{"url": "Atril_Neff", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bespin Wing Guards", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Atril Neff"}, {"tag": "p", "text": "Lieutenant Atril Neff was a Human female immigration officer in the planet Bespin's Wing Guard during the Galactic Civil War. During her service, Neff's job was to know everyone who entered and left Bespin's Cloud City. In 3 ABY, Neff was present on Cloud City during Bespin's Imperial occupation, when her curiosity was piqued by the Dark Lord of the Sith Darth Vader's presence. For that reason, she tried to catch a glimpse of the Sith Lord whenever possible."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human female Atril Neff served as an immigration officer with the rank of lieutenant in the planet Bespin's Wing Guard during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. She had a brother named Allen, who hailed from the planet Ertegas and moved to Bespin at age six, eventually following his sister into service in the Wing Guard. Neff's job in the Wing Guard was to know everyone who entered and left Bespin's Cloud City. She was present on Cloud City when Imperial forces led by the Sith Lord Darth Vader occupied Bespin in 3 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Good at her assigned job, Neff knew who entered and left Cloud City. Her curiosity was piqued by Darth Vader's presence on Bespin during the Imperial occupation. Due to her curiosity, she tried to catch a glimpse of the Dark Lord of the Sith whenever possible. Neff had light skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During Lieutenant Neff's service in the Bespin Wing Guard, she wore the standard uniform and was armed with a Relby-k23 blaster pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first source mentioning Lieutenant Neff was a card for the Premiere set of Decipher's 2001 Jedi Knights Trading Card Game. In 2014, Neff was briefly mentioned, and given the first name \"Atril,\" in the Rogues Gallery department of Star Wars Insider 148."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}