{"url": "Omera", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Farmers", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Omera"}, {"tag": "p", "text": "Omera was a human female who lived as a farmer on the planet Sorgan during the time of the New Republic. She was a widow with one child, a daughter named Winta."}, {"tag": "p", "text": "Omera was a skilled marksman. She assisted Din Djarin and Carasynthia Dune in repelling a group of Klatooinian raiders who repeatedly attacked her village on Sorgan."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At some point, Omera had a daughter, Winta, but was later widowed. She resided with her tribe at a village on the planet Sorgan, taking care of her daughter and farming krill. The village became the site of frequent attacks by Klatooinian raiders, forcing Omera and the villagers to remain hidden to avoid being caught by them. Fellow villagers Caben and Stoke convinced the bounty hunter known as Din Djarin help defend their village, who also brought former rebel shock trooper Carasynthia Dune alongside him. When they arrived at the village, Omera provided lodging to Din Djarin. When Djarin was alerted to Winta's presence, Omera comforted the girl, explaining that he was here to protect the village. She later arrived with a tray of food and asked why he never removed his helmet publicly, learning of his past and the way of life he followed."}, {"tag": "p", "text": "When Dune and Din Djarin investigated the Klatooinian raiders and discovered the tracks of an AT-ST, they announced to the villagers that they would have to migrate elsewhere. Omera stated that the farmers had nowhere else to go. After the two agreed to train the tribe, Omera and a number of villagers were trained in using blasters by Din Djarin. Omera displayed her prowess in using a Relby-v10 micro grenade launcher, catching the attention of the bounty hunter. Following their training, Djarin told Omera to prepare for the attack as him and Dune departed to provoke the Klatooinian raiders. When the two returned, Omera and the tribe repelled the attack."}, {"tag": "p", "text": "A few weeks after the battle, Dune and Din Djarin settled in the village. Omera provided a cup of spotchka to Dune while commenting to Djarin that Grogu was happy to be living at the village. He later informed her that he would be leaving Grogu behind in order to keep him safe. Omera asked Din Djarin to stay and attempted to remove his helmet but was stopped by him, stating that only Grogu belonged here. Their conversation was interrupted by a gunshot, which turned out to be Dune killing a bounty hunter that attempted to eliminate Grogu. Knowing that his life was still in danger, Djarin decided to leave the planet with him. Omera thanked him as he parted ways with Dune and the tribe."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Omera was portrayed by Julia Jones in Chapter 4 of Jon Favreau's 2019 Disney+ television series The Mandalorian, which aired on November 29, 2019. Stunt work for the character was performed by Lauren Mary Kim, who also acted as the double for The Armorer in the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}