{"url": "Omega_Squad:_Targets", "categories": ["Category:Real-world articles", "Category:Legends short stories from Star Wars Insider", "Category:Short stories republished with novels"], "nodes": [{"tag": "h1", "text": "Omega Squad: Targets"}, {"tag": "p", "text": "Omega Squad: Targets is a short story written by Karen Traviss and illustrated by Robert Hendrickson for Star Wars Insider 81. The story was also included in the Del Rey printing of Republic Commando: Triple Zero though not in the UK and Australia, where Triple Zero was published under the Orbit imprint. It takes place in 22 BBY."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A group of terrorists has taken a senator hostage on Coruscant, and it's up to a crack team of clone commandos to defuse the dangerous situation."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On Coruscant, Omega Squad is sent to a spaceport where a group of terrorists from Haruun Kal is keeping hostages. The terrorists demand that the Republic leave their planet so they can stay out of the war, or they will kill the hostages with explosives. Null ARC trooper N-11 Ordo, Kal Skirata, and a Jedi arrive, and the Jedi enters the room with the terrorists to negotiate. The squad, watching video from a camera the Jedi smuggled in, mentally catalogue the terrorists based on the colors of their clothing: green, gray, tan and dark brown. The terrorists kill the Jedi and throw out his body with a bomb attached to it. Fi jumps on top of the bomb before it can detonate, shielding the police with his armor. Luckily the armor protects him too and he is regarded as a hero for saving the men and gains Ordo's respect."}, {"tag": "p", "text": "The squad then begins the attack. Ordo covers the roof as Darman sets explosives to destroy the door that protects the terrorists. Fi then throws some flash bangs in to stun the terrorists and upon entering shoots the green one in the chest. Atin takes out the gray one out and Darman and Niner take out the dark brown one. But the terrorists had switched the clothes of a hostage with the tan one and only by shielding the hostage does Skirata keep Fi from shooting. Then Ordo sees the one in the hostage's clothing with a gun and kills him. Later they learn that the hostage who had been framed was an important executive for the Corporate Sector Authority, an organization with a lot of money and armaments, and that the terrorists were trying to get the hostage shot so that the Corporate Sector would side with the Confederacy of Independent Systems. All the hostages are rescued, including the executive and a Senator who was the bait to attack the terrorists."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In this story, the Corporate Sector is abbreviated \"CorSec\", which typically refers to the Corellian Security Force. \"CorpSec\" is the usual shortened form of Corporate Sector."}, {"tag": "h2", "text": "External links"}]}