{"url": "Omega_Squad", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Galactic Republic commando squads"], "nodes": [{"tag": "h1", "text": "Omega Squad"}, {"tag": "p", "text": "Omega Squad was an elite clone commando unit, and was part of the Grand Army of the Republic during the Clone Wars. The members of this unit were brought together after each of their respective squads were killed during action at Geonosis. Unlike most other commando squads, the Omegas wore specialized Night Ops Armor. It was part of Arca Company of Zero Five Commando."}, {"tag": "p", "text": "After the formation of the Galactic Empire, the Omega Squad was disbanded, reassigning the remaining members to Squad 40."}, {"tag": "h2", "text": "Missions"}, {"tag": "h3", "text": "Mission to Qiilura"}, {"tag": "p", "text": "Omega Squad's first mission together was on the planet Qiilura approximately three standard months after The Battle of Geonosis. Jedi Master Kast Fulier and his apprentice Etain Tur-Mukan were on the planet, gathering information, but Master Fulier was captured and promptly killed, and Etain hid and waited to be liberated from this seemingly dangerous planet. Omega Squad was sent to Qiilura to sabotage research on a clone-killing nano-virus. Ghez Hokan later personally killed Master Fulier with his own lightsaber, which he would later use to kill Cailshh and Guta-Nay."}, {"tag": "p", "text": "During the planet-fall, Darman was separated from the rest of the squad, and killed some of Hokan's thugs who were attacking a village. With help from the Gurlanin Jinart Etain eventually met up with Darman, but accidentally confused him with Ghez Hokan by the notorious Mandalorian T- on his helmet. Luckily for Darman, he was exceptionally well trained in close hand-to-hand combat and was able to disarm Etain and explain. The rest of Omega Squad had to evade natives, and soon enough met up with Jinart. Jinart proved to be a huge help with the mission, by gathering information and acting as a go-between for Darman and the rest of Omega Squad."}, {"tag": "p", "text": "Later, so all of Omega Squad could talk via comlink, Niner took out the planet's communications facility in Teklet, preparing the squad for their final assault. Using tunnels made by gdans, the squad finally assaulted the research facility, and captured the nano-virus along with Dr. Ovolot Qail Uthan. En route to the LAAT/i at the extraction point with Dr. Uthan, Etain, Darman, and Atin had some trouble with Captain Hurati, one of Ghez Hokan's men. Hurati seriously wounded Atin with a Verpine shatter gun, smashing through Atin's armor plate about 20 centimeters below the armpit. Darman killed Hurati and patched up Atin enough to get to the extraction point, but Dr. Uthan was hit with shrapnel from Atin's armor just below the ribs. They made the rest of the way without incident. Unfortunately, Niner and Fi also had trouble, but this time with the former Mandalorian protecting Uthan, Ghez Hokan. In a bold move, Niner lay on the ground, screaming for his training sergeant, Kal Skirata. Hokan attempted to kill the seemingly maimed commando, but Etain arrived just in time to decapitate Hokan with her lightsaber. Fi kept Hokan's Mandalorian helmet and armor as a prize. Etain later asked Darman to stay and help her on Quiilura, but he refused saying that he couldn't leave his new brothers behind."}, {"tag": "h3", "text": "Galactic City spaceport hostage siege"}, {"tag": "p", "text": "A month after the Qiilura operation, Omega Squad were stationed at Arca Company Barracks on Coruscant, where they were called upon to defuse a terrorist siege at a local spaceport. With help from Kal Skirata and the Null ARC trooper Captain Ordo, they were able to end the situation. Fi jumped on a bomb to save the rest of the squad and Coruscant Security Forces men, earning him CSF's respect."}, {"tag": "h3", "text": "Mission to Fest"}, {"tag": "p", "text": "Ten and a half months into the war, Omega were dispatched to Fest, to destroy a Separatist research center that was researching phrik alloy. Fest was a frozen wasteland, covered in white snow. Ironically, they were issued new matte black Night Ops Armor just in time for this job, which of course became the source of many jokes from their pilot. However, with the kind of protection the new armor gave, they didn't need to hide."}, {"tag": "h3", "text": "TIOPS"}, {"tag": "p", "text": "Shortly after the Fest operation, Omega Squad were involved in a TIOPS mission at the Corellian–Perlemian hyperspace intersection. Although they were successful in capturing several suspected Separatist terrorists, they became stranded aboard a damaged vessel and had to be rescued by Delta Squad. They were then picked up by the assault ship Fearless, and met up with Etain again. It was during this mission that the TIV pilot, Sicko, that had transported Omega to their objective, was killed by a passing civilian vessel, Nova Crystal, who saw what the pilot described as \"a pirate ship descending on its prey\"."}, {"tag": "h3", "text": "Mission to Coruscant"}, {"tag": "p", "text": "Following the events of TIOPS, a terrorist attack on a freighter brought the attention of the Coruscant Security Force, as well as Kal Skirata to the situation. While revisiting the incident on a holo-recorder, Captain Ordo, speculated that the terrorists held operatives within Coruscant. Not wanting the risk the lives of thousands of civilians, Kal requested that Delta and Omega Squads return to Arca company barracks for leave to secretly investigate the recent terrorist act. Jedi Master Arligan Zey turned a blind eye to Skirata and granted his request."}, {"tag": "p", "text": "With the aid of Captain Ordo, Jedi Knights Bardan Jusik and Etain Tur-Mukan, and a former clone instructor Walon Vau, Kal, along with Delta and Omega, began uncovering what was believed to be a Separatist plot. They began by paying a visit to Qibbu, Coruscant's resident Hutt to cash in on a favor owed to Skirata. Kal persuaded Qibbu to lend his quarters to serve as a base of operations for the mission, in order to remain inconspicuous. Ordo was then sent out to grab a large number of military grade explosives to attract Separatist attention. Sure enough, a very \"interested customer\" by the name of Perrive contacted Skirata to discuss further business involving the explosives."}, {"tag": "p", "text": "Before Kal and his new-found associates meet to discuss terms with one another, Omega and Delta squads along with the two accompanying Jedi positioned themselves along the agreed location and stakeout the transaction. Fi and Scorch marked Perrive and his six consorts with microscopic transmitters designed to look like common dust, courtesy of Jusik. When the suspects dispersed from the scene, the team attempted to track their movements and common locations."}, {"tag": "p", "text": "In between time during the mission, Darman and Etain Tur-Mukan's relationship blossomed into something deeper, which makes Etain question her path to follow the Jedi Order. Within her reasoning, she attempted to give Darman something no other clone in the GAR would have; a future."}, {"tag": "p", "text": "During reconnaissance, Fi and Sev came across Vinna Jiss, a GAR logistics employee, and sent her to Walon Vau for interrogation. After squeezing information out of Jiss, Vau hurled her off a balcony to her death in the sublevels of Coruscant. Ordo, armed with new information about \"Dead-Letter\" drops, headed to GAR headquarters disguised as the receptionist clone trooper Corr. Monitoring each movement, Ordo began to suspect Besany Wennen, an attractive female employee with an alluring smile. Much to his surprise, however, Wennen met with Vinna Jiss, whom Ordo had presumed dead."}, {"tag": "p", "text": "In an attempt to uncover the truth, Ordo returned to GAR HQ in the evening with Etain, to find Vinna Jiss, with Wennen falling behind her. Ordo and Etain trailed and subdued them both, only to later find out that Wennen was an agent of the Republic Treasury Audit Division, and the specter of Vinna Jiss was actually Jinart."}, {"tag": "p", "text": "As the investigation unfolded and more pieces were added to the puzzle, Kal and his boys began setting up a sting operation, with unexpected help from another Null ARC, Mereel. The explosives were traded off to the suspects for a sum of four-million credits, and the criminals in question were then neutralized."}, {"tag": "h3", "text": "Mission to Olanet"}, {"tag": "p", "text": "Four hundred and sixty days after Geonosis, Null ARC Trooper Prudii trained Atin on Olanet in his sabotage technique. Together they entered the droid factory on Olanet, which was regarded as a high value target by military intelligence, and sliced the main computer. Prudii then modified the alloy mixture just enough to render droids produced at the factory worthless on the battlefield, but not enough to alert quality controllers that there was anything wrong. Atin then returned to his squad at Coruscant HQ and introduced Omega Squad to the new technique, while Prudii continued his work with his fellow Null ARC brothers in the search for Kaminoan cloner Ko Sai."}, {"tag": "h3", "text": "Mission to Gaftikar"}, {"tag": "p", "text": "Four hundred and seventy days after the First Battle of Geonosis, Omega Squad was sent to Gaftikar to aid a group of local rebels attempting to overthrow the Separatist government. While there, Darman and Atin infiltrated one of Gaftikar's cities disguised as civilians. During their time in the city, they found ARC Alpha-30, Sull, who had been missing for nearly two weeks. Atin and Darman managed to return him to their base, and Darman returned to Sull's apartment to search for his armor and anything to point towards his involvement with the GAR. While there, he encountered two clone assassins who thought he was Sull. He managed to kill them both, but was shocked that clones would kill their brothers. During the battle for the city, Fi suffered a head injury due to an artillery round hitting the HoloNet station they were sabotaging and became virtually brain-dead."}, {"tag": "p", "text": "Fi was to be terminated as his injury was deemed incurable by med droids onboard the Leveler but due to the actions of Omega Squad and Kal Skirata, he was transported to Republic Central MedCenter for further diagnostics. However, he was recognized solely as government property, not as a man. Besany Wennen went to visit him, and ended up holding him hostage, in order to prevent his termination. CSF Captain Jaller O'Brim defused the situation and took Besany and Fi back to his home,to begin recovering. Kal Skirata helped to rehabilitate him and bring him back to Mandalore to be nursed back to health by Bardan Jusik and Mandalorian Parja. He was replaced in the squad by Corr."}, {"tag": "h3", "text": "Mission to Haurgab"}, {"tag": "p", "text": "Maujese rebels were attacking GAR supply convoys on Haurgab and Omega squad was sent to assassinate their leader, Jolluc. They observed the rebels as they raided a few convoys to gather information. When they finally made their move, Corr successfully shot him in the head followed by another shot from Atin when the body twitched. They found themselves however assaulted by more rebels than Intelligence stated. They made a stand on a hill and after a furious firefight, were rescued by a LAAT/i sent by Captain Maze."}, {"tag": "h3", "text": "Return to Coruscant"}, {"tag": "p", "text": "As Omega returned from Haurgab they were caught up in the Battle of Coruscant. They managed to navigate through the intense space battle and through an opening in the planet's shields. Unfortunately a droid starfighter followed them through and caused their ship to crash somewhere in Galactic City. Here they joined the Republic forces in the area, including Yayax Squad, to repel the Separatist invasion. When Order 66 was activated, Omega did not comply as Darman had a relationship with Jedi Knight Etain Tur-Mukan. Instead, disillusioned with the GAR's treatment of clone troopers, Omega decided to desert with Kal Skirata and the Null-ARCs. However, the carefully laid plans to evacuate Coruscant were jeopardized when Tur-Mukan was killed at the Shinarcan Bridge Extension, a skirmish in which Niner was also injured. Atin and Corr extracted to Mandalore with Skirata, while Darman remained with the injured Niner. Unable to rejoin their brothers due to the establishment of the Galactic Empire, Darman and Niner were forced to remain commandos. They were combined with survivors of Galaar Squad, becoming Squad 40 of the 501st Legion where they were tasked to capture Jedi and Jedi helpers."}, {"tag": "h2", "text": "Members"}, {"tag": "p", "text": "Sgt. Kal Skirata (their field trainer Cuy'val Dar) also known as Kal'buir which means Papa Kal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}