{"url": "Onderon/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Confederacy of Independent Systems planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Infinite Empire planets", "Category:Japrael system planets", "Category:Jungle planets", "Category:Mandalorian planets", "Category:New Republic planets", "Category:Onderon locations", "Category:Sith planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Onderon"}, {"tag": "p", "text": "One of eight planets in the Japrael system, Onderon had a temperate climate, and was once home to a primitive race of Humanoids."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Onderon had four moons. Dxun, the primary moon, once orbited very close to the planet, allowing some animals to fly between the planet and the moon. The other three moons were Dagri, Evas and Suthre."}, {"tag": "p", "text": "The native Humans of Onderon struggled against the beasts, eventually gathering new technologies and building a huge walled city, Iziz, to protect themselves. Like the people of many other fringe worlds, the Onderonians had a distrust of non-Humans."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "A colony ship brought the first humans to Onderon sometime between 5200 and 4600 BBY. Owing to the brutal fauna of the world, the earliest encampments were hastily expanded into what would become the only city on the planet, Iziz. The early Onderonians were described as having been peaceful before the arrival of the beasts of Dxun, but they soon learned to hunt and kill the animals. Eventually, most of the planet's inhabitants took refuge in Iziz and the city expanded as the center of Onderon's civilization. Technology progressed, and the city's population grew to number in the millions. It also spanned thousands of square miles. Great walls and defenses kept the savage wilderness at bay."}, {"tag": "h3", "text": "The Beast Wars and the Naddist Uprising"}, {"tag": "p", "text": "In 4400 BBY, Freedon Nadd conquered the planet and established a dark side theocracy. These cultists were known as Naddists. Naddist tyrants included Warb Null and King Ommin. The Naddists sent Iziz's criminal element (opponents of the Naddists) out into the wilderness without any protection from the animals, expecting them to perish. However, these outcasts soon learned to survive and even defend themselves, and eventually formed a second civilization, the Beast Riders. Relations between the two groups were hostile, and they remained at war with each other for many years. The Beast Wars lasted until 4000 BBY, with the final battles serving as the opening salvos of the Great Sith War."}, {"tag": "p", "text": "In 4002 BBY, Onderon first made contact with the Galactic Republic. The Republic asked the Jedi to watch over the world. Jedi Master Arca Jeth was selected as Watchman, and assigned his Padawans Ulic Qel-Droma, Cay Qel-Droma, and Tott Doneeta to the planet in a test-capacity. The Beast Wars finally ended with the death of Naddist Queen Amanoa. Amanoa's daughter Galia married Oron Kira, the leader of the outcasts, known as the \"Beastprince.\""}, {"tag": "p", "text": "In 3998 BBY, two years after the First Battle of Onderon, the Freedon Nadd Uprising occurred. The Naddists tried to overthrow Galia, but were foiled by the Jedi and the Republic. Ommin and Sith disciple Warb Null were slain, but so was Jedi Kith Kark."}, {"tag": "p", "text": "In more ancient times, the sociopolitical situation between the Onderonian beast-riders and the people of Iziz was far different from the present day. Formerly untamed and coarse, many of the wilderness Beast Lords prospered during the several decades since the end of the Great Sith War, thanks to off-world trade going back two generations (marked in the game by Oron Kira's marriage to the Iziz royal house, thus uniting the bloodlines)."}, {"tag": "h3", "text": "The Mandalorian Wars and the Jedi Civil War"}, {"tag": "p", "text": "The Mandalorians attempted to invade Onderon during the Krath Holy Crusade in 3996 BBY, but they failed, and settled on the planet's moon, Dxun. During the Great Hunt, the Jedi cleansed the world of terentateks."}, {"tag": "p", "text": "Onderon was the site of two battles during the Mandalorian Wars. Onderon, very interestingly, went almost entirely unaffected by the Jedi Civil War. It was almost as if Revan did not want to attack it. Further, it long remained the only world in the Republic still capable of seeding ecosystems into other dead worlds—Onderon's wildlife being some of the most aggressive in the known galaxy, particularly its winged drexl creatures flown by the Beast Lords there. Merely placing such creatures on target worlds guaranteed their habitation for years to come."}, {"tag": "p", "text": "The Mandalorian Wars and the Jedi Civil War threatened the peace of Onderon, so a new Onderonian hero emerged, bringing the victories against the Mandalorians and the Sith – General Vaklu, the leader of the Onderon army."}, {"tag": "p", "text": "The population began to sympathize with Vaklu and his ideology, and it caused an important admiration and support for the general. The military sector was also close to Vaklu's ideas. One of the high ranking officers, Colonel Tobin, was the general's right hand and a great ally."}, {"tag": "h3", "text": "The Onderon Civil War"}, {"tag": "p", "text": "During the years following the Great Sith War and the Jedi Civil War, a good number of the beast-riders became \"socialized,\" influenced by the ways of the city… yet others simply fell to common thuggery, living within the walls, yet unwilling to abide by the laws of civilization."}, {"tag": "p", "text": "When Vaklu had enough power, he expressed his disagreement with the alliance that Queen Talia—who was his cousin—made with the Galactic Republic. He defended that these ties would drag Onderon to war, and also put forward the sale of their natural resources to the worlds devastated for the war. Talia believed in equality, and a peaceful resolution to the problem – whereas, Vaklu preferred using the military to resolve matters."}, {"tag": "p", "text": "Then, the separatists peacefully blockaded his own planet to avoid any contact with the Republic. However, they attacked the freighter Ebon Hawk, which was trapped in the blockade, testifying that the \"capital-class Republic vessel\" had attacked Onderon first. He labeled the Queen as ineffective against the Republic declaration of war, so the society and the military sector started a rebellion."}, {"tag": "p", "text": "General Vaklu allied himself with Darth Nihilus and his Sith forces. The deal laid to in giving military assistance to the Onderon separatists to overthrow Queen Talia, while Vaklu let the Sith visit Freedon Nadd's tomb on Dxun."}, {"tag": "p", "text": "Eventually, Vaklu's dark side ally gave the order for him to start a revolution, aiming to seize power from Queen Talia, and thus began the Onderon Civil War. When the war was drawing to a close, it looked like Vaklu might overthrow the Queen. However, Meetra Surik arrived, and the tide began to turn back in favor of Queen Talia and her supporters. Surik commanded royalist supporters and overran the many Sith and Vaklu-loyal units holding Iziz and the palace. Surik, demonstrating her great command of the Force, broke through the rear of the Sith ranks by defeating Sith forces on the Sky Ramp to the palace. Upon reaching the palace, the royalist supporters and Vaklu-loyal forces engaged each other within the throne room."}, {"tag": "p", "text": "Surik swayed the battle in favor of Talia's forces and Vaklu was defeated, surrounded by Talia and many of her followers. Vaklu was executed, and Talia began the rebuilding of Onderon."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "In later centuries, overhunting and an outbreak of mange led to a decline in wildlife, finally reducing the dangers of Onderon. Flat plains were developed around the city of Iziz, and were considered quite safe, though offworlders were warned not to venture beyond the treeline. In addition, the Unifras religion erected a string of shrines, which attracted off-world pilgrims."}, {"tag": "p", "text": "During the time of the revolt against the Eternal Empire, Onderon's newly elected government abandoned the previous administration's efforts to build a self-sufficient biodome beneath the planet's surface."}, {"tag": "p", "text": "Around 3627 BBY, Onderon would be under a political crisis with King Regalun Petryph retreating from Iziz to his secluded Royal Hunting Lodge to avoid the opposition of his noble council. The Sith Empire used this to convince King Petryph to launch an attack on the capital, hoping to use Petryph's attack as a distraction to destroy the Republic fleet in orbit."}, {"tag": "p", "text": "In 1000 BBY, Darth Bane rode to Onderon from Dxun upon a drexl to rendezvous with Darth Zannah after the Seventh Battle of Ruusan."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, Onderon joined the Confederacy of Independent Systems. It was represented in the Separatist Parliament by Senator Mina Bonteri, and later her son, Lux Bonteri."}, {"tag": "p", "text": "At the onset of the war, King Ramsis Dendup was overthrown by one of Count Dooku's supporters, Sanjay Rash, due to the Treaty of Iziz. To that end, a rebellion was formed to restore Dendup's rule and to rid Onderon of the Separatist Droid Army. Jedi Anakin Skywalker, Obi-Wan Kenobi, Ahsoka Tano, and Captain Rex answered a call for help from Onderonian rebels Saw Gerrera and Lux Bonteri, who joined the rebellion to defeat the CIS. The Jedi trained the rebels at their base camp set up in the jungles of Onderon, which was soon located by the Droid Army via probe droids. However, the rebels managed to survive and defeated the droids. They continued their acts of defiance to Sanjay's rule throughout the city of Iziz."}, {"tag": "p", "text": "King Dendup was eventually rescued, and the rebels retreated to the highlands to prevent so many casualties in Iziz. With the new droid gunships, the rebels were forced to pull back, but they defeated the entire droid army and the gunships with rocket launchers, courtesy of Weequay pirate Hondo Ohnaka and his band. With their losses, the droids retreated by order of Dooku to Agamar, who also ordered the super tactical droid general Kalani to kill Sanjay Rash. Though victorious, the rebels lost their leader, Steela Gerrera, during the conflict. After the battle, Dendup's reign as king was restored, and he chose Lux to represent Onderon in the Galactic Senate."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Galactic Civil War, Onderon was the site of the most important Imperial military ordnance center in the sector, near Iziz. The Rebel Alliance destroyed it in 2 ABY. This battle was one of the first direct military confrontations between Rebel and Imperial forces in the war. The destruction of the ordnance center crippled Imperial abilities to resupply its forces in the region."}, {"tag": "p", "text": "During the reborn Emperor Palpatine's insurrection, Han Solo and Leia Organa Solo hid their three young children on Onderon. The planet was also where the Emperor met his final death, at the cost of the lives of Rayf Ysanna and Empatojayos Brand. While his flagship engaged New Republic forces in orbit, the Emperor disguised himself and his bodyguards as pilgrims and tracked down the Solos to Kira Fortress, outside of Iziz. Here, Palpatine was killed by Han Solo and attempted to possess Anakin Solo, but in the skirmish, a dying Brand caught his spirit and dragged the Emperor down to the Netherworld of the Force with himself."}, {"tag": "h2", "text": "Onderon Military"}, {"tag": "p", "text": "During the Old Republic era, the Onderonian military consisted of both the Onderonian navy and Ground Forces (see Onderon Soldier). The palace of Iziz was guarded by Paladins."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If General Vaklu prevails with the backing of Meetra Surik in the Onderon Civil War, Kreia specifies that \"Vaklu will have a short reign, but Onderon's independence will persist.\" She also states that by leaving the Republic forever, Onderon will preserve its traditions, customs, lore and identity- just as Vaklu and many of his supporters had hoped to do."}, {"tag": "p", "text": "The galaxy map from Star Wars Insider #65 incorrectly contains two Onderons. One is located in the correct spot in the Inner Rim, while the other was mistakenly placed in the Colonies. Leland Chee has confirmed that the Inner Rim location is correct."}, {"tag": "p", "text": "This location places Onderon near Ambria, and Star Wars Gamer 1 even claims that Onderon, like Ambria, is in the Stenness Node. This placement seems to defy the original Tales of the Jedi comics, which stated Onderon was on \"the other side of the galaxy\" from the Stenness Node."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}