{"url": "Onara_Kuat", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Business owners and executives", "Category:Females", "Category:Humans", "Category:Kuati"], "nodes": [{"tag": "h1", "text": "Onara Kuat"}, {"tag": "p", "text": "Onara Kuat was head of the Kuat family and principal director of Kuat Drive Yards during the Clone Wars. In a position to select the Kuat sector's representative in the Galactic Senate, Onara ensured that both her family and her shipyards would benefit from her selections. Senator Risi Lenoan acquitted herself well in that regard, but when questions arose concerning her bookkeeping in conjunction with Kuat Drive Yards, she was forced to leave her office. In selecting Lenoan's successor, Onara attempted to choose someone who would be politically malleable. Her choice, Giddean Danu, proved to be anything but, as he opposed the centralization of power and championed the Jedi Knights."}, {"tag": "p", "text": "Realizing her mistake, Onara unsuccessfully tried to have Danu recalled. Her nephew, Kuat of Kuat, along with several others, thought that Danu was a strong advocate of Kuati independence, and so the man stayed. Furthermore, he began investigating the Kuat family as part of his planned reform of Kuati politics. Concerned that her closely guarded secrets would be revealed, Onara began pursuing other methods of removing Danu. At a performance of Squid Lake at the Galaxies Opera House in 19 BBY, shortly before the conclusion of the Clone Wars, she met with Tannon Praji's bodyguard, Ottegru Grey. Grey assured her that all her problems would be solved if she was to stay loyal to Supreme Chancellor Palpatine. Onara was eventually succeeded by her nephew's father."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Lenoan to Danu"}, {"tag": "p", "text": "In the waning years of the Galactic Republic, Onara Kuat was the principal director of Kuat Drive Yards, a shipyard that had been supplying the government with warships for thousands of years. Onara herself was a distant descendant of a family that had been one of the original Core Founders. By the time of Onara's ascension to the role of principal director of Kuat Drive Yards and head of the Kuat family, her office had the power to select the Kuat sector's representative in the Galactic Senate. Onara always made sure that her choices would benefit the shipyards and her family as well. In 31 BBY, Onara received a secret order for KDY worth billions of credits, to produce starships, vehicles and equipment for a clone army that was being developed in secret on the planet Kamino."}, {"tag": "p", "text": "Senator Risi Lenoan served Kuat well in her tenure, but was removed from office when questions arose concerning her bookkeeping in connection with Kuat Drive Yards funds. For Lenoan's successor, Onara chose a man she thought would be easily manipulated: Giddean Danu. The choice proved unwise for the principal director, as Danu was a vocal supporter of the Jedi Knights, and spoke out against the centralization of power. When the Clone Wars broke out in 22 BBY, Danu advocated the role of Jedi as overseers of the conflict."}, {"tag": "h3", "text": "Trouble"}, {"tag": "p", "text": "Displeased, Onara attempted to have him removed, but other members of her family, including her nephew, Kuat of Kuat, believed Danu to be an effective representative and advocate of Kuati independence. Onara's motion failed as a result, and making matters worse for her, Danu intended to launch a reformation of Kuati politics. To start with, he intended to investigate the Kuat family. This deeply concerned Onara, and she feared that certain secrets pertaining to her would be brought to light."}, {"tag": "p", "text": "Hoping to take control of the situation, Onara began pursuing other ways of having Danu removed. Shortly after the Battle of Coruscant, she attended a performance of Squid Lake at the Galaxies Opera House—a performance also attended by Supreme Chancellor Palpatine. Seated in Galaxies owner Romeo Treblanc's private box along with several other dignitaries and Treblanc himself, she discussed her situation with Tannon Praji, First Minister of the Coruscant Ministry of Ingress. Praji, sympathetic, introduced her to his bodyguard, Ottegru Grey. Grey, who was actually an agent of Chancellor Palpatine's, assured Onara that the problem with Danu would be resolved. Although he did not elaborate, he told the principal director that loyalty to Palpatine was all that was required of her. In time, Onara was succeeded by the father of her nephew, who was in turn followed by the younger Kuat of Kuat himself."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "During her tenure, Onara was seen as a prime example of the cutthroat and labyrinth nature of Kuati politics, as well as the consolidation of aristocrat, politician, and business executive. Onara tried to make sure that her choices for the role of the Kuat sector's senator always benefited her family and her work, although her choices of Lenoan and Danu both proved to be problematic. Onara did not tolerate Danu's views on political influence and the Jedi Order, leading her to the knee-jerk reaction of trying to have him removed. When that did not work, she found herself worrying about his investigation of her family, which could have dug up secrets about her operations."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Onara Kuat first appeared as an unnamed extra in the \"Galaxies Opera House\" sequence of George Lucas' Star Wars: Episode III Revenge of the Sith. She was played by visual effects executive producer Denise Ream, and is seen in one of the boxes at the Opera House. Accompanying Ream, cameos were also made by visual effects supervisor John Knoll as Tannon Praji, animation director Rob Coleman as Romeo Treblanc, visual effects supervisor Roger Guyett as Ottegru Grey, and visual effects producer Jill Brooks as Gem Sirrom."}, {"tag": "p", "text": "In 2006, the character of Kuat was named and fleshed out by Aidan Hennessy, through the StarWars.com Hyperspace feature, \"What's The Story?\" Noting that the character wore elaborate headgear similar to characters from Kuat, such as Giddean Danu, Risi Lenoan, and Kuat of Kuat, he decided to connect Ream's character with the planet. Since he felt the time period had been underused in the Expanded Universe, Hennessy loosely tied Kuat's entry to the New Sith Wars that had originated in Terry Brooks' Star Wars: Episode I The Phantom Menace novelization."}, {"tag": "p", "text": "In addition, he utilized the characters of Risi Lenoan from the HoloNet News website, and Giddean Danu from Revenge of the Sith, meshing them with the story of Kuat. Some minor details that he had written about the characters were cut, concerning Danu's origins and fate, as well as Lenoan's embezzlement of funds. Kuat of Kuat originated in K. W. Jeter's Bounty Hunter Wars trilogy, who had been used sparingly in the Expanded Universe outside his original appearances in those books. As a further tie, he wrote Ottegru Grey, who had also been fleshed out through \"What's the Story?\" into his entry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}