{"url": "Onaconda_Farr/Legends", "categories": ["Category:Legends articles", "Category:Accuracy disputes", "Category:Articles with conflicting sources", "Category:Articles with elements from unlicensed sources", "Category:Galactic Republic senators", "Category:Males", "Category:Rodians", "Category:Separatist leadership"], "nodes": [{"tag": "h1", "text": "Onaconda Farr"}, {"tag": "p", "text": "Onaconda Farr was a male Rodian from the planet Rodia and served as the Senator of his homeworld in the Galactic Senate during the later years of the Galactic Republic. During the Separatist Crisis the senate began to debate the Military Creation Act, which would create an army for the Republic for the first time in a millennium. During the debate, Senator Farr became a strong Militarist and supporter of the Act. He was known as a watchdog against Separatist influences in the senate and was highly critical of Supreme Chancellor Palpatine's Loyalist Committee, going so far as to claim it was a shadow government. After exposing Senator Havriso Looruya's Separatist ties, Farr was granted a position on the Loyalist Committee, an appointment that confused many members of the Senate. Despite the appointment, he continued to be critical of the Chancellor's handling of the Separatist Crisis, claiming that Palpatine was following his own agenda to the detriment of the Republic."}, {"tag": "p", "text": "In 22 BBY, the Separatist Crisis exploded into the Clone Wars, a galaxy-wide conflict between the Republic and the Confederacy of Independent Systems. Emergency Powers granted to Palpatine resulted in the creation of the Grand Army of the Republic without the Military Creation Act ever coming to a vote. Farr was installed as the head of the Senate Action Subcommittee for Corellian Trade Spine Defense, a position he used for personal advancement. Around the beginning of the war, supplies en route to Farr's homeworld of Rodia became the repeated targets of pirates. After Rodia's pleas for assistance were consistently ignored by the Republic, Farr abandoned the Senate and joined the Confederacy of Independent Systems. In exchange for much-needed supplies, Separatist Council member Nute Gunray demanded that Farr aid him in capturing the Rodian's longtime friend, Senator Padmé Amidala of Naboo. Amidala came to Rodia in order to aid in the supply crisis, but was instead imprisoned by Farr and Gunray's battle-droid forces. After learning Gunray's plan to execute Amidala, Farr realized the error in his decision to join the Confederacy and turned on the Separatist leader. Farr then assisted Amidala and Representative Jar Jar Binks in arresting Gunray and turning him over to Republic forces."}, {"tag": "p", "text": "Following the incident with Gunray, Farr rejoined the Senate. Shortly after, he and several other senators were taken hostage in the Republic Executive Building by a group of bounty hunters led by Cad Bane. Bane used his hostages as leverage when negotiating the release of the Hutt crime lord Ziro Desilijic Tiure, a Confederate ally who had been captured by the Republic earlier in the war. Bane accomplished his mission and escaped the Republic Executive Building before detonating a series of explosives intended to kill the hostage senators. Farr and the rest of the senators survived the assassination attempt through the efforts of Jedi Knight Anakin Skywalker. In the wake of the attack, Farr returned to Rodia to find that the wildlife around a swamp on the planet was being killed. With the aid of Jedi Master Kit Fisto, he learned that the cause was a Confederate station under the command of Robonino, one of the bounty hunters who had aided Cad Bane on Coruscant. Later in the war, Farr vehemently opposed a proposal to increase clone trooper spending and increase the war effort. However, he was murdered through a poison put in his drink by his aide Lolo Purs, who wanted to punish him for bringing war to Rodia."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Loyalist senator"}, {"tag": "p", "text": "Onaconda Farr was a Rodian male from the planet of Rodia, and by 52 BBY, he represented Rodia in the Galactic Senate of the Republic. He held residences in both the Senatorial Palace on Rodia and the Rodian Consulate on Coruscant, the galactic capital and headquarters of the Senate. Senator Farr was a close family friend of Padmé Amidala, who affectionately referred to him as \"Uncle Ono\" from the time when Farr was the biggest ally of Amidala's father, Ruwee Naberrie, in the Senate. He also had a brother and a sister."}, {"tag": "p", "text": "In 33 BBY, when the Yinchorri began a campaign to attack and conquer settlements near the planet of Yinchorr, Farr was a large supporter of Supreme Chancellor Finis Valorum and his actions. Valorum sent a team of Jedi to Yinchorr to negotiate peace, but were only met with continued hostility, and a military garrison was later placed on the planet."}, {"tag": "p", "text": "In 32 BBY, Farr, along with Senators Tikkes of Dac and Mot-Not Rab of Tarnab, attended an unofficial audience organized by Senator Orn Free Taa of Ryloth. At that point, Supreme Chancellor Finis Valorum had just finished a crisis and was suddenly accused of corruption. Taa admitted to have delayed the accusation because the situation at that point would allow the Senate to oust and replace Valorum, which was Taa's goal. Neither Farr or Rab openly supported Taa's scheme at that point."}, {"tag": "p", "text": "In 24 BBY, a variety of planets and corporations began to withdraw from the Senate in protest of the growing power of the government, beginning the Separatist Crisis. Farr was very critical of then–Supreme Chancellor Palpatine's handling of the crisis, often accusing him of following his own agenda to the detriment of the Republic. Because of the crisis, the Senate began to discuss the Military Creation Act, which would create an army for the Republic. During the discussion, Farr remained a Militarist, a proponent of the Act. The Rodian senator objected to Palpatine's attempts to negotiate directly with the leader of the Separatist Movement, Count Dooku, believing that the talks would accomplish nothing and blunt the Military Creation Act. Farr also expressed criticism when Palpatine created the Loyalist Committee, a ten-senator advisory body to the Supreme Chancellor that would also negotiate with the Separatists, saying that the body was made up of Palpatine's political allies and was another attempt to weaken the Military Creation Act. Later, when Palpatine and the Loyalist Committee formed the covert investigative agency known as the Senate Bureau of Intelligence, Farr once again criticized Palpatine, saying that the Chancellor was using the Committee and the bureau to increase his power."}, {"tag": "p", "text": "In 22 BBY, to help promote his Militarist ideals, Senator Farr wrote and bankrolled the politically charged play The Trickery of Vosdia Nooma, produced by the Rodian government's Drama Council. Filled with allegory and symbolism, the play endorsed Farr's pro-military positions and a pro-Military Creation Act stance in particular. Farr himself had a cameo in the play, though drama editor Korvit Domesa of HoloNet News, who reviewed the play, believed this was a mistake that could hurt his platform. Domesa, however, still thought that the production would inspire discussion on both sides of the debate."}, {"tag": "p", "text": "Later that year, in a Senate session prior to the vote for the Act, Farr released a \"list of 245\" individuals within the Judicial and Legislative branches of the Galactic Republic he accused of Separatist ties, including Loyalist Committee member Havriso Looruya. Farr had received the information from a source he kept private from the judicial investigators, and the source was never identified by the officials. Though the Senate protested these accusations, the Judicial Department confirmed that the charge against Looruya was indeed legitimate, leading to Looruya's resignation from Senatorial office. Farr was elected to the Loyalist Committee in light of his recent success but was unable to celebrate, suffering a devastating personal loss when a house fire on Rodia killed both his brother and sister shortly before Farr was announced to the Loyalist Committee."}, {"tag": "p", "text": "Soon after, Jedi Knight Obi-Wan Kenobi discovered a clone army—commissioned by the long-dead Jedi Master Sifo-Dyas—being built for the Republic on the world of Kamino. Kenobi also found evidence that the Separatists were building their own army on the planet of Geonosis. With the Senate still deadlocked over the Military Creation Act, emergency powers were given to Chancellor Palpatine, allowing him to activate the clone army to defend the Republic. Despite Farr's mistrust of Palpatine, he and the rest of the Loyalist Committee supported the emergency powers. The clone army launched an attack on the Separatist's Droid Army at Geonosis, starting the Clone Wars."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "Abandoned by the Republic"}, {"tag": "p", "text": "After the Clone Wars had begun, Farr was made chairman of the Senate Action Subcommittee for Corellian Trade Spine Defense. However, Rodia was left undefended, and its supply lanes were soon attacked by pirates, leaving the population deprived of food and other necessary materials. In response, Senator Farr returned to Rodia along with the Senate's Rodian delegation. At first, Ryloth Senator Orn Free Taa criticized Farr, saying that the delegations move back to Rodia was just a \"political move.\" It was later confirmed, though, that Rodia was actually experiencing pirate attacks. However, a Senatorial vote for a relief effort for Rodia was postponed, and Farr tried to contact his longtime family friend, Padmé Amidala, but was unable to speak with her, as she was preoccupied with other business."}, {"tag": "p", "text": "As Rodia's people continued to starve, Farr turned to the Separatists, reluctantly making a deal with Trade Federation Viceroy Nute Gunray. Gunray, who harbored a strong grudge against Amidala since his defeat at the Battle of Naboo, promised that Rodia would become a member of the Confederacy of Independent Systems and would be given relief supplies in exchange for the capture of Senator Amidala. Farr was willing to give up Amidala to the Separatist, thinking that he could protect her after her capture. As soon as Amidala learned of the pirate attacks on Rodia, she traveled to Rodia to ensure the planet's loyalty to the Republic. She was accompanied by her protocol droid C-3PO and Associate Planetary Representative Jar Jar Binks."}, {"tag": "h4", "text": "Nute Gunray's machinations"}, {"tag": "p", "text": "Once Amidala landed at the Rodian Senatorial Palace, she went to speak with Farr, while C-3PO and Binks remained with Amidala's H-type Nubian yacht in the hangar. Silood, one of Farr's aides, took Amidala to Farr. When Senator Farr confronted Amidala, he revealed his alliance with Gunray, remorsefully saying that he had already done what was necessary the survival of his people. A squad of battle droids appeared and surrounded Amidala as Farr opened a hololink with Gunray, allowing Amidala and the viceroy to talk. Amidala attempted to contact C-3PO and Binks via comlink, but a B1-Series battle droid seized the device and destroyed it. As Amidala was escorted away, she warned Farr that he could not trust Gunray and that he had made a mistake by aligning with the Separatists. The Naboo senator was imprisoned and shackled inside a cell at the top of a detention tower until Gunray arrived."}, {"tag": "p", "text": "When Gunray arrived at Rodia, Farr and Silood led the viceroy and several of his battle droid guards to the detention tower where Amidala was being held. However, one of Gunray's battle droids spotted a humanoid dressed in Jedi robes along with a protocol droid following the group. The droid, assuming the humanoid was a Jedi, alerted Farr and Gunray about the pair. The viceroy ordered his droids to destroy the supposed \"Jedi\" as Farr and Silood stood back and watched. As the battle droids attacked, the \"Jedi\" escaped through a grate that led to the swamp underneath the compound, losing his robes in the process. The protocol droid, which turned out to be C-3PO, was captured, and Gunray ordered several of his droids to search for the Jedi as he continued on to the detention tower with Farr and Silood."}, {"tag": "p", "text": "As Farr and Gunray were walking on the bridge that led to the detention tower, Gunray revealed to Farr that he planned on executing Amidala, and that he would only give the much needed supplies over to Rodia once the Naboo Senator was dead. When Farr objected to this, Gunray told him that Rodia was now under his protection and that Farr follows his orders. Realizing that he had made a mistake in aligning with the Separatists, Farr whispered to Silood to keep his eye out for the \"Jedi,\" believing that he was Rodia's last hope."}, {"tag": "p", "text": "When the group arrived at the detention tower, a pair of B1 battle droids told them that Amidala had escaped from her cell. The \"Jedi,\" having found his robes, appeared on a platform on the side of the detention tower, and Gunray once again ordered his droids to kill the \"Jedi.\" As Farr looked on, the \"Jedi\" evaded the droids' laser shots, and made it to the bottom of the detention tower. Amidala emerged and started to engage the battle droids with a blaster rifle she had stolen, while the \"Jedi\" once again dropped his robes and retreated through a grate into the swamp. A B2-HA series super battle droid dropped several thermal detonators into the swamp, trying to kill the \"Jedi,\" but the \"Jedi\" was able to escape the resulting explosion."}, {"tag": "p", "text": "As Farr and Gunray were making their way to the bottom of the detention tower, Amidala was captured by the viceroy's battle droids while the B2-HA series super battle droid fired a homing torpedo at the \"Jedi.\" When Farr and Gunray arrived, the homing torpedo exploded, making Amidala assume that the \"Jedi\" was killed. C-3PO appeared under battle-droid escort, and—despite Farr's protest—Gunray ordered his droids to execute Amidala and her protocol droid."}, {"tag": "p", "text": "As a group of droidekas were about to kill Amidala and C-3PO, the \"Jedi\" climbed out of the swamp behind the group, having survived the explosion and found his robes. Farr diverted Gunray's attention to the \"Jedi,\" and the viceroy again ordered his droids to kill the \"Jedi.\" However, as the droidekas began to fire at the \"Jedi,\" a large Kwazel Maw—which the \"Jedi\" had befriended while in the swamp—smashed through the ground and attacked the Confederate battle droids, destroying most of them. Gunray and his remaining battle droids fled back to the palace's hangar, trying to escape Rodia."}, {"tag": "p", "text": "In the hangar, Amidala, having retrieved a blaster, destroyed the viceroy's droid bodyguards, while the Kwazel aw pushed Gunray's shuttle out of the hangar and into the swamp below. As Amidala cornered Gunray, Senator Farr appeared behind the pair, holding an E-5 blaster rifle he had found. Gunray ordered the Rodian to kill Amidala and the \"Jedi,\" but Amidala lied to Gunray, saying that this entire scenario had just been a trap for the viceroy. Realizing that this was a chance to correct his previous mistakes, Farr agreed with the Naboo senator, saying that he was with the Republic, not the Confederacy."}, {"tag": "p", "text": "Amidala was arresting Gunray when a Republic Venator-class Star Destroyer appeared in orbit over Rodia, and several LAAT/i gunships landed in the hangar and Clone Commander CC-1004 and Green Company apprehend the viceroy. C-3PO had managed earlier to contact a nearby clone trooper deployment and tell them about Amidala's capture. Supreme Chancellor Palpatine contacted Farr, Amidala, and the \"Jedi\" via hologram to congratulate them on capturing Gunray, and to tell Senator Farr that he has dispatched several supply convoys to Rodia to help in the relief effort."}, {"tag": "p", "text": "Farr attempted to thank the \"Jedi\" for all his help, but he discovered that the he was actually Representative Binks in disguise. After Binks had escaped from the battle droids, he found the Jedi robes in Amidala's yacht, and had put them on to disguise himself so he could rescue Amidala. Farr thanked both Amidala and Binks for their help and assured them that Rodia would remain allied to the Republic."}, {"tag": "p", "text": "After Gunray's capture, Captain Faro Argyus of the Senate Commandos, Jedi Master Luminara Unduli, Commander CC-1004, and Jedi Padawan Ahsoka Tano attempted to escort the viceroy to Coruscant, where he would stand trial. However, Gunray escaped with the aid of Dark Acolyte Asajj Ventress and a turncoat Argyus."}, {"tag": "h4", "text": "Cad Bane's raid"}, {"tag": "p", "text": "Later that year, Senators Farr, Padmé Amidala, Bail Organa, and several other senators met in the East Wing of Republic Executive Building on Coruscant to discuss preventing the Enhanced Privacy Invasion Bill—a piece of legislation going through the Senate—from being passed. However, bounty hunter Cad Bane and a team of recruited hunters, intent on taking hostages to free the imprisoned Hutt crime lord Ziro Desilijic Tiure from prison, broke into the building and took the senators prisoner. When the Gran Senator Philo objected to being taken hostage and attempted to walk away, he was killed by Bane, and the bounty hunters began to collect the senators' communication devices. Meanwhile, one of Bane's team members, Robonino, who had broken in the building's power control room, shut down the power and put the entire building on lockdown."}, {"tag": "p", "text": "At the same time, Jedi Knight Anakin Skywalker, who was in the building at the time, attempted to engage the bounty hunters himself, trying to free the senators. However, Skywalker had given his lightsaber to Amidala, his secret wife, and was unarmed. After a brief chase throughout the Executive building, Skywalker was knocked out by Robonino before being handcuffed and taken to Bane. After Bane had negotiated Ziro's release with Supreme Chancellor Palpatine, the bounty hunters placed a system of lasers around the senators and the unconscious Skywalker, which would activate explosives on the slightest touch, intending to use the trapped senators as further leverage against Palpatine."}, {"tag": "p", "text": "After the bounty hunters had left the building, Skywalker regained consciousness, and Amidala handed back his lightsaber. Farr told the Jedi Knight that he believed that it would be safer to remain where they were, but Skywalker anticipated that Bane would not hesitate to detonate the explosives, despite the bounty hunter's supposed assurance of the opposite. As payback for the indignities Ziro had gone through while in prison, Bane indeed activated the explosives, but Skywalker cut a hole in the floor around the senators with his lightsaber. This allowed the senators and Skywalker to drop into the room below just as the explosives went off, saving Farr and the rest of the hostages."}, {"tag": "h4", "text": "\"Environmental\" problems on Rodia"}, {"tag": "p", "text": "Also that year, mysterious environmental problems began to occur in the swamps on Rodia, with all the wildlife in the waters around an abandoned station dying from an unknown reason. Along with this, Rodian scouts spotted Confederate battle droids near the station. In response to this news, Senator Farr contacted Nautolan Jedi Master Kit Fisto to investigate the station for whatever was infecting the water in the swamp. After Fisto landed on Rodia, Farr briefed the Jedi Master about the situation in a LAAT/i gunship while on the way to the station."}, {"tag": "p", "text": "When the group arrived at the abandoned station, Fisto and several of his clone SCUBA troopers dived into the water while Farr waited back on the gunship. Fisto and his troops investigated a group of ruins underneath the station, where they discovered several modified Confederate battle droids and a device controlling the droids. Fisto also found the droids' leader, the bounty hunter Robonino, who had gone into hiding after the Senate hostage crisis. Fisto destroyed the droid-controlling device, while Fisto's troopers fought off Robonino's modified droids and secured the station itself. However, the bounty hunter escaped in the confusion."}, {"tag": "p", "text": "After the battle, Master Fisto met with Farr in the station, telling the Rodian senator that the abandoned station was never a Confederate outpost, but instead Robonino's hideout, and that environmental problems were unintentionally caused by the deadly signals given off by the bounty hunter's modified battle droids. Farr was at first surprised that the resulting destruction was accidental, but the Jedi said that in nature, the unintended is often so. As the two were finishing up their conversation, a Kwazel Maw emerged from the swamp water and spat out Robonino, giving him over to Republic custody."}, {"tag": "h4", "text": "Later activities"}, {"tag": "p", "text": "Farr later returned to Coruscant and was present in Senate's dining commons, eating alongside fellow Senator Kin Robb, during Senator Amidala's attempts to discern Scipio Senator Rush Clovis's allegiances. Later in the war, Farr was part of a senatorial delegation on Mandalore during the events of the Death Watch scare. When Mandalorian Duchess Satine Kryze resolved to travel to Coruscant to plead the case of Mandalore's neutrality to the Senate, Farr accompanied her aboard her transport, the luxury yacht Coronet. Alongside fellow Senators Orn Free Taa, Kin Robb, and Tal Merrik, Farr enjoyed the lavish environment of the Coronet while under the protection of Jedi Obi-Wan Kenobi and Anakin Skywalker. The luxury vessel came under attack from assassin probes during a Death Watch attempt on Kryze's life; however all senators aboard survived. Following the attack, Kenobi interrogated the senators under the suspicion that one of them was a spy for the Death Watch. Senator Merrik was revealed to be the turncoat, and during his escape attempt, a probe killer droid landed on Farr's clothing. Kenobi destroyed the droid before Farr was harmed, and Skywalker later succeeded in killing Merrik. The trip ended with no harm being done to Farr, Robb, Taa, or Kryze."}, {"tag": "h4", "text": "Disgrace after Duro"}, {"tag": "p", "text": "In 20 BBY, the Confederate General Grievous led an assault on the planet Duro, and after a week of heavy fighting, captured the planet in a decisive victory. Later, during an investigation by Agent Inglemenn Barezz of the Senate Bureau of Intelligence, it was discovered that the Iseno senator, Ronet Coorr, had redirected three Venator-class Star Destroyers to Rodia, where they were to be employed as \"shakedown cruisers.\" Barezz also discovered that Senator Farr had bribed Coorr to redirect the Star Destroyers, which forced both senators to resign their spots on the Loyalist Committee and in the Senate. After his resignation, Farr returned to Rodia, ending his political career."}, {"tag": "h4", "text": "Opposition and assassination"}, {"tag": "p", "text": "After Senator Padmé Amidala's meeting with Separatist Senator Mina Bonteri and the news of the Separatist Parliament's bill for peace, Farr put forward the notion to vote the bank deregulation bill down. Farr campaigned with fellow Senators Padmé Amidala and Bail Organa to reduce and eventually stop the production of clone troopers. However, Senator Halle Burtoni proposed a bill to fund and produce 5,000,000 clone troopers. Farr and his colleagues strongly opposed the bill, so Organa prepared to speak before the full senate. Once he did, the trio believed many of the senators still undecided would agree to oppose the bill. Farr and Amidala visited the Quarren Senator Christo in his apartment in order to convince him to join the opposition. Before the speech, however, Farr, Amidala, and Organa were each individually attacked by bounty hunters Robonino and Chata Hyoki. All three surviving the attacks, Onaconda was injured but all right. Amidala sustained no serious injuries also. Organa was not so fortunate. He could not give his speech, so Amidala spoke in his place, and the bill was defeated. After Padmé's speech, Farr said to himself, \"well done, Padmé.\""}, {"tag": "p", "text": "As a result of this opposition, he was assaulted by Separatist-hired thugs who did not want him to vote against the bill. Farr's mind was not changed, however, and he and Amidala attempted to convince the Senate. After the Senate then voted for the bill, Farr and the other senators opposing the bill celebrated. However, Farr was murdered by his legal aide, Lolo Purs, in an act of revenge for plunging Rodia into war. Purs poisoned Farr's drink, and to the shock of everyone else in the room, Farr fainted and died almost immediately. Before Senator Farr's body was returned to Rodia, a funeral was given on Coruscant attended by many of his friends, as well as other senators, Jedi Council members and the Supreme Chancellor. Silood, in his eulogy, mentioned that Onaconda Farr was a flawed man, but he never compromised his principles and always acted with his people's needs in mind. Following the funeral, an investigation by the Coruscant Security Force ensued, and Purs's culpability was discovered by Amidala, who turned her over to the police."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Farr was a strong supporter of the Galactic Republic and Supreme Chancellor Finis Valorum, though he was a loud critic of Supreme Chancellor Palpatine. Farr believed that during the Separatist Crisis, Palpatine was just following his own political agenda to strengthen his own power. Senator Farr was a strong proponent of the Military Creation Act, believing that a strong Army of the Republic was needed to counter the growing Separatist threat."}, {"tag": "p", "text": "Senator Farr was also an extreme patriot to Rodia, going to great lengths to protect and supply his homeworld, willing to even give up his honor to do so. Although he had no love for the Separatists, Farr joined the Confederacy, and even handed over his longtime friend, Senator Amidala, in order to obtain food and supplies to his people. Although, when he discovered that Amidala was to be executed, he did realize that he had made a mistake in aligning with the Separatists. He was also willing to bribe another senator to provide security for Rodia. In addition, Farr was frightened by bounty hunter Cad Bane and Bane's fellow bounty hunters, as he was willing to comply with the Hunter's orders and did not doubt the reality of Bane's threats."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Onaconda Farr was first introduced as the senator of Rodia in Star Wars: Episode II Attack of the Clones, released May 16, 2002. In the movie, Farr was played by Zuraya Hamilton, who was also the department coordinator for Attack of the Clones. There are also several unnamed Rodian senators that appear in Star Wars: Episode I The Phantom Menace. He also appeared in several articles in the in-universe HoloNet News website, and had a cameo appearance in the film Star Wars: The Clone Wars."}, {"tag": "p", "text": "Farr later played a larger role in the first season of the Star Wars: The Clone Wars television series, making appearances in the episodes \"Bombad Jedi\" and \"Hostage Crisis,\" where he was voiced by Dee Bradley Baker. In the second season, Farr appeared in the episodes \"Senate Spy,\" \"The Mandalore Plot,\" \"Voyage of Temptation\" and \"Senate Murders.\" In the third season, he had a cameo appearance in \"Sphere of Influence\" and also appeared in \"Heroes on Both Sides\" and \"Pursuit of Peace.\" The last two episodes, along with \"Senate Murders,\" form a three-episode arc."}, {"tag": "p", "text": "In Attack of the Clones, the wardrobe worn by Senator Farr is the same as the one worn by Dar Wac, Chancellor Palpatine's Rodian aide. This carries on the habit of Rodians dressing alike, first seen in Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}