{"url": "Ommo_Twilto", "categories": ["Category:Canon articles", "Category:Wookieepedia Comprehensive articles", "Category:Individuals of unidentified species", "Category:Individuals of unspecified gender", "Category:Mercenaries"], "nodes": [{"tag": "h1", "text": "Ommo Twilto"}, {"tag": "p", "text": "Ommo Twilto was an alien who worked with Dered Karno as a mercenary. The pair at one point served as enforcers for the Sith assassin Ochi of Bestoon, a member of the Sith Eternal. Around 21 ABY, Twilto and Karno stood in the passenger compartment of Ochi's starship, Bestoon Legacy, with electroprod staffs braced as Ochi questioned the parents of Rey, whom he had been sent to find by the Sith Lord Darth Sidious. Karno watched as Rey's mother claimed that Rey was no longer on the planet Jakku and that Ochi would not find her, after which the assassin stabbed both parents to death with his dagger."}, {"tag": "p", "text": "Twilto had brown skin and black eyes and braided black hair. The alien wore brown armor made up of plastoid tiles wrapped in leather padding and a gray helmet over a red shirt with a brown belt, pants, gloves, and boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ommo Twilto was created for the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo. The book includes Twilto in a section on the planet Pasaana, although the character is not present in any scenes on the planet in the film. Twilto's name is a partial anagram of the name of actor Tom Wilton, who portrayed Twilto in the film and referred to the character as Tovine on set. Derek Arnold, who portrayed Dered Karno, stated that everything about Twilto and Karno and their depiction in The Visual Dictionary made completing the sequel trilogy worthwhile."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}