{"url": "One-Eye_(Ortolan)", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Males", "Category:Ortolans"], "nodes": [{"tag": "h1", "text": "One-Eye  (Ortolan)"}, {"tag": "p", "text": "One-Eye was the nickname of an Ortolan male who attempted to claim the lost treasure of the Sith Lord Count Dooku on the planet Ponemah Terminal some time after the Battle of Endor. He traveled in his heavily modified sandcrawler to try and reach the treasure in the Sea of Sands, where it was located onboard the crashed cruiser known as the Obrexta III. En route, One-Eye and his sandcrawler were both swallowed whole by a sand worm, preventing the Ortolan from ever reaching his goal."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "An Ortolan male became known as One-Eye following the loss of one of his eyes in an explosion that also claimed his hearing. At some point after the Battle of Endor, One-Eye was on the desert planet Ponemah Terminal when he learned that a crashed Separatist cruiser named the Obrexta III was located in the Sea of Sands region of the planet, and potentially contained the legendary lost treasure of the Sith Lord Count Dooku. The ship had lay dormant and without power since its crash during the Clone Wars, but had recently began broadcasting a distress signal after an ion storm had recharged some of its systems."}, {"tag": "p", "text": "One-Eye set out in his heavily modified sandcrawler, which was fully air conditioned and strong enough to withstand the highly hazardous conditions of the Sea of Sand. Upon reaching the Sea of Sands, the Ortolan saw on his viewscreen a battle raging between three other groups hoping to claim the treasure: the two crews of the pirates Sidon Ithano and Scorza and the Gray Gundarks speeder bike gang. Assuming that an incoming sandstorm would quickly rid him of the competition, One-Eye continued on toward the Obrexta III, but was prevented from reaching his prize when a gigantic sand worm swallowed both he and his sandcrawler whole. Unaware that One-Eye had ever even been present, the crew of Ithano was eventually able to claim the prize, which turned out to be the cryogenically frozen clone trooper CT-6116."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Following the explosion that claimed his eye, One-Eye was also slightly deaf. By the time he tried to claim Dooku's treasure, he was an angry and half-mad individual, and played Ortolan music that only such an individual could enjoy through the comm system and loudspeakers of his sandcrawler while traveling. He was confident in his vehicle's ability to withstand anything that the Sea of Sands could throw at it, and despite its slow speed believed he was going to be successful in beating his competitors once he saw them fighting in the desert."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "One-Eye first appeared in the short story \"The Crimson Corsair and the Lost Treasure of Count Dooku,\" which was written by Landry Q. Walker and released as an eBook in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}