{"url": "Atrivis_7", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Atrivis sector planets"], "nodes": [{"tag": "h1", "text": "Atrivis 7"}, {"tag": "p", "text": "Atrivis 7 was a planet in the Atrivis sector of the Outer Rim Territories. Populated by Humans, it experienced some domestic conflicts known as range wars. Atrivis 7 was the homeworld of Sheeka Tull, who eventually became a resistance fighter with the guerrilla group Desert Wind located on Ord Cestus during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Atrivis 7 was the seventh planet of the Atrivis system, located in the Outer Rim sector of the same name. Its atmosphere was breathable by Humans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Atrivis 7 was inhabited by Human settlers who, during the final years of the Galactic Republic, engaged in a range war. During the conflict, Sheevis Tull and his wife were killed, leaving their daughters, Sheeka Tull and her sister, orphans. Both sisters later left the planet; Sheeka moved to Ord Cestus while her sister joined a religious group on Devon Four. On Ord Cestus, Sheeka fought with the Desert Wind guerrilla movement that opposed the practices of Cestus Cybernetics. She met, and conceived a child with, Jangotat, an Alpha-class Advanced Recon Commando in the Galactic Republic Grand Army."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Atrivis 7 was first mentioned in The Cestus Deception by Steven Barnes (2004) as the homeworld of one of his characters; however, little supporting information was provided. Given the shared name, this article understands it to be a world within the Atrivis system, mentioned in the West End Games The Rebel Alliance Sourcebook (1990)."}, {"tag": "p", "text": "In The Cestus Deception, Barnes mentions a \"range war\" occurring on Atrivis 7, but does not elaborate on the meaning of this term. Out-of-universe, Range Wars are \"a type of (typically undeclared) conflict that occurs in agrarian or stockrearing societies,\" commonly in the American West. The conflicts on Atrivis 7 are likely intended to parallel these struggles."}, {"tag": "p", "text": "Another West End Games product, Gundark's Fantastic Technology: Personal Gear (1997), mentions a battle in which Rebel pilot Homack gets shot down \"over Atrivis.\" While this may correspond to Atrivis 7, it has not been identified as such, and, as there may be as many as five other planets named \"Atrivis [n]\" in the system (One planet is already named Generis), this information has been kept at \"Atrivis.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}