{"url": "Onderon_rebels", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Stub", "Category:Culture of Onderon", "Category:Galactic Republic organizations", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Onderon rebels"}, {"tag": "p", "text": "The Onderon rebels, also referred to as the Onderon resistance, was a militia of resistance fighters who stood opposed to the reign of King Sanjay Rash and the Confederacy of Independent Systems during the Clone Wars. The rebels, with the unofficial backing of the Jedi Order, waged a successful campaign to reclaim Onderon from the Separatists and restore the deposed former King, Ramsis Dendup, to the throne of Onderon. Though unsuccessful in their initial campaigns, the support of the Jedi provided them additional training and resources, including the active participation of Padawan Ahsoka Tano and the assistance of the pirate Hondo Ohnaka. Another resource utilized by the rebels were freighters, which they used to transport soldiers to battle. At the end of the rebellion, Onderon rejoined the Galactic Republic, with rebel fighter Lux Bonteri as the planet's Senator."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Clone Wars began, Onderon's king, Ramsis Dendup attempted to keep Onderon neutral by refusing to join the Republic and the Confederacy. However, he was then removed from the throne, imprisoned and then replaced with pro-Confederate Sanjay Rash. Rash allowed the Confederacy to send in the Separatist Droid Army to occupy the planet and its capital city of Iziz."}, {"tag": "p", "text": "However, members of the population, such as Steela Gerrera and her brother Saw, refused to recognize Rash's rule. The Gerrera's thus organized a resistance movement that fought the battle droids in and near Iziz. With their militia, the Gerreras fought the battle droids. By 20 BBY, the resistance fighters planed to end the Separatists' occupation. To that end, Saw and former Separatist senator, Lux Bonteri contacted the Jedi Council for help. At first, the Council was wary about providing aid the the rebels. However, the Council approved of Masters Obi-Wan Kenobi, Anakin Skywalker, and his apprentice Ahsoka Tano to train the Rebels in fighting the droids."}, {"tag": "p", "text": "The Jedi then arrived at the rebels' camp, where they trained the insurgents in fighting the battle droids and their tanks. Training ended abruptly when the base was discovered by a droid patrol and the rebels got their first taste of true combat, utterly wiping out the droid forces with minimal losses. Emboldened by this success, the rebels opted to move part of their forces into the capital city of Iziz, to take the fight to the home front."}, {"tag": "p", "text": "Once inside the city, the rebels proceeded to endlessly harry the droid forces stationed in the capital by ambushing lone patrols and checkpoints; despite their usage of droid popper grenades and specifically targeting the droids, the rebels were nonetheless held in fear by the people owing to the unpredictable and often public nature of their attacks. The rebels also made a statement against King Rash by attacking the Royal carriage as it left the royal residence. Rash, perceiving the rebels as terrorists, attempted to end the insurgency by forcing his predecessor to call off the attacks; Dendup, having nothing to do with them, refused. Frustrated with the lack of support from the people, the rebels' Jedi allies determined that they had to show them that they were on their side. In order to do so and rob the droids of an advantage, the rebels decided to target the city's power generator; without power, the droid army would literally grind to a halt. Ambushing a patrol, the rebels got its commander to request reinforcements in the form of a tank, which they proceeded to hijack and use to destroy the power generator. As Iziz descended into darkness and the droids were left in disarray, the rebels returned to their city hideout to celebrate. In light of her actions in uniting the rebels, Steela Gerrera was elected as their official leader, to the initial dismay of her brother."}, {"tag": "p", "text": "The rebels continued their attacks in the city, dealing much damage. However, the destruction of the power generator had prompted King Rash to petition Count Dooku for reinforcements, which came in the form of the super tactical droid general Kalani. Kalani's tactics were more effective, but their brutal nature did not sit well with his human counterpart, Akenathen Tandin, who commanded the Royal Onderon Militia. Rash and Kalani, hoping to draw out and finish the rebels, made a public address announcing that the former king Dendup would be executed in Yolahn Square for crimes of treason. Though Saw was captured trying to free the king from prison, the rebels nonetheless resolved to save the king before he could die. At the execution, the rebels attacked just before Dendup was beheaded via an electroguillotine and managed to free the king, but were caught in a trap which resulted in the death of one rebel, Dono. However, the rebels encountered an unexpected ally in the form of General Tandin, whose previous conversation with Saw had convinced him to side with the rebels against the false rulership of the Confederacy. Storming the plaza with the royal guards in tow, Tandin held Rash on the point of a laser lance and declared his intentions to support the true king. With the Separatist forces held at bay by Tandin's capture of Rash, the rebels were able to escape. Tandin himself was spared from certain death by Ahsoka, whose retreat was covered by the assembled citizens; finding solidarity with the rebels, the citizens had come to see the Confederacy as invaders."}, {"tag": "p", "text": "Having retreated to their base in the highlands, the rebels swore fealty to King Dendup once more, though the king delegated the military command to Tandin and Steela. Helped by the rebels in the city, Dendup broadcast a speech in which he saluted the efforts of the rebels and decried Rash's rule. These words inspired the citizens to rise up and attack the droids, sparking massive riots across Iziz. Knowing that they could not hold Onderon without the people's willing or unwilling support, the Confederacy dispatched a massive force of infantry and armor to destroy the rebels in the highlands, bolstered by new HMP droid gunships. Though the rebel forces managed to initially devastate the droids sent against them, the sudden appearance of the gunships turned the tide in favor of the droids. The gunships began decimating the rebels, who were unable to penetrate the powerful ray shields protecting them. In desperation and sustaining heavy casualties, the rebels contacted the Jedi Council for assistance. However, though the Republic could not intervene itself, Anakin came up with the idea of using a third party to aid the rebels. Through the pirate Hondo Ohnaka, Anakin secured a shipment of brand new Sienar RPS-6 rocket launchers capable of punching through the ray shields."}, {"tag": "p", "text": "This delivery once more shifted the battle in favor of the rebels, who quickly downed most of the gunships. However, Steela got word that the main base was under attack by droids seeking King Dendup and rushed there just in time to save him from a commando droid assassin whilst Saw finished off the last gunship with his rocket launcher. Unfortunately, the gunship spun out of control and crashed into the cliff where Steela and Dendup were standing, causing it to destabilize. Steela threw Dendup to safety but nearly fell to her death, saved only by grabbing onto the cliff edge. Lux's efforts to save her nearly caused him to fall as well, but Ahsoka lifted him to safety with the Force before attempting to do the same with Steela. Unseen by them all, however, the crashed gunship was still functional and it loosed a shot at Ahsoka which caused her to lose her concentration and drop Steela to her death dozens of feet below. Though Lux destroyed the gunship before it could fire on them again, the damage had been done. Though the rebels had won a mighty victory, celebration was cast aside as they mourned their fallen leader."}, {"tag": "p", "text": "After the Confederacy withdrew from Onderon, with Kalani killing the now-useless King Rash as they did so, the surviving rebels gathered at the Unifar Temple alongside thousands of Onderonian citizens for Steela's funeral. In the wake of her death, Onderon was once more free and joined the Republic under the newly-christened Senator Lux Bonteri, who had come to see the Republic and the Jedi as the more honorable side in the conflict."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Contrary to the victory of its members, the peace and freedom which many rebels had fought and died for was lost only a year later, when the Republic fell to be replaced by the Galactic Empire. Under the New Order, Onderon was once more subjugated. This prompted an aging Saw Gerrera to reform the Onderon rebels, now going by the name of the Partisans, to fight once more against a totalitarian regime. The rebels once more won several victories and inducted a Lasat mercenary into their ranks, who helped them destroy an Imperial patrol led by Alexsandr Kallus. By 0 BBY, however, the Partisans had shifted their theater of operations to the ancient moon of Jedha."}, {"tag": "p", "text": "Around a year into the Imperial Era, Tano also remembered her time in the Onderon rebels, informing her companions Neera and Miara Larte that she fought in the Clone Wars. She tried to avoid discussing being a part of the Republic, hoping that they would believe she had been a member of a planetary militia, which she recognized was technically true. She also suspected that cantina owner Selda and farmer Vartan thought she had been a militia member, although her past as a Jedi would come to light shortly afterward."}, {"tag": "p", "text": "Days before the Battle of Yavin, Saw Garrera and the majority of the Partisans were killed by a single-reactor superlaser blast from the First Death Star in the destruction of Jedha City. However, several members of the Partisans, including Saw's second-in-command, Benthic Two Tubes, escaped, making them the last legacy of the reorganized Onderon Rebels."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Onderon rebels were created for a four-episode arc in the fifth season of the animated television series Star Wars: The Clone Wars. The intention of the Onderon rebels was to show one of the seeds of what would become the Alliance to Restore the Republic. According to Dave Filoni, the supervising director of The Clone Wars, stated that he and George Lucas intended the Onderon rebels to be the first of many militias that were created by the Jedi during the Clone Wars, militias that would be brought together by characters such as Bail Organa and Mon Mothma to become the Rebel Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}