{"url": "Onimi", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Force-sensitives", "Category:Males", "Category:Shamed Ones", "Category:Supreme Overlords", "Category:Yuuzhan Vong shapers"], "nodes": [{"tag": "h1", "text": "Onimi"}, {"tag": "p", "text": "Onimi was a male Yuuzhan Vong. A Shamed Shaper, he was the only Force-sensitive of his species apart from another mysterious figure. Onimi was revealed to be the true power behind the Yuuzhan Vong at the Battle of Yuuzhan'tar."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Onimi was a Shaper and a member of the Elite. At some point he realized that the eighth cortex, supposedly holding the knowledge necessary to survive the decades of war that the Yuuzhan Vong had doomed themselves to, was empty. After adding yammosk tissue to his brain (which was most likely the action that restored his connection to the Force, given the yammosk's natural telepathy), Onimi was marked as a Shamed One, taking the form of a mentally and physically twisted, demented creature. He blamed the gods, especially Yun-Harla the Trickster goddess, for his afflictions."}, {"tag": "p", "text": "While Onimi seemed weak, with his torso twisted, short limbs, small hands, and his wretched face being his worst feature, his repulsive physical features and lowly social status caused him to be underestimated; he was seen by the Royal Court as an annoyance, a Shamed One who Supreme Overlord Shimrra should not dirty his presence with. But for reasons unknown to them, Shimrra tolerated his pet."}, {"tag": "p", "text": "This was because despite his diminutive and pitiful appearance, Onimi now possessed a connection to the Force that had been lost to the Yuuzhan Vong for many thousands of years. This gave him the power to manipulate the minds of others. His experiments also gave him other powers; not only was he able to amplify the energy flowing through his mismatched form, but he could create deadly toxins and chemicals through his metabolism and release them through almost every bodily fluid he produced, such as his sweat or saliva. He could even secrete toxins out of his nails."}, {"tag": "p", "text": "Seeing an opportunity for redemption in the Intendant Supreme Overlord Shimrra, Onimi had influenced him into taking him as a familiar, becoming a jester for the new leader. Using this proximity to the Supreme Overlord to his advantage, Onimi manipulated Shimrra and the other Yuuzhan Vong to mastermind the invasion of the galaxy that the species chose as their new home. Onimi wished to be the salvation of his race."}, {"tag": "h3", "text": "The Court of the Supreme Overlord"}, {"tag": "p", "text": "Onimi did not limit himself to appearances as the court jester. Indeed, under the name Kae Kwaad, he worked side by side with the heretical Nen Yim to create the eighth cortex and new technologies for the Yuuzhan Vong. The invasion of the chosen galaxy was not going as planned; through Shimrra, Onimi tasked Nen Yim with filling the eighth cortex. Other than this, he busied himself about the court of Shimrra, cackling in obscene rhymes and daring to do that which no other would during meetings with the Elite. However, Onimi had no mind for war; he could not be blamed for the mistakes of Warmaster Tsavong Lah, for the rise of the heretical movements, or for the tenacity of the \"infidels\" whose galaxy he had sought to take. The invasion was failing; two years after the Battle of Coruscant, which saw the Vong take the New Republic's aforementioned planetary capital, the enemy, now reorganized into the Galactic Alliance, had come to reclaim what was once theirs."}, {"tag": "h3", "text": "Revelation"}, {"tag": "p", "text": "When Luke Skywalker and the Solo twins penetrated Shimrra's chambers during the Battle of Yuuzhan'tar, Onimi controlled the biologically enhanced Slayer warriors as they attempted to fight off the Jedi. He eventually retreated from the battle, leaving the Slayers and his puppet Supreme Overlord to be slain by Skywalker and the twins. Jaina Solo pursued Onimi into the command chamber of Shimrra's Citadel, but was quickly disabled and incapacitated by the deformed creature. When she woke up, tied between statues of Yuuzhan Vong deities, Onimi revealed the true nature of the invasion, his manipulation behind it, and his belief that Jaina was truly the Yuuzhan Vong goddess Yun-Harla, for whom he blamed for his disfigurement. Of course, this belief was undoubtedly extracted from the fact that Jaina had used the reputation of Yun-Harla as psychological warfare against the Vong in the latter half of the war. And more importantly, Onimi was genetically linked to the Citadel, able to control every movement of the worldship. As Shimrra died, the top section of the Citadel took flight and launched itself into space, with its controller plotting to kill every living being in the galaxy when the Alpha Red pathogen reaches the living world of Zonama Sekot, killing it because of the genetic similarities between it and the Yuuzhan Vong (Zonama was the seed of the original Vong home world of Yuuzhan'tar), and turning him into a god. With the section under the manipulation of the real Supreme Overlord of the Yuuzhan Vong, those in the species who doubted Shimrra's demise believed that the arrival of the vessel demonstrated their leader's continued existence."}, {"tag": "p", "text": "Onimi anticipated the arrival of Jacen Solo in his command chamber. The monstrous figure sensed within Jacen the \"divine glow\" of Yun-Shuno, the Pardoner goddess of the Shamed Ones, the underminer of all that Onimi set out to accomplish and plans to accomplish. After stating what he sensed in Jacen, the true Supreme Overlord of the Yuuzhan Vong declared that the death of \"Yun-Shuno,\" combined with the proposed devastation of Zonama Sekot, would fully establish the grotesque figure as the god he wants to be. Then Onimi attacked Jacen, using all of the powers that he possessed to destroy his final foe. However, Jacen had gained a much deeper connection with the Force, releasing himself to its purity; he met his opponent blow-for-blow, never making a mistake in his combat, keeping Onimi constantly off balance, batting away his toxins harmlessly. The Solo twin who Onimi interpreted as Yun-Shuno had achieved a state of oneness with the Force to become a being of light, a power against which the warped Yuuzhan Vong could not prevail. As the Force was channeled through Jacen, it rushed against his physically/mentally deformed opposite, pinning him to the bulkhead as its pure energy reversed every last deformity on his body. Unfortunately, while he was physically restored, Onimi had also lost his connection to the Force, causing him to lose control of the poisons he had inside him. He collapsed from those toxins and dissolved into a puddle of foul hydrocarbons which the yorik coral absorbed as easily as it might a stain."}, {"tag": "p", "text": "With Onimi's death, the section which he controlled had self-destructed due to the severed connection of its late ruler. Those Yuuzhan Vong who witnessed the destruction, particularly Warmaster Nas Choka, knew that the Supreme Overlord was dead, and that there was no further point in fighting the denizens of the galaxy they had conquered. The Yuuzhan Vong War was over."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The fight that Jacen had with Onimi would have far greater consequences for Solo in the future. Jacen's experiencing his oneness with the Force gave him this idea similar to that of the Unifying Force philosophy itself; he was beyond good and evil, light and dark. This ideology would be the motivation for Jacen during the Dark Nest Crisis and into his eventual downfall to the dark side of the Force itself by the time of the Second Galactic Civil War. Jacen would become the Sith Lord Darth Caedus and die in the hands of Jaina, the sister he saved from Onimi."}, {"tag": "p", "text": "Han Solo would comment three times about Onimi, twice during his son's reign as Darth Caedus and once after Caedus died. Han wanted to pretend that his son was already dead after he killed Onimi, and considered that the monster known as Caedus was simply taking over the empty shell of the Jacen who ended the Yuuzhan Vong War by killing Onimi. Two years after the end of the Second Galactic Civil War, Han, in his mourning over Jacen's loss, wondered where his son went wrong after being such a great Jedi, most notably for killing Onimi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There is some debate over what rank Onimi held before he was shamed. Though most sources state the Onimi was once a Master Shaper, in The New Jedi Order: The Unifying Force Onimi himself stated that he was denied the rank of Master Shaper. Also, in The New Jedi Order: Edge of Victory II: Rebirth, Nen Yim noticed that he had normal Yuuzhan Vong digits, apparently lacking even the shaper hands given to Shaper Adepts. These factors seem to point at Onimi having been a Shaper Initiate."}, {"tag": "p", "text": "Onimi is described as speaking in rhyme in several of the New Jedi Order novels while in Shimrra's court. In this case he would be speaking in the Yuuzhan Vong language, which consists primarily of guttural noises and most likely would not rhyme as it would in Basic."}, {"tag": "p", "text": "In Jedi vs. Sith: The Essential Guide to the Force, Onimi is referred to simply as the Supreme Overlord."}, {"tag": "p", "text": "The extent of Onimi's powers is unknown. However, since Jacen Solo had to enter a state of oneness with the Force, it is indicated that Onimi would have been powerful enough to defeat anyone else in combat, as indicated when he managed to easily overpower Jaina Solo during the Battle of Yuuzhan'tar. And while it is unknown how Onimi could have brought upon darkness to the galaxy, it is implied through Jacen's vision of a galaxy on a tipping balance point that he may have succeeded, even after Shimrra's death."}, {"tag": "p", "text": "During the course of The New Jedi Order: The Unifying Force, Onimi appeared to lose all power over Shimrra. When he revealed to Jaina that he was the true Supreme Overlord, the only explanation he had of his loss of control over Shimrra was that his \"preoccupation with defeating you (Jaina) allowed what remained of Shimrra to re-emerge.\" However, if this was so, then it is unknown how Onimi had not lost control of Shimrra earlier throughout the course of the war, such as in his first appearance in The New Jedi Order: Edge of Victory II: Rebirth, when he had not been in nearby contact with Shimrra for the entirety of the novel until its end."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}