{"url": "Ongary_IX", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Confederacy of Independent Systems astronomical objects", "Category:Ividal sector astronomical objects", "Category:Mining areas", "Category:Terrestrial astronomical objects"], "nodes": [{"tag": "h1", "text": "Ongary IX"}, {"tag": "p", "text": "Ongary IX was a Mid Rim astronomical object located in the Ividal sector. It featured hfredium mines that were converted into Vulture droid starfighter bases when the Confederacy of Independent Systems captured the celestial body during the Clone Wars."}, {"tag": "p", "text": "When the Galactic Republic planned to eliminate the Confederacy bases on Ongary IX, the Z-95 Headhunters of the Ividal Sector Forces' Foxfire Squadron were equipped with burrowing plasma charges for bombing runs. The brightness of the warheads' detonation caused problems for the starfighter pilots, however, leading to Republic technicians outfitting the squadron's helmets with opaque blast shields. The subsequent bombing run succeeded in destroying one of the Confederacy bases on Ongary IX, and the Headhunter starfighters were transported back to the Ividal Sector Forces' base the following day."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ongary IX was a terrestrial astronomical object located in the Ongary system, a part of the Slice portion of the Mid Rim. A mountain was located on the celestial body's surface, and hfredium, a metal used in starship construction, was extracted in several mines featuring central shafts."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Strategic mines"}, {"tag": "p", "text": "During the Clone Wars, the Confederacy of Independent Systems captured Ongary IX due to its interest in the hfredium reserves. The Confederacy took over the astronomical object's mines and converted their central shafts into bases for its Vulture droid starfighters, which departed the facilities for confrontations at both dawn and dusk."}, {"tag": "p", "text": "The Galactic Republic intended to eliminate the Confederacy bases on Ongary IX at some point during the conflict but was unable to spare its starfighter squadrons, which were engaged in a military operation at Uvadala. Instead, the Republic Military recruited the local Ividal Sector Forces, outfitting the Z-95 Headhunters of its Foxfire Squadron with Arakyd Industries burrowing plasma charges to allow them to function as bombers."}, {"tag": "p", "text": "Foxfire Squadron subsequently carried out several bombing runs against Confederacy targets on Ongary IX. However, the detonation of the Headhunters' plasma warheads was unexpectedly bright, and as a result the pilots Jens and Rafana became distracted and were killed. After the second bombing run, Republic technicians outfitted the Foxfire Squadron's flight helmets with opaque, hinged plastoid blast shields that could be flipped down over a pilot's face when the plasma charges were fired."}, {"tag": "h3", "text": "Flying blind"}, {"tag": "p", "text": "The bombing run of the following day targeted one of the hfredium mines. Foxfire Squadron engaged a screen of Vulture droids in an intense dogfight before firing the plasma charges. The Headhunter pilots flipped their blast shields, flying blind until the warheads vectored in on their targets and exploded. The pilot Jorn Kulish flew through the dogfights at an altitude of thirty meters, forced to wait for eight seconds until the detonation of the missile, only to realize that the blast shield of the helmet had become stuck."}, {"tag": "p", "text": "Kulish struggled with the chin strap of the helmet for ten to fifteen seconds before finally yanking it off, only to notice that the swerving starfighter passed a mountain at a distance of merely two meters. That day's bombing run was a success for the Republic's forces, with the target mine imploding and burying the entire Confederacy base."}, {"tag": "p", "text": "The next day, Foxfire Squadron's Headhunter starfighters were loaded aboard a Republic Venator-class Star Destroyer bound to return to the sector forces' base at the celestial body Ividal. Due to experience of the Ongary IX attack, however, Kulish decided to leave the service, instead leaving the celestial body as a passenger aboard the Coreward-bound Republic Group freighter Stellar Envoy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ongary IX was originally meant to be mentioned in the 2012 reference book The Essential Guide to Warfare by Jason Fry and Paul R. Urquhart; however, the section that would have mentioned the celestial body was cut before the book's release."}, {"tag": "p", "text": "The information regarding Ongary IX was later released in 2014 as part of Star Wars: The Essential Guide to Warfare Author's Cut, a series of articles published on the StarWars.com Blog by Fry and Del Rey editor Erich Schoeneweiss containing various cut content from The Essential Guide to Warfare. The StarWars.com Online Companion to the 2009 reference book The Essential Atlas placed the Ongary system, and therefore Ongary IX, in grid square P-14."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}