{"url": "Ood_Bnar", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Authors", "Category:Jedi Masters of the Jedi Order", "Category:Jedi Purge survivors", "Category:Males", "Category:Neti"], "nodes": [{"tag": "h1", "text": "Ood Bnar"}, {"tag": "p", "text": "Ood Bnar was a Neti Jedi Master who lived for over five thousand years, from before the Great Hyperspace War in 5000 BBY until 10 ABY. Bnar was born on the planet Ryyk, but found himself stranded on Myrkr during his youth. He eventually joined the Jedi Order, and over time became one of the most respected and revered Masters of the era. Bnar specialized in the history of the Sith, and preferred to avoid combat where possible, though he often advised more martial Jedi on how best to fight the dark side. Eventually, he had such knowledge of Jedi and Sith lore that he recorded a holocron, which was passed down through the generations for centuries."}, {"tag": "p", "text": "Bnar eventually became the understudy of Head Librarian Odan-Urr at the Great Jedi Library on Ossus, and after his friend's death at the hands of Exar Kun during the Great Sith War in 3996 BBY, Bnar took over his role as Head Librarian. However, his reign would not last long. He was among the Jedi who discovered that they would have little time to evacuate before Ossus was destroyed by a Sith-created supernova in the nearby Cron Cluster. While the other Jedi hurried to save as much as they could, Bnar went to his bundle of ancient lightsabers, hoping they would survive the shockwave heading for the planet. However, he was interrupted by Exar Kun, who had come to Ossus to scavenge any artifacts left behind. Knowing he could not defeat the Dark Lord of the Sith, Bnar transformed into a giant and immovable tree, barring Kun from the trove of sabers."}, {"tag": "p", "text": "Bnar survived the devastation of Ossus, and entered a millennia-long slumber. He was awakened in 10 ABY to find Luke Skywalker and Kam Solusar facing off against a Dark Side Elite named Sedriss QL, who had taken a native girl hostage. Bnar freed the girl and gripped Sedriss tightly with his roots. The darksider attempted to use the dark energies contained in Ossus's skies against Bnar, but the Neti fought back, counteracting Sedriss's attack by using the powers rooted deep in the Ossus ground. He eventually sacrificed himself to stop Sedriss and save the two Jedi and the native."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Ood Bnar was a member of the Neti, a little-known tree-like species with the ability to shape and change their bodies at will. He began life as a tiny seedling on the planet Ryyk, though he soon found himself orphaned and marooned on Myrkr. He lived on the planet for his youth, which, given Neti's long lifespans, could have lasted over a century. Ood Bnar was Force-sensitive, and several centuries before the fall of the Sith Empire, he was found by the Jedi Order and began training as a Jedi apprentice."}, {"tag": "h3", "text": "Jedi Master"}, {"tag": "p", "text": "Bnar excelled at his training, and eventually became a Jedi Master. Bnar was a revered Jedi Scholar, and took a particular interest in studying the dark side of the Force, though throughout his long career, Bnar was never seduced by the dark side. He possessed a rare ability in that he could completely sever himself from the subject of his studies; this strange capability allowed him to become one of the few Force-users to learn the workings of the Sith and the dark side without falling under its sway. Ood Bnar became a revered repository of Jedi lore after centuries of study, and the Jedi Order began to rely on this vast knowledge whenever they fought the dark side themselves. He was a poor tactician himself, but he was able to inform his allies of their enemies' weaknesses and the best methods to exploit them, thus he indirectly helped resolve many crises during his tenure as a Jedi Master."}, {"tag": "p", "text": "Bnar did not take part in the Great Hyperspace War of 5000 BBY, though one young Jedi Knight, named Odan-Urr, did. Bnar and Odan-Urr, both extremely long-lived individuals, became close friends, and often instructed young Jedi together. Like Bnar, Odan-Urr was a Jedi Scholar, and after the war he built a Great Jedi Library on the planet Ossus in remembrance of his late Master Ooroo. The Library contained a plethora of Jedi lore, as well as the Sith holocron Odan-Urr had recovered in the aftermath of the Great Hyperspace War. Odan-Urr was made Head Librarian and the Keeper of Antiquities, while Bnar acted as his understudy."}, {"tag": "p", "text": "Over time, the other Jedi encouraged Bnar to construct a Jedi holocron, so that his knowledge might be kept for ever more. Aged one thousand years, he made a holocron, containing a great amount of Jedi lore, as well as a comprehensive history of the Sith. The Neti Master installed a mimicry of himself to act as the gatekeeper for the holocron. He gave it to one of his fellow Jedi, who passed it down through the generations, until it came into the possession of Master Arca Jeth. Jeth then loaned it to Thon of Ambria, who was a close friend of Master Bnar."}, {"tag": "p", "text": "Some time before 4000 BBY, Bnar took a young Human female named Shaela Nuur as his apprentice. He taught her several aspects of being a Jedi, including lightsaber construction. Nuur excelled at her studies, and Bnar became impressed at how quickly she was progressing. He knew she would never be seduced by the dark side of the Force, and decided to give her his sacred Solari crystal. The Neti presented it to her in the gardens on Ossus after she had completed building her lightsaber, though Nuur was shocked, thinking herself unworthy to hold the powerful focusing crystal. Bnar, however, knew that she was worthy, and told her that she would go on to do great things. Her training eventually finished, leaving Bnar student-less for the remainder of his time as a Jedi Master."}, {"tag": "p", "text": "Approximately 4,000 years before the Battle of Yavin, Bnar's homeworld, Ryyk, was destroyed by a cataclysmic supernova, which wiped out much of the species. Bnar was offworld teaching students on Ossus when this happened, so he survived, but nearly all of the Neti species was wiped out. Only fragments of their culture remained, and from that point onward information about the Neti was extremely scarce."}, {"tag": "h3", "text": "Conclave on Deneba"}, {"tag": "p", "text": "In 3997 BBY, Ood Bnar was one of thousands of Jedi to attend a great convocation of the Jedi Order on the planet Deneba, called by Head Librarian Odan-Urr. Odan-Urr was growing worried with the recent attacks on the Galactic Republic by a dark side sect calling themselves the Krath, and the ineptitude at dealing with them thus far displayed by the Republic forces. The Krath were led by two cousins, named Satal and Aleema Keto—members of the Tetan aristocracy, they had traveled to Onderon, a planet known for its traditional allegiance to the dark side, and learned some basic dark side talents. The growing cult had already fought off a Republic/Jedi task force, largely thanks to Keto's powers, and had then arrogantly declared war on the Jedi Knights. Odan-Urr called forward Ulic Qel-Droma and Nomi Sunrider, the two leaders of the botched Republic attack, who had formulated a plan of attack which they hoped would stamp out the Krath. However, Qel-Droma's idea was not received well by the congregation. The young Human planned to infiltrate the Krath by pretending he had gone over to the dark side, and from there he would destroy them from within. The other Jedi, both the youthful and the experienced, warned Qel-Droma against it, knowing he would truly fall to the dark side should he attempt his plan."}, {"tag": "p", "text": "Meanwhile, the Krath were plotting against the Jedi on Deneba. A Tetan Corsair lay hidden among the other vessels above Deneba, and released a barrage of life pods, each containing hundreds of freshly produced war droids, down onto the mountainous world. Simultaneously, the service droids assigned to aid the Jedi turned on them, and a full-scale battle ensued. The droids were programmed to take out the most high-ranking and senior Jedi present. Though Bnar was not harmed, the same could not be said of all the Jedi Masters. Arca Jeth was killed by a war droid in the presence of his Padawan, Ulic Qel-Droma. The Jedi eventually defeated the Krath droids with minimal injuries, though Qel-Droma, feeling responsible for his Master's death, decided to carry out his plan regardless of the Jedi's attempts to dissuade him."}, {"tag": "p", "text": "However, Bnar was determined not to see the Jedi fall to the dark side, and once again attempted to persuade him against carrying out his plan. In the Great Jedi Library on Ossus, Bnar and his old friend Odan-Urr met with Qel-Droma and his fellow Jedi Knight, Nomi Sunrider. The ancient Neti gave Qel-Droma a centuries-old book, authored by the influential Empress Teta, which he hoped would prove useful during Qel-Droma's time in the Empress Teta system. Bnar knew Qel-Droma would not be swayed, but he introduced him to Odan-Urr regardless. Using the Sith holocron he had recovered over a thousand years beforehand, Odan-Urr demonstrated to him what had happened to a young Jedi who tried something similar to what Qel-Droma proposed—he fell to the dark side and murdered his Master. Qel-Droma was horrified at the thought of it, though he was still determined to carry out his plan, thinking he would become a hero. The wise Masters knew he would fail, and bade the two Jedi Knights goodbye, wishing the Force to be with them."}, {"tag": "h3", "text": "Great Sith War"}, {"tag": "p", "text": "Qel-Droma's efforts ultimately failed. He became seduced by Aleema Keto and her dark magic, and turned on his fellow Jedi. A team of Jedi Knights, including the likes of Nomi Sunrider, Qel-Droma's brother Cay, Qrrrl Toq and Dace Diath, among others, had decided to travel to the Empress Teta system in an attempt to bring Ulic Qel-Droma back to the light. Bnar was one of several Jedi Masters who spoke to the team shortly prior to their departure. Master Thon told them that Qel-Droma might teach himself a lesson through his own foolish actions, but Bnar disagreed. He told the Knights that one who had turned to the dark side, such as Aleema Keto, could make a Jedi feel angry, and that rage clouded one's judgment and prevented the use of common sense. The Jedi Knights departed, though they soon returned, their mission a failure: Qel-Droma had refused to join them, telling them his true allegiance. Another impressionable young Jedi, a Human named Exar Kun, had also fallen to the dark side. The Sith spirit of Marka Ragnos proclaimed Kun the Dark Lord of the Sith, with Qel-Droma acting as his Sith apprentice. Along with the armies of Mandalore the Indomitable and the Krath, Kun waged war on the Republic. The first major casualty of the war was Odan-Urr, who was slaughtered by Kun on Ossus after the Dark Lord learned of his Sith holocron. With his longtime friend dead, Ood Bnar became the new Head Librarian and Keeper of the Antiquities at the Great Jedi Library. However, neither Bnar nor any of the other Jedi learned the truth behind Odan-Urr's death; Kun had lied, claiming that Odan-Urr had declared him a Jedi Master before succumbing to his age and becoming one with the Force."}, {"tag": "p", "text": "Kun had secretly recruited several young Jedi and turned them to the dark side without the Order knowing. He had his acolytes kill their Jedi Masters, while he would take out his former Master Vodo-Siosk Baas himself. Baas was killed by Kun on Coruscant, while Kun's dark Jedi succeeded in killing off their Masters, save for Oss Wilum and Crado, who had been unable to defeat Master Thon on Ambria. Along with Nomi Sunrider and Sylvar, Thon traveled to Ossus to assess the damage caused. They met with Bnar in a chamber off the Great Jedi Library, and were joined by a group of several Jedi Shadows, who had been among the first to discover the bodies of the slaughtered Masters. The Jedi were discussing Qel-Droma's fall, and the eight Jedi Masters who had perished, when a young Twi'lek Jedi Knight named Tott Doneeta rushed in with news that the nearby space station known as Kemplex IX, located in the Cron Cluster of the Auril sector, was being attacked by the Sith."}, {"tag": "p", "text": "The Jedi discussed what to do, with Thon advising caution; the station was unimportant by itself, and Kun had no reason to target it. He suspected it was a trap, though three of the Jedi Shadows—Qrrrl Toq, Shoaneb Culu, and Dace Diath—would engage the Sith fleet and attempt to rescue those on the space station, while the others would remain on Ossus to ensure Kun could not launch a surprise assault. Thon guessed Kun's strategy correctly; the attack on Kemplex was nothing more than a ruse, though one which would have devastating effects for Ossus. Qel-Droma and Kun had ceased to require the services of Aleema Keto and Crado, and the two acolytes were beginning to get in the way of the two Sith's operations. Kun sent them on a suicide mission to the Cron Cluster, intending for the Republic and Jedi to give chase. They did, and when Keto was within reach of one of the Cluster's stars, she used her Sith magic to make it go supernova, destroying the Jedi and Republic forces sent after them. However, the supernova proved far more powerful than Keto had anticipated, and it killed her and Crado, as well as unleashing a shockwave that would devastate Ossus in very little time."}, {"tag": "h3", "text": "Devastation of Ossus"}, {"tag": "p", "text": "While the other Jedi rushed to save as much of Odan-Urr's vast collection of scrolls as they possibly could, Bnar went to a private alcove in the Jedi archives, where he hid several ancient lightsabers in a concealed hole under the tiled floor. As he packed them away, Exar Kun entered, accompanied by several hulking Massassi warriors. Kun was trying to scavenge any artifacts left behind by the Jedi before they were lost forever, though Bnar was determined to stop the Sith Lord. Kun ironically thanked the Neti Master for saving the artifacts for him, though Bnar did not waver, and ignited one of the ancient sabers, ready to face Kun."}, {"tag": "p", "text": "However, Kun had two large advantages over the old Neti Master: he had a unique double-bladed lightsaber, and his skills with it were far better than Bnar's basic dueling abilities. However, the Neti held Kun off for several minutes, managing to evade his blows. Eventually, one of Exar Kun's Massassi stepped in, forcefully knocking the saber from Bnar's branch-like hands. On his knees and defenseless, Bnar knew he would not overcome the Dark Lord of the Sith, yet he was determined to keep the sabers out of the man's hands. Using his Neti abilities, he metamorphosed into his true, tree-like state, standing to protect a trove of sacred lightsabers from Kun. The Sith Lord left, knowing that even without the lightsabers, he was victorious."}, {"tag": "p", "text": "Kun fled to Yavin 4, while Qel-Droma was cut off from the Force by Nomi Sunrider after killing his own brother. Thon and the others had managed to save some of the scrolls and documents Odan-Urr had kept in his library, though they remarked that even if they had had a year to pack away the scrolls, they would still have had to leave some behind. Before he left, Thon went to visit Ood Bnar, his old friend. Bnar was unable to move, though he could still talk and relate to other beings. The Tchuukthai Master could not fathom Bnar's actions, yet he accepted them, and was saddened to have lost his friend in such a way. Bnar told him not to be concerned; this was his life-cycle, and he may even survive the cataclysm of Ossus. Thon wished him well, and the two said goodbye, never to see each other again. Bnar also left his lightsaber crystal, which would be later called Bnar's Sacrifice, as a legacy to those who would come after him. His exploits in this battle were later portrayed in an artwork by the Rodian master artist Zyk-yadoon that was kept at the Remembrance Hall on Almas."}, {"tag": "h3", "text": "Reawakening"}, {"tag": "p", "text": "The shockwave hit Ossus soon after Thon's departure, though as he had foreseen, Bnar managed to survive the devastation. Ossus, however, was ruined, and the intense radiation meant that the Jedi were unable to rebuild their libraries and training centers there. Bnar was not the only survivor—a group of Jedi unable to evacuate had found refuge in great caverns under the Eocho Mountains, where their descendants lived until they had forgotten their origins. They eventually became the tribal Ysanna. Bnar was never discovered by the Jedi, and over time his friends perished. Thon saw out the rest of his days on Ambria, while Shaela Nuur was killed during the Great Hunt shortly after the war. Bnar eventually entered a centuries-long slumber, living through many eras of the galaxy, including the Great Jedi Purge in 19 BBY, where the majority of Jedi Order was wiped out, minus a few survivors. He was not forgotten, however: Bodo Baas, a descendant of Bnar's friend Vodo-Siosk Baas, spoke of the Neti Master in his holocron, which would eventually fall into the hands of Luke Skywalker, a young Human from Tatooine who sought to rebuild the Jedi Order."}, {"tag": "p", "text": "In 10 ABY, over four millennia after he had metamorphosed, Ood Bnar was awakened. Luke Skywalker and Kam Solusar had been guided to Ossus by Bodo Baas's holocron, and found two of the native Ysanna, named Jem and Rayf, tied to what appeared to be a large and gnarled tree. They released the pair and were introduced to the Ysanna tribe, who allied themselves with Skywalker and Solusar upon learning that they were Jedi. Skywalker had been followed, however, by two of Palpatine's Dark Side Elite: Sedriss QL and Vill Goir, who had brought a contingent of troops with them as backup. They engaged the Ysanna and Jedi in a battle, though their soldiers were fought off, and Goir was killed by Kam Solusar. Alone against two powerful Jedi, Sedriss took Jem hostage and backed up against the momentous tree form of Ood Bnar."}, {"tag": "p", "text": "The presence of so many powerful Force-users, particularly that of the Jedi, stirred Ood Bnar out of his sleep. He used his root-like arms to grab a hold of Sedriss, and pulled him away from the frightened Ysanna female. Sensing that it would be his final battle, Sedriss attempted to use the energy of the planet's broken skies to defeat Bnar. Bnar, however, was able to counteract this, and drew on the living energy present in his roots deep in the Ossus ground. In the end, the two Force-users annihilated each other. The Jedi were saddened that Bnar was unable to share his knowledge with them, though his trove of ancient lightsabers helped in the restoration of the Jedi Order. Bnar was now one with the Force, however, before his death he was successfully able to leave a descendant behind: a tiny sapling that grew upon his death."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Long after the end of the Great Sith War, treasure hunters scoured the galaxy for journals presumably written by Ood Bnar himself. Although their existence was debated by the time of the Battle of Yavin, the explorer Riyan Kiner became utterly insane after spending his life looking for this fabled artifact."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ood Bnar was a wise individual, and his word was highly regarded within the Jedi Order. His centuries studying both the light and the dark meant that he was extremely knowledgeable, and the other Jedi felt his knowledge and expertise were so important that they should be recorded in a holocron. Students were often sent to Master Bnar so that they could learn a lesson; his experience of Jedi lore meant he could often determine what would happen should one attempt something, as it had nearly always been attempted previously. Some of Bnar's lectures on the Force were even published by the Coruscant Jedi Temple, in a collection named \"Lectures on the Nature of the Force.\""}, {"tag": "p", "text": "Throughout his life, Bnar made many friends, despite knowing that he would live to see the death of nearly all of them. He and Thon were extremely close, although they disagreed on many subjects. He also conferred with the other Masters often, including Vodo-Siosk Baas, one of the most senior Masters. His closest friend was Odan-Urr, with whom he maintained the Great Jedi Library on Ossus. He and Odan-Urr often consulted people together, and Bnar had great respect for the Draethos, considering him one of the wisest of the Masters. Bnar took many students, and he was known to be an encouraging teacher, offering advice where he could, but also praising a promising student's abilities. His favorite apprentice was Shaela Nuur, whom he kindly awarded his rare Solari crystal to in acknowledgment of her steady progress. Although Bnar had no qualms with teaching other Jedi of the dark side, he always warned them of the perils the dark side possessed, and that they should think carefully before deciding to learn of it."}, {"tag": "p", "text": "Bnar was a very quiet and peaceful individual, preferring to stay out of the limelight during times of crisis. He spent much time alone, though this did not bother him. He disliked violence, and only learned basic skills with a lightsaber. Although he preferred to remain in the background most of the time, Bnar was happy to speak in front of others, and often attended conferences with other members of the Order. Bnar discouraged the thought that Humans were in any way superior to other species, and also felt that every creature, even non-sentients, were as important as each other. He thought that the Force linked everything, so everything was of equal importance."}, {"tag": "p", "text": "A very studious and scholarly character, Bnar held an extremely rare ability: he was able to distance himself when learning the various aspects of the Force, particularly the dark side, so he was never tempted to renounce the light and worship the dark in his millennia-long life. This way of being proved instrumental during Bnar's lifetime, as he was one of very few pure Jedi to have an intricate knowledge of the dark side, so he could always advise more martial Jedi on where its weaknesses were and how to combat them. Ood Bnar was extremely selfless, and was happy to sacrifice himself for the good of others. During the Great Sith War, he metamorphosed to save the lightsabers from Kun's hands; though the transformation was inevitable for a Neti, Bnar could have remained in his previous state for much longer."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Bnar was an accomplished Jedi, though he preferred reading to fighting, and his lightsaber skills could be found lacking when facing faster and superior opponents. Nevertheless, he could wield a weapon decently, though he did not carry a lightsaber himself. Shaela Nuur, Ood's Padawan, was a good swordsman, which was a testament to Bnar's abilities. However, Bnar knew his limitations, and tried to avoid one-on-one lightsaber fights whenever he could."}, {"tag": "p", "text": "Although Bnar was not a master swordsman, he was an expert at using the Force, and had a wide array of powers in his repertoire. He was able to draw on the energies held deep below Ossus's surface and use them against Sedriss QL, who was attempting something similar, though the darksider was trying to use the dark energies contained in Ossus's atmosphere against Bnar. The Neti Jedi proved equally powerful, and the two Force-wielders ultimately destroyed each other."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ood Bnar was conceived by Star Wars author Tom Veitch for the Saga of Nomi Sunrider story arc, part of the Tales of the Jedi comic series. His visual appearance was designed by artist Christian Gossett. Veitch later re-used the character in the subsequent Tales of the Jedi story-arc, as well as in Star Wars: Dark Empire II."}, {"tag": "p", "text": "Ood Bnar acts as the in-universe \"author\" of the Tales of the Jedi Companion, where he acts as the gatekeeper of the holocron, and instructs players on various aspects of running a Tales of the Jedi RPG campaign."}, {"tag": "p", "text": "Ood Bnar makes an appearance in the Jedi Under Siege exansion for Star Wars: The Old Republic, in his Tree form, a codex entry states that Jedi Master Gnost-Dural along with other Jedi meditated at his roots in hopes of learning from the ancient master, to no avail."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}