{"url": "Oola", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Females", "Category:Jabba's dancers", "Category:Slaves", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Oola"}, {"tag": "p", "text": "Oola was a green-skinned Twi'lek female who was enslaved as a dancer in Jabba the Hutt's palace. Shortly before a disguised Leia Organa arrived with a seemingly-captured Wookiee named Chewbacca, Oola performed a dance for Jabba. Enraptured, Jabba attempted to pull Oola closer to him. She struggled, and Jabba dropped her through a trapdoor, where she was eaten by his pet rancor."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Oola was a green-skinned female Twi'lek who was born to a clan chieftain on her species' homeworld of Ryloth. She devoted herself to dancing, and was trained at a celebrated school. When given the opportunity to choose between two careers, Oola decided to take her chance on Tatooine, a desert planet controlled by the Hutts."}, {"tag": "p", "text": "At some point, she was betrayed by a jealous rival, resulting in her status falling so far that she became enslaved by the Hutt crime lord Jabba Desilijic Tiure in his palace. The Hutt forced her to wear skimpy fishnet garments, a collar, and a chain around her neck when she danced."}, {"tag": "p", "text": "Shortly before Leia Organa and Chewbacca arrived as part of the plan to rescue Han Solo, Oola performed her final dance to the music of the Max Rebo Band. Jabba tugged her chain to pull her towards his dais, but she rejected his advances by pulling back on her chain. In retaliation for her defiance, Jabba opened the trapdoor in front of his dais to drop her into the rancor pit. He and his retinue watched and laughed as Oola, unable to defend herself, was eaten alive by Jabba's rancor while her screams echoed throughout the palace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Oola was portrayed by Femi Taylor in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi, in both the original release and in additional scenes filmed later for the 1997 Special Edition. Since Taylor's appearance was almost unchanged after 14 years, she could film a close-up of Oola's terror at the rancor."}, {"tag": "p", "text": "According to Femi Taylor in a TheForce.net interview, during the early development of Return of the Jedi, Oola was meant to have a major part in the scenes at Jabba's Palace because her fate was not to be eaten by Jabba's rancor. Instead, Oola was to survive and escape from Jabba's Palace. Although director Richard Marquand storyboarded the sequence of Oola's escape, it was cut because of budget constraints, so the character's role was considerably reduced, as well as her fate."}, {"tag": "p", "text": "In an interview with the Aggressive Negotiations podcast, Star Wars: The Clone Wars writer Henry Gilroy stated that the events of the Battle of Ryloth in that series likely involved many Twi'leks being sold into slavery by the Confederacy of Independent Systems, going on to suggest that Oola may have been brought to Jabba's Palace as a result."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}