{"url": "Onoam", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire moons", "Category:Moons of Naboo", "Category:Onoam locations", "Category:Terrestrial moons"], "nodes": [{"tag": "h1", "text": "Onoam"}, {"tag": "p", "text": "Onoam was a moon of the planet Naboo, a part of the Mid Rim's Chommell sector. Its grassy plains housed second homes for wealthy citizens of Naboo while miners extracted medicinal spice underneath the surface. A secondary royal palace was also maintained there for when the queen of Naboo visited. During Padmé Amidala's lifetime, miners protested for a greater share of the profits from Onoam's mines; under the Galactic Empire, conditions grew even worse. When Princess Leia Organa of Alderaan visited the moon on a mercy mission, she attempted to address the Imperial corruption in the mines and witnessed the assassination of Quarsh Panaka."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Onoam was a moon that orbited Naboo, a planet in the Naboo system, within the Chommell sector in the regions known as the Mid Rim and the Trailing Sectors. Onoam was located in grid square O-17 of the Standard Galactic Grid. It had pinkish skies and rolling plains covered in tall grass, as well as rocky terrain and at least one river."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rocky relationship"}, {"tag": "p", "text": "Onoam had a long history of tension with Naboo. During the last days of the Galactic Republic, the mining moons of Naboo had difficulty balancing their need to meet production quotas with the rule of Naboo. As a newly-minted senator, Padmé Amidala considered settling recently freed slaves on the mining moons. She decided against it, as jobs in the mines were far less likely to earn the former slaves enough to start a new life than farming jobs on the neighboring planet of Karlinus."}, {"tag": "p", "text": "Around that time, there were multiple strikes as miners lobbied for a greater share of the profits from the mines, with some groups engaging in minor political violence that escalated to property damage on the surface of Naboo. When Senator Amidala narrowly escaped assassination in 22 BBY, Jedi Master Mace Windu suggested that the discontented miners from the moons of Naboo might have been responsible, although it was later proven untrue."}, {"tag": "h3", "text": "Vein of corruption"}, {"tag": "p", "text": "In 3 BBY, while the Naboo system was under the rule of the Galactic Empire, Princess Leia Organa began to undertake the three challenges needed to prove herself worthy as a successor to the throne of the planet Alderaan. As part of her Challenge of the Heart, Organa visited Onoam on a humanitarian mission, bringing aid to miners facing difficult working conditions. When she landed, protocol required her to visit Queen Dalné, as the young queen was in residence at her secondary palace. Organa invited Dalné to join her on a visit to a spice mine on the moon where she planned to distribute safety equipment to the miners."}, {"tag": "p", "text": "When they reached the mine, Organa observed that conditions for the miners had grown worse since the previous generation's protests; the air was clogged with dust. Organa and Dalné met with Brel Ti Vorne, the representative for the miners. Organa announced that they had brought enough equipment for five hundred miners, including safety belts, atmosphere masks, and portable force fields for purifying the air. To the girls' surprise, Vorne received the gift with dismay. He explained that the Imperial major in charge of the mines had a habit of confiscating useful equipment either as a punishment or with the claim that it was defective, then selling it off to line his own pockets. Organa and Dalné promised to make sure the miners would get to keep and use their equipment."}, {"tag": "h3", "text": "The fuse is lit"}, {"tag": "p", "text": "Determined to keep their promise to the miners, Dalné and Organa considered their options. Dalné recalled that she had the right to demand an audience from senior officials, and the two girls paid Moff Quarsh Panaka a visit. He agreed that while Imperial officers were given leeway to act to maintain order and economic means of punishment were preferred over violent ones, some officers abused the license and punished innocent citizens along with the lawbreakers. He agreed to Organa's proposal that he establish better oversight in the mines."}, {"tag": "p", "text": "Unknown to Organa, members of Saw Gerrera's Partisans, a group affiliated with Organa's father's Rebel Alliance but acting without the approval of other Alliance leaders, had planted bombs at Panaka's chalet. As the girls left the chalet, the explosives went off, destroying the building and killing Panaka. In the wake of the assassination, Organa realized that it might be a few weeks before a new Imperial officer could get through the lockdown and take charge of Naboo, and in the meantime Dalné would be able to act freely as queen and help the miners, promising to rise to the challenge."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The moon was home to workers who extracted spice from its mines. Many wealthy citizens of Naboo also had second homes on Onoam, including Quarsh Panaka and Queen Dalné."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Royal House of Naboo maintained a secondary palace on Onoam where Dalné received visitors while in residence. A spaceport was located a few kilometers away from the palace. The palace was cupped in the bend of a river, overlooked by cliffs from which several waterfalls descended, with rolling hills on one side and flat grassy plain on the other. Other buildings surrounded the palace both at ground level and atop the cliffs, and more were clustered towards the hills on one side of the palace."}, {"tag": "p", "text": "Onoam housed medicinal spice mines, which by law had to be worked by sentients rather than droids. The entrance to the mine visited by Organa and Dalné was in an area with rising, rocky terrain. Notable residences on Onoam included Quarsh Panaka's chalet. The chalet was a single building alongside a river, surrounded by grassland, and had a terrace with a view of the river."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Onoam first appeared in Leia, Princess of Alderaan, a 2017 young-adult novel written by Claudia Gray. In other sources, the three moons of Naboo are variously named Ohma-D'un, Rori, and \"a nameless mass\" or Ohma-D'un, Rori, and Veruna. The first picture of a moon positively identified as Onoam appeared in Leia Organa: Ordeal of the Princess, a Japanese webcomic adaptation of Leia, Princess of Alderaan, on May 8, 2021."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}