{"url": "Oojoh", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Ho'Din", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "Oojoh"}, {"tag": "p", "text": "Oojoh was a male Ho'Din with green skin who lived in the period just after the Great Sith War of 3996 BBY. As a Force-sensitive, he was selected by the Jedi Order for training. Initially, he received this at the Jedi Enclave on Dantooine, before transferring to Taris along with four other trainees. There, he was apprenticed under the Feeorin Jedi Master Feln. He progressed through his training, constructing a lightsaber and bringing down the Leverby smuggling ring. As Oojoh and his companions neared the end of their training, they underwent a final test on the Rogue moon—a rock in an inner asteroid belt of the Taris system. There, he successfully traversed the terrain with only the Force to guide him, avoiding a multitude of meteors raining down from above."}, {"tag": "p", "text": "However, Oojoh's promotion to Jedi Knight was not to be. While he and the other trainees were crossing the Rogue moon, their masters received a vision of the Galactic Republic crumbling due to the rise of the Sith. Determined to prevent such an occurrence, and led by elements of their vision to believe one of their Padawans would be responsible, the Masters agreed to kill their own Padawans. Shortly after returning to Taris, at a special ceremony ostensibly to announce the graduates, four of the five Padawans, including Oojoh, were massacred. The final remaining Padawan, Zayne Carrick, escaped, and was framed by the Masters. Eventually, however, he cleared his name, and Oojoh's family finally learned the truth behind his death."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and training"}, {"tag": "p", "text": "Oojoh was a green skinned Ho'Din, a reptilian sentient species native to Moltok, a planet in the Atrivis sector of the Outer Rim Territories. Born during the reign of the Galactic Republic, which had just suffered through the Great Sith War of 3996 BBY, and being a Force-sensitive, Oojoh was tested at the Jedi Enclave on Dantooine, and accepted into the Jedi Order for training in the ways of the Force."}, {"tag": "p", "text": "Along with four other trainees, he was subsequently sent to a small satellite training facility on the prosperous world of Taris in the years leading up to the Mandalorian Wars. The five Jedi trainees—the others being Gharn, a Nagai; Kamlin, a Falleen; and two Humans, Shad Jelavan and Zayne Carrick—grew up together, and were each assigned to a Jedi Master. Oojoh was assigned to an imposing Feeorin Jedi named Feln. Under his training, Oojoh successfully brought down the Leverby smuggling ring led by Loopy Leverby, an achievement noted by the Taris Holofeed."}, {"tag": "p", "text": "Oojoh was present in 3964 BBY, when the Taris academy was visited by Jedi Knights Alek Squinquargesimus and Revan, who were on their way to the front lines of an emerging conflict between the Republic and the Mandalorians. The pair of Knights advocated direct Jedi involvement in the conflict, and sought support from the Taris Masters. They were turned down, however, as the Taris Masters considered the war secondary to efforts to prevent the return of the Sith."}, {"tag": "h3", "text": "Trials on the Rogue moon"}, {"tag": "p", "text": "The next week, the five Padawans were transported up to the Rogue moon, located within an asteroid belt orbiting Taris's sun, for their final Jedi test. The Rogue moon traveled in the opposite direction to the rest of the asteroid field; consequently, it suffered a constant barrage of meteor impacts of all sizes. This was considered a suitable location to test the trainees' ability to \"see\" using only the Force. Each Padawan was clad in a heavy red Enviro-suit with its visor down. In this manner, the Force was the only sense they had available to avoid the constant barrage of meteor impacts. While his master piloted the starship, Oojoh and the other Padawans were dropped from the ship to drift to the moon's surface below."}, {"tag": "p", "text": "Oojoh safely crossed the valley—neither the quickest nor the slowest of the Padawans—and rejoined the Masters who had been waiting on the far side. While waiting, however, the Masters had not been idle. Four of the masters—Feln, Xamar, Q'Anilia, and Raana Tey—were trained Consulars, a class of Jedi that specialized in Force skills of a cerebral nature, including healing, research, and precognition. Together, they meditated, and with the Force flowing freely in this location, they each received a vision of the future: their own deaths and accompanying ruin for the galaxy. Oojoh's master Feln saw himself cut down on his homeworld Odryn, while others saw the return of the Sith, the fall of Jedi Order, or the ruin of the Republic. The four visions were unified by one feature: each involved a figure wearing a red environment suit, just like their Padawans were wearing."}, {"tag": "h3", "text": "Graduation"}, {"tag": "p", "text": "Following the completion of the Jedi trials, the masters sequestered themselves in the Jedi Tower to discern the meaning of their vision. When they finally emerged, they announced they had made their decisions as to who would graduate to Jedi Knight. They organized a celebratory banquet ahead of their official announcements, to which they invited various family members and guests. Oojoh was present along with Gharn, Jelavan, and Kamlin, but the final Padawan, Carrick, was late. Having been making one final attempt to catch Marn Hierogryph, a local Snivvian criminal, Carrick was foiled and actually crashed through the window of the banquet hall. At this surprise entry, Oojoh ignited his lightsaber, along with the eight other Jedi present, placing them at the throat of the intruder. Although suffering embarrassment, Carrick received no further harm."}, {"tag": "p", "text": "Later that evening, Oojoh was present for the graduation ceremony in the council chambers at the top of the Jedi tower, although once again Carrick was late arriving. While the other Jedi waited for him, Shad Jelavan questioned whether Carrick would graduate with the rest of the class. When Lucien Draay, Carrick's master, answered in the affirmative, Oojoh expressed his surprise at the announcement—Carrick had always finished last in each of the Jedi assignments. His reaction was shared by the other Padawans, each of whom had heard their masters speak disparagingly of the Human; Oojoh's own Master Feln frequently called him a \"buffoon.\" As the Padawans continued pressing the Masters, Jelavan detected that they were lying. Agitated by the Padawans, the Masters took action earlier than planned: igniting his lightsaber, Feln killed Oojoh, stabbing him through his torso, while the other Masters, likewise, killed their Padawans. The Masters believed this act was the only way to prevent their visions coming to fulfillment—a tragic intervention to save the galaxy. It was at this point that Carrick stumbled into the Council Chambers. Seeing the massacre before him, he quickly fled the scene."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Initially, the murder of Oojoh and the other Padawans was blamed on Carrick, who managed to successfully evade the Jedi Masters attempts to capture him. The death of the Padawans, combined with the growing threat of the Mandalorians, caused riots on Taris, and the Masters were subsequently recalled to Coruscant and then split up. Master Raana Tey subsequently returned to Taris in pursuit of Carrick, and en route had a nightmare in which Oojoh and the other murdered apprentices swapped positions with their masters and forced her to look at her own body. Despite being pursued by the Taris Masters, Carrick eventually managed to clear his name of the murders, and the Jedi Order revealed the truth to Oojoh's family, although it was kept secret from the galaxy at large. Oojoh's family later worked with Carrick as part of the Rogue Moon Project, looking after those marginalised by the war."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Oojoh was green skinned, with head-tendrils of mixed blue-green coloration, one of which he wrapped like a Padawan braid. He typically wore a yellow shirt with a brown vest over the top, along with some shoulder guards decorated in gold. He wore black boots, and finally, a utility belt with numerous pockets. Oojoh appeared genuinely pleased to hear that his childhood companion and peer, Zayne Carrick, would graduate to Knighthood, even if the news surprised him. However, when Jelavan, the nominal leader of the trainees, began to question this decision, Oojoh followed along."}, {"tag": "p", "text": "Oojoh was Force-sensitive and a competent Jedi trainee. For instance, while practicing policing duties on Taris, he brought down the Leverby smuggling ring. Similarly, while on the Rogue moon, he was able to use the Force to guide his steps so as to avoid being struck by a meteor. While he was not the fastest to cross the valley, nor was he the slowest of the Padawans."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Oojoh was created by John Jackson Miller for the Dark Horse comic series Star Wars: Knights of the Old Republic. He debuted in Knights of the Old Republic 1 (2006) and subsequently appeared in most of the issues of the first story arc Commencement, and two subsequent issues. However, he was never named in any of the issues—that only occurred in Knights of the Old Republic 0 a promotional comic set before the main story arc that included an in-universe newsreel—and overall, only received three lines. Oojoh also appeared in the Star Wars: Knights of the Old Republic Handbook, which was the first canon confirmation that he was Feln's Padawan—although Miller had previously confirmed this in the production notes on his website—and in The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "Oojoh's lightsaber color is never specified; however, in the first issue, nine lightsabers are shown to correspond to the nine Jedi. Of these nine, three have not been appointed—two green and one blue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}