{"url": "Onnelly_Praji", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Coruscanti", "Category:Females", "Category:House Praji"], "nodes": [{"tag": "h1", "text": "Onnelly Praji"}, {"tag": "p", "text": "Onnelly Praji was the daughter of Tannon Praji, the First Minister of the Coruscant Ministry of Ingress. In 19 BBY, she and her family were to be relocated to the \"Emerald Splendor Estates\" on the planet Byss for a short time as part of a recolonization effort. While preparing for departure, Onnelly met Jodd Sonta, a Commission for the Preservation of the New Order Sub-Adult Group member. She later encountered Sonta once more as her transport was preparing to depart for Byss. Sonta, who was actually the fugitive Jedi Drake Lo'gaan, informed her that the transport was a slave ship. Despite his warning, Onnelly went to Byss with her family and had her Force energy slowly drained by Emperor Palpatine himself, who used the world as a private retreat."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human female Onnelly Praji was born to Tannon and Maree Praji, members of the influential House Praji; Tannon, in particular, was the First Minister of the Coruscant Ministry of Ingress, the agency that monitored the galactic capital Coruscant's immigration and emigration. In 19 BBY, when the Galactic Empire came to power, Tannon took leave of his job to help relocate Onnelly and Maree to the \"Emerald Splendor Estates\" on the Deep Core world of Byss. The relocation was part of a much broader \"recolonization effort,\" intended to attract the wealthy and powerful. Despite this, Onnelly believed they would only be there for approximately a month. Before departure, Onnelly traveled to transport platform DN6-4435 to help load her family's luggage on board the craft bound for \"Emerald Splendor.\""}, {"tag": "p", "text": "Onnelly was having difficulty with the bag repulsors and asked for help from a young boy in the Commission for the Preservation of the New Order Sub-Adult Group who was passing by. The boy obliged and began carrying all the bags by himself at once. The two began conversing, and Onnelly asked the boy about his family, only to discover that they had died in the Clone Wars. The boy claimed that he had joined COMPNOR for the credits, and that he hoped to find out if any of his family had survived. When he had finished loading the bags, Onnelly introduced herself, and the boy identified himself as Jodd Sonta, although he was hesitant to do so. Onnelly noticed this, but let it pass, giving Sonta a kiss on the cheek before departing."}, {"tag": "p", "text": "When the transport finally prepared to depart, Onnelly was approached by Sonta once again—this time, the boy was wearing battle armor. He quickly explained to her that the possessions of the non-Humans aboard the transport were being destroyed, and that the Imperials were not going to let anyone off the transport. Sonta attempted to lead her off the transport, but Onnelly resisted, as she did not understand. He explained the situation to her bluntly—the transport was a slave ship, and Onnelly was unlikely to ever return from \"Emerald Splendor.\" At that moment, Inquisitor Antinnis Tremayne—flanked by stormtroopers—entered the room, intending to arrest Sonta. The boy was in fact a Jedi, Drake Lo'gaan, who had escaped the Jedi purge of Order 66 some time prior and was acting undercover. In response to Tremayne's arrival, Lo'gaan used his lightsaber to break open a nearby window and jumped off the transport."}, {"tag": "p", "text": "Despite Lo'gaan's warning, Onnelly accompanied her family to \"Emerald Splendor.\" In reality, the world was Emperor Palpatine's private retreat. While there, Onnelly, Maree, and others like them were kept entertained, but unknown to them, Palpatine was secretly sapping away at their Force energy in order to keep himself sustained."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The black-haired Onnelly Praji was not adverse to performing menial tasks, such as loading luggage by herself, but could not do so without the assistance of repulsorlift technology. She was reliant on her father's ability to buy her what she wanted and needed, and she expected as much when her current possessions somehow failed her. Onnelly was also flirtatious when it came to her encounter with Drake Lo'gaan; Lo'gaan himself, having been trained as a Jedi, found it difficult to resist striking up a relationship with the girl."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Onnelly Praji first appeared in the Paul Ens webstrip Evasive Action: Recruitment as a minor supporting character. Her relationship to another Star Wars character, Tannon Praji, was established in the article Tinker, Tailor, Soldier, Praji."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}