{"url": "Oovo_IV_Uprising", "categories": ["Category:Legends articles", "Category:Battles in the Tharin sector", "Category:Missions of The Hunt"], "nodes": [{"tag": "h1", "text": "Oovo IV Uprising"}, {"tag": "p", "text": "The Oovo IV Uprising occurred when the prisoners on the prison asteroid of Oovo IV rose up against the prison guards and rioted."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "When Jango Fett learned of a bounty for Bendix Fust who was wanted alive by Sebolto, a crime lord on Malastare with connections to the Bando Gora, Jango decided to go to Oovo IV and collect the bounty."}, {"tag": "p", "text": "Fett planned to slip through the shield when a supply craft would arrive to deliver its cargo to the prison. Jango flew his old ship, the Jaster's Legacy, and settled down near an entrance. After blasting his way through multiple guards of the Helmet Squad, he encountered Wim \"Smootie\" Smoot who knew where Bendix Fust was located at Cell Block Level 1. He had also heard about the tale involving the Bando Gora and how Komari Vosa became part of the cult and subsequently told Jango about it. When Jango found Bendix Fust, he was beaten to him by a female bounty hunter called Zam Wesell, who sparked off a riot to cover her escape."}, {"tag": "h2", "text": "The Riot"}, {"tag": "p", "text": "Jango managed to fight through multiple guards and prisoners, despite the chaos, which began to grow out of control. Despite being attacked by both prisoners and guards—one of which was Meeko Ghintee, who was wanted dead—Jango Fett managed to reach the Jaster's Legacy and fought off the guards with Zam's help. However, his ship was disabled irreparably by a Firespray-31-class prototype patrol ship. Jango decided to capture one, but first he needed to shut down the shield that was protecting the prison."}, {"tag": "p", "text": "Jango asked \"Smootie\" how to shut the shield down, and was told that he should cause a meltdown by overloading the three reactors that powered the shield, by blasting the cooling circuits. Fett managed to fight his way through the guards and overload all three reactors, causing the shield to malfunction and deactivate. When he arrived at the hangar bay, he confronted a VA RPV. Despite its weapon systems and being surrounded by guards, Jango managed to disable the vehicle and secure the area. After taking one of the Firespray-31-class prototypes, he destroyed the hangar containing the rest."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "It is unknown whether the prisoners or the guards won, but it is assumed that since it was only guards Jango Fett fought to get to the reactors and the hangar, the guards likely managed to pacify the riot."}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}]}