{"url": "Ooris_Bynar", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Bounty hunters", "Category:Males", "Category:Thisspiasians"], "nodes": [{"tag": "h1", "text": "Ooris Bynar"}, {"tag": "p", "text": "Ooris Bynar was a Thisspiasian male bounty hunter active during the time of the Galactic Empire. When the former bounty hunter Nakano Lash resurfaced, Bynar intended to take the bounty on her. Syphacc, owner of Syphacc's Bountiful Bounties, was hesitant to allow Bynar to do the job, but eventually relented, though later additionally contacted famed hunter Boba Fett. Bynar chose to follow in the footsteps of fellow hunter Beilert Valance, who tracked Lash's trail to the graveyard planet Galmerah. After pursuing Lash to Ruusan, Bynar was strangled to death by Lash."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the reign of the Galactic Empire, Ooris Bynar worked as a bounty hunter, gaining a reputation for often causing a large amount of collateral damage. Around 3 ABY, the former bounty hunter Nakano Lash, who had disappeared after betraying fellow hunters in a previous mission, supposedly resurfaced, leading a number of bounties to be placed on her. One such bounty was placed by Syphacc, the owner of Syphacc's Bountiful Bounties, who Bynar attempted to get the job from. Syphacc was reluctant to allow Bynar to take the job due to the hunter's reputation, and Bynar threatened Syphacc, who relented. As Bynar departed, Syphacc, who was doubtful of his chances, contacted famed hunter Boba Fett about Lash's reappearance."}, {"tag": "p", "text": "In order to track down Lash, Bynar trailed the bounty hunter Beilert Valance, who Lash formerly mentored, watching him search a safe house in Phelar Port on Eriadu. After Valance acquired a clue to Lash's location, leaving for the graveyard planet Galmerah in his starship, the Broken Wing, Bynar followed him at a distance in another starship."}, {"tag": "p", "text": "Eventually, Bynar caught up to Lash on Ruusan. He captured Lash's companion and threatened to kill her, but was stabbed by the girl as he was taunting Lash. He was then wounded by Lash, losing one of his arms before being strangled to death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ooris Bynar was a Thisspiasian male with brown hair and green skin. The bounty hunter was aggressive, strangling Syphacc in order to take the bounty on Nakano Lash. When hunting down Nakano Lash, Bynar chose to follow fellow bounty hunter Beilert Valance, secretly insulting him for his nature as a cyborg."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "At the time of Nakano Lash's reappearance, Bynar wore a blue coat over a purple jacket and white armor, as well as gloves on one pair of hands. The bounty hunter also wore a mask on the lower face, and carried a blaster that was kept in a holster. Bynar utilized a starship when attempting to track down Lash."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ooris Bynar first appeared in Bounty Hunters 1, a comic written by Ethan Sacks, illustrated by Paolo Villanelli, and published by Marvel Comics on March 11, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}