{"url": "Oovo_IV/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Empire moons", "Category:Galactic Republic moons", "Category:Rocky moons", "Category:Tharin sector moons"], "nodes": [{"tag": "h1", "text": "Oovo IV"}, {"tag": "p", "text": "The moon Oovo IV was home to Desolation Alley, a maximum security federal prison for the Galactic Republic and a well known podrace track. It orbited the gas giant Oovo in an asteroid belt in the Outer Rim. Energy shields protected the prison and kept the atmosphere in, and access was tightly restricted. This prison was used for persons who committed severe crimes and thus were tightly guarded."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Oovo IV was the fourth moon of the gas giant Oovo. Jango Fett and Zam Wesell both attempted to recover the smuggler Bendix Fust from the heavily guarded prison. Fett entered by following in a transport into the hangar before the energy shields closed again. Losing his own ship, Jaster's Legacy, Fett stole a Firespray-class patrolship that he renamed Slave I, and escaped with Wesell to deliver Fust to Sebolto on Malastare, destroying the remaining Firesprays by firing missiles into the hangar where they were kept. The prison riot that covered their escape was eventually suppressed. Aurra Sing, after being captured by Aayla Secura, was sent to the prison but was eventually released[source?] after telling the prison officials about a bounty hunter hunting Jedi."}, {"tag": "p", "text": "Reti operated as a mercenary here prior to his involvement with Nym and the Lok Revenants."}, {"tag": "p", "text": "During the Galactic Civil War, it was the location of the Battle of Oovo IV, which involved Imperial Admiral Hurkk and at least one Rebel-owned EF76 Nebulon-B escort frigate. During the Yuuzhan Vong War, Oovo IV was decimated by the Yuuzhan Vong."}, {"tag": "h2", "text": "Security"}, {"tag": "p", "text": "The surface entrances and upper levels were guarded by armed soldiers with blasters and laser turrets. But the underground levels, where the worst criminals were kept, needed even stricter control. Thus, special riot guards patrolled those areas. These riot guards were armed with nothing but their fists, but reduced most chances of a successful riot organized from the inside as the guards were highly trained, and could cause fatal damage on anyone who attempted a breakout. During emergencies, however, these guards were free to join their fellows in using numerous crowd-suppression weapons ranging from heavy blasters to charged stun pikes. Jango Fett would eventually encounter such guards as he broke out of the prison after his mission. Some droids were used as security, hovering about 1 foot in the air."}, {"tag": "h2", "text": "Podracing"}, {"tag": "p", "text": "Due to its combination of low gravity and artificial atmosphere, podracing was extremely popular throughout the asteroid and its prison, though it was also very dangerous for the contestants. It was one of the few places where the sport had not been outlawed. Three other examples of these planets are Malastare, Aquilaris, and Tatooine. The asteroid was the setting for at least four race courses, including Vengeance, Executioner, and The Gauntlet. An exogorth lived near Executioner. The home crowd favorites were Gasgano, Fud Sang and Toy Dampner."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}