{"url": "Ooroo/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Celegians", "Category:Jedi Consulars", "Category:Jedi Masters of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ooroo"}, {"tag": "p", "text": "Ooroo was a male Celegian Jedi Master who acted as an instructor to Jedi students on the planet Ossus for a long time before the Great Hyperspace War in 5000 BBY. Ooroo's species breathed a gas, deadly to most life-forms, known as cyanogen, whereas oxygen was deadly to them. This caused the Jedi Master to depend on a crystalline life support chamber for survival on oxygen-rich worlds. Ooroo trained many students during his time as a Jedi instructor, but the Draethos Jedi Knight Odan-Urr was by far the most well known. 5,000 years before the Battle of Yavin, Ooroo sent Odan-Urr to help restore peace to the Koros system, which was ravaged by a series of Unification Wars aimed at uniting the seven planets of the system."}, {"tag": "p", "text": "During their separation, Ooroo and his apprentice were plagued by visions of long-forgotten Dark Jedi, as well as the pain and suffering the darksiders would bring the Republic. The Celegian Jedi traveled to Koros to meet with his student. Ooroo was on the planet when the Sith Empire launched their attack on the Republic. He and Odan-Urr led the forces of Teta, the Empress of the system, on Kirrek. Teta's men were overrun with Massassi warriors, so the ancient Master sacrificed himself to defeat the Sith warriors, shattering his cyanogen tank and sending the fumes into the Massassi's lungs, killing many of them instantly. He was later known as the Martyr of Kirrek for this selfless act."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi Master"}, {"tag": "p", "text": "Although Celegian Force-sensitives were exceedingly rare, Ooroo was found to be of sufficient Force sensitivity to become a Jedi, and he was trained in the ways of the Light side of the Force, eventually rising to the rank of a Jedi Master. At a small training center on the planet Ossus, Ooroo acted as a Jedi instructor, teaching a great many students in the great library of the mountainous planet. However, unlike most species, who breathed oxygen, Celegians breathed cyanogen. The yellow gas was poisonous to most forms of life. The planet on which Ooroo conducted his teaching was oxygen-rich, which meant that the ancient Jedi Master had to live in a cyanogen-filled crystalline life-support tank, which floated several feet above the ground. However, this did not affect his ability with a lightsaber, though he rarely made use of such a weapon and preferred to avoid combat. However, when violent conflict was unpreventable, he usually utilized his variety of Force-powers."}, {"tag": "p", "text": "One of his students, a young Draethos named Odan-Urr, had completed his training and become a Jedi Knight, yet remained on the planet with his master. Odan-Urr was content to study Ooroo's mass of scrolls and documents, with a particular interest in the history of the Sith as well as obscure and little-known Jedi arts. Where many of Ooroo's other trainees sought to make history, Odan-Urr was far more interested in reading history. He only ever left his studies at Ooroo's urging, and always reluctantly. Perhaps it was because of his student's peaceful temperament that Ooroo decided to send Odan-Urr to the Koros system to aid Empress Teta and her Jedi advisor Memit Nadill in their efforts to defeat the remaining rebels and pirates, bringing the final of the seven planets of the system under Teta's dominion. The experienced Nadill would also take over Odan-Urr's training during his time on Koros. Odan-Urr departed for Cinnagar in a shuttle, though he expressed his displeasure in the possibility of facing combat. Ooroo told his young apprentice that a Jedi Knight had responsibilities other than reading and studying ancient scrolls."}, {"tag": "p", "text": "Teta had successfully united the other planets in the system, but the pirates on Kirrek had managed to fend off any efforts to fight them, and had started attacking any ship that flew within distance of their weapons emplacements. Several dozen hostages had been murdered by the pirates after the last attempt to defeat them. Teta came to the conclusion that the only way to defeat the pirates was a full military assault, and she reluctantly ordered her men to carry one out, despite her fears that many lives would be lost fighting the rebels. However, Odan-Urr managed to save a great many lives with his knowledge of an obscure branch of the Force known as battle meditation, a power which Ooroo was also capable of using. Odan-Urr helped Teta's forces achieve victory, and when Ooroo heard of his apprentice's achievements, he assigned the young Jedi Knight to stay on the Koros system to help Empress Teta restore order to the new alliance of planets."}, {"tag": "h3", "text": "Visions"}, {"tag": "p", "text": "While Odan-Urr was staying on Koros, Ooroo had a vision of the ancient Sith Empire, and the war it would bring to the Republic. In the vision, Ooroo witnessed the funeral of the Dark Lord of the Sith Marka Ragnos. During the funeral, the two rivals for Ragnos's throne, Naga Sadow and Ludo Kressh, engaged in a frenzied duel. Sadow wanted to invade the Republic and expand the borders of the Sith Empire, while Kressh was content to continue to keep their existence a secret from the Jedi Order and the Republic. As the duel neared a close, the spirit of Marka Ragnos emerged, and told the two Sith that the Sith Empire was under threat, and to choose their paths wisely. Odan-Urr had the same vision on Koros. Ooroo interpreted the dream the same way as his apprentice: that, although they may be long forgotten, the Dark Jedi that were banished over a thousand years previously still posed a great threat to the Republic. Odan-Urr later went with Teta and Nadill to Coruscant, where Teta told the Senate of the dangers that lay ahead. However, the senators were highly skeptical of Teta's speech, refusing to prepare for war because of the dreams of a young Jedi. The trio left, dejected, though Teta pledged her full military support. However, a group of Jedi Knights, whom Ooroo later contacted, took Teta's pleas seriously."}, {"tag": "p", "text": "Several days later, Ooroo traveled to Koros to check on the progress of his young student. He met Empress Teta in her palace, and she told him of Odan-Urr's visions, before sending her advisor Memit Nadill to bring Odan-Urr to them. Odan-Urr arrived shortly after, surprised and delighted to see his master. The young Draethos told his master that he missed the tranquility of Ooroo's training facility. Ooroo replied that Jedi must, at times, learn action as well as knowledge. The Celegian Jedi Master then told the others that he too had been having dreams, and that their pleas in the Senate did not go unheard; three Jedi Knights believed what Teta had said to be true. Ooroo then told Odan-Urr, Nadill and Teta that if the Republic should confront the fabled Sith Empire, it would devastate and destroy what had stood for twenty thousand years before, and cross the fabric of hyperspace. Afterwards, Teta led the three alien Jedi out onto a great balcony, overlooking a massive courtyard, where the Empress's impressive forces prepared. She told them that now that she had brought peace to her home system, she would not let it fall to an outside enemy."}, {"tag": "p", "text": "Ooroo decided to stay with his apprentice on Koros, though he was absent when a young woman burst into Teta's chambers. Jori Daragon and her brother Gav had entered random hyperspace coordinates into their ship, the Starbreaker 12, and had landed on Korriban, the mausoleum planet of the Sith. The two siblings were taken in and cared for by Naga Sadow, one of the aspiring Dark Lords, and Gav was even briefly trained in the ways of the Sith. However, during a skirmish between the forces of the two competing Sith Lords, Jori was forced to leave her brother on the desert planet and flee back to the Republic. Sadow had planned this, though, and had placed a tracking signal on Jori's ship. The young Human female told them that Sadow was preparing to launch an invasion on the Republic. The Jedi knew this was the evidence that would persuade the Senate of the danger they were in, so Memit Nadill traveled to Coruscant to meet with members of the Jedi Order. Ooroo and Odan-Urr chose to wait on Koros, where Teta prepared her forces for a full-scale invasion."}, {"tag": "h3", "text": "Battle of Kirrek"}, {"tag": "p", "text": "Nadill eventually arrived on Coruscant and met with the Jedi Knights, but he was too late; Sadow's men, aided by his Sith magic illusory soldiers, attacked the capital with hundreds of warships. Meanwhile, Ooroo and Odan-Urr were stationed on local Kirrek, where they commanded Teta's forces. The pirates and rebels Odan-Urr had helped to defeat previously were supporting Teta's army in an attempt to gain amnesty for their actions during the Unification Wars. Odan-Urr was hesitant at having to face real combat, though Ooroo was able to calm him. Ooroo told his young apprentice that he himself would fight against the Sith, even though he was in his tank. The immense Koros army created a barricade around a huge citadel on Kirrek as thousands of Sith pods, each containing hundreds of warriors, were sent down onto the barren wasteland. Masses of Massassi warriors, Sith war behemoths and Sith war worms charged at Teta's forces, tasked with tearing down the citadel; the battle of Kirrek had begun."}, {"tag": "p", "text": "The battle raged on, with the Republic forces taking heavy damages. Odan-Urr had tried to use his battle meditation, to no avail; it did not seem possible to sway the purposes of the single-minded fury of the Massassi, who were routing Teta's men. The young Draethos asked Ooroo how would they fight such an enemy, and the ancient Jedi Master replied that they would fight them with the Force, to the best of their abilities. Using great wooden ladders to climb the massive wall of the Citadel, the group of Massassi broke through the defensive barricade. A young soldier of Teta's called out to Odan-Urr, who was standing still, upset at the suffering taking place around him. Odan-Urr told his master that there was no chance for victory, and that his dream had come true."}, {"tag": "p", "text": "Ooroo had foreseen these events, and had a plan prepared. As the hordes of Massassi approached Ooroo and his understudy, the old Celegian master ordered the Republic troops to retreat. Odan-Urr protested, but after stern words from his master, the Jedi Knight fell back with the soldiers. The Massassi warriors saw their enemies withdrawing, and closed in on Ooroo. The ancient Jedi Master then punctured his cyanogen-filled chamber with one of his pink tentacles, releasing the deadly gas into the atmosphere. The cyanogen poisoned and killed all of the vicious Massassi. Meanwhile, oxygen poured into Ooroo's smashed tank, slowly killing the Jedi Consular. However, even though their most powerful units had been defeated, the Sith forces continued to attack. Suddenly, dozens of giant ships appeared in the atmosphere. Although Teta's men originally thought it was another wave of Sith, they turned out to be bearing the symbol of Empress Teta; thousands of prisoners from Ronika, the prison planet of the Koros system, had been released to fight for Empress Teta. The Sith were already taking heavy losses, and this fresh batch of enemies made them retreat back to their Empire. Ooroo had still not passed away, though he was unable to move, and the oxygen was taking its toll on him. His mouth covered with part of his robes, Odan-Urr approached his master, suffering great grief. Odan-Urr told the Celegian that he wished the two could have stayed in the peaceful libraries of the training planet together, surrounded by books. Ooroo replied that he would have loved to float in the seas of his homeworld one last time. Ooroo then reassured him that he would grow old and one day die among his precious books and scrolls, and live to be one of the most ancient Jedi ever. Ooroo then passed away, and became one with the Force."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Odan-Urr helped defeat the remaining Sith forces on Kirrek, and Memit Nadill, aided by the three Jedi who had been present at the senate hall, defeated the Sith on Coruscant. Although there were great losses and damages, the war, later known as the Great Hyperspace War, had ended in victory for the Republic. Odan-Urr was glad that the Republic emerged victorious, but was extremely distressed by the loss of his master, who he would never forget. The former pirates and rebels who had fought alongside Ooroo and Odan-Urr were granted amnesty for their brave efforts in defeating the Sith. Empress Teta stayed on as the Empress, living for over one hundred and seventy-five years. Ooroo's prophecy about Odan-Urr would become true: Odan-Urr went on to become a Jedi Master and would die over a thousand years later among his books in a Great Jedi Library on Ossus, which he had founded himself. Ooroo was later given the title of the Martyr of Kirrek for his actions on the barren planet."}, {"tag": "p", "text": "As the Jedi Order solidified itself following the defeat of the Sith, the Coruscant Jedi Temple began to take shape as the headquarters of the Order. Along the Processional Way, a giant bronzium statue of Ooroo was erected alongside the likenesses of fellow Masters Arca Jeth and Odan-Urr."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ooroo was a selfless individual, and put the needs of others before his own. During the Battle of Kirrek, he punctured his life-support chamber, sacrificing his own life so that his apprentice would survive and the deadly Massassi warriors would be defeated. He had foreseen what was going to happen, and had deduced that the only way to defeat the Massassi was to release his cyanogen, which would kill him. As he lay dying, Ooroo's only regret was that, since becoming a Jedi, he had not visited the great seas of his homeworld. He used to swim there, without the cumbersome life-support chamber necessary on planets other than Celegia."}, {"tag": "p", "text": "Ooroo was also extremely encouraging to Odan-Urr. The young Jedi would have been content to stay in Ooroo's Jedi Praxeum for his entire life, reading books and studying ancient scrolls and documents, but for Ooroo's urging. The old Celegian wanted Odan-Urr, who he knew had massive potential as a Jedi Knight, to leave the library occasionally. He encouraged him to go on assignments offworld, where he was more likely to see combat and gain a better picture of what it was like to be a Jedi Knight."}, {"tag": "p", "text": "Ooroo was an old and wise Jedi Master and Jedi Instructor, with great knowledge of Jedi lore. He knew what would happen at Kirrek, and he knew what had to be done if the Republic were to be victorious. He was also correct, as was his Draethos Padawan, in his interpretations of the vivid dreams of Marka Ragnos's funeral, and the damage the Sith would inflict upon the Republic. A diplomatic Jedi, Ooroo was able to easily sense the motive of someone he was conversing with."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Ooroo preferred to avoid combat where possible, though he knew that part of a Jedi's duty was to enforce peace, which often involved fighting. However, his cumbersome life-support tank meant that he could not fight as freely as he would have been able to on his homeworld, free of his cyanogen tank. Although he did not carry one in his later years, Ooroo was entirely capable of using a lightsaber. He was also adept at using as weapons not widely used by Jedi, such as blaster pistols and primitive weapons."}, {"tag": "p", "text": "Ooroo practiced the ancient and little known Jedi art of battle meditation, which affected the morale of both allies and enemies and allowed the user to envision an outcome they desired. Battle meditation simultaneously lowered the morale and spirit of enemy soldiers and heightened the morale of the user's forces, which gave victory to one side and lowered the death count of battle. However, the one drawback of this was that broken-spirited hostiles could become desperate, and, rather than surrender, attempt to take down as many of the other side as possible. Boosting morale was not the only advantage of the power, however. The user could imagine things in their mind, which, if the power was utilized properly, would become a reality. This meant that a Jedi skilled in battle meditation could almost choose the outcome of the battle that suited them."}, {"tag": "p", "text": "Ooroo was also a master of Force sense, which granted the user the ability to extend his senses through the Force and gain a great awareness of his surroundings. Other powers known to be used by Ooroo were Force alter and control; he also had the ability to heal himself and others, and could telekinetically move objects with the Force."}, {"tag": "p", "text": "Ooroo's species, known as Celegians, did not have a spoken language; they communicated with each other telepathically, and they could use their telepathy to talk to other sentients up to five hundred meters away. This ability could only be used for communication; Celegians could not access others' memories or thoughts. In addition to his natural telepathy, Ooroo could speak Galactic Basic Standard. Because Celegians were extremely rare in the Jedi Order and off their homeworld generally, and because most species could not respond to a Celegian's telepathic messages, Ooroo generally spoke Basic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ooroo was created by Star Wars author Kevin J. Anderson for the sub-series The Golden Age of the Sith, which is part of the Tales of the Jedi comic series. He appeared again in the subsequent story arc The Fall of the Sith Empire, which was also written by Anderson. He was drawn by Dario Carrasco, Jr. in both story arcs, with three other artists acting as inkers. His backstory was later expanded upon in the Power of the Jedi Sourcebook, written by several authors, with additional art by Jeff Carlisle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}