{"url": "Oolth", "categories": ["Category:Legends articles", "Category:Black Sun members", "Category:Clerical workers and assistants", "Category:Fondorians", "Category:Males"], "nodes": [{"tag": "h1", "text": "Oolth"}, {"tag": "p", "text": "Oolth was a Fondorian male servant of Black Sun and the only survivor of Darth Maul's attack on Black Sun's Ralltiir fortress in 33 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Black Sun"}, {"tag": "p", "text": "A Fondorian male, Oolth served as secretary to the head of Black Sun, Alexi Garyn, in the time immediately preceding the Invasion of Naboo. Perpetually in the company of his master, Oolth was attendant, taking notes, as Black Sun enforcer Asa Naga recounted Darth Maul's attack on Vigo Darnada's station to the assembled remaining Vigos. As Darth Maul commenced his assault on the fortress, Oolth accompanied his master and his bodyguard from the citadel to escape to Corellia, leaving the remaining Vigos and guards behind to stall Maul. However, before the executive yacht could be reached, Maul caught up and slew both Garyn and his bodyguard. Oolth slunk away silently to hide and was ignored by Maul, whose primary target was Garyn. He was the only known individual to survive the massacre on Ralltiir."}, {"tag": "h3", "text": "Death on Coruscant"}, {"tag": "p", "text": "Afterward, Oolth attempted to hide on Coruscant and inform the Jedi Order about the existence of Darth Maul. Jedi Padawan Darsha Assant was ordered to find and escort him to the Jedi Temple, intended as a trial in her quest for Knighthood. Though Oolth was located, hiding out in the undercity, the two were attacked by a gang known as the Raptors before they could reach Darsha's skyhopper. In an attempt to escape, Assant activated her elevation belt and, for a moment, the pair evaded danger and approached the safety of the upper levels. Unavailingly, they were then assailed by hawk-bats, which gouged out Oolth's right eye. He tried to defend himself only to lose his grip and fall into the abyss of the undercity. He was presumed dead and, when Assant and her master returned to the scene, his body had disappeared, already scavenged by the hunters that roamed Coruscant's lower levels."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Oolth was constantly shadowed by a small hovering droid, presumably an assistant in the mechanical aspects of his position as secretary."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Though a useful and intelligent secretary, Oolth was notably a coward, abandoning even his master when he saw Garyn's bodyguard slain. Like many Fondorians, he saw himself as a superior organism in all ways and showed no compassion for other beings, especially the indigent. He showed little thanks even when rescued from mortal peril and seemed logically concerned only with his survival with the littlest possible effort on his own part."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}