{"url": "Opening_crawl", "categories": ["Category:Real-world articles", "Category:Films", "Category:Star Wars culture"], "nodes": [{"tag": "h1", "text": "Opening crawl"}, {"tag": "p", "text": "The Star Wars opening crawl is the famous opening to the Star Wars saga."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Each of the nine episodic Star Wars films begins with nearly identical openings, in which the text \"A long time ago in a galaxy far, far away.…\" is displayed, followed by the Star Wars logo over a field of stars. A subsequent downward tilt reveals the film's episode number, the subtitle in all-capital letters, and a three-paragraph summary of events immediately prior to the events of the film."}, {"tag": "p", "text": "Two typefaces were used in the crawl: In current releases of episodes I–III and VI, News Gothic bold is used for the main body of the crawl and episode number, and Univers light ultra condensed for the titles of the films. In the current releases of Episodes IV–V and VII, News Gothic bold is used for the main body of the crawl and episode number, but varied versions of the News Gothic font are also used for the titles of the films."}, {"tag": "p", "text": "In the widescreen (or letterbox) versions of the Star Wars films, each line of the opening crawl text appears directly in its entirety from the bottom of the screen (with the exception of The Empire Strikes Back). In the fullscreen (or pan and scan) versions, the sides of each line of opening crawl text are visible only after that line reaches the center of the screen. The pre-1995 fullscreen version of Return of the Jedi opted to present the opening crawl unsqueezed, having the entire widescreen image appear in a 4:3 frame horizontally compressed."}, {"tag": "h2", "text": "Differences"}, {"tag": "p", "text": "Though each crawl is roughly similar, the individual films contain some differences in their presentation. For instance, in Episode II: Attack of the Clones, the camera tilts upwards after the text finishes, rather than downwards as seen in all of the eight other films."}, {"tag": "p", "text": "Some words or names are in all-capital letters to stress their importance to the story. The text is in simple, yellow, sans-serif type, and it is pitched at a sharp angle. The text scrolls upward into the distance, toward a horizon located just below the top of the screen. In a trademark of the film series, each title crawl ends with a four-dot ellipsis except for Episode VI, which ends with a three-dot ellipsis."}, {"tag": "p", "text": "When originally released in 1977, the first film was simply titled Star Wars, as Lucas was not certain if he would follow the film with a sequel (and 20th Century Fox felt that alluding to a nonexistent \"previous episode\" would be too confusing). Following The Empire Strikes Back, the film was re-released on April 10, 1981, with the subtitle Episode IV A New Hope. The original version, without the subtitle, was not released, outside of the 1982 Laserdisc version, on home video until the 2006 limited-edition DVDs."}, {"tag": "p", "text": "The content of the opening crawl itself, as originally written by George Lucas, was initially different during the production of the first film, and contained the following:"}, {"tag": "p", "text": "The crawl used in the film itself was a revised version by Brian DePalma and then–film critic Jay Cocks."}, {"tag": "h2", "text": "Non-Saga Exceptions"}, {"tag": "p", "text": "The Clone Wars introductory movie, Star Wars: The Clone Wars (2008), and Anthology Films, Rogue One: A Star Wars Story (2016) and Solo: A Star Wars Story (2018), all theatrically debuted without opening crawls."}, {"tag": "p", "text": "All three include \"A long time ago in a galaxy far, far away.…\" Rogue One then cuts straight to a cold open displaying a shuttle bound for a ringed planet. The Clone Wars uses a newsreel-style narrator in lieu of a crawl. Solo features backstory summaries similar to a crawl's content; these paragraphs are shown in a similar typeface and color to \"A long time ago…\" over shots of a planet's dockyards and before the title card."}, {"tag": "p", "text": "Legends made-for-TV movies (the Holiday Special, Caravan of Courage, and Battle for Endor) contain neither the crawl nor the \"A long time ago.…\" card, either starting immediately with action or a title card."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "The roll-up (alternatively called the \"crawl\") is an homage to the opening crawl at the beginning of each episode of the Flash Gordon serials of the 1930s and 1940s, which Star Wars creator George Lucas enjoyed as a child and which inspired Lucas to write much of the Star Wars saga. It is also for this reason that many of the subtitles of the films have a \"pulpy\" sound to them or are reminiscent of the Gordon serials."}, {"tag": "p", "text": "In a 2005 interview, George Lucas described how the final phrasing of the roll-up in Star Wars came about: \"The crawl is such a hard thing because you have to be careful that you're not using too many words that people don't understand. It's like a poem. I showed the very first crawl to a bunch of friends of mine in the 1970s. It went on for six paragraphs with four sentences each. Brian De Palma was there, and he threw his hands up in the air and said, 'George, you're out of your mind! Let me sit down and write this for you.' He helped me chop it down into the form that exists today.\""}, {"tag": "p", "text": "According to Dennis Muren (who worked Episodes I–V), on the audio commentary track of the 2004 original trilogy DVD release, the roll-ups on the original trilogy films—A New Hope, The Empire Strikes Back, and Return of the Jedi—were accomplished with physical models laid out on the floor. Muren says the models were approximately two feet wide and six feet long. The crawl effect was accomplished with the camera moving longitudinally along the model. It was, says Muren, difficult and time-consuming to achieve a smooth scrolling effect."}, {"tag": "p", "text": "With the advent of computer-generated graphics, the roll-ups for the prequel trilogy films—The Phantom Menace, Attack of the Clones, and Revenge of the Sith—were achieved much more quickly. However, because nobody had taken notes on how the original ones were accomplished, the design team had to rewatch and piece together the elements to make the new opening crawl."}, {"tag": "h2", "text": "Film crawls"}, {"tag": "h2", "text": "In other Star Wars media"}, {"tag": "p", "text": "The West End Games roleplaying game supplement Galaxy Guide 1: A New Hope suggests that the opening crawl from A New Hope was actually written by Rebel Alliance historian Voren Na'al to end his account of the events surrounding the Battle of Yavin. The account includes the phrase, \"A long time ago, in a galaxy far, far away…\""}, {"tag": "p", "text": "A large number of LucasArts computer and video games feature an opening crawl. Games based on one of the films usually include the same crawl as the movie, while other games have original crawls. Some of the games' crawls differ from the traditional film versions. Star Wars: TIE Fighter plays The Imperial March over the crawl, while Rebel Assault uses a spoken version, starting with the first paragraph from A New Hope and differing afterward. Dark Forces has an unused spoken version in its cutscene data. The Phantom Menace video game begins with the film's crawl but features a second, original one partway through the game. The LEGO Star Wars games include an opening crawl at the beginning of each chapter, with five to six chapters per movie."}, {"tag": "p", "text": "An opening crawl plays when a character is loaded for the first time in Star Wars: The Old Republic. A shortened variation plays every subsequent time a character is loaded, recapping the story so far."}, {"tag": "p", "text": "A number of Dark Horse's Star Wars comics have used the same format as the opening crawl to serve as a recap of the previous events in the series. These series include Star Wars: Dark Empire, Tales of the Jedi and many others. Opening crawls also appear in the post-2014 Marvel Comics Star Wars comics, serving to either introduce a story arc or recap events as in the Dark Horse comics."}, {"tag": "p", "text": "The original edition of the novel Heir to the Empire included a still-image version on its back cover."}, {"tag": "p", "text": "Jeffrey Brown's non-canon Star Wars: Jedi Academy, Darth Vader and Son, and Vader's Little Princess book series use the opening crawl."}, {"tag": "p", "text": "All of the sourcebooks and adventure books are written for Fantasy Flight Games's Edge of the Empire, Age of Rebellion and Force and Destiny roleplaying games include an introductory crawl at the beginning."}, {"tag": "p", "text": "With a few exceptions, most canon novels published since April 25, 2014, include a page before the beginning of the novel with a passage providing background or contextual information, written in a similar style to the opening crawl. The Star Wars: The High Republic multimedia project also has an opening crawl."}, {"tag": "h2", "text": "Parodies"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}