{"url": "Operation:_Cinder", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles in need of updating", "Category:Operation: Cinder"], "nodes": [{"tag": "h1", "text": "Operation: Cinder"}, {"tag": "p", "text": "Operation: Cinder was the code name for the orbital bombardment campaign devised by Galactic Emperor Darth Sidious, who sought to punish the Galactic Empire for failing to prevent his death. Following the Emperor's demise during the Galactic Civil War in the Battle of Endor in 4 ABY, his posthumous instructions were relayed to loyal Imperial officers by sentinel messenger droids. They targeted various planets across the galaxy, including Burnin Konn, Candovant, Abednedo, Commenor, and Nacronis, as well as Vardos, a world known for its loyalty to the Empire, and the Emperor's homeworld of Naboo. Although Naboo was saved during the Battle of Theed, Vardos was devastated by satellites that ravaged its ecological balance. Operation: Cinder was the first part in the Emperor's Contingency; the Empire was to be rebuilt in the Unknown Regions while Sidious was secretly revived on Exegol."}, {"tag": "p", "text": "The plan was undermined by Grand Admiral Rae Sloane, who killed the Emperor's protégé, Fleet Admiral Gallius Rax during the Battle of Jakku in 5 ABY. The widespread destruction caused by Operation: Cinder also resulted in Iden Versio and Del Meeko—Imperial Special Forces commandos of Inferno Squad—defecting to the New Republic Defense Force. Despite these setbacks, the Contingency succeeded in ensuring the Empire's revival as the First Order, a military junta determined to recapture the Imperial legacy by ending the New Republic Era."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Emperor Palpatine, ruler of the Galactic Empire and secret Dark Lord of the Sith, believed that if he was to ever perish unexpectedly then the Empire did not deserve to live beyond him. He likened it to the strategy game of Shah-tezh, in which the role of each game piece was to protect an Imperator. If the Imperator was to fall, then the surviving game pieces had failed and the game was over, as the others did not deserve to carry on. As a result of that belief, he entrusted Gallius Rax, who knew Palpatine since Rax was a small child before rising to the rank of Fleet Admiral in the Imperial Navy, with carrying out a Contingency plan that called for the annihilation of the Empire and its enemies. The Contingency also further called for the Empire's rebirth, however, by allowing a select group of Imperial survivors to regroup in the Unknown Regions where they would rebuild the Empire."}, {"tag": "p", "text": "In 4 ABY, Emperor Palpatine was believed to have been killed by Darth Vader during the Battle of Endor, leaving the Sith extinct. The Contingency was activated soon after. As part of the plan, several worlds were targeted for destruction through an orbital bombardment campaign that was code named Operation: Cinder. Messenger droids were sent to select Imperial officers to relay the last orders of the Emperor—to begin Operation: Cinder at once."}, {"tag": "h2", "text": "The Operation"}, {"tag": "h3", "text": "Target: Vardos"}, {"tag": "h4", "text": "Acquiring satellites at Fondor"}, {"tag": "p", "text": "After the Battle of Endor, Iden Versio, Commander of the Imperial Special Forces commando unit Inferno Squad, was summoned by her father, Admiral Garrick Versio, aboard the Eviscerator in orbit of Vardos to receive her next orders. She received her orders via a Messenger droid carrying the Emperor's last command, though she was suspicious of what Operation: Cinder entailed. Inferno was sent to an Imperial shipyard above Fondor to provide security for Moff Raythe, who was procuring and transporting satellites that were crucial to Operation: Cinder, although Inferno was not informed of the target of the satellites. During this time, the Rebel Alliance attempted an assault on the Dauntless, but their MC80 Star Cruiser flagship was ultimately destroyed by Inferno."}, {"tag": "h4", "text": "Deployment of the satellites and Inferno Squad's defection"}, {"tag": "p", "text": "After securing Raythe's satellites and destroying the Emperor's Observatory on Pillio, Iden and Inferno Squad returned to Vardos, an Imperial haven and the homeworld of the Versio family. Upon arrival, they noticed the experimental satellites they had protected at Fondor deployed in the planet's upper atmosphere along with the Dauntless itself, the flagship of Raythe. Now aware of their target, Iden confronted her father aboard the Eviscerator, furious that their own homeworld was a target of Operation: Cinder despite its loyalty to the Empire. In response, Admiral Versio stated in his point of view of Operation: Cinder that, for the greater good of the Empire, Vardos and other worlds had to be sacrificed so that the utter fear and brutality would prove beyond a doubt to the galaxy that the Empire was still in charge. Garrick then ordered for the satellites to be activated, spawning massive electrical storm systems within minutes. Whilst the storm systems laid waste to the planet surface, anti-air batteries shot down any non-Imperial ships attempting to leave in order to contain them on Vardos."}, {"tag": "p", "text": "Iden and Inferno Squad were ordered by Garrick to extract Protectorate Gleb alone from the planet and bring the Aqualish to him. However, at the Archive in Kestro City, Iden and Del Meeko attempted to bring along other civilians with them to transport them off world. Agent Gideon Hask, refusing to disobey Garrick's command, attempted to prevent this from happening, but was unable to stop the civilians from fleeing to the Corvus. Iden claimed that the Empire's job was to protect civilians from things like Operation: Cinder; Hask responded that this was the \"new Empire,\" prompting Meeko to state that he sought no part in this \"new Empire\" and would follow the orders of his commanding officer, Iden. When Hask refused to lower his blaster and aimed it at Iden, she shot him first in his leg. Hask returned alone to Garrick with Gleb and a Rodian while Iden and Del escaped aboard the Corvus with their crew, jumping into hyperspace to the Outer Rim Territories. There, they decided to formally surrender themselves to the Rebel Alliance."}, {"tag": "h3", "text": "Target: Naboo"}, {"tag": "p", "text": "Not long after the Battle of Endor, Captain Lerr Duvat of the Star Destroyer Torment was approached by a Messenger droid, which relayed the Emperor's final command: to begin Operation: Cinder at once. Twenty days after the Battle of Endor, Duvat's Star Destroyer was relocated to Naboo and launched satellites in orbit to form a climate disruption array. The array was used to create massive hurricanes and electrical storms across the planet. By the time the array's power reached twenty percent efficiency, three class-five hurricanes were already formed—with another dozen forming. As fires, flooding, and chaos ripped across the surface of the planet, Lieutenant Shara Bey of the Alliance to Restore the Republic—who accompanied Princess Leia Organa to Naboo, where Organa rallied the support of Queen Sosha Soruna in establishing the New Republic—realized that satellites had to be behind the phenomenon. The only means Naboo had of fighting back was to scramble starfighters to destroy the satellites."}, {"tag": "p", "text": "Bey was placed in command of the mission, with Organa and Soruna accompanying her. The Emperor demilitarized Naboo many years earlier, but a few N-1 starfighters remained in storage from the Battle of Naboo decades earlier. Once in orbit, Bey destroyed a number of the satellites while Organa and Soruna dealt with TIE fighters dispatched from the Torment. The three pilots were outgunned against seventy-two TIE fighters and were nearly killed until General Lando Calrissian arrived with a Rebel fleet, along with Danger Squadron, whose newest members were Iden and Meeko, former Imperial commandos who provided key intel to the Alliance about Operation: Cinder. The Alliance had also gathered intelligence of Operation: Cinder during a raid at an Imperial Security Bureau complex at the Wretch of Tayron, allowing them to move their forces to Naboo in time to help save the planet."}, {"tag": "p", "text": "Though Danger Squadron was able to destroy the satellites and cripple the Star Destroyer in orbit of Naboo, surviving Imperial forces, following standard protocol, evacuated to the nearest safe haven: Theed, the capital city of Naboo. There, Danger Leader Shriv Suurgav, Iden, and Meeko met up with Organa, who covered Meeko as he repaired Theed's defenses. Once rebel forces were inside the royal palace, the defense system was activated, sending an ionic disruption across the city that disabled all blasters and starfighters, forcing the remaining Imperials to surrender. Afterwards, Organa confronted Iden and Meeko over the damage that they had done to the Alliance in the past. Iden apologized on behalf of them, and wished to continue to fight with the Alliance in order to continue the fight against Operation: Cinder and the new Empire. Organa complimented them on being images of hope for the galaxy, and formally welcomed them to the New Republic, which Inferno Squad was integrated into."}, {"tag": "h3", "text": "Target: Burnin Konn"}, {"tag": "p", "text": "In the aftermath of the Battle of Endor, Burnin Konn was locked down by Governor Ubrik Adelhard in an Iron Blockade that promulgated propaganda claiming that reports of the Emperor's death were in fact lies. As a result, Burnin Konn's underworld operatives had begun to foster their own uprising against the Empire, seeking alliances with other worlds affected by the blockade. Around three months after the Battle of Endor, the Empire sent Valin Hess and at least one division to carry out the operation on the planet. During their attack, one of the cities attempted to resist, coming in the form of civilians who sought to defend their homes. In response, Valin Hess ordered the city to be wiped out, an action which caused the loss of many civilians and his entire division, the latter of which numbered somewhere between 5,000 to 10,000, a staggering loss carried out within moments. Among the attack's survivors were a sniper named Migs Mayfeld and Hess himself."}, {"tag": "h3", "text": "More targets"}, {"tag": "p", "text": "Three months after the Battle of Endor, the Empire continued to carry out Operation: Cinder on countless worlds. A dozen other worlds were targeted or still being targeted, including Burnin Konn, Candovant, Abednedo, Commenor, Nacronis, and Senthrodys, which endured the shattering of its crust. The Republic was able to determine the purpose of many of these attacks, though they found that the Empire's motivations behind others were less clear. Nonetheless, Republic forces were able to save untold numbers of civilians as a result of combating the Imperial operation. Despite that, it would still be many months until the war came to an end, with Admiral Gial Ackbar and General Crix Madine seeing no end to hostilities with the Empire in the short-term."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Naboo was targeted by the Empire again during the Naboo invasions in an attempt to wipe out New Republic forces on the planet, but the Republic was able to thwart these attacks as they had done with Operation: Cinder. The final phase of the Contingency was ultimately carried out in 5 ABY, as New Republic forces attacked the Empire, assembled on Jakku by Counselor Gallius Rax, during the Battle of Jakku. Using the power of ancient Sith artifacts buried in the surface, Rax sought to carry out the final part of Palpatine's Contingency by corrupting the planet's core and life essence with the dark side, thus destroying the desert planet and wiping out both the Imperial and Republic forces, crippling both sides. The Contingency was thwarted, however, by Grand Admiral Rae Sloane, who further sought revenge against Rax after he removed her from power. She killed Rax, though in his dying breaths, he urged Sloane to regroup with select Imperial officers and loyalists in the Unknown Regions and begin the Empire anew."}, {"tag": "p", "text": "Sloane's actions undermined Operation: Cinder. Nevertheless, by taking Rax's place as leader of the Imperials who escaped into the Unknown Regions, she became part of the foundation of the First Order. As a result, the Emperor's Contingency proceeded according to his plan to return to power."}, {"tag": "p", "text": "The Republic emerged victorious during the battle and signed the Galactic Concordance with the Empire's Grand Vizier, Mas Amedda, bringing an end to the Galactic Civil War. However, in the Unknown Regions of the galaxy, Sloane, Brendol Hux, and other Imperial loyalists formed the First Order, seeking to one day reclaim the Imperial legacy as they plotted their return to power."}, {"tag": "p", "text": "On Morak in 9 ABY, Valin Hess would offer a toast to Operation: Cinder with Din Djarin and Migs Mayfeld, who were both undercover, unbeknownst to Hess, infiltrating the Imperial base. He noted that the rhydonium Mayfeld and Djarin had brought in would actually help the Imperial Remnants carry out operations even bigger than that of Operation: Cinder.  Mayfeld, having fostered regret and misgivings about his role in Operation: Cinder decided to shoot and kill his former superior then and there, which forced him and Djarin to fight their way out of the base and eventually leading Mayfeld to decide to detonate their rescued batch of rhydonium causing a chain reaction of explosions that brought forth significant damage to the base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Operation: Cinder first appeared in the second issue of the Marvel comic book series Star Wars: Shattered Empire, written by Greg Rucka, and released on October 7, 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}