{"url": "Operation_Cobolt", "categories": ["Category:Legends articles", "Category:Battles in the Atrivis sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Operation Cobolt"}, {"tag": "p", "text": "Operation Cobolt, also known as the Cobolt Offensive, was the military codename for a hit-and-run assault against an Imperial facility by the Rebel Alliance."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Ordered into effect by Commander-in-Chief Mon Mothma at the 251st Meeting of the Alliance High Command, Operation Cobolt was planned by General Crix Madine an executed by Colonels Anna Seertay, Gharon, and Toombs. The objectives of the mission were to capture a new Imperial Intelligence Scandoc coding computer and to subsequently destroy the base. The target was an Imperial space facility orbiting Mantooine in the Atrivis sector. The mission was a coordinated effort between Alliance Special Forces, Starfighter Command and Atrivis Sector Forces."}, {"tag": "h2", "text": "The operation"}, {"tag": "p", "text": "A team of Infiltrators, posing as an Imperial supply crew, enter the facility ahead of the assault. As Alliance starfighters attacked the base to draw TIE Fighters away and cause confusion, the Infiltrators disabled the facility's shields, communications and defense systems. With the perimeter defenses down, an assault shuttle and supporting Marines blasted the cargo bay blast doors, allowing a Wolden-class shuttle carrying the assault team to land in the cargo bay."}, {"tag": "p", "text": "Three assault teams, each with 20 Special Forces Marines, two Heavy Weapon teams, two Techs and one medic, took the operational initiative from there. The first team, designated Black Team, disabled the facility's power station, while the second, White Team, led the assault against the Intelligence Center that house the Scandoc. Red Team was held in reserve. White Team succeeded in securing the Scandoc, but required the aid of Red Team as Imperial defenses stiffened. Black Team also succeeded, but was overwhelmed by enemy Stormtroopers and cut down. The teams made their way back to the cargo bay as the TIE Fighters began to retreat towards the base. The remaining Alliance forces boarded their craft and fled. Without power, the base drifted into Mantooine's atmosphere and was destroyed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Total losses included thirteen starfighters and pilots, four damaged starfighters, and sixty eight soldiers, including Colonels Seertay and Toombs, producing almost 62% losses for Special Forces."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}