{"url": "Operation:_Thunderstroke", "categories": ["Category:Legends articles", "Category:Battles in the Lahara sector", "Category:Battles of the Second Imperial Civil War"], "nodes": [{"tag": "h1", "text": "Operation: Thunderstroke"}, {"tag": "p", "text": "Operation: Thunderstroke was the code name for a mission sanctioned by Imperial Regent Morlish Veed that involved ambushing a secret meeting scheduled between exiled Galactic Emperor Roan Fel and members of the Jedi Order. Led by Moffs Rulf Yage and Fehlaaur'aitel'loro aboard the War Hammer, the Imperials' primary objective was to capture Fel, so that he might stand trial and be sentenced to execution, effectively ending the resistance movement of his exiled forces."}, {"tag": "p", "text": "The operation was planned to be carried out by the First Sith Imperial Strikeforce, a unit of the Imperial Navy formed by members of the One Sith, who would lead Skull Squadron from their Fury-class starfighters. The strikeforce failed to complete its prime objective, as Emperor Fel eluded capture. However, the Sith were successful in capturing Princess Marasiah Fel."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "When the rumors of Darth Krayt's death reached to the remnants of the Jedi Council, the surviving Jedi decided to join the fight alongside the newly formed coalition between Fel's resistance and the surviving Galactic Alliance forces led by Gar Stazi. Agamar, an agricultural world on the edge of the Fel-controlled space, was selected to be the location of the meeting."}, {"tag": "p", "text": "Through the Sith, intel of this rendezvous reached Imperial Regent Veed, who planned an attack in order to capture Roan Fel and his daughter so the deposed monarch would undergo public trial an execution. Veed hoped that by eliminating Fel, his Empire-in-exile would inevitably crumble. Veed named the operation \"Operation: Thunderstroke\" and ordered Moffs Yage and Fehlaaur to oversee it and command the First Sith Imperial Strikeforce, a Navy unit composed by pilots of the One Sith. Yage himself, however, resented having to lead what he considered \"monsters\"."}, {"tag": "p", "text": "Under the protection of his Imperial Knights, Fel landed on Agamar to await the Jedi delegation, which was composed by Jedi Masters K'Kruhk, also a member of the Jedi Council, Rasi Tuum and Hira, as well as Jedi Knight Shado Vao. Both parties dressed in the manner of Agamar's farmers to prevent recognition, though the Imperials were already en route. The Jedi agreed to cooperate with Emperor Fel and Admiral Gar Stazi and coordinate their attack with them. In retribution, both Bastion and Stazi's forces would give safe haven to the Jedi."}, {"tag": "p", "text": "Moff Nyna Calixte arrived to Agamar to warn the allies, landing her starfighter at a distant farm so as not to alarm either party. Paying a native farmer to hide her vessel, Calixte proceeded to the meeting aboard a borrowed Agamarian beast, disguised in the farmer's cloak and hat."}, {"tag": "p", "text": "The Imperial Knights sensed Calixte approaching and opened fire against her, having considered her a threat. Emperor Fel recognized her and ordered the shooting to stop. Surrounded by lightsabers, Calixte warned both parties that the Sith knew of the meeting and would be arriving at any moment to hunt down Emperor Fel."}, {"tag": "p", "text": "At that precise moment, the Sith forces, led by Yage's Pellaeon-class Star Destroyer, the War Hammer, emerged from hyperspace and engaged Fel's own Star Destroyer, the Dauntless."}, {"tag": "h2", "text": "The operation"}, {"tag": "p", "text": "The War Hammer deployed its squadrons of Sith-Imperial starfighters and Sith Furies to attack the Dauntless as well as the delegations on the planet's surface. Aboard the Dauntless, Admiral Tohri Challon ordered her crew and pilots to attack the Sith Imperial forces in order to buy time for Emperor Fel to escape."}, {"tag": "p", "text": "As the space battle progressed, several of the Fel loyalist pilots ejected from their damaged Predator starfighters to save their lives. However, Darth Rauder, the Sith Lady in command of the strikeforce pilots, ordered Captain Gunn Yage to eliminate them as well. When Yage refused to follow Lady Rauder's orders, the Sith threatened to kill her with the Force if she did not comply. Rauder employed her telekinetic abilities to exert pressure within Yage's head, causing her to bleed from nose and eyes. However, to save Yage's life, Lieutenant Tev Rimon fired at the pilot, much to the anger of Lady Rauder, who wanted Yage to personally shoot at the enemy pilots and threatened to kill Rimon if he defied her orders again."}, {"tag": "p", "text": "As Emperor Fel prepared to escape, the delegations were attacked by a group of several Sith, amongst them a Dashade, a Zabrak, and a Devaronian. The Jedi and the Imperial Knights fought side by side to protect Emperor Fel so he could reach his shuttle, the Defender One, killing some of the attacking Sith in the process. However, Master Hira perished when a Nautolan Sith struck her with Force lightning."}, {"tag": "p", "text": "Fel reached his shuttle alongside Masters Antares Draco and Treis Sinde while Princess Marasiah Fel, Imperial Knight Azlyn Rae and Master Rasi Tuum held off the enemy. Before the three could enter the shuttle, however, a number of enemy fighters approached. Though Master Draco desired to rescue the Princess, Master Sinde reminded him that the Emperor's safety was his priority and that they had to get off the planet. As Fel, Rae and Rasi Tuum were overwhelmed by the enemy fire, Draco ordered the shuttle's pilot to evacuate."}, {"tag": "p", "text": "In space, the War Hammer had inflicted heavy damage to the Dauntless, whose shields had already failed. However, Admiral Tohri Challon ordered her crew to keep on fighting until the Emperor's shuttle had made the jump to hyperspace. The shuttle successfully escaped but the Dauntless was destroyed. Admiral Challon, her second in command, Captain Basile, and the entire crew of the Star Destroyer perished."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Though the main objective of the operation was not achieved, the battle was not a defeat for the Sith Empire. The War Hammer managed to destroy the Dauntless, depriving Fel's fleet of a valuable starship as well as a loyal Admiral, while the Sith sent to the planet succeeded in achieving the mission's second objective: the capture of Princess Marasiah Fel. Alongside Princess Sia, Azlyn Rae and her former Master, Rasi Tuum, were captured as well."}, {"tag": "p", "text": "Emperor Fel managed to escape to hyperspace alongside Antares Draco and Treis Sinde, thanks to the efforts of his Knights and particularly the deaths of Admiral Challon and her crew. Once safe in hyperspace, Fel saluted the noble sacrifice of his soldiers, which he had witnessed as the Defender One flew above the War Hammer. The Force also allowed Fel to sense that his daughter had survived the attack and that she was in custody of the Sith. He ordered Master Draco to save her, a task Draco swore to complete."}, {"tag": "p", "text": "It was later revealed that the one who betrayed Fel to the Sith was Hogrum Chalk, the Emperor's brother-in-law and the Imperial Knights' master armorer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}