{"url": "Open_Circle_Fleet", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Galactic Republic fleets", "Category:Ships of the Open Circle Fleet"], "nodes": [{"tag": "h1", "text": "Open Circle Fleet"}, {"tag": "p", "text": "The Open Circle Fleet, also known as the Open Circle Armada, was an armada in the Galactic Republic's Navy. During the Clone Wars against the Confederacy of Independent Systems, the fleet fought against the Confederacy navy in several engagements, including the Battle of Ringo Vinda, the invasion of Scipio, and the Battle of Coruscant. The Fifth Fleet was part of the armada, as was the task force of Jedi General Anakin Skywalker."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Open Circle Fleet, also known as the Open Circle Armada, was led by Jedi High Council member and Jedi General Obi-Wan Kenobi. The Open Circle was composed of several units, including the task force of Jedi General Anakin Skywalker as well as the Fifth Fleet. Clone Flight Squad Seven was the armada's most prominent ARC-170 starfighter squadron, which was one of several that were part of the Open Circle Fleet, alongside Red Squadron."}, {"tag": "p", "text": "During the Battle of Ringo Vinda, the armada deployed at least twenty Venator-class Star Destroyers, including the flagship of Skywalker, at least three Acclamator-class assault ships, at least three Arquitens-class light cruisers, and at least two Consular-class cruisers, including medical frigate 517."}, {"tag": "p", "text": "Skywalker's task force itself consisted of at least three Venator-class Star Destroyers including his flagship, and two Arquitens-class light cruisers. By the Battle of Coruscant, many Republic vessels belonged to the Open Circle Armada."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Open Circle Fleet, also referred to as the Open Circle Armada, was formed as a naval armada of the Republic Navy by the time shortly after the First Battle of Geonosis and included the task force of Jedi General Anakin Skywalker. During the Ringo Vinda campaign, Skywalker's task force blockaded the planet and its space station against Separatist Admiral Trench's forces."}, {"tag": "p", "text": "All Open Circle Fleet units included at least twenty Venator-class Star Destroyers and many other support ships. Clone navigation officers of the Open Circle Fleet were later in 79's on Coruscant during the hunt for CT-5555 \"Fives\". Skywalker's task force later participated in the invasion of Scipio, and fought against the flotilla commanded by Separatist Head of State Count Dooku."}, {"tag": "p", "text": "By the time of the Battle of Coruscant, which the fleet also participated in, many warships were part of the Open Circle Fleet. The Fifth Fleet was also part of the naval group. The Open Circle Armada proceeded to participate in the Outer Rim Sieges till the end of the war. The fleet's Clone Flight Squad Seven was assigned to rescue Supreme Chancellor Palpatine from the Separatists, and escorted Jedi Generals Skywalker and Kenobi on their way to the Separatist flagship, the Invisible Hand."}, {"tag": "p", "text": "At least one cruiser of the Open Circle Fleet, the Tribunal, also participated in the aftermath of Siege of Mandalore, deploying the newly created 332nd Division into battle against the forces of former Sith Lord Maul. Upon successful conquering of the planet, the cruiser then departed Mandalore for Coruscant with a captive Maul restrained onboard. En-route, however, Order 66 was enacted and the entire clone crew turned on Ahsoka Tano, who had left the Jedi Order but was acting as an informal advisor and commander of the division. In the ensuing skirmish, Maul was freed and tore the cruiser out of hyperspace by destroying its hyperdrive, causing it to crash on the surface of a nearby moon and killing all aboard save Maul, Ahsoka and Captain Rex, who managed to evacuate the doomed vessel shortly before it crashed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Open Circle Fleet first appeared in the movie Star Wars: Episode III Revenge of the Sith, and was first canonically identified in the 2016 edition of Star Wars: Complete Locations. It was first identified as the Open Circle Armada in the 2018 edition of Star Wars: Complete Vehicles."}, {"tag": "p", "text": "Kevin Jenkins used the Open Circle Fleet symbol on concept art of Resistance RZ-2 A-wing interceptors he drew for Star Wars: Episode IX The Rise of Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}