{"url": "Operation_Handoff", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles in need of updating", "Category:Battles in the Lothal sector", "Category:Missions of the Galactic Civil War", "Category:Missions of the Ghost"], "nodes": [{"tag": "h1", "text": "Operation Handoff"}, {"tag": "p", "text": "Operation Handoff was a mission undertaken by the rebels to protect Senator Mon Mothma, who publicly condemned the reign of Emperor Palpatine, and ferry her to Dantooine. These events sparked the official formation of various rebel cells into the Alliance to Restore the Republic, with a skirmish occurring in the Archeon Nebula between the Galactic Empire and the rebels of Phoenix Cell and the Massassi Group in 2 BBY, during the early rebellion against the Empire."}, {"tag": "p", "text": "Phoenix Squadron dispatched Hera Syndulla and her crew, the Spectres, who destroyed a tactical infiltration pod sent to find her. They met up with Mothma's shuttle, the Chandrila Mistress, and her escorts from Gold Squadron, part of the Massassi Group of rebels. After a brief skirmish with Imperial warships, the rebel teams traveled through the Archeon Nebula] using the Archeon pass, a dangerous hyperspace route they hoped would dissuade the Empire from pursuing them. They were tracked, however, by a prototype TIE/d \"Defender\" Multi-Role Starfighter and its TIE/IN interceptor escorts. The rebels managed to elude their TIE pursuers and two Star Destroyers, commanded by Governor Arihnda Pryce and Admiral Kassius Konstantine, by firing proton torpedoes into the nebula's gas clouds to damage the Imperial ships."}, {"tag": "p", "text": "The rebels safely delivered Mothma to Dantooine, where she broadcast a speech to the galaxy in which she declared open rebellion against the Empire. This led to the arrival of several rebel cells, which joined together to formally build the Rebel Alliance that would one day be responsible for toppling the Empire and giving rise to the New Republic."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the end of the Clone Wars in 19 BBY, Supreme Chancellor Palpatine proclaimed himself Emperor and transformed the Galactic Republic in to the first Galactic Empire. Over the years, the Empire became progressively authoritarian and oppressive towards the galactic population. Senator Mon Mothma became a staunch critic of the Emperor's authoritarian rule in the Imperial Senate. Disillusioned with the corruption of the Senate and its failure to rein in the Empire's excesses, Mothma resigned from the Senate and joined the growing galactic-wide rebellion against the Empire."}, {"tag": "p", "text": "Following the Ghorman Massacre, Mothma delivered a speech condemning the Emperor's attacks on Ghorman, in which she denounced him as a \"lying executioner.\" As a result, she was designated a traitor by the Empire and forced to flee into hiding, with the Imperial Security Bureau issuing an alert for Mon Mothma in an attempt to capture her. ISB agents also visited Cantham House on Coruscant, the location of the Cantham House meetings, based on suspicions they had, and questioned Leia Organa and several others there. Under orders from Senator Bail Organa, Phoenix Leader Hera Syndulla and her Spectres rebel cell were tasked with rendezvousing with Mon Mothma's freighter and her Y-wing escorts in deep space. Due to the sensitivity of the mission, the Spectres were given little information about the ship and its passengers."}, {"tag": "p", "text": "While the Spectres waited aboard the Ghost amidst the wreckage of two former Confederacy navy warships, their ship was discovered by a tactical infiltration pod. The pod was piloted by an E-XD-series infiltrator droid, which was part of Grand Admiral Thrawn's program to scour the sector for rebels. Following a brief pursuit, the Spectres managed to destroy the infiltration pod but failed to prevent the infiltrator droid from contacting the Empire. Shortly later, they were joined by Mon Mothma's shuttle and her escort."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "h3", "text": "First attack wave"}, {"tag": "p", "text": "After Mothma's Chandrila Mistress docked with the Ghost, the Spectres met with the former Senator's attaché Erskin Semaj and Gold Leader Captain Jon Vander. Following a brief argument, the Spectres began refueling Mothma's Y-wing starfighters. While refueling the fifth fighter, the rebel ships came under attack from several TIE fighters that had been dispatched by an Arquitens-class command cruiser and a Gozanti-class cruiser, which had both exited hyperspace. After Gold Two was wounded, Spectre Ezra Bridger took her place and flew her Y-wing."}, {"tag": "p", "text": "During the dogfight, Mon Mothma's shuttle was crippled and the former Senator and her crew were forced to abandon ship and flee aboard the Ghost. Meanwhile, Ezra and Gold Squadron managed to use their ion cannons to disable the light cruiser before bombing the ship, critically damaging it. The rebels then fled into hyperspace. Since Mon Mothma wanted to travel to Dantooine for an important rebel meeting, Hera agreed to take her through the Archeon pass, a dangerous route through the Archeon Nebula."}, {"tag": "h3", "text": "Navigating through the Archeon Nebula"}, {"tag": "p", "text": "Meanwhile, Grand Admiral Thrawn dispatched Governor Arihnda Pryce and Admiral Kassius Konstantine to capture the rogue Senator. Thrawn's plan involved sending the TIE fighter pilot Commander Vult Skerris in the prototype TIE Defender and two escort TIE interceptors to flush out Mon Mothma and Hera Syndulla's ships. Pryce and Konstantine, meanwhile, were travelling to the other side of the nebula in two Imperial Star Destroyers to intercept and capture the Ghost, which was carrying Mothma."}, {"tag": "p", "text": "Commander Skerris caught up with the Ghost and her Y-wing escorts. Skerris's TIE Defender and her TIE interceptor escorts were equipped with deflector shields that protected them from the radiation of the nebula. Skerris managed to shoot down the Y-wing fighters Gold Three and Gold Four. In an attempt to lose Skerris, the Ghost and its three remaining Y-wing escorts pressed deeper into the Archeon pass. Garazeb Orrelios, who was manning the Ghost's rear cannon, was unable to penetrate the Defender's powerful shield. Skerris then acquired a lock on the Ghost, but Gold Five intercepted the shots with her Y-wing, saving the freighter at the cost of her own life."}, {"tag": "p", "text": "Unable to outrun the TIEs, Hera instructed her crew to shift power to their deflector screens, and brought the group in close to a forming star. One of the TIE Interceptors was destroyed by the intense heat of the protostar. The second fighter was damaged and attempted to pull back, but Zeb destroyed it with his cannon. Flying closer to the star, the Ghost began to sustain hull damage from the intense heat. With his shields frying, Skerris was forced to pull back. Ezra and Jon agreed to hold off the TIE Defender while Hera took Mothma and the Ghost out of the nebula."}, {"tag": "h3", "text": "Escaping Thrawn's snare"}, {"tag": "p", "text": "Outside the Archeon Nebula, the Ghost was intercepted by Pryce and Konstantine's Star Destroyers. Pryce demanded that Mon Mothma surrender herself to the Empire. While Mothma distracted Pryce with a list of demands, Hera and Chopper worked to repair the ship's hyperdrive. Pryce rejected Mothma's demands, while Konstantine activated their Star Destroyer's tractor beam projector. The Ghost was drawn towards the Star Destroyer's hangar."}, {"tag": "p", "text": "Meanwhile, Ezra and Jon managed to lose the TIE Defender following a protracted chase. While Ezra led Skerris on a chase, Jon fired his ion cannon at the TIE Defender, temporarily disabling it and causing it to plunge into the nebula. The rebel Y-wings managed to escape before Skerris regained control. Ezra and Jon exited the Archeon Nebula just in time to prevent the Ghost from being drawn into Pryce's Star Destroyer. Under Hera's orders, Ezra and Jon fired their proton torpedoes into the nebula. This created an explosion which engulfed Pryce's two Star Destroyers, causing extensive damage to the Imperial ships. With the tractor beam disabled, the rebel ships jumped into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Spectres' actions during the skirmish in the Archeon Nebula earned them the respect of Mon Mothma, Captain Vander, and Gold Two. After arriving over Dantooine, Mon Mothma gave a broadcast urging the galaxy to rise up in rebellion against the Empire. This broadcast was witnessed by rebels across the galaxy, including Ryder Azadi and his cell on Lothal and members of Phoenix Cell at Chopper Base on Atollon. Shortly later, the Ghost and its Y-wing escorts was joined by a rebel fleet which exited hyperspace. This action ultimately led to the formation of the Alliance to Restore the Republic and marked the beginning of the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Operation Handoff first appeared in the Star Wars Rebels Season Three episode \"Secret Cargo,\" which premiered on March 4, 2017 on Disney XD. It was first identified as \"Operation Handoff\" in Star Wars: The Rebel Files."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}