{"url": "Operation_Skyhook", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Battles of Operation Skyhook", "Category:Galactic Civil War campaigns"], "nodes": [{"tag": "h1", "text": "Operation Skyhook"}, {"tag": "p", "text": "Operation Skyhook was the codename given to the Rebel Alliance's operation to obtain the Death Star plans and ultimately destroy the Imperial battlestation, the Death Star."}, {"tag": "p", "text": "Operation Skyhook would become one of the most devastating series of battles of the war. The entire population of the Alliance-allied planet Alderaan would be wiped out by the superlaser of the Death Star. During the Battle of Yavin, the Death Star was destroyed by a \"lucky shot\" by Luke Skywalker, wiping out hundreds of thousands of Imperial personnel, including Grand Moff Wilhuff Tarkin."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Learning about the superweapon"}, {"tag": "p", "text": "In 2 BBY, the Rebel leaders Mon Mothma, Bail Organa and Garm Bel Iblis were captured by Darth Vader and conducted to the battlestation. They became aware of the Death Star's existence but were not fully aware of its true nature. Operation Skyhook was launched shortly after their escape and the death of Galen Marek."}, {"tag": "p", "text": "Rumors about the existence of a massive Imperial construction began with the rescue of the Genue; Rebel escapees from the Stars' End secret prison facility informed the Alliance about Wookiee slaves working for a secret project. Meanwhile, R2-D2's investigations of the Imperial computer networks led him to uncover evidence of an \"Imperial superweapon\", rumors confirmed through further inquiries among the galaxy's underworld."}, {"tag": "p", "text": "The Alliance rescued Wookiee slaves on their transfer on Toral. Examining the ship's documents, the Alliance learned of the existence of a convoy of weapons near Orron III. An assault against that convoy resulted in the obtaining of Imperial communications satellites, which later transmitted the superweapon's schematics to the Rebel outpost AX-235; the Rebel spies who manned it learned about the definite existence of the Death Star."}, {"tag": "p", "text": "About the same time, Princess Leia Organa went on a mercy mission to deliver medical supplies and equipment to the Ralltiiri High Council. However, her real objective was supporting the Ralltiiri resistance movement with heavy weaponry and military-grade equipment to fight the Imperial occupation troops. She was permitted to land by Commodore Lord Tion, head of the Imperial task force. There, Leia rescued a wounded Rebel soldier, Basso, who later revealed the existence of the first Death Star. On Alderaan, Bail Organa told his foster daughter that Basso's story of a top secret Imperial weapons project supervised by Grand Moff Tarkin was confirmed to be truthful. Later, Lord Tion visited Alderaan and met the Organas. Leia tricked him into revealing that the Death Star was a moon-sized battlestation equipped with a superlaser capable of destroying entire planets. Tion gossiped that an Imperial convoy was transporting the Death Star plans from Grand Moff Tarkin's headquarters to the Imperial vaults. After Leia accidentally revealed her knowledge about the Death Star battlestation, Tion realized that the Organas had connections to the Rebel Alliance, but he died before he was able to inform the Imperial authorities."}, {"tag": "p", "text": "Acting on the advice of Princess Leia—identified to operatives merely as an anonymous \"friend in the Senate\"—Mon Mothma ordered a further investigation into the nature of this weapon. Using data already collected, the Rebels discovered that cargo shipments to a research station doing work on the Death Star were being sent from the Vergesso Asteroids. Raymus Antilles personally recruited Han Solo, despite Solo's reluctance, to plant a tracking device and EMP in one of the cargo containers bound for the research station."}, {"tag": "p", "text": "The tracking device revealed the station's location over Corulag, and then triggered the EMP and paralyzed Imperial security forces while Antilles led a team to attack the station, recovering valuable data. From this data haul, the team was able to confirm the name of the project—Death Star—and gain an idea of its destructive capabilities, but they were without technical schematics detailed enough to reveal a weakness. Mon Mothma then instructed Leia Organa to begin intensified operations to gather relevant intelligence, and assigned Captain Antilles to her service aboard Tantive IV."}, {"tag": "h3", "text": "The operation"}, {"tag": "p", "text": "When the Death Star whereabouts became more well known, the Rebels proceeded with the Mission to Danuta, during which Rebel operative Kyle Katarn (who had recently defected from the Empire) was sent to retrieve the plans from a secret Imperial base in the city of Trid. Due to their importance, these plans were transported physically to Princess Leia aboard the diplomatic vessel Tantive IV by the shuttle Maria. In addition to the fragments gathered from AX-234 and Danuta, it seems another piece of the plans were delivered from a rebel base on Polis Massa. These plans were stolen during a prisonbreak on the Death Star. The 501st Legion of stormtroopers attempted to recover this information on Polis Massa, but it was smuggled out. This led to the 501st Legion being saved from the destruction of the Death Star. Further information was retrieved on Darkknell by Senator Garm Bel Iblis, then presumed dead, shortly after the death of his family at the hands of Imperial agents."}, {"tag": "p", "text": "The last part of the plans were retrieved by Rebels operating out of Toprawa, but Imperial reinforcements led by Darth Vader blockaded the system. The information was to be delivered to the Star Cruiser Liberty, but the sudden appearance of the Star Destroyer Immortal forced the transfer to stop. Under the guise of a mercy mission, Princess Leia Organa arrived in the system aboard the Tantive IV, hoping her diplomatic immunity as a member of the Imperial Senate would protect her. However, Vader's flagship, the Devastator, detected the transfer, and Princess Leia was forced to flee the system with Vader in pursuit. There was a spy onboard which helped the Imperials track the vessel."}, {"tag": "p", "text": "Tantive IV fled to Tatooine in an attempt to fulfill its secondary objective: Former Jedi General Obi-Wan Kenobi had survived the Great Jedi Purge and was now hiding on Tatooine. Princess Leia had been instructed by her father to seek him out if she had no other option. Leia would now attempt to bring Kenobi to Alderaan, along with the stolen plans. Unfortunately, before the ship ever reached Tatooine, it was intercepted by the Imperial Star Destroyer Devastator, the flagship of Darth Vader."}, {"tag": "p", "text": "The Tantive IV was quickly disabled and captured, and though a small struggle was made by Rebels on board, the stormtroopers of the 501st Legion quickly eliminated the Rebel troops and captured Princess Leia. However, the boarding party was unable to find the plans, which had been secretly uploaded to the astromech droid R2-D2, who then made his getaway in an escape pod."}, {"tag": "p", "text": "While the Alliance was looking for the location of the Death Star, Jan Dodonna proposed that if the base of Kalla VII was destroyed, any passing ships heading for the Death Star would be stranded there. According to this, Red Squadron assisted to its destruction while Priam arrived and as predicted, it was stranded. After the capture of Priam, its computer revealed to the Alliance that the location of the Death Star was Despayre. The rebel carrier Fortressa then made an ill-fated solo attack on the Death Star at Despayre and was completely destroyed along with her starfighter compliment. Afterward, when Rebel scouts Ethar went to investigate, the Death Star had already left the system and they were captured by lingering Imperial forces."}, {"tag": "p", "text": "With the Death Star complete and on the move, Imperial forces started to attack the Rebels in several sectors, forcing the Alliance to go to Condition Yellow and increase protection of storage areas.[source?]"}, {"tag": "h3", "text": "Conclusion"}, {"tag": "p", "text": "Following the Destruction of Alderaan, a tracking bug was placed on the Millennium Falcon, which led the Imperials to the moon Yavin 4. To confirm Rebel presence on the moon, Palpatine ordered an expeditionary force to go to the moon and gain a stronghold on the planet. Following a rough skirmish in the vicinity of the Massassi Arena, Rebels were confirmed to have been on the planet."}, {"tag": "p", "text": "With the Death Star en route to Yavin 4, Jan Dodonna devised a complicated plan to destroy the Death Star with only one pair of proton torpedoes. Red Squadron and Gold Squadron would fly into the Death Star's trench and fire into a secondary thermal exhaust port leading from the main exhaust port of the battlestation, which would cause it to explode from within."}, {"tag": "p", "text": "The Battle of Yavin started soon after. The Alliance would emerge victorious as Luke Skywalker, Red Five, fired successfully into the Death Star through use of the Force."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The threat of the Death Star was vanquished thereafter. But the Empire would later respond with other special projects, including the dark trooper production line, the development of TIE Phantoms and the Tarkin battlestation. Their efforts would conclude with the TIE Experimental Project and finally the construction of the Death Star II."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The briefing in Star Wars: Dark Forces states that the Mission to Danuta belongs to the \"second phase\" of Operation Skyhook. It tells us nothing about which was the first phase, although it would supposedly refer to the missions of Star Wars: X-Wing and what missions comprised the phases of the whole operation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}