{"url": "Operations_Planning_Center", "categories": ["Category:Legends articles", "Category:Coruscant rooms", "Category:Jedi Temple locations", "Category:New Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Operations Planning Center"}, {"tag": "p", "text": "The Operations Planning Center was a chamber in the High Council Tower of the Jedi Temple on Coruscant. It was within this chamber that the High Council could meet and converse over the HoloNet with other Jedi in the field and with planetary governments on matters of state. At the center of the chamber, a sunken holoprojector pit could display a circular two-story holomap upon which the largest hotspots in the galaxy were charted."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Used by the Jedi High Council, the Planning Center was the top-most layer of a communications hierarchy established at the Temple. In conjunction with the communication center, analysts would look over all transmissions to the Temple and archived data and established the holomaps that were to be used in the Temple. While the lowest level holomaps were based off of the archived starcharts in the Jedi Archives, the Operations Planning Center received a map upon which the most potent problems were plotted."}, {"tag": "p", "text": "When Jedi Master Qui-Gon Jinn and his apprentice Obi-Wan Kenobi were waiting to be summoned before the Council, they waited in the Planning Center, noting that Coruscant was glowing red, symbolizing the danger surrounding the upcoming Eriadu Trade Summit that would be attended by Supreme Chancellor Finis Valorum. As they waited for Master Adi Gallia to descend from the High Council Chamber, the pair chatted with Master Jorus C'baoth as Jinn reflected that it was from the Meditation Deck that he first truly saw Coruscant."}, {"tag": "p", "text": "Following the three years of devastation known as the Clone Wars, the Supreme Chancellor of the Galactic Republic was revealed to be the Dark Lord of the Sith Darth Sidious leader of the Republic's opposition, the Confederacy of Independent Systems. While the Order was the only entity to know of this, they hoped to arrest the Chancellor and return order to the Republic. However, when the Jedi failed to arrest Palpatine, the Sith Lord ordered the Temple scoured of all its residents for the attempted assassination attempt an \"Jedi Rebellion\". As Darth Vader led the troopers of the 501st Legion through the Temple halls, the Planning Center inevitable fell to the Galactic Empire's war engine."}, {"tag": "p", "text": "The Temple would lie mostly dormant throughout the Galactic Civil War, lightly guarded by a ceremonial guard of Imperial Senate Sentinels. While the Towers stood during the New Republic's retaking of the Temple, they eventually collapsed following the catastrophe caused by the Lusankya. After having the rubble cleared, Knight Luke Skywalker of the New Jedi Order established a enclave on the room of the Temple Ziggurat as a waypoint and diplomatic station on Coruscant while the Jedi academy was established on Yavin 4. The Headquarters would soon be destroyed during the Yuuzhan Vong War as the alien invaders took the capitol."}, {"tag": "p", "text": "Following the war the Galactic Alliance Chief of State Cal Omas donated a new Temple to the Order in thanks for their sacrifices during the conflict. When the Reconstruction Authority rebuilt the Temple nearly exactly as it had been, the Operations Planning Center was recreated in the same place as it had stood over a decade before. It would see increased use as the Jedi High Council began holding its meetings on Coruscant. During the Dark Nest Crisis Grand Master Skywalker and Captain Han Solo were being held captive on Woteba by the Killiks after being accused of beginning the Fizz plague that was killing off their people. From the Operations Planning Center, Masters Mara Jade Skywalker and Saba Sebatyne, along with Jedi Leia Organa Solo met to discuss what action the Order should take. Joining by holoconference, Masters Kyp Durron, Corran Horn, Kenth Hamner all suggest ways of freeing the Grand Master while the two Joiner Jedi Knights Zekk and Jaina Solo argued for peace between the Order and the Unu nest. Master Hamner exclude the Jedi attending by holocomm and only spoke to the Jedi present at the Temple when he advised that the Galactic Alliance Fifth Fleet was heading to take on the Gorog nest and that the Order should use the assault as a distraction to extract the Grand Master. The situation was made easier when a hologram of Master Cilghal from Ossus announced that she had discovered the Fizz was really a strange nanotechnology built into the planet and was not sabotage by the mysterious Dark Nest."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Several stories tall, the circular Operations Planning Center was located near the peak of the High Council Tower of the Jedi Temple. Situated below the treasury room, which in turn lay under the High Council Chamber, the chamber was erected over and open shaft that ran several stories down the Tower and was occupied by a large collimating dish and power generator used to send and receive the data from across the Republic. The dish below the room allowed for even the weakest signals to be cleaned up and boosted so that the Council receive the best transmission technology could provide."}, {"tag": "p", "text": "The Operations Planning Center was accessed by a dedicated turbolift that ran from the Council Chamber to a special Council lobby several stories below. Additionally an ancient staircase wrapped around the Tower up into the highest regions of the tower. Inside the chamber a hallway encircled the holoprojection pit around which a railway protected visitors from tumbling into the tower shaft. Emitting a two-story map, the holoprojector was controlled via a panel on the rail. Smaller holograms could be emitted from the railing for use by Jedi not present at the Temple during a meeting. Along the outer walls, three portals led out onto the Contemplation Stations, small balconies that over looked the cityscape of the planet. It was here that Jedi awaiting access to the Council Chamber would wait and calm themselves before standing before the august body."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}