{"url": "Operation_Roundabout", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Battles of Corellia", "Category:Battles of the Second Galactic Civil War", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Operation Roundabout"}, {"tag": "p", "text": "Operation Roundabout was a military assault on Corellia launched by the Galactic Alliance, which triggered the Second Galactic Civil War."}, {"tag": "p", "text": "The operation was motivated by intelligence indicating that the Corellian government were making military preparations to bolster their political moves towards independence: secretly constructing an assault fleet, and also attempting to render Centerpoint Station operational once again. More generally, the strike was conceived as a show of force, a means of eliminating the problem of Corellia's stridently anti-Coruscant government, and discouraging dissent and unrest within the Alliance."}, {"tag": "p", "text": "To this end, a major Fleet operation was mounted, deploying a sizable task force from the Second Fleet into Corellia's orbital space, commanded by Admiral Matric Klauskin. This was largely designed as a psychological move to overawe opponents of the Alliance, however, and in purely military terms, it was intended to serve as a feint and support mission. The main strike thrust of Operation Roundabout was provided by a series of Jedi commando teams, named after various foul-tempered beasts, and designed to cut the heart out of the Corellian government and military-industrial complex."}, {"tag": "p", "text": "The operation was a closely guarded secret prior to its launch, and it was apparently regarded as a rational move to the Senate and Defense Force leadership of the Alliance, but it was compromised from the outset on several levels, most fundamentally in attacking an entire member state for what were largely the actions of one political faction: the assault fleet was the private project of a caucus within the system government, led by Corellia's planetary Chief of State Thrackan Sal-Solo, and working behind the back of the Five World Prime Minister, Aidel Saxan and the rest of the administration."}, {"tag": "p", "text": "Moreover, the show-of-force strategy also had the potential to cause counterproductive political ramifications throughout the Galaxy, and alienated no less than Han and Leia Organa Solo before it had even begun: in a move that some would consider treason, they met in secret with Prime Minister Saxan to warn her of the military preparations against her government. However, it seems that Thrackan Sal-Solo was already aware of the attack before this juncture, and had planned accordingly; indeed, it was not impossible that he leaked information about the assault fleet to provoke the strike in the first place, in order to draw the Alliance and the Jedi into the trap that they encountered when they arrived at Corellia, and to propel himself to greater power."}, {"tag": "h2", "text": "Strike teams"}, {"tag": "p", "text": "As mentioned above, the main offensive element of Operation Roundabout involved a series of Jedi strike missions, consisting of one two-man team deployed against Centerpoint Station, and a synchronized series of four teams sent against Corellia itself. Two commando snatch-teams and a spotter detail were deployed covertly on the surface around Coronet City, while an airborne support/extraction mission was launched from the Second Fleet during the main phase of the operation."}, {"tag": "h3", "text": "Mynock"}, {"tag": "p", "text": "Team Mynock, comprising Jacen Solo and his padawan Ben Skywalker, was the most important part of Operation Roundabout, with the objective of destroying Centerpoint Station. While Jacen walked into an anti-Jedi trap laid by Thrackan, Ben reached the control room undetected, and found a droid which was programmed to think it was Anakin Solo. Because Centerpoint station was keyed to only respond to commands from Anakin Solo, Thrackan had created the droid to simulate his thought-patterns and biometrics, to fool the station's computers."}, {"tag": "p", "text": "When the young Skywalker made the droid realize that it was not the real Anakin, it destroyed itself, locking the station's controls indefinitely—but preventing the destruction of Centerpoint. Ben and Jacen subsequently escaped Centerpoint in the confusion of an evacuation alert initiated by the droid."}, {"tag": "h3", "text": "Slashrat"}, {"tag": "p", "text": "Team Slashrat was a two-man reconnaissance mission, involving Jedi Master Corran Horn and an unknown Jedi. Their role was to monitor military starfighter activity at Coronet's main spaceport. However, Slashrat was rendered redundant as most of the Corellian Defense Force's starfighters were already in space, in order to ambush the Second Fleet."}, {"tag": "h3", "text": "Purella"}, {"tag": "p", "text": "Team Purella, led by Jaina Solo and including Thann Mithric, Zekk, and Kolir Hu'lya, was tasked with kidnapping Prime Minister Aidel Saxan. However, when they struck at her motorcade, they found themselves faced only with YVH 1 combat droids, having been led straight into a trap."}, {"tag": "h3", "text": "Tauntaun"}, {"tag": "p", "text": "Team Tauntaun, led by Tahiri Veila with Tiu Zax and Doran Tainer, was given the mission of removing planetary Chief of State Thrackan Sal-Solo. As with Saxan, the Jedi walked into a trap, being ambushed by CorSec troops and probots like those used by Thrackan on Centerpoint, but they were able to score a minor victory when Zax opted not to return with the rest of the group, instead staying behind in hiding inside Sal-Solo's mansion to provide intelligence to the Alliance."}, {"tag": "h3", "text": "Womp Rat"}, {"tag": "p", "text": "Team Womp Rat, led by Grand Master Luke Skywalker himself, consisted of the ten XJ6 X-wing starfighters of Hardpoint Squadron and the ground-assault shuttle Chandrila Skies. Assigned directly to the Second Fleet, their role was the retrieval of Purella and Tauntaun from the surface. They suffered the first Alliance combat losses of the Second Galactic Civil War, when a force of Corellian attack fighters maneuvered them into the range of concealed flak emplacements outside Coronet, leading to the loss of Chandrila Skies and her crew, and one X-wing with its Jedi pilot, Toile Senn."}, {"tag": "p", "text": "The loss of Chandrila Skies forced Purella-Tauntaun to improvise their own extraction, but the nine surviving XJ6s continued to provide them with fighter cover until their successful escape."}, {"tag": "h2", "text": "Fleet operation"}, {"tag": "p", "text": "The deployment of a sizable naval force from the Second Fleet was intended to overawe Corellia, and anyone else who might think of following her example, with the firepower and strength of the Alliance. It was believed that the battlegroup would sit unopposed in orbit, while the Jedi strike teams seized the Prime Minister and Chief of State and brought them into Alliance custody aboard the command ship Dodonna."}, {"tag": "p", "text": "In reality, the Defense Force ships found themselves backed against Corellia by a Corellian fleet, consisting of every combat-capable vessel the Five Worlds government could field, apparently interspersed with large numbers of hulks and incomplete hulls to confuse the Alliance as to their true numbers and deployment. As skirmishing between the two sides' starfighters escalated, a Corellian escort frigate was destroyed by Alliance Eta-5 interceptors."}, {"tag": "p", "text": "Admiral Matric Klauskin, apparently through the machinations of Lumiya, suffered a mental breakdown during the operation, but in outline, his improvised strategy was sound—sounder, in military terms, than most people seem to have appreciated: realizing that his close-orbit deployment was untenable, he withdrew to the edge of the system to seize Tralus as a forward bridgehead for continuing operations against the Corellians."}, {"tag": "p", "text": "Understandably, the Defense Force were not prepared to withdraw from Tralus, but they were unable to make any rapid moves to reinforce their bridgehead, while negotiations to resolve the situation between the Alliance and the Five Worlds government were staged at Toryaz Station in the Kuat system. When these collapsed—due to Lumiya's intervention—the Corellian military subsequently mounted a counterattack before the occupation forces could be significantly strengthened. In this operation, known as Operation Noble Savage, a starfighter-led assault was successful in driving off the Second Fleet, and liberating Tralus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}