{"url": "Operation_at_Jarbanov", "categories": ["Category:Canon articles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Operation at Jarbanov"}, {"tag": "p", "text": "The operation at Jarbanov, also referred to as the Jarbanov attack, was carried out around 5 ABY at the planet Jarbanov by the Galactic Empire's 204th Imperial Fighter Wing. The fighter wing's Squadron Four split into flights and attacked the colony on Jarbanov, drawing a military response from the defending armored cloud cars. As the squadron withdrew from the planet, Lieutenant Palal Seedia breached some hazard vaults, irradiating the colony."}, {"tag": "p", "text": "While Squadron Four evaded a New Republic corvette and rendezvoused with the Imperial Quasar Fire-class cruiser carrier Allegiance, the 204th's own cruiser-carrier the Aerie collected the wreckage of nine TIE fighters. Following the operation, New Republic agents reported the TIE attack on the Jarbanov colony, which was review by members of the New Republic Intelligence on the planet Troithe. The senior officers of the 204th also reviewed the Jarbanov operation, the leaders of Squadron Four leading the discussions."}, {"tag": "h2", "text": "The operation"}, {"tag": "p", "text": "The Galactic Empire's 204th Imperial Fighter Wing traveled to the barren planet Jarbanov around 5 ABY. While the fighter wing's special adviser, Major Soran Keize, oversaw the mission from the Quasar Fire-class cruiser-carrier, the Aerie awaiting in orbit, the 204th's Squadron Four, comprising of TIE fighters, was sent down to the colony on Jarbanov. This was timed so that the workers at the industrial hub were already released from their afternoon shifts. A flight led by Lieutenant Palal Seedia attacked a disassembly plant at the colony at the same time as another flight led by Lieutenant Nord Kandende fired upon a battery recycling plant, being unsuccessful in inflicting any significant damage."}, {"tag": "p", "text": "Captain Jothal Gablerone, the commander of Squadron Four, led his own flight which targeted roads and bridges. The local militia responded to the attacks by deploying armored cloud cars. The TIEs took evasive action to gain distance from the enemy patrol craft. As Squadron Four out maneuvered the cloud cars, one patrol craft crashed into a garbage silo, Seedia reporting it to her comrades. Keize recommended formation adjustments to Gablerone to take advantage being outnumbered. The squadron commander acknowledged that but did not follow through, and Keize soon told the captain to withdraw Squadron Four when ready."}, {"tag": "p", "text": "Squadron Four proceeded to shake the pursuing cloud cars and began ascending from Jarbanov. Seedia, though, split off and punctured a row of hazard vaults, irradiating the colony. Keize informed her of this and advised the lieutenant to stay in her TIE until it was completely scrubbed of trace radiation. A New Republic corvette attempted to intercept Squadron Four in orbit, but the squadron evaded the enemy vessel and rendezvoused with the Imperial Quasar Fire-class cruiser-carrier Allegiance at the far side of Jarbanov's moon. Simultaneously, the Aerie retrieved the wreckage of nine TIE fighters from Jarbanov's junk rings using a tractor beam."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "New Republic agents at Jarbanov gave descriptions of the 204th's TIEs attacking the planet. Yrica Quell and Caern Adan, assets of the New Republic Intelligence who were searching for the 204th, reviewed the sighting while on the planet Troithe but concluded that it lacked the typical signatures of the fighter wing. Meanwhile, Keize soon held a conference with his senior officers which included a \"postmortem\" of the Jarbanov operation. Seedia was called into the meeting to account for her flight's actions, and she and Galberone led the discussions about the operation. When Keize called the lieutenant's decision to irradiate the colony unnecessary, Seedia compared his claim to the New Republic's actions at the planet Pandem Nai."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The operation at Jarbanov appeared in the 2020 novel Shadow Fall, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}