{"url": "Operation_Masterstroke", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Galactic Civil War campaigns"], "nodes": [{"tag": "h1", "text": "Operation Masterstroke"}, {"tag": "p", "text": "Operation Masterstroke was an operation planned by the Galactic Empire during the Galactic Civil War against the Alliance to Restore the Republic. Planning for the operation was overseen by Imperial High Command during the time following the Battle of Yavin in 0 BBY. The intricacies of the operation were conducted by at least one Imperial representative who contracted the services of couriers to receive multiple cargo shipments from agents of the Imperial Security Bureau. These efforts resulted in the stockpiling of immense amounts of material, including proton torpedo warheads, heavy weapon stabilizing mounts, capacitor banks, and drilling pumps. The Imperial higher-ups believed that the success of Operation Masterstroke would paralyze the Rebellion in a single unexpected blow. However, the operation was apparently beset with delays. ISB workers responsible for delivering the shipments lightly criticized the Empire for taking so long to complete the operation, and they wondered when it would even occur."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Alliance to Restore the Republic won a decisive victory against the Galactic Empire at the Battle of Yavin in 0 BBY, Imperial High Command stepped up their planning of Operation Masterstroke, a secretive undertaking which they believed would paralyze the Rebellion in a single unexpected blow."}, {"tag": "p", "text": "To achieve their ends, the Empire, through the auspices of at least one representative, contracted the services of loyal couriers to receive shipments delivered by agents of the Imperial Security Bureau in exchange for credits. These shipments included proton torpedo warheads, which only constituted a small fraction of the full potential of Operation Masterstroke. Regardless, couriers responsible for receiving these shipments were reminded of cargo's critical importance to their mission, and they were advised to meet all assaults on their person with maximum force. Under no circumstances was the Empire willing to allow the cargo to fall into enemy hands. In addition to the threat of Rebel intrusions, delivery of these proton torpedo warheads posed an addition risk to Imperial couriers. ISB agents cautioned to keep the warheads away from intense magnetic fields, although they did not elaborate why."}, {"tag": "p", "text": "With cargo shipments arriving in greater frequency, the Empire became increasingly confident that the success of Operation Masterstroke would lead them to victory. However, additional hand-delivered shipments were required. This included deliveries of heavy weapon stabilizing mounts and capacitor banks. However the linchpin to the potential success of Operation Masterstroke were drilling pumps, at least one of which was faithfully delivered by the Imperial Security Bureau. On their own, each component of the operation was largely insignificant, but altogether they formed what the Galactic Empire believed to be an ingenious scheme. At least one agent of the Imperial Security Bureau surmised that the Empire had accumulated warehouses worth of material, or perhaps enough material to fill entire cities, or even planets. However, the time it had taken to collect so much material was not lost on the ISB. Agents responsible for the deliveries regularly remarked, with a hint of criticism, that the Empire had taken a very long time to plan the entirety of Operation Masterstroke. After so much delay, at least several of these agents wondered when the Empire would finally execute the operation in its totality."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Operation Masterstroke was featured in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Early in the game's lifespan, dynamically spawned non-player characters offered a variety of simple kill, delivery, and escort missions. Some of these were provided by NPCs of a specific faction. In this case, four Imperial delivery missions of varying difficulty required players to retrieve items essential to the conduct of Operation Masterstroke. The missions, titled Operation Masterstroke Cargo Delivery, Operation Masterstroke Materiel Delivery [sic], Operation Masterstroke Delivery Assignment, and Operation Masterstroke Cargo Required involved the delivery of a proton torpedo warhead, heavy weapon stabilizing mount, capacitor bank, and drilling pump respectively."}, {"tag": "p", "text": "According to a player discussion board on a video game role-playing site known as Allakhazam, the NPC responsible for issuing at least one of the missions, titled Operation Masterstroke Cargo Delivery, was a scout trooper named SX-212. According to this role-playing site, SX-212 could be found issuing the mission at various cities on the planet Naboo, including Keren, Moenia and Theed. However, the game's directory tree files and source data make no mention of a specific scout trooper with this designation. In fact, dynamically spawned scout troopers in Star Wars Galaxies would typically have randomly generated code names starting with SX, GX, VX, CX, and NX, so it is likely that SX-212 was not a permanent designation assigned by the game's developers. Furthermore, the game files do not indicate that a scout trooper on Naboo exclusively issued missions relating to Operation Masterstroke. Rather, as dynamically spawned faction NPCs, it appears as though the missions could be given by a variety of generic Imperial NPCs on a number of different worlds. Therefore, this article does not assume the exact name, nature or location of the Imperial (or Imperials) responsible for issuing the missions pertaining to Operation Masterstroke."}, {"tag": "p", "text": "When accepting these missions, players were required to meet with delivery NPCs. These NPCs were randomly named with generically spawned appearance templates. For instance, in the mission to retrieve the proton torpedo warhead, the player may have encountered a randomly named NPC identified as \"a farmer.\" However, as the mission dialogue identified these delivery NPCs as agents of the Imperial Security Bureau, this article disregards those random designations and assumes that their status as agents of the ISB is canon in the Star Wars Legends continuity. Because the mission dialogue referred to there being large scale shipments relating to Operation Masterstroke, this article also assumes that multiple Imperial couriers were responsible for making the deliveries, rather than any singular player. Although the player could choose not to do the missions associated with Operation Masterstroke, this article assumes 100% game completion"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}