{"url": "Oplock", "categories": ["Category:Canon articles", "Category:Esral'sa'Nikto", "Category:Males", "Category:Mechanics"], "nodes": [{"tag": "h1", "text": "Oplock"}, {"tag": "p", "text": "Oplock was a Esral'sa'Nikto who was the mechanic of the racer Marcus Speedstar. When Speedstar was in debt with the Guavian Death Gang, Oplock was taken hostage by Guavian security soldiers until he could pay back the credits. Oplock could not speak Basic, so he spoke with facial expressions and Cracek instead."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Oplock was a mechanic who was part of the racer Marcus Speedstar's crew during the New Republic era alongside the astromech droid R4-D12. Shortly before the Hosnian Cataclysm, Oplock and R4-D12 accompanied Speedstar to the Colossus platform on the planet Castilon. Speedstar had incurred heavy debts and had signed up for the Platform Classic in order to pay these debts."}, {"tag": "p", "text": "When Speedstar visited his estranged older brother Jarek Yeager's garage, Oplock gave Yeager's employees including fellow Nikto Neeku Vozo the customary Nikto greeting by howling. This startled Neeku's human colleagues Tamara Ryvora and Kazuda Xiono but Oplock reassured them that it was a customary greeting. Oplock put his arm around Neeku, who then introduced R4-D12."}, {"tag": "p", "text": "After leaving Yeager's garage, Oplock, Speedstar, and R4-D12 visited Aunt Z's Tavern. Two Guavian security soldiers then confronted Speedstar for disturbing a ship on Rishi and demanded that he pay back 20,000 credits in confrontation. Speedstar promised to pay back the money by winning the Platform Classic. To ensure his compliance, the Guavian enforces took Oplock hostage."}, {"tag": "p", "text": "As a result, Speedstar resolved to win the Platform Classic in order to free his friend. Despite competing against his bitter brother, Speedstar managed to convince Yeager to let him win so that he could save Oplock's life. Oplock watched the race anxiously. To his relief, Yeager pulled out of the race near the end, allowing Speedstar to reach the finish line in his racer Galaxy's Glory first."}, {"tag": "p", "text": "After Speedstar paid his debts to the Guavian Death Gang using the prize money, Oplock was delighted to be reunited with his boss. Though Yeager was still not able to fully forgive Speedstar for causing the deaths of his wife and daughter, the two brothers departed on amicable terms."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Oplock was a male Esral'sa'Nikto with gray skin and black eyes. He could not speak Galactic Basic Standard but spoke Cracek and used facial expressions. According to Speedstar, Oplock was a forgiving person who judged him by the person that he was. Oplock stood by Speedstar when Yeager severed relations following a racing accident that claimed the lives of his wife and daughter. Oplock expressed fear and anxiety after he was taken hostage by the Guavian Death Gang to ensure that Speedstar would pay his debts. He expressed elation when Speedstar won the race and was able to secure his freedom."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Oplock first appeared in the Star Wars Resistance Season One episode \"The Platform Classic,\" which premiered on November 25, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}