{"url": "Oppo_Rancisis/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Jedi Generals", "Category:Jedi Guardians", "Category:Jedi instructors", "Category:Males", "Category:Post-Ruusan Jedi High Council members", "Category:Post-Ruusan Jedi Masters", "Category:Thisspiasians"], "nodes": [{"tag": "h1", "text": "Oppo Rancisis"}, {"tag": "p", "text": "Oppo Rancisis, an adept strategist and tactician, was a Thisspiasian male who abdicated the throne of his homeworld in favor of becoming a Jedi Master. Offered to the Jedi Order as an infant by his mother, the Blood Monarch of Thisspias, Rancisis was apprenticed to Master Yaddle, training to become a Jedi Knight almost two centuries before the Battle of Yavin. In 186 BBY, Rancisis' sister was killed by terrorists, and he was offered the throne; he declined, instead preferring to continue on the path of the Jedi."}, {"tag": "p", "text": "After achieving the rank of Master and being given a place on the Jedi High Council, Rancisis served as one of the Jedi's top military advisors due to his tactical nous. He was also a member of and often led the Council of Reconciliation. Rancisis served the Jedi Council through the re-emergence of the Sith, the Separatist Crisis, and the Battle of Geonosis, and when the Clone Wars began, he became a Jedi General. Along with Yoda, Rancisis spent much of the war on Coruscant, organizing and coordinating Republic forces through the galaxy, such as during the defense of Kamino and the Battle of Zaadja, conferring with Supreme Chancellor Palpatine, and serving on the Council of Reconciliation."}, {"tag": "p", "text": "Near the close of the war, Rancisis learned of a Separatist operation on the planet Saleucami; Dark Acolyte Sora Bulq was overseeing the creation of a cloned Morgukai \"Shadow Army,\" which Rancisis feared would prove a match for the Jedi. The Thisspiasian Jedi Master led a team of Jedi and three battalions of clone troopers to Saleucami, and besieged the planet for five months. Rancisis used his battle meditation to aid Republic forces during the conflict, to the point of exhaustion. Sora Bulq used this to his advantage, sending a group of Anzati assassins to slay Rancisis, but the Jedi Master was able to fend them off and defeated his attackers. However, the attack had in fact been a ruse orchestrated by Bulq, who used the distraction to enter Rancisis' chamber unnoticed and stab the Thisspiasian in the back, killing him."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Oppo Rancisis was a Thisspiasian male born on the planet Thisspias in 206 BBY. The son of the female Blood Monarch, who ruled over Thisspias, he was discovered to be Force-sensitive as an infant, and his mother offered him to the Jedi Temple on Coruscant for training in the ways of the Jedi in 200 BBY, when Rancisis was six standard years old. She hoped that, after his training had been completed, he would return to Thisspias and succeed her as Blood Monarch, and use the wisdom and power taught to him by the Jedi for Thisspias's benefit."}, {"tag": "p", "text": "Rancisis was accepted by the Jedi Order, and eventually selected by Jedi Master Yaddle, a revered member of the Jedi High Council, as a Padawan. Yaddle trained Rancisis in the Jedi arts, and he proved to be an adept wielder of the Force and a tactician, with a keen sense for military strategy. He also received training of some sort from Master Yoda, though Rancisis was a rebellious student, sometimes disobeying Yoda's instructions. In 186 BBY, when Rancisis was twenty, terrorists stormed the alcazar on Ramatesh and killed his younger sister, who had become Blood Monarch during Rancisis' early training; Rancisis was the next in the lines of heirs, and was offered the throne. Devoted to the Jedi Code, he refused the offer, and continued with his training in the Jedi Temple."}, {"tag": "h3", "text": "Mastery"}, {"tag": "p", "text": "Rancisis was eventually made a Jedi Knight and later a Jedi Master, proving adept at the rare Jedi techniques of battle meditation and Malacia. Battle meditation allowed the user to boost his allies' morale while draining his enemies', and to subtly alter the odds of any given battle. Malacia allowed a user to use the Force to turn an opponent's equilibrium against him or her, halting movement and causing dizziness and nausea, though the effects were only temporary. A rare ability, which many frowned upon for its seemingly violent nature, Malacia was taught by Rancisis for many decades, and he recorded his notes on using the power in the Great Holocron. Rancisis had a keen grasp of military tactics, and he was known for his elegant and complex strategies, which helped the Republic to emerge from several conflicts victorious."}, {"tag": "p", "text": "Sometime prior to 89 BBY, Rancisis was given a temporary seat on the Jedi High Council, joining his former Master Yaddle on that august body. Rancisis was also a member of the Council of Reconciliation, a five-person body that attempted to find peaceful solutions to the Republic's problems, and assigned various Jedi to carry out these solutions. That same year, Rancisis traveled to the chambers of Lorian Nod, a young Padawan, at the behest of the other Councilors, who had noticed him acting strangely and believed he might be ill. Rancisis entered the room to find Nod with a fellow Padawan named Dooku and immediately sensed a tremor in the Force; he searched the room, looking to locate the source of the tremor, and eventually found a Sith holocron, stolen from the Jedi Archives. Nod claimed that Dooku had stolen it, which Dooku denied, but Rancisis merely took the holocron and left them, telling the two Padawans that the Council would decide their fate."}, {"tag": "p", "text": "Rancisis informed the Council of the theft, though, as it was busy attending to other matters, it would be several days until they could hold a meeting with the two students. In the interim, Rancisis and Master Yoda arranged a sort of competition for a group of Padawans, including both Nod and Dooku. Breaking them up into two teams of ten, Rancisis tasked them with successfully bringing a muja fruit from one of the fruit sellers in the All Planets Market back to the Temple by sunset. The Padawans could also use their training lightsabers to eliminate opposing team members with a light touch of their blade. Rancisis and Yoda purposely selected Nod and Dooku as team leaders so that they could pit them against each other and test how great the tension was between them. During the contest, Dooku recklessly injured Nod badly with his lightsaber, and was brought before the Council. Rancisis, Tor Difusal, and Yoda questioned him; ultimately, Dooku was sanctioned for excessive aggression during a training exercise, while Nod was banished from the Order for lying about stealing the holocron and for implicating his fellow Padawan. Dooku went on to become a revered Jedi Master, while Nod became a pirate."}, {"tag": "p", "text": "During the Stark Hyperspace War, Jedi Master Plo Koon—a friend of Rancisis'—and several other Jedi contacted the Jedi Council from the planet Troiken to relay a plan of his to end the conflict. Koon asked Rancisis specifically about the plan, because of his tactical nous, and the Thisspiasian approved it. Iaco Stark had unleashed a virus onto all Republic ships that prevented them from entering hyperspace, but Master Qui-Gon Jinn had found a way to counteract it. Koon's plan was to take Stark and his forces by surprise by sending a small fleet through hyperspace; simultaneously, Koon's forces on the ground would drive Stark's soldiers back and occupy them. Rancisis refined Koon's plan, devising various elaborate strategies, and, along with fellow Council Member Yarael Poof, he used battle meditation to augment the Republic assault force. The strategy was successful, and Stark was apprehended; Plo Koon was given a seat on the Council for his part in ending the conflict, while Rancisis' term was made permanent for his."}, {"tag": "h3", "text": "Later crises"}, {"tag": "p", "text": "In 33 BBY, Rancisis and his fellow Councilors met to discuss the Yinchorri Uprising. The Yinchorri, a warlike species native to Yinchorr, had recently discovered hyperspace travel, and were attacking the other worlds in the Yinchorri system. Two Jedi were sent by Master Mace Windu to negotiate with the Yinchorri, though their heads were sent back to Supreme Chancellor Finis Valorum's office. Jedi Master Yaddle later learned that the Yinchorri were immune to Jedi mind tricks, and that they wore cortosis armor, which rendered lightsabers useless. During the meeting, Rancisis told the Council of the Yinchorri's philosophy—that the strong could take what they wished from the weak—but also that, should they encounter beings stronger than themselves, they would surrender. Ultimately, after much discussion, Mace Windu and Councilor Micah Giiett volunteered to lead teams of Jedi to the Yinchorr system to find and destroy the Yinchorri headquarters. Rancisis remained behind with half the Jedi Council."}, {"tag": "p", "text": "Rancisis, Yoda, and Yarael Poof watched Windu's three Consular-class cruisers depart, though Yoda was uneasy; he told the others that Windu's team was in considerable peril, but so were those who opted to stay on Coruscant. His fears proved correct soon thereafter, when a team of Yinchorri warriors infiltrated the Jedi Temple and attempted to execute the Council. The Force forewarned the Jedi of their arrival, though, and they were able to kill the attackers with minimal Jedi casualties. Surveying the damage, Rancisis expressed his concern about the raid to Yoda; the Yinchorri had nothing to gain by attacking the Temple, and he suspected that some unknown, outside force was manipulating the warrior species. In the Yinchorr system, the Jedi were successful, though at the expense of three lives: Micah Giiett, Lilit Twoseas, and Theen Fida. Rancisis attended their funerals on Coruscant, and Ki-Adi-Mundi was chosen as Giiett's replacement on the Council."}, {"tag": "p", "text": "Also in 33 BBY, Rancisis and the other members of the High Council agreed that Nuru Kungurama, a Chiss youngling found by Jedi Masters Ring-Sol Ambase and Dooku, should be raised and trained as a Jedi. In 32 BBY, the Council of Reconciliation—consisting of Rancisis, Yoda, Adi Gallia, and Plo Koon—met with Qui-Gon Jinn to discuss his most recent mission, which had resulted in the destruction of the Trade Federation battleship Revenue, for which Arwen Cohl and the Nebula Front militant group were responsible. The Front had serious qualms with the Trade Federation's monopoly on trade in the Outer and Mid Rims, and several of the Councilors believed their anger was justified—Rancisis, however, noted that, despite their laudable goals, they were, in his eyes, a ruthless organization and nothing more than petty criminals. Eventually, the Council decided to attempt not to take sides, as both factions represented a great many beings, a course of action for which Rancisis was a strong proponent."}, {"tag": "p", "text": "Soon after, members of the Nebula Front attempted to assassinate Chancellor Valorum, but fled to Asmeru in the Senex sector, which was not part of the Republic, when the attempt failed. The Council sent several Jedi to Asmeru to deal with the would-be assassins while many more safeguarded the Eriadu Trade Summit. After the Jedi overstepped their bounds and attacked natives on Asmeru, Valorum and the Council were put in a difficult and finely balanced situation. If Lord Crueya Vandron of the Senex sector filed charges against the Jedi, Valorum and the Council would have received much negative attention, and might have lost support from Republic citizens. The Council met to discuss the issue; some, such as Even Piell, advocated striking a deal with the Senex lords—who had been repeatedly refused free trade with the Republic for a number of years because of their policies on slavery—while others believed that the Senex lords were mere slavers, and not to be bargained with. With the Republic's interest at heart, Rancisis seconded Piell's proposal, knowing that a rift between the Senex sector and the Republic would be difficult to mend. Ultimately, the Republic appeased the Senex sector, and Cohl was apprehended."}, {"tag": "p", "text": "Later that year, during the Trade Federation's Invasion of Naboo, the Sith re-emerged, and Qui-Gon Jinn briefly dueled with a Dark Lord of the Sith on the planet Tatooine. When he returned to Coruscant, he briefed the Council about the confrontation, though some were skeptical that the Sith had returned. Jinn had also encountered a Human child, Anakin Skywalker, on Tatooine and, convinced he was the Chosen One of Jedi prophecy, asked if could take the boy as his Padawan, despite Skywalker being several years older than the traditional age of new members of the Order. Yoda reminded Jinn that he already had a Padawan, Obi-Wan Kenobi, though Jinn was adamant that Kenobi should be knighted and Skywalker trained. Ultimately, the Council opted to wait before making a decision, and sent Jinn and Kenobi to help Queen Padmé Amidala end the crisis on Naboo. There, the Sith Lord slew Jinn, but Kenobi struck the Sith down—though no one knew if he was the master or the apprentice. Rancisis and his fellow Councilors traveled to Naboo to attend Jinn's funeral, and, ultimately, Kenobi was knighted, and took Skywalker as his Padawan, though Rancisis was among those opposed to Skywalker's admittance to the Order, believing that he was far too old for training."}, {"tag": "h3", "text": "Separatist Crisis"}, {"tag": "p", "text": "Rancisis continued to serve on the Council for the Separatist Crisis, during which many Republic worlds seceded to Count Dooku's newly formed Confederacy of Independent Systems. There were other threats to the Republic, as well, which the Council had to deal with; in 30 BBY, former Jedi Aurra Sing murdered several Jedi Knights on Coruscant, and Rancisis and his fellow Councilors sent Ki-Adi-Mundi to apprehend her. Three years later, the Council learned that Ashaar Khorda, an Annoo-dat revolutionary, had obtained a mysterious superweapon with which he planned to target the Republic. In his report, Mace Windu stated that his sources were unable to learn exactly where Khorda would strike, but they were able to narrow it down to three targets: Corellia, Alderaan, and Coruscant itself. Rancisis volunteered to safeguard Corellia, while Eeth Koth traveled to Alderaan and Yarael Poof defended Coruscant. Ultimately, Khorda targeted Coruscant, and although Poof was able to put a stop to the Annoo-dat's plot, he did so at the expense of his own life. Master Yaddle also perished around this time; Shaak Ti and Coleman Trebor were drafted as their replacements."}, {"tag": "p", "text": "During this period, some believed that the Jedi Knights were too few, and many Padawans were scheduled to be Knighted earlier than was traditionally accepted. Rancisis was present at the double ceremony to make Quinlan Vos a Jedi Master and his Padawan, Aayla Secura, a Jedi Knight. However, the Council soon realized that they might have been hasty in performing so many early Knightings, and decided to postpone the Knighting ceremony of Anakin Skywalker and Ferus Olin after a Councilor raised a concern about their conduct. Rancisis was one of those who informed Skywalker's Master, Obi-Wan Kenobi, that his Padawan would have to wait to become a Jedi Knight."}, {"tag": "p", "text": "In 22 BBY, Rancisis was sent on a diplomatic mission to Trandosha. Relations between the Trandoshans and their in-system neighbors, the Wookiees, had been going downhill, and the Trandoshans repeatedly petitioned for representation in the Galactic Senate. Rancisis arrived four weeks after Trandoshans began attacking Wookiee transports to speak with representatives from both species, accompanied by Caamasi and Alderaanian diplomats. Many critics of the Jedi were quick to voice their displeasure at the fact that Rancisis had arrived so late into the conflict, and claimed that had the Council sent a representative sooner, much bloodshed might have been averted."}, {"tag": "p", "text": "Rancisis met with Wookiee senator Yarua and Trandoshan Speaker-Above-All Hadocrassk at Hsskhor, Trandosha, to discuss the situation and to address the problem presented by Trandosha's policies on slavery. The talks started shakily, and continued in the same vein for some time. When the Trandoshans went behind Rancisis' and the Wookiees' back and requested Trade Federation help getting a seat on the Senate, Senator Yarua refused to continue the discussions, and stormed out of the chamber, despite the efforts of Rancisis to persuade him against leaving. The Council, recognizing the negotiations as a debacle, reassigned Rancisis."}, {"tag": "p", "text": "One month later, the Jedi Order received a distress signal sent by Obi-Wan Kenobi on the planet Geonosis in the Outer Rim; after unearthing a plot of the Confederacy's to start a war with the Republic, he had been captured by Dooku and sentenced to be executed, along with Anakin Skywalker and Senator Padmé Amidala, at the Petranaki arena. A team of over 200 Jedi, led by Mace Windu, traveled to Geonosis in a bold rescue attempt, though Rancisis was not among those who participated in the arena battle. The Jedi ranks in the arena were decimated, with a ring of several dozen survivors being all that remained. Before Dooku could order their deaths, however, Yoda arrived with hordes of clone troopers, who had secretly been grown on Kamino on the orders of the deceased Jedi Master Sifo-Dyas. The Republic was victorious at the Battle of Geonosis, though it marked the beginning of a galaxy-wide conflict: the Clone Wars."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Early war"}, {"tag": "p", "text": "As he was considered one of the most astute tacticians in the Jedi Order, Rancisis became a Jedi General and one of the most important Jedi figures in the Grand Army of the Republic, using his battle meditation to subtly alter the will of Separatist forces to give the Republic an advantage in battle. The early stages of the war saw much bloodshed for the Republic, but two months after the Battle of Geonosis, the Jedi Council was presented with an opportunity to hit back at the CIS. Jedi Quinlan Vos and Aayla Secura, working undercover on the space station known as The Wheel, had learned that the Confederacy planned to launch a major offensive on Kamino in the hopes of destroying a fresh batch of over a million clone troopers produced by the Kaminoans. It was the first time since the outbreak of the war that the Republic knew when and where the Separatists would attack, and Rancisis was tasked with drawing up a battle plan for Kamino's defense."}, {"tag": "p", "text": "The most important part of Rancisis' strategy centered on the fact that the CIS was expecting Kamino to be ill-defended. If they suspected that Republic forces were lying in wait for their fleet, Rancisis knew that they would retreat, and the opportunity to gain a foothold in the war would be lost. Thus, Rancisis had the fleet given to him to defend Kamino position itself outside the Kamino system, ready to jump to the planet's defense via hyperspace at Rancisis' signal, once the Separatists had launched their assault. Despite being a somewhat risky plan, in that it left Kamino virtually undefended for the beginning of the attack, Rancisis was confident in its chances for success."}, {"tag": "p", "text": "Rancisis did not coordinate the battle on Kamino itself, but would lead the Republic forces from aboard a ship in the Republic armada. He addressed a team of Jedi, led by Obi-Wan Kenobi, via hologram before the Separatists arrived, outlining his plan and explaining the importance of the element of surprise. Tipoca City, where the majority of the clones were being grown and trained, would still be susceptible to ground attacks from the first wave of CIS forces, and with clone starfighters unavailable en masse, Rancisis tasked Kenobi's Jedi with piloting starfighters against the CIS fleet, while Shaak Ti and numerous others defended the interior of the clone complex. Ultimately, the battle was something of a stalemate; both sides incurred losses, and the Separatists, led by Passel Argente, were able to flee. Despite this, Rancisis' battle plan had helped to preserve the future warriors of the Republic and ensured that the Separatists were not granted an early victory in the conflict."}, {"tag": "p", "text": "He continued to serve the Jedi Council during the Clone Wars, and was present at many meetings, during which the cost of the continuing war was discussed. At some point during the conflict, Rancisis returned to Thisspias to request the assistance of his species in the struggle against Dooku and the Separatists. The current Blood Monarch agreed provisionally, promising to pledge Thisspias's help if, as tradition required, Rancisis bested him in unarmed combat. Knowing the Republic was desperate for the assistance, the Jedi Master agreed; he defeated the Blood Monarch, who stayed true to his word and lent small contingents of Thisspiasian warriors to several battles."}, {"tag": "p", "text": "Rancisis, along with the likes of Yoda and Mace Windu, often met with the Chancellor in his office to discuss the war. Sixteen months after Geonosis, Rancisis, Yoda, and Windu met with Palpatine at his request to discuss the situation on the planet Thustra, whose native species, the Sephi, were on the brink of seceding. Negotiations with the Sephi king, Alaric, had been unsuccessful, but Palpatine was adamant that the Republic and the Jedi should do all they could do stop Thustra joining the CIS by whatever means necessary, as the planet was of strategic importance and because he feared that the remainder of the sector would follow suit. Yoda, who had known Alaric for centuries and who knew that he could see reason, volunteered to travel to Thustra and act the diplomat, though Rancisis stated that this was out of the question. Yoda oversaw the entire Jedi war effort, and Rancisis feared that placing his attention on a single battle would be detrimental to the Republic's chances of winning the war. Palpatine would not be deterred, however, and, despite Rancisis' objections, Yoda traveled to Thustra and persuaded Alaric to side with the Republic. Two months later, Rancisis and Windu agreed to a battle plan proposed by Obi-Wan Kenobi for the Battle of Zaadja."}, {"tag": "p", "text": "After General Grievous, the new Supreme Commander of the Separatist Droid Armies, killed and wounded many senior Jedi on Hypori, the Jedi Council convened to discuss the dwindling number of Jedi Knights, and the toll the war had taken on the Order. After Adi Gallia suggested that the Council knight any deserving Padawans, Obi-Wan Kenobi suggested that they forgo the traditional Jedi Trials and promote Anakin Skywalker to Jedi Knight, but Rancisis was strongly opposed. He felt that Skywalker was too reckless to be a Knight, and that the Order's most ancient principles and practices should not be forgotten, even in times of war. Yoda was quick to remind Rancisis that, in his youth, the Thisspiasian was not the most disciplined himself; ultimately, despite varying opinions on the Council, Yoda agreed that they should knight Skywalker, and the Council held a ceremony in the Jedi Temple."}, {"tag": "h4", "text": "Challenges on the Council"}, {"tag": "p", "text": "Rancisis also continued to serve on the Council of Reconciliation for parts of the war, and he sometimes led the Council, too. After the Battle of Rendili two and a half years after Geonosis, Rancisis and the Council of Reconciliation, as well as Masters Tholme and Kenobi, met with Quinlan Vos, a Jedi Master who was flirting with the dark side and was believed to have gone rogue, or even joined Dooku. Vos had previously been sent on a mission attempting to infiltrate Dooku's circle of Dark Acolytes, but his current loyalties were shrouded in mystery. Vos wished to be re-accepted into the Order's fold, though the Council members were unsure of his trustworthiness. Eventually, four of the other Council members, Mace Windu, Plo Koon, and Ki-Adi-Mundi, deferred to Rancisis' judgment, as they were away from Coruscant and attending via holographic transmissions from throughout the galaxy."}, {"tag": "p", "text": "Rancisis believed that Vos had returned to the light, and allowed him to return to the Order; he knew that the war's strain often superseded archaic traditions, a lesson he had learned after Anakin Skywalker was granted Knighthood. Later, he questioned Vos about what he had learned while undercover as Dooku's agent; Vos had not managed to learn much, though he knew the CIS was planning something in the Outer Rim Territories, where the Separatist Council was hiding, on planets such as Alliga and Anzat. Vos volunteered to travel to Anzat to investigate, though both Tholme and Rancisis believed he should spend some time resting and recuperating. Rancisis also acknowledged that, although Vos' information had been limited, his insight into Dooku's mind would greatly help the Thisspiasian strategize and plan against the Separatist leader."}, {"tag": "p", "text": "While on Coruscant, Rancisis joined several other Councilors to hear a report from Obi-Wan Kenobi regarding a potential intelligence lead from a close friend, diner owner Dexter Jettster. Although Jettster had not hinted at any details, as he had been speaking with Kenobi over an unsecured comlink, Rancisis and the others agreed that Kenobi should meet with his friend. Following a terrorist bombing on Coruscant orchestrated by Count Dooku, Rancisis attended a full High Council session in which Anakin Skywalker reported the information from Jettster in the absence of Kenobi, who had been wounded in the bombings. According to Jettster's intelligence, General Grievous was preparing to strike at the Republic-loyal world Bothawui, home to the vital Bothan Spynet. Although some Council members doubted the information's authenticity, Skywalker was adamant that it was accurate. After Skywalker left the High Council Chamber, Rancisis, like the rest of his colleagues, deferred to the judgment of Mace Windu and Yoda about how to address the threat and retired for the night. Windu and Yoda devised a plan for Skywalker to lead a battle group to mount a defense of Bothawui, and Skywalker was successful in preventing Grievous from capturing the strategic world."}, {"tag": "p", "text": "When the Bardottan species contacted the Republic for aid, as their Dagoyan Masters—Force mystics—had vanished, Chancellor Palpatine contacted the Council and suggested that a Jedi be sent along with Representative Jar Jar Binks to Bardotta. Rancisis attended the meeting, where despite the Bardottans' distrust of the Jedi, Master Windu decided to accompany Binks to Bardotta. Shortly thereafter, Plo Koon discovered Master Sifo-Dyas's crashed shuttle on a desert moon of the planet Oba Diah, and Rancisis was present when Koon reported his findings to the Council. Further investigation into Sifo-Dyas's death uncovered the fact that Dooku had murdered Sifo-Dyas before the Clone Wars and had purposefully worked to draw the Republic into the intergalactic conflict. Troubled by the revelation, the Council gathered to discuss it, but during the meeting, Yoda seemed particularly distracted. After the meeting, Kenobi, Rancisis, Unduli, and Secura were talking in the halls when Mace Windu interrupted their conversation to speak with Kenobi. Yoda soon met with the Council and asked them to meditate with him in order to confirm his belief that the spirit of Qui-Gon Jinn was contacting him from beyond death, and the Council remained there for over a day, to no avail. The other Councilors began to consider the possibility that Yoda was affected by the dark side, so Yoda underwent medical testing."}, {"tag": "h4", "text": "Siege of Saleucami"}, {"tag": "p", "text": "Rancisis and the Republic soon received information of a new Separatist threat brewing on the Outer Rim world of Saleucami. Tholme, acting on information he had learned during his mission to Anzat, had unearthed a plot orchestrated by Dooku and one of his Dark Acolytes, former Jedi Master Sora Bulq, to create a clone army of Morgukai warriors, trained by Anzati assassins. Cloned from the Kajain'sa'Nikto Bok, the warriors wore cortosis armor, and Rancisis and the Order knew that they would be a threat to the Jedi. Tholme's transmission was cut short after a duel with Sora Bulq, so Rancisis was unsure of his condition. Chancellor Palpatine was informed of the \"Shadow Army,\" as it had been dubbed, and he authorized the Jedi Council to send troops to deal with it—knowing that both Bulq and the Morgukai clones needed to be defeated, they sent three battalions, and placed Rancisis in overall command of the Republic forces."}, {"tag": "p", "text": "Rancisis wanted Quinlan Vos to be his second-in-command, as the Kiffar Jedi had had prior dealings with both the Anzati and Morgukai. He was knowledgeable about both groups, and Rancisis also chose him because he was Tholme's former Padawan. When Rancisis showed Vos Tholme's transmission, the Kiffar stated his belief that Tholme had survived, and was attempting to harass and disrupt Bulq's operations on Saleucami. Vos offered to travel to Saleucami himself, but Rancisis informed him of the Council and Palpatine's commands, as well as his selection of Vos as his right-hand-man; there was no time to deliberate, as the battalions were ready to leave immediately. Vos accepted, and Rancisis led his forces to Saleucami, beginning what became known as the Outer Rim Sieges."}, {"tag": "p", "text": "Thousands upon thousands of clones, vehicles, ships and weapons, were taken to Saleucami, and a Republic headquarters was established for Rancisis to coordinate the fighting through battle meditation. Bulq's encampment was heavily fortified and shielded, and the harsh terrain of barren Saleucami made for a prolonged conflict. Rancisis used the Force to gain a sense of the battlefield, to know when and where to strike, and to foresee the eventual outcome. Republic forces, led by Vos and other Jedi, attacked on the ground, while Sagoro Autem commanded from space, but, despite the loss of many lives, including several Jedi, they could not penetrate Bulq's caldera headquarters in Saleucami's main city, which was guarded by a perimeter shield generator and swaths of ion cannons. After fives months of laying siege to Bulq's fortress, to no avail, Rancisis' forces were running extremely low on supplies, much of which had to be used to feed refugees from Saleucami's city."}, {"tag": "p", "text": "Rancisis had Vos and his contingent of Jedi Generals—Ausar Auset, Sian Jeisel, A'Sharad Hett, Xiaan Amersu, Aayla Secura, and K'Kruhk—attempt to disable the shield generator yet again during one skirmish, telling them that, through his meditation, he had seen that a path for them to follow would be carved. Many of the Jedi were skeptical, as the elusive path had been part of Rancisis' plan for months and had yet to be found. During the battle, however, Vos and Jeisel unearthed a path to the tunnels that would allow the Republic access to the caldera fortifications. Vos' forces were ultimately able to secure the caldera's rim, though the Separatist and Shadow Army forces had converged on the city's center, and were putting up a stiff resistance. During the battle, Rancisis went deeper into his battle meditation, exhausting himself in an attempt to see the likely outcome of both the battle and the war as a whole; however, some unknown factor that was at work eluded him, and the dark side clouded his vision."}, {"tag": "p", "text": "When the fighting reached a hiatus, Rancisis spoke via hologram with Sagoro Autem, who was commanding the Venator-class Star Destroyers in orbit around Saleucami, about the situation regarding supplies. The latest delivery had contained fewer supplies than Rancisis' forces had requested, and Autem commented that if they were not expending so much supplies on refugees, their situation would be less dire. Rancisis was quick to remind Autem that it was the Republic attacking the refugees' city, and that it was impossible to evacuate them offworld; Rancisis was a Jedi, and he would not ignore the needy and let them starve. The Thisspiasian's meeting with Autem was cut short by the arrival of Quinlan Vos, who had come to report on the day's events. Vos reported that the Separatist headquarters were impenetrable as long as the shield generator remained, but that the Separatists were unable to leave Saleucami and attack other Republic worlds. Rancisis was content with this, but Vos explained that the Republic and Jedi forces could not continue for much longer without respite."}, {"tag": "p", "text": "Rancisis had a plan, but he refused to share it with anyone, even Vos—if the CIS caught wind of it, victory on Saleucami would be nigh impossible. A key part of the plan involved getting someone inside the Separatist compound to attack from within, but all efforts to do so had thus far ended in failure. Vos and Secura, both former Padawans of Tholme, informed Rancisis that their Force bond with him had not indicated that he was dead, and that if they could make contact with Tholme he might act as their inside man, but Rancisis was skeptical."}, {"tag": "h3", "text": "Death and legacy"}, {"tag": "p", "text": "When the Republic forces had recuperated, they launched another assault on the Separatists, attacking the city center. Rancisis coordinated the battle from within the Republic stronghold, using his last reserves of energy to maintain his battle meditation. During the fighting, his chamber was infiltrated by several elite Anzati assassins, seemingly sent by Sora Bulq to slay Rancisis. The Thisspiasian Jedi Master realized their presence through the Force before they could attack, and began to fight them off, despite his exhaustion. Using whatever weapons he could muster—the Force, his lightsaber, his long tail and his four arms—he clashed with the Anzati, killing many, until just one remained."}, {"tag": "p", "text": "Rancisis told the remaining Anzati, Rath Kelkko, that he would accept his surrender, or kill him—it made no difference to the Jedi Master. Kelkko recognized Rancisis' tired condition, and confidently attacked, expressing his regret that he would not be able to consume his \"soup\" as Rancisis was too dangerous to be kept alive. With one last throw of the chance cube, Rancisis used his tail to send Kelkko sprawling across the room; the Anzati perished when he collided with an energy barrier. As Rancisis watched him die, however, he was stabbed in the back by Sora Bulq; the entire Anzati attack had been a ruse, intended to distract Rancisis so that Bulq could enter the room without the Force alerting the Thisspiasian to his presence. Rancisis became one with the Force, and his death was sensed by all the Jedi on Saleucami."}, {"tag": "p", "text": "Jeisel, Hett, K'Kruhk and the other Jedi were the first to find Rancisis in his chambers, and despite K'Kruhk's efforts to heal Rancisis with the Force, they could do nothing to save him. Vos had been in the Separatist headquarters at the time of Rancisis' death, and some of the Jedi, such as Sian Jeisel, suspected that he was the killer. Vos, however, pointed out that as Rancisis' second-in-command, he had had ample opportunity to kill the Jedi Master, and that he would have made sure not to implicate himself. Jeisel eventually used the Force to learn that Vos was innocent, and accepted that he had played no part in Rancisis' death. However, the Jedi were still in a predicament—Rancisis had not revealed his plans to anyone, and they believed that the Republic's war effort on Saleucami would fail without his intricate strategies."}, {"tag": "p", "text": "Quinlan Vos claimed that he could use his psychometry—a Force ability possessed by his species that allowed a user to view memories off inanimate objects—to read Rancisis' plan from his dead body, though this was met by stern opposition by several of the other Jedi. K'Kruhk believed it would be disrespectful to Rancisis' person, but relented, and Vos appeared to have read Rancisis' plan from the Jedi Master's body—in actual fact, he was unable to read memories from organics, and had formulated his own plan, but he pretended it was Rancisis' so that the Republic would carry it out. The Jedi then cremated the body and held a funeral for the Thisspiasian, also remembering the other Jedi who had fallen on Saleucami."}, {"tag": "p", "text": "Vos' plan involved a three-pronged attack against the Separatist—simultaneous land and air attacks on the CIS base, while a small team of Jedi infiltrated Bulq's hideout and destroyed the shield generator. It was a risky plan, with potentially catastrophic results if the Jedi team was unsuccessful. Ultimately, the Jedi were successful, and Vos was able to slay Bulq. Nevertheless, Rancisis' death had a negative effect on the Republic's war effort, as they were without his elaborate strategies and his battle meditation. Obi-Wan Kenobi took his chair in the High Council Chamber."}, {"tag": "p", "text": "Rancisis died just months before Order 66 was issued to the clone troopers, who executed their Jedi Generals across the galaxy. The Jedi Order fell, and Chancellor Palpatine—actually Dark Lord of the Sith Darth Sidious—dissolved the Republic, with the approval of the Senate, and created the first Galactic Empire, becoming Emperor. Sidious had been culling the numbers of the Jedi Order slowly during his time, and he was the mysterious outside force that Rancisis and his peers detected during the Yinchorri Uprising. The Clone Wars had all been a machination of Palpatine's, designed to lay the foundations for the destruction of the Jedi Order, and Rancisis' contributions to the war effort had been in vain. He was not forgotten, however, and, decades later, his life was documented in a number of New Republic historical documents, as well as in a report on the Jedi written and compiled by Tionne Solusar. Rancisis' teachings on Malacia eventually fell into the hands of the New Jedi Order, as well."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Oppo Rancisis was extremely loyal to both the Jedi Order and the Republic. He could have accepted the throne on his homeworld at a relatively early age and lived a life of luxury and power, but he decided to continue with his Jedi training, and never looked back. He was wholly devoted to the Jedi, spending over a century teaching students and offering his tactical knowledge whenever he was requested to do so. He had the Republic's interests at heart, and the majority of his decisions while serving on the Council were in the interest of the Republic. During the crisis surrounding the Eriadu Trade Summit, Rancisis advised that the Council and Republic take no sides in the conflicts between the Trade Federation and the Nebula Front, and advocated the appeasement of the Senex sector, all so that the Republic would not lose support."}, {"tag": "p", "text": "Rancisis was conservative, more so than most of the other Councilors of his time, and he was strongly opposed to overlooking ancient traditions laid down by the Jedi of old. While many members of the Jedi Council were content to forgo the proper trials and promote Anakin Skywalker to Knighthood early, Rancisis was strongly opposed to it, as well as to a number of other concessions afforded to Kenobi's Padawan. However, by the time of the Clone Wars, he had realized the necessity of occasionally setting aside ancient Jedi tenets for the good of the Republic."}, {"tag": "p", "text": "Rancisis cared for all living beings, and was often at odds with non-Jedi military officers who had less compassionate natures. During the attack on Saleucami, Rancisis allocated much of his force's resources to feeding and sheltering refugees from the planet's main city, to such an extent that many of his subordinates feared there would not be enough for the Republic soldiers. Rancisis maintained his position that the refugees should be given precedence because it had been the Republic that had displaced them from their homes. He also demonstrated extreme persistence concerning his plan for victory. While using battle meditation, he had a vision of a path that would lead the Republic to Sora Bulq's headquarters, but, after attempts to find it were continually unsuccessful, many of the Jedi under his command wanted to give up and try a new strategy. Rancisis refused, and stuck with his original plan, which was ultimately a success."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Oppo Rancisis was talented in a number of Force powers unconventional among the Jedi, as well as in lightsaber combat and unarmed combat. Although he rarely used his lightsaber, preferring to orchestrate attacks from inside a headquarters or to use the Force against opponents, Rancisis fashioned the traditional weapon of the Jedi during his training, a simple green blade. Rancisis used the weapon to fight off the Anzati assassins who infiltrated his chambers and attacked him during the Clone Wars, killing or incapacitating all of them. Sora Bulq, who had once been among the most talented swordsbeings of the Jedi Order, acknowledged Rancisis' skill with a blade, and, thus, opted not to engage him in direct combat but to instead use subterfuge to kill him. Rancisis' lightsaber abilities were augmented by his skills in hand-to-hand combat; he used any part of his body that he could to attack any enemies, including his four hands and his tail. He was strong enough in unarmed combat to defeat the Blood Monarch on Thisspias in an honor duel during the Clone Wars."}, {"tag": "p", "text": "A military mastermind, Rancisis was one of the few Jedi of his time to master the ancient Jedi art of battle meditation, an ability that was over 5,000 years old when he learned it, and known to be used by the famous Jedi of old, including Odan-Urr, Nomi Sunrider, Thon, and Arca Jeth. In Tionne Solusar's documents about battle meditation, she listed Rancisis among those Jedi, suggesting that he was very skilled at using the power. Yarael Poof was another practitioner of battle meditation alive in Rancisis' era, and the two used it together to help Republic forces on Troiken during the Stark Hyperspace War. The power allowed the user to envision his or her desired outcome of any current battle, and, if properly used, this vision could be made to come through, via subtly altering the odds against the user's enemies, sapping their morale and boosting his or her allies' courage. Rancisis used the power to great effect during the attack on Saleucami; he also used it to attempt to view the outcome of the entire war, though it was stopped by another factor: the Dark Lord of the Sith, Darth Sidious."}, {"tag": "p", "text": "The unconventional Jedi power of Malacia, which many Jedi opted not to learn, preferring to use simpler methods instead, was a specialty of Rancisis', and he taught it in the Jedi Temple for many decades. The power was used predominantly as a defense mechanism; it caused no permanent effects, but turned a victim's equilibrium against him or herself, inducing incapacitating nausea and dizziness for several minutes—enough time for those who were being attacked to escape. Most Jedi found it easier to employ powers like affect mind or Force push to halt attacking enemies, but many of Malacia's proponents argued that the power might have benefited some of its victims—it reminded thugs that they, like their prey, were not invincible."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Conception"}, {"tag": "p", "text": "Oppo Rancisis was created for Star Wars: Episode I The Phantom Menace, in 1999. The character was designed by storyboard artist Benton Jew, who based him upon a picture of an old, bearded man from a Chinese calendar in the home of Jew's grandparents. Jew made several modifications to the picture, adding green skin and a long tail, but Rancisis still greatly resembled the man in the picture. Rancisis first appeared in the novelization of The Phantom Menace, written by Terry Brooks and published in April 1999. He was portrayed by Jerome Blake in the film, though Blake had no dialogue. Rancisis returned in Star Wars: Episode II Attack of the Clones, though he did not feature in the Battle of Geonosis scenes, unlike most of the other Jedi in the film. The character's appearance in Attack of the Clones was achieved through the use of archive footage from The Phantom Menace with minor CGI alterations; in Attack of the Clones, he curls his tail, something that did not occur in The Phantom Menace. Rancisis did not return for Revenge of the Sith."}, {"tag": "p", "text": "Rancisis has appeared in numerous spin-off material since, mainly comics released by Dark Horse. He had minor roles in a number of Star Wars: Republic issues, as well as in Jedi Council: Acts of War and Qui-Gon and Obi-Wan: Last Stand on Ord Mantell, shortly after The Phantom Menace. In the lead-up to Attack of the Clones, he played a more important role in James Luceno's Cloak of Deception and appeared in two segments of Pablo Hidalgo and Paul Ens's HoloNet News articles. Rancisis made many appearances in Clone Wars works, including several issues of Republic, Jedi: Yoda, Jude Watson's Legacy of the Jedi, and Clone Wars Chapter 21. During Clone Wars Chapter 21, he was voiced by Fred Tatasciore. Rancisis played a far more important role in John Ostrander and Jan Duursema's Siege of Saleucami arc of Republic, released in March 2005. The Siege of Saleucami killed off Rancisis, as it was decided he would not return for Revenge of the Sith. Despite this, he erroneously appears in Douglas Wheatley's comic adaptation of Revenge of the Sith, set months after his death."}, {"tag": "h3", "text": "Other material"}, {"tag": "p", "text": "Rancisis is the only Jedi Council member from Attack of the Clones whose part in the Battle of Geonosis has never been documented; the majority of the Council appears in the Geonosis scenes of the film, while other material has established the roles of all others, bar Rancisis. There is also an inconsistency surrounding Rancisis' ascension to the Jedi Council. Both the Power of the Jedi Sourcebook and The New Essential Guide to Characters establish that Rancisis was given a place on the Council after the Stark Hyperspace War, but this is contradicted by Legacy of the Jedi, which has Rancisis on the Council almost fifty years prior, and Star Wars: Republic: The Stark Hyperspace War, which shows that Rancisis is a member of the Council during the conflict."}, {"tag": "p", "text": "In March 2012, Series Director Dave Filoni confirmed that Rancisis would appear on a future episode of the Star Wars: The Clone Wars television series, as his character model had been developed for the series with a maquette from sculptor Darren Marshall. The episodes featuring Rancisis's debut were released in March 2014 as part of the series' sixth and final season."}, {"tag": "p", "text": "Rancisis appears in \"Yaddle's Tale: The One Below\", a short comic featured in Star Wars Tales 5. The canonicity of Tales stories is dubious, but The One Below has been referenced in several sources, including Cloak of Deception and The Official Star Wars Fact File, though Rancisis' part in it has yet to be referenced. However, it is impossible for Rancisis to canonically appear in the story without altering his backstory, as he appears on the Jedi Council in the The One Below, even though other sources establish that Yaddle was his Master. The story is also set around the time of Rancisis' birth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}