{"url": "Attack_of_the_Clones_(painting)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Paintings and posters"], "nodes": [{"tag": "h1", "text": "Attack of the Clones (painting)"}, {"tag": "p", "text": "Attack of the Clones was a painting available in the galaxy sometime after the Battle of Yavin during the Galactic Civil War. The painting portrayed Jedi Padawan Anakin Skywalker, Jedi Knight Obi-Wan Kenobi, Jedi Masters Yoda and Mace Windu, Naboo Senator Padmé Amidala, bounty hunter Jango Fett, astromech droid R2-D2, protocol droid C-3PO, clone troopers of the Grand Army of the Republic, and various Confederacy of Independent Systems war machines."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The painting Attack of the Clones depicted individuals and groups that were involved in the Battle of Geonosis during the Clone Wars. This included Jedi Padawan Anakin Skywalker, Jedi Knight Obi-Wan Kenobi, Jedi Masters Yoda and Mace Windu, Senator Padmé Amidala of the planet Naboo, bounty hunter Jango Fett, astromech droid R2-D2, and protocol droid C-3PO. The painting also depicted clone troopers and LAAT/i gunships of the Grand Army of the Republic engaged in battle with B1-Series battle droids, droidekas, and OG-9 homing spider droids of the Separatist Droid Army."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One of many paintings and other pieces of art available in the galaxy, Attack of the Clones was most prevalent during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. The painting appeared sometime after the Battle of Yavin, which took place in 0 BBY and was a pivotal conflict in the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Attack of the Clones appeared in the 2003 video game Star Wars Galaxies: An Empire Divided. It was a reward from the \"Buddy Token\" system. Players who invited others to play Star Wars Galaxies were awarded these Buddy Tokens once the people they had invited purchased the game and a subscription. One token was rewarded for each person they invited. The inviting player could then redeem the tokens for this painting and other rewards, including two other paintings and a Light Bending BARC Speeder. The painting required two Buddy Tokens to acquire. It could be used in one of the player's personal structures as decoration. The painting is actually a cropped version of the theatrical poster for Star Wars: Episode II Attack of the Clones, and, since it depicts an out-of-universe image, its canon status is ambiguous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}