{"url": "Orbalisk", "categories": ["Category:Legends articles", "Category:Arthropods", "Category:Blaster-resistant creatures", "Category:Creatures of Dxun", "Category:Jungle and forest creatures", "Category:Lightsaber-resistant creatures", "Category:Non-sentient species", "Category:Parasitic creatures"], "nodes": [{"tag": "h1", "text": "Orbalisk"}, {"tag": "p", "text": "An orbalisk was a parasitic creature found on Dxun that lived in groups. They lay inactive in caves or other dark places, until they found a suitable host creature on whose skin they would attach themselves to in order to feed. Orbalisks, once attached to a host, would multiply and grow, eventually enveloping and suffocating their victim. However, the holocron of Freedon Nadd contained the knowledge to make armament to prevent the orbalisks from covering the face, hands, and feet of the host, allowing them to keep this armor hidden."}, {"tag": "p", "text": "Perhaps by nature or as a result of residing on Dxun (which was itself a great focus of dark side power), orbalisks were able to feed on the Force-sensitivity of darksiders. It was said that the orbalisk armor's durability was such that lightsabers had a hard time penetrating it, making a wearer basically immune to lightsaber attacks. The only weakness to this armor were the exposed joints at the neck and wrists, but these gaps were so small a lightsaber could only barely slice through. However, orbalisk armor was unable to protect the wearer from electricity, as Darth Bane discovered when he was attacked by Umbaran Shadow Assassins wielding Force pikes. However, the Orbalisks did offer some limited protection from the electrical shocks; despite being set to kill, the force pikes did not deliver a strong enough charge to subdue Bane. Orbalisks caused the wearer to feel pain, fueling the wearers dark side power and if they were removed or killed, they would release a highly potent toxin into the host's body."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "\"Orbalisk\" was a Nikto word, suggesting the creatures might have originated in Kintan. Orbalisks were poisonous to average beings, and caused extreme physical pain to their host. Darth Bane, however, was able to remain alive by allowing the orbalisks to feed off the dark side energy in his body. In turn, the orbalisks sent a constant massive surge of adrenaline and other enzymes into his bloodstream, increasing his already considerable physical strength and enabling him to draw on even more dark side energy. However, this cycle could cause Bane to go into a fit of mindless rage if he did not keep his anger under control. The orbalisks also released other chemicals that enabled Bane to heal almost instantly from virtually any wound, even those inflicted by a lightsaber. Because of their benefits to their host, the orbalisks in a sense shared a symbiotic rather than parasitic relationship with Bane."}, {"tag": "p", "text": "Only electricity proved to be dangerous to the orbalisk and its host—if at a high enough voltage—although orbalisks attached to Darth Bane could harmlessly absorb over a million volts. When orbalisks died, they released toxins into the body of the host killing him/her within days or hours (depending on the strength of the individual)."}, {"tag": "p", "text": "Orbalisks could be removed from the host, but the task was both challenging and could potentially kill the host. The host had to be in very good health in order to even attempt it. The first crucial step to remove a living orbalisk was to send an electric jolt—powerful enough to stun the orbalisk but not harm its host—through its small underbelly, resulting in the orbalisk weakening the adhesive it used to bind itself onto the host. After the orbalisks were removed, they could be disposed of by electrocution. For a period of 10 years, Bane wore orbalisks that had attached themselves to him as living armor. In 990 BBY, Caleb removed many of the orbalisks covering Bane's body with such a method after many of the parasites were killed by the Sith Lord's own Force lightning in a duel against five Jedi. When the New Republic was founded nearly a millennium later, the Coruscant Livestock Exchange and Exhibition featured these creatures along with energy spiders and drochs in its arthropod exhibit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Orbalisks first appeared in Kevin J. Anderson's short story, Bane of the Sith in 2001. Bane of the Sith was adapted into Drew Karpyshyn's novel, Darth Bane: Rule of Two. They play a major part in the story, and link into a sub-plot for the final novel. They are also seen in Legacy 5, when Darth Krayt consults the holocrons of Darth Andeddu, Darth Nihilus and Darth Bane, as the gatekeeper of Bane's holocron appears wearing orbalisk armor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}