{"url": "OrbaLin", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles in need of updating", "Category:Archivists", "Category:Jedi of the Jedi Order", "Category:Males", "Category:Ugors"], "nodes": [{"tag": "h1", "text": "OrbaLin"}, {"tag": "p", "text": "OrbaLin was a male Ugor Jedi archivist who lived during the High Republic Era. Serving aboard the Starlight Beacon space station, OrbaLin led the autopsy of a Hutt trader whose corpse had been found on a derelict starship after a Nihil attack. Later, OrbaLin represented Starlight's Jedi at the Valo Republic Fair while Marshal Avar Kriss was off fighting the Drengir, and fought Nihil raiders during their attack. Due to the largely formless nature of his species, OrbaLin wore an environment suit in order to function in environments tolerable to humans and near-humans."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "OrbaLin, a male Ugor, was the first member of his species to ever join the Jedi Order. During the High Republic Era, he became the resident Jedi archivist aboard the Starlight Beacon space station. At the station's dedication ceremony, OrbaLin encountered recently elevated Jedi Master Elzar Mann and had a conversation with him, although Mann found him boring. OrbaLin oversaw the autopsy of a Hutt who had been found on a derelict starship after a Nihil attack alongside Jedi Knight Vernestra Rwoh and her Padawan, Imri Cantaros."}, {"tag": "p", "text": "While the autopsy was ongoing, OrbaLin assured Jedi Master Estala Maru that they were following strict quarantine procedures. However, he found that the attack had not been what killed the Hutt; instead, its systems had seemingly been infected by a root system. As OrbaLin reported the findings to Maru, the Hutt's corpse exploded, releasing the sentient carnivorous plants known as the Drengir, who proceeded to attack the station."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An Ugor male, OrbaLin wore an environment suit in most locations in order to maintain a humanoid form, using pseudopods to animate the suit and to move. His true form was green and amorphous. He enjoyed bursting into lectures about historical subject and the artifacts he looked after, although Master Elzar Mann considered him capable of boring the wings off of a Drethi. The archivist was insistent on the importance of proper procedure, but also somewhat witty, interrupting Cantaros complaining about how disgusting he found the autopsy to point out that the Padawan had had a good question regarding the causes of the Hutt's death. He was stoic in the face of danger, reacting to a Drengir attack by telling Maru that the station's quarantine measures were about to be tested to their limits."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "OrbaLin was experienced in the use of Force powers such as telekinesis, as well as lightsaber combat. When his environment suit was breached during a fight with Nihil, the archivist used the amorphous nature of his true form against his opponents to a considerable advantage."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "OrbaLin wore a white environment suit with gold detailing and brown gloves and belt, and a domed blue helmet with two breathing tubes. The suit had a compartment in one sleeve for OrbaLin's short lightsaber. During the autopsy, he rode a one-person repulsorlift platform with an attached control panel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}