{"url": "Oranessan", "categories": ["Category:Legends articles", "Category:Grumani sector planets", "Category:Outer Rim Territories planets on the Hydian Way", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Oranessan"}, {"tag": "p", "text": "Oranessan was a planet that was located in the Grumani sector."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Oranessan was a clouded, stormy world, that was located near to the termini of a number of different hyperspace routes. The world was also polluted and ravaged."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Between 3701 BBY and 3699 BBY, the Hydian Way was charted through Oranessan as part of the Seswenna Expansion."}, {"tag": "p", "text": "During the New Sith Wars, Oranessan fell under the control of the Daimanate, a Sith state that was ruled by the Sith Lord Daiman. The Sith Lord used Oranessan as a transport center, from which support vessels were dispatched to the Daimanate frontiers. However, due to its distance from the Daimanate borders, the planet was only lightly defended."}, {"tag": "p", "text": "The Jedi planned to carry out a raid on Oranessan, but when the Order received word that baradium mining operations had commenced on the Daimanate world Chelloa, they instead planned to make a strike against the Sith on Chelloa, with the Oranessan operation constituting the first stage of the attack. The mission became known as Operation Influx and was put into action in 1032 BBY by a team of Jedi under the command of Jedi Master Vannar Treece. The Jedi inserted on Oranessan in a captured Daimanate personnel shuttle, and while posing as pilots, Treece and the Jedi Kerra Holt and Dorvin Eltrom commandeered a Daimanate Heavy-Lift Starcrosser from the Sith transport landing zone. The Jedi planned to use the transport to take them to Chelloa, but discovered that the transport's navigation computer was missing its activation cylinder. Holt stole a replacement cylinder from a nearby hangar, and after fitting the device, the Jedi departed Oranessan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}