{"url": "Orbital_Defense_Command_Center", "categories": ["Category:Legends articles", "Category:Buildings", "Category:Sith Empire military bases", "Category:Ziost locations"], "nodes": [{"tag": "h1", "text": "Orbital Defense Command Center"}, {"tag": "p", "text": "The Orbital Defense Command Center was a military base located on the Sith-controlled planet of Ziost during the Galactic War. At some point, following the world's capital city's construction, the command center was constructed, and went on to serve a number of purposes, including, but not limited to, local headquarters for Imperial Intelligence, planetary customs, and air traffic control of the system. It also served gubernatorial purposes. Eventually, the headquarters of the Ministry of Logistics would relocate to the building."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Orbital Command Center was constructed following the Sith reconquest of their ancient capital world of Ziost at some point before or during the Great Galactic War. Although the empire's capital had relocated to Dromund Kaas, Ziost once more became an important planet in Sith buffer space. The Orbital Command Center became the primary government building on the planet, functioning as a military headquarters and a governor's residence."}, {"tag": "p", "text": "During the Cold War, the Sith Ministry of Logistics relocated from Dromund Kaas to Ziost, and the minister set up an office in the Orbital Command Center, thus making it the main headquarters for the entire bureaucracy."}, {"tag": "p", "text": "The building was believed to be virtually impenetrable, being heavily fortified. But that was not entirely the case, as in 3640 BBY, SIS operative Theron Shan infiltrated the Orbital Command Center to steal a black cipher from the minister's office during Operation End Game. Not even Imperial security could stop the young agent from breaking into what was thought to be the most secure facility on-world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Orbital Defense Command Center was first introduced in the novel The Old Republic: Annihilation, released in 2012. In April 2015, Game Update 3.2: Rise of the Emperor introduced the planet Ziost to the video game Star Wars: The Old Republic, and featured an area named the \"Military Outpost.\" Dialogue in the game identifies the outpost as the Command Center, differing slightly from the description given in the novel."}, {"tag": "h2", "text": "Appearances"}]}