{"url": "Orbital_jumper", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:New Republic starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "Orbital jumper"}, {"tag": "p", "text": "The orbital jumper was a light shuttle produced by Poranji. Not hyperspace-capable, orbital jumpers were popular on Core Worlds such as Coruscant for travel in near-planetary space. Vessels of this type were used by high-ranking military and government officers for travel on short notice during the Black Fleet Crisis."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The orbital jumper was a three-meter-long light shuttle designed for short-range applications such as intercontinental travel or transit from the ground to orbital facilities like space stations and skyhooks. Unmodified units had only repulsorlift engines for primary motive power and had limited ion drives for maneuvering. This allowed a maximum atmospheric speed of 650 kilometers per hour without the ability to travel beyond orbital space. They were sold unarmed and were able to carry a total of four Human-sized beings, including the pilot. At 35,000 credits new or 20,000 credits used, the Poranji orbital jumper was the smallest ground-to-orbit craft licensed for use on Coruscant."}, {"tag": "p", "text": "Some units were upgraded to leave orbit and were capable of traveling as far as a nearby moon. This was not common, as there were numerous alternative methods of in-system travel that were faster, less expensive, and more efficient."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Poranji's orbital jumper model was first used around 16 ABY. They were considered a coveted status symbol among the youth of the Core Worlds. One vehicle of this class was parked at New Republic Admiral Ackbar's Coruscant residence on Victory Lake in the early stages of the Black Fleet Crisis. General Etahn A'baht found the ship appealing, and he was able to borrow it for his transit from Coruscant to his flagship, Intrepid. He quickly took a liking to the craft and asked his deck officer, Marty, to take good care of it."}, {"tag": "p", "text": "Leia Organa Solo also had an orbital jumper, which she used to visit retired Chief of State Mon Mothma later during the crisis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The orbital jumper first appeared in Before the Storm, the first book of 1996's The Black Fleet Crisis by Michael P. Kube-McDowell, and last appeared in the final book of that trilogy, Tyrant's Test. Specifications and a visual depiction were later provided in 1997's Cracken's Threat Dossier. After this, the ship made no appearances in any Star Wars products until the 2008 release of The Complete Star Wars Encyclopedia, which added no new information."}, {"tag": "p", "text": "The ship A'baht flies the jumper to is identified once in the story as the Glorious, but the Glorious had already been established as being away from Coruscant in pursuit of the Teljkon Vagabond, and A'baht's flagship was identified as the Intrepid both earlier and later in the book."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}