{"url": "Ord_Enisence/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Post-Ruusan Jedi Masters", "Category:Skrillings"], "nodes": [{"tag": "h1", "text": "Ord Enisence"}, {"tag": "p", "text": "Ord Enisence was a Skrilling male Jedi Master hailing from the planet Agriworld-2079. During the Clone Wars, Enisence was killed by the bounty hunter Cad Bane while fighting the Confederacy of Independent Systems far away from the galactic capital of Coruscant. He was later impersonated by the Clawdite Cato Parasitti, who assisted Bane in stealing a holocron from the Jedi Temple on Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ord Enisence, a male Skrilling native of the planet Agriworld-2079, was a Jedi Master during the Clone Wars. By the time of the conflict, he was considered to be rather old and hulking. In 22 BBY, he was targeted by the Sith Lord Darth Sidious, who had the bounty hunter Cad Bane kill Enisence while he was fighting against the Confederacy of Independent Systems far from the galactic capital of Coruscant."}, {"tag": "p", "text": "His dead body was subsequently brought to Coruscant and fell into the possession of Bane, who hoped to use it in his plot to steal a holocron from the Jedi Temple. Cato Parasitti, a Clawdite shapeshifter hired by Bane, assumed Enisence's appearance and infiltrated the Jedi Temple's Archives to provide Bane with inside information. Although Parasitti was ultimately captured, Bane was able to escape with the holocron."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Skrilling, Ord Enisence had the common skin color, green, and brown eyes. Enisence wore a rust-colored red and tan tunic which contained a collar, and the same colored boots."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Skrilling, Ord Enisence had powerful fingers with a crushing grip. He was proficient with both the Force and a lightsaber and possessed enough skill to become a Jedi Master."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ord Enisence was created for the Star Wars: The Clone Wars television series and appeared, although only as a corpse, in \"Holocron Heist,\" the first episode of the series' second season, which first aired on Cartoon Network on October 2, 2009. His first appearance, however, was in The Holocron Heist, a young readers book based on the episode and written by Rob Valois. He later received an entry in the 2010 Star Wars: The Clone Wars Character Encyclopedia."}, {"tag": "p", "text": "In the episode, Enisence—or rather Parasitti impersonating Enisence—was voiced by Dee Bradley Baker, who also voices all of the clone troopers in the series. The episode guide refers to Enisence as a Jedi Knight; however, The Holocron Heist book calls him a Jedi Master. Enisence was inspired by the design of Pote Snitkin, a Skrilling character who had originated in Star Wars: Episode VI Return of the Jedi."}, {"tag": "p", "text": "According to concept art by Kilian Plunkett, early candidates for Enisence's species included him being a Human, among other options."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}