{"url": "Ord_Mantell/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Black Sun locations", "Category:Bright Jewel system planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Ord Mantell locations", "Category:Ordnance/Regional Depots", "Category:Shadowports", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Ord Mantell"}, {"tag": "p", "text": "Ord Mantell was a terrestrial planet which was located into the Bright Jewel system of the Bright Jewel sector in the Mid Rim Territories. It was located near Anobis and was originally settled by the Galactic Republic circa 12,000 BBY as an Ordnance/Regional Depot."}, {"tag": "p", "text": "The planet was primarily known as a former industrial world, where large portions of the planet's surface was covered in immense junkyard fields, which served as the perfect lawless haven for many smugglers, mercenaries and bounty hunters of all stripes. Although a dangerous place, its strategic location on the Celanon Spur between the Expansion Region and the Outer Rim Territories gradually made the planet as the leading commercial hub not only of the Bright Jewel sector, but of the Dohu sector and Qiilura sector as well."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "Ord Mantell was known as the \"Heart of the Bright Jewel\", since it orbited the star Bright Jewel at the center of the Bright Jewel system. Two large moons and thirteen other satellites orbited the planet, to which was added the Jubilee Wheel."}, {"tag": "p", "text": "Over 70% of Ord Mantell's surface was covered with pink clouds. The cloud cover was tinged with pink when viewed from the planet's surface. This collection of natural wonders made Ord Mantell something of a tourist attraction, despite its seedier side. It was also the homeworld of the Mantellian Savrips and Mantellian flutterplumes, whose sentience was largely unnoticed or ignored."}, {"tag": "p", "text": "Ord Mantell's population was clustered in the low mesas and flat plains of the arid equatorial region. Coastal cities, including the capital Worlport, were known for their casinos and touristic attractions. Many spacers regarded this part of Ord Mantell as a safe port, and it attracted almost one billion tourists annually. Other metropolitan areas lacked address markings and were considered not intended for outsiders. The thinking behind this was that if you don't know where you're going, then you don't belong here. Thrill-seekers often visited the planet to participate in savrip-tracking expeditions. The Mantellian savrip could pose as a formidable opponent for even the most seasoned of hunters in Ord Mantell wildlife."}, {"tag": "p", "text": "Ord Mantell was considered to be in the middle of nowhere but, at the same time, it was located close to some major hyperspace trade routes, making it a thriving port. Futhermore, the planet was known for having clement banking laws and anyone could get a bank account easily. Combination of these factors made the planet very popular among criminal organizations. The planet was famous for its thick, outer cometary cloud, which glowed with a pinkish cast when viewed from space, ensuring its place as the site of the Blockade Runners Derby for nearly 100 years."}, {"tag": "h3", "text": "Surface"}, {"tag": "p", "text": "The planet had a temperate climate with a variety of different terrain types. The most remarkable were the plateaus peppering the surface, including the Ten Mile Plateau."}, {"tag": "p", "text": "The relative closeness of Ord Mantell's two large moons, which could easily be seen during the night and daytime, was responsible for the elevated tidal forces that affected the planet's dynamic landscape: groundquakes were common, which resulted in the planet being volcanically active and almost every landmass being dotted with mountain chains. Sandy beaches were rare, and the coastlines were mostly dominated by cliffs, rocks, and mudflats. Thus, mountains and islands were the distinct features of Ord Mantell's terrain."}, {"tag": "p", "text": "Outside the urban sprawl, the narrow equatorial band of starports, and the volcanic islands, Ord Mantell remained largely rural and low tech. The interior was present with smelters, scrap heaps, and a persistent brown haze from burning fossil fuels. Its extreme reliance on fossil fuels kept the planet quite barren; huge robotic coal yards remained to fuel the planet's cities, and immense junkyard fields, like the Scraplands, littered a large portion of the planetscape."}, {"tag": "h3", "text": "Environment"}, {"tag": "p", "text": "Since fossil fuels were the predominant energy source throughout most of the Old Republic era, massive amounts of greenhouse gases like carbon dioxide were in the Ord Mantellian atmosphere. As a result, Ord Mantell lacked polar icecaps, and the average global temperature was far above the pre-industrial level."}, {"tag": "p", "text": "The planet's polar regions were mostly dominated by a tundra landscape which consisted of many fjords, glaciers and mountains. In turn the tropical and temperate regions of Ord Mantell included the vast majority of its forests, seas, mountain chains and junkyard fields. The large robotic coal yards and factories emitted tons of different gases into the planet's atmosphere, polluting the air of Ord Mantell, especially in the immense junkyard fields of the planet's industrial zones."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Discovery"}, {"tag": "p", "text": "Ord Mantell was originally inhabited by the primitive but sentient Savrips. Circa 12,000 BBY, Ord Mantell was settled by Corellian colonists as an advance military and scouting base for the Galactic Republic. Established as an Ordnance/Regional Depot during the Pius Dea Crusades, with many military installations being built around the continent of Worlport, which in the following centuries provided the ground for the planet's capital city and other urban areas. Due to the aggressive nature of the Savrips and the expansionist beliefs of the outsiders, violent conflict arose between the groups almost immediately. The Savrips, outmatched in technology, were ultimately forced to flee into the wilderness of their homeworld. Beginning a propaganda campaign depicting the Savrips as dangerous beasts, the Republic placed bounties on the hides of Savrips which led to their near-extinction due to overhunting. With the Savrip population nearly depleted, the colonists were able to settle into their new home, mostly becoming farmers. Over time, the planet's fauna were driven back, and the world became something of a free port for all manner of freighters and cargo ships. The Republic eventually lost control of the colonists overtime, who embraced their obstinate Corellian attitudes and resisted foreign control."}, {"tag": "h3", "text": "Old Republic era"}, {"tag": "p", "text": "Ord Mantell was colonized as a an ordinance/regional depot during the Pius Dea Era. Despite the Mantellians' collective refusal to behave as civilized as the Galactic Senate wanted, the planet served as an ordinance/regional depot for centuries."}, {"tag": "p", "text": "During the Mandalorian Wars, Ord Mantell was the site of a battle won by the Mandalorian Neo-Crusaders."}, {"tag": "p", "text": "While never attacked outright during the Great Galactic War, Ord Mantell would become embroiled in scandal during the Cold War between the Republic and the Sith Empire. Several cabinet members were revealed to have accepted bribes by the Empire, causing the Galactic Senate to investigate and detain members of the cabinet on charges of treason. In 3653 BBY, a corrupt admiral sold off the local fleet, causing the Republic military to all but abandoned the planet. The planet became a haven for mercenaries, exiles, murderers and smugglers coming from the Hydian Way who sought out the Republic's military spaceports. Angered with the Republic's response to the cabinet scandal and the fleet's departure, many secessionist movements began to describe a free and independent Ord Mantell that could police its own government. As the cries for succession rose above all other politics, an armed civil war for independence racked the planet. The conflict was primarily focused near the Republic-aligned Fort Garnik in the Avilatan region where the Galactic Republic-backed elected government sought to defeat the Mantellian Separatist Movement through force. Based out of Fort Garnik, Republic and Mantellian troops sought to gain control of the volcano stronghold of the Separatists."}, {"tag": "p", "text": "During this period, corruption ran rampant throughout the Mantellian government and military. Lax ethics among both Republic and Mantellian officers damaged relations with civilians. In the local villages in Avilatan, public perception of the Republic and the Ord Mantell government was very low. Crime syndicates and smugglers utilized such corruption to operate on Ord Mantell freely. Republic and Mantellian officers did little to combat illegal trade, and some encouraged smuggling as a way to expedite shipping. One such crime syndicate, led by Rogun the Butcher, utilized Ord Mantell as a viable shipping depot. Although attempting to restore order, crime syndicates and Galactic Republic military forces destabilized the region as the local government attempted to reclaim the area. Several Republic Special Forces units were dispatched to deal with the crisis. Organized at Fort Garnik, Havoc Squad, led by Harron Tavus, was one such unit. Havoc Squad defected to the Sith Empire on Ord Mantell, stealing a prototype ZR-57 Orbital Strike Bomb."}, {"tag": "p", "text": "While the Separatists were fueled by fanaticism and self-righteous rage, the Republic military eventually overwhelmed the Separatist groups and encouraged them to lay down their arms. While peace returned to Ord Mantell, the scars of civil war would remain for millennia as abandoned battlefields reminded citizens of the past."}, {"tag": "h3", "text": "An era of peace"}, {"tag": "p", "text": "After 3700 BBY, Ord Mantell began to serve as a trade outpost for the region. Smugglers and black marketeers startes to establish their activity on the planet in that era. Despite the colonization of the New Territories by the Republic and efforts to create other trading worlds in the region, Ord Mantell remained the most powerful planet in the New Territories."}, {"tag": "p", "text": "While the planet was the site of a battle won by the Jedi during the New Sith Wars, Ord Mantell remained at peace since the time of the Great Galactic War. Despite being considered a shadowport, the world was a profitable member of the Republic. While rarely sending its senators to Coruscant, Ord Mantell maintained its position in the galactic economy through untaxed criminal enterprise."}, {"tag": "p", "text": "Circa 37 BBY, Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi were assigned to investigate a missing cargo ship. The investigation led them to Ord Mantell, where they encountered a ruthless land baron named Taxer Sundown, who controlled much of Ord Mantell's moisture-farming property. The intervention of the Jedi forced Sundown to try and flee Ord Mantell, though the resulting chase ended in a crash that broke Sundown's neck. This led to the discovery of a mind-control device being employed by Sundown, which, in addition to lightsaber-wielding enforcers, had convinced Mantellian farmers that he was a Jedi."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Before the start of the Clone Wars, Jedi Knight Pablo-Jill brought peace to the lawless world. Anakin Skywalker's fleet was ambushed by Separatist forces while making a supply run to the planet. Despite this, the overall lack of Republic presence on the world allowed for Black Sun to control the world and its criminal enterprises. The Shadow Collective seized this as an opportunity when the Clone Wars erupted across the galaxy, enveloping Black Sun and other criminals to amassing a large criminal empire. When the Confederacy of Independent Systems attempted to establish a stronghold on Ord Mantell, Darth Maul led the armies of the Shadow Collective against the droid army, and defeated both Count Dooku and General Grievous, before abandoning the world to the Republic."}, {"tag": "p", "text": "Afterward, Ord Mantell became the headquarters of the Republic 8th Sector Army and was used as a weapons storage facility, clone trooper barracks and fleet support by the Grand Army of the Republic and Republic Navy. Despite its prominent and profitable position in the Republic, the Senate still sought to bolster the manufacturing capacity on the planet to raise its tax revenue. Despite increased contributions to the Republic, the windfall was never as great as the Senate planned. Bribed to remain loyal through the rest of the war, the planet was kept within the fold by the Galactic Empire's great military might."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "During the Imperial era, Ord Mantell was the capital of the Bright Jewel Oversector, an Imperial Priority Sector created from the area of operations of the Republic 8th Army and ruled by Grand Moff Vanko."}, {"tag": "p", "text": "During the Galactic Civil War, Rebel Alliance operatives were able to secure a large cash tribute, given to the Empire by the House of Organa on Ord Mantell. Leia Organa was able to switch the loading instructions on the shipment so the Rebellion could use the money to fund a new base on Hoth."}, {"tag": "p", "text": "By the time of the Battle of Yavin, the Empire established a Naval staging area in the Ord Mantell space. Imperial warships moving through training maneuvers became common in the system. However, the Empire naval forces did not search for trouble with the inhabitants and smugglers."}, {"tag": "p", "text": "Following the Evacuation of Yavin, Renegade Squadron, Han Solo, and Chewbacca rendezvoused on the planet to repair damages sustained to their fleet. It was here that the squadron and Solo were attacked by IG-88 and Imperial forces in the Ord Mantell junkyards. However, the Rebels managed to escape. Although the planet claimed to be free of Imperial interest, Han Solo and Luke Skywalker, while on a different mission, discovered an Imperial fleet on maneuvers there."}, {"tag": "p", "text": "Before returning to Echo Base on Hoth, Han had a run-in with the bounty hunter Skorr on Ord Mantell. It was also at a starship scrapyard on Ord Mantell that Dash Rendar—working to locate information on Han Solo's whereabouts for Lando Calrissian after the debacle at Cloud City—ran into IG-88D and other bounty hunters trying to intercept Boba Fett, who was transporting Han Solo's frozen body to battle in the Ord Mantell junkyards."}, {"tag": "p", "text": "The Wookiee Chalmun used gambling profits earned on the planet to purchase his cantina in Mos Eisely."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "By 7 ABY, Ord Mantell was located in the heart of Imperial Space. However during the Post–Zsinj campaigns of 8 ABY, Admiral Ackbar secured a corridor to Ord Mantell and captured the planet. Ord Mantell attained membership in the New Republic in 8 ABY, and although the Republic launched extensive efforts to civilize the planet, it remained a center of illicit activities. The Republic also deployed an X-wing fighter wing to Ord Mantell to assist in ongoing skirmishes in its sector."}, {"tag": "p", "text": "Ord Mantell was attacked in the following year by Grand Admiral Thrawn as part of a tactic to keep the New Republic distracted. The planet was later briefly recaptured by the Empire just prior Operation Shadow Hand."}, {"tag": "p", "text": "During the Disciples of Ragnos crisis, information surfaced about a large stockpile of Rebellion-era weapons caches hidden in the wastes of the planet. Jaden Korr was sent to destroy the stockpiles so they didn't fall into the wrong hands; during the mission he battled Boba Fett, who wished to capture the weapons for himself. Han Solo returned to Ord Mantell between 23 and 24 ABY aboard the Millennium Falcon to act as a judge in the Blockade Runner Race. During this visit, they encountered Anja Gallandro, who believed that Solo had murdered her father. Gallandro used this to try and coerce Solo in mediating a violent dispute between miners and farmers on her home world of Anobis."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "During the Yuuzhan Vong invasion of the galaxy, Ord Mantell was approached by the New Republic to help alleviate the overwhelming rush of refugees fleeing the battle zones. Like many refugee worlds early in the war, it was eventually overrun by the Yuuzhan Vong who also caused severe damage to the orbiting space station, the Jubilee Wheel. The planet was eventually liberated by a band of soldiers wearing Mandalorian armor. It was believed that their leader was none other than Boba Fett himself, although only Han Solo had any evidence to support this rumor."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "h3", "text": "Mantellian Savrips"}, {"tag": "p", "text": "Until 12,000 BBY, when the Galactic Republic started to colonize the planet, the native Savrips were the predominant sentients on the planet. Despite being a predator and ferocious the Savrip almost came to an extinction because of the legal hunting that took place on Ord Mantell during the Old Republic era. Fortunately in the New Republic era the Ord Mantellian government passed a chain of laws that forbade the hunting of the Savrip in order to preserve the existence of the remaining native species."}, {"tag": "h3", "text": "Immigrated species"}, {"tag": "p", "text": "The inhabitants of Ord Mantell were known as Mantellians, which made up a variety of different immigrated species. Although originally settled by Human colonists from Corellia, with time Ord Mantell also became a haven for a large number of Zabraks, Ithorians, Sullustans, Rodians, Bothans, Devaronians and many more exotic species who mostly lived in the urban sprawls of Worlport. While there were many segregated villages and communities beyond the capital, no species dominated the world. Thus, the Mantellian society remained mostly cosmopolitan."}, {"tag": "p", "text": "Despite its status as a military outpost in the Mid Rim, throughout most of its history the lawless world served as a magnet for criminals of all stripes—pickpockets and smugglers frequently enjoyed the shining casinos in Worlport, while pirates and other mercenaries preferred to stay in the barren outback. Even assassin droids were common to the planet's surface, mostly lurking in the industrial junkyards of the Scraplands. Because of the nature of the world, many Mantellians prized privacy and often operated under simple pseudonyms while dealing with strangers. Resisting the urge to form strong bonds with others until trust was firmly established, Mantellians were otherwise cordial."}, {"tag": "h3", "text": "Government and politics"}, {"tag": "p", "text": "The Mantellian central government was known as the Ord Mantell Central Authority, which during the Separatist War, thousands of years prior to the rise of the Galactic Empire, was located in the Republic's military base of Fort Garnik."}, {"tag": "p", "text": "In turn during the post-Imperial era the central government was relocated to Worlport, which was primarily located in the Government Circle nearby the Morro Spaceport. The Mantellian government was headed by a governor which together with the remaining delegates of the Ord Mantell Central Authority implemented the executive and legislative powers of the Mantellian society."}, {"tag": "p", "text": "Although the central government had to promote investments, make interplanetary trade deals, pass laws and tax the inhabitants, throughout the centuries one of its main problems was the high corruption level which was found in nearly every Mantellian government, and served as one of the main reasons why progress and development of Ord Mantell was slower than expected."}, {"tag": "h3", "text": "Economy"}, {"tag": "p", "text": "The economy of Ord Mantell during the Old Republic era was mostly concentrated in the hands of the most effective crime syndicates on the planet. Together with the corrupt government, the syndicates controlled the planet's industry and the tariff prices of incoming and outgoing goods. Since Ord Mantell was located at the junction of the Celanon Spur and Entralla Route, the tariff prices continued to be the main income of the planet's economy, because apart from some manufactured weaponry and foodstuffs, Ord Mantell's industry could offer little of value to export. Despite the fact that over time Ord Mantell lost its strategic significance due to the expansion of new trade routes, the presence of military-quality starship yards and docks brought a thriving civilian cargo trade to the world."}, {"tag": "p", "text": "Planetary income during the Old Republic era also came from game hunters, who traveled from as far as Rodia to hunt the Mantellian Savrips. As the number of Savrips declined, contact with the colonists became less frequent, and hunters' interest in the world waned. Although the economy of Ord Mantell recovered from these losses, the Savrip population remained low. The absence of strong law enforcement, at least in the Old Republic era, prevented farmers from having an efficient agrarian industry and was the main reason Ord Mantell remained dependent on foreign food supplies, mostly from the agriworld of Anobis. Other luxury foodstuffs and beverages were imported from the nearby world of Qiilura, while high tech was mostly imported from the Core Worlds."}, {"tag": "p", "text": "Morro Spaceport, located in the central parts of the planet's capital of Worlport, served as the primary base of operations for incoming and outgoing goods."}, {"tag": "h3", "text": "Entertainment and sports"}, {"tag": "p", "text": "Apart from gambling in the casinos of Ord Mantell, hunting the native Savrips was popular during the days of the Old Republic. Also, since the planet contained a mountainous landscape of different altitudes, mountain climbing was considered a very popular activity in the Mantellian society."}, {"tag": "p", "text": "If one was affected by speed and fame, the Blockade Runners' Derby was the most prestige starship race in the Bright Jewel system. It was held annually on Ord Mantell and was considered one of the grandest and most daring races a pilot could enter. The course was run through the outer rim of the system, weaving through the outer cometary cloud. The course changed yearly, due to the orbital mechanics of the system."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Worlport"}, {"tag": "p", "text": "Worlport was the capital and largest city of Ord Mantell which served as the planet's main hub of commerce, finance, culture and entertainment. It also served as the planet's primary industrial center, employing many local residents and producing many manufactured goods like weapons, droids and pharmaceuticals for exports to other planetary systems."}, {"tag": "p", "text": "Worlport was also known for its Corellian architecture, which served as a legacy from its first settlers during the Old Republic era. It also was known for its many gambling districts, where Herglic's Folly was considered the most dangerous of all. Many famed casinos like the Lady Fate were located in these districts which attracted inhabitants of all stripes."}, {"tag": "p", "text": "Worlport was also the home of the Mantellian central government which was located in the Government Circle, and of the Morro Spaceport which served as the largest starport not only on Ord Mantell, but in the Bright Jewel sector as well. Thereby serving as the planet's center of trade and politics, Worlport was undoubtedly the busiest, safest, and most strategically important urban settlement on the planet's surface."}, {"tag": "h3", "text": "Scraplands"}, {"tag": "p", "text": "The Scraplands were a vast junkyard field located north of the planet's capital of Worlport. The vast territory was primarily known as an abandoned and inhospitable dumping ground consisting of several ancient industrial fields, salvage pits, abandoned shipyards, acid lakes and other manufactured waste, which was mostly created during the days of the Galactic Republic."}, {"tag": "p", "text": "As the largest planetary dumping ground, the Scraplands were also known as one of the most dangerous places on Ord Mantell — local Mantellian Savrip hunters, pirates, mercenaries and even assassin droids were known to inhabit the place. Thereby the safest way of traveling through the Scraplands was using an armored hovertrain rail system, which was constructed by the Mantellians to transport people and cargo to other outback territories and larger communities."}, {"tag": "p", "text": "Despite the consistent dangers of traveling the Scraplands, the vast territories of the junkyard fields also housed some of the well known geographical features outside of Worlport, like the Ten Mile Plateau, and small Jawaese settlements known as squats of which the colony of Yalawua was the most prominent."}, {"tag": "h3", "text": "Avilatan"}, {"tag": "p", "text": "Avilatan was a large volcanic and mountainous island located on Ord Mantell, which during the Separatist War served as the main battleground between the supporting fractions of the Galactic Republic and the reconstituted Sith Empire."}, {"tag": "p", "text": "The island was known to have a significant population of inhabitants which were mostly spread throughout the main urban settlements like Fort Garnik, Drelliad village, Oradam village and Talloran village. Also the nearby separate island of Mannett Point was known to house a large population of inhabitants, which during the Separatist War served as one of the main trading posts of Ord Mantell."}, {"tag": "p", "text": "Avilatan was also known as the location of Mount Avilatan, a former military stronghold and the highest mountain peak on the island. Also the Avilatan Badlands, known for its barren terrain, were located near the military base of Fort Garnik. In turn the fauna of Avilatan included the Mantellian flutterplume and many other unique species."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Ord Mantell in the Dufilvan sector (a misspelling of the Dufilvian sector) of the Outer Rim Territories. The Dufilvian sector is actually located in the Mid Rim."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}