{"url": "Attack_on_Coruscant%27s_Verity_District", "categories": ["Category:Canon articles", "Category:Battle stubs", "Category:Battles of Coruscant", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Attack on Coruscant's Verity District"}, {"tag": "p", "text": "The attack on Coruscant's Verity District was a mission undertaken by Colonel Soran Keize of the Galactic Empire's 204th Imperial Fighter Wing. Keize had learned of an extensive databank situated beneath the upper level Verity District of the capital planet Coruscant; the databank, maintained by Emperor Palpatine and cataloguing every criminal act and atrocity that Imperial personnel committed, had been used by the Messenger droids to provide orders for Operation: Cinder in the aftermath of the Emperor's death at the Battle of Endor. Believing that the nascent New Republic would use the data bank's records to prosecute former Imperials in the event that it won the Galactic Civil War, Keize intended to destroy it by destroying its supports and dropping it onto the district's lower levels. Yrica Quell, former TIE pilot of the 204th, deduced Keize's plan, and the New Republic dispatched her and the U-wing pilot Kairos to stop him."}, {"tag": "p", "text": "The attack, which occurred simultaneous to the Empire's last stand at the Battle of Jakku, saw Keize abandon his unit on his mission to destroy the databank. After breaking his way through the Imperial blockade in the Coruscant system, Keize descended toward the planet, and was later followed by Quell and Kairos. Though Imperial forces attempted to defend Coruscant, they were destroyed by both Keize and Quell, who proceeded to duel one another. With TIE fighters in pursuit, Kairos ejected from her U-wing shortly before it exploded, destroying many of her pursuers and damaging Keize's starfighter. Keize crashed, sustaining severe injuries, but intended to destroy the databank using proton warheads. Quell landed and confronted the dying Keize, preventing him from completing his mission. At the same time, the New Republic defeated the Empire at Jakku, subsequently sending Intelligence to study the databank."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}