{"url": "Ord_Pardron/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Dufilvian sector planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Low-gravity planets", "Category:New Republic planets", "Category:Ordnance/Regional Depots"], "nodes": [{"tag": "h1", "text": "Ord Pardron"}, {"tag": "p", "text": "Ord Pardron was a tiny planet with a thin atmosphere in the Ord Pardron system of the Dufilvian sector, located in the Mid Rim."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet was a rocky world with low gravity and a thin atmosphere, it was classified as an asteroid."}, {"tag": "p", "text": "It was rich in minerals and ores."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet was originally a Galactic Republic Ordnance/Regional Depot, lending the planet its name. It was heavily mined by the Republic and then the Empire."}, {"tag": "p", "text": "It was the site of a major New Republic military base, with approximately 68,000 troops, defending the Abrion and Dufilvian sectors. Grand Admiral Thrawn's forces hit many targets in the area at once, reducing Ord Pardron's own defenses to the bare minimum as it sent help to the devastated worlds. The base was, as a result, unable to assist Thrawn's true target, the planet Ukio. Ukio was captured, and the Ord Pardron base was severely damaged."}, {"tag": "p", "text": "Ord Pardron was also the homeworld of Dera Jynsol, one of Lando Calrissian's candidates for marriage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion refers to the planet as \"Ord Pardon.\" The game also mistakenly places the Dufilvan sector (a misspelling of the true Dufilvian sector) and, consequently, Ord Pardron, in the Outer Rim Territories. The planet was represented as a temperate world in Star Wars: Rebellion whereas the The Last Command Sourcebook clearly identified as an planetoid asteroid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}