{"url": "Order_65", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with non-canon elements", "Category:Contingency Orders for the Grand Army of the Republic"], "nodes": [{"tag": "h1", "text": "Order 65"}, {"tag": "p", "text": "Order 65 was one of the 150 contingency orders that the clone troopers of the Grand Army of the Republic were trained to carry out in the event of different emergency scenarios during the Clone Wars. Order 65 stated that if a majority of the Senate or the Security Council declared that the Supreme Chancellor—at that time Palpatine—was unfit for duty, the Chancellor was to be arrested or, if necessary, killed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Order 65 was the sixty-fifth of the 150 contingency orders developed by the Grand Army of the Republic during the Clone Wars against the Confederacy of Independent Systems. Like all 150 contingency orders—which dealt with a variety of different emergency situations—the clone troopers of the Grand Army were trained to carry out Order 65 without hesitation."}, {"tag": "p", "text": "Order 65 stated that if either a majority of the Galactic Senate or the Republic Security Council deemed the Supreme Chancellor—the Supreme Commander of the Grand Army and an office held by Palpatine during the war—unfit for duty, and if the clone forces directly received Order 65, then the army was to immediately arrest or, if needed, kill the Chancellor. Following this, command of the Grand Army would be given to the acting Chancellor until a stable replacement could be chosen."}, {"tag": "h3", "text": "Full text"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 19 BBY, 995 days after the Battle of Geonosis, clone commando RC-3222 indirectly mentioned Order 65 to squadmate RC-5108/8843 and Jedi General Etain Tur-Mukan during a conversation over the Grand Army's 150 contingency orders at the Republic's Special Operations Brigade Headquarters on Coruscant. However, Order 65 was never implemented during the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Order 65 was first mentioned in the Karen Traviss novel Republic Commando: True Colors—published in October 2007—when the full text of the contingency order was stated at the beginning of the novel's twentieth chapter. Order 65 was later indirectly mentioned in the novel Order 66: A Republic Commando Novel, published in September 2008."}, {"tag": "h3", "text": "Non-canon appearance"}, {"tag": "p", "text": "Order 65 was also mentioned in a non-canon advertisement for the Star Wars Miniatures: The Clone Wars set in Star Wars Insider 105, released in December 2008."}, {"tag": "p", "text": "Sometime around 21 BBY, after killing the Jedi hunter Durge and disabling the Separatist General Grievous in battle, a group of clone troopers under the command of Jedi Commander Ahsoka Tano wondered what their next orders were going to be. As the clones and Commander Tano were walking away from the immobilized Grievous, one of the clone troopers asked his squadmates whether they were up to either Order 64 or Order 65."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}