{"url": "Ord_Trasi/Legends", "categories": ["Category:Legends articles", "Category:Braxant Run", "Category:Confederacy of Independent Systems planets", "Category:Fortress worlds", "Category:Galactic Empire planets", "Category:Imperial Remnant planets", "Category:New Republic planets", "Category:Ordnance/Regional Depots", "Category:Pentastar Alignment planets", "Category:Planets with shipyards", "Category:Relgim sector planets", "Category:Type II atmosphere planets"], "nodes": [{"tag": "h1", "text": "Ord Trasi"}, {"tag": "p", "text": "Ord Trasi was a planet in the Relgim sector of the Outer Rim and a major shipbuilding world."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Conditions on the planet were favorable to a majority of the galaxy's citizens."}, {"tag": "p", "text": "Ord Trasi was a planet rich in natural resources: metals, minerals, ores and crystals. This allowed the planet to become a major shipbuilding world. Space platforms completely encircled the planet, defended in turn by a number of defense platforms. Mining and smelting was carried out by droid labor on the planet's two moons. Ord Trasi's resources also enabled the planet to be a manufacturer of weapons and communication gear."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ord Trasi was originally an Ordnance/Regional Depot fortress world of the Galactic Republic. Prior to the Great Sith War, Enforcer One was retired here."}, {"tag": "p", "text": "Established as a jump-off point and refueling depot for exploration missions, the Ord Trasi outpost saw heavy usage and gradually improved the level of its ship maintenance facilities, eventually becoming the major construction center. Ord Trasi itself was typical of most planets that serve as shipbuilding centers."}, {"tag": "p", "text": "Ord Trasi was the site of a battle during the Clone Wars."}, {"tag": "p", "text": "During the Imperial Period, Ord Trasi was primarily responsible for the construction of capital combat starships. By 4 ABY, the planet had become an Imperial fortress world. After the arrival of Thrawn, Ord Trasi's output was turned entirely to Imperial Star Destroyer production. By 9 ABY Wing Commander Diblen Harleys was investigating the information that at least three Imperial-class Star Destroyers were under construction at the shipyards there."}, {"tag": "p", "text": "Eventually captured by the New Republic in 17 ABY, Ord Trasi became the assembly point for General Garm Bel Iblis's task force which would participate in the Battle of Yaga Minor."}, {"tag": "p", "text": "The world was captured and occupied by the Yuuzhan Vong as they swept through the Outer Rim during the early stages of their invasion of the galaxy. Ord Trasi would later be liberated from the alien invaders by the Imperial Remnant and would remain under Imperial control."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Ord Trasi in the Dufilvan sector (a misspelling of the true Dufilvian sector)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}