{"url": "Ord_Wylan", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Mid Rim planets", "Category:Oktos sector", "Category:Ordnance/Regional Depots", "Category:The Slice planets"], "nodes": [{"tag": "h1", "text": "Ord Wylan"}, {"tag": "p", "text": "Ord Wylan was a world located in the Mid Rim's Oktos sector. During the Pius Dea Era, between 12,000 BBY and 11,000 BBY, it served as an Ordnance/Regional Depot outpost for the Galactic Republic. Shortly after the Battle of Yavin, the gambler Lando Calrissian won the license rights for the taxi service on Ord Wylan in a sabacc game but lost them shortly afterward."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ord Wylan was a world located in the Ord Wylan system, a part of the Oktos sector in the Slice portion of the Mid Rim."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ord Wylan served as an Ordnance/Regional Depot outpost for the Galactic Republic during the Pius Dea Era, a period of time that lasted between 12,000 BBY and 11,000 BBY, despite it being located just outside the borders of Republic space. Specifically, the world served as the launching point for Republic attacks against the Hutt-allied worlds of Toydaria and Circumtore, in the First Pius Dea Crusade of 11,965 BBY and the Thirty-Fourth Pius Dea Crusade of 11,057 BBY, respectively."}, {"tag": "p", "text": "Shortly after the Battle of Yavin millennia later, a taxi service existed on Ord Wylan, the license rights for which had become highly sought after. During that time, the gambler Lando Calrissian won the rights in a game of sabacc, although he lost them only moments later in a bet over the brand of liquor the players were drinking. By the date 36:1:16, that fact was mentioned in a news report by Cynabar's InfoNet, issued from the Nar Shaddaa Node on the Hutt Space moon Nar Shaddaa."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ord Wylan was first introduced by Paul Sudlow in the \"Galaxywide NewsNets\" feature of West End Games' Star Wars Adventure Journal 5, which was published in February 1995. The 2009 reference book The Essential Atlas placed the Ord Wylan system, and therefore the world itself, in grid square R-12."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}