{"url": "Ord_Tiddell/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Ordnance/Regional Depots", "Category:Tennuutta sector planets"], "nodes": [{"tag": "h1", "text": "Ord Tiddell"}, {"tag": "p", "text": "Ord Tiddell was a Mid Rim planet established as an Ordnance/Regional Depot by the Galactic Republic during the Pius Dea Era. In 22 BBY, the planet, home to a population of four million, became one of many worlds in the Mid Rim and Colonies regions to be affected by stone mites, genetically-engineered aggressive arthropods that fed on building materials. Unlike the other affected worlds, which reported only minor damage from the arthropods, Ord Tiddell was devastated. The mites ate through the foundation of Lagabee, Ord Tiddell's capital city, leaving the area in ruins and forcing the planet's population to flee off-world. The widespread destruction caused by the mites cost Ord Tiddell billions of credits, and many believed it was too late for any assistance from either the Republic or the Jedi Order to be effective."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Ord Tiddell was an Ordnance/Regional Depot in the Ord Tiddell system, a star system located in the Tennuutta sector of the Mid Rim. It fell into the region of space dubbed the Trans-Hydian, which comprised the portion of the galaxy located between the Hydian Way and the Perlemian Trade Route."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Discovered by the Galactic Republic prior to the Pius Dea Era, Ord Tiddell became an Ordnance/Regional Depot, one of many such military outposts established by the Republic on its frontier during the Pius Dea Crusades against alien species. Thousands of years later, in 22 BBY, Ord Tiddell became infested with stone mites, genetically-engineered arthropods that fed off metals and silicates. While many worlds throughout the Mid Rim and Colonies regions—including Havricus, Deylerax, and others—reported only relatively minor damage from the creatures, Ord Tiddell was devastated by the mites."}, {"tag": "p", "text": "The planet's capital city, Lagabee, was left in ruins after the arthropods ate through the city's foundation. Lagabee was abandoned by its occupants, and Ord Tiddell's population of four million began fleeing off-planet. The widespread destruction also brought economic hardships—Ord Tiddell lost billions of credits it had invested in businesses and other assets. Both the Jedi Order and the Republic's Judiciary Department launched investigations into the incident, but many were skeptical that either group could be of assistance to the beleaguered world."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The city of Lagabee served as Ord Tiddell's capital. In 22 BBY, the city's foundation was devoured by an infestation of stone mites, leaving Lagabee abandoned and in ruins."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "In 22 BBY, Ord Tiddell boasted a population of four million, which fled off-planet after stone mites devastated the world. One inhabitant, Siolu Sporipri, served as mayor of Lagabee during the stone mite infestation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ord Tiddell first appeared in an article on the HoloNet News website as part of the buildup to the release of Star Wars: Episode II Attack of the Clones in 2002. The world later received an entry in The Complete Star Wars Encyclopedia in 2008, and was among the many planets referenced in both 2009's The Essential Atlas and 2012's The Essential Guide to Warfare."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}