{"url": "Order_4", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Contingency Orders for the Grand Army of the Republic"], "nodes": [{"tag": "h1", "text": "Order 4"}, {"tag": "p", "text": "Order 4 was one of the 150 contingency orders that the clone troopers of the Grand Army of the Republic were trained to execute for a variety of emergency situations during the Clone Wars. Order 4 stated that if the Supreme Chancellor was incapacitated, the command of the Grand Army would temporarily fall to the Vice Chair of the Senate until another Supreme Chancellor was elected."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Order 4 was the fourth of 150 contingency orders created by the Grand Army of the Republic during the Clone Wars. All such orders dealt with different emergency scenarios that the Galactic Republic might face during the war; the clone troopers of the Grand Army were trained to carry out Order 4 without delay."}, {"tag": "p", "text": "Order 4 specified that if Supreme Chancellor Palpatine—the Supreme Commander of the Grand Army and an office occupied by Palpatine during the war—was incapacitated in such a manner as to prevent him from performing his duties, command of the army would temporarily fall to the Vice Chair of the Galactic Senate, a position held at the time by Mas Amedda. The Vice Chair would be relieved of his command once a new Supreme Chancellor was elected or an alternative Supreme Commander was chosen."}, {"tag": "h3", "text": "Full text"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 19 BBY, 995 days after the Battle of Geonosis, clone commando RC-3222 indirectly mentioned Order 4, along with the rest of the Grand Army's 150 contingency orders, to squadmate RC-5108/8843 and Jedi General Etain Tur-Mukan during a conversation at the Republic's Special Operations Brigade Headquarters on the galactic capital planet Coruscant. However, Order 4 was never employed by the Republic during the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Order 4 was first mentioned in the 2007 novel Republic Commando: True Colors, written by Karen Traviss, when the full text of the contingency order was stated at the beginning of the novel's fifth chapter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}