{"url": "Order_of_the_Sith_Lords", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:NPOV disputes", "Category:Incomplete lists", "Category:Secret societies", "Category:Sith organizations"], "nodes": [{"tag": "h1", "text": "Order of the Sith Lords"}, {"tag": "p", "text": "The Order of the Sith Lords, also known as Bane's Sith Order, Banite Sith, or simply the Sith, was an ancient Sith organization of Force-sensitives who utilized the dark side of the Force. Founded approximately one thousand years before the Battle of Yavin by the Sith Lord Darth Bane, it was intended to replace the Brotherhood of Darkness and institute a rebirth of the Sith. The guiding principle of the Order was the Rule of Two, which was developed by Bane through the teachings of Darth Revan's Holocron. Under this new tenet, only two Sith Lords were allowed to exist at any given time; a master and an apprentice. The Rule stipulated that after learning everything the master had to teach, the apprentice would attempt to kill the master and take an apprentice of their own. The intended effect of this rule was to ensure that each successive master would be stronger than the last. Ultimately, Bane intended that his successors would be able to amass enough power in secret to engineer the fall of the Republic and the destruction of the Jedi Order."}, {"tag": "p", "text": "Bane's expectations of the new Order were met with his death at the hands of his own apprentice, Darth Zannah. The tradition was carried on over the next millennium, even though many Sith who followed in Bane's lineage were appalled at the thought of being slain by their own apprentices. After centuries of operating in secrecy, the Grand Plan for revenge was initiated by the Sith Lords Darth Plagueis and Darth Sidious. Sidious, who usurped his Master's position, ultimately fulfilled Darth Bane's dream: the return of Sith dominance throughout the galaxy. With the betrayal and near destruction of the Jedi Order, Sidious dissolved the Galactic Republic and replaced it with the Galactic Empire. Ruling as emperor in his public guise as \"Palpatine\", Sidious' reign was prophetically ended by his own apprentice—the Chosen One, Anakin Skywalker. Though he returned in the form of several clones, each inhabited in turn by the Emperor's dark spirit, Sidious' final demise in 11 ABY ended the line of Bane and Zannah."}, {"tag": "p", "text": "The collapse of Darth Bane's Sith Order, however, did not bring about the final end of the Sith itself. Lumiya, a former Hand of Emperor Palpatine and the self-proclaimed Dark Lady of the Sith, formed her own Sith and incorporated the Rule of Two in its philosophy. She regarded her greatest achievement in the form of her apprentice Darth Caedus, a grandson of Anakin Skywalker and the first active Sith Lord since the reign of Darth Sidious. During the time of Lumiya and Caedus, another Sith Order had come into existence, one that was far less connected with the old Order of Darth Bane: The One Sith, founded by the former Jedi A'Sharad Hett, rejected the Rule of Two. Under the Rule of One, the new organization permitted the existence of many Sith Lords, all of whom ultimately answered to the authority of a single Dark Lord. This was known as the Rule of One."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Bane's reformation"}, {"tag": "p", "text": "The Order of the Sith Lords was formed approximately one thousand years before the Battle of Yavin by a Human male Sith Lord named Bane. Initially a member of the Brotherhood of Darkness, Bane delved deep into the secrets of the ancient Sith Lords to increase his own knowledge and power in stark contrast to most of his contemporaries. Bane's investigations led him to the conclusion that the Brotherhood was a perversion of the Sith; ultimately little more than a copy of the Jedi Order, the Sith's mortal enemies. Disillusionment and contempt for the Brotherhood drove Bane to journey to the planet Lehon where he discovered the holocron of Darth Revan. Bane was inspired by the ancient Dark Lord of the Sith. Through Revan's philosophy regarding the dark side of the Force, Bane saw the power and discipline that he felt a Sith should have; qualities which he believed had been lost under the Brotherhood of Darkness."}, {"tag": "p", "text": "Upon renaming himself as Darth Bane, the new self-proclaimed Dark Lord of the Sith was more convinced than ever that the Brotherhood could never defeat the Jedi Order. To do so would require a drastic reshaping of the Sith as a whole; a reshaping that required the annihilation of the Brotherhood. During the Seventh Battle of Ruusan, Bane betrayed the Brotherhood to the Jedi, allowing the Republic to send critical reinforcements to the beleaguered Army of Light. Thus, the final battle of the New Sith Wars ended with the triumph of the Jedi Order and the Galactic Republic. With the exception of Bane, all members of the Brotherhood were exterminated by the thought bomb, an ancient Sith technique unleashed by the Sith's own leader, Lord Kaan."}, {"tag": "p", "text": "With the Brotherhood destroyed, the galaxy at large believed the Sith to be extinct. Darth Bane did nothing to disprove this assumption, feeling that as long as the Jedi remained convinced that the Sith could never return, he was free to proceed with his plans to create a new Sith Order. His work began shortly after discovering a Force-sensitive Human female child on Ruusan. Sensing her potential in the Force, Bane took the orphaned Zannah as his Sith apprentice. Throughout the course of Zannah's training, Bane not only indoctrinated her with devotion to the ancient tenets of the Sith Code, but also exposed her to certain modifications of his own that were added to the new Sith philosophy. Instead of the thousands who were admitted into the former Brotherhood of Darkness, the Order of the Sith Lords only permitted the membership of two beings; a Master, the embodiment of the dark side's power; and an apprentice, the disciple who coveted said power. This creed, known as the Rule of Two, became the core tradition of Bane's Sith Order. Its main focus, as envisioned by Bane, was to prevent the Sith from becoming destabilized by the ambitions and intrigue of too many members. Furthermore, Bane wanted the dark side to be concentrated into just two individuals, as he believed that its power was finite and had been diluted among the many members of the Brotherhood."}, {"tag": "p", "text": "The Rule of Two also served to ensure the continued survival of the Sith by dictating that the Order should operate in secret. By limiting membership to just two Sith Lords, Bane believed that he could keep his machinations hidden from the Jedi. He fully believed in the power of the dark side, but also felt that two Sith Lords could never defeat the entire Jedi Order in a direct confrontation. Rather than openly challenging the Jedi through martial means, the Dark Lord concluded that the Sith's rise to power would be far better served by utilizing cunning, stealth, subterfuge and—a virtue borrowed from their own enemy—patience."}, {"tag": "p", "text": "Together, Darth Bane and Darth Zannah steadily worked toward the ultimate goal of their organization from their hideout on the planet Ambria. Aside from the Jedi Order, Bane also targeted the Galactic Republic as another victim of the Sith plot for retribution. But rather than contributing to the complete destabilization of the galactic government, the Dark Lord wanted to ensure that it remained intact throughout the coming centuries. Given that the Republic unified much of the known galaxy under one system of government, Bane believed that the Republic's collapse would lead to the creation of numerous small, independent states. In Bane's opinion, destroying the numerous smaller states would have been a far more difficult task than toppling the single, large government of the Republic. Hence, he dispatched his apprentice on many missions aimed at preempting Anti-Republic movements, such as a Separatist movement on Serenno. Through the machinations of Bane and Zannah, the Separatists were goaded into launching their insurrection long before their movement was ready for a conflict with the Republic. In the aftermath of their failure to kidnap Supreme Chancellor Tarsus Valorum, the Separatist organization was eventually disbanded and Serenno remained with the Republic. At the same time, Bane and his apprentice also concentrated their attention on the study of Sith magic, learning all but forgotten dark side techniques found in ancient scrolls. This task was largely left to Zannah however, as Bane himself stated that he had no affinity for such arcane abilities."}, {"tag": "p", "text": "Bane's fledgling Order was nearly destroyed when the Jedi Knight Johun Othone convinced the Jedi High Council to investigate the possibility of the Sith's survival. Along with Jedi Master Valenthyne Farfalla, Othone led a Jedi task force on a hunt for the resurgent Sith. Tracking Bane and Zannah to Tython, the Jedi made an attempt on the lives of both master and apprentice. The Sith ultimately survived the confrontation, but Bane was severely wounded during the fight. Darth Zannah was not prepared to allow her Master to die, if only because she felt that there was much more to learn from Darth Bane. She traveled back to Ambria to enlist the help of the healer Caleb, whom she believed represented Bane's best chance for survival. Upon arrival however, Caleb refused to help them, even under threat of torture or death. Darovit, Zannah's cousin, offered to convince Caleb to help Bane, but only if Zannah agreed to surrender herself into Jedi custody along with Bane. Zannah agreed to her cousin's terms, and he contacted the Jedi Temple and asked them to send a team to take custody of the two Sith. However, Zannah had lied to Darovit, pledging to surrender to the Jedi for the sole purpose of convincing him and Caleb to repair Bane's injured body. Once their task had been completed, Zannah killed Caleb and used the dark side to drive her cousin insane. The team had been sent by the Jedi Council arrived on but only found Darovit utterly consumed by madness. In his madness, he attacked the Jedi task force, but was cut down almost immediately. Darovit's behavior led the Jedi to believe that he had been the Sith Lord that they had been sent to apprehend, driven mad by drawing too heavily on the power of the dark side. As such, they believed the Sith menace to be truly extinct at last. This assumption lead them to make the decision to leave Ambria without conducting a more through investigation; Zannah and Bane had in fact been hiding, cloaked by the dark side, in the very hut in which Darovit had been killed."}, {"tag": "p", "text": "When Darth Bane recovered, his apprentice explained how she had manipulated the Jedi Order into believing that the Sith were finally destroyed. Darth Zannah also explained that—in spite of the risk of discovery and capture—she still needed her Master in order to finish her training, but would not hesitate to kill him as soon as her powers eclipsed Bane's. The Dark Lord was pleased by Zannah's ambitions, and was filled with a sense of confidence in the future of the Sith."}, {"tag": "h3", "text": "The Apprentice becomes the Master"}, {"tag": "p", "text": "By 980 BBY, Bane and Zannah had adopted a cover as civilians on Ciutric IV. Posing as brother and sister—Sepp and Allia Omek—the two lived in a mansion and possessed considerable wealth, which had been appropriated from the vast accounts of the former Brotherhood member Qordis. Much of this wealth was used to create a vast network of spies and contacts. By this time, however, Darth Bane's health had begun to deteriorate at an accelerated rate due to the harmful side-effects of his deep immersion in the dark side of the Force. Though unafraid to accept his own death, Bane feared for the future of his Sith Order. In the ten years that had passed after his near-death experience on Tython, Bane had waited for his apprentice to kill him and become the next Dark Lord of the Sith. Yet as far as he could tell, Darth Zannah seemed either content to serve at his bidding, or was simply waiting until her Master was too feeble to pose any challenge. As a result, Bane became obsessed with discovering some way to prolong his life in order to train a new apprentice."}, {"tag": "p", "text": "However, unbeknownst to Bane, Zannah had decided that the time had finally come for her to challenge Bane and attempt to claim the title she had coveted for so long. She also decided to claim an apprentice for herself in advance. Her choice fell on the Dark Jedi Set Harth. However, the selection of Harth as her disciple was a rushed decision; Zannah would have preferred someone more interested in the continuation of Bane's Sith rather than a fallen Jedi who cared only about himself. By the time Zannah and her apprentice tracked Bane's location to Doan, the Dark Lord had discovered information on how to prolong his life. Through the holocron of Darth Andeddu, Bane learned of the ability to transfer one's own spirit into another body. Shortly after learning this information however, Bane had been captured by an Iktotchi female known as the Huntress and her small strike team. In the employ of Caleb's daughter Serra, the Huntress had brought Bane to Stone Prison on Doan, where Serra had intended to kill him on the assumption that he had killed her father. Zannah and Harth arrived on Doan shortly thereafter, with Zannah intending to kill Bane and take his place. Bane managed to escape his captors, and encountered Zannah, who accused him of betraying the Rule of Two and attacked him. During Bane's confrontation with Zannah, the unarmed Bane managed to hold off Zannah long enough to escape. However, Serra, learning of Bane's escape, activated a series of explosives in the prison, intending to collapse it. During the duel, Harth abandoned Zannah and stole Andeddu's holocron. Intending to flee Doan with it, he proceeded to the prison's hanger, where he had the misfortune of attempting to steal a ship belonging to the Huntress. She confronted him, and when he attacked her, she gave pursuit. However, Harth managed to evade her, and lead her on a fruitless game of cat-and-mouse throughout the hanger. Eventually, the two of them called a truce as each knew that the prison was close to destruction, and that their confrontation would most likely result in both of their deaths if they stayed much longer. Reluctantly, the Huntress allowed him to escape just as Bane arrived in the hanger. Having realized through the Force that Bane could give purpose to her currently meaningless existence, she pledged herself to Bane. Having been on the lookout for a suitable candidate for apprenticeship, Bane accepted her pledge. The two of them then escaped Doan on the Huntress's ship, and set a course for Ambria."}, {"tag": "p", "text": "Zannah later tracked Bane to Ambria, the planet where a decade ago she had vowed to kill him one day. There, she encountered Bane and the Huntress, who had since been re-christened as Darth Cognus. Unwilling to be denied the position she had been prepared for throughout most of her life, Darth Zannah challenged the Dark Lord to a final duel, which Darth Bane eagerly accepted. Cognus, having been instructed by Bane on the importance of the Rule of Two, promised both not to interfere in the duel and to pledge her allegiance to whomever emerged victorious. The Master and his former apprentice fought as near-equals, but Zannah was outmatched with regard to her lightsaber skills and raw power. In desperation, Zannah utilized her knowledge of Sith magic; tapping into the dark side nexus on Ambria, she unleashed a wave of dark side tendrils against the Dark Lord. Bane tried to avoid the conjured tendrils, only to have his arm grabbed and vaporized by one. Bane, on the verge of defeat, made one final attempt to thwart his apprentice. Using the knowledge he gained from Darth Andeddu's holocron, Bane released his essence from his body and transferred it into Zannah's, vaporizing his own body in the process."}, {"tag": "p", "text": "The duel then transcended into a battle of wills; Zannah's spirit fought with all of its strength to reject Bane's essence and maintain control of her own body. The struggle lasted a few moments before Darth Zannah overcame her master, expelling him to Chaos. Though Bane had left a slight psychic imprint on her, the being that remained was wholly and unmistakably Zannah. With Bane dead, leadership of his Sith Order was transferred to Darth Zannah, the new Dark Lord of the Sith. Claiming Darth Cognus as her apprentice, Zannah declared that they were both part of Darth Bane's legacy; the Order of the Sith Lords lived on through them, and so did its founder's plot for revenge against the Jedi."}, {"tag": "h3", "text": "The split"}, {"tag": "p", "text": "Darth Cognus eventually took an apprentice of her own, the three-eyed Human mutant Darth Millennial. A staunch adherent to Darth Bane's Rule of Two, Cognus found herself at philosophical odds with her own disciple. Millennial believed that the Rule of Two was far too restrictive and counterproductive to the Sith's growth in power."}, {"tag": "p", "text": "The Dark Lord eventually believed that Millennial had become a heretic; an apostate with views contrary to the Rule of Two. She disavowed her apprentice and cast him out of the Order of the Sith Lords. Millennial just barely escaped his former Master's fury and later settled on Dromund Kaas where he founded a splinter Sith group known as the Prophets of the Dark Side and their philosophy, the Dark Force religion. Centuries later, the new Jedi Order presumed that it was Cognus who carried on Bane's \"lineage\" by taking on a new apprentice after the disappearance of her wayward student."}, {"tag": "h3", "text": "Quiet times"}, {"tag": "p", "text": "The lineage of Darth Bane and Darth Zannah continued on for a thousand years in an unbroken line, typically through the virtually endless cycle of the Rule of Two. Many of the Sith Lords who came after Cognus contributed to the Grand Plan in one way or another, usually by integrating themselves into public life or through experimenting with the dark side of the Force. One such Sith Lord was Darth Vectivus."}, {"tag": "p", "text": "Around 552 BBY, the Sith Lord Darth Gravid rejected the dark side of the Force. He came to believe that in order for the Sith to survive, the Order had to become more like their Jedi counterparts by embracing the light. His apprentice, Darth Gean, did not share her Master's new beliefs and was appalled by his apparent blasphemy. In keeping with his new philosophy, Gravid began destroying nearly five hundred year worth of accumulated Sith lore. Gravid was ultimately killed by Gean, but not before he had managed to destroy most of the artifacts and writings in his fortress. Thus, many ancient dark side techniques and rituals—including essence transfer—were lost to future dark side practitioners. Though his actions had set the Grand Plan back by decades at the very least, Gravid's madness had an unintended, positive effect on the generations of Sith to come. By depriving his successors of the essence transfer ritual, he unintentionally eliminated centuries of obsession that long distracted the Sith from further developing the Grand Plan and exacting vengeance against the Jedi Order."}, {"tag": "p", "text": "Though Darth Gean sustained severe injuries during her confrontation with Gavid, her actions ensured that the Order of the Sith Lords remained true to its tenets and the dark side of the Force. Bane's line continued on, and eventually produced Darth Ramage, a scientist who preserved his life's work—including the procedure on how to combine the effects of pyronium and bota—in a Sith holocron, designated as SD41263.I. The line of Sith Lords proceeded on after Ramage's time, and eventually led to the reign of Darth Tenebrous around 167 BBY. His own Master was the Sith Lord who created a wound in the Force, thereby allowing the Jedi to sense the dark side for the first time in centuries. Shortly before killing his Master, Tenebrous theorized that the dark side was simply an energy source to be manipulated, as opposed to an omnipresent and malevolent mystical force."}, {"tag": "p", "text": "In Darth Tenebrous's public life, he was a renowned starship designer named Rugess Nome. Through the Force, Tenebrous foresaw the birth of a powerful darksider who would become his apprentice. Hence, he was indirectly responsible for the conception of his own apprentice, the Muun Sith Lord Darth Plagueis. Born as Hego Damask, Plagueis's father and mother were manipulated into meeting each other by Darth Tenebrous, who wanted to ensure the birth of his future protégé. After serving as an apprentice for decades, Darth Plagueis murdered his Master while Tenebrous was distracted by maintaining a Force shield."}, {"tag": "p", "text": "As with some of Darth Plagueis's predecessors, the new Sith Master abhorred the Rule of Two. Rather than simply training an apprentice, only to eventually be killed and replaced, Plagueis wanted to end the millennium-long cycle that began with Darth Bane and Darth Zannah. Under his vision, the Sith would rely on trust and cooperation in order to see the fulfillment of the Grand Plan, although Plagueis intended to adhere to the restriction of just two Sith Lords. While searching the galaxy for an apprentice, someone cunning in mind and powerful in the Force, Plagueis operated in the public domain under his birth name as Magister Hego Damask of Damask Holdings. A corporate power-broker, Plagueis had political and financial connections to various companies and other industries throughout the galaxy, including the InterGalactic Banking Clan and the Trade Federation."}, {"tag": "p", "text": "Unknown to the Dark Lord, however, Tenebrous had trained another apprentice behind Plagueis's back. After his Master's demise, Darth Venamis confronted Plagueis in order to legitimize himself as Tenebrous's successor. Plagueis ultimately bested Venamis and experimented on him in a personal quest to learn more about the manipulation of midi-chlorians."}, {"tag": "h3", "text": "The rise of Darth Sidious"}, {"tag": "p", "text": "Around the year 65 BBY, Darth Plagueis visited the planet Naboo in his public guise as Hego Damask in order to influence the outcome of the election for the people's next monarch. But what started out as a simple business trip to a Mid Rim world became what Plagueis saw as a piece of his destiny, shaped and influenced by the will of the dark side. On Naboo, the Dark Lord discovered a teenage Human noble named Palpatine, the seventeen year-old son of Cosinga Palpatine, an aristocrat of mediocre standing. Outwardly, Palpatine appeared to others as friendly, unassuming, and guileless; an intelligent young man, somewhat shy and withdrawn, who possessed a keen sense of politics and a passion for competitive racing."}, {"tag": "p", "text": "Though proud to hail from House Palpatine, one of the Royal Houses of Naboo, Palpatine was aggravated by his family's lack of wealth and prestige in comparison to some of the other aristocratic families. He blamed his father as an incompetent, self-absorbed, uninspired indolent fool with no talent for business and political maneuvering. Furthermore, he resented his mother for being too weak to challenge her husband's will, and his siblings for treating him like an interloper. His hatred for the members of his family was further intensified by fear of his father. That fear was not due to the threat of punishment through physical harm; Palpatine was afraid that his father would disown him if he ever crossed the line too far, thus cutting him off from the life of rank and privilege."}, {"tag": "p", "text": "Before long, Darth Plagueis became a mentor and idol to Palpatine, who viewed the elderly Muun as a blessing. In the young noble's eyes, Plagueis embodied the wealth and power that he had coveted throughout his short life. Using the boy's own hatred to his advantage, Plagueis manipulated Palpatine into committing patricide by murdering his entire family. Once the deed was done, the Dark Lord convinced the orphaned aristocrat to learn the ways of the dark side by becoming a Sith apprentice. Henceforth, Palpatine's true identity was Darth Sidious; his family's name was simply used as part of his public disguise."}, {"tag": "p", "text": "The first ten years of Darth Sidious' apprenticeship revolved around basic lessons in lightsaber combat and Force techniques, as well as an indoctrination into Sith ideology. At the same time, part of Sidious' contribution to the Grand Plan was his gradual rise as a politician. By the time he was twenty-seven years old, Sidious was publicly known as Ambassador Palpatine, a young diplomat who was part of Naboo Senator Vidar Kim's entourage. Through Darth Plagueis's influence, Sidious also gained close allies such as Kinman Doriana and Sate Pestage, both of whom played essential roles in Palpatine's rise through the galactic political hierarchy."}, {"tag": "p", "text": "Once the apprentice's Master allowed him to visit certain worlds that related to the history of the Sith, Darth Sidious traveled to the world of Dathomir. Home to Mother Talzin's Nightsisters, Dathomir was also populated by the Nightbrothers, a clan of Zabrak males born and raised as warriors and slaves to the Witches of Dathomir. While touring the streets of Blue Desert City, Sidious was approached by an enigmatic Nightsister who begged him to take her child. The infant, a male Zabrak named Maul, was strong in the Force, and the Nightsister hoped that—under Sidious's care—her son would find a life better than that of a Nightbrother. After some persuasion on the woman's part, Sidious agreed to take Maul away from Dathomir, although he initially had no idea what to do with the child."}, {"tag": "p", "text": "Sidious later revealed his adoption of Maul to Plagueis, pointing out how his Master told him to keep an eye out for beings who were strongly connected to the Force. Given that neither of the two Sith Lords could overly risk compromising the secrecy of their existence, Sidious proposed to train Maul in the Sith arts so that the Zabrak could be the one who was exposed to the risk of detection—or even death—when necessary. Even though the use of another apprentice technically violated the protocol of the Rule of Two, Plagueis approved of Sidious's plans for Maul, but under the strict understanding that the Zabrak's training would be limited to the role of an assassin rather than a full-fledged Sith Lord. Darth Plagueis oversaw Maul's training—first in their secret droid-run facility on Mustafar and later in the Orsis Academy—through Sidious' reports and regarded him as a capable fighter, eventually coming to accept him as Sidious' apprentice, despite their original arrangement. Darth Sidious bestowed the titles of Dark Lord of the Sith and Darth on Maul c. 37 BBY."}, {"tag": "p", "text": "Over the years, Darth Maul developed into a deadly combatant, trained to be a remorseless killer who wielded the double-bladed lightsaber. But even Maul suspected that his training was far from adequate, and he sometimes wondered how he could be fit to succeed Darth Sidious when he lacked even a basic understanding of the complexities of galactic society. He only suspected that his Master answered to another Master shortly before his defeat on Naboo."}, {"tag": "h4", "text": "Unification of the splinter cults"}, {"tag": "p", "text": "While still apprenticed to Plagueis, Sidious moved to eliminate certain loose ends in form of Sith-based cults that threatened the Grand Plan. More often than not, these cults were harmless and disorganized; youngsters thoughtlessly rebelling against the staid world of their parents. Many of them had no real knowledge of Sith ideology or even the power of the Force. But in some cases they were seen as dangerous, to Sidious as well as the innocent. To ensure the long-term success of the Grand Plan, he brought these wayward cults to heel or obliterated them."}, {"tag": "p", "text": "Among the factions in question was a Sith-centered mercenary band, the Thyrsian Sun Guard. Their members were not Force-sensitive, but their fighting prowess was considered phenomenal. Plagueis and Sidious eventually recruited the Sun Guard to serve as their secret bodyguards, spies and assassins. A detachment of the Guard protected Plagueis during the many years he spent in near total isolation while studying the midi-chlorians. Other members were stationed in the Dark Lord's LiMerge Building, located in The Works on Coruscant."}, {"tag": "p", "text": "Another potential threat that the Sith Lords turned into an advantage was the Prophets of the Dark Side, the heretical group founded by the apostate Darth Millennial centuries ago. Discovered by the Sith on Dromund Kaas, the Prophets were a collection of both Force-users and Sith enthusiasts, united under the leadership of a diminutive fallen Jedi by the name of Kadann. Sidious, intrigued by Millennial's legacy, approached Kadaan and recruited the Prophets to the Sith cause."}, {"tag": "p", "text": "At Sidious's behest, Kadaan assembled a small group of Sith devotees known as Dark Force. These darksiders were gifted with particular talents for seeing portents and omens in the Force. Hence, the Prophets of the Dark Side became an extension of the Order of the Sith Lords, with Kadaan as their Supreme Prophet. Years later under the reign of the New Order, Kadann became one of Darth Sidious's most trusted—and most secret—advisors."}, {"tag": "h4", "text": "The Grand Plan"}, {"tag": "p", "text": "As Palpatine, Darth Sidious's political career steadily advanced through the machinations of Darth Plagueis. At the Dark Lord's personal request, King Ars Veruna appointed Palpatine to represent Naboo's interests in the Galactic Senate on Coruscant. Sidious was able to convince many beings that he was an honest and trustworthy politician whom others could easily confide in; an extremely rare individual given the corruption and decadence in Coruscant politics. Even seasoned Jedi Masters such as Dooku and Knights such as Ronhar Kim not only failed to sense Palpatine's true nature, but also befriended him."}, {"tag": "p", "text": "Over the next several years, the Sith Lords gradually placed each part of the Grand Plan into effect. With Sidious acting as his proxy, Plagueis initiated the Yinchorri Uprising; he arranged for the assassination of Black Sun's leader and Vigos by Darth Maul; he helped Nute Gunray ascend to the position of Viceroy of the Trade Federation; all of which was ultimately aimed at placing Darth Sidious in a position to reach the highest executive office in the political hierarchy of the Galactic Republic."}, {"tag": "p", "text": "Another key factor in the Grand Plan was the secret creation of an army that would enable two Sith Lords to systematically exterminate the thousands of Jedi. Plagueis' original goal was to create an army of Yinchorri clones, and thus he hired the cloners of Kamino to carry out his wishes. The Kaminoans found Yinchorri DNA was not manipulable enough to effectively instill certain traits like obedience into the clones. They suggested to Plagueis that a Human template would be easier to replicate and modify in order to meet Plagueis' exact expectations. The Grand Plan was further modified after Sidious advised his Master about how the Jedi could not simply be destroyed; they also had to be demonized in the eyes of the galactic populace so that the Sith's actions would be justified and accepted. Hence, Plagueis decided that the Human clone army would not fight against the Jedi Order in the war to come. They would instead fight for the Galactic Republic, under the command of Jedi officers. Their loyalty, however, would ultimately belong to the Supreme Chancellor alone. In order to avoid any chance of the Jedi learning about the Sith's role in the creation of clone soldiers, Plagueis knew that he needed a Jedi to commission the Kaminoans to create an army for the Republic. As Hego Damask, the Dark Lord manipulated Jedi Master Sifo-Dyas into placing the order for an army with Kamino, but without the authorization or knowledge of the Jedi High Council. The cost of such an endeavor was covered by the vast wealth that Plagueis possessed through his corporation, Damask Holdings."}, {"tag": "p", "text": "The next phase of the Grand Plan came in the form of the Invasion of Naboo in 32 BBY. By then, Viceroy Gunray had become an agent of the Order of the Sith Lords. Under Darth Sidious's instructions, the Neimoidian ordered a Trade Federation fleet to blockade the entire planet of Naboo. All proceeded according to Darth Plagueis's plan, until Chancellor Finis Valorum sent two Jedi ambassadors, Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi, to negotiate an end of the blockade with the Trade Federation. This anomaly caused the Sith Lords to accelerate their plans, thus forcing Gunray to order an illegal full-scale invasion of Naboo with the use of the Federation's battle droid army."}, {"tag": "p", "text": "The capture of a peaceful—and lightly defended—world like Naboo was swiftly accomplished. With the entire planet under military occupation, including the capital city of Theed, the next step in the plot was to force Queen Padmé Amidala to sign a treaty that would cede Naboo's sovereignty to the Trade Federation, thereby legalizing the occupation. Amidala, the young daughter of House Naberrie who had risen to the throne with Senator Palpatine's support, refused to comply with Gunray's demands. The Grand Plan was further complicated when Jinn and Kenobi rescued the Queen and spirited her away from Naboo. Although Maul tracked Amidala and her Jedi protectors to the desert world of Tatooine in the Outer Rim Territories, he failed to prevent them from fleeing to Coruscant, where Darth Sidious greeted them as Senator Palpatine."}, {"tag": "p", "text": "Although Queen Amidala's escape was not part of the Grand Plan, her arrival on Coruscant served the Sith Lords far better than her imprisonment on Naboo. It was Darth Sidious who realized that if he could persuade the Queen to propose a Vote of No Confidence in Chancellor Valorum, then he would be in a position to succeed to the executive officer much sooner than anticipated. In order to do so, he needed Amidala to see Valorum's style of leadership with her own eyes. As soon as she witnessed the Chancellor's inability to overcome Senate politics and bureaucratic procedures, Amidala proposed the motion that suddenly ended the controversial career of the Republic's unpopular head of state. Under the guise of Hego Damask, Darth Plagueis used all of his considerable political and financial influence to create the conditions that would guarantee the election of Senator Palpatine as the next Supreme Chancellor."}, {"tag": "p", "text": "Around the same time, just prior to Amidala's return to Naboo, Palpatine learned that the supposed Chosen One had been found by Qui-Gon Jinn. Anakin Skywalker, a young Human boy formerly enslaved along with his mother, possessed the highest count of midi-chlorians—more than twenty thousand per cell—than any other Force-sensitive lifeform in galactic history. Furthermore, his conception occurred without a natural father. According to Jedi prophecy, the Chosen One would be created by the will of the Force in order to destroy the Sith, thus restoring the Force back into balance. Sidious was amazed by the revelation of this discovery, but he was not nearly as surprised as his Master. Upon learning of Skywalker's existence and the nature behind it, Darth Plagueis was struck with a mixture of shock, awe, outrage and even fear. Although he had made great strides in the manipulation of midi-chlorians, his attempt to coerce the midi-chlorians into spontaneously creating life had not only failed, but had noticeably backfired. The Dark Lord suspected from the start that the Force had purposely created Anakin to undermine—and ultimately undo—the Sith Grand Plan as a balancing act to Plagueis's machinations. At that moment, it seemed to Plagueis as though the centuries of planning and waiting patiently on the Sith's part was all for nothing."}, {"tag": "p", "text": "Regardless of whether Skywalker was the Chosen One or not, Darth Plagueis refused to turn away from his plot, decades in the making by then. He instructed Sidious to pass on orders to Maul that Qui-Gon Jinn was to be killed no matter what. As Jinn was acting as Anakin's sponsor within the Order, Plagueis believed that the Jedi Council would simply send Anakin back to Tatooine if Jinn died. While Amidala led an alliance of Naboo resistance fighters and the Gungan Grand Army against the Trade Federation, the Senate voted for Palpatine as its new leader. With his apprentice finally at the highest level in the Republic's government, Plagueis intended to share in the control of the executive branch once Palpatine proclaimed him Co-Chancellor. But Darth Sidious—who had subtly manipulated Plagueis into setting the stage for the Clone Wars—would have no such thing. Shortly before being sworn into office, Sidious manipulated Plagueis into becoming overly intoxicated. Once the Dark Lord was too incapacitated to defend himself, the apprentice tortured his Master with Force lightning before ultimately killing him, thus ending his long stint as a Sith apprentice."}, {"tag": "p", "text": "The new Sith Master soon found himself without an apprentice. Darth Maul had been defeated during the Battle of Naboo. Although the Zabrak Sith assassin slew Qui-Gon Jinn, Maul acted with a level of overconfidence that led to his defeat at the hands of Obi-Wan Kenobi. With Maul lost and apparently dead, Sidious traveled to his homeworld where he was welcomed by the victorious Naboo and Gungan forces. Supreme Chancellor Palpatine promised Queen Amidala that his term would usher in the restoration of the Republic's honorable principles; as Darth Sidious, the Dark Lord of the Sith continued to carry out the Grand Plan that would eventually lead to his ascension as Galactic Emperor."}, {"tag": "p", "text": "Regarding Darth Maul's replacement, Sidious was determined to ensure that Anakin Skywalker became his apprentice one day. For the time being, however, he was content to allow the Jedi Order to train the boy. Aside from his fascination with the Chosen One's unique potential, Sidious was reminded of his own youth by Skywalker's personality. The child—much like a young Palpatine from years ago—yearned for adventure and a life of significance, but resented authority and was rather skilled at hiding his anger. In the meantime, Sidious decided that the former Jedi Master Dooku would be a sufficient placeholder as an apprentice until Skywalker's fall to the dark side of the Force was completed."}, {"tag": "p", "text": "Like Plagueis, Sidious had no intention of being killed by an apprentice and replaced. However, while Plagueis had envisioned a system where master and apprentice worked in concert with loyalty and trust, Sidious desired to rule completely alone. He therefore created a Sith doctrine which he called the Rule of One. The new doctrine paid lip service to Bane's Rule of Two in that only two beings could have the Darth title bestowed upon them at any given time. In all other ways however, it deviated substantially from Bane's philosophy. Where Bane's doctrine dictated that the master should train an apprentice earnestly and with the intention of making the apprentice as powerful as possible, Sidious's doctrine detailed the need for an apprentice to function solely as an instrument of the master's will, not as a potential usurper. As such, Sidious never passed on teachings to any of his apprentices that might have enabled them to contest his power. In addition, while the Rule of Two dictated that the dark side should be concentrated into just two beings, Sidious planned to eventually create a cadre of lesser darksiders in addition to a Sith apprentice to help enforce the rule of his Empire. While these beings would receive no Sith training, and were technically not Sith as a result, they were nonetheless darksiders who answered to the authority of Sidious."}, {"tag": "h4", "text": "The Clone Wars"}, {"tag": "p", "text": "Darth Tyranus, formerly Jedi Master Dooku, succeeded Darth Maul as Sidious's new apprentice. Shortly after pledging his allegiance to the Sith, Tyranus was tasked by his new Master with selecting an ideal candidate to become the template of the clone army. Tyranus's choice fell on a bounty hunter named Jango Fett. Throughout the decade that followed, while Fett oversaw the training of his clones on Kamino, Tyranus led a growing movement of disillusioned star systems on the path to secession from the Galactic Republic. Known as Count Dooku of Serenno, the Sith Lord's insurrection eventually included major corporations such as the Trade Federation, the InterGalactic Banking Clan and the Techno Union."}, {"tag": "p", "text": "In 22 BBY, Supreme Chancellor Palpatine was entrusted with near dictatorial authority—reserved only for moments of crisis—by the Senate in order to effectively counter the insurrection of the newly-created Confederacy of Independent Systems. The Chancellor then commissioned the clone troopers on Kamino as the Grand Army of the Republic. Furthermore, the members of the Jedi Order became high-ranking officers in the new military. After the first battle of the Clone Wars concluded in a victory for the Republic, Sidious assured Tyranus that everything proceeded on schedule, according to the Grand Plan."}, {"tag": "p", "text": "In three years, the Clone Wars virtually engulfed the galaxy in conflict as Jedi-led clone forces fought against the Separatist Droid Army on countless fronts. At the same time, the Chancellor's political authority and public support increased along with the Republic's desperation to bring end to the war. During this conflict, Darth Maul re-appeared, having survived his bifurcation by Kenobi on Naboo. Learning that he had been replaced by Dooku, Maul attempted to take his revenge against Kenobi for injuring him, and took his brutish sibling Savage Opress as his apprentice. With his brother, Maul even contemplated overthrowing Sidious and ruling the galaxy as the Dark Lord of the Sith. Unfortunately for the two brothers, Sidious eventually decided that Maul had become enough of an irritant to attend to him personally. Shortly after Maul's coup on Mandalore, Sidious traveled to the Sundari Royal Palace and engaged Maul and Oppress in a duel. He easily bested the two nascent Sith Lords, killing Oppress and kidnapping Maul for some unknown purpose. By 19 BBY, the final phase of the Grand Plan came into effect. It began when Palpatine orchestrated his own kidnapping during a Separatist surprise attack on Coruscant itself. The Jedi Generals Obi-Wan Kenobi and Anakin Skywalker successfully liberated the Chancellor, but not before Skywalker killed Tyranus in cold blood at Palpatine's urging."}, {"tag": "p", "text": "With Darth Tyranus dead and the Separatists on the verge of defeat, Palpatine subtly guided Anakin Skywalker further into the dark side of the Force. He eventually revealed his secret identity as Darth Sidious to Skywalker, knowing that the young Jedi would report the revelation to the Jedi High Council. Masters Mace Windu, Kit Fisto, Saesee Tiin and Agen Kolar confronted the Dark Lord of the Sith, but ultimately failed to arrest him. Their failure not only cost them their lives, but also led to Anakin Skywalker's fall to the dark side. Embracing his new role as a Sith, Skywalker was initiated into the Order of the Sith Lords by his new Master. Henceforth, the fallen Jedi Knight ceased to be Anakin Skywalker and became Darth Vader."}, {"tag": "h4", "text": "Order 66 and the Great Jedi Purge"}, {"tag": "p", "text": "Shortly after his anointment as a Sith Lord, Darth Vader returned to the Jedi Temple at the head of the 501st Legion, a famed unit noted for its elite clone troopers. While Sidious's new apprentice carried out Operation: Knightfall, the mission to exterminate all Jedi inside of the Temple, the Dark Lord issued Order 66—a contingency directive issued in the event of a Jedi Rebellion—to the clone commanders. Failing to foresee imminent betrayal, countless Jedi officers were ruthlessly gunned down by the clone troopers. Although a few Jedi survived, including Grand Master Yoda and General Kenobi, much of the rest of the Order was destroyed on Coruscant and various other locations throughout the galaxy."}, {"tag": "p", "text": "By sunrise on Coruscant, Darth Sidious called for a special session of congress. Inside the Grand Convocation Chamber of the Senate Building, the Chancellor accused the Jedi Order of committing acts of rebellion, including an attempt on his own life. Hence, he labeled the Order's surviving members as enemies of the state, subject to summary execution upon discovery. What followed next was the Declaration of a New Order, which outlined the Republic's transition into the first Galactic Empire; a New Order ruled by the self-appointed Emperor Palpatine. After a thousand years of plots and patience, the Order of the Sith Lords achieved its two primary goals: the systematic purge of the Jedi Order and the rebirth of Sith galactic hegemony."}, {"tag": "p", "text": "Though the Sith exacted their vengeance on the Jedi, the victory was somewhat hollow for Darth Sidious due to the near death of his apprentice. Darth Vader was confronted by his former Jedi Master, Obi-Wan Kenobi, on Mustafar. Blinded by overconfidence in his own abilities, Vader had been dismembered by his former master and left to burn to death on the shores of Mustafar's lava flows. The injuries, combined with the psychological damage his transformation and recent choices had inflicted upon him diminished his potential power in the Force. The Emperor retrieved Vader and rebuilt his body, but the process ultimately turned Vader into a cyborg; a being more machine than man. Furthermore, he was forced to spend the rest of his life encased within a fully-concealing suit of armor—outfitted with life support technology—just to stay alive."}, {"tag": "p", "text": "In spite of Darth Vader's weakened potential, he still became the Emperor's chief enforcer and a much feared symbol throughout the Galactic Empire. Though he believed that Vader might still be capable of achieving his full potential with a complete psychological recovery, Sidious would always be on the lookout for a Force-sensitive who could replace his hobbled disciple. However, Sidious also realized that finding another apprentice as powerful as Vader was extremely unlikely, and, despite Sidious's sociopathic tendencies, he had even developed a degree of affection for Vader. However, as Sidious did not intend to be replaced by an apprentice in any event, it is unknown if Vader's condition was of any real concern to him. In fact, it appears to be very likely that Sidious actively sabotaged his apprentice's recovery and training, purposely limiting Vader's abilities so that his apprentice would not rebel against him."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "Through the Galactic Empire, the Order of the Sith Lords controlled the known galaxy through military force and state-sponsored terror. Planets that resisted the New Order's policies were swiftly made examples of by the Empire's clone soldiers, newly dubbed Imperial stormtroopers. For more than two decades, Emperor Palpatine ruled the galaxy by imposing peace through oppression, and order through fear. The few remaining members of the Jedi Order disappeared into hiding; others were hunted down and exterminated."}, {"tag": "p", "text": "However, trouble was brewing beneath the superficially stable surface of the Empire. As the brutality of the Sith regime became ever clearer, civil unrest grew accordingly throughout the fledgling Empire. Numerous Imperial Senators began to consider the possibility of open rebellion, and some of them even began funding anti-Imperial extremist groups like Rahm Kota's militia. These Senators had long been suspected by Sidious of treason, but the Emperor could find no proof of their rebel affiliations. Additionally, many of the suspected Senators were among the most respected members of the Senate, so he could not simply have them executed without massive public backlash. As such, Sidious had no viable means of eliminating these insurrectionist Senators, and simply had to put up with their actions. Even worse, although seemingly loyal to the Emperor, Darth Vader harbored a great deal of anger at his master and sought to overthrow his rule."}, {"tag": "p", "text": "For years, the Dark Lord personally trained a young Human orphan as his own Sith apprentice. The apprentice, codenamed Starkiller, was kidnapped by Vader shortly after his Jedi father was killed on Kashyyyk. Afterward, Starkiller spent years preparing for the day when he and his Master would overthrow Darth Sidious, thus allowing him to become a true Sith Lord. However, Sidious eventually discovered the young human and, instead of having him executed, decided to use him to gather the rebellious members of the Senate under the pretense of forming an armed insurrection against the Empire."}, {"tag": "p", "text": "For some unknown reason, Darth Vader apparently changed his mind about attempting to overthrow his master with Starkiller at his side. Once the apprentice fulfilled his purpose by bringing rebellious senators together in one location on Corellia, Vader betrayed Starkiller, nearly killing him, and apprehended the rebel leaders. In act of redemption for his former life as a Sith assassin, Starkiller defeated Darth Vader and rescued the senators, but ultimately fell during a struggle with Darth Sidious in the process. The apprentice's sacrifice resulted in the formation of the Alliance to Restore the Republic, a galactic insurrection aimed at the overthrow of Palpatine and the restoration of democracy. Sidious, frustrated by the setback of Starkiller's demise, was also concerned that the Rebel Alliance—secretly created by himself and Vader through Starkiller's actions—would eventually destroy the Order of the Sith Lords unless every rebel was exterminated first."}, {"tag": "h3", "text": "The Galactic Civil War"}, {"tag": "p", "text": "The Galactic Civil War was the result of Darth Sidious's failure to prevent the creation of the Rebel Alliance, which partially owed its existence to the Emperor's schemes. Despite being vastly outmatched in terms of resources and manpower, the fledgling Alliance remained committed to the cause of rebellion, even while being hunted throughout the galaxy by Darth Vader and the Imperial Military. The Alliance, however, presented the Emperor with an opportunity at seizing even more political power. Under the pretense of increased security, Sidious announced the Dissolution of the Imperial Senate; the legislative body that originated from the Senate of the former Republic ceased to exist as Imperial governors gained direct control over their star systems."}, {"tag": "p", "text": "The removal of the last symbol of the Old Republic was followed by the Battle of Yavin where the Galactic Empire experienced an unexpected defeat against the Rebel Alliance. The Empire's loss at Yavin 4 was further magnified in scale by the destruction of the Death Star, an immense battlestation designed to inspire submission through fear of its ability to destroy entire planets. The only thing that concerned the Emperor even more than the Battle of Yavin, however, was the Death Star's destroyer, Luke Skywalker."}, {"tag": "p", "text": "Luke Skywalker, a young Rebel pilot and the son of Anakin Skywalker, became a priority target of the Emperor and his apprentice. Both Sidious and Vader agreed that Skywalker had the potential to be a powerful asset to the Order of the Sith Lords, so long as he could be turned to the dark side first. As with Starkiller, Vader hoped to use his son in a plot to topple Sidious from the galactic throne. Likewise, the Emperor intended to claim the Jedi aspirant as his new apprentice, thus releasing him from the necessity of relying on Vader's services any longer. However, turning Skywalker was apparently not his preferred plan, as he attempted to have Skywalker killed by one of his personal assassins, Mara Jade, while the former attempted to free Han Solo from Jabba the Hutt. It was only after her assassination attempt failed, and Sidious was left with no other options, that he decided to try turning Skywalker to the dark side."}, {"tag": "h4", "text": "Fall of the Sith"}, {"tag": "p", "text": "Four years after the Battle of Yavin, Darth Sidious decided to accomplish two goals—Luke Skywalker's fall to the dark side and the end of the Rebellion—at the same time. Hence, he allowed the Alliance's Bothan spies to discern the location of the second Death Star, as well as the shield generator that protected the station during its construction period. Furthermore, he also chose to oversee its production in person, knowing that the Rebels could not afford to miss the opportunity to assassinate their main target."}, {"tag": "p", "text": "Neither Sith Lord succeeded in their objective. While Skywalker came close to embracing the dark side, in the end he refused to murder Darth Vader in hatred, hence declaring himself a Jedi as his father once was. Realizing that Skywalker was lost to the Sith and would not turn, the Emperor unleashed his own anger through the use of Force lightning, which he used to slowly torture the Jedi. But while doing so, the Emperor's apprentice experienced another metamorphosis, caused by the sight of his son in excruciating agony. The Emperor failed to realize that Darth Vader no longer stood beside him; the fallen Jedi Knight re-embraced the former persona of Anakin Skywalker."}, {"tag": "p", "text": "In a single act of redemption for all of his deeds as a Sith Lord, Anakin Skywalker suddenly seized Darth Sidious in order to save his son. Shrieking in utter surprise and terror, the Dark Lord turned the full power of his lightning against his now former apprentice. Despite sustaining critical damage to his armor's life support systems, Skywalker withstood the attack and threw his former Master into the Death Star's reactor shaft. With Darth Sidious's body destroyed and Anakin Skywalker succumbing to his mortal wounds, the Order of the Sith Lords was no more. After a millennium of hiding, their Order had finally taken its revenge on the Jedi, only to be destroyed by its last two members who ultimately killed each other. With this single act the prophecy of the Chosen One who would bring balance to the Force was finally fulfilled and realized at last."}, {"tag": "h4", "text": "Darth Sidious's rebirth"}, {"tag": "p", "text": "At some point before his death, Darth Sidious became obsessed with achieving immortality, much like his Master who also hoped to avoid the tradition of the Rule of Two. After rediscovering the lost ability to move his soul into another vessel, the Emperor secretly commissioned the creation of a series of clones with himself as their genetic template. Hidden within the Imperial Citadel of Byss, the clones were part of Sidious's plan to escape a similar fate of the many Sith Lords who preceded him. With the destruction of his original body on the Death Star II, the fallen autocrat used his new technique for the first time, thus preventing his spirit's banishment into the Void. Upon claiming one of his clones as a host for his essence, Darth Sidious was alive once more. He then hid on Byss for several years while plotting to reestablish his hold over the galaxy."}, {"tag": "p", "text": "The use of a cloned body was only a temporary solution. The fact that a clone was created beyond the natural process made it more vulnerable to the harmful effects of the dark side. As a result, the clones that Sidious inhabited were subjected to rapid age acceleration and decay, thus leading young clones to extreme old age in a short matter of time. Even still, however, Sidious regarded this dilemma as an acceptable price to pay for immortality. Although he found the dying painful and the transition uncomfortable, the Dark Lord believed that he would live forever as long as there was always a fresh supply of clones for him to possess."}, {"tag": "p", "text": "Without Sidious's presence, the Galactic Empire was fractured into various factions controlled by ambitious Moffs and Imperial officers who desired to seize opportunity in the wake of the massive power vacuum left behind by the fall of the Sith Lords. The discord that engulfed the Empire worked to the advantage of the New Republic—the successor state to the Rebel Alliance—and its objective to liberate the galaxy from Imperial control."}, {"tag": "p", "text": "When Sidious resurfaced in 10 ABY, he briefly turned Luke Skywalker into his apprentice. Convinced that the Emperor's defeat could only be achieved through the dark side, Skywalker accepted his father's former position at Sidious's side. But through the intervention of Leia Organa Solo, daughter of Anakin Skywalker, Skywalker broke the Emperor's influence over him. With the help of both Leia and her unborn son Anakin, Skywalker managed to disrupt Sidious's link to the dark side. This action caused Sidious to lose control over the Force storm he had been using to destroy the Rebel fleet at Pinnacle Moon. The storm obliterated Sidious's flagship along with his current body. Although Skywalker returned to his role as a Jedi, the Emperor cheated death once more by taking possession of another clone."}, {"tag": "p", "text": "As Sidious concentrated his full attention on destroying the New Republic and Luke Skywalker's new Jedi Order, a plot was orchestrated by a group of Imperial conspirators, led by Imperial Sovereign Protector Carnor Jax, who wanted to end the Emperor's reign permanently. They poisoned the last remaining supplies of clone bodies, thus diminishing the Emperor's ability to avoid his final death. Sidious, desperate and on the verge of oblivion as his last body aged into a deteriorated state, decided to inhabit the infant body of Anakin Skywalker's grandson, Anakin Solo."}, {"tag": "p", "text": "The dying Emperor journeyed to Onderon where he destroyed his last clone body, thus releasing his spirit in an attempt to gain control of Anakin Solo. His efforts were thwarted by the intervention of Empatojayos Brand, a survivor of the Jedi Purge. Using his mortally wounded body to trap the Emperor, Brand bound Sidious's life essence to his own, thus taking Sidious's spirit with him as he became one with the Force. The final death of Darth Sidious dissolved the lineage of Darth Bane, and the Order of the Sith Lords was finally destroyed."}, {"tag": "h3", "text": "Post-Darth Sidious Sith"}, {"tag": "p", "text": "The Order of the Sith Lords died with Darth Sidious in 11 ABY, but the Sith legacy was preserved in three separate cults. The first to confront the new Jedi Order was Lumiya's Sith, a collection of darksiders loosely related to Darth Bane's Order. As an Emperor's Hand, Lumiya had a limited knowledge of Sith teachings and dark side techniques during her tutelage under Emperor Palpatine and Darth Vader. When both Sith Lords perished at the hands of each other at the Battle of Endor, Lumiya proclaimed herself as their successor; a Dark Lady of the Sith. A strict adherent to the teachings of Darth Bane, Lumiya preserved the Rule of Two in her Order, and thus she searched for only one Sith apprentice to serve at her side. After passing over two failed apprentices, Flint and Carnor Jax, the Dark Lady successfully trained Jacen Solo, a grandson of Darth Vader and a Jedi Knight of the Galactic Alliance, as her successor by 40 ABY. With Lumiya's guidance, Solo accepted the Sith mantle as Darth Caedus, the first active Dark Lord of the Sith since the time of Sidious and Vader."}, {"tag": "h4", "text": "Lost Tribe of the Sith"}, {"tag": "p", "text": "In 43 ABY, the Jedi Order discovered the Lost Tribe of Sith, a hidden society that traced its origin to the Sith Empire of Naga Sadow. The Lost Tribe, created long before the rise of Darth Bane and the Rule of Two, was populated by many Sith individuals, all ruled by a Grand Lord. They formed a short-lived alliance with Luke Skywalker's Jedi Order to defeat a powerful being named Abeloth, but then betrayed the Jedi with preparations for galactic conquest."}, {"tag": "h4", "text": "Darth Krayt"}, {"tag": "p", "text": "The third organization that followed in the wake of Sidious's demise was the One Sith, founded by Darth Krayt. Once a Knight of the first Jedi Order, Krayt fought for the Old Republic during the Clone Wars as A'Sharad Hett. Although Hett survived the betrayal of the clone troopers during Order 66 and the subsequent Purge, his faith in the light side of the Force was destroyed by the desire for vengeance against the Galactic Empire and the Order of the Sith Lords. Hett eventually came to believe that the only way to defeat Sidious and Vader was by embracing the power of the dark side. Though he recreated himself as Darth Krayt, the self-proclaimed Sith Lord ignored Bane's Rule of Two. Under Krayt's Rule of One, the new Sith Order included many members in its ranks, all of whom were indoctrinated with absolute loyalty to a single Dark Lord of the Sith. In the year 130 ABY, Darth Krayt established a new Galactic Empire after seizing the Imperial throne for himself."}, {"tag": "p", "text": "This organization would later be taken over by Darth Wyyrlok after the latter murdered Darth Krayt, although it would eventually be under the command of Darth Krayt again, having managed to revive himself. The One Sith eventually ended up defeated when Darth Krayt died, this time permanently, and his remains flung into the sun, with several surviving Sith-aligned members going underground. The One Sith eventually ended up destroyed altogether by a rogue Sith named Darth Wredd wiping out all of the Sith except for himself with the intention of reinstating the Rule of Two. However, Wredd ultimately failed to gain an apprentice in the form of the Imperial Knight Yalta Val, who remained true to the light side, and Wredd ended up being killed by Ania Solo, presumably wiping out the Order of the Sith Lords permanently, although the Empress Marasiah Fel implied that this may not necessarily be the case."}, {"tag": "h2", "text": "Ranks"}, {"tag": "p", "text": "In order to ensure the survival of the Sith, Darth Bane instituted the Rule of Two. Hence, only two Sith Lords were allowed to exist at any given time; the master and an apprentice. This new tenet was also meant to inspire the apprentice to murder the master, thus culling the weak from the Order and guaranteeing that only the strongest were fit to be Sith Lords. Both members of the Order held the title Dark Lord of the Sith and were required to adopt a Sith name, beginning with the title of Darth."}, {"tag": "p", "text": "Sith Master"}, {"tag": "p", "text": "Sith Masters were the head of the Order. Only one master could exist at a time, and each was supposed to have only one apprentice to serve them. Notable Sith Masters included Darth Bane, Darth Plagueis and Darth Sidious."}, {"tag": "p", "text": "Sith apprentice"}, {"tag": "p", "text": "Sith apprentices were neophytes in the ways of the dark side of the Force. Although they were taught to embrace absolute submission during their training, apprentices also had a tendency to become utterly fixated on the power that the Master embodied as the senior Dark Lord of the Sith. A dynamic designed by Darth Bane led to a tradition in which the apprentice eventually killed the Master and usurped the role of leadership. Upon appointing an apprentice of their own, the cycle would be renewed as the new apprentice waited until his or her power eclipsed the Master."}, {"tag": "p", "text": "Notable Sith apprentices included Darth Zannah and Darth Vader."}, {"tag": "h2", "text": "Secret Apprentices"}, {"tag": "p", "text": "Different from a Dark Jedi acolyte or a formal Sith apprentice, a secret apprentice was an individual who was introduced into the Order and trained by a Master to replace a failed apprentice, or by an apprentice in order to overthrow the Master. With the exception of Darth Maul, whom Darth Plagueis was aware of, the following apprentices were trained in absolute secrecy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}