{"url": "Order_of_the_Terrible_Glare/Legends", "categories": ["Category:Legends articles", "Category:Force-based organizations"], "nodes": [{"tag": "h1", "text": "Order of the Terrible Glare"}, {"tag": "p", "text": "The Order of the Terrible Glare was a splinter group of the Jedi Order, formed by dissident Jedi Knights during the Pius Dea Crusades. When the Jedi Order recused itself from the Galactic Republic during this time, these dissenters rallied to the Pius Dea cause, and abandoned Ossus in favor of Garn. Becoming a violent and dangerous cult led by shamans, the Order waged war against the Jedi before being destroyed at the end of the Crusades. The sole survivor, Rur, lived on in a computer and lured Jedi to Garn for thousands of years, taking vengeance on them one at a time. However, Rur was finally defeated by Luke Skywalker during the Galactic Civil War, which brought an end to this ancient Order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Order of the Terrible Glare was a group of dissident Jedi Knights who splintered from the Jedi Order when the Jedi High Council withdrew to Ossus during the Pius Dea Crusades of the Galactic Republic. Believing that the Pius Dea were correct in their pursuit, these Jedi abandoned the Order and championed the crusaders who were causing turmoil across the Republic. The shamans of the Order used their Force abilities learned on Ossus to pervert nature, developing soul snare—crystal prisms that were capable of imprisoning the life force of a sapient being for eternity. Master illusionists, the shamans of the Order of the Terrible Glare established a base on the desolate planet Garn where they stored massive computer terminals to store their knowledge and equipped with sensors able to detect lightsabers across interstellar distances. At some point, the Order also allied with the ghastly inter-dimensional monsters, known as the Rozzum."}, {"tag": "p", "text": "Despite the length of the Crusades and the fanaticism of the Order's shamans, the Jedi Order proved to be more powerful and were able to overthrow Supreme Chancellor Contispex XIX on Coruscant. With the Republic under control, the Jedi Order dispatched a strike team to Garn and laid waste to the world. While all members of the Order were thought to have been killed, High Shaman Rur survived long enough to encode and preserve his mind within one of the Order's computers."}, {"tag": "p", "text": "Trapped within the Order's black tower, Rur would secretly continue to wage war against the Jedi Order for millennia, using long-range sensors to detect lightsabers and sending false distress signals to lure their wielders to Garn and to their deaths. Rur, in his computerized state, lost sense of time; a span of more than 10,000 years was to him but a few months."}, {"tag": "p", "text": "At the height of the Galactic Civil War, Rur lured Luke Skywalker to Garn using a distress signal in which a woman pleaded for help from his tower. There, Skywalker was \"attacked\" by giant \"pale squirmers,\" manifestations of his own fears, and discovered soul-snares still containing the life forces of fallen Jedi Knights. Elsewhere in the tower, he discovered the desiccated skeletal remains of armored Jedi, and ancient and alien remains unknown to him."}, {"tag": "p", "text": "Ultimately, Skywalker encountered the vengeful remains of Rur, who appeared as a green-skinned humanoid figure draped in ornate vestments within a green translucent pyramid. Rur accused the Jedi of treachery in their \"recent\" attack \"many months ago,\" and announced his intention to take revenge on Skywalker as he had done to so many others. Recognizing the planet and the ancient Order from a story briefly related to him by Jedi Master Obi-Wan Kenobi, Skywalker explained to Rur that the Jedi were all dead, killed in the Great Jedi Purge, and that he was not a Jedi, but merely a man with a lightsaber."}, {"tag": "p", "text": "Unable to reconcile the destruction of the Jedi Order and the passage of so much time with his ancient lust for revenge, Rur fell into a self-destructive fit of dissonance, and destroyed the tower. Skywalker narrowly escaped, reflecting on the hatred and vengeful spirit that had finally consumed the last of the shamans of the Order of the Terrible Glare."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Order of the Terrible Glare is in some ways a precursor to later, better-established elements of Star Wars lore, such as the Dark Lords of the Sith, as ancient and terrible enemies of the Jedi, thought long-since destroyed, and the Ssi-ruuk, as enemies who stole souls and kept them imprisoned in technological constructs. In particular, Rur bears a strong resemblance to the later character of Exar Kun, who also escaped destruction at the Jedi's hands by death, returning to menace Luke Skywalker thousands of years after his demise. Given the use of crystals in the Terrible Glare's unique technology, it is visually similar to the Sith Empire's magic, but in light of Palpatine's interest in the Ssi-ruuk's entechment technology, it is highly likely that the Sith Lords never obtained the secrets of the Terrible Glare's soul-snares, even though they were able to imprison evil spirits within their holocrons."}, {"tag": "p", "text": "The Order of the Terrible Glare was featured in Joseph Bongiorno's and Rich Handley's article Cult Encounters of the Star Wars Universe, though Star Wars Gamer was canceled, it was later published on www.starwarstimeline.net."}, {"tag": "p", "text": "Finally, what—if anything—this order had to do with the name given to the storm of solar irradiation that engulfed Dweem and its neighboring worlds, circa 60 BBY, has not yet been established."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}