{"url": "Order_of_the_Silver_Jedi", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Jedi organizations"], "nodes": [{"tag": "h1", "text": "Order of the Silver Jedi"}, {"tag": "p", "text": "The Order of the Silver Jedi was a sect of the Jedi Order devoted solely to combat the dark side of the Force wherever it manifested, as well as to \"Serve and Protect\" the Galactic Republic. The Silver Jedi, even more so than the \"ordinary\" Jedi, were dedicated to the complete eradication of all dark side influences from the galaxy. Though they were a military organization, they also included some of the great Jedi theorists and philosophers in their ranks. The insignia of the order was a silver crescent with its tips pointed downwards, and a pair of ignited lightsabers crossed at the handles beneath it."}, {"tag": "p", "text": "As they were in constant battle with beings of the dark side, they soon noticed that beings who used the dark side could do so to bolster their strength, and so they soon began experimenting with ways to make their connection with the light side even greater. They tampered with the natural bond which all beings shared with the Force, all with the best of intentions. Though some found a minor amount of success—their abilities seemed enhanced, their powers more potent—this was not yet good enough for the Order. In their haste to defeat the dark side once and for all, they discovered what they thought to be a fool-proof (if not dangerous) means of opening oneself fully to the power of the Force."}, {"tag": "p", "text": "Tel Angor, the Order's greatest Jedi Knight at that time, an experienced and dedicated Knight, volunteered for the experiment happily. He was ordered to take at least a month to prepare during which time he meditated, fasted, and concentrated on his connection to the Force in anticipation of a complete merge with it. Both the Order and Angor himself believed he would become a living symbol of the light side, a glowing beacon of righteousness and justice."}, {"tag": "p", "text": "Unfortunately for Angor, and indeed the galaxy itself, the experiment backfired; instead of drawing on the Force to bolster his abilities, Angor was corrupted completely by the dark side and turned into the Force Vampire, a being that fed on the Force and indeed needed it to survive. As soon as he came to life, the Vampire's first act was to feed on the Silver Jedi who had aided him in the experiment, followed by destroying all the notes and computer files he could find in relation to his creation. From this point on, the Vampire attacked any existence of the Order of the Silver Jedi it could find."}, {"tag": "p", "text": "After the rest of the Order discovered what had happened, they hunted the Vampire down relentlessly. Unfortunately, whenever they discovered a lead as to where his location may be, all they discovered were corpses. Eventually, just before the time of the Clone Wars, a team of seven Silver Jedi managed to track the Vampire and, in a great battle, finally captured him. They then imprisoned him on an Outrider-class cruiser and joined him as the ship was sent on an automated continual jump through hyperspace. They decided to serve as the Vampire's guardians, keeping him imprisoned until a way could be found to bring Angor back."}, {"tag": "p", "text": "Not long after the trip began, however, one of the Jedi made a critical error and the Vampire escaped. The Vampire quickly went about feeding on, then murdering, anyone on board he could find. When it was only down to the last of the Silver Jedi, a Knight named Bar Oplut, he managed to sabotage both the hyperdrive and sublight drives to keep the Vampire from escaping before dying valiantly in the inevitable final battle."}, {"tag": "p", "text": "What happened to the rest of the Silver Jedi after this is unknown, some believe that they fell victim to either Order 66 or Second Jedi Purge, others argue they survived, but by the time of the New Republic their only remaining stronghold on the planet Coruscul had been abandoned. When the Vampire was finally freed by a New Republic picket ship, he attempted to get to this last stronghold to destroy it also, but was stopped before he could get there. This base contained the last journal which described the experiments and the results which twisted Tel Angor into the monster he now was. The journal ended apologetically, with the note, \"We never should have tried.\""}, {"tag": "h2", "text": "Sources"}]}