{"url": "Order_of_Shasa", "categories": ["Category:Legends articles", "Category:Force-based organizations", "Category:Imperial organizations"], "nodes": [{"tag": "h1", "text": "Order of Shasa"}, {"tag": "p", "text": "The Order of Shasa was a Force-sensitive cult of Selkath natives of Manaan who were duped to serve Darth Sidious during the tenure of the Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Order took its name from a Force-sensitive Selkath named Shasa that the Sith had lured, along with her friends, to the Sith Embassy on Manaan. The Sith planned to use the impressionable Selkath to overthrow the Manaan government, and replace it with the easily-manipulated young Force trainees. However, the plot was uncovered by Revan, and he successfully convinced the Selkath of the Sith's evil nature. The Sith's actions, threatening Manaan's neutrality, were punished by restrictions on their kolto shipping."}, {"tag": "p", "text": "After the end of the Jedi Civil War Shasa quickly realized that if Manaan was to remain truly neutral in the coming years, the Selkath must not rely on the Jedi anymore than they rely on the Sith. Because Force-sensitive Selkath still needed training and guidance to develop their powers and avoid the dark side, Shasa and the other Sith-trained Selkath developed a doctrine of peace and defense, creating an organization initially known only as the Order. The Order was secretly based in an abandoned mining station in the Hrakert Rift. But with its few members formally trained in the ways of the Force by the Sith, the Order immediately discovered that dark side temptations were a constant threat. Those with Sith training had difficulty disregarding their early lessons, and the Order of Shasa struggled to resolve the conflicts by seeking a path of moderation between the light and dark. With the Sith deception fresh in her mind, Shasa initially avoided contacting the Jedi or any other Force-using tradition for aid. However, when dark side proponents made significant advances or began to influence new members of the Order, she did not hesitate to seek advice from a Jedi she trusted, or from another Force tradition with a good reputation, such as the Jal Shey."}, {"tag": "p", "text": "The Order continued to exist even after Manaan fell from the galactic stage. During the Galactic War, the Order of Shasa defended an underwater laboratory conducting experiments with Rakata technology to create invincible supersoldiers for the Order of Revan's Infinite Army at the behest of Revanites, Darth Arkous and Colonel Rian Darok. Republic and Imperial strike teams sent by Theron Shan and Lana Beniko fought their way past the Order's adepts and any survivors presumably perished when the Revanites scuttled the base."}, {"tag": "p", "text": "By the time of the Galactic Empire, the Order held over two hundred adepts, remarked upon as being disproportionately high considering the size of the population. Despite this, they were little defense against the Empire as they subjugated the world."}, {"tag": "p", "text": "Oddly enough, many of them managed to elude the Empire for years, until a mysterious stranger contacted them sometime before the Battle of Endor. This heavily cloaked Human with a rebreather (Darth Vader) gave them detailed information on the guards and encouragement (possibly through the Force), and instructed them to strike back against the resort that had been built on Manaan during the Imperial Rule. Two hundred of the Order's finest managed to swim through Ahto's waste disposal system without effort (a feat that would normally have been quite distressing for a Selkath), and took out the guards with incredible speed, driving them into a retreat. But a strange bloodlust overcame the members of the Order, and they tore into the resort guests, slaughtering them all in a shark-like killing frenzy. When the rage wore off, the Order members were shocked, but the strange Jedi with the dark helmet and deep voice told them that their revenge would make them strong, and now they all served The Emperor."}, {"tag": "h2", "text": "Practices and Abilities"}, {"tag": "p", "text": "The Order held the safety of the Selkath as its foremost priority. Storytellers of the Order passed down knowledge of the planet's history to younger generations, strengthening the dedication of the Selkath to Manaan. Each adept would be assigned to a master, with the training period being anywhere from months to years."}, {"tag": "p", "text": "A sword known as the fira was to the Order as the lightsaber was to the Jedi; each was unique, constructed by the trainee of rare materials as part of their training. The materials used in the fira were taken from the old Hrakert Rift station, destroyed by Revan in times past. The raw elements were shaped and tempered using volcanic ocean floor vents, making the experience dangerous as well as challenging. To construct a fira was to be truly inducted into the Order. This ritual was known as the Rite of Fira."}, {"tag": "p", "text": "The Order of Shasa, motivated by Sith duplicity during the Jedi Civil War, acquired a powerful Force-based ability to perceive deception. They developed the mind-affecting power known as the Progenitor's Call, which could disrupt their enemies' actions. The Order was also known for a telekinetic manifestation they called a waveform, which manipulated the particles of the environment to enhance the impact of telekinetic assaults."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}