{"url": "Origami_Yoda", "categories": ["Category:Real-world articles", "Category:Non-canon Legends articles", "Category:Origami Yoda"], "nodes": [{"tag": "h1", "text": "Origami Yoda"}, {"tag": "p", "text": "The Origami Yoda series of children's books was created by American author Tom Angleberger. Featuring Star Wars elements whose use was officially licensed by Lucasfilm Ltd., the series presents the adventures of a group of children in middle school."}, {"tag": "p", "text": "The story begins when a social outcast in the school named Dwight Tharp creates a finger puppet that is dubbed \"Origami Yoda.\" Tommy Lomax opens a case-file to investigate when it seems as though Dwight is using the Force to channel power through Origami Yoda to answer people's questions about topics such as life and love."}, {"tag": "p", "text": "A new threat emerges in the form of \"Darth Paper,\" who unlike Origami Yoda, gives snide and crass answers to questions. A sequence of events eventually results in Dwight's being expelled from the middle school and he is sent to a private school called Tippet Academy."}, {"tag": "p", "text": "Following these events, three girls at the school, including Tommy's crush Sara, create new finger puppets called the \"Fortune Wookiee,\" and \"Han Foldo\" a translator. These new puppets again help to solve people's problems, though Tommy begins to suspect that there is something not on the level about the two."}, {"tag": "p", "text": "The Surprise Attack of Jabba the Puppett sees the return of Dwight and focuses on the students creating an Origami Rebellion to face off against the \"FunTime Menace,\" a test-preparation program that involves a series of hokey videos and worksheets that has caused all elective classes to be canceled. The plot was resolved in Princess Labelmaker to the Rescue. Emperor Pickletine Rides the Bus focuses on a school field trip to Washington D.C. that they fought for in Jabba the Puppett and its sequel, Princess Labelmaker to the Rescue."}, {"tag": "p", "text": "Art2-D2's Guide to Folding and Doodling  is a collective activity book in which Kellen Campbell and Dwight Tharp make a guide for Star Wars doodling (Kellen), folding (Dwight), and other activities by various other students, with the help of Art2-D2."}, {"tag": "h2", "text": "Titles"}, {"tag": "h2", "text": "Bibliography"}]}