{"url": "Attack_on_Goff", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Airam sector", "Category:Battles of Task Force Vengeance"], "nodes": [{"tag": "h1", "text": "Attack on Goff"}, {"tag": "p", "text": "A battle involving the XQ5 Platform Goff taking place during Imperial Task Force Vengeance's operations in the Airam sector. The Imperial-class Star Destroyer Rage and the Interdictor Compellor launched an attack on the Airam supply station of Goff Platform, intending to seize it for the Empire."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Following their police action near the Blair Cluster, the Empire had, through interrogation of prisoners, gained unequivocal evidence of Airam involvement with the Rebels. Intent on discouraging such cooperation, a demonstration of Imperial might was agreed upon. The target selected by Imperial Intelligence was an Airam supply platform in the Goff system. The goal was to seize it intact for use as a forward staging point for further operations in the sector."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "The Empire's strike force, consisting of Star Destroyer Rage and interdictor Compellor, entered the area and proceeded to execute its preplanned pincer attack. As expected, a Rebel ship was present, docked at the platform. This was escort transport Omicron 2, bearing Rebel officers."}, {"tag": "p", "text": "Avenger Squadron was launched to draw off defending forces while Rage and Compellor then made a nano-jump to the other side of the platform. Once there, Rage launched Beta and Gamma Squadrons in their TIE/sa bombers and TIE/LN starfighters. Beta was to knock out Goff Platform's shields with torpedoes, allowing Delta-class DX-9 stormtrooper transports from Sigma Squadron to disable it for capture. Gamma was tasked with protecting Beta. All craft were also required to protect Sigma, as the loss of even one of the craft would constitute a mission failure."}, {"tag": "p", "text": "Goff Platform's defense force consisted of Bat Squadron in R-41 Starchasers, patrol craft Sele and Iphige, Lambda-class shuttle Flan, and escort shuttle Cateb. Bat Squadron and the other Airam defenders engaged Avenger Squadron but were soon destroyed by their speedier adversaries. Omicron 2, in defiance of an Imperial arrest order, loosed a torpedo salvo at Compellor. Despite taking damage, the Rebel ship fought hard and surrendered only when faced with imminent destruction."}, {"tag": "p", "text": "Meanwhile, Beta Squadron's own torpedoes slammed home against Goff Platform. However, no sooner had the platform's shields fallen to one-quarter strength then the Rebel Nebulon-B2 frigate Colada arrived to aid its potential allies and rescue Omicron 2. The Airam then proved their informal alliance with the Rebels by launching the shuttle Rateb from Goff Platform with an Airam leader aboard to dock with Colada. In defense of the Rateb, and with intent to drive off Compellor whose interdiction fields trapped them all, the commander of the Rebel frigate launched Azul Squadron in its Z-95 Headhunters and Grez Squadron in its Y-wings."}, {"tag": "p", "text": "Faced with this new threat, the Imperials turned their starfighters against the Rebel interlopers. Beta Squadron now fired its remaining torpedoes at the Colada, leaving Goff Platform to be handled by Sigma Squadron. Avenger and Gamma Squadrons engaged Azul and Grez, both of which had Compellor as their target. Shuttle Rateb also was fired upon, as the Empire had no wish to allow a Rebel/Airam alliance of any kind to strengthen."}, {"tag": "p", "text": "In a harrowing fight, Avenger and Gamma disposed of their Rebel starfighter foes while Beta and Rage pounded Colada. Goff Platform, by now heavily damaged, broadcast its surrender, pleading for the Imperials to cease firing on the station, as it was losing air pressure rapidly. Sigma Squadron promptly boarded the Airam station and within minutes had taken control."}, {"tag": "p", "text": "As for Colada, it fought back with zeal. When the frigate's shields hit null, Rage demanded its surrender. However, Colada responded defiantly—the Rebels vowed to never give up their ship. The Imperials gave their adversaries a cold farewell and then resumed fire, destroying the Colada completely."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With this, the second victory of the campaign, Admiral Wooyou Senn was convinced that he had properly demonstrated the might of the Empire. By capturing the Airam platform, he had shown them the price they would pay for assisting the Rebels. The Airam, he believed, would be dissuaded from such activity in the future. Furthermore, a permanent Imperial presence had been established within Airam space."}, {"tag": "p", "text": "There were, however, some causes for concern. The arrival of the Rebel frigate, Senn theorized, was a calculated attempt to recruit the Airam over to the Rebellion. Senn feared that by showing the Airam their willingness to sacrifice their own troops to save a neutral party, the Rebels might well succeed in forming an alliance with the locals. Also, the Empire grew more certain that the Rebellion was indeed working towards setting up a new base of operations in the sector. The prisoners taken at the First Battle of Goff would be interrogated to learn just how and where the Rebels meant to establish it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}