{"url": "Orientation", "categories": ["Category:Real-world articles", "Category:Canon short stories", "Category:Short stories republished with novels", "Category:Star Wars Insider fiction"], "nodes": [{"tag": "h1", "text": "Orientation"}, {"tag": "p", "text": "\"Orientation\" is a short story by John Jackson Miller that was published in Star Wars Insider 157. The story takes place immediately before the novel Lords of the Sith by Paul S. Kemp, and features Darth Sidious and Darth Vader."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "Aboard the Imperial cruiser Defiance, a training exercise has commenced for the twenty members aboard the ships bridge. Led by Commandant Pell Baylo, the training exercise was a battle-time simulation for the cadets while enroute to Ryloth from Coruscant. Presiding over the fictitious battle, Darth Vader loomed as Baylo shouted orders. Keeping to himself, Vader had been silently observing the Commandant ever since The Emperor had left him there on the bridge with him. And Baylo, who was now well over seventy, had yet to impress the Dark Lord. The Emperor, who had previously ordered a stop in the Denon system to consult with several chiefs of the Imperial Navy about the jumble of affiliated military schools that had once existed under the Galactic Republic, had busied himself elsewhere, leaving a reluctant Vader to observe Baylo and his cadets."}, {"tag": "p", "text": "Pell Baylo had been the one to suggest that the Emperor hold his meetings aboard the Defiance, though Darth Vader had seen through the offer. Baylo was attempting to save his school. The Defiance Flight Training Institute, better known as \"the Baylo School\", had been around since before the Clone Wars, under the umbrella of the Republic, and now the Galactic Empire. Despite the Empire taking charge, Naval leaders had been loathe to rein Baylo in. He had treated the institute as his own personal property, ignoring schedules and deviating from the deadlines that had been set before him, and now it seemed, as Vader knew, that the famed institute would be taken away. Baylo, still shouting orders and training the young crew, some who were on their first orientation flights, had shown signs of the obvious injuries he had sustained over the years, furthering Vader's belief that the commandant was unfit for his role."}, {"tag": "p", "text": "Still docked in the Denon system, word came up that Vice Admiral Tallatz had boarded. Noting that that had been the last of the Emperor's guests, Pell Baylo had given the order for the navigator to plot the hyperspace route to Christophsis where the Defiance was scheduled to meet with the Perilous. When the navigator had determined the route, Baylo had decided that he would take a second look, to which he determined that the route the navigator plotted would send them into Wild Space on account of failing to account for a singularity. Scorned and embarrassed, the navigator stood back while Baylo plotted the correct route. After an exchange of offhanded comments and would-be insults with the Dark Lord, Baylo ordered the jump to hyperspace when the docking was complete and exited the bridge to prepare for potential meetings. Darth Vader, who was still in keeping to his thoughts, sensed the apprehension and confusion in the navigator that Baylo had just corrected. Vader ordered an immediate hold on the order to jump to hyperspace. Descending into the stairwell where the navigator was, Vader learns that her name is Rae Sloane of Ganthel. Upon further questioning from Vader, Sloane admits that, upon a second viewing of the coordinates set by the commandant, something didn't seem right."}, {"tag": "p", "text": "Only a little while later, in the anteroom of the administrative deck, Darth Vader steps in to find Pell Baylo waiting outside, observing once again the man's frailty. With the ship now in hyperspace enroute to Christophsis, Baylo had been summoned by the Emperor for a personal meeting. Expressing to Vader his discontent to waiting outside of his own office, Baylo watched as four admirals silently exited the room while giving him only brief glances on their way out. Vader, signaling to enter the office, follows Baylo in where the Emperor was waiting for them. Here, the Emperor lays out his plans for the Imperial Academy which included vast modifications to streamline operations."}, {"tag": "p", "text": "The Emperor had decided that \"the Baylo School\" would be folded into an existing training center on Corellia and that the commandant would take a chair at the navigation institute planet side, all to which Pell Baylo ultimately declined. The Emperor, who was surprised by the response, allowed him to continue as Baylo affirmed his loyalty to the late Republic. Baylo reinforced his statement by claiming to not recognize the legitimacy of the Galactic Empire while also stating that he would not hand over the Defiance. Instead, Baylo offered his resignation to the Emperor from the Navy maintaining that he would not give in to the Emperor's demands. The Emperor, amused by his reaction, inquired as to why he had the audacity to respond to which Darth Vader made it known that Baylo had planned to destroy the Defiance, and everyone aboard, by plotting the hyperspace coordinates to emerge into the sun near Christophsis; this plan Vader had foiled with the help of the navigator Rae Sloane."}, {"tag": "p", "text": "Dropping out of hyperpspace and realizing that his plan had failed, Pell Baylo made known his true thoughts of the Emperor. He accused him of corrupting the Navy, turning something honorable into something corrupt and was turning everyone around him into mindless, obedient droids. Before he could finish insulting the Emperor, Darth Vader Force choked Baylo and killed him. Disappointed with the Dark Lord, the Emperor reprimanded him for killing Baylo without his say-so. The Emperor explained that he wanted to keep Baylo alive and force him to watch the Navy be turned into something he hated and have the Defiance be recycled into cafeteria trays. Above all, he wanted to use Baylo, a man who was willing to kill his own students for a cause, for his own ambitions. But that plan was ruined because Vader killed him. Vader tried to explain that his way was more efficient, but the Emperor told him his reasons don't matter and that he shouldn't have killed Baylo because he did not order it."}, {"tag": "p", "text": "At that moment, Rae Sloane entered to inform the Emperor that Captain Luitt of the Perilous had hailed them, ready to resume the journey to Ryloth. Sloane, who just realized her now former superior was dead, which Palpatine brushed aside as Baylo merely dying of old age; was then instructed by the Emperor to relay new information to her superiors at the academy: the ship's name was to be changed from the Defiance to the Obedience as a last subtle jab at Baylo and a not-so-subtle reminder to Vader to remember his place."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}