{"url": "Oric_Harfard", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Alliance Security members", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Oric Harfard"}, {"tag": "p", "text": "Oric Harfard was a Human male captain in Galactic Alliance Security in 43.5 ABY. He led the Security forces that were sent to the Jedi Temple to arrest the Jedi Knight Valin Horn, who had recently gone on a destructive rampage as the result of a psychotic breakdown. Harfard later led the Security forces to the Jedi Temple in search of the rogue Jedi Seff Hellin, who had been secretly captured by Darkmeld—a covert organization formed by Jedi Knight Jaina Solo to counter the Chief of State Natasi Daala's anti-Jedi policies—and brought to the Temple to be studied. When Harfard questioned acting Grand Master Kenth Hamner, Hamner denied knowledge of Hellin's whereabouts, as Solo had kept her organization secret from the Jedi Masters."}, {"tag": "p", "text": "Captain Harfard later accompanied Daala when she met with Han Solo during the siege of the Jedi Temple in order to negotiate the surrender of psychotic Knights Sothais Saar and Turi Altamik to the Galactic Alliance. The move was a ploy orchestrated by the Jedi, however, as Saar and Altamik had both been cured. Once this had been proved to Daala, she was forced to order Harfard to lift the siege on the Temple."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Oric Harfard was a captain in Galactic Alliance Security. In 43.5 ABY, Jedi Knight Valin Horn suffered a psychotic breakdown that caused him to go on a destructive rampage. He was quickly caught and placed in the Mon Mothma Memorial Medical Center, and then transferred to the Jedi Temple. Harfard was later issued a warrant by the Galactic Alliance Chief of State Natasi Daala, for the arrest of Horn. Harfard led a group of Security troopers, along with the bounty hunters Zilaash Kuh and Vrannin Vaxx, to take custody of Horn. He was stopped outside the Temple entrance, where he had a dispute concerning the authorization of his entrance with the Jedi Master Kyp Durron. Master Cilghal quickly arrived at the scene and diffused the situation, reluctantly allowing Harfard to enter. During the arrest, Cilghal proceeded to delay the captain, but Harfard eventually took Horn into custody. Horn was then put on trial, encased in carbonite, and placed in the Armand Isard Correctional Facility, a Galactic Alliance prison."}, {"tag": "p", "text": "Shortly thereafter, Jedi Knight Seff Hellin, who was suffering from the same disease as Horn, attempted to rescue the carbonite-encased Jedi from the prison. During his rescue attempt, Hellin was captured by Darkmeld, a covert organization formed by Jedi Knight Jaina Solo to counter Daala's increasingly anti-Jedi policies. During Hellin's capture, Solo was spotted with her lightsaber, and, although she wasn't recognized, the sighting led the Galactic Alliance to believe that a Jedi had captured Hellin. The next day, Harfard—who had recently been made point man for Alliance-Jedi Order interactions—was issued a warrant for the arrest of Hellin. Harfard once again led a force of Security troopers to the Jedi Temple. There, he questioned the acting Grand Master Kenth Hamner, who truthfully denied all knowledge of Hellin's whereabouts, since Solo had kept Darkmeld's operations secret from the Jedi Masters. The captain quickly became exasperated, and after exchanging threats with Hamner, Harfard and the Security troops left the Temple."}, {"tag": "p", "text": "Later, in 44 ABY, Harfard accompanied Daala when she arrived at the Jedi Temple to negotiate the public surrender of psychotic Jedi Knights Sothais Saar and Turi Altamik during the siege of the Temple. Harfard frisked Han Solo, who came out to greet Daala, for weapons. However, the move was a ploy by the Jedi—they used that moment to show that the formerly psychotic Knights had actually been cured. Solo told Harfard to order the Mandalorians who were sieging the Temple at Daala's orders to hold their fire, as Saar and Altamik were coming out of the Temple. As the Jedi emerged, Harfard ordered some of his troops to quickly form a guard around Daala. When Solo suggested that the Chief of State was scared, she ordered Harfard to have his men stand down, and he obliged very reluctantly. As Saar and Altamik approached, Harfard held Solo at blasterpoint and refused to let the Jedi come near Daala. Solo, however retorted that assassination wasn't in the Jedi character, and Daala waved Harfard aside. After Doctor Thalleus Tharn observed Saar and Altamik and pronounced them cured, Daala ordered Harfard to lift the siege."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Harfard was a lanky man who believed himself to be superior to others and enjoyed being in control of situations. As such, he was often quick to anger when those beings around him didn't follow his orders. This led him to assume a dislike for the Jedi, who frequently defied him. Harfard was often condescending to those that irritated him, and he openly slandered fellow Security Captain Savar. He also insulted Cilghal by calling her a \"fish-head\"—a derogatory name for her species, the Mon Calamari. Harfard also frequently threatened beings that annoyed him or got in his way."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Oric Harfard was created by author Aaron Allston for Fate of the Jedi: Outcast, his first novel in the Fate of the Jedi series. Harfard later made an appearance in Troy Denning's Fate of the Jedi: Vortex, the sixth installment in the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}