{"url": "Original_unaltered_trilogy", "categories": ["Category:Real-world articles", "Category:Home video"], "nodes": [{"tag": "h1", "text": "Original unaltered trilogy"}, {"tag": "p", "text": "The original unaltered trilogy refers to the original theatrical versions of the first three Star Wars films, before they were modified for the Special Edition and subsequent re-releases. These sets were repackaged for a November 2006 box-set release."}, {"tag": "h2", "text": "StarWars.com summary"}, {"tag": "p", "text": "The Star Wars trilogy comes out for a limited time as individual movie DVDs on September 12th—complete with the unaltered original films as bonus material—and will be available for pre-order starting this week. This is a chance for longtime fans to re-experience the movies as they originally played during their first theatrical releases, and an opportunity for new fans to see a bit of movie history."}, {"tag": "p", "text": "Each movie comes as a two-disc set—one disc is the 2004 remastered version of the film, while the second disc is a version that captures its original theatrical presentation. For more information about this release, see the original announcement story here. StarWarsShop.com will be making Star Wars, The Empire Strikes Back, and Return of the Jedi available for pre-order on Friday, May 12."}, {"tag": "p", "text": "Here's a look at the cover art for this release. Done in the photo-montage style of previous DVD release, each movie mimics a poster design from the original theatrical campaign."}, {"tag": "h2", "text": "Controversy"}, {"tag": "p", "text": "Although fan reaction to the announcement of the DVDs was largely positive, upon release many fans were disappointed due to the unaltered versions having non-anamorphic video sourced from the 1993 LaserDisc releases, which was nowhere near the same quality as the remastered versions of the films present in the 2004 box set. In 2011, the Despecialized Editions (unofficially) brought an anamorphic theatrical cut to DVD owners."}, {"tag": "h2", "text": "DVD covers"}, {"tag": "h3", "text": "Full Screen"}, {"tag": "p", "text": "Although the packaging says \"full screen,\" only the 2004 remastered version of each film is full-screen, cropped into pan-and-scan form. In both the full-screen and widescreen releases, the unaltered version of each film is widescreen, in a non-anamorphic ratio."}, {"tag": "h3", "text": "Widescreen"}, {"tag": "h2", "text": "External links"}]}