{"url": "Orleon", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Mid Rim planets on the Perlemian Trade Route", "Category:Perlemian Trade Route", "Category:Talcene sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Orleon"}, {"tag": "p", "text": "Orleon was a rainy planet in the Mid Rim. The rain was torrential and never stopped, leaving the planet covered in mud."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 19.9 BBY, the freighter Spinner was believed to have contracted stone mites on Orleon before crashing at Westport, Coruscant. As he believed this indicated a Confederacy of Independent Systems facility on the planet, Senate Bureau of Intelligence Director Armand Isard ordered the planet infected with weapons-adapted stone mites. They ate through the planet's crust, and Orleon's entire population of 800 million was forced to evacuate."}, {"tag": "p", "text": "These creatures could eat through anything, even solid rock and military-grade starship hull plating with the natural acids they produced. They reproduced rapidly, and usually moved in swarms thousands to millions of stone mites strong, eating everything in their way. This made Orleon a hazardous place for spacers to land."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Marvel Star Wars 28, Han Solo rescues \"Jabba the Hut\" (sic) from stone mites on Orleon, leading the crimelord to briefly cancel Solo's debt. However, Jabba was at this time depicted as a Nimbanel, based on a background character from A New Hope later identified as Jabba's accountant Mosep Binneed."}, {"tag": "p", "text": "Jabba's Databank entry states that \"While this particular version of these events didn't happen, it is still possible that the Orleon incident did occur.\" Many fans have speculated that Han rescued Mosep Binneed rather than Jabba, and further speculated that Mosep used the alias \"Jabba the Hut\"."}, {"tag": "p", "text": "The Marvel comic places the planet in the Outer Rim Territories; however, The New Essential Chronology places it in the Mid Rim."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}