{"url": "Orlok", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Orlok"}, {"tag": "p", "text": "Orlok was a Human male commander serving with the Galactic Empire and the leading Imperial authority on ground-based facilities during the height of the Galactic Civil War. By 0 ABY, shortly following the Imperial defeat at the Battle of Yavin, Orlok was assigned to command the Imperial Training Center on the remote, storm-ridden planet Daluuj. Orlok resented the position, believing himself to be worth more to the Empire than running a mere training station on such a backwater world."}, {"tag": "p", "text": "The opportunity for Orlok to prove his greater value to the Empire came six months after the Battle of Yavin, when several jettisoned escape pods delivered the Mon Calamari Admiral Gial Ackbar and several Calamari agents to Daluuj following an Imperial attack while they were attempting to rendezvous with the Rebel Alliance. Orlok set out from the training fort with a convoy of three Imperial ground-skimmers carrying stormtroopers to respond to the Rebel crash site, but the commander quickly found himself in a race with the Rebels Han Solo, Luke Skywalker, and the Heroes of Yavin, traveling in the Millennium Falcon, to reach Ackbar's position."}, {"tag": "p", "text": "While the Rebels linked up with Ackbar first, they were beset by two giant lake worms that dragged the Millennium Falcon to the watery depths of a nearby mud lake. Solo and Skywalker set out to stall Orlok's impending arrival, while Ackbar's team worked to free the Rebel starship. In the resulting skirmish, Orlok succeeded in driving Solo and Skywalker back to the Rebel crash site, but he met his defeat when Ackbar strategically drew Orlok's ground-skimmers to the center of the lake, where the giant worms dragged Orlok and his men to the water's bottom, simultaneously releasing the Millennium Falcon."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Detested assignment on Daluuj"}, {"tag": "p", "text": "Orlok was a Human male officer of the Imperial Military during the prime years of the Galactic Civil War. Orlok was second only to Bevel Lemelisk, Chief Engineer of the Empire's first Death Star battlestation, in terms of being the top authority on Imperial facilities. When it came to ground-based facilities, however, Orlok was the best the Empire had to offer."}, {"tag": "p", "text": "By the time of the Battle of Yavin, the Empire had assigned Commander Orlok to be in charge of the Imperial Training Center on the rainswept, backwater planet Daluuj, much to Orlok's displeasure. He resented being posted on the stormy world to command such an insignificant outpost. In 0.5 ABY, six months after the Imperial defeat at Yavin, several escape pods carrying the Mon Calamari Admiral Gial Ackbar and some of his Calamari colleagues crash-landed on Daluuj. Ackbar and his men had fallen under Imperial attack while attempting to rendezvous with Princess Leia Organa of the Rebel Alliance to join the Rebellion's evacuation efforts of its Yavin 4 base and were forced to jettison to Daluuj's surface. The Imperial Training Center quickly detected the signal emanating from Ackbar's distress beacon, and Orlok set out to investigate, leading a force of three Imperial ground-skimmers loaded with stormtroopers. Orlok hoped this opportunity would be his chance to prove his greater value to the Empire and would be his ticket off Daluuj."}, {"tag": "h3", "text": "Orlok's opportunity"}, {"tag": "p", "text": "While approaching Ackbar's position, however, the pilot of Orlok's ground-skimmer informed the commander that their instruments indicated a ship passing them overhead. Although Orlok derided as mad anyone attempting to fly through Daluuj's constant atmospheric storms, he nevertheless knew they were now in a race for the source of the distress beacon. What Orlok did not know was that the competing ship was none other than the Millennium Falcon, carrying the Rebels Han Solo, Luke Skywalker, Leia Organa, and the rest of the Heroes of Yavin, en route to rescue Ackbar and his men. Orlok ordered his three ground-skimmers ahead at full speed, intent on preventing the Rebels from ever leaving Daluuj."}, {"tag": "p", "text": "The Rebels reached Ackbar's crash site ahead of Orlok, though Solo was forced to set the Millennium Falcon down on the surface of a mud lake, the only available landing spot. Before they could rescue the downed Mon Calamari, two giant lake worms emerged from the water and dragged the Millennium Falcon below in their grasp. The Rebels were able to swim to freedom on the shores of the lake but with the realization that they were now trapped on Daluuj without a transport and with Orlok's forces inexorably bearing down on them."}, {"tag": "p", "text": "Orlok's ground-skimmers soon hit a patch of dense fog, forcing the lead scout craft to stop in its approach. Angered, Orlok demanded to know why their progress had been halted. The lead craft's pilot reported echoes and distortions on their scanning equipment because of the fog and warned that proceeding further would only risk wrecking the vehicles or missing the Rebels' position. Not to be denied his opportunity, Orlok ordered the stalled craft to hold its position—he would be taking the lead himself."}, {"tag": "p", "text": "However, Solo, Skywalker, and the Wookiee Chewbacca—having set out from the Rebels' crash site together to slow the Imperials while Ackbar and his men worked to free the Millennium Falcon from the lake—ambushed the waiting lead ground-skimmer before Orlok could reach its position, neutralizing the craft's stormtroopers, but the commotion they made in the attack alerted Orlok and the main Imperial party. When the fog cleared away soon thereafter, opening the way for the rest of the Imperials to rush to the aid of their attacked comrades, Orlok devised a plan to instead gain the surprise advantage on the Rebels. He split his forces in two, sending the remaining two ground-skimmers forward and using the sound of their approaching engines to mask a large group of stormtroopers, led by Orlok, secretly taking up positions atop a nearby bluff."}, {"tag": "h3", "text": "A watery disposition"}, {"tag": "p", "text": "At Orlok's command, the stormtroopers atop the bluff began firing down at will on the Rebels, who scrambled into the Imperials' neutralized ground-skimmer and started speeding away. Solo, at the ground-skimmer's controls, expertly avoided the Imperial fire, but Orlok ordered his men to keep at it, as the Rebels were heading straight into range of the guns of Orlok's two other approaching vehicles. However, Solo, not planning on Orlok's ambush, had previously cross-wired the skimmer to overload once the Imperials eventually recovered it, forcing he, Skywalker, and Chewbacca to leap from the vehicle just moments before its destruction. The explosion covered their escape from the Imperials, but it did not stop their approach. Orlok and his men soon inspected the exploded skimmer and determined that the Rebels had, in fact, escaped for the moment. Determined to defeat the elusive Rebels once and for all, Orlok ordered his stormtroopers back to the remaining ground-skimmers to continue pursuit."}, {"tag": "p", "text": "Orlok's two ground-skimmers reached the mud lake's edge and opened fire as they approached the Rebel crash site. Ackbar ordered his group to take up a vulnerable position across the lake from the Imperials but nevertheless in such a spot so as to draw Orlok's skimmers across the center of the lake in order to reach them. The stratagem worked just as Ackbar planned—as Orlok reached the lake's center, the two giant worms emerged from the water and coiled themselves around the skimmers, dragging them down to the bottom of the lake and releasing the Millennium Falcon in the process. With Orlok defeated and their ship freed, the Rebels safely escaped Daluuj with Ackbar and his fellow Mon Calamari."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Orlok was an ambitious Imperial officer and one who resented his command at the remote Imperial training outpost on wet, fog-shrouded Daluuj. He felt he was worth more to the Empire than running a minor training station and recognized the Rebel presence on Daluuj as his opportunity to rise to greater things. Orlok vowed to eliminate the Rebels to prevent them from ever accomplishing their mission of rescuing Ackbar's downed team."}, {"tag": "p", "text": "During the skirmish with the Rebels, Orlok demonstrated a certain ability for tactical innovation. Once Han Solo and Luke Skywalker defeated the stormtroopers in Orlok's lead ground-skimmer, Orlok, realizing that his enemy expected him to rush to the aid of the lost skimmer, instead elected to divide his force. He personally led a stormtrooper party on a disguised flanking maneuver, which succeeded in catching the Rebels by surprise and forcing them on the run directly into firing range of his other two waiting skimmers. Only Solo's inadvertently-manufactured cover explosion allowed the Rebels to escape Orlok's trap. Nevertheless, Orlok was later bested by Ackbar, himself regarded as a tactical genius in his own right."}, {"tag": "p", "text": "Orlok was a demanding combat leader during the battle, constantly urging his ground-skimmers to move faster in the race to reach the source of Ackbar's distress beacon. He scolded his lead skimmer for daring to halt without his permission when it ran into a dense fog cover and stopped rather than risking damage or bypassing the downed Rebels' position. Instead, Orlok dismissed the threat and took lead of the convoy himself."}, {"tag": "p", "text": "Orlok was the Empire's foremost authority on ground-based facilities, second only to Chief Engineer Bevel Lemelisk as top overall Imperial facility specialist. He had brown hair, blue eyes, and light skin. Orlok wore a goatee around the time of the Battle of Yavin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Commander Orlok wore the standard-issue Imperial officer's uniform during the Battle of Daluuj. He also utilized a pair of binoculars while directing his stormtroopers to attack the Rebels from atop a bluff."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Commander Orlok first appeared in the Revenge of the Jedi comic strip, written by Archie Goodwin and illustrated by artist Al Williamson. Revenge of the Jedi was originally published by the Los Angeles Times Syndicate as a newspaper serial comic across November 1982 to January 1983, leading up to the May 1983 theatrical release of Star Wars: Episode VI Return of the Jedi."}, {"tag": "p", "text": "Orlok was later included in the 1998 PC game Star Wars: Rebellion as a playable character available to the Galactic Empire. The game established Orlok as the Empire's leading ground-facility expert. In gameplay, the character has the invaluable ability to research new facility designs and also possesses leadership and combat ratings that enable him to successfully quell planetary uprisings and conduct missions to Alliance systems. The player may also grant Orlok the rank of general for advanced ability in commanding ground troops."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "The Star Wars: Rebellion: Prima's Official Strategy Guide and Star Wars: The Comics Companion publications each misspell the character's name as \"Orlock.\""}, {"tag": "p", "text": "In one panel of the Revenge of the Jedi comic strip, Orlok's rank insignia plaque includes six red bars, which corresponds to the Imperial Military rank of admiral, according to the 1994 West End Games Imperial Sourcebook. However, in a later scene, Orlok's rank badge includes three red bars, which, according to the Imperial Sourcebook, correctly corresponds to his rank of commander. Orlok's profile picture from Star Wars: Rebellion depicts the character with both the correct rank badge and number of code cylinders in accordance with his commander rank."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}