{"url": "Attack_on_Imperial_interrogator_droids", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Missions of the Ghost", "Category:Missions to Lothal"], "nodes": [{"tag": "h1", "text": "Attack on Imperial interrogator droids"}, {"tag": "p", "text": "In the years before the Battle of Yavin, the rebel crew of the starship Ghost undertook an operation to attack and destroy over two dozen Imperial interrogator droids near an Imperial center on the planet Lothal. The rebels, including Sabine Wren and Garazeb Orrelios, attacked an Imperial convoy and successfully destroyed the shipment using a paint bomb. After the attack, the Empire released a propaganda report via the Imperial Holovision claiming that a large group of insurgents destroyed Timely Tutor education droids bound for Lothal's neediest schools."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "At some point by 5 BBY, during the early rebellion against the Galactic Empire, the rebel cell that operated aboard the starship Ghost attacked a shipment of Imperial interrogator droids on the Outer Rim planet of Lothal. The rebels, including Mandalorian warrior Sabine Wren and the Lasat warrior Garazeb Orrelios, carried out their operation near an Imperial center on Lothal."}, {"tag": "p", "text": "The rebels launched their attack under the cover of darkness and took out an Imperial supply convoy that was closely guarded by Imperial stormtroopers. The attack was carried out using blasters as the convoy slowed to stop between two closely-parked hovertrucks. Wren used a paint bomb to destroy the shipment, resulting in the destruction of over two dozen interrogator droids. The explosion, which Wren felt was one of her best due to the color and artistry used, lasted a few seconds, though she recorded it on her helmet camera."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The events of the attack were reported by the Empire on the Imperial Holovision on Lothal. The story alleged a different version of events, claiming that the rebels—described as mercenaries and alien berserkers—attacked a shipment of Timely Tutor education droids that were en route to the neediest schools on Lothal. The Empire also claimed that there were between twenty-five and fifty insurgents, whereas in reality the entire rebel crew numbered only five in total. Commandant Cumberlayne Aresko urged Imperial citizens on Lothal to give up any traitors that they knew of, otherwise Lothal would not receive Imperial resources and support."}, {"tag": "p", "text": "Wren placed a clipping of the Imperial report on the attack in her personal journal, where she expressed joy over her explosive handiwork. She thought it was funny that the Empire claimed the attack was carried out by a large number of people, and she stated that the Empire was too embarrassed to admit that they were only attacked by a small band."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on the interrogator droids was first referenced in the 2015 book Sabine My Rebel Sketchbook, written as the in-universe journal of Sabine Wren. The book was written by Daniel Wallace, with art by Annie Stoll."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}