{"url": "Orn_Free_Taa", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Galactic Republic senators", "Category:Imperial Senators", "Category:Males", "Category:Rutian Twi'leks"], "nodes": [{"tag": "h1", "text": "Orn Free Taa"}, {"tag": "p", "text": "Orn Free Taa was a male Rutian Twi'lek who represented his homeworld of Ryloth in the Galactic Senate during the waning years of the Galactic Republic. Because he was content with amassing riches for himself on Coruscant, Taa was very unpopular on Ryloth. During the Separatist Crisis, Taa joined the Loyalist Committee, which supported the Republic's leader, Supreme Chancellor Sheev Palpatine, against the growing threat of Count Dooku's Confederacy of Independent Systems. After the war, he retained his position in the Imperial Senate; while he retained his treasured wealth, he was little more than a puppet for the Galactic Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Naboo Crisis"}, {"tag": "p", "text": "A male Rutian of the Twi'lek species, Taa hailed from Ryloth and joined the Galactic Senate to represent the planet. However, he made himself content with gaining wealth on the Galactic Republic capital of Coruscant and became entangled in politics, making him a very unpopular figure on Ryloth itself. Taa was among the senators who supported Queen Padmé Amidala's Vote of No Confidence to replace Supreme Chancellor Finis Valorum with a stronger chancellor during Naboo occupation by the Trade Federation."}, {"tag": "h3", "text": "The Separatist Crisis"}, {"tag": "p", "text": "Ten years later, Taa was present in Chancellor Sheev Palpatine's office suite when Amidala arrived to the Senate following the assassination attempt on her. He was later present in the Senate when Representative Jar Jar Binks pushed for Palpatine to have full emergency powers to handle the growing crisis. Taa represented Ryloth in the Galactic Senate; he was a trusted advisor to Palpatine, but a perfect symbol of corruption in government, extravagant with his spending and living in utter luxury."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Concerning Ryloth"}, {"tag": "p", "text": "When the Separatist Alliance invaded Ryloth, Taa contacted King Katuunko of Toydaria in efforts to receive aid to help the people on his planet. When the Republic fleet broke through the Separatist blockade, Taa arrived on Ryloth, where he came into conflict with his rival Cham Syndulla over what to do with the occupation. However, Jedi General Mace Windu convinced the two that they both wanted to see a free Ryloth and had to cooperate to help their people. When the Separatist troops were defeated and Wat Tambor was arrested at Lessu, Taa waved to the crowds at the Republic's victory parade and made peace with Syndulla."}, {"tag": "h4", "text": "Other endeavors"}, {"tag": "p", "text": "When Duchess Satine Kryze of Mandalore traveled from Sundari to Coruscant in order to represent her planet in the Senate, she invited several senators and allies to accompany her on the aircraft. The senators included Kin Robb and Tal Merrik. Taa was present in the luxury suite where Duchess Satine rejected any statements made by Taa as he tried to persuade her towards joining the Republic. Taa then calmed Obi-Wan Kenobi and Satine while they argued over the war and reasons to fight. He dined alongside the other members of the party, where he urged that they not talk about politics and simply enjoy their meal of nuna legs. During the attack from SD-K4 assassin droids, Taa was very frightened and cowered away from the table with his aides. The senator then calmed down and sat back down at the table where he happily ate his favorite meal, however he was horrified when Kenobi rendered with the final metallic probe. When more Separatists forces attacked, he ran from the dining suite and ended up surviving the events."}, {"tag": "p", "text": "When Cad Bane and several other bounty hunters took over the Republic Senate building, Taa rushed into Palpatine's office to inform him of the situation. When Bane contacted Palpatine and told him of his deal, the bargain being that the Republic release Ziro and in return the trapped Senators would be released as well. Palpatine decided to comply with Bane and sent Taa down to the prison with the pardon disc, he was not happy with the thought of being at the prison which Ziro even commented upon. Taa was, however, very happy when the Chancellor was freed and Bane's cohorts were surrounded by Commander Fox's Coruscant Guard."}, {"tag": "p", "text": "During the bill that promoted further funding for the war speaker for the opposing campaign Senator Bail Organa was injured, meaning he was unable to attend and speak and causing a large delay for the speech. During the delay Senator Mee Deechi pushed for the voting to start without Organa's words. Taa agreed with this notion and vocally expressed his opinion, when Padmé Amidala stepped forward to the speech, Taa looked very surprised at a partisan volunteering to make the speech. However, when Amidala gave her moving speech, Taa was visibly impressed and applauded her loudly."}, {"tag": "p", "text": "When Palpatine was rescued from General Grievous at the Battle of Coruscant, Taa was among the Senators who greeted him on the landing platform. Pleased that Palpatine had been rescued, he stood in the second row but was nonetheless quick to walk back inside."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "h4", "text": "Troubles with the New Order"}, {"tag": "p", "text": "When Palpatine declared the first ever Galactic Empire, Taa was present in the Senate. Taa continued to serve loyally under the Emperor's dictatorship, thus keeping his wealth and heavy self-indulgence. Taa was however little more than a puppet delegate, serving under Moff Delian Mors and willingly taking part in the exploitation of his homeworld. However Taa was still happy as he retained his wealth and luxurious habits due to being a supporter of the Empire."}, {"tag": "p", "text": "Early in the Imperial Era, in Ryloth's capital city of Lessu, a mass gathering was held by Senator Taa, Imperial Vice Admiral Rampart, Cham Syndulla, his wife Eleni Syndulla, and Captain Howzer, who looked upon the gathered crowd from the balcony. At the gathering, the Twi'lek senator delivered a speech to his fellow citizens, speaking about peace and prosperity the Empire would bring to the planet, and mentioned a new refinery being built. Orn Free Taa was nonetheless ridiculed and insulted by the Twi'lek crowd, and Cham Syndulla spoke up; the freedom fighter was cheered by the crowd."}, {"tag": "p", "text": "Subsequently, Orn Free Taa had a meeting with Admiral Rampart, during which he confessed his worries about the freedom movement led by the Syndullas. He came to the conclusion that the best option would be to get rid of Cham as quickly as it was possible."}, {"tag": "p", "text": "Later that day, in the evening, Taa, together with Rampart and Howzer, traveled on a Juggernaut tank to witness the arrest of Gobi Glie and Hera Syndulla, the daughter of Cham, for alleged treason against the Empire and the people of Ryloth, and for smuggling weapons. However, the Juggernaut was attacked by insurgents who were trying to rescue the prisoners. While Rampart called for the tank to stop, Taa insisted on getting rid of the attackers. Cham and his wife Eleni then retreived their child, and while passengers left the tank, a quarrel arose between Taa and Syndulla. The latter threatned to kill the senator, holding a blaster against the former's torso. Captain Howzer and Admiral Rampart appealed to Syndulla's reason, and Eleni persuaded him to set Taa free."}, {"tag": "p", "text": "However, Rampart then ordered the clone CT-9904 \"Crosshair\" to shoot Taa in the head, so that the senator was incapacitated. Two clone troopers quickly ferried Taa away from the spot, and Cham was accused of attempting to take Taa's life. Despite the shot, Taa survived. Later, Rampart addressed the citizens of Lessu at another public gathering and promoted opposition against the Free Ryloth Movement on account of this purported assassination attempt; he also stated that the senator would make a full recovery."}, {"tag": "p", "text": "After previously allying himself with his rival Cham Syndulla during the Clone Wars, he found himself at war with him. As head of the Free Ryloth Movement, Syndulla carried out a series of attacks against the Imperial occupation forces on Ryloth, which gained the attention of the Emperor and his apprentice, Darth Vader."}, {"tag": "h4", "text": "Battles against the Ryloth resistance"}, {"tag": "p", "text": "After the attacks by the Free Ryloth movement began to slow the spice production on Ryloth, Taa was summoned for an audience with the Emperor. Now openly afraid of Palpatine and his apprentice, Taa feared the worst as he optimistically tried to reassure the Emperor that the Twi'lek security forces and Moff Mors would have the situation under control. Palpatine dismissed Taa's assertion and informed him that he had come to a decision. Taa was relieved to hear that the Emperor's decision was to accompany him and Vader on an official visit to Ryloth to investigate the matter personally. The senator expressed his reluctance to return to Ryloth, but Palpatine assured him his presence would reassure the people they were truly part of the Empire."}, {"tag": "p", "text": "Vader surmised that Taa was loyal to the Empire, though he would put his own interests first, Ryloth's interests second, and the Empire's third. Taa, his senatorial staff, and the two Sith Lords traveled on the Imperial Star Destroyer Perilous to Ryloth. However, one of Taa's senatorial staff leaked information about the trip to the Free Ryloth movement. Upon entering the Ryloth system, the Perilous was attacked by space mines, vulture droids, and Free Ryloth rebels disguised as maintenance crew."}, {"tag": "p", "text": "During the attack, Taa was Force choked by an enraged Vader, who released him at the Emperor's urging. Vader informed Taa that there was a spy among his staff. Taa apologized to Vader and the Emperor and vowed to find the traitor. The Emperor was convinced of Taa's loyalty but warned the Senator that it did not mitigate his fault; emphasizing that Taa was ignorant that he had a traitor among his staff. The Emperor then ordered his royal guards to restrict the senatorial staff to their quarters and to deny them access to communications equipment and computer terminals. The Emperor then warned Taa that harsher measures would be required in the future to quell unrest on Ryloth. Taa acceded to the Emperor's demands. When the Perilous fell apart, Taa and his staff escaped the Star Destroyer with Vader likening him to a \"rat finding his way off a sinking ship.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Orn Free Taa was a Republic Senator and later an Imperial Senator who represented his homeworld of Ryloth. Outwardly jovial, if a bit bumbling, the large shadow Taa carried was nonetheless cast over nearly all aspects of Coruscanti politics. In spite of his gregarious nature, Taa was a staunch militarist and was ever alert for opportunities to put credits in his pocket. Even though his corruption was obvious, no one was able to find enough evidence of criminal behavior to oust the Twi'lek Senator. While he demonstrated genuine concern for the people of Ryloth, he was known for his greed, cowardice, and putting himself first, the people of Ryloth second, and the Empire third."}, {"tag": "p", "text": "During the Battle of Ryloth, Taa saw that his presence on Coruscant was more helpful to his people's cause than being on their homeworld. The indulgent Twi'lek was seen by reformers as a symptom of the Republic's corruption, while in the Separatists' eye, he was a symbol of all the Republic's rottenness. When the Galactic Empire was formed Taa retained his position in the Senate and, more importantly to him, his wealth."}, {"tag": "p", "text": "With blue skin and yellow eyes, Orn Free Taa stood 1.84 meters tall and had five chins and four lekku, as well as four fingers on each hand. He had a legendary appetite."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the Clone Wars, Taa wore Coruscanti robes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While Star Wars: Galactic Atlas places the events of the novel Lords of the Sith, including Taa's visit to Ryloth with Darth Vader and Emperor Palpatine, in 14 BBY, the Biography Gallery of Taa's own Databank entry places it eight years after the end of the Clone Wars, or 11 BBY.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}