{"url": "Orion_Ferret", "categories": ["Category:Legends articles", "Category:Businesspeople", "Category:Criminals", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Orion Ferret"}, {"tag": "p", "text": "Orion Ferret was a Human male who served as an unscrupulous telepathic weapons trader and plied his wares aboard the commercial merchant station Bazarre during the time of the Galactic Civil War. He crossed paths with Lando Calrissian on more than one occasion."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Orion Ferret once made arrangements to sell four black market TIE Fighters to the Rebel Alliance shortly after the Battle of Hoth. Luke Skywalker and Lando Calrissian met with Ferret aboard the space station Bazarre and negotiated the sale. After receiving his payment, Orion told the Rebels that the TIE fighters were hidden in the wastelands of a garbage world known as Patch-4. He gave them the proper coordinates and allowed them the use of one of his shuttles to pick them up. Lando, who distrusted him, left the Wookiee Chewbacca behind on Bazarre to keep a watch on Ferret."}, {"tag": "p", "text": "Lando had good cause to be suspicious. No sooner had the Rebels left for Patch-4 then Orion began conspiring their deaths. He believed that if he were to remotely activate the shuttle's ejection seats, then Luke and Lando would die in space and he would be able to keep the money, his fighters and the Millennium Falcon. However, he had to find a way to get Chewbacca out of the way. With the aid of his assistant P'Lor, he used a gelatinous spritzer solution to imprison the Wookiee. Unfortunately for Ferret, the solution was not strong enough to contain Chewbacca and he soon broke free."}, {"tag": "p", "text": "Chewbacca chased Ferret all through the Bazarre marketplace. Ferret attempted to flee in his personal shuttlecraft, but a few well-aimed shots from Chewbacca's bowcaster rendered the ship unusable. Lando Calrissian then returned to Bazarre in time to keep Chewbacca from ripping Orion's head off."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Orion Ferret was a tall, slender, middle-aged Human male. He had thin, graying hair and a gaunt, narrow face. While operating on Bazarre, Orion traditionally dressed in black formal attire, with a red bowtie and white dress shirt. Thick red buttons, and large heart-shaped sequins adorned the lapels of his jacket."}, {"tag": "h2", "text": "Talents and abilities"}, {"tag": "p", "text": "Orion Ferret owned a small squid-like animal, which he kept as a pet. This diminutive green creature could frequently be seen resting on Orion's shoulder or climbing about his head and neck."}, {"tag": "p", "text": "Orion maintained an entourage of servants at any given moment. Two of his colleagues were known as P'Lor and Quad-Lo. The exact nature of Orion's telepathic capability is unclear. There is nothing in his background to suggest that he was Force-sensitive, although he was able to successfully maintain a telepathic link with P'Lor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Orion Ferret was created by Marvel Comics writers, David Michelinie and Walt Simonson."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}