{"url": "Orn", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Coruscanti", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Orn"}, {"tag": "p", "text": "Orn was the uncle of Jedi Knight Jaden Korr and lived on the planet Coruscant during the time of the New Republic. In 14 ABY, Korr built his own lightsaber, and his uncle had him enrolled in the Jedi Academy. Orn was killed in 27 ABY during the conquest of Coruscant by the Yuuzhan Vong, a species of extra-galactic invaders."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Orn was the uncle of the Human child Jaden Korr and took custody of him on the New Republic capital planet, Coruscant, after Korr's adoptive parents were killed in a shuttle accident. As a child, Korr acquired a scar using one of his uncle's tools, which persisted years later. Unbeknownst to Orn, Korr was sensitive to the Force, and, in 14 ABY, while in a dreamlike state, Korr created a lightsaber of his own in Orn's workshop. Korr showed off the weapon to a surprised Orn, who immediately contacted the authorities, and within two days Korr was enlisted in the Jedi Academy on the moon Yavin 4 under the tutelage of Jedi Master Luke Skywalker. Orn was later killed when the Yuuzhan Vong, extra-galactic alien invaders bent on domination, conquered Coruscant in 27 ABY. Korr, having become a Jedi Knight, was on a mission and only heard of Orn's passing at a later time."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jaden Korr remembered Orn as being an easily grinning individual who had a wheezing laugh. Orn was also very obese, which caused Korr to refer to his adoptive relative as \"Uncle Orn the Hutt\" after the large, slug-like species."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Uncle Orn was mentioned in Paul S. Kemp's 2011 novel Riptide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}