{"url": "Ormeddon", "categories": ["Category:Canon articles", "Category:Imperial Army generals of the Galactic Empire", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ormeddon"}, {"tag": "p", "text": "Ormeddon was a male individual who served as a Grand General in the Armed Forces of the Galactic Empire during the Imperial Era. During or prior to 10 BBY, Tobias Beckett and his gang operated in the Berullian theater of operations which caused three Imperial advisors to persuade Emperor Palpatine into dispatching Ormeddon to the Berullian Checkpoint in order to gain his security clearances."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ormeddon was a male individual who came to serve the Galactic Empire during the Imperial Era, eventually rising to the rank of Grand General. During or prior to 10 BBY, the criminal Tobias Beckett and his gang launched an operation at the Berullian Checkpoint by stealing Imperial supply ships for several weeks. The disruption caused three different Imperial advisors to persuade Emperor Palpatine into taking action. Palpatine dispatched Ormeddon to deal with the matter, which was what Beckett and his crew had planned for."}, {"tag": "p", "text": "The thefts of the supply ships were meant to force Ormeddon away from his security where he was vulnerable. At the checkpoint, Beckett and his crew dressed as maintenance workers and fifteen minutes into Ormeddon's inspection, they stole his shuttle, jumped to Foundry, and used his clearance codes to land in his personal docking bay, and stole experimental shield generator technology. By the time Ormeddon completed his inspection and began asking where his shuttle went, Beckett and his gang were in another part of the galaxy in negotiations with the Crymorah syndicate. Midnight later recounted Ormeddon and his situation with Beckett's gang."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ormeddon was first mentioned in Solo: A Star Wars Story: Tales from Vandor, a reference book authored by Jason Fry and released in 2018."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}