{"url": "Orishen", "categories": ["Category:Canon articles", "Category:Orishen", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Orishen"}, {"tag": "p", "text": "The Orishen were a sentient species native to the planet Orish. Known for their sense of nobility and honor, the Orishen were enslaved by the Galactic Empire and poisoned their homeworld in order to emancipate themselves. Characterized by the smooth plates peppered over their bodies, as well as their nose-slits and bisected jaws, the Orishen numbered only a few thousand during the era of the New Republic, during which time Orishen Senator Tolwar Wartol represented the species and vied for chancellorship of the Republic with Mon Mothma."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Orishen had smooth plates arranged unevenly and asymmetrically over their smooth skin, including hard plates covering the head; these disconnected plates caught the light like black mirrors. Purple-blooded, they had nose-slits and bisected lower jaws that gave their mouths the appearance of a blooming flower whenever they spoke. Within their mouths were serrated teeth on either side of a tapered pink tongue. The Orishen had long-fingered, clawlike hands, and deep-set eyes with X-shaped irises and corneas that drifted and pulsed, giving a kaleidoscopic effect."}, {"tag": "p", "text": "Orishen mates each gave birth to one child—two children for two parents—and died at the birth in order to give their children life. In this manner of life for life, the total population of Orishen did not increase, although no Orishen seemed able to answer the question of how the species originally came to any number at all."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Orishen were originally a pacifistic, mostly agricultural species on their lush homeworld of Orish prior to the intervention of the Galactic Empire. Orishen were considered to be tough, if strange, as well as noble and almost aggressively honorable. They had a firm grip on protocol, and their architectural and decorating style was considered to be severe, spare, blocky, and even unpleasant. Orishen tended to appellate themselves with anagrammatic names, such as Tolwar Wartol, Vendar Darven, and TimTam TamTim. They were known to consume root juice."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Orishen were enslaved by the Galactic Empire, which strip-mined Orish and drained the planet's surface of its natural nutrients, destroying the pastoral haven. The Orishen were worked hard and beaten for their food, although ultimately the slaves banded together, having hoarded pesticides and fertilizers to create a bomb. The chemist Tolwar Wartol helped create the device. Although the chemical weapon destroyed the Imperial occupation, it also poisoned their world from the ground to the atmosphere. Bodies clogged streams, and the surviving Orishen built massive tombs for their dead. The Empire fled, abandoning Orish and its people, in what Wartol would later describe as a triumph. As of the era of the New Republic, only a few thousand Orishen remained, living in a skeletal framework of tubes and stations above their devastated homeworld, as well as an asteroid archipelago. Wartol became his people's senator in the Galactic Senate, and used his survivor's spirit as part of his campaign."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}