{"url": "Oroko", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Pirate starships", "Category:Transports"], "nodes": [{"tag": "h1", "text": "Oroko"}, {"tag": "p", "text": "The Oroko was a transport ship that served as a mobile base for the pirate Valius Ying's gang during the Mandalorian Wars. Operating out of the Outer Rim Territories, Ying and the Oroko hunted fugitive Jedi Padawan Zayne Carrick and accomplice Marn Hierogryph in 3964 BBY, after Carrick was accused of murdering four classmates. The Oroko found its quarry in the Taris asteroid belt and captured them in the junk hauler Last Resort with its tractor beam. After Hierogryph struck a deal for his freedom, Ying brought the Oroko to Taris and left to turn Carrick over to the Jedi Order. Meanwhile, Hierogryph bribed the Oroko's first mate to drop The Last Resort off in orbit, allowing for Carrick's rescue."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A massive transport ship, the Oroko was sizable and accommodating enough to support a group of people as a mobile base. The Oroko had three forward-facing engines in front of a large, spherical frame and was equipped with a tractor beam. The ship had a spacious hangar, which was able to hold a junk hauler and a shuttle at the same time. Largely a dirty brown color, the Oroko had four vertical orange stripes above its three engines."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Oroko was owned by Twi'lek pirate captain Valius Ying, who used the vessel as a mobile base for his Outer Rim gang in the era of the Mandalorian Wars. Not normally a bounty hunter, Ying, in 3964 BBY, joined the hunt for fugitive Jedi Padawan Zayne Carrick, accused of murdering four classmates on the planet Taris, and an accomplice, local Snivvian hood—and an old acquaintance of Ying's—Marn Hierogryph. Searching the Taris system in the Oroko, Ying found Carrick and Hierogryph aboard the junk hauler Last Resort, hidden in the Taris asteroid belt. The Oroko brought The Last Resort aboard with its tractor beam. In the ship's hangar, Hierogryph negotiated a deal for his freedom, along with that of Last Resort owners Jarael and Gorman \"Camper\" Vandrayk, in exchange for the entry codes to the Snivvian's Taris storehouses. Meanwhile, Ying would take Carrick alone in the Oroko's shuttle to the Taris surface and turn him over to the authorities. Afterward, the Oroko would let The Last Resort off in another system."}, {"tag": "p", "text": "After the Oroko arrived in Taris' vicinity, Ying and Carrick departed in the shuttle. Met by a huge throng of spectators, Ying commed the Oroko when he landed to tell the ship's crew he had arrived safely and proceeded on to give Carrick to the five Jedi Masters of the Tarisian Jedi Tower. Discovering that the Jedi Masters had actually killed the Padawans and framed Carrick, Ying attempted to leave the room quickly but instead was killed by Jedi Master Lucien Draay. Meanwhile, Hierogryph, concerned for his friend Carrick's safety, bribed the Oroko's first mate to release The Last Resort in orbit, allowing Jarael to break into the Tower and rescue Carrick."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Valius Ying commanded the Oroko, which served as a mobile base for a number of gangsters who worked for the Twi'lek pirate. The Oroko also had a first mate, who took over command of the ship while Ying was away."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Oroko made its first appearance in Knights of the Old Republic 5, a comic written by John Jackson Miller and released in 2006. The Oroko was illustrated by Travel Foreman—it was also mentioned in the series' next issue. In 2008, the Oroko was given an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}