{"url": "Oron_Kira", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conflicting sources", "Category:House of Kira", "Category:Males", "Category:Monarchs of Onderon", "Category:Onderonians"], "nodes": [{"tag": "h1", "text": "Oron Kira"}, {"tag": "p", "text": "Oron Kira was a Beast Rider leader and King of Onderon who played a pivotal part in his homeworld's history, reigning as monarch during the onset of the Great Sith War. A Human male, Kira grew up during the turbulent period known as the Beast Wars, when the Beast Riders, prisoners cast out of the Onderonian capital of Iziz, went to war with the great walled city. The son of Beast-Lord Modon Kira, Oron Kira secretly traveled in and out of Iziz for years, trading with the political underground. On one trip, he met the love of his life, Princess Galia, heiress to the Onderonian throne. Galia reciprocated Kira's feelings, but the circumstances of the war would never allow a Beast Rider and the Princess of Onderon to marry. Kira and Galia formulated a plan to circumvent their dilemma in 4000 BBY; Kira and a fellow Beast Rider, Gobee, would break into the Iziz Royal Palace and \"kidnap\" Galia, bringing her back to Kira's fortress beyond Iziz's borders so they could be wed. The plan went off without hitch, and their marriage soon began. However, the ceremony was interrupted by three Jedi Knights—Human brothers Ulic and Cay Qel-Droma, and Twi'lek Tott Doneeta—sent by Queen Amanoa to retrieve Galia. The Jedi nearly made off with the Princess, but, after she protested and professed her love for Kira, she was returned to her betrothed. Kira and his family then revealed the dark side corruption of the Onderonian monarchy to the Jedi and enlisted them in the campaign to end the Beast Wars once and for all."}, {"tag": "p", "text": "After peace negotiations with Amanoa failed, Kira fought with a massive Beast Rider army in a final assault on Iziz. Although Amanoa's dark magic took a heavy toll on the Beast Riders, Kira's forces finally took Iziz, thanks to the battle meditation of newly-arrived Jedi Master Arca Jeth. Amanoa died at the end of the battle, and Kira became the new King of Onderon. As monarch, Kira soon faced another crisis, the Freedon Nadd Uprising, during which Sith cultists, led by former King Ommin, rose up and waged war on the new Onderonian regime. Although the Iziz Royal Palace was destroyed and Kira and Galia were briefly forced out of Iziz, they retook the city with help from the Jedi and put an end to the rebellion. Kira also fought in several more battles in the next few years; he lent his Beast Riders to Jedi forces in an engagement on Empress Teta in 3997 BBY, an attempt to retrieve Ulic Qel-Droma, who had begun to fall to the dark side, from the Krath cult on the planet. The next year, Kira and his fellow Beast Riders successfully defended Onderon from an army of Mandalorian invaders during the Great Sith War. His descendants went on to hold the Onderonian throne for more than four thousand years."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Becoming the King"}, {"tag": "p", "text": "Oron Kira was a Human male from the wilds of Onderon, born sometime before the onset of the Great Sith War. Kira was reared amongst the Beast Riders, a society of dissidents who thrived on their banishment from the great walled city of Iziz by taming and riding the dangerous beasts of the Onderonian wilderness. Kira was the son of Beast-Lord Modon Kira, the leader of the Beast Riders, and the grandson of Drokko Kira, a man who was cast out of Iziz for challenging the dark side-worshiping monarchy of the planet. Kira grew up in the time of unending war between the Beast Riders and Iziz, when Kira's people struck back against those who had cast them out. Although banned from Iziz, Oron and his father secretly went in and out of the city for years, trading with the political underground there. While on one of his secret journeys into Onderon, Kira ventured into the garden of the Iziz Royal Palace; there, he caught a glimpse of Princess Galia, heiress to the Onderonian throne. It was love at first sight for the two, and in 4000 BBY, they arranged to run away together. As it was unthinkable that the Princess of Onderon would marry a Beast-Lord, their plan was for a contingent of Beast Riders to kidnap Galia from the palace and bring her back to Kira's fortress, where their wedding would take place."}, {"tag": "p", "text": "The plan went off without hitch, as Kira and his right-hand man, Gobee, successfully retrieved Galia and brought her to the fortress, where the wedding promptly began. However, the ceremony was interrupted by a group of three Jedi Knights—brothers Ulic and Cay Qel-Droma, and the Twi'lek Tott Doneeta—who rode in on tamed boma beasts. The Jedi had been hired by Galia's mother, Queen Amanoa, to bring her back to Iziz. The Knights' bold charge proved initially successful, as Ulic Qel-Droma was able to grab hold of Galia in an attempted rescue. However, Galia expressed her willingness to marry the Beast-Lord, and, at the behest of Modon Kira, the Jedi laid down their arms as Oron and Galia embraced. With hostilities between the Beast Riders and the Jedi put to an end, the intruders were invited to join the Kiras at the wedding banquet. There, Oron told the Jedi Knights about how he and Galia fell in love and revealed that the Onderonian monarchs were in fact dark side servants. Hoping to put an end to the conflict between Iziz and the Beast Riders, Ulic Qel-Droma proposed that he go to Iziz with Oron and Galia to ask Amanoa for peace. Although Oron thought this plan unwise, Drokko Kira, speaking for the first time in decades, agreed with Qel-Droma's idea and asked for the Jedi to go to war with the dark side if the peace talks failed. The plan of action was then set: Oron, Galia, and the Jedi visitors would travel to the Iziz Royal Palace in Qel-Droma's starship, the Nebulon Ranger, and begin peace talks with Amanoa; if they failed, Modon Kira would lead the Beast Rider army against Iziz in one final battle."}, {"tag": "p", "text": "When the group reached the Iziz Royal Palace, however, Amanoa rejected their offer of peace. Although Kira threatened to unleash the full might of the Beast Rider army upon the city, Amanoa held firm and, in an act of rage, called the dark side power of deceased Dark Lord of the Sith Freedon Nadd upon Kira and his companions. Kira's group soon found themselves under attack by palace guards, all while under the oppressive pall of the dark side. A blaster shot grazed Kira's arm as Galia guided them to a secret passage. There, Ulic Qel-Droma realized that they had left his brother, Cay, behind in the palace throne room and instructed Doneeta to escort Kira and Galia back to the Nebulon Ranger while he tried to save his brother. With all hope of a peaceful solution lost, Kira grabbed his comlink and informed his father that the battle had begun. Once the fighting had reached full intensity, Kira left Galia in the safekeeping of Doneeta and joined the Beast Riders in the battle. In the midst of the fighting, Gobee brought Kira a prisoner—Novar, a high-ranking minister in the Onderonian government. As Kira and Gobee taunted Novar, Amanoa called down the power of the dark side upon the Beast Rider army, filling Kira with feelings of dread and driving him to his knees. Just as things seemed bleakest, Jedi Master Arca Jeth arrived in his starship, the SunGem, and shifted the advantage toward the Beast Riders with the Jedi power of battle meditation. At that moment, Novar tried to kill the downed Kira with a knife, but Kira, now filled with inner strength, caught Novar's knife arm and beat the politician mercilessly. Her dark power having fled her, the Queen died at the conclusion of the battle, and the Beast Riders were finally victorious. With the dark side's influence gone from Iziz, Kira and Galia had their marriage consecrated under the laws of the Galactic Republic, and the two warring tribes of Onderon were unified, with Kira as the planet's new king."}, {"tag": "h3", "text": "War with the Naddists"}, {"tag": "p", "text": "By 3998 BBY, Kira was into his second year as King of Onderon and found himself with a major problem—the Freedon Nadd Uprising. A group of dark side followers who worshiped Freedon Nadd had rebelled against Kira's government, placing Onderon into yet another civil war. That year, after a Naddist attack on the Iziz Royal Palace, Master Arca Jeth ordered that the bodies of Freedon Nadd and Queen Amanoa be removed from Onderon and placed on the moon of Dxun. Kira and Galia led the darksiders' funeral procession, which was also attended by several Jedi, including Jeth, and legions of Iziz soldiers and Beast Riders. However, the ceremony was interrupted by a massive groundborer emerging from beneath the Iziz streets. Hundreds of Naddist troops, led by the lightsaber-wielding warrior Warb Null, attacked Kira's men. Although a group of Naddist soldiers went after Galia, Kira and his Beast Riders stood firm and defended her. While Kira's men were able to fend off most of their Naddist attackers, the enemy still was able to get what they had come for—the sarcophagi of Freedon Nadd and Queen Amanoa. Once in their possession, the Naddists fled the battlefield, returning below Iziz's surface in the groundborer."}, {"tag": "p", "text": "In the wake of the battle, Galia, Ulic Qel-Droma, and Jeth went to meet with Galia's father, the former King Ommin, in his subterranean fortress, in order to get some answers about the dark pall enveloping the planet. Meanwhile, Kira and the other Jedi stayed behind to secure the Royal Palace. However, the palace was attacked by Naddists, and, despite Kira's best efforts, it soon fell. Galia and Qel-Droma emerged with similarly bad news, as Jeth had been captured by Naddists in Ommin's lair. Knowing that they needed to get out of the city, Kira and Galia left for Kira's fortress beyond the Iziz walls on a drexl warbeast, with the Jedi following behind. They decided to set up operations at the Kira citadel, and warrior teams were organized and transported there. Kira and his troops soon found themselves surrounded in the citadel by more Naddist forces, but they were aided by some timely reinforcements ordered by Republic Minister of Defense Netus, including a Jedi team. Aided by Jedi Knight Nomi Sunrider's battle meditation, Kira's forces were able to retake the advantage in the battle. Kira joined the fight alongside his Beast Rider brethren, helping them to repel the Naddist attack on the fortress."}, {"tag": "p", "text": "The combined Jedi, Republic, and Beast Rider forces, having fought off the Naddist soldiers at the fortress, took the fight to the enemy stronghold in Iziz. King Ommin was killed when a Jedi team attacked his subterranean fortress, Iziz was retaken, and the bodies of both Freedon Nadd and Queen Amanoa were retrieved. With the Freedon Nadd Uprising suppressed, Kira and Galia ordered that the city of Iziz be placed under martial law and all offworlders present on Onderon be evacuated to their homeworlds. The sarcophagi of Nadd and Amanoa, along with the newly-dead King Ommin, were finally laid to rest in a tomb on Dxun, a ceremony both Kira and Galia attended."}, {"tag": "h3", "text": "Continued battles"}, {"tag": "p", "text": "One year later, the Jedi were dealing with yet another dark side threat. A Sith cult known as the Krath took power in the Empress Teta system and attacked a Jedi conclave on Deneba, resulting in the death of Master Arca Jeth. Ulic Qel-Droma went undercover in the Krath, but, after the realization that he was dangerously close to the dark side, the Jedi decided to organize a team to attack the Empress Tetan capital of Cinnagar and rescue him. Kira and the Beast Riders were called upon to join the Jedi battle force, and the King of Onderon and a Beast Rider army went to meet them on Ossus. The Jedi were still in the preparations phase, and Kira had an idea—drop the Jedi in on warbeasts, so they could fly to the Krath palace and retrieve Qel-Droma easier. From there, Kira and the Beast Rider forces traveled along with their warbeasts to Cinnagar. The battle began, and Kira and the Beast Riders fought against Krath forces on the ground. Although Ulic Qel-Droma resisted the Jedi attempts to bring him back, his brother, Cay, forcibly removed Ulic from the palace and called for Kira to pick up the wayward Knight. Before Kira could reach Ulic on his warbeast, Nomi Sunrider ordered them to release Ulic, as it was not the Jedi way to take him against his will. With their attempts to rescue Ulic unsuccessful, Kira returned to Onderon."}, {"tag": "p", "text": "By 3996 BBY, the galaxy had descended into a state of war. Ulic Qel-Droma, now the Sith apprentice of Dark Lord Exar Kun, led a Sith army against the Galactic Republic and the Jedi Order. Although the Sith had several early successes in what would come to be known as the Great Sith War, the Republic was able to retake the advantage in the conflict. Late in the war, Sith-loyal Mandalorian forces, led by Mandalore the Indomitable, attacked Onderon and forced Kira to return to battle once again. Kira and Galia were at the Royal Palace when the Mandalorian Basilisk war droids surprise-attacked Iziz, and the King of Onderon sprung into action, taking the reins of his drexl warbeast and calling the Beast Rider armies to defend the city. Kira also summoned reinforcements from the Republic, and the Beast Riders had to hold out against the formidable Mandalorian strike force until help reached the planet. Kira was at the forefront of the battle as the primitive Beast Rider technology proved equal to the Mandalorian war droids. Finally, a Republic fleet led by Captain Orley Vanicus arrived to aid the Beast Riders. Although the Mandalore refused to surrender, Kira and his allies took a decisive advantage and forced the invaders to fall back to the Dxun moon. Mandalore the Indomitable was devoured by the hostile creatures of the moon, and the rest of the Mandalorian forces dispersed. Kira had successfully defended his homeworld, and the Republic eventually claimed victory in the Great Sith War."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "By the time of their descendant Talia's reign as queen around 3951 BBY, the life and times of both Kira and Galia were common subjects of discussion among the people of Iziz. Kira's descendants continued to hold the throne of Onderon for thousands of years, until at least 11 ABY, when a man named after Kira's father, Modon, held the title of king."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Oron Kira was a fierce warrior with a good heart who worked tirelessly for the overthrow of Iziz. Kira deeply loved his wife, Galia, so much so that he was willing to undertake a highly dangerous mission into the Iziz Royal Palace so he could marry her. Although not a Force-sensitive, Kira hated the dark side and understood its dangers, which he based off the history of Freedon Nadd's subjugation of Onderon and his own grandfather's banishment from Iziz for challenging the dark side regime. Although an experienced warrior, Kira was devoted to creating peace on his home planet in order to end the Beast Wars that had ravaged Onderon for years. However, by 4000 BBY, Kira had grown more and more doubtful that he would ever see peace on Onderon."}, {"tag": "p", "text": "Kira was very bold, personally going on the mission to retrieve Galia from the Iziz Royal Palace, and threatening Queen Amanoa, known to be adept in the dark side, with force if she did not comply to his demands of peace. Kira, even after his ascension to the Onderonian throne, still was quick to join a battle on the front lines, fighting darksiders in the Freedon Nadd Uprising, the Krath on Empress Teta, and he defended his homeworld against the formidable Mandalorians in the Great Sith War. As king, Kira was very vigilant against any threat to his planet, having his Beast Rider army standing ready at all times."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "A man with a formidable physical presence, Oron Kira was an adept warrior. Kira was skilled in infiltration and stealth, as shown during his raid on the Iziz Royal Palace, when he and Gobee successfully slipped past the palace's heavy defenses and spirited Princess Galia away. Kira was also adept in hand-to-hand combat, a skill he showed when he was able to catch Novar's knife arm from a prone position and beat his attacker mercilessly during the final battle of the Beast Wars. As a Beast Rider, Kira was experienced in riding drexl warbeasts, able to deftly dodge blaster bolts on his mount's back during the Great Sith War. The King of Onderon was also an able tactician, playing a major part in the formation of the Beast Rider battle strategy during the siege of Iziz and the Jedi strategy in the skirmish on Empress Teta."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Oron Kira first appeared in Star Wars: Tales of the Jedi — Ulic Qel-Droma and the Beast Wars of Onderon, the first story arc of the Tales of the Jedi comic book series, written by Tom Veitch and released in 1993. Kira went on to become a rather major character in Tales of the Jedi as a whole, appearing in the Freedon Nadd Uprising, Dark Lords of the Sith, and The Sith War arcs as well. Kira also appeared and played a major role in the Tales of the Jedi audio drama, in which he was voiced by Aden Gillet. During his appearances in the Tales of the Jedi comics, Kira was drawn by four different artists: Christian Gossett, Tony Akins, Art Wetherell, and Dario Carrasco, Jr. Kira was mentioned in a host of other sources and reference books, including the video game Star Wars: Knights of the Old Republic II: The Sith Lords, the Tales of the Jedi Companion, The Essential Guide to Planets and Moons, The New Essential Chronology, and Galaxy at War."}, {"tag": "p", "text": "As the Tales of the Jedi audio drama and the Tales of the Jedi: Ulic Qel-Droma and the Beast Wars of Onderon comic both told the story of the final battle of the Beast Wars and Kira's ascension to the Onderonian throne, there are several continuity issues between the two sources that remain unresolved. In the audio version, Modon Kira did not appear, an omission that led to most of his lines being attributed to Oron Kira. This resulted in a different telling of Kira and Galia's marriage and the siege of Iziz. For the purposes of this article, where the two sources conflict, the Tales of the Jedi: Ulic Qel-Droma and the Beast Wars of Onderon comic is treated with superior canonicity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}