{"url": "Orphne/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Females", "Category:Individuals of unidentified species"], "nodes": [{"tag": "h1", "text": "Orphne"}, {"tag": "p", "text": "Orphne was a female being who resided in the Underworld of Aleen."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "As a resident of the Underworld of Aleen, above ground air was toxic to Orphne. When a seal separating the Underworld from the surface world was removed Orphne and her neighbors, the tree-like Kindalo, began to suffer from the influx of above ground air. Orphene accused the surface-dwelling Aleena of causing their suffering and the Kindalo responded to the perceived wrong by causing severe groundquakes. The groundquakes caused the death of many Aleena and substantial damage to their infrastructure."}, {"tag": "p", "text": "Shortly after C-3PO and R2-D2 arrived on the planet in company with a relief mission launched by the Grand Army of the Republic they fell into the underworld due to one of the groundquakes. Orphne followed them in the form of sparkling dust, causing C-3PO to believe he was under attack. The duo then ran into the Kindalo, who directed them to Orphne after being convinced the two droids were there as friends. The Kindalo claimed that Orphne would help them escape from the Underworld. When they arrived at a large circular chamber, it was revealed that she had been following them in the form of purple and white sparkles. She then attempted to eat C-3PO, but was unable. After her failed attempt at consuming C-3PO Orphne decided to explain to the droids that the Aleena and under-dwellers had made a covenant to separate the above and below ground, so that neither would have to breathe the poisonous air of the other. But somehow, the opening to the underworld had been breached, and the under-dwellers resorted to causing groundquakes in an attempt to resolve their dilemma. After giving a riddle to the two droids Orphne left the room, leaving the droids to their contemplation. R2-D2 quickly devised the answer to Orphne's riddle: river. R2-D2 sprayed water on the water elemental symbol imprinted on the floor, which caused a geyser of water to force the droids out the opening and back to the surface. The two droids then shifted the seal back onto the opening, ending the threat to the residents of the Underworld."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Orphne had the Force ability to turn herself into a glowing, pink cloud. She could travel freely in this form, and seemed to \"unravel\" into separate orbs of these glowing particles when transforming into the cloud. This ability was a usage of the Force that was similar to Allyan Magic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Orphne was voiced by Cara Pifko, who also voiced Sionver Boll, Suu Lawquane, Naa'leth and TJ-912."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}