{"url": "Orphne", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Females"], "nodes": [{"tag": "h1", "text": "Orphne"}, {"tag": "p", "text": "Orphne was a female Sollux who resided in the underworld of Aleen. Though not necessarily Force-sensitive, Orphne did possess magical powers similar to those of the Nightsisters. However, her abilities seemed to be much more light side-based than those of the Nightsisters. For example, she could transform into a shimmering cloud of pink light. Her species was humanoid, with four digits on each hand, and had an unusually long tongue. She could move about much quicker than a human could."}, {"tag": "p", "text": "During the Clone Wars, the droids R2-D2 and C-3PO stumbled into Aleen's underworld while on a mercy mission. They were directed by the Kindalo to visit Orphne, whom they said would show them the way to the surface."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "While on a Republic relief mission to the groundquake-devastated world Aleen, protocol droid C-3PO and astromech R2-D2 became trapped underground. After wandering through the underworld's tunnels for some time, they came in contact with the tree-like species Kindalo, who commanded the droids to leave the underworld. C-3PO replied by telling them that they would if they knew how. The Kindalo then told the droids that they must visit Orphne to learn how to return to the planet's surface. R2-D2 and C-3PO left the Kindalo, unsure how to find the mysterious Orphne. However, it was not long before she materialized before them in a flowery throne. Orphne immediately shot out her tongue to taste C-3PO, but was disappointed to find that she could not eat him. When asked about the exit to the underworld, she simply give them a riddle:"}, {"tag": "p", "text": "Orphne then disappeared into a cloud of shimmering pink light, leaving the droids to solve the riddle on their own."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Orphne first appeared in \"Mercy Mission,\" the fifth episode in the fourth season of Star Wars: The Clone Wars. When asked about Orphne and her powers, supervising director Dave Filoni said that certain aspects of her person, such as her inhuman speed, were just natural traits found in members of her species. However, her ability to disappear as a cloud of light was in fact a magical ability. He likened Orphne to a light side-equivalent of the Nightsisters: although she was not a direct Force user, her powers did stem from the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}