{"url": "Attack_on_Milvayne", "categories": ["Category:Legends articles", "Category:Battles in the Inner Rim", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Attack on Milvayne"}, {"tag": "p", "text": "The attack on Milvayne took place during the Galactic Civil War, in the final quarter of the year 0 ABY. It resulted in a Rebel defeat and the split between Garm Bel Iblis and Mon Mothma."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Prior to the Destruction of Alderaan, Mon Mothma proposed an attack on the planet Milvayne, the location of the most important Imperial garrison in the Gyrica system. The attack was supported by Bail Organa before his death but Mon Mothma didn't seek the approval of Garm Bel Iblis."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Following the disaster at Deepspace Besh, Mon Mothma ordered the attack to be carried out. However, Bel Iblis's information indicated that Milvayne didn't house an Imperial garrison but an Ubiqtorate base, a target Rebel troops were not prepared to deal with. Before the beginning of the attack, Bel Iblis requested Mothma that she postponed and reconsidered the strike. Mothma overruled him, but a furious Bel Iblis accused her of amassing power for herself. The Corellian stated that none of his troops would have a part in the attack and the quarrel increased until Mothma coolly told him that the Rebellion no longer required his services. The battle eventually occurred but Rebel forces were defeated as expected by Bel Iblis."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In addition to the military defeat, the Rebel Alliance lost one of its most brilliant leaders. Garm Bel Iblis created his own resistance movement and waged his private war against the Empire for years throughout the Galactic Civil War. Bel Iblis eventually joined Mon Mothma and the New Republic during the Thrawn campaign."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}