{"url": "Ortraag", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified species", "Category:Jedi Masters of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ortraag"}, {"tag": "p", "text": "The male Jedi Master Ortraag lived approximately four thousand years before the Battle of Yavin. He trained and promoted Shalavaa, a Human male, to the rank of Jedi Protector, and charged him with protecting a fenti bean colony. Ortraag returned to the planet in time to witness Shalavaa fight a local carnivorous plant."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ortraag was a Force-sensitive male who trained as a member of the Jedi Order around the period of the Old Sith Wars, circa 4000 BBY. He eventually obtained the rank of Jedi Master and undertook the task of training the Human male Shalavaa. Once Ortraag felt that Shalavaa had completed his training, he promoted the Human to the level of Jedi Protector, and the pair traveled in an ancient starship to a colony of fenti bean farmers. There, Ortraag charged his student with protecting the colonists and maintaining peace before leaving the planet."}, {"tag": "p", "text": "After several weeks, Ortraag returned to the planet to find Shalavaa investigating a ravine that the colonists believed to be haunted. Witnessing Shalavaa successfully kill a vicious carnivorous plant, Ortraag congratulated his former apprentice, telling him that he was ready to face greater challenges offworld."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ortraag was able to instruct his apprentice on how to use the Force to sharpen his senses of hearing and sight. The Jedi Master also carried a lightsaber, the traditional weapon of the Jedi. He wore a dark cloak and a belt to which he clipped his weapon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Peter Schweighofer created Ortraag for the roleplaying game adventure Jedi Protector published in Star Wars Galaxy Magazine 13 in 1997. The story presented three outcomes to Shalavaa's encounter with the carnivorous plant, each depending on the results of several dice rolls. The above scenario reflects the two successful and probable outcomes. The least probable scenario has Ortraag intervening and killing the plant with his own lightsaber, finally deciding that his student is not competent enough to work on his own."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}