{"url": "Oruba/Legends", "categories": ["Category:Legends articles", "Category:Hutt Council", "Category:Hutts of the Gorensla clan", "Category:Kajidiis", "Category:Males"], "nodes": [{"tag": "h1", "text": "Oruba"}, {"tag": "p", "text": "Oruba was an elder Hutt from the Gorensla kajidic who served as a member of the Hutt Ruling Council during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At some point before the Clone Wars began, Oruba was born on Nal Hutta. He created a criminal empire, and gained enough power in his kajidic, Gorensla, that he became the leader and represented it on the Hutt Ruling Council around 21 BBY."}, {"tag": "p", "text": "Around 21 BBY, he discussed the plans to release Ziro from Republic custody with other Hutt council members Jabba, Gorga, Arok and Marlo, as Ziro had potentially damaging information about Hutt activities. Deciding that it was safer for Ziro under the 'protection' of the Hutts, they hired Cad Bane to free Ziro on Coruscant, which succeeded after a hostage in the Senate Building."}, {"tag": "p", "text": "Sometime later, Ziro appeared before the council. Oruba did not speak when Ziro addressed the council and reminded them that if anything where to happen to him the Hutt Council records would find their way into the hands of the Galactic Senate. Ziro was then imprisoned. Later, Oruba and the rest of the council where entertained by Sy Snootles who performed the musical number Da Hutt Moda."}, {"tag": "p", "text": "Jedi Knights Obi-Wan Kenobi and Quinlan Vos later appeared before the council and informed them of Ziro's escape. When Vos accused the Council of arranging Ziro's escape from the Republic Detention Center, Oruba became angry with the Jedi Knight. The elder Hutt angrily glared at him while Obi-Wan reminded Vos that the Hutts were their allies. Meanwhile, Ziro broke free with the help of Sy Snootles, but his freedom was short-lived as he was killed on Teth."}, {"tag": "p", "text": "In 20 BBY, Oruba was present with Arok and Marlo, along with Gorga and Jabba who were seen in holograms. When the Sith Lords Darth Maul, Savage Opress and Death Watch leader Pre Vizsla came before the council to seek an alliance, the confrontation became a skirmish. While Arok and Marlo were able to escape, Oruba was injured and eventually executed by Savage after the frightened Hutt gave the location of Jabba's Palace."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Oruba was identified by his relatively narrow head for a Hutt and the fact that he wore clothes. He also wore a kind of beret on his head. Oruba's pale skin was due to a genetic defect that left it without pigment and prone to chafe. He wore clothes to hide his condition."}, {"tag": "p", "text": "Like most Hutts, Oruba was fond of musical entertainment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Oruba is also seen in the 9th edition of the Star Wars: The Clone Wars Magazine, by Titan Magazines. In it, he was identified as having quick wits and using self-preservation that helped his empire to grow. However, those traits did not help him when Maul arrived."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}