{"url": "Orso_Meeto", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Chagrians", "Category:Males", "Category:Slavers"], "nodes": [{"tag": "h1", "text": "Orso Meeto"}, {"tag": "p", "text": "Orso Meeto was a male Chagrian slave trader who worked on the planet of Orvax IV, where he lived in the upper levels. During his career as a slaver, Meeto became one of the most prominent sellers on Orvax and sold many child slaves, including Resa Greenbark, to Dezono Qua, a regular customer from the planet Esseles. The Jedi Master Dass Jennir tracked Meeto down whilst searching for Greenbark, and, after learning from him that she had been sold to Qua and taken to Esseles, he killed the slaver."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the final years of the Galactic Republic, the Chagrian male Orso Meeto operated as one of the most prominent slavers on the slave world of Orvax IV. He regularly sold slaves to Dezono Qua, a wealthy Human from the planet Esseles, who bought a child from the Chagrian around every ten cycles. In 19 BBY, about a month after the inauguration of the Galactic Empire, Meeto came into possession of a group of Nosaurian slaves, which the Empire had captured on the group's homeworld of New Plympto whilst the slaves were trying to escape from a conflict with Imperial forces. Shortly after Meeto had taken ownership of the slaves, Qua visited him one morning and purchased one of the Nosaurians, a young female named Resa Greenbark. When the child was taken from the group, her mother, Mesa Greenbark, fought so hard to prevent the loss of her child that Meeto and his men were forced to kill her."}, {"tag": "p", "text": "After Qua left with his purchase, Meeto returned to his private residence and, with two guards stationed outside his room, began drinking and viewing a hologram of a scantily-clad Chagrian girl dancing. As he observed the hologram, a Human burst through the balcony window of his room with a blaster aimed at the slaver. Shocked, Meeto demanded to know who the individual was and what he wanted, warning him that he had guards stationed outside. The individual, who was a Jedi Master named Dass Jennir, questioned Meeto about the location of Resa Greenbark, at one point hitting him hard enough with the blaster to draw blood. Jennir promised Meeto that if he gave up the name of his client, Jennir would become the client's problem instead of Meeto's. The Chagrian told Jennir where to find Qua but was horrified when the Jedi did not lower his weapon. To prevent Meeto from informing Qua that he was in danger, Jennir shot the slaver through the head, killing him instantly, which brought Meeto's guards running into the room. However, Jennir escaped by leaping from the balcony window."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Meeto was a blue-eyed Chagrian who enjoyed viewing images of female members of his species dancing while they wore little clothing. As a slave trader, Meeto saw the bartering of other sentients as acceptable business. When Resa Greenbark's mother, whom Meeto owned, fought to prevent her child from being taken, Meeto had his guards kill her, considering her stupid for causing her own demise. Meeto swiftly gave up information on where to find Dezono Qua, one of his regular clients, in order to save his own life and begged for Jennir not to shoot him when the Jedi chose to kill Meeto anyway."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Whilst alone in his private residence, Meeto, on at least one occasion, wore a purple robe with a blue garment underneath along with blue leggings and a pair of slippers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Orso Meeto first appeared in the comic book series Star Wars: Dark Times, in the 2007 fourth issue of The Path to Nowhere story arc, which was written by Randy Stradley under the name Mike Harrison and illustrated by Douglas Wheatley. Meeto also received an entry in the 2008 The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}