{"url": "Ort_Hoogra-D%27En", "categories": ["Category:Legends articles", "Category:Ho'Din", "Category:Males", "Category:Terrorists"], "nodes": [{"tag": "h1", "text": "Ort Hoogra-D'En"}, {"tag": "p", "text": "Ort Hoogra-D'En was an infamous male Ho'Din terrorist wanted by the Galactic Empire. Despite his anti-Empire feelings, he had no interest in joining the Rebel Alliance."}, {"tag": "p", "text": "Born on Moltok, Hoogra-D'En grew up with a keen interest in plants. He eventually moved to the Ho'Din colony Anemcoro to study the vast exotic plant life there. He was forced to depart Anemcoro following the near-complete destruction of the planet by Imperial forces involved in a dispute between two neighboring planets, eighteen years before the Battle of Yavin."}, {"tag": "p", "text": "Hoogra-D'En swore vengeance for the loss of so much exotic plant life on his adopted home and began to prepare to unleash his fury on the Empire, specifically Imperial interests in the Outer Rim."}, {"tag": "p", "text": "Over the next few years, Hoogra-D'En relocated his operations to the planet Pallaxides and built up a network of allies, including a male Human named Tergeth Dilorr, a Bith merchant named Babel Senjorg, and several Aqualish mercenaries who made up the bulk of his forces. On Pallaxides, Hoogra-D'En was able to cultivate samples of the plant life he rescued from Anemcoro and used these in his operations."}, {"tag": "p", "text": "Tamack plants were the most important component to the creation of Hoogra-D'En's spore bombs. Tamack spores were carefully harvested periodically from the plants and placed inside a metal container. Once activated, the spore bombs released the microscopic spores into the air and began infecting anyone in the immediate area. The spores stayed active for three hours, an improvement from the spore's normal thirty-minute lifespan. Nothing less than full bacta immersion could cure an individual of the Tamack spore plague. Hoogra-D'En also used a water plant called Fahla to hide his base on Pallaxides from any orbital scans."}, {"tag": "p", "text": "Eventually, Hoogra-D'En's attacks in the Outer Rim became too bold when he unleashed a spore bomb on the Syndaar Military Prep School on Syndaar. The father of one of his victims, System Sub-Commander Jared Brojtal, organized all of the sector forces available to him and began a massive manhunt for the terrorist. Eventually, Hoogra-D'En's base on Pallaxides was located by Brojtal's forces and bombarded."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}