{"url": "Orto/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Planet stubs", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Ice planets", "Category:New Republic planets", "Category:Sluis sector planets"], "nodes": [{"tag": "h1", "text": "Orto"}, {"tag": "p", "text": "Orto was a small planet in the Orto system of the Sluis sector, located in the Outer Rim Territories. It was the homeworld of the Ortolan race."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Orto was located within a star system of the same name in the Sluis sector of the Outer Rim Territories region of the galaxy. It was a small, cold planet in a highly elliptical orbit around a red dwarf star. Water was plentiful on Orto, though much of it was frozen in the form of snow and ice, and its atmosphere was thin, but rich in oxygen. Beneath its ice caps, the world also possessed an abundant supply of heavy metals and radioactive fuels. Due to its orbit, axial tilt, and atmospheric conditions, Orto's growing season lasted an average of 161 standard days and occurred only in latitudes near the equator, and as a result of these harsh conditions, food was scarce and famines were common. The Ortolans, a species of sentient humanoids native to Orto, were efficient miners, and as their economy was barter-based, manufacturing companies competed for the planet's minerals by importing the best or most exotic foodstuffs possible."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Geologists believed that Orto had been struck by a large comet or planetary body in the past and hypothesized that the collision was the cause of Orto's peculiar orbit. In any case, Orto's climate was altered by a disaster at some point and all lifeforms over 200 kilograms in mass were driven to extinction by freezing temperatures and lack of food. With their primary predators gone, the primitive Ortolans, who were small enough to survive, were left as the planet's dominant species."}, {"tag": "p", "text": "Orto was neutral during the Clone Wars until its Financial Minister, Belo Tusus, declared his allegiance to the Confederacy of Independent Systems, seized control of the planetary government, and locked down all spaceports. Later that day, Confederate forces arrived on Orto and battle droids stormed its capital. While Tusus worked to settle his new government, it was struck by several unexplained acts of sabotage. These attacks were committed by Nem Bees, a Jedi Knight under cover as a common Ortolan citizen. Bees later reestablished contact with the Galactic Republic, arranging for a battalion of clone troopers to arrive in-system at a designated time shortly before infiltrating Tusus's palace to disable its shield generator. When the Republic forces arrived, Tusus, fearing for his life, fled Orto, and Bees rendezvoused with Clone Commander Deviss. One week into their campaign to remove the entrenched droid armies, Order 66 was issued, and Deviss cut down Bees as he led an assault on enemy lines."}, {"tag": "p", "text": "During the Galactic Civil War, Orto was largely left alone by the Galactic Empire. Although the Empire did impose regulations limiting the natives' ability to leave their homeworld, supposedly for their own protection, as long as they traded their ore to Imperial supporters such as TaggeCo and SoroSuub, the Empire remained indifferent to them. To facilitate the extraction of resources, the Empire established several large processing centers on Orto. The Ortolans also traded with the Rebel Alliance, and altogether, the war was a boon to Orto's food supply."}, {"tag": "p", "text": "Orto later joined the Alliance of Free Planets and, eventually, the New Republic.[source?]"}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "At least one city existed on Orto, functioning as the planet's capital. The world also hosted multiple spaceports, as well as several processing stations which had been established under Imperial rule. A massive crater was buried beneath the northern polar ice cap of Orto."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places the Sluis sector and, consequently, Orto, in the Core Worlds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}