{"url": "Ortolan/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Mammalian sentient species", "Category:Ortolans", "Category:Outer Rim Territories species", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Ortolan"}, {"tag": "p", "text": "Ortolans were a race of stocky, bipeds with long snouts, and large floppy ears. Ortolans came from the frigid, mineral-rich planet Orto. Two of the most famous Ortolans were the Jedi Knight Nem Bees and the musician Max Rebo."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Ortolans were squat, heavily-built humanoid bipeds with long, trunklike noses and beady black eyes. They possessed floppy ears, which were extremely sensitive to sound waves, and mouths that, while small, were well-adapted for eating. They had two hands, each ending in four chubby fingers and a thumb, which was not opposable. A thick, baggy hide covered in fuzz resembling velvet hung off of the Ortolan body."}, {"tag": "p", "text": "Ortolans had a keen sense of smell to help them forage for food and were able to sense food up to two kilometers away. This was an adaptation to their planet's harsh climate and short growing season, which made food supplies scarce. Ortolans also had hearing that extended well into the subsonic range. Naturally, their twin obsessions were food and music, and their suction-cupped fingers were suitably adapted to both pastimes: while able to absorb food through their finger tips, they were also exceptional organists. Offworld, many Ortolans found success as Master Chefs or musicians. They were handicapped in their business affairs by their obsession with food, however, sometimes accepting otherwise unfavorable contracts when promised enough to eat."}, {"tag": "p", "text": "While most Ortolans appeared to have blue skin, Ortolans were actually covered in short velvety fur which they often dyed in bright colors, including not only blue but pink. This tradition began when a Devaronian trader tried to sell Ortolans a shipment of food dyes—they considered dyeing their food a waste of time, but found dyed fur to be quite stylish. Ortolans had a thick layer of blubber beneath their skin, which insulated them against cold weather and sustained them when food was scarce."}, {"tag": "p", "text": "Ortolans were born with their teeth and musculature fully developed. Education was the responsibility of their parents, though gifted youngsters would often be traded to other families to get specialized education. At the age of seven, Ortolans were expected to support themselves, and would be forced out of the family unit unless they had a particularly valuable talent."}, {"tag": "p", "text": "Ortolan society was reasonably industrialized, though not as technologically advanced as other species. Despite this, their economy was mostly based on barter, with credits primarily used to trade with offworlders."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "An Ortolan tribe with shamanic beliefs inhabited the planet Lenico IV until the Great Galactic War, when they were wiped out by Sith apprentice Exal Kressh. These Ortolans seemed to be more slender than Ortolans from Orto."}, {"tag": "p", "text": "During the Clone Wars, the Ortolans initially tried to stay neutral. However, Orto's corrupt financial minister Belo Tusus, with the assistance of Neimoidian advisors, orchestrated a coup, and gave the planet over to the Separatists. While under Separatist control, the Ortolans were used as slaves on their own homeworld to build forts, fortresses and factories for the Separatist war machine. However, Nem Bees led a resistance effort during the occupation, which sabotaged Separatist operations on Orto. His efforts culminated in 19 BBY, when he took down Orto's planetary shields, allowing Clone Commander Deviss's K Company to land on Orto and rout the Droid Army. The Battle of Orto did not end in freedom for the Ortolans, however: after Order 66 was issued and the rule of the Galactic Empire began, Nem Bees was killed, and the Ortolans found themselves subject to Imperial rather than Separatist oppression."}, {"tag": "p", "text": "Under the rule of the Galactic Empire, Orto was occupied by Imperial forces, and Ortolans were not allowed to leave the planet. Ortolans found offworld during the Imperial era were usually either slaves or associated with Rebels or smugglers."}, {"tag": "h2", "text": "Ortolans in the galaxy"}, {"tag": "p", "text": "The Ortolan Vondri Deeq was a perfectionist chef operating the Three Jetties Gourmet Restaurant in Bartyn's Landing, Lamaredd. He supervised every served dish. Nem Bees was an Ortolan who served as a Jedi Knight during the Clone Wars, participating in efforts to drive the Confederacy of Independent Systems from his species's homeworld until he was assassinated during the enactment of Order 66."}, {"tag": "p", "text": "Common Ortolan names were Bedo, Eembek, Miebar, Nabkess, Ooben, and Ruznee.[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars: The Visual Dictionary uses the alternate spelling of Ortoloan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}