{"url": "Orto_Plutonia/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Ice planets", "Category:Orto Plutonia locations", "Category:Sujimis sector planets"], "nodes": [{"tag": "h1", "text": "Orto Plutonia"}, {"tag": "p", "text": "Orto Plutonia was a desolate icy planet in the Pantora system, home to the native Talz and a number of narglatches. It was considered a protectorate of the orbiting moon Pantora until the Clone Wars, when the Talz inhabitants were granted political supremacy by the Pantoran Assembly following a brief conflict with\nGalactic Republic forces."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Orto Plutonia had long been a protectorate of the nearby Pantoran moon, after Pantoran scouts searched the world and declared it uninhabited. They had missed the Talz population, which lived in the ice canyons in villages carved out of the ice walls, filled with huts made from animal skins pulled over bone-frames. The Talz lived a simple existence, somehow subsisting off the harsh environment, and using the native narglatch cats as mounts and protection. It is unknown how or why that Talz clan colonized the planet; Talz of Orto Plutonia were more aggressive and war-like than other members of their species who belonged to the galactic community."}, {"tag": "p", "text": "At the time of the Cold War between the Galactic Republic and the Sith Empire, the demands for forbidden narglatch-pets from Orto Plutiona was higher than ever."}, {"tag": "p", "text": "During the Clone Wars, the Pantoran Assembly requested that the Republic establish an outpost on Orto Plutonia to serve as an advanced warning station for any Separatist incursions. To that end, the Republic established Glid Station, a clone trooper outpost built within a massive ice spire. The Separatists too established a temporary base in the ice, and all this activity aggravated the Talz. When the Separatists discovered the Talz, they attacked them, but the Talz fought back. Glid Station got caught in the middle of the conflict, which ended in the Talz slaughter of all Separatists and Republic personnel on the planet. The Talz also left behind grim warnings against future trespassers - droid heads and clone helmets left perched atop spears."}, {"tag": "p", "text": "The Republic sent a task force to investigate, led by Jedi Anakin Skywalker and Obi-Wan Kenobi, assisted by a squad of clone cold assault troopers. The Pantoran side was represented by the Chairman Chi Cho and Senator Riyo Chuchi, whom the chairman brought along to have some measure of authority over the Jedi. Cho believed that the Separatists had attacked Glid Station, but the Jedi investigated the disappearance of their troopers and discovered the Talz village. They were welcomed as visitors to the chieftain's hut, and Talz leader Thi-Sen explained that the Talz simply wanted to be left alone on their world. Kenobi and Skywalker promised a peaceful negotiation with the Pantorans, but the chairman did not want to lose claim over Orto Plutonia. When it became an apparent that Orto Plutonia had a native population, Cho at first refused to believe it, and then later declared war to wipe out the Talz and keep the planet under Pantoran control."}, {"tag": "p", "text": "Before the Pantoran Assembly was able to intervene, Cho led a charge of clone troopers against the Talz, which went poorly and the Talz nearly overwhelmed Cho's forces, fatally wounding Cho in the process. Cho's violent gambit failed, and when he told reinforcements under Senator Chuchi to continue the war, he died in disbelief that the Assembly called his decision out of order. Senator Chuchi, backed by the Pantoran Assembly, ceded ownership of Orto Plutonia to the Talz, allowing them sovereignty over the planet. She withdrew the Republic and Pantoran presence from the world, leaving the Talz free to live their quiet life in their ice canyon villages."}, {"tag": "p", "text": "Years later, about one year before the Battle of Yavin, bounty hunters Bossk and Boba Fett traveled across the inhospitable surface of Orto Plutonia on a particularly difficult job."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}