{"url": "Orykan_Tamarik", "categories": ["Category:Legends articles", "Category:Females", "Category:Jedi trainees of the Jedi Order", "Category:Rutian Twi'leks"], "nodes": [{"tag": "h1", "text": "Orykan Tamarik"}, {"tag": "p", "text": "Orykan Tamarik was a female Rutian Twi'lek Padawan who served the Jedi Order and the Galactic Republic during Supreme Chancellor Thoris Darus' administration."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Twi'lek, Orykan Tamarik was trained in the ways of the Force by the Jedi Order at the Coruscant Jedi Temple's academy. Selected to become the Padawan of Jedi Master Casieck Akinslesh, Tamarik crafted her own blue-bladed lightsaber under Akinslesh's tutelage and she was greatly affected by his sudden death in 53 BBY. After a satisfactory mourning period, the Jedi High Council decided it was time to assign Tamarik a new master. As Master Tahl was to join Master Qui-Gon Jinn and his Padawan Xanatos on a mission to Telos IV, the High Council decided to test Tamarik's compatibility with the Noorian Jedi Master."}, {"tag": "p", "text": "While Tamarik was uncomfortable around Xanatos, she was able to defend herself upon their arrival when a group of insurgents attacked the Jedi's ship and forced them to draw their lightsabers. Later Tamarik accompanied Xanatos and his master to the rooftop where High Priestess Liora was murdered; Tamarik was able to reach into the Force and sense the actual murder take place while neither Xanatos or Jinn could see it. Collapsing from the shock of feeling the reverberations of the murder through the Force, Tamarik was escorted back to her quarters to recover. Later at a gala for Crion, the ruler of Telos, Tamarik began talking with Princess Nason, Xanatos' sister. While attempting to introduce the two, Xanatos made insensitive anti-alien remarks causing brief tension at the party. Meanwhile, Tahl and Jinn discussed Tamarik's future in private but were overheard by both Padawans; Xanatos' jealousy caused him to interpret Jinn's praise of the girl as meaning that she would eventually replace him as the Jedi's apprentice."}, {"tag": "p", "text": "When Tahl left for Landor, Tamarik was left behind with Jinn as the mission was deemed too dangerous for the girl. Remaining in her quarters as civil war erupted across the planet, Tamarik joined Master Jinn in battle as it was revealed that Lord Crion had fabricated the war in order to secure his place as dictator. While Tamarik lost her lightsaber and nearly was slain by Crion, Jinn rushed to her aid and slew the would-be tyrant, throwing his body into the beds of decorative fires within his palace. Xanatos, having just witnessed his master slay his father, attacked Tamarik as his anger rushed over him. Wearing the Twi'lek down easily, Xanatos was distracted by Jinn and was unable to achieve his goal of finishing Tamarik off with his lightsaber. As the fighting erupted over the capital, Jinn and Tamarik were able to escape, while Xanatos disappeared into the fray. While Tamarik returned by shuttle to the Jedi Temple, Jinn refused to return as he had to meditate on his failures with his former apprentice."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}