{"url": "Orvos", "categories": ["Category:Legends articles", "Category:Males", "Category:Nelvaanians", "Category:Religious workers"], "nodes": [{"tag": "h1", "text": "Orvos"}, {"tag": "p", "text": "Orvos was the elderly shaman of the village of Rokrul on the Outer Rim planet of Nelvaan during the last years of the Galactic Republic. Near the end of the Clone Wars between the Republic and the Confederacy of Independent Systems, Orvos assisted the Jedi Master Obi-Wan Kenobi and the Jedi Knight Anakin Skywalker by informing them metaphorically of the Techno Union presence that was decimating the planet. The shaman then prophesied that Skywalker was the Holt Kazed, or \"Ghost Hand,\" based on the fact that Skywalker had a cybernetic arm, and that he would save the Nelvaanian people. He then sent Skywalker on a solo mission to bring back the male villagers that had been captured by the Techno Union."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Orvos was a Nelvaanian male native to the planet Nelvaan in the Koobi system of the Outer Rim Territories. He was shaman of the village of Rokrul during the galaxy-spanning Clone Wars between the Galactic Republic and the rebelling Confederacy of Independent Systems. Some years prior to 19 BBY, the last year of the Clone Wars, Orvos predicted an ice age would fall over Nelvaan. His prediction came true when the Confederacy-aligned Techno Union set up a laboratory that ran off a siphon generator. The generator sucked the thermal energy from the surrounding area, making temperatures plummet across the world. However, despite Orvos prophecy, the fierceness and obstinacy of the winter shocked the villagers. The Nelvaanians sent out their male warriors and scouts to discover the reason behind the cold, but none of them came back. Even Orvos was without explanation as to the cause of their disappearance. However, Orvos did foresee two men coming to Nelvaan and discovering the cause of their plight."}, {"tag": "p", "text": "In the year 19 BBY, Jedi Knight Anakin Skywalker and his Master Obi-Wan Kenobi landed on the planet in search of the Separatist General Grievous. After crossing paths with a ferocious horax and disrupting the coming-of-age ritual of Rokrul's chieftain's son, the chieftain, whose name was Tuzes-Adaz, brought the Jedi to the village to meet Orvos. Later that night, Orvos, the Jedi, and the villagers gathered around a campfire as the shaman attempted to contact the Spirit of the Fire. After receiving a sign from the smoke, Orvos determined that Skywalker was the prophesied Holt Kazed, or \"Ghost Hand,\" the one would free the villagers from their wintery misery."}, {"tag": "p", "text": "Orvos then prepared Skywalker for his journey through the wilderness by using bruise-leech crawlers to create a rectangular tattoo design over his chest. He explained to Skywalker how to heal the \"Great Mother,\" the Nelvaanian term for their planet, by telling him to follow \"the path of her frozen tears to where her inner flame had languished.\" Orvos regretfully did not tell the Jedi the entire story, leaving out the part where the \"Ghost Hand\" would eventually, over time, take over Skywalker's body and consume him, block out the light, and strangle all his loved ones, for he felt the Great Mother needed Skywalker's strength no matter the consequences. Skywalker would go on to find the Nelvaanian men (ensnared by General Grievous for mutation by the Separatist war machine), destroy the Techno Union lab, and return the men to their village. There the shaman and the villagers had waited for his return, and after some initial hesitation, the tribe's warriors were overjoyed to be reunited with the others."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Orvos was a very spiritual Nelvaanian. He had strong faith in the deities of the Nelvaanian people, such as the Spirit of the Fire and the Great Mother, and was very concerned for the latter's well-being. The shaman was also able to make accurate prophesies regarding future events, having made at least two that came to pass during the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The article on Tuzes-Adaz in The Complete Star Wars Encyclopedia alternatively calls the shaman \"Orvos\" and \"Ovros\", the second spelling having not been seen in any other source."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}