{"url": "Attack_on_Nakadia", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Attack on Nakadia"}, {"tag": "p", "text": "During Operation Ringbreaker in 3 ABY, the Rebel Alliance's 61st Mobile Infantry initiated an attack on Nakadia against the Galactic Empire. During the battle, Twilight Company destroyed the planet's plastic factories, where farm crops were made into armor-grade polymers and synthetic resins."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3 ABY, Twilight Company had taken heavy losses at Obumubo, but were ultimately succesful. The plan was to destroy all of Nakadia's plastic factories that were producing synthetics used in armor."}, {"tag": "p", "text": "Hazram Namir knew he the battle would be difficult."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Namir left Everi Chalis behind on the Thunderstrike and accompanied the squads on the first assault. The Company did multiple night raids from the stalks. The strategy worked, but exhausted the soldiers and had to leave some injuries unattended. Maediyu and others returned with bloody eyed and the medics confirmed his suspicions. It was not pesticides that were affecting the soldiers, but military bio-weapons. Namir told the squad leaders about it and told them to be careful. Sixteen more soldiers fell to airspeeders spraying it before  their origin point was located. A squad attacked and burned the facility to the ground. Twilight then destroyed the factories and left Nakadia."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the battle, Namir confronted Chalis over the bio weapons saying those were the same ones they had destroyed at the Distillery during the Coyerti campaign. Chalis responded that they had saved millions from the bio weapons, but the Empire had been building up for decades and she would have not picked Nakadia as a target if she knew."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on Nakadia first appeared in Alexander Freed's 2015 novel Battlefront: Twilight Company."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}