{"url": "Osi_Sobeck/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Males", "Category:Phindians", "Category:Separatist officers", "Category:Wardens"], "nodes": [{"tag": "h1", "text": "Osi Sobeck"}, {"tag": "p", "text": "Osi Sobeck was a Phindian who lived during the time of the Clone Wars. Sobeck worked for the Confederacy of Independent Systems as the warden of the infamous prison known as the \"Citadel\", which was based on the volcanic planet Lola Sayu. A sadistic and cruel demeanered officer, Sobeck specialized in the torture and mental breaking of Jedi incarcerated at the Citadel as prisoners of war."}, {"tag": "p", "text": "In 21 BBY, Sobeck handled the incarceration of Jedi Master Even Piell and his crew, captured by Separatist forces after his fleet was suddenly ambushed en route to Coruscant. Count Dooku, the public face of the Separatist movement, personally assigned Sobeck the responsibility of learning the coordinates of a well hidden hyperspace lane known as the Nexus Route, data which Piell and his commanding officer, Captain Wilhuff Tarkin, memorized prior to their capture. The two were able to resist Sobeck's relentless torture, and a Republic operation aimed at the rescue of Piell and Tarkin was soon authorized. Despite Sobeck's best efforts to contain the situation, the Republic rescue force succeeded in extracting Piell and his crew. During a final effort to prevent the prisoners' escape on a small island north of the facility, Sobeck attempted to murder Tarkin by throwing him into the flow of lava, but was quickly silenced by an attack from one of Jedi Padawan Ahsoka Tano's two lightsabers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Separatist service"}, {"tag": "p", "text": "Osi Sobeck was a male Phindian allied with the Confederacy of Independent Systems during the Clone Wars. Sobeck served as the warden of the notorious prison complex known as the Citadel. The prison was infamous for its high security, having been designed to hold members of the Jedi Order as prisoners. Osi believes in torture, a very cruel way to get information from enemies."}, {"tag": "h3", "text": "Incarceration of Even Piell"}, {"tag": "p", "text": "At some point in 21 BBY, the Separatist forces captured Jedi Master Even Piell and transported him to the Citadel. Piell and his officers were transferred to the Citadel under the watch of Osi Sobeck. While being held at the prison Piell was interrogated in order to obtain coordinates for a key hyperspace route known as the Nexus Route, control of which could influence the outcome of the Clone Wars. Sobeck relied on the use of fear to break his prisoners - the one thing Jedi spend all their lives training against. The Phindian used an A4 laboratory assistant droid and a few commando droids to torture the Jedi and get the information out of him by any means necessary."}, {"tag": "p", "text": "Even though he did not know that the Galactic Republic was planning to rescue Even Piell, he knew that the Jedi would soon arrive to rescue him.\nHis predictions came true as a rescue team soon came in the form of a shuttle, full of Jedi and clone troopers frozen in carbonite. Due to his suspicions and the current occupancy of the prison, he ordered his droid K2-B4 to do a detailed scan of the incoming vessel. Because of them being frozen in carbonite, the scan did not detect any life forms. But the warden's tension did not ease. But when an electro-mine guarding the Citadel exploded because of a clone trooper accidentally triggering it, Sobeck knew a rescue team had arrived. Thus, Sobeck ordered all of his troops to their positions and prepared his special unit of commando droids."}, {"tag": "p", "text": "In the mean time, the Phindian, within the Citadel Command, watched the intruders' every step with the use of security cameras.\nOsi Sobeck took the opportunity and activated a ceiling magnet, which attracted all the weapons of the Republic force towards the ceiling. After which all the weapons, which were made of metal, were attracted to the sealing. Unfortunately, because Skywalker's prosthetic arm was also made of metal, he along with the guns and lightsabers got stuck to the ceiling. At that moment the warden's special unit of BX-series droid commandos came to arrest all the Jedi and clones and take them back to the holding cells. Sobeck saw that as an opportunity to torture the Jedi with electricity, but Skywalker managed to grab his lightsaber and he disabled the entire machine. This in turn released all weapons from the magnetic hold and the strike team managed to destroy all the commando droids. This turn of events angered Sobeck and when Rex shot the surveillance cameras – that was the last straw for the warden and he decided to go out there and takes matter in his own hands."}, {"tag": "p", "text": "To his dismay, he was too late and the Republic navy officers, including Captain Wilhuff Tarkin, had already been freed. a commando droid, inspecting the prison cell, reported that the cellmates had escaped. Infuriated by the statement of the obvious by the commando droid, he ordered his captain to “teach” the droid what happens when they use words as “escaped”. The droid in the cell was shot in the head for his failure, which in a way was used by Sobeck to let out some of the built-up anger."}, {"tag": "p", "text": "After the display, two security droids reported to the Phindian that the Jedi and clones were headed for the upper levels, which unknown to Sobeck was a diversion by Obi-Wan Kenobi to lead the attention away from the second group of Republic forces exiting the Citadel. The warden, assuming the Jedi were to steal transports, sent orders to all his battalions to stand guard on the landing pads and requested that he wanted all prisoners back. But in a few moments an explosion occurred that shook the entire complex. Sobeck and his droids were shaken by the explosion, but they stood their ground."}, {"tag": "p", "text": "Sobeck was later contacted by Separatist leader and Confederacy Head of State, Count Dooku who was upset as he heard about the Jedi's success of rescuing Piell and and his men. After K2-B4 informed him, Sobeck went to answer the Count, accompanied by K2-B4. After Count expressed his frustration about the conflict, Sobeck assured him that everything was under control and ended transmission. He then grabbed K2-B4 and warned her never to surprise him like that again to which K2-B4 obliged."}, {"tag": "p", "text": "Later on, after K2-B4 laid a trap for Kenobi's team, he observed them falling into the trap via video screen and laughed at them as droids and turrets surrounded the team. After the captured team were brought into the Citadel Command, Sobeck asked for the information on the Nexus Routes and threatened to execute the clones if they did not listen. Piell replied that the clones were ready to die in this war for anything to which Sobeck grabbed a blaster rifle from a commando droid and shot a clone in the head. He then proceeded to execute another clone when K2-B4 informed him that Skywalker's team had been spotted. Sobeck ordered the prisoners to be taken for interrogation. Later on, however, a security droid informed him that prisoners had escaped and what was worse for Sobeck, K2-B4 informed him that Count Dooku wanted to contact him immediately. Looking at the holographic view of the outside, Sobeck noticed that a part of the pipeline had exploded and quickly deduced that the two teams were probably heading for the landing pad as that was their only way of escaping. Ignoring contact with Dooku, he ordered all units to the landing pad. His predictions proved correct as a firefight soon erupted there which resulted in the death of Echo, the destruction of rescue team's ship and the remaining members of the team escaping to the bottom caverns."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "However, Dooku contacted him again and reminded him of the importance of the Jedi's capture and threatened him by saying that Sobeck's promises to capture the Jedi were the only thing keeping him alive.\nSobeck then ordered the release of Anoobas in an attempt to pick up the Jedi's scent.\nWhen the team were spotted, Sobeck personally led a squad of STAP-mounted commando droids to capture them. Upon sighting the team, he fired at them. However, his STAP was shot down by Fives and he crashed to the ground. Tarkin tried to shoot him but he missed. He then grabbed Tarkin, angry that he was unable to obtain the information, and was about to throw him into the lava, but was stabbed through the chest by Ahsoka and killed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Osi Sobeck was known to be a sadist and enjoyed the torture of others. This quality of his was perfect for the position he occupied as warden of the Citadel. This sadistic nature was also shown during the encounter with the Jedi rescue team that had come to save Even Piell. He showed a great amount of pleasure in the sight of Anakin Skywalker being electrocuted by one of his traps. As he did not tolerate failure, he showed the same sadistic tendency towards his own troops by enjoying the punishment of any droid that failed him in any way.\nAside from the sadism that Sobeck displayed, it was also evident that this Phindian was insane. This often displayed by the fact that he would go on and talk to himself, even though there were many droids around. Although probably insane, he was able to predict his enemies' move as he had done so twice. Sobeck was also honest to his superiors, but avoided reporting failure if he thought success was imminent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Osi Sobeck was voiced by James Arnold Taylor."}, {"tag": "p", "text": "Taylor voicing multiple characters in the trilogy was addressed in an inside joke where Kenobi comments on Sobeck's voice. According to Taylor, Sobeck's voice is a combination of \"Christopher Walken and a little Al Pacino.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}