{"url": "Oskan_blood_eater", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Carnivorous creatures", "Category:Non-sentient species", "Category:Vertebrates"], "nodes": [{"tag": "h1", "text": "Oskan blood eater"}, {"tag": "p", "text": "Oskan blood eaters were bipedal carnivores found on a variety of planets, often used as guards for penal colonies. They had two large hooves on each foot and four arms, each ending in a blade-like claw. They fed on any animal with oxygenated blood, preferring large mammalian creatures such as Humans and humanoids. The sight of a humanoid or other prey animal was enough to send them into a violent feeding frenzy. Though their senses were not particularly acute, they were determined trackers, who would hunt escaping prey for weeks."}, {"tag": "p", "text": "Blood eaters were notable for the gruesome way they killed and ate their prey. They would attack by slashing their prey to bits with their four large, slashing claws, leaving nothing more than a pile of flesh and blood. They would then lower their heads, and drink the remains through their perforated mouths."}, {"tag": "p", "text": "There was little variation between individual blood eaters, partly because they reproduced through a parthenogenetic process which made every blood eater almost genetically identical to its mother, and partly because of an efficient mutation correction mechanism in their cells. Despite this, they could thrive in a variety of environments on many worlds."}, {"tag": "p", "text": "Although they were found in several different systems, blood eaters did not appear in the mythologies of any planet, as carnivores of their size would be expected to. This, together with their genetic peculiarities, led many to believe that they were artificially created creatures. Imperial Intelligence's Destab Branch supported these rumors, claiming that they were developed by the Old Republic. In fact, they were much more recent creations produced by the Galactic Empire."}, {"tag": "p", "text": "Oskan blood eaters were popular with the galactic underworld. The crimelord Jabba Desilijic Tiure once kept a blood eater as a \"pet\" in his palace on Tatooine. Chalmer Trillili, leader of a pirate gang called \"The Scourge\", also owned a blood eater, recovered from an Imperial vessel, which he kept as a guard animal in his hideout on Dega. The Nikto shipjacker Nim Abek also kept one for gladiatorial combat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}