{"url": "Osarian-Rhommamool_conflict", "categories": ["Category:Legends articles", "Category:Conflicts of the Expansion Region"], "nodes": [{"tag": "h1", "text": "Osarian-Rhommamool conflict"}, {"tag": "p", "text": "The Osarian-Rhommamool conflict was a prolonged series of tensions between the double planets of Osarian and Rhommamool in 25 ABY towards the start of the Yuuzhan Vong War."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "The roots of the conflict lay in the fact that Osarian was a wealthy and luxurious world, while Rhommamool was dry and barely habitable. Over the years, the Osarians populated Rhommamool with convicted criminals used as de facto slave labor for the planetary mines, with the profits largely going to support the lifestyle of those on Osarian. Although the worlds shared a single government, it was based on Osarian and dominated by Osarians."}, {"tag": "p", "text": "The situation largely stayed under control due to the fact that neither planet had extensive space forces. However, every ten years their orbits would bring the worlds within a million kilometers of each other, close enough for each planet's ground-based nuclear missiles to hit each other if launched. At those times of closest contact, the conflict would flare up. Until the close encounter of 25 ABY, the worlds managed to hold off attacking one another."}, {"tag": "h2", "text": "War Begins"}, {"tag": "p", "text": "In the time leading up to 25 ABY, a firebrand by the name of Nom Anor had risen to prominence on Rhommamool, combining their hatred of the Osarians with a broader appeal against technology, the New Republic, and the Jedi Knights. He formed an independent senate and a group of religious fanatics, the Red Knights of Life, to push his agenda."}, {"tag": "p", "text": "Anor's call for action against Osarian led the New Republic to dispatch a Mon Calamari Star Cruiser, the Mediator, to keep the peace, while Jedi Knight Wurth Skidder arrived to take vigilante action against whichever side showed aggression. The Osarian leader, Shunta Osarian Dharrg, hired Captain Grappa and his Osarian First-Force to help defend the world."}, {"tag": "p", "text": "Despite an arrival of Leia Organa Solo to negotiate, the situation was impossible to resolve due to the fact that Anor fully intended to use it to cause as much destruction and chaos as possible. Following her departure, whipping his followers into a holy rage, Anor initiated a nuclear strike against the Osarian capital, Osa-Prime, beginning a full-scale war between the planets. More missiles would be fired by Rhommamool, destroying more Osarian cities. Large red thermonuclear blast clouds also appeared over the planet, presumably causing harm to millions of Osarians."}, {"tag": "p", "text": "Using a nuclear-armed shuttle to both fake his death and cripple the Mediator, Anor and his adjunct Shok Tinoktin left Rhommamool behind in a secreted A-wing as the nuclear volley continued. As the conflict escalated, the Red Knights of Life attempted to help the Yuuzhan Vong subjugate the galaxy by attacking planets with high levels of technology and droids including Osarian, Uffel and Kligson's Moon. However, they were repelled by the Iron Knights."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}