{"url": "Attack_on_Ongary_IX", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Attack on Ongary IX"}, {"tag": "p", "text": "During the Clone Wars, the Galactic Republic carried out an attack on Confederacy of Independent Systems starfighter bases on the astronomical object Ongary IX."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Mid Rim mining world of Ongary IX was captured by the CIS, hoping to claim its hfredium deposits. The celestial body's mine shafts were converted into heavily-fortified starfighter bases for Vulture droids."}, {"tag": "p", "text": "While ground forces of the Grand Army of the Republic were available, the Galactic Republic's starfighter squadrons were committed to a military operation at Uvadala, so the local Ividal Sector Forces were enlisted to lead the Republic's counterattack. The Z-95 Headhunters of Foxfire Squadron were refitted as bombers to attack the Separatist positions in the mines with missiles armed with Arakyd-made burrowing plasma charges."}, {"tag": "p", "text": "The Republic forces encountered difficulties when it was found that the extreme brightness of the burrowing plasma charges' explosions would completely polarize the visors of flight helmets and scramble head-up displays, resulting in two casualties within Foxfire Squadron in two bombing runs. For a third bombing run, the squadron's helmets were retrofitted with plastoid blast shields, which were designed to be flipped down when the missile was launched to protect the eyes from the explosion and be raised again once the flash had dissipated."}, {"tag": "p", "text": "Foxfire Squadron fought through a screen of Vulture droid starfighters before flying nap-of-the-earth to attack the mine. The attack was successful, collapsing the mine and destroying the Separatist base. However, one pilot, Jorn Kulish, had the terrifying experience of his blast shield jamming as he tried to raise it, and narrowly avoided colliding with a mountain before he was able to remove his helmet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Republic was victorious and the Ividal Sector Forces were returned to Ividal aboard a Venator-class Star Destroyer. However, the experience of the battle prompted Jorn Kulish to resign and seek passage to the Core Worlds aboard the YT-1300 light freighter Stellar Envoy. Kulish accidentally left his blast shield-equipped helmet behind on the freighter when he disembarked at Denon, though he did not regret the loss."}, {"tag": "p", "text": "Many years later, Luke Skywalker would use Kulish's helmet, still aboard the freighter now known as the Millennium Falcon, as part of his training with Obi-Wan Kenobi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on Ongary IX was first conceived of at Celebration VI in 2012, where Star Wars author Jason Fry convened an impromptu discussion on why anyone might need an opaque blast shield attached to a flight helmet, as worn by Luke Skywalker in Star Wars: Episode IV A New Hope. Intended for The Essential Guide to Warfare, the piece was ultimately cut from the final book owing to word count constraints, but was later featured in Star Wars: The Essential Guide to Warfare Author's Cut, a twelve-part blog series detailing material cut from the book."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}