{"url": "Otherside", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Deities", "Category:Keshiri religion"], "nodes": [{"tag": "h1", "text": "Otherside"}, {"tag": "p", "text": "In the Keshiri religion, the Otherside were the enemies of the Keshiri gods, the Skyborn. Said to have come \"from below,\" the Otherside engaged in a Great Battle with the Skyborn in the stars above the planet Kesh in ancient times. The Otherside were defeated in the clash, but not before they wounded the Skyborn—injured, the Skyborn spilled blood onto Kesh's oceans, creating all of the world's landmass. The legend of the Otherside continued to be told on Kesh for ages, and members of the Keshiri species were always warned to hate the Otherside. Along with the Skyborn, the Otherside were eliminated from Keshiri mythology after the arrival on Kesh of a group of crash-landed Sith in 5000 BBY, who did away with those stories in favor of earlier tales of the Protectors and the Destructors."}, {"tag": "h2", "text": "Mythology"}, {"tag": "p", "text": "The Otherside were a group of deities depicted in the mythology of the Keshiri religion, native to the planet Kesh. The Otherside, who came \"from below,\" were said to be the nefarious enemies of the benevolent Skyborn, and their conflict eventually led to a calamitous battle in the stars above Kesh. The Great Battle, as it was known, lasted for eons—although the Otherside wounded the Skyborn, their opponents won the battle. Drops of Skyborn blood fell onto the seas of Kesh, creating all of the planet's landmass. In the ages afterward, the Otherside were regarded as the source of all evil on the planet Kesh, and heresy against the Skyborn was said to be glorification of the Otherside. As such, the Keshiri regarded it as the will of the Skyborn that they were to hate the Otherside. Among the uvak beast-riding ruling council known as the Neshtovar, falling from one's mount was to be claimed by the Otherside."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 5000 BBY, the worship of the Skyborn, and as a result, the hatred of the Otherside, was a dominant facet in Keshiri daily life. Tradition held that in ages past, the uvak-riding Neshtovar brought the knowledge of the Otherside and the Great Battle to the masses from the Cetajan Mountains. Although faith in the Keshiri religion was prevalent, by 5000 BBY the Neshtovar still had not hammered down exactly who or what the Otherside were. That year, geologist Adari Vaal was brought before the Neshtovar to testify about the veracity of her controversial teachings of the formation of Kesh's landmass, which conflicted with the common Keshiri religion. There, Neshtovar leader Izri Dazh accused her of glorifying the Otherside with her supposed heresy. After harassment by other Keshiri, Vaal fled into the Cetajan Mountains, where she found a group of crash-landed Sith who claimed to be the Skyborn returned to Kesh. After taking control over Kesh, the Sith did away with the use of the terms \"Otherside\" and \"Skyborn\" in favor of earlier tales of the Destructors and Protectors, respectively."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Otherside were first mentioned in John Jackson Miller's 2009 eBook, Lost Tribe of the Sith: Skyborn. They were also referred to in one of Skyborn's sequels, Lost Tribe of the Sith: Paragon. Although the existence of the Destructors, the later counterpart of the Otherside, was confirmed as true by Troy Denning's 2012 novel Fate of the Jedi: Apocalypse, the full extent of the connection between the Otherside and the Destructors has not been revealed, so it is not known whether or not the Otherside actually existed in the Star Wars universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}