{"url": "Ostrine_edge", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Weapon attachments"], "nodes": [{"tag": "h1", "text": "Ostrine edge"}, {"tag": "p", "text": "An ostrine edge was a rare type of melee weapon edge that had been augmented by the application of a refined form of a rare, heat-absorbing mineral known as ostrine, from the planet Hargeeva. It caused the weapon to emit an extreme cold that caused additional damage to objects that it struck, and the edge also partially protected the user from extreme heat and fires. The edge was used around the time of a series of conflicts fought between the Galactic Republic and the fragments of the Sith Empire, which was known as the Dark Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An ostrine edge was a melee weapon edge that had applied to it a form of refined ostrine from the planet Hargeeva, in order to gain the rare ostrine mineral's heat-absorbing capabilities. When the melee weapon had the edge affixed to it, the weapon emitted extreme cold powerful enough to damage objects it struck. The ostrine edge also decreased the surrounding temperature, which helped protect the weapon's user from fires and other sources of extreme heat. The edge was silver in color except for a red part of the edge that would be near the weapon's hilt."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although they were quite rare, ostrine edges were in use around the time of the Dark Wars, a string of conflicts between the remnants of the Sith Empire and the Galactic Republic. In the year 3951 BBY, the weapon upgrade sold for around 28,850 credits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The ostrine edge made its first appearance in the 2004 Obsidian Entertainment video game Star Wars: Knights of the Old Republic II: The Sith Lords. Due to its rarity and the fact that it could be found in random locations, the melee weapon upgrade was not guaranteed to appear during each play-through of the game, but characters with a very high Repair skill could construct the item at a workbench. A melee weapon upgraded with the edge gave the user a cold damage bonus and a reduction in damage taken from fire-based attacks. The ostrine edge also gave the weapon an increased chance of scoring a critical hit, which dealt increased damage."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}