{"url": "Oswaft", "categories": ["Category:Legends articles", "Category:Oswaft", "Category:Outer Rim Territories species", "Category:Space-borne creatures"], "nodes": [{"tag": "h1", "text": "Oswaft"}, {"tag": "p", "text": "The Oswaft were sentient, transparent, manta-like creatures that lived inside the ThonBoka nebula in the Centrality."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Oswaft were a species that developed outside of the confines of a planet. Instead, they \"swam\" through space as if it were a great body of water. These massive creatures had brains that took up approximately two-thirds of their immense volume, and found tasks like deciphering encrypted Imperial communications codes trivial. They used an intense, information dense language, which was \"spoken\" by emitting microwaves. Oswaft also had the ability to travel through hyperspace without a starship to carry them."}, {"tag": "p", "text": "Young adult Oswaft could be half a kilometer across at the wingtips, and the Elders of the species were at least twice that. Oswaft grew throughout their lives. The duration of an Oswaft's life isn't known, however, they clearly live for many centuries. They had tentacles on their undersides, and two sensory projections on the front of their bodies. They could fabricate objects like gemstones from elements in their environment. The Oswaft were naturally transparent making them difficult to see, but became opaque when they died."}, {"tag": "p", "text": "The Oswaft were similar in appearance to the Neebray manta or a jellyfish."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Oswaft tended to be cautious creatures and never left the safety of their home nebula. Thus, they remained in isolation from the rest of the Galaxy at large for millennia. Their only explorer was Lehesu, an ally of Lando Calrissian and Vuffi Raa. Honorific syllables were added to an Oswaft's name as they grew older and more influential, and the ruling Oswaft Elders had names of six to nineteen or more syllables."}, {"tag": "p", "text": "In 3 BBY, Emperor Palpatine tried to exterminate the Oswaft because of his distrust of an intelligent alien species of significant population that could make hyperspace jumps at will. An armada of 500 capital ships under the command of his local ally, Sorcerer of Tund and Centran Scrivinir Rokur Gepta, blockaded the ThonBoka Nebula."}, {"tag": "p", "text": "The armada's Carrack-class light cruisers were modified to contaminate the interstellar plankton that inhabited the nebula. Help came in the form of Lando Calrissian and a mysterious droid species known as the Silentium, who led the Oswaft against the Imperial fleet during the Battle of ThonBoka."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}