{"url": "Ota", "categories": ["Category:Legends articles"], "nodes": [{"tag": "h1", "text": "Ota"}, {"tag": "p", "text": "Ota was a frozen world in the Kashyyyk Region of the Mid Rim which was the home of the furry sentient species known as the Snogars. The Snogars lived in cities built within the planet's ice canyons by their ancestors, a highly intelligent race referred to as the \"Old Ones.\" By 1 ABY the heating machines that kept the Snogar cities warm began to fail, leading Ota's natives to seek out offworlders who could repair the devices and help them survive the planet's biting cold."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Mostly hidden by the fringes of the Thornhedge Nebula, Ota was an icy world in the Kashyyyk Region's Mytaranor sector, sitting at the junction of the Dauntless Run and the Ootmian Pabol. A freezing world, Ota was characterized by massive ice canyons and crevasses big enough to fly a starfighter through. A sentient species known as the Snogars lived in shivering cities above ground, the ice contained hidden dangers, including massive serpent-like creatures that could emerge suddenly to attack travelers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the millennia before the Galactic Civil War, a civilization of technologically advanced humanoids later referred to as the \"Old Ones\" flourished on Ota, building massive cities among the planet's ice valleys. However, over time, the Old Ones degenerated into the less-intelligent Snogars, whose society devolved as they forgot how to use the technology that powered and heated their communities. During the latter years of the Republic, the wealthy Tefaun banker Kelek \"the Blue\" funded mining opportunities on Ota, but by the era of the Galactic Civil War the planet was a complete backwater, inhabited solely by the Snogars freezing in their ancient cities."}, {"tag": "p", "text": "By 1 ABY the Snogars had become desperate to find some way to fix the technology that kept their homes heated, and staked all their hopes on the arrival of offworlders—or, as they called them, \"smart ones\"—who had the technical knowledge necessary to save them. Their prayers were seemingly answered when Rebel pilot Luke Skywalker pursued Mandalorian bounty hunter Boba Fett to Ota—Fett, on behalf of the Imperials, was hunting a rogue Imperial spy believed to be hiding on the world. A group of Snogars from a nearby city captured the pair and ordered them to fix the hydroelectric generator that powered its heating machine, and when the two offworlders escaped, they instead kidnapped Skywalker's friend Han Solo, who had followed Skywalker to Ota alongside Rebel associates Leia Organa and Chewbacca. Fett, also pursuing a bounty on Solo, returned to the city to track him down, leading to a confrontation between the Rebels, Fett, and a group of angry Snogars wanting Fett's blood."}, {"tag": "p", "text": "Fett chased the Snogars off, then found that the Imperial mole had taken refuge in a part of the city shunned by the natives. However, the Rebels overpowered the bounty hunter and trapped him using a massive magnet, allowing them to flee Ota with the defecting spy."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Ota was home to the Snogar species, a race of tall, furry humanoids of limited intelligence who lived within the cities built by their ancestors, the \"Old Ones.\" Although the Snogars grew up on the freezing world and were adept in traversing its snowdrifts and ice canyons, the cold often grew too great even for them when they were away from the heating machines of their cities. Although offworlders were rare on Ota, the Snogars thus became dependent on their help to be able to survive."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ota first appeared as the setting of The Frozen World of Ota, a comic strip story arc written by Russ Manning, Rick Hoberg and Don Christensen and released in the summer of 1980. As The Frozen World of Ota contains one of the earliest-ever appearances of Boba Fett, the planet was later mentioned in numerous later sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}