{"url": "Attack_on_Phoenix_Squadron_(4_BBY)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Battles of the Galactic Civil War", "Category:Battles of Lothal"], "nodes": [{"tag": "h1", "text": "Attack on Phoenix Squadron  (4 BBY)"}, {"tag": "p", "text": "An attack was carried out on Phoenix Squadron by the Sith Lord Darth Vader in 4 BBY, during the Siege of Lothal. Having concocted an elaborate trap designed to track the rebel group known as the Spectres back to their fleet, Vader launched a one-man assault on the Phoenix fleet in his TIE Advanced, decimating the group and crippling the rebel command ship Phoenix Home. Due to the quick thinking of Hera Syndulla and an incidental distraction caused by Ahsoka Tano, the rebel CO and command crew managed to evacuate the crippled Phoenix Home, and the surviving rebels were able to retreat into hyperspace before Imperial reinforcements arrived."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "On the day prior to the battle, the Spectres undertook a mission to the planet Lothal to rescue a defecting Imperial Minister named Maketh Tua. During the rescue attempt, Tua was killed and the rebels were framed for her murder by the Imperial Security Bureau Agent Kallus on the orders of Darth Vader. With their transport having been shot down, the rebels were left stranded in Lothal's Capital City without the support of the local populace. To compound their problems, the Galactic Empire had imposed a blockade of the planet in an effort to ferret the rebels out."}, {"tag": "p", "text": "Hoping to commandeer a hyperspace-capable Imperial craft, the rebels managed to infiltrate the Imperial Complex in Lothal's Capital City. There, they came upon an Imperial shuttle and several shield generators. Realizing that they could steal not only the shuttle but the shield generators as well, they began loading them aboard the ship when they were confronted by Darth Vader and a small group of stormtroopers. The Sith Lord lazily engaged in a duel with the group's two Jedi, Kanan Jarrus and Ezra Bridger, while the stormtroopers exchanged fire with the remaining rebels. After a short time, the rebels managed to load all of the shield generators onto the shuttle and took off. Kanan and Ezra, who had realized by that point that they were nowhere near a match for Vader, broke off the fight and leapt aboard the escaping shuttle. Vader, having staged the entire affair, allowed the shuttle to leave unmolested."}, {"tag": "p", "text": "Unable to flee offworld without alerting the Imperial fleet, the Spectres turned to Lando Calrissian for help. While offworld, the galactic entrepreneur arranged for his droid W1-LE to facilitate their escape by using sensor buoys to replicate their shuttle's signal and scatter the Imperial fleet. The Spectres managed to escape the blockade and returned to the Phoenix Cell's fleet in deep space. However, Vader had arranged for a tracking device to be planted aboard the shuttle with the intention of following the Spectres to Phoenix fleet."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Upon rendezvousing with Phoenix fleet, the astromech droid Chopper detected a transmitter aboard the Spectres' shuttle. Realizing that they were being tracked, the Spectres rushed aboard the rebel fleet's command ship Phoenix Home to warn Commander Jun Sato and Ahsoka Tano about the danger. Before any action could be taken however, Darth Vader emerged from hyperspace in his TIE Advanced and began to rapidly close on the rebel fleet. In response, Commander Sato launched the RZ-1 A-wing interceptors of Phoenix Squadron. However, Vader's peerless piloting skills allowed him to decimate the squadron in short order."}, {"tag": "p", "text": "After breaking through Phoenix Squadron, Vader launched a devastating attack on Phoenix Home. With the rebel pilots visibly outmatched and the command ship in serious danger, the Spectres boarded their VCX-100 light freighter Ghost along with Tano and attempted to render assistance to the beleaguered Phoenix Squadron. However even with the aid of the Ghost, the battle remained completely one-sided, and Vader continued to bombard Phoenix Home whilst picking off rebel fighters at his leisure. Vader quickly crippled Phoenix Home and eliminated most of the rebel fighter craft while essentially ignoring the Ghost. As he prepared for a final assault on the rebel command ship, Commander Sato begged the crew of the Ghost to stop him. However, the rebels were unable to land so much as a hit on Vader's craft as he closed in for the kill. While in pursuit, Tano sensed that the Force was strong with whoever was piloting the Imperial fighter, and decided to combine her powers with those of Kanan to probe the pilot's mind. As they reached out, Ezra Bridger experienced a chilling sensation similar to that which he had felt on Lothal while facing Vader, and deduced that the pilot was in fact the Sith Lord that they had encountered earlier. At the same time, Tano managed to probe Vader's mind enough to get a sense of his identity as her former master Anakin Skywalker, but was overwhelmed by the psychic backlash of the probe and passed out in horror. Vader too sensed the identity of the one attempting to probe him, and realized that his former Padawan was still alive."}, {"tag": "p", "text": "Upon learning of Tano's presence aboard the Ghost, Vader broke off his killing run at Phoenix Home and engaged the Ghost. Annihilating the few remaining rebel fighters, Vader began to pepper the Ghost with blaster fire in an attempt to disable it. This distraction allowed Commander Sato and the command crew of Phoenix Home to begin evacuating the doomed ship. As the battle neared its end, several Star Destroyers entered the system under the command of Admiral Kassius Konstantine. Aboard the Relentless, Konstantine contacted Vader and requested orders. Vader informed him to move his Star Destroyers to block the escape of the Ghost but not to fire, as he wanted the rebels aboard it alive. With Vader and the Star Destroyers focused on the Ghost, Sato and his crew successfully abandoned Phoenix Home and evacuated the system with the remains of Phoenix fleet."}, {"tag": "p", "text": "As Vader continued his assault on the Ghost, Hera Syndulla flew the ship straight towards the Star Destroyers. On Vader's orders, the Relentless powered up its tractor beam to capture the Ghost as it passed between it and another Star Destroyer. Syndulla however, made it through the gap between the two Star Destroyers just before the tractor beams became active, leaving Vader to be caught rather than the Ghost. The Ghost jumped into hyperspace and due to the tractor beams, Vader was unable to pursue."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following their narrow escape from the Empire, the Phoenix and Spectres were forced to come to terms with the loss of their command ship and nearly all the pilots of Phoenix Squadron. Despite the odds against them, the Spectres decided to commit to aiding the rebellion. Ahsoka had by then regained consciousness and was asked by Ezra if she had any idea who Vader might be. Ahsoka, consumed with guilt and anguish at learning Anakin's fate, lied to Ezra and stated that she had no suspicions as to his identity. Meanwhile, Darth Sidious was pleased to learn about the discovery of Tano and believed that she would lead them to more Jedi. Under Sidious' orders, Vader dispatched another Inquisitor to hunt the rebels down."}, {"tag": "p", "text": "Due to the serious losses sustained by the Phoenix fleet, Ahsoka sent the Spectres on a mission to Seelos to seek out an old friend. This old friend turned out to be the former Clone Captain \"Rex,\" who agreed to supply the rebels with information about Galactic Republic military bases in the Outer Rim Territories and on Mandalore. After fighting off an Imperial assault, Rex agreed to join the rebellion and accompanied the rebels back to the Phoenix fleet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on the Phoenix fleet first appeared in the one-hour movie Star Wars Rebels: The Siege of Lothal, which first premiered at the Celebration Anaheim on April 18, 2015. It was later released on Disney XD on June 20, 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}