{"url": "Attack_on_Point_Modie", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Occupation of Karthakk"], "nodes": [{"tag": "h1", "text": "Attack on Point Modie"}, {"tag": "p", "text": "The Attack on Point Modie was a test conducted by Lieutenant Bella to establish the efficiency of the Hex Weapons against the Mere living on Point Modie."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In preparing for the galactic crisis which was to come, Count Dooku set about finding allies for the Confederacy of Independent Systems. He found a like-minded individual in the pirate Cavik Toth, the scourge of the Outer Rim. In return for giving the pirate resources, Toth would develop new weapons. Toth wasted no time in requiring dangerous and illegal Trihexalon weapons. As the Revenants were currently raging a war against Trade Federation occupation, the planet Mere would be chosen as the testing point for the Hex weapons."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "On the orders of Captain Cavik Toth, Lieutenant Bella assembled five Hex Deployers and began an orbital bombardment upon Point Modie. Having just destroyed a Trade Federation Sensor Station, Jedi Master Adi Gallia sensed a disturbance in The Force and convinced Nym that she should investigated accompanied by Reti. Upon their arrival they found Point Modie in a state of emergency: the city was being bombed by orbit-to-surface Hex missiles, and the population was scrambling to evacuate. Master Gallia and Reti engaged the missiles at once and managed to neutralize a substantial amount, even more so when Sol Sixxa joined the battle."}, {"tag": "p", "text": "After their initial failure the Hex Bombers descended and resumed their attacks only now accompanied by Sabaoth Squadron. Again Gallia, Reti and Sol Sixxa were able to defend the spaceport. When Reti tapped into the enemy's comm channel the trio were able to identify Bella. With the destruction of the last of the Hex bombers Gallia contacted Mace Windu to inform him and the Council that the threat behind the Hex Weapons was Captain Cavik Toth."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After discovering that the person behind the attack was Cavik Toth, the Mere Resistance vowed to stop his reign of terror. They would go on to attack the Hex production plants and eventually face Toth himself in a showdown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This particular mission was used for the demo of the video game Star Wars: Jedi Starfighter."}, {"tag": "h2", "text": "Appearances"}]}