{"url": "Otoh_Gunga/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles to be expanded", "Category:Gungan Swamp locations", "Category:Otoh Gunga locations", "Category:Trade Federation cities"], "nodes": [{"tag": "h1", "text": "Otoh Gunga"}, {"tag": "p", "text": "Otoh Gunga, also known as Gunga City, was the largest Gungan city on Naboo, and the seat of their government."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The city of Otoh Gunga was anchored to a massive underwater cliff deep within Lake Paonga, and was a mass of hydrostatic bubbles which keep water out while allowing the Gungans to enter through them. There were satellite clusters outside of the city, including buildings which had been cast out from other Gungan settlements. While the Gungans could survive both on land and underwater, they chose to build their capital city under Lake Paonga to avoid contact with the Nabooian Humans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Otoh Gunga was founded by Boss Gallo in 3000 BBY on the site of Boss Rogoe's fortress city, Spearhead. Otoh Gunga was originally occupied by the population of Otoh Jahai, Otoh Langua, Otoh Mandassa, Otoh Raban, Otoh Sancture, and Otoh Urs, after Gallo united all the Gungan tribes under one banner."}, {"tag": "p", "text": "As of the Battle of Naboo, Otoh Gunga was home to a million Gungans living in a massive bubble city that had grown out from the original foundation laid by Gallo's people, an area now known as the Ancient Quarter. The main focus of the city was a dense cluster of bubbles in the central district, radiating out from between walkways and plazas."}, {"tag": "p", "text": "Notable additions to the city included the Otoh Villages, where most Gungans lived and worked, and the City Bigspace, a popular concourse constructed on the orders of Boss Rugor Nass, wishing to leave his mark on the city. The city also included bongo pens, cantinas and one of its most famous attractions, the Otoh Gunga Zoological Research Facility."}, {"tag": "p", "text": "After standing for three thousand years as a symbol of Gungan unity and strength, Otoh Gunga fell to the might of the Trade Federation in the latter stages of the Invasion of Naboo in 32 BBY. In the early stages of the invasion, the Trade Federation had only heard rumors of a primitive underwater civilization."}, {"tag": "p", "text": "Having confirmed the existence of the Gungans, Nute Gunray ordered a full assault on their strongest fortress. Led by OOM-9 and assisted by Darth Maul, a contingent of battle droids and aquatic destroyers attacked and besieged Otoh Gunga. Demoralized and defeated, Boss Nass informed the Rep Council of the situation, trying to convince the Reps they needed to evacuate soon before the city was destroyed. Many members of the council wanted to stay, but Rep Been finally convinced them to go. He knew the secrets of old Gungan hidden places, and suggested they fled to the Gungan's Sacred Place to plan his counterattack. After Boss Nass joined with the Royal Naboo Security Forces to expel the Trade Federation of Naboo, Otoh Gunga was re-occupied."}, {"tag": "p", "text": "Many years later during the time of the Clone Wars, Lyonie had become the Boss of Otoh Gunga. He fell under the sway of Minister Rish Loo, who had allied with the Confederacy of Independent Systems and forced Lyonie to call the Gungan Grand Army together to march against the Royal Naboo. Senator Padmé Amidala and the Jedi Knight Anakin Skywalker traveled to Otoh Gunga and revealed Loo's treachery in time for the Grand Army to expel a Confederacy invasion force."}, {"tag": "p", "text": "Several years later, during the early stages of the Galactic Civil War, Otoh Gunga was advertized as a visitable locale for the Star Tours travel agency. In addition, a Star Tours vessel briefly passed by this area when attempting to access a Rebel-owned hangar on Naboo during a skirmish in the orbit of Naboo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name Otoh Gunga was never mentioned in The Phantom Menace. Jar Jar Binks called it Gunga City, and Obi-Wan Kenobi referred to it as \"The Gungan city\". In all novelizations of the film however, it is referred to as Otoh Gunga."}, {"tag": "p", "text": "Otoh Gunga appears in a cutscene in the 2005 video game LEGO Star Wars: The Video Game. The scene was later included in the game's 2007 compilation re-release."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}