{"url": "Ottlis_Dos", "categories": ["Category:Canon articles", "Category:Agents of the Galactic Empire", "Category:Guards", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ottlis Dos"}, {"tag": "p", "text": "Ottlis Dos was a human male who was the personal bodyguard of Moff Ghadi. He was a student of Juahir Madras when he first met with Arihnda Pryce. Later he got her martial arts lessons. Ottlis invited Pryce to his employer's office under the pretext of a martial arts training session. Pryce soon discovered that Ottlis' employer had summoned her for a meeting. The Moff told that Ottlis was his undercover agent and blackmailed her."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Government bodyguard"}, {"tag": "p", "text": "Ottlis Dos served as Moff Ghadi's personal bodyguard during the Imperial Era. In the years leading up to the Battle of Yavin, Ottlis trained under the tutelage of Juahir Madras, a martial arts instructor at the Yinchom Dojo on the galactic capital of Coruscant. Juahir was a secret rebel operative affiliated with Nightswan who used her position at the Dojo to recruit bodyguards as spies to steal files and information on Imperial mining operations. However, Ottlis was a double agent whose true loyalty lay with his employer, Moff Ghadi."}, {"tag": "p", "text": "While receiving extra hand-to-hand classes from Juahir at the dojo, Juahir received a distress call from her friend Arihnda Pryce, whose lift had malfunctioned and taken her to the dangerous lower levels of Coruscant. While Juahir fought off a gang of youths who had accosted Pryce, Ottlis watched his instructor single-handedly defeat the gang and force them to retreat. Madras ordered him not to intervene since as a government bodyguard he would have to fill out a mass of datawork if he beat someone down. Since Juahir was a private citizen, she was not bound by such regulations and could easily claim self defense."}, {"tag": "p", "text": "When Pryce expressed an interest in learning martial arts, Juahir replied that the dojo was booked but offered Ottlis' services as a combat instructor. Though Pryce did not want to embarrass Ottlis, he was happy to teach her and remarked that a man never truly understood a subject until he teachers it. When Pryce asked if he had the time, Ottlis reassured her that his employer was away for the next six weeks and could instruct her at his employer's empty office suite. Pryce accepted Ottlis and Juahir's offer on the condition that they allow her to treat them for dinner tonight."}, {"tag": "h3", "text": "Trapping Pryce"}, {"tag": "p", "text": "For several weeks, Ottlis trained Arihnda in hand to hand combat. Moff Ghadi subsequently returned to Coruscant for a visit, causing Ottlis to miss their last two sessions. Ottlis made arrangements with Pryce to meet at the office of his employer Moff Ghadi. He led an unsuspecting Pryce into the presence of Moff Ghadi, who demanded that Pryce reveal who had hired her Higher Skies Advocacy Group to harry his financial and mining operations."}, {"tag": "p", "text": "After Pryce convinced Ghadi that Higher Skies was not targeting him specifically, he tasked her with spying on Higher Skies and providing information from the organization to him. To ensure Pryce's compliance, Ghadi threatened to frame Pryce for stealing confidential files and data cards. Ghadi then revealed that Ottlis was his double agent and had been keeping him informed about her the whole time. Ottlis drove Pryce back to her home in an airspeeder and the two did not speak for the duration of the trip."}, {"tag": "h3", "text": "Ghadi's gamble"}, {"tag": "p", "text": "In despair, Pryce turned to the Chiss Imperial officer Commander Thrawn for help. Thrawn convinced her to be ready to turn on her Higher Skies colleagues in order to receive protection from Imperial Security Bureau Colonel Wullf Yularen. After stealing data from Higher Skies including files related to Grand Moff Wilhuff Tarkin, Pryce met with Moff Ghadi and offered to provide him with information about Tarkin, knowing of Ghadi's rivalry with the Grand Moff."}, {"tag": "p", "text": "Seeking an opportunity to blackmail Tarkin, Ghadi ordered Pryce to download Tarkin's data into a data card and to pass it to Ottlis at a Whitehawk Tower address. He instructed Pryce to pass the card only to him. Pryce complied with Ghadi's instructions. However, she then turned the tables on both Higher Skies and Ghadi by revealing the former's espionage activities to Grand Moff Tarkin and the latter's willingness to use the stolen data against Tarkin. This led to the arrest of Higher Skies' members, Juahir, and presumably Moff Ghadi. Ottlis' fate is unknown."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ottlis Dos was a human man with brown hair and blue eyes. Besides being a skilled fighter, Ottlis was also a smooth talker who managed to gain Arihnda Pryce's trust. He then betrayed her to his employer Moff Ghadi, who force Pryce to serve as his unwilling double agent. Pryce however turned the tables on Ghadi by exposing his opportunism to his rival Grand Moff Tarkin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ottlis Dos first appeared in Timothy Zahn's 2017 canon novel Thrawn. He was first illustrated in the Marvel Comics Thrawn 3, a comic adaptation of the novel which debuted on April 11, 2018. Ottlis was drawn by Luke Ross and colored by Nolan Woodard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}