{"url": "Attack_on_Porso_Hill", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Invasion of Naboo"], "nodes": [{"tag": "h1", "text": "Attack on Porso Hill"}, {"tag": "p", "text": "This attack occurred after the Trade Federation invaded Naboo in 32 BBY, when the Royal Naboo Security Forces were in desperate need of allies. Captain Kael and Lieutenant Gavyn Sykes of the Security Forces had joined together with Borvo the Hutt, who betrayed them and killed Kael. The Hutt planned to sell as slaves the Naboo civilians that Kael and Sykes had previously rescued from the Federation. Sykes and fellow Bravo Squadron pilots Vedd Deviss and Lutin Hollis, flying N-1 starfighters, split up and pursued the Hutt to his base on Porso Hill. Deviss saw the Hutt heading to Porso Hill and informed Sykes, who moved ahead and began his attack. After fighting through opposing starfighters, Sykes joined with the mercenary Kol Kotha, who led the Naboo pilot to Porso Hill but withdrew after receiving damage to his starfighter. Sykes engaged the Hutt's personal transport while his newly-arrived wingmen provided cover and forced the Hutt to flee."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The alliance between the Naboo pilots of Bravo Squadron and Hutt smuggler Borvo during the Invasion of Naboo in the year 32 BBY had proven fruitful. The Naboo resistance fighters were able to mount an offensive attack against the Trade Federation, and with Borvo's help, they liberated Trade Federation slave camps. However, Borvo kept the alliance only as long as he could profit from it; he eventually betrayed the resistance, killing the flight leader, Captain Kael, and taking the prisoners to sell as slaves. As a result, he gained the ire of Lieutenant Gavyn Sykes, who was driven to avenge his captain and rescue his people. Sykes and two wingmen, Vedd Deviss and Lutin Hollis, flying N-1 starfighters, located the Hutt on Porso Hill and flew to stop him."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Infiltration"}, {"tag": "p", "text": "As Sykes approached Borvo's location on Porso Hill, he was hailed by one of the Hutt's starfighters, warning him to stay away, but Sykes refused to comply with the demand. The Hutt's fighters subsequently attacked him, and he shot them down while avoiding their fire and that from laser turrets. After Sykes eliminated that threat, he destroyed a wall of mines blocking his path. Kol Kotha, one of the Hutt's mercenaries and Sykes' former wingmate, approached directly in front of Sykes, asking the Naboo pilot not to fire on him in order to give him the chance to explain that he wanted to help. Sykes cautiously accepted his help, telling Kotha to lead him to the Hutt. The two flew onward, taking fire from more turrets. Kotha led Sykes to the Hutt but had to retreat, having suffered damage to his starfighter and a weapons malfunction."}, {"tag": "p", "text": "Along the way, Sykes spotted homing torpedo technology that could potentially be used by the Naboo resistance. Blowing away the surrounding trees, he was able to acquire the valuable technology."}, {"tag": "h3", "text": "Porso Hill"}, {"tag": "p", "text": "As Sykes flew in to meet the Hutt, Borvo launched his freighter. Adela Tyché, the freighter's pilot, contacted Sykes and translated Borvo's words, which was to offer the Naboo pilot a bribe to join Borvo. When Sykes refused, the rest of the Hutt fighters launched to defend the freighter as Deviss and Hollis arrived to reinforce Sykes. Sykes ordered them to attack the freighter while he provided cover, but the two were out of torpedoes. Sykes instead proceeded to attack the freighter himself while the other pilots provided cover. Despite fire from turrets, Sykes delivered heavy damage to Borvo's ship; as it exploded, the cockpit separated, sending Borvo and Tyché flying away in retreat."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "When Borvo fled in the freighter's cockpit, the remaining Hutt pilots ran with it and the Naboo pilots cut off the chase. Kotha rejoined the Naboo pilots and congratulated Sykes on sending Borvo back to Nal Hutta, the Hutt's homeworld. With this threat gone, Sykes wanted to return to fighting the Federation, but he felt that the Resistance needed more pilots. Kotha mentioned that, while serving Borvo, he had scouted Trade Federation camps which the pilots could liberate, and the quartet went on to achieve that objective."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle appears in the 2000 video game Star Wars: Episode I: Battle for Naboo. Hidden in the level is the Homing Torpedo upgrade; picking it up fulfills the bonus objective. The ending cinematic reflects how many Hutt starfighters are seen fleeing with Borvo, depending on how many are shot down in the second part of the level."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}