{"url": "Outer_Rim_Territories", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Outer Rim Territories", "Category:Regions"], "nodes": [{"tag": "h1", "text": "Outer Rim Territories"}, {"tag": "p", "text": "The Outer Rim Territories, also known as the Outer Rim, Outer Systems, Lesser Space, or simply the Rim, was a sparsely populated region of the galaxy located outside the Mid Rim before Wild Space and the Unknown Regions. The largest region in the galaxy, it was home to diverse worlds and rugged, primitive frontier planets."}, {"tag": "p", "text": "Inequalities between the richer Core Worlds and the poorer Outer Rim Territories set the stage for resentments that fed several conflicts through the history of the galaxy, including the Clone Wars and the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Days of the Old Republic"}, {"tag": "p", "text": "With the formation of the Galactic Republic and the bustling Core planet of Coruscant being homeworld to the pioneering human species, galactic expansion occurred along trailblazing new hyperspace routes emanating outwards from the Core Worlds, with colonists heading towards the Outer Rim in search of opportunities and a better life. Owing to economic and legal restrictions, coupled with political repression, many chose to live beyond the civilizing grasp of the Core. Navigational beacons set up by Republic survey teams such as in the Tertiary Usaita system aided travelers heading towards the galactic periphery."}, {"tag": "p", "text": "Eventually, tensions arose between the Republic and its Jedi allies over the warrior culture of the Outer Rim world of Mandalore, leading to a destructive conflict that ultimately saw the theft of the Darksaber from the Jedi Temple. While the Sith eventually collapsed from continuous infighting, Darth Bane secretly survived and enacted the Rule of Two, while he and other Sith Lords were buried in the Valley of the Dark Lords on Moraband."}, {"tag": "h3", "text": "Republic Era"}, {"tag": "h4", "text": "Height of the Republic"}, {"tag": "p", "text": "The Galactic Republic remained one of the dominant galactic powers of the millennium. Though eventually trade and galactic commerce boomed between the Core and Outer Rim Territories, the Outer Rim was difficult to navigate and dangerous during the High Republic Era. Still, the current Supreme Chancellor, Lina Soh, sought to bring these outer worlds into the Republic and established outreach programs to do so. She also requested the Jedi Order expand its outreach as well, and Senator Izzet Noor of Serenno voiced the needs of the majority of the Outer Rim in the Galactic Senate. Traveling to the Outer Rim through hyperspace aboard transport ships like the Legacy Run, many settlers left the overpopulated Core and Colonies to make new lives for themselves, hoping to earn credits and make a future."}, {"tag": "p", "text": "Part of the Outer Rim became known as the Galactic Frontier, which was also home to a guiding station known as Starlight Beacon. Even as Starlight was being constructed, the Outer Rim was considered a place of challenges; these challenges proved to be more deadly than exciting. Republic Judicial Forces and the Jedi Order enforced order throughout the galaxy, preventing a major galactic war for centuries. During the High Republic Era, the Republic Defense Coalition also helped patrol the Rim. Following the Great Hyperspace Disaster, the Outer Rim was effected by the Emergences, forcing Soh to blockade hyperspace routes into the Rim, which impacted many worlds in the region."}, {"tag": "h4", "text": "Fall of the Republic"}, {"tag": "p", "text": "Several years before the Clone Wars, those in the Outer Rim eventually came to believe themselves victims of economic and social injustices, as Judicials were often withheld in intervening in Outer Rim affairs after many far-flung worlds refused to provide the Core with profitable deals. Harassed by numerous pirates and lacking protection from a federal military, the Outer Rim world of Eriadu formed the Outland Regions Security Force for the protection of the Seswenna sector. Funded by off-world loans and composed of an amalgam of ships, it received weapons from arms merchants who had for centuries been ignoring a Republic ban on the sale of weapons to member worlds. Initially lacking major success, it came to the forefront after Wilhuff Tarkin joined its anti-piracy task force, in which he was able to significantly reduce pirate raids throughout neighboring systems."}, {"tag": "p", "text": "With the monolithic Trade Federation slowly encroaching on the Outer Rim and the perceived weakness of Supreme Chancellor Finis Valorum, who was already embroiled in numerous scandals and unable to bring the growing corruption in the Galactic Senate under control, Governor Tarkin of Eriadu turned Valorum from investigating a trade summit in an effort to weaken his authority. Ending in a disaster, the summit hastened the Trade Federation's Invasion of Naboo over the recently proposed the taxation of the Free Trade Zones and disputes over plasma exports."}, {"tag": "p", "text": "With increasing dissatisfaction over years of neglect from the Core Worlds, dashing political idealist Count Dooku managed to foment political turmoil on worlds such as Kashyyyk, Sullust and Onderon. He eventually hijacked a HoloNet station in the Raxus system to voice his opinion. This precipitated the Separatist Crisis, which would see thousands of worlds leave the Galactic Republic and join the growing Confederacy of Independent Systems."}, {"tag": "p", "text": "After the First Battle of Geonosis, the deadly three-year Clone Wars engulfed the galaxy and resulted in billions dead on both sides of the conflict. The Republic was forced to raise the Grand Army of the Republic to combat the Separatist threat, with the war finally ending following the Outer Rim Sieges and the death of the Separatist Council on Mustafar. Meanwhile, Chancellor Palpatine transformed the Republic into the First Galactic Empire, wiping away the thousand-year-old democracy—and the Jedi Order—in an instant."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "The budding Galactic Empire increasingly attempted to take control of the Outer Rim, although many worlds never fully fell under the Empire's sway, and were instead controlled by unsavory criminal organizations like the Hutt Cartel, the Pyke Syndicate, the Black Sun, or Zygerrian slavers. Believing control of the galaxy's outer systems would stabilize and secure the galactic center, Galactic Emperor Palpatine oversaw the buildup of the Imperial Military and ruthless quashing of dissent and remaining Separatist holdouts across the Outer Rim. Worlds such as Jelucan and Lothal saw Imperial occupation and development, often leading to rampant pollution and industrialization to support the Imperial war machine, while men and women were conscripted into the Imperial Army and Navy. A \"five-year plan\" was implemented for numerous Imperial-occupied worlds under the supervision of the Imperial Outer Rim High Command. In the farthest reaches of the Outer Rim, the Empire barely bothered to patrol its territory, and local citizens' militias took it upon themselves to protect friendly convoys."}, {"tag": "p", "text": "The Empire was never able to fully control the Outer Rim, but often utilized its worlds as testing grounds for new biological weapons and as a source of labor, brutally wiping out the Lasat species of the Outer Rim world of Lasan, exploiting the native Twi'lek species of Ryloth by rounding up native villagers for slave labor, and murdering nearly all the Geonosians."}, {"tag": "p", "text": "Seeking to embody the spirit of the Tarkin Doctrine, the Empire oversaw the construction of the first Death Star over Geonosis and exterminated the native Geonosian population. Grand Moff Tarkin was tasked with imposing order in the Outer Rim Territories, being promoted to Governor of the Outer Rim. After limiting the HoloNet of various Outer Rim worlds to Imperial use five years after the formation of the New Order, many dissatisfied systems viewed the embargo as the unofficial start of the Imperial conquest of the Outer Systems."}, {"tag": "p", "text": "In 10 BBY, Han Solo, Chewbacca, Qi'ra, Tobias Beckett, and the droid L3-37 disrupted a Pyke Syndicate spice mining operation on Kessel during a mission to acquire coaxium for the Crimson Dawn crime lord Dryden Vos. While fleeing Imperial forces, Solo managed to make the Kessel Run aboard the Millennium Falcon in less than thirteen parsecs, beating previous records. Later, Solo, Qi'ra, and Chewbacca joined forces with Enfys Nest's Cloud-Riders to defeat Vos' Pyke Syndicate forces on Savareen. Vos and Beckett also met their ends at the hands of Qi'ra and Solo respectively."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Imperial Era, several rebel cells emerged throughout the Outer Rim, including Hera Syndulla's Spectres, the Phoenix Cell, and General Jan Dodonna's Massassi Group. Following the suppression of the Batonn insurgency, Grand Admiral Thrawn was tasked with eliminating rebel forces in the Lothal sector. Despite inflicting heavy casualties on rebel forces during the Battle of Atollon, the Spectres and Lothal resistance group succeeded in liberating the planet Lothal from Imperial rule."}, {"tag": "p", "text": "By 2 BBY, various rebel cells had coalesced into the Alliance to Restore the Republic under the leadership of Mon Mothma in response to the Ghorman Massacre. This rebel network posed a major threat to the Imperial Ruling Council[source?] and established bases on the worlds of Dantooine and Yavin 4. The Rebellion won its first victory against the Galactic Empire at the Battle of Scarif, which resulted in the theft of the Death Star plans."}, {"tag": "p", "text": "After the Emperor dissolved of the Imperial Senate, regional governors were given direct control over their territories. Luke Skywalker, who hailed from Tatooine, ultimately destroyed the Empire's planet-killing battle station at the Battle of Yavin."}, {"tag": "p", "text": "The Outer Rim Territories became embroiled in the Galactic Civil War, with the Alliance Fleet dispersed across the region and the Empire fortifying the border of the Mid Rim against the lawlessness of the outlying systems. Due to its distance from the Core, unauthorized holofeeds operated in abundance in the Outer Rim, owing in part to the Empire's tentative control of the region. During this time, the Empire launched a crackdown on the Outer Rim to eliminate criminal syndicates save for those allied with the Empire, such as the Hutts, who Darth Vader had negotiated with for resources. This included an attack on the the Cymorah sydicate which had been stealing from the Empire. Vader led forces to attack a station which resulted in its destruction. Son-tuul Pride base which was led by Vader and resulted in the seizure of the base and credit hoards from the group as well as the death of the leader, Yonak's father. The Son-tuul-Pride would later be briefly reorganized under 0-0-0 before dissolved after the Empire later launched another attack led by Lieutenant-Inspector Magna Tolvan that decimated them. Many of the Empire's funding was going towards the construction of Super Star Destroyers. Some of it also helped enrich the Hutts although this was simply a side effect. A lot of crime events took place in the Anthan system which led to fighting between criminals and the Empire. After the Son-tuul robbery Vader and Thanoth worked their to find those responsible, although Vader was secretly responsible so he worked to cover it up. On Anthan Prime there was a droid fighting den and the Empire raided it where Vader and Inspector Thanoth captured Doowan who gave them the location the Dragons den on Anthan 13 where Vader killed him. They used his data to find the Ante who was a major figure who sold information. Vader and Thanoth led a raid which resulted in the death of the Ante. Vader and Thanoth later attacked a rebel group on Anthan 1 and destroyed them."}, {"tag": "p", "text": "After the Mid Rim Retreat, the Empire discovered the Rebellion's new base on Hoth, destroying it in the Battle of Hoth and splintering the Rebellion into fragments spread across the Outer Rim. Following Operation Ringbreaker, roughly six months after the Battle of Hoth, Operation Yellow Moon allowed the scattered Rebel Fleet to converge over Sullust to strike on the Empire's new Death Star under construction over Endor. Its destruction in the Battle of Endor, as well as the deaths of the Emperor and Darth Vader, saw the fragmentation of Imperial authority, resulting in the gradual retreat of Imperial dominion from the Outer Rim."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "The New Republic, the government formed by the Rebel Alliance, admitted Akiva as the first Outer Rim world to formally join the Republic in the months after Endor. By 5 ABY, the Empire had lost control of much of the Outer Rim with the exception of Zhadalene, Korrus, and Belladoon.  Many crime groups took advantage of this chaos to rise. Under the orders of Fleet Admiral Gallius Rax, the Empire nationalized the Imperial weapons and vehicular factories there for the war effort. In coordination with Imperial fleets hidden in the Vulpinus Nebula, the Almagest, the Recluse's Nebula, the Queluhan Nebula, the Ro-Loo Triangle, and the Inamorata, Rax planned to use the three Outer Rim holdouts as a cord to strangle the New Republic. Shortly before the Battle of Jakku, Princess Leia Organa reported that Tatooine and Horuz were in the thrall of some Imperial remnant, criminal syndicates or gangsters. The Red Key Raiders tried to take over Tatooine but were opposed by Cobb Vanth, the elusive Mayor and Sheriff of Freetown."}, {"tag": "p", "text": "The Empire made a final attempt at a counter-offensive one year after Endor, but was defeated at the Battle of Jakku by the New Republic. The Empire was pushed back to a handful of sectors in the fringe of the Outer Rim, and although they only contained a small fraction of the galaxy's population and industrial base, they were nevertheless a heavily fortified final redoubt. As a result, the New Republic deemed that they posed too minor of a threat to justify the high cost in life that liberating them would require, and the Empire surrendered to the the New Republic and signed a treaty ending the war. The Republic then began arriving in the remaining Imperial sectors to announce the signing of the treaty."}, {"tag": "p", "text": "After the Battle of Jakku, the Outer Rim was very lawless as the New Republic didn't do much to control it. Due to this it was common a place for Imperial remnants like Moff Gideon's to hide, with bases on planets like Nevarro. The world of Tatooine had changed very much by 9ABY. It was much less populated and the Mos Eisley cantina formerly known for not allowing droids was now run by a droid and the Bounty Hunter's Guild no longer operated there.[source?]"}, {"tag": "p", "text": "In 28 ABY, New Republic member worlds included Arkanis and Daxam IV, which were aligned with the Centrist faction in the Galactic Senate on Hosnian Prime. The Outer Rim planet Ryloth chose not to join the new galactic government. The planet Pamarthe was known for producing pilots."}, {"tag": "p", "text": "The New Republic took steps to control organized crime by introducing new financial regulations and patrolling the major shipping lines. However, organized crime later returned to the Gaulus sector and adversely affected the economy of Ryloth due to the indecisiveness of the Galactic Senate. One major crime syndicate was the Nikto crime lord Rinnrivin Di's cartel, which was based on Bastatha. Rinnrivin's smuggling activities took a toll on Ryloth's economy and precipitated a New Republic senatorial investigation led by Organa and Ransolm Casterfo. In truth, Rinnrivin's cartel was a criminal front organization set up by several Centrist senators including Lady Carise Sindian to bankroll the Amaxine warriors and the First Order's fleet. The planet Daxam IV was the site of an Amaxine base which housed a thousand Amaxine warriors. The Amaxines were a militia that was led by former Imperial officers like Arliz Hadrassian, who admired the Old Empire and sought to overthrow the New Republic. The organization was largely destroyed when an explosion destroyed their main base on the Expansion Region world of Sibensko."}, {"tag": "p", "text": "During the Cold War, the planet D'Qar in the Ileenium system hosted the Resistance's base of operations. Shortly before the attack on Tuanul, the First Order operated a mining operation in Pressy's Tumble, an artificial asteroid field in the Pressylla system. The former stormtrooper Finn and his commanding officer Captain Phasma took part in suppressing a strike at Pressy's Tumble."}, {"tag": "h3", "text": "Rise of the First Order"}, {"tag": "p", "text": "Following the Hosnian Cataclysm and the Battle of Takodana, the First Order tried to destroy D'Qar with its Starkiller Base superweapon. However, the Resistance destroyed Starkiller Base before it could fire its superlaser."}, {"tag": "p", "text": "Before the Resistance could complete their evacuation of D'Qar, they were attacked by the First Order Navy. Despite destroying a Mandator IV-class Siege Dreadnought, the Resistance lost several bombers and starfighters. Fleeing through hyperspace, they were pursued by the First Order Navy including Supreme Leader Snoke's flagship Supremacy, which was equipped with a hyperspace tracker. The Resistance operatives Finn and Rose Tico traveled to the planet Cantonica to recruit the Master Codebreaker to disable the First Order's hyperspace tracker. However, their mission went awry, and they were only able to recruit the criminal slicer DJ."}, {"tag": "p", "text": "After abandoning the Resistance flagship Raddus, the Resistance evacuated in U-55 orbital loadlifters to the planet Crait. However, the Resistance were betrayed by DJ, who revealed the Resistance's plans to the First Order. Despite sustaining heavy casualties, five of the Resistance loadlifters managed to regroup on Crait due to Vice Admiral Amilyn Holdo ramming the Supremacy with the Raddus. After killing Snoke, Kylo Ren claimed the mantle of Supreme Leader and led an assault against the Resistance on Crait. However, the Resistance escaped offworld due to Luke Skywalker's final stand with Ren."}, {"tag": "p", "text": "By 35 ABY,[source?] the Resistance had established a new base on the Outer Rim world of Ajan Kloss. That same year, Supreme Leader Kylo Ren led a raid against Alazmec colonists on the volcanic world of Mustafar in order to obtain a Sith wayfinder, which led him to the hidden Sith world of Exegol where he formed an alliance with the resurrected Emperor Palpatine's Final Order, who had ruled the First Order from behind the scenes through his puppet Snoke. The Emperor offered Ren an alliance with the First Order in return for hunting down his granddaughter Rey."}, {"tag": "p", "text": "During their quest for the second Sith wayfinder, Rey, Finn, Poe, Chewbacca, C-3PO, R2-D2, and D-O traveled to the moon Kef Bir in the Endor system, which was the site of the Death Star ruins. They also encountered members of the First Order stormtrooper unit Company 77 led by Jannah, who had deserted after refusing to shoot civilians. Though Kylo Ren destroyed the second Sith wayfinder during a duel at the Death Star ruins, his mother Princess Leia gave her life to bring him back to the light side. After being healed by Rey and communing with a memory of his later father Han Solo, Ren embraced his former identity of Ben Solo and rejected the dark side."}, {"tag": "p", "text": "Following the death of General Organa, Ajan Kloss served as a staging point for a Resistance  assault on the Emperor's forces on Exegol. After the defeat of the Emperor, uprisings broke out against the First Order on the Outer Rim worlds of Bespin and Endor. Later, Rey, who had rejected her Sith lineage and embraced the Skywalker family, traveled to the Lars homestead on Tatooine where she buried the Skywalker and Leia's lightsabers."}, {"tag": "h2", "text": "Government"}, {"tag": "p", "text": "Due to its distance from the Core Worlds, the Outer Rim lacked a stable, central authority to maintain order across the vast expanses of space in the region throughout its history. By the High Republic Era, it was considered a haven for all who wanted to avoid Republic law, becoming a region filled with anti-Republic individuals even as Chancellor Lina Soh wanted to bring the Republic into it. Numerous crime families such as the Hutt Clan and Pyke Syndicate operated with impunity in the region, with slavery being common despite a Republic ban on its practice."}, {"tag": "p", "text": "As a result, several planets remained neutral and unaligned during the era of the Republic, such as Dathomir, Nal Hutta and Zygerria. Mandalore was nominally associated with the Galactic Republic, but was not part of it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}