{"url": "Outbound_Flight_(novel)", "categories": ["Category:Real-world articles", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "Outbound Flight (novel)"}, {"tag": "p", "text": "Outbound Flight is a Star Wars Legends novel from author Timothy Zahn that tells the story of the ill-fated Outbound Flight Project, which was originally mentioned in Zahn's 1991 novel, Heir to the Empire. Outbound Flight was first published by Del Rey in hardcover on January 31, 2006. The first paperback edition was released on January 30, 2007 and includes the short story \"Mist Encounter\" by Zahn."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Hardcover"}, {"tag": "h4", "text": "Back cover"}, {"tag": "p", "text": "On an epic voyage far beyond the Republic, the Jedi will confront their most extraordinary enemy—and test the limits of honor and sacrifice against their most devastating challenge…."}, {"tag": "h4", "text": "Internal flap"}, {"tag": "p", "text": "It began as the ultimate voyage of discovery—only to become the stuff of lost Republic legend…and a dark chapter in Jedi history. Now, at last, acclaimed author Timothy Zahn returns to tell the whole extraordinary story of the remarkable—and doomed—Outbound Flight Project."}, {"tag": "p", "text": "The Clone Wars have yet to erupt when Jedi Master Jorus C'baoth petitions the Senate for support of a singularly ambitious undertaking. Six Jedi Masters, twelve Jedi Knights, and fifty thousand men, women, and children will embark—aboard a gargantuan vessel, equipped for years of travel—on a mission to contact intelligent life and colonize undiscovered worlds beyond the known galaxy. The government bureaucracy threatens to scuttle the expedition before it can even start—until Master C'baoth foils a murderous conspiracy plot, winning him the political capital he needs to set in motion the dream of Outbound Flight."}, {"tag": "p", "text": "Or so it would seem. For unknown to the famed Jedi Master, the successful launch of the mission is secretly being orchestrated by an unlikely ally: the evil Sith Lord, Darth Sidious, who has his own reasons for wanting Outbound Flight to move forward… and, ultimately, to fail."}, {"tag": "p", "text": "Yet Darth Sidious is not the mission's most dangerous challenge. Once underway, the starship crosses paths at the edge of Unknown Space with the forces of the alien Chiss Ascendancy and the brilliant mastermind best known as \"Thrawn.\" Even Jedi Knight Obi-Wan Kenobi, aboard Outbound Flight with his young Padawan student, Anakin Skywalker, cannot help avert disaster. Thus what begins as a peaceful Jedi mission is violently transformed into an all-out war for survival against staggering odds—and the most diabolical of adversaries."}, {"tag": "p", "text": "Timothy Zahn's unique mix of espionage, political gamesmanship, and deadly interstellar combat breathes electrifying life into a Star Wars legend."}, {"tag": "h3", "text": "Paperback"}, {"tag": "p", "text": "It began as the ultimate voyage of discovery, only to become a dark chapter in Jedi history. Now acclaimed author Timothy Zahn returns to tell the whole extraordinary story of the remarkable—and doomed—Outbound Flight Project."}, {"tag": "p", "text": "The Clone Wars have yet to erupt when Jedi Master Jorus C'baoth petitions the Senate for support of an ambitious mission: to contact intelligent life and colonize undiscovered worlds beyond the known galaxy. But the government bureaucracy threatens to scuttle the expedition before it can even start—until Master C'baoth foils a murderous conspiracy plot, winning him the political capital he needs to set in motion the dream of Outbound Flight."}, {"tag": "p", "text": "Or so it would seem. The evil Sith Lord Darth Sidious has his own interests in Outbound Flight. Yet even he is not the mission's most dangerous challenge. Once underway, the starship crosses paths with the forces of the alien Chiss Ascendancy and the brilliant mastermind known as \"Thrawn.\" Thus what begins as a peaceful Jedi mission is violently transformed into an all-out war for survival."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Five years after the Battle of Naboo, a smuggler's freighter, the Bargain Hunter is fleeing trouble with its crew of three: Captain Dubrak \"Rak\" Qennto, Maris Ferasi and a very young Jorj Car'das. They are on the run from Progga the Hutt, and to escape, Car'das punches in random hyperspace coordinates that send the ship into the Unknown Regions."}, {"tag": "p", "text": "Progga's ship manages to follow them, and Progga calls the Hunter on the comm, believing that they've made an intentional jump to a secret cache of treasure, and they're going to lead him to it. Before anything else can happen, the Hunter is captured by a flotilla of unknown ships. Progga's ship, though larger and more heavily armed and armored than any one of the unknown ships, is utterly destroyed when he tries to fight back."}, {"tag": "p", "text": "Aboard the flagship, the smugglers are introduced to Commander Mitth'raw'nuruodo of the Chiss Ascendancy Fleet, who generously offers to repair their ship and and send them on their way, provided they can bear with him and be his guests during the flotilla's patrol cruise deeper into the Regions."}, {"tag": "p", "text": "The story then shifts to Coruscant, where Jedi Master Jorus C'baoth and his Padawan, Lorana Jinzler, interrupt a meeting between Supreme Chancellor Palpatine and his aide, Kinman Doriana. Yet again, C'baoth demands more funding for his proposed Outbound Flight Project, insisting that its importance outweighs any of the other petty problems the Republic is facing. Doriana suggests a compromise: if C'baoth can resolve a mining strike on the planet Barlok, it will free up enough immediate funds to finish the project. After C'baoth and Lorana leave, Palpatine orders his aide to keep an eye on C'baoth, to make sure that his well-known arrogance doesn't cause him to do something foolish."}, {"tag": "p", "text": "On returning to his apartment to pack, Doriana makes a call to his real master, Darth Sidious, who has already ordered him to prepare to travel to Barlok."}, {"tag": "p", "text": "After C'baoth demands, and receives, permission from the Jedi Council to travel to Barlok, Master Mace Windu orders Obi-Wan Kenobi and his Padawan, Anakin Skywalker, to Barlok for the same reason: to keep an eye on C'baoth."}, {"tag": "p", "text": "Back in the Unknown Regions, Commander Mitth'raw'nuruodo is taking the opportunity to learn more from his guests, teaching them his language, and vice-versa. When he says that the Chiss have a low view of smugglers, Maris objects that they are actually privateers - mercenaries employed to steal supplies and food for oppressed peoples - a somewhat fanciful lie that Qennto sold Maris on a while ago. Qennto privately regards the alien Commander as a naif, but Car'das is quick to discern that Mitth'raw'nuruodo is actually very cunning and dangerous. The young officer sees something similar in Car'das, and the two begin spending so much time together that the Commander allows Car'das to call him by his \"core name,\" Thrawn."}, {"tag": "p", "text": "In an unexpected skirmish with one of the Chiss's most deadly enemies, the Vagaari, Thrawn is badly wounded, though the battle goes in their favor. The flotilla limps home, and the three smugglers are introduced to Thrawn's brother, Thrass, a political official of some importance, and Admiral Ar'alani of the Chiss Expansionary Defense Force."}, {"tag": "p", "text": "On Barlok, C'baoth and Lorana meet up with Obi-Wan and Anakin. C'baoth leaves Lorana with the other two Jedi while C'baoth goes to arrange the negotiations to resolve the mining dispute. In his absence, the other three Jedi, through a series of chance encounters, discover a plot to sabotage the negotiations by some disgruntled workers (egged on by a disguised Doriana). When the negotiations start, the saboteurs launch a missile that only C'baoth is powerful enough in the Force to stop. Seeing his power, the council members are scared enough to quickly resolve the conflict."}, {"tag": "p", "text": "Between the sudden cash flow caused by the mining resolution, and his new prestige as a Jedi hero, C'baoth quickly receives the necessary funds to finish Outbound Flight, and immediately begins organizing a group of Jedi Masters and Knights, and civilian colonists to travel to the Unknown Regions."}, {"tag": "p", "text": "Lorana is ambivalent about whether she wants to leave her home behind, but while walking around the Jedi Temple, she is confronted by one of the workers, whom she has caught staring at her. It turns out that he is Dean Jinzler, her brother. As she was taken from her family as a baby like all Padawans, she never had the chance to know him, but she is shocked and hurt when he vents his jealousy of her. Dean believes that their parents always overlooked him because of her, simply because of the \"accident\" of her being a Force-sensitive. When he turns his back on her and walks away, Lorana decides that she has nothing in this galaxy worth staying for, and can't wait to leave on Outbound Flight. Before leaving, C'baoth asks for, and receives, permission to promote her to Jedi Knight."}, {"tag": "p", "text": "Obi-Wan and Anakin also agree to accompany the voyage for at least part of the way."}, {"tag": "p", "text": "When the titanic vessel is finally launched into space for its long journey toward the outside of the galaxy, Doriana checks the crew and passenger manifest and informs Darth Sidious. Sidious is pleased at first, but becomes enraged when he learns that Anakin is aboard, and orders Doriana to get him off the vessel immediately. Then he reconsiders, saying he will do so himself, while Doriana departs for his main mission."}, {"tag": "p", "text": "Doriana, under the alias \"Commander Stratis,\" rendezvous with Trade Federation Vicelord Siv Kav, commanding a battle fleet powerful enough to destroy Outbound Flight, waiting at the edge of the galaxy."}, {"tag": "p", "text": "Aboard Outbound Flight, C'baoth appears to be taking the opportunity to transform his ship into his own personal vision of what he believes the Jedi Order, and by extension, the entire galaxy, should be. His decisions encompass every aspect of the passengers' lives, right down to the décor of the common rooms. Additionally, he orders that the colonists' children be sorted for Force-sensitives, who should immediately be separated from their parents."}, {"tag": "p", "text": "Midway through the voyage, Palpatine meets the vessel personally, saying he has an urgent diplomatic errand for Obi-Wan and Anakin. They depart with the Chancellor, playing no further part in the events to come."}, {"tag": "p", "text": "Meanwhile, the Chiss fleet, under the command of the recovered Thrawn, stumbles on the Trade Federation battle fleet. Though massively outgunned, Thrawn remains calm, and tells the fleet that they are trespassing into Chiss space. Kav arrogantly orders his forces to wipe out the tiny Chiss fleet. With some technical advice from Car'das, coupled with his own innate tactical genius, Thrawn devastates the Trade Federation fleet utterly, leaving Kav no choice but to surrender."}, {"tag": "p", "text": "Seeing an opportunity where the Neimoidian does not, Doriana pleads with Thrawn to let them carry out their original mission, going so far as to initiate a direct conversation between Lord Sidious and Thrawn. Sidious explains that Outbound Flight, and the Jedi, are a grave threat to the Republic – specifically, because Outbound Flight's path will take them directly into the projected home of an immensely powerful and hostile alien empire (though unnamed, the clear implication is that they are the Yuuzhan Vong). Sidious's agents discovered the existence of this empire some years ago, and since then he has been doing his best to prepare the Core Worlds for the invasion he believes is inevitable. If Outbound Flight reaches the aliens first, the invasion may come too soon. Thrawn appears to take Sidious seriously, and agrees to help Doriana and Kav destroy Outbound Flight."}, {"tag": "p", "text": "Car'das, becoming increasingly worried that Thrawn is holding him hostage, escapes the Chiss fleet in a small ship, but is captured by the Vagaari. Car'das shares everything he knows to prevent his own death, and the Vagaari become very interested upon learning about the Trade Federation's battle droid technology – despite their spacefaring capabilities, the Vagaari have almost no droid technology, and the idea of a manufactured army of remote killers is immensely appealing to the aggressive race. The Vagaari commander decides to return to the Trade Federation fleet and take their technology."}, {"tag": "p", "text": "When Outbound Flight finally makes it to the edge of the galaxy, Thrawn, much to Doriana and Kav's consternation, insists on giving the vessel the opportunity to turn back. He meets with C'baoth and Lorana aboard the ship, and warns them that a Sith Lord is planning to destroy them. But in his arrogance, C'baoth disregards Thrawn's warnings and sends him back to his ship."}, {"tag": "p", "text": "As the two sides prepare for battle, the Vagaari arrive. Sensing their hostility, the Jedi aboard Outbound Flight band together in a telepathic link to confuse the Vagaari. But Thrawn takes advantage of their distraction to open fire on both hostile forces. After severe damage has been inflicted on the vessel, C'baoth gives in entirely to his rage and falls to the dark side, choking Thrawn through the Force. Rather than let such a valuable officer be killed, Thrawn's fleet drops a lethal radiation bomb into the vessel's bridge, killing C'baoth and all the other Jedi on board, except Lorana. The Vagaari receive a sound thrashing at Thrawn's hands, and are forced to retreat, but not before Car'das escapes their ship."}, {"tag": "p", "text": "Because Chiss military doctrine is harshly against the use of preemptive strikes, Thrawn is immediately reprimanded by his superiors, and recalled to Chiss space. While he is preparing to return home, Thrass and Car'das investigate the heavily damaged Outbound Flight, and find Lorana. Knowing that the vessel cannot remain intact in space for much longer, Thrass orders Car'das to rejoin Thrawn, while he and Lorana attempt to pilot the vessel to a nearby planet."}, {"tag": "p", "text": "As they near the planet, the vessel begins to roll out of control, meaning the side of the ship where the majority of the survivors are trapped will crash first. Lorana and Thrass, despite their differences, see the choice before them and make it together: they must stay in the ship's command console and steer the ship so that their side crashes instead. They prepare to die together, hoping only that they succeed in saving lives, and Lorana intones, \"May the Force be with us.\""}, {"tag": "p", "text": "Thrawn releases Car'das, Qennto and Maris and reveals to Car'das that he had been feeding his suspicions to send him to the Vagaari, with the intent of luring them to their destruction. Thrawn wishes them well, and then prepares to face his own exile as punishment for his actions."}, {"tag": "p", "text": "Kav insists that Thrawn cannot be allowed to live, since he knows too much about Lord Sidious. Doriana agrees, but, when he and Kav meet face-to-face with Thrawn, realizes that a being as unique and useful as Thrawn must not be killed. Kav, with his wounded pride, then attempts to kill Thrawn himself, but ends up killing himself with a ricochet from his own hold-out blaster."}, {"tag": "p", "text": "Then Thrawn reveals why he believed Sidious: because the Chiss have indeed encountered the aliens the Sith Lord is preparing for, and know even better than Sidious how much of a threat they pose. The Chiss call these aliens the \"Far Outsiders.\" Thrawn then sends Doriana back to his master, confident that they will meet again someday."}, {"tag": "p", "text": "Qennto, Maris, and Car'das depart in their repaired ship, each of them a little richer (financially and figuratively) for their experience, but also uneasy about their unnerving encounter with the master strategist, Thrawn."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Outbound Flight was originally scheduled to be released on October 25, 2005."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}