{"url": "Outrider/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic starships", "Category:Smuggler starships", "Category:YT-2400 light freighters"], "nodes": [{"tag": "h1", "text": "Outrider"}, {"tag": "p", "text": "The Outrider was a heavily modified YT-2400 light freighter used by the brash smuggler Dash Rendar. Rendar held that his ship was almost as well known as the Millennium Falcon."}, {"tag": "h2", "text": "Design and modifications"}, {"tag": "p", "text": "The Outrider started life as a stock Corellian Engineering Corporation YT-2400. Like all the ships in the YT-series, the Outrider featured the trademark saucer-shaped hull, which Rendar reinforced with titanium armor and gave a dark, chrome gleam. The cockpit and main escape pod were attached to the starboard side of the saucer with two bracing arms. The docking hatch and another escape pod were on the port side."}, {"tag": "p", "text": "One of the first modifications Dash made was to replace the original engines with three KonGar KGDefender military-grade ion engines stolen from the advanced engineering department of the Imperial Academy on Corulag. The factory-issue hyperdrive was also replaced with a modified SoroSuub Griffyn/Y2TG hyperdrive, giving the Outrider a Class 0.75 hyperdrive rating. The backup hyperdrive engine had a Class 10 performance. Rendar also improved the Outrider's sensors and added a countermeasure/stealth package. Though these last modifications were highly illegal, they helped him to avoid unnecessary conflicts."}, {"tag": "p", "text": "When Rendar could not avoid combat, the Outrider was more than capable of holding its own. The ship was armed with a pair of Dymek heavy laser cannons, mounted on dorsal and ventral turrets. The standard Corellian 1D servo mounts provided a 180-degree range of fire above and below the ship. These cannons were hand-modified by Rendar to improve both firepower and range, and could be fired from the gunnery wells or from the cockpit. The Outrider was also armed with a pair of forward-firing concussion missile launchers built into the cockpit tube. Each launcher contained a magazine of three missiles."}, {"tag": "p", "text": "The Outrider was customized to be operated by Rendar and/or Leebo. It could carry about 75 metric tons of cargo, in addition to up to four additional passengers. When fully stocked, it could go for two standard months before needing to resupply."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When asked how he acquired his ship, Rendar typically answered, \"Not by clean living.\" The Outrider was a gift from \"Uncle\" Vanya, a Twi'lek crime boss for whom Dash worked during the early days of his mercenary career. Vanya also provided Rendar with a Rodian co-pilot who ended up dying within the first twenty seconds of Rendar's debut mission."}, {"tag": "p", "text": "Rendar immediately began modifying the ship for smuggling duties. Most of the original modifications were done at the Byblos Starport Tower 214 by Rendar and the talented Sullustan engineer Bolabo Hujaan."}, {"tag": "p", "text": "Sometime before the Battle of Yavin 4, the Outrider was smuggling cargo through the Maw when it was ambushed by the Galactic Empire. Rendar and his navigator, Eaden Vrill, were able to escape by using a hyperspace jump, but it blew out the primary and secondary hyperdrive engines. They limped to Tatooine on their ion engines and laid the Outrider in a berth in Mos Eisley to effect repairs. Rendar was able to hire his crew to the holostar Javul Charn to get the required money to pay for repairs."}, {"tag": "p", "text": "Dash and Leebo were infamous in smuggling circles well before they were hired by the Rebel Alliance to smuggle weapons and badly needed supplies to Echo Base on Hoth after the evacuation of Yavin 4. When the Battle of Hoth began, the Outrider was still berthed in Echo Base's hangar. Dash and Leebo barely escaped the base, and had to fly through the Hoth asteroid field in order to escape the orbiting Death Squadron."}, {"tag": "p", "text": "Soon afterwards, the Outrider accompanied the Millennium Falcon in an attempt to rescue Han Solo from the bounty hunter Boba Fett, who had set down for repairs at the Imperial Enclave on the moon of Gall. The Outrider also participated in a battle to secure the Imperial freighter Suprosa, which was carrying the plans for the second Death Star. Rendar also piloted the Outrider during the final conflict with Black Sun leader Prince Xizor over Coruscant. In that battle it appeared that the Outrider was destroyed, and Rendar and Leebo killed, but it was a trick of timing and perspective. Rendar had decided that his time as a Rebel was over. The fate of the Outrider and its captain in later years is unknown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The look of Outrider was designed by Doug Chiang, who also worked on the designs for the Star Wars prequel trilogy films. He was inspired by the design of the Millennium Falcon. Its class of ship was designed for the Special Edition release of the 1977 original film Star Wars: Episode IV A New Hope, and was later adopted and given the name Outrider in the multimedia project Star Wars: Shadows of the Empire, though the latter was released first in 1996."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}