{"url": "Attack_on_Tuanul", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Battles of the Cold War", "Category:Battles of Jakku", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Attack on Tuanul"}, {"tag": "p", "text": "The attack on Tuanul, also known as the Massacre at Tuanul, the Battle of Tuanul, the Assault on Jakku, or as the secret mission to Jakku, was an assault carried out against Tuanul, a spiritual village on the planet Jakku, by the First Order during the Cold War. The assault was led by the dark enforcer Kylo Ren, who had been seeking a map that would lead to the location of the missing Jedi Master Luke Skywalker. As four First Order squadrons from Kylo Ren's forces descended on Tuanul with a force of eighty stormtroopers, the Resistance pilot commander Poe Dameron received the map from the Resistance ally Lor San Tekka. Dameron attempted to flee prior to the assault but his T-70 X-wing starfighter was disabled by the attacking stormtroopers, despite his droid BB-8's warning just before the assault began. Dameron had BB-8 escape the village with the map. Subsequently, Tekka was killed by Kylo Ren, Dameron was captured, and the villagers were killed."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "By 34 ABY, the First Order knew Lor San Tekka was hiding on Jakku with a piece of the map containing the location of Jedi Master Luke Skywalker, whom they wanted to find and destroy. Kylo Ren wanted the map, and so he, Captain Phasma, and a First Order unit of stormtroopers and flametroopers traveled to Tuanul, the village where Tekka lived."}, {"tag": "h2", "text": "The assault"}, {"tag": "p", "text": "The stormtroopers quickly overcame initial resistance of the villagers with few casualties. Meanwhile, at Resistance commander Poe Dameron's urging, BB-8 successfully fled from Tuanul with the map in tow as the pilot joined in the battle. Poe shot and killed several stormtroopers, including FN-2003, whose death was witnessed by fellow trooper FN-2187. 2003's death led to an awakening of his conscience and opened the trooper's eyes to the brutality of the First Order, which would eventually lead him to desert the First Order. Just as FN-2187 began to see this brutality, Kylo Ren's command shuttle landed."}, {"tag": "h3", "text": "Ren's realization"}, {"tag": "p", "text": "The defeated villagers of Tuanul were herded into a large group before Tekka was brought to Ren himself, who requested him to turn over information on the map. Tekka claimed that Ren could not deny the truth that was his own family, causing Ren to slay the old man with his lightsaber after sarcastically telling the latter that he was correct in his claim. In retaliation, Dameron fired on Ren, but the dark warrior caught the blast and subsequently captured the pilot, and figured out that Tekka had given the map to him. Stormtroopers searched Dameron, who was then taken aboard Ren's Resurgent-class Star Destroyer Finalizer for interrogation. Meanwhile, Captain Phasma and her stormtroopers—except for FN-2187—executed the remaining villagers on Ren's orders."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Disillusioned by the brutality of the First Order forces during the attack on Tuanul, FN-2187 decided to defect from the First Order. He freed Dameron from his cell and convinced him to escape together on a stolen TIE/sf space superiority fighter. Their TIE was shot down by the Finalizer's weaponry and crashed landed in Jakku's Goazon Badlands. After being separated from Dameron, Finn encountered BB-8 and the local scavenger Rey. Rey likewise had heard rumors about the attack, and also had distaste for the First Order from their more brutal methods. They were pursued by First Order forces but managed to escape on the Millennium Falcon into space. After encountering Han Solo and Chewbacca, they convinced Solo to help them get BB-8, who was carrying the map, back to the Resistance."}, {"tag": "p", "text": "In large part because of the brutal nature of the attack, it inspired a propaganda poster showcasing Flametroopers of the attack, called \"The Massacre at Tuanul\"."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on Tuanul appears in the 2015 film Star Wars: Episode VII The Force Awakens, the first installment of the Star Wars sequel trilogy."}, {"tag": "p", "text": "In the early iterations of the film, Kylo Ren mentioned his parentage to Lor San Tekka in the film's first scene instead of San Tekka implying it in the aftermath of the attack. This idea was later dropped by director J.J. Abrams, as he didn't wanted to reveal the mystery of Kylo's parents to the audience too soon. On the other hand, the aftermath of the attack was Adam Driver's first scene on the film and he feared to be fired if he accidentally struck Max von Sydow with Ren's lightsaber as he couldn't see clearly with his mask. He ultimately avoided whacking von Sydow by good luck."}, {"tag": "p", "text": "The scene with Poe Dameron and BB-8 along his X-wing were filmed in the studio backlot using the full-sized vehicle. Abrams and the filming crew used the death of FN-2003 to show that stormtroopers were humans and not robots."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}