{"url": "Outrunner", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Freighters", "Category:Smuggler starships"], "nodes": [{"tag": "h1", "text": "Outrunner"}, {"tag": "p", "text": "The Outrunner was a freighter purchased by Dash Rendar with the profits from his career as a freelance pilot, smuggler, and mercenary. The black ship was heavily armed with both laser turrets and proton torpedo launchers, and could be powered up quickly to enable a rapid escape. Rendar used the Outrunner to disable the luxury liner Star of Empire after the crew abandoned ship when the liner's artificial intelligence, SIM, seized control of the vessel."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Outrunner was a sleek black starship that functioned as a small freighter. The ship was so streamlined that the Human boy Zak Arranda thought it resembled a missile about to be fired. The Outrunner's systems could be brought online quickly, allowing for quick getaways. The vessel was armed with multiple laser turrets—at least one of which was a turbolaser, which could be retracted into a hole in the ship's hull—and forward-facing proton torpedo launchers. The ship could be operated by a single pilot."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point prior to late 0 ABY, the freelance spacer Dash Rendar purchased the Outrunner using the profits from his early career. He went on to use the ship to escape from several difficult situations. Approximately one year after the Battle of Yavin, Rendar, traveling under a false name, took the Outrunner aboard the Haj Shipping Lines luxury liner Star of Empire with the intention of stealing the vessel and selling it to the Rebel Alliance to be converted into a warship. While Rendar was aboard, the Star of Empire's artificial intelligence, SIM, seized control of the vessel, causing most of the passengers and crew to abandon ship. Trapped aboard with the children Zak and Tash Arranda and their uncle Mammon Hoole, Rendar attempted to regain control of the ship, only to come under frequent attack from SIM and the ship's droid complement. Rendar, Hoole, and the Arrandas eventually made their way to the hangar, where both the Outrunner and Hoole's ship, the Shroud, were docked. Rendar quickly powered up the Outrunner and used its turbolaser to blast a hole in the hangar doors, allowing both ships to escape the liner. Rendar used the Outrunner's weapons to disable the Star of Empire's engines before contacting the Alliance to arrange the sale of the crippled liner."}, {"tag": "h2", "text": "Owners and operators"}, {"tag": "p", "text": "The Outrunner was owned by the freelance pilot, smuggler, and mercenary Dash Rendar. Born to a wealthy Corellian family, Rendar studied at the Imperial Academy on Carida until his brother crashed a freighter into the Imperial Museum. Expelled and banished by the vengeful Emperor Palpatine, Rendar became a successful smuggler and mercenary. Rendar acquired the Outrunner as a second ship, to supplement his primary freighter, the Corellian Engineering Corporation YT-2400 light freighter Outrider."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Dash Rendar was created for the 1996 multimedia project Shadows of the Empire, which established the name of Rendar's ship as the Outrider. The 1998 young reader novel Galaxy of Fear: The Doomsday Ship by John Whitman featured both Rendar and his ship, which was erroneously called the Outrunner. In Rendar's entry in the 2002 reference book The New Essential Guide to Characters, Daniel Wallace retroactively established that the Outrunner was a second ship that Rendar purchased after acquiring the Outrider."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}