{"url": "Ovissian", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Ovissians", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Ovissian"}, {"tag": "p", "text": "Ovissians were a sentient species with a bipedal figure and two pairs of horns. A population of Ovissians inhabited the planet Krystar by the time of the Clone Wars. The Ovissian Boolio, a mine overseer on the Sinta Glacier ice asteroid, was a secret associate of the Resistance during its war against the First Order."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Ovissian sentient species had a bipedal form and a rounded face. Their skin could be green or orange in color, matching their blood, which was rich in copper. The species' eye color ranged from brown to black. Ovissians could also have hair, including facial hair, in colors such as black or red."}, {"tag": "p", "text": "Ovissians had two pairs of polycerate horns on their heads—the greater pair extended from the sides of the head, while the lesser horns jutted from the mandible. Members of the species could grow to at least 1.78 meters in height."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The population of Ovissians that resided on the planet Krystar were led by a regent, who ruled from a palace. Ovissians could speak Galactic Basic Standard."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 22 BBY, during the Clone Wars, a population of Ovissians resided on the planet Krystar, ruled by the Ovissian regent Queb and represented in the Galactic Republic by Vishar Koss. Queb secretly worked with the Confederacy of Independent Systems, keeping Republic clone troopers prisoner on Krystar, who he sold to a Trandoshan hunter. After Koss discovered the compound where Queb kept the troopers, she contacted her associate Senator Padmé Amidala, leading to a Republic mission where the clones were rescued and Queb was taken into custody."}, {"tag": "p", "text": "In around 28 ABY, an Ovissian was present at a cantina on the Mid Rim astronomical object Varnak when Ben Solo, former Jedi Padawan of Jedi Master Luke Skywalker, met with \"Ren,\" the leader of the dark side organization known as the Knights of Ren."}, {"tag": "p", "text": "An Ovissian served as the headmaster of a school on the desert planet Merokia. The headmaster came into conflict with the student Karr Nuq Sin, believing that his Force visions were simply headaches."}, {"tag": "p", "text": "The Ovissian Boolio, who hailed from the astronomical object Sinta IV, worked as a mine overseer on the Sinta Glacier, a large ice asteroid that orbited the same star. By 35 ABY, Boolio had secretly become an affiliate of the Resistance, covertly supplying the group with surplus materials. After receiving an anonymous message from an officer of the First Order, Boolio contacted the Resistance, who initiated a mission to retrieve the information. However, Boolio was discovered by the First Order, who had the Ovissian executed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ovissians were created for the 2019 film Star Wars: Episode IX The Rise of Skywalker, but first appeared in the novel Force Collector, written by Kevin Shinick."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}