{"url": "Overwatch", "categories": ["Category:Legends articles", "Category:Eternal Alliance locations", "Category:Zakuul locations"], "nodes": [{"tag": "h1", "text": "Overwatch"}, {"tag": "p", "text": "The Overwatch was the command center for most of the droids in The Spire, the capital city of the Eternal Empire of Zakuul. It also served as headquarters for the Overwatch Intelligence organization that protected the command center and several power junctions in the Old World part of Zakuul. During the reign of Emperor Arcann it was run by Administrator Tayvor Slen and protected a cadre of Skytroopers and Knights of Zakuul. In 3630 BBY the anarchist Kaliyo Djannis and The Commander allied with each other to raid onthe Overwatch. Kaliyo obtained the Overwatch access data from Tayvor's daughter Alianna Slen and blew up several power junctions in the Old World at once, disabling the majority of the automated security measures. The duo stormed through the Overwatch, eventually reaching the control room, where the Outlander downloaded the blueprints of the Spire, while Kaliyo planted explosives at the droid controls. Tayvor arrived with the skytroopers and attempted to stop them, but was defeated and mortally wounded during the fight. Before he passed away, Kaliyo mocked Tayvor's attempts to manipulate her and explained that destroying the droid controls along with the bomb detonation would cause a mass panic and throw the Spire into chaos. However, the Outlander persuaded her to only disable the droids and spare the city from the mass destruction."}, {"tag": "p", "text": "After the Eternal Empire was defeated by the Eternal Alliance, the Alliance took control of the Overwatch center. Doctor Juvard Illip Oggurobb and Alliance engineers reprogrammed the control center to turn the Skytroopers into loyal Alliance soldiers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Overwatch appears in Star Wars: The Old Republic: Knights of the Fallen Empire Chapter 10: Anarchy in Paradise."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}