{"url": "Attack_on_a_New_Republic_outpost", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of Devaron"], "nodes": [{"tag": "h1", "text": "Attack on a New Republic outpost"}, {"tag": "p", "text": "In 5 ABY, the Acolytes of the Beyond launched an attack on a New Republic outpost on the planet Devaron. During the attack, the Acolyte Remi tried to kill his estranged lover Kiza in order to recover his Sith lightsaber. However, he was killed by Kiza instead."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the months following the Battle of Endor, a cult known as the Acolytes of the Beyond emerged that worshiped the Sith and the dark side of the Force. While the Acolytes were not Force-sensitive, many experienced Force visions of fallen Sith from the Beyond. They recruited several disaffected youths and outcasts including the Pantoran Kiza and the human Remi. Following the Coronet City revolution, a group of Acolytes gathered on the planet Devaron to attack a New Republic outpost. This group was led by Yupe Tashu, a former adviser to the later Emperor Palpatine."}, {"tag": "p", "text": "This attack was part of a series of coordinated strikes against the New Republic across the galaxy. The Acolytes were enemies of the New Republic and saw themselves as waging a war against the nascent regime, which had emerged from the Alliance to Restore the Republic. While the Acolytes revered Darth Vader, they saw themselves as serving something greater than the Galactic Empire. The New Republic was establishing a series of new and old outposts across the planet's surface. They were staffed by diplomats, liaisons, scientists, and soldiers. These outposts brought food and portable water to the local population."}, {"tag": "p", "text": "Prior to the attack, Tashu communed with the fallen Sith spirits and gifted the mask of Viceroy Exim Panshard to Kiza. When Remi demanded the mask for himself, Tashu chastised the youth for angering the spirits and confiscated his lightsaber. He handed it to Kiza, who fell under the control of the two dark side objects."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "Armed with red clubs, machine shop blades, and chop-axes, the Acolytes attacked the unsuspecting New Republic outpost. Under the influence of Panshard's mark, Kiza hacked at several New Republic personnel. She drove her lightsaber through the arm of one woman before cutting her down. Driven by hate, Kiza then sliced the legs of a fleeing woman. During the heat of battle, Remi attempted to recover his lightsaber from Kiza. He threw her to the ground and told her that she was unworthy to own the weapon. Remi attempted to kill Kiza but she managed to recover her lightsaber and shove it through his head. Remi was killed when Kiza ignited the blade, which burned through his eyes."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After killing Remi, Kiza rejoined her fellow Acolytes in their attack on the outpost. The outpost soon fell and the Acolytes claimed victory."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on a New Republic outpost occurs in an interlude chapter in Chuck Wendig's 2017 novel Aftermath: Empire's End, the third installment in Star Wars: The Aftermath Trilogy. The incident is told from the point-of-view of Kiza, who had previously appeared in the 2016 novel Aftermath: Life Debt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}