{"url": "Overlook_stage", "categories": ["Category:Legends articles", "Category:Theed Royal Palace locations"], "nodes": [{"tag": "h1", "text": "Overlook stage"}, {"tag": "p", "text": "The Overlook stage was a raised terrace located in the back of the Royal Palace in Theed, capital of Naboo. It was overlooked by King Ars Veruna's library tower and the palace's rear watchtower. At some point during the Clone Wars, the Supreme Chancellor of the Galactic Republic Palpatine, acted as a master of ceremony during the Festival of Light, delivering a speech from the Overlook stage."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Overlook stage was already a part of the Royal Palace in Theed, capital city of Naboo, before King Ars Veruna of the Naboo added its library tower. Upon completion of that tower, the Overlook stage was from then on accessed by the library. Traditionally, the Overlook stage housed the main proceedings of the Festival of Light, the annual celebration of Naboo's membership of the Galactic Republic. At some point during the Clone Wars, the Supreme Chancellor of the Republic Palpatine, was asked to deliver a speech on the Overlook stage for the Festival of Light, which commemorated Naboo joining the Republic. The Jedi who were tasked with protecting Palpatine erected a security shield over the stage."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The circular Overlook stage was accessed from the lower levels of the library tower commissioned by King Ars Veruna, and was overlooked by the watchtower and its skywalk. Rimmed with stone balustrades, the Overlook stage was paved with highly polished marble. The stage was linked to the library tower by a wide walkway, and a stepped decorative walkway led down an around from the back of the stage. On the occasion of the Festival of Light, the platform was fitted with three banks of seating, as well as with a podium from which speech were given. There were speeder docking points on the stage. During the Festival of Light, those were used by floating repulsorplatforms, allowing guests to watch the ceremony."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}