{"url": "Oversector/Legends", "categories": ["Category:Legends articles", "Category:Oversectors"], "nodes": [{"tag": "h1", "text": "Oversector"}, {"tag": "p", "text": "An Oversector, also called a Priority Sector, was an area of space comprising many sectors or parts of sectors plagued with Rebel activity."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The oversectors were originally created during the Clone Wars by the Sector Governance Decree. The decree gave twenty of the new Moffs responsibility for supporting the Republic's twenty Sector Armies. These Moffs' military territories, the oversectors, matched the Sector Armies' theaters of operations. They crossed the boundaries of the regional sectors and freed their Moffs from having to constantly consult local authorities."}, {"tag": "p", "text": "After the Declaration of a New Order, oversectors were reorganized as part of the Imperial militarization recommended by the Tarkin Doctrine, with each oversector composed of a number between dozens or hundreds of smaller sectors. According to the field manual for the Imperial Military, Imperial Handbook: A Commander's Guide, the redistricting of the Imperial territory allowed for increased efficiency, namely for direct command of military operations, control of information, as well as more efficient taxation of various Imperial subjects, as well as ensuring that the politicians back the actions of the military to avoid being pulled in competing directions. In addition, it was also explained that part of the reason for their redistricting was to further divorce the Empire from the Old Republic, as the latter divided the galaxy into thousands of sectors, each representing a senator which created chaos. The new oversectors usually contained between two and a dozen sectors. The Grand Moffs were assigned by Palpatine as a military Regional Governors, superseding the authority of Sectorial Governors (Moffs), Planetary Governors, and other local authorities. The Grand Moffs were given direct control over the systems within their Oversectors, and could use practically limitless resources and means to squash Rebel activity therein, with the military allotments also being tailored to be appropriate to his station. Some of the original oversectors remained unchanged (such as the Coruscant Oversector) or were expanded, and several others disappeared: the Greater Seswenna oversector, originally surrounding Eriadu, came to encompass almost the entirety of the Outer Rim Territories, with the exception of elements of the Quelii and Bright Jewel Oversectors."}, {"tag": "p", "text": "Oversectors were sometimes known as priority sectors. This term was applied to areas where the Empire was pursuing active military campaigns or special military projects. The Death Star Project was considered as a priority sector."}, {"tag": "p", "text": "Although oversector control by Grand Moffs was intended to be such that the Grand Moffs would \"not think twice\" about crossing sector borders, as well as having no need to consult local politicians concerning the actions of the Empire specifically to ensure hit-and-hype raiding could not be used, it was ultimately flawed in implementation, which was exploited by the Rebel Alliance by staging raids at the border of an oversector and then ensuring that the Grand Moffs enter a turf war, which Wedge Antilles noted."}, {"tag": "h2", "text": "List of Oversectors"}, {"tag": "h3", "text": "The 20 original sectors"}, {"tag": "h3", "text": "Others"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}