{"url": "Oz/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Clone troopers", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "Oz"}, {"tag": "p", "text": "\"Oz\" was the nickname of a clone trooper who served in the Galactic Republic's Torrent Company, a unit of the 501st Legion, during the Clone Wars. Around 21 BBY, after defending the planet Ereesus against a Separatist invasion, Oz and the 501st fought in a campaign to reconquer the formerly Republic-aligned world of Umbara. After a rough landing on the planet's surface, Oz and his comrades met heavy resistance from the Umbaran militia. While on a highway that led to the Umbaran capital, Oz and fellow trooper Ringo stepped on a mine and were killed in the resulting explosion."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The clone trooper nicknamed \"Oz,\" a clone of the Mandalorian bounty hunter Jango Fett, was born and raised on the planet Kamino to serve in the Grand Army of the Republic during the Clone Wars. Around 21 BBY, Oz served in the Republic's Torrent Company of the 501st Legion under Jedi General Anakin Skywalker and Clone Captain CT-7567, nicknamed \"Rex.\" During that time Torrent Company was sent to the planet Ereesus, where the clones assisted the local Ereesus Planetary Security Forces in defending the world against a Confederate invasion. Oz served as a liaison between Torrent Company and the Planetary Security forces. During the campaign the Separatists captured Oz and a local militia squad led by Planetary Security Forces Sergeant Palola. The tactical droid commanding the Separatists showcased his prisoners in a holotransmission sent to Rex to make certain demands of the Republic forces. However, Lieutenant Sollaw ap-Orwien of the local militiamen was able to decipher several key points of intelligence that Palola surreptitiously provided during the holorecording, as they were both Lorrdian, a species able to communicate without speaking. Ap-Orwien was therefore able to pinpoint from Palola the location of the captives, and a team led by Rex successfully rescued Oz and the local squad."}, {"tag": "p", "text": "Sometime later, the Republic sent a strike force, including Oz and the 501st, to reconquer the former Republic planet Umbara. The Republic's goal was to capture the Umbaran capital city, and Oz and his unit were dispatched to attack Umbaran troops north of the city. After landing roughly on the surface of Umbara, Oz and his brothers immediately engaged the native Umbaran troops in a tough fight."}, {"tag": "p", "text": "After securing a ridge, Skywalker was recalled to the Republic capital, Coruscant, and was replaced by Jedi General Pong Krell. Krell, a Besalisk Jedi Master, was known for the high casualty rate of the clone troopers under his command but also for amassing many victories throughout the war. The general immediately ordered Oz and the 501st to move directly toward the Umbaran capital. After arriving at a highway that led to the capital, Krell told Rex that he would not proceed with Skywalker's plan of capturing the city through the use of surgical strikes, and instead wanted his troops to attack the city in a full frontal assault. The 501st soldiers, including Oz, would use the highway and would not retreat if they met resistance from the Umbarans. Unbeknownst to the Republic clones, the enemy had mined the road. After some time, Oz, together with fellow trooper Ringo, stepped on such a mine, and both were killed in the ensuing explosion. Two clones who checked the bodies then reported that Oz and Ringo were dead."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "While under captivity on Ereesus, Oz revealed no information to the enemy due to his training. Oz was unable to recognize that the road on Umbara was mined, and as a result he died when he stepped on one of the explosives. As a clone of Jango Fett, Oz likewise stood 1.83 meters tall."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the battle on Umbara, Oz wore a set of Phase II clone trooper armor that was customized with the blue markings of the 501st Legion, his unit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Oz first appeared in \"Darkness on Umbara,\" the first episode of the Umbara arc of the fourth season of the television series Star Wars: The Clone Wars. The episode aired on October 28, 2011. Oz was also mentioned in the episode's corresponding online guide on StarWars.com. In 2013, Oz had a short appearance in Speaking Silently, a short story written by Tom Hodges and published in Star Wars Insider 139."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}