{"url": "Oxon_City", "categories": ["Category:Legends articles", "Category:Cities on Naboo"], "nodes": [{"tag": "h1", "text": "Oxon City"}, {"tag": "p", "text": "Oxon City, also known as Oxon, was a city on the planet Naboo. Gungans and Humans lived in Oxon. The Gungans there contributed forces to the Battle of Naboo in 32 BBY, and during the Separatist Crisis Queen Jamillia of Naboo designated Oxon as one of several refugee arrival stations on the world."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Oxon City, often shortened to Oxon, was a city in the swamps of the planet Naboo, inhabited by both the native Gungans and the Human Naboo. It was considered one of the principal Human settlements on the world, and was located to the southeast of the city of Theed, the Human capital, and Lake Paonga, which contained the underwater Gungan capital Otoh Gunga. It contained a spaceport."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Invasion of Naboo in 32 BBY, Oxon contributed Gungan warriors to the Gungan Grand Army, who fought alongside their brethren from Otoh Mandassa, Umberbool City, and Otoh Gunga to repel the invading forces of the Trade Federation in the Battle of Naboo. After the planet's freedom was won in the battle, Gungans began the construction of a colony the Naboo moon of Ohma-D'un. A shipment of machine parts was hijacked by pirates on its way from Oxon to the moon installation, prompting the Royal House of Naboo to assign a group of pilots to escort further shipments."}, {"tag": "p", "text": "On the date 13:4:18, during the Separatist Crisis, Queen Jamillia of Naboo loosened the planet's immigration restrictions and designated spaceports in Oxon, Theed and Kwilaan Starport as refugee arrival stations. Her decision came at the cost of moving commercial mining ventures to specific service ports. Jamillia's announcement was reported in a 13:3:18 issue of the CoCo District Edition of the HoloNet News."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Oxon was first mentioned in the character statistics webpage written by Steve Miller published on the Wizards of the Coast website. The page was written to supplement Miller's short story, \"The Starfighter Trap,\" published in 2000. It was further identified as Oxon City in the 2001 LucasArts video game Star Wars: Galactic Battlegrounds. The 2009 The Complete Star Wars Encyclopedia stated that Oxon was a human settlement, despite its prior portrayals as a Gungan habitation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}