{"url": "Owool_Interceptor", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Starfighter classes", "Category:Wookiee vehicles"], "nodes": [{"tag": "h1", "text": "Owool Interceptor"}, {"tag": "p", "text": "The Owool Interceptor was a heavy, single-pilot starfighter that was designed by the Wookiees of the shipyard KashyCorp after the end of the Swarm War in 36 ABY. Operational during the Second Galactic Civil War, the interceptors were intended for use by the Galactic Alliance, but when the New Jedi Order withdrew from the Galactic Alliance, the Wookiees withdrew their support as well, leaving the Owool Interceptors to be taken up by Wookiee pilots instead. Some Wookiees flew the heavy starfighters for the Jedi when the Galactic Alliance set portions of the Wookiee homeworld of Kashyyyk ablaze, and later at the culminating battle of the war near the planet Shedu Maad."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Owool Interceptors were twin-engine heavy starfighters that featured an armament of four laser cannons and two ion cannons, and had the ability to launch Jedi shadow bombs if required. Operated by a single pilot, the Owool had enough cockpit room for a 2.26-meter-tall Wookiee, with the cockpit situated in the tapered fuselage of the hyperdrive-equipped brown starfighter. With a pair of engine mounts—each of which also housed the laser cannons—that were connected via a spar to either side of the fuselage and rose slightly above the cockpit, the starfighter looked like a fork-prowed wedge when viewed from the front. Military observers described the fighters as tough, fast, and ferocious like the Wookiees who built them."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Owool Interceptor was used both to attack enemy capital ships and in a starfighter-versus-starfighter capacity, and it was capable of flying fighter escort for other starships."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Protecting a homeworld"}, {"tag": "p", "text": "Owool Interceptors were designed and developed in the years following the events of the Swarm War—which ended in 36 ABY—by the Wookiees of the new shipyard KashyCorp. The first Owools were finished circa 40 ABY, when the Galactic Alliance was fighting the Confederation in the Second Galactic Civil War. Although KashyCorp was supposed to deliver a shipment of the heavy starfighters to the Galactic Alliance, the Wookiee Rock Council stopped supporting the Alliance when the New Jedi Order withdrew its support, preventing the Owools from being delivered."}, {"tag": "p", "text": "In 40 ABY, the Galactic Alliance's Chief of State, Sith Lord Darth Caedus, took the Galactic Alliance Fifth Fleet to the Wookiee homeworld of Kashyyyk, which was a member of the Alliance. There, Caedus demanded that the Wookiees turn over his parents, Han Solo and Leia Organa, as they were aligned with the Jedi who had abandoned the Galactic Alliance, to give Caedus a pretense to attack Kashyyyk when they refused; Caedus aimed to force the Confederation Fleet to aid the Wookiees instead of continuing its drive for the Galactic Alliance's capital planet of Coruscant. With the Fifth Fleet over Kashyyyk, a squadron of Wookiee-flown Owool Interceptors, led by the Wookiee Jedi Knight Lowbacca, was dispatched to meet the capital ships. When the Wookiees refused to hand over Solo and Organa, Caedus' flagship, the Imperial-class Star Destroyer Anakin Solo, opened fire upon the forests of Kashyyyk, setting Wroshyr trees ablaze."}, {"tag": "p", "text": "In response to the attack, the Owool squadron, whose fighters amounted to half the number of capital ships in the Fifth Fleet, attacked the Anakin Solo. Led by Lowbacca, the Owools rode the Anakin Solo's stripe, flying up the larger vessel's firing lane toward the bridge and using the flash-static of the Star Destroyer's turbolasers to shield them from its sensors. Although some of the Owools fell prey to the capital ship's anti-starfighter weapons, Lowbacca scored a direct hit on the bridge with a shadow bomb, causing significant damage. In the fighting that followed, the Jedi attacked Caedus' forces for the first time in defense of Kashyyyk, and the fleet elements of the Jedi and their allies, as well as those of the Confederation, drove the Fifth Fleet away."}, {"tag": "h3", "text": "End of a war"}, {"tag": "p", "text": "In 41 ABY, Wookiee-flown Owools were present in the Hapes Cluster within the hangar of a Hapan Battle Dragon warship that was serving as a launch point for an upcoming Jedi Coalition operation in the Roche system designed to have Caedus' sister, Jedi Knight Jaina Solo, assassinate the Sith Lord. The Owool Interceptors were meant to fly fighter escort for Skipray 24r Blastboats in the mission, but Jedi Grand Master Luke Skywalker deemed them unnecessary and told them to stand down, as he predicted a fighter escort would be present in the Roche system for the blastboats."}, {"tag": "p", "text": "After Caedus survived the attempt on his life and the Galactic Alliance emerged victorious in the Roche system, Caedus tracked the Jedi to their secret base on the planet Shedu Maad in the Hapes Cluster's Transitory Mists, bringing with him the Anakin Solo and the Super-class Star Destroyer Megador, as well as an Imperial Remnant fleet. With Uroro Station—a space station located near Shedu Maad—acting as a decoy for the Jedi base, a squadron of Owool Interceptors launched from the station as part of the starfighter group that struck at the inbound Anakin Solo and Megador. However, the Owools and the other Jedi Coalition fighters met resistance from the two capital ships' starfighter complements, resulting in a concentrated dogfight forming near the Anakin Solo and the Megador. In the end, Caedus was slain by his sister, while the Jedi Coalition forces prevailed over Caedus' fleet elements, bringing an end to the Second Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Owool Interceptors first appeared in Inferno, the sixth novel of the Legacy of the Force series, written by Troy Denning and released in 2007. The heavy starfighters were first illustrated by Darren Tan in 2012's The Essential Guide to Warfare."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}