{"url": "Oz", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Clone troopers", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "Oz"}, {"tag": "p", "text": "\"Oz\" was the nickname of a clone trooper who served in the Grand Army of the Republic's 501st Legion. During the Battle of Umbara in 20 BBY, Oz and fellow soldier Ringo were killed by Umbaran mines while under the command of Jedi General Pong Krell."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Grown on the planet Kamino, \"Oz\" was a clone trooper who served in the Grand Army of the Republic during the Clone Wars. In 20 BBY, Oz served in a platoon of the 501st Legion that was sent to secure the planet Umbara. During the Battle of Umbara, the legion's Jedi General, Anakin Skywalker, was called back to Coruscant and replaced by Jedi Master Pong Krell."}, {"tag": "p", "text": "Krell ordered Oz's platoon to lead a full-frontal assault on the Umbaran capital. Although wary of Krell's order, the platoon followed the jungle road to the city. However, the road was mined, and Oz, along with fellow soldier Ringo, were killed in an explosion. Oz and Ringo's comrades confirmed that they had died, and Clone Captain CT-7567 \"Rex\" ordered the road to be swept for more mines. Shortly after, the Umbaran Militia ambushed the platoon, forcing them to retreat."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a clone trooper, Oz was a human male who stood at a height of 1.83 meters."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the Battle of Umbara, Oz wore Phase II clone trooper armor with blue markings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Oz first appeared in \"Darkness on Umbara,\" the seventh episode in the fourth season of the animated television series Star Wars: The Clone Wars. The episode was written by Matt Michnovetz and premiered on October 28, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}