{"url": "Attack_on_an_Imperial_outpost", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Great Galactic War"], "nodes": [{"tag": "h1", "text": "Attack on an Imperial outpost"}, {"tag": "p", "text": "During the later years of the Great Galactic War between the Galactic Republic and the Sith Empire, a squad of troopers from the Republic Military attacked an Imperial outpost in order to rescue prisoners of war. However, the squad's intelligence about the enemy numbers was incorrect, and Sergeant Fideltin Rusk was forced to lead his unit in a fight against a numerically superior opponent. Despite the odds, the squad successfully rescued the prisoners and escaped with no casualties."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Chagrian Fideltin Rusk joined the Republic Military sometime after 3665 BBY, during the Great Galactic War between the Galactic Republic and the Sith Empire. When he achieved the rank of sergeant at some point before the end of the war in 3653 BBY, Rusk was awarded with command of his own unit. The squad, which included troopers such as Karsim, Naja, and Eckerd, was subsequently given its first assignment. The unit received intelligence on the defenses of the Imperial outpost that they would be attacking in order to free Republic prisoners of war. According to the reports, the POW camp was lightly manned and would not receive reinforcements for another day."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "However, when the squad launched their attack on the outpost, they discovered that their intelligence was wrong—the reinforcements were a day early, and the unit was outnumbered by the Imperials at a ratio of ten-to-one. Despite the numerical disadvantage, Sergeant Rusk led his squad in fighting through over 130 enemy soldiers and rescued the prisoners before escaping the base alive. Rusk's squad suffered a 97.4% casualty rate, though no permanent injuries or fatalities, and all of the prisoners were extracted successfully."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the successful completion of the mission, Rusk was reassigned to command another unit, and General Elin Garza recruited the rest of the squad into the black ops program of the Republic Special Forces Division. As a black ops unit, the squad was renamed \"the Surgeons\" and tasked with destabilizing the Empire's command structure by eliminating the enemy's leaders. However, the Surgeons soon began to pursue the families of their assigned targets, and the squad was convicted of war crimes and forced to serve out life sentences in a detention facility on the planet Berrun. Reminiscing over the mission later led Rusk to investigate the fates of his former squad, and he was dismayed to learn of their imprisonment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on the Imperial outpost was first mentioned in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011, during the conversation \"Bad Intel\" with the Jedi Knight class character Sergeant Rusk. The conversation leads Rusk to investigate his first squad before the later conversation \"Vanished,\" and he discovers their imprisonment on Berrun before the conversation \"The Surgeons.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}