{"url": "Attack_on_an_Imperial_convoy", "categories": ["Category:Canon articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Battles of the Early rebellion against the Galactic Empire", "Category:Battles of Lothal", "Category:Missions of the Ghost"], "nodes": [{"tag": "h1", "text": "Attack on an Imperial convoy"}, {"tag": "p", "text": "During their rebellion against the Galactic Empire, the rebel crew of the starship Ghost carried out an attack against an Imperial convoy on Lothal. The intelligence for the attack came from Ahsoka Tano, a Rebel Intelligence operative who secretly coordinated with cells such as the Ghost crew under the codename \"Fulcrum.\" The information about the convoy's timing and route was accurate, but Tano's intelligence underestimated Imperial defenses. This led to at least four TIE/ln space superiority starfighters chasing the Phantom, the Ghost attack shuttle, which was carrying pilot Hera Syndulla, Mandalorian explosives expert Sabine Wren, and Jedi Padawan Ezra Bridger. Syndulla was able to outfly and destroy the TIE fighters, allowing the Phantom to escape."}, {"tag": "p", "text": "Fulcrum's identity and the intelligence she provided became a point of contention for Wren, who wanted to know why the rebels were risking their lives on operations like the convoy attack. Syndulla assured her that they were part of something bigger and that there was a plan for fighting the Empire. After a mission to Fort Anaxes, where they were attacked by fyrnocks that inhabited the abandoned Grand Army of the Republic asteroid base and had to rely on one another to survive, Wren learned to trust Syndulla about the crew's mission."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the fifth year before the Battle of Yavin the rebel crew of the starship Ghost encountered Senator Bail Organa of Alderaan during an operation that led to Organa's droids, C-3PO and R2-D2, falling into their care. The droids saw the rebels' insurgency against the Galactic Empire on the Outer Rim world of Lothal first hand, and, upon their return to the senator, R2-D2 reported what he learned about the rebels to Organa. Organa thought highly of the rebels, and, as a result, the crew's captain, Hera Syndulla, came into contact with Ahsoka Tano. Tano, a former Padawan of the Jedi Order, was a member of a growing rebel movement that Senator Organa secretly championed. Tano, operating under the codename \"Fulcrum,\" passed a number of missions to Syndulla for her cell to carry out against the Empire, though the intelligence was sometimes incomplete."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "Utilizing intelligence that Fulcrum provided, three of the rebels—Syndulla, Mandalorian warrior Sabine Wren, and Padawan Ezra Bridger—assaulted an Imperial supply convoy on Lothal in their attack shuttle, the Phantom. Syndulla was privy to the intelligence and the purpose of the mission, but she kept Wren and Bridger in the dark due to Fulcrum's intelligence being on a need-to-know basis. Fulcrum's information was correct about the timing of the convoy's arrival and the route it had taken, but the intelligence underestimated the strength of the Imperial defenses. As a result, the Phantom was pursued by a TIE/ln space superiority starfighter. Syndulla led the fighter on a chase across the Lothal landscape, outmaneuvering the TIE pilot at every turn. She flew around stone circles, large rock formations on the surface, to lose them, and was able to shoot the TIE fighter out of the sky. Moments later, three more fighters approached and opened fire on the shuttle."}, {"tag": "p", "text": "The chase led to Syndulla piloting the shuttle through a close collection of stone circles, causing damage to the bottom of the ship as it briefly impacted one of the stones; the damage caused an issue with the shuttle's steering. One of the TIE fighters crashed into the stone circle and was destroyed, while the other two kept up the pursuit. The rebels continued to evade the Imperial fighters, while the intelligence failure became a point of contention amongst Syndulla and Wren. The Twi'lek pilot had not shared the full nature of their involvement with the larger rebellion with her crew, thus protecting the secrets of the rebel collective in the event any of the Ghost team was captured, but Wren demanded to know more, including why the mission to assault the supply convoy was important. Syndulla would not say anymore, however, telling her that Fulcrum's intelligence was on a strict need-to-know basis, and Wren did not need to know."}, {"tag": "p", "text": "Syndulla fired a shot at one of the stone circles, causing a plume of smoke to rise into the air. As the TIE fighters flew out of the smoke, one of the pilots flew too close to the other vessel and the ships collided. They both exploded midair, bringing an end to the attack. With the Empire off their tail, the Phantom set a course to rendezvous with the Ghost. Unknown to the rebels, however, was that the shuttle was leaking fuel."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Shortly after returning to the Ghost, Syndulla prepared for a scheduled meeting with Fulcrum at Fort Anaxes, a base on the surface of asteroid PM-1203 that served as a Grand Army of the Republic military outpost during the Clone Wars. Wren insisted on joining her on the trip to learn more about Fulcrum, and Syndulla reluctantly agreed to let Wren join the mission. Fulcrum contacted the Phantom while they were en route to Fort Anaxes, saying that she had left a crate of supplies for the rebels at the base. Wren interjected during their conversation, telling Fulcrum that she wanted to meet, which was a breach in rebel protocol. The nature of the crew's relationship to Fulcrum remained a point of debate between Syndulla and Wren when they arrived at Fort Anaxes, where Fulcrum was nowhere to be found. Wren, who had once been a cadet at the Imperial Academy on her homeworld of Mandalore, knew firsthand the dangers of blind trust and felt she deserved to know more about their mission. Syndulla urged her to have faith that there was a bigger plan to fight the Empire."}, {"tag": "p", "text": "The two rebels collected the crates and attempted to leave Fort Anaxes, but they discovered the fuel leak from the damage caused to the Phantom during the escape from the TIE fighters—damage that Bridger and fellow crewmember Garazeb Orrelios had neglected to fix after the shuttle returned from the previous operation. Making matters worse, Syndulla and Wren were attacked by fyrnocks, creatures who lived in the shadows of the asteroid base. The two rebels rigged canisters of rhydonium fuel to explode once triggered, which they used to kill the fyrnocks as they attempted to attack the rebels. Syndulla and Wren held out until the rest of the crew arrived aboard the Ghost to rescue them. Their experience at Fort Anaxes and the trust they placed in one another led Wren to have more faith in the rebels' secret mission. Wren ultimately learned about their role in the rebellion, as well as Fulcrum's identity, once the rebel collective helped rescue Kanan Jarrus, the leader of the Lothal rebels, from Imperial captivity some time afterward."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on the Imperial supply convoy, specifically the Phantom's escape from the TIE fighters, was depicted in the opening moments of \"Out of Darkness,\" the fifth episode of the first season of the animated television series Star Wars Rebels. The event marked the first reference to Fulcrum on the series, as well as Wren's concerns over the secrecy amongst the rebel crew. This plotline was carried through the season finale, \"Fire Across the Galaxy,\" in which the crew learned that Ahsoka Tano was Fulcrum and that they were part of a larger rebellion against the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}