{"url": "P3", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Phoenix Squadron starships", "Category:Sphyrna-class corvettes"], "nodes": [{"tag": "h1", "text": "P3"}, {"tag": "p", "text": "P3 was one of three Sphyrna-class Hammerhead corvettes that was sent by Senator Bail Organa to reinforce Commander Jun Sato's unit of the rebellion. P3 could be identified by its distinctive faded yellow and orange markings."}, {"tag": "p", "text": "Some time after her acquisition by the Phoenix fleet, P3 was attacked somewhere in space by the Nightbrother and former Sith Lord Maul, who was seeking to capture the crew of the Ghost. Maul inflicted heavy damage to the corvette and boarded her. Despite the crew putting up a considerable fight, they were no match for Maul and were all killed apart from one pilot and an astromech droid whom Maul forced to send a distress call to the Ghost before capturing them upon arrival. Maul then left the damaged corvette floating in space to be discovered by Ezra Bridger and Kanan Jarrus, who subsequently discovered the injured pilot and the identity of the attacker."}, {"tag": "p", "text": "P3 was soon repaired and ready for battle once more, however, participating in the Battle of Atollon against the Seventh Fleet. Though one of her sisters, P2, was destroyed in the battle, P3 and her other sister P1 managed to retreat back to Chopper Base and was ultimately one of the few rebel ships to successfully escape, jumping to Yavin 4."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The hammerhead corvette P3 made its first appearance in the Star Wars Rebels Season Two episode \"A Princess on Lothal\". It was revealed as P3 in the Concept Art section of the A Princess on Lothal episode guide. Star Wars: The Rebel Files identifies the three corvettes as Lightmaker, Duchess Senna, and Amity's Arrow, although it has not been clarified which names corresponds to the ships."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}