{"url": "P2_astromech_unit", "categories": ["Category:Canon articles", "Category:Astromech droid models", "Category:Industrial Automaton products"], "nodes": [{"tag": "h1", "text": "P2 astromech unit"}, {"tag": "p", "text": "The P2 astromech unit was the first droid purposely-built and marketed as an astromech droid. Launched by developer-manufacturer Industrial Automaton some decades before the Clone Wars of 22 BBY–19 BBY, the model was sold exclusively to the Republic merchant fleet. Stood at 2.3 meters tall, the P2's head and shoulders towered average humans and droids. The astromech unit was very effective as a shipboard tool, possessing a barrel-chested body, retractable manipulator arms, a trio of wheeled legs, a sensor-filled domed head, and a video display for communication."}, {"tag": "p", "text": "Despite the P2's success, and due to it being one of the two largest droid manufacturers in the galaxy, Industrial Automaton's droid development lab turned their attention to creating the R-series line of droids, beginning with the improved R1 and meeting great success with the R2. The P2 astromech unit shared its name with P2, a prototype astromech droid around the height of a typical human who was present on the planet Tatooine in 0 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The P2 astromech unit was introduced to the new Star Wars canon by the twenty-eighth issue of De Agostini's Star Wars: Build the Millennium Falcon magazine, which uses a sketch that was also featured in the Star Wars Legends reference book The Essential Guide to Droids."}, {"tag": "p", "text": "In Legends, the P2-series astromech droid was 2.2 meters tall, and its design was inspired by an early Ralph McQuarrie concept illustration of R2-D2. One of the original concept sketches by McQuarrie that became the basis of the Legends P2 unit was also based upon for the design of CH-33P, a canon-exclusive C1-series astromech droid introduced in \"Shattered,\" the penultimate episode of the Star Wars: The Clone Wars TV series. The episode was released on May 1, 2020, with the design of CH-33P in \"Shattered\" attributed to K [Kilian] Plunkett."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}