{"url": "P-series_destroyer_droid", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Droid stubs", "Category:Colicoid Creation Nest products", "Category:Droideka models", "Category:Trade Federation battle droid models"], "nodes": [{"tag": "h1", "text": "P-series destroyer droid"}, {"tag": "p", "text": "The P-series destroyer droid was a model of droideka produced by the Colicoids for the Trade Federation, and later for the Confederacy of Independent Systems."}, {"tag": "p", "text": "Several P-series droidekas were stationed aboard the Federation Lucrehulk-class battleship Saak'ak during the Invasion of Naboo, and they were also deployed during the Battle of the Great Grass Plains against the native Gungans."}, {"tag": "p", "text": "Several P-series droidekas remained on Lok after the Trade Federation utilized it as a testing zone for their assault on the planet of Naboo, in addition to other B1 model droids."}, {"tag": "p", "text": "Swift and deadly, the P-series was nevertheless obsolete by the time of the Battle of Geonosis, during which the more advanced W-series was also deployed."}, {"tag": "p", "text": "Although it could not use its deflector shield generator while in \"wheel\" mode, the P-series became largely invulnerable once it unfolded into its upright firing stance. It even stymied the resourceful and powerful Jedi Qui-Gon Jinn and Obi-Wan Kenobi, who abandoned their immediate task and fled when faced with these \"destroyers\" aboard Saak'ak. The deflector shield generators, however, were not immune to heavy artillery, as demonstrated when Anakin destroyed three P-series droids with a Naboo starfighter. In addition, even an unfolded Droideka can be disabled if it was hit with a surprise shot, as evidenced by one being accidentally taken down by Jar Jar Binks via blaster fire during the Battle of Naboo before it had the chance to activate its deflector shield due to Binks' foot being entangled with a severed battle droid's wiring at the time."}, {"tag": "h2", "text": "Notable units"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}