{"url": "Attack_on_an_unidentified_pirate_base", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Outer Rim"], "nodes": [{"tag": "h1", "text": "Attack on an unidentified pirate base"}, {"tag": "p", "text": "During the Galactic Civil War, not long after the Battle of Yavin, a robotic CR90 corvette belonging to pirates—who were funded by the Crymorah syndicate—attacked an Imperial shuttle carrying Imperial weapons. The Dark Lord of the Sith Darth Vader, stopped the corvette. Soon after, Grand General Cassio Tagge sent Vader aboard the captured pirate ship to attack the pirate's base, and to learn the larger organization behind the constant raids—after assigning Lieutenant Oon-ai to serve as a Tagge's spy to Vader. Once at the base, Vader, Oon-ai, and six stormtroopers quickly killed all the resistance, including a pair of customized droidekas, while a black astromech droid planted false evidence in the station's computer incriminating Oon-ai as a traitor. Vader, with Oon-ai in tow, went farther into the station to retrieve the evidence as the station self-destructed around them. After obtaining the information, they boarded the corvette as the station exploded entirely. The strike team returned to the Annihilator where Vader claimed Oon-ai was a traitor and that the Crymorah Syndicate had been backing the pirates. Later, Vader located Aphra, the archaeologist who had provided the pirates with the droidekas, and enlisted her services for a secret mission."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, Luke Skywalker of the Rebel Alliance managed to destroy the Empire's greatest weapon: the planet-destroying Death Star battle station."}, {"tag": "p", "text": "With the Death Star gone, the Empire had become weaker than Emperor Palpatine had ever imagined it would; so he was forced to deal with the Outer Rim crime lord Jabba the Hutt. Jabba sent an envoy to Cymoon 1 to negotiate the terms, but the Rebel Alliance had recently launched a galaxy-wide campaign to take advantage of their victory at Yavin. A rebel team led by Leia Organa intercepted and posed as the Hutt's envoy, and assaulted Weapons Factory Alpha. Vader fought against the attackers, but failed to stop them before Skywalker succeeded in their task, and blew up the factory's power core; causing the entire facility to explode."}, {"tag": "p", "text": "Vader, now in an even worse position with his master for losing the Death Star and Weapons Factory Alpha, was ordered to continue the negotiations with Jabba on Vader's homeworld of Tatooine. The Empire's terms were ultimately agreed upon, and Jabba became a supplier for the Empire."}, {"tag": "p", "text": "Not long after, Vader, now under the command of Grand General Cassio Tagge, were working to stop pirates and other lawless beings who took advantage of the Empire's disarray, with neither the Imperial Senate or the Death Star holding order, they pillaged and plundered Imperial ships and equipment at a much higher rate than was classified as normal. One such group was funded by the Crymorah syndicate, and enacted several raids using a robotic CR90 corvette. Vader and Tagge soon tracked down the pirate ship when it attacked CZ-246, a Lambda-class T-4a shuttle carrying recently supplied weapons from Jabba's enterprise. The corvette soon disabled the shuttle's engines, however the pilot of the shuttle blew themselves up to prevent the pirates from gaining the Empire's property. The robotic corvette began to flee, but Vader arrived in his TIE Advanced starfighter and quickly blew up the corvette's engine block, ending the skirmish."}, {"tag": "p", "text": "Soon thereafter, Vader returned to report to Tagge aboard his Executor-class Star Dreadnought Annihilator. The pirate ship was put into a hanger where it was repaired well enough to pass a cursory exam. Then Tagge conceived a plan to send Vader, their greatest warrior, to trace the pirates to their home base using the captured corvette, and learn the larger organization behind the raids, before assigning an Adjutant to Vader who would serve as Tagge's spy. Vader was unhappy with the situation but obeyed in respect for the Emperor. However, he planted incriminating evidence into a black astromech droid that would identify Adjutant Oon-ai as a traitor. Soon, Vader, Oon-ai and a squad of six stormtroopers set out aboard the corvette and located the pirate's base of operations; a space station on the extreme edge of the Outer Rim."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "The pirates, a Twi'lek, a Mon Calamari, and a Sullustan, noticed the return of their corvette and prepared to unload the contraband and begin repairs on it. However, the Twi'lek was killed by Vader when the Twi'lek was instead met by Vader's strike team. The astromech droid went outside of the station's airlock and made its way to the command center where it planted the information that would convict Oon-ai of treason."}, {"tag": "p", "text": "The other two pirates realized they were outmatched, so they released a pair of customized droideka security droids sporting missile launchers to repel the boarders. The droidekas killed four troopers before Vader, at Oon-ai's urging, used the Force to throw a pair of missiles back at the droidekas and pirates—killing them all. Except for the Mon Calamari, who activated the station's self-destruct as he lay, dying. The station went to red-light, and Vader ordered the surviving stormtroopers to return to the corvette and prepare it for launch. The troopers obediently did so while Vader went to the station's command center to retrieve the computer records, and the \"evidence\" the droid had planted—much to Oon-ai's dismay, as he was to follow per his orders from Tagge. Vader ordered the Lieutenant not to abandon his orders while Vader retrieved the information from the computer console. He finished and he casually strode to the awaiting corvette as the station exploded around them. The corvette blasted away as the pirate's base exploded entirely. Oon-ai was surprised they had survived the ordeal, Vader was not and told them they would immediately report their findings to Tagge."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Vader then killed Oon-ai to finish his plan of using the attack to rid himself of Tagge's spy, and send a message of who was really in control to Tagge. And once back on the Annihilator, Vader reported to the Grand General, telling him he had been impressed with the results of Tagge's plan: the intelligence he had gathered from the pirate's computer confirmed the raiders had been backed by the Crymorah syndicate. Vader also claimed Oon-ai was a traitor, and that he had used his closeness to Tagge to achieve his ends. Vader then went to the black astromech droid and insured it had deleted all records of its data upload to the pirate station. It then ejected itself into space and exploded, leaving Vader to lament how only droids were truly trustworthy and loyal."}, {"tag": "p", "text": "Soon thereafter, Vader learned from the information obtained from the pirate base's computer, that the droidekas the pirates had utilized had been supplied by a rogue archaeologist, Doctor Aphra. Vader had been impressed by the customized droids, and wished to have some in his personal service to use against his enemies and on private missions. So he left the Annihilator to search for the Doctor. He searched many worlds, and killed many witnesses before learning that Aphra was on Quarantine World III in Kallidahin Space. Vader arrived on the quarantined asteroid and saved her from imprisonment and told her of his plight. She was a \"fan\" of the Dark Lord's, and agreed to help him secure his own army of unquestionably loyal battle droids on the old warzone of Geonosis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on an unidentified pirate base first appeared in the Marvel comic book series second issue of their Darth Vader series; it was released in 2015 and was written by Kieron Gillen, with art by Salvador Larroca. Gillen has been working alongside the Lucasfilm Story Group to develop the story and events of the ongoing comic series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}