{"url": "PLX-1_portable_missile_launcher", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Merr-Sonn Munitions, Inc. products", "Category:Portable launchers"], "nodes": [{"tag": "h1", "text": "PLX-1 portable missile launcher"}, {"tag": "p", "text": "The Merr-Sonn PLX, or Plex, was a powerful missile launcher that was in service almost from the beginning of the Clone Wars and continued to be used in different militaries well after the conclusion of that cataclysmic conflict."}, {"tag": "p", "text": "Produced by the tens if not hundreds of thousands, these versatile weapons were developed to give the standard clone infantryman a powerful anti-vehicle or anti-emplacement weapon and become a real force to be reckoned with on the battlefield. Small enough to be easily portable by a single soldier and powerful enough to destroy an Armored Assault Tank in a single well aimed hit, a battery of troopers using these could prove a truly devastating anti-vehicle force on the battlefield."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Merr-Sonn Munitions, Inc. PLX-1 portable missile launcher was a versatile piece of ordnance. Using a miniature mass-driver barrel, the weapon launched specially designed projectiles (manufactured by Arakyd)[source?] which could be fired either 'dumb' (firing the projectile straight, to hit slow or non-moving line-of-sight targets) or in the 'smart' GAM. GAM, or Gravity Activated Mode, used sensors in the missile to actively search for specific pre-programmed target gravity silhouettes (these generally focused on the distinctive gravity waves produced by repulsorlifts, but it could be used against enemy legged or tracked vehicles as well) and attempt to home in on them. If a GAM target lock was achieved and the missile launch was initiated, the on-board guidance systems steered the missile towards its target and, with any luck, hit it, with predictable results. There is one round in the chamber with another in reserve. With two ready-to-fire missiles loaded at once, a soldier could pop out of concealment, fire a couple of quick rounds and duck back behind cover again while preparing his next salvo."}, {"tag": "p", "text": "Packing a detonite core of considerable weight, the missile could easily blow away any soldiers on foot and destroy or heavily damage lightly armored targets. Even heavily armored vehicles such as the AAT were not invulnerable; at first, many was the time a Separatist commander committed his armored units to the battle without truly considering the threat puny infantry units could face to his heavily shielded, heavily armored and heavily armed vehicle force – and paid for it with an inordinate number of vehicle losses. As the war ground on, though, Separatist forces learned the lesson and sent antipersonnel units in before or alongside their vehicles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Primarily carried by the Advanced Recon Commando (ARC) trooper forces, but also Clone Marines, this weapon gave the Galactic Republic the highly explosive edge its embattled infantry units sought when dealing with droid forces many times their number and firepower. Being not restricted to targeting ground vehicles, and if held in the target reticule for long enough, a lock could be achieved on airborne craft such as starfighters or gunships as well, providing a versatile, compact and mobile anti-air defense for a ground-locked infantry force.[source?] During the Galactic Civil War, the Garos Resistance movement possessed one PLX-1 which they used in ambushed one Imperial convoys to take out the escorting AT-ST."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "PLX-1 (Plex) missile launchers first appeared in the short story A Glimmer of Hope. In the Battlefront video game series, the launchers serve as the primary weapon for the republic heavy trooper class."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}