{"url": "PLX-2M_portable_missile_launcher", "categories": ["Category:Legends articles", "Category:Merr-Sonn Munitions, Inc. products", "Category:Portable launchers"], "nodes": [{"tag": "h1", "text": "PLX-2M portable missile launcher"}, {"tag": "p", "text": "The PLX-2M portable missile launcher, sometimes referred to as the Plex-Twoem, or Plex, was a missile launcher produced by Merr-Sonn Munitions, Inc. and based on their earlier PLX-1 model. The sheer explosive power of the PLX-2M made it dangerous to fire blindly in close quarters, but was extremely effective when used as a 'smart' tracking weapon. Once locked on to a target, the PLX-2M's missiles had a range of 50 kilometers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The PLX-2M had a magazine of six Arakyd Industries 3t3 missiles, and included a miniature repulsorlift generator to aid in carrying the heavy weapon. Other missiles were sometimes used, including armor piercing anti-vehicle shells, explosive \"bunker busters\", gas delivery systems, and GAM guided missiles."}, {"tag": "p", "text": "This weapon also included a holographic heads-up display that gave the user information about his or her target, including its speed, range, and what defensive shields it had. This weapon had two \"smart\" missile firing modes. In one mode, the missile acted as a heat-seeker. In the other mode, the missiles homed in on the gravity distortion fields created by repulsorlift engines. The PLX-2M could also be dumbfired to avoid hitting friendly vehicles. Despite its complexity, the PLX-2M could be assembled and ready for battle in less than a minute, and, because of the microrepulsorlifts, could be carried over almost any terrain and could be easily mounted and fired from the shoulder. It was popular with infantry attacks against tanks and small fighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally designed for the Empire at the start of the Galactic Civil War, the PLX-2M was a durable weapon that can be easily transported by stormtroopers or other soldiers."}, {"tag": "p", "text": "In 9 ABY, Corran Horn's X-wing was damaged by a hit from a shoulder-fired missile, \"probably plex-twoems\", during the Battle of Liinade III. He was able to land safely."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}