{"url": "Attack_on_disabled_base", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Invasion of Naboo"], "nodes": [{"tag": "h1", "text": "Attack on disabled base"}, {"tag": "p", "text": "During the Invasion of Naboo in 32 BBY, a temporarily disabled Trade Federation base was attacked as part of the Naboo resistance effort. Members of the Royal Naboo Security Forces' Bravo Squadron, led by Captain Kael and his pilots, allied with a Hutt smuggling organization and planned an offensive against the Trade Federation. Their first victory was to destroy Comm 4, an orbital component of the Federation communications web providing a control signal to the base down on the planet. With the control signal lost, the base went into hibernation and was vulnerable to attack. The pilots flew back down to the planet and attacked the base, which consisted of multiple platforms spread throughout the area. The pilots were ambushed when the base reactivated and had to destroy a wall of airborne mines to proceed further into the base. The group fought through the complex, facing the base's defenses, before blowing up the deflector shield generator protecting the command center, which allowed Lieutenant Gavyn Sykes to land and steal a gunboat to use as a decoy. His wingmen then left the site as Federation reinforcements arrived."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 32 BBY, the Trade Federation, led by a group of Neimoidians, invaded the planet Naboo in response to a trade dispute in the Galactic Senate, and the Royal Naboo Security Forces defended their homeworld. Acting on intelligence gathered by Borvo the Hutt, the leader of a smuggling organization, the Resistance group led by Bravo Squadron's Captain Kael went on their first offensive against the Trade Federation Droid Army. Borvo's mercenaries and the Naboo pilots knocked out Comm 4, an orbiting satellite that, as part of the Trade Federation comm web, rerouted the control signal to a Federation base down on the planet. After knocking out the satellite and forcing the base to hibernate, the five fighter pilots, flying N-1 starfighters and another type of ship, dashed down to destroy the base itself. Kael ordered them to destroy all Federation targets."}, {"tag": "h2", "text": "The attack"}, {"tag": "h3", "text": "Infiltration"}, {"tag": "p", "text": "Approaching the canyon in which the base's multiple platforms were situated, the pilots destroyed several inactive laser turrets. They were blocked from further travel, however, by a wall of airborne proximity mines. As they were attempting to disable the first three platforms of the base, the base reactivated much sooner than expected, and the turrets opened fire on the Resistance fighters. The pilots destroyed the turrets and the mines, and proceeded into the next section of the base."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "The pilots found and destroyed another gun platform before moving on to destroy a platform supporting a building. The building was protected by two laser cannons in the water and a nearby missile launcher. When the area was cleared of Federation forces, Kael ordered his pilots to rejoin formation. As he led them toward the next part of the canyon, they were met by Vulture droid starfighters, about which Naboo pilot Vedd Deviss informed his compatriots. A C-9979 landing craft took off from the base at the same time."}, {"tag": "p", "text": "The Naboo coalition engaged the droid starfighters as they continued on to the next section of the base. There they found buildings protected by turrets, which they cleared as well. Moving along the canyon, they destroyed the next platform, which was protected by Ostracoda-class gunboats in addition to laser turrets. Kael ordered his team to move on once the Federation presence in the area was annihilated."}, {"tag": "p", "text": "Naboo Lieutenant Gavyn Sykes then flew off the path and acquired advanced proton bomb technology in a burned-out building after clearing away the surrounding Federation defenses. As Sykes rejoined the formation, which was flying over a destroyed dome with Federation turrets nearby, the mercenary pilot Adela Tyché commented that the Trade Federation had been there already."}, {"tag": "h3", "text": "Control Center"}, {"tag": "p", "text": "Flying through the next part of the canyon, the Naboo pilots reached the base control center, where they planned to steal a Federation gunboat. The command center was protected by a deflector shield, which Sykes had to disable to steal the gunboat while Tyché provided supporting fire. Once the defenses were destroyed, Sykes landed his N-1 starfighter and absconded with a gunboat, shooting through a wall that blocked his path to the Andrevea River. The other fighters were unable to escort him, as Federation reinforcements were inbound. Kael ordered Sykes to continue, as the Captain surmised the Federation would think Sykes was an escaping Neimoidian."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With his stolen gunboat, Sykes traveled down the Andrevea River and reached several Federation camps holding enslaved Naboo citizens, whom he and his team liberated. Eventually, Borvo betrayed the Naboo fighters and killed Captain Kael, taking control of the rescued slaves. Sykes and his wingmen in turn stopped the Hutt before returning to fighting the Trade Federation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on the disabled base appears in the seventh mission of the 2000 video game Star Wars: Episode I: Battle for Naboo. It is not necessary to destroy every Trade Federation emplacement, although this article assumes full game completion. During the course of the mission, picking up the advanced proton bomb upgrade will fulfill the bonus objective and provide a technology boost to the player's craft for the rest of the game. The battle is mentioned in Sykes' entry in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}