{"url": "PM-1203", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Azure sector", "Category:Core Worlds planetoids"], "nodes": [{"tag": "h1", "text": "PM-1203"}, {"tag": "p", "text": "PM-1203, colloquially known as the Fort Anaxes asteroid, was a massive planetoid located in the Azure system's Anaxes asteroid belt, within the Azure sector of the galaxy's Core Worlds. It was created from the remains of the planet Anaxes, which was obliterated in a cataclysmic event near the end of the Clone Wars. However, Fort Anaxes, a Galactic Republic military base located on the asteroid's surface, miraculously survived the planet's destruction."}, {"tag": "p", "text": "Within the smuggling community, Fort Anaxes became a fuel depot and neutral meeting ground for conducting private business, but ghost stories of bloodthirsty Anaxes soldiers and other superstitions scared most spacers away from PM-1203. The truth behind such wild claims lay with a colony of vicious fyrnock creatures that nested on the asteroid. During the early rebellion against the Galactic Empire, the Spectres undertook several missions to PM-1203, where they encountered the fyrnock colony and faced off against the Grand Inquisitor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planetoid PM-1203 was part of an asteroid belt comprising the remains of the destroyed planet Anaxes located in the Azure system, within the Azure sector of the galaxy's Core Worlds, in grid square L-9. The massive planetoid featured a temperate climate, though other asteroids in the Anaxes belt sporadically eclipsed its sun, shrouding PM-1203 in darkness."}, {"tag": "p", "text": "PM-1203 was large enough to support a thin atmosphere with light gravity, which attracted a colony of fyrnocks—ferocious predatory creatures that evolved to survive on asteroids with similarly harsh conditions. They inhabited the caverns of the abandoned planetoid's pockmarked surface."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Anaxes cataclysm"}, {"tag": "p", "text": "Near the end of the Clone Wars, a cataclysmic event shattered the planet Anaxes, creating an asteroid belt that included PM-1203 and thousands of other planetoids. While the exact cause was unknown, the leading theory was that a massive stockpile of hypermatter was detonated when the planet's shipyards suffered a catastrophic main reactor failure. However, there also existed a multitude of more wild explanations, ranging from Separatist superweapons to Jedi-engineered planetary collisions. PM-1203 was a key installation during the war, as it contained the Galactic Republic military outpost known as Fort Anaxes. Republic engineers had built the fort into the side of a mountain, which miraculously protected it from the planet's annihilation. The planetoid later became known simply as the Fort Anaxes asteroid."}, {"tag": "p", "text": "PM-1203's location was a well-guarded secret within the smuggling community, and Fort Anaxes became a fuel depot and neutral meeting ground for those who required privacy in their dealings. Dangerous excursions into the facility had the potential to yield Clone Wars-era weaponry, ship parts, and fuel. Nevertheless, most scavengers avoided PM-1203, citing ghost stories and other superstitions. Everyone claimed to know someone who knew the lone survivor of a scavenging attempt into the fort, and their wild claims of the bloodthirsty ghosts of Anaxes soldiers scared off most spacers. In reality, an overwhelming fyrnock infestation proved to be the source of these fears."}, {"tag": "h3", "text": "The early rebellion"}, {"tag": "p", "text": "In the year 5 BBY, Hera Syndulla and Sabine Wren of the Spectres went on a supply run to PM-1203, where they planned to rendezvous with an enigmatic ally known as \"Fulcrum\" at Fort Anaxes. However, Fulcrum had already left by the time they arrived. To make matters worse, the rebels' shuttle, the Phantom, was leaking fuel, forcing them to hold off a nest of fyrnocks until they could be rescued by their comrades aboard the light freighter Ghost."}, {"tag": "p", "text": "In 4 BBY, the Jedi Kanan Jarrus and his Padawan, Ezra Bridger, returned to PM-1203 to draw away the Imperial Jedi hunter known as the Grand Inquisitor as part of the Spectres' mission to rescue a defecting Imperial Information Office worker named Tseebo. After arriving at Fort Anaxes, the Inquisitor and his stormtrooper squad were attacked by fyrnocks under Jarrus and Bridger's control. The Inquisitor ultimately defeated Jarrus in lightsaber combat, but Bridger drew upon the dark side of the Force to summon a massive fyrnock, which attacked the Grand Inquisitor and allowed Jarrus and Bridger to escape aboard the Phantom."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "PM-1203 first appeared without name in \"Out of Darkness,\" the seventh episode in the first season of the Star Wars Rebels animated television series, which first aired on November 10, 2014. It was first named in Ezra's Duel with Danger, a 2015 junior-novel adaptation of the Star Wars Rebels episodes \"Empire Day,\" \"Gathering Forces,\" and \"Path of the Jedi,\" written by Michael Kogge. Original concept art of PM-1203, labeled \"Asteroid belt planetoid,\" was created by Amy Beth Christenson on November 22, 2013."}, {"tag": "p", "text": "While the StarWars.com Databank entry for Fort Anaxes initially claimed that the fort was built upon an asteroid, the entry was later updated to clarify that the base was located on Anaxes and remained intact following the planet's destruction."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}