{"url": "PB-950_patrol_boat", "categories": ["Category:Legends articles", "Category:Corvette classes", "Category:Galactic Empire starship classes", "Category:Galactic Republic starship classes", "Category:Patrol craft classes", "Category:PB-950 patrol boats"], "nodes": [{"tag": "h1", "text": "PB-950 patrol boat"}, {"tag": "p", "text": "The PB-950 Patrol Boat was a patrol craft produced by Corellian Engineering Corporation for three hundred years up until the end of the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Seeing widespread use during the Old Republic as a system defense and customs interdiction vessel, the series' sturdy design and reliability came to be a welcome addition to many system and sector fleets."}, {"tag": "p", "text": "Despite seeing a last surge of popularity at the onset of the Clone Wars before production was halted to make way for the larger and more powerful Light corvette, there are still tens of thousands of patrol boats in operation rounding out Imperial Customs forces and system defense forces throughout the Galactic Empire, with the corellians employing these craft during the original Corellian Crisis."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "A rugged and reliable ship, the clunky PB-950 was known for its ability to withstand considerable punishment due to its double hulled design. In addition, despite the ship's age, its armament sported enough firepower to deal with smugglers and pirates, its stock ion cannons being used to immobilize ships before they could escape."}, {"tag": "p", "text": "Due to these qualities, while the ship declined in dedicated military use, the ship remained popular with smugglers and pirates alike, who appreciated its robust design."}, {"tag": "p", "text": "However, due to the ship's age, replacement parts were scarce and expensive. Many private owners, in order to counter prohibitive costs, elected to entirely replace damaged components with modern equivalents rather than attempt to procure original parts. As a result, ships such as the Lumrunner were often extensively upgraded and modified when compared to their stock Clone Wars era counterparts."}, {"tag": "h2", "text": "Known ships"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}