{"url": "Pa%27lowick", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pa'lowicks", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Pa'lowick"}, {"tag": "p", "text": "Pa'lowicks were a sentient species of long-limbed reptilian humanoids that had spotted skin, eyes that protruded from the tops of their heads, and trunk-like mouths. Sy Snootles, the lead singer of the Max Rebo Band, was a Pa'lowick."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Pa'lowick's were a species of reptilian humanoids. Their most distinctive feature was their trunk-like, 30-centimeter snout that ended with a large pair of lips, while a pair of retractile tusks protruded from their second mouth. This helped them cope with the variety of conditions associated with living in swamps, and Pa'lowicks were able to use their snout as a snorkel. Pa'lowicks had four long, thin limbs attached their rounded body. Their yellow skin was covered in blue or purple spots, which provided camouflage in the swamps of their homeworld. A pair of bulbous blue eyes protruded from their head, right above their snout. Instead of a heart, Pa'lowicks had an organ known as a fluid sac."}, {"tag": "h2", "text": "Pa'lowicks in the galaxy"}, {"tag": "p", "text": "Sy Snootles, a Pa'lowick from Lowick, was a popular singer and part-time bounty hunter, though in secret she worked as a spy for the Hutt Clan. She later chose to focus on her singing career and helped form the Max Rebo Band, becoming its lead singer. Another Pa'lowick worked as an announcer for the illegal Gladiator Night sporting event held at Monad Outpost on the planet Lothal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pa'lowicks first appeared in Star Wars: Episode VI Return of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}