{"url": "Attack_on_the_Distillery", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Attack on the Distillery"}, {"tag": "p", "text": "The attack on the Distillery was an assault that took place on the planet Coyerti in 3 ABY. The distillery was a biotoxin and chemical refining facility used by the Galactic Empire and was the hub of the Empire's production on Coyerti, making it a valuable target for the Alliance to Restore the Republic."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "In 3 ABY, the Alliance to Restore the Republic's 61st Mobile Infantry launched a campaign on the planet Coyerti in 3 ABY, less than a month before the battle of Hoth. One of the main targets there was the distillery, the hub of Coyerti's bio-weapon production. It mainly consisted of three white bunkers, covered with vegetation and guarded by three stormtrooper patrols. The attack started when Rebel soldier Brand planted a microdetonator on one of the chemical barrels. When it exploded, it caused a sufficient distraction for the members of the 61st to attack, killing the remaining stormtrooper guard. The rebels then entered the Distillery and cleared the bunkers, placing detonators as they went. Once the rebel troops exited the distillery, they set off the detonators and destroyed it."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "According to Everi Chalis, the distillery's destruction would set back Coyerti's operations for years. However, due to the large amount of bioweapons the Empire had already stockpiled, the Sixty-First ended up facing some of Coyerti's biotoxins during their attack on Nakadia."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack on the Distillery appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}