{"url": "Padm%C3%A9%27s_Apartment", "categories": ["Category:Canon articles", "Category:Structure stubs", "Category:Coruscant apartments", "Category:Galactic Republic locations"], "nodes": [{"tag": "h1", "text": "Padmé's Apartment"}, {"tag": "p", "text": "Padmé's Apartment was the suite Padmé Amidala lived in on Coruscant after her term as Queen of Naboo was up and she instead became the planet's representative in the Galactic Senate. It was located in a high-rise complex in the Senate District."}, {"tag": "p", "text": "During the Separatist Crisis, Amidala was subjected to a series of assassination attempts, the last of which saw Zam Wesell smuggle two poisonous kouhuns into her bedroom, which were killed by one of her Jedi bodyguards, Anakin Skywalker."}, {"tag": "p", "text": "Skywalker and Amidala were married on Naboo following the First Battle of Geonosis. The Clone Wars kept the two apart however, as Amidala served as a senator on Coruscant, and Skywalker was a Jedi General leading the Grand Army of the Republic in the war. Following a tour of duty Skywalker returned to Coruscant and entered the apartment with dinner for him and Amidala. He was greeted by their protocol droid, C-3PO, and shared a happy reunion with Amidala. As he entered he referred to the apartment as their \"home,\" and when Amidala noticed he replied there wasn't another name for him to call it. The two shared the evening together."}, {"tag": "p", "text": "The apartment was among the meeting places of the Delegation of 2,000, the group of senators Amidala belonged to who plotted to remove Supreme Chancellor Sheev Palpatine from power."}, {"tag": "p", "text": "Following Amidala's death and Anakin Skywalker's transformation into Darth Vader, the senator's apartment was sealed, with a large, tri-dimensional representation of her face blocking the entrance. Many years later, shortly after his duel on Cloud City with his estranged son Luke Skywalker, Vader forced his way into the apartment, accompanied by the forensics droid ZED-6-7."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}