{"url": "Packered_mortar_gun", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Portable launchers"], "nodes": [{"tag": "h1", "text": "Packered mortar gun"}, {"tag": "p", "text": "The Packered mortar gun was a mortar weapon utilized by the Galactic Empire during the Galactic Civil War. The mortar gun could quickly fire a barrage of explosive shells with a wide explosive radius in an arced trajectory. The weapons were stocked in various Imperial bases and supply caches. In the aftermath of the Battle of Yavin, Rebel Alliance mercenary Kyle Katarn commandeered Packered mortar guns during his campaign to stop the Dark Trooper Project, effectively using the weapons against their original owners. Katarn used one against Imperial stormtroopers during his mission to Orinackra, where he stormed a prison complex in order to rescue the Imperial informant Crix Madine."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Packered mortar gun fired explosive shells. The weapon was cylindrical, featuring a large-bore barrel. Three ammunition tubes, attached to the midsection, rotated each time the weapon fired. The thin stock had a flat end to rest against the user's body, while the trigger, protected by a trigger guard, was located in front of the stock. A perforated shroud covered the barrel. The weapon had a predominantly chrome finish, with dark-gray portions between the stock and barrel. Hooks behind the barrel shroud allowed users to attach a sling to the weapon."}, {"tag": "p", "text": "The weapon offered two primary methods of use. The first involved holding and firing the gun like a rifle. Alternately, the end of the stock could rest against the user's thigh, allowing the weapon to be fired with one hand. The Packered mortar gun fired silver shells with brass-colored linings and a red tip, which were lobbed in an arc. The farthest firing distance was achieved by holding the weapon at a forty-five-degree angle. Although the weapon served as an alternative to thermal detonators, the mortar's shells were actually weaker. Still, the weapon was useful against a wide range of foes and could potentially render multiple tight-knit targets inoperable with a single shell."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Galactic Empire utilized Packered mortar guns during the Galactic Civil War. Stocks of the weapons were located on the Imperial capital planet Coruscant and in the Imperial Detention Center on the world of Orinackra, along with many other locations. Shortly after the Battle of Yavin, the Rebel Alliance agent Jan Ors briefly described the weapon in a coded transmission to mercenary Kyle Katarn."}, {"tag": "p", "text": "Shortly after, the Empire began the Dark Trooper Project, an initiative to create droid soldiers. Imperial officer Crix Madine surreptitiously exposed information about the project to the Alliance, which eventually led Imperial authorities to arrest and issue Madine a sentence on Orinackra. Katarn, who had been making waves in disrupting the project with Madine's information, set out to the prison to rescue him. During the rescue, Katarn came across a Packered mortar gun and used it inside the prison against the Imperial troops on his way to freeing Madine. Katarn was able to carry up to fifty mortar shells at a time."}, {"tag": "p", "text": "Afterward, Katarn continued to use the Packered mortar gun throughout the dark trooper campaign, fighting through scores of Imperial stormtroopers, Imperial commandos, and Imperial officers in various Imperial installations. The weapon also accompanied Katarn during a mission to the Ramsees Hed spaceport on the planet Cal-Seti; a brief tenure aboard the Star Jewel, the personal yacht of crime lord Jabba the Hutt; a mission to the Imperial Security Operations building on the planet Coruscant; and an excursion to the Fuel Station Ergo. Katarn eventually infiltrated the dark trooper factory ship Arc Hammer and destroyed the project."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Packered mortar gun was created for the 1995 video game Star Wars: Dark Forces, and it later featured in artwork for the 1995 Topps Star Wars Galaxy Series 3 trading card set, which served as promotional material for the game. Justin Chin, the game's story writer, named the Packered mortar gun after one of his favorite automobile companies, Packard. According to Chin, Kyle Katarn personally favored the mortar gun and used it extensively when rescuing Jan Ors from Imperial imprisonment, as told in Dark Forces Manual: Coded Transmissions. However, no Dark Forces source material, including Coded Transmissions, mentions Chin's details regarding Katarn."}, {"tag": "p", "text": "At least one Dark Forces game tester referred to the weapon as \"smoke\" during development, having favored other weapons over the launcher. Level designer Brett Tosti purposely placed a Packered mortar gun underneath a ledge where a thermal detonator-tossing Gran was stationed during the game's Cal-Seti mission. Tosti felt that the weapon was most useful for that encounter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}