{"url": "Padawan_braid", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Fashion accessories", "Category:Hairstyles", "Category:Jedi culture"], "nodes": [{"tag": "h1", "text": "Padawan braid"}, {"tag": "p", "text": "The Padawan braid was a symbol worn in the hair or head that marked the rank of a Jedi Padawan. The braid was composed of a long strand of intricately woven hair typically worn across the right shoulder. In the case of Padawans from species that did not grow hair on their heads, alternatives such as silka beads were worn instead. When a Padawan was declared a Jedi Knight after passing the trials, the braid was shed. If a Padawan was expelled from the Jedi Order, the braid was ripped off, as happened to Ahsoka Tano after she was framed for treason."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Padawan braids were a symbol of rank used to distinguish apprentices within the Jedi Order. They were lengths of intricately woven hair, typically worn across the right shoulder. Padawans which belonged to species that did not grow hair on their heads would wear alternatives such as silka beads. Padawan braids would be shed upon attaining the rank of Jedi Knight after passing the Jedi Trials. Padawans who were expelled from the Jedi Order would have their braids ripped off."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the High Republic Era, Jedi Masters could decide whether or not their apprentice had to wear a Padawan braid: Master Cohmac Vitus did not intend to require his next apprentice to wear a braid, while Padawan Reath Silas had unsuccessfully attempted to persuade his Master, Jora Malli, to not make him wear it any longer. Silas' braid was later ripped out by a Wookiee infant he rescued from the starship Journeyman, and he thought he would have to grow it back."}, {"tag": "p", "text": "While stranded on the jungle moon Wevo around 232 BBY, Padawan Imri Cantaros was dealing with grief over the death of his Master and feelings of envy regarding the skills of Jedi prodigy Vernestra Rwoh, who was only sixteen, two years older than him, but already a Knight. Seeing Rwoh braiding her hair made him touch his Padawan braid self-consciously."}, {"tag": "p", "text": "During his time as a Padawan, Obi-Wan Kenobi developed a bad habit of tugging at his Padawan braid when nervous, a habit he hoped to break."}, {"tag": "p", "text": "Togruta Padawan Ahsoka Tano's silka bead braid was stolen by bounty hunter Cad Bane during the Battle of Devaron. After Tano helped capture Bane on Naboo, she took the braid back, declaring she had earned the right to wear it again. Late in the Clone Wars, Tano was framed for the bombing of the Jedi Temple hangar, and was expelled from the Order so she could be put on trial, with her braid being removed by a Jedi Temple Guard. After her master Anakin Skywalker managed to clear his apprentice's name by revealing fallen Padawan Barriss Offee as the true traitor, Tano was offered her braid and position in the Order back. However, having lost faith in the Order and the Jedi High Council, she declined and left."}, {"tag": "p", "text": "After he survived Order 66, Padawan Caleb Dume's occasional rescuer Janus Kasmir made Dume cut his braid off and abandon his Jedi robes in order to better hide from the Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}