{"url": "Pacithhip/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Mammalian sentient species", "Category:Outer Rim Territories species", "Category:Pacithhip"], "nodes": [{"tag": "h1", "text": "Pacithhip"}, {"tag": "p", "text": "The Pacithhip were a sentient species native to the planet Shimia in the Outer Rim Territories. Members of the species were short, squat pachydermoid bipeds with long, thick tails and rough, blue, green or gray skin. To fit in with a humanoid-dominated galaxy, Pacithhip often employed robotic stilts to achieve greater height and to use technology crafted for standard humanoids. The Pacithhip face featured a long trunk, four nostrils, and two elaborate tusks. The tusks came in three distinct patterns, which determined whether their bearer was a member of the scholar, warrior, or farmer caste. Most Pacithhip made peace with their genetically determined place in society, but a few rejected the system and sought their fortune offworld. Pacithhip were broad-minded and adaptable to foreign environments."}, {"tag": "p", "text": "The Pacithhip were discovered before 1000 BBY, in the days of the Galactic Republic. The Corellian Run trade route eventually reached Shimia, and the Pacithhip gained access to galactic-standard technology. Pacithhip colonists reached faraway planets; for example, by 35 BBY, Mos Espa on Tatooine boasted a significant Pacithhip population, many of whom were animal breeders. After the rise of the Galactic Empire, Imperial troops took over Shimia's spaceports and discouraged offworld travel but otherwise left the Pacithhip alone. The Imperial defeat at the Battle of Endor in 4 ABY freed the Pacithhip to once again spread throughout the galaxy."}, {"tag": "p", "text": "Since their discovery by the Galactic Republic, Pacithhip integrated into the galaxy. One such individual was a Pacithhip Jedi who fought in the Army of Light during the New Sith Wars. Durundo was a podracer active during the latter days of the Republic. Ketwol was a Pacithhip prospector who settled on Tatooine and frequented Chalmun's Cantina."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Pacithhip were sentient mammalian pachydermoids who walked upright on stubby legs. Coupled with a long tail, this gave them a low center of gravity and made them surefooted and stable Nevertheless, these short limbs made them slower than most humanoid species and prevented them from operating standard machinery and vehicles. Many Pacithhip wore robotic stilts that raised their height from their natural 1.3 to 1.7 meters and gave them the proportions of an average humanoid, although this behavior was far from universal. Because Pacithhip young often hitched rides on their elders' backs, their speed was not as much of a disadvantage. The Pacithhip had hairless, wrinkled skin that ranged in color from blue to green to gray. It was thick and tough, which afforded them some resistance to physical damage and stun blasts. The hands of some Pacithhip had three short, stubby fingers, while others sported four long and thin digits. Pacithhip adjusted easily to environmental extremes."}, {"tag": "p", "text": "A thick ridge of bone at the back of the skull protected the Pacithhip head. Above this and high on the sides of the head were two large eyes that gave the Pacithhip a full 360-degree field of vision. Their eyes came in different hues, but blue was particularly common. A long proboscis jutted from the front of the face and ended in two nostrils; Pacithhip could drink through the trunk and even squirt jets of liquid from it. This trunk was flanked by two larger nostrils at its base. The large mouth opened widely. Many Pacithhip had deep, gravely voices."}, {"tag": "p", "text": "The species' most distinctive feature was a pair of elaborate tusks that grew from the base of the skull ridge and stuck out to either side of the nose—although at least some Pacithhips had no tusks at all. These were covered in skin for much of their length, but these fleshy growths terminated in tufts of black fur in some specimens. The final third resembled ivory-colored bone or teeth, jutting up at an angle in some individuals, growing out straight in others. The tusks were deadly in combat but served primarily to aid in depth perception. They came in three genetically determined patterns. Some Pacitthip adorned them with rings and bands. Young Pacithhip had undifferentiated tusks until the onset of adolescence at thirteen standard years of age, with the full tusk pattern emerging by adulthood, at eighteen standard years. Pacithhip life expectancy was eighty-five standard years."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Shimia's 10 to 100 million Pacithhip were divided into three castes: scholars, warriors, and farmers. Pacithhip viewed the castes as equal in rights and duties with no caste-based discrimination, but each had predetermined tasks they were expected to execute. The scholars acted as legal experts, judges, administrators, and teachers. The warriors upheld the mandates of the scholars and provided Pacithhip communities with defense. The farmers were the most diverse; although originally responsible for food production and textile work, in later years they took on manufacturing tasks on a greater scale. Membership in a particular caste was determined by the shape of a Pacithhip's tusks. This could be determined early in a Pacithhip's life through genetic testing, but the tusks of a few Pacithhip failed to differentiate, making their place in society liminal."}, {"tag": "p", "text": "The Pacitthip were logical and broad-minded beings. Their society condoned and encouraged stoicism; their preferred approach to dealing with the disagreeable—even something as fundamental as dislike of the caste system—was to let it be and endure. They believed it best to follow authority, especially the scholar caste. These intellectuals emphasized egalitarianism and equality, so Pacithhip were unafraid of, even intrigued by, other species. Therefore, they easily adjusted to different cultures and conditions."}, {"tag": "p", "text": "The language of the Pacithhip was known as Shimiese, a tongue that combined proboscis toots, dense oral vocalizations, and quick nasal huffs. Written Shimiese employed pictograms that stood for idioms and various parts of speech. Pacithhip could easily understand and speak Basic. At least those Pacithhip who lived among members of other species used gestures standard for much of galactic society, such as shaking their head to indicate no."}, {"tag": "p", "text": "After their discovery by the Galactic Republic and integration to the Corellian Run trade route, the Pacithhip gained access to advanced technology and spaceports. Nevertheless, their native manufacturing and engineering capabilities lagged behind those of the galaxy at large for most of their history; by the time of the Galactic Civil War, they were still in their industrial period. Nevertheless, offworld Pacithhip could become quite adept at analyzing starship malfunctions, even if they had to be careful not to tangle their tusks in the complex wiring of hyperdrives and other equipment. The Imperial presence on Shimia did its best to retard the Pacithhip's technological progress, but with the rise of the New Republic, the species was once again able to engage in trade with the galaxy on a large scale."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Pacithhip evolved on the planet Shimia, in the Dalchon sector of the Outer Rim Territories. The world was dominated by temperate grassland that abutted coastal mountain ranges. The Pacithhip evolved from creatures with tough, lengthy tusks used for defense and sexual competition. As the beings grew more intelligent, these features became smaller and more refined."}, {"tag": "p", "text": "Shimia was first reached by outsiders between 20,000 and 15,000 BBY, during the Galactic Republic's settlement of the Trailing Sectors in which the world was located. The remote world lay just south of the Corellian Run trade route, and over time, commercial Republic interests built several spaceports on the world. The planet fell within territory considered both Hutt Space and part of the Brotherhood of Darkness during the New Sith Wars of 1004 to 1000 BBY. Years later, the Pacithhip's planet was in unaligned space during the Clone Wars. During the conflict, the Republic suspected that a gang of Pacithhip smugglers led by the Pacithhip Kozzel Qwok were having dealings with the Confederacy of Independent Systems, and so spent several months trying to find the criminals."}, {"tag": "p", "text": "Over millennia of contact with offworlders, the Pacithhip imported and embraced galactic technology. Their own manufacturing capabilities, however, remained primitive; they had only approached the industrial level—fossil fuels and precision machinery—by the time of the Galactic Civil War."}, {"tag": "p", "text": "This relative backwardness and reliance on imported technology helped the Galactic Empire conquer the world after the rise of the New Order in 19 BBY. The new government contented itself with taking over operations of Shimia's spaceports, monitoring traffic to and from the planet, and discouraging Pacithhip from traveling offworld; otherwise, it left the Pacithhip to their own devices. With the defeat of the Empire in 4 ABY, the Pacithhip reclaimed their spaceports and pursued larger-scale trade with the outside galaxy. When the New Republic was established, more and more Pacithhip ventured off Shimia. In 137 ABY, the world fell within territory controlled by the Dark Lord Darth Krayt as part of his Galactic Empire."}, {"tag": "h2", "text": "Pacithhip in the galaxy"}, {"tag": "p", "text": "In the centuries after their first contact with the Galactic Republic, several Pacithhip left their homeworld to explore the greater galaxy, and members of the species could be found from the Rim to the Core. Some of these opposed their world's rigid caste system and sought instead to make their own destinies in the galaxy. However, rather than branding these dissidents outcasts or ostracizing them from society, members of the scholar caste encouraged them to seek their own ways, especially after the fall of the Empire. Offworld Pacithhip often took up the life of fringers, scoundrels, or scouts. Such Pacithhip were more likely to employ robotic stilts and hide their tails to better fit in with other species."}, {"tag": "p", "text": "Pacithhip integrated into the greater galaxy for centuries. A Pacithhip Jedi was a member of the Army of Light in 1,000 BBY, while another Pacithhip was known to be a lightsaber wielder. By 32 BBY, a number of Pacithhip lived in Mos Espa; one of their number, Bok Askol, served as a factotum and prospector. Mos Eisley on Tatooine, where they befriended other city dwellers; one befriended the slave boy Anakin Skywalker, for example. Tatooine's Pacithhip were known as skilled animal breeders; at least a few such Pacithhip made trips to Coruscant to sell their beasts. The Tatooine jerba was one rare breed they raised. Pacithhip in the Republic gravitated toward podracing. One worked as a podracer mechanic on Tatooine, another performed in a band at the Boonta Eve Classic of 32 BBY, and another, known as Durundo, was a podracer who competed in the final race of the Vinta Harvest Classic on Malastare in 32 BBY. Pacithhip were also present at the Casino District of Ord Mantell in 30 BBY, and Coruscant's Outlander Club and Dex's Diner in 22 BBY. Another member of the species was part of a circus that performed on Coruscant. A Pacithhip delegation was present in the Galactic Senate when Palpatine declared the formation of the Galactic Empire in 19 BBY. Later, during the Clone Wars, a stilt-wearing Pacithhip pirate served as part of the Black Hole Gang, a group of spacers who had become trapped in the Unknown Regions due to the gravitational pull of a black hole. This Pacithhip was eventually freed from this predicament when Jedi Padawan Nuru Kungurama opened a hyperspace portal using an ancient Kwa Star Temple."}, {"tag": "p", "text": "During the Imperial occupation of Shimia, emigration was discouraged, although it was never outlawed, and Pacithhip suffered from government anti-alien policies. Indeed, a Pacithhip was among other job seekers at the Coruscant Employment Center in 19 BBY, and sometime before 0 BBY, a Pacithhip passenger was featured by the Star Tours travel agency in a safety program for passengers on the StarSpeeder 1000. Some members of the species chose to collaborate with the new government in exchange for bribes; Pacithhip businessbeings on Dantooine, for example, sold the Empire the names of the Rebel Alliance's financial backers on that world. Erkwil was a Pacithhip spice dealer who lived in Mos Eisley on Tatooine. Ketwol was an asteroid miner and prospector who traveled widely during the period of the Galactic Civil War selling precious metals and booking charters. Although he came off as mysterious to those who met him, Ketwol was kind to others, and he befriended the Tatooine street thief Swilla Corey. He shared a jigger of Merenzane Gold with a Defel and a Devaronian in the Mos Eisley Cantina around the time Jedi Knight Obi-Wan Kenobi hired smugglers Han Solo and Chewbacca for passage to Alderaan."}, {"tag": "p", "text": "After the Battle of Endor, Pacithhip joined the throngs on Coruscant cheering the Empire's fall. With the rise of the New Republic, Pacithhip became more and more common off their homeworld, especially along the Corellian Run, where many became traders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character Ketwol was the first Pacithhip to appear in Star Wars canon. An artist at Industrial Light & Magic designed the character, and Howie Weed sculpted and painted the puppet for use in the 1997 Special Edition release of the film Star Wars: Episode IV A New Hope. Known as \"the elephant,\" the character, puppeteered by Weed, was digitally inserted into the film's cantina scene. Ketwol replaced the Shistavanen Lak Sivrak, a character whose unarticulated mask had bothered George Lucas. The Ketwol mask was reversed to become the character Melas, who replaced another wolf-like character, the Defel Arleil Schous, in the same scene. However, the Star Wars: A New Hope - The Special Edition comic keeps Sivrak in this scene, and the non-canonical story \"The Emperor's Court\" in Star Wars Tales 14 makes fun of Lucas's changes through Han Solo's protest against Lak Sivrak's testimony damning him for the shooting of Greedo; after all, as of the Special Edition, Sivrak was not present in the cantina to witness Greedo's death."}, {"tag": "p", "text": "The appearance of the Pacithhip has varied from source to source. The 1998 West End Games roleplaying sourcebook Alien Encounters depicts a long-legged, humanoid Pacithhip with three-fingered hands. However, in concept art for Star Wars: Episode I The Phantom Menace, artist Terryl Whitlatch included several Pacithhip among the denizens of Mos Espa—including an early concept for the Swokes Swokes gorgmonger Gragra—all of them as tall as a Human, but with decidedly non-humanoid bodies with long tails, short legs, and four long fingers. The production crew of the film created several Pacithhip masks for the film's extras, so several Pacithhip background characters appear in the Star Wars prequel trilogy who fit this same general build as West End's Pacithhip, not Whitlatch's. The Whitlatch design resurfaced in the 2001 book The Wildlife of Star Wars: A Field Guide, which recycles some of the concept art from The Phantom Menace. The 2003 Wizards of the Coast supplement Ultimate Alien Anthology follows Whitlatch's design. Still other sources, such as the cover to Wretched Hives of Scum & Villainy, show only the head and shoulders of Pacithhip characters and leave the body plan in doubt. To explain this discrepancy, the Hasbro Ketwol action figure was designed with mechanical stilts that could be hidden by trousers, a notion that later sources, such as the \"Ketwol\" StarWars.com Databank entry and The Complete Star Wars Encyclopedia support as a species quirk. Sources have yet to explain why some Pacithhip have three fingers and others four."}, {"tag": "p", "text": "In both the West End Games and Wizards of the Coast Star Wars roleplaying games, Pacithhip are available for players to use as characters. Both game systems' statistics for the species make them slightly clumsy and slow-moving, though strong relative to Humans."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}