{"url": "Padm%C3%A9_Amidala%27s_wardrobe/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Articles with elements from unlicensed sources", "Category:Articles needing additional sources", "Category:Clothing", "Category:Padmé Amidala's wardrobe"], "nodes": [{"tag": "h1", "text": "Padmé Amidala's wardrobe"}, {"tag": "p", "text": "Padmé Naberrie Amidala, Queen and later senator of Naboo, maintained a large wardrobe of extravagant, ornate and in some cases very elaborate disguises, dresses, and robes of office throughout her life. As a Princess of Theed, her dresses were simpler, geared more towards practicality than style. However, her robes and dresses during her terms as Queen were ornate and uniquely styled, geared highly towards Naboo tradition rather than comfort. After her second term as Queen ended, she opted for simpler, more practical clothing. After her marriage to Anakin Skywalker, she often wore dark, loose clothes to disguise her pregnancy."}, {"tag": "h2", "text": "Princess attire"}, {"tag": "p", "text": "Princess Robe. A few months before she took the throne as Queen Of Naboo, Padmé Amidala made a speech while wearing a bright red robe. The robe was simple, a wide garment that fell to her feet with wide sleeves dressed with two white stripes near the end. Over this she wore a tabard of a slightly lighter red, made of stiffer fabric. It went up and over her shoulders, flaring them, met at her neck, then traversed the length of her robe. The high collar of the garment was white, with a pattern of traditional Naboo symbols stitched in gold around it. Her hair was simply done, hanging down and somewhat straightened, with two braids, like headbands, running across the back of her head."}, {"tag": "p", "text": "Garden Attire. For this outfit, Padmé wore simple casual attire. This consisted of a red blouse with loose sleeves that were tied at the wrist by a gold ribbon. The blouse was decorated with magenta markings resembling armor, which ran down her back to become a knee-length coatskirt. At the waist, she wore a yellow sash with the top and bottom ends of it curled towards the center. She wore simple purple pants and pink slip-on shoes (but liked to walk barefoot on the grass). Her hair was straightened, with two braids running lengthwise across the top of her head."}, {"tag": "p", "text": "Meeting Wear. During one of her meetings with Ian in the garden, she wore a simple outfit of purple fabric. This outfit consisted of a purple blouse with a small collar. The sleeves were tied at Padmé's wrists with a red cord, and for jewelry she wore two gold bracelets on her right hand. Her hair was done in two half-crescent buns, stacked one on top of the other."}, {"tag": "p", "text": "Address Robe. During another address to the people as part of her duty as Princess of Theed, she wore another bright red robe. This one, however, was simpler. Her robe reached down to brush the floor, and her sleeves were wide. She wore a kind of shawl/tabard of a lighter red that sat on her shoulders then ran down the front of her robe. She wore her hair in a simple style consisting of having her hair gathered back behind her head in a kind of ovular bun, then the hair was drawn through a ring that hung down in a ponytail. Her hair was straightened."}, {"tag": "p", "text": "Palace Dress. When meeting secretly with Ian outside the Theed Royal Palace, Padmé wore a simple purple dress. The dress fell to her knees and was drawn at the waist by a thin sash of a darker purple. The cuffs and collar of the dress were yellow, with the curved, lapel-like collar decorated with a pattern of Naboo symbols in needlework all around. She wore loose, billowy yellow pants under the dress tucked into bright purple boots. Her hair was done with two braids running across her head, and the remainder of her hair put in a simple ponytail."}, {"tag": "h2", "text": "Royal attire"}, {"tag": "p", "text": "Regal gown. As the Queen of Naboo, Padmé Amidala was most prominently seen in a traditional mode of dress and make-up, designed to express her commitment to maintaining Naboo's cultural history, and her role within it. Her wide-shouldered, red throne-room robe was accented by hand-stitched gold embroidery and a series of illuminated sein jewels just above the robe's wide, potolli-furred hem. In addition to this robe, Amidala commonly wore an ornate gold face frame, including the prominent Jewel of Zenda, and had her hair combed over a padded form. She also wore white nail polish during her times as Queen, one of the few traditions she retained from her home village. This extremely formal appearance belied Amidala's young age, projecting an air of unwavering confidence beneath inscrutable white make-up. This attire was worn during her coronation. She wore it again prior to the Invasion of Naboo, when she confronted Nute Gunray via holographic transmission."}, {"tag": "p", "text": "Coruscant Apartment Robe. When meeting with Naboo's Senator, Padmé wore a crimped mauve under-gown under a stiff, turquoise dress with intricate patterns. Over this was a light gray robe held together with a wide, embroidered sash. The sleeves of the robe were wide and somewhat stiff, with curling needlework along the sides. A Shiraya fan headdress adorned her head, and was hung with Veda pearl beading and glass filaments."}, {"tag": "p", "text": "Galactic Senate Dress. While addressing the Galactic Senate on Coruscant, Queen Amidala wore an extraordinary dress that expressed the majesty of Naboo finery. The underdress was a glossy bright red, with a high collar decorated with ornate gold stitchwork and dangling beads. She wore a maroon cloak over this, with intricate orange hems decorated with fine needlework. The shoulders and bottom of the cloak were smocked in a crimson fabric, and lined from above with a golden, triple-braided soutache. The remainder of the cloak was stitched with embossed rosettes, and sported long, billowing sleeves. Above this she wore a dark, thick, faux fur cloak with wide, exaggerated shoulders. To complement this dress and to make her more visible in the vast chamber, Amidala's hair was dressed in a wide arc centered by an escoffiate headpiece with golden hairbands to keep her hair's shape. This arc was decorated with dangling orichalc suspensas capped with golden hairtip ornaments. The medal of the Royal Sovereign of Naboo served as the centerpiece of this elegant hairstyle."}, {"tag": "p", "text": "Foreign Residence Dress. This dark, somber dress was adopted by Amidala during her stay in Senator Palpatine's quarters on Coruscant, following the Invasion of Naboo. The black dress was befitting of the gravity of her situation, and served to subtly acknowledge Amidala's separation from her people. The fluffy, black, Cyrene silk dress was accented with beaded emblems over 240 years old that once adorned a former Queen's dress. The dress's sleeves were triangular, and within them was a smaller sleeve. The sleeves were lined with a dark, lustrous, Prussian blue material. Her hair was arranged in a fan shape with a prominent foreknot and small suspensas. The foreknot was intricate, with her hair rippling like small beads. It was capped with a golden hairtip ornament, with a single, disc-shaped bead dangling from it, which rested against her forehead. This hairstyle and costume, except in white, returned near the ignition of the Clone Wars when Padmé's decoy, Cordé, wore a similar robe when she died from Zam Wesell's assassination attempt on Senator Amidala."}, {"tag": "p", "text": "Traveling Dress. For her return trip to Naboo after calling for a Vote of No Confidence in the Galactic Senate, Queen Amidala wore a glossy purple dress under a dark mauve-hued overcoat. Her dark purple skirt was full and ruffled. The cerlin sleeves were lustrous and very full and billowy, almost completely hiding Padmé's arms. She wore part of her hair in two full buns at the top of her head, and the rest hung down into her headpiece. This antique diadem was made of gold and rested on her forehead. Her hair was covered in a purple, semi-opaque chersilk hair veil, and the hair which hung down was contained in sack-like extensions made of the same material. They were decorated with ribbons which crisscrossed around them."}, {"tag": "p", "text": "Yellow-cloaked Dress. Padmé Amidala also wore a large, yellow cloak with orange serpentine embroiderings and a hood depicting from the inside a dark panel of three planets amidst the cosmos, all on top of a red, puffed dress. The dress cuffs were of an alternating yellow and red pattern, while the inside arm sleeves showed a tone of bright green to the observer. Amidala wore it with the traditional royal make-up: white facepaint, the red scar of remembrance and two stylized beauty marks."}, {"tag": "h2", "text": "Disguises"}, {"tag": "p", "text": "Handmaiden dress. In times of trouble, Queen Amidala was known to use one of her handmaidens as a decoy, while she herself adopted the role of Padmé, an unassuming aide to the Queen. In doing so, she wore the simple robes sported by her retinue of handmaidens. These hooded dresses were tinted with spectra-fade dye, and made from soft trevella cloth. These dresses were dyed from orange at the hood to bright yellow at the lower hem. The underdress was of bright red, which showed through the full, slit sleeves of the trevella dress. Also, the bright red peeked out once more as a bill-like hood, which shadowed the face of the wearer. The dress was capped off with a red sash. The handmaidens wore a variant on the trevella-cloth design, most notably worn during Amidala's address to the Galactic Senate on Coruscant prior to the Battle of Naboo. These dark-red, hooded robes were decorated with the royal insignia, and the wide cowl served to mask the appearance of the wearer—ideal for those times when Amidala needed to travel incognito."}, {"tag": "p", "text": "While Padmé wore this disguise, her handmaiden Sabé wore a black spiderweb lace travel robe. It was worn with an immense black feather headdress and gemstone ear coverings."}, {"tag": "p", "text": "Peasant disguise. While on Tatooine following her escape from the Trade Federation on Naboo, Padmé Amidala wore the simple clothing of a farm girl, comprising a rough, blue blouse with full sleeves, with gray, rough-spun wrist bindings to keep out sand. This same fabric was used to make the smaller overshirt which reached down below her waist. This was tied with a blue belt inset by a red glass jewel of little value. Her billowy pants were black, as were her plain walking boots. Her hair was braided, with a braid traveling around the back of her head, a bun within the ring, and the rest of the braids running down her back to her waist. This helped her blend in well with the hardened people of Mos Espa as they searched for a new hyperdrive for their Nubian starship."}, {"tag": "p", "text": "Pilot disguise. On her way back to Coruscant to place her vote in the Military Creation Act, Padmé disguised herself as a Naboo pilot and her handmaiden, Cordé, played her decoy. For her disguise she wore the typical tactical pilot suit of her people, with tight red pants and a black undershirt with a high collar. A brown, long-sleeved shirt was worn over it. A vest was worn over this, with a utility belt with the gold Naboo Royal Space Fighter Corps emblem as a clasp. She wore simple tactical gloves and boots. Her hair was pulled back to keep it out of her face, done in several ponytails held in place by metal rings at various intervals. Her burgundy helmet included an auto-encrypting comm unit, anti-glare goggles, and a supplementary oxygen hookup."}, {"tag": "p", "text": "Refugee gown. This costume disguised Padmé as a young matron from the Thousand Moons system. The main part of the mustard-colored dress was a stiff upside-down cone that reached from her shoulders to her ankles. It was decorated with purple paisley designs with olive green leaves, and a feathery purple design running down the font, back, and sides. The bottom hem was decorated with a simple diamond design. On her shoulders she wore a kind of full-shouldered pauldron of the same mustardy color with an abstract floral design. Her loose sleeves were of a lighter, scalier material, and were drawn at the lower arm by a lower-arm band of the same design as the pauldrons. Her headpiece was made of a coppery metal with a tight skullcap with ridges running up into an intricate, fan-like crown. The headdress is made from orichalc metal, and the Flower of Life emblem decorates the crest in a continuous pattern. Under this piece was a length of mustard-colored fabric that looped under her face and wrapped around her neck. The headdress was sometimes covered by a golden lace veil. The veil was down when she departed Coruscant, up while traveling onboard the Jendirian Valley and down again as she traveled through Theed to meet with Queen Jamillia."}, {"tag": "h2", "text": "Action attire"}, {"tag": "p", "text": "Battle dress. When forced into battle against the Trade Federation, Queen Amidala adopted a dark magenta battle dress woven with energy-absorbing fibers to protect her against blaster fire. It featured a high collar that concealed a blast-absorbing pad, and the cloak was clasped in the front down to her waist. Her full sleeves were lined with fabric of a bright magenta. The shoulder seams were lined with a yellow fabric, and a calf-length coatskirt protected her legs. She wore black pants with a black utility belt that was set with the Naboo royal emblem. High-traction tactical boots that went from dark purple to yellow as it approached her toes completed the outfit. She wore her hair pulled back into two half-crescent buns stacked one on top of each other, to keep her hair out of her way. This battle dress was also sported by some of her handmaidens during their training."}, {"tag": "p", "text": "Padmé's handmaiden Sabé, disguised as the Queen during their meeting with Boss Nass, wore a more formal version of Padmé's battle dress. This outfit consisted of a long surcoat and skirt made from blast-dampening fabric, cinched with a broad waistband. Her hairstyle was kept simple, and the entire costume was designed for maximum freedom of movement. During the Battle of Naboo, Sabé fought her way through the Theed Royal Palace in this dress, and was able to draw attention away from the real Queen long enough for Padmé to resolve the conflict."}, {"tag": "p", "text": "Geonosis attire. Free of any political restraints, Padmé could wear more practical clothing on Geonosis. She wore a simple white jumpsuit and a tan utility belt with an off-white shawl, and sported an intricately looped hairstyle which kept her hair at the back of her head in a bun and out of the way, thus preparing her for action. In addition, she wore a silver armband that signified her political service. Her tan boots included light shin armor and a firm grip."}, {"tag": "p", "text": "Spy jumpsuit. Meant for quick action and maximum movement, this black jumpsuit with a low neckline was worn with gray boots and gloves with a matching gray utility belt. Gray stripes decorated the outer thighs of her suit, and her hair was done up in a twin-bun hairstyle."}, {"tag": "p", "text": "Ilum attire. On Ilum, Padmé wore a jumpsuit similar to that she wore on Geonosis, except with a hood. She also wore fur-laced combat boots and gloves along with a fur-trimmed cloak, also with a hood, that clasped at the neck. The jumpsuit was heated to keep her warm on the harsh landscape of Ilum. For protection, her outfit was made in white and light blue, to camouflage her against the landscape, wore a utility belt, and carried a blaster."}, {"tag": "p", "text": "Malevolence attire. Padmé was traveling to coordinates given to her by Supreme Chancellor Palpatine to negotiate with a representative from the Banking Clan, but it was only a trap part of Palpatine's plot as Darth Sidious to lure her to the Malevolence during the ongoing space battle there to be taken as a hostage. The outfit consisted of a tan jumpsuit with a dark crimson vest with brown boots and fingerless gloves. Also on the upper left of the vest, she wore a Senatorial rank badge. She wore a brown belt with a holster for her blaster. Her hair was drawn through small, oval, blue beads beginning where the hair left the head in three rows across, leaving room for gaps, with her hair down to her middle back."}, {"tag": "p", "text": "Rodia attire. During the Mission to Rodia, Padmé wore a white jumpsuit and tan utility belt virtually identical to the one she wore on Geonosis, including the silver political service armband. The difference was the shawl, which was purple and hooded with a face cover that left only her eyes visible. The utility belt included a holster for her ELG-3A blaster pistol."}, {"tag": "p", "text": "Hazmat Gear. During the Blue Shadow Virus Crisis on Naboo, Padmé wore a hazmat suit. The bio-hazard gear was made out of a yellow material tasked with protecting the senator from any airborne virus that may be present. The suit is equipped with a helmet and air tubes to pump clean oxygen to the senator."}, {"tag": "p", "text": "Wetsuit. While negotiating on Mon Calamari Padmé donned this suit to help her with the underwater environment. The suit was red and covered her entire body, ending with a skullcap. The midsection was black, flexible rubber and bounded by yellow stripes, and there were similar blue paint Naboo insignias running up and down her legs. She wore a black belt over top of this. She also had a light blue metal detailing on her neck that had the Naboo insignia on it to identify herself as the Senator. She also wore scuba callout communicators on her wrists and a helmet with an oxygen supply hook up when underwater, with the tank strapped to a backpack. Her helmet also sported a yellow Naboo insignia on the back. She wore black flippers on her feet to assist with her swimming."}, {"tag": "p", "text": "Tusk cat riding gear. During the Victory Races of Naboo, Padmé wore trappings that were very similar to her aforementioned battle dress, only with a brighter hue and a shorter cloak. As this apparel was designed for an official sporting event and not for battle, the make-up and hairstyle were more formal, complete with golden earring pendants."}, {"tag": "h2", "text": "Senator's attire before the Battle of Coruscant"}, {"tag": "p", "text": "Senator dress. Amidala wore this dress during her address to the Galactic Senate two hours after she was almost assassinated. This dark blue velvet dress included a peek-a-boo panel of golden yellow, with the lapel and collar turned up. Connected to the either side of underside of the collar was a glossy, crimped scarf-like shawl that met at her mid-back, held together by a large, beaded ribbon. The ends drifted part as they reached her ankles. The full sleeves were tied off at the elbow, giving way to a drawn-up sleeve of lustrous material. The yellow panel was decorated with needlework, especially around the high collar, which was decorated with beads. The surcoat was embellished with large Naboo designs along the inner hem dine in light yellow thread, and the trim was a light shade of blue. Her hair was done in an intricate upside-down dual-fan shape, with a half-crescent bun in the back. She also wore a small jeweled diadem."}, {"tag": "p", "text": "Loyalist dress. Amidala wore this dress in Chancellor Palpatine's office after Zam Wesell attempted to assassinate the senator and in a session of the senate when she was confronted by Anakin Skywalker about the spying mission she had denied. For this outfit, Padmé wore a dark indigo bodice and skirt under a dark purple overcoat. The bodice was studded with beads and pearls along the low-cut neckline, and the front panel of the skirt was decorated with dark, beaded scrollwork, as were the sleeves. The overcoat was decorated with intricate swirls, almost resembling a river as it flowed down to touch the floor. The shoulders of the overcoat were flared and decorated with beads. The long sleeves were done in the same fabric as the overcoat, with a slit to show the sleeves of the bodice, with those full sleeves showing the smaller sleeves within them. Her hair was in a style almost resembling a cone, held in place with a metal headpiece. It was a severe hairstyle, one which conformed to diplomatic etiquette. She also wore a neckband given to her by the Naboo Council."}, {"tag": "p", "text": "Packing dress. Amidala wore this in her apartment while packing her necessities for her trip to Naboo and eventually Tatooine. This outfit consisted of a light gray blouse with puff sleeves that were drawn tight at the upper arm to become long sleeves. Silver bands, four on each side, encircled the sleeves along the upper arm. The skirt was of a darker gray, and was pleated just so it rippled. Under this skirt she wore an uncomfortable blast-dampening underskirt. Over the blouse she wore a high-collared, double-breasted corset of a darker gray material. The front of the corset, where it overlapped, was decorated with fine embroidery, and within the corset was a light armor used for protection. Her hair was done in unique semi-crescent buns on the sides of her head, and she wore a delicate headpiece made of embossed pieces of metal connected by tiny silver chains. The subdued colors of the dress expressed her grave mood."}, {"tag": "p", "text": "Imperial dress. Due to her public service both as Queen and as Senator, a large tapestry depicting Padmé was hung in the Imperial Palace in memorial to her. The dress she wore in the tapestry was made of a drapey white fabric. The sleeves were decorated with braids of gold along the sides, and were tied by a gold cord halfway up her lower arm. After the cord, the sleeves widened, and within that was another sleeve with gold embroidery along the hem. Her belt was white, with a layer of purple beneath it forming an edge around it and a piece of gold metalwork accenting the center. She also wore a pastel purple cape with a red stripe at the shoulders, and a gold braided chain along the neckline. It was clasped by an intricate gold pendant inset with a white jewel, with three pieces of metal dangling from it. She wore a necklace of gold chain centered by an embossed piece of metal. She wore her hair in a braided bun, and a delicate headpiece of gold. Gold earrings reminiscent of shells adorned her ears. The tapestry still hung in the Imperial Palace during the Thrawn campaign, where Padmé's son and daughter frequently passed it by, oblivious to the woman's identity."}, {"tag": "p", "text": "Meeting dress. This simple outfit consisted of a light crimson low-cut dress with a dark brown overcoat. The slightly ruffled collar of this coat was stiff, high, and fan-shaped in the back. Her hair was done in a twin bun hairstyle exactly like that of her daughter Leia."}, {"tag": "p", "text": "Presidential dress. When meeting with the President of Bri'ahl, Padmé wore a black undershirt that reached below her waist under a red blouse with gold trim along the hems. A swirl pattern was also done in this gold trim. The sleeves were loose but not wide, and the red skirt she wore was gently pleated. She also wore a dark red neckband. Her hair was done in two cones from the lower part of either side of her head. These were secured with a gold cylinder, and a small triangular gold diadem adorned her forehead."}, {"tag": "p", "text": "Farewell dress. Knowing that it would be a long while before she saw her husband again, Padmé was saddened when Anakin was assigned to leave for Muunilinst. When she bid him farewell, she wore a pastel pink, off-the-shoulder dress with a bodice decorated by crisscross diamond shapes, decorated along the bottom hem with intricate needlework capped by a full tassel. Her loose sleeves were made of a sheer material, with an intricate tassel dangling off the ends with pearls decorating the upper part. Her skirt was pleated and brushed the floor, with a feathery, fan-like trail reached the floor behind her. Her hair was tied into two buns on each side of her head, done in a half-crescent, and held in place with a delicate, purple headpiece. She wore a diadem decorated with pearls."}, {"tag": "p", "text": "Yacht dress. This dress was very similar to her Loyalist dress, with a conical hairstyle held in place by a gold-colored metal headpiece, a neckband, and her dark purple attire. However, the dress was slightly different, with her blouse clasped together, decorated by a simple swirl motif and a lighter colored hem. Her undershirt was the same color as the blouse, and her sleeves were decorated very simply, with a stripe encircling the upper portion and a hem decorated with triangular embroidery. Her skirt, which was a color slightly lighter than her blouse, was crisply folded in wide pleats."}, {"tag": "p", "text": "Gift dress. This dress was almost symbolically resembled a stream in its color, flowing feel, and sheer white cape. The dress was a delicate light blue with rippled flared shoulders. It had a simple form-fitting top with light blue decorations, and the light, transparent cape was cut in a simple crescent. Her hair was done relatively simply, with two braids looping from before her ears to behind them, with a bun at the back of her head. On the back of the bun was a blue jewel-like hair clip. This hairstyle is similar to the one worn by her daughter Leia during her stay on Bespin."}, {"tag": "p", "text": "Blue Gray dress. Amidala wore this dress often. The dress has two main parts. The under-dress is a dark blue, with a gray waistband. The band has designs on it. The over-dress was a lighter blue that split at the middle with similar designs as the waistband. The shoulders were puffed, and the sleeves had similar designs as the band. Her hair was held in a silver headdress, split into two sections in the back. It had a strip of metal that went around her head, and had rectangular breaks that showed her hair. (Note, in gallery to see a better view click on image.)"}, {"tag": "p", "text": "Conference dress. Senator Amidala wore this dress on a mission to Alderaan, where she led a conference addressing the humanitarian problem of the war refugees. The dress she wore consisted of two pieces. The underlying dress was a long-sleeved, pleated, brown dress. This was covered by a tan sleeveless tunic that split at the middle. Ornate designs traced the boarder of the split. The senator accessorized with a silver necklace and a silver headdress. Her hair was bunched into two buns hidden by the high collar."}, {"tag": "p", "text": "Red Senate dress. This dress had a light red middle section of the shirt. The sleeves were a darker red up to her forearm. There, the color changed to a very dark red. Additionally she wore fingerless gloves and brown boots. Her headpiece was also red, with a jewel in the front, and it rested on the top of her head. Her hair curved down by her ears so it was held firmly in place."}, {"tag": "p", "text": "Green dress. This dress was a light olive green above the waist, then below it shifted to a darker olive green. The skirt had simple designs on it. The shirt was long sleeved, with no designs on the top. She wore a simple silver headband. A light gray variant of this dress was also worn by Padmé."}, {"tag": "p", "text": "Black dress. Padmé wore this while hosting Rush Clovis to discuss the Banking Clan. It was a long, sleeveless black dress with a greyish-black bodice than moved to darker black towards the end. There was also a middle stripe matching the bodice on the skirt. The dress was covered with dark black lace and four rows of black beadwork on the sides met in the middle to form a large stripe on the bodies leading into the skirt. The bodice was attached to four rows of light blue beads that attached to the neckline, with another, larger blue bead, connecting the black neck band to the back. She wore long black fingerless gloves that matched the bodice, with the hems being in the darker black of the skirt. She wore a blue headband matching the beads on her neck piece, and her hair was up in twin buns. She wore black low heeled shoes with an ankle strap underneath her gown."}, {"tag": "h2", "text": "Senator's attire after the Battle of Coruscant"}, {"tag": "p", "text": "Collared dress. When the Battle of Coruscant began unexpectedly, Padmé wore this blue dress. The underdress was a slinky light blue garment with a low neckline. Over this she wore an open royal blue coat with a wide lapel and simple motifs. The collar of this was a light blue, stiff and tall, resembling the petals of a flower. The hems of the wide sleeves were of stiff lace. Her hair was drawn back behind her head in a kind of bun then the remainder was pulled up into a pair of swirls above her head, accented with a small hair clip."}, {"tag": "p", "text": "Velvet cloak. She wore a simple purple dress almost completely covered by a rich, voluminous, dark purple robe that enfolded her almost completely. The underside of this cloak was decorated with a spotted pattern. This voluminous robe was designed to disguise her pregnancy, and, coincidentally, blended in fairly well with the shadow she hid in to meet Anakin. She also sported an elaborate coiffure twin-bun hairstyle that originated in Naboo, a hairstyle which her daughter would later mirror. The dress also included a pair of heirloom suspensas."}, {"tag": "p", "text": "Delegation dress. Padmé wore a long, green dress during the meeting of the Delegation of 2000 in her apartment. The dress was somewhat conical, which disguised her pregnancy well. The V-neck of the dress was accented with a small jeweled pendant with dangling beads. The dress had long, loose sleeves, and was decorated with intricate motifs. A wide purple sash was tied around her just above her swollen belly, adding a splash of color to the outfit. The dress also included a hood, which she frequently wore up. She had her hair down and curled when she called the meeting."}, {"tag": "p", "text": "Visiting attire. This beautiful outfit combined a range of fabrics and colors to bring together a unique look. She wore an iridescent purple dress decorated with scrollery, especially as it neared the hem. The side of the dress was grayer, with swirling designs done in needlework, as were the sleeves. She wore a purple full-shoulder pauldron decorated with swirling designs, clasped with an umber-colored disc. Under this was a dark purple cape with scrollery around the edges. The collar was studded with beads, as were the ends of the inner sleeves. Her hair was done in a unique style, with small buns on each side and a small loop beneath each of them. The rest of her hair was gathered up in a braid, with a strip made out of slivery material braided in with it. An umber, jewel-studded headband completed the outfit."}, {"tag": "p", "text": "Peacock dress. She wore this billowy, somber dress when meeting with Chancellor Palpatine to discuss the conclusion that he had grasped and held on to too much power. The glossy dress was turquoise in color, shaped like an upside-down cone, and tightly folded in tiny pleats all around. It had a high collar which traveled far up her throat. The puff sleeves were drawn at the lower arm, and beads dangled from the cuff. Over this she wore a long, brown, layered vest that was somewhat triangular from the front, with a cape that went over her arms. Tassels hung off each point, and the entire coat was decorated in scrollwork done in ribbon. Her headdress was unique, shaped like a rectangle with an in-facing scalloped front. From the point back, centered on her forehead, was done with strings of coppery metal in serpentine swirls. The sides were done in a decorative yet simple style in a grayish metal with Padmé's hair done in myriad tight ringlets resembling strings of beads."}, {"tag": "p", "text": "Beaded dress. When Anakin further told Padmé of his uneasiness with the Jedi Council, she wore a purple dress with her hair down and curled. A simple pattern was found throughout the dress. It was decorated with a kind of belt made from black beads, centered around a large black jewel with dangling beads. She wore a matching necklace. Over this was a black lace housecoat."}, {"tag": "p", "text": "Senatorial dress. This was a very severe look for Padmé, a reflection of the news she heard at the Senate, when Palpatine announced the birth of the Galactic Empire. She wore a long, purple dress with the inside hems done a wide panel of light fabric and a wider panel of darker fabric. Another lighter purple traveled up her sides and made her puff sleeves, and her high collar was turned up. Over this she wore a stiff, mid-back cape that reached around her arms like pauldrons. The purple cloth had a decorative, ruffled top hem, and was clasped with two silver diamond-shaped clasps and one triangular clasp. Her hair was done in a simple bun, decorated with a hairpiece resembling two silver wings."}, {"tag": "p", "text": "Revelation dress. This outfit began with a low-cut, glossy purple dress decorated with swirling embroidery. Over this she wore soft, fluffy, dark blue, V-neck cloak, clasped with two beaded tassels. Down her shoulders and the side of her sleeves, there ran an intricately embroidered floral pattern. There were beaded tassels where this pattern met the neck, and her sleeves were loose. It was obvious she was not expecting company, as this dress did not hide her pregnancy very well. Her hair was done in a simple style, with it curled along the side until it met in the back. It was held behind her head with a wide, embossed, silver band with three other, smaller bands at intervals down the length of her hair. Her headpiece consisted of four metal headbands sprouting from the thick of her twisted hair."}, {"tag": "h2", "text": "Travel attire"}, {"tag": "p", "text": "Homecoming attire. Padmé wore this light blue outfit when she arrived to her home on Naboo with Anakin. The garment had two pieces, the top was of a crimped light blue fabric, decorated simply with silver trim and tiny shells, and a decorative knot in the center. The outfit was turtle-necked, and her sleeves were long. The bottom piece were a simple light blue skirt, cut wide to give her freedom of movement, clasped on her left side. She sometimes wore a decorative white cloak over this, which was decorated in a light blue abstract shape a little down from the collar. It was clasped with a carved ivory clasp. She wore her hair down in loose ringlets, held back by a simple light blue headband decorated with a diamond pattern."}, {"tag": "p", "text": "Villa retreat dress. The dress started at a pale yellow at her neck and moved through shades of pink and orange until at the hem at her ankles, where it reached lilac. The dress was gathered up at the waist with clasps made of tassels and pearl. This was then draped over her arms, where it was hemmed with a wide ribbon. The dress was held up by five layered pieces of metal resembling shells, with the top one reaching part way around her neck, tied off with a piece of ribbon. Similar pieces of metal adorned her upper arms. When wearing this, her hair resembled a conch shell, held in place by headbands inset by pearls. The design of her dress reflected Padmé's love of water, and it was little wonder that it was the water that she discussed with Anakin while wearing it."}, {"tag": "p", "text": "Picnic dress. Padmé wore a light, summery dress in a shade of yellow to be romantic and show Padmé's fun side. The tan skirt of the dress was light, and decorated with tiny, white, stitchwork flowers and olive-colored leaves. Her bodice was a golden shade of yellow, with brightly embroidered flowers, leaves, and scrollery. The full sleeves were tan, and were tied at the lower arm by brightly colored ribbons. Over this she wore a sheer, light cape with flowers similar to those on her corset, with scalloped edges done in bright yellow and green. The dress was ribbon-strapped, with single flowers capping off each one. Her hair was down except for two buns on the side of her head decorated with a yellow hairnet. Her hair was tied behind her by ribbons similar to those on her sleeves, and she wore a green headband decorated with stitched-on flowers."}, {"tag": "p", "text": "Dinner dress. For dinner with Anakin, Padmé wore a black corset style dress with a black, metallic printed mermaid skirt accessorized by a long, drapey, beaded necklace that ended at her knees. For dinner, she wore a black feathery shawl which was removed afterwards. She also wore long, black leather, fingerless gloves. Her hair was done in a twisted braid with a headband for decoration."}, {"tag": "p", "text": "Tatooine cloak and attire. On Tatooine, Padmé wore a very light blue midriff dress with silver embroidery. The top was wrapped around her, with wide, loose sleeves that became a cape behind her. The hem of the cape was decorated with silver motifs. The bottom was accessorized with a tightly drawn, sash-like top at the waist that was decorated in the center with a silver beaded pendant, with a sash hanging from it. The pants were wide and loose. She wore two buns on the side of her head, with the rest of her hair handing down. She also wore an intricate, delicate metal headpiece. While traveling through Mos Espa, Padmé wore a full-length, large-cowled cloak. It was done in indigo material, with abstract embossed patterns dyed silver. It was clasped with a simple, curling clasp studded with beads. The dress kept her cool in the heat of Tatooine's twin suns, while the cloak disguised her further as an inconspicuous traveler, as well as protecting her from the suns' rays."}, {"tag": "p", "text": "Later, during the Clone Wars, she used the cloak again. After she was wounded during an assassination attempt by Aurra Sing, she had a BD-3000 luxury droid wear this cloak to try to fool the assassin while Amidala was guarded in her quarters. However, Sing was not fooled, but she was stopped before she could end the Senator's life."}, {"tag": "p", "text": "Tatooine blue dress. Padmé wore a long, light blue, pleated under-dress that swept the floor, with an off-the-shoulder blue, star-shaped poncho over it. This poncho was decorated with bright embroidery in flower shapes on her sleeve with silver along the hem of the sleeve, and an intricate, circular pattern at the apex of the bottom of the poncho. Ribbons decorated with beads hung off the lower hem. Her hair was worn down while wearing this loose dress."}, {"tag": "p", "text": "Gala dress. This dress, similar to the Dinner dress, was a slinky, form-fitting dress with a low neckline. It was close-fitting until it reached her knees, where it fanned out. To accessorize, she wore silky black gloves that reached halfway up her upper arm. She also wore a gold neckband with several dangling beads. Her hair was pulled up into two buns on the sides of her head."}, {"tag": "p", "text": "Travel cloak. Similar to her Velvet cloak, this simple, nondescript mantle was blue and reached her feet. The long sleeves, though a little loose, were not wide, and it included a simple hood. Her hair was worn up in a twin-bun style, and her delicate headpiece was of gold, which went across her forehead along her hairline, at which it formed a diamond shape with a pink jewel at the upper point. The ends of the headpiece followed the curl of her buns, accenting it."}, {"tag": "p", "text": "Red dress. This magenta dress was, though comfortable, somewhat tight. It was long-sleeved, with a straight-cut skirt with two seams running down the front, creating a kind of panel. Over this, she wore a dark red cloak with hood that clasped at the neck with a gold clasp with a pink jewel inset. The cape part of the cloak was slit where her arms were, so that part of the cape fell in front of the arms, allowing her to hide them within it."}, {"tag": "p", "text": "Blue travel attire. This outfit was worn by Padmé on multiple occasions such as when she returned to Naboo during the Blue Shadow Virus Crisis as well as during her voyage to Cato Neimoidia. This outfit consists of multiple pieces. The turtle-necked top has two layers of blue-shaded fabric that exposes her abdomen. The lower part of the outfit is composed of long light blue pants with a waist shawl clasped together with a heavily decorated clasp. The outfit also sports silver arm bands and an ornate headdress."}, {"tag": "p", "text": "Cato Neimoidian dinner dress. While on a mission on Cato Neimoidia, Padmé donned this dinner dress. An elegant dress, this purple, backless dress sported a long train at its end. The outfit included matching arm-length gloves, shoes and purse as well as being accented by a silver pendant necklace. Padmé wore her hair pulled back and braided, ending with a silver hair clip."}, {"tag": "p", "text": "Raxus dress. To meet with Mina Bonteri to discuss an end to the Clone Wars, Padmé wore this dress. The dress was orange on both sides, with a yellow stripe running down the middle. The dress had a high neckline in the same yellow color, as well as a tan hood to conceal Padmé's face. Padmé also wore orange handless gloves that went up to her elbow and an orange sash around her waist. There were also lighter yellow stripes on the neckline, the hem of her sleeves and on the hem of her gloves. She wore her hair up in a ponytail, with the lower half folded up and put in a bun with a gold band. Around her neck, she wore a necklace of rectangular yellow beads on a brown cord."}, {"tag": "p", "text": "Mustafar attire. This was a simple outfit, suited more for action, which is exactly what she ended up walking into when she went after her husband to see if what Obi-Wan had told her about Anakin's dark deeds were true, though more to convince herself that they were not. She wore a simple tan shirt that reached her legs. The turned-up collar was clasped with a delicate piece of metal goldwork, and, to help ease the back pain associated with pregnancy, she wore a harness made of a brown material clasped in the middle with an intricate gold pendant. Also to help with her pregnancy, her boots included cushioned inserts. She wore tan gloves that reached from her knuckles up to her upper arm. To complete the outfit, she wore tight-fitting white pants with simple brown boots. Her hair was pulled back away from her face. Her hair had been worn into two large twisted braided buns, with the remainder of her hair worn into a long braid that ended at her lower back, tied off with a piece of leather. This outfit revealed her pregnant figure clearly because she expected to be around only Anakin."}, {"tag": "p", "text": "Birthing robe. Padmé wore a simple white robe, was barefoot, and had her hair down when put under the care of the Polis Massans."}, {"tag": "h2", "text": "Nightwear"}, {"tag": "p", "text": "Coruscant nightdress. This simple long-sleeved white, drawstring-necked nightdress was worn after the attempt on Padmé's life via the bomb set on her starship."}, {"tag": "p", "text": "Nightdress and robe. When investigating the source of Anakin's discomfort, Padmé wore a simple V-necked white nightdress under a blue smocked robe with gold trim along the edges of the sleeves up to her neck. Her hair was completely down."}, {"tag": "p", "text": "Blue trimmed nightdress. This nightdress was more elaborate than most of Padmé's nightdresses. The nightdress was white with wide, off-the-shoulder sleeves. The nightdress had a low back, and the sleeves' upper hems and the back hem was trimmed with a wide, blue, embroidered band which held the three pieces together. This band also looped up from the front of her nightdress and around her neck to hold it up. The nightdress went to her ankles, and her hair was worn down and slightly straightened."}, {"tag": "p", "text": "White nightdress. This simple white nightdress consisted of an off-the-shoulder dress with a white ribbon looping around her neck and wide sleeves not connected to the nightdress proper, held up by a semi-tight white ribbon at the top hem. A sash for decoration wrapped around her waist that made a V in the front, with the point reaching to the hem of the ankle-length nightdress. Her hair was worn down and straightened."}, {"tag": "p", "text": "Gold nightdress. This nightdress, like most of Padmé's, was white with a V-neck. The silky nightdress's neckline was hemmed with lace, and over it she wore a gold robe with wide sleeves. The robe reached to her ankles, and her hair was down and slightly straightened."}, {"tag": "p", "text": "Flight nightdress. The white nightdress she wore on her over-night flight to meet with Bail Organa on Alderaan. Accompanied by Ahsoka Tano because she felt the senator was in danger, startles Amidala when Ahsoka thinks the killer is in her room. This nightdress resembled her Coruscant nightdress but with no drawstringed-neck."}, {"tag": "p", "text": "Veranda nightdress. Padmé wore this as Anakin revealed his nightmare of her death to her. The glossy nightdress was of a light blue, near lavender. It was low-cut, held up by several ribbon straps. Out of an embossed metal pendant at the center of the top hem came forth six strings of pearls, three on each side, that wrapped around her arms. Several bright blue braids came out of the bottom of the pendant. The back of her nightdress was folded in a decorative fan-styled pattern, held in place by several silver clasps. Her hair was down except for a small hair clip. The nightdress was accessorized with the Japor snippet given to her by Anakin when they first met."}, {"tag": "p", "text": "Aqua nightdress. Padmé wore this simple aqua nightdress the night of the Raid on the Jedi Temple and Anakin's fall to the dark side. It was low-cut, held up by straps. The hems and straps were decorated with delicate embroidery, and were studded with pearls and tiny shells, further carrying the theme of water, the element Padmé was so enamored with. The front of the nightdress was slit, revealing a glossy light blue fabric beneath it, and a simple cape flowed off her back. She wore aqua-colored gloves that started at her wrist up to her upper arm, the bottom of which was also decorated with embroidery, shells, and pearls. She wore her hair down, held back by a delicate headband studded with aqua-colored beads."}, {"tag": "h2", "text": "Formal attire"}, {"tag": "p", "text": "High court outfit. While representing Ahsoka Tano in her trial in the aftermath of the eventful bombing of the Jedi Temple Hangar around 20 BBY, Amidala wore a tight, dark gray dress with a puff sleeve around the elbows and a long, silver-colored band of cloth over her shoulders with four dark stripes at chest height. She also wore a metallic headband that covered her ears, while also sporting her hair in a simple bun."}, {"tag": "p", "text": "Parade gown. With the Trade Federation defeated and Naboo free once more, a celebration was held outside the Theed Royal Palace, which Queen Amidala attended. During the celebration, she wore a luminous pale pink ceremonial dress. The silky outfit included a kind of banner that hung from her low neckline. Over this, she wore a cape decorated with myriad pink silken petals. These petals were designed after flowers found near Padmé's home village, which bloomed only once every eighty-eight years, and so signified a time of special celebration. The pink petalled cape and long white dress was topped by an aurate fan capped with jeweled finials was commonly used to signify continuity in ancient Naboo fashion. She also wore a delicate royal diadem, and, for simplicity, wore minimal jewelry. Her hair was drawn up into a unique bun with five crescents in a star shape along the back of her head, and she wore small, white, pointed-toed shoes. The plain white dress signified her and her people's pure happiness at Naboo's newfound peace. The dress also echoes the outfit her daughter would wear during the celebration on Yavin IV."}, {"tag": "p", "text": "Wedding gown. For her wedding at Varykino, Padmé wore a beautiful and intricate wedding gown made of lace and beads with a lace veil. The wedding gown was long and flowing, touching the floor. The wedding gown was white, with intricate, off-white scrollery done in ribbon throughout. The sleeves reached to her elbows, and was hemmed with scalloped lace. Her arms were decorated with scrollery. The headpiece was made of lace, with a band decorated with swirl scrollery. The headdress hung down to her mid back, and pearls studded the entire wedding gown. She wore her hair down as she bound her decision to pursue her love rather than deny it."}, {"tag": "p", "text": "Funeral dress. This simple dress was done in a light, pleated, aqua blue fabric under an iridescent dark blue cloak studded with pearls. Padmé was seen as though she was floating in water, the element she was so connected with. The colors of the dress, with her hair gently fanned out, and her body surrounded by fresh flowers and leaves evoked the symbol of her soul returning to the lake at which she and Anakin were wed and first expressed their love. Her pregnancy was clearly visible, in order to protect the twins from discovery by making it appear as if they had died within her, before being born. In her hands she clasped the Japor Snippet given to her by Anakin when they first met as she was slowly led away to her final resting place."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The costumes designed for Padmé in Star Wars: Episode I The Phantom Menace were widely acclaimed, and were featured in a Vogue magazine spread. The intricate costumes also served an important plot function, as they allow Padmé's handmaidens to impersonate her behind voluminous robes and white makeup."}, {"tag": "p", "text": "Several words used to describe her costumes as Queen of Naboo were coined by archaeologist Dr. David Reynolds, to imbue the costumes with a sense of imaginative history."}, {"tag": "p", "text": "Padmé's costumes inspired two paper doll books, the Star Wars: Episode I - Queen Amidala Paper Doll Book and the Star Wars: Attack of the Clones - Padmé Amidala Paper Doll Book."}, {"tag": "p", "text": "There were over 250 individual petals on the parade dress's cape."}, {"tag": "p", "text": "The dinner dress was the only costume of Padmé's that was designed by George Lucas himself."}, {"tag": "p", "text": "The robe of the nightgown worn on Naboo was made by hand-smocking more than twenty yards of panne velvet, a process that took more than a month to complete before they could begin making the dress."}, {"tag": "p", "text": "This peacock dress, though used for the official Revenge of the Sith theatrical poster and on the soundtrack, was never seen in the film. The peacock idea was to show that Padmé was in disguise concerning her pregnancy."}, {"tag": "p", "text": "The wedding gown was mostly made from an antique lace bedspread from the late Edwardian period. Because there wasn't enough material to make the preconceived design, they altered the pattern to make it fit. The veil was made of Maltese lace, and the headdress was decorated with Edwardian wax flowers with beaded pearls. To further decorate the dress, the costume designers made over three hundred yards of French-knit braid for the Cornely scrollwork found throughout the dress. It was then studded with pearls. Interestingly, when shooting the wedding scene in Italy, production supervisor Guido Cerasuolo exclaimed \"Ah, Italian lace!\" upon seeing the outfit."}, {"tag": "p", "text": "According to Trisha Biggar, the headdress used for the regal gown was hooked up to a pulley made of fishing wire, to help Natalie Portman support the weight of the headdress."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}