{"url": "Padm%C3%A9_Amidala/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Semi-protected articles", "Category:Articles in need of updating", "Category:Apprentice Legislators", "Category:Diplomats", "Category:Females", "Category:Galactic Republic senators", "Category:House Naberrie", "Category:Humans", "Category:Imperial Senators", "Category:Monarchs of Naboo", "Category:Naboo resistance members", "Category:Nobility", "Category:Pilots", "Category:Skywalker family"], "nodes": [{"tag": "h1", "text": "Padmé Amidala"}, {"tag": "p", "text": "Padmé Naberrie of Naboo (publicly known by her regnal name, Padmé Amidala, and also known as Her Royal Highness, Queen Amidala of Naboo from 33 BBY to 25 BBY, as Her Excellency, Senator Padmé Amidala of Naboo from 25 BBY until her death and as Padmé Naberrie Skywalker after her marriage) was the younger daughter of Ruwee and Jobal Naberrie, and the sister of Sola Naberrie. Later in her life, Amidala became the secret wife of Jedi Knight Anakin Skywalker and the mother of Luke Skywalker and Leia Organa Solo, two of the most important figures in galactic history. She was also the grandmother of Jaina, Jacen, and Anakin Solo, as well as Ben Skywalker. This relationship made her great-grandmother of Allana Solo, Jacen Solo's daughter, and an ancestor of Nat, Kol, Cade Skywalker, and Ania Solo."}, {"tag": "p", "text": "Amidala was the democratically elected Queen of Naboo before representing the Chommell sector as a Senator in the Galactic Senate. As Queen of Naboo, Amidala fought bravely to liberate her people during the Trade Federation's invasion in 32 BBY, thus becoming one of the most respected political figures in the galaxy. In 22 BBY, following the Military Creation Act, Anakin Skywalker was assigned to protect her, and following the Battle of Geonosis, the two secretly married on Naboo after the pair fell in love."}, {"tag": "p", "text": "Senator Amidala participated in many events of the Clone Wars, both political and military, while also becoming pregnant to her husband. Around the end of the war, she doubted the motives of the Galactic Republic. In 19 BBY, appalled by the dissolution of the Republic and the creation of the Galactic Empire, she signed the Delegation of 2000 along with Bail Organa, Mon Mothma, and other Senators."}, {"tag": "p", "text": "After Anakin slaughtered many Jedi, including younglings, Obi-Wan Kenobi came to tell Padmé about Anakin's transformation to the Sith Lord Darth Vader. She refused to believe him, and went to Mustafar to find her husband. Unknown to her, Kenobi had hidden aboard her ship in order to find his former apprentice. When Kenobi revealed himself, the newly christened Sith Lord assumed she had betrayed him, and he strangled his wife using the dark side, knocking her unconscious."}, {"tag": "p", "text": "After Kenobi defeated Vader, and left him for dead, he took Amidala to a medical facility on Polis Massa, where she gave birth to fraternal twins and named them—the boy, Luke, and the girl, Leia."}, {"tag": "p", "text": "But her husband's fall to the dark side had broken her heart, causing her to lose the will to live, which, coupled with the strain of giving birth to her children, resulted in her death. In her final words, she told Kenobi of her strong belief that there was still good within Anakin. At her state funeral, thousands of Naboo gathered in the streets of Theed to pay their respects to their beloved former Queen and Senator."}, {"tag": "p", "text": "Throughout her relatively short life, she played a vital role in the politics and events surrounding the Clone Wars. Amidala and other Senators were responsible for creating the foundation for any chance of rebellion against the Empire. Eventually, Padmé's children would play a major role in the fragmentation of the Empire and the redemption of Anakin."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (46–33 BBY)"}, {"tag": "p", "text": "Born Padmé Naberrie in 46 BBY, Amidala was the youngest daughter of Ruwee and Jobal Thule Naberrie, and the sister of Sola Naberrie. Padmé grew up in an isolated mountain village where her parents instilled in their children high virtues like self-sacrifice and care for the socially weak. Her family moved to Theed when she was young, and Padmé attended the best schools available to her, enjoying occasional class retreats to Naboo's lake country. In her youth, she volunteered for the Refugee Relief Movement, like her father had before her, and journeyed to Shadda-Bi-Boran to aid in the relocation efforts of the natives. Sadly, many of these refugees died when they were unable to adapt to life on another world. Following this, she entered the Legislative Youth Program, where she met a young man named Palo. A brief, innocent relationship followed, but the pair parted ways when Palo became an artist, and Padmé continued in politics. She never forgot her past or her heritage, however; even after she reached the top, Amidala still maintained her village's tradition of painting her thumb nail on each hand stark white, a small but notable sign of her dedication to her family."}, {"tag": "p", "text": "Amidala's rise was meteoric—she had joined the Apprentice Legislature at age eight and became a full Apprentice Legislator by age eleven. During this time, she first met Silya Shessaun, her workshop mentor. The two would meet again as Senators, and formed a close bond. By 33 BBY, at the age of thirteen, Padmé Naberrie had become Princess of Theed, and was extremely popular, rallying those opposed to the rule of King Ars Veruna."}, {"tag": "p", "text": "She became involved in a relationship with Ian Lago, the young son of Veruna's Prime Counselor, Kun Lago. Lago's father opposed the match, but it ended of its own accord when Veruna abdicated and Amidala accepted to enter the race to succeed the King. Her bid for the throne had initially been suggested to her parents, and subsequently discreetly backed, by Senator Palpatine, who wished to see Veruna lose the election for his own reasons."}, {"tag": "p", "text": "Although prodigiously talented, Amidala, at 14 years old, was still not the youngest Queen of Naboo to ever be elected. Once elected Queen, Padmé took the name Amidala, and amended the constitution to limit the rule of elected monarchs to two terms, in light of Veruna's unpopular long rule."}, {"tag": "p", "text": "Her birth name was Padmé Naberrie; Amidala was actually a regnal name. In her guise as Queen Amidala, she appeared regal and austere, but as Padmé, she was headstrong and compassionate. It appeared that her birth name was not public knowledge. In a lengthy communiqué assembled by Supreme Chancellor Valorum's aide in 32 BBY, the Republic diplomats and Intelligence officers who contributed listed Padmé as one of the queen's handmaidens, and only referred to the queen as \"Amidala.\" The notion that the handmaidens' true purpose was to serve as the queen's decoys, suggested by a Senate security officer based on irregularities in the Royal Starship's passenger lists, was dismissed as \"outrageous.\" Even the Jedi diplomats dispatched by the Chancellor were unaware of the fact that Padmé was the queen."}, {"tag": "p", "text": "Amidala's cadre of handmaidens, young women of a similar age and with a striking similarity to her, acted as bodyguards, decoys, and confidantes to their mistress, roles devised by Amidala's head of security, Captain Panaka, who insisted the new queen be trained in self-defense and weapons usage. While Amidala was queen, her handmaidens included Sabé, Eirtaé, Rabé, Yané and Saché. During her term as Senator, Amidala's handmaidens included Dormé, Cordé, Versé, and later Moteé and Ellé."}, {"tag": "h3", "text": "Queen (33–25 BBY)"}, {"tag": "h4", "text": "Invasion of Naboo"}, {"tag": "p", "text": "About five months after her election in 33 BBY, Queen Amidala was faced with what would become one of the most significant problems in Naboo history. In protest of the Galactic Senate's decision to tax users of the galaxy's trade routes, Viceroy Nute Gunray of the Trade Federation enforced a blockade on Amidala's home world, Naboo. With few resources of its own, Naboo relied on imports, and the blockade served as the perfect example of the Republic's reliance on trade."}, {"tag": "p", "text": "Amidala tried to use diplomatic and political means to rid her planet of the Trade Federation, yet it was all in vain. The Viceroy—secretly following the orders of Darth Sidious—avoided direct diplomatic efforts, going so far as to order his troops to assassinate the Republic ambassadors that Chancellor Valorum had secretly dispatched. Unfortunately for him, the ambassadors were the Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi, and shortly after their escape Gunray was ordered to both sabotage all of Naboo's communications systems and deploy his troops for invasion. Amidala refused to condone a course of war for her planet, but the Federation invaded anyway and swept away the RSF defense. When the Federation took Theed, Amidala was captured at the Palace, but in the guise of a handmaiden; her double, Sabé, assumed the guise of the queen during this time. Acting on instructions, the decoy refused to sign the treaty authorizing a Federation occupation of Naboo, and they were sentenced to be placed in detention camps. On their way to detention facilities, the retinue—consisting of the false Amidala, her handmaidens, Governor Sio Bibble and Captain Panaka—was freed by the Jedi ambassadors Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi, as well as a Gungan named Jar Jar Binks. Though reluctant to leave her people, Amidala (via Sabé) accepted the Jedi's offer to escort her to Coruscant, leaving Bibble and two handmaidens behind."}, {"tag": "p", "text": "Engaging the blockade as the Naboo Royal Starship escaped, total destruction was avoided thanks to the droid R2-D2, whom Amidala commended. However, significant damage was inflicted in the escape, and the ship was forced to land on the remote planet Tatooine. Disguised as the handmaiden Padmé, Amidala accompanied Jinn, Binks, and R2-D2 into the small town of Mos Espa to search for parts needed to repair the ship. There she met a nine-year-old slave, Anakin Skywalker, and formed a close bond with him that would last her entire life. Skywalker offered to take part in the Boonta Eve Classic, a podrace, to win the group enough money to acquire new parts and leave for Coruscant. Though she liked Skywalker, Amidala doubted Jinn's wisdom in placing her planet's fate in a little boy's hands. She reconsidered, however, when Skywalker won."}, {"tag": "h4", "text": "The fight for Theed"}, {"tag": "p", "text": "Arriving on Coruscant, Amidala once again resumed her role as queen. In preparation for her appearance in the Senate, Senator Palpatine, her planet's representative, warned her of the Senate's corrupt nature, and was proved right when Amidala was unable to acquire immediate help for her people. Following Palpatine's advice, Amidala called for a Vote of No Confidence in the Senate's leader, Finis Valorum. Soon after, Palpatine himself was nominated to succeed Valorum, and eventually won."}, {"tag": "p", "text": "However, Amidala decided to ignore his pleas for her to remain on Coruscant until that time, choosing instead to return to Naboo. En route, Amidala revealed to a concerned Qui-Gon Jinn that she planned to unite with the native Gungans, with whom the Naboo had had somewhat bad relations in the past. Amidala journeyed through the swamps of Naboo, escorted by the two Jedi and a small posse of Naboo security guards. En route, her party encountered several other droids, as well as Royal Security Force personnel scattered through the swamp. Eventually, Amidala and her party boarded a group of naval transports, which took them to the Gungan Sacred Place. Appearing before the Gungan leader Rugor Nass, Sabé (still acting as Amidala's decoy) attempted to convince the Gungans to unify in a bid to oust the Trade Federation. Seeing that this attempt was going nowhere, Amidala decided to reveal her secret identity as a signification of trust. Nass agreed, and the two warring cultures hastily put an end to their dispute to concentrate on a more pressing issue: the occupation of Naboo. Amidala presented her formulated plan to the group, which would consist of her leading a strike team into the Royal Palace and capturing the Viceroy, while at the same time the Gungan Grand Army would lead a ground assault to distract the droid armies. Though the plan eventually worked—thanks mostly to Skywalker's effort in destroying the Droid Control Ship and Sabé's distraction—it did not come about without loss, with Qui-Gon Jinn being killed by Darth Maul, who had been sent to help the Neimoidians on Naboo. Amidala was among those who attended Jinn's cremation in the Funeral Temple of Theed to pay her respects."}, {"tag": "p", "text": "Her actions throughout the crisis earned her immense popularity with the people, and the Naboo and Gungans became officially unified during a celebration in Theed, attended by Supreme Chancellor Palpatine and the Jedi High Council. After the celebration, Padmé was approached by Master Yoda who, on behalf of the Jedi Council and in agreement with the Supreme Chancellor, asked her to keep all knowledge of the Sith a secret."}, {"tag": "p", "text": "In 25 BBY, Amidala ended her second term as queen. Though some on Naboo suggested amending the constitution to allow her to serve a third term, she stayed true to her belief that \"popular rule is not democracy.\" Hereafter, Amidala gave up the throne to her elected successor, Queen Jamillia."}, {"tag": "h3", "text": "Senator (25–19 BBY)"}, {"tag": "p", "text": "Though Amidala had planned to retire into a family life, as her sister Sola had, at Queen Jamillia's urging she was elected Naboo's representative in the Galactic Senate, succeeding Horace Vancil as the Galactic Senator from the 36th regional state space system. Surprisingly, given her career change, she retained an elaborate fashion sense and a constantly changing wardrobe. Indeed, due to her enormous support on Naboo, Amidala continued to be granted all the formalities usually restricted to the elected monarch, including distinctive chrome plating on all of her starships."}, {"tag": "p", "text": "Amidala entered the Senate in the same year as Senator Rush Clovis. The two became very close, however, Amidala ultimately ended the relationship as she felt that it was not professional for it to continue. Clovis took this very hard, and the pair ultimately terminated any kind of contact."}, {"tag": "p", "text": "Though she preferred to remain on Naboo, when on the capital Padmé lived in a small penthouse apartment in the Senate Apartment Complex. Though the interior was modest in size and decor compared to other Senatorial residences, the apartment's large veranda boasted a private landing platform as well as a number of luxurious Naboo artifacts."}, {"tag": "p", "text": "Soon, she was one of the leaders of a faction opposed to the establishment of an army to quell the growing Separatist movement. She believed that signaling violence only invited violence in return. Padmé Amidala was also appointed by the Supreme Chancellor to the Loyalist Committee, an exclusive group of Senators who would act as advisers to the Chancellor during the Separatist Crisis. She also served on a team of Republic diplomats that attempted to negotiate a peace with the Separatists, but unfortunately a number of terrorist attacks thwarted the negotiations. Amidala suspected that Dooku, the Count of Serenno, leader of the Separatists, and a former Jedi Master, was behind attacks that ended the negotiations."}, {"tag": "p", "text": "Because of the Separatists threats, the Military Creation Act was proposed to create a military for the Republic. Padmé, opposing the Act due to believing it would ultimately harm the Republic and be an act of war, formed the Campaign against Republic Militarization to oppose the bill's passage, where she proceeded to give various speeches and tours. One of these speeches, given at the University of Commenor, had her strongly implying that those who supported the bill were cowards, claiming that warfare was created by cowardice and that true bravery was to forego easy answers and find peaceful solutions. These comments led to criticism from the Stark Veteran Assembly, with one of the representatives of the organization, Laslo Dorits, pointing out the hypocrisy in her statement by citing that it was soldiers who liberated her home planet in the past. Although she declined to comment afterward, she nonetheless left a HoloNet message stating that she respected those fighting to protect their soil, and her comments were referring to what she considered alarmist elements in the senate. Her tour lasted until the first month of 22 BBY in the Chommell Sector."}, {"tag": "h4", "text": "Assassination attempts"}, {"tag": "p", "text": "In 22 BBY, Amidala was targeted for assassination by an unknown enemy, which she firmly believed to be Count Dooku. An attempt on her life was made by the Clawdite bounty hunter Zam Wesell, resulting in the deaths of Amidala's decoy Cordé, handmaiden Versé, and numerous other security guards on a Coruscant landing platform. Hours later, Amidala appeared in the Senate both to thwart reports of her death and to openly criticize her enemies as well as supporters of the Military Creation Act, which she strongly opposed. When explaining her survival of the assassination, she also cited that it was targeting the security apparatus of the Republic, and strongly implied that the one responsible had been among the supporters of the Military Creation Act. She then attempted desperately to change their minds against passing the bill, citing that the Separatists would \"offer violence in turn\" and that freedom itself would be at risk, but the session was postponed due to a need to review security measures. In a brief conference with Supreme Chancellor Palpatine, members of the Loyalist Committee and numerous members of the Jedi High Council (including Yoda and Mace Windu), it was decided that Amidala be placed under protection of the Jedi while the matter was investigated. Padmé held firm her belief that Dooku was behind the attack, but the Jedi—believing a former Jedi to be incapable of murder—rejected that claim."}, {"tag": "p", "text": "Later that day, Amidala was reunited with Anakin Skywalker, now a Padawan to Jedi Knight Obi-Wan Kenobi, who had been assigned to protect her. After a second assassination attempt by Zam Wesell—who had, under the orders of Jango Fett, placed poisonous kouhuns in her bedroom, which Skywalker and Kenobi prevented from killing her—the Jedi Council determined that Skywalker would escort Amidala to her home world of Naboo for protection while Obi-Wan continued the investigation. As the vote on the Military Creation Act was fast approaching, Chancellor Palpatine had to issue an executive order to an irritated Amidala to return to Naboo. Disguised as a refugee couple from the Thousand Moons system, Amidala and Skywalker traveled discreetly on a freighter ship to Naboo. During the trip they discussed the sacrifice that Anakin's mother made by letting him go to train with the Jedi. Hoping to make him feel better and without knowing she would make the same sacrifice for her own children, Padmé said that what a parent needed for her child was to know that he had been given a chance of a better life."}, {"tag": "p", "text": "To maintain the illusion that the Senator was still in the capital, Captain Typho and handmaiden Dormé stayed behind, with the latter acting as Amidala's decoy. After a meeting with Queen Jamillia, as well as a meal with Amidala's family, she and Anakin took refuge at Varykino, the Naberrie family lake retreat, where the two began to fall in love. Such a romance was against the Jedi Code, so Amidala—fearing the repercussions on both her and Anakin's careers and not willing to take that risk—attempted to dismiss the notion,."}, {"tag": "h4", "text": "Return to Tatooine"}, {"tag": "p", "text": "After Skywalker had a dream of his mother dying, Amidala accompanied him to Tatooine to help find and rescue her. While on Tatooine, they learned that Shmi Skywalker had married a moisture farmer named Cliegg Lars during Anakin's ten-year absence. Lars sadly informed Anakin that Shmi had been kidnapped by Tusken Raiders about a month before his return, and that, after a disastrous search party, all hope for her was lost. Upset and unwilling to give up, Skywalker traveled into the desert to rescue her, leaving Amidala in the care of the Lars family."}, {"tag": "p", "text": "While there, she got to know Anakin's step-brother Owen Lars and his girlfriend, Beru Whitesun, the couple that would eventually become foster parents to her son, Luke Skywalker. Anakin returned the next morning, carrying the lifeless body of his mother. Skywalker deeply grieved for Shmi's death, and confessed to Amidala his massacre of the Tusken Raider village in which his mother had been held captive. Though shocked, Amidala understood his grief and his guilt, attempting to comfort him with the notion that he, like anyone, was only Human. During Shmi's funeral, Artoo informed Amidala of a message received by Obi-Wan Kenobi."}, {"tag": "h4", "text": "Battle on Geonosis"}, {"tag": "p", "text": "After saying goodbye to the Lars family, the pair viewed the message, only to discover that Kenobi had been captured by droidekas on the planet of Geonosis. The message also revealed Count Dooku's involvement in the assassination attempts on Amidala; the Count was apparently trying to fulfill a deal that would see Padmé's former enemy, Nute Gunray of the Trade Federation, officially join the Separatist movement. Twisting Mace Windu's orders for Skywalker to remain with the Senator, Amidala resolved that if Anakin wished to protect her, he would have to follow her to Geonosis in her attempt to rescue Skywalker's Master."}, {"tag": "p", "text": "Arriving on Geonosis, Skywalker and Amidala were chased through a droid factory, where Amidala would doubtless have been killed if R2-D2 had not intervened. Captured by battle droids, the pair was sentenced to execution by Poggle the Lesser. As they were brought into the Geonosian execution arena, Padmé finally admitted her love for Anakin, and they shared an intimate kiss, before joining Kenobi in the arena, where they were individually chained to three stone pillars and three huge predatory beasts were turned loose to kill them."}, {"tag": "p", "text": "While being watched by the Separatist leaders and the Geonosian people, Amidala, Skywalker, and Kenobi continually did all they could to fight back against the beasts brought out to kill them. Notably, Amidala picked the locks on her fetters and climbed to the top of her pillar. In her own battle, Amidala was slashed across the back by a nexu, which left her with several deep cuts, but she fought off the beast and joined Skywalker in his efforts to escape the arena. The execution was put on hold as Mace Windu and a Jedi strike team aided in their rescue. The three prisoners together fought in the First Battle of Geonosis, where Amidala again proved herself rather good in combat and sufficient with a blaster."}, {"tag": "p", "text": "After the timely arrival of Jedi Master Yoda with forces of the Grand Army of the Republic allowed the strike team to escape the arena, Amidala was taken aboard a LAAT Gunship, but was separated from Skywalker and Kenobi when the ship was hit by Separatist fire. Amidala pursued them with a squad of clone troopers, only to find both men injured from their duel with Count Dooku, who had escaped. Skywalker had lost his right forearm in the fight. Though the battle was a victory for the Republic, it was but the first battle in the Clone Wars."}, {"tag": "h4", "text": "Marriage to Anakin Skywalker (22 BBY)"}, {"tag": "p", "text": "Directly after the Battle of Geonosis, Amidala was transported to the Jedi Temple alongside the wounded Skywalker and Kenobi. Before the healers at the Temple could treat her wounds, she rushed into the Halls of Healing demanding to see Skywalker. Chief Healer Vokara Che demanded she allow the healers to treat her, or to otherwise leave the Temple. Before the argument continued, the wounded Kenobi stepped from his healing chambers, and told her to leave."}, {"tag": "p", "text": "Amidala returned to her apartment on Coruscant that night, and was surprised to have Obi-Wan Kenobi as a visitor. Sent by Master Yoda, Kenobi demanded that the Senator only maintain a cordial relationship with Skywalker, and otherwise stay out of Jedi affairs. Amidala lied, saying she agreed, and asked if she could end the relationship herself, suggesting that Skywalker escort her back to Naboo."}, {"tag": "p", "text": "Amidala then married Skywalker at Varykino on Naboo in a secret ceremony performed by Maxiron Agolerga, the Pontifex of the Brotherhood of Cognizance. R2-D2 and C-3PO were the only witnesses to the wedding. From that moment on, Amidala was also called Padmé Naberrie Skywalker, a title with her birth name, and the name of her husband, though she would never publicly take her new husband's name."}, {"tag": "p", "text": "The only evidence of Amidala's marriage to Skywalker was an official scroll containing their names, which Agolerga placed within the archives of the Brotherhood. However, Amidala's former head of security during her reign as queen, Panaka, discovered the marriage. He then informed Palpatine of it, who used the information to his advantage in the coming years."}, {"tag": "h3", "text": "Clone Wars (22–19 BBY)"}, {"tag": "p", "text": "With the beginning of hostilities, Amidala's message of diplomacy and restraint was drowned out by the guns of war. She continued to find herself the target of Separatist assassins, which forced her to remain on the capital world. Amidala rarely saw her husband, Anakin Skywalker, who was constantly at the front line, leading clone troopers with Obi-Wan Kenobi. She maintained a secret correspondence with her husband, and, although she was thrilled about his exploits, Amidala also feared for his safety."}, {"tag": "p", "text": "Four months into the war, Amidala was traveling with Jedi Master Yoda aboard her Naboo yacht when the ancient Jedi sensed a disturbance in the Force, coming from the planet Ilum. Despite Captain Typho's protests, she accompanied Yoda to the world and assisted in the rescue of the Jedi Luminara Unduli and her Padawan Barriss Offee, after battling against three chameleon droids, with some help from R2-D2 and C-3PO."}, {"tag": "p", "text": "Throughout the Clone Wars, Amidala was a source of diplomacy in a decaying Republic. One such example was during the Outer Rim Sieges in which she and Captain Typho traveled to the planet of Bri'ahl to persuade the natives to join the Republic. Coincidentally, Amidala's diplomatic solution would have failed miserably had C-3PO, in his clumsiness, not accidentally crushed a resistance and a contingent of fake clone troopers attempting to murder both the Senator and the planet's President, Vuul, so Bri'ahl would not be carried into the Clone Wars."}, {"tag": "p", "text": "Believing that she could not simply sit back and allow others to defend the Republic's freedoms, Amidala, at the behest of Bail Organa, joined with Sheltay Retrac to reveal the Separatist sympathies of Senator Bezz Drexx."}, {"tag": "p", "text": "During the Clone Wars, Amidala was disliked by many who believed her to be responsible for starting the Clone Wars by her illegal presence on Geonosis; indeed, Amidala became the target of anger, due to her opposition of the Military Creation Act prior to the outbreak of the war."}, {"tag": "p", "text": "In 20 BBY, Padmé went with Skywalker, Kenobi, and Jedi Siri Tachi to the planet Genian, a neutral planet in the war. The Separatists were pursuing an important codebreaking mechanism invented by Talesan Fry, whom Tachi and Kenobi had met decades earlier. Fry was now the founder of a very wealthy business on Genian. After persuading Talesan to give the device to the Republic, the group was attacked by the bounty hunter Magus."}, {"tag": "p", "text": "Fry accompanied the Jedi and Amidala to Azure, where the Republic was fighting off more Separatists. Amidala and Tachi took a starfighter to pursue Magus, while Kenobi, Skywalker and Fry fought off the attack led by Magus (who was working for the Corporate Alliance). Upon reaching Magus, Padmé was left to fly the ship herself, while Tachi made a desperate leap and landed on Magus's starfighter. In the end, Amidala and the Jedi were successful, with Magus becoming a prisoner of war, but Tachi died in the effort."}, {"tag": "h4", "text": "Separation from Skywalker"}, {"tag": "p", "text": "Several months later, on Coruscant, Amidala followed Skywalker into the depths of the city-planet, concealing her identity in a blue hooded cloak. Skywalker sensed someone following him and assumed she was someone attempting to attack him. He pulled her into a darkened alleyway and engaged his lightsaber before realizing who she was. They shared an intimate kiss, but with sentients nearby, Amidala shied away. Angered, Skywalker exclaimed that he was tired of hiding their love. She assured him that even in the lowest, darkest levels, she would love him, to which he quipped she did look good in the dark. They shared another kiss, but were interrupted by the cries of C-3PO, who was searching for his mistress. When Skywalker noticed something different about the droid, Amidala pointed out his new gold plating. Skywalker was then called away by Kenobi to, unknown to Anakin, finally be granted the rank of Jedi Knight by the Jedi Council. Soon after, Amidala received Skywalker's severed Padawan braid as a keepsake. She placed it in a box next to the carved japor snippet Skywalker had made for her as a young boy. She sent R2-D2 to deliver a recording of her presenting the astromech droid as a gift to Skywalker."}, {"tag": "p", "text": "Later in the war, during Skywalker's brief break from the war (granted by the Jedi Council due to his and Kenobi's extended service in the Outer Rim), Padmé reunited with her husband on Naboo. This reunion did not last long, as the couple were shortly interrupted by a suspicious Kenobi, who wanted his former Padawan to help him hunt down Asajj Ventress, one of Count Dooku's dark disciples. Skywalker, believing himself to have killed the Dark Jedi, was offended, but he was persuaded by Padmé to accompany his Master. At some point after he received his facial scar, Anakin traveled to Naboo to be with Padmé, where they spent the night together. They would not see each other for a long time."}, {"tag": "h4", "text": "Negotiations with the Hutts"}, {"tag": "p", "text": "While Skywalker and his new Padawan learner Ahsoka Tano, were searching for Jabba the Hutt's son, Rotta on Teth, Amidala went to see Supreme Chancellor Palpatine about the new security measure for Naboo. There Palpatine told her of how Jabba thinks that Anakin was behind his infant son's kidnapping. Padmé offered to convince the Hutt of Anakin's innocence, but Palpatine told her that Jabba was not accepting communications from them. Despite Palpatine's warning of the Hutts being vile gangsters, Padmé went to meet with Jabba's uncle Ziro at his palace on Coruscant. Her objective was to convince Ziro to side with the Jedi, and let her contact Jabba himself, who incorrectly believed the Republic had orchestrated the kidnapping of Rotta and had subsequently executed him. Unfortunately, Ziro had no interest in what she had to say, and had Amidala forcibly removed from his throne room. However, the always resourceful Senator escaped her IG-unit guard and eavesdropped on Ziro during a communication with Count Dooku himself."}, {"tag": "p", "text": "While listening to this conversation, Amidala discovered that Ziro had allied himself with Count Dooku and the Separatists, in exchange for becoming the ruler of all the Hutt clans, and had thus concocted an elaborate scheme to kidnap Jabba's son, frame the Jedi for his murder and force Jabba to attempt revenge for this—an act that would surely result in his death, leaving Ziro as the sole ruler of the Hutts. Unfortunately, Amidala was discovered eavesdropping and locked away, with Count Dooku suggesting that Ziro collect the bounty placed on her head by Nute Gunray and Separatists."}, {"tag": "p", "text": "Amidala was taken to the detention level, where battle droids confiscated her comlink and blaster. However, the Senator outwitted them and tricked one into activating her comlink as Threepio was attempting to contact her. She quickly explained her predicament before the IG-unit guard smashed the device. Because of this, Ziro planned to have her disposed of, but at the last moment, Threepio led a squad of Coruscant Guard under Clone Commander Fox's troopers to rescue her. They destroyed all of his droid guards, and captured Ziro being held at gunpoint by Padmé. Amidala then contacted Jabba, just as he was about to execute Skywalker and Tano for allegedly kidnapping Rotta. However, Amidala forced Ziro to confess his betrayal to Jabba, who promised swift punishment in return."}, {"tag": "p", "text": "With Skywalker and Tano saved, Amidala proceeded to negotiate an alliance between the Republic and the Hutts, which would allow Republic warships to use unknown Hutt hyperspace lanes, an advantage the Separatists did not have."}, {"tag": "h4", "text": "Wartime Senator"}, {"tag": "p", "text": "As the war continued, Amidala became a member of the Security Committee, working closely with Alderaan's Senator Bail Organa. When a terrorist attack devastated Coruscant and severely injured Amidala's friend Kenobi, Supreme Chancellor Palpatine took both Senators on an airspeeder tour of the attack site, to show them the ruination first-hand and to spur them on to urge the Committee to enforce tighter security bands on Republic planets. The intense emotional experience served to forge a bond between Amidala and Organa, and when the Alderaanian received a communique from his secretive Friends of the Republic network regarding an assault on the Jedi Order by the Sith, he took the information to Amidala, who in turn contacted Kenobi. Although Organa insisted that something needed to be done to protect the Jedi, Kenobi dismissed his ideas, gave the Senator his contact information, and returned to the Jedi Temple. When Organa received a second communique providing detailed, step-by-step instructions to the Sith planet Zigoola, he and Kenobi departed on a mission to find whatever danger might be lurking there. After Organa and Kenobi had been gone much longer than anticipated, Grand Master Yoda visited Amidala in her apartment, after having received a strong Force signal from the Jedi Master asking for help. Explaining that the dark presence on Zigoola was too strong for any Jedi to withstand, Yoda asked Amidala to collect the two men herself, a task the Senator immediately accepted. She departed with Captain Korbel on her yacht that night and successfully rescued Organa and Kenobi, all Sith presence on the planet destroyed."}, {"tag": "h4", "text": "Trap on the Malevolence"}, {"tag": "p", "text": "Through the efforts of Representative Binks, Amidala found in her possession information able to keep her updated on her husband's safety. However, the price of gaining such information was that Amidala would appear on the HoloNet show of a Rodian, who proceeded to confront her about pirate activity on his home planet of Rodia. Horrified, Amidala later brought the matter to the attention of Chancellor Palpatine, who dismissed it and chose to send her on a diplomatic mission important for the war; the Republic had been contacted by a representative of the InterGalactic Banking Clan, who professed a desire to betray his Separatist allies, and Amidala's mission was to negotiate an alliance."}, {"tag": "p", "text": "Upon exiting hyperspace at the rendezvous point, however, Amidala and Threepio found themselves in the midst of a vicious battle between Republic forces and the Separatist superweapon the Malevolence. Knowing of the relationship between Amidala and one of the leaders of the Republic forces, Anakin Skywalker, Darth Sidious, under the guise of his alter ego Palpatine, had arranged for Amidala to enter the fray and be captured by General Grievous, so that Skywalker would feel compelled to cease his assault on the Separatists invaluable weapon."}, {"tag": "p", "text": "Though Amidala successfully managed to communicate with the Republic forces, her husband and other Jedi at their head, she became caught by the Malevolence's tractor beam. Refusing to become a Separatist bargaining chip, Amidala ordered the Jedi to continue their assault upon the superweapon, though her husband disregarded these orders and had the Republic forces cease fire, just as Dooku and Sidious had predicted. On board, Amidala and Threepio sabotaged their ship's engines and proceeded to sneak off it, so that upon Grievous coming from the bridge to personally take charge of them, the ship would explode, killing him."}, {"tag": "p", "text": "The Senator was surprised, however, to see Grievous survive her trap and as such, she and her droid companion proceeded to stow away, while Grievous began a search for them. Indeed, while secretly attempting to contact the Republic forces, the pair barely escaped discovery by Grievous, though this proved a valuable occurrence, as they overheard that the damaged hyperdrive was nearly operational once again. Amidala then made contact once more with her husband, and discovered that he and Obi-Wan Kenobi had mounted a rescue mission to retrieve her and had secretly boarded the Malevolence."}, {"tag": "p", "text": "The two groups rendezvoused at a point halfway between them, though Skywalker and Amidala soon became separated from Kenobi, Threepio and Artoo. While Kenobi was forced to delegate the rescue of Threepio to Artoo, so as to ensure that the hyperdrive stayed offline, Skywalker and Amidala made their way to the bridge to make adjustments to the navicomputer that would cause the superweapon to pilot itself into a moon. Both missions proved a success, and the group managed to escape the Malevolence."}, {"tag": "p", "text": "While Grievous personally headed a task force that dogged the group as they attempted to dock with the Republic forces, the Malevolence began to move towards a near moon, before colliding with it, destroying the superweapon instantly. With the loss of the Malevolence, Grievous fled the battle, and Amidala and her companions reached safety."}, {"tag": "h4", "text": "Crisis on Rodia"}, {"tag": "p", "text": "Still concerned with the welfare of the people of Rodia, Amidala traveled there with Threepio and Representative Jar Jar Binks in an effort to persuade her old friend Senator Onaconda Farr to remain loyal to the Republic. Unfortunately, when she arrived, Amidala learned that Farr had already pledged his system to the Separatists, as Nute Gunray could provide them with supplies, unlike the Republic. Amidala was imprisoned to await Gunray's arrival, while Threepio was scheduled to be scrapped and Binks managed to evade arrest."}, {"tag": "p", "text": "Wearing a discarded Jedi robe he found within Amidala's cruiser, Binks caused his pursuers to mistakenly believe he was a Jedi Knight. After hearing word of a Jedi being nearby, Amidala managed to outsmart her guards and escape her cell. The Senator then resuscitated Threepio, and was dismayed to learn that the Jedi she had heard about was merely Binks in disguise. Amidala found herself in trouble once again, after Gunray arrived on the planet and captured her. However, Binks and a Kwazel Maw happened to cause chaos among the Viceroy's guard, forcing him to attempt to escape, only to find himself at gunpoint. Gunray was confident Senator Farr would rescue him from Amidala; however, he soon learned that the two Senators had planned to capture him the entire time."}, {"tag": "p", "text": "A Republic cruiser subsequently arrived, and Gunray was taken into custody. While Farr requested that Amidala accept his apology for his brief betrayal, she remained adamant that it was the Republic that owed him an apology for forgetting that just because Rodia was not a particularly powerful ally, that did not make it any less important than any other system. Shortly after Amidala's capture of the important Separatist, Gunray was liberated from captivity by Asajj Ventress and the traitor Faro Argyus, who returned the Viceroy to Dooku."}, {"tag": "p", "text": "Sometime after the incident on Rodia, the Republic received word from Hondo Ohnaka's pirate gang that they had managed to capture the leader of the Separatists, Count Dooku. Being that Dooku was a powerful Sith Lord, the Jedi Council, the Chancellor and Amidala found it difficult to believe that mere pirates could capture him. Amidala counseled Palpatine, advising him to have the Council send two Jedi to confirm the validity of Hondo Ohnaka's claims before sending diplomats to deliver the ransom that he demanded."}, {"tag": "p", "text": "After receiving word from Skywalker and Kenobi, the Jedi that were sent on Amidala's advice, that Dooku truly was held captive by the pirate gang, Chancellor Palpatine sent Senator Kharrus and Representative Binks to deliver the ransom in return for Dooku."}, {"tag": "p", "text": "The pirate gang proved treacherous after they took Skywalker and Kenobi captive, though they were ultimately rescued by Binks. Unfortunately, the incident resulted in the death of the respected Senator Kharrus and the escape of Dooku."}, {"tag": "h4", "text": "Homeworld threatened"}, {"tag": "p", "text": "A short time after Dooku's brief capture, the Naboo Senatorial delegation was recalled to their homeworld by Queen Neeyutnee. The queen revealed that a squad of Separatist battle droids had been encountered and destroyed onworld, and requested that Amidala petition the Senate or the Jedi Council to help protect Naboo. Unfortunately, Amidala knew that greater proof would be needed to warrant action by the Senate or the Jedi and took it upon herself to search the swamplands for signs of a greater Separatist presence on her homeworld, as had been indicated by a captured tactical droid."}, {"tag": "p", "text": "Following a tainted water stream, Amidala and Jar-Jar Binks came across a hatch, which they were unable to open. Amidala contacted Captain Typho to give him the location of the lab. During their attempts to open the hatch, they were surrounded by battle droids and were swiftly captured. The pair was then taken before Separatist scientist Dr. Nuvo Vindi, who revealed that he had perfected the long-thought-eradicated disease the Blue Shadow Virus, which he planned to release into the galaxy."}, {"tag": "p", "text": "Shortly after Amidala and Binks began their search for a Separatist presence, Jedi Skywalker, Kenobi, and Tano arrived onworld to aid her. Tano, with the help of Gungan native Peppi Bow, located the secret lab of Dr. Vindi. When Skywalker and his troops came to rescue her, Vindi threatened to kill Padmé and Binks. Though Vindi eluded the Jedi and clones for the moment, Skywalker rescued Padmé and Jar Jar. When Skywalker pursued Vindi, Padmé and Jar Jar went with him and his troops. When they joined Ahsoka and Rex, Obi-Wan told them that Vindi had activated the bombs and that one bomb was missing. Padmé then remembered that Vindi had given a little droid the bomb. When everyone split up, Padmé and Jar Jar found the droid. At first, Padmé tried to get the bomb nicely back from the droid, but the droid growled at them and tried to run away with it. But Jar Jar grabbed the droid and then the bomb. Ahsoka then brought the bomb squad, and the bomb was deactivated. The Jedi and a squad of clones then captured and held Vindi for trial. However, as the Jedi prepared to take the mad scientist to trial on Coruscant, Amidala and the clones discovered that one of his virus bombs was missing the vial that contained the virus, meaning that it may have found its way into the wrong hands and could still be released."}, {"tag": "p", "text": "As they had suspected, the virus had fallen into Separatist hands, Vindi's assistant droid, who released it within the laboratory, causing the facility to lockdown with Tano, Amidala, Binks, and several clones trapped inside. The few remaining battle droids then started slicing the exits, hoping to escape the lab and release the virus into Naboo's atmosphere. The remaining Republic forces in the lab began to pick off the droids before they could break out. While being attacked by droidekas, the biohazard suit Amidala was wearing became breached and she was infected with the virus. However, she continued on and eventually, the remaining droids were destroyed. Amidala and Tano contacted Skywalker and Kenobi on the surface, telling them not to open the lab, so as to prevent the virus escaping. The transmission was cut off before Amidala could say her last goodbye to her husband, but Skywalker refused to abandon his wife to her fate."}, {"tag": "p", "text": "After the skirmish, two clone troopers died because of the virus. Subsequently Amidala said she that she hoped that their sacrifice would help bring peace to the galaxy, a sentiment agreed to by Tano. Soon after, Tano herself lost consciousness, due to the virus. However, before the virus could kill Amidala and Tano, Skywalker and Kenobi arrived with the cure, freeing the survivors from the contaminated compound and ensuring that Naboo, and the galaxy itself, was safe from the virus."}, {"tag": "h4", "text": "Defending the Zillo Beast"}, {"tag": "p", "text": "Following the Battle of Malastare, Amidala was informed of the Zillo Beast's transportation to Coruscant by Obi-Wan Kenobi, in the hopes that she could use her relationships with Anakin Skywalker and Palpatine to bring about the release of the creature. Although she secured a meeting with her Jedi husband and the Supreme Chancellor, she was cut short when the Zillo Beast escaped its confines, rampaging towards the Senate District to settle a personal vendetta against Palpatine after witnessing him order its death. Amidala, Skywalker and Palpatine, along with droids C-3PO and R2-D2, evacuated to the Supreme Chancellor's personal escape shuttle, although they were grabbed by the beast immediately upon their escape and held captive in its claws. Skywalker was able to cut the shuttle in half, releasing himself, Amidala and the droids out onto the sloped roof of the Senate building. Although Amidala had no means to stop her descent while sliding down the roof, she was soon caught by Skywalker. With the help of Yoda and Aayla Secura, Skywalker then withstood the fatal toxin attack against the Zillo Beast. Everyone exited the incident largely unscathed."}, {"tag": "h4", "text": "Intrigue within the Senate"}, {"tag": "p", "text": "Later, Amidala was approached by Grand Master Yoda, who hoped to convince her to aid the Jedi Council by spying on fellow Senator Rush Clovis. However, Amidala refused. A short time after Master Yoda's request, Amidala's secret husband, Anakin Skywalker, returned to the capital after a lengthy stint at war. However, during their attempts at a reunion, Skywalker was forced to leave Amidala to answer the call of the Jedi Council, leaving her somewhat annoyed."}, {"tag": "p", "text": "At the insistence of the Council, Skywalker confronted Amidala in the Senate, presenting the Council's wish that she spy on Senator Clovis personally, despite his misgivings about the assignment. Once again Amidala refused, however, she ultimately accepted the mission after learning that the Council suspected Clovis of being tied to the Separatists; indeed, much to the chagrin of Anakin, Amidala cited his earlier argument that \"duty comes first, especially in war time.\""}, {"tag": "p", "text": "As Senators Amidala and Clovis had been lovers in the past, the Council believed that she was perfectly placed to secretly investigate him, as their past provided a perfectly legitimate seeming reason for her to re-establish contact with him. Amidala did this by inviting him to dinner where she professed a wish to rekindle their romance and subtly steered conversation towards his dealings with the Trade Federation, successfully earning herself an invite to a business meeting Clovis was to attend on Cato Neimoidia. While Clovis genuinely hoped to restart his relationship with Amidala, he also felt that her standing as an important Galactic Senator would help in his dealings with the Neimoidians."}, {"tag": "p", "text": "For the mission to Cato Neimoidia, Skywalker insisted on accompanying Amidala and her small entourage, disguised as her pilot. On Cato Neimoidia, Amidala and Clovis met with Trade Federation Senator Lott Dod, before Amidala was shown to her room so that Clovis and Dod could conduct their \"business\"; in actual fact, the pair was conspiring, along with Poggle the Lesser, in the creation of a new droid foundry on Geonosis. Later, after witnessing Clovis' affection for Amidala, Dod poisoned her in the hopes of forcing Clovis to concede to his demands, in exchange for the antidote. Shortly after being poisoned, Amidala uncovered proof of Clovis' Separatist ties and managed to hide her maneuver by hugging him, just as Skywalker appeared behind him, his face bursting with jealousy. Amidala held up the data disc, assuaging his anger, and dropped it so he could catch it with the Force. Shortly after Skywalker departed, Amidala succumbed to the poison. Clovis, after learning of her deteriorating health, was informed by Dod that she was a spy and confronted her. After a brief exchange of words, Skywalker arrived. Clovis decided that his feelings for Amidala were stronger and cooperated with Skywalker to get the antidote from Dod. However, Skywalker abandoned Clovis on the planet and left the Senator to face the wrath of Dod, before administering Amidala with the antidote, her mission a success."}, {"tag": "h4", "text": "Blockade of Pantora"}, {"tag": "p", "text": "When the Trade Federation blockaded Pantora, public unrest on the planet threatened its allegiance to the Republic. Senator Riyo Chuchi of Pantora was sent by Chairman Papanoida to persuade the Senate to act in favor of their planet before Lott Dodd, the Federation representative, could legitimize the blockade. After her speech, Amidala went to Chuchi to show her support, as she had experienced the same situation on her own homeworld. Afterwards, Chairman Papanoida's daughters, Chi Eekway and Che Amanwe, were kidnapped by a Rodian bounty hunter named Greedo, to use as leverage in order to force Pantora into joining the Separatists. The next morning, Ahsoka Tano, who had become a close friend of Chuchi, informed her Master, Anakin Skywalker, and Amidala of the situation. While the Jedi couldn't officially get involved in the investigation, Anakin slyly granted his Padawan permission to look into the matter due to \"personal\" concerns. Ahsoka teamed up with Chuchi, to aid the new Chairman in recovering his family before the Trade Federation could unduly influence the future of his planet. The Chairman and his son, Ion, eventually tracked down Greedo on Tatooine and rescued Che Amanwe. Meanwhile, Ahsoka and Chuchi found Chi Eekway held captive aboard a Trade Federation battleship over Pantora and exposed Trade Federation officer Sib Canay as a Separatist conspirator."}, {"tag": "h4", "text": "Turmoil on Mandalore"}, {"tag": "p", "text": "In 21 BBY, the Duchess of Mandalore Satine Kryze traveled to Coruscant to command the Senate to not order Republic Army occupation of Mandalore. Senator Amidala was present at the Duchess's session with the Senate, and when a hologram recording of a good friend of the Duchess, Deputy Minister Jerec, who was speaking against Kyrze's government, she asked if she knew this man. Right after Satine's argument against the recording, Chancellor Palpatine stated he had perished in a Death Watch bombing on Kalevala. Later, she told Obi-Wan Kenobi and Satine that the Senate had concluded their vote, and had agreed on a majority to send clone troopers to reinforce the Mandalorian Government. Amidala later presented the real hologram recording of Jerec, uncovered by Kryze's contact, to the Galactic Senate, proving that the Mandalorian government shouldn't accept Republic occupation of the planet. Amidala, Kryze's and Kenobi's actions later ratified the Senate's vote."}, {"tag": "p", "text": "During a crisis on Mandalore, Padmé visited Duchess Satine Kryze in the hopes of resolving the issue. The planet's trade routes were disrupted due to the Republic's conflict with the Confederacy of Independent Systems (CIS). This resulted in the populace running out of supplies, forcing Mandalore to deal with smugglers and a black market filled with corruption. Satine asked for Republic help and Padmé was deployed to see what she how she could help. During the visit, an outbreak of sickness happened, resulting in Padmé and Satine investigating the source. This had led to the discovery of a toxin known as slabin being used in a tea that was being consumed by the victims. The slabin was used to dilute and stretch out the tea quantity. Prime Minister Almec presumed Death Watch to be responsible, to which Satine expressed skepticism, as Death Watch only targeted her administration. Upon finding corruption in the Mandalore government, Satine and Padmé were led to the warehouse in which the tea was being made. The smugglers opened fire, but using a freight container as a shield, Padmé and the guards moved in and took them out, and following the arrest of the conspirators, Satine had the warehouse and its contents burned down. Satine confronted Prime Minister Almec, who strangely reluctant to acknowledge the corruption within the Mandalorian government and merely promises to have the matter investigated. As Padmé prepared to leave, Satine suggested bringing a Jedi to secretly investigate the corruption, and Padmé agreed to bring the matter to Yoda. The Jedi investigator they sent was none other than Ahsoka, who, with Satine's nephew Korkie and friends, exposed Almec as corrupt and brought an end to corruption on Mandalore."}, {"tag": "h4", "text": "Bounty hunter plots"}, {"tag": "p", "text": "Amidala was to go to Alderaan to speak with Bail Organa to an assembly about the war with the Separatists. While preparing for the mission, Amidala was approached by Ahsoka Tano, who had a Force vision revealing the Amidala was in danger of an assassination attempt by the bounty hunter Aurra Sing. Determined to speak at the assembly, Amidala still insisted upon travelling to Alderaan despite the warning. This prompted Ahsoka to accompany her on the trip to protect the Senator from any danger. During the first night Ahsoka had another vision leading her to believe the attack was happening at that moment, causing her to barge into the sleeping Senator's room. However, this was a false alarm."}, {"tag": "p", "text": "The next day, Ahsoka would reveal another vision that revealed the location of the assassination attempt: the hall in which Amidala was to speak that day. With security provisions taken, Amidala began her speech to the crowded hall. During the speech, Ahsoka sensed Sing in the room and immediately went after the hidden bounty hunter, preventing Sing from killing Amidala. Amidala was not unscathed in the attempt, however, as Sing managed to squeeze off a shot that went through the Senator's arm. Despite the intervention by the Padawan, Sing escaped, leaving the threat of assassination looming."}, {"tag": "p", "text": "Although the danger was still present, Amidala was still determined to speak at another assembly that night. To protect Amidala, Ahsoka and the security detail came up with a plan to keep Amidala safe while allowing her to speak. The plan was to send in the place of Amidala a droid clad in heavy robes to keep the identity secret. While the droid sat in, Amidala would be kept in a separate room thought to be safe from the assassin. During the speech, however, Ahsoka sensed that Amidala was still in danger and immediately rushed to the Senator's aid. Making it in time, Ahsoka prevented Sing from shooting Amidala, but was quickly overpowered by the experienced bounty hunter. During the battle, Ahsoka was shot in the arm, but while falling revealed Amidala with a blaster set on stun to incapacitate the assassin. After Sing was defeated she was arrested and transported back to Coruscant. During this time, Ahsoka used her Force Visions to help Amidala determine that Ziro the Hutt had hired Sing to assassinate the Senator. After a quick visit by Anakin and Ahsoka, Ziro confessed his crime, earning the Hutt an extended prison sentence."}, {"tag": "p", "text": "Amidala was desperately trying to arrange a party for Senator Aang, a member of the Military Oversight Committee, and despite Anakin's efforts to ease her mind, the stress wore her down, especially since Threepio was also quite fuzzy about the arrangements. Diplomatic disaster loomed when she was told that there was no jogan fruit for the cake. The dish was a favorite of Senator Aang's, and she had hoped the Roonan Senator's enjoyment of it would help convince him to support Amidala's diplomatic efforts in the war. Anakin sent Threepio and Artoo to fetch the jogan, but little did he know that lying in wait was ruthless bounty hunter Cad Bane, hired by Jabba the Hutt. Capturing the dawdling duo, the mercenary stole information on the Galactic Senate Building's headquarters from Artoo. He then had the two droids mind-wiped and dumped back in the place where they were snatched. The two droids then returned to their mistress's apartment, just in time for the cake to be served."}, {"tag": "p", "text": "Anakin Skywalker had just returned from his Jedi duties to be on a meditative retreat for two weeks, but instead decided to attempt to persuade Amidala to go away with him. When she refused, he questioned Amidala on whether she remembered that they were actually husband and wife, but Amidala again declined Skywalker's offer to go away together because she was finishing an important bill, which she needed to present to the Senate shortly. Skywalker said that nothing was as important as their love, and told her that she was his life. Indeed, he gave her his lightsaber to prove it. Amidala, however, thought that he was making fun of her by doing this. Skywalker assured her that he wasn't, and the two shared a kiss."}, {"tag": "p", "text": "Soon after, Senator Bail Organa entered Amidala's office, forcing the Jedi to hide behind her desk. Bail Organa requested that she come with him to the senate lobby to discuss the forwarding of the Enhanced Privacy Invasion Bill, before the Senate voted on it, with Senator Philo and others. After being hastily interrupted, Amidala was not able to give Skywalker his lightsaber back, so she took it with her, hiding it within the sleeve of her robe. Once she and Organa reached the lobby, they discussed with other Senators whether the Chancellor should be allowed to move forward with the bill. At this time, bounty hunter Cad Bane and his crew of thugs broke in and held them at gunpoint, so that they could exchange their lives with the release of Ziro Desilijic Tiure. However, Senator Philo, who called the meeting, refused to give in to the thug's threats and tried to walk out, but was subsequently shot in the back and killed. Amidala suggested, under her breath, to Bail Organa that they try and fight the thugs off, but he told her that the other Senators did not carry weapons. Amidala debated whether she should use her husband's lightsaber, but chose not to as she had no explanation for how she obtained it."}, {"tag": "p", "text": "Amidala nervously tried to avoid being searched by Cad Bane's crew, in case they came across the lightsaber. She confided in Bail Organa that she had it, and that she must not be searched. Bail Organa agreed, and Amidala managed to avoid being searched. Skywalker, being without his weapon, was caught by Bane's droids and was brought to the lobby to be held hostage along with Amidala and the others. Chancellor Palpatine and Senator Orn Free Taa of Ryloth, who were locked in the Chancellor's Office, were then forced by Cad Bane via hologram to release Ziro the Hutt."}, {"tag": "p", "text": "The Chancellor agreed to Bane's terms and Free Taa was taken to swap with Ziro at the prison on Coruscant. Once Bane had Ziro, and was safely away from the senate building, he detonated the laser-activated bombs he put in place before he left, blowing up the senate lobby. However, Amidala had given Skywalker's lightsaber back, and he managed to make an escape route for the Senators by cutting a large portion of the floor, before any harm could come to them."}, {"tag": "h4", "text": "Seeking peace over war"}, {"tag": "p", "text": "When the Senate debated whether to increase the war effort by deregulating the banks, Padmé spoke out, saying that it would only prolong the fighting, and the war had gone on long enough. Several Senators were outraged by this, while others were sympathetic. Padmé suggested opening peace negotiations with the Separatists, but many saw it as impossible. After the session, Padmé asked Anakin to ask the Jedi Council to speak with the Chancellor, but Skywalker refused, saying it wasn't the Jedi's place. Ahsoka stated it was their place to speak and advise the Chancellor, causing Anakin to ask Padmé to teach her about politics. Later in her office, Padmé asked Ahsoka to use her status as a Jedi to smuggle her behind enemy lines to Raxus so she could meet with her mentor Mina Bonteri to make peace negotiations in secret (as holding official meetings was illegal). After arriving on Raxus, Padmé and Ahsoka were instantly greeted by Bonteri with open arms. When Ahsoka said that Bonteri and the others started the war being a Separatist, Padmé tried to tell her off, but Mina said it was fine, and that not everybody in the CIS felt the same way about the Republic. With that Tano excused herself, and Amidala and Bonteri began the real talks. They both agreed on a need to end the war, and Mina agreed to put a motion of peace on the floor of the Separatist Parliament."}, {"tag": "p", "text": "Padmé and Ahsoka both witnessed the session in which the vote for peace passed. Upon returning to Coruscant, Padmé told Chancellor Palpatine that the Separatists had voted on peace and how the vote originated. In the senate, Padmé moved for a vote for peace now that the CIS had voted on a peace proposal. But before the vote could be taken, demolition droids destroyed the Coruscant power generators, and the most of the senate blamed it on the CIS, canceling the vote for peace and putting the vote to deregulate the banks forward. After the session, Amidala returned Ahsoka to Anakin, and Skywalker berated Amidala and Tano for doing something illegal. Nevertheless they both felt they had done the right thing."}, {"tag": "p", "text": "Amidala, Farr, and Organa continued with their crusade to end the war. Padmé tried to convince the Senate that not all the Separatists were bad people. Despite Senator Mee Deechi trying to paint her as traitor, the Chancellor agreed with Padmé about the Separatists. Count Dooku then contacted the Senate, saying that the Republic launched their own attack, killing Mina Bonteri and therefore ending peace with the Separatists. Padmé was deeply shocked by this. After the Senate had deregulated the banks, Senator Burtoni proposed a bill that would draw funds from the Banking Clan to fund five million additional clones. Amidala and her colleagues immediately opposed the bill. Once the bill was proposed, Amidala and Farr went to the Banking Clan to find the interest rate on the proposed loan. The Banking Clan Representative, Mak Plain, told the duo that the interest rate would be 25%. Filled with a new determination, Organa decided to speak against the bill before the full Senate, even though other members had been attacked for opposing it. Amidala and Farr spoke to Senator Christo about the matter. Leaving Christo's apartment, Amidala and Farr split up. Padmé was then attacked by bounty hunters Chata Hyoki and Robonino. Though two nearby police droids intervened, they were easily overcome by the two thugs. Not finding her driver, Amidala hijacked a civilian's BARC speeder and managed to shake off her attackers in a vicious chase. Police speeders eventually blocked Amidala's escape, claiming she was riding a stolen bike. The following day, Organa was attacked by the same bounty hunters. He was so injured, he had to be brought to the hospital. Amidala, though unsure at first, spoke before the full Senate and \"swayed the thoughts of millions.\" This she only did after the encouragement of her loyal aide, Teckla Minnau."}, {"tag": "p", "text": "Amidala worked tirelessly with fellow Senators Bail Organa, Onaconda Farr, and Mon Mothma in an effort to reduce and eventually halt the production of clone troopers and end the war. She gave a rousing speech before the Senate championing their cause, and although the oration was deemed a success, she was met with much criticism, especially from Senators Mee Deechi and Halle Burtoni, who went so far as to dub her a Separatist. During a group celebration after the speech, Farr became ill, dying soon after in an apparent heart attack. Amidala attended his funeral, grieving for her Uncle Ono, and was, along with Farr's aide Lolo Purs, presented with a summons to Supreme Chancellor Palpatine's office afterwards, where Lieutenant Tan Divo reported that Farr's death was, in fact, a murder. Fueled by anger over her friend's assassination, as well as the nagging suspicion that Divo had a level of incompetence to him, Amidala teamed up with Organa, interviewing Deechi and Burtoni and discovering that, through the use of a spy, Deechi had spotted Farr holding several clandestine meetings at the Coruscant docks. Though the two set out to the docks, they were soon separated by a cloaked shooter. Although Amidala was able to provide ample chase, she was forced to choose between saving Organa and pursuing their attacker."}, {"tag": "p", "text": "The shooting was reported to Lt. Divo, who soon arrived at the scene to thoroughly reprimand the Senators. Nonplussed by their chastising, Amidala and Organa stormed back to Deechi's office to accuse him of setting a trap, only to find the Umbaran dead with a knife to the heart. Divo insisted upon locking the two in his office with heavy protection, along with Mothma and Purs, although the late Farr's aide immediately expressed indignation with the situation and stormed out. She returned soon after with claims of an attack from Halle Burtoni, who was soon brought in and arrested by Divo for murder. As the Kaminoan was being led out in handcuffs, Amidala had one last burst of inspired thought: if Farr was killed by a poison specifically engineered for Rodians, Purs would have died too, but she had not have a drink that day. Caught at last, Purs drew out a gun and pressed it to Amidala's forehead, using the Senator as a shield as she moved towards the exit. However, during the aide's emotional confession Amidala was able to break free of Purs' stronghold and deliver a knockout punch, allowing Divo and his droids to move in and arrest the true murderer."}, {"tag": "h4", "text": "Second Battle of Mon Calamari"}, {"tag": "p", "text": "After the assassination of King Yos Kolina of Mon Calamari, the fragile peace between the Mon Calamari and the Quarren began to collapse. At the behest of Kolina's chief military adviser, Captain Gial Ackbar, Padmé came to help negotiate a compromise between both races, with Anakin as her bodyguard. When the peace talks ended, Padmé, along with Anakin and Ackbar, contacted the Jedi Council, telling them that the Quarren had decided to withdraw from the Republic. When the Quarren, backed by Commander Riff Tamson's Separatist forces, attacked, Amidala and Skywalker fought alongside the Mon Calamari, but with the Separatists' reinforcements of aqua droids, the battle quickly turned in their enemies' favor. Fortunately, the Republic reinforcements arrived and they, for the time being, had the upper hand. However, the Quarren soon returned with a secret weapon: Hydroid Medusas, cybernetically enhanced biological weapons with electrified tendrils. The Republic forces were quickly forced to retreat. Anakin, Padmé, Ahsoka Tano, Kit Fisto and Captain Ackbar then decided to get the heir to the throne, Prince Lee-Char, and Mon Calamari Senator Meena Tills to their ship and out of the system to safety. But before they could do so, Tamson had their ship destroyed. The fugitives then retreated to the seabed."}, {"tag": "p", "text": "With no troops to spare, the Jedi Council decided to ask for the Gungans' help. Master Yoda therefore contacted Boss Lyonie and the Gungan High Council. Although Lyonie was initially hesitant, Jar Jar Binks quickly convinced him that they had to help Amidala out of loyalty to the Naboo Senator. Lyonie eventually agreed to send the Gungan Grand Army to Mon Calamari."}, {"tag": "p", "text": "After the Gungan reinforcements arrived, Tamson decided to use his Trident assault ships to create blinding whirlpools. Taken by surprise and disorientated, the Republic, Mon Calamari and Gungan forces were defeated. Anakin, Fisto, Padmé and Jar Jar were imprisoned by Tamson with electric eels for the Jedi and shackle droids for the Senators. He then began to question them about Prince Lee-Char's whereabouts. Exasperated by the Jedi's silence, Tamson used his huge jaws to crack Padmé's helmet, allowing water to spill into her suit, hoping that the Jedi would eventually talk. When he finally learned that Lee-Char had been apprehended, Tamson abandoned the Senator to her fate. Nossor Ri, the Quarren chieftain, saw Anakin's suffering and finally confirmed to himself that the Karkarodon Commander was not trustworthy. As soon as Tamson left, Anakin and Fisto used the Force in order to remove the water from Padmé's helmet and Jar Jar spat his \"Gungan waterproofin'\" to seal the breach. The prisoners were then taken to watch the Prince's public execution, but the Quarren suddenly turned on the Separatists and helped save Lee-Char. A battle ensued in which Lee-Char killed Tamson and the Separatists were defeated. Amidala, along with the Jedi, stayed on the planet to watch Lee-Char's coronation before leaving."}, {"tag": "h4", "text": "Skirmish on Naboo"}, {"tag": "p", "text": "Padmé and her Jedi husband were sent to investigate rumors that the Gungan Army was planning on marching on Theed with the Separatists. After their arrival on Naboo, they met with Jar Jar Binks, who took them to Otoh Gunga, where Boss Lyonie was attempting to rally the Gungans for the impending conflict. Anakin and Padmé quickly noticed that Lyonie appeared to be possessed or under someone's influence. The cause was a mind-control necklace which Anakin telekinetically snatched from Lyonie's neck. Lyonie revealed that the necklace had been given to him by Minister Rish Loo. Loo was helping the Separatists invade Naboo in exchange of a position of power in the Separatist Alliance. Lyonie confronted Loo in order to get an explanation, but the latter used his mystical powers on Lyonie once again. When Anakin and Padmé came to Lyonie's aid, commando droids attacked them at the Gungan Minister's orders. Loo then stabbed Boss Lyonie and escaped. Seriously injured, Lyonie couldn't possibly call off the Gungan invasion. However, when Jar Jar put the Boss's crown of office on his head, Anakin and Padmé immediately noticed a striking resemblance between the two Gungans and hatched a new plan. Jar Jar would take Boss Lyonie's place and tell the army to stop their attack on the Naboo."}, {"tag": "p", "text": "On the surface, Rish Loo announced Boss Lyonie's death. The disguised Jar Jar appeared just in time and denounced Loo as a traitor. However, Loo managed to escape again, and as Anakin was pursuing him, General Grievous and his droid army landed on Naboo. Jar Jar, along with General Tarpals, then entered Grievous' ship and negotiated with the cyborg General. Terrified, Jar Jar desperately stalled for time and sent Tarpals out to contact Amidala. Padmé advised him to try and capture Grievous by taking advantage of the alliance with the Separatists and shutting down the droids. Grievous eventually became highly irritated by faux Lyonie, who quickly escaped. Outside, the Gungans immediately attacked Grievous. The cyborg Kaleesh fought back and fatally stabbed General Tarpals. With the last of his strength, however, Tarpals jammed his spear right through Grievous's metal shell, enabling his capture. Seriously annoyed by this, Darth Sidious ordered Dooku to lure Skywalker into a trap in order to capture him for a prisoner exchange. In the meantime, Anakin chased after Loo, who brought him to Dooku's lair. After killing Loo, the Sith Lord and his MagnaGuards confronted Anakin in a fierce lightsaber combat. Outnumbered, the Jedi Knight was eventually defeated and shocked into unconsciousness. On Sidious's advice, Dooku then contacted Amidala and offered her to release Skywalker in exchange for Grievous. Amidala, shocked and upset at the capture of her husband, was conflicted between her duties to the Republic and her feelings for Anakin. Though initially hesitant to give up Grievous, Jar Jar reminded her that Anakin was their friend, finally causing her to relent. Sometime thereafter, the prisoner trade took place. The Separatists then left the planet."}, {"tag": "h4", "text": "Aleen in need"}, {"tag": "p", "text": "When the Separatists moved to annex the Qiilura system, Commander Wolffe and the 104th Battalion were dispatched to aid Jedi Master Plo Koon in thwarting the Separatists' plans. En route to Qiilura, they were reassigned to deliver humanitarian supplies to the planet Aleen, where groundquakes had inflicted mass casualties among the native Aleena species. After the Republic forces located survivors, Wolffe reported the news to Senator Amidala and Master Yoda, who were pleased to learn that many had lived through the disaster. Wolffe had no such compassion and quickly informed the Senator of his orders: getting the Aleena on the path to rebuilding and then moving on to help Master Plo. For this mercy mission, the 104th Battalion also brought along Amidala's protocol droid, C-3PO, to translate the Aleena's native language and Skywalker's astromech droid, R2-D2, to restore Aleen's computer systems, which had sustained damages. Later, in Jedi Master Adi Gallia's cruiser, C-3PO and R2-D2 reported to Senator Amidala via hologram about their recent adventure. However, in the midst of communication, three Separatist cruisers under the command of General Grievous launched a surprise attack on their ship, crippling it critically and forcing an evacuation of the vessel."}, {"tag": "h4", "text": "Interrupted peace negotiations"}, {"tag": "p", "text": "The first ever-sanctioned meeting between the Republic and the Separatists was held and Mandalore was chosen as neutral ground. Amidala, accompanied by Senator Organa, Senator Mothma and Padawan Tano, led the Republic delegation in discussions with the Separatist Senators, Voe Atell, Bec Lawise and Amita Fonti. Atell demanded the Republic to recognize the CIS as a legitimate state. Before Padmé could answer, Lux Bonteri entered Duchess Satine's throne room and delivered an embittered accusation against Count Dooku for his involvement in the murder of his mother, Mina Bonteri. Calling him a traitor, the Separatist delegates had him thrown out of the room. Fearing that he would be executed for voicing the truth, Padmé allowed Ahsoka to go help Lux. When the meeting was over, Amidala contacted her husband to tell him that the peace negotiations had all but collapsed and about the situation with his Padawan and Bonteri."}, {"tag": "h4", "text": "Kenobi's \"funeral\""}, {"tag": "p", "text": "Amidala was at the Jedi Temple in order to attend Obi-Wan Kenobi's funeral ceremony. The latter pretended to be dead in order to learn more about a Separatist plot to kidnap Supreme Chancellor Palpatine. Besides Obi-Wan, only Master Yoda and Master Windu knew Kenobi did not really die. Other mourners included Duchess Satine, Bail Organa, Mon Mothma, Jar Jar Binks, Anakin Skywalker, Ahsoka Tano, Barriss Offee, Saesee Tiin, Plo Koon, Ki-Adi-Mundi, Shaak Ti, Adi Gallia, Mace Windu, Yoda and other Jedi."}, {"tag": "h4", "text": "Crisis on Naboo"}, {"tag": "p", "text": "Supreme Chancellor Palpatine, Mace Windu, Anakin Skywalker and Ahsoka Tano arrived in Theed for Naboo's traditional Festival of Light, where they were welcomed by Queen Neeyutnee, Governor Sio Bibble, Senator Padmé Amidala and Senator Bail Organa. Anakin, worried about his wife's safety, assigned his Padawan to be Amidala's personal bodyguard during the event. That night, hundreds of spectators gathered at the overlook plaza. As fireworks erupted following a rousing speech from the Chancellor, a bounty hunter named Derrown used the distraction to slink through the security shield, toward the generator. He detonated it, and the shield collapsed. Ahsoka immediately shuffled Senator Amidala and other delegates to safety. Later, after the first attempt to kidnap Chancellor Palpatine failed, Anakin shared his frustrations with Obi-Wan about the Jedi Council's lack of trust in him. Obi-Wan revealed that it had been his decision to keep the truth from him about his fake death. Anakin angrily wondered how many truths Obi-Wan and the Council could be keeping from him. In the darkened corridors of the Theed Royal Palace, Palpatine told Anakin that they would leave after the queen's banquet was finished. Anakin was surprised that Padmé didn't tell him anything about it. However, it was a trap, as Dooku and his MagnaGuards were waiting for them in the banquet hall. Anakin fought them, but was quickly overwhelmed. Obi-Wan arrived just in time to help Anakin and save the Chancellor."}, {"tag": "h4", "text": "Trial of Ahsoka Tano"}, {"tag": "p", "text": "After the Jedi Temple became the victim of a terrorist attack, Ahsoka Tano was wrongly accused of and arrested for the bombing as well as the murder of the imprisoned saboteur, Letta Turmond. Senator Amidala was assigned to represent her husband's Padawan in her trial, while Admiral Wilhuff Tarkin acted as the prosecution. Tarkin wanted the full weight of the law to be brought down upon the former Padawan, including penalty of death. Amidala then made her speech in Tano's defense, trying to convince the Court that even if the culprit was a Jedi, it couldn't possibly be Ahsoka. Admiral Tarkin subsequently pointed out the fact that Tano had been seen conspiring with former Separatist, Asajj Ventress. Ahsoka tried to defend herself by claiming that Ventress had actually set her up, but unfortunately in vain. When the Court was about to render its decision, Skywalker and Jedi Temple Guards arrived just in time with the real culprit, Jedi Barriss Offee, who admitted that she was responsible for everything Ahsoka had been accused of."}, {"tag": "h4", "text": "Strike at the core"}, {"tag": "p", "text": "In 19 BBY, Amidala was present on Coruscant when General Grievous and the Separatist army made an attack on the capital, kidnapping Chancellor Palpatine in the process. Though she was now pregnant with Skywalker's children, the Senator still proved able in combat, helping to lead the evacuation of the Senate Apartment Complex. Later, assisted by Jedi Council members Shaak Ti and Stass Allie, Amidala and Senators Bail Prestor Organa and Mon Mothma acquired a small transport to take them to one of the Senate Complex's bomb shelters. En route, the trio of Senators was forced to combat droid starfighters, with Amidala again proving proficient with a blaster."}, {"tag": "p", "text": "Once Palpatine had been rescued and Grievous' capital ship crash-landed on Coruscant by Skywalker, Kenobi and R2-D2, Amidala was reunited with her husband in the shadows of the Republic Executive Office building. It was then that an anxious Amidala informed him of her pregnancy. She feared that if anyone found out, the queen would not allow her to maintain her position in the Senate and that her husband would be cast out of the Jedi Order. Skywalker assured her that the baby was a miracle, not a problem. Soon after, Amidala began planning to raise their child on Naboo."}, {"tag": "h3", "text": "End of democracy"}, {"tag": "p", "text": "By the end of the war in 19 BBY, the pregnant Amidala became increasingly alarmed by the changes in her husband's character as he was seduced to the dark side. Furthermore, she became disturbed by his visions of her dying in childbirth, especially when he stated that he could not see the fate of their child. When Obi-Wan left for Utapau to hunt down General Grievous, she pleaded with Skywalker to tell Palpatine to end the war, return to the use of diplomacy and give up all the emergency powers the Senate had awarded him, but he refused to do so."}, {"tag": "p", "text": "Senators Mon Mothma and Bail Organa both felt that their cause needed a strong and influential member of the senate to join and Mon Mothma asked Organa if he'd consider allowing Senator Amidala into their efforts to stop the Chancellor from further subverting the constitution. Amidala more than willingly accepted Organa's offer, as after all this was what she had been fighting for and after attending and holding a number of meetings with various worried Senators—such as Chi Eekway, Terr Taneel, Giddean Danu and Fang Zar—Amidala agreed to lead the Delegation of 2000, a group of Senators opposed to the dictatorship that Chancellor Palpatine's rule was creating."}, {"tag": "p", "text": "Though she was the spokesperson for the committee, her efforts to try and involve the Jedi were futile, as her peers felt that it was too dangerous at that point to involve the Jedi, as they were unsure of whom they would side with and they didn't want the Chancellor knowing of their opposition. While the petition presented by Amidala to the Chancellor would pave the way for a later resistance movement, the Rebel Alliance, its immediate effects were the reverse of what was hoped, with Palpatine first ignoring it altogether and then using it to round up what he coined \"traitors to the Senate\" during and after his ascension to absolute power."}, {"tag": "p", "text": "Amidala was, with her retinue, present in the Senate chamber during a special session in which Chancellor Palpatine presented \"proof\" of a Jedi rebellion against the Senate, which in actuality was an attempt to arrest Palpatine for his allegiance with the Sith. Painting himself as a heroic survivor of such an attack, Palpatine convinced the Senate of the Republic's reliance on the protection he could offer it. With little to no resistance in the Senate—for indeed many of Amidala's fellow Delegation members began to be rounded up as the speech took place—Palpatine declared himself Emperor, much to the dismay of Amidala and Bail Organa, who was with her."}, {"tag": "p", "text": "Though the latter attempted to vocally oppose the declaration, Amidala assured Bail that this was not the time. Indeed, she was correct, as the future generation would testify. Amidala, having been warned by her husband to distance herself from her \"friends in the Senate,\" well understood the need for her not to be a vocal supporter of the Resistance movement, and thus she asked Organa to continue his movement without her knowledge. Being watched by both Skywalker and Imperial spies, Amidala knew that any involvement on her part would jeopardize both Organa's efforts and his life. Knowing this, she advised Organa to support Palpatine and the Empire on the surface while covertly working to subvert his goals."}, {"tag": "h4", "text": "Death of liberty"}, {"tag": "p", "text": "While still queen during the Naboo Crisis, Amidala, feeling the urgency of relief for her people, was maneuvered by Darth Sidious to vote Chancellor Valorum out of office, making room for Sidious, as Palpatine, to rally support for himself and become the leader of the Galactic Senate."}, {"tag": "p", "text": "Additionally, regardless of her personal feelings for Anakin Skywalker or her devotion to the Galactic Republic during her career as a Senator for her people, Amidala was instrumental in Skywalker's fall and his subsequent aid in the rise of the Empire. Skywalker already had the seeds of the Empire sown within him, having grandiose ideas of how to prevent the type of ill-treatment he and his mother suffered during their lives. Though Amidala expressed disapproval of his political philosophy when he expressed it to her, she did not successfully readjust his thinking. Upon the revelation of their love for each other and their subsequent secret marriage, Amidala was torn between her state duty to keep her distance and her role as wife to encourage such feelings. She nevertheless helped to foster in her husband a deep emotional bond, providing him with a forbidden relationship that he could not bear to lose, and would fight to keep at all costs. She, therefore, had unwittingly become one of the main driving factors that contributed to his transformation into a Sith Lord."}, {"tag": "p", "text": "Thus, in a sense of total irony, Amidala had helped to destroy the very Republic to which she had devoted her life, both by unknowingly having been manipulated into giving Palpatine the opportunity to seize power for himself, and by indirectly corrupting Skywalker as he fell to the dark side, having himself become susceptible to the subtle influence of Darth Sidious."}, {"tag": "h4", "text": "Final days"}, {"tag": "p", "text": "Not long after the Emperor's declaration, Amidala was visited by Kenobi. He told her of hologram evidence he had seen of Skywalker's raid on the Jedi Temple and his allegiance with the Sith. Amidala refused, at least outwardly, to believe such claims and, in order to ensure her husband's safety, did not tell Kenobi where Skywalker had gone. During this exchange, Kenobi discovered her involvement with Skywalker and left, understanding her reservations. Upon this revelation of her husband's dark deeds, Amidala traveled to the planet Mustafar to intercept Skywalker and discover the truth, although inwardly Amidala likely understood not only the truth of Kenobi's claims, but its effects on her marriage. She did not realize that before the journey, Kenobi had stowed away on board her Naboo Skiff."}, {"tag": "p", "text": "Shortly after the Separatist slaughter, Amidala met with Skywalker (dubbed Darth Vader by Palpatine) on Mustafar, revealing what Kenobi had told her. Upon discovering the truth of Kenobi's statements, she attempted to persuade him to turn back to the light side of the Force, to run away and raise their child. When he told her his plans to slay Sidious and become Emperor with her at his side, Amidala realized he had changed and that she could not follow him down his chosen path. Amidala begged her husband to leave with her, tearfully saying she still loved him."}, {"tag": "p", "text": "However, Kenobi revealed himself on the ramp of Amidala's ship. Not even allowing her the chance to explain herself, Vader succumbed to his anger and Force choked her, believing that Amidala had brought Kenobi to kill him. Kenobi managed to distract Vader to release her, barely preserving Padmé's life. C-3PO and R2-D2 then moved their fallen mistress into her ship, where they awaited Obi-Wan Kenobi's return."}, {"tag": "h4", "text": "Birth of the twins and Padmé's destiny"}, {"tag": "p", "text": "After Kenobi defeated Vader in a lightsaber duel, only to have Darth Sidious rescue his injured apprentice, the Jedi Master took the pregnant Amidala to a medical facility on the asteroid Polis Massa, where Master Yoda and Bail Organa awaited their arrival. There, a medical team attempted to save Amidala's life. However, they discovered that she was dying, having apparently lost the will to live, her heart broken because of her lover's transformation into a Dark Lord of the Sith."}, {"tag": "p", "text": "In the last minutes of her life, Amidala gave birth to healthy twins, Luke Skywalker and Leia Amidala Skywalker, both of whom would later go on to join the Rebellion Padmé and other Senators had started and defeat the Empire together. In her final breaths, she told Obi-Wan Kenobi that good still remained in her husband, now Darth Vader. Padmé Amidala died at the age of twenty-seven. Her daughter, Leia, was adopted by Senator Bail Organa and his wife, and her son, Luke, was taken in by his father's step-brother and his wife."}, {"tag": "p", "text": "There were conflicting reports regarding Amidala's death, its circumstances, and how she spent her final hours, but all the autopsy reports agreed on two things: that she died by strangulation, and that the child she was pregnant with had died with her. What puzzled people most though was how exactly she could have been strangled when there were no external signs of strangulation. There were no signs of bruises on her neck, there were no scratches of any kind nor signs of congestion; there were no signs of exterior trauma at all. Her throat was \"pristine.\" This led some, including Captain Typho, to conclude that Amidala was Force-choked. Typho also knew that Amidala had gone to Mustafar to meet Jedi Knight Anakin Skywalker. Therefore, Typho concluded, Skywalker must have either killed Amidala, or known who did. Either way, he was Typho's only lead to find out what really happened to Amidala, and he would follow it until he got answers."}, {"tag": "h4", "text": "Funeral of Amidala"}, {"tag": "p", "text": "After her death, Amidala was laid to rest in Theed. Her casket was drawn through the streets of Theed, leading an enormous procession of mourners that included her family, Queen Apailana, Boss Rugor Nass, close friend Representative Jar Jar Binks, Governor Sio Bibble, Captain Gregar Typho, many Senators (such as Bail Organa, Mon Mothma, Veedaaz Awmetth, Ivor Drake, Eeusu Estornii, Silya Shessaun, Gem Sirrom and Solipo Yeb) and her past and present handmaidens, who acted as Amidala's pallbearers."}, {"tag": "p", "text": "The japor snippet that Skywalker had given to her in 32 BBY rested in her hands. Thousands of people lined up in the streets of the city to pay their respects to the remarkable woman who had given her life, freed their world from occupation, united its people and spoken for democracy. The body of the late Senator was finally entombed in a private burial chamber."}, {"tag": "p", "text": "Afterwards, one of the first resolutions passed by Palpatine after the formation of the Empire was a national day of mourning for the \"murdered\" Amidala.[source?]"}, {"tag": "p", "text": "Padmé's death would haunt Vader for the rest of his life. Despite the supremely evil being that the Sith Lord would become, he was never able to shake himself of the emotional agony caused by his wife's passing, and the guilt of knowing he was responsible for her death."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Shortly after her funeral, Amidala's son, Luke Skywalker, was given to the care of her husband's step-brother, Owen Lars, and his wife, Beru, on their moisture farm on Tatooine. Luke would follow in his father's footsteps, becoming a powerful Jedi. Leia, meanwhile, was formally adopted by Bail Organa and his wife, Breha, becoming the heir apparent to Alderaan as Princess Leia Organa. Her life would mirror her mother's, with Leia also serving the Senate as well as championing similar causes. However, in her later years, Leia would also take the path of her father and brother and become a Jedi as well at the end of the Swarm War."}, {"tag": "p", "text": "Amidala's family and Queen Apailana were informed by Imperial Intelligence that she had been killed, along with other Senators, by rogue Jedi on Coruscant. An investigation into who had impregnated her would have gone against Naboo tradition, yet many doubted this official statement, with Apailana even going on to harbor Jedi who had escaped Order 66. Amidala's longtime friend Senator Silya Shessaun also had her doubts about the circumstances of Amidala's death and pushed for a Senate investigation after attending Amidala's funeral. Little was accomplished in this regard due to opposition by Palpatine, citing \"security concerns.\" Her former handmaiden Sabé was equally frustrated by what little she knew of her friend and former mistress's death. She eventually befriended Senator Bail Organa and became one of his principal agents. She was also asked by Organa to tutor Leia and her companion Winter in a variety of subjects, from etiquette and bureaucracy to the more esoteric arts. In 18 BBY, Amidala's maternal grandmother, Ryoo Thule, was killed by Inquisitor Malorum, who had gone to Naboo to investigate Amidala's pregnancy and uncovered that her offspring had not died. Thanks to Ferus Olin, a former Jedi, this information died with him."}, {"tag": "p", "text": "Additionally in 18 BBY, Amidala's head of security during her time as Senator of the Chommell sector, Gregar Typho, secretly began an investigation into her death, as while he served under her, he had developed an unrequited love for her. Typho later discovered that Amidala had died due to strangulation, a fact that had initially been missed due to the fact that there were no exterior signs of trauma of any kind (including but not limited to bruising on the neck, scratches, and/or signs of congestion on the neck). Multiple, more in-depth autopsies all concluded that Amidala had indeed died of strangulation, and despite the fact that there were no external injuries to conclude this, there were internal ones, such as a fractured hyoid bone, damage to the larynx, and compression of the trachea. Typho soon discovered that Darth Vader was somehow involved in the death of his beloved, and after luring the Dark Lord of the Sith to an abandoned location, with the bait of Jedi Knight Jax Pavan, so as to avenge the Senator, Typho himself died at the hands of Amidala's former love and killer."}, {"tag": "p", "text": "During the rule of the Galactic Empire, the Mon Calamari Shipyards built a luxury starliner named after her, the RNS Queen Amidala IV, that boasted an innovative Class One hyperdrive. Like the Kuari Princess, the components of the Queen Amidala IV were explicitly developed as prototypes for future Imperial warships. However, the ship was also implicitly part of a larger plan for Dac's liberation from the Empire. In 1 BBY, the Mon Calamari and the Quarren finally rose up and overthrew their oppressors. The planet subsequently joined the Rebel Alliance."}, {"tag": "p", "text": "In the years before the Battle of Yavin, Amidala's youngest niece, Pooja Naberrie, served together with Amidala's daughter as Senators in the Imperial Senate. Neither woman, however, was informed of their biological relationship at that time."}, {"tag": "p", "text": "Shortly before the Battle of Endor in 4 ABY, Luke asked Leia if she remembered her mother at all. From very faint recollections, Leia described her as \"very beautiful, kind, but sad.\" Luke remarked that he had no memory of Amidala whatsoever. Unknown to either of them, a large painting of Amidala still hung in the Imperial Palace, even up to the Thrawn campaign, twenty-eight years after her death."}, {"tag": "p", "text": "Amidala was briefly seen in a hologram projected by R2-D2 while Luke was fixing him in 35 ABY. R2 showed Anakin Skywalker telling her about his dream of her death in childbirth. Until this revelation, Luke and Leia had been unaware of the identity of their mother, though they had been aware of a \"Senator Amidala\" who had served in the final days of the Old Republic, they had suspected she was their mother, but hadn't firmly believed it. Later, shortly before and during the Swarm War, Luke also saw recordings of his mother's conversations with Anakin Skywalker and Obi-Wan Kenobi. He also watched a recording of her death."}, {"tag": "p", "text": "Sometime in 36 ABY, Leia traveled to Naboo to inform her former colleague in the Imperial Senate, Pooja Naberrie, of their biological relationship through Amidala."}, {"tag": "p", "text": "Four years later, Amidala's grandson, Jacen Solo, flow-walked back 59 years to see why his grandfather had fallen to the Dark Side. Once he realized that Skywalker had fallen in order to prevent Amidala's death, Solo was convinced that his reasons for becoming a Sith were more compelling than Skywalker's had been."}, {"tag": "p", "text": "By 137 ABY, Amidala's penthouse apartment on Coruscant had been converted into a high-class restaurant called the Naboo Queen. Moff Rulf Yage, his daughter, Gunn Yage, and her mother, Nyna Calixte, had a meal in the restaurant shortly after Cade Skywalker, Amidala's descendant, infiltrated the capital world."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Amidala took to heart the lessons of self-sacrifice that had been taught her by her parents, and throughout her life she continued to do what was best for her people and the Republic she believed in, without thought of herself. Her sister sometimes scolded her for this attitude. She rarely gave in to personal desires, such as at a young age denying Ian Lago her affection, saying that Naboo needed her more than he did. She was compassionate, always considering other people before herself, and she stood firm in what she believed in. She was also a persuasive and extremely empathetic speaker, as evidenced by her speeches as a Senator, particularly when she opposed the escalating violence of the Clone Wars. She was even willing to doubt the Republic in its later years, because of how far it had fallen short of its duty. In part, her firm belief in democracy and her genuine care for her people made her election for Queen of Naboo a landslide. Unable to deny her people's need, she accepted Queen Jamillia's invitation to become Senator after her two terms as queen ended. She was obviously well-loved by her people, as she kept several privileges usually restricted to the monarch of Naboo during her time as a Senator, such as allowing her ships to be chrome plated."}, {"tag": "p", "text": "Amidala matured quickly, as evidenced by her quick rise to political heights at a very young age, becoming queen at only fourteen years old. Though responsible, she was a strong-willed person, who continued to do what she believed to be right despite those closest to her standing against her. She followed her own instincts in pleading to the Senate for help as queen, and in returning to Naboo afterwards to strike out on a limb to unite with the Gungans. She also refused heightened security, even after blatant attacks on her life during her time as Senator, going so far as to cover security cameras. Though her security's fears were proven true time and again, Amidala was still loathe to leave during the vote on the Military Creation Act, and only an order from the Supreme Chancellor could make her concede. Although a popular senator, she was not above subjecting herself to controversy regarding her beliefs, as evidenced by how she earned the irritation from the Stark Veteran Assembly for her implication that those who pursued war were cowards and that true bravery required finding non-war solutions, with Dorits in particular calling her comments \"disgraceful, stupid, and typical.\" Similarly, she was not above lying to achieve a political end. Such was demonstrated during the events of the first attempted assassination, where Padmé, when alluding to how the assassination attempt targeted both her and the security measure, strongly implied that the ones responsible had been among the pro–Military Creation Act senators, yet afterwards, when meeting with Palpatine and the Jedi, she privately admitted that she suspected that Count Dooku of the Separatists had in fact been responsible."}, {"tag": "p", "text": "Her strong will and self-restraint were proven again when she firmly told herself and Skywalker that a relationship between them would go nowhere and would endanger both of their futures. She saw how difficult it would be, and how much it had the potential to ruin their lives, and, though it was difficult for her to accept, she attempted to persuade Skywalker to see it as well. However, when she believed she was about to die, she saw no harm in admitting her true feelings, believing that they could not come to pass. However, when they survived their attempted execution, she and Skywalker could no longer deny their love. Despite this, she still tried to keep her relationship with Anakin a secret, even after they were married."}, {"tag": "p", "text": "Even then, she remained loyal as a Senator to her people, and continually urged Skywalker to stay loyal to the Order, even when, at times, he wanted to refuse an order because of the long periods of time away from her. Though pained by the long separations they had to endure, Amidala kept strong for them both, knowing the great burden placed on both of their shoulders. She believed strongly in Skywalker, and when she heard of his exploits during the Clone Wars, she was enthralled, though she remained worried for his safety. Her belief in him became even more evident when she began to believe him over the Jedi Order when he told of their manipulations of him to use him as a spy for their own purposes. She was reluctant even to believe Obi-Wan, a close friend of theirs, when he told her of Anakin's dark deeds. Partly to reassure herself that what he had said was not true, she traveled to Mustafar to ask Skywalker herself. When her husband confirmed her worst nightmares, she still refused to believe that he could not come back to the light and urged him to do so. Even at her death, Amidala continued to have faith in her husband, speaking of the good still in him—though no one believed her at the time. Twenty-three years later, her son would come to share this belief, proven correct when Vader turned on his Master to save his son."}, {"tag": "p", "text": "Though her marriage to Skywalker was undoubtedly the closest of all her relationships, Amidala maintained a number of close friendships throughout her life. From her early days, Amidala was a favorite of Onaconda Farr, who served alongside her father in the Senate. Their relationship was so close that Amidala even referred to him as \"Uncle Ono.\" This friendship only became strained at one point when Farr briefly joined the Separatist Alliance after despairing of Republic aid during a severe famine. Though Farr had Amidala imprisoned on the orders of Nute Gunray, Viceroy of the Trade Federation and Amidala's archenemy, Amidala forgave him wholeheartedly for his mistake and later defended his honor in front of Farr's Senatorial aide and murderer, Lolo Purs. Amidala's other close friends in the Galactic Senate included Bail Prestor Organa, who would eventually adopt her daughter, and Mon Mothma. They often worked alongside Amidala in peace efforts before and during the Clone Wars, though Organa and Mothma eventually became skeptical of the direction in which the Republic was headed under the control of Palpatine. Though Amidala was outspoken in her loyalty to the Republic, Mothma and Organa trusted her enough to invite her to secret meetings that proved to be the seed of the Rebel Alliance."}, {"tag": "p", "text": "Amidala was loved by all her people for the interest she showed in their personal lives, no matter how menial their roles. Thus, it is no surprise that Amidala was quite close to her handmaidens and staff. During her reign as Queen of Naboo, Amidala selected a number of handmaidens alongside whom she had trained. These handmaidens assisted her in her personal life as a monarch and were her last line of defense in case of an emergency. As queen, Amidala was particularly close to Sabé, who served as her double whenever the queen was in extreme danger. They were so close that Amidala and Sabé could communicate in the subtlest of phrases or glances. Sabé would later be enlisted by Bail Organa to train her former mistress's daughter. As a Senator, Amidala cut down on the number of handmaidens who attended her, though she still remained close to those she had. One of these handmaidens, Cordé, was killed in an explosion intended to put the Senator out of commission before an important vote. Amidala was grief-stricken at the loss of Cordé. Her only other handmaiden at the time, Dormé, remained unshaken by this loss and voluntarily doubled for Amidala when she fled into hiding on Naboo following a second assassination attempt. In fact, Dormé remained more concerned for Amidala than she did for her own safety. While staying with Skywalker on Naboo, Amidala enlisted the help of a family friend, Teckla Minnau, who later served Amidala as handmaiden briefly during the Clone Wars. The last handmaiden to serve Amidala before her untimely death was Moteé. Moteé was one of the few privileged to know of Amidala's marriage as she helped the Senator dress appropriately to conceal her pregnancy. Amidala also developed decent friendships with her heads of security, Panaka and Typho. Though Typho developed a love interest in Amidala, the Senator never let their friendship go beyond a strictly professional level."}, {"tag": "p", "text": "Both during her reign as queen and her time serving as a Senator, Amidala presented herself as an advocate for the Gungans. Relationships between the Human inhabitants of Naboo and the natives had always been tense, but during the invasion by the Trade Federation, Amidala managed to unite the two species against a common enemy. She and Gungan Boss Nass achieved a level of mutual respect, which she carried even for his successor, Boss Lyonie. Amidala also worked so that the unrepresented Gungans might have a say in the Galactic Senate. This goal was achieved when Jar Jar Binks became a representative of Naboo alongside Amidala. Eventually, Binks also became a Senator. During the Clone Wars, the Gungans continued to call on Amidala for aid when relations between them and the Naboo became somewhat unstable. Amidala was summoned when battle droids appeared once again on the planet and a mysterious plague instantly killed the Shaak of a Gungan herder named Peppi Bow. Later, Amidala was also sent to Otoh Gunga when Boss Lyonie stirred up dissent among the Gungans while under the influence of Rish Loo. Ultimately, Amidala's constant care for the Gungans turned the tide in the battle on Mon Calamari between the Mon Cala and the Quarren."}, {"tag": "p", "text": "Unlike many Senators, Amidala also maintained close contact with her homeworld's ruling monarch. Queen Jamillia trusted Amidala's advice on the state of the Republic and helped hide the Senator from her assassins. During the Clone Wars, Queen Neeyutnee turned to Amidala first in any situation of crisis. Apailana, the third queen to follow Amidala, showed the Senator great respect for her contributions to her planet and to the galaxy."}, {"tag": "p", "text": "Amidala had four major types of vehicles that belonged to her throughout her life, although she used many others for special circumstances. The first one was the Naboo Royal Starship, while she was the Queen of Naboo. When she became Senator, she was given the J-type diplomatic barge, although chromed vehicles were usually reserved for Nubian royalty. However, this was destroyed by Zam Wesell in 22 BBY. Padmé borrowed a Nubian Yacht to travel to Tatooine with Anakin and later to Geonosis. This type of vessel was used interchangeably throughout the Clone Wars with her star skiff."}, {"tag": "p", "text": "Padmé Amidala could read, write and speak Basic, Ithorese, Mon Calamarian, Gran, Gunganese, High Galactic, and Rodese. As a queen, she received extensive martial training from Captain Panaka for use in self-defense. In combat, her weapon of choice was the sporting blaster ELG-3A blaster pistol."}, {"tag": "h2", "text": "Relationships"}, {"tag": "h3", "text": "Anakin Skywalker"}, {"tag": "p", "text": "Amidala met the kind Anakin Skywalker in his home of Mos Espa, where she passed as a commoner named Padmé Naberrie. When they first met, he asked her if she was an Angel. He was later distraught upon discovering that she was actually the queen, which he admitted to Obi-Wan at Qui-Gon Jinn's funeral. After parting ways after the Battle of Theed, he continually thought of her, and his fascination grew for his bold and beautiful friend, who was four years his senior. They met again ten years later, and his fascination blossomed into love. After a hair-raising series of adventures together, she began to return his affection. Padmé accompanied Anakin to Tatooine when he sensed that his mother was in mortal danger, and at the Lars farm, they met Shmi's husband, who revealed that she had been kidnapped by a Tusken tribe. When Anakin returned with his mother's corpse, Amidala tried to comfort him, but Anakin revealed that he had massacred the whole village, including women and children, in revenge for the death of his mother. This surprised and horrified Amidala, but she remained at Anakin's side, consoling him."}, {"tag": "p", "text": "The two married as the Clone Wars began. Although they saw each other rarely and had to work hard to keep their marriage a secret, Skywalker was deeply in love and vowed to protect Amidala from the fate he could not save his mother from. In the end, his fear for Amidala, who he believed would die in childbirth, turned him to the dark side, and after he incapacitated her on Mustafar, she lost the will to live but still believed that he could be redeemed, which her memory in Luke helped do."}, {"tag": "p", "text": "With Skywalker, Amidala had twin children, although Anakin did not know of their existence until at least 19 years after they were born. Both were born at the secret base of Polis Massa, where Amidala died shortly after their birth. Luke, the elder of the two, was raised on the harsh desert planet of Tatooine (which was also the home of her husband) by his father's step-brother, Owen Lars, and his wife Beru. He was to follow in his father's footsteps and become a respected Jedi. Leia was raised by the Royal Family of Alderaan in its capital, Aldera."}, {"tag": "p", "text": "She was given the name Leia Organa, which later changed to Leia Organa Solo when she married. She would follow a similar path to her mother's, becoming a respected young Senator serving the galaxy, but also a leading member of the Rebel Alliance, which her mother helped to create. The two children were hidden from the Empire, the Emperor, their father and each other, not knowing of each other's existence until they were in their early twenties, and finding out they were related much later. In the end, both of them played a key role in defeating the Sith and the Empire, but it was Luke who ultimately defeated Darth Vader and redeemed Anakin Skywalker."}, {"tag": "h3", "text": "Family"}, {"tag": "p", "text": "Padmé was very close to her family, but due to her political duties she could not spend as much time as she wanted with them. She was especially close to her sister Sola, who constantly stressed that she should form her own family, something that Amidala did not think was possible. After her death, her family was devastated and never discovered her pregnancy. Her niece Pooja followed in her footsteps and took her place as the senator of Naboo in the Imperial Senate."}, {"tag": "h3", "text": "Jedi Council"}, {"tag": "p", "text": "Amidala had a friendly and cordial relationship with the Jedi Council, being particularly united to Masters Yoda and Obi-Wan, respecting both of them for their skills and wisdom."}, {"tag": "p", "text": "Although her relationship with Master Yoda was always professional and respectful, her relationship with Obi-Wan tensed after the Battle of Geonosis when he discovered her feelings for Anakin, so he asked her to stay away from him so he could fulfill his destiny, something that Amidala pretended to accept only to marry Skywalker soon after. During the war Padmé and Obi-Wan repaired their friendship, but she never confessed her marriage to Anakin, knowing the consequences of that action."}, {"tag": "p", "text": "When Anakin became Darth Vader, Obi-Wan, knowing how close they were, informed her of her husband's fall to the dark side, only to discover her pregnancy and deduce that Anakin was the father. When Padmé lied about Anakin's whereabouts, Obi-Wan hid in her ship, which almost caused the death of Amidala at the hands of her husband when he believed that she had betrayed him. After her death Obi-Wan remained by her son Luke and helped him to start as a Jedi."}, {"tag": "h3", "text": "Palpatine"}, {"tag": "p", "text": "At first Amidala saw Palpatine as good and reliable, and sought his help when Naboo was threatened. Unbeknownst to her, Palpatine was the Sith Lord Darth Sidious and the one responsible for Naboo's plight, while he only used her as a pawn in his plan to become Chancellor."}, {"tag": "p", "text": "When Amidala became a Senator thanks to the guidance of Bail Organa and other Senators, she began to perceive the intentions of the Chancellor and to worry about the power that he accumulated during the war. When Obi-Wan informed Padmé of the true identity of Palpatine as Darth Sidious and that he had seduced her husband to the dark side, Amidala no longer saw Palpatine as a friend but as an enemy. She was present when Palpatine dismantled the Republic, turning it into the Empire, before the disgusted look of some senators and Amidala, who saw Palpatine with anger and resentment."}, {"tag": "h3", "text": "Bail Organa"}, {"tag": "p", "text": "Bail Organa was one of Amidala's closest friends in the Senate, as well as her most valuable political ally and confidant. Bail's advice helped Amidala mature as a politician and perceive Palpatine's ulterior motives. When the Republic became the Empire, Amidala, Organa and the other Senators created the seed of what would be the Rebel Alliance."}, {"tag": "p", "text": "Bail was one of the few to discover the relationship between Amidala and Anakin Skywalker, and when the Republic became the Empire, Bail discovered that Palpatine was actually the Sith Lord Darth Sidious and the true instigator of the Clone Wars. After the death of Amidala, Organa, out of respect for his friend, adopted her daughter Leia as his own and instructed her as he did a long time ago with her mother in the way of politics."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "Padmé Amidala was played by Natalie Portman in the prequel trilogy. In her interview on the \"Inside the Actors Studio\" program, she admitted that, when her agent first mentioned the new Star Wars trilogy to her, she didn't know the difference between Star Wars and Star Trek. Portman also missed the first screening of The Phantom Menace, due to exams. An unknown actress played Amidala in holographs that can be seen in Episode II deleted scenes."}, {"tag": "p", "text": "Padmé has been also voiced by Grey DeLisle in Star Wars: Clone Wars as well as several video games, and Catherine Taber in the Star Wars: The Clone Wars film and TV series."}, {"tag": "p", "text": "Hasbro released an Evolutions pack that portrays Padmé as Queen of Naboo (featuring her in the outfit she wore prior to pleading her case to the Senate in The Phantom Menace), a Senator (featuring her in her clothing as depicted during the Battle of Geonosis in Attack of the Clones) and as \"the Mother of Heroes\" (referring to Luke and Leia Skywalker; this figurine depicts Amidala in the light blue nightgown she was wearing in several scenes of Revenge of the Sith)."}, {"tag": "p", "text": "According to concept artist Iain McCaig, Padmé was meant to make an attempt on Darth Vader's life on Mustafar: the scene as storyboarded had her embracing him with a knife, but finding herself unable to actually kill him. (Her role in the Revenge of the Sith script also reflected that she realized Anakin was becoming a monster.)"}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "Padmé's image first appeared in the Star Wars universe in the comic The Last Command 5, which was published around a year before The Phantom Menace premiered. At the time the comic was being created, the decision to cast Natalie Portman as the mother of the twins had just been made, so the authors of the comic decided to place her likeness in a portrait in the background. This has an important bearing on the dispute over whether Leia ever knew what her real mother looked like."}, {"tag": "p", "text": "In Return of the Jedi, Leia tells Luke she remembered her real mother dying when Leia was very young, and described her as very kind, beautiful and sad. Since Padmé dies, in Revenge of the Sith, while Leia is a newborn, it is not clear how Leia has these memories. (It's possible that Leia felt her mother's sadness through the Force; however, this is not confirmed. Leland Chee admitted that this inconsistency is not yet addressed in the Holocron continuity database.) Another possibility is that Padmé herself was Force-sensitive while pregnant with the twins. In the novelization of Revenge of the Sith, many references are made in regard to this, most notably, when Anakin and Padmé communicate with each other across the city (he from the Jedi Temple, she from her apartment), something also briefly implied in the film. It also is possible that Leia saw a hologram or picture of some sort, such as the portrait mentioned above. The junior novelization of Revenge of the Sith addressed this problem by stating that the newborn Leia looked around shortly after being born, as if she wanted to memorize every detail."}, {"tag": "p", "text": "The Return of the Jedi novelization said that Obi-Wan took both Leia and her mother (Padmé) to Alderaan after the birth of the twins, while in Revenge of the Sith, Padmé dies shortly after childbirth. In the novelization of The Phantom Menace, Anakin had a vision of Padmé leading an army against a dark man (Vader), foreshadowing their later conflict of morals following his betrayal of her."}, {"tag": "p", "text": "The 2004 junior novelization of Return of the Jedi suggests her last words were truly prophetic, and that, years after her death, she would play a very significant role in restoring freedom to the galaxy: placing the reader inside the Dark Lord's mind as he watches Luke suffer under Palpatine's wrath, the book implies that, somehow, the thought of Padmé and her undying love broke through to him, bringing about the realization that he could not allow this to happen to her child, and it was at that moment that Anakin Skywalker overcame Darth Vader and destroyed the Emperor."}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "Padmé Amidala has an easter egg in the first mission of the Wookiee campaign of Star Wars: Galactic Battlegrounds. Amidala can be found if the player uses cheats to create aircraft or destroys a large segment of forest to reach the east. Upon journeying far enough, a desert area with a landed Royal cruiser, Qui-Gon Jinn, Obi-Wan Kenobi, Jar Jar Binks, Captain Panaka and other characters from Episode I are sitting. The mission objectives then change to protecting Amidala from a group of marauding Tusken Raiders."}, {"tag": "p", "text": "Padmé's likeness also appeared in the Empire Strikes Back segment of LEGO Star Wars II: The Original Trilogy, where Vader takes out a photograph of Padmé while she was pregnant and then points to her gut, and then motions towards himself and eventually to Luke Skywalker, making it clear that Skywalker is the developing child in Padmé. This was done to cover the revelation that Vader was Skywalker's father, due to the characters in the games not having an intelligible language."}, {"tag": "h3", "text": "Name"}, {"tag": "p", "text": "Though she married Anakin Skywalker in 22 BBY, she never publicly took the surname Skywalker in order to keep Anakin from being expelled from the Jedi Order and to protect them both from any vulnerabilities this marriage would bring them."}, {"tag": "h3", "text": "Quotes"}, {"tag": "p", "text": "One of Padmé Amidala's lines, \"So this is how liberty dies... with thunderous applause,\" said in reference to Palpatine's transformation of the Republic into an Empire in Revenge of the Sith, was later quoted by James Cameron in his interview with George Lucas in his AMC series James Cameron's Story of Sci-Fi, regarding how Empires continuously make the same mistakes throughout history, with Lucas also saying in the middle of Cameron's quoting of the line that they're \"in the middle of it,\" referring to the surge in populism as a result of the 2016 United States Presidential Elections."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}