{"url": "Palace_Guard_(New_Republic)", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:New Republic stubs", "Category:New Republic trooper variants"], "nodes": [{"tag": "h1", "text": "Palace Guard  (New Republic)"}, {"tag": "p", "text": "The Palace Guard were a detachment of bodyguards that were attached to the New Republic Senate and were tasked with the protection as well as security of the Chief of State at Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 25 ABY during the Yuuzhan Vong War, Dray traveled to the galactic capital of the New Republic alongside Finn Galfridian in order to thwart a Yuuzhan Vong assassination attempt against Chief of State Borsk Fey'lya. After arriving on Coruscant, Finn was tasked with infiltrating the Imperial Palace in order to use his unique senses in The Force to find the enemy assassin. Upon arriving at the Palace, their entry was blocked by the Palace Guard who asked the two what their business was but Finn Galfridian used a mind trick to allow himself entry. One of these guardsmen allowed Galfridian entry as the mind trick made him believe the Jedi was an ambassador that needed to meet with the Chief of State."}, {"tag": "p", "text": "When Finn Galfridian fell into the scene, ambassador Yarmond of the Imperial Remnant summoned the Senate Guard to deal with the intruder. However, Finn used the Force to send the guardsmen falling back, though the distraction allowed Yarmond to knock the Jedi unconscious. Guardsmen were later present to guard Finn Galfridian after he was captured and were present when Chief of State Borsk Fey'lya came to interrogate the prisoner. Afterwards, they stood guard and were knocked unconscious by Prowl and Dray came to rescue Finn. He would later attempt to bypass the Palace Guard in order to recover his goggles and lightsaber located in Chief of State Fey'lya quarters. Under the command of Captain Kopri, the Guard attacked Finn and believed he was killed when he fell off the ledge though he used the opportunity to infiltrate Borsk Fey'lya's quarters."}, {"tag": "p", "text": "Afterwards, the Guard were ordered by Captain Kopri to attack the rogue Force user Dray, who intended to capture Finn Galfridian. Upon confronting their target, the Guard ordered Dray to drop his lightsaber, which he did, only for him to unleash Force lightning on the Guardsmen, killing them. Their deaths gave Kopri valuable time needed to escape the planet with Galfridian."}, {"tag": "h2", "text": "Appearances"}]}