{"url": "Paladins_of_the_Adamite_Tower", "categories": ["Category:Legends articles", "Category:Force-based organizations"], "nodes": [{"tag": "h1", "text": "Paladins of the Adamite Tower"}, {"tag": "p", "text": "The Paladins of the Adamite Tower was a Force-sensitive tradition among the people of Weik, a planet deep in Wild Space that was long disconnected from the civilized galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars a damaged Star Destroyer crashed on the planet Weik deep within the Ordan Spine Mountains. Buried deep within the ground, the Star Destroyer's bridge remained above ground, allowing for the clone troopers and their Captain, Vasque Mirlan to exit and strike out towards Vossport. Met by the armies of Weik in the Karnik Valley, the clone troopers opened fire on the hostile locals, sparking a brief yet fierce war. Wielding far-superior weaponry, the clones would have made short work of the army but were struck down by four Force-wielders with sunfire swords.When Vasque was killed in battle, the clones fled into the hills."}, {"tag": "p", "text": "The four champions returned to Vossport where they refused all rewards and titles, instead asking for stewardship of the strange tower left visible in the mountains of the Ordan Spine. Taking up residence within the so-called Adamite Tower, the four Force-sensitives took up residence in the area, founding a feudal society and serving justice to those who sought to corrupt or disturb life. The Paladins were recognized as warrior-judges, feared for their strength but respected for their righteousness. Supplicants seeking to join the ranks of the Paladins took vows to forsake their former lives, donning helmets that they covered with their hoods. When abroad, the Paladins wore reforged armor to protect from the simple bullets of the scoundrels of Weik. Fighting with bows and a quiver of arrows, the highest ranking Paladins were equipped with ancient lightsabers, relics of the ancient Jedi that crashed on Weik thousands of years prior to the founding of the Paladin group. Known as Sunfire swords, the lightsabers were rare and the knowledge to reproduce them had been lost."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}