{"url": "Attack_on_the_Hidden_Temple", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Battles in the Cadavine sector", "Category:Battles of the Second Imperial Civil War", "Category:Invasions", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Attack on the Hidden Temple"}, {"tag": "p", "text": "The Attack on the Hidden Temple was a military operation carried out by forces of Darth Krayt's Galactic Empire against the New Jedi Order's Hidden Temple in 138 ABY."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The events leading up to the attack on Taivas started on Korriban. The Sith Lord and Inquisitor Darth Havok tortured his former apprentice, the Imperial Knight Antares Draco. After a period of time of no results the Sith Lord tricked Draco into believing that the Sith had captured his love, Marasiah Fel and would kill her if Draco did not provide useful information. Unable to stand the thought of seeing her killed he then revealed the existence of the Hidden Temple and its location."}, {"tag": "p", "text": "With this valued information attained, Darth Talon sent a message to Darth Krayt about the Temple. Pleased with this information, he ordered Talon to have Draco delivered to Cade Skywalker."}, {"tag": "p", "text": "Discovering Draco inside his ship, Draco revealed he had broke under the Sith and had revealed the location of the Temple. At first enraged, Skywalker and his crew then went to alert the Jedi to the coming attack."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "Cade arrived and warned the Jedi. After confering with Gar Stazi and Roan Fel, the council decided to evacuate, but Cade said that the best thing to do was stand and fight. Reasoning that Krayt had sent a warning so the Jedi would move into the open, Cade said the Jedi should lure the Sith-Imperials into a trap, saying that the alliance and fel empire could trap their enemies between the planet and their fleets. Cade's uncle, Bantha Rawk agreed, saying Taivas was a natural fortress. Both Roan Fel and Gar Stazi agreed."}, {"tag": "p", "text": "The empire, meanwhile, combined all it's fleets for the attack. The Sith Imperial forces attacked with the Moffs themselves leading the battle. After sustaining casualties to friendly fire, the Sith Imperials were forced to stop attempting orbital bombardment and engage their enemies on the planet itself. Land forces under the command of Moff Geist soon began advancing on the temple while Sith Imperial fighters engaged the Jedi in the sky. The Imperial forces breached the temple, but instead of a repeat of Ossus, the Sith and Imperials found the Jedi waiting for them."}, {"tag": "p", "text": "Soon after battle in the temple itself broke out, the fleets of Bastion and the Galactic Alliance Remnant arrived to aid the Jedi. The Sith Imperial armada soon found itself surrounded and trapped, and the allied fleets proceeded to tear into the armada while the Jedi inflicted heavy casualties on Geist's army."}, {"tag": "p", "text": "Unknown to the allies, however, Krayt had foreseen their trap and had a response planned for it. Just when victory for the allied forces seemed assured, Krayt played his secret trump card: a fleet of new Sith troopers, led by Darth Nihl, dropped out of hyperspace and joined the battle. The allies were surprised at the new arrivals, and took heavy casualties from them. The troopers joined the battle on the ground, they destroyed anything that stood in their way of the Jedi Temple, even the Sith-Imperial forces who weren't able to escape their path. In their fury they killed Moff Geist."}, {"tag": "p", "text": "Everyone was shocked by the new Sith troopers and for some Sith-Imperials this was the last straw: Moff Rulf Yage and his daughter Gunn rebelled and killed their Sith supervisors and joined the allies. Meantime the Jedi ordered to evacuate the temple, and the ships that made up the temple detached and set a course for Bastion, accompanied by the Alliance Remnant, loyalist Imperials and the recent Sith-Imperial defectors. Cade remained behind with his uncle, Drok, Te Corso, and Sayar Dun'La to protect the allies' secret weapon: T'ra Saa, who was deeply immersed in battle meditation. The Nikto, Elomin, and Bothan soon fell, leaving only Nat and Cade to hold off the remaining Sith troopers. Shortly thereafter, a damaged Annihilator-class starfighter set a collision course on the remains of the temple. Cade prepared to die, but as the ship collided, Nat quickly threw him out a window before helping T'ra Saa set off the Force energy she had drawn from the planet, taking any Sith caught in the blast with them and leaving an opening in the Sith fleet for everyone else to escape."}, {"tag": "p", "text": "Cade was deeply shaken by his uncle's demise, and took his rage out on a group of Sith Troopers who managed to get on top of the Mynock, even tapping into the dark side to gain the advantage. But Corde managed to convince Cade to keep one of the troopers alive so they could find a weakness in Krayt's newest weapon. As the Mynock headed for Bastion, Cade was tended to by Deliah Blue, who also comforted him as he mourned the loss of his uncle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}