{"url": "Palace_Courtyard/Legends", "categories": ["Category:Legends articles", "Category:Plazas", "Category:Theed locations"], "nodes": [{"tag": "h1", "text": "Palace Courtyard"}, {"tag": "p", "text": "The Palace Courtyard, also known as the Grand Plaza, was a large annex to the Royal Palace at the end of Palace Plaza in the Naboo capital city, Theed."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the Trade Federation's 32 BBY invasion of Naboo, Queen Padmé Amidala of the Naboo ordered the construction of the courtyard to replace the buildings destroyed during the Federation's attack. Constructed at the end of Palace Plaza and the start of the city's main boulevard, the courtyard buildings consisted of several large dome structures and a large arcing corridor which curved toward the Royal Palace."}, {"tag": "p", "text": "Following Amidala's term as queen, she was appointed Senator by her successor, Queen Jamillia, and took up residence in an office within the Courtyard annex. From here the career politician fretted over the increase in rioting in the city. From her window in the complex she could see several incidents of migrant workers staging protests in the Courtyard to raise awareness of their poor working conditions. While forcibly removed by the Royal Naboo Security Forces each time, Amidala's security personnel continued to worry for the senator's safety remaining in the Courtyard complex. In the following weeks, Amidala returned from Coruscant after escaping an assassination attempt on her life. Arriving by airbus to the Courtyard, Amidala retired to her residence until her meeting with the Queen soon there after."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "A massive complex constructed over a ruined portion of the city, the Courtyard complex consisted of two distinct structures; the hemispherical courtyard colonnade which framed the courtyard plaza and the large domed structures making up the bulk of the government offices. Along the base of the colonnade were several holographic friezes depicting some of the planet's greatest philosophers and artists. The courtyard was filled with trees, fountains, and a shallow moat crossed by many hump-backed bridges. With a The diameter of six hundred meters, its walkways were often used for royal occasions and ceremonies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Episode II Attack of the Clones, the courtyard was located in front of the Palace and directly linked to it, which suggests that it took the place of the former Palace Plaza, which appeared in Star Wars: Episode I The Phantom Menace. The comic book adapation of Star Wars Episode II even explicitely stated that the Courtyard was located \"just outside the Royal Palace.\""}, {"tag": "p", "text": "However, when the original trilogy was released in DVD format in 2004, shots of the Palace Plaza were inserted in the ending sequence of Star Wars: Episode VI Return of the Jedi, creating a discrepancy between the movies. In the 2005 movie Revenge of the Sith, the location was the Palace Courtyard was retconned. The Courtyard opens its two arms towards the Palace Plaza, and is not part of the Palace proper."}, {"tag": "p", "text": "Footage of the Plaza was filmed at the Plaza de España in Seville."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}