{"url": "Palace_Precinct", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Coruscant districts", "Category:Galactic Empire locations", "Category:Locations of the Jedi Order", "Category:Temple Precinct locations"], "nodes": [{"tag": "h1", "text": "Palace Precinct"}, {"tag": "p", "text": "The Palace Precinct, known as the Temple Precinct or the temple district during the time of the Galactic Republic, was the area that surrounded the Imperial Palace, formerly the Jedi Temple."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Around the time of the Clone Wars, the Temple Precinct was a low-rise sector of the Federal District comprised of modern buildings that consisted mainly of standard accommodations. In the center of the Precinct was the Jedi Temple complex—a conglomerate of structures built over millennia; an archaeological treasure behind which laid histories of the Jedi center's numerable instances of expansion, renovation, ruin, and reconstruction that revolved around a locus of power: a natural mountain found sacred by Coruscanti and which attracted Force-wielders of various beliefs; an amalgamation of numerous wellsprings of the Force hidden beneath the spire's many lost grottos and shrines."}, {"tag": "p", "text": "Within the district was the Processional Way, a long lane which terminated with ceremonial steps that led to the Jedi Temple, atop of which laid two statues each of the Jedi Order's Sage Masters and Warrior Masters. Situated between low-rising structures, various sparsely-situated Jedi statues sat amidst the Precinct's Way. These serene features marked a Jedi tranquility distinct from the otherwise dense urban constructs cut by busy thoroughfares of the Galactic City, with the broad promenade providing a symbolic bridge between."}, {"tag": "p", "text": "A spaceport tower rising from the Precinct allowed for the docking of spaceships too large for the Temple hangars—constructed within the Temple after the time of the Naboo blockade in 32 BBY—in the Jedi Temple complex. Below the monolith was an extensive collection of buildings, divided by avenues and averaged in their rise, that accommodated the standard training of Padawans. Such low-rising structures gave the Temple, most notably its great spires, domination over the landscape for kilometers around."}, {"tag": "p", "text": "The district was renamed as the Palace Precinct during the reign of Emperor Palpatine. Under the Emperor, the Precinct served as a landing field for capital ships, housing a courtyard with the capacity to hold multiple Venator- and Victory-class Star Destroyers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The transitionary boulevard between the fringe and heart of the Jedi Temple Precinct—the Processional Way—bore witness to heated gatherings during the fall of the Republic and the early days of the New Order that took its place."}, {"tag": "p", "text": "During the Clone Wars, a crowd of friends and family of the casualties of the bombing of the Jedi Temple hangar gathered to stage a protest against the continuation of the war in a demonstration of anti-Jedi sentiment."}, {"tag": "p", "text": "Under the New Order that took the place of the Republic, Grand Vizier Mas Amedda personally hosted a celebration of the eradication of the Jedi Order at the Precinct. Addressing citizens gathered before the entry steps, the Imperial bureaucrat incinerated fallen Jedi's lightsabers. Cam droids recorded the occasion from above the gathering."}, {"tag": "p", "text": "The Palace grounds were transformed into a large landing field by the Galactic Empire, with a dedicated landing pad raised before the Imperial Palace's entrance for a Lambda-class T-4a shuttle. This was accessible via a walkway that accommodated rows of white-clad escorts and Imperial Royal Guardsmen. Despite these changes, the Precinct still remained a low-rise area by the outbreak of the civil war on Coruscant in 4 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Palace Precinct's first canonical appearance was in the 1999 film Star Wars: Episode I The Phantom Menace. It was identified as the Temple Precinct in the 2016 reference book Star Wars: Complete Locations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}