{"url": "Palpatine%27s_Statue_Garden", "categories": ["Category:Legends articles", "Category:Republic Executive Building locations"], "nodes": [{"tag": "h1", "text": "Palpatine's Statue Garden"}, {"tag": "p", "text": "Palpatine's Statue Garden was an open air location in the Republic Executive Building where Supreme Chancellor Palpatine kept a number of stone statues. The garden occupied space on a large balcony on one of the upper levels of the executive building."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 20 BBY, Chancellor Palpatine was alone in the garden when he was visited by Jedi Knight Anakin Skywalker. The Chancellor proceeded to inform the young Jedi that he was several hours early for a Senate War Rally, to which Anakin replied he would not be able to attend as he had been called away to help a Jedi Task Force track down a Sith Lord. Believing Count Dooku, Palpatine's own Sith apprentice, to be the intended target, Palpatine encouraged Skywalker to go and help bring Dooku to justice. However, Skywalker revealed that the Sith Lord the Jedi where seeking was not Dooku but the Sith Lord who Obi-Wan Kenobi had slayed on Naboo, Darth Maul."}, {"tag": "p", "text": "Palpatine was stunned upon learning the news his former apprentice was still alive. After a several moments of silence, Palpatine told Skywalker he found it hard to believe that Maul had survived Kenobi's fatal attack. Agreeing with the Chancellor, Skywalker went on to explain that the Sith rely on their anger and do not accept death as a final end."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The garden was located on a balcony in the upper levels of the Senate Executive Building. A median size railing ran along the balcony on all sides. As the garden was uncovered, the numerous space lanes that crisscrossed across Coruscant were visible. The garden was large enough for individuals to move about the statues with ease."}, {"tag": "p", "text": "The statues themselves were of unknown humanoid figures craved from stone with each figure standing atop the rock it was made from. Two of the figures appeared to be wearing a type of head covering with one being a warrior and held a type of staff in his right hand and the other of a figure kneeling with right arm outstretched holding a skull in his hand. A third figure appeared to be cloaked and was posed leaning on a long staff."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}