{"url": "Attack_on_the_Imperial_Royal_Guard_Academy", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Imperial Civil War", "Category:Battles of Yinchorr"], "nodes": [{"tag": "h1", "text": "Attack on the Imperial Royal Guard Academy"}, {"tag": "p", "text": "An attack on the Emperor's Royal Guard took place on Yinchorr during the Imperial Civil War. The incident occurred in the wake of the destruction of Byss, the Sith throneworld, and the final death of Emperor Palpatine. Carnor Jax, a member of the Emperor's Royal Guard and an aspiring Sith Lord himself, played a part in the Emperor's death, which was part of his bid for the title of Emperor."}, {"tag": "p", "text": "Jax's splinter group proceeded to cleanse the Empire of Palpatine's loyalists, leading to an attack on the Imperial Royal Guard Academy on Yinchorr in an effort to kill the surviving members of the Royal Guard, who were knowledgeable of Jax's plot and were intent on retribution. The ensuing bloodbath led to the death of 18 guardsmen, as well as their leader, Ved Kennede. The sole guardsmen who survived the incident, Kir Kanos, vowed to carry on the guardsmen's pact to kill Jax and avenge Palpatine."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the first death of Emperor Palpatine during the Battle of Endor in 4 ABY, Palpatine's Royal Guardsmen were scattered until reconvening on Byss on 11 ABY, after their master returned in the form of a clone. Following the final death of Palpatine on Onderon that same year, many of his Royal Guardsmen also perished in the destruction of Byss, brought on by a misfiring of the Emperor's Galaxy Gun superweapon. Others died during the destruction of the Emperor's flagship, the Eclipse II. The few survivors of the unit made their way to the Imperial Royal Guard Academy on Yinchorr."}, {"tag": "p", "text": "Ten days after Palpatine's death, a wounded straggler made his way to the Academy: one of the two guards Palpatine had taken to Onderon. He had been wounded and believed killed by the aspiring Jedi Rayf Ysanna, but had, in fact, lived. By spying upon the New Republic interrogation of the Emperor's physician the lone Guardsmen learned that Palpatine's clones had failed to deliberate poisoning—and that such poisoning had been done on the orders of Carnor Jax, one of the Royal Guard who had not returned to Yinchorr with his comrades. The assembled Guardsmen made a promise to not rest until the traitor had been killed and Palpatine avenged."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "At that moment, scores of Imperial stormtroopers dispatched by Jax stormed the Academy, and the Guardsmen were forced to defend themselves. Outnumbered more than ten to one, they were slowly overrun, losing even their trainer Ved Kennede, until only two were left: Kir Kanos and Kile Hannad. Deciding that one of them should sacrifice his life so the other could live to fulfill the blood oath against Jax, they flipped a coin. The coin toss named Kanos as the one who would hunt down and kill Jax, leaving Kile Hannad to die a warrior's death. As Hannad charged the remaining Imperial forces, Kanos slipped quietly from the Academy before it was demolished, and escaped from Yinchorr to the portworld Phaeda as Hannad enjoyed a warrior's death."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Jax later learned from an analysis of the dead that Kanos had escaped, and ordered his forces under General Redd Wessel to continue the search for the last man who knew the secret of how Jax had assumed the Imperial throne. Jax considered Kanos to be a thorn in his plans for Galactic domination, and possibly the only man in the galaxy capable of undoing his work."}, {"tag": "p", "text": "Kanos kept a low profile on Phaeda for a period of time following the massacre, where he inadvertently became entangled in the conflict between the New Republic and the Galactic Empire. His involvement would ultimately help him fulfill the blood pact against Jax, ultimately slaying him in The Squall on Yinchorr."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The massacre of the Royal Guardsmen on Yinchorr was first depicted in the third issue of the Dark Horse Comics mini-series Crimson Empire. The incident serves as the catalyst for the conflict between Kir Kanos, the series's protagonistic anti-hero, and Carnor Jax, the series's antagonist."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}