{"url": "Attack_on_the_Imperial_command_center", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Vaklin insurgency"], "nodes": [{"tag": "h1", "text": "Attack on the Imperial command center"}, {"tag": "p", "text": "In the year 19 BBY insurgents attacked an Imperial command center on the planet Vaklin as part of the Vaklin insurgency. The insurgents attacked the center in the hope of rescuing a Jedi Knight who was imprisoned there. During the attack they instead encountered the Sith Lord Darth Vader, who killed the entire assault force. During the chaos the Jedi managed to break free and attack Vader as well, but he to was killed by the Sith."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Shortly after the end of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, an insurgency took place on the planet Vaklin against the newly formed Galactic Empire. The Vaklin insurgents were lead by three members of the Jedi Order, and so the Sith Lord Darth Vader traveled to the planet to lead the Imperials in crushing the insurgency as part of the Great Jedi Purge. Vader killed one Jedi Master and then captured a Jedi Knight, leaving only the Jedi Master Cho'na Bene at large. Bene continued to harass Vader's forces after the Knight's capture, and twelve days after the capture ambushed Vader whilst he was on patrol. Shortly after the ambush, Vader returned to the city Vaklin Zenith, where an Imperial command center was located. At the command center he discussed the Insurgency with several Imperial officers, before visiting the Jedi Knight, who was imprisoned in the center. Vader hoped that Bene would be drawn out of hiding to attempt to rescue the Jedi, but sucesfully interrogated the captive as to the Jedi Master's location in case he didn't work as bait."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "The attack began with an explosion caused by an explosive device planted inside a MSE-series droid, which the insurgents sent directly into the command center. This caused damage to three levels of the building and allowed three armed insurgents to enter near the holding cells, where they encountered Vader interrogating the Jedi. The insurgents attacked Vader, but using the Force, he collapsed part of the passage they were fighting in and killed the trio. The Sith lord's distraction allowed the Jedi prisoner to break his stun cuffs and also attack the Sith, but Vader cut him down with a single sweep of his lightsaber. One room damaged by the attack was the conference room in which Vader had previously spoken with Imperial Officers, several of whom were still there when the room collapsed. Whilst Vader fought the insurgents elsewhere in the building, Oniye Namada, a Major of the Imperial Security Bureau, rallied the officers in the conference room and looked after one who had been wounded, with the help of two other officers from the meeting."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the attack the Imperial forces were initially pleased with their response, considering the attack a failure. The local population however saw the strike as a valiant effort and remembered the Jedi as a martyr and a hero. When the Imperials were forced to retreat to a Imperial I-class Star Destroyer orbiting the Vaklin due to the damage to the center, the local celebrations got even worse. Angered by the populations response, Vader then ordered Namanda to begin a purge of anything Jedi-related from Vaklin, in an effort to make them forget the Jedi Order and stop supporting the insurgency. The details of the attack were later recorded by Namanda in an ISB report titled I-1807-VAK."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack first appeared in 2012 in Purge – The Tyrant's Fist 1, a comic book in the Star Wars: Purge series. The comic was written by Alexander Freed and penciled by Marco Castiello and Andrea Chella."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}