{"url": "Palleus_Chuff", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Actors", "Category:Impersonators", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Palleus Chuff"}, {"tag": "p", "text": "Palleus Chuff was a male actor during the reign of the Galactic Republic. Since childhood, his passion was pretending; specifically, pretending to be a hero. His small height, which was below one meter, forced him to portray dubious characters in his early acting career. However, he eventually made his breakthrough with his portrayal of Jedi Master Yoda in his self-written play Jedi!. Later, in 20 BBY, Chuff impersonated Yoda at the Jedi Master's behest on a personal mission to the planet Ithor in the Ottega system. The goal of this mission was to keep Yoda's mission to Vjun secret."}, {"tag": "p", "text": "Arriving in the Ottega system, Chuff was attacked by the Last Call, the personal starship of the Dark Jedi Asajj Ventress, who erroneously believed him to be Yoda. After a short time, Ventress discovered that Yoda had not flown the starfighter, and she changed her plan to confuse her enemies by faking Yoda's death and holding Chuff captive so that he could not tell anyone the truth. A few days later, after a business transaction with the FIII Footman droid Solis, Ventress found out that the real Yoda was going to the Phindar Spaceport. Considering the actor harmless, she left him in the ship when she tried to kill the Jedi Master. However, Chuff engaged her ship's hyperdrive for a random hyperspace flight. Outside the ship, the actor was confronted with the real Yoda. As the ship was anchored to the deck with five high-pull magnets, Yoda knew that the firing of the engines would tear the whole spaceport apart. As a Jedi, Yoda's main goal was to destroy the magnets holding the ship in place to prevent the spaceport from this catastrophe. As he neared completion, battle droids tried to attack Yoda, forcing him to trust Chuff with the mission while he engaged the droids. At that point, they split up, and Chuff succeeded in destroying the last magnet by himself, saving the spaceport."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "Palleus Chuff spent most of his childhood taking part in role-playing games. In those games he often played starfighter pilots, Jedi Knights, or adventurers. From childhood on, he was afraid of enclosed spaces and of flying. Because he loved role-playing so much, he decided to become an actor. As he was very short—less than one meter—the producers would not risk casting him as a hero. Due to this, he usually found himself playing villainous, scheming dwarfs. Disappointed by this fact, he came up with a play in which he portrayed the diminutive Jedi Master Yoda. Chuff studied Yoda's mannerisms for several months to be able to portray him realistically in the play Jedi! After this, he was capable of using Yoda's emotions according to the particular situation. The effort paid off, with the play getting rave reviews from the media and earning him much respect with his fellow actors."}, {"tag": "h3", "text": "Impersonating Yoda"}, {"tag": "p", "text": "In 20 BBY, Jedi Master Yoda was on a mission with Masters Maks Leem and Jai Maruk, and their respective Padawans Whie Malreaux and Tallisibeth Enwandung-Esterhazy, to the planet Vjun. The group was meeting Count Dooku, the leader of the Confederacy of Independent Systems, for a peace talk. At the same time, Chuff was employed to masquerade as Yoda on a mission to the planet Ithor in the Ottega system at the request of the government of the Galactic Republic. The actor was to travel to Ithor within a Seltaya-class fast courier, a type of starfighter manufactured by Hoersch-Kessel Drive. Four pilots escorted him within Tavya-class armored pickets to protect him in starfighter combat. The goal of this mission was to fool the galaxy into believing that the real Yoda was on the Ithorian homeworld. Despite his fear of flying, Chuff agreed, because he found it disrespectful to deny a request from the government. However, he wanted a R2 droid to navigate his Seltaya-class fast courier so that he would not have to worry about piloting the starfighter. Furthermore, there was an emergency override that would allow the control tower to fly the starfighter. Shortly before the departure, he became nervous and imagined that his R2 droid had been manipulated by the Trade Federation, a member of the Confederacy. In the hangar upon his departure, Chuff did not have the heart to answer the questions posed by the local journalists, instead smiling and waving his walking stick at the reporters."}, {"tag": "p", "text": "The Dark Jedi Asajj Ventress decided to ambush Chuff and his fellow pilots, because she knew that a dead Yoda—who was a beacon of hope for many citizens in the galaxy—would be a catastrophe for the Jedi Order. Before Chuff arrived in the system, Ventress had already killed three of the four pilots. However, the actor did not care and commanded his astromech droid to fire upon Ventress' ship, the Last Call. Ventress sensed through the Force that it was not Yoda flying the starfighter. Her new plan was to confuse her enemies by capturing Chuff and leaving the wreckage of his craft at the battle site. The Ithorians identified the debris as Yoda's and broadcast the message of his death throughout the galaxy. As a captive in Ventress' ship, the actor was gagged and tied to a seat. At one point, the FIII Footman droid Solis contacted Ventress. The droid had spied on one of Yoda's companions and meanwhile found out the Jedi's next stopover, which he offered to tell her for the price of 734,995 credits. Ventress was very interested in doing business with the droid, since the death of Yoda was still one of her prime concerns."}, {"tag": "p", "text": "When they arrived at Yoda's location, the spaceport on Phindar, Ventress perceived Chuff as harmless and left him in the ship. Seeking revenge, Chuff set a ten-minute countdown to engage the ship's hyperdrive for a random hyperspace flight. When he got out of the ship, he was confronted by the real Yoda. Worried about the Jedi Master's safety, Chuff immediately informed him of the Dark Jedi's plans. He also mentioned the hyperdrive that he had manipulated shortly before. After hearing this, Yoda was slightly displeased with Chuff. As the ship was anchored to the deck with five high-pull magnets on the bottom of the support legs, an ignition of the hyperdrive engine could tear the spaceport apart. To avoid a devastating blast, Yoda attempted to chop down the supports legs one by one. Then, he intended to push the ship out of the docking bay so that the spaceport would be untroubled by the destruction. However, after Yoda had managed to destroy only four of the five legs, Chuff witnessed battle droids trying to attack the Jedi Master. Yoda decided that it would make more sense if Chuff assumed the responsibility for the last support leg, while he went out to eliminate the attacking droids. Solely responsible for the future of the spaceport, Chuff's major goal was to not disappoint Yoda. After he successfully cleaved the last support leg—which was no serious challenge for him—the actor went directly to the turbolifts outside of the spaceport as Yoda had ordered him to. A few minutes later, Yoda came back to join Chuff, when suddenly suction from the ignition of the engines forced everything near the ship into space. Only Yoda and Chuff were able to keep their position, because Yoda used the Force to avoid such a disaster."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Palleus Chuff loved to play the role of the hero. Restricted by his height, he often had to portray scheming characters, which frustrated his ambitions. Therefore, he came up with making his breakthrough by writing his own play, entitled Jedi!. To give an authentic portrayal of Jedi Master Yoda, he studied his mannerisms for several months. After this period of study, he had Yoda's emotions fairly mastered and could use them appropriately. The effort paid off, as the play's premiere proved to be a big success. In addition, his colleagues recognized his witty qualities."}, {"tag": "p", "text": "Since childhood, Chuff had a fear of flying as well as claustrophobia. Due to these fears, he prayed before the departure of his courier. However, in his mind, serving the government had a higher priority than avoiding his fears, so he accepted their mission. After the time he spent in Ventress' ship, the actor was annoyed with the Dark Jedi and decided to gain revenge by making her ship perform a random hyperspace jump. Chuff, who was convinced of his plan, saw—after Yoda's explanation—that his plan had some flaws that he had not considered. When Yoda and the actor had to cut the support legs, Chuff initially felt a shaky courage. However, he lost his gallantry just before the ignition of the engines, fearing his own death. Chuff eventually became more confident, when Yoda suddenly arrived to save him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Palleus Chuff's first and only appearance was in the 2004 novel Yoda: Dark Rendezvous, written by Sean Stewart. Chuff portrays one of the minor characters in the novel. In The Complete Star Wars Encyclopedia, Chuff's first name is incorrectly spelled as Pelleus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}