{"url": "Pallaxides", "categories": ["Category:Legends articles", "Category:Planet stubs", "Category:Galactic Empire planets", "Category:New Republic planets", "Category:Ojoster sector planets", "Category:Pallaxides locations", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Pallaxides"}, {"tag": "p", "text": "Pallaxides was a planet of the Ojoster sector in the Outer Rim. It was owned by TaggeCo, who used it as a resort world."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Pallaxides was a private planet owned by TaggeCo where starships were not supposed to come without an express invitation. Used as a resort world, TaggeCo took its privacy seriously, even to the extent of ignoring distress calls. The planet was constantly guarded by three IPV-1 System Patrol Craft which escorted all incoming civilian ships."}, {"tag": "p", "text": "Pallaxides was approximately 12 hours away from Celanon with hyperspace travel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the bombing of Syndaar Military Prep School by the Ho'Din terrorist Ort Hoogra-D'En, System Sub-Commander Jared Brojtal went to Pallaxides with the Carrack-class light cruiser Marduk to seek revenge for the death of his son. He found Hoogra-D'en's base, which was defended by Aqualish mercenaries and spore bombs, and attacked it with TIE/LN starfighters and TIE/rc starfighters. During the attack, Hoogra-D'En planned to use the Gymsnor-3 light freighter Batattis to escape, using two fleeing YT-1300 light freighters as decoys."}, {"tag": "p", "text": "Pallaxides was later freed by a New Republic fleet led by General Han Solo after a long campaign in 13 ABY."}, {"tag": "h2", "text": "Fauna"}, {"tag": "p", "text": "Pallaxides had a number of large predators but none were considered a threat to travelers. However, several dangerous off-world animals, such as shredder bats and zuxu, were imported for the sporting interests of TaggeCo executives. Their introduction was made without regard to the possible long-term ecological effects."}, {"tag": "p", "text": "The largest animal native to the planet was the docile rormaroo, which was used as a beast of burden."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}