{"url": "Attack_on_the_Nouane_system", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Nouane sector", "Category:Battles of the Berch Teller campaign"], "nodes": [{"tag": "h1", "text": "Attack on the Nouane system"}, {"tag": "p", "text": "Toward the end of the Berch Teller campaign in 14 BBY, Berch Teller and his dissidents attacked the Imperial facility on the planet Nouane in the Inner Rim. In response to the insurgents, Vice Admiral Dodd Rancit had fortified the facility. Despite the stolen corvette Carrion Spike's stealth technology, the insurgents were forced to retreat by a continuous onslaught of long-range lasers. After barely escaping with their lives, Teller and his dissidents deduced that their contact Rancit had betrayed them. Suspecting a trap at Carida, the dissidents instead sent the Carrion Spike on autopilot to the Carida system. They then transferred to Berch Teller's warship, which traveled to ambush an Imperial convoy in the Gulf of Tatooine."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 14 BBY, the former Republic Intelligence operative Berch Teller and his rebel cell launched an insurgency against the Galactic Empire. Teller and many of his fellow dissidents were witnesses or survivors of the Antar Atrocity, which had seen the mass killing of many innocent Koorivar and Gotals including Republic loyalists. Teller had a special animus for Moff Wilhuff Tarkin, the architect of the Antar Atrocity and the overseer of the secret Death Star project. They were aided by Vice Admiral Dodd Rancit, the Director of the Naval Intelligence Agency and a rival of Tarkin."}, {"tag": "p", "text": "Teller and his fellow dissidents stole Tarkin's personal corvette Carrion Spike, which was equipped with an advanced hyperdrive and stealth technology. Seeking to turn it into a symbol of resistance against the Empire, Teller and his comrades raided several Imperial facilities across the galaxy. To generate publicity, the dissidents broadcast holovids of their raids on the Imperial HoloNet, echoing the Separatist Shadowfeed broadcasts during the Clone Wars. They were pursued by Tarkin and Darth Vader, who deployed the resources of the Imperial Navy."}, {"tag": "h2", "text": "The failed raid"}, {"tag": "p", "text": "After creating a diversion in the Obroa-skai system, Teller and his fellow dissidents traveled aboard the Carrion Spike to the Nouane system, which was home to an Imperial facility. To avoid arousing Imperial attention, Teller had the Gotal navigator Salikk decant the ship deeper in the system, as far away from the Imperial capital ships as possible. However, their nominal ally Vice Admiral Rancit had diverted substantial Imperial military resources to defending Imperial facilities along the Perlemian Trade Route and Hydian Way. The dissidents attempted to attack the Imperial facility but were repulsed by laserfire. Despite being under heavy enemy fire, the Carrion Spike managed to jump into lightspeed using a difficult maneuver."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Despite escaping their Imperial pursuers, the Carrion Spike sustained considerable damage including a damaged navigation computer, multiple wrecked instruments, and an inoperative deflector shield generator. The ship's armaments was down to two forward laser cannons and one starboard battery. With the hyperdrive motivator marginal, the Koorivar insurgent Cala estimated that the ship could only do two more jumps. Salikk himself sustained facial injuries. Realizing that Rancit had abandoned them, Teller and his dissidents abandoned ship and relocated to a warship, a modified Providence-class Dreadnought. Before traveling to the Gulf of Tatooine to ambush an Imperial convoy, they set the Carrion Spike's autopilot to travel to the Carida system."}, {"tag": "p", "text": "Meanwhile, Tarkin and Vader learnt about the Carrion Spike's repulsed attack at Nouane. While Vice-Admiral Rancit was credited for identifying Nouane as the dissidents' next target through a careful process of elimination, Tarkin and Vader soon ascertained that he had been colluding with the dissidents. Before Rancit could cover his tracks by destroying the Carrion Spike, Lord Vader confronted Rancit and had him executed for treason. Deducing that the diversion of Imperial forces to the Perlemian and Hydian Way was a ruse to enable the dissidents to ambush Imperial convoys transporting material to the Death Star project, Tarkin traveled to the Gulf of Tatooine to pursue the insurgents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Attack on the Nouane system first appeared in James Luceno's 2014 novel Tarkin, the second in a line of new Canon adult novels published by Del Rey."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}