{"url": "Attack_on_the_Lodge_of_the_Canted_Circle", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battle stubs", "Category:Battles of Coruscant"], "nodes": [{"tag": "h1", "text": "Attack on the Lodge of the Canted Circle"}, {"tag": "p", "text": "In 52 BBY, while attending the initiation of Larsh Hill into the Order of the Canted Circle in its Lodge in the Fobosi District on the planet Coruscant, Darth Plagueis, accompanied by two of his Sun Guards and 11-4D, along with the other Muuns attending, were attacked by Maladian assassins. Palpatine and Sate Pestage later arrived to help Plagueis, but by then, Plagueis and 11-4D were the only ones still standing save for the Maladians, which Palpatine and Pestage dispatched with a Repeating blaster cannon. Plagueis was severely wounded, forcing him to wear a transpirator from then on."}, {"tag": "p", "text": "In the aftermath of the battle, two Jedi Knights arrived at the scene in response to the disturbances that the battle had caused in the Force. They notified the Coruscant Security Force of the situation. The remains of the Maladians were so scattered that the CSF detectives believed at first that an explosion had occurred though they could find no evidence of it. The Jedi refused to inform the police as to their interest in the case and why they had been at the location in the first place. Later, the CSF attributed the carnage to a hit by organized crime."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The event which would develop into the Attack on the Lodge of the Canted Circle was first conceived by Star Wars creator George Lucas during the early planning stages of the 2012 novel Darth Plagueis, around the late 2000s. One of Lucas' tidbits for James Luceno during the project's early planning, aside from the fact that Plagueis should be a Muun, was that Plagueis wore a transpirator following an assassination attempt he suffered on his life."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}