{"url": "Pammich_Nerro_Goode", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Females", "Category:Humans", "Category:Resistance members"], "nodes": [{"tag": "h1", "text": "Pammich Nerro Goode"}, {"tag": "p", "text": "Pammich Nerro Goode was a human female who served as a lead dispatcher for the Resistance at their base on the planet D'Qar around thirty years after the Battle of Endor."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At some point, Pammich Nerro Goode piloted a Resistance transport from the Resistance's base on D'Qar."}, {"tag": "p", "text": "Holding the rank of ensign during the Resistance's conflict with the First Order, Goode was present in the D'Qar base control room for the preparations and execution of the Resistance's attack on the First Order's Starkiller Base superweapon. She sided with Captain Poe Dameron when he mutinied against Vice Admiral Amilyn Holdo. Shortly after this, she was present to co-pilot the transport that took Dameron and General Leia Organa down to the abandoned base on the planet Crait. Goode participated in the Battle of Crait, flying a V-4X-D ski speeder. She died during the battle along with several Resistance pilots. While in the D'Qar base, Goode wore a brown lead dispatcher's uniform. She had dark skin and black hair."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pammich Nerro Goode first appeared in the film Star Wars: Episode VII The Force Awakens, portrayed by Crystal Clarke. She was first identified as \"Ensign Goode\" in the film's credits, and was named \"Pamich Nerro\" in Star Wars: The Force Awakens: The Visual Dictionary, a reference book written by Pablo Hidalgo and released in conjunction with the film. Her full name, \"Pamich Nerro Goode,\" was shown in the video game LEGO Star Wars: The Force Awakens. Despite the game being non-canon, story group member Pablo Hidalgo confirmed on Twitter that the names provided by the game for previously unidentified characters, including Goode, were considered canon."}, {"tag": "p", "text": "In Star Wars: The Last Jedi: The Visual Dictionary, the character's first name is spelled \"Pammich.\" This new spelling has since been adopted by subsequent media releases, inluding Topps' Star Wars: Card Trader, Star Wars: X-Wing Second Edition, and StarWars.com's Databank."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}