{"url": "Palpatine_family", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Incomplete lists", "Category:Culture of Naboo", "Category:Families", "Category:Force-sensitive bloodlines", "Category:Palpatine family"], "nodes": [{"tag": "h1", "text": "Palpatine family"}, {"tag": "p", "text": "The Palpatine family was the bloodline of Galactic Emperor Sheev Palpatine who was in secret the Dark Lord of the Sith Darth Sidious. A human from the Mid Rim planet of Naboo, Sidious was born into a prestigious family that formed part of the nobility in Naboo society. The bloodline was artificially continued through his son, an artificial strandcast grown from the cloned DNA of Sidious, which sired Rey in turn. Unlike her father, Rey inherited her grandfather's powerful connection to the Force."}, {"tag": "p", "text": "Sidious trained in the ways of the dark side of the Force while serving as the Sith apprentice of Darth Plagueis. He eventually killed his Sith Master and trained several apprentices in turn, from Darth Maul to Darth Tyranus and Darth Vader. Retaining his birth name, he cultivated two identities as Palpatine and Sidious. Both personas served to further the Grand Plan of restoring the Sith to dominance over the galaxy. As Palpatine, he rose to power in the ranks of the Galactic Senate, first as a senator representing the Royal House of Naboo and then as Supreme Chancellor of the Galactic Republic. As Sidious, he secretly influenced powerful organizations, including the Trade Federation and the Confederacy of Independent Systems. He secured greater executive authority through the chaos that ensued from the Clone Wars, a galactic conflict that he orchestrated as both Sidious and Palpatine. By the time of the war's conclusion, he formally ended the Republic by declaring himself Emperor of the Galactic Empire. With the rise of his new regime and the near annihilation of the Jedi Order, Palpatine discarded his public persona and lived as Sidious full time."}, {"tag": "p", "text": "Sidious' reign lasted throughout most of the Imperial Era. The name of Palpatine all but disappeared in the minds of the subjects he ruled, and Sidious became known simply as \"the Emperor.\" His rule ended during the Galactic Civil War between the Empire and the Alliance to Restore the Republic; during the Battle of Endor, Vader sacrificed himself in order to save his son, the Jedi Knight Luke Skywalker, destroying the Emperor who turned him against the Jedi. As the last Sith Lords in existence, the deaths of Sidious and Vader ended the thousand year lineage of Darth Bane, fulfilling Anakin Skywalker's destiny as the Chosen One. However, Sidious was resurrected on Exegol, an ancient Sith world hidden in the Unknown Regions. His spirit was forced to inhabit a body that was cloned from his own genetic template while his followers, the members of the Sith Eternal cult, searched for ways to ensure his survival."}, {"tag": "p", "text": "The Emperor's son was a byproduct of Sidious' experiments. The strandcast exhibited no sensitivity to the Force despite inheriting Sidious' bloodline, which continued through his daughter Rey. Rey's father and mother sought to protect her by hiding on the desert world of Jakku where they lived as ordinary junk traders during the rise of the New Republic. They eventually sold their daughter to keep her hidden, but were captured and executed by the assassin Ochi before they could return for her."}, {"tag": "p", "text": "After years of eking out a meager existence as a scavenger, the Force awakened within Rey, who sought to control her new powers by training under Jedi Master Luke Skywalker. As the conflict between the First Order and the Resistance escalated, Sidious announced his return to the galaxy, intending to revive the Sith once again. His efforts ultimately failed, however. During the Battle of Exegol, the phantom Emperor was vanquished by Rey, who overcame the power of the dark side with the help of the redeemed Jedi Ben Solo."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rise of the Emperor"}, {"tag": "p", "text": "A human Dark Lord of the Sith, Darth Sidious was born into the nobility of the affluent planet Naboo as Sheev Palpatine. His family was one of the oldest, most prestigious and influential houses among the Naboo. Palpatine was raised in the city of Theed, his homeworld's capital, where he formed connections with a reputable host of credible politicians produced over the centuries, all the while acquiring a great amount of knowledge on governance and the subtleties of power during his youth."}, {"tag": "p", "text": "Sidious cultivated two identities during the final years of the Republic Era, one as a secret Sith Lord who masterminded the Separatist Crisis and the Clone Wars, and the other as Palpatine, the senator who became the Supreme Chancellor and ultimately the Galactic Emperor. The name of Palpatine was largely forgotten in the Galactic Empire that replaced the Galactic Republic; it was by the title of Emperor that he was known to the galaxy's population. He also discarded his public persona by embracing his Sith identity in thought and action, no longer needing to maintain two identities as Sidious and Palpatine."}, {"tag": "p", "text": "Within a generation of his accession, Sidious' reign ended with his death at the Battle of Endor in 4 ABY. As the New Republic gained momentum in the Galactic Civil War, it was believed that he had no living relatives, and consequently there was no clear chain of succession, leading to the Empire's defeat and capitulation in the Galactic Civil War."}, {"tag": "p", "text": "Though he perished onboard the DS-2 Death Star II Mobile Battle Station, Sidious had been prepared for the eventuality of his own demise. Having gained the knowledge to preserve his consciousness after death, he killed Darth Plagueis, the Sith Master who trained him in the ways of the dark side of the Force. He had done the deed quickly, not giving his mentor time to preserve his own essence, and with the devotion of the Sith Eternal cult, Sidious secretly endeavored to prolong his existence by coupling the modern science of cloning with the arcane sorcery of the Sith."}, {"tag": "h3", "text": "Death and rebirth"}, {"tag": "p", "text": "Sidious long suspected the possibility of betrayal from his Sith apprentice, Darth Vader, having sensed a remnant of the light side of the Force within him, preserving the identity of the Jedi Knight Anakin Skywalker within the shell of Vader. However, Vader acted sooner than Sidious anticipated, and while his spirit had managed to escape from his doomed body, his new form proved inadequate. Using the Emperor's genetic material, the Sith Eternal created a bioengineered vessel to replace Sidious' original body in the event of his death. Ultimately, his cloned body could not sustain the dark power attached to Sidious' soul, leading to rapid deterioration and the threat of a permanent death. His followers labored tirelessly to keep the Dark Lord alive while they searched for a solution, using Clone Wars-era technology and an ancient Ommin harness to preserve his new body as long as possible."}, {"tag": "p", "text": "The Sith cultists continued to work with Sidious' genetic template without success, creating various failed strandcasts, including a non-identical clone who was healthy, but lacked his father's connection to the Force. Sidious was too ashamed to even look at his cloned son, and was disappointed that someone so ordinary could be made from his own blood. However, he allowed his clone to live in order to continue his bloodline through more natural methods, hoping to achieve more favorable results. An unexpected union was eventually formed between the clone and a woman, which, in turn, led to the birth of Rey in 15 ABY. Knowing that the girl inherited his power, he considered her the perfect cradle for his dark consciousness, unlike her powerless father."}, {"tag": "p", "text": "Rey's parents sought to protect their daughter, however, using their own anonymity to keep their family hidden from the Emperor and his followers. Life was difficult for the poor, frightened couple eking out a meager existence, surviving on the edge of desperation. One of the cultists, Ochi of Bestoon, was sent by Sidious to hunt Rey and bring her to Exegol, an ancient Sith planet located in the Unknown Regions. Though Ochi succeeded in capturing the child's parents, bringing them aboard his starship, the Bestoon Legacy, he was unable to find Rey. Her parents protected her by selling her away. After refusing to reveal Rey's location, they were both killed by Ochi on the Emperor's orders in 21 ABY."}, {"tag": "p", "text": "Sidious, meanwhile, found greater success in grooming Ben Solo—heir to the powerful bloodline of the Skywalker family—as his secret apprentice and heir, using Supreme Leader Snoke as a proxy for his training. Though Solo embraced the ways of the dark side, becoming the dark warrior Kylo Ren, at the time he was unaware that Snoke was another one of the Emperor's creations, and that Sidious was his true mentor. Ultimately, Snoke had been created not only to turn Solo against his family, but also to test his worthiness of inheriting the Sith legacy."}, {"tag": "h3", "text": "A scavenger from Jakku"}, {"tag": "p", "text": "Abandoned on the desert world of Jakku, Rey was raised in the care of a Crolute junk boss, Unkar Plutt, and learned to support herself as a scavenger. By her nineteenth year, Rey had become a capable combatant, mechanic and pilot, but opted to remain on her backwater homeworld due to her childhood dream of reuniting with her family. Unaware of her dormant Force powers, she believed her survival was owed to chance. With nothing but her feelings of isolation and abandonment, she felt utterly alone throughout her years on Jakku, never knowing that she had always been part of a Force dyad—a unique Force-bond connecting her with Ben Solo across the stars."}, {"tag": "p", "text": "In 34 ABY, Rey encountered the astromech droid BB-8, and subsequently befriended Ben's father, the smuggler Han Solo, while attempting to return the droid to the Resistance. Though her journey took Rey offworld to Takodana, Rey was determined to return to Jakku, believing her family would eventually return. Solo's contact, Maz Kanata, candidly told Rey that no one was coming back for her."}, {"tag": "h3", "text": "Revelation"}, {"tag": "p", "text": "Following the Battle of Starkiller Base, Rey tracked Jedi Master Luke Skywalker to the lost world of Ahch-To, birthplace of the Jedi Order. While attempting to gain his support in the war between the First Order and the Resistance, Rey discovered that she could commune with Skywalker's nephew and former Jedi apprentice, Kylo Ren, across the galaxy as a result of the bond they shared through the Force. The connection between Rey and Ren caused them to gain deeper insights into one another, with Rey sensing the dark apprentice's internal struggle against the pull to the light. However, the bridging of their minds allowed Ren to discover the insecurities Rey harbored about her past and, in particular, her parents, much to the scavenger's dismay. Although Rey regarded Ren as a monster for committing the act of patricide, Ren believed they shared much in common, with both having been abandoned as children."}, {"tag": "p", "text": "Upon discovering a cave with a strong connection to the dark side, Rey tried to use its powers to discover the identities of her parents. Her efforts ended in failure, leaving Rey distraught and seeking the company of Kylo Ren, whom she now saw as the only person who understood her feelings of isolation and abandonment. Although Rey felt more lost than ever due to her experience in the cave, Ren assured her that she was not alone. Rey responded by reaching out to toych Ren's hand, assuring him that he was not alone either, and that it was not too late for him. They were both amazed by the discovery that they could touch each other through the Force, regardless of the actual light-years separating them."}, {"tag": "p", "text": "Convinced there was still good in the former Ben Solo, Rey confronted him in the flesh and together they overthrew Ren's dark master, Supreme Leader Snoke. Seizing the chance to claim Snoke's mantle as absolute ruler of the First Order, Ren invited Rey to rule by his side as leaders of a new galactic order. He then compelled Rey to confront her worst fears by admitting the truth she had long suppressed—her parents were nobody. Ren elaborated, telling Rey that they were mere junk traders who bartered their daughter away for drinking money. Ultimately, they were both dead and buried in a pauper's grave in the Jakku desert. The revelation brought tears to Rey's eyes, for she sensed no deception in Ren's intentions. Nevertheless, Rey resisted Ren's entreaty and helped the Resistance survive the Battle of Crait. She further hindered Ren's plans by continuing her studies in the Jedi arts, ensuring the Jedi Order would not end with the death of Luke Skywalker."}, {"tag": "h3", "text": "The whole truth"}, {"tag": "p", "text": "Despite the efforts to sustain the Emperor's cloned body, the Sith Eternal cultists were fighting a losing battle to keep Sidious alive. With Snoke's death, however, Ren usurped political and military control of the First Order as the new Supreme Leader. Within a year of Ren's accession, a message was transmitted across the galaxy, broadcasting the voice of Sidious who announced his return and the imminent rebirth of the Sith. This turn of events motivated Ren to seek the phantom Emperor's location, unwilling to tolerate any threat to his reign. Using a Sith wayfinder that once belonged to his grandfather, he made his way to Exegol where he confirmed the existence of the Sith Eternal cult. In addition to learning that the cultists had secretly groomed him as the heir to a new empire, Ren discovered their various experiments, such as multiple copies of his late Master as well as the decaying clone of the late Emperor."}, {"tag": "p", "text": "Ren could sense the essence of Sidious within the clone vessel, but its decrepit condition revealed that the Sith Lord was living on borrowed time. Sidious had made use of that time by overseeing Ren's progression as the heir to the Sith legacy, and commended the young warrior on destroying Snoke. Having molded Ren as a successor and having constructed a fleet—referred to as the Final Order—of Xyston-class Star Destroyers, Sidious declared that Ren would succeed him by ruling over all the galaxy as the new Emperor, on the condition that he kill Rey before she could complete her Jedi training. He also revealed his connection to the Jedi apprentice, informing Ren that Rey was, in fact, his granddaughter."}, {"tag": "p", "text": "Ren had been honest with Rey when he told her that her parents were irrelevant, having seen a glimpse of their lives in a vision. He thought little of the poor, frightened couple that initially raised Rey, but her blood relation to the phantom Emperor intrigued Ren. He was now convinced that the dark side was as much a part of Rey's nature as it was with him, pushing Ren to renew his efforts to convert her despite the Emperor's mandate to kill her. During their confrontation on Pasaana, Ren pushed Rey to give in to her anger, resulting in a burst of Force lightning from her hand. After witnessing the demonstration of Rey's capacity for darkness, Ren revealed that the Emperor was not only her grandfather, but that he was also responsible for the deaths of her mother and father. Additionally, Ren made a discovery relating to the bond between him and Rey—they were a dyad, two separate beings who were one in the Force. He kept this information a secret from Sidious, hoping that he and Rey could destroy the Emperor and usurp the Throne of the Sith with their combined power."}, {"tag": "p", "text": "Despite all of her training as a Jedi, the revelation of her blood ties to Sidious pushed Rey to give in to her impulses, including the impulse to avenge her parents. Sensing that she was closer than ever to embracing the dark side, Ren goaded Rey in to fighting him in the wreckage of the second Death Star on Kef Bir. However, Sidious' plan was disrupted by the actions of Ren's mother, Princess Leia Organa, who, with her dying breath, called her son back to the light, leading Ben Solo to renounce the dark persona of Kylo Ren. During the Battle of Exegol, Sidious urged Rey to succeed him and become \"Empress Palpatine.\" He used Rey's attachment to her friends as leverage in turning her to the dark side. Rey found her grandfather's power intoxicating and was tempted by his offer, believing the galaxy would have no choice but to accept salvation if she became the Empress. In actuality, Sidious planned to transfer his spirit into Rey's body with the aid of a Sith ability he pilfered from Plagueis."}, {"tag": "p", "text": "With the help of a redeemed Ben Solo, however, Rey defied her grandfather by refusing to kill him in anger, affirming her commitment to the light. Angered at the sight of Solo and Rey standing together as Jedi, Sidious unleashed his power against them, and discovered the truth that Kylo Ren concealed from him—their nature as a dyad in the Force. Realizing the power of their bond could heal his clone body, Sidious restored his strength by almost completely draining both Solo and Rey of their life force. After becoming whole again, he declared his return as the one true Emperor, no longer requiring a host body. Nearly deprived of her power, Rey called on the spirits of all past Jedi to help her defeat Sidious. With their help, she managed to turn the Emperor's newfound power against him, utterly destroying Sidious. The effort killed Rey, however, though Solo found that he had the power to save her from death by sacrificing his life."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Although Rey rejected her grandfather's legacy, she accepted her parents despite remembering very little about them. After learning that they had died while protecting her, Rey used their memory to keep herself anchored to the light, resisting Sidious' efforts to tempt her into surrendering to the dark side."}, {"tag": "p", "text": "Anakin Skywalker's bloodline ended with his grandson, Ben Solo, becoming the last Skywalker. However, Rey decided to adopt \"Skywalker\" as a surname during her visit to Luke Skywalker's childhood home on Tatooine, having rejected her heritage as the granddaughter of a Sith Lord. She kept her origins as a Palpatine a secret, uncertain about what her allies would think if they knew the truth, or if they cared about bloodlines at all."}, {"tag": "h2", "text": "Family tree"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the first eight films of the Star Wars saga, there were no hints or references to Sheev Palpatine having relationships or offspring. J.J. Abrams, director of The Force Awakens and The Rise of Skywalker, hinted the revelation that Palpatine was Rey's grandfather in the ninth installment was an early idea when working on the seventh chapter. \"That's not to say there was a bible and we knew what happens at every step,\" he said, \"but when Larry Kasdan and I worked on The Force Awakens, we didn't do it in a vacuum.\" After the release of The Force Awakens, Daisy Ridley, the actress who portrays Rey in the sequel trilogy, recalled feeling surprised that many saw the film and came away speculating about the identity of Rey's parents, explaining, \"I thought a lot was answered in The Force Awakens. Then after the screening, I went for a drink with my agent and everyone, and we were chatting away and I realized that oh, in their minds it's not answered at all!\" She later revealed that Obi-Wan Kenobi was considered as one of the possibilities for her grandfather; According to Ridley, Abrams went back-and-forth on Rey's lineage, even during filming of The Rise of Skywalker, and making her a descendant of Kenobi was still in the mix. She said she wasn't clear on the final decision until the end of filming."}, {"tag": "p", "text": "Rian Johnson, the director of The Last Jedi, opted to reveal that Rey did not come from a special bloodline. As a result, her parents were nobodies. In an interview, Johnson stated that it was a dramatic decision of \"What is the toughest thing she could hear about her parents? What is the thing for her and for us what will make her have to stand on her own two feet and will make things the hardest for her?\" After the release of The Last Jedi, Simon Pegg said “I know what J.J. kind of intended, well, at least what was sort of being chucked around. I think that's kind of been undone slightly by the last one. There was some talk about, you know, a kind of relevant lineage for her. But I honestly don't know, and I don't know if anybody knows. We shall see.” However, Abrams said he felt The Last Jedi's script \"didn't get in the way of anything Larry and I talked about that I thought I'd get to. There were some very specific things we did get to do in this movie that we were laughing and going, 'Oh my god, we're finally doing that thing we talked about five years ago.'\" He elaborated thematically that \"one of the themes of the movie is that anyone can be anything regardless of where you're from, and I don't know if it resonates for everyone but I think there are quite a few people who appreciate that idea of not coming from a place that you're not particularly excited about following or proud of. And though I completely understand 'you're nobody' is a devastating thing, to me the more painful, the more shocking thing was the idea that you're from the worst possible place. And is that thing that you feel that you know is part of you somehow, that you're haunted by, is that your destiny? And the idea that there are things more powerful than blood, as Luke says, that thing was a really important thing to convey for us.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}