{"url": "Pantora/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic moons", "Category:Outer Rim Territories moons", "Category:Pantora locations", "Category:Sujimis sector", "Category:Swamp moons", "Category:Type I atmosphere moons"], "nodes": [{"tag": "h1", "text": "Pantora"}, {"tag": "p", "text": "Pantora was the principal moon of the Outer Rim Territories' Pantora system, orbiting the ice planet Orto Plutonia. Pantora was covered by terrestrial land, with marshes on the outskirts of its cities. It was a member of the Galactic Republic and had full senatorial representation on Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Beginning as a feudal system of government, Pantora eventually developed a democratically elected government, presided over by the Pantoran Assembly which was in turn led by the Chairman. During the Clone Wars, the manipulative Chi Cho at the time ruled over Pantora as chairman. The moon was represented in Galactic Senate by the young female Senator Riyo Chuchi. An influential moon, Pantora was able to request and receive a Republic outpost within its system as a measure of protection against the CIS forces during the Clone Wars."}, {"tag": "p", "text": "Initially thought to be the only inhabited world in the system, Pantora orbited the ice world of Orto Plutonia, which was a protectorate of the Pantorans and—unknown to them—a home to a Talz colony. When the existence of Talz was discovered, the planet was granted sovereignty—though Chairman Cho fiercely opposed the measure and started the One-Day War with the Talz. However, Senator Chuchi intervened at the behest of the Pantoran Assembly and, in respect of the Talz's wishes to be left alone, she recalled the Pantoran and Republic presence from the ice world and returned to Pantora. Not long after, Baron Notluwiski Papanoida became the new Chairman of Pantora."}, {"tag": "p", "text": "Later in the war, Pantora was blockaded by the Trade Federation under the command of Lott Dod to force Pantora to join the Separatists. The blockade led to violent riots and calls to join the CIS in desperation. Papanoida managed to overcome the crisis after his daughters were kidnapped and held as leverage, with the help of Senator Chuchi and Ahsoka Tano, who aided him in their rescue. Chuchi successfully negotiated with the Trade Federation ambassador to end the blockade and resume trade relations after she threatened to blackmail him and expose his alliance with the Separatists."}, {"tag": "p", "text": "When the Republic collapsed and the Galactic Empire seized control of the galaxy, Pantora was cut off from the rest of the galaxy. Struggling to come to grips with their new predicament, the Pantoran Assembly split into three factions: the Appeasers, the Republicans, and the Expansionists. The first group believed that integrating with the Empire was the only path to security and economic strength, while the traditionalist Republicans believed the Empire stood in stark opposition to the core principles and values of the Pantoran culture. The Expansionists argued that the forging of treaties with the old slaving and spice trading worlds around them would be their salvation. The Expansionists were the smallest in number, and their position was viewed as abhorrent by most Pantorans."}, {"tag": "p", "text": "Building up a small navy of volunteers, the Assembly cautiously expanded; careful to avoid drawing Imperial attention to their work. Rogue members of the Assembly began to hire mercenaries and make unofficial deals to free up the flow of information technologies and resources. Despite the vast resources available on Orto Plutonia, Senator Chuchi's treaty still stood, protecting the Talz from Pantoran interference. While many on the Assembly wished to respect the Treaty, others sought to educate the Talz in hopes of integrating the two societies and sharing resources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}