{"url": "Pantoran_Assembly/Legends", "categories": ["Category:Legends articles", "Category:Pantoran culture", "Category:Legislatures"], "nodes": [{"tag": "h1", "text": "Pantoran Assembly"}, {"tag": "p", "text": "The Pantoran Assembly was the government of the Pantorans, who lived on Pantora, the moon of Orto Plutonia."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "It was a democratic government of elected officials and was in turn presided over by the elected chairman. During the first year of the Clone Wars, the Pantoran Assembly was forced to declare their Chairman Chi Cho out of order when he started a war with the Talz, whose settlements were discovered on Orto Plutonia. After Cho's death during the conflict, Notluwiski Papanoida, a Pantoran baron, became the new chairman."}, {"tag": "p", "text": "The Chairman and Speaker wielded the overwhelming power in regards to Pantora and Pantoran affairs. In the event of an emergency, the Assembly was able to relegate power to their Senator, acting as a check on the power of the Chairman."}, {"tag": "p", "text": "When the Empire came to power, the Assembly split into three factions: the Appeasers, the Republicans, and the Expansionists. The first group believed that integrating with the Empire was the only path to security and economic strength, while the traditionalist Republicans believed the Empire stood in stark opposition to the core principles and values of the Pantoran culture. The Expansionists argued that the forging of treaties with the old slaving and spice trading worlds around them would be their salvation. The Expansionists were the smallest in number, and their position was viewed as abhorrent by most Pantorans. Building up a small navy of volunteers, the Assembly cautiously expanded; careful to avoid drawing Imperial attention to their work. Rogue members of the Assembly began to hire mercenaries and make unofficial deals to free up the flow of information technologies and resources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}