{"url": "Paonu", "categories": ["Category:Canon articles", "Category:61st Mobile Infantry personnel", "Category:Alliance Military officers", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Paonu"}, {"tag": "p", "text": "Paonu was a male commander in the Rebel Alliance's 61st Mobile Infantry, better known as Twilight Company. He served as naval captain on the company's CR90 corvette, Thunderstrike and was third down the line of command in Twilight Company. When the Thunderstrike was being pursued by forces of the Galactic Empire due to a hyperdrive leak, Paonu suggested transferring select personnel from the Thunderstrike to its escort the Braha'tok-class gunship Apailana's Promise, in the hopes of saving them."}, {"tag": "p", "text": "The former Imperial governor Everi Chalis, though, proposed raiding an Imperial heavy freighter, which was approved and carried out. After the raid, the Thunderstrike and Apailana's Promise rendezvoused with a rebel flotilla in the Elochar sector to make repairs to the Thunderstrike under Paonu's supervision. However, Imperial spies were able to infiltrate the Thunderstrike and Paonu was killed on the bridge."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Emergency meeting"}, {"tag": "p", "text": "During the Galactic Civil War, Paonu served as a commander in the Rebel Alliance's 61st Mobile Infantry, better known as Twilight Company, holding the position of naval captain aboard the company's CR90 corvette, the Thunderstrike, on which he led ship operations. The commander was third from the top in the Twilight Company's command structure, after Captain Micha Evon and his second-in-command, Lieutenant Sairgon. In 3 ABY, the Thunderstrike and its escort, the Braha'tok-class gunship the Apailana's Promise, suffered a series of attacks from the Galactic Empire due to a hyperdrive leak in the Thunderstrike which left a trail of hypermatter for the Imperial forces to follow."}, {"tag": "p", "text": "Captain Evon gathered the high ranking members of Twilight Company to discuss the matter. As suggestions for obtaining repair equipment ensued, Paonu hesitantly tabled his own plan to have Everi Chalis, an Imperial defector travelling with Twilight Company, and select personnel transferred to the Apailana's Promise and split the gunship from the Thunderstrike. His plan further suggested that the Thunderstrike would likely be pursued to obliteration while the Promise carried the its passengers to safety. Chalis commended his plan, but proposed her own in its place, stating they could instead locate an Imperial cargo transport and board it as a replacement for the Thunderstrike. Discussions soon arose in the conference again until Howl silenced them, and First Sergeant Hazram Namir suggested instead stealing supplies from an Imperial transport."}, {"tag": "h3", "text": "Final service"}, {"tag": "p", "text": "The plan to board an Imperial transport was ultimately approved and Twilight Company traveled to the Redhurne system and awaited an Imperial heavy freighter which carried the supplies the Thunderstrike's hyperdrive required. While they waited, Paonu, Evon and Chalis conversed on the corvette's bridge. After two hours, the company's target arrived and the Thunderstrike and Apailana's Promise attacked, with the Thunderstrike using boarding pods to deploy troops inside the freighter. Twilight Company's raid was successful, and the Thunderstrike and Apailana's Promise traveled to a flotilla in the Elochar sector where a dozen rebel ships were stationed, to have repairs."}, {"tag": "p", "text": "Evon similarly parted for a conference at the Alliance High Command's secret base on the planet Hoth with Chalis, which left Sairgon provisionally in charge of the rest of the Company. While the Thunderstrike's crew worked non-stop under Paonu to complete the repairs, Sairgon tried his best to keep the troops out of the way. Ten days into their time at the flotilla, Twilight Company took on survivors from the damaged light freighter Trumpet's Call, not knowing that they were Imperial spies which had killed the actual crew. The spies regained their strength and then stormed the Thunderstrike's bridge."}, {"tag": "p", "text": "Sairgon was killed, and five other bridge crew were captured, but wrestled the Imperial infiltrators after the rebel soldier Brand entered the bridge. By the time they defeated the spies, Paonu was dead on the floor. Brand then took charge of the remaining two bridge crew, and the Thunderstrike and Apailana's Promise fled to the pirate backwater planet Ankhural. As Evon had died while at Hoth, Chief Medic Von Geiz realized that he and Sharn, the second-in-command of the Promise, were technically the highest ranking with Paonu and Sairgon gone as well. With no one to lead the ship operations on the Thunderstrike, Commander Tohna was transferred from the Apailana's Promise to take charge of the corvette's bridge crew."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A male individual, Paonu wished to have the important personnel in Twilight Company abandon their comrades in the Thunderstrike in order to flee to safety aboard the Apailana's Promise, leaving the former vessel to face certain obliteration. He proposed this plan reluctantly during the meeting with the senior personnel and bridge crew of Twilight Company."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Paonu appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}