{"url": "Panza_Hondi", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Criminals", "Category:Guineo", "Category:Males"], "nodes": [{"tag": "h1", "text": "Panza Hondi"}, {"tag": "p", "text": "Panza Hondi was a male Guineo criminal living in the Industrial District of the planet Coruscant after the Battle of Naboo. During the year 32 BBY, Hondi worked for Haugg Nerf Industries, a death stick manufacturer that disguised itself as a nerf-packing plant. During his time living on Coruscant, Hondi murdered a police officer of the Coruscant Police Force by beating the officer to death, which caused the police to put a bounty on his head. While Hondi was working at Haugg Nerf, his bounty was claimed by the Mandalorian bounty hunter Jango Fett, who was there looking for information about Komari Vosa, the leader of a secret criminal organization known as the Bando Gora."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Guineo criminal, Panza Hondi was living in the Industrial District of the Galactic Republic's capital planet of Coruscant after the Battle of Naboo in 32 BBY. While living in the Coruscant Industrial District, Hondi worked for Haugg Nerf Industries, a local death stick distributor disguised as a nerf-packaging plant and owned by an individual named Groff Haugg. By the year 32 BBY, Hondi had murdered a police officer of the Coruscant Police Force while the officer was not on duty. In response to the death of their officer, the Coruscant Police Force placed a bounty on Hondi with his last known location being the Industrial District, promising a reward of 2,000 credits for live capture and 1,000 credits for his death. While he worked for Haugg Nerf, Hondi was affiliated with a number of thugs-for-hire. During the same year, the Mandalorian bounty hunter Jango Fett infiltrated Haugg Nerf Industries while searching for information to locate Komari Vosa, a former Jedi and the leader of a secretive criminal cult known as the Bando Gora, who were rumored to be behind an increase in the demand for death sticks. During Fett's infiltration of Haugg Nerf Industries, the bounty hunter apprehended Hondi on one of the facility's walkways."}, {"tag": "p", "text": "Fett claimed the bounty placed on Hondi, capturing him alive."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like many other Guineo, Panza Hondi had hairless skin of a pale yellow color, and was over two meters tall. A known affiliate of many different hired thugs, Hondi was not above murdering sentient beings, as shown when he beat a Coruscant Police officer to death. He also had some knowledge about using a blaster."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While working for Haugg Nerf Industries, Panza Hondi carried a blaster that fired red energy bolts. He wore a yellow jumpsuit with a gray plate on its front that had two tubes attached to it, each of which connected to one of the two silver-colored tanks attached to the back of his suit. Hondi's jumpsuit also had white stripes along the sleeves and around the collar. Along with the jumpsuit, Hondi wore light-gray gloves, dark-gray boots, and a pair of gray goggles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Panza Hondi first appeared in Star Wars: Bounty Hunter, a video game produced by LucasArts and released in December 2002. Before appearing in the game, he received an entry in Star Wars: Bounty Hunter: Prima's Official Strategy Guide, the game's corresponding guide, which was published by Prima Games and released in November of the same year. In 2008, Panza Hondi received an entry in Del Rey's The Complete Star Wars Encyclopedia, which established that Jango Fett apprehended him but did not say whether Hondi was killed or not. In Bounty Hunter, the player controls Jango Fett, and, since claiming Hondi's bounty is not essential to the game, the player has several ways to approach the bounty. The player can ignore Hondi entirely, kill him and not claim the bounty, kill him and claim the bounty, or capture him and claim the bounty. The Complete Star Wars Encyclopedia established his capture, so he must have been captured dead or alive. This article was written with the assumption that the player chose to capture Hondi alive, since that resulted in Jango Fett receiving the maximum reward possible."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}