{"url": "Panshee", "categories": ["Category:Legends articles", "Category:Ewok tribes"], "nodes": [{"tag": "h1", "text": "Panshee"}, {"tag": "p", "text": "The Panshee, also known as Tribe Panshee, or the Panshee Tribe, were a tribe of Ewoks on the forest moon of Endor who followed the Way of the Tree Spirits. Rebel Alliance and later New Republic agent Grael the Ewok was one the tribe's most respected members."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A tribe of Ewoks known as the Panshee resided on the forest moon of Endor by the time of the Galactic Civil War, following the Battle of Yavin in 0 BBY. The tribe were enemies of several tribes of Duloks, including the Donkuwah, Korga and Pubam. The Panshee also opposed the Sanyassan Marauders, a band of Sanyassan pirates which had crash landed on the moon. Another tribe of Ewoks, known as the Gondula, were allied with the Panshee. The Panshee Tribe practiced the Way of the Tree Spirits, a pantheistic Ewok Force tradition and religion. Their tribe consisted of a varied caste of Ewoks, including chiefs, matriarchs, loremasters, ritualists, shamans, warriors and ordinary workers. Members of the tribe made use of several types of weapons, including Ewok crossbows, wooden staffs, reinforced combat staffs, and spears."}, {"tag": "p", "text": "They operated out of several camps and tree villages. Two such villages were the Central and Southeast Panshee Ewok Villages. The Tribe Panshee village was another such tree village, which was the home of Grael the Ewok, his wife, and their son Ponto. As one of the leading members of his tribe, the Force-sensitive Grael became involved with the Alliance to Restore the Republic and the subsequent New Republic in 4 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Panshee first appeared in Escape from Balis-Baurgh, a short story written by Paul Balsamo that was that was originally published in Star Wars Adventure Journal 1 by West End Games in February 1997. They were later included as a non-playable faction in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}