{"url": "Paramatan", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Senex sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Paramatan"}, {"tag": "p", "text": "Paramatan was a primitive terrestrial world located in the Mid Rim's Senex sector. Its surface featured forests and jungles as well as plains and oceans. The world's fauna included birds, reptiles, and great oopiks, a species having both avian and reptilian traits. The oopiks were a relic species of flightless creatures that made their home in the Paramatan fruit trees of the continent of Grxy. Paramatan was discovered by scouts of the aristocratic House Elegin and eventually came to be used by the nobles of the Senex-Juvex region as a destination for hunting safaris."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Paramatan was a terrestrial world with at least one sun that was located in the Paramatan system of the Senex sector, a part of the Senex-Juvex region in the Western Reaches portion of the Mid Rim. A hyperlane linked it to the Rulaar system."}, {"tag": "p", "text": "Paramatan was a primitive world, with its surface being divided between deep purple oceans and continents featuring extensive plains and thick forests and jungles. The forests of the southern continent Grxy were considered to be remote, and Paramatan fruit trees grew there."}, {"tag": "p", "text": "Both avian and reptilian life forms were native to Paramatan, and the forests of Grxy were inhabited by small woodland creatures. Another example of the Grxy faunas was the great oopik. A flightless, arboreal creature utilizing ultrasound in hunting its prey, the oopik had evolved from both birds and reptiles and were a relic species that represented an earlier age of its homeworld. Initially thought to have gone extinct more than a million years before the reign of the Galactic Empire, the creatures were finally discovered on Grxy around the latter time period."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Paramatan was discovered by scouts affiliated with House Elegin, an aristocratic Ancient House based on the nearby world of Caltinia, as they were probing the periphery of the Thull's Shroud nebula. The planet was eventually mentioned in an entry of a holobrochure for the Tagge Holographic Museum of Chandrila dedicated to the great oopik."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Like the rest of the Senex-Juvex worlds, Paramatan was under the control of the region's aristocratic houses. It served as a hunting preserve used by affluent nobles, who went on safaris on the world and sometimes arranged for convenient accidents to happen there."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Paramatan was first mentioned in the 1994 sourcebook Creatures of the Galaxy, published by West End Games for Star Wars: The Roleplaying Game. The section of the book mentioning the planet was written by Rick D. Stuart and illustrated by Mike Vilardi. The 2009 reference book The Essential Atlas placed the world in grid square L-17."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}