{"url": "Attack_on_the_Sempre", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of Nightswan's campaign"], "nodes": [{"tag": "h1", "text": "Attack on the Sempre"}, {"tag": "p", "text": "During the Imperial Era, the troop carrier Sempre was attacked by two squadrons of stolen V-19 fighters and the frigate Castilus while transporting Wookiee slaves. The attackers damaged and boarded the transport. The Sempre's captain transmitted a distress call that was received by the Imperial Star Destroyer Chimaera, Commodore Thrawn's flagship. Thrawn suspected Nightswan to be behind the attack. Imperial authorities ordered the Chimaera's stormtrooper commander Major Ayer not to tell the Chimaera's crew that the Sempre was transporting slaves. However, Commodore Thrawn and Lieutenant Commander Eli Vanto insisted on inspecting the Sempre and discovered its true cargo."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the Clone Wars, the Galactic Empire subjugated and enslaved the Wookiees of Kashyyyk, regarding them as beasts. The xenophobic Galactic Empire wanted to exploit the Wookiees because their massive, robust physiology allowed them to work in harsh and dangerous conditions. Kashyyyk was completely subjugated by the Empire with the Wookiees being forced to cut wroshyr trees, produce crops for the Imperial Military, and extract wroshite mineral deposits. Wookiee slaves were also exported offworld as slave laborers in Imperial mines and projects such as the Death Star. In addition, Wookiees were also used as test subjects for weapons and medicines."}, {"tag": "p", "text": "Before being shipped offworld, Wookiee slaves were taken for processing at space stations such as Lansend Twenty-Six. They were then transported in modified troop carriers such as the Sempre. The insurgent leader Nightswan and his operatives took an interest in liberating enslaved Wookiees as part of his insurgency against the Empire. The insurgents stole the frigate Castilus and two squadrons of V-19 Torrent starfighters eight weeks prior to raiding the Sempre."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "The insurgents' frigate and V-19 Torrent starfighters ambushed the Sempre while it was traveling trough space. The boarders stormed the ship and liberated the Wookiee slaves. The liberated Wookiees joined in the fight and slammed several stormtroopers and crew members against the bulkheads. The crew of the Sempre picked up a distress signal that was intercepted by the Imperial Star Destroyer Chimaera, the Chiss Commodore Thrawn's flagship. By the time the Chimaera arrived at the Sempre's coordinates one hour and 49 minutes later, the insurgents had escaped with the Wookiees and all the crew had been killed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "To maintain the secrecy of the Sempre's true cargo, Coruscant directed the stormtrooper commander Major Ayer to board the Sempre while the Chimaera's crew dealt with the attacking ships. However, Commodore Thrawn and Lieutenant Commander Eli Vanto insisted on inspecting the troop ship. Vanto observed that several of the fallen stormtroopers had blaster burns while others had injuries to their heads and torsos consistent with being hit. Thrawn also observed that some of blood marks on the bulkhead were higher than the victims. Vanto and Thrawn also found that the assailants had left a blood mark behind."}, {"tag": "p", "text": "Despite Major Ayer's protests, Thrawn insisted on inspecting the troop quarters. Thrawn and Vanto discovered that the troop carrier racks had been modified to accommodate Wookiees. Thrawn then deduced that the Sempre was transporting Wookiee slaves; information that the Empire wanted to keep secret. Under Thrawn's command, the Chimaera then went to aid the beleaguered station of Lansend Twenty-Six, which was being attacked by the insurgents who wanted to free more Wookiee slaves. Thrawn's reinforcements succeeded in defeating these insurgents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Attack on the Sempre first appeared in Timothy Zahn's 2017 novel Thrawn, a Canonical origins story of the titular character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}