{"url": "Paran_Am-Ris", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Cereans", "Category:Galactic Republic senators", "Category:Males", "Category:Supreme Chancellors"], "nodes": [{"tag": "h1", "text": "Paran Am-Ris"}, {"tag": "p", "text": "Paran Am-ris was a male Cerean senator of the Galactic Republic who was appointed Supreme Chancellor after the peace treaty with the reconstituted Sith Empire signed on Alderaan."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Around 3653 BBY, the senator from Cerea was among a delegation of politicians, accompanied by two Jedi who traveled to Alderaan, on behalf of the Galactic Republic with the representatives of the Sith Empire, to conclude a peace agreement. However, it was discovered that the Imperials had threaded this meeting because they secretly planned an attack on Coruscant and forced the representatives to accept their terms and conditions. Eventually, he was contacted by Chancellor Berooken who told him that the planet was attacked by the Empire and therefore cease the negotiations. Sadly, the Cerean witnessed Berooken's death at the hands of the Sith. Darth Baras, who had been attacked by the Jedi Knight Satele Shan, told the senator that the contract must be signed up at the conditions of the Empire while Coruscant was held hostage. Paran suggested to think about it since the participants were treated unfairly by this approach. Finally, the contract had to be signed, because it didn't connect to Coruscant and the safety of the public."}, {"tag": "p", "text": "Returning to Coruscant, Am-ris became interim Supreme Chancellor as a result of Berooken's death during the attack. Therefore, he had to watch how many system representatives resigned because of the conditions of the contract, including Ambassador Mareesh of Rodia. Furthermore, Am-ris had a discussion with Jedi Master Zym that the Jedi Temple couldn't be rebuilt from these lack of resources that the Republic had. However, Zym and Commander Gin Lesl were allegedly killed in the aftermath, due to another bombing in the Senate. Am-ris received this message with a growing concern, and decided to contact a military base on Dantooine. The Republic discovered that Zym and Lisl were killed by the bounty hunter Braden who had apparently also carried out the attack on the Senate. Am-ris was furious and contacted Orgus Din to find Braden and bring him into custody for treason against the Republic. He was later replaced by Dorian Janarus during the same year."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}