{"url": "Parasophic_Arachne", "categories": ["Category:Legends articles", "Category:Scientific projects and programs"], "nodes": [{"tag": "h1", "text": "Parasophic Arachne"}, {"tag": "p", "text": "The Parasophic Arachne program was an illegal bioengineering project conducted by the GeneTech Syndicate during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Parasophic Arachne program was a class 5 biological research and development project carried out by the GeneTech Syndicate company. The aim of the program was to create an intelligent form of arachnes for the use of the Galactic Empire. Those arachnes could be released onto a world the Empire did not want to spend troops on, but did not want it to be used by its enemies. Even though the creatures would thoroughly destroy the native ecology, the planet would be effectively rendered uninhabitable."}, {"tag": "p", "text": "The project was secretly developed in a laboratory located just outside the city of Dearic, on the planet Talus, a lab listed as engaging in legitimate genetic manipulation on animals. Highly dangerous, the Parasophic Arachne program was even more illegal as it was conducted on an inhabited planet. The project was led by Doctor Vigh, the chief scientist of the GeneTech Syndicate."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The scientific part of the Parasophic Arachne program could be initially considered as a success since the GeneTech Syndicate scientists eventually managed to create deadly and intelligent creatures. Some time after the Battle of Yavin, Doctor Vigh ordered to transport several specimens to the Imperial research facility on Nubia. However, the transport carrying the creatures crashed in the mountains near the city of Nashal just after its departure. Moreover, the arachnes in the lab escaped containment and overwhelmed their creators, slaughtering most of the staff of the lab, including the project manager. All the surviving scientists quickly fled and went into hiding to avoid being arrested by the CorSec and charged with illegal biological experiments. Jana T'bayr was the sole scientist to remain in the lab. She initially wanted to save the project but she then tried to find a way to prevent the parasophic arachnes from destroying the planet Talus."}, {"tag": "p", "text": "The Parasophic Arachne program was exposed after the ship carrying engineered arachnes crashed in the mountains near Nashal, circa 1 ABY. CorSec Agent Taarna dispatched a spacer to investigate the crash site and rescue any survivors. However, the spacer discovered that Captain Narl and all the other survivors were killed while trying to prevent the arachnes from escaping in the wilderness."}, {"tag": "p", "text": "The CorSec later traced the flight trajectory of the crashed ship and found that it took off from Dearic. A CorSec scout team then discovered that the GeneTech Syndicate Lab near Dearic was undergoing an emergency evacuation. Agent Taarna recruited spacers who headed to the lab and discovered that the building was completely overwhelmed by the bioengineered creatures. The spacers first located the directory terminal and downloaded evidences and details about the project known as Parasophic Arachne. Taarna therefore ordered his CorSec crew to clear the lab. With the help of 6-POC, the project manager's protocol droid, the spacers managed to delete all scientific data that could be used to restart the program. They also retrieved a self-destruct intron virus, a virus designed specifically by the GeneTech Syndicate scientists to kill the arachnes. The spacers applied this virus to every arachne eggs they found in the lab. In the meantime, they fought and killed many arachnes in the lab. Agent Taarna later tasked the spacer to eliminate the arachne queen, the arachne responsible for breeding the parasophic arachnes. The spacers found the queen, a gigantic arachne, at the lowest level of the lab and finally killed her. Taarna thought that the new arachne species was doomed with the death of the queen. However, Jana T'bayr revealed that another arachne, the queen's mate, was still posing a threat. The queen's mate was much larger and stronger than other arachnes and designed to be exceptionally durable. While much of the queen mass was dedicated to reproductive functions, her mate however was almost entirely devoted to combat. Furthermore, if the queen's mate was the only arachne left, he could morph into a breeder and could repopulate the species by himself. A group of spacers found the queen's mate in another part of the lab and, after an intense fight, managed to kill the dreadful creature. The destruction of all the breeding arachnes and eggs eliminated the Parasophic Arachne threat."}, {"tag": "p", "text": "After the planet Talus was saved from the bioenineered arachnes, the CorSec targeted the escaped Genetech Syndicate scientists. The CorSec also filed a complaint with the Imperial Research Division against the GeneTech Syndicate for carrying out class 5 biological experiments on an inhabited world. Nevertheless, Agent Taarna was very pessimistic and thought that the investigation would be very complex and a very long time would be necessary before any trial. In any case, the spacers involved in the fight against the arachnes received a very generous reward from the Talusian government."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Parasophic Arachne program appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Parasophic Arachne program was added to the game as part of the \"Genetic Potential\" and \"Deifying Decisions\" arcs with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}