{"url": "Parent", "categories": ["Category:Canon articles", "Category:Stub", "Category:Incomplete lists", "Category:Reproduction"], "nodes": [{"tag": "h1", "text": "Parent"}, {"tag": "p", "text": "A parent was the biological progenitor of an offspring."}, {"tag": "p", "text": "In some animals like fathiers, the male parent was referred to as the \"sire,\" and the female parent as the \"dam.\""}, {"tag": "p", "text": "Humans were born to a male father and a female mother. Anakin Skywalker, a Jedi who became known as the \"Chosen One,\" had no known father, resulting in Shmi Skywalker Lars's great surprise when she became pregnant with him. The Jedi Master Qui-Gon Jinn, upon being told this, speculated that Skywalker had, in fact, been conceived directly by the midi-chlorians."}, {"tag": "p", "text": "The revelation of one's parentage could have profound implications for an individual. Luke Skywalker was shocked upon Darth Vader, who was formerly Anakin Skywalker, telling him that he was his father. Although Luke did not accept this at first, he eventually came to believe the truth of it and used the information to bind them together and convince Vader to save him from the ravages of his master, Darth Sidious. Leia Organa, another child of Vader, was forced to exit the Galactic Senate of the New Republic upon the truth of her parentage being revealed. Sometime after the Battle of Endor, Hera Syndulla became a mother after she gave birth to the son of Kanan Jarrus, Jacen."}, {"tag": "p", "text": "Rey, an orphaned scavenger from Jakku, remained on the planet in the hope that her father and mother would one day return for her. Even after leaving the planet following the awakening of her Force powers, she sought desperately to learn the identity of her parents. Eventually, however, a journey on the planet Ahch-To and a conversation with Kylo Ren, who had killed his own father Han Solo, led her to confront the truth: that a part of her had always known that deep down that her parents were junkers who sold her off for drinking money and were now dead in a paupers' grave in the desert wastelands of Jakku. Further revelations, however, led her to learn that they in fact had secreted her away on Jakku in order to hide her from her grandfather, the Sith Lord Darth Sidious."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}