{"url": "Parlan_Spinner", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Humans", "Category:Males", "Category:Sith in the Lost Tribe of Sith"], "nodes": [{"tag": "h1", "text": "Parlan Spinner"}, {"tag": "p", "text": "Parlan Spinner, also known as the \"Death Spinner\" and \"The Blademaster,\" was a Force-sensitive Human male rebel who was a member of the Lost Tribe of Sith in 2974 BBY. The Lost Tribe were the descendants of stranded Human Sith who had settled on the planet Kesh in 5000 BBY. The child of slaves, Spinner was born in the city of Eorm during the Festival of Nida's Rise in 3000 BBY. He was a descendant of an ancient rebel Ermon Parrah who had been cast out from the Tribe and whose descendants had been forced to become lowly weavers and ropemakers. Due to his genealogy, Spinner endured the stigma of being an outcast and was denied any opportunity of social mobility. In his youth, Spinner rebelled against the Tribe's establishment and became an outlaw who perpetrated acts of vandalism and mischief against the state. He even rejected his first name \"Parlan\" and became known as \"Death Spinner\" among both his peers and the public. Spinner became the leader of a gang of outlaws known as \"Spinner's Web\" and a perennial foe of the local authorities."}, {"tag": "p", "text": "By 2974 BBY, his anarchic campaign culminated in an assassination attempt against the ruling Grand Lord Varner Hilts, a reformist Sith who had ended the Time of the Rot and instituted the Hilts Restoration. However, Hilt's daughter Takara Hilts—the Prefect of Police—learnt about his plot and engineered a sting operation which ended in Spinner's capture and imprisonment. While the youth faced capital punishment for his various crimes against the Tribe, Varner showed clemency towards Spinner and decided to give him a second chance as a mariner serving on the exploratory vessel Southern Star. The ship was assigned with exploring the frozen continent of Eshkrene in Kesh's South Pole. While Spinner and Takara were bitter opponents, their paths ultimately crossed again and the two Human found themselves on Eshkrene. Following a scuffle with the ship captain Chegg and his crew, the two Human Sith encountered the Doomed—the descendants of stranded Jedi and Dark Jedi warriors from the Hundred-Year Darkness who had made peace after their actions unleashed the Great Calamity that ravaged much of Kesh and inspired legends of the Skyborn and Destructors amongst the indigenous Keshiri."}, {"tag": "p", "text": "The Doomed and their S'kytri leader Kaliska took the intruders captive. During their time with the Doomed, Spinner and Takara would learn about the origins of the Doomed including their role in the Great Calamity and a \"Great Weapon\" that had been sealed for safekeeping. Seeing an opportunity to settle scores against the Tribe, Spinner and the Keshiri crew stole the \"Great Weapon\" and escaped aboard the Southern Star. However, Kaliska and Takara pursued them and attempted to stop Spinner from opening the oubliette containing the \"Great Weapon.\" This weapon turned out to be the ancient Dark Jedi warlord Remulus Dreypa who had survived the Hundred-Year Darkness. Upon awakening, Spinner and the Keshiri pledged their allegiance to the powerful Dark Sider while Kaliska and Takara were taken captive. While Dreypa desired to return to the galaxy, he saw Spinner as a convenient ally and later promoted him to the position of Sith Lord."}, {"tag": "p", "text": "After killing the local Lost Tribe rulers at the port of Eorm, Dreypa and Spinner instigated a peasant uprising against the Lost Tribe. Despite initial successes on the Marisota Floodplain, Dreypa's forces suffered heavy casualties and were forced to retreat by the Tribe's elite Skyborn Rangers. Dreypa had also intended to keep Takara as insurance in negotiations but the Sith princess had escaped with Kaliska back to Eshkrene with a large flight of uvaks, winged reptilian steeds indigenous to Kesh. There, the Doomed rallied to stop Dreypa's megalomaniac ambitions. Dreypa's forces retreated to the volcanic crater of Sessal Spire where the Dark Jedi unleashed his pet Leviathans, monstrous serpentine Sithspawn who fed on the life energies of sentient beings. The Leviathans quickly wiped out much of the rebel and Lost Tribe forces. No longer needing minions to carry out his bidding, Dreypa turned on his former ally Spinner."}, {"tag": "p", "text": "However, Spinner then joined forces with his adversary Takara to save her mother Grand Consort Iliana Hilts from being devoured by a Leviathan. Spinner himself slew the beast. Meanwhile, the Doomed arrived at Sessal Spire and fought with Dreypa's Sithspawn but proved no match for the Leviathans and many perished. Amid the fighting, Spinner managed to escaped the battlefield with Takara, Iliana, and the Doomed leader Kaliska. Spinner quickly learnt from Kaliska that the ancient forebears of the Doomed had concealed a Jedi starship beneath the Circle Eternal in the Lost Tribe's capital of Kesh. Fearing the threat posed by Dreypa's megalomania, Kaliska urged the two Sith to destroy the vessel before Dreypa could take it for himself. After winning Takara's trust, Spinner also agreed to help ferry her debilitated mother Iliana back to Tahv. Spinner managed to escaped the scene with Iliana on an uvak before Dreypa's Leviathans caught up with them. Kaliska was slain by one of the Sithspawn and through her Dreypa learnt about the existence of the Last Hope."}, {"tag": "p", "text": "Takara stayed behind to delay the Dark Jedi but was unable to match him in combat and was subsequently taken captive herself. The Dark Jedi intended to barter the Sith princess in order to coerce Spinner into handing him the Last Hope. Meanwhile, Spinner brought Iliana back to Tahv as promised and managed to make his way to the Last Hope. However, he reneged on his promise to destroy the vessel and attempted to make travel to Coruscant, the capital of the Galactic Republic. Still, Dreypa caught up with the Sith outcast and threatened to destroy Tahv if he did not return the starship. Concerned at the plight of his former–enemy–turned–friend Takara and the destructiveness of Dreypa's Leviathans, Spinner returned back to Tahv in his starship. After wiping out the Leviathans with the starship's weapons systems, he rescued Takara who managed to land on his starship. However, Dreypa followed them and demanded that Spinner return his vessel."}, {"tag": "p", "text": "Spinner agreed but set the ship's autopilot on a one-way trip into Sessal Spire's volcanic crater. After handing back the vessel to Dreypa, he and Takara jumped into the Southern Ocean. Meanwhile, the Dark Jedi Dreypa perished in the volcano which prevented any information about Kesh and the Lost Tribe from reaching the greater galaxy. Following the defeat of Dreypa, the former outcast Spinner was welcomed into the Tribe as the \"savior\" of Tahv. He was subsequently recruited by the grateful Grand Lord Hilts as one of the \"Grand Lord's Hands\", secret agents who helped root out threats to the Grand Lord. Spinner also developed a romantic relationship with his former enemy Takara."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "According to the report Enemy of the Order: The record of Parlan Spinner, vandal and would-be revolutionary that was deposited at the Lost Tribe of Sith's intelligence repository at Orreg, Parlan Spinner was the descendant of Ermon Parrah—the relief navigator aboard the Sith warship Omen and one of the earliest Humans to be cast out from the Tribe. The Lost Tribe were the descendants of Human Sith slaves from Naga Sadow's Sith Empire that had fled the Great Hyperspace War in 5000 BBY. His ancestor Ermon Parrah had once led a failed attempt to steal the crippled Sith warship Omen and escape into hyperspace. As a punishment, Parrah and his future descendants were enslaved and ordered to spin a chord that would reach the stars in return for being readmitted to the Tribe. They became known as the Spinner family and would labor for centuries in a desperate attempt to fulfill the command. Since it was physically impossible to achieve such a feat, Parlan's descendants were kept in a perpetual state of pauperism."}, {"tag": "p", "text": "Over the centuries, the Spinner family became stigmatized as a poor, working class clan of weavers and rope-makers who were treated with disdain by the Tribe. The stigma of enslavement for the Spinner family was so strong that the Spinners continued to weave unquestioningly even when government order broken down during The Time of the Rot. The young Parlan Spinner was born during the turbulent Festival of Nida's Rise. Spinner was the only known member of his family to have rebelled against this edict, describing the \"rope to the stars\" as the same path that would lead to his true destiny of usurping the tribe's authority. At a young age, he left home and took to living on the streets as an outlaw, an anarchist opposed to the contemporary status quo. As an outcast, Parlan was denied access to education and any other forms of social mobility that would have enabled him to lift his status on Kesh. From childhood, Parlan bore a great deal of resentment towards the Tribe for casting his family into the fringes of Keshiri society. He was also known to have eschewed his given name in favor of the alias \"Death Spinner.\""}, {"tag": "p", "text": "At the age of eleven, Spinner got into trouble with the local authorities for defacing the statue of Yaru Korsin in Eorm. Through his teenaged years, Spinner's crimes progressed from acts of vandalism to robbery and acts of sabotage. According to the Prefect of Police Takara Hilts—the daughter of Caretaker Varner Hilts and Grand Consort Iliana Hilts, Spinner's actions were motivated by a desire to create trouble for the authorities. Likewise, Spinner rationalized his actions as part of his anarchic guerrilla struggle against the authorities on Kesh. By the twelfth year of the Hilts Restoration, Spinner had joined a gang of outlaws who ambushed and killed Keshiri tribute bearers traveling to Orreg from the east."}, {"tag": "p", "text": "By 2974 BBY, Spinner had come to the attention of the Tahv Constabulary for his frequent acts of robbery. Since he was constantly on the run from the authorities, Spinner lived off the land and did not accumulate much material possessions. He also became the ringleader of his own gang known as \"Spinner's Web\" which specialized in harassing the authorities. Prefect Hilts investigated Spinner's involvement in several crimes including an assassination plot against all the Keshiri cake decorators prior to the wedding fete of High Lord Nikoll, and a terror plot to hijack an airship and ram it into the southeastern aqueduct. By 2975 BBY, one of his latest strings of crimes included an attempt to desecrate the Keshiri Burial Cairns beneath the old Circle Eternal. Prefect Hilts attempted to apprehend him but he escaped capture.While exploring the catacombs, Spinner also stumbled upon a working ancient Jedi starship that had been hidden beneath the Circle Eternal by the Jedi following the Great Calamity which ended in a truce between the Jedi and their Dark Jedi foes."}, {"tag": "p", "text": "During her investigation, Hilts speculated that this reflected a distain of tradition but surmised that he had no political aims of overthrowing the current government. Thus, Spinner was classified as a persistent trouble-maker rather than a rebel, a far more serious offense on Kesh. As a low-level offender, Grand Lord Hilts assigned Spinner's case to the Tahv Constabulary as opposed to the elite security forces like the Lost Tribe's Sabers and Apprentices, who were focused on eliminating rival Force-wielders that challenged the incumbent establishment. During a correspondence between Prefect Hilts and her father Grand Lord Hilts, she offered him two options: killing Spinner or capturing him. Ultimately, the reformist Grand Lord chose to spare the youth's life by capturing him since he intended to give him a second chance in life."}, {"tag": "h3", "text": "Entrapment"}, {"tag": "p", "text": "In 2974 BBY, Spinner's anarchic campaign reached a new high when he planned to assassinate the High Lord Varner Hilts himself during the celebrations commemorating the arrival of the Omen on Kesh—the warship carrying the original ancestors of the Lost Tribe. For centuries, the Lost Tribe had been able to maintain domination over the Keshiri by claiming to be the Skyborn, ancient protectors from the annals of Keshiri mythology who had fought against the evil Destructors. Thus, the Lost Tribe came to occupy a demi-god status among their Keshiri subjects. Officially, Spinner told his fellow gang members in \"Spinner's Web\" that they were only there to create mischief and trouble. However, one member of his coterie was secretly working an informant for the Tahv authorities and leaked intelligence of Spinner's plans to Takara who informed her father Varner. The Grand Lord then concocted a trap for the youth."}, {"tag": "p", "text": "During the celebrations, Spinner and at least two other accomplices donned jesters' masks and deliberately walked into a parade by members of the Lost Tribe. Several Keshiri onlookers initially mistook them as being part of the celebration but their presence aroused anger from the Sith participants. One Lord scolded one of Spinner's accomplices for going too far by disrupting the Founding celebrations. Spinner himself managed to break free from several Constables, exclaiming loudly that only a fool would celebrate being stranded on what he labeled a \"festering lump of a world.\" Before the guards could stop him, Spinner discarded his mask and headed towards the sedan carrying Lord Hilts, deriding the man as the \"Head Fool.\""}, {"tag": "p", "text": "To the horror of his mates, Spinner unsheathed his dagger and jumped into the sedan while shouting that he was the \"Death Spinner\" and was tired of waiting. However, the sedan chair proved to be a decoy and the youth encountered Prefect Takara herself, the daughter of Varner Hilts. She used the Force to knock the dagger out of his hand. Surrounded by several constables, Spinner refused to concede defeat. As a finale, the youth threw a minlohku dart at a Keshiri constable, grazing his shoulder. However, Spinner was quickly overpowered by the constable's comrades. Still defiant, the youth attempted to goad the Prefect by exclaiming that they could not break his spirit because he was the \"Death Spinner.\""}, {"tag": "p", "text": "However, Takara Hilts retorted that she did not want to break his spirit but rather his body. She ordered her constables to rough him as part of the night celebrations. Spinner was taken to the palace of Grand Lord Hilts where he was beaten and roughed up by the constables for several hours. However, Takara ensured that her subordinates did not permanently maim or cripple him because her father Grand Lord Hilts had ordered that he be captured alive and brought into his presence. However, Spinner's accomplices were not so fortunate since the Grand Lord's wife Iliana had ordered their summary execution. She disagreed with her husband's decision to spare Spinner's life since she regarded him as an assassin. However, Varner insisted that he get to meet the youth for himself."}, {"tag": "h3", "text": "A Second Chance"}, {"tag": "p", "text": "At dawn, a beaten and disheveled Spinner was brought before Grand Lord Hilts. Hilts was a historian who had dedicated himself to studying the history of the Lost Tribe. He explained to Spinner that he had not been present at the celebrations because he had little interest in state functions which took away time from his research. Unlike his Sith compatriots, Hilts believed that time was more valuable than power since nobody had ever broken the chains of time. Spinner regarded Hilts as a stereotypical \"absent-minded\" professor who did not fit conventional definitions of a \"proper\" Grand Lord. Hilts merely commented that Spinner should instead blame the founders for perpetuating the view that power was synonymous with authority."}, {"tag": "p", "text": "He was examining a Keshiri tapestry which detailed the ancient history of the Keshiri people. Hilts explained the historical origins of the Tribe; that they had been slaves of Naga Sadow who had been sent on a mission to deliver lightsaber crystals when their starship crashed on Kesh and encountered the Keshiri. The Keshiri were a backward, premodern society that was deeply superstitious. One of their legends described an ancient cataclysm between two powerful series of gods known as the Protectors and Destructors. Hilts surmised that the ancestors of the Tribe merely co opted the Keshiri legend by convincing them that they were the Protectors. Spinner responded that this action sickened him because he believed that Sith should not want to protect but rather to destroy."}, {"tag": "p", "text": "Meanwhile, Spinner managed to untie his bonds and attempted to strangle the Grand Lord from behind. However, he was caught red-handed by Hilts' daughter Takara who hit him on the head with an ancient urn. True to his absent-minded personality, Varner merely asked if that urn had belonged to someone important. Takara then revealed that further investigations had confirmed that \"Death Spinner\" was actually the working-class vagabond and slave Parlan Spinner. Spinner then angrily responded that her tribe was to blame for casting out his families many generations earlier and reducing them to pauperism. He reiterated that they still remained Sith who could use the dark Side of the Force."}, {"tag": "p", "text": "Takara, however, had little sympathy for the outlaw youth, dismissing him as a vandal who had earlier been convicted for attempting to desecrate the Keshiri Burial Cairns beneath the Circle Eternal. She described Spinner as an irreverent miscreant who would kill anyone for any reason. Takara's hostility towards Spinner was joined by her mother Iliana who chided her daughter for bringing an assassin into her husband's parlor, adding that Spinner should have been executed in the street along with his coterie. However, Lord Hilts was unconcerned and merely explained to the youth that killing him would be unwise since Spinner lacked the necessary qualities to succeed him as landlord."}, {"tag": "p", "text": "Hilts further lectured Spinner and his family about the complex power structure his ancestors had established to channel their ambitions. With its collapse in 3960 BBY, the Tribe had nearly gone extinct after nearly nine hundred years of turmoil and civil war known as The Time of the Rot. However, Grand Lord Hilts had used his knowledge of history to restore order through a series of reforms known as the Hilts Restoration. Spinner remained unmoved by Hilt's words and commented that the current political order only benefited the elite while the masses remained powerless. Grand Lord Hilts sensed that Spinner was impatient but reiterated that he could be put to good use. Under the Hilts Restoration, the Grand Lord had commissioned the construction of a new fleet of wooden ships as part of a program to explore new frontiers in the continent of Alanciar. His wife Iliana chided her husband for allowing his enemies to live since that would threaten the family's grip on power."}, {"tag": "h3", "text": "Uncharted Waters"}, {"tag": "p", "text": "Lord Hilts ordered his daughter Takara to fly an uvak to the new docks west of Berav where she would find a Keshiri mariner known as the Southern Star that had just arrived from Alanciar. The ship's captain Chegg was due to depart on a surveying mission. He instructed her to inform him that the Grand Lord was sending Spinner to join his crew. However, Iliana still distrusted Spinner and told her daughter Takara to kill him if he created trouble again. At that point, Spinner realized that Varner and Iliana Hilts were the parents of Takara. He then expressed his surprise that the daughter of nobles of such high social standing was doing patrol work, which was considered a lowly occupation delegated to Keshiri. Takara then explained that this policy reflected her father's idea that power in the tribe was not hereditary but was rather earned through merit. She explained that the Grand Lord was elected by the High Lords since it provided a safety valve that prevented competition between the various ruling families. Spinner mockingly asked whether Lord Hilts was protecting her or his \"precious tribe.\""}, {"tag": "p", "text": "Takara replied that she did not care but it was difficult to follow Sith principles because of her father's meritocratic policies. Spinner then took the opportunity to taunt the Prefect by commenting that he had written the tome on being thwarted but was still determined to use his new job as a sailor to advance his social standing. As a final parting, Spinner commented that Takara could enjoy being her parent's slave while he would be gaining riches as a mariner. Captain Chegg was a Keshiri, a member of the indigenous species of Kesh that had been subjugated by the Lost Tribe millennia earlier. Chegg was a hard and demanding taskmaster who assigned the young Spinner with the task of manning the ship's sails and rigging. Chegg disdained the arrogant disposition of many of the Human Sith on Kesh and took advantage of Spinner's employment to exploit the young Human. Most of the previous Humans he had encountered while working as a mariner had been slaves and criminals who had been cast out by the Tribe. From the beginning, the two men disliked each other and Cheggs regarded Spinner as unwanted trouble."}, {"tag": "p", "text": "After several days of voyaging, the Southern Star sailed past Alanciar and headed towards Kesh's South Pole which was believed to contain a large frozen continent. Most of the Sith population and their Keshiri subjects lived on the main continent of Keshtah Minor. However, tribal rivalries and population strains had led Grand Lord Hilts to commission a maritime exploration program to seek new lands and resources. Despite their initial hostility, Spinner and Takara were destined to cross paths yet again. One day, Spinner was below deck sharpening his daggers when he encountered Takara, who had stowed aboard the ship. She had grown tired of working as a Constable and like Spinner, she wanted to start a new life in Alanciar. She had thought that Spinner's vessel was rounding Keshtah and then sailing towards Alanciar. Upon going on the ship's deck, Takara quickly discovered that they not heading to Alanciar, but were actually sailing towards the South Pole."}, {"tag": "p", "text": "At that point, Captain Chegg encountered Takara. Unaware of her true identity, he assumed that she was another Human castaway who had stowed aboard the Southern Star. He reiterated that everyone who stepped aboard his vessel had a job to do and that stowaways were shirkers. Spinner attempted to speak up for Takara and tried to explain that she was someone important. However, Takara claimed that she was only another passenger. Due to the privileged status of Humans in Keshiri society, Takara insulted the Captain by telling him to watch his mouth since he was a Keshiri. However, Chegg was not amused by the Human girl's recalcitrance and reminded her that the only \"gods\" above his ship were the surveyors and straw bosses on his crew. Everyone else below those positions were indentured laborers. He then ordered his two Human charges to get to work, reiterating that since they were heading into uncharted waters he needed all hands aboard to make a landfall."}, {"tag": "p", "text": "Spinner and Takara were then sent to work on the sails and rigging. Due to the polar climate, it was hard work working on the exposed deck. Growing tired of his labor, Spinner asked Takara why she did not tell him whom she actually was since they could have gone back to warmer regions. Takara responded that her parents would not give her the advantage of her family name and stated that she would thus not use it to her own advantage. Due to his impoverished background, Spinner thought that Takara was wasting her power and privileges. Takara then replied that he could make his own way while she made her own way. She then reiterated that she was a Sith and she had made up a plan. This plan would involve stowing back aboard the ship and sailing back to Keshtah while leaving the Captain and his crew behind. Upon landing on the frigid shores of the South Pole, Chegg and his surveying crew began unloading supplies and equipment. They planned to set up camp and then explore the region over the following days."}, {"tag": "p", "text": "Unhappy with his polar assignment, Captain Cheggs dubbed the newly uncharted land with the derogatory nickname \"Frozen Pit.\" While there were several wild animals and trees, Cheggs believed that the land had not sapient life and expressed his bemusement on why the tribe had wanted him and his crew to survey the South Pole. He instructed his men to set up shelters since there was a snow storm approaching. Meanwhile, Spinner and Takara attempted to sneak back aboard the Southern Star but were caught by the crew. For Cheggs, this confirmed his initial suspicions that Spinner was trouble since the moment he had come aboard. He ordered his crew to kill the two \"mutineers\". After fighting off several of the Keshiri crew by using their Force powers, the two Humans headed towards the forest. Meanwhile, Cheggs promised to give double rations to whoever killed the ringleader and triple rations if they were both caught alive."}, {"tag": "p", "text": "As they fled, Takara chided Spinner for ruining her plans by following her. Takara had panned to sneak aboard quietly and then kill the guards one by one. However, Spinner had wanted to spike the Captain and stressed that it was no use winning if their opponents did not get to see it. After breaking out of the forest, they headed towards a large hill where they stumbled upon the skeletons on a massive creature, which turned out to be a leviathan, a monstrous and gigantic Sithspawn from the Hundred-Year Darkness. Takara slipped and lost her lightsaber. By that stage, Chegg and his men had caught up with the mutineers and taken Takara's lightsaber. While the Keshiri lacked the Force abilities of the Human Sith, they knew not to lose their weapons in the snow. After disparaging the Human \"Protectors\" by claiming that they would die like Keshiri, he and his crew were about to kill the Humans when they were slain by arrows fired by several cloaked figures in the horizon."}, {"tag": "p", "text": "Takara attempted to fight off the strangers with her lightsaber bit was quickly disarmed by them. The leader quickly recognized Takara as the daughter of Grand Lord Hilts and ordered her followers to lower their bows and arrows. She and her companions then removed their cloaks and identified themselves as members of the \"The Doomed\", the stranded descendants of Jedi and Dark Jedi veteran of the Hundred-Year Darkness who had made peace and moved to the South Pole. Their leader was a S'kytri woman named Kaliska and her followers included a male Wookiee, a male Ithorian, and a female Chagrian. She explained that her people shared Kesh with the Sith tribe before explaining that her people were known as \"The Doomed\" and that the two travelers were now \"doomed\" as well."}, {"tag": "h3", "text": "Captives of the Doomed"}, {"tag": "p", "text": "After capturing Spinner and Takara, Kaliska and her party detained the remaining members of the Southern Star's crew and impounded the vessel. The prisoners were taken to the main settlement on Eshkrene that was home to the descendants of the Jedi and Dark Jedi veterans. The settlement contained a large tower. While walking through the streets of the settlement, Spinner and Takara were surprised to encounter other individuals from different species including Rodians and Twi'leks. The Lost Tribe castaways had been predominantly Human and members of other species aboard the expedition had gradually died out through violent or natural means."}, {"tag": "p", "text": "They were also surprised by the lack of Keshiri slaves. Spinner correctly surmised that the Doomed themselves had built the settlement. Spinner also attempted to flirt with Takara, but the young woman rejected his overtures and reminded him to address her as \"Takara\" rather than \"Red.\" She also threatened to chop off his hand if he touched her again. However, Spinner commented that she did not have her lightsaber since their captors had taken it from them. Spinner also sensed that while the dark side was strong on Eshkrene, they could not feel it in the people. Takara merely replied that it was too cold for people to feel anything in the Force. However, she concurred that the inhabitants were null. However, both Humans sensed that there was power around them and that they wanted it. Takara then caught sight of a dagger being wielded by a Twi'lek member of the \"Doomed.\""}, {"tag": "p", "text": "The two Humans then attempted to escape from their captors. Spinner fought with several of the \"Doomed\" and even punched a Rodian in the head. Meanwhile, Takara attempted to flee back to the ship and alert the Lost Tribe about the presence of the \"Doomed.\" However, the two were quickly disarmed and separated. The winged Kaliska personally intervened and grabbed Takara by her arms, taking her on a flight of the city. The older woman reprimanded Takara for her actions and reminded her that Eshkrene was at peace. She then introduced herself as the leader of the Doomed and explained that the remaining Keshiri crew were already in their custody. Takara expressed her surprise that the winged S'kytri woman had used the Force to sweep her into her hands. Kaliska admitted she could use the Force but said that it gave her no joy to do so. After explaining the identity of the \"Doomed\" to both Spinner and Takara, she took them to the Hall of Regret, which contained the history of the Doomed."}, {"tag": "p", "text": "There, Kaliska explained to both Humans that they could not afford to allow the Tribe's explorers to find Eshkrene. However, she reiterated that they could not allow any harm to come to Takara or her \"protector\" Spinner. Kaliska was then unaware of the poor relations between the two Humans and Takara took that as an insult. Meanwhile, Spinner expressed his surprise at the vast amount of metal on Eshkrene and criticized his captors for wasting it on lanterns. The Twi'lek guard replied that while the light itself was not valuable, what was valuable was what the light that revealed. He then explained that the lights were known as glowbacters and revealed images that had been sketched onto the ice murals on the walls. These murals documented the history of the Doomed. As a local custom, all members of the Doomed came every day or night to commemorate their original landing on Kesh during the aftermath of the Hundred-Year Darkness and the exile of the Dark Jedi into the Stygian Caldera. As the leader of the Doomed, Kaliska explained the historical origins of the community to her two Human captives."}, {"tag": "p", "text": "Following the defeat of the Dark Jedi at the Battle of Corbos which ended the Hundred-Year Darkness, the Dark Jedi had been exiled to Korriban, a world in the Stygian Caldera which was home to the red-skinned Sith species. There, these Dark Jedi established themselves as Sith Lords, dark side wielding dictators who ruled the Sith. Several of these new Sith rulers including the former Baron Remulus Dreypa decided that it was time to take their revenge on the Jedi Order and the weakened Galactic Republic. They then assembled a strike force, gathering their new armies and their twisted Sith beasts. Those Sith Lords left their recalcitrant brothers behind them and ventured out of the Calder. But Dreypa and his forces came across a Jedi patrol composed of Corbos veterans looking for the Exiles, to make sure that they were unable to try to seek revenge on the Jedi and Republic. After a pursuit across the galaxy, the Jedi and Sith ships crash landed on Kesh, where the space battle became a tremendous clash of lightsaber and Force-powers."}, {"tag": "p", "text": "Unable to call for reinforcements due to the strange magnetic field of Kesh, the Jedi and their former brothers fought with a unparalleled ferocity, devastating the planet by using all the weapons at their disposal. But, horrified by the extent of damage and the impact of their conflict on the planet and its inhabitants, both sides formed a truce and the Sith sealed, into one of his own oubliettes, their darkest weapon, Dreypa himself. Seeking atonement, the Jedi and the Sith dedicated themselves to find the true neutrality between Dark and Light sides of the Force, settling at the south pole of the planet, in Eshkrene, where they formed a new community, \"The Doomed\". For thousands of years, the Doomed and their descendants watched over Kesh and the Keshiri, mounting guard initially on the prison of Remulus Dreypa and later monitoring the influence of the Lost Tribe of Sith on Kesh."}, {"tag": "h3", "text": "The Great Weapon"}, {"tag": "p", "text": "Takara surmised that the Keshiri legends of the Protectors and Destructors during the Great Calamity had actually described the conflict between the Jedi and their Dark Jedi opponents. She explained to Kaliska that the Lost Tribe had merely co opted this story to legitimize their rule over the Keshiri. After Kaliska revealed that the Dooomed had been spying on the Lost Tribe for generations, she praised Takara's father Varner Hilts for bringing peace to Keshtah and protecting the Keshiri people. While Takara came to sympathize with the Doomed and understand their experiences, Spinner maintained a cavalier attitude and criticized the Doomed for not using their \"Great Weapon.\""}, {"tag": "p", "text": "He further angered his hosts by squatting on their holy reliquary, a large stone table. Spinner's desire to see the \"Great Weapon\" led Kaliska to order the other members of the Doomed to confine him in prison with the remaining crew of the sailing ship Southern Star. While Kaliska was still undecided about the fate of the Sith captives, she was unwilling to let the two Humans and the Keshiri crew return back to Keshtah since they wanted to hide all evidence of their existence from the Tribe. Since they could not join the Doomed, Kaliska had planned to execute them as any other \"natural predators.\""}, {"tag": "p", "text": "However, Kaliska chose to spare the Takara's life because she sensed that the female Sith was more willing to learn more about the Doomed than Spinner. Kaliska took Takara on a tour of Eshkrene's farm where several livestock were kept. As Spinner was led outside, he denounced Takara as a traitor to her tribe. Takara responded that he would enjoy prison because that was where he belonged. Unlike the Lost Tribe's prisons, the Doomed's prison on Eshkrene lacked any bars or restraints. It consisted of a ramshackle building that was guarded by at least three archers. Spinner and his fellow Keshiri inmates were also not bound in restraints but were only confined to the prison. Within hours, Spinner hatched an escape plan, determined to go and take the \"Great Weapon\" for himself. He also fashioned several minlohku blades from a glass lantern. While the guards were looking at the horizon, Spinner killed them with his minlohku blades and stole their metals daggers."}, {"tag": "p", "text": "He quickly deduced that the \"wing-woman\" had hidden the \"Great Treasure\" at the top of the citadel in the center of the settlement. He used the Force to leap over several buildings, escaping the notice of other \"Doomed\" citizens. He then used the Force and his stolen metal daggers to scale the tower. While Spinner managed to reach the top of the tower safely without attracting attention, he wished that he had taken the stairs. Spinner managed to enter the to chamber through a narrow alcove. The \"Great Treasure\" was in the room and was guarded by two sentries including a male Weequay and an unidentified red-skinned alien. Since they were in such a remote place, they had not been expecting intruders and thus were not on full alert. Thus, they were unprepared when Spinner entered through the alcove and attacked. He used one of his daggers to incapacitate both sentries. Spinner then found that the treasure was a sealed black oubliette."}, {"tag": "p", "text": "Realizing that it was too heavy to carry down on his own, Spinner decided to free the remaining crew from the Southern Star to help him carry the oubliette back to the ship. As he left, the wounded Weequay guard begged him not to steal the oubliette and release its dangerous prisoner but Spinner ignored the man's pleas. He assured them that he was not going to unleash the oubliette on them but was rather going to use it to settle scores with people back home. After freeing the Keshiri crew, they headed back to the tower and stole the \"Great Weapon.\" Spinner and the Keshiri crew had been able to steal the \"Great Weapon\" and escaped to the harbor unnoticed since the city was in morning meditation. Due to its heavy weight, they had lowered it down the tower onto a sledge. At the harbor, the \"Death Spinner\" and his Keshiri allies were able to overpower the token guard force and escape Eshkrene on the Southern Star."}, {"tag": "p", "text": "By the time the Doomed had found out about the theft, the Southern Star was already sailing towards Keshtah. Kaliska and Takara only found out about Spinner's escape after other sentries who stumbled upon their incapacitated comrades in the tower had sounded the alarm. Takara quickly realized that Spinner was planning to use the \"Great Weapon\" to destroy the Lost Tribe and revealed that she had been pursuing him for years. Kaliska and Takara then pursued Spinner with the winged Kaliksa holding Takara under her arms. Kaliska wanted to bring Takara along to reason with the young outcast but Takara merely wanted to beat him to death. Meanwhile, other Doomed warriors were also dispatched to the harbor. While sailing through several ice flows, Kaliska and Takara caught up with the Southern Star. By then, Spinner was gloating to the crew about his plans to take over the tribe when one of his crew spotted the approaching winged woman and Takara."}, {"tag": "p", "text": "Before they could fire explosive shells at them, the \"Doomed\" leader and Takara had already landed on the deck. Takara confronted Spinner and tried to convince him that the oubliette had been sealed for a good reason. However, Spinner was unmoved by Takara and reiterated that he was no longer a slave of the Tribe and refused to take orders from anyone. He exclaimed that there was no weapon he could not use and added that he was not afraid to see what even the \"Great Jedi\" were so afraid of. Despite objections from both Takara and Kaliska, Spinner took a hammer and smashed the oubliette's cover open. This triggered a small explosion which unleashed a cloud of gas. Through his actions, Spinner had freed the dreaded Sith Lord known as Baron Remulus Dreypa, one of the early founders of the Sith Empire. After Lord Dreypa introduced himself, Spinner and the Keshiri crew immediately pledged their loyalty and fealty to the Sith Lord. Outnumbered, Kaliska and Takara were forced to surrender and were taken below the deck where they were imprisoned in the ship's hold. During their voyage back to Keshtah, Kaliska ceased resistance and entered into a state of perpetual meditation. In contrast, the Sith princess Takara fought against her captors and had to be restrained in chains."}, {"tag": "h3", "text": "A New Master and New Cause"}, {"tag": "p", "text": "After several days of voyaging across the Southern Ocean, the Southern Star arrived in Keshtah and landed at the port town of Eorm, Spinner's hometown. During the voyage, Spinner became acquainted with Lord Dreypa and related to him the historical origins of the Lost Tribe of Sith and their empire. The Sith Lord was surprised that an entire Sith civilization had developed on Kesh while he had been imprisoned in the oubliette for millennia. Lord Dreypa was grateful towards the Sith rebel for freeing him and swore vengeance against the descendants of his Dark Jedi allies who had imprisoned him within his own oubliette. Since he had been imprisoned in stasis for a long period, Lord Dreypa was slowly recovering his memory but could not remember all his powers at the moment. Spinner also related to Lord Dreypa that Eorm was his hometown and expressed his desire to destroy the town as a means of proving the Sith Lord's powers. Dreypa agreed to level the town but first had to attend to his two captives: Kaliska and Takara. Lord Dreypa had spared Takara Hilts since her father was the leader of the Lost Tribe and he felt that she would be useful as a hostage for future bargaining."}, {"tag": "p", "text": "While on the outskirts of Eorm, Dreypa sensed panic emanating from the town and decided to use the city to display the extent of his powers to his new allies and their prisoners. The local townfolk had failed to meet their quota of producing enough sailcloth to supply the Lost Tribe's fleet of wooden ships. As punishment, the local Sith Lord Galathos had ordered his troops to raze several houses. When a local Keshiri begged for mercy claiming that the townsfolk had labored day and night to meet the order, Galathos used the Force to choke the man. Galathos also added that the reformist Grand Lord Hilts was too far away to stop such abuses. However, Galathos was interrupted by Lord Dreypa himself who killed him by using powerful Force lightning bolts."}, {"tag": "p", "text": "Dreypa then used the Force to conjure flames, incinerating Galathos's troops. After this fiery display, Spinner rallied the crowd of slaves who had become dazed by the power of Dreypa, stating that the Tribe's rulers in Tahv had let the people down and that this new Sith Lord would fight for them against their oppressors. However, Dreypa interrupted Spinner to tell the crowd that he was fighting for nobody and that he would not stay on Kesh. The Sith Lord harangued the onlookers for not keeping to the true Sith path but promised that he would overthrow the tribal leadership, whom he derided for becoming lax and complacent through the exploitation of others. Dreypa also vowed to return to the stars which he described as his domain. Finally, the Exiled urged the townsfolk to join him in order to get revenge against their former tormentors. Dreypa's speech calling for the people to \"break their chains\" had a spellbinding effect on the people of Eorm."}, {"tag": "p", "text": "Among the observers were Spinner's long-time enemy Takara and the S'kytri Doomed leader Kaliska. Kaliska warned the Sith princess not to underestimate the dangers of Dreypa's powers since he had once threatened the entire planet. However, Dreypa overheard their conversation and quickly recognized the winged S'kytri woman as one of the descendants of one those Dark Jedi who had betrayed him and sealed him within the oubliette. Dreypa then revealed that he had been able to survive within the oubliette for several millennia because of an amulet that his rival Sorzus Syn had given to him on Korriban with the intention of trapping his spirit. However, Dreypa had altered the amulet's powers to help him survive his captivity within the oubliette. While Dreypa still had not fully regained his memories, the Sith Lord recalled that there was something he was looking for. He asked Kaliska if it was with her people but the woman feigned ignorance and claimed that she was only concerned with the well being of the Keshiri natives."}, {"tag": "p", "text": "Dreypa then boasted that his campaign would not stop at Eorm and that the Lost Tribe would eventually come to serve him. However, Takara responded that this was her Tribe's homeworld and that they would resist him. Dreypa then insulted Takara bu threatening to kill her father Grand Lord Varner Hilts whom he derided as a \"fool.\" Meanwhile, Dreypa's new \"partner\" Spinner went to the guardhouse at Eorm where he retrieved the lightsabers the deceased Sith. Upon returning back to the village, Spinner gave one of these lightsabers to Dreypa. In return, Dreypa conferred the rank of Sith Lord on the the young man and instructed him to distribute the remaining lightsabers to his newly-formed peasant army. Dreypa then announced that they would march on the Tribe's capital at Tahv. Takara chided Spinner for his willingness to betray his own people and to collaborate with an enemy. However, Spinner would have none of her lecturing and disowned the Tribe as his people, claiming that he aligned himself with the Exiled in order to overthrow the ruling elite."}, {"tag": "p", "text": "Takara then tried to insult Spinner by claiming that Dreypa would take all the glory for himself. She then told him to scurry back to Dreypa's side and disparaged the young man as little more than a slave who had changed his master. Drepya regarded the Sith princess Takara as a valuable hostage that he could used as leverage in negotiations. He then ordered two Keshiri guards to take Takara and Kaliska into captivity. However, the Sith princess had stolen two lightsabers and quickly felled her captors once they were out of sight. Kaliska then convinced Takara to return with her to Eshkrene and rally the Doomed in order to counter Dreypa's plans. The two women fled and also took all the uvaks of Eorm with them, depriving Spinner and Dreypa of an \"air force.\" Meanwhile, the Lost Tribe, advised of the Eorm insurrection but not of the presence of Dreypa, gathered its warriors under the command of Varner's wife Iliana, and marched against Dreypa and his followers in the Marisota Floodplain, a large plain which had been the site of many battles between rival Sith Lords. Grand Consort Iliana initially dismissed the Eorm incident as a mere slave rebellion but expressed concern at the vast numbers and level of organization."}, {"tag": "p", "text": "During the Battle of the Marisota Floodplain, Dreypa and Spinner eliminated many of their Sith opponents. Spinner took advantage of the fighting to settle scores against his opponents for real and perceived wrongs. While Dreypa killed several opponents with Force lightning, Spinner cruelly threw daggers into the chest of an enemy Sith warrior. As the man bled to death from his wounds, Spinner claimed that he had returned and was teaching the man a \"history lesson\" and that some people would be more excited about it than others. However, the tide of the battle changed when the Grand Consort sent forth her air forces, the Skyborn Rangers, who wiped out much of the Dreypa's untrained peasant army with their glass daggers. Facing defeat, Dreypa chided Spinner for not bring uvak steeds along. However, Spinner explained that their army lacked any professional riders and added that it took several months to learn how to fly an uvak."}, {"tag": "p", "text": "Spinner suddenly recalled that the guards with their two hostages had not yet caught up with the main army. An argument broke out between the two commanders when Spinner argued that their forces had moved too fast. However, Dreypa was unconcerned and expressed his impatience with reaching the capital Tahv in order to escape Kesh. Despite experiencing memory losses since his awakening, Dreypa finally remembered the existence of the Leviathans and ordered his surviving troops to follow him to the Sessal Spire, a large volcano that was situated in a peninsula south-west of the battlefield. Their retreat was observed by the Lost Tribe's commanders and Iliana gloated that the enemy was entering into a trap since the volcano was a dead end at the rim of the continent Keshtah overlooking the Southern Ocean."}, {"tag": "p", "text": "After some traveling, Spinner and Dreypa reached the molten crater of the volcano. By then, Spinner was beginning to have doubts about the mental health of Dreypa, and tried to negotiate his surrender with Iliana and the other Lost Tribe pursuers. The Grand Consort immediately recognized Spinner as the same man who had tried to assassinate her husband in Tahv. Spinner however tried to maintain a cheerful disposition and offered to make a deal with the Tribe since his leader had apparently turned insane. Spinner cheekily remarked to Iliana that her husband Varner would have just dismissed his involvement in the uprising as another one of his pranks that had gone wrong. However, Iliana was unwilling to give any quarter to the young anarchist and threatened to throw him into the lava after they had killed the ringleader."}, {"tag": "p", "text": "Iliana then turned her attention to the ringleader Dreypa, who insulted the Grand Consort for marrying a \"doddering old man.\" He offered Iliana the opportunity of becoming his new consort and claimed to be a true Sith with \"real\" power. However, Iliana rejected the offer and stated her preferences for Varner, claiming that he did not have any delusions of grandeur. Iliana then disparaged Dreypa as a mere slave who had thought himself some Force tricks and donned a ridiculous outfit. She then ordered her troops to throw Dreypa and Spinner into the molten crater. However, Dreypa used his talisman to awaken three fully developed Leviathans. These ancient Sithspawn had been developed during the Hundred-Year Darkness and had a fearsome reputation throughout the galaxy. The Sith Lord had earlier stolen them from his rival Sorzus Syn's laboratory on Korriban."}, {"tag": "h3", "text": "An Unlikely Alliance"}, {"tag": "p", "text": "Having awakened his Leviathans, Lord Dreypa ordered them to kill all the Sith present, including both the Tribe loyalists and the rebels. Spinner and Iliana barely managed to escape with their lives as the massive monsters began using their tendrils to pluck Sithlings. The Leviathans then drained all the life energy within their prey, leaving behind shrivelled husks. The Leviathans also absorbed the knowledge of their prey, increasing their advantages in hunting. Spinner attempted to save his own life by begging his former ally to spare him. However, Dreypa rejected Spinner's pleas on the basis that he had no allies and that his so-called allies had betrayed him centuries ago. Dreypa regarded the Leviathans as all the help that he needed. In the middle of the feeding frenzy, Dreypa and his Leviathans came under attack from the \"Doomed\", who had just flow across the Southern Ocean from Eshkrene by riding their uvak steeds. Kaliska herself led the attack and ordered her warriors to target the Leviathans' blister traps and exhorted her men to fight for the fight they had been born for."}, {"tag": "p", "text": "Dreypa then unleashed Force lightning on the attackers. At that point, Spinner took the opportunity to desert Dreypa. However, his old enemy Takara caught sight of him and flew her uvak towards him, slamming him to the ground. She then shouted that kick had been retribution for selling out his people to the Dark Jedi enemy. Spinner responded that the Tribe was not his people and tried to goad Takara by claiming that she was a slave of her parents. During the duel, Spinner unsheathed several glass daggers while Takara activated her red-bladed lightsaber. However, Takara was able to dodge both his blades and she kicked him in the face with her boot, knocking him to the ground. After pinning Spinner down to the ground, Takara announced that the tribe had found him guilty and was about to execute the young anarchist with her lightsaber. However, Takara was distracted by the cries of her mother who was in the grip of a Leviathan."}, {"tag": "p", "text": "Takara quickly rushed away and attempted to save her mother by hacking at the monster's tendrils. However, she too was captured by the Leviathan. At that point, Spinner intervened and attacked the Leviathan. He used his daggers to puncture the beast's blister traps. A free Takara then threw her lightsaber to Spinner who then used it to slay the Leviathan. Takara was shocked that her former enemy Spinner had willingly chosen to help her since she had been about to kill him. Spinner responded by claiming that while he was not interested in helping her, he had many ambitions for himself which did not involve the Leviathans destroying his society. While Spinner and Takara had managed to save the life of Iliana Hilts, she had been aged by the Leviathan. She was no longer the young warrior queen but was now an old woman. Spinner explained that the Leviathans stole the life force of their victims but they had managed to stop it before it could finish its work."}, {"tag": "p", "text": "The Doomed were busy keeping the Leviathans preoccupied which allowed the three Humans to escape the battlefield before more Leviathan larvae hatched. Takara and Spinner then loaded the debilitated Grand Consort aboard an uvak. By that stage, Dreypa had gained the upper hand over the Doomed through the use of Force lightning and the Leviathans' awesome powers. One of his Leviathans managed to catch a Rodian member of the Doomed in one of its blister trap. Since the Sith Lord commanded the Leviathans, he was able to absorb their knowledge and quickly learnt that the Doomed were the descendants of the Jedi and Dark Jedi who had imprisoned him within the oubliette. While he knew that the Doomed had pledge never to go to war again near the Keshiri, they had broken that rule in order to stop him. At that point, Dreypa recalled that his forebears had hidden a Last Hope beneath the Keshiri Burial Cairns in Tahv."}, {"tag": "p", "text": "The sole Sith survivors of the onslaught at Sessal Spire were Spinner, Takara, and Iliana. The S'kytri woman Kaliska was the lone survivor of the Doomed on Keshiri since most of her brethren had been slaughtered by Dreypa's Leviathans. While Takara was guiding the uvak carrying her mother, Kaliska had a brief conversation with Spinner. Since Dreypa's Leviathans had been too strong for even the Doomed to handle and that he was rapidly learning their secrets, Kaliska suggested that they combine their assault with the Tribe's remaining forces. However, Spinner dismissed the idea since he felt that the Tribe's leadership would have regarded her as a freakish alien in the same vein as the Leviathans. While Takara's mother Iliana could have led the Tribe's forces, she was in a debilitated state and had to be flown back to Tahv on her uvak. There, she hoped that the Tribe's sages could heal her."}, {"tag": "p", "text": "Kaliska suggested to Takara that as a Sith Princess she was in the position to lead her troops. She reminded Spinner and Takara that Dreypa had to be stopped since he would pose a threat to the wider galaxy if ever he escape offworld. Spinner then interjected at that point and asked the S'kytri woman if the \"business about the stars\" had not just been poetry. Kaliska replied that she was not interested in the Human youth since his actions had unleashed the threat of Dreypa. While she saw that Spinner had a cowardly nature, she expressed her surprise that he stayed with them. Spinner then asked Kaliska about an earlier comment she had made about her people not leaving even though they had the ability to use the Force. He and Takara had assumed that she had meant that the Doomed could not leave the South Pole. However, he concluded that they had not left the planet even though they had a starship."}, {"tag": "h3", "text": "The Jedi starship"}, {"tag": "p", "text": "Takara overheard their conversation and asked Kaliska about the issue. Kaliska then confirmed that a single Last Hope had survived the Great Calamity for centuries but that her forebears had hidden it within the Keshiri Burial Cairns beneath the Circle Eternal, the center of the Tribe's government on Kesh. However, her forebears had preserved the spacecraft since destroying the vessel would have alerted the Lost Tribe to their presence. Now that Dreypa had finished extracting the memories of the slain Doomed members, the Sith Lord had recalled that there was a way offworld. In order to prevent Dreypa from taking the starship for himself and posing a threat to the galaxy, Kaliska stressed that the vessel had to be destroyed. It had been the Doomed's last hope of escaping the planet but it would become dangerous if it fell into the wrong hands."}, {"tag": "p", "text": "Kaliska explained to the two Human Sith that she was unable to enter the chamber since it was too narrow for her large wings. Takara was reluctant to enter the catacombs since it would take days to get inside. However, Spinner had managed to enter the cairns within less than a day and was deemed the most suitable person for the job. As a grave robber in his earlier days, Spinner knew how to reach the Last Hope quickly. Takara then convinced him to also return to Tahv with both her mother and their uvak by presenting it as a chance for the former anarchist to redeem himself. While Kaliska was hesitant to trust the young man, Takara persuaded her to accompany Spinner and Iliana while the Sith princess herself remained behind to stop Dreypa. She remarked that as a Sith she was unwilling to let herself be controlled by fate. At that point, the group was attacked by one of Dreypa's Leviathans which had caught up with them."}, {"tag": "p", "text": "Spinner and Iliana were able to escape the scene on their uvak. Since the young man had never ridden an uvak before, he had to teach himself how to control the winged beast. Kaliska was unable to join them since she had been captured in one of the Leviathan's tendrils. Takara attempted to save her but it was too late since the beast had finished draining all her life energy and information. While Takara remained behind to delay Lord Dreypa, Spinner and Iliana arrived in Tahv. By then, news of Dreypa and his Leviathans had spread to the Tribe's seat of power which caused much fear and panic among the population. The Tribe rallied all its forces including Sith, Keshiri, and even slaves to meet this new threat. While Iliana was brought by a court official into the presence of her husband Varner, who was shocked by the effects of the Force-induced accelerated aging process on his wife."}, {"tag": "p", "text": "After the tenders had taken the uvak back into the palace stables, Spinner took the opportunity to slip away and enter the burial cairns. Within minutes, he made his way through the catacombs and found the Last Hope. However, he broke his promise to the late Kaliska to destroy and instead activated its engines, intending to escape Kesh for good by heading into hyperspace. The starship levelled part of the palace courtyard as it ascended into the skies above Tahv. Varner and Iliana witnessed his departure and the former commented that he could sense a change in Spinner's plans. The Last Hope's escape from the Tahv burial cairns damaged several buildings. Several Keshiri observers in the vicinity regarded the Last Hope as a great metal monster with a great eye that had a man guiding it. This man turned out to be Spinner."}, {"tag": "p", "text": "Since he was unfamiliar with the ship's controls, Spinner accidentally drove the vessel into Tahv's waterworks, disrupting the city's water supply. At that point, the starship's autopilot system activated and initiated its audio interface which was able to adapt to the Tribe's distinct dialect of Basic. With the autopilot engaged, the ship's computer asked Spinner about his course selection. He opted to go into the space above Kesh and the Last Hope complied. Within seconds, the vessel had emerged in the atmosphere above the planet. Spinner could immediately see the vast expanse of the Kesh system and marveled that the starship enable to see more to his homeworld than even the Sith Founder Yaru Korsin's ancient maps had enabled the Tribe to see. Spinner realized that Grand Lord Varner was right to send out explorers to explore Kesh."}, {"tag": "h3", "text": "From Anarchist to Hero"}, {"tag": "p", "text": "Having escaping Kesh, Spinner decided to test the ship's hyperdrive system and the ship's computer loaded its vast library of hyperspace coordinates and displayed a wide range of destinations. At first, Spinner thought that the winged woman Kaliska had been wrong to order the ship's destruction since he subscribed to the credo that it was a waste not to utilize the powers that one hand. Spinner was about to order the ship's hyperdrive to take him to the galactic capital of Coruscant when he was interrupted by his former ally Lord Dreypa who had used his own holo-emitter to activate the ship's hologram system. The Dark Jedi commented that the late Kaliska had been right to distrust the young Sith. He denounced Spinner as a snivelling slave who had stolen something he wanted. Dreypa explained that Kesh's magnetic field was limiting the range of the Last Hope which enabled him to transmit his ultimatum via his holo-emitter."}, {"tag": "p", "text": "Lord Dreypa then threatened to use his Leviathans to destroy Tahv unless Spinner returned the Last Hope. However, Spinner was undaunted by Dreypa's threats and claimed that he did not care about the fate of his own tribe since they had marginalized him since his birth. Dreypa then presented the captive Takara Hilts, his former foe who had become an unlikely ally after Dreypa turned on him. Hilts was in the grips of one of Dreypa's Leviathans after the Dark Jedi had beaten her in combat. After reading through the S'kytri woman Kaliska's memories, Dreypa found that Spinner had a weakness: he secretly loved and cared for the Sith princess. On the ship's intercom, Spinner tried to downplay his affection for Hilts by claiming that they were enemies. However Dreypa did not believe the young man's lies since he knew what Kaliska knew–that Spinner had earlier saved Takara by helping bring home her mother."}, {"tag": "p", "text": "Dreypa was sickened that the so-called \"Sith\" Tribe on Tahv cared about other sentient beings since it contradicted Sith credo that Sith adherents should only care about power. Finally, Dreypa offered to trade Takara and Kesh for the ship. He instructed Spinner to meet them in Tahv in exchange for allowing Spinner to rule the planet after his departure. Takara herself was enraged at being described by Dreypa as Spinner's weakness. In a fit of rage, she told Spinner to leave Kesh by claiming that no one on the planet cared about him and warned him not to return to the planet. Dreypa then ended the transmission with Spinner and left the youth to ponder his ultimatum. Ultimately, the Sith outcast was moved by Dreypa's ultimatum and realized the destructive and cruel tendencies of the Dark Jedi. He realized that he could not live with sacrificing his entire world to Dreypa's wrath and abandoned his desire to explore the galaxy."}, {"tag": "p", "text": "Spinner then headed back to Tahv and asked the Last Hope's computer to give him a quick tutorial on operating the vessel's weapon systems and tractor beam projector. Meanwhile, Dreypa's forces invaded Tahv and laid waste to much of the city, overwhelming the Tribe's garrison. The aged Iliana Hilts led her Sith Sabers in combat, reminding her men that they were the \"true Sith\" of the galaxy and that they should stand and fight for the tribe. Back at the Tribe's palace, her husband Varner began moving all of the Tribe's tomes into the vault. However, a Leviathan broke into the palace and pursued him. The monster was about to devour the elderly Sith Lord when Spinner's Last Hope arrived over the palace. Spinner then used the ship's tractor beam projector to drag the Leviathan into the skies. He then used the ship's turbolaser cannons to destroy the beast. Spinner also used the starship's intercom system to announce to the Grand Lord that he had come to help the Tribe."}, {"tag": "p", "text": "Spinner then killed several of the remaining Leviathans by strafing them with his turbolaser systems. His former foe Iliana and one of her Sith Sabers quickly recognized him and saw that he had joined their side. Iliana then ordered her men to run for cover before Spinner's turbolasers hit them accidentally or on purpose. Lord Dreypa was furious when he saw his pets being wiped out by Spinner's Last Hope. Soon, the Sith Lord was left with only one Leviathan and his hostage Takara who was still trapped in the beast's tendrils. Dreypa then ordered his Leviathan to leap on top of a tall building to meet Spinner and his starship. The Dark Lord repeated his ultimatum and threatened to murder the Sith princess. However, Spinner remained defiant and told the Sith Lord that he was going to send him back to his coffin in pieces."}, {"tag": "p", "text": "At that point, Takara used Force lightning to attack the massive Leviathan, beheading the monster. As the beast descended to its death, she and Dreypa leapt onto the hull of the Last Hope. Realizing that he had both Takara and Dreypa, Spinner took the starship on a fast spin to the Southern Ocean. Due to its advanced engine systems, the vessel reached the shores of Keshtah within seconds. Spinner then stopped the vessel and hovered over the ocean before opening the cockpit's canopy. He claimed that he was ready to deal with the Sith Lord and apologized for destroying his monstrous \"critters.\" He offered the Sith Lord the opportunity to leave Kesh for good in return for taking his deal to rule the planet. However, Dreypa threatened to kill both Spinner and Takara for the trouble they had caused him. Before he could kill them Spinner grabbed Takara and they jumped from the vessel into the ocean below."}, {"tag": "p", "text": "However Spinner had earlier reset the ship's computer to take the vessel on a one-way course into Sessal Spire's caldera. To prevent Dreypa from changing the ship's course, he had the course program locked. As planned Dreypa re-entered the ship's cockpit and strapped himself into the seat. At first Dreypa gloated over his escape from death and tried to set the ship on a course for Coruscant. There, he intended to seek vengeance against the Galactic Republic and the Jedi Order. However the ship's computer announced that the vessel was set on a one-way course into Sessal Spire's caldera. Dreypa was unable to alter the ship's course since Spinner had tampered with the controls. Thus, the Dark Jedi was trapped in a metal death trap as the vessel crashed into the volcanic crater. With that, both the Sith Lord and the Last Hope, the only means of getting offworld on Kesh, were destroyed. Dreypa's death ended a major threat to the Lost Tribe's existence and prevented any knowledge of Kesh from reaching the wider galaxy."}, {"tag": "h3", "text": "New Beginnings"}, {"tag": "p", "text": "Meanwhile, Spinner and Takara survived the fall and swam back to the shores. Spinner was pleased that his crafty plan had ridden Kesh of Dreypa's threat and commented that his actions were not too bad for a beginner Sith. Initially, Takara scolded him for destroying the Last Hope which the Tribe could have used to get off the planet. However, she expressed her amazement that Spinner had the power to leave Kesh forever but had decided not to. She asked Spinner what kind of Sith he was. Spinner sarcastically remarked that he was just a vandal and that wrecking things was his expertise. Finally, he added that he was the best vandal that Kesh had ever witnessed. Through their shared adventures and experiences, the two Humans overcame the previous animosity they had towards each other and fell in love with each other. The two Sith were later rescued by the Tribe and brought back to Tahv which had already begun a long process of reconstruction."}, {"tag": "p", "text": "Grand Lord Varner Hilts himself was pleased with Spinner for choosing to save Tahv rather than fulfilling his own desires to escape the planet even if it mean sacrificing the only means of getting off world. Varner met Spinner at the site of the ruin palace and jokingly asking whether the youth still wanted to kill him. However, Spinner had abandoned his homicidal plans of killing the Grand Lord. He then asked Hilts if the assignment to Eshkrene had not just occurred by chance. He also asked the Grand Lord if he had somehow suspected that people were living in the South Pole. Hilts admitted that he had theorized that other people had preceded the settlement of the Lost Tribe since he was perplexed at the ease by which the ancient Keshiri had accepted his forebears. Hilts also remarked that if the mythical Protectors and Destructors had indeed existed, the Tribe would have been unable to match their powers."}, {"tag": "p", "text": "Spinner then asked why the Grand Lord had not sent members of his own Tribe to explore Eshkrene. Hilts explained that his compatriots would have used the Dreypa's oubliette for political gain to threaten the Tribe. Instead, he had dispatched slaves like Spinner and lowly Keshiri explorers to Eshkrene because he knew that the Sith outcast would misuse what he had found. However, that would have united the Tribe against him. He confessed that he had not expected his own daughter Takara to have gone with Spinner but admitted that her presence had led to a good outcome for the tribe. Since the Doomed had sacrificed their lives in a desperate effort to defeat Dreypa, none of the ancient settlers' descendants had survived. A second exploration team dispatched to Eshkrene by the Tribe discovered that little remained of their settlement since it had only been preserved from the elements by their sheer Force will."}, {"tag": "p", "text": "Spinner privately admitted to Hilts that he had wished the Doomed had left another starship. However, Varner disagreed since he believed that the Tribe was not ready to interact with the wider Galaxy due to their disunity. In the past, Iliana had used to managed the various elements in the Tribe but her weakened state meant she could no longer fulfill that role. Due to the recent political turmoil, the Grand Lord now needed an agent who would act on his behalf. He preferred a political outsider like Spinner who had no political ambitions of succeeding him. Instead, Spinner would become the Grand Lord's Hand, his personal hatchet-man. Initially, Spinner was reluctant to consider the offer since he did not want to become someone's slave and to prop up a system which he disliked. However, Hilts managed to convince him that as a Sith, Spinner belonged to the tribe and that his destiny was with the Tribe."}, {"tag": "p", "text": "He also praised Spinner's family for bringing them closer to the stars through their elaborate tapestries. While the other Sith families had been squabbling for the past millennium, he reasoned that Spinner's family had been doing something productive with their lives. The Grand Lord commented that a spinner like Hilts knew how to merge opposing strands into a strong rope and believed that was the youth's destiny. Sensing that the youth had a desire to rule the Tribe, he exhorted Spinner to make sure that the tribe survived so that he could gain control over it."}, {"tag": "p", "text": "After the meeting, Spinner was joined by his former–enemy–turned–lover Takara Hilts who expressed her surprise that he had not been put in chains. By then, the Sith princess Takara had washed herself and changed into new garments. By contrast, Spinner remained in the same clothes he had worn for the past few days and had not cleaned himself. Spinner joked that he was lucky that the planet did not have enough metal to make chains and explained that he had been put in charge of the rebuilding effort. Hilts commented that she was pleased he had found something he liked."}, {"tag": "p", "text": "During a private conversation in the palace gardens, Spinner explained that the Grand Lord had offered him the position of becoming his new Hand but that he had to think about that offer. Hilts explained that her father had in the past offered her the same position but she had not opted for it. She also warned him about being careful in his dealings with the various Lords before suggesting that the youth pay attention to his personal hygiene by bathing himself. Spinner jokingly warned her to respect his new celebrity status as the hero who had saved Tahv. The young man was jubilant about his newly-found opportunity of working for the Tribe which would allow him to lift his own social status. The two Hilts parents were observing the warm budding relationship between the two former enemies. The Grand Consort Iliana had earlier eavesdropped on Varner's conversation with Spinner and was sceptical about appointing an outsider as his own special agent while overlooking their own daughter Takara."}, {"tag": "p", "text": "In response, Varner assured his wife that it was likely that both Parlan and Takara would become his own personal Hands. Despite the rehabilitation of Parlan Spinner's status within the tribe's hierarchy, it remains unknown if the Grand Lord also made efforts to rehabilitate the social standing of the Spinner family, who had been made outcasts for millennia. It can be assumed that Spinner and Takara would go on to develop a close romantic relationship."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Due to his impoverished background, Parlan Spinner was an opportunistic and cavalier person. He was willing to exploit any situation or opportunity that best served his interests. His decision to align himself with the Dark Jedi Remulus Dreypa was motivated by a desire to settle scores with the ruling Lost Tribe and to improve his own social standing. By the climax, he considered accepting Grand Lord Varner Hilts' offer to make him one of the Grand Lord's Hands, an elite secret agent in the service of the Tribe. Despite this, Spinner was still sometimes willing to risk his life to save others. His decision to rescue his former enemy Takara Hilts and her mother Iliana Hilts was motivated by both romantic feelings for the Sith princess and his rejection of Dreypa's vision of using Leviathans to destroy his world."}, {"tag": "p", "text": "Spinner also exhibited a strong disdain for tradition and authority figures which led him to embark on a spree of vandalism and crime throughout his youth. Spinner's hatred of the Lost Tribe of Sith dated back to his childhood. He blamed the ruling elites in Tahv for reducing his family to the status of slaves after one of his ancestors Ermon Parrah tried to steal the Omen millennia earlier. This cavalier attitude dated back to his prepubescent years when he defaced a statue of the Tribe's founder Yaru Korsin at the age of eleven. By 2974 BBY, this irreverence had escalated into an assassination attempt on Grand Lord Hilts, the theft of the Doomed's \"Great Weapon, and the destruction of the Last Hope during the Siege of Tahv."}, {"tag": "p", "text": "Despite Spinner's anarchist beliefs and disdain for tradition, Lord Hilts saw that Spinner had much potential and decided to spare the youth's life rather than executing him. His wife Iliana disagreed and saw him as a threat to the Tribe's existence. Later, relations between Spinner and the Hilt parents improved due to his role in saving their lives and the Tribe from Dreypa. During their adventures, Spinner's relationship with Takara evolved from one characterized by mutual hatred to cooperation when faced with a common foe. Finally, the couple developed romantic feelings for each other. Spinner was attracted to the Sith princess's beauty while Takara was indebted to Spinner for saving both her and her mother from being devoured by a Leviathan."}, {"tag": "p", "text": "The S'kytri Doomed leader Kaliska regarded him as an irreverent and opportunistic coward who was willing to switch sides to save his own skin. While she, Spinner and Takara agreed to destroy the Last Hope, Kaliska was unwilling to trust Spinner and offered to accompany the Sith anarchist to Tahv. Later, her suspicions were proven right when Spinner attempted to use the starship to escape Kesh. However, his feelings for Takara led him to return to Tahv and stop Dreypa."}, {"tag": "p", "text": "Spinner had an acrimonious relationship with the Dark Jedi Dreypa, who was only willing to used the Sith anarchist to serve his own means of escaping Kesh. As one of the early founders of the Sith, Dreypa only served himself and was disgusted that the Keshiri Sith had deviated from classical Sith teachings by caring for others. Dreypa also shared Kaliska's assessment that Spinner was an opportunistic individual who could not be trusted. Dreypa was further disgusted that Spinner had risked his own life to rescue his former enemies Takara and Iliana from death. While Spinner was unable to match Dreypa's dark side powers, he made up for this with his cunningness. In the end, Dreypa died after being lured back into the Last Hope which then crashed into Sessal Spire."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "During his teenaged years, Parlan Spinner learnt how to wield the shikkar blade and minlohku, the art of throwing glass darts. These martial skills were further augmented by Spinner's Force-sensitivity. While a dark side user who was the descendant of ancient Sith, Spinner was not known to have received any formal instruction in the Sith ways. However, he was able to wield a Sith lightsaber on a few occasions. It is also likely that he received further instruction after joining the Grand Lord's Hands."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Parlan Spinner was first developed by John Jackson Miller as one of the two major protagonists of the Star Wars: Lost Tribe of the Sith comic series, which debuted on August 8, 2012. This five-issue comic series ran until December 12, 2012. He was also illustrated by Andrea Mutti, inked by Pierluigi Baldassini, and then colored by Michael Atiyeh. He along with the Lost Tribe princess Takara Hilts served as one of the two main point-of-view characters. According to Miller's production notes, he envisioned Spinner as a cross between a vandal and a revolutionary with deluded ambitions of being a \"master-criminal.\" Miller also wanted use Spinner's origins as a slave to explore the Human slave caste within the Lost Tribe's society, which served as a control mechanism for recalcitrant members of the Tribe. Miller surmised that Spinner rejected his calling as a slave while the rest of his family kept on weaving even during the dark ages. He also added that Spinner's decision to return to Kesh despite discovering a way offworld was fuelled by a desire to prove to Takara that he was not who she thought he was. For Miller, defiance was a Sith trait even though it could be used for a benevolent cause."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}