{"url": "Attack_on_the_Steady_Wing", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Events during the High Republic Era"], "nodes": [{"tag": "h1", "text": "Attack on the Steady Wing"}, {"tag": "p", "text": "The attack on the Steady Wing, also known as the destruction of the Steady Wing or the Steady Wing massacre, occurred shortly after the Great Hyperspace Disaster, when the Galactic Republic starship Steady Wing was bombed by undercover Nihil saboteurs Gwishi and Klinith Da. Disguised as mechanics, the two pirates had been sent to sabotage Republic expansion into the Dalnan sector, as a Dalnan diplomatic party was traveling aboard the Steady Wing to the dedication ceremony of the Starlight Beacon space station. The chaos of the bombing led a young party comprised of Jedi Knight Vernestra Rwoh, her charge Avon Starros, Starros' droid J-6, Padawan Imri Cantaros, and Honesty Weft, the son of the Dalnan ambassador, to evacuate in a shuttle, subsequently becoming stranded on the jungle moon Wevo. The Steady Wing was destroyed shortly after their escape, killing everyone onboard."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Dalna, a planet in the Dalnan sector of the Outer Rim Territories, was inhabited by the Dalnan civilization. Mistrustful of space travel, the Dalnans were not members of the Galactic Republic. Around 232 BBY, Republic expansion in the Outer Rim was taking a major step forward with the opening of the Starlight Beacon space station, intended as a central hub for Republic and Jedi operations on the galaxy's fringe. The Dalnans began to show interest in joining the Republic, and a diplomatic delegation led by Ambassador Weft departed Dalna for Haileap on the edge of the sector, where they would board the cruiser Steady Wing, dispatched by Supreme Chancellor Lina Soh, for transport to the Beacon, where they would attend its dedication ceremony. Weft was accompanied by a party consisting of humans, Pantorans and Trandoshans that included Janex, Starstriker, and Weft's son Honesty."}, {"tag": "p", "text": "At the same time, the Nihil, a pirate group with unusual and secretive means of hyperspace travel, were becoming an increasing threat in the Outer Rim. The aftermath of the Great Hyperspace Disaster, in which the freighter Legacy Run had disintegrated in hyperspace due to a near-collision with a Nihil Stormship, sending its debris flying all over hyperspace, only emboldened them. The Nihil wanted to prevent the Republic from expanding into the Dalnan sector. To that end, Strikes Gwishi and Klinith Da were dispatched to Port Haileap in a stolen cargo hauler by the Storm Kara Xoo, ordered to sabotage the Steady Wing and destroy any negotiations."}, {"tag": "h2", "text": "The attack"}, {"tag": "h3", "text": "Saboteurs"}, {"tag": "p", "text": "Gwishi and Da landed at Port Haileap in their stolen ship and infiltrated the Steady Wing disguised as mechanics. The Republic guards watching the boarding ramp let them on without paying them any attention as they were laughing about something. Making their way inside, the two pirates proceeded to an intersection where there was a map displayed on the wall. Gwishi pointed out the location he was heading for, planning to leave some \"surprises\" for the crew, and told Da to sabotage the escape pods. After puzzling out the pods' location on the map, Da made her way to the escape pod bay on another deck, where she was confronted by a maintenance droid which asked her if she was there to sign off on them. She claimed she needed to upgrade them by removing the comms and navigation systems, to which the droid stated that it needed to update its feeds to receive new instructions. Da grabbed a large hydrospanner mounted on the wall of the bay and used it to smash the droid to pieces."}, {"tag": "p", "text": "Over the course of their sabotage, in addition to taking out the escape pods, the pirates planted bombs onboard the ship. A maintenance shuttle parked in an onboard hangar had multiple systems sabotaged, including its comms, hyperdrive and deflector shields. While the sabotage was ongoing, the passengers began to board the ship, including the members of the Dalnan delegation. Boarding the ship with Avon Starros, the daughter of a Republic Senator who was being brought along in the hopes that she would befriend Honesty Weft, Jedi Knight Vernestra Rwoh saw Gwishi among a group of mechanics doing maintenance, and received an unsettling feeling about him through the Force. Attributing the \"spiky\" sensation to nerves, Rwoh attempted to put it out of her mind and continued aboard. Ambassador Weft and his son encountered an undercover Da while walking to their room after a tour of the spaceport, and she greeted him to maintain her cover. Da later collided with J-6, Starros' personal droid, and was knocked to the floor. The pirate's magenta hair and elaborate lip piercing caught Starros' attention, but after a minor but heated exchange about minding one's manners and watching where one was going, Da departed and the girl and droid quickly put the encounter out of their minds. Once they were done, Da and Gwishi disembarked from the Steady Wing before it took off from Haileap."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "Due to the aftereffects of the recent Great Disaster, the Steady Wing did not immediately jump into hyperspace after leaving Haileap. Instead, it was to travel through the Haileap system at sublight speeds to a safe entrance point, which would add at least a day of travel time. After taking off from Haileap, the Steady Wing journeyed through realspace for a time, still having not entered hyperspace by the time Rwoh met Jedi Master Douglas Sunvale and the Dalnan delegation in the smallest of the cruiser's six dining areas."}, {"tag": "p", "text": "Discussing the journey ahead, Ambassador Janex expressed concern over the possibility of the Steady Wing being struck by an Emergence of the debris from the Great Disaster. However, Sunvale stated that the journey would be as safe as possible. Avon arrived, and with everyone sitting down, the serving droids were starting to set out the meal when the cruiser shook as the bombs went off, Janex wondering if it was a piece of debris. Sunvale, realizing that something was wrong, used the Force to hold everyone into their seats as Rwoh felt a disturbance in the Force from the fear and panic of everyone else on the ship. After several large crashes in quick succession, alarms began blaring as the roof of the dining room ripped off, exposing it to space. Sunvale used telekinesis to hold everyone in their seats, preventing them from floating off, but the emergency bulkhead was obstructed by debris before it had closed all the way, and the room's door slammed shut, trapping the group."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}