{"url": "Attack_on_the_Trade_Federation_Research_Station", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Invasion of Naboo"], "nodes": [{"tag": "h1", "text": "Attack on the Trade Federation Research Station"}, {"tag": "p", "text": "This attack was launched by the Royal Naboo Security Forces after receiving intelligence about a Trade Federation Research Station. The Research Station was working on creating a new type of battle droid. A commando raid captured the research station, and Lieutenant Gavyn Sykes provided air support while the data were downloaded. After Federation reinforcements joined the battle, the commandos were evacuated."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the invasion of their home planet, the forces of Naboo kept on their guard and watched the actions of the Trade Federation. They launched an attack on a research station to uncover its secrets."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "After the Naboo commandos captured the facility, the Trade Federation launched reinforcements in the form of a C-9979 landing craft and droid starfighters. Lieutenant Gavyn Sykes, the sole Naboo pilot, engaged the initial Federation forces while flying his N-1 starfighter."}, {"tag": "p", "text": "He strafed the six approaching Armored Assault Tanks, thinning their ranks. The Multi-Troop Transport was destroyed before it could disgorge its complement of B1-Series battle droids. As the data theft continued, the Trade Federation continued to harass the Naboo defenders using STAPS and more droid starfighters. Sykes destroyed many forces, but eventually the superior numbers took their toll and the Research Station began to crumble, even with laser turret defenses."}, {"tag": "p", "text": "When the data completed its download, the commandos called for their Consular-class cruiser to evacuate them. The ship landed on the base as the soldiers climbed aboard. With the survivors gathered together, the ship lifted off. A number of droid starfighters began to chase the escaping cruiser, but Sykes escorted the ship to a safe distance."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "When Naboo technicians analyzed the data, they discovered the Trade Federation was creating a new type of super battle droid. They knew they had to keep track of further developments."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack is the first bonus mission of the 2000 video game Star Wars: Episode I: Battle for Naboo, unlocked through the use of cheat codes or by achieving bronze medals on all regular campaign missions. It is not necessary to destroy all Trade Federation forces, but this article assumes the player did so. There is a security hangar near the facility to change starfighters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}