{"url": "Parcovey_Minor", "categories": ["Category:Legends articles", "Category:Hune sector planets"], "nodes": [{"tag": "h1", "text": "Parcovey Minor"}, {"tag": "p", "text": "Parcovey Minor was a planet considered part of the outlying domains of the Hutt species during the time at which the world was settled during the Kymoodon Era."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The colonists who settled the world and set up ranches there were from the Galactic Republic and not associated with the Hutts. This lead to the Hutt Utoradii kajidic backing an assault on the world in order to enslave its new population. Details of the planned attack however were passed to the Free Volunteers of the planet Belasco by a captured Jilruan pirate, and the Volunteers raced to defend Parcovey Minor. Arriving before the Hutt forces, the Volunteers ambushed and defeated the Hutts' Weequay and Klatooinian mercenaries when they arrived, and were able to learn of the Utoradii's involvement by interrogating mercenaries who survived the battle. A group of local militia and the Volunteers then took the mercenaries shuttles to the world of Affavan where the slaves from the assault where meant to be delivered. There they exacted revenge upon the Hutts behind the assault."}, {"tag": "p", "text": "A record of the assault on Parcovey Minor was included in a report designed to act as an advisory against colonisation of Rimward systems compiled by the Republic. In 114 BBY, an episode of the holodrama series True Tales of the Ancient Republic was created based around assault on Parcovey Minor. The episode, titled Episode XXIV: Death on the Rim, gave a fictionalised account of the assault, detailing Parcovey Minor as a small green world of nerf ranchers and including a Sector Ranger named Novan Nune, who served as the shows hero in place of the Free Volunteers. In 6 ABY, after the discovery of the report on Rimward colonisation at a Kymoodon-era government archive on Belasco, the Academician of Popular Studies Thunys Albegron spoke about the assault on Parcovey Minor and its representation in True Tales of the Ancient Republic at the Conference on Popular Entertainment on the planet Obroa-skai."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Parcovey Minor was first mentioned in the 2014 fifth entry in the Star Wars: The Essential Guide to Warfare Author's Cut series of posts by Jason Fry on the StarWars.com blog. The article featured content cut from The Essential Guide to Warfare a book released in 2012 by Fry."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}