{"url": "Parkanas_Tark", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Articles with gameplay alternatives", "Category:Humans", "Category:Jedi of the Jedi Order", "Category:Males", "Category:Redeemed Jedi", "Category:Sith Lords of the reconstituted Sith Empire"], "nodes": [{"tag": "h1", "text": "Parkanas Tark"}, {"tag": "p", "text": "Parkanas Tark was a male Human Jedi who lived during the Great Galactic War and the Cold War. Left behind during an expedition to Malachor III, he came under the sway of the spirit of the ancient Sith Lord Terrak Morrhage and fell to the dark side, adopting the name Lord Vivicar. Years later he would return to Republic space to get revenge upon the Jedi Order. His plans failed due to the actions of a Jedi Consular sent to stop him."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi Padawan"}, {"tag": "p", "text": "As a Jedi Padawan, Tark was the youngest of an expedition sent to Malachor III. Other members of the expedition included Yuon Par, Duras Fain, Eriz Vossan, Sidonie Garen and Cin Tykan. During their exploration of the planet, these Jedi stirred the ancient spirit of Terrak Morrhage, who had been entombed on the planet for centuries. Despite his youth, Tark refused to be influenced by the spirit while the other members succumbed to Morrhage's influence, and, as a result, indulged in their urges and become paranoid. When they realized what was happening, Sidonie Garen formulated a tactical plan to escape, but Tark was trapped after rescuing Eriz Vossan. Now left behind on the planet, Parkanas Tark was prey for Morrhage's power."}, {"tag": "h3", "text": "Cold War"}, {"tag": "p", "text": "What happened during the years between the mission to Malachor Three and Tark's return is unknown. When Tark returned, little was left of his original self. While his former friends had emerged as Jedi Masters, Tark found his own mastery in darkness. Taking the name Vivicar, he had learned the secrets of Morrhage's Force plague. This dark technique induced madness into those that Lord Vivicar had known and caused them to become puppets of the Sith Lord, including Duras Fain's daughter, Laranna. As his influence spread across the members of his former team, a young Jedi Consular emerged to challenge Lord Vivicar. A Padawan of Yuon Par, this young Consular learned an ancient shielding-technique which could free any under Lord Vivicar's influence. It was later used to free the Jedi Masters from Lord Vivicar's control and made the Consular immune against the plague."}, {"tag": "p", "text": "The Consular searched the galaxy for affected Jedi Masters and freed them one by one from Lord Vivicar's control. After shielding Laranna, the Consular received a holo-call from Vivicar, who taunted that more Masters would become affected by his plague, and that the Consular would die like the last Jedi who wielded the shielding technique, spent from shielding so many. The conflict against Lord Vivicar ended when the Jedi traced Lord Vivicar to his ship in Hutt Space. Here, Yuon's former apprentice made a startling discovery: Lord Vivicar was Parkanas Tark controlled by Morrhage's spirit. With no choice, the Consular and Morrhage fought in a brutal duel. The Consular took the upper hand and injured Morrhage. However, if Vivicar dies, then all the Jedi that he infected will die. The Jedi Consular immediately redeems Lord Vivicar as Parkanas Tark, expelling the spirit of Morrhage out of his body. Parkanas, now free from Morrhage's corruption and returned to the light side, promised to return to Tython, but he wouldn't return to the Jedi Order for everything he'd done. He decided to remain an exile and go find Tython's hidden places where he could remain in peace. But before parting ways, Parkanas left a dark promise that the Jedi and Republic would abandon the Consular. After saving Parkanas Tark, the Consular returned to the Jedi High Council and was granted the rank of Jedi Master and the title of Barsen'thor for the actions against Lord Vivicar."}, {"tag": "h2", "text": "Powers and Abilities"}, {"tag": "p", "text": "A promising Jedi Padawan, Tark emerged as a powerful Sith Lord with the impressive ability of using Terrak Morrhage's Force-plague. Using it he managed to corrupt Jedi Masters across the galaxy and even managed to seize control of them at times. But Vivicar's powers extended further than mind-control. He was proficient in the usage of a lightsaber and could also use the Force-leap ability. Also during combat he could use an immensely powerful Force-crush that had the potential to kill instantly."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vivicar is the final boss in Chapter 1 of the Jedi Consular storyline in Star Wars: The Old Republic MMO. The fate of Vivicar and the Jedi Masters that he corrupted depends on player action,. For the light side option, the Consular spares and frees Parkanas from Terrak's possession. For the dark side option, the Consular would kill him, which would result in the deaths of all of the affected Jedi Masters as well (if the Consular had not already taken the dark side option with each Master and killed them beforehand)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}