{"url": "Parvin_Willsaam", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Alderaanians", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Parvin Willsaam"}, {"tag": "p", "text": "Parvin Willsaam was a female Human who was also the wife of Gregor Willsaam and the mother of Jaesa Willsaam."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Great Galactic War between the Galactic Republic and the Sith Empire, Parvin lived with her husband and daughter as servants to the House of Organa on Alderaan. A few years after the Treaty of Coruscant, it was discovered that her daughter was force-sensitive and Jedi Master Nomen Karr selected Jaesa as his apprentice. However, it was said that Parvin and Gregor wanted Jaesa to marry the Organas in order for them to be free, but their efforts failed."}, {"tag": "p", "text": "During the Cold War, Darth Baras secretly discovered Jaesa Willsaam's power to sense other people's true nature and believed that she was a threat to him and the Empire. He sent his apprentice to eliminate everyone that stood for Jaesa and lure the young Jedi out of hiding. The apprentice discovered that Jaesa's parents were located in Gesselle Organa's castle on Alderaan."}, {"tag": "p", "text": "Parvin and Gregor were under the protection of Jedi Master Volryder who was assigned by Jedi Master Nomen Karr to protect them from the Sith. Volryder quickly realized why the Sith had come for Jaesa's parents and warned Parvin and her husband about the cause of the attack. The Sith apprentice only wanted Parvin and Gregor to deliver a message to their daughter and the message was killing them in order to draw Jaesa out of hiding in order to eliminate her as a threat. Parvin and Gregor were killed by the Sith apprentice by Force-choking them in front Volryder's eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith Warrior has two options. In the light side option, he/she would convince the parents to join the Empire and spare them, and letting Volryder leave; that way, if the Warrior would tell Darth Baras of his/her sending the parents to him, the option of either torture or letting them bask in Imperial luxury would tip Jaesa off-balance. In the dark side option, the Warrior kills them and faces Volryder."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}