{"url": "Parsec/Legends", "categories": ["Category:Legends articles", "Category:Units of length measurement"], "nodes": [{"tag": "h1", "text": "Parsec"}, {"tag": "p", "text": "A parsec was a unit of distance equal to 3.26 light-years. The system used by starship navigators throughout the galaxy to record the location of star systems was based on parsecs, with one unit on the coordinate scale corresponding to 15 parsecs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the real world, a parsec is a measurement of distance based on apparent stellar motion as observed from Earth. It is defined as 360×60×60/2π astronomical units (AU), which is equivalent to about 19.17 trillion miles, or about 3.262 light-years."}, {"tag": "p", "text": "The Star Wars parsec appears to be equivalent to the real-world measurement: The Essential Atlas says a parsec is 3.26 light-years. The \"Decoded\" version of the Star Wars: The Clone Wars episode \"Dooku Captured\" says that six parsecs equals about 114 trillion miles, making one parsec about 19 trillion miles."}, {"tag": "p", "text": "If the Star Wars galaxy is similar in size to ours, roughly 30,000 parsecs across, elementary arithmetic shows that any ship capable of traveling across the galaxy in only a few weeks could travel about a parsec per minute. However, in The Courtship of Princess Leia, it takes more than a week to travel only seventy parsecs (the stated distance between Dathomir and Coruscant), and in Attack of the Clones, it seems to take many hours to travel the distance between Tatooine and Geonosis, which is stated to be less than a parsec. However, the map Amidala shows Anakin while talking about the distance only seems to zoom about tenfold from the entire galaxy, implying that either the Star Wars galaxy is very small (which seems unlikely, since no night sky seems to show the huge numbers of visible stars that would be consistent with the corresponding smaller interstellar distances), or Amidala misspoke. The latter is statistically more likely, since the odds of two random planets in the galaxy being within a parsec of each other are about one in a hundred billion."}, {"tag": "h3", "text": "A New Hope error?"}, {"tag": "p", "text": "In Star Wars: Episode IV A New Hope, Han Solo boasted about the speed of his spaceship by claiming it made the Kessel Run in less than twelve parsecs, despite a parsec being a unit of distance. (In the novelization, he said, \"less than twelve standard timeparts.\") Screenwriter George Lucas claimed the seeming gaffe was intentional, showing that Han was something of a bull artist who didn't always know precisely what he was talking about."}, {"tag": "p", "text": "Within the Expanded Universe, Kevin J. Anderson later retconned an explanation: the Kessel Run is through the Maw. Event horizons around black holes are dependent on the speed at which you are traveling. A standard ship has to do the run in eighteen parsecs because to cut the route any closer, the ship would get sucked in."}, {"tag": "p", "text": "The Falcon, however, is fast enough to straighten the route and cut over six parsecs off the distance traveled."}, {"tag": "p", "text": "The director's commentary on the Blu-Ray Star Wars set explains that hyperspace travel requires heavy computation to compute a path that does not cause you to fly through a star. The Millennium Falcon has customized computation engines that calculate shorter hyperspace paths more quickly than those in other ships. Shorter distances mean faster travel times. The Falcon reduces travel times by a combination of being faster in a traditional sense, and by using more accurate navigation calculations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}