{"url": "Pasha", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Pages needing citation", "Category:Character stubs", "Category:Humans", "Category:Jedi Knights", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Pasha"}, {"tag": "p", "text": "Pasha was a Human Padawan who went to Jedi Academy. His home world was Obroa-Skai. His father worked at the Obroan Institute for Archaeology. Pasha was a skilled lightsaber duelist. He had a girlfriend at Jedi Academy called Shi-Fara. Pasha was one of the first students befriended by Roan Novachez and currently his best friend at Jedi Academy."}, {"tag": "p", "text": "Pasha excelled at lightsaber combat and during Pasha's second year of attendance, he won a Lightsaber Fencing Tournament, beating Roan whom he had drifted apart from him due to Roan's liking towards Cronah and Cyrus. He was also close to defeating Cyrus in another lightsaber battle. He eventually became friends with Roan again after Roan apologized."}, {"tag": "p", "text": "In his third year, Pasha trained personally with a Jedi Master, but failed to find his focus. He joined Roan in the Obstacle Course, being on his team for the event. He also bypassed the labyrinth that was the final test, arriving at the finish a little while before Roan.\nPasha grew up and became a Jedi Knight. In 162 BBY, he visited the Academy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Pasha was born on Obroa-Skai. His father worked at the Obroan Institute for Archaeology."}, {"tag": "h3", "text": "Jedi Academy"}, {"tag": "p", "text": "Pasha was a skilled lightsaber duelist. He had a girlfriend at Jedi Academy called Shi-Fara. Pasha was one of the first students befriended by Roan Novachez and currently his best friend at Jedi Academy."}, {"tag": "p", "text": "Pasha excelled at lightsaber combat and during Pasha's second year of attendance, he won a Lightsaber Fencing Tournament, beating Roan whom he had drifted apart from him due to Roan's liking towards Cronah and Cyrus. He was also close to defeating Cyrus in another lightsaber battle. He eventually became friends with Roan again after Roan apologized."}, {"tag": "p", "text": "In his third year, Pasha trained personally with a Jedi Master, but failed to find his focus. He joined Roan in the Obstacle Course, being on his team for the event with Shi-Fara, Gaiana, and Roan. He also bypassed the labyrinth that was the final test, and engaged Cyrus again halfway through the maze. He arrived at the finish shortly before Roan did."}, {"tag": "h3", "text": "Later life"}, {"tag": "p", "text": "In the years that followed, Pasha grew up and became a Jedi Knight. In 162 BBY,[source?] he visited the Academy and Yoda introduced him to several students, including Victor Starspeeder."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pasha first appeared in the non-canon junior novel Jedi Academy by Jeffrey Brown."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}