{"url": "Parrah%27s_rebellion", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Battles of Kesh"], "nodes": [{"tag": "h1", "text": "Parrah's rebellion"}, {"tag": "p", "text": "Parrah's rebellion occurred at some point between the Red Sith Purge in 4985 BBY and Seelah and Jariad Korsin's attempted coup d'état in 4975 BBY. During the rebellion, the Lost Tribe's former navigator and chief science officer Ermon Parrah led a failed attempt to steal the crippled starship Omen, the starship which had brought the Tribe's ancestors to Kesh, so that they could leave the planet and return to the wider galaxy. However, they were defeated by the Lost Tribe's leadership who enslaved most of the surviving rebels. Meanwhile, Parrah and his family were reduced to a state of permanent servitude and were ordered to spin a cord that would reach the stars."}, {"tag": "p", "text": "Since this task was physically impossible, Parrah and his descendants were unable to reach the stars and improve their social standing. For millennia, Parrah's descendants worked as tailors and weavers in the port town of Eorm. Due to their occupation, they became known as the Spinner family. Due to the strong stigma attached to their punishment, Parrah's descendants adhered to this ancient edict even during the anarchic Time of the Rot. Following the Hilts Restoration, the Sith anarchist Parlan Spinner became the first in his family line to rebel against this edict. He became the leader of a gang of outlaws known as \"Spinner's Web\"."}, {"tag": "p", "text": "Spinner's actions eventually attracted the attention of the Sith authorities and he was apprehended in 2974 BBY. However, the ruling Grand Lord Varner Hilts decided to give Spinner a second chance working as a crew aboard the sailing ship Southern Star. Spinner would set in motion a chain of events that led to the return and defeat of the ancient Sith Lord Remulus Dreypa. Due to his role in the Siege of Tahv, Spinner became regarded by the Tribe as a hero and joined the Tribe as a Grand Lord's Hand. It is unknown if other members of the Spinner family had their social status improved."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Parrah's rebellion was used as a plot element in John Jackson Miller's 2012 stand-alone comic Star Wars: Lost Tribe of the Sith—Spiral. It appeared in the third issue of that comic, which was released on October 10, 2012. According to an email exchange with Miller that was dated back to October 20 2013, Ermon Parrah was the same Parrah who was the relief navigator and main science advisor aboard the starship Omen. He also clarified that Parrah's rebellion had occurred at some point between the events of the two eBooks Paragon and Savior, since the comic Spiral 3 depicted the Kesh Sith Temple, which was sealed off after the events of Savior."}, {"tag": "p", "text": "Miller has also argued that the Lost Tribe of Sith did not kill Parrah because the Tribe was running out of Humans by that time. According to Miller, the script for Spiral 3 had initially conceptualized Parrah's older opponent as being an older Yaru Korsin. Ultimately, Miller and his team opted not to name him on the page since he did not resemble the older version of the character in Pablo Hidalgo's The Essential Reader's Companion, which was released on August 21, 2012. Thus, Miller speculates that the man fighting Parrah was actually one of Korsin's allies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}