{"url": "Partisans", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Partisans"], "nodes": [{"tag": "h1", "text": "Partisans"}, {"tag": "p", "text": "The Partisans, also referred to as Saw Gerrera's militia, and Saw Gerrera's rebels were a militant insurgent group and rebel cell who enacted armed campaigns against the Galactic Empire during the Imperial Era. Led and founded by Saw Gerrera in 19 BBY, the Partisans played a part in destabilizing Gerrera's homeworld of Onderon from the Empire's occupying forces and eventually became allied with first the rebellion, and later, the Alliance to Restore the Republic. However, some, like Rebel Alliance founders Mon Mothma and Bail Organa, distanced themselves from Gerrera's faction due to their willingness to resort to extreme tactics, such as torture and attacks on civilian targets. By 0 BBY, the militia had very little communication with the mainstream Alliance, and Gerrera's militia besieged the holy moon of Jedha with the intentions of purging the Imperial occupation. However, the campaign took a major blow with the destruction of the Holy City by the Imperial Death Star battle station's superlaser, and the death of Saw Gerrera himself."}, {"tag": "p", "text": "The Partisans were also responsible for enough attacks resulting in civilian casualties that the Galactic Empire in response made a propaganda poster denouncing the Rebel Alliance as a terrorist group. The campaigns of the Partisans were later mentioned by New Republic Senator Ransolm Casterfo as an example of the Rebels' so-called terrorist tactics during the war, and also demanded of Leia Organa to know if she condoned it or not, with Leia simply saying he did what needed to be done without saying either way regarding her views on the matter."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "Following Onderon's Civil War and the Galactic Republic's transformation into the Galactic Empire Saw Gerrera reorganized the Onderon rebels into the Partisans. Wilhuff Tarkin sent Clone Force 99 to eliminate them, claiming they were a Separatist remnant, but they disobeyed orders and decided to desert upon learning the truth. Later, a new squadron led by Crosshair, who had left the Clone Force 99 due to their defection from the Empire, arrived to finish the mission to eliminate Saw and his militia. However, Saw was already gone, and the only ones left were some militia members and some civilians. All were killed, including the Elite Squad Trooper ES-01, who refused to execute the civilians, which was seen as treason by Crosshair. When the Empire sent ISB Agent Kallus and his platoon to bring peace to Onderon, Gerrera and a Lasat mercenary ambushed them. The Lasat then mercilessly executed the platoon and left Kallus alive."}, {"tag": "h3", "text": "Armed resistance"}, {"tag": "p", "text": "In 14 BBY,[source?] the Partisans led an incursion against the Empire on Kashyyyk, in an attempt to weaken the Empire and free Wookiee prisoners. They assisted the Jedi Padawan Cal Kestis and the crew of the Stinger Mantis in locating Wookiee Chieftain Tarfful. They were overwhelmed by Imperial forces after finding him, forcing the majority of them to retreat the planet. Saw offered Kestis a place in the Partisans, but Kestis refused because was on his own mission. Saw said the invitation continued."}, {"tag": "p", "text": "In 13 BBY,[source?] Gerrera took Jyn Erso and accepted her into the partisans. By 5 BBY,[source?] Erso was one of the best fighters among the partisans. However, Gerrera was forced to abandon her due to her father, Galen Walton Erso, being an Imperial collaborator."}, {"tag": "p", "text": "In 6 BBY,[source?] Gerrera and his Partisans were hired by Arane Oreida and her group of partisans to infiltrate the Sakoola blossom festival on Inusagi. Using flechette launchers, the partisans massacred the festival and the outcome involved the deaths of Maia, the Inusagi chieftess, several Imperials including governor Cor Tophervin, and many Inusagi civilians. Some of Gerrera's members left the Partisans for less extreme rebel groups."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "h4", "text": "Uneasy alliance"}, {"tag": "p", "text": "In 3 BBY,[source?] a member of Saw's Partisans planted a bomb in the chalet of Moff Quarsh Panaka, governor of Naboo, on the moon Onoam. The explosion destroyed the building and killed Panaka, but also nearly killed Princess Leia Organa of Alderaan, fellow rebel Bail Organa's adopted daughter, and Naboo's reigning Queen Dalné, both of whom escaped death by mere moments. Panaka's assassination caused a full lockdown of the sector and infuriated Bail, both because Panaka had been one of the select few Imperials who was neither corrupt nor cruel and because his daughter was very nearly killed."}, {"tag": "p", "text": "By 1 BBY,[source?] Saw Gerrera was at odds with Senator Mon Mothma, leader of the Alliance to Restore the Republic in terms of how the war was to be fought. The Partisans, while part of the Alliance, were unlike the rest of the rebellion, having very few qualms and were willing to do whatever was deemed necessary in their fight, including openly attacking and killing civilians. The Partisan leader attempted to convince the Spectres to join his cause. Soon after, he assisted the rebels in their mission to the Jalindi Station, with he and Benthic in their U-wing. Gerrera dropped proton bombs on the relay to destroy it, and rescued the Spectres from their mission."}, {"tag": "p", "text": "Sometime later, the Partisans untertook a mission to the Imperial Metal Factory on Dooma 4 after learning that the factory provided components for an secret Imperial project."}, {"tag": "h4", "text": "Jedha insurgency"}, {"tag": "p", "text": "With his campaigns against the Empire becoming increasingly brutal, Alliance High Command, at the urging of Mon Mothma, formally censured Gerrera and severed all official ties with the Partisans. Gerrera relocated his militia to Jedha, a small desert moon which orbited the planet NaJedha, feeling that it was an appropriate place to bring his rebellion, as it was a sacred world to many different galactic religions."}, {"tag": "p", "text": "From his new base of operations in the Catacombs of Cadera, Gerrera began recruiting and organizing the local insurgencies under the umbrella of his Partisans. Over several months, the Partisans attacked the Imperial occupiers, leading to harsher and harsher reprisals from the Empire increasing significantly."}, {"tag": "h4", "text": "Post-Yavin"}, {"tag": "p", "text": "Following the death of Gerrera, the remaining Partisans under the leadership of Benthic continued his extremist legacy to thwart the Empire at any cost. After the theft of the Death Star plans, the newly formed Inferno Squad was ordered to infiltrate and eliminate the surviving Partisan cell called the Dreamers, which they did."}, {"tag": "p", "text": "When the rebellion began looking for a new base, another group of surviving Partisans were then approached by Leia, Jedi Luke Skywalker, Captain Han Solo, and Chewbacca after rescuing Partisan Ubin Des and Chulco Gi from the Imperials. The Partisans were attempting to stop the Empire from extracting more kyber crystals from what remained of Jedha. Des and Gi then took the Millennium Falcon to the Partisans' new base on Jedha. There, they were brought before Benthic, who believed they should kill the Rebels, but agreed to listen to her. He then agreed to accept her supplies and spoke with her about re-joining the Alliance. Skywalker and Benthic then boarded the drill citadel. Benthic forced one of the technicians to lower the shields so that the Partisans and the Falcon could attack the citadel. After the mission, the Falcon dropped off the surviving Partisans and refugees on NaJedha. Benthic promised that he and his partisans would guard Jedha until it was gone. Leia agreed to have the Partisans work with the Alliance once again. Ubin Des was then given the Medal of Bravery by Captain Solo in recognition for her actions."}, {"tag": "p", "text": "Following their joint effort with the Rebel Alliance, the mission to Shu-Torun, Benthic and his fellow partisans went to Salobea."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}