{"url": "Parwan", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Botanical sentient species", "Category:Parwans"], "nodes": [{"tag": "h1", "text": "Parwan"}, {"tag": "p", "text": "Parwans were a sentient species native to Parwa. During the Clone Wars, the Parwan Derrown was considered one of the best bounty hunters in the galaxy."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Parwans were a sentient species with four long, tentacle-like appendages in their lower body, as well as two arms with three-fingered hands. They possessed three eyes on a mushroom-shaped head. They could \"float\" by filling themselves with gas, and could generate electrical fields. They could safely inject themselves with electrolytic serum depending on their blood type. They were physically capable of speaking Galactic Basic Standard. Some Parwans went into hibernation based on the several century long seasons of their homeworld Parwa, even if they were offworld. It was possible for Parwans to be Force-sensitive."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Parwans had their own language, which some members of the species, such as Derrown, used instead of Basic."}, {"tag": "h2", "text": "Parwans in the galaxy"}, {"tag": "p", "text": "During the High Republic Era, the Parwan Jedi Master Obratuk was a respected diplomat. As such, he was chosen to lead a secret mission to negotiate with the Hutt Clan. However, Obratuk fell into a seasonal hibernation before arriving on Nal Hutta, leaving his Padawan, Farzala Tarabal, to attempt to lead the negotiations instead."}, {"tag": "p", "text": "During the Clone Wars, the Parwan bounty hunter Derrown was active, known as \"the Exterminator\". Derrown's repute was such for him to be invited to compete in a tournament on Serenno, where the Separatist leader Count Dooku intended to select a group of talented hunters to abduct Galactic Republic Supreme Chancellor Palpatine. Derrown was one of the survivors, and as such participated in the kidnapping attempt on Naboo, which was sabotaged by Jedi Master Obi-Wan Kenobi, who had infiltrated the group. Derrown, however, escaped being taken into Republic custody."}, {"tag": "p", "text": "The cyborg and droid expert Doctor Gubacher directly served the Republic at the same time, giving the astromech droids recruited into D-Squad upgrades for their mission to steal a Separatist encryption module."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Parwan species first appeared in \"The Box,\" the seventeenth episode of the canon animated series Star Wars: The Clone Wars' fourth season, which originally aired on February 3, 2012. Its design was based upon an unused cantina alien developed by Ron Cobb for Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}