{"url": "Pashvi", "categories": ["Category:Canon articles", "Category:Pashvi locations", "Category:Wild Space astronomical objects"], "nodes": [{"tag": "h1", "text": "Pashvi"}, {"tag": "p", "text": "Pashvi was a Wild Space world where the pirate Queen Maz Kanata hid a portion of the spoils from her reign in a buried vault armed with an antitamper sub-space alarm. She later wrote about the cache in the book that would become known as the Smuggler's Guide, after which the smuggler Tryphon Leo travelled to Pashvi to find the treasure, which he believed to be within the Shrove of the Left-Handed God Typhojem. Leo was killed while searching for the treasure, and his body discovered by senior terrain trekker Reginald Danfillo of the League of XenoExplorers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Pashvi was a world located in the Wild Space region of the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Treasure trove"}, {"tag": "p", "text": "Following her reign as pirate queen, Maz Kanata hid a portion of the spoils she had claimed in a buried vault armed with an antitamper sub-space alarm in the Shrove of the Left-Handed God Typhojem on Pashvi. As of the time she began writing the book that would become known as the Smuggler's Guide, the alarm in the vault on Pashvi had not been sounded, and so she included in the book a map and coordinates showing the locations of each of her vaults so that a worthy reader may one day claim them. Hoping that the book would grow and be added too by others, Kanata let the smuggler Tryphon Leo steal it from her during the reign of the Galactic Empire."}, {"tag": "p", "text": "After reading through the book, Leo decided he would attempt to claim the treasure on Pashvi, as it was the closest to his location on Vergesso. As the Crimson Dawn criminal syndicate were active in the region of space that Pashvi was located in, the smuggler kept quite about the cache, not speaking with any of Pashvi's native inhabitants about the shrine."}, {"tag": "h3", "text": "Crushing failure"}, {"tag": "p", "text": "He believed he would be able to transport the full treasure on a gravsled and so chose to work alone so that he would not have to share the take. Leo was killed in front of a Typhojem Thrall seventy meters along the Grand Causeway while searching for the treasure when a large boulder fell from the ceiling and crushed him."}, {"tag": "p", "text": "Leo's body was later found by senior terrain trekker Reginald Danfillo of the League of XenoExplorers during the archaeological Typhojem Excavation of the shrove. Danfillo also found Quesoth pottery shards and a piece of tapestry dating to the Neo-Middle Secundus on the outing, which the trekker recorded in a file that was added to the Smuggler's Guide, which Danfillo had taken from Leo's body. Danfillo was disappointed to discover that the guide was a contemporary object and commented that it might be something that could sold to a spacer."}, {"tag": "p", "text": "The book then ended up in a box of reading material elsewhere on Pashvi, where it was discovered tucked between The Biography of Master Thief Makuta and The Field Guide to Trammic Reptavians by the Besalisk Dexter Jettster, who purchased it and wrote a short passage in the book before leaving Pashvi and traveling to Athus Klee in the stellar skirt of the Tingel Arm region."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "During the reign of the Galactic Empire, Pashvi was inhabited by natives."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pashvi was first mentioned in the current canon in Star Wars: Smuggler's Guide, a reference book written by Daniel Wallace and released in 2018. The world originated in the Star Wars Legends continuity, where it was first indirectly mentioned in the 2006 novel Outbound Flight by Timothy Zahn, then named in the 2009 reference book The Essential Atlas, written by Wallace and Jason Fry. In Legends, the natives of Pashvi were a sentient species also named the Pashvi."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}