{"url": "Paskla-class_cruiser", "categories": ["Category:Legends articles", "Category:Cruiser classes", "Category:Vagaari starship classes"], "nodes": [{"tag": "h1", "text": "Paskla-class cruiser"}, {"tag": "p", "text": "The Paskla-class cruiser was a type of vessel used in the Unknown Regions; the origins of the design are unknown, but it was apparently used by a variety of species and deployed in a number of different civilian and military configurations."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Although about half the size of a Dreadnaught or a modern bulk cruiser and technologically inferior to either, it was capable of serving as a potent warship by the standards of the Unknown Regions. Externally, it resembled a light-colored flattened sphere, and in at least some configurations, it carried a regular pattern of dark spots covering the hull, which could be used as launch ports for Vagaari fighters; most of the cruiser's habitable volume was apparently taken up by small cabins, with the command center being the only large open area."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the events surrounding the rediscovery of Outbound Flight, the appearance of a Paskla-class vessel in unknown configuration was enough to alarm a senior Chiss commander like General Drask and send the cruiser Chaf Envoy to combat stations; but when the cruiser identified itself as a refugee ship—part of a ruse by the Vagaari, masquerading as peaceable Geroons—the suspicious Chiss apparently accepted this claim at face value."}, {"tag": "p", "text": "The military configuration and true capabilities of the Vagaari ship were revealed, however, when she attacked and attempted to destroy the Brask Oto Command Station in a bid to penetrate the Redoubt. Their attempts were only foiled by the combined efforts of the Chiss Ascendancy, the Empire of the Hand, the Outbound Flight survivors, and the Jedi Knights Luke and Mara Jade Skywalker at the Battle of the Redoubt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}