{"url": "Pashvi/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Terrestrial planets", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Pashvi"}, {"tag": "p", "text": "Pashvi was a planet that was located on the edge of Wild Space and had thousands of rock pillars scattered across its landscape. Both nutritional plants and dangerous predatory avians could be found on the tops of the pillars. As a result, the native Pashvi, a sentient humanoid species, were both drawn to and afraid of the pillars, and had a distanced emotional state. The Pashvi also created works of art that were sought after in the Corporate Sector, and the Human smuggler Dubrak Qennto had visited the world a few times by the year 27 BBY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Pashvi was a remote planet with at least one sun that was located within the Pashvi system, on the edge of the galaxy's Wild Space region. Thousands of rock pillars were scattered across the planet's surface, and certain plants grew on the tops of those pillars, where they could receive more sunlight. A native predatory avian species that was considered to be dangerous also lived atop the pillars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Human smuggler Dubrak Qennto had visited Pashvi, the homeworld of the sentient Pashvi species, on several occasions by the year 27 BBY in connection to the trade of Pashvi artworks in the Corporate Sector, a part of the Outer Rim Territories. By that year, the Pashvi had fallen prey to a raid by the sentient Vagaari."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Pashvi was home to the sentient Pashvi, a non-violent humanoid species that had different proportions than those of the Human and Chiss species. The plants that grew on the planet's rock spires had one of the highest nutritional values to the Pashvi, and this attracted the native sentients to the pillars. However, the threat posed by the predatory avians simultaneously made the Pashvi afraid of the edible plants and the pillars. These feelings led to a distanced emotional state among the Pashvi themselves and other things they valued. The Pashvi created various works of art, including an elaborate blue-and-white sculpt that had fallen into the hands of Vagaari raiders by 27 BBY. There was a small but stable market for Pashvi art, which was mostly based in the Corporate Sector."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pashvi was first mentioned, albeit indirectly, in the 2006 novel Outbound Flight, written by Timothy Zahn. The 2009 reference book The Essential Atlas placed the Pashvi system, and therefore the planet, in grid square I-5. Jason Fry, co-author of The Essential Atlas, has stated that the star systems listed in the book's Appendix section are named after the most prominent planets or celestial bodies located in those systems. This article therefore considers the homeworld of the Pashvi species to be named in accordance with the Pashvi system."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}