{"url": "Path_engine", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Hyperdrive units", "Category:Nihil"], "nodes": [{"tag": "h1", "text": "Path engine"}, {"tag": "p", "text": "Path engines were a type of specialized hyperdrive that provided incredibly fast hyperspace travel through use of the unorthodox and otherwise inaccessible Paths. Utilized by the Nihil marauder organization during the High Republic Era, the Path engines allowed the Nihil to appear unexpectedly when undertaking raids, giving the marauders a feared reputation. The devices were installed on Nihil starships in addition to normal hyperdrives, connected to the vessels' engines. Path engines, as well as the Paths that they utilized, were originally provided to the Nihil by Asgar Ro after he positioned himself as the first Eye of the Nihil; after his death, his son, Marchion, took his place."}, {"tag": "p", "text": "Marchion Ro had plans to manipulate the Nihil for his own purposes, and the Path engines played a role in his scheme. After Ro orchestrated the Great Hyperspace Disaster, a hyperspace incident that led to subsequent Emergences across the Outer Rim, the Galactic Republic and Jedi Order became aware of the Nihil and their unconventional hyperspace abilities. As part of his maneuvers, Ro sent one of the Nihil's three Tempests to their deaths in the Battle of Kur, hoping to convince the Republic of the Nihil's destruction. Ro utilized the Path engines of the Nihil starships to perform short and unpredictable hyperspace jumps across the Kur Nebula; the supposed tactic escalated into the Nihil ships being sent into fatal impacts with the opposing vessels. His plan was successful, with the Republic believing that the force at Kur had been the entire organization, and Ro proceeded to take control of the Nihil himself."}, {"tag": "p", "text": "Long after the time of the Nihil, during the Imperial Era, Beol De'Rruyet, founder of De'Rruyet Industries, acquired an ancient Path engine. Though De'Rruyet claimed to have the ability to replicate its design, revolutionizing lightspeed travel, the Path engine that De'Rruyet possessed was only one part of the larger system, and as such would not work as he had claimed. De'Rruyet succeeded in constructing a replica of the Path engine, but the reproduction was incomplete, and would combust if it were to be activated. Nevertheless, his claims drew the attention of his rival, Domina Tagge of the Tagge Corporation, who recruited the rogue archaeologist Doctor Chelli Aphra to verify De'Rruyet's claims before he could unveil it at an expo on the planet Midarr. Aphra learned of the catastrophic effect that the replica's activation would have, but her attempt to shut De'Rruyet down was interrupted by the arrival of General Vukorah of the Unbroken Clan, who wished to take the Path engine for herself."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Path engine was a type of hyperdrive that provided a starship with a fast and unconventional method of traversing hyperspace, utilizing the Paths, hyperspace routes located between and across typical hyperlanes. The device could translate the Paths into navigational data that only the Path engine could utilize; any conventional system would reject the data as impossible."}, {"tag": "p", "text": "A complex system composed of multiple components, the engine had a hexagonal frame, inside which was a smaller device: a half-spherical metal lattice, containing a glowing green fire, with stepped edges and four pointed legs. Path engines were attached to a starship's engines; the larger Path engine in its entirety could fit into a compartment of the same shape located within a system that retracted beneath the vessel's bridge. The Path engine would additionally be connected to the hyperdrive and control systems."}, {"tag": "p", "text": "In addition to accessing unconventional routes, the Path engines were able to make a starship perform hyperspace jumps shorter than was possible with regular vessels, flickering in and out of realspace in leaps as short as one kilometer. The engines could also be activated remotely. When calculating jumps from within a planet's gravity well, Path engines had to do so from a specific point."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rise of the Nihil"}, {"tag": "h4", "text": "A Path and a plan"}, {"tag": "p", "text": "During the time of the High Republic Era, the hyperspace prospector Mari San Tekka, who possessed the ability to locate the Paths, was taken by the family of Asgar Ro and his son, Marchion. The family exploited her ability for their own purposes, with San Tekka being passed down through generations until Asgar Ro, who kept her alive within a medical pod aboard his flagship, the Gaze Electric. The starship was equipped with a Path engine—the first of many—of a unique design. The device could handle San Tekka's abilities, allowing the Gaze Electric to traverse the Paths. San Tekka continued to discover Paths from aboard the Gaze Electric, which were stored in a database on the vessel."}, {"tag": "p", "text": "Asgar Ro and his son eventually left their homeworld behind, and with an ulterior goal in mind, approached the Nihil, at that point a small and disorganized marauder organization that operated near Thull's Shroud. The elder Ro offered the Nihil the Paths for the marauders to utilize in their operations, becoming the Eye of the Nihil. The starships of the Nihil fleet were all equipped with Path engines, though less enhanced than the original device aboard the Gaze Electric."}, {"tag": "p", "text": "With the Path engines, the Nihil situated themselves in the Great Hall of the Nihil, a new base of operations within No-Space, an area only accessible through the unconventional and unmapped hyperspace routes. The Paths were provided by the Eye of the Nihil; the members of the Nihil's three Tempests were unaware where the routes originated. The Nihil utilized the Path engines in maneuvers that appeared impossible—appearing without warning anywhere, at any time. With the Paths and the Eye's guidance, the Nihil grew larger and stronger, becoming feared across the Outer Rim Territories. Asgar Ro was eventually killed and succeeded by Marchion, who inherited the Gaze Electric and control over the Path engines, continuing the plans set in motion by his father."}, {"tag": "h4", "text": "Vision of the Eye"}, {"tag": "p", "text": "The Path engines played a role in Marchion Ro's manipulation of the Nihil for his own goals. Around 232 BBY, Ro sent a Nihil Stormship on a Path that took it across the route of the freighter Legacy Run, which broke apart in hyperspace while attempting to avoid the vessel. In the resulting Great Hyperspace Disaster and its subsequent Emergences, debris from the Legacy Run was scattered across the Outer Rim. In their investigation into the incident and its cause, the Galactic Republic and Jedi Order learned of the threat that the Nihil posed and their unconventional manipulation of hyperspace."}, {"tag": "p", "text": "Ro sent the Tempest of Tempest Runner Kassav Milliko to the Kur Nebula, supposedly to intercept a transport carrying the flight recorder of the Legacy Run to prevent the Republic from gaining further information on the Nihil. In reality, Ro had intended for Milliko and his Tempest to be sent to their deaths to give the Republic the impression that the Nihil had been entirely eliminated; the subsequent Battle of Kur saw the Tempest come up against a much larger Republic Defense Coalition and Jedi force than Milliko had expected."}, {"tag": "p", "text": "Despite the Nihil's use of atypical tactics at Kur, the marauders were trapped and slowly became overpowered. During the battle, Ro remotely activated the Path engines of the ships in the Nihil fleet, utilizing a tactic that he referred to as Battle Paths, in which the starships entered hyperspace and exited it almost immediately, disappearing and reappearing short distances away. The tactic caused chaos across the battlefield; while the rapid jumps disoriented the Nihil's opponents, the Path engines took some ships directly into the path of both Republic vessels and their own."}, {"tag": "p", "text": "Learning of Ro's intention to sacrifice his Tempest, Milliko ordered his crew to disconnect the Path engine of his corvette, the New Elite; at the same time, the Battle Paths began to actively target the Republic vessels, sending the Nihil ships into direct impacts. The Nihil were unable to control or stop their Path engines, and Milliko's Tempest was destroyed as a result. Ro's maneuvers had succeeded—the Republic and Jedi believed that the Nihil were no longer a threat. In the aftermath of the Battle of Kur, Ro reorganized the Nihil, dissolving the Tempest hierarchy and taking control of the organization."}, {"tag": "h3", "text": "Rediscovery"}, {"tag": "h4", "text": "Technology from the past"}, {"tag": "p", "text": "By the Imperial Era, long after the time of the High Republic, the Path engine and the technology's abilities were lost. During the Galactic Civil War between the Galactic Empire and the Rebel Alliance, the smuggler Remy discovered a Path engine within the wreckage of a Nihil battleship on the planet Dol'har Hyde. Remy retrieved the engine and put it up for sale on a clandestine network of artifact sellers and buyers, where it was noticed by Beol De'Rruyet, founder of De'Rruyet Industries. De'Rruyet was interested by the Path engine, purchasing the device from Remy on the planet Corellia and returning with it to his company's headquarters, De'Rruyet Center, on the planet Midarr."}, {"tag": "p", "text": "De'Rruyet intended to create a reproduction of the Path engine in order to replicate its abilities, claiming it would revolutionize lightspeed travel. He and his company were successful in creating a reproduction of the Path engine, using seemingly genuine parts. However, the Path engine that Remy had discovered on Dol'har Hyde was only one part of the system—the device would not work on its own. As such, the replica that De'Rruyet Industries produced was incomplete and did not work as he had claimed; in fact, its activation would result in the engine combusting, destroying the starship in which it was installed."}, {"tag": "h4", "text": "Destructive demonstration"}, {"tag": "p", "text": "Despite the Path engine replica's incomplete nature, De'Rruyet continued to claim that the device was functional and revolutionary, intending to showcase it at the De'Rruyet Industries confluence on Midarr. His claims attracted the attention of various parties. Lady Domina Tagge of the rival Tagge Corporation—wary that the technology would change the galactic economy or end the ongoing war, thus jeopardizing her own company's economic position—hired the rogue archaeologist Doctor Chelli Aphra to investigate De'Rruyet's engine. General Vukorah of the Unbroken Clan criminal syndicate wished to acquire the device for herself, while Emperor Palpatine intended to secure the technology for the Empire if it was successful."}, {"tag": "p", "text": "One day prior to the confluence, De'Rruyet's Path engine was still not operational, but De'Rruyet was not discouraged; he ordered his employees to make the device appear convincing so as to impress his company's investors. However, he had begun to panic about the possibility of an unsuccessful demonstration, having planned to run with his money in that event. Aphra, along with the smuggler Sana Starros, infiltrated De'Rruyet Center, confirming that the Path engine's activation would be catastrophic and attempting to convince De'Rruyet to call off the upcoming demonstration. Before De'Rruyet could decide, however, Vukorah and her forces breached De'Rruyet Center; upon learning that the engine was not yet functional, she intended to hold the company's employees hostage until they made it so."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Path engine first appeared in the comic Doctor Aphra 6, written by Alyssa Wong, penciled by Ray-Anthony Height and Robert Gill, and published by Marvel Comics on November 25, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}