{"url": "Attack_on_the_Zaarin_supply_convoy", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Battles of the Zaarin insurrection"], "nodes": [{"tag": "h1", "text": "Attack on the Zaarin supply convoy"}, {"tag": "p", "text": "A battle was fought during the Zaarin insurrection in the Semag system."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Thrawn prevented an potentially uncontrollable proliferation attempt of TIE Defenders by Nami Crime Lord Ali Tarrak. Emperor Palpatine promoted Thrawn to Grand Admiral, making him now one of 12 Grand Admirals, despite Palpatine's clear prejudice against Aliens. Thrawn was then tasked to hunt down and destroy Zaarin, the Grand Admiral Thrawn replaced."}, {"tag": "p", "text": "Thrawn found that Zaarin was last seen in the Semag system and was planning to escape into the Unknown Regions. Believing that he could use the regions to amass new forces and rally more armies to his cause, Thrawn had multiple Probes to locate anything interesting, assigning his best pilot Maarek Stele who had helped him on numerous tour of duties and had proven to be his most valuable asset to be the leader of anything that would be of importance. Stele was placed in command of Captain Kuuztin, another hand-picked officer for his bravery and commanded his own Imperial-class Star Destroyer Courageous."}, {"tag": "p", "text": "A probe, called AIM-9R detected a convoy of three BFF-1 bulk freighters called Furlo escorted by a Dreadnaught-class heavy cruiser Rahmat with two T-wings as fighter escort. Kuuztin assigned Stele to attack the convoy and destroy the escorts, hoping to draw some of Zaarin's forces into an ambush."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "When Stele arrived at the location, with Assault Gunboats as cover, he targeted the Rahmat and launched 12 Heavy rockets at the ship then used his SLAM to inspect the dreadnaught, to find it carrying Yrabrab, and the freighters carrying Munitions. While dogfighting and easily defeating the T-wings, Inrider Squadron and Outrider Squadron, a Nebulon-B2 frigate Strident arrived and launched TIE Interceptors and a Lambda-class T-4a shuttle that was to dock with the freighters. Stele focused on the Interceptors, while Assault Gunboats moved in to disable the shuttle. The Imperial-class Star Destroyer Courageous arrived and began launching TIE Bombers. The Strident launched its own but were intercepted by Stele, who then helped the loyalist bombers destroy the Strident. Finally three TIE Advanced squadrons arrived to try to disrupt operations, all squadrons were destroyed in the battle. The Courageous launched two Stormtrooper transports Upsilon 1 and 2 to capture both the shuttle and the freighters."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The capture of the supplies and prisoners from the shuttle was a particular blow to Zaarin. Thrawn hoped that by depriving Zaarin of much needed supplies, he would be pressurised into making a mistake and Thrawn wanted to be there when he does. Kuuztin meanwhile discovered a Supply Base in the Gwar system and, without consulting Thrawn, made plans and preparations to destroy the station."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle appears in the 1994 PC game Star Wars: TIE Fighter in Battle 11 Mission 1. This article assumes completion of both \"Primary\", \"Secondary\" and most, if not all \"Bonus objectives\" completed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}