{"url": "Pastorian", "categories": ["Category:Canon articles", "Category:Insectoid sentient species", "Category:Outer Rim Territories species", "Category:Pastorians"], "nodes": [{"tag": "h1", "text": "Pastorian"}, {"tag": "p", "text": "Pastorians were a sentient species with several insectoid features from the Outer Rim planet Pastoria."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A bipedal insectoid species, Pastorians appeared vaguely humanoid, walking on two legs and possessing two arms. A small abdomen protruded from their lower back, although some Pastorians did not possess one. Pastorians had four wings on their backs that gave them the ability to fly, and could be folded over their bodies when not in use. The color of their wings could vary, with known colors being yellow, blue, and green. Their faces had flattened noses, and various numbers of tendrils on the sides."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Pastorian society was a monarchy, with their planet under the rule of a king. The claim to the throne of Pastoria was contested, and potential rulers each resided in their own territories. Despite not being equipped enough to provide military aid in a war, they had some form of military, and possessed a number of starfighters and transports."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the war between the First Order and the Resistance, the king of Pastoria was Siroc, who wished to stay in power in order to lead his species into negotiations with the First Order, who he assumed would eventually arrive on Pastoria after the Battle of Starkiller Base. As part of a mission assigned by General Leia Organa, Black Squadron visited Pastoria in an attempt to persuade King Siroc into assisting the Resistance and using his influence to spread the word to other star systems. However, Siroc was not interesting in affiliating himself with the Resistance, and only wished to eliminate his primary rival."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}