{"url": "Pathogenic_bomb", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Biological and chemical bombs"], "nodes": [{"tag": "h1", "text": "Pathogenic bomb"}, {"tag": "p", "text": "A pathogenic bomb was a chemical warhead that mixed two prime components together to create a poison cloud that was capable of spreading disease among targeted populations. The resulting mixture was highly volatile, which necessitated its storage in independent receptacles until just prior to deployment. In 8 ABY, the population of the planet Kolatill in the Kathol sector of the Outer Rim Territories was targeted by Imperial warlord Moff Kentor Sarne. The assault was in response to Kolatill's overthrow of their Imperial governor in the wake of Sarne's ousting from his own capital, Kal'Shebbol, by New Republic forces. The attack—which was to feature the dropping of pathogenic bombs on major cities across the surface of the planet—was thwarted by the combined forces of the Kolatill Defense Force and the starfighter squadron assigned to the New Republic CR90 corvette FarStar."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Pathogenic bombs were highly toxic warheads capable of deploying a poison cloud over a vast area, spreading disease among organic populations. Such weapons comprised two prime components that, when mixed, formed a deadly poison. However, due to the volatile nature of the mixture, the two components were stored separately, and were not mixed until just prior to the bombs' release in the delivery vessel's ordnance bay. If the components remained separated, the bombs were harmless."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 8 ABY, the forces under the command of Imperial warlord Moff Kentor Sarne intended to deploy pathogenic bombs against the citizens of the planet Kolatill in the Kathol sector of the Outer Rim Territories. The assault was in retribution for the populace's defiance against Sarne; the populace had overthrown their local Imperial governor, Tetrum, and declared their allegiance to the New Republic when they learned that Sarne had lost control of his capital, Kal'Shebbol. TIE/sa bombers assigned to the Ton-Falk-class escort carrier Kathol Protector—which had conducted a previous assault on the planet four days previously—were armed with these weapons and ordered to target cities on Kolatill."}, {"tag": "p", "text": "While the Kathol Protector and its TIE/LN starfighters engaged the New Republic CR90 corvette FarStar—which had arrived at the planet to render assistance to the inhabitants of the city of Domaz following the Kathol Protector's previous assault on the world—in space, TIE bombers loaded with pathogenic bombs descended to the surface. During the resulting aerial battle between the bombers and the fighters of the Kolatill Defense Force, alongside the starfighter squadron assigned to the FarStar, one pilot registered the presence of the pathogenic bombs aboard the bombers when one of the fighters was destroyed, and the pilot's sensors detected poisonous chemicals in the debris field. Realizing that the bombers carried chemical weapons, the combined forces redoubled their efforts and managed to destroy the TIE bombers before they could release their payloads."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pathogenic bombs first appeared in the roleplaying game adventure Omens, which was published in The DarkStryder Campaign by West End Games in 1995."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}