{"url": "Patrok_Ru-Saxon", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Humans", "Category:Males", "Category:New Mandalorians"], "nodes": [{"tag": "h1", "text": "Patrok Ru-Saxon"}, {"tag": "p", "text": "Patrok Ru-Saxon was a male Mandalorian human police captain who served in the Mandalorian Guard during the Clone Wars. He was in command of the Sundari shipping docks during a poisoning epidemic instigated by Moogan smugglers on Mandalore."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Service on Sundari"}, {"tag": "p", "text": "The male Mandalorian Patrok Ru-Saxon served as a captain in the Mandalorian Guard, the law enforcement agency of the New Mandalorian government, during the Clone Wars. In that capacity, Captain Ru-Saxon was in command of the Sundari shipping docks and sometime following a mission to Florrum undertaken by members of the Jedi Order, a group of Moogan smugglers led by Tee Va took advantage of the greed of government officials on Mandalore and the planet's dependence on the black market."}, {"tag": "p", "text": "Va's group of smugglers arrived at the shipping docks and paid off a customs official. Eventually, Va and his group of smugglers headquartered in a dock warehouse where Mandalorian scientists were paid off to mix slabin with Ardees Beverage in order to produce twice the tea and twice the profit. However, the scientists added the wrong dosage of slabin to the tea, which resulted in a mass exodus of sickness in Mandalorian children. After launching an investigation, Mandalorian leader Duchess Satine Kryze and Naboo Senator Padmé Amidala pinpointed the source of the epidemic."}, {"tag": "h3", "text": "Battle with the Duchess"}, {"tag": "p", "text": "The following morning, Captain Ru-Saxon was summoned at the Sundari Royal Palace by Duchess Kryze and was flanked by two members of the Mandalorian Royal Guard. When Duchess Kryze informed him of the corruption situation unfolding at the docks, Captain Ru-Saxon refuted the information and believed it to be impossible. When Senator Amidala corroborated Duchess Kryze's accounts, Captain Ru-Saxon was stubborn in the belief that the bribery of a customs official under his command at the docks was occurring. The captain believed that the docks were a highly secure area and free of dangerous criminals."}, {"tag": "p", "text": "When Duchess Kryze countermanded that the docks were not free of corruption and that the most dangerous weapon in the galaxy was money, Ru-Saxon continued to stand firm that smuggling never occurred under his command as he was watching. He continued to state that he was always watching when Senator Amidala stated on what occurs when he was not. Duchess Kryze asked Ru-Saxon if he was watching while children were dying, but when he attempted to defend himself, Kryze interrupted that if he wanted her respect, he would stop stalling and arrest the criminals at the docks. Kryze asked Ru-Saxon on what other reason there would be for not making arrests with a patrol unit unless he was involved. Ru-Saxon then reluctantly acquiesced to the Duchess and agreed to look into the situation."}, {"tag": "h3", "text": "Skirmish on Sundari's docks"}, {"tag": "p", "text": "Two Buirk'alor-class speeders containing Captain Ru-Saxon, Duchess Kryze, Senator Amidala, and members of the Mandalorian Royal Guard headed to the suspected warehouse at the docks and when they arrived, they encountered two Mandalorian Guards. Duchess Kryze asked Captain Ru-Saxon if he had ordered them there, but Ru-Saxon stated that he was with her the entire time. When Ru-Saxon ordered to two guards to move aside and open the door, the guards refused, stating that they were ordered not to let anyone inside. Captain Ru-Saxon asked them if they knew who the Duchess was, and Kryze repeated Ru-Saxon's command to open the doors. After hesitating, one of the guards attempted to strike the Duchess, but was blocked by Ru-Saxon and knocked unconscious, and the other was then struck by the captain and also rendered unconscious."}, {"tag": "p", "text": "Ru-Saxon then ordered two Mandalorian Royal Guards to arrest the corrupt police officers and proceeded to open the door of the warehouse. After the doors opened and Ru-Saxon caught the Moogan criminals and scientists in the act and ordered them to surrender, the Moogan smugglers and their Gotal workers opened fire, killing two Mandalorian Royal Guards and forcing the captain, along with the others, to seek cover. Ru-Saxon then ordered two Mandalorian Royal Guards to move inside and provide him cover with their shields while the others protected Senator Amidala and the Duchess. Using the Guards as cover, Ru-Saxon utilized his WESTAR-35 blaster pistol to engage the criminals but was shot in the arm and wounded. One of the Mandalorian Royal Guards pulled him to safety while the other covered them until they were all outside. Senator Amidala recovered Ru-Saxon's blaster pistol, and using a crate as cover and two Mandalorian Royal Guards pushing it forward, Amidala was able to lay suppressive fire and attack the criminals while other guards moved in and detained the smugglers."}, {"tag": "p", "text": "Recovering from his wound, Ru-Saxon stated that he was impressed with Amidala's shooting. After the criminals were vacated from the warehouse, Kryze ordered Ru-Saxon to burn down the warehouse. Ru-Saxon was quick to object, as there was evidence critical to the investigation. Ru-Saxon then accepted the order when Kryze threatened to consider him a part of the conspiracy if he did not comply. Giving out orders, two Mandalorian Royal Guards used flamethrowers to destroy the warehouse, and watched on as it burnt to the ground."}, {"tag": "h3", "text": "Foiling further operations"}, {"tag": "p", "text": "Following the skirmish at the docks, an investigation of the Moogan smuggling vessel found that its navigation computer indicated a stop off on Coruscant, which suggested that the smuggling ring was looking to open operations there. Captain Ru-Saxon sent a tip to Lieutenant Tanivos Exantor Divo of the Coruscant Security Force which allowed him to intercept a shipment destined for the Coruscant Underworld. As a show of gratitude, Lieutenant Divo sent Captain Ru-Saxon a bottle of artisanal Tarine tea, and Ru-Saxon sent back a bottle of Mandalorian kri'gee ale."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Patrok Ru-Saxon was a human male Mandalorian who was stubborn in his accountability and did not accept criticism well during his service as a captain in the Mandalorian Guard, so far as to argue with the leader of his planet, Duchess Kryze. Although he believed that because he was always watching, crime was not rampant but failed to detect and investigate major smuggling and black market operations under his purview. He was a proud man, quickly refuting the idea that he and his men could be corrupt and exploited by a black market scheme. He was unwilling to believe that the shipping area under his control could have been exploited, and was frustrated to learn that he was not able to prevent the operation."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Although a captain, Ru-Saxon's oversight proved ineffective against corruption and black market operations in his area of command. He was able to utilize a blaster pistol in combat."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As a captain of the Mandalorian Guard, Ru-Saxon was outfitted with the standard armored uniform of the guard, although his helmet had a single viewport rather than two small ones, and he had a rank insignia on his left shoulder armor plate. He utilized a WESTAR-35 blaster pistol during combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Patrok Ru-Saxon first appeared in \"Corruption,\" the fifth episode of the third season of Star Wars: The Clone Wars which aired in 2010. He was voiced by actor Tom Kane, who was credited as \"police captain.\" He was first identified in the canon 2018 reference book, Star Wars: Scum and Villainy: Case Files on the Galaxy's Most Notorious."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}