{"url": "Pathfinders/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic divisions", "Category:Alliance to Restore the Republic Special Forces units", "Category:Pathfinders"], "nodes": [{"tag": "h1", "text": "Pathfinders"}, {"tag": "p", "text": "The Pathfinders were a specialist division of the Alliance to Restore the Republic's Special Forces. Skilled in stealth and reconnaissance, Pathfinders were dropped into enemy territory to perform forward scouting missions, or secure beachheads and landing zones for further ground assaults. Lightly armed and mobile, Pathfinders relied on surprise and finesse to achieve their mission objectives, lest they be overwhelmed by a larger, more organized enemy force."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Pathfinders were a military speciality of the Alliance to Restore the Republic's Special Forces. The 2nd Regiment of each individual Division was designated as the Pathfinder regiment. Pathfinders were deployed as the initial wave of an assault, inserted via covert drop into enemy territory via various means including parachutes and para-wing gliders to establish beachheads and hold their position until relieved by stronger forces, or to conduct reconnaissance missions. Pathfinders traveled light, relying on total surprise to overwhelm the enemy before they realized that the Pathfinders were among them. However, it was a difficult undertaking to insert large forces with sufficient heavy weapons without being detected, and were usually undertaken by small units, usually no larger than a company. Relying on mobility and stealth, a small number of Pathfinders were capable of causing havoc amongst the ranks of the enemy if they achieved total surprise. However, if the enemy was able to organize and regroup, they would be able to pose a real threat to the smaller Pathfinder force, risking annihilation unless relieved. Pathfinders were also deployed in small units to act as scouts for other SpecForce units during ground operations. In these situations, the Pathfinders enjoyed the luxury of better reinforcements. Pathfinders also carried out reconnaissance and data retrieval mission at the behest of Alliance Intelligence."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, a Pathfinder platoon was deployed to the planet Nishr after a series of crackdowns against the native population, the near-Human Nish, were conducted by local Imperial forces. The Pathfinders reported on the state of Imperial-Nish relations and marked potential base sites on the planet. Inside three weeks, the Pathfinders were joined by three Wilderness Fighters platoons; the resulting unit, the Nishr Taskforce, was assigned to hinder Imperial operations on the world in attempt to draw reinforcements away from other locations in the sector, and encourage the local resistance. The taskforce's Pathfinders were mounted on speeder bikes, and frequently operated out of Nishr Base Ten."}, {"tag": "p", "text": "A Pathfinder platoon was assigned to Taskforce Shen, an elite silent missions forces that operated throughout the Mid Rim. Taskforce Shen was commanded by Major Mart Stevez, and was based around two Infiltrator platoons tasked with conducting silent raids, ambushes and tactical strikes. Shortly after the Battle of Yavin, the Pathfinder platoon was commanded by Lieutenant Mishowan Shigormallan."}, {"tag": "p", "text": "Outpost Cinder was an Alliance field base staffed by Team Blade under the command of Lieutenant Teracca Torrh. The base was responsible for monitoring the Bid'jerma Detention Block on the planet Bid'jerma, which housed Alliance prisoners, and to formulate a plan for their rescue."}, {"tag": "p", "text": "As the Galactic Civil War entered a state of conventional warfare, Pathfinders were expected to be deployed alongside Infiltrators to prepare beachheads and landing zones for invasion forces."}, {"tag": "h2", "text": "Personnel"}, {"tag": "p", "text": "Pathfinders were generally natives of nondescript planets, usually in the Colonies. As youths, they explored the rural wilds of their homeworlds extensively, and traveled far and wide gaining an appreciation for visiting new places while learning valuable navigation skills along the way. Many of the Jiivahar that joined the Alliance were effective woodland Pathfinders. Upon joining the Alliance, the acquired skills saw them assigned to SpaceForce Pathfinders. After drop camp, Pathfinders spent two weeks learning to survive in a variety of terrains, underwent stealth training, and learned how to operate repulsorlift vehicles."}, {"tag": "p", "text": "Self-reliant and practical, Pathfinders were calm and collected with little patience for the flashier Specs such as Heavy Weapons Specialists, Marines, or pilots, prefering to work with Infiltrators and Wilderness Fighters. Minimal contact with the enemy and low profile insertion missions were their stock in trade, as Pathfinders preferred to employ finesse over brute force. They were often referred to as \"TrekSpecs\" or \"Trekkers\" by other Specs."}, {"tag": "p", "text": "During the Galactic Civil War, Team Razor was commanded by a Major, and was comprised of Razke, Acle, Reku, Jal, Henle, and a rookie. Team Razor conducted the preliminary scouting and set-up for Outpost Cinder on Bid'jerma, while the Outpost's primary mission was conducted by Team Blade under Lieutenant Torrh. Lieutenant Shigormallen was a native of Yelsain who served with Taskforce Shen, while Sergeant Brooks Carlson served with the strike team that destroyed the shield generator bunker during the Battle of Endor. During the early years of the New Republic, Lilla Dade served as the Pathfinder in the elite Katarn Commandos."}, {"tag": "h2", "text": "Skills"}, {"tag": "p", "text": "Pathfinders were trained extensively in stealth tactics, and in survival across various terrain types. The possessed knowledge about the various alien species throughout the galaxy, and how to scout through unexplored and unknown locations. Combat training for Pathfinders included how to handle blasters and blaster rifles, as well as grenades, blaster artillery, and vehicle mounted blasters. Basic training in unarmed combat was provided for Pathfinders, and they were skilled in the operation of repulsorcraft. Technical skills, such as computer use, demolitions, and repair were not strongly focused on, and Pathfinders were able to apply first aid when needed."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Standard equipment for Pathfinders included blaster rifles, at least two grenades, survival gear and survival packs. Mission specific equipment included heavy weapons, flame carbines, and available repulsorcraft such as speeder bikes; Pathfinders favored modified Mobquet Overracer speeder bikes. Pathfinders employed camouflage ponchos for stealth, and, on occasion, light scout armor and climbing equipment. The Graph 18 surface locator was employed during missions, along with landing beacons. ShadoWing-4 para-wing gliders were used for insertion, along with parachutes. Pathfinders were also known to employ native riding beasts, such as Cracian thumpers. They also rarely employed comlinks, except for when absolutely necessary."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}