{"url": "Patitite", "categories": ["Category:Canon articles", "Category:Races and species stubs", "Category:Mid Rim species", "Category:Patitites"], "nodes": [{"tag": "h1", "text": "Patitite"}, {"tag": "p", "text": "Patitites were a species of diminutive sentients native to the planet Patitite Pattuna. During the Clone Wars, they had to start a democracy after the droids C-3PO and R2-D2 caused the death of their dictator, \"Big\" Hay-Zu."}, {"tag": "h2", "text": "Biology and Appearance"}, {"tag": "p", "text": "The Patitites were sentient humanoids with skin that ranged from green to light blue to purple. They were very diminutive, with an average height of 0.4 meters. They were bright-minded and had a grasp on machinery."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Patitites were ruled by the dictator Hay-Zu. He sent their children to fight his wars and the rest were forced to serve and entertain him. During the Clone Wars, a Y-Wing containing C-3PO and R2-D2 crash landed on the planet Patitite Pattuna. The two droids exited the starship, but they were shocked unconscious by the Patitite scouts. The droids were tied up and their leader Hay-Zu arrived. C-3PO managed to arrange their release, but R2-D2 talks back to Hay-Zu, causing C-3PO to give a reprimanding slap. R2-D2 toppled over onto Hay-Zu, killing him. The other Patitites celebrated the death of their tyrannical leader and helped the droids repair their starship. The Patitites wanted C-3PO to be their new leader, but he refused and helped them establish a democracy, instead. As R2-D2 and C-3PO left, conflict broke out among the Patitites as they struggled to choose the late Hay-Zu's replacement."}, {"tag": "h2", "text": "Weaponry"}, {"tag": "p", "text": "The Patitites possessed powerful electrified staves, which they were able to use to disable both R2 and C-3PO despite their small size."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Patitites first appeared in \"Nomad Droids,\" the sixth episode of the fourth season of Star Wars: The Clone Wars television series. The Patitites are a reference to the Brownies, small creatures that appeared in Lucasfilm Ltd.'s 1988 sword and sorcery film, Willow. The supervising director of Star Wars: The Clone Wars, Dave Filoni, is a fan of the film; he saw to it that the Patitites spoke in a similar fashion to the Brownies, as well. While the Brownies were humanlike in appearance, Filoni distinguished the Patitites from their source material by giving them radically different skin tone colorations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}