{"url": "Pau%27an", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Enslaved species", "Category:Outer Rim Territories species", "Category:Pau'ans"], "nodes": [{"tag": "h1", "text": "Pau'an"}, {"tag": "p", "text": "Pau'ans were gaunt, long-limbed humanoids from Utapau. They dwelled in their planet's sinkholes, and tamed the local varactyl for riding. Due to their long life-span, they were also known as the Ancients. The Utai, another indigenous species that lived on Utapau, and them were collectively known as the Utapauns."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Pau'ans were a species of gaunt humanoids with gray, furrowed skin, and sunken eyes. Their arms ended in long, pentadactyl hands with an opposable thumb and sharp nails. Being carnivores with a preference for raw meat, they also had sharp, jagged teeth. In addition to those intimidating features, Pau'ans were tall—Tion Medon, a Port Administrator during the Clone Wars, stood at about 2.06 meters. They had hypersensitive hearing, which prompted them to wear special coverings to protect their fragile ears. Their life-span was measured in centuries, which earned them the nickname of \"Ancients.\" The Pau'ans' native language was Utapese, however they were also capable of speaking Galactic Basic Standard."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Pau'ans were sentient beings, capable of intelligent thought. Although they often appeared fearsome to outsiders, most of them were peaceful and amiable. On their homeworld of Utapau, they preferred to dwell in darkness rather than light, and their cities were built within the planet's many sinkholes. Their primary settlement and spaceport was Pau City, which was administrated by various officials including the Governor, the Police Inspector, and the Port Administrator."}, {"tag": "p", "text": "They shared Utapau with at least three other species, namely the Utai, the Sugi, and the Amani. They domesticated the fast-paced varactyl to use as mounts. Like the Utai, the Pau'ans built their cities and buildings in the Ossic architectural form. The Utai were a fellow indigenous species on Utapau, with whom the Pau'ans had a symbiotic relationship. The two races were collectively referred to as Utapauns. Some Pau'an's like Gen Tri did not refer or had themselves referred to as he or she; instead they and them."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally, the Pau'ans occupied the surface of Utapau, while the Utai lived in tunnels and caverns. Over time, however, severe winds forced the Pau'ans underground. The two societies then merged and started founding sinkhole cities across the surface of their planet."}, {"tag": "p", "text": "At the end of the Clone Wars, the planet was occupied by the Confederacy of Independent Systems. The Jedi Master Obi-Wan Kenobi came searching for General Grievous: Port Administrator Tion Medon discreetly informed him of Grievous's location, allowing him to bring the forces of the Republic to liberate the Pau'ans."}, {"tag": "p", "text": "During the Clone Wars, a Pau'an male served the Jedi Order as a Jedi Temple Guard. The same Pau'an would turn to the dark side of the Force and attain the title of Grand Inquisitor, the leader of the Empire's Inquisitorius."}, {"tag": "p", "text": "During the reign of the Empire, many Pau'ans fled their homeworld after it was occupied by the Empire."}, {"tag": "p", "text": "At the time of the Battle of Yavin, on Coruscant, one Pau'an worked at a cantina. He would recruit strays to make deliveries. Anandra Milon visited him with her brother to find shelter, but refused and fled when a stormtrooper and underworld policeman arrived."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The design of the Pau'ans for Revenge of the Sith was originally intended for the natives of Mustafar. The Pau'ans themselves were designed as lemur-like creatures per George Lucas. These lemur concepts would later become the Lurmen. Artist Sang Jun Lee drew some initial sketches of the Pau'an species, and Robert E. Barnes and Michael Murnane created sculptures of their faces. The design developed over time and was later changed to the Pau'ans' current appearance as Revenge of the Sith developed. The Pau'ans in Revenge of the Sith were created through a mix of prosthetic makeup effects and computer-generated imagery. The design of their face was inspired by an African tribal mask."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}