{"url": "Pau_Sinkhole", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Natural formations", "Category:Utapau locations"], "nodes": [{"tag": "h1", "text": "Pau Sinkhole"}, {"tag": "p", "text": "The Pau Sinkhole was a natural formation stretching beneath the surface of the planet Utapau. It housed the subterranean settlement of Pau City, home to a million inhabitants including Pau'ans and Utai."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Pau Sinkhole was located along with most Utapauan settlements on the planet's lone continent, which resided as the most stable of the world's surface plates. Pau City was constructed as a vertical sanctuary within the sinkhole, largely in underground caves, with external access points and starship docking facilities situated on the inner cliff-face walls. The sinkhole sheltered the eleven-level city from the planet's strong surface winds, and subterranean passageways linked it to nearby secondary access sinkholes and settlements."}, {"tag": "p", "text": "Extending around the entire circumference of the Pau Sinkhole, the city maintained governmental, civic, and ceremonial buildings on the uppermost Civic Level, which was overseen by the Port Administration; the lowest Mining Level extended into the bone mines and deep caves at the bottom of the sinkhole, inhabited by resputi and other monsters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Utapau's complex tidal forces, a result of the remote planet's nine moons, caused massive currents in the world-ocean that lay beneath the underside of the planet's outer crust. In turn, these currents caused groundquakes that collapsed sections of the surface into subterranean sinkholes and stress-fracture chasms. The native Pau'ans and Utai built underground sanctuaries in many of the sinkholes on the single, most stable of Utapau's continents; the Pau Sinkhole was among these, and hosted the vertical settlement of Pau City. The inhabitants harvested minerals from the waters, grottoes, and pools of Coranth found in the lowest Mining Level."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}