{"url": "Pau_City/Legends", "categories": ["Category:Legends articles", "Category:Cities", "Category:Confederacy of Independent Systems cities", "Category:Galactic Empire cities", "Category:New Republic cities", "Category:Pau City locations", "Category:Utapau locations"], "nodes": [{"tag": "h1", "text": "Pau City"}, {"tag": "p", "text": "Pau City was a large sinkhole sanctuary plunging deep into the surface of the planet Utapau. Serving as Utapau's spaceport, Pau City ushered the planet's few visitors into the depths of the sinkholes. During the Clone Wars, the settlement was governed by Port Administrator Tion Medon."}, {"tag": "h2", "text": "Structure"}, {"tag": "p", "text": "Pau City was built into the walls and cavities of one of Utapau's large sinkholes. Many kilometers wide and even deeper, the sinkhole was linked to neighboring sanctuaries via deep canyons running between the natural depressions. The scrub-covered surface was unremarkable; life on Utapau flourished underground."}, {"tag": "p", "text": "When the Pau'ans joined the Utai underneath Utapau's surface following a planetary climate change, the two societies merged to form a single, hodgepodge civilization. The city encompassed the entire sinkhole, with structures littered across the inner walls, designed with varying styles of architecture. Pau City was divided into four main sectors; the Civic Level, located nearest to the surface, was where the city's bureaucracy and government officials resided and worked. The city's major civic, ceremonial and recreational buildings were located here. The Wealth Level operated below, serving as the city's hub for industry and trade. It also served as the main spaceport, and was littered with landing platforms and docks. The Produce Level was where the city's functional facilities, services and heavy industrial structures were located. This level produced the city's food supplies, and dactillions and varactyl were trained here to transport residents around the city. Finally, the Mining Level comprised the lower region of the sinkhole, given up to waste disposal and mining."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly before the Battle of Coruscant, General Grievous landed in the Pau City, demanding sanctuary for his forces. Tion Medon had no choice but to comply. Fortunately, the Jedi Council sent Master Obi-Wan Kenobi to destroy the Separatist Supreme Commander, and Tion was more than happy to accommodate him. Though initially wary of the Jedi, Tion offered his assistance to Obi-Wan. Though Pau City was briefly engulfed by war, Kenobi prevailed, and the menace of the Confederacy was lifted from Pau City, although major collateral damage was caused to the city in the fighting. The freedom would not last long at all. After Palpatine gave Order 66, Imperial Forces took control of the city and imprisoned many Utapauns."}, {"tag": "p", "text": "In 137 ABY, the Galactic Alliance Remnant established a base in Pau City."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}