{"url": "Pau_City", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Capital cities", "Category:Confederacy of Independent Systems cities", "Category:Galactic Republic cities", "Category:Pau City locations"], "nodes": [{"tag": "h1", "text": "Pau City"}, {"tag": "p", "text": "Pau City, also known as the sinkhole city, was one of the large sinkhole cities that pitted the arid surface of Utapau. It was the planet's capital and primary spaceport. In the ending stages of the Clone Wars, Pau City was governed by Torul Blom, with Tion Medon serving as Port Administrator, and Jen June as Police Inspector."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Pau City was located on the Outer Rim planet of Utapau. It was located in a giant sinkhole beneath the planet's surface and a majority of its structures were built out of Ossic, a type of fossilized animal bone. Many of the cities structures jutted out from the cliff walls over the sinkhole, which could be vertigo inducing. It was mostly populated by the native Utai and Pau'ans whose ancestors built the city. Pau City was the largest sinkhole community on Utapau."}, {"tag": "p", "text": "The city was composed up of eleven different levels that extended from top of the sinkhole to the bottom. Of those levels, four were the most important: the Civic Level, the Wealth Level, the Produce Level, and the Mining Level."}, {"tag": "h3", "text": "Civic Level"}, {"tag": "p", "text": "The Civic Level was the highest level and was occupied by the governmental and bureaucratic community and the Port Administration. The city's major civic and ceremonial buildings were also located on this level, as were the residences of the Pau'an elite. Being close to the surface was seen as a status symbol on Utapau."}, {"tag": "h3", "text": "Wealth Level"}, {"tag": "p", "text": "The Wealth Level was located slightly lower than the Civic Level. Production from the lower levels was delivered here and shipped off world on the docks. Here, ossic structures were manufactured. Additionally, the level contained the city's port facilities, factories, and warehouses. Middle class Pau'an and a few wealthy Utai lived on the level."}, {"tag": "h3", "text": "Produce Level"}, {"tag": "p", "text": "Farther down was the Produce Level. Most Utai lived on the level. Heavy industry, functional services, and city services were on this level. Its primary purpose was to raise small animals and plants such as ocean-kelps and cave-molds for food. The level was also where the dactillions and varactyls were bred and trained. Utapauns preferred their meat uncooked and butchers delivered meat every day throughout the city."}, {"tag": "h3", "text": "Mining Level"}, {"tag": "p", "text": "The city's lowest level was the Mining Level. The Mining Level's primary function was for the mining of bone used in ossic architecture and rare ores. Waste disposal was also here. Miners often encountered vicious creatures here, but it also contained natural hot springs that were popular for relaxing."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Eons ago a group of aliens, who would later evolve into the Utai and the Pau'ans, sought to colonize the world of Utapau even though it was barren and appeared to lack natural resources. Because of the huge storms that regularly occurred on the surface of the world, the colonists who settled on Utapau were unable to live on the planet's surface, and so instead of building their settlements on the surface, the colonists decided to build their communities in natural sinkholes and crevices where they would be safe from the storms. These sinkhole communities had to build their structures out of fossilized bones due to a lack of nearby wood and other natural resources. Pau City was the largest sinkhole community on Utapau created."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}