{"url": "Patrol_trooper", "categories": ["Category:Canon articles", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Patrol trooper"}, {"tag": "p", "text": "Patrol troopers were a specialized variant of the Galactic Empire's stormtroopers, acting as a rapid response policing force within urban environments. As the Empire reinforced its hold on planets across the galaxy, local defense forces were being supplemented and eventually completely replaced by stormtroopers. To cover distances across sprawling settlements and cities, patrol troopers policed the streets aboard their swift C-PH patrol speeder bikes and were armed with EC-17 hold-out blasters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 13 BBY, patrol troopers had a presence in Coronet City, of Corellia. In one situation, a patrol trooper witnessed Han Solo and his lover, Qi'ra, speeding in their M-68 landspeeder as they were being pursued by an A-A4B truckspeeder piloted by the White Worms gangster Moloch. The trooper then began chasing the two landspeeders on his C-PH patrol speeder bike; however, the others were able to escape as the trooper crashed his speeder shortly afterward."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The armor of the patrol trooper contained various advanced measures that allowed them to conduct their duties in the sprawling cityscapes of the Galactic Empire. In particular, their helmets possessed an enlarged dome that allowed them access to enhanced imaging electronics, and the overall armor, which shared similarities to the scout troopers', allowed for greater movement than regular stormtrooper armor. In addition, they received real-time traffic data, construction, and other potential obstacles from their headquarters via an in-helmet connection, allowing them to easily navigate various congested city environments. Patrol stormtroopers were armed with EC-17 hold-out blasters, and rode the C-PH patrol speeder bike."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The patrol trooper was created for Solo: A Star Wars Story, written by Lawrence Kasdan and Jon Kasdan and directed by Ron Howard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}