{"url": "Pax_Empirica%E2%80%94The_Wookiee_Annihilation", "categories": ["Category:Real-world articles", "Category:Legends short stories"], "nodes": [{"tag": "h1", "text": "Pax Empirica—The Wookiee Annihilation"}, {"tag": "p", "text": "Pax Empirica—The Wookiee Annihilation is a short story written by Steven L. Kent published in Star Wars: Galactic Battlegrounds: Prima's Official Strategy Guide."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Stormtrooper Wayson Dower is part of an Imperial 200-man troop (with three speeder bike scouts) tasked with a reconnaissance mission (ordered by Grand Moff Wilhuff Tarkin) to Kashyyyk in order to prepare the Wookiees' homeworld for Imperial invasion. Captain Janzor, the leader of the unit, briefs the soldiers on the mission. He reveals that the area they will attack (a treetop city) is so overgrown with foliage that transports cannot land there, so the unit will have to march, and adds that there will be little to no support for the mission: TIE/LN starfighters will be unable to assist because due to the vegetation it will take them some time to locate their target, and thus will be easily shot down when searching for the target, and the treetop cities' platforms cannot support an AT-AT's weight. After Janzor remarks about a tale going around that Wookiees are actually evolved banthas, the troops are given time to prepare for the mission and rest."}, {"tag": "p", "text": "Dower and his friend Corporal Milo Strander stop at the Trooper's Canteen on the way to their quarters. They converse about the mission and other GeNode troopers. The conversation reveals quite a bit about clones, namely that they are psychologically programmed to ignore the fact that most of their comrades look and sound exactly like them, that they are psychologically programmed to think that they are not clones, and that they all develop unique personalities. They also observe the three sergeants selected for the mission, all of whom are from an earlier generation of clones than Strander and so more experienced than the rest of the clones. They also all have the same cold and strict by-the-rules personality. They are named Oswald Strepp, Tak Bazierre, and Dalia. After double-checking their equipment, the troopers enter a transport bound for Kashyyyk."}, {"tag": "p", "text": "The transport enters the atmosphere of Kashyyyk and, after eliminating a few Wookiees hiding in the trees, hits a large branch, knocking Sergeant Bazierre out of the cabin and into the forest. The pilot says that the trees are too thick to break through, and the troops must disembark in the skylift (a device lowered from the transport to bring supplies and soldiers down from a height). Sergeant Strepp selects Dower to go down with the skylift and unload the supplies it lowers. As Dower goes down with the lift he spots the dead body of Sergeant Bazierre. All goes well until the skylift finishes lowering supplies, and a single Wookiee assaults Dower and nearly kills him until Strepp kills it with a single shot. After the skylift brings the soldiers down, Dower remarks to Strander that he thinks Strepp has a grudge against him. After Strepp orders Dower on point and then on guard duty that night, Dower confronts him, and Janzor tells Strepp to ease off on Dower (although he still has guard duty). Janzor then tells the men they must attack a small outpost nearby in order to stop it from sending transmissions informing other Wookiees of the invasion."}, {"tag": "p", "text": "After arriving at the outpost, a Wookiee spots one of the speeder-bike scouts, and the element of surprise is lost. Janzor chooses five soldiers to storm the building (two of them being Strepp and Dalia), and orders Strander and Dower to circle around and shoot any retreating Wookiees, and also tells the soldiers not to use thermal detonators as the building must remain in one piece. Strepp acts as a target for the Wookiees, drawing them out and letting Dalia and several other marksmen kill them. After most of the Wookiees are killed, three of them retreat from the building, and Dower guns them down, earning Strepp's respect. Janzor discusses the next steps of attack with Dalia and Strepp while Strander and the other troopers set up a barracks. After observing the equipment in the outpost and realizing that the Wookiees are more intelligent than they had been told, Dower goes on guard duty."}, {"tag": "p", "text": "Some time later, a massive attack force of Wookiees silently kill another stormtrooper guard and ambush the outpost. Dower runs back towards the post and as he nears it, sees several retreating stormtroopers, Strander among them. He advises Dower not to return to the outpost and Strepp orders Dower and the escaping troopers not to return. Janzor and a dozen other troopers are forced into the building by the sea of Wookiees (Dalia is presumably dead by this point). However, the Wookiees retreat when Strepp climbs to the roof of the outpost and fires on the Wookiees. He draws their attention and continues to fire, ordering Dower and the other survivors to return to the drop site. Strepp tells Janzor he is dropping a thermal detonator to allow them to escape and tells them to drop to the ground when he says to and then run for open ground. He drops it and it goes off. The resulting explosion nearly destroys the outpost, kills Strepp and Janzor as well as other troopers, but kills many Wookiees and allows the surviving troops to escape."}, {"tag": "p", "text": "Strander and Dower briefly speak together and learn that there are five survivors of the battle: Dower, Strander, a soldier with Strander, and two troopers who escaped after Strepp used his detonator. Dower, Strander and the man with him, and the other two are an unknown distance apart. Strander wishes to use beacons that will show their locations through their helmet's vision in order to reunite the group, but Dower says they should not use their helmets anymore because the Wookiees may be monitoring them and says they should follow Strepp's order to return to the drop zone. After running for some time, Dower sees a large group of primal Wookiees and hides. He sees them torture two soldiers (the two who survived thanks to Strepp) who are holding onto tree branches. The Wookiees poke them with branches until they fall and then maul them."}, {"tag": "p", "text": "While still hiding, Dower sees a TIE fighter sized spider with an extremely low temperature reading a meter of branches below him. He stays absolutely still until Strander finds him. Dower expresses guilt over not helping the two troopers but Strander consoles him and says he could have done nothing to a large group of Wookiees. Strander introduces the other survivor, Private Sterns Yennich. Both are unarmed. Strander explains that the two of them were part of a five man group retreating from the base. Strander and Yennich were unarmed and Wookiees eventually picked off the three men in their group who had weapons. They then decide to wait for nightfall so they can use nightvision and have slightly better vision than the Wookiees. While they wait, Yennich discovers the tortured troopers' weapons, and he and Strander scavenge them."}, {"tag": "p", "text": "After night falls, the three of them move forward as quickly as possible. Dower spots the spider again but ignores it and continues to run for the drop zone. Dower theorizes that the spider, living in the darkness under the treebranches, is blind or ultra-sensitive to light. Fortunately, the sun is coming up and will soon force the spider back into the darkness. Strander and Dower push forward through thick overgrowth, but Yennich runs towards a clearing with no branches that the spider is near. Dower tries to warn Yennich but realizes the audio on his helmet does not work. He watches the spider attack Yennich mercilessly with its icy claws. At one point it seems that Yennich will be able to shoot his way out but the spider bites through his armor, killing him. The spider then retreats down through the trees with Yennich's body just as the sun rises."}, {"tag": "p", "text": "Dower realizes that since his helmet's audio is not functioning he has been rendered deaf and throws away his helmet. Strander takes off his helmet while he and Dower discuss what they should do next, but suddenly they hear a voice radiate from Strander's helmet. It is one of the three speeder-bike scouts who accompanied their platoon, and they soon appear near the troops. The speeder-bike scouts explain that they had been looking for the survivors of the platoon all night and mentions that a much larger attack force landed a few hours after theirs. Dower realizes that his platoon only landed to distract the Wookiees from the main invasion force, and when he, Strander, and Yennich were running during the night, the Empire had captured a continent."}, {"tag": "p", "text": "Strander and Dower are returned to the cruiser, promoted to first sergeant, given medals, and will see no more action in the Kashyyyk campaign. Posthumuous medals are rewarded to the dead soldiers of their platoon. Dower briefly considers retiring and moving to a quiet corner of the galaxy, but then decides (probably due to his obedient clone programming, if he was a clone) that such a peaceful place only exists with the help of the Empire and he must serve the Empire and never retire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Clones"}, {"tag": "p", "text": "Published in November 2001, Pax Empirica provided information on clone stormtroopers, several months before the release of Attack of the Clones. The story states that at the time of invasion, nearly 40% of stormtroopers originated with the same template. It goes into detail on a part of the clones' genetic programming that made them ignore their matching appearance of their comrades. It also details the development of personality among the clones, a theme expanded upon in Revenge of the Sith"}, {"tag": "h3", "text": "Wookiees"}, {"tag": "p", "text": "The story suggests that Wookiees may have evolved from banthas. Supposedly, Neimoidian traders crashed on Kashyyyk with a cargo of banthas hundreds of years ago, which quickly adapted. This may correlate with Star Wars: Knights of the Old Republic, which reveals that approximately 30,000 years ago, the Rakata made Kashyyyk an agricultural planet, with a machine that encourages growth and ecosystem management. The machine malfunctioned, causing the massive tree growth on the planet. The machinery itself, as well as the nearby Star Map, were influenced by the Dark Side, which supposedly caused the extremely hostile environment of the Kashyyyk Shadowlands. The game also mentions the Wookiees' legend that they were not native to the world, and speculates that they were put there as garden tenders for the agricultural planet."}, {"tag": "h3", "text": "Timeframe"}, {"tag": "p", "text": "Although the story is said to take place a few years before Star Wars: Episode IV A New Hope, the invasion of Kashyyyk led by Tarkin takes place in 19 BBY in Dark Lord: The Rise of Darth Vader."}, {"tag": "h2", "text": "Appearances"}]}