{"url": "Paxi_Sylo", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Dantooinians", "Category:Farmers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Paxi Sylo"}, {"tag": "p", "text": "Paxi Sylo was a Human male born to parents Griggen and Tashna Sylo on a farm on the Outer Rim planet of Dantooine between the years 30 BBY and 31 BBY. As a child, Sylo was an adventurous daydreamer, doodling stories of the Jedi Knights and the Clone Wars, things he heard about in fragments of stories. In 22 BBY, Sylo witnessed the battle on Dantooine between the Grand Army of the Republic and the Separatist Droid Army. He watched in awe as Jedi Master Mace Windu made short work of a massive droid seismic tank that was crushing Republic forces. After the tank was destroyed, Sylo assisted Windu by offering him a drink of water. Sylo went on to draw sketches of Windu defeating the seismic tank. During the reign of the Galactic Empire, animations emerged of Windu's endeavors on Dantooine that matched the style of Sylo's doodles."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Paxi Sylo was a Human male born to parents Griggen and Tashna Sylo on a large outback farm on the Outer Rim planet of Dantooine between the years 30 BBY and 31 BBY. He was the youngest of seven children, and his entire family harvested tritacale and yot beans to supply a larder for food for the family and to sell off-world, as they had done for ten generations. During his childhood, Sylo enjoyed writing down adventures on his datapad and spare flimsiplast. He was told stories of Jedi Knights and the Clone Wars, a conflict between the Galactic Republic and the seceded Confederacy of Independent Systems, but Dantooine was so far away from the conflict that the stories might as well have been fiction."}, {"tag": "p", "text": "Such stories were made reality in 22 BBY, when the Confederacy sought to take control of Dantooine to help ensure a victory in the coming Battle of Muunilinst. Jedi Master Mace Windu led a force of clone troopers from the Grand Army of the Republic to counter the Separatist Droid Army. As the battle ensued, young Sylo watched from the family farm. During the battle, the Separatists deployed a massive siege weapon called the seismic tank. Sylo watched in awe as Windu single-handedly destroyed the machine, ensuring victory for the Republic. Windu escaped the explosion from the seismic tank by jumping out of the machine, resulting in him landing next to young Sylo. The boy then shared some of his water with the Jedi, who returned to finish off the droid forces. For the next few weeks, Sylo could talk about nothing other than the battle he had witnessed, and he doodled several drawings of Windu defeating the seismic tank on his datapad."}, {"tag": "p", "text": "By the time the Galactic Empire rose, the Sylo family had abandoned their estate, but history lost track of the Sylos after that point. However, during the Galactic Civil War, a bootleg HoloNet broadcast was made showing animations of Windu's activities during the battle on Dantooine. The Imperial Security Bureau unsuccessfully attempted to stamp it out, as it began to gain a cult status among would-be members of the Alliance to Restore the Republic. Though the animations were unattributed, the style very closely resembled that of Sylo's datapad doodles."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sylo was an adventurous child who was prone to daydreaming and had a very active imagination. He was fascinated by tales of Jedi Knights and the Clone Wars, and loved to write and illustrate stories related to those tales. He was very quiet, but that all changed after he met Mace Windu, as he could not stop talking about his encounter with the Jedi Master. Sylo had brown hair, black eyes, and light tan skin. He wore a hat and sleeveless shirt with shorts that were held up by a belt from which hung a canteen filled with water. He also wore a sort of band on his left wrist and walked around barefoot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Paxi Sylo made his first and only appearances in the twelfth and thirteenth chapters of the animated television series Star Wars: Clone Wars. The characters for the episodes were designed by Andy Suriano, and both episodes aired in 2004. Sylo later received an entry in the original Databank on StarWars.com, posted in 2004, which identified him by name for the first time."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}