{"url": "Pax_Bonkik", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Mechanics", "Category:Rodians", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Pax Bonkik"}, {"tag": "p", "text": "Pax Bonkik was a male Rodian mechanic, and along with his brother, Trax Bonkik, served as a slave to the Podracer Mars Guo. Guo was a particularly overbearing owner, and worked the siblings to exhaustion. Pax eventually struck up a friendship with the racer Teemto Pagalies, who abhorred slavery, especially since the object of his affections, Ann Gella, was herself a slave. At the Boonta Eve Classic of 32 BBY, Guo sustained crippling damage from the former champion, Sebulba. While he was healing from his wounds, Sebulba, bitter that he had lost the race to young Anakin Skywalker, arranged to have Guo's possessions auctioned off."}, {"tag": "p", "text": "Pagalies, who had himself survived a crash during the race, was only able to free Pax, with Trax being sold off to Sebulba. Pax, however, was determined to save his brother, and worked for Pagalies until he had earned enough to repay the kindly Veknoid. When Pagalies won the Aleen Classic, he had enough credits to free Ann Gella, but at the last moment, he chose to free Trax, finally reuniting him with his brother."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The Rodian male Pax Bonkik grew up on Rodia, alongside his brother, Trax. Their parents were spice addicts, and were constantly out of work, and so they made the decision to sell their children into slavery. Pax decided to look out for his brother during those trying times, and the two drifted from master to master, job to job, eventually acquiring a variety of skill sets. They developed into mechanics, and their skills garnered them the attention of the minor league Podracer, Mars Guo."}, {"tag": "h3", "text": "Service under Guo"}, {"tag": "p", "text": "Guo forced the siblings to work to exhaustion on his Podracer, a Plug-2 Behemoth, in the pursuit of what Guo deemed to be perfection. The pair were also subjected to Guo's bragging and boasting, which led Pax to seek solitude. He found it in Teemto Pagalies, another Podracer. Pagalies was totally abhorrent to the concept of slavery, and in turn, he struck up a friendship with Pax. Pagalies' resentment of slavery, however, was likely due to the fact that the object of his affections, Ann Gella, was in fact a slave of the champion Podracer, Sebulba."}, {"tag": "h3", "text": "Boonta Eve Classic"}, {"tag": "p", "text": "In 32 BBY, Guo intended to compete in the Boonta Eve Classic on Tatooine, one of the largest and most prestigious of all Podraces. Shortly before the race, Trax entered into an argument with Guo, and the latter mercilessly beat the hapless Rodian to a pulp. Guo claimed that after the race, he would sell Trax off, thereby separating the siblings for the first time. Pax, seeking to avert such an occurrence, contacted Pagalies, who was also participating in the race. He explained the situation, and also told Pagalies that Guo had his eyes on Gella, and likely intended to purchase her from Sebulba. Pagalies was skeptical, but he disliked the idea of having the Bonkiks separated, or worse, the thought of Gella in the clutches of Guo."}, {"tag": "p", "text": "During the race, Guo's Podracer was destroyed by Sebulba. While this could have proved advantageous for the Bonkiks, it turned out to be disastrous. Sebulba, bitter that he had lost the race to Anakin Skywalker, a local boy, arranged to have Guo's possessions auctioned while the Phuii lay in the infirmary. Pagalies had also sustained the loss of his Podracer during the tumultuous race, and was only able to afford to buy Pax at the auction, while Trax fell into the possession of Sebulba."}, {"tag": "h3", "text": "Service under Pagalies"}, {"tag": "p", "text": "Despite the fact that he was free, Pax decided to stay on with Pagalies, and served as his mechanic. Together, they traveled the racing circuit, with their eyes on the lookout for Sebulba or Trax. Eventually, Pax was able to raise enough credits to pay Pagalies back for his kindness on Tatooine. The Veknoid, with Pax's help, won the Aleen Classic, and was finally able to purchase Ann Gella's freedom. At the last minute, however, Pagalies relented, and purchased Trax, reuniting the Rodians. The siblings would eventually stay in each other's company until death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The one constant in Pax Bonkik's life was the companionship of his brother, Trax. They stayed together through their slavery, and had effectively looked out for each other as they matured. As such, the well-being of Trax was high in Pax's priorities. When the machinations of Sebulba threatened to tear them apart, Pax was willing to go into debt and test his friendship with Teemto Pagalies in order to secure the safety of his brother. When Pagalies was only able to pay for Pax, the Rodian stayed in the Podracer's company, and even though he did not have to, worked as a mechanic for Pagalies. His mechanical skills served him well enough to allow him to raise money to pay back Pagalies, when the opportunity arose."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pax Bonkik first appeared in George Lucas' Star Wars: Episode I The Phantom Menace, during the Boonta Eve Podrace scene. The backstory of the character was elaborated on by Ashley Sharpe, through the StarWars.com Hyperspace feature, \"What's The Story?.\" Sharpe named the character, and tied him into the backstories of Teemto Pagalies, Mars Guo, and Sebulba."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}