{"url": "Peace_Brigade", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Jedi hunters", "Category:Peace Brigaders", "Category:Political factions", "Category:Slaver organizations", "Category:Yuuzhan Vong military units"], "nodes": [{"tag": "h1", "text": "Peace Brigade"}, {"tag": "p", "text": "The Peace Brigade was a paramilitary group that collaborated with the Yuuzhan Vong invaders during the Yuuzhan Vong War. Their symbol was the image of a Human hand and a Yuuzhan Vong hand clasped, as equals. Ironically, in the Yuuzhan Vong language, the phrase for peace was indistinguishable in meaning from the phrase for submission."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Peace Brigade was formed by sentients who thought that the New Republic maintained an apathetic attitude and did not react properly to the threat of the Yuuzhan Vong invasion. They presumed that the Yuuzhan Vong would ultimately win the war; so, the Peace Brigade thought it best to become the allies of the Yuuzhan Vong against the Jedi. In the process of disrupting planetary governments, capturing ranking officials, and turning over Jedi prisoners to the invasion force, the Brigade was only sealing their own fate, for the Yuuzhan Vong had little use for them once the war had reached a conclusion. But, as membership in the Brigade continued to grow and expand beyond the control of their loose governing structure, it was obvious they required a clear, more rigid command structure to continue functioning as a single, cohesive organization."}, {"tag": "p", "text": "The planet Metalorn was conquered by the Yuuzhan Vong and then became a recruiting place for the Peace Brigade."}, {"tag": "p", "text": "After the Yuuzhan Vong drove the Hutts out of their former Space, Ylesia was granted to the Brigade for use as a location of their central headquarters, where it became the unofficial armed forces of the newly established Ylesian Republic. The hierarchy was simplistic: a single headquartered group, with command branching down into the smaller, independent cells operating furtively throughout the galaxy. In function, the Brigade was an ideological combination of the Bothan Spynet and Black Sun, employing both guerrilla tactics and political manipulation. The Brigade deployed its own fleet, but its most effective weapon was still subtle manipulation of galactic politics, furthering the goals of their alleged allies, the Yuuzhan Vong."}, {"tag": "p", "text": "In the later years of the war, the Peace Brigade and various mercenary forces were used as auxiliaries by the Yuuzhan Vong, guarding their conquests and defending rear lines from New Republic raids."}, {"tag": "p", "text": "When Thrackan Sal-Solo reappeared, the Yuuzhan Vong forced him to become Commander-in-Chief of the Ylesia by promising not to attack Sal-Solo's homeworld, Corellia. When Ylesia itself was attacked by a joint task force of the New Republic and Bothan Fleets, once again the Brigade's command and control ability was crippled; and another blow was dealt when Sal-Solo was captured during the battle. But much like the Black Sun and similar clandestine organizations, the Brigade would soon emerge revitalized and revivified, and with new leadership to continue their fight."}, {"tag": "p", "text": "By this point, however, the galaxy at large had realized and accepted the fact that the Yuuzhan Vong had broken their word far too many times to be again trusted with the promise of mercy. Ironically, at the latter stages of the conflict, the Yuuzhan Vong began to use Peace Brigadiers in their slave forces; however, most of the Peace Brigade remained loyal to the Yuuzhan Vong. Several Peace Brigaders were used to guard the Caluula spaceport in the final year of the conflict, and were later arrested by Galactic Alliance forces. After the Battle of Yuuzhan'tar, ranking members of the Peace Brigade were placed on trial for both treason and war crimes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}