{"url": "Paz_Vizsla", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Humanoids", "Category:Males", "Category:Children of the Watch"], "nodes": [{"tag": "h1", "text": "Paz Vizsla"}, {"tag": "p", "text": "Paz Vizsla was a male Heavy Infantry Mandalorian who was a member of the Tribe during the reign of the New Republic, living in a hidden covert on the planet Nevarro. Vizsla had a great disdain for the fallen Galactic Empire and anyone affiliated with it due to the Empire's role in the Great Purge against the Mandalorians."}, {"tag": "p", "text": "When the Mandalorian bounty hunter Din Djarin used Imperial-seized beskar provided to him by the forces of an Imperial remnant to create his armor, Vizsla confronted and fought Djarin for doing business with the Empire. The altercation was broken up by the Tribe's armorer. Vizsla and other members of the Tribe later protected Djarin from a number of bounty hunters, allowing him to escape to his starship with a child he had rescued from the Imperial remnant."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the era of the New Republic, Paz Vizsla was a member of the Tribe, residing in a Mandalorian covert on the planet Nevarro. Due to the Galactic Empire's Great Purge against the Mandalorians, the Tribe's members were forced to remain hidden in their enclave, with Vizsla guarding the armory within. In around 9 ABY, Vizsla witnessed the Mandalorian bounty hunter Din Djarin enter the covert with a camtono of beskar. Vizsla and several other Mandalorians watched as Djarin gave the beskar to the Tribe's armorer, intending to have armor forged from it. Vizsla inspected the beskar, which had been taken by the Empire during the Great Purge and given to Djarin by an Imperial remnant in return for the delivery of the infant Grogu. Accusing Djarin of cowardice, Vizsla confronted him, leading to an altercation between the two Mandalorians. As Djarin and Vizsla two held their vibroblades at each other, the Armorer broke up the fight, reminding them of the Way of the Mandalore. Vizsla stepped aside, allowing the Armorer to forge armor for Djarin."}, {"tag": "p", "text": "Shortly afterward, Djarin was confronted by a number of Bounty Hunters' Guild members led by Greef Karga after he rescued Grogu from the Imperial remnant. Karga intended to kill Djarin if he did not hand over Grogu, but the members of the Tribe arrived to protect the bounty hunter, descending from above with their jetpacks. Vizsla landed near Djarin, shooting down a number of bounty hunters with his blaster cannon. Turning to Djarin, Vizsla told him to escape while the Tribe held off the bounty hunters. Djarin stated that the enclave would need to be moved due to the Tribe's interference, which Vizsla acknowledged, citing the Way of the Mandalore. Vizsla provided cover as Djarin escaped to his starship, the Razor Crest, leaving Nevarro. As the Razor Crest departed, Vizsla flew alongside the vessel with his jetpack and saluted Djarin before turning back towards the ground."}, {"tag": "p", "text": "As a result of the rescue, the Bounty Hunters' Guild lost control of Nevarro, and the Imperial remnant cracked down on the Tribe for their part in the incident. The covert was attacked by forces of the remnant, and a number of Mandalorians were killed. The Armorer managed to survive the attack, believing that some Mandalorians had managed to escape the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A humanoid male Mandalorian, Paz Vizsla despised the Galactic Empire and anyone who affiliated themselves with it due to the events that had happened to the Mandalorians during the Great Purge. A born survivor, he was determined to help preserve the Mandalorian heritage after the event. Vizsla accused the Mandalorian bounty hunter Din Djarin of being a coward for taking jobs from former Imperials. However, despite their differences, Vizsla followed the Way of the Mandalore foremost, protecting Djarin when he was attacked by the Bounty Hunters' Guild."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Vizsla was skilled in combat, able to wield a heavy blaster cannon and fend off a number of attackers at once."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Paz Vizsla wore heavy Mandalorian armor made of beskar with a blue color and a mythosaur skull emblem on his pauldron. His left vambrace held a large wrist-mounted flamethrower. He also wore a jetpack and a cape, and carried both a heavy blaster cannon and a vibroblade."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Paz Vizsla appeared in Chapter 3 of the 2019 television series The Mandalorian, released on November 22, 2019. While not identified in the episode, Paz Vizsla's name was given in the credits. When \"The Sin\" originally aired, its credits identified him as \"Paz Vizla,\" though they were later updated to read \"Paz Vizsla.\" Vizsla was voiced by series creator Jon Favreau—a nod to his first role for Dave Filoni, the character of Pre Vizsla in the animated series Star Wars: The Clone Wars—and portrayed by Tait Fletcher, who previously appeared as a trawler in the first episode of the series. Fletcher learned about his part as Vizsla shortly after he received the news that he was chosen to play the trawler character, but was unaware of the exact role until construction of the suit was underway. Fletcher claimed that playing his two characters was an incredible experience, remarking on the galvanizing nature of Vizsla's character."}, {"tag": "p", "text": "Vizsla was designed by Brian Matyas, who was influenced by the Brutalist and geometric shapes of Art Deco and the German Expressionist movement when designing Vizsla's angular helmet. The blaster cannon Vizsla carried was a nod to the M56 Smartgun from the science fiction film Aliens. Matyas created concept art of Vizsla in the Mandalorian covert and during the Nevarro skirmish, while art depicting a Mandalorian using a jetpack to fly alongside the Razor Crest was created by Doug Chiang and John Park; however, the pictured Mandalorian's armor appears similar to Djarin's rather than Vizsla's."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}