{"url": "Attempted_assassination_of_Allana_Solo", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Assassination attempts", "Category:Battles of the Dark Nest Crisis"], "nodes": [{"tag": "h1", "text": "Attempted assassination of Allana Solo"}, {"tag": "p", "text": "In 36 ABY, the Gorog were hired to kill the daughter of Tenel Ka Djo, the Queen Mother of Hapes. With the intervention of her father, Jacen Solo, the Chume'da was saved."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Dark Nest Crisis, Jacen Solo went to Hapes to ask his old friend Tenel Ka Djo, who was now the Queen Mother, to send a fleet to the Unknown Regions to guard the The Colony from Chiss assault. She agreed to send the fleet, but only if he stayed the night with her, which he did."}, {"tag": "p", "text": "One year later, Djo secretly invited Solo to come and visit her on Hapes. He was originally supposed to take his cousin, Ben Skywalker, camping on the forest moon of Endor, and brought him along as well. Little did Solo know, but Djo had gotten pregnant after their night together the previous year, and had used the Force to prolong their daughter's gestation, keeping her parentage a secret. Since her daughter was born, however, Djo had felt a sense of danger through the Force."}, {"tag": "p", "text": "When Solo was holding his daughter for the first time, the sense of danger peaked. After reactivating DD-11A, the bodyguard and nanny droid for the new Chume'da, the droid warned of an insect infestation. Skywalker had been joined to a Killik previously, and recognized the insects instantly, and considered them safe. He realized, however, that the Gorog had been hired to assassinate the Chume'da."}, {"tag": "p", "text": "Solo had to put Skywalker into a Force grip, and applied pressure to his carotid arteries to induce sleep, and prevent Skywalker from attacking DD-11A. While the droid used its flamethrower to attack the bugs, Solo shrouded Djo, Skywalker, his daughter, and himself through a Force technique he had learned from the Adepts of the White Current. DD-11A escaped through a hole in the floor Solo had cut with his lightsaber, which led the bugs away. Djo and Solo used their lightsabers and the Force to finish off the rest."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Gorog had possessed knowledge of an escape tunnel, which only the Queen Mother, or a former Queen Mother would know. This led Djo and Solo to believe that Ta'a Chume, a former Queen Mother, and Djo's grandmother, was the one who had hired the Gorog. Solo went to question her, and would have killed her had Djo asked him not to, wanting to deal with her grandmother in her own way. Ta'a Chume told Solo that the Gorog had approached her first, because they were upset over Djo's interference at Qoribu. She also told Solo that she had ordered the assassination in order to prevent the offspring of two Jedi from being the heir to the Hapan throne, and had to give the bugs navicomputer technology to get them to kill the Chume'da instead of Djo. Solo was ready to kill her, but she told him that if she died, other assassins had orders to kill Djo. In anger, he then poured Force energy into her head rendering her comatose, but not dead."}, {"tag": "p", "text": "Solo later rubbed Skywalker's head, and erased his memories of the events on Hapes. He replaced them with new memories of the Moon Falls on Endor, to keep his daughter's identity a secret."}, {"tag": "h2", "text": "Appearances"}]}