{"url": "Pawn", "categories": ["Category:Legends articles", "Category:Dark side organizations", "Category:Force-sensitives"], "nodes": [{"tag": "h1", "text": "Pawn"}, {"tag": "p", "text": "Pawn was the title given to any of the handpicked agents of Cronal during his Restoration campaign against the New Republic."}, {"tag": "p", "text": "The Pawns were selected from among Force-sensitive prisoners taken by Cronal's raids. They were taken to the Election Center on Mindor, where crystals of meltmassif would be surgically implanted into the brain. These crystals would spread throughout the nervous system of the prisoner, which would facilitate Cronal's control over them through the Force. The transformation was completed with the attachment of a Shadow Crown to the patient's skull, which served as a control device that cemented the link between the Pawns and their master. The Crown would create a holographic mask over the wearer's face, depicting the visage of Lord Shadowspawn."}, {"tag": "p", "text": "Around the time of the Battle of Mindor, the Pawns served as the highest-ranking minions of Cronal, able to command his soldiers with simple hand gestures. Their true purpose, however, was more sinister. Cronal relied on them as vessels into which he could send his spirit, so that the Pawns were little more than living extensions of his will, as well as bodies for him to inhabit should his own body die or be destroyed."}, {"tag": "p", "text": "They were also essential to Cronal's plan to take control of Luke Skywalker, substituting the young Jedi's conscious mind with his own and building up his image as an heir to Palpatine to become the new Emperor. His plan failed, however, with the intervention by one of his own Pawns."}, {"tag": "p", "text": "Cronal was not the only Sorcerer of Rhand to employ Pawns. Other members of this order had the know-how, however they didn't have access to meltmassif and used Nihil smokestone instead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}