{"url": "Pech_Seki", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Humans", "Category:Males", "Category:Meatlumps"], "nodes": [{"tag": "h1", "text": "Pech Seki"}, {"tag": "p", "text": "Pech Seki was a Human male member of the Meatlump gang, a group of technology-hating thugs based on the Core World Corellia at the time of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sometime following the Battle of Yavin, Seki lived in the Meatlump Cave near the city of Tyrena and participated in the gang's activities against the use of technology on the planet. But Seki wanted to quit being a Meatlump. Circa 1 ABY, he was ready to leave the cave and the Meatlumps behind, but he had left his bag and his strongbox behind in the cave. Luckily, he met an adventurer that worked for the Corellian Security Force as an independent agent. The adventurer investigated the attack on the starship captain Osto Grissom and planned to disrupt the Meatlumps' vandalisms. The agent agreed to help Seki and a short time later, he got his belongings back and could finally leave the life as a Meatlump behind."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pech Seki was a Non-Player Character (NPC) in Sony Online Entertainment's MMORPG Star Wars Galaxies, prior to its closure on December 15, 2011. Pech Seki was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006. He could be found right inside the Meatlump Cave near Tyrena on Corellia. During the quest \"CorSec Case Files: Assault and Battery\" — which was a part of the Legacy quest, the longest quest line of the game — the player entered the cave to kill several Meatlumps and destroy their supplies. Seki offered a small side quest that could be completed by finding his bag and strongbox inside of the cave. The reward for this mission was app. 15,000 credits."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}