{"url": "Pelikki", "categories": ["Category:Canon articles", "Category:Aquatic creatures", "Category:Birds", "Category:Carnivorous creatures", "Category:Creatures of Naboo", "Category:Flying creatures", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Pelikki"}, {"tag": "p", "text": "Pelikki were a species of non-sentient, river-dwelling birds from the planet Naboo. They had an expandable throat pouch in which they held their aquatic prey when hunting."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Pelikki were a non-sentient bird species from the planet Naboo. Closely related to ducks, they were characterized by a long bill, a gular pouch, two large feet, and two functional wings. Their plumage could be grayish-green. A pelikki's head, perched atop a long, curved neck, sported eyes and three fleshy growths on the upper parts."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Dwelling in rivers, the pelikki fed on smaller aquatic life forms. Their beaks helped them hunt their prey, while their throat pouch could expand to hold their catch."}, {"tag": "p", "text": "Pelikki remained largely untamed, and were easily startled by sudden noise or movement. However, in certain areas of Naboo, the human citizens of the planet fed them for pleasure."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The pelikki evolved on Naboo, an idyllic world close to the border of the galaxy's Outer Rim Territories."}, {"tag": "p", "text": "During the Invasion of Naboo by the Trade Federation in 32 BBY, a flock of pelikki lived in an estuary of the Solleu River in the city of Theed, near the Royal Palace. When a Gungan bongo submarine transporting two Jedi bobbed to the surface, causing a loud rush of bubbles, those pelikki panicked and took flight."}, {"tag": "h2", "text": "Pelikki in the galaxy"}, {"tag": "p", "text": "In Galactic Basic Standard, the most prevalent language in the galaxy, the phrase \"sitting pelikki\" was used for someone or something that was unprotected and vulnerable to an easy attack."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The pelikki first appeared in the 1999 movie Star Wars: Episode I The Phantom Menace, in which they were not named. In canon, they were first identified in the 2017 reference book Star Wars: The Visual Encyclopedia, although the name originated in the 2012 Legends book Star Wars: The Phantom Menace: The Expanded Visual Dictionary."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}