{"url": "Pekt%27s_clan", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Clans", "Category:Trandoshan organizations", "Category:Unidentified organizations"], "nodes": [{"tag": "h1", "text": "Pekt's clan"}, {"tag": "p", "text": "A Trandoshan clan operated from the planet Trandosha, amassing significant power and fortune. The slaver Pekt was a prominent member of the clan, known for his sadistic treatment of Wookiees prior to the Liberation of Kashyyyk."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A wealthy and powerful Trandoshan clan operated an empire on the planet Trandosha in the Kashyyyk system. The clan employed servants and participated in the Trandoshan's ancient rivalry with the Wookiees of Trandosha's neighboring planet—Kashyyyk—keeping Wookiee prisoners in a garrison."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One wealthy male member of the clan fathered the sadistic Pekt, who became legendary among his people for escalating the conflict against the Wookiees and expanding the clan's empire. As a hatchling, Pekt experimentally tortured his families' servants with slave collars and restraints. In adolescence he experimented on the clan's Wookiee prisoners, eventually using his father's fortune to study their biology and develop restraints and techniques to efficiently capture and enslave them."}, {"tag": "p", "text": "Pekt developed a reputation for his ability to kill Wookiees, partnering with the Trade Federation during their failed colonization and war against the Wookiees on the moon Alaris Prime, between 39 BBY and 36 BBY. Pekt was also hired by the bounty hunter Bossk to create several customized weapons, for which he received several fine Wookiee pelts that he passed on to his egg-litter. After the rise of the Galactic Empire in 19 BBY, Pekt was hired by Moff Hindane Darcc to oversee the slaving operations on Kashyyyk throughout the Imperial Period, ultimately being killed there by forces led by the Wookiee Chewbacca during the Liberation of Kashyyyk in 4 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pekt's clan was described in his DataBank entry in the 2001 LucasArts video game Star Wars: Galactic Battlegrounds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}