{"url": "Attichitcuk%27s_camp", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alaris Prime locations", "Category:Colonies"], "nodes": [{"tag": "h1", "text": "Attichitcuk's camp"}, {"tag": "p", "text": "Attichitcuk's camp was a settlement built by the Wookiee Attichitcuk on the moon Alaris Prime at some point between 39 BBY and 36 BBY, during his group's colonization attempt of the moon. The camp was built in a small forest clearing and only had four buildings. After Attichitcuk built the camp, it was found by his son, Chewbacca, and his friend Shoran with the help of Jedi Master Qui-Gon Jinn. At the same time, four gundarks, predators on Alaris Prime, attempted to destroy the camp, but the three Wookiees were able to defend it."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A camp was built by the Wookiee Attichitcuk on Alaris Prime, a forest moon that a group of Wookiees were trying to colonize. The camp was built in a small clearing in the forest, but markers were placed so any travelers could find a path to the camp. The camp consisted of four buildings: one command center, the main building in the camp; and three prefab shelters, which could house Wookiees living in the compound."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Attichitcuk built his camp at some point between 39 BBY and 36 BBY as part of the Wookiee colonization effort on Alaris Prime. The camp was one of the first settlements on Alaris Prime and was built shortly after Attichitcuk arrived on the moon. Attichitcuk stayed at the camp until his son, Chewbacca, and his friend Shoran arrived there with assistance from Jedi Master Qui-Gon Jinn, who had been sent by the Jedi Council to oversee the colonization effort. At the same time as their arrival, the camp was attacked by four gundarks, the main predatory threat on Alaris Prime. The three Wookiees quickly fought off and killed the gundarks in order to stop them from destroying the camp. Attichitcuk, Chewbacca, and Shoran continued to lead a successful colonization effort on Alaris Prime."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Attichitcuk's camp was first mentioned and named in the strategy guide for the 2001 LucasArts video game Star Wars: Galactic Battlegrounds, which was released shortly before the game was. The camp appears in the first level of the Wookiee tutorial campaign, titled \"Moving and Attacking,\" in which the player has to find the compound using Chewbacca and Shoran and then defend it from a gundark attack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}