{"url": "Pekt", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Males", "Category:Slavers", "Category:Trandoshans"], "nodes": [{"tag": "h1", "text": "Pekt"}, {"tag": "p", "text": "Pekt was a male Trandoshan from Trandosha who was born into a powerful family, and became a slaver. After the Battle of Endor, he joined with the Imperial Moff Hindane Darcc to enslave the Wookiees on Kashyyyk. He and Darcc were subsequently chased off Kashyyyk by a Wookiee army led by the Wookiee Chewbacca. Pekt was then killed in the raid on Avatar Orbital Platform."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "The male Trandoshan Pekt was born on the species' homeworld, Trandosha. He was a member of a powerful clan, and at a young age, began to expand his clan's empire. As a young hatchling, he used his servants in experiments with slave restraints. After reaching the molt stage, Pekt moved on to the Wookiee prisoners-of-war kept in his clan's garrison and soon gained a reputation for his sadism."}, {"tag": "p", "text": "Realizing that the Wookiees had great strength, Pekt used his father's fortune to research their biology, and developed a series of techniques to capture and enslave them. He earned a certain degree of fame when he was consulted by bounty hunter Bossk in order to make some custom weapons for him, and in return, Pekt received a number of fine Wookiee pelts, which he gifted to his egg-litter. On one job, a Wookiee broke free, seized Pekt in his paws, and tore off the Trandoshan's arms while Pekt just stared at him. The Wookiee was then killed and Pekt returned to Trandosha. Within a month, his arms had regenerated, a trait shared by all Trandoshans, and he was back at the camp."}, {"tag": "p", "text": "Sometime between 39 BBY and 36 BBY, Pekt was an ally of the Trade Federation during their illegal colonization of Alaris Prime, a moon of Alaris in the Kashyyyk system. When the rightful Wookiee colonists first landed there they encountered and destroyed a Trade Federation power core, which had been previously damaged by gundarks living on the moon. A B1-Series battle droid named OOL-2 found the remains of the power core and identified the gundarks as the perpetrators to Trade Federation Viceroy Nute Gunray, who ordered the droid to exterminate the gundarks, skin them, and bring their pelts to the Trandoshans."}, {"tag": "p", "text": "The Wookiees and the Trade Federation encountered each other when they both attacked the gundark nest. The Trade Federation attacked the Wookiees, leading to several conflicts on the moon which saw the destruction of several Trade Federation installations before the Wookiee leader Chewbacca planned a final attack on their last base. Jedi Master Qui-Gon Jinn arrived to participate in the Battle for Alaris Prime, sighting several of Pekt's transport ships and correctly deducing that they belonged to Trandoshan slavers. The Wookiee objective in the battle was to destroy the Trade Federation fortress, which they achieved using energy pummels. Jinn alerted the Wookiees that two of Pekt's transport ships flew from the wreckage, inside one of them the Trandoshan claimed the Wookiee victory was only a minor setback and that he would return as Wookiee pelts were still valuable."}, {"tag": "h3", "text": "Enslavement of the Wookiees"}, {"tag": "p", "text": "Gradually, Pekt's reputation as a Wookiee-exterminator garnered him several jobs around the galaxy, working for bounty hunters, gangsters, and eventually the Galactic Empire. He hired a task force of ex-Trandoshan Army regulars and it was rumored that he could clear a Wookiee village in less than a standard week."}, {"tag": "p", "text": "When the Empire took control of Kashyyyk, under advisement from Trandosha, they enslaved the major cities of the planet. Pekt and the Trandoshan slavers were selected by Moff Hindane Darcc to oversee the entire slaving operation, and Pekt drew up the plans for the Avatar Orbital Platform, a slaving hub in Kashyyyk's orbit. Pekt knew as long as the Empire controlled Kashyyyk, he could act with impunity, and he did—stepping up both his experiments and his slaving trade."}, {"tag": "p", "text": "However, in 4 ABY, after the Battle of Endor, the enslaved Wookiees, freed and gathered by New Republic members Han Solo and Chewbacca, attacked Pekt and Darcc's holdings. After the Wookiee army destroyed Darcc's Palace, Pekt and the Moff escaped in a shuttle, with a hold full of Wookiee slaves, to the heavily protected Avatar Orbital Platform. There they stood in the station's fortress. The Wookiee army followed them to Avatar and knocked out the station's airbases, preventing their escape. With the arrival of Luke Skywalker, Lando Calrissian, and Rogue Squadron, their fortress was demolished. Solo and Pekt traded insults, and Pekt and Darcc were soon killed, one of the most important supportive acts for the Kashyyyk Resistance. The orbital station was destroyed soon afterwards."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "At an early age, Pekt experimented with slavery restraints. When a Wookiee was trying to tear his arms off, he just stared back coldly. Pekt, like Trandoshans in general, was not considered to be honest or brave. At the time of his death, he had a reputation for brutality and was considered to be especially sadistic. Pekt also considered Humans to be ugly."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pekt was voiced by Frank Welker in the 2001 video game Star Wars: Galactic Battlegrounds. He received his first canonical mention in the game's strategy guide, and went on to appear in the game's Chewbacca campaign. He and Darcc escape in a scripted event at the end of the fifth mission. In the sixth mission, taking place on Avatar, the player's objective is to kill Pekt and Darcc."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}