{"url": "Attichitcuk/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic members", "Category:Diplomats", "Category:Kashyyyk residents", "Category:Males", "Category:Military personnel", "Category:New Republic individuals", "Category:Wookiee Chieftains", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Attichitcuk"}, {"tag": "p", "text": "Attichitcuk (meaning \"first heroic companion\" in Shyriiwook), known as \"Itchy\" for short, was an influential male Wookiee Chieftain who lived during the last centuries of the Galactic Republic. He sired two pups, a female named Kallabow and a male named Chewbacca, the latter of whom became a fabled hero of the Rebel Alliance that fought the authoritarian Galactic Empire. A supportive father, Attichitcuk had allowed his only son to leave the household to travel all over the galaxy in search of adventure around the year 150 BBY. In his prime, Attichitcuk played a leading role on his homeworld of Kashyyyk, a planet covered in immense forests. It was he who represented his Wookiee brethren in the Galactic Republic negotiations for colonization rights to Alaris Prime, a moon of the gas giant Alaris. With the help of both his son and the Jedi Master Qui-Gon Jinn, the chieftain drove out invasion forces of the Trade Federation that occupied Alaris Prime illegally."}, {"tag": "p", "text": "When the Clone Wars broke out in 22 BBY, Attichitcuk was already an old, retired warrior, but he still joined in at least one fight. When the Confederacy of Independent Systems invaded Kashyyyk toward the end of the three-year conflict, Attichitcuk engaged in combat along his fellow warriors and the Republic forces led by the Jedi Master Yoda. That event, known to future generations as the Battle of Kashyyyk, was one of the last conflicts fought during the Clone Wars. The Republic fell apart shortly afterwards and was replaced by the Galactic Empire, an autocratic regime led with an iron fist by Emperor Palpatine. Following the new government's xenocentrist policies, the Wookiees were enslaved. Attichitcuk, however, was left behind on Kashyyyk while his son Chewbacca was still traveling offworld. Living with his daughter-in-law Mallatobuck, the old Wookiee focused on raising his grandson Lumpawarrump."}, {"tag": "p", "text": "Nearly two decades later, in 1 ABY, the Empire enacted a blockade on Kashyyyk. On Life Day, a most sacred family holiday, the former Chieftain Attichitcuk and his family were visited by Imperials who were investigating for ties between the Wookiees and the Rebel Alliance. Three years afterwards, the gray Wookiee was captured by Nagai slaver Ozrei N'takkilomandrife, but was subsequently freed by Chewbacca and his Human partner Han Solo. A few months later that same year, Kashyyyk was taken over once again when the Imperial Moff Darcc combined forces with the Trandoshan slaver Pekt. Attichitcuk shouldered the responsibility of calling Chewbacca and his Rebel allies for help, but he was kidnapped by the Trandoshan, who planned on having him skinned. One more time, Chewbacca and Solo saved Attichitcuk from certain death. In his late years, Attichitcuk had become an elder statesman retired to his family treehouse in the city of Rwookrrorro, enjoying his wood carving and the company of his kin. However, his peaceful existence was stricken by misfortune two decades later, when Chewbacca found his doom during the Yuuzhan Vong War, a pan-galactic conflict that was fought between 25 and 29 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born on the planet Kashyyyk in the year 350 BBY, Attichitcuk was a male Wookiee of the common, brown-furred rwook subspecies. He was descended from Bacca, the first great Wookiee Chieftain, who was also the first Wookiee to encounter offworld life and the maker of the legendary Ceremonial Blade. Attichitcuk's family originated from Rwookrrorro, the capital of Kashyyyk, and his name was made of three words that meant \"father,\" \"hero\" and \"husband\" in Shyriiwook, the main Wookiee language. Attichitcuk's father had once killed another Wookiee in a duel, which had caused a lasting enmity between his clan and that of the deceased opponent."}, {"tag": "p", "text": "In his youth, Attichitcuk became noticed for the audacious hunting raids he made at the very bottom of the dangerous wroshyr tree forests. On Kashyyyk, warriors were expected to take part in such expeditions to protect the civilians from the predators roaming below the treehouses. As a consequence, skilled hunters like Attichitcuk were held in high regard in the Wookiee culture. Once, he slaughtered a pack of twenty ferocious katarns with only a ryyk blade, collecting their claws after killing them. However, despite his outstanding abilities, Attichitcuk was no braggart, and he long kept that particular exploit a secret. In addition to his mastery of edged weapons, he was also proficient with the bowcaster, the traditional ranged weapon of the Wookiees."}, {"tag": "p", "text": "At some point, the warrior sired two pups: a female named Kallabow, and a male born in 200 BBY, whom he christened Chewbacca, as a tribute to his legendary ancestor. Attichitcuk encouraged his younglings to explore the differences that manifested in their youths. It was he who gave his son Chewbacca a wooden starship toy that inspired his wanderlust. By telling him tales of adventure and mysterious places, Attichitcuk passed his curiosity and ambition to his offspring. When his son was deemed ready, Attichitcuk took him to the Well of the Dead in the Shadowlands so he could perform his hrrtayyk ceremony, the Wookiee coming-of-age ritual. Unbeknownst to Attichitcuk, his son had already ventured at least twice in the Shadowlands before his hrrtayyk, one with his friend Salporin and another with the recently initiated Tarfful of Kachirho. One day, Chewbacca found the claws of the twenty katarns his father had collected, lifting the veil on Attichitcuk's past as an ace hunter."}, {"tag": "p", "text": "At the height of his powers, Attichitcuk took the mantle of chieftain, leading troops to war. As his pups grew older, Attichitcuk settled down into a leadership role in the community, advising the disparate Kashyyykian councils and tribes. He had the role of a peacemaker and even-handed referee during inter-tribal conflicts. In 150 BBY, Attichitcuk allowed his only son to leave for adventures in the vast universe, as he had succumbed to the wanderlust of Wookiee adolescence. The young adventurer would make occasional stopovers on Kashyyyk to visit his father and Mallatobuck, a beautiful female he had once saved from the clutches of Trandoshans, a reptilian species from the neighboring Dosha who had been the Wookiees' archfoes since ancient times."}, {"tag": "h3", "text": "The colonizing of Alaris Prime"}, {"tag": "p", "text": "Around 59–56 BBY, Wookiee explorers discovered Alaris Prime, a green moon of the gas giant Alaris, in the Kashyyyk system. Following that discovery, the Wookiees expressed their interest in colonizing the moon before the Senate, the main legislative body of the Galactic Republic. Still considered a leader amongst the Wookiees, Attichitcuk represented Kashyyyk in the subsequent negotiations. At some point between the years 39 BBY and 36 BBY, the Wookiees were finally awarded the colonization rights on the moon after twenty years of debates."}, {"tag": "p", "text": "As a reward for his efforts in negotiating with the Senate for the two decades, Attichitcuk was awarded the honor of leading the Wookiee colonists on Alaris Prime. However, in spite of his many years of experience, Attichitcuk had never been confronted with new, potentially hostile environment. To help the chieftain carry out his new mission, he was offered the help of the renowned Jedi Master Qui-Gon Jinn. The chieftain set foot on the moon, establishing a primary settlement with only a few carbon prefab shelters and a command center. The chieftain stayed on guard duty at the camp, waiting for the first settlers to arrive, while Chewbacca and his cousin Shoran were tasked with exploring the surrounding area. To ensure the two youngsters would find their way to the camp, the older Wookiee left markers on the way. When Chewbacca and Shoran reached the camp, it appeared that a damaged power core had been found on the surface of the moon, indicating illegal presence on Alaris Prime. Immediately afterwards, the camp was attacked by a group of four gundarks, a species of red, four-armed predators. The creatures were no match for trained Wookiee warriors, however; Attichitcuk and the youngsters got rid of the intruders in next to no time."}, {"tag": "p", "text": "The Wookiees found out the identity of the power core owners when they came across a group of B1-Series battle droids belonging to the Trade Federation, one of the wealthiest corporate organizations in the galaxy, battling gundarks in their nest. It transpired that the Federation intended to colonize Alaris Prime. Now they had seen the face of their foe, the Wookiees prepared themselves for a colonial war. While Chewbacca and Master Jinn were working on improving the camp's technology level, Chieftain Attichitcuk conducted a handful of troops on a reconnaissance mission in hopes of locating the Trade Federation's landing area without being detected. However, on their way back to the village, the scouting patrol faced a Federation unit led by DRN-38, and Attitchitcuk fell into an ambush at the very doors of his camp. His soldiers were shot, and when the chieftain himself fell under enemy fire, Chewbacca, who had been close enough to witness the ambush but too far to intervene in time, released a cry of grievance. Qui-Gon Jinn, who felt that a spark of life remained in the recumbent body of Attichitcuk, suggested immediate action. Taking a squad of bowcaster troopers and a newly built medical droid, Chewbacca marched toward his father's attackers, destroying the battle droids on his way. Thanks to that quick intervention, the chieftain was saved. Attichitcuk received enough medical care from a droid to keep him on his feet and keep him walking, and he was garrisoned in a command center for a period of convalescence."}, {"tag": "p", "text": "A prolonged campaign ensued, during which a secondary Jedi Temple and a stronghold were built on the Wookiee territory. Once Attichitcuk had fully recovered from his wounds, he and his allies planned on an attack that would allow them to remove the Trade Federation forces for good. During the Battle for Alaris Prime, the chieftain led his troops on the battlefield, along with Chewbacca, Shoran, and Qui-Gon Jinn. Their war efforts met with complete success when the enemy fortress was razed, forcing the Federation to leave Alaris Prime in panic."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "On the fifth month of the year 22 BBY, the Galactic Republic engaged in war with the Confederacy of Independent Systems, a separatist alliance led by the former Jedi Master Dooku, Count of Serenno. The resulting Clone Wars, which started on the planet Geonosis, soon turned into a galaxy-wide conflict involving thousands of other worlds. For most of the war, the leaders of Kashyyyk chose to remain non-aligned. In fact, the Wookiees criticized the Republic for toying with the idea of giving senatorial representation to the Trandoshans, their longtime enemies, and for stationing military assets in Wookiee space. In 21 BBY, in an attempt to pour oil on troubled waters, the Jedi Order sent the Human Kai Justiss to Kashyyyk, appointing him as the new Jedi Watchman of the forest planet. Attichitcuk and Chewbacca were among the delegation that welcomed Justiss during his first journey on the Wookiee world. Their meeting was later reported in issue 14:10:03 of the HoloNet News channel's Core Edition."}, {"tag": "p", "text": "But in 19 BBY, an unexpected event pressed the Wookiees to take sides more clearly: the Confederacy forged an alliance with Trandoshan slavers and imposed a naval blockade on Kashyyyk. Soon thereafter, the Republic tasked High Jedi General Yoda with defending the Wookiee world from the droid armies of the Confederacy. In spite of his advanced age, Attichitcuk joined in the defense of his homeworld. Deemed too old to fight alongside the younger Wookiee warriors on the ground, the former chieftain served as a gunner aboard an Oevvaor jet catamaran during the battle that raged near the city of Kachirho. Seated at the back of the catamaran, Attichitcuk's role was to throw thermal detonators at the enemy tank droids in hopes of melting sizeable holes in them. The elderly chieftain's throwing accuracy was extremely high because he had long practiced in virtual-reality games played on an addictive \"mind evaporator\" headset. The allied Wookiee and Republic troops emerged victorious, a feat which may not have been accomplished without the help of Yoda."}, {"tag": "h3", "text": "Birth of the Galactic Empire"}, {"tag": "p", "text": "Very shortly after the victory against the Confederacy, the clone soldiers suddenly turned on their Jedi generals. In fact, the Supreme Chancellor of the Republic Palpatine had just revealed his true colors, to the great surprise of the galactic community. He had officially dismantled the Republic, transforming its dying carcass into an authoritarian Galactic Empire, and ordered the extermination of all Jedi. With the rise of the Empire and its xenophobic policies, Kashyyyk would once again be blockaded and the Wookiees enslaved. Almost immediately, the Empire tasked the commando Triton Squad with killing fugitive Wookiees throughout the forest. The squad notably intended to burn a certain Wookiee village to the ground and execute its inhabitants. Attichitcuk was present when the commando arrived, and the elderly Wookiee interposed himself between the attackers and a group of scared pups, only armed with an Elder's staff. However, a group of Wookiee warriors led by Chewbacca and Tarfful swooped down on the enemy, keeping Attichitcuk and the pups out of harm's way. After a brief skirmish, the Wookiee warriors pushed the Imperial troopers into the Shadowlands, where the entire squad was hunted and killed. Attichitcuk did not take part in the hunting party, but he briefly conferred with Tarfful and Chewbacca before they descended into the ground levels of Kashyyyk."}, {"tag": "h3", "text": "The Galactic Civil War"}, {"tag": "p", "text": "Although he had survived the attack by Triton Squad, Attichitcuk was not spared by Emperor Palpatine's new regime. Like most of his fellow Wookiees, Attichitcuk was trapped on Kashyyyk, forced to watch his beloved forests burned and his peers tortured by the Imperial overseers. Chewbacca himself, his own offspring, had been assigned to forced-labor projects on Coruscant, under the thumb of the Imperial officer Pter Nyklas. However, in 5 BBY, a young Corellian lieutenant named Han Solo ended up using his weapon to stun Nyklas and free the Wookiee. The two escaped, becoming inseparable companions, partly out of friendship, and partly as a result of the life debt Chewbacca owed to Solo—following an old Wookiee tradition."}, {"tag": "p", "text": "A few years later, in 1 BBY, Chewbacca, Solo, and a young street urchin named Jarik planned a brief stopover on Kashyyyk. Upon hearing that his son would pay a visit home, Attichitcuk was thrilled, talking about nothing else for days. After Chewbacca and the Humans arrived, the former chief proudly showed off his heir and his companions in the neighborhood. On that occasion, Chewbacca finally married Mallatobuck, who had been waiting for him all these years, giving Attichitcuk a devoted daughter-in-law that would stay with him in Rwookrrorro. Now a married couple, Chewbacca and Malla immediately conceived a child, who would be christened Lumpawarrump, or \"Lumpy\" for short. Attichitcuk became a grandfather, and he would take care of the child in the absence of Chewbacca. He also acquired a nickname when Han Solo took to calling him \"Itchy\", a diminutive that the venerable rwook proudly accepted. On occasion, even Chewbacca would refer to his genitor as \"Itchy\" rather than \"Father.\""}, {"tag": "p", "text": "While Chewbacca and the Corellian traveled the stars aboard the starship Millennium Falcon, Attichitcuk remained on Kashyyyk and helped Mallatobuck rear the infant Lumpy. Together, Attichitcuk and his daughter-in-law allowed the pup to stay close to the nursery ring and the home tree. He was different from the other Wookiee pups, and his grandfather never pushed him to take part in their \"toughening\" games. In the meantime, several pockets of resistance against the Empire had started to emerge in the galaxy. In 2 BBY, many of those groups had merged together, forming the Alliance to Restore the Republic, better known as the Rebel Alliance. This marked the start of the Galactic Civil War. In the early stages of the conflict, Attichitcuk befriended one of the Alliance's leading figures, the Princess of Alderaan Leia Organa."}, {"tag": "p", "text": "In 0 BBY, Attichitcuk's son and Han Solo were drawn reluctantly into the affairs of the Alliance. The duo ended up saving the day by helping destroy the Death Star, an Imperial planet-killing battlestation, during a battle over Yavin Prime. Shortly afterwards, Attichitcuk and Malla organized a surprise birthday party for the bicentennial of Chewbacca. Upon the hero's imminent arrival, Attichitcuk decided to tell his grandson Lumpy the story of how Chewbacca and Solo teamed together. Inspired by this tale of adventure, Lumpy traveled to the dangerous Shadowlands in search of wasaka berries, a food that his father loved. Back at the house, Malla and Attichitcuk became worried of Lumpy's absence, but the young Wookiee was finally rescued from the Nother World's swamp by none other than his father. The birthday party was held with its dancing, games and fireworks, and Attichitcuk attended."}, {"tag": "h3", "text": "Recovering the Vor'Na'Tu"}, {"tag": "p", "text": "Around 0.5 ABY, Attichitcuk briefly returned from retirement at the request of his friend, Princess Leia Organa, whose world of Alderaan had been destroyed by the Empire a couple of months earlier. The Princess needed help in retrieving the Vor'Na'Tu, an ancient and powerful artifact that had been stolen from the exiled Jedi Master Echuu Shen-Jon. Clothed in his old chieftain battle armor, Attichitcuk joined Organa and Shen-Jon on the desolate asteroid of Geddes, where the Imperials kept the Vor'Na'Tu hidden in a Sith temple. When Attichitcuk landed on Geddes in his transport ship, he was accompanied by a contingent of nine warriors, three Kas tanks, two catapults and one HummBike. The Wookiee chieftain's timely arrival with reinforcements proved decisive in the battle that ensued."}, {"tag": "p", "text": "Once the allied forces reached the Imperial research compound, they split into two groups. One was tasked with drawing the attention of the enemy while the other approached the base from behind. The Wookiees, the Rebels and Master Shen-Jon then found a group of explosive droids which the research facility had built, and the Jedi used his Force powers to convert them for the Rebels' use. The explosion of the droids added to the general turmoil, allowing Princess Leia's tank-like Energy Pummels to bring down the walls of the Sith temple in which the Vor'Na'Tu was hidden."}, {"tag": "p", "text": "Although Attichitcuk, Organa, and Shen-Jon did recover the object of their quest, their victory was short-lived: upon returning to their spacecraft, they faced Darth Vader, the Emperor's right-hand man, who had been dispatched to retrieve the Vor'Na'Tu and had been waiting for them. Refusing to hand over the valuable relic to the enemy, Shen-Jon destroyed it instead. Vader and the Jedi then engaged in a lightsaber duel, which ended in the death of Echuu Shen-Jon. While the Wookiee chief and the Princess had been able to escape, the mission itself was an overall failure."}, {"tag": "h3", "text": "An agitated Life Day"}, {"tag": "p", "text": "Midway through the year 1 ABY, Chewbacca and Solo were expected on Kashyyyk to celebrate Life Day, the most sacred holiday in the Wookiee culture. Back in Rwookrrorro, Attichitcuk, Mallatobuck and the young Lumpawarrump anxiously waited for them, making preparations. When it became obvious that the two friends were late, Attichitcuk noticed Mallatobuck' growing concerns, fearing that an accident may have occurred. The former chief gently comforted his daughter-in-law, putting an arm around her shoulders. As the Wookiees could do nothing but wait, the grandfather decided to take a nap in his armchair. However, his rest was interrupted by the startling sound of the treehouse's viewscreen, on which an Imperial officer appeared. The man on the screen officially announced that the Empire had enforced a blockade of Kashyyyk due to suspected Rebel activity. Indeed, the Empire had been tracking down Chewbacca and Solo ever since their role in destroying the Death Star, and they hoped to catch the fugitives by combing every household in the Kashyyyk system."}, {"tag": "p", "text": "For a brief instant of relief after so much recent bad news, the former chief's family received the visit of Saun Dann, an amicable Human who ran a trading post in the neighborhood. Dann had come with arms full of presents, and he offered his elderly friend a virtual erotic cassette. That product would conjure the image of a holographic woman named Mermeia, tapping into the viewer's deepest fantasies. As soon as he got it, Attichitcuk inserted the cassette in his mind evaporator and enjoyed his sensual gift for a moment. Shortly thereafter, an Imperial commander barged into Attichitcuk's home, accompanied by a technician and two stormtroopers, blasters at the ready. Despite the housemistress' initial protest, the treehouse was searched thoroughly. Determined not to give in to the occupier, Attichitcuk, Mallatobuck and Lumpawarrump never revealed their ties with the Rebel heroes. They pretended there was no other male Wookiee in their immediate family, arguing they had come to the wrong house. Ultimately, the investigation came to naught. The Imperials left the premises empty-handed, but not without having put the residence in disorder."}, {"tag": "p", "text": "Attichitcuk, alongside his grandson and daughter-in-law, was eventually reunited with Chewbacca and Solo, who arrived shortly after the Imperials' departure. Having donned ceremonial robes, the old rwook and his family gathered with other Wookiees at the foot of the sacred Tree of Life—from which, according to legends, all life on Kashyyyk had sprung. Princess Leia Organa, the Rebel pilot Luke Skywalker and their droids C-3PO and R2-D2 were also present."}, {"tag": "p", "text": "Around the same period, a painting was made of Attichitcuk and his family celebrating Life Day. That work of art, entitled Family Bonds, was reproduced and distributed across the galaxy during the Civil War."}, {"tag": "h3", "text": "New governments and slaving rings"}, {"tag": "p", "text": "In 4 ABY, Emperor Palpatine was killed at the Battle of Endor, and the second Death Star was destroyed. What remained of the Imperial Navy scattered. The Rebel Alliance was reorganized into the Alliance of Free Planets, which evolved into the New Republic one month later. With the Empire gone from Kashyyyk, the Nagai Commander Ozrei N'takkilomandrife—known to the Wookiees as \"Knife\"—plotted to take over the Wookiee slaving ring. Knife allied with Vargi, Mallatobuck's own brother, who hoped to enslave all of Attichitcuk's family. Vargi informed Knife of Chewbacca's legendary status to the Wookiee people and the new galactic government, which prompted the Nagai to kidnap his family as a bait. By capturing the planet's child prodigy, Knife sought to demoralize local resistance to the new slave trade. Attichitcuk was taken into custody, along with his daughter-in-law and grandson."}, {"tag": "p", "text": "Fortunately for the old Wookiee, his son Chewbacca arrived on Kashyyyk with Generals Han Solo and Lando Calrissian. Although Chewbacca himself was captured, his Human friends escaped, and Calrissian managed to free Attichitcuk and the others. The old Wookiee and his family followed Calrissian to the starship the enslaved Chewbacca and other captives were boarding, and they found Chewbacca and Solo in a pitched fight with Vargi. Lando Calrissian then used his blaster pistol to create a diversion, allowing Chewbacca to overpower his foe. The Wookiee's fellow captives rose up against Knife and his minions. With his plans ruined, Knife fled Kashyyyk without further ado."}, {"tag": "p", "text": "A few months later, the ambitious Imperial officer Hindane Darcc proclaimed himself Moff of the Mytaranor sector, and took over Kashyyyk, which he intended to turn into his personal domain. The Wookiee homeworld was being overrun, and its cities under heavy fire. The Wookiees were proud, but they knew they couldn't overcome this situation on their own, so Attichitcuk sent a call for help to his son. The silver-furred Wookiee hoped Chewbacca would convince the New Republic to send a strike force to fight off the Imperials, but to no avail. Solo and Chewbacca traveled alone to Kashyyyk, unsure of what they might find. In fact, the situation was even worse than they had imagined: the self-appointed Imperial Moff had hired the Trandoshan Pekt to gather a shipment of Wookiee slaves for use in Kessel mines. Organizing the Wookiee resistance, Chewbacca and Solo were successful in retaking the fallen Kashyyykian city of Chenachochan. However, both Darcc and Pekt were able to escape in a Lambda-class shuttle with a cargo hold full of Wookiee prisoners, and Attichitcuk himself was among the deported. The old chieftain and his peers were held on the Avatar Platform, a space station designed as the orbital headquarters of the Trandoshan slaving ring and where slaves were detained. Eventually Chewbacca and Solo led a team into space to rescue the Wookiees and avenge Kashyyyk. Attichitcuk was released from his chains and reunited with his son."}, {"tag": "h3", "text": "Burying his son"}, {"tag": "p", "text": "In 25 ABY, the Yuuzhan Vong—a race of extragalactic aliens—invaded the galaxy, and a major conflict ensued. During the initial stages of the war, Han Solo and Chewbacca were on the planet Sernpidal when the Yuuzhan Vong used a creature known as a dovin basal to draw the moon Dobido into an impact trajectory with the planet. Chewbacca helped Solo evacuate thousands of Sernpidalians, but the Wookiee was lost when he failed to board the Millennium Falcon on time. Following Chewbacca's heroic end, his droid friends C-3PO and R2-D2 were tasked with collecting memories of his life. They traveled to Rwookrrorro, where they spent some time discussing around the fireplace with a very weakened, mirthless Attichitcuk. The old rwook told the droids how his son once fought the albino Wookiee Tojjevvuk for the love of Malla. Aching with grief, the elderly chieftain confessed that burying his own son was the most terrible ordeal of his life, even compared to the destruction of the forests or slavery under the Galactic Empire. Still filled with pride in his late heir, Attichitcuk wondered how \"a mere moon\" could have killed such a bigger-than-life hero."}, {"tag": "p", "text": "Six months after the destruction of Sernpidal, a funeral was held outside of Rwookrrorro, and Attichitcuk bade his son a final farewell, along with twenty-three other Wookiees and the Human friends of the family. The old Wookiee reluctantly accepted that Solo was not prepared to accept an extension of Chewbacca's life debt by Lumpawaroo, and the Jedi Knight Lowbacca, Attichitcuk's other grandson through Kallabow. The old chieftain eventually understood that the Human was still clinging to his memory of Chewbacca and needed time to mourn him properly. Four years later, the New Republic finally gained the upper hand against the Yuuzhan Vong. Attichitcuk and his people welcomed several members of the Skywalker family and the House of Solo. They spent the night together in Rwookrrorro and trekked to a massive fallen branch where a memorial for Chewbacca had been carved."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In his prime, Attichitcuk was a brown Wookiee with a squat face, brown irises, a broad nose and a wide stature. He used to be tall like all members of his race, but he gradually shrank over the years, a common phenomenon in older Wookiees. When his son's relationship with Mallatobuck started, Attichitcuk's shoulders had already begun to stoop forward. By then, the chief was one head shorter than Chewbacca, but still retained the brown color of his fur. However, one year after the start of the Clone Wars, Attichitcuk had gone entirely gray."}, {"tag": "p", "text": "Like other members of his species, including his fellow chieftain Tarfful, Attichitcuk used to style his facial hair into long braids when he was young. In the height of the Galactic Civil War, Attichitcuk appeared as a large, white-haired and stooped Wookiee, measuring only 1.73 meters—much shorter than the average 2.2 meters of a healthy Wookiee adult. He had also lost all of his fangs, which had caused his jaws to decrease in size."}, {"tag": "p", "text": "Although he tended to be extremely irritable and gruff, the former chief had genuine attachment to the members of his little family. Despite their great complicity, Attichitcuk would never spoil his grandson, neither would he go against the authority of Mallatobuck. He was immensely proud of his son Chewbacca, whom he saw as an almighty warrior. When the old chieftain had to bury his own child, he was grief-stricken and refused to admit the circumstances of Chewbacca's death. Attichicuk was also very modest, as he would not boast about the impressive hunting prowesses of his youth."}, {"tag": "p", "text": "In addition to being drawn to females of his own species, the old Wookiee also had an attraction for Human women, as exemplified by his excitement when seeing Mermeia's alluring image in his mind evaporator. His attraction, and using the mind evaporator was a common enough occurance that neither Lumpawaroo nor Mallatobuck commented on the situation. In his old age, Attichitcuk also liked to smoke a pipe."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "At his peak, Attichitcuk was a skilled warrior and hunter, capable of slaying twenty ferocious katarns on his own. Thanks to his training with a mind evaporator, he was also a highly accurate grenade thrower, even in his old age. He also displayed crafting talents, a common cultural trait of the Wookiees due to their dexterous hands. Attichitcuk would carve wood, making small-scale replicas of starfighters for the benefit of his son, and later grandson. He used to put heart in this activity, and he disliked being interrupted when carving models, even by Lumpawarrump."}, {"tag": "p", "text": "A native speaker of Shyriiwook, Attichitcuk could understand Galactic Basic Standard, the most prominent language in the galaxy. He was, however, unable to speak it, as the structure of the Wookiee voice box and vocal cords could not reproduce the sounds of Basic. Attichitcuk's voice was deeper and raspier than that of his son Chewbacca."}, {"tag": "p", "text": "Even as a cane-using three-hundred-fifty-year-old male, Attichitcuk was capable of putting up a decent fight. He was as accurate as ever with his bowcaster and still qualified to lead troops on the path to war, as he demonstrated on Geddes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Whereas most of his brethren would not wear any clothes at all, Attichitcuk was known to have worn a crimson waist wrap in his younger years. As a Wookiee chieftain, he donned a battle dress consisting of a wide cape, a pair of shoulder armor and a crested helmet. As a mourning father in 25 ABY, he used a red shawl with golden motifs on his shoulders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "The gray-furred Wookiee Attichitcuk, along with the rest of Chewbacca's immediate family, was created by George Lucas for The Star Wars Holiday Special, a variety show aired by CBS on November 17, 1978. The Holiday Special was a spin-off of the successful original film that had been released the year before. With the newfound success of Star Wars, the character of Chewbacca had become a fan favorite—with his actor Peter Mayhew receiving between 2,000 and 3,000 letters a week. This prompted Lucas to write a script that revolved around the hairy hero's family. The creator of Star Wars named all three new Wookiees himself, christening the grandfather \"Itchy.\" The original draft of the Holiday Special was a collaborative effort between writers Leonard Ripps and Pat Proft and George Lucas. The final script, however, was written without Lucas's involvement and was entrusted to producers Ken and Mitzie Welch of Smith-Hemion Productions. They made significant changes to the script, adding several musical numbers and comedy skits."}, {"tag": "p", "text": "In the fourth draft script of the Holiday Special, dated October 13, 1978, Chewbacca's father was called \"Old Attchituck\" and described as a \"gray-haired, cranky, 400-year-old cuss.\" This version of the script differs only slightly from the final cut of the TV special and features Wookiee dialogue translated in all caps. In early story treatments, Attichitcuk's role was much less developed, with him being mentioned only three times in a five-page rough draft. In this early story treatment, Itchy's \"big scene\" with the mind evaporator was attributed to Chewbacca instead, although it did not feature the erotic entertainer Mermeia."}, {"tag": "p", "text": "The old Wookiee's appearance was designed by Joe Johnston, who had worked as head storyboard artist on Star Wars. In his conceptual drawings, Johnston described Attichitcuk as a \"350-375 years old\" Wookiee. The 350 figure was finally retained and confirmed many years later in the 2001 video game Star Wars: Galactic Battlegrounds. Many of Itchy's characteristics can also be attributed to Ralph McQuarrie, who recalled drawing \"an old Wookiee getting up out of his chair and several females and children.\" At some point after the airing of the Holiday Special, the American toy company Kenner Products envisioned an action figure line of Chewbacca's family. Prototypes were constructed of Chewbacca, Malla, Itchy, and Lumpy, but the idea was ultimately dropped. The Attichitcuk prototype was in fact a modified Chewbacca figure with the bandolier strap removed and gray paint sprayed around the head and beard."}, {"tag": "p", "text": "While Attichitcuk as we know him dates from the 1978 Holiday Special, there are traces of a proto-Itchy as far back as the May 1973 rough draft of Star Wars. This early incarnation, known as \"Auzituck,\" appeared in scene 135, which was set in the \"Wookee [sic] camp\" on Yavin—\"Yavin\" being an early version of Kashyyyk. The script says: \"Chewbacca enters the largest of the lodges. He is greeted by his father, AUZITUCK, Chief of the KAAPAUKU tribe; an old and feeble Wookee [sic] dressed in royal skins and headdress.\" The old Chief only appeared in this scene, and was mentioned in passing later in the script, when a proto–Han Solo introduced \"Chewbacca, son of Auzituck, Prince of the Sawas, a very powerful tribe.\" This name was later used for a gunship model in Star Wars Rebels: Spark of Rebellion."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "In The Star Wars Holiday Special, Attichitcuk was portrayed by actor Paul Gale. His co-star Patty Maloney, who played Lumpy in the show, recalled Gale \"as fun to work with\" and \"just like being with family.\" Like the other actors who played Wookiees in the Holiday Special, Paul Gale was given no lines, and all his performance was based on mime. Along with Malloney and Mickey Morton, who played Malla, Gale attended a Shyriiwook class in order to get accustomed to the language and better react on cues during shooting. The Wookiee characters' voices were added during post-production by sound designer Ben Burtt. In his 2011 reference book Galactic Phrase Book & Travel Guide, Burtt recalled spending two days at the Olympic Games Farm in Sequim, Washington, collecting enough bear sounds to give each Wookiee a distinguishable voice. Out of the dozen captive bears of various species that were kept at the Farm, Burtt chose grizzlies to provide a basis for Attichitcuk's voice. In 2005, sound clips of Itchy's voice from The Star Wars Holiday Special were reused for a few of Chieftain Tarfful's growls in Star Wars: Episode III Revenge of the Sith. Specifically, they were used during Yoda's \"goodbye\" scene to Chewbacca and Tarfful."}, {"tag": "p", "text": "Although makeup supervisor Stuart Freeborn had designed the original Chewbacca costume, he had no hand in creating additional Wookiee suits seen in the TV special. Attichitcuk's hairy bodysuit was produced by special effects artists Stan Winston and Thomas R. Burman. Burman and his brother Ellis provided Winston with a a large amount of \"Wookiee fur\" mined from dozens of human-hair wigs, while Chewie's suit was made out of knitted mohair and straight yak hair. Winston also designed very articulated face prothestics for the special. Attichitcuk's mask was made of overlaying vacuum forms and springs so it would would fit up tight against the actor's eyes. According to creature effects artist Don Bies, Attichitcuk's costume and mask were still housed in the Lucasfilm Archives as of 2005. The two wooden X-wings allegedly carved by Itchy in the show—actually painted models—were also preserved. In 2008, they were exhumed by StarWars.com editor Pete Vilmur on the occasion of the Holiday Special's thirtieth anniversary."}, {"tag": "h3", "text": "Character development"}, {"tag": "p", "text": "Following its only diffusion in 1978, The Star Wars Holiday Special was heavily criticized. Part of the criticism focused on the opening scenes of the special, which featured Attichitcuk and his kin addressing each other in unsubtitled Wookiee-speak for fifteen minutes. However, as Star Wars Insider magazine contributor Jon Bradley Snyder put it, the Holiday Special had a silly, stuck-in-the-seventies feel that gave it charm, and the show acquired cult status in popular culture."}, {"tag": "p", "text": "One year after the airing of the Holiday Special, Random House released The Wookiee Storybook, a tie-in children book that had been written by Eleanor Ehrhardt during the production of the show. Patricia Wynne illustrated the book without having seen the actual Wookiee costumes. Because of the short deadline, George Lucas allowed Wynne a large amount of creative freedom."}, {"tag": "p", "text": "The next appearance of Itchy was a single-panel cameo in Star Wars 91, the ninety-first issue of Marvel Comics' Star Wars series. Despite the overall failure of the Holiday Special, Attichitcuk was reused in other Star Wars Expanded Universe stories, although not as often as Lumpawarrump or Mallatobuck."}, {"tag": "p", "text": "In 2001, Attichitcuk was given an important role in the video game Star Wars: Galactic Battlegrounds as the main character in the Wookiee training campaign, which revolved around the colonization of Alaris Prime. An older Attichitcuk also appeared in the Princess Leia and Chewbacca campaigns later in the game. In the third mission of the Princess Leia campaign, Attichitcuk took part in the Battle of Geddes. When brought back towards the ship with Leia Organa and Echuu Shen-Jon at the end of the mission, the Wookiee literally disappears from the screen. It should also be noted that if Attichitcuk dies in any of the campaigns he appears in, the player loses the level. The name of Attichitcuk was pronounced two different ways in the game. Qui-Gon Jinn (voiced by James Warwick) pronounced \"Atty-chitchik,\" while Princess Leia Organa (voiced by Lisa Fuson) pronounced \"ATT-uh-CHIT-tik.\" While the old chieftain was already gray and stooped by the time of the Clone Wars, the later Rebellion/New Republic missions featured the same youthful, brown-furred ingame model with matching icon as the earlier Attichitcuk campaign. The present article treats that inconsistency as a result of game mechanics."}, {"tag": "p", "text": "Around October 2002, Attichitcuk was to be reinvented during production of Revenge of the Sith. According to Sang Jun Lee, who worked as concept artist at Skywalker Ranch, \"Chewbacca's father\" was to be killed during the course of the movie, which would have prompted him to run away and meet Han Solo. This concept, however, did not make it into the final film; had it been implemented, it would have directly contradicted Attichitcuk's later appearances in continuity. However, in January 2003, Lucas told the creation team that a young Han Solo was being raised on Kashyyyk by Chewbacca. Eventually, both ideas of featuring Chewbacca's father and Han Solo in the movie were abandoned. While Attichitcuk did not appear in Revenge of the Sith, he was stated to have taken part in the Battle of Kashyyyk in the reference book Star Wars: Revenge of the Sith Incredible Cross-Sections. In a technical drawing by Hans Jenssen, Attichitcuk was pictured at the back of a Wookiee catamaran, throwing grenades. Additionally, the movie character of Merumeru bore a strong resemblance to one of the conceptual drawings, sporting the same staff and a similar headgear."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}