{"url": "Pelekotan", "categories": ["Category:Legends articles", "Category:Force philosophies", "Category:Korunnai culture"], "nodes": [{"tag": "h1", "text": "Pelekotan"}, {"tag": "p", "text": "Pelekotan was the word used by the Korunnai people of Haruun Kal to describe the Force. Loosely translated as \"world-power,\" its literal meaning was \"jungle mind.\" Since the Korunnai were a Force-sensitive race, descendants of a long lost, anthropological expedition of Jedi to the planet, pelekotan served as the equivalent spiritual power and focus that the light side of the Force was for the Jedi."}, {"tag": "p", "text": "It is unknown if pelekotan was rooted in any form of organized religion among the Korun people, save for a prominent figure known as the lor pelek (which meant \"jungle master\"). The lor pelek was a shaman who embodied the power of pelekotan, described as a person of great power and great peril, as unpredictable as the jungle. This figure is known to have healing powers, and can often be a fierce warrior. Kar Vastor, the lor pelek at the beginning of the Clone Wars, fit these attributes perfectly. In Mace Windu's mission to Haruun Kal, he noted that Kar Vastor possessed unique Force powers unknown to and never seen before by Jedi, apparently having been discovered in the course of jungle life. One example was an ability to drive deadly fever wasp parasites of the brain and nervous system from an infected person's body through means of the Force."}, {"tag": "p", "text": "The Korunnai interacted with pelekotan as a means of surviving the danger-ridden jungles of their homeworld, in order to preserve their herds and tribes. Pelekotan itself was described as a mystical entity, a power that ruled the darkness of the Korunnai's environment, perhaps meant to represent the jungle itself. It demanded a struggle from those who used it in order to survive the horrors of the jungle (an example being that Kar Vastor lost the ability to speak any comprehensible language in exchange for the greater Force powers he needed to survive)."}, {"tag": "p", "text": "Vastor explained pelekotan thus: \"Pelekotan brings us waking dreams of our desires and our fears. When we desire what we fear and fear what we desire, pelekotan always answers… Only pelekotan is real. Everything else is forms and shadows: less even than a cloud, or a memory. We are pelekotan's dream.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}