{"url": "Peko-peko/Legends", "categories": ["Category:Legends articles", "Category:Creatures of Naboo", "Category:Creatures of unspecified diet", "Category:Flying creatures", "Category:Food creatures", "Category:Reptavians", "Category:Species of undefined sentience", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Peko-peko"}, {"tag": "p", "text": "Peko-pekos were large, strong reptavians, whose raucous squawks carried over long distances. They were native to the Gungan swamps of Naboo. Another breed lived on Nal Hutta. The feathers of the peko-peko albatross were used in the construction of Reinforced Insulated Sheath armor."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Peko-pekos congregated in large flocks but generally traveled in pairs and mated for life. Both male and female had beautiful indigo-sapphire plumage, and both were the same size. Peko-pekos had powerful wings and fairly toxic skin and feathers. Most animals left peko-pekos alone, as their toxins caused sharp stomach pains, severe vomiting, and occasional deaths. Not all animals were susceptible, however. Ironically, the peko-peko's blood contained antivenin for glie-based poisons. They had keen eyesight, clawed wings to help them climb, and a powerful beak that could crush even the hardest of nuts."}, {"tag": "p", "text": "Besides nuts, the peko-peko ate kaadu eggs and small creatures. Certain nuts and seeds would not germinate unless they passed through the peko-peko's gastrointestinal system. They were preyed upon by tusk cats."}, {"tag": "p", "text": "The peko-peko nested in the high hollows of trees. The female laid two eggs at a time. Both partners cared for hatchlings."}, {"tag": "p", "text": "Skilled mimics, they imitated perfectly the sounds of many other animals. Easily taught to talk in captivity, they were a favorite pet of both Gungans and Naboo."}, {"tag": "p", "text": "Impressively sized specimens were known as \"Giant Peko-Pekos.\" It is unclear if they were simply more mature, or a separate breed."}, {"tag": "p", "text": "The Alsakan outlaw Cornelius Evazan conducted experiments on peko-pekos which resulted in the creation of the mutated Toxic peko-peko."}, {"tag": "p", "text": "Peko-peko meat was comestible. The cookbook Essential Cooking Skills detailed how to best cook that meat."}, {"tag": "h2", "text": "Audio"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}