{"url": "Peka_Community", "categories": ["Category:Articles to be merged", "Category:Canon articles", "Category:Batuu locations", "Category:Settlements"], "nodes": [{"tag": "h1", "text": "Peka Community"}, {"tag": "p", "text": "Peka Community was an energetic river community that lived in a small settlement mostly made up of tents, huts and cabins made from natural resources. The inhabitants mostly came from fishing and farming families and some commuted into Black Spire Outpost."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Peka Community was a small settlement located near a river, where most residents lived in makeshift tents, huts or modest log cabins, all made from whatever natural resources the inhabitants could harvest."}, {"tag": "p", "text": "Other types of housing included apartment buildings built into large spires that could house several families, large houses that were occupied by single families. There were also small houses made of wood and mud similar in design to the architecture found in Black Spire Outpost, some of which had underground rooms."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Peka Community was inhabited by an energetic group of sociable, hardworking residents who were family-oriented and centered many of their activities around the river. Many of the inhabitants came from families involved in fishing or farming, and when they were not working many of them enjoyed swimming, camping, hiking, or recreational fishing. They would often offer to take off-worlders on fishing trips where they could catch and cook their own meals."}, {"tag": "p", "text": "Some inhabitants commuted into Black Spire Outpost for work, traveling each day from the settlement's depot on a shuttle belonging to Oga Garra, who owned Oga's Cantina in the outpost. The shuttle would also return them home at the day's end."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Peka Community was created for Star Wars: Galaxy's Edge, a theme park land that opened at Disneyland Park on May 31, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}