{"url": "Pello_Scrambas", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Alderaanians", "Category:Alliance Fleet officers", "Category:Guards", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Pello Scrambas"}, {"tag": "p", "text": "Pello Scrambas was a lieutenant in the service of the Royal House of Alderaan. Scrambas's father was Tash Scrambas, the captain of the Qel-Droma, who served Jedi Master Jorus C'baoth during the Alderaan Ascendancy Contention. On the last day of the Contention, the younger Scrambas joined the Alderaanian armed forces. Rising to the rank of sergeant, his peers believed that Alderaan would be insulated from the pan-galactic Clone Wars, but Scrambas knew better. He saw combat frequently in the conflict, as General Grievous made his move toward the Core Worlds. After serving in several tours of duty, Scrambas was transferred to Senator Bail Organa's personal guard."}, {"tag": "p", "text": "Despite his new role as a guard, Scrambas still saw plenty of action during the remainder of the war, on planets as diverse as Boz Pity, Qalydon, and Metalorn. When the war came to a close in 19 BBY, Scrambas stayed on with Organa, having formed a close and personal friendship with the senator. Nearly twenty years later, Scrambas came to serve Organa's daughter, Princess Leia Organa, who had succeeded her father in the Imperial Senate and had ties to the Alliance to Restore the Republic. It was those ties that attracted the attention of Lord Darth Vader, whose forces boarded the Tantive IV in 0 BBY. During the boarding, Scrambas was wounded and captured by Imperial stormtroopers, and was killed shortly afterward, sacrificing himself for the daughter of his trusted friend."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career and the Clone Wars"}, {"tag": "p", "text": "Pello Scrambas was sired by Captain Tash Scrambas of the Qel-Droma in either 47 or 43 BBY, during the Republic Classic era. The elder Scrambas took part in the Alderaan Ascendancy Contention, the conflict over what Alderaanian noble house would assume the Viceroyship of Alderaan, serving Jedi moderator Jorus C'baoth during the crisis, as he did not wish to side with the House of Organa or the House of Antilles. On the day that C'baoth ended the contention, Pello Scrambas joined Alderaan's armed forces, aged fifteen. By 22 BBY, Scrambas held the rank of sergeant, and when the Clone Wars broke out, he was told to expect \"limited action\" in the coming conflict, as it was thought that the Galactic Republic's clone troopers would be able to adequately suppress the Confederacy of Independent Systems."}, {"tag": "p", "text": "From the perspective of those in the Core Worlds, the conflict was seen as a \"brush war,\" and one that the Core would be insulated from. Scrambas was not satisfied with the assessment, however, and he was vindicated in his thinking when the Clone Wars spread across the galaxy. Alderaan itself was threatened by the Confederate advance many times, and during Operation Durge's Lance, the planet Duro fell to the Confederate General Grievous, making Scrambas's homeworld particularly vulnerable. He found himself constantly fighting on the front lines against the Confederacy, and after several tours of duty, he was transferred to the personal guard of Senator Bail Prestor Organa."}, {"tag": "h3", "text": "The Organas"}, {"tag": "p", "text": "Despite the fact that he was now guarding a senator, Scrambas still found himself actively fighting the Confederacy. Organa participated in the war frequently, witnessing the battles in the Outer Rim Territories, particularly Boz Pity, rescuing waylaid Jedi Knights such as Shaak Ti on Metalorn, and visiting fronts such as Qalydon. During those particular adventures and conflicts, Scrambas and Organa became close friends. In 19 BBY, the war came to a close with the deaths of General Grievous, Confederate leader Count Dooku, and the Separatist Council. In the wake of the war's conclusion, former-Supreme Chancellor Palpatine replaced the Republic with the Galactic Empire."}, {"tag": "p", "text": "After many years of service, Organa was succeeded as senator by his daughter, Princess Leia Organa, and Scrambas, now a lieutenant, came to regard the young woman as he would his own daughter. In 0 BBY, approximately twenty years after first serving Bail Organa directly, Scrambas was aboard the princess's CR90 corvette Tantive IV when she received a transmission from spies belonging to the Alliance to Restore the Republic containing plans to the Empire's new Death Star battlestation. However, Organa's corvette was pursued from Toprawa to Tatooine by Darth Vader's Imperial I-class Star Destroyer Devastator, and was eventually disabled over the latter world. Scrambas volunteered to lead a detachment to repel potential boarders, so he and his fellow guards were deployed to fight the Imperial teams that stormed the ship. He was hit by blaster fire, and was captured as the first wave of Vader's stormtroopers barged onto the craft. Shortly thereafter, he was gunned down, succumbing to a blaster wound."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a young man, Pello Scrambas was perceptive enough to realize that the Clone Wars were going to be far more than just the local brush fire that his superiors predicted. He gained a considerable amount of combat experience during the war—so much so that in his later life his exploits were almost legend amongst those under his command. Scrambas himself jokingly entertained the rumors, even going so far as to enhance them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Pello Scrambas first appeared in George Lucas' 1977 film Star Wars: Episode IV A New Hope, as an unnamed extra in the opening scenes, played by Eddie Eddon. His scenes were filmed in mid 1976 in the United Kingdom. In 1996, he was identified in the \"A New Hope Limited\" set of the Star Wars Customizable Card Game, on the card entitled \"Rebel Squad Leader.\" Scrambas's story was fleshed out by Aidan Hennessy (writing as \"Darth NTM\") through StarWars.com's Hyperspace feature, \"What's The Story?\" Hennessy's winning entry, published in the Databank, made connections to a wide variety of disparate Expanded Universe elements, such as the alluded-to Alderaan Ascendancy Contention from 1992's Dark Force Rising, the fall of Duro from 2004's CIS Shadowfeed Dispatch 15:2:29 Edition, and Bail Organa's mission to Metalorn from 2006's Bailed Out."}, {"tag": "p", "text": "For chronicling the early stages of the Clone Wars, Hennessy drew inspiration from the attitudes people had toward World War I. By his own admission, Hennessy also, inadvertently, misspelled \"Scrambas\" as \"Scambras\" several times in his entry. Hennessy's entry also conflicted with an earlier source, the 1998 Star Wars Encyclopedia, which claimed that Scrambas was captured when the Imperial forces attacked the Tantive IV, and was never seen again. Despite this, the Databank does not explicitly state that Scrambas perished during the sortie seen at the start of A New Hope. Scrambas was also featured and identified in StarWars.com's short-lived Visual Guides feature. The character was shown in \"Chapter 3\" of the feature."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}