{"url": "Peragus_asteroid_field", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Outer Rim Territories asteroid fields", "Category:Peragus II locations", "Category:Xappyh sector"], "nodes": [{"tag": "h1", "text": "Peragus asteroid field"}, {"tag": "p", "text": "The Peragus asteroid field was a formation of fuel-rich asteroids that was created after the first attempt to set up a mining station on Peragus II."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the process of drilling for fuel when the first station was set up, the mining crew accidentally discovered just how flammable and unstable Peragian fuel could be. The resulting explosion shattered the surface of Peragus II, sending vast quantities of the planet's crust and upper mantle into space. The cooling-down of the blown planetary material created the asteroid field, which hung in geosynchronous orbit over the original blast site. Further mining was halted until the beginning of the Telosian Restoration Project on the nearby planet of Telos IV, which required large amounts of fuel to keep Citadel Station in orbit. The Peragus Mining Facility was established inside one of the largest asteroids in the field and would supply Citadel Station with mined material until 3951 BBY."}, {"tag": "p", "text": "The asteroid field was destroyed when a critically-damaged freighter, the Ebon Hawk, made an emergency landing at the Peragus Mining Facility; the starship had been transporting the injured Jedi Exile, who was actively pursued by Darth Sion. After healing her wounds and fighting her way through hostile mining droids, the Exile and her companions boarded the Ebon Hawk and fled the facility, with Sion and the Harbinger in hot pursuit. As the Ebon Hawk cleared the asteroid field and prepared to make the jump to hyperspace, the Harbinger fired a shot at one of the asteroids in a last-ditch attempt to destroy the freighter. The resulting explosion created a chain reaction that destroyed the mining facility and the entire asteroid field itself."}, {"tag": "p", "text": "One of the asteroids was designated 32-19K."}, {"tag": "h2", "text": "Appearances"}]}