{"url": "Peragus_Mining_Facility", "categories": ["Category:Legends articles", "Category:Asteroid bases", "Category:Industrial facilities", "Category:Kwymar sector", "Category:Mining stations", "Category:Outer Rim Territories asteroids", "Category:Peragus II locations", "Category:Spacecraft locations"], "nodes": [{"tag": "h1", "text": "Peragus Mining Facility"}, {"tag": "p", "text": "The Peragus Mining Facility was the only supplier of shipping-grade engine fuel to the Kwymar sector. It was installed in the Peragus asteroid field as a second attempt at siphoning Peragian fuel after the first one resulted in the near-destruction of the planet Peragus II and was itself an Asteroid. The project was possibly endorsed by G0-T0 during contract negotiations for the Telosian restoration efforts, as he attempted to force the Republic to turn to shipping fuel from Peragus rather than buying it from the Hutts, which he deemed as a suicidal business venture. Here Citadel Station had its main fuel source until the facility was sabotaged and destroyed in the Skirmish at Peragus II as Darth Sion chased Meetra Surik on the Republic warship Harbinger in 3951 BBY."}, {"tag": "h2", "text": "Sabotage"}, {"tag": "p", "text": "The mining facility was sabotaged by an HK-50 Jedi hunter who stumbled upon Meetra Surik and found his way to the Ebon Hawk, where the former Jedi was taken by Kreia after she was drugged by the assassin droid during a diplomatic journey to Telos IV aboard the Harbinger. When the freighter docked with the station for critical repairs, both Jedi were unconscious and in need of medical attention. The administrator of the facility sent them to the medical bay, inventoried and sealed the ship's cargo, and brought its droid crew to maintenance. Though HK-50 presented himself as a mere protocol droid, he was allowed to work with the maintenance officer on droid repairs. From that point, he sought to learn all he could about security, personnel and anything that would gain him facility control. To subtly undermine facility operations, he tampered with mining droid comm routines and recognition sensors to stage accidents and have all units brought to maintenance, prematurely detonated sonic charges that injured several miners, and used the maintenance station to order a sedative treatment to be given to all patients in med bay, delivering a dosage that would prevent Meetra from waking up but that would be lethal to the miners."}, {"tag": "p", "text": "Meanwhile, despite the administrator's best efforts to keep it secret, knowledge of Meetra's standing with the Jedi had leaked out from a miner who served with her in the Battle of Malachor V. Some of the miners, who could not ignore the chance to take advantage of Meetra's state of unconsciousness, made plans to collect the bounty the Exchange had posted on live Jedi. Against the orders of the heads of the facility, Coorta and his mining crew kept plotting, and HK-50 joined them in the hopes of gaining a means to get off the station. Mimicking the maintenance officer's voice via comlink, HK-50 claimed that if they could provide a transport, he knew how to cover their tracks and make sure the Republic was not alerted. Coorta contacted a smuggler to take Meetra to Nar Shaddaa, but whether the smuggler had arrived at the facility by the time Meetra regained consciousness is unknown."}, {"tag": "p", "text": "HK-50 went on to cripple the facility, slicing into the fuel depot computers, creating a phantom fuel leak, and strategically sealing off areas with force fields to block passage to the hangar bay. Finally, detonations were triggered in isolated gas pockets down the mining tunnels, causing a lockdown that drove the miners into emergency sections of the station and cut them off from communications and facility control. The surviving miners tried to use a holo-transmitter to beam a transmission to the administration level that would end the lockdown, but by that time HK-50 had severed the administration console from the main hub. The miners kept using the transmitter as a relay to beam distress signals outside the Peragus facility until they were killed as toxic fumes built up in the ventilation system."}, {"tag": "h2", "text": "Destruction of the facility"}, {"tag": "p", "text": "Although the Peragus administrator believed Kreia to be dead and sent her to the morgue, she was actually in a Hibernation trance. From there, she unconsciously reached out to Meetra and awoke her from her kolto tank. The two met and Kreia urged Meetra to find the Ebon Hawk so that they might escape the disturbances Kreia had sensed during their slumber. Fighting her way through hostile mining droids, Meetra explored the rest of the facility, slowly regaining her Force sensitivity under Kreia's guidance. She found Atton Rand in a Force cage on the administration level and accepted his remote assistance through the mining tunnels as she futilely attempted to find an alternate route to the hangar. Eventually the Harbinger, under the command of Darth Sion and his Sith assassins, docked with the station, opening the airlock on a docking bridge. Meetra, Atton, and Kreia joined forces and were forced to confront and destroy HK-50, who made one last attempt to claim Meetra's bounty, before they could board the Republic vessel."}, {"tag": "p", "text": "There they acquired the necessary orbital drift charts from the ship's navicomputer and made for the engine deck, fighting their way through stealthed Sith Assassins. Before they could escape, Darth Sion found the trio and Kreia stopped to hold him off. During their short but decisive duel, Sion cut off Kreia's hand but spared her life. She, Meetra, Atton, and T3-M4—who had been disabled by HK-50 but was later found in the fuel line to the hangar—barely made it to the Ebon Hawk as they took off with Sith troopers on their heels. With T3-M4 doubling as an astrogation system, the party made the jump to hyperspace in an attempt to evade the Harbinger—but not before the warship had fired upon an asteroid, setting off a chain of explosions that destroyed the facility and the entire asteroid field."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In the wake of the Mandalorian Wars and the Jedi Civil War, the loss of the Peragian fuel source set in motion events that, according to G0-T0's prospects, would result in the utter collapse of the Republic in one standard month's time. The fate of the Telosian Restoration Project—which relied on fuel from Peragus to keep Citadel Station in orbit—was tied to that of twenty other worlds, with them the Republic would lose the fundamental infrastructures needed to support itself. Upon her arrival on Telos, Meetra was put under house arrest pending the results of an inquiry by the Telosian government. However, logs recovered from the facility's wreckage indicated that the miners perished as a result of sabotage and that the Harbinger had indeed been present and was responsible for the station's destruction."}, {"tag": "h2", "text": "Layout"}, {"tag": "h3", "text": "Administration level"}, {"tag": "p", "text": "The administration level was the main floor and the center of operations for the facility, containing its med bay, morgue, communications consoles, prison, and turbolifts to the dormitories and mining tunnels. When Meetra Surik arrived at the facility, she was put into a kolto tank in the med bay, and it was here that she began her explorations of the facility. Meetra and Atton Rand used one of the consoles on the administration level to contact T3-M4 and have him unlock an emergency hatch to the mining tunnels. Later, Meetra returned to the administration level with Kreia and Atton, destroyed HK-50, and boarded the Harbinger."}, {"tag": "h3", "text": "Mining tunnels"}, {"tag": "p", "text": "These tunnels were where Peragus fuel was mined, then piped up to the fuel depot. When Meetra Surik entered the mining tunnels via the turbolift from the administration level, she was attacked by mining droids, who had been reprogrammed by HK-50 to attack all organics. From here, Meetra entered the fuel depot."}, {"tag": "h3", "text": "Fuel depot"}, {"tag": "p", "text": "The fuel depot was where fuel pipes reached the exterior of the asteroid to the freighters that were to carry the shipments, and was where the Peragus maintenance officer sealed himself after the droid attacks began. T3-M4 entered the fuel depot in an effort to reach a console which could unlock an emergency hatch on the administration level, and allow Meetra Surik to the mining tunnels, but was disabled shortly afterwards by HK-50. When Meetra entered the depot through the mining tunnels, force fields set up by HK-50 prevented her from reaching the hangar bay and the Ebon Hawk, forcing her to don a space suit and walk the asteroid's surface to the dormitory airlock."}, {"tag": "h3", "text": "Exterior"}, {"tag": "p", "text": "Located outside the administration level, the exterior of the facility contained a platform in the vacuum of space that enabled transport between the fuel depot and the dormitories. When Meetra used this platform to reach the dormitories, the Harbinger, with Darth Sion onboard, docked at the facility."}, {"tag": "h3", "text": "Dormitories"}, {"tag": "p", "text": "Located beneath the Peragus Mining Facility's administration level were its dormitories, where the miners ate and slept. When Meetra Surik came to the dormitories in her attempts to escape the facility, she discovered that many of the miners, such as Coorta, had been trapped there and killed by mining droids or toxic gases. Meetra managed to escape the dormitories by using a console that unlocked the turbolift to the administration level. The mess hall was also here."}, {"tag": "h3", "text": "Hangar bay"}, {"tag": "p", "text": "The hangar bay, located next to the fuel depot, was where the Ebon Hawk was tractored in the facility. When Meetra contacted him, T3-M4 traveled between here and the fuel depot to provide a route for Meetra to get to the ship. When Meetra, Atton Rand, Kreia, and T3-M4 finally reached the hangar bay, they were able to escape the facility on the Ebon Hawk."}, {"tag": "h2", "text": "Mining facility crew"}, {"tag": "p", "text": "By the time of Meetra's visit, the Peragus Mining Facility had over one hundred and fifty personnel, all murdered by mining droids or gassed during the emergency lockdown. As the Exile never saw the miners alive, her only knowledge of them came from holorecords and datapads."}, {"tag": "h2", "text": "Mining facility droids"}, {"tag": "p", "text": "The facility used a large number of droids in its operations. These droids would later come under the command of HK-50 as he used them to murder the miners and prevent Meetra Surik's escape."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the demo of Knights of the Old Republic II that Obsidian Entertainment showed at the Electronic Entertainment Expo, the Peragus Mining Facility was a system of mining tunnels underneath the surface of Telos IV. Mira, a bounty hunter that the player meets on Nar Shaddaa, was instead a trapped miner in the demo."}, {"tag": "p", "text": "A non-canon option exists in the game for Meetra Surik to order Atton Rand to fire on an asteroid deliberately as they flee the Harbinger's gunfire, an idea suggested by Kreia. The resulting explosion sets off a chain-reaction just as the Harbinger's weapons hitting the asteroid would, adding an alternate cutscene to the menu list. Additionally, some dialogue is altered, as the Exile cannot truthfully protest innocence when accused of destroying the Peragus Mining Facility following that decision."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}