{"url": "Penzak_Kraal", "categories": ["Category:Legends articles", "Category:Domain Kraal", "Category:Males", "Category:Pilots", "Category:Yuuzhan Vong warriors"], "nodes": [{"tag": "h1", "text": "Penzak Kraal"}, {"tag": "p", "text": "Penzak Kraal was a Yuuzhan Vong warrior who, along with the other members of Domain Kraal, was assigned to guard over the captured world of Borleias during the Yuuzhan Vong War. A skilled pilot and an experienced warrior, Kraal was nonetheless killed in 27 ABY, while on patrol in the Pyria system."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Domain Kraal was assigned the world of Borleias in the Pyria system to watch over during the Yuuzhan Vong War. An important staging point for the successful assault on Coruscant, Borleias had a relatively small garrison of coralskipper pilots and warriors, of which Penzak Kraal was one. He and his domain kinsman, Charat Kraal, were often assigned to patrol the system; however, as the New Republic had been dealt defeat after defeat, the two were more accustomed to spend their hours in space discussing the Yuuzhan Vong, the gods and the \"infidels\" who populated the galaxy."}, {"tag": "p", "text": "It was during one of these discussions, while the two warriors were in a distant orbit around Borleias, that elements of the New Republic Third Battle Group reverted from hyperspace with the intent of recapturing Borleias from the Yuuzhan Vong. Kraal quickly donned his cognition hood and warned his domain's commander of the threat. As the Imperial-class Star Destroyer Mon Mothma disgorged its starfighters for an assault on the planet, Kraal decided to make an attack run on the ventral hangar of the Star Destroyer, imagining that once he and Charat were underneath the vessel, they could fly into the hangar and destroy the starship from the inside. Although Kraal managed to avoid destruction as he evaded the starfighters, a laser cannon volley from the Mon Mothma hit his vessel as he raced towards the hangar. The blast obliterated Penzak Kraal's coralskipper in an instant, killing him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "More experienced and decisive than Charat, Penzak Kraal was a capable pilot, and rather than commit himself to a pointless attack against the many starfighter squadrons present, he decided to make a bold run on a Star Destroyer. He was dismissive of his kinsman's suggestions that the galaxy's defenders were as resourceful as they often seemed, and was quite abrasive in his rebuttal of his kinsman's statements."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Penzak Kraal dies in the first chapter of The New Jedi Order: Enemy Lines I: Rebel Dream, soon after his introduction."}, {"tag": "h2", "text": "Appearances"}]}