{"url": "Peregrine_(Strike-class)", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Interdictor starships", "Category:Strike-class medium cruisers"], "nodes": [{"tag": "h1", "text": "Peregrine (Strike-class)"}, {"tag": "p", "text": "The Peregrine was originally a Strike-class medium cruiser in the Rebel Alliance fleet sent to the Airam sector."}, {"tag": "p", "text": "During the campaign it was upgraded with gravity well projectors from the Interdictor cruiser Compellor that had been captured from Imperial Admiral Senn's forces. After this conversion was completed, Peregrine was designated by the Rebels as a \"Modified Strike Cruiser\"."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the capture of the Compellor by Rebel forces, the Imperial fleet immediately began a concerted effort to recover the ship and deny its gravity well technology to the Rebels."}, {"tag": "p", "text": "The Rebels chose Peregrine for modification in an effort to trick Admiral Senn into thinking he had achieved his goal. With the assistance of the local Airam pirate clans, it was fitted with two large, bulbous housings for the gravity well projectors at the Airam X7-Factory Gallofree in the Mobetta system. The projectors were transferred to Peregrine, and Compellor was destroyed in full view of Senn's task force."}, {"tag": "p", "text": "Its field test was a Rebel attack against an Imperial convoy in the Derilyn system. Pinned down by the Peregrine's gravity wells, the imperial ships were unable to escape and all convoy craft were destroyed. Imperial losses included a Strike Cruiser, two Nebulon-B escort frigates, two Ton-Falk-class escort carriers and a Nebulon-B2 frigate."}, {"tag": "p", "text": "Later, Peregrine participated in a similar attack on the Imperial-class Star Destroyer Rage in the Bes system, spearheaded by Airam Dreadnaughts, but the attack was repulsed by Rage and its starfighter complement that included the elite Avenger Squadron."}, {"tag": "p", "text": "Peregrine was last seen in the disastrous Battle of Nocto, but is believed to have survived. Its ultimate fate is unknown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although it is possible for players on the Imperial side to destroy the Peregrine in the Battle of Nocto, its destruction is not a primary mission objective and irrelevant for the overall storyline that culminates in this battle. There is no canonical information pertaining to the demise of the Peregrine, therefore it can be assumed it withdrew from the battle at some point for lack of confirmation of its destruction."}, {"tag": "h2", "text": "Appearances"}]}