{"url": "Permit", "categories": ["Category:Legends articles", "Category:Legal documents"], "nodes": [{"tag": "h1", "text": "Permit"}, {"tag": "p", "text": "A permit was an authorization provided by the government of the city of Depatar, grant certain rights to a specific visitor to the city. As visitors had to buy several permits during their stay, they hired a professional permitor to deal with the Establishment."}, {"tag": "p", "text": "Depatar, known as the City of Masks, had been founded by several crime unions looking for a neutral meeting ground. It was later opened to others with similar needs. To protect the identities of people dealing in Depatar, every visitor was required by law to wear a full disguise; infractors were to be expelled from the city."}, {"tag": "p", "text": "Beyond that, visitors were required to have permits for many things they would like to do, including performing a commercial transaction or bearing personal weapons. The permits were held in a code cylinder and applied to a person identified by that person's costume (as the person's real name was a secret). The permit was valid for a limited amount of time, ranging from a few minutes to several days. An activity done without the permit could also be punished with the expulsion from the city; if the infraction was particularly severe, the City Council could expel the infractor from the city without using a ship — a problem in a gas giant."}, {"tag": "p", "text": "Visitors were unfamiliar with the correct bureaucracy, so the city grew a new occupation: The permitor, a professional sentient that would provide one or more visitors with all the permits they could need. They were identified because they wore a badge of permitor. One visitor commonly had one permitor during all the stay; although the visitor could change the permitor (paying a transfer of representation permit), this circumstance was rare. Permitors thus also served as specialized guides to the city. Sometimes, permitors were affiliated to specific guilds or Houses, and tried to direct their clients to businesses of that guild."}, {"tag": "p", "text": "Getting one permit could require four hours until its approval, although this time could be reduced by paying an additional fee. However, forging a fake permit could be done in six to thirty seconds, if the forger (commonly the permitor) was skillful. Obviously a black market of forged permits appeared in Depatar, which was a great black market in itself; the local government, which was composed of known criminals, profited from both legal and illegal permits, so they did not discourage this activity."}, {"tag": "p", "text": "Known permits include:"}, {"tag": "h2", "text": "Appearances"}]}