{"url": "Permafrost_crystal", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Lightsaber crystals"], "nodes": [{"tag": "h1", "text": "Permafrost crystal"}, {"tag": "p", "text": "Permafrost crystals were rare lightsaber crystals found on the planet Hoth. When used in a lightsaber, they gave the blade an icy blue color. During the Galactic Civil War, one permafrost crystal was in the possession of the township of Aurilia on the planet Dathomir. It was awarded to a spacer who was a key asset in the Battle of Hoth."}, {"tag": "h2", "text": "Properties"}, {"tag": "p", "text": "Permafrost crystals were deep, icy blue crystals; this coloration was a trait they passed on to the blade of any lightsaber into which they were incorporated. When one of the crystals was tuned by a Force-sensitive for use in a lightsaber, it became a focusing crystal and could only be used in lightsabers constructed by the individual who tuned it."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The only known source of the permafrost crystals was the planet Hoth, although how they were created was a mystery. Sometime during the Galactic Civil War, one of the crystals became the property of the township of Aurilia on the planet Dathomir. A quartermaster in the township awarded one of them to a spacer who was instrumental in the Battle of Hoth between the Galactic Empire and the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The permafrost crystal is a unique lightsaber crystal in the 2003 MMORPG Star Wars Galaxies: An Empire Divided, developed by Sony Online Entertainment. It was added to the game on November 20, 2008. Permafrost, like all blue crystals in the game, causes the player-character's lightsaber to deal additional cold damage when used. The vagueness of its history is due to the fact that, even though characters may take part in the Battle of Hoth in game, they may choose to fight on the side of either the Empire or the Rebel Alliance. They may then purchase the crystal for fifty \"Echo Base Tokens of Heroism,\" a commodity of which player-characters can get a maximum of nine for each flawless completion of the battle. Additionally, while characters may participate in the Battle of Hoth, which canonically takes place in 3 ABY, the game's time frame of approx. 1.5 ABY is not moved up to when the battle occurs. The crystal also appears as an \"Item\" card in the Star Wars Galaxies Trading Card Game set The Nightsister's Revenge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}