{"url": "Peril_on_Kashyyyk", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: The Freemaker Adventures"], "nodes": [{"tag": "h1", "text": "Peril on Kashyyyk"}, {"tag": "p", "text": "\"Peril on Kashyyyk\" is the fifth episode of the first season of the animated television series LEGO Star Wars: The Freemaker Adventures. It is the fifth episode of the series overall. The episode premiered on Disney XD on June 27, 2016."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Kordi's attempts to save money force the Freemakers into trouble on Kashyyyk..."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Job on Kashyyyk"}, {"tag": "p", "text": "On The Wheel, Rowan Freemaker wins a holochess match against Zander before their game is interrupted by Kordi, who is looking for loose credits. Business has fallen on hard times and Furlac is, for the second time, demanding the rent for their garage any day now. A ship belonging to Ignacio Wortan of the wealthy Core planet Wortan arrives in the hangar to have the dashboard replaced with Wroshyr wood, which is exclusive to Kashyyyk. He promises them a large sum of money for doing so, which Kordi initially accepts."}, {"tag": "p", "text": "Zander is reluctant since Kashyyyk is under an Imperial blockade as well as the fact that Wookiees don't accept visitors. Roger adds to his misery by mentioning the loss of his fellow troops in the Clone Wars battle that took place there, and the fact that Wookiees love to rip arms off. Although Rowan is fluent in Shyriiwook, which is the language of the Wookiees, Kordi decides to buy an RA-7 protocol droid, but the expense of 30,000 credits resorts her to installing a translator chip into Roger's data. Zander modified the StarScavenger by adding fins and wings that make it resemble a Lambda-class shuttle."}, {"tag": "h3", "text": "Rescuing Tantarra"}, {"tag": "p", "text": "Evading TIE fighters and an Imperial Star Destroyer, Kordi throws caution to the wind and lands the StarScavenger on Kashyyyk. The Imperial commanders, Lieutenant Commander Durpin and his aide Plumestriker, order their men to pretend the intrusion never happened but travel down to Kashyyyk to apprehend the intruders. Meanwhile, the Freemakers land their ship and encounter several Wookiees. Roger's head is ripped off in a botched attempt to speak with the Wookiees. Rowan saves the day with his knowledge of Shyriiwook and convinces Chief Attabura to give them the wood for free. Zander quickly reattaches Roger's head to his body."}, {"tag": "p", "text": "However, Roger then explains that Chief Attabura gave them the wood in return for them freeing his son Tantarra from the Trandoshans who are imprisoning him in an island fortress with the Imperials' permission. As long as the Trandoshans are holding Tantarra prisoner, the Wookiees do not dare fight back. Unwilling to get into anymore misadventures, Zander and Kordi suggest returning the wood. When Attabura roars, Roger and Rowan explain that it is considered dishonorable in Wookiee culture to break a deal. Rowan then convinces his sibilings to seize the opportunity to rescue a \"princess\"; confusing the Wookiee words for prince and princess."}, {"tag": "p", "text": "The three Freemaker siblings depart for the island fortress in their speeder bikes while leaving Roger behind with the StarScavenger. When asked by Zander, Kordi brings the wood along because she says that Roger has had a hard day already. After using a catapult to get inside, they are surrounded by Trandoshan guards. Kordi bluffs the guards into believing that they had come to replace a panel for the main cell block. The Freemakers then make their way into the main cell block where they find Prince Tantarra; who is initially annoyed when the Freemakers mistakenly call him a princess."}, {"tag": "h3", "text": "Imperial entanglements"}, {"tag": "p", "text": "Meanwhile, the Imperial officers Durpin and Plumestriker ask the Trandoshans if they have seen anything unusual. Upon learning about the supposed delivery of a wood panel, Plumestriker puts two and two together and Durpin sounds the alarm. Back in the fortress, the Freemakers and Tantara reach the top of the tower only to find the alarm ringing. Roger and the StarScavenger rendezvous with them at the top of the tower. Having rescued Tantarra, Zander fires a flare gun which gives the signal for the Wookiees to begin their attack on the Trandoshans. Before they can depart, Rowan senses a Kyber Saber crystal."}, {"tag": "p", "text": "The Trandoshans catch up with them and Roger is forced to fly the StarScavenger away when Wookiee Auzituck anti-slaver gunships begin bombarding the fortress. Together, Rowan, his siblings and Tantarra venture into the fortress. Amidst the fighting, Kordi orders Roger to rendezvous with the ship at the blaze. The Trandoshans shoot down a Wookiee gunship which begins deploying a party of Wookiee Warriors, who attack the Trandoshan garrison. Inside the command tower, Durpin and Plumestriker spot the Freemakers but lose them. Meanwhile, Rowan senses the Kyber crystal inside a tall tower. Together with Tantarra, the Freemakers venture inside a chamber full of Trandoshan statues."}, {"tag": "p", "text": "Rowan finds the Kyber crystal in the eye of a giant Trandoshan statue but is unable to remove it, Tantarra hurls a Trandoshan warrior at the eye, dislodging it and allowing Rowan to obtain it. After reuniting Tantarra with his father Attabura, the Freemakers return to the blaze where Roger is waiting with the StarScavenger. However, Kordi gets trapped under the roots of a tree. Zander and Rowan make it back to the ship only to be trapped by Durpin and Plumestriker. Roger's head falls off a second time and he says he hates this place so much. Plumestriker then remarks \"just as you said, find the ship, find the rebels.\" However, Durpin cannot recall making that statement."}, {"tag": "p", "text": "While Durpin makes a speech about all the things he would do to the rebels, Plumestriker realizes they are missing one more. At that point, Kordi sneaks up with the wood behind them and knocks them out. However, the impact splits the wood in half. Kordi considers going back to get another piece but relents when the Trandoshan fortress goes up in flames. Meanwhile, Roger puts his head back on only to get it knocked off a third time while boarding the StarScavenger."}, {"tag": "h3", "text": "Homecoming"}, {"tag": "p", "text": "Upon returning to The Wheel, the Freemakers and Roger offer Ignacio Wortan the wood. However, Wortan finds the wood damaged and calls off the deal. While Kordi is distraught, Zander reassures her that they gave the Wookies hope. Kordi responds that hope doesn't pay their bills and their rent. Rowan is also pleased that he found a third Kyber crystal."}, {"tag": "p", "text": "Naare praises her apprentice for his success and tells him that his powers are growing at a most impressive rate. She is surprised the Freemakers found the crystal on Kashyyyk and deduces that the Trandoshans must have brought it there. While everyone else is happy, Kordi is distraught by her setback and regrets not hiring a translation droid. Zander hugs and comforts his younger sister."}, {"tag": "p", "text": "Meanwhile above Kashyyyk, Lieutenant Commander Durpin is reprimanded by Emperor Palpatine and Darth Vader for his incompetence in stopping the intruders. Durpin tried to deflect some of the blame onto Plumestriker. However, Palpatine lays the blame on the Trandoshans and instead promotes Durpin to general and gives him more men and resources to get the job done. While Plumestriker is happy, Durpin is miserable and bangs his head."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}