{"url": "Atuarre", "categories": ["Category:Legends articles", "Category:Females", "Category:Scientists", "Category:Trianii"], "nodes": [{"tag": "h1", "text": "Atuarre"}, {"tag": "p", "text": "Atuarre ((pronounced /ɑtʊ'ɑreɪ/)) was a female Trianii who served in the elite Trianii Rangers during the era of the Galactic Civil War. Atuarre joined the elite law enforcement squad after marrying a Ranger, Keeheen, with whom she had a cub, Pakka. Although she had a sheltered, higher-class upbringing, Atuarre took quickly to the life of a Ranger, which eventually took her and her mate to a posting on the Trianii frontier world of Fibuli. Her life changed significantly when the Corporate Sector Authority violently annexed Fibuli around 2 BBY: the Authority captured and imprisoned Keeheen and Pakka, and while Atuarre managed to rescue her cub, he was so traumatized that he was unable to speak."}, {"tag": "p", "text": "As she searched for Keeheen, Atuarre linked up with Rekkon, an academic leading a group of concerned citizens who were also looking for family members kidnapped by the CSA. In the coming months, Atuarre was part of a crew who infiltrated a Authority Data Center on Orron III, and with the help of notorious smugglers Han Solo and Chewbacca, they managed to uncover the location of the prisoners: Stars' End, a secret prison on Mytus VII. Atuarre and Pakka subsequently joined Solo and Chewbacca in breaking into Stars' End and freeing those held within, and ultimately reunited with Keeheen."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Trianii Ranger"}, {"tag": "p", "text": "A female member of the feline species known as the Trianii, Atuarre was born and raised on the Trianii homeworld of Trian, where she grew up dreaming of being a dancer, model or corporate executive. From her youth, Atuarre lived a life of peace and comfort, as befitting a young woman born in a higher class. But one day, she caught the eye of Keeheen, a member of the elite Trianii Ranger law enforcement force, while watching the Rangers train. Keeheen was instantly smitten—for her part, Atuarre, while interested, initially turned the young cadet down. However, they exchanged information and kept in touch over the next two years, with Keeheen proposing to her frequently. As Atuarre learned more of Keeheen and his life, the more she found herself falling for him, and eventually they wed. They soon welcomed a cub, Pakka, into the world, and not long after Keeheen asked the lithe and athletic Atuarre to join him in the Trianii Rangers."}, {"tag": "p", "text": "Although the life of a Ranger was far different from the comfort she had grown up in, she soon found that she had an aptitude for the job, with her dance training helping her quickly master the intricate Trianii martial arts. After she became a full-fledged Ranger, she joined Keeheen in patrolling the planet Fibuli, a longtime flashpoint in the ongoing struggle between the Trianii and the Corporate Sector Authority. The couple's tour was originally uneventful—they spent most of their time stopping herdbeast rustlers and busting thionarx dealers—but in 2 BBY, war broke out in earnest when the Authority moved to forcefully annex Fibuli. Atuarre and Keeheen were involved in the armed Trianii resistance, but the Authority needed only three months to assume full control of the world."}, {"tag": "p", "text": "CSA forces captured Keeheen and Pakka at some point in the fighting. Vowing to save them or die trying, Atuarre managed to rescue her cub as he was being transported to an interrogation station, but by that time he had been so traumatized by the Authority's treatment that he had been rendered unable to speak. Keeheen, on the other hand, was simply gone. Desperate to find any trace of her missing mate, Atuarre discovered that it wasn't an isolated incident: there had been a rash of disappearances of beings who had openly defied the Corporate Sector Authority. That led Atuarre to link up with a group of people searching for their missing loved ones, led by a Human academic named Rekkon, whose nephew had vanished after criticizing the Corporate Sector government."}, {"tag": "h3", "text": "Search for Stars' End"}, {"tag": "p", "text": "Their search eventually led them to the planet Orron III, home of one of the Authority's Data Centers, where they hoped they could find some answers. Over a period of a month, Rekkon, Atuarre, Pakka and two comrades slowly infiltrated the facility, with the Trianii posing as an apprentice agronomist. They were playing a high-stakes game: during their short period on Orron III, one of their number, Engret, suffered the same fate as the loved ones they hoped to save. However, they soon received reinforcements in a pair of smugglers, cocksure Corellian Han Solo and his Wookiee partner Chewbacca, who had agreed to aid them on their mission and extract them from the planet in exchange for repairs to their ship, the Millennium Falcon. The two smugglers were accompanied by a pair of droids, Bollux and Blue Max, who allowed them to download relevant data pertaining to the location of the missing people. Atuarre and Pakka, as well as fellow conspirator Torm Dadeferron, arrived as the droids were finishing their work, although their introductions were interrupted when Blue Max notified the group that the Authority's Security Police had detected their presence and were moving on their position."}, {"tag": "p", "text": "With the help of Blue Max—which used its access to the Authority's systems to spoof alarms all over the planet—Atuarre and her confederates managed to narrowly escape the facility just ahead of a squad of police, stealing a skimmer and making a break for the nearby spaceport. However, pursuing police managed to force the skimmer to crash in a field, and while Atuarre focused on getting her cub to safety, police managed to capture Chewbacca. Without the Wookiee, the group reformed and returned to the Millennium Falcon and flee to hyperspace. But while the immediate threat of Authority capture was gone, any hope of peace was short-lived. Not long after the Falcon entered hyperspace, Rekkon—who had suspected there was an informant in his group—was found dead, slumped over the ship's dejarik board with a blaster wound in his back. Solo quickly deduced that Dadeferron was the killer, and managed to subdue him with Atuarre and Pakka's help before spacing him out of the ship's airlock."}, {"tag": "p", "text": "There was one fortunate aspect to Rekkon's death: before he had been shot, he had gotten the chance to examine the data taken from Orron III and write down the presumed location of the Corporate Sector's missing, a place on Mytus VII referred to as \"Stars' End.\" With two more of their group gone, Atuarre, Solo, Pakka and the two droids continued onward to the Mytus system, finding it to be a desolate asteroid and Stars' End a heavily guarded prison. However, Solo came up with an idea to get them inside: the crew of the Millennium Falcon would pose as entertainers, with Atuarre serving as the troupe leader and ace dancer of \"Madam Atuarre's Roving Performers.\" Although the Trianii warrior was initially nervous about posing as \"Madam Atuarre,\" she managed to pull off the role of smug, effusive celebrity brilliantly, and more than passed muster when performing her people's native dances before an audience that included Authority Security Division Viceprex Mirkovig Hirken."}, {"tag": "p", "text": "It was all a distraction, of course, drawing the attention of the prison's personnel away as Solo and Blue Max trawled the facility's systems for the locations of the prisoners, which they soon found. Meanwhile, the unimpressed Hirken cut Atuarre's performance short, wanting to see Bollux fight his Mark X Executioner gladiator droid, leading the Trianii to leave for the Falcon in a huff with her cub. As she approached the ship, Stars' End was suddenly rocked by a massive explosion—the result of a duel between Solo and Hirken's bodyguard, Uul-Rha-Shan—and Atuarre watched in shock as the prison blasted off the surface of Mytus VII into the sky above. Atuarre immediately took the Falcon's controls and made for the airborne prison. Realizing that the light freighter was not large enough to hold all of Star End's inmates, Atuarre used the ship's tractor beam to attach a tunnel-tube junction station, which had more than enough space to hold everyone, to the Falcon. With the station in place, Atuarre docked the ship on the hurtling prison and led the freed prisoners to safety, joyously reuniting with a safe and sound Keeheen on the way off Stars' End."}, {"tag": "p", "text": "Atuarre and her family tried their best to return to a normal life after their ordeal, settling down in Trianii space to enroll Pakka in school while taking a year off from active patrol duty. They both took positions in the Ranger hierarchy: Atuarre as a trainer for cadets, and Keeheen as an administrator. Pakka even began to speak again after a few weeks, indicating that Atuarre's family was fully on the road to recovery."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Haughty in her youth, Atuarre grew into a devoted mate and mother, Atuarre was willing to take great risks to protect her family, and carried with her no fear of death as she openly resisted the Corporate Sector Authority. It was a radical change from her youth: the Trianii grew up in an upper-class family, in a life of comfort, and was initially amused by the seriousness of the Rangers. However, after falling in love with Keeheen, her life took a completely different direction. Although never comfortable with a blaster, Atuarre took quickly to her training, and found that she had the inner desire for justice that was required for all Rangers. She even forwent her initial misgivings about living on a frontier world like Fibuli, joining Keeheen in patrolling the planet. But after her mate and cub were kidnapped by the Corporate Sector Authority, Atuarre became consumed by vengeance, and fully intended to either save her family or die trying."}, {"tag": "p", "text": "During her time searching for her mate, Atuarre kept her circle of trust small: while she was initially leery of Han Solo, she soon grew to respect the smuggler during their adventure in the Corporate Sector. Atuarre's training as a Trianii Ranger served her well throughout the ordeal, not only in terms of her fighting skills but in her discipline and ability to stay cool in stressful situations. The Trianii also proved to be a talented freighter pilot while at Stars' End. Standing about a head shorter than Han Solo—who himself stood about 1.8 meters tall— Atuarre was a slim, athletic Trianii with a light, cream-colored pelt characterized by a striped pattern on her back. Like most of her species, Atuarre typically wore no clothes outside of a utility belt around her waist."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Atuarre first appeared in the novel Han Solo at Stars' End, written by Brian Daley and released in 1979, and was pictured in the story's comic adaptation, where she was illustrated by Alfredo Alcala. Atuarre's entry in The Complete Star Wars Encyclopedia, and her entry in the original Star Wars Databank, incorrectly identify her as an apprentice agronomist, which was only her cover during her group's infiltration of Orron III."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}