{"url": "Periphery/Legends", "categories": ["Category:Legends articles", "Category:Galactic Empire sectors", "Category:Hutt Space", "Category:Outer Rim Territories sectors", "Category:Periphery"], "nodes": [{"tag": "h1", "text": "Periphery"}, {"tag": "p", "text": "The Periphery was a region of space that skirted Hutt Space and the Outer Rim Territories. It was also bordered by the Ansuroer sectors and the Karstaxon Regions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A number of major hyperspace routes ran through the region, with the Sisar Run and the Salin Corridor meeting at Sriluur, the region's capital. The Ac'fren Spur also ran from Sriluur out to the Si'Klaata Cluster in nearby Hutt Space."}, {"tag": "p", "text": "The Periphery was home to a number of sentient species, including the Defel, the aquatic Sedrians, the Ry'coz, the Vaathkree and the Weequay. Many other species immigrated to the region, including a number of long abandoned Hutt colonies."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Located between Hutt space and the Tion Cluster at the time of the Xim Wars, the Periphery was eventually absorbed in Hutt space after the victory of the Hutt Empire. The northern territories of Hutt space, which contained the Periphery, were known as the Kreetan Narrows."}, {"tag": "p", "text": "The Hutts lost control of the Periphery during the Hutt Cataclysms circa 15,000 BBY, but recovered it in the next millennia, as late as 5000 BBY."}, {"tag": "p", "text": "The Nikto Cult of M'dweshuu was active in the region in the days of the Old Republic."}, {"tag": "p", "text": "At the end of the Clone Wars, Hutt Space was substantially reduced but the Kreetan Narrows remained under Hutt control. In the months following the Declaration of a New Order, the surrounding regions were the site of important Separatist activity. After their defeat, the Separatists retreated to the Kreetan Narrows, leading to the annexation of the region, including the Periphery, by the Galactic Empire. The Periphery became a subsector of the Tharin sector."}, {"tag": "p", "text": "Given the region's proximity to Hutt Space, it was often thought that the Hutt criminal empires had significant influence in the region. In actuality, Black Sun controlled much of the region, through its Vigo Sprax. In addition to this activity, the region had been plagued for many years by the Disac pirates and well as the Ghilron pirates. The Disac pirates caused such significant interruption to Black Sun activities in the region that Ket Maliss, personal assassin of Black Sun's head, was dispatched to eliminate the pirate group. The Dashade was successful in this task, eliminating virtually the entire organization."}, {"tag": "p", "text": "During the Galactic Civil War, the region was governed by Governor Newen Streeg. The Imperial Navy presence in the Periphery was spearheaded by the Imperial-class Star Destroyer the Ruthless, while the Strike-class cruiser Ion Storm patrolled the Sisar Run with a small patrol fleet. This fleet consisted of Interdictors, escort frigates and carriers as well as smaller vessels like System patrol craft and Guardian-class light cruisers. While this presence had to deal with various criminal activities, it was also directed at activities of the Alliance to Restore the Republic which was active in the region. The Rebels even operated their own penal colony on Dles IV in the Dles system."}, {"tag": "p", "text": "During the Yuuzhan Vong War, a number of the regions' worlds such as Sriluur were overrun by the Yuuzhan Vong invaders."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}