{"url": "Personal_energy_shield/Legends", "categories": ["Category:Legends articles", "Category:Incomplete lists", "Category:Personal energy shields"], "nodes": [{"tag": "h1", "text": "Personal energy shield"}, {"tag": "p", "text": "A personal energy shield was a defensive technology that projected a field of energy that protected the user from blaster fire, the elements, or other hazards. Most were small enough to be worn on a belt or arm, or were designed to be held much like a traditional physical shield."}, {"tag": "p", "text": "When activated, the device protected the wearer with a glowing energy field. Typically, the standard energy shield was only effective against energy attacks, such as blaster bolts. However, other variants created by the Mandalorians and Echani could block melee attacks, while other shields developed by the Arkanians and Verpine, and other cultures, were capable of resisting a variety of different attacks, including electrical, kinetic, cold, heat, and sonic damage."}, {"tag": "h2", "text": "Use"}, {"tag": "p", "text": "As with most deflector systems, shields required large amounts of energy in the form of energy cells or a portable shield generator. Some models featured rechargeable energy cells. While the generator provided the most efficiency, it was larger and bulkier. The power requirements meant that shields tended to be used only when combat was expected."}, {"tag": "p", "text": "Another feature of personal shields was ablation, that is, the shield weakened as it absorbed damage until it either was deactivated, failed, or recharged. As the shields absorbed energy, they tended to become extremely hot. Due to the limitations of personal deflector shields, they were usually used in tandem with other forms of protection."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In use as early as the Mandalorian Wars and brought to prominence in the subsequent Jedi Civil War, the technology was rumored to be of Echani origin. There were melee shields, energy shields, and Verpine shields."}, {"tag": "p", "text": "When Revan began his campaign against the Galactic Republic, his Sith troopers were issued standard energy shields. This resulted in the Sith armies gaining many bloody battles against Republic troopers armed with standard blasters. After the Republic gained access to copies of the technology, it began to flourish. This led to both sides issuing standard melee weapons, such as vibroblades, and training their soldiers in hand to hand combat."}, {"tag": "p", "text": "While never widespread during the Jedi Civil War (usually being issued to small, elite strike teams) the technology eventually disappeared almost entirely. Little information exists as to why, but Admiral Carth Onasi was heard to speculate that in the future blaster technology might \"catch up\" to shield technology. As blasters became increasingly effective against shields, producing effective shields would most likely become increasingly difficult and expensive, until it was no longer feasible to build shields for everyday use."}, {"tag": "p", "text": "By the time of the Battle of Naboo, personal shields that covered an entire being existed, but produced radiation and magnetic fields that were dangerous for sustained use. The Gungan Grand Army of Naboo employed hand-held personal energy shields that projected a thin force field around one and a half meters tall. The commando droids which protected the Separatists' vital facilities such as the Citadel were also equipped with hand-held personal shields similar to Gungan's. The droideka units of the Trade Federation also carried personal energy shields, making them highly effective against clone troopers and Jedi Knights. However, these shields were hazardous to organic lifeforms, generating highly-intense electromagnetic fields and large amounts of radiation. In contrast, however, the Republic used personal shields in much the same way they had been used in the Jedi Civil War, issuing them to their small but skilled clone commando units. According to Imperial doctrine circa 0 BBY, high-ranking Stormtrooper leaders were issued personal energy shields."}, {"tag": "p", "text": "The Chiss used personal shields with reverse polarity to protect homes against robbers, with the criminals often incinerating themselves. However, this practice was discontinued several decades prior to 27 BBY due to the dangers of both the radiation and of catching innocent bystanders."}, {"tag": "p", "text": "During the Galactic Civil War through the Yuuzhan Vong War, however, personal shield tech was all but lost. Very few armies equipped their soldiers with personal shielding, due to the craft being lost (or simply outdated) for many years. The technology was by then very expensive and mostly limited to extraordinary individuals, such as the mercenary/Jedi Kyle Katarn and his student Jaden Korr, Sate Pestage, Imperial General Bentilais san Sk'ar, and a Ben Kenobi-impersonating Imperial agent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars: Jedi Knight: Mysteries of the Sith depicts Mara Jade as using a personal shield on a number of missions; however, this shield hasn't been mentioned in any other sources, and is generally considered simply a convention of Mysteries's game mechanics."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}