{"url": "Personal_Universal_Translator", "categories": ["Category:Legends articles", "Category:Cybot Galactica products", "Category:Data storage and processing", "Category:Translation devices"], "nodes": [{"tag": "h1", "text": "Personal Universal Translator"}, {"tag": "p", "text": "The Personal Universal Translator (PUT for short) was an electronic translator designed by Cybot Galactica so that traders, politicians, and spies would be able to communicate effectively with new and prospective clients in a no-frills manner. The device allowed a single individual to communicate verbally in anywhere up to two thousand known languages through means of language chips. These chips were available for each sector, star system, and planet of the Empire. To use the PUT, you simply had to put the new language chip in and you could understand what everyone around you was saying. There were two chip receptacles in the master unit which could be used to hold a second memory chip or language chip."}, {"tag": "p", "text": "Because the PUT did not have any artificial intelligence of its own, it was not able to translate body languages, rituals, or any other type of non-verbal communications. It was able to use broadband communications to communicate with a protocol droid if needed to enable more precise translations. Though the protocol droid did not have to be physically present for this to work, it did have to be within broadband receiver range. There was a companion unit for the PUT which had to be installed on the protocol droid which allowed it to broadcast any translation or helpful hints back to the PUT user."}, {"tag": "p", "text": "Other features of the PUT included primary and secondary earpiece ports which allowed discreet listening for either one or two individuals, or for having private conversations. When an earpiece was inserted into either port, the speaker on the main unit could be turned off for privacy. The main unit itself was roughly the same size as a standard paperback novel."}, {"tag": "p", "text": "The Empire modified some of the broadband transmitter/receiver setups so as to allow probe droids and assassin droids to use the PUT. The combination became extremely effective for deep cover operatives requiring an assassin droid to terminate a target by spoken word from a distance. The Empire also used the PUT as a diplomatic aid when they were dealing in remote areas. Each ambassadorial post was generally issued with several of these units when diplomatic relations got underway. It was rumored that Imperial spies also used the PUT to listen to, and record, incriminating conversations, though that would technically be illegal. Many traders also used the PUT as an alternative to relatively expensive protocol droids."}, {"tag": "h2", "text": "Sources"}]}