{"url": "Pers_Pradeux", "categories": ["Category:Legends articles", "Category:Galactic Republic admirals and generals", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Pers Pradeux"}, {"tag": "p", "text": "Pers Pradeux was a Republic Navy officer during the Pius Dea Era and was among those responsible for the Pius Dea's overthrow. He was considered the \"father\" of the modern Republic Navy, and to some extent, the Imperial Navy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Pers Pradeux joined the Republic Navy when it was a bastion of the Pius Dea religion, and rose to the rank of Admiral: for nearly a thousand years beforehand, the Republic Navy had been the tool of the theocrats controlling the Galactic Republic to launch Crusades against the alien species of the Rim. By the 10,900s BBY, however, a heresy stoked by Jedi and Caamasi agents was circulating throughout the Pius Dea Republic, and Pradeux became influenced by Renunciate thought. Admiral Pradeux became part of the conspiracy to overthrow Pius Dea and restore the Republic."}, {"tag": "p", "text": "Pradeux discovered the secret colony of Prefsbelt IV, founded by Republic citizens fleeing the Pius Dea, and used the world as a secret base and a retreat for his fellow Renunciate naval officers while plotting the overthrow of the Pius Dea Faithful."}, {"tag": "p", "text": "Following the Battle of Uquine in 10,966 BBY and the collapse of Pius Dea rule, Pradeux and his colleagues held meetings on Prefsbelt to plan the reorganization and rebuilding of the Republic Navy."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Owing to his role in restoring the Republic Navy after the defeat of the Pius Dea, Pradeux became remembered as the \"Father of the Navy\", with Castle Pradeux on Prefsbelt named for him."}, {"tag": "p", "text": "After his death, Pradeux's body was entombed in the Naval Crypt, a few kilometers from Castle Pradeux. As a tradition, the night before graduation from the Prefsbelt IV Naval Academy, navy midshipmen would walk from Castle Pradeux to the Crypt and pledge their dedication to the service."}, {"tag": "p", "text": "The Imperial Navy named the Imperial I-class Star Destroyer Pradeux in his honor."}, {"tag": "h2", "text": "Sources"}]}