{"url": "Personal_Luxury_Yacht_3000", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Ship stubs", "Category:Personal Luxury Yacht 3000s", "Category:Yacht classes"], "nodes": [{"tag": "h1", "text": "Personal Luxury Yacht 3000"}, {"tag": "p", "text": "The SoroSuub Personal Luxury Yacht 3000 was a yacht starship, similar to a transport, only more suited to travellers rather than cargo, and far more luxurious."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Personal Luxury Yacht 3000 was 50 meters long, with a pair of engine pods that extended from the main hull. Each pod housed a sublight engine and a hyperdrive engine. It also had an observational level with an exterior deck near the aft of the ship, while the interior compartment had a small jet-stream meditation pool and several conform-couches. The main deck offered a dining area, a large private suite, and five visitor cabins, as well as the escape pods, the bridge and the main control systems. In addition, the viewports on the side of the ship were retractable. Above the bridge was a docking coupling. It also housed a retractable laser cannon on the ventral side of the ship in the event of emergencies. It sometimes also utilized ion engines. The power couplings and sensor arrays were at the front of the ship, and in some cases jutted out."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Personal Luxury Yacht 3000s, made by SoroSuub, were utilized as early as the Clone Wars, including a visit to Naboo by Supreme Chancellor Palpatine."}, {"tag": "p", "text": "During the Liberation of Gerrard V by the Rebel Alliance, the planet's Imperial governor used a small fleet of these yachts in an attempt to pillage the planet's priceless treasures and military supplies as he fled; this was thwarted by Gold Squadron's use of ion cannons."}, {"tag": "p", "text": "This type of ship was later used by members of the New Republic, namely Lando Calrissian, owner of the Lady Luck, and Mara Jade Skywalker, owner of the Jade's Fire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There is an error in the ship's depiction in the Star Wars: The Clone Wars TV series. In the show the ship is shown to fire lasers out of the two antenna-like structures on the ventral side of the vessel. However, The Essential Guide to Vehicles and Vessels identifies these structures as the comm transceiver."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}