{"url": "Personal_Force_reservoir", "categories": ["Category:Legends articles", "Category:The Force"], "nodes": [{"tag": "h1", "text": "Personal Force reservoir"}, {"tag": "p", "text": "The personal Force reservoir refers to how much a Force user could perform their Force powers before fatigue or other inabilities. The user's condition could be restored with rest and meditation. This amount of endurance was highly dependent on the user's experience. For example a Jedi Master could use their abilities more times than a Padawan, before fatigue."}, {"tag": "h2", "text": "Symptoms and concerns"}, {"tag": "p", "text": "Several Force powers had different demands in concentration and endurance than others, on behalf of the Force user. Continuous or excessive usage of the powers would have resulted in \"Force fatigue\" with several unwanted symptoms, both physical and mental."}, {"tag": "p", "text": "Count Dooku experienced some waning and waxing of his strength with the Force during the duel on the Invisible Hand. In this case, Dooku's over-reliance on the dark side led to \"Force exhaustion,\" temporarily shutting down his natural Force senses. In several instances, this fatigue was suggested to have been heavily linked to Dooku's state of mind, with his strength being restored by a moment's introspection."}, {"tag": "p", "text": "The excessive use of the battle meditation Force technique by Darth Caedus during the Second Battle of Fondor rendered him \"thin-stretched\" and unable to move or think clearly for a while, clearly demonstrating the limitations of Force usage. It was fairly likely that these limitations referred much to mental limitations and also the inability of the body to withstand continual use of external energies."}, {"tag": "p", "text": "The Corellian Jedi apprentice Corran Horn referred to his personal Force reservoir, during his training at the Jedi Praxeum."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The concept of Force repository appears in Lucasarts games and is a game mechanic. By using Force powers, the pool wears out, and replenishes slowly with time/rest. Its role in games is to simulate the natural limitations (such as fatigue, concentration, experience) of a user, while its gameplay value is the same as the 'mana pool' of fantasy games; such measures prohibit the player using all of his powers every moment and therefore urges him/her to strategically choose the best time for each action rather than using them recklessly."}, {"tag": "p", "text": "In the wider Expanded Universe it is not explicitly mentioned that the Jedi have a finite (replenishable) repository of powers."}, {"tag": "p", "text": "However the exact mechanism of these limitations is unknown and almost certainly not so mathematically precise as the 'Force mana' of the video games."}, {"tag": "p", "text": "In the Super Star Wars trilogy for Super Nintendo, the Force repository is replenished only by taking a potion-like bonus."}, {"tag": "p", "text": "In the non-canon Soulcalibur IV, the three Star Wars characters' Force feature is called Force Meter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}