{"url": "Peshk_Vri%27syk", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Bothans", "Category:Males", "Category:Pilots", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Peshk Vri'syk"}, {"tag": "p", "text": "Peshk Vri'syk was a male Bothan pilot who served in Rogue Squadron, the New Republic's elite starfighter unit, in 6 ABY. Born on Bothawui, Vri'syk was trained in flight combat at the Bothan Martial Academy. His performance earned him an appointment to Rogue Squadron when the unit was reconstituted in 6 ABY by Commander Wedge Antilles. Vri'syk's assignment was also politically motivated; the Bothans wanted a member of their species represented in the New Republic's flagship squadron because their spies had uncovered the location of the second Death Star, which Rogue Squadron subsequently assisted in destroying. The New Republic assented to the request."}, {"tag": "p", "text": "Although inexperienced, Vri'syk was an excellent pilot, and his training scores—along with the rest of the squadron's new recruits—were better than those of many front-line combat units. Vri'syk saw action at Chorax, and served in the effort to extract New Republic assets from the planet Hensara III. He survived a covert stormtrooper attack against the Rogue Squadron base on the planet Talasea, and participated in a retaliatory strike against Admiral Devlia, the Imperial officer who had ordered the assault. Vri'syk was killed during the First Battle of Borleias when a heavy ion cannon blast destroyed his X-wing starfighter. His legacy was later exaggerated by the Bothans to advance their political achievements."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Peshk Vri'syk was a male Bothan born on the planet Bothawui. Educated at the Bothan Martial Academy, Vri'syk was trained in starfighter operations and combat. He was a year ahead of the female, Asyr Sei'lar, and the two were considered to be equally skilled during their training. In 6 ABY, the New Republic's elite starfighter unit, Rogue Squadron, was in the process of being reconstituted by Commander Wedge Antilles. Vri'syk's skills earned him a posting to the squadron, although his assignment was partly spurred by political motivations. The Bothans wanted their species represented in the New Republic's foremost starfighter squadron as Bothan spies had been responsible for locating the second Death Star, which Rogue Squadron had subsequently taken a role in destroying during the Battle of Endor. The New Republic agreed to the request as a way of showing the Bothans that their contributions were valued."}, {"tag": "p", "text": "Although the political pressure benefited Vri'syk, Antilles assured Admiral Gial Ackbar, the Supreme Commander of the New Republic Defense Force, that none of the pilots selected for political reasons—which included the Thyferrans Bror Jace and Erisi Dlarit to appease the competing Bacta Cartels on their homeworld, Thyferra—was inferior to any other candidates. Along with the rest of the newly formed squadron, Vri'syk was posted to the training base on Folor, a moon of the planet Commenor, where he was given the call sign Rogue Two, a placement in One Flight, and assigned as Antilles' wingman."}, {"tag": "h3", "text": "Rogue Squadron"}, {"tag": "p", "text": "Alongside the rest of the squadron, Vri'syk participated in training exercises while stationed on Folor as Antilles sought to mold his new recruits into a viable squadron. During an exercise on the base's gunnery range, Antilles ordered one of the Rogues, the Corellian Corran Horn, to make the first run and complete a series of flying and targeting challenges. The Corellian complied, and aimed to score a target that the other members of the squadron would not be able to match in an effort to impress the Commander. However, Antilles felt that Horn needed to learn a lesson in humility and teamwork, and ordered Horn's astromech droid, Whistler, to transmit the pilot's sensor data to the rest of the squadron so that they would benefit from Horn's run. Horn subsequently scored 3250 out of a possible 5000, and was ordered back to base with no knowledge that the rest of the squadron would be using his data. Vri'syk tackled the exercise using Horn's data as ordered, scoring 4200. Antilles then privately revealed to Vri'syk what he had done to Horn and ordered the Bothan not to mention it to Horn, but to simply inform the Corellian of his score. Upon returning to base, the Bothan took pleasure in reporting his success to Horn, who had no idea why the rest of the squadron was beating his score until he figured out what Antilles had done. Following the exercise, the squadron gathered in DownTime, the base's cantina, where most of the members considered presenting a formal protest over Antilles' actions towards Horn to General Horton Salm, the base commander. When Horn arrived after confronting Antilles over the commander's actions, Vri'syk was apathetic to his presence while the rest of the squadron were pleased to see him. Later during their training, Vri'syk and the squadron participated in a simulated attack on Defender Wing, a unit of three BTL Y-wing starfighter training squadrons led by General Salm. The assault ended with the Rogues registering thirty simulated kills for the loss of four of their own."}, {"tag": "p", "text": "A month after the Rogue Squadron roster was finalized, the unit was declared operational. Antilles believed that the unit was still green, however. He had expected between four-to-six months of advanced training before taking the squadron into combat, but he could not deny that his pilots were superior fliers and that their training scores were better than those of operational line units. As part of the New Republic's campaign to advance into the Core Worlds in an attempt to liberate the galactic capital of Coruscant, Rogue Squadron was moved to the planet Talasea in the Morobe system. During the transfer, the Rogues were pulled out of hyperspace in the Chorax system by the Imperial interdictor cruiser Black Asp, which was attempting to apprehend the smuggler Mirax Terrik and her ship, the Pulsar Skate. The Rogues engaged the Imperial ship and its squadron of TIE starfighters, driving them off with no losses to the Rogues."}, {"tag": "p", "text": "Vri'syk and his squadronmates' first official action against the Empire was at the Rout of Hensara, a mission to protect the Battle of Yavin, a modified customs frigate. Assigned to Coreward scouting missions, the Battle of Yavin had encountered the Strike-class medium cruiser Havoc in the Hensara system. Forced to go to ground to avoid capture, the ship's crew sank the vessel in a deep lake on the planet Hensara III. The Havoc had landed ground forces to search for the ship and crew, then left the system, giving the New Republic a chance to effect a rescue mission. During the operation, the Havoc returned, having been retrofitted with starfighter hangars and carrying thirty-six TIE Series craft—six TIE interceptors, six TIE bombers, and twenty-four TIE starfighters. The Rogues engaged the Imperials, and Vri'syk killed at least two enemy fighters. The New Republic won the battle, destroying thirty-four craft with no losses. On Talasea after the battle, Rogue Five, Gavin Darklighter, who secured no kills during the engagement, was jokingly named \"worst pilot in the squadron\" rather than the Bothan, a fact that Vri'syk was visibly relieved about."}, {"tag": "p", "text": "One night on Talasea, a platoon of Imperial stormtroopers was dispatched to the base by Admiral Devlia, commander of Imperial forces in the Rachuk sector, based on information provided by Imperial Intelligence agent Kirtan Loor who was actively hunting the Rogues. Vri'syk survived the covert attack, which claimed the life of Rogue pilot Lujayne Forge and left his squadronmates Horn, Darklighter and Andoorni Hui seriously injured. Vri'syk attended Forge's funeral and, later, participated in a retaliatory strike against Devlia and his forces at Grand Isle, their base on the planet Vladet. Once again, the battle proved to be a victory for the New Republic with no losses to Rogue Squadron."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "As part of the New Republic's offensive towards the Core, a task force was assigned to capture the planet Borleias, a target codenamed \"Blackmoon.\" The New Republic intended to use Borleias as a staging point for the assault on Coruscant. The mission was commanded by the Bothan General, Laryn Kre'fey, and the Bothan Spynet indicated that Borleias was poorly defended. Rogue Squadron was assigned to the task force, charged with escorting assault shuttles to the surface once the larger capital ships had breached the planetary shield and subdued its defenses. However, the Imperial commander, General Evir Derricote, had extra defenses hidden on the planet of which the Bothans were unaware. During the engagement, Derricote allowed the New Republic to believe that they were weakening his shields with their assault by gradually reduced power to them, lulling them into a false sense of security. Once the shields had dropped and no defensive fire came from the surface, General Kre'fey ordered General Salm's Defender Wing away from the engagement—the unit had originally been slated to sweep the planet's defenses with a bombing run, but Derricote's actions had convinced the Bothan General that such an action was unnecessary—and ordered the Rogues to escort the shuttles in."}, {"tag": "p", "text": "Vri'syk and his squadronmates formed up on the shuttles, escorting them to their target. As they approached, Derricote sprung his trap, re-establishing his planetary shield and firing surface based ion cannons at the task force. The first barrage of ion fire struck the Modaran, Kre'fey's command shuttle, and sent it slamming into the shield. Vri'syk's starfighter, positioned between one of the other shuttles and the shield, was struck by another ion blast, which vaporised him and his craft. The New Republic task force effected a retreat from the battle, while the Rogues also lost Andoorni Hui to enemy fire."}, {"tag": "p", "text": "Despite Vri'syk's brief career with Rogue Squadron, the Bothans exaggerated his accomplishment and hailed him as a hero in order to advance their political achievements, comparing him to the Martyrs who secured the second Death Star plans. More than three years later, Wedge Antilles still regretted the loss of Vri'syk, and would remember him while recalling other close friends who had perished in battle, including Biggs Darklighter, Jek Porkins, Dak Ralter and others."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Peshk Vri'syk was a ruddy-furred Bothan who was considered to be an excellent pilot. While not as impressive as fellow Rogues Corran Horn or Bror Jace, Vri'syk stood out among his classmates at the Bothan Martial Academy. Vri'syk possessed a great amount of pride in his abilities; while his colleagues felt guilty for excelling in a Folor training run at Horn's expense, Vri'syk took great delight in bragging about his score. He was also relieved to not be regarded as the worst pilot in the squadron following the Battle of Hensara, a distinction that fell on Gavin Darklighter. Vri'syk was also the most socially detached of the Rogues. He seldom engaged in conversation with his fellow pilots, and he reacted apathetically to Horn after the Folor training session, while the other pilots were happy to see him and apologetic for benefiting at his expense by the use of his targeting data."}, {"tag": "p", "text": "Vri'syk's given name, Peshk, meant \"handsome\" in Bothese. His family name, Vri, translated as either \"groundskeeper\" or \"caretaker\". The \"'syk\" honorific suffix indicated that he belonged to either Clan Asyk, or Clan Isyk."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Peshk Vri'syk was created by Michael A. Stackpole and first appeared in X-Wing: Rogue Squadron, the first novel in the X-Wing series published in 1996. He was first illustrated in the Japanese language edition of the Rogue Squadron novel. Vri'syk garnered mentions in other entries in the X-wing series, including X-Wing: Wedge's Gamble, X-Wing: The Krytos Trap—both also published in 1996—and X-Wing: Isard's Revenge, which was released in 1999. He later received entries in both the Star Wars Encyclopedia in 1998 and 2008's The Complete Star Wars Encyclopedia, and was mentioned in the fourteenth issue of The Official Star Wars Fact File."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}