{"url": "Pest_Control", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2017) lead stories"], "nodes": [{"tag": "h1", "text": "Pest Control"}, {"tag": "p", "text": "\"Pest Control\" focuses on Finn's adventure in the First Order, in which a creature is let loose on the Resurgent-class Star Destroyer Finalizer. It was published as the lead story of Star Wars Adventures 3 on October 18, 2017."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The purple intruder"}, {"tag": "p", "text": "On the fringe of the Outer Rim, the Resurgent-class Star Destroyer Finalizer was orbiting the planet of GUHL-JO387O. FN-2187 was cleaning off an AAL-1971/9.1 Troop Transport that had just come back from the mud planet. FN-2187 did not like how the First Order always seemed to be landing on mud planets. Instead he wished that they would go to planets made out of cakes. A strange sound came out of the troop transport and he went to go investigate. A creature from the planet had made its way onto the transport. The purple furred creature leaped up on to FN-2187's helmet causing him to run all around the hangar bay, trying to get the creature off. He smacked his head into a TIE fighter, knocking off his helmet and the creature. FN-2187 got up and remembered that Captain Phasma told him that under no circumstances can you be compromised which he learned from hsi training. He realized that he had just been compromised as the creature ran off with his helmet."}, {"tag": "p", "text": "As he was chasing the creature through the hallways they ran past Kylo Ren with General Armitage Hux and other First Order officers. They were discussing a planet in the Western Reaches of the galaxy. FN-2187 sat down on the floor knowing that he will be harshly punished for this. The situation went from bad to worse when the creature ran back into the room where Kylo Ren and the other officers had gathered and messed around with a control panel, causing the power to shut off in the room. Kylo Ren ignited his red-bladed lightsaber to provide a light source in the room. FN-2187 quickly ran into the room and grabbed the creature trying to figure out how he could explain this to Kylo Ren. He played with the idea that maybe Kylo Ren and the creature will become friends but quickly shot the idea down realizing that Kylo Ren will most likely eject the creature in the vacuum of space. The creature got away again and rode on top of a mouse droid and into a bathroom. FN-2187 caught up the creature and collected him again. All the sudden, the shower turned on and the stormtrooper was looking for a means of escape. Kylo Ren then started to knock on the door, requesting to speak with Captain Phasma who was in the shower. FN-2187 grabbed Phasma's helmet and stuck it of the door, tricking Kylo Ren into think it was her. Kylo Ren said that he had transmitted \"her\" the orders, making sure she had received them. Kylo Ren also said that he sensed the presence of something from the planet below them on the ship and ordered \"Phasma\" to find any Resistance activity on the planet and bring it to him. Ren left and FN-2187 was very surprised that it worked."}, {"tag": "h3", "text": "Down on the planet"}, {"tag": "p", "text": "Shortly after, on the surface of GUHL-J0387O, FN-2187 and other stormtroopers were ordered to search the surrounding for any Resistance activity. FN-2187 stayed on the transport and opened a crate to grab the creature and return it. But the creature was not in the crate. The creature was on the controls and managed to send the ship into lift off. The transport started flying around carelessly and FN-2187 was barely holding on. Phasma ordered the stormtrooper to gain control of the ship as it started to barrel towards Phasma. Finn managed to get control of the ship and it just missed her. The ship hit the surface and crashed nearby. Phasma came by and told him to execute the creature and maybe they could use it afterwards. FN-2187 was very hesitant on doing it and even considered taking down Phasma but the stormtroopers would also kill him. But before he could go through with it, more of the purple furred creatures appeared and FN-2187 recommended that they should leave them. Phasma agreed and ordered the stormtrooper to put his helmet back on."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}