{"url": "Petranaki_arena", "categories": ["Category:Legends articles", "Category:Geonosis locations", "Category:Gladiatorial arenas", "Category:Rock formations"], "nodes": [{"tag": "h1", "text": "Petranaki arena"}, {"tag": "p", "text": "The Petranaki arena, also known as the Arena of Justice and commonly referred to as the Geonosian execution arena, was brought about by both a need for entertainment in the rigid Geonosian society, and an efficient way of disposing of otherwise resource-draining prisoners. It was named after Petranaki, a form of arena combat fighting that utilized several special weapons, including the Picador's spear. The most popular attractions used deadly beasts in combat, resulting in the extinction of some of the more crowd-pleasing creatures on Geonosis."}, {"tag": "p", "text": "Those looking to trade with Geonosis would often provide exotic predators for the arena entertainment as payment. Such creatures included acklays, nexus, reeks, and mongworsts."}, {"tag": "p", "text": "The arena itself was a natural formation carved out by millennia of weathering, with additions made by the Geonosians. Its floor consisted of sand and silt upon which events took place. The lower walls of the arena base included ancient low-relief carvings depicting famous battles and events. The arena could also be flooded for aquatic events."}, {"tag": "p", "text": "A large tunnel connected the arena to an underground Geonosian droid factory and was below the Geonosian High Audience Chamber. Droid storage chambers were also located nearby."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly before the First Battle of Geonosis and the outbreak of the Clone Wars, Obi-Wan Kenobi, Anakin Skywalker, and Padmé Amidala were all scheduled for execution, having been convicted of espionage by Poggle the Lesser. With a mix of ingenuity and Jedi abilities, the trio evaded the beasts long enough for Mace Windu to arrive with a strike force of Jedi Knights. In response, large numbers of battle droids flooded the arena, signaling the start of the Clone Wars. Fighting soon erupted between the two sides. The 212 Jedi were overwhelmed by the sheer amounts of droids, and soon only about 30 of them survived. A dozen Jedi formed a circle. It would have been a defeat for the Jedi if not for the timely arrival of Master Yoda and the newly christened Grand Army of the Republic, who managed to rout the Confederacy of Independent Systems forces. Shortly after the battle had moved away from the arena, the famed Republic clone commandos of Delta Squad fought their way into the High Audience Chamber, slaying the Geonosian lieutenant Sun Fac and shutting down the droid foundry beneath the arena. After the battle had been completely won, Republic forces took control of the planet, and droid remains were taken to be melted down."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}