{"url": "Peter_Mayhew", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Star Wars original trilogy actors", "Category:Star Wars: Episode III Revenge of the Sith actors", "Category:Star Wars: Episode VII The Force Awakens actors", "Category:Star Wars: Episode VIII The Last Jedi actors", "Category:The Star Wars Holiday Special actors", "Category:Deceased actors"], "nodes": [{"tag": "h1", "text": "Peter Mayhew"}, {"tag": "p", "text": "Peter Mayhew (May 19, 1944 – April 30, 2019) was a British actor, best remembered for his portrayal of Chewbacca in the Star Wars films. He was born in Barnes, London, England."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Prior to his work on Star Wars, Peter Mayhew was cast in the role of a Minotaur on a previous movie. The producers discovered Mayhew from a photograph in a newspaper article about men with large feet. Mayhew's portrayal of the Minotaur impressed several film-industry employees, who offered him a chance to act for more movies; he accepted. After finishing his work as the Minotaur, Mayhew received a phone call from 20th Century Fox, who informed him of the production for Star Wars: Episode IV A New Hope and asked him to audition for one of the characters."}, {"tag": "p", "text": "Upon entering the office, Mayhew spotted paintings of the characters on a wall, done by Ralph McQuarrie. At one end was Chewbacca, with a sign that read \"Eight foot plus, blue eyes.\" Having blue eyes himself, Mayhew picked Chewbacca as the character to audition. Immediately afterward, the door to the office opened; director George Lucas walked into the room, with producer Gary Kurtz flanking him. Mayhew stood up on instinct, something he attributes to living in England. Lucas looked up, shook hands with Mayhew, turned to Kurtz and said \"I think we found him.\" Lucas and Kurtz would go on to explain what the character was, as well as the design of the costume. Originally, Chewbacca had shorts and a vest, which Lucas advised against due to Chewbacca being an animal."}, {"tag": "p", "text": "Lucas originally had the idea of casting David Prowse, a six footer, as Chewbacca, but in a show of irony, Prowse chose to be Darth Vader, because he \"didn't want to be a masked character.\" Consequently, the role of Chewbacca was given to Mayhew. His first shot was Docking Bay 94, where Han Solo was talking to Jabba the Hutt. When cast in the role, he studied the movement of large animals at the zoo to come up with an authentic sense of movement for Chewbacca. Mayhew did not provide the voice of Chewbacca; that was created by the film's sound designer, Ben Burtt, by mixing together the growls of different animals."}, {"tag": "p", "text": "In addition to his work as Chewbacca in the films, he appeared in character in various commercials and for hospital appearances for sick children. Mayhew lived in Granbury, Texas. In an interview with the Fort Worth Star Telegram, he jokingly noted that he didn't get a medal at this ceremony either, a reference to the Star Wars scene in which Luke and Han get medals but the Wookiee gets none."}, {"tag": "p", "text": "He was kind enough to make a cameo as himself in the Paducah Imperials FanForce feature-length fan film Star Wars Fanboy, scaring off stormtroopers with Wookiee noises, some of which he made himself on set."}, {"tag": "p", "text": "Mayhew's family announced that he had passed away on April 30, 2019, in a post on Twitter."}, {"tag": "h2", "text": "Star Wars filmography"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}