{"url": "Phantom_Squadron", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:New Republic starfighter squadrons", "Category:Phantom Squadron personnel"], "nodes": [{"tag": "h1", "text": "Phantom Squadron"}, {"tag": "p", "text": "Phantom Squadron was a New Republic starfighter squadron that was formed by Captain Wedge Antilles. In 5 ABY, the squadron fought against the Galactic Empire during the liberation of Kashyyyk. Since their strike on Kashyyyk had not been authorized by the New Republic Defense Fleet, the squadron was dissolved as punishment. However, Phantom Squadron was re-established just in time to participate in the climactic Battle of Jakku, which ended the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Liberation of Kashyyyk"}, {"tag": "p", "text": "Following the capture of the Imperial Vice Admiral Perwin Gedde in 5 ABY, Captain Wedge Antilles informed his student Temmin Wexley that he was planning to establish a new squadron called Phantom Squadron. He invited Wexley to join the squadron once he was spaceworthy. Phantom Squadron consisted of washouts, burnouts, and capable freaks."}, {"tag": "p", "text": "At the urging of Princess Leia Organa, Phantom Leader Antilles and his squadron launched an unsanctioned attack on the Imperial-occupied world of Kashyyyk. By the time of that attack, Phantom Squadron numbered twelve X-wing starfighters and their pilots. During the battle, one of the X-wings was shredded by three TIE fighters. Phantom Squadron and Organa's borrowed ship, the Millennium Falcon, were then reinforced by Admiral Ackbar's flagship Home One. The remaining Imperial forces were defeated after Han Solo hijacked the Dominion and destroyed the Star Destroyer Vitiator. Phantom Squadron suffered a few loses during the battle."}, {"tag": "h3", "text": "Dissolution"}, {"tag": "p", "text": "Following the liberation of Kashyyyk, Temmin Wexley praised Phantom Squadron for their flying skills. In public, Phantom Squadron were praised for their efforts by the New Republic Defense Force authorities and Wedge Antilles was even awarded a medal. In private, disciplinary action was taken and Phantom Squadron was shut down. Since the New Republic was transitioning from a rebel movement into a proper government, the authorities wanted to take action against Phantom Squadron for acting outside the command structure."}, {"tag": "p", "text": "Antilles and his fellow pilots were relieved of their duties and reassigned to work as support crew at the New Republic military base on Chandrila. Koko was reassigned to running fueling lines. The Quarren Jethpur found work as an engine mechanic. Yarra resigned from the New Republic military and found work on a Chandrilan fishing rig. Antilles was reassigned to managing a hangar on Chandrila. Due to the disciplinary action taken against Phantom Squadron, Antilles was unwilling to travel with Wexley to Jakku in order to rescue his mother Norra."}, {"tag": "h3", "text": "Battle of Jakku"}, {"tag": "p", "text": "After the Galactic Senate authorized military intervention at Jakku, Temmin Wexley convinced Wedge Antilles to re-establish Phantom Squadron. Antilles agreed and told Wexley to meet him at Hangar Forty-Seven in two hours in preparation for the Battle of Jakku. The majority of Phantom Squadron pilots flew X-wings, while Yarra flew a Y-wing. Wexley flew an older T-65C-A2 X-wing with the astromech droid R3-W5."}, {"tag": "p", "text": "Phantom Squadron exited lightspeed after the main New Republic fleet had arrived at Jakku. Since the space above Jakku was crowded with Imperial and New Republic ships, Wexley advised his fellow pilots to fly down to Jakku and punch a hole in the Imperial air-to-space defenses so that New Republic ground forces could land on the planet. Antilles accepted Wexley's advice and brought Phantom Squadron into Jakku's atmosphere. During the ground battle, Phantom Squadron targeted TIE strikers and Imperial walkers. Antilles then directed Wexley to pursue an Imperial shuttle. This shuttle turned out to be carrying Wexley's mother Norra and his B1-series battle droid companion Mister Bones. The young pilot had a brief conversation with his mother before returning to the battle."}, {"tag": "p", "text": "As the battle continued, Wexley's X-wing was hit by falling debris from the crippled Imperial Super Star Destroyer Ravager and the Starhawk-class battleship Concord. Wexley survived the crash but his X-wing was destroyed. He was attacked by several stormtroopers and an AT-ST walker. Wexley was rescued by Mister Bones but the droid was destroyed during a friendly fire incident involving two A-wings."}, {"tag": "p", "text": "Following the Battle of Jakku and the signing of the Galactic Concordance, Wexley earned the nickname \"Snap\" from his fellow Phantom Squadron pilots. Antilles became the head instructor at New Republic's new flight academy on Hosnian Prime while Wexley became a cadet at that academy. Wexley's friend Sinjir Rath Velus jokingly nicknamed Phantom Squadron \"Fancy Squadron\"."}, {"tag": "p", "text": "Another notable member during the Galactic Civil War, was Wesson Dove who later went on to fight with the Resistance's Dross Squadron alongside fellow pilot Sanrec Stronghammer."}, {"tag": "h3", "text": "Battle of Exegol"}, {"tag": "p", "text": "Phantom Squadron was part of the Citizens' fleet that aided the Resistance against the Sith Eternal forces in the Battle of Exegol."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}