{"url": "Phase_Zero_dark_trooper", "categories": ["Category:Legends articles", "Category:Dark trooper models", "Category:Imperial Department of Military Research products", "Category:Cyborgs"], "nodes": [{"tag": "h1", "text": "Phase Zero dark trooper"}, {"tag": "p", "text": "Phase Zero dark troopers were the result of the Galactic Empire's Dark Trooper Phase Zero Project and the predecessors of Imperial Dark troopers. Unlike the latter they were not fully droids, but actually aged clone troopers, transformed into cyborgs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Phase Zero dark troopers were created in the early years of the Empire to deal with a shortage of experienced troops. The program was overseen by then-Lieutenant Rom Mohc and was based on the Empirical, a hidden space station in the Dominus system. He called the program the Dark Trooper Phase Zero."}, {"tag": "p", "text": "To return aged veterans of the Clone Wars to peak condition, their limbs and organs were removed and replaced with cybernetics using much of the same technology used to transform Darth Vader into a cyborg. In some cases, over 70% of a clone's body was replaced. With their years of combat experience and cybernetic enhancements, the units that did make it onto the field were undeniably effective. At the height of the project the Dark Troopers were split into specialized classes including the Dark trooper commander and the Elite dark trooper."}, {"tag": "p", "text": "However, as the subjects were forcibly recruited into the project, many Phase Zero Dark Troopers could not cope with the state of being more machine than man and attempted suicide. The project was eventually shut down as the Empire grew in power and the recruitment rate of non-clones rose. Although the project was shut down, it was eventually succeeded by the Dark Trooper Project also headed by Rom Mohc, who had become a General."}, {"tag": "p", "text": "A number of Dark Troopers served on battlefronts shortly before the Battle of Yavin. They were outfitted with Blast Cannons, SE-14r light repeating blasters, thermal detonators, ARC Casters, and Commando Pistols. They also had a jump pack. Rumors spread that the armored, lethal individuals were not just mere humans or droids, but enhanced cyborgs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Phase Zero Dark Troopers first appeared in the Star Wars: Battlefront video game series as the Empire's specialized class. In the first game, they utilized the blast cannon and blaster pistols as their sidearm, while they are equipped with the ARC caster along with commando blaster pistols as their sidearm weapon in Star Wars: Battlefront II. They also had jump packs in order to travel quickly on the battlefield."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}