{"url": "Phantom", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles in need of updating", "Category:Corellian Engineering Corporation products", "Category:Phoenix Squadron starships", "Category:Starfighters"], "nodes": [{"tag": "h1", "text": "Phantom"}, {"tag": "p", "text": "The Phantom was a modified VCX-series auxiliary starfighter that could dock with its mothership, the Ghost. The Phantom was widely used by the crew of the Ghost, who were also known as the Spectres. The Phantom was used by these rebels on numerous missions against the Galactic Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Phantom was a modified VCX-series auxiliary starfighter that was attached to the VCX-100 light freighter known as the Ghost. Both vessels were manufactured by the Corellian Engineering Corporation. The auxiliary ship was armed with a Taim & Bak MS-2B twin laser cannon and a Taim & Bak KX4 dorsal laser turret The Phantom had a former starfighter cockpit that had been sourced during an earlier raid. It was also equipped with four swinging seats which could be folded to make way for goods. The Phantom also had a hatch which led down to the Ghost's ship ladder."}, {"tag": "p", "text": "The Phantom was capable of doubling as both a starfighter and shuttle; something that was maximized by its crew. On at least two occasions, the Phantom sustained damage but was repaired to full operational capacity. The Phantom was also equipped with a jammer that allowed it to conceal its presence. The rebel Sabine Wren painted a Sando aqua monster on the Phantom's hull. The Phantom was upgraded to include a hyperdrive by a Mon Calamari shipbuilder named Quarrie. However, the hyperdrive required an astromech in order to function. In addition, the Phantom's autopilot was also programmed to fly back to the mothership. This was a mechanism designed to counter thefts."}, {"tag": "p", "text": "Because of the Phantom's secondary role as a shuttle, it was larger, heavier, and less agile than dedicated starfighters like the TIE/ln space superiority starfighter used by the Galactic Empire. This was compensated for by its durability, shielding, aft armament, versatility, and sophisticated avionics systems. In addition to its duties as a fighter and shuttle, the laser cannons allowed it to be used as an aft-facing gun turret for the Ghost when docked in reverse."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Spectres"}, {"tag": "p", "text": "As part of Ghost's auxiliary vessel, the Phantom was owned by the Twi'lek pilot Hera Syndulla. Her crew included the former Jedi Padawan Kanan Jarrus, the astromech droid Chopper, the former Lasat Honor Guardsman Garazeb Orrelios, and the teenaged Mandalorian weapons expert and artist Sabine Wren. During a raid on an Imperial convoy, Chopper manned the Phantom's laser cannons when the mother ship was attacked by several TIE fighters."}, {"tag": "p", "text": "During a heist on Imperial supplies on the Outer Rim planet Lothal, the rebels encountered a Force-sensitive human boy named Ezra Bridger, who took a ride aboard the Ghost. After escaping his improvised holding cell, Ezra manned one of the Phantom's laser turrets before being relieved by Sabine. Still attached to its mother ship, the Phantom took part on a mission to rescue Wookiee slaves being shipped to the spice mines of Kessel. Following these adventures, Ezra decided to become Kanan's apprentice and join the crew of the Ghost."}, {"tag": "h3", "text": "Further adventures"}, {"tag": "p", "text": "Later, the crew of the Ghost learned that the Jedi Master Luminara Unduli was imprisoned at the Spire, a high-security prison on the planet Stygeon Prime. While Chopper waited aboard the Ghost, the other rebels flew down to the Spire aboard the Phantom. Hera piloted the auxiliary shuttle and deployed Kanan, Ezra, Sabine, and Zeb onto a landing platform. While the other rebels entered the prison, Hera attached the Phantom to the side of the prison. To avoid detection, she powered down the auxiliary vessel and activated a jammer."}, {"tag": "p", "text": "Hera's companions quickly discovered that Luminara was dead and were trapped by the Grand Inquisitor and several stormtroopers. Meanwhile, the Phantom's sensors detected something approaching the shuttle. Hera initially thought it was a TIE fighter but quickly discovered that it was a large swarm of tibidees, which had mistaken the shuttle's jamming system for a mating call. Hera quickly detached the shuttle from the prison but was pursued by the tibidees. Later, Hera managed to win over the tibidees and use them to harass the Imperials while she rescued the other Spectres. They then flew back to the Ghost and fled into space."}, {"tag": "p", "text": "The Phantom and its mother ship later took part in a mission to intercept an Imperial convoy transporting a large kyber crystal. Kanan flew the Phantom while Hera piloted the Ghost. The two rebels had learnt about the convoy from Ezra, who had infiltrated Lothal's Academy for Young Imperials, and a cadet named Zare Leonis, who was sympathetic to the rebels. While the Phantom distracted the convoy's TIE fighter escorts, the Ghost destroyed the Gozanti-class cruiser carrying the kyber crystal. This triggered a vast explosion which destroyed the Imperial convoy. The Phantom narrowly managed to escape the explosion by linking up with the Ghost, which then jumped into hyperspace."}, {"tag": "p", "text": "After a supply raid on Lothal, the Phantom was pursued by several TIE fighters and had its fuel line damaged by a laser strike while navigating through a canyon. After the mission, the Phantom and the Ghost docked with each other, Ezra, Chopper, and Zeb ran a diagnostic scan but failed to check it due to their bickering. During a supply run to Fort Anaxes, an old Republic base on the asteroid PM-1203 that had been abandoned some time after the Clone Wars, the ruptured fuel line was discovered. Hera and Sabine were stranded on the asteroid and surrounded by several hostile fyrnocks. Their mission proved successful despite some close calls with the beasts, in part thanks to explosive rhydonium canisters. Kanan, Ezra, Chopper, and Zeb arrived in short order to rescue the two and the Phantom was recovered as well."}, {"tag": "h3", "text": "Rising challenges"}, {"tag": "p", "text": "After sabotaging the Empire Day celebrations in Lothal's Capital City, the rebels fled into space on the Ghost. They were accompanied by the Rodian fugitive Tseebo, an Imperial Information Office employee who wore a cybernetic implant containing Imperial secrets. During a brief dog fight, Chopper manned the Phantom's laser cannons but was knocked out by a laser blast. Before the Imperials could inflict further damage, Tseebo transmitted coordinates into the Ghost's hyperdrive which allowed the rebels to escape into hyperspace. However, the Grand Inquisitor succeeded in planting an XX-23 S-thread tracker onto the auxiliary vessel's hull."}, {"tag": "p", "text": "While traveling through hyperspace, Chopper detected the homing beacon on the Phantom's hull. To prevent the Empire from capturing Tseebo, Kanan, and Ezra decided to use the Phantom as a decoy vessel to lure the Inquisitor away from the Ghost. The Phantom exited hyperspace above the asteroid PM-1203 and landed at Fort Anaxes. There, Ezra used the Force to command the fyrnocks to attack the Grand Inquisitor and his stormtroopers. After escaping the Inquisitor, Kanan and an exhausted Ezra escaped aboard the Phantom and linked up with the Ghost."}, {"tag": "p", "text": "Since Ezra had tapped into the Dark Side during his confrontation with the Inquisitor, Kanan decided that his Padawan should embark on his Jedi trials to ascertain whether he had the discipline to be a Jedi. While meditating with his Jedi holocron, Kanan discovered that there was a Jedi Temple on Lothal. He used the Phantom to take his apprentice there. After Ezra sensed the temple's presence, Kanan landed the shuttle near the temple. After Ezra passed his Jedi trials, he and Kanan returned to the Ghost with the Phantom."}, {"tag": "p", "text": "The Phantom also saw action during a mission by the crew of the Ghost to seize control of the Imperial Communications Center in Jalath and use it to broadcast Rebel counter-propaganda. Hera remained aboard the Phantom to provide a get-away transport while the other rebels seized control of the facility. However, this was a trap set by Grand Moff Tarkin, the Grand Inquisitor, and Agent Kallus. Imperial forces quickly converged on the communications tower. While Kanan held back the Imperials, the other rebels managed to escape aboard the Phantom. Despite Hera's protests, she complied with Kanan's orders to leave him and escape."}, {"tag": "p", "text": "Despite Kanan's capture, Ezra succeeded in broadcasting a message before Grand Moff Tarkin destroyed the communications tower. Following Kanan's capture, Hera received orders from the mysterious rebel leader known as Fulcrum to sacrifice Kanan in order to avoid exposing the rebellion. However, Ezra, Sabine, Zeb, and Chopper defied Hera's orders and used the Phantom to visit the Devaronian crime lord Cikatro Vizago. With Vizago's help, the rebels learnt that Kanan was imprisoned aboard Tarkin's flagship Sovereign, which was departing for the Mustafar system."}, {"tag": "h3", "text": "A wider rebellion"}, {"tag": "p", "text": "Following Kanan's rescue, the crew of the Ghost learned that they were part of a larger rebellion. Fulcrum was an alias for the Jedi Purge survivor Ahsoka Tano, who was a key rebel leader. The rebels also joined the Phoenix Cell, which operated a fleet of starships. The Phantom and its mother ship narrowly survived an attack on the Phoenix fleet by Darth Vader."}, {"tag": "p", "text": "Following their escape, the Phantom was used by the rebels on a mission to the desert planet Seelos. Ahsoka had sent the rebels to contact an old friend from the Clone Wars, the former Clone Captain Rex. The rebels needed new bases and Ahsoka believed that Rex knew the location of several Clone Wars-era facilities. While Hera and Chopper waited above in the Ghost, Kanan and the other rebels descended to Seelos on the Phantom. After establishing contact with Rex and two other former Clone commanders, the Phantom was attacked and damaged by an Imperial probe droid. The rebels and clones managed to destroy the probe droid and repair the shuttle."}, {"tag": "p", "text": "Shortly later, an Imperial Star Destroyer led by Admiral Kassius Konstantine and Agent Kallus arrived over Seelos. During the ensuing battle, the rebels departed on the Phantom while Rex and his comrades held back Kallus' AT-AT walkers with their antiquated AT-TE walker. At Ezra's urging, Kanan decided to help the clone veterans and used the Phantom to destroy one of the AT-AT walkers. After defeating the Imperials, the clone commanders agreed to join the Rebellion."}, {"tag": "p", "text": "Later, Sabine, Zeb, Chopper, and Ezra traveled on the Phantom during a mission to retrieve medical supplies from an abandoned Old Republic medical base in space. After docking the shuttle in a hangar bay, the four rebels ventured into the space station only to be ambushed by two Inquisitors known as the Seventh Sister and the Fifth Brother. The Inquisitors managed to overpower and capture Chopper, Ezra, and Sabine but Zeb managed to escape and free Chopper. Using the Phantom's intercom, he posed as \"Commander Meiloorun\" and tricked the Inquisitors into entering the hangar bay. Following another struggle, he managed to free the other two rebels and they escaped into space to rejoin the fleet."}, {"tag": "p", "text": "Following their encounter with the two Inquisitors, Ezra and Chopper used the Phantom to come to the aid of Vizago, whose ship the Broken Horn had been taken over by the Weequay pirate Hondo Ohnaka. After docking the Phantom in the Broken Horn's hangar bay, the two rebels encountered Ohnaka, who claimed that he had won the Broken Horn by beating Vizago in a sabacc game. Together, the three companions attempted to sell several power generators to the Jablogian crime lord Azmorigan."}, {"tag": "p", "text": "After escaping Azmorigan, Ezra and Chopper discovered a captive Vizago and freed him. During the ensuing fight between Vizago and Ohnaka, Ohnaka fled to the planet Garel on the Phantom. However, the Phantom's autopilot had been programmed to fly back to its mother ship. The Phantom along with Ohnaka and the power generators were subsequently recovered by the other crew of the Ghost. Ohnaka was allowed to keep his proceeds but agreed to hand over the power generators to the rebels, who used them to aid the people of Rinn, which was experiencing an energy crisis."}, {"tag": "h3", "text": "The hyperdrive upgrade and beyond"}, {"tag": "p", "text": "The Phantom was later used by Hera, Sabine, and Zeb to investigate the possibility of using an experimental new starfighter being developed on the planet Shantipole to break a blockade preventing relief supplies being delivered to severely overworked laborers on the planet Ibaar. Because of atmospheric hazards, the Phantom was disabled and crash-landed on the landing pad of Quarrie's secret research and development station. Quarrie offered several parts to restore the Phantom to flight-worthiness, and also surreptitiously installed an aftermarket hyperdrive engine."}, {"tag": "p", "text": "The Phantom then delivered the prototype Blade Wing fighter to the rebel blockade run to Ibaar using this hyperdrive. Since test-firing an experimental heavy weapon on the Blade Wing had disabled its own integrated hyperdrive, the Blade Wing had to be ferried through hyperspace by the Phantom; which was now equipped with Quarrie's only other available hyperdrive engine. Thanks to the Phantom's timely delivery, the Blade wing turned the blockade run into a blockade bust."}, {"tag": "p", "text": "Later, the Phantom was used by Kanan, Ezra, Chopper, and Zeb to travel to Hammertown, a settlement on the planet Takobo. Tano had sent the four rebels on a mission to investigate a set of coordinates belonging to the Inquisitors. Upon arriving, the rebels learnt that the Fifth Brother and Seventh Sister were kidnapping Force-sensitive babies. The rebels managed to recover two younglings, Alora and Pypey. After fighting off the Inquisitors with the help of Ahsoka, the rebels fled to Garel, which had become home to a significant rebel presence."}, {"tag": "p", "text": "Following the Battle of Garel, Kanan, Ezra, and Chopper used the Phantom to travel to Lothal. Ezra had earlier received a Force vision of his parents Ephraim and Mira Bridger and decided to find them. After finding a gap in the Imperial fleet, the Phantom traveled to Lothal. After landing at Capital City, Chopper stayed aboard the Phantom while Ezra searched for the loth-cat he had encountered in his vision. When the loth-cat escaped on a speeder bike into the wilderness, the three rebels used the Phantom to track to speeder bike to a remote camp. There, the three rebels encountered Ryder Azadi, the former Governor of Lothal who had known Ezra's parents. Azadi revealed that Ezra's parents had died during an escape attempt which had been inspired by Ezra's recent broadcast from the Imperial Communications Center."}, {"tag": "p", "text": "When Imperial forces stumbled on Azadi's hideout, a brief skirmish broke out when the other crew of the Ghost arrived. During the skirmish, Chopper secured the Phantom by entering the ship's astromech socket and piloting it into the Ghost. Later, the Phantom was used during a successful operation by the crew of the Ghost to steal three Sphyrna-class Hammerhead corvettes from an Imperial depot in Jalath. The Alderaanian Senator Bail Organa had sent three Hammerhead corvettes to augment the Phoenix rebels' depleted forces. Since the Alderaanians could not afford to be seen directly supporting the rebels, Bail instead arranged for his adopted daughter Princess Leia Organa to deliver the ships to Lothal, where they would be \"stolen\" by the crew of the Ghost. However, the Imperial Supply Master Yogar Lyste had fastened gravity locks to the ships in order to deter thefts."}, {"tag": "p", "text": "With the connivance of Leia and Ryder Azadi, the rebels put their plans into action. Donning Imperial uniforms, Kanan and Ezra accompanied Leia back to the Imperial depot in the Phantom. Upon landing, Kanan claimed that they were Imperial personnel who had rescued Leia from the rebels. While Lyste and his stormtroopers were distracted, the other rebels disabled the gravity locks and stole the Hammerhead corvettes. After completing their mission, Chopper and Ezra escaped Lothal aboard the Phantom and returned with the Ghost to the rebel fleet, which was waiting on the outskirts of the Lothal system."}, {"tag": "h3", "text": "Ferrying the rebels"}, {"tag": "p", "text": "The Phantom was also used by Kanan, Chopper, and Sabine during a sabotage mission to the third moon of Concord Dawn. Earlier, the rebels had attempted to negotiate safe passage through the Concord Dawn system with the Mandalorian Protectors, a Mandalorian faction that had colonized Concord Dawn. However, the Protectors' leader Fenn Rau had allied his people with the Imperials and attacked the rebel diplomatic mission, seriously wounding Hera. In retaliation, the rebels decided to destroy the Protectors' Fang fighters, which were housed at a base on the third moon of Concord Dawn."}, {"tag": "p", "text": "During the mission, Chopper flew the Phantom into the moon's atmosphere and landed Kanan and Sabine near the encampment. He then flew the shuttle away from the base to avoid drawing the attention of the Mandalorians. After Sabine had succeeded in destroying seven of the Fang fighters, she contacted Chopper to pick them up with the Ghost. Chopper picked up Sabine before rendezvousing the Phantom with Kanan in the upper atmosphere. Kanan had hijacked Rau's starfighter and managed to knock him out. The Jedi then leaped into the Phantom's rear hatchway with Rau in tow. Having completed their mission and take Rau prisoner, the Phantom then returned to the rebel fleet. Following his capture, Rau allowed the rebels to travel through the Concord Dawn system in exchange for keeping his capture a secret from the Empire."}, {"tag": "p", "text": "During the crew of the Ghost's journey to Lira San, the Phantom remained in its mother ship's rear section for much of the expedition. After the rebels rediscovered Lira San, Zeb and the two Lasat refugees Gron and Chava used the Phantom to travel to Lira San's surface. There, they discovered that Lira San was the original Lasat homeworld and that it was already home to millions of Lasat. While Gron and Chava chose to remain on Lira San, Zeb returned on the Phantom to rejoin his rebel companions aboard the Ghost."}, {"tag": "p", "text": "With its mother ship the Ghost low on fuel and power, the crew of the Ghost took part in a heist at a Mining Guild Asteroid Belt Gas Refinery to obtain fuel for their ship and the fleet. Since the Ghost was low on power, Captain Hera was forced to divert power from the Phantom to power the rest of the ship. As a result, the Phantom remained aboard the Ghost during the raid. The rebels managed to acquire the fuel canisters and destroy the gas refinery with the help of the purrgil, large space-dwelling creatures capable of hyperspace travel."}, {"tag": "p", "text": "Later, the Phantom was used by Kanan and Ezra to search for Zeb following an ambush on an Imperial construction module above the planet Geonosis. Despite their efforts, they were unable to locate Zeb, who had landed with Agent Kallus in an escape pod on the icy moon of Bahryn. There, Zeb and Kallus overcame their animosity and struck an unlikely friendship to survive the cold and to ward off several bonzami beasts. After fixing his transponder, the rebels were able to trace his signal to Bahryn where they picked him up."}, {"tag": "p", "text": "Chopper, Kanan, and Ezra later traveled on the Phantom to scout the planet Oosalon as a prospective location for a new rebel base. While Kanan and Ezra explored the planet, Chopper stayed in the air with the Phantom. After Kanan and Ezra encountered trouble with the Fifth Brother and the Seventh Sister, Chopper rendezvoused with the Jedis' tibidee and picked them up. To avoid drawing the Inquisitors to the fleet, Kanan instructed Hera to rendezvous with them in deep space. While the Phantom docked with the Ghost's rear, Kanan briefed the other crew and Tano about their problems on Oosalon."}, {"tag": "p", "text": "Later, Chopper used the Phantom to ferry Kanan, Ezra, and Ahsoka to the Jedi Temple on Lothal. While the three Jedi entered the Temple, Chopper stayed with the Phantom. When night fell, Chopper picked up some approaching starships on his satellite and departed on the Phantom. Shortly later, the Fifth Brother and Seventh Sister arrived on their TIE Advanced v1 starfighters. After the Jedi had finished communing with Yoda and the Force in the Temple, they returned to the Phantom and fled into space before more Imperial reinforcements could arrive."}, {"tag": "p", "text": "Following the discovery of the planet Atollon, the Phoenix rebels established a base called Chopper Base on the planet. After the disappearance of Lieutenant Dicer, Rex and Sabine took the Phantom to the base's northern perimeter to investigate. Shortly later, they were attacked by several large spidery creatures known as krykna. One of the krykna managed to swarm the Phantom. Sabine managed to fight the krykna but Rex was taken captive. After reinforcements arrived in the form of the Ghost, Chopper secured the Phantom and parked it back in the rear compartment of the Ghost. Following a skirmish, the Phantom and its mother ship escaped back to Chopper Base."}, {"tag": "p", "text": "The Phantom was used by Kanan, Ezra, and Ahsoka during their mission to Malachor to seek knowledge on how to defeat the Sith. During the expedition, Chopper served as the ship's pilot from his astromech socket. After landing the Jedi and Tano, Chopper used the Phantom to track down a second starship under Kanan's orders. This starship turned out to be a TIE Advanced v1 fighter which belonged to the Eighth Brother, another Inquisitor who had attacked the Jedi and Tano. Prior to the Malachor Sith Temple's destruction, Chopper used the Phantom to evacuate Ezra and Kanan. However, the Jedi were unable to bring Ahsoka with them, who was trapped with her former Jedi mentor Darth Vader inside the doomed temple. The Phantom safely landed at Chopper Base where her passengers were greeted by the Spectres and Rex."}, {"tag": "h3", "text": "Last mission"}, {"tag": "p", "text": "After rescuing Hondo Ohnaka from the Imperial prison on Naraka, Ezra, Sabine, Zeb, Chopper, Rex, and Hondo traveled on the Phantom to the Imperial junkyard Reklam Station, which lay inside the gas planet of Yarma. On the way, Sabine and Chopper exited hyperspace at Sereeda Waypoint. There, they were intercepted by a Mining Guild patrol which ordered them to halt and explain their breach into Mining Guild space. After Chopper and Sabine shot down two TIE/mg Mining Guild starfighters, the Phantom jumped into hyperspace and reached Yarma. With Hondo serving as a guide, the rebels flew inside Yarma's gassy atmosphere and found Reklam Station. On the way they were attacked by two DTS-series Dismantler Droids but Chopper and Rex repelled them. During the dogfight, the Phantom was damaged, but Sabine managed to regain control."}, {"tag": "p", "text": "She docked the ship underneath a floating platform at Reklam Station. The rebels then infiltrated the station and managed to steal the Y-Wing light bombers with the help of the Ugnaught laborers. The Phantom was destroyed after Ezra shut down power to the station, causing Reklam Station to crash into Yarma's surface. Ezra attempted to escape on the Phantom, but the platform it was hanging on fell into the volatile surface below and exploded. Ezra was later rescued by Hera and Kanan. Hera reprimanded Ezra for his recklessness and for the loss of the Phantom. Due to his actions, Ezra was suspended from his position as Lieutenant Commander. During a mission to Agamar, Ezra, Chopper, Rex, Kanan, and Zeb escaped from the Empire on a Sheathipede-class transport shuttle which became the new Phantom, named the Phantom II, replacing the one lost at Reklam Station."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ghost's attack shuttle was first identified as the Wolf in concept art that appeared in a video released on October 12, 2013. The video featured concept art from the upcoming animated series Star Wars Rebels. However, the ship was revealed as the Phantom at the January 2014 Nuremberg International Toy Fair, which announced a LEGO set featuring the shuttle. The set includes a detachable cockpit, a cargo hold for storing Ezra Bridger's Imperial cadet helmet and blaster, a spring-loaded missile, and encourages players to fly the Phantom into battle against the Galactic Empire's TIE fighters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}