{"url": "Phantom_Menaces", "categories": ["Category:Real-world articles", "Category:Articles with conflicting sources", "Category:Star Wars Tales 17"], "nodes": [{"tag": "h1", "text": "Phantom Menaces"}, {"tag": "p", "text": "Phantom Menaces was a short story in Star Wars Tales 17. Set during the New Republic era, it focuses on Luke Skywalker's encounter with a holographic representation of Darth Maul on Iridonia, leading to the revelation that Maul's brain was kept alive by Drell Kahmf, and used to terrorize the planet."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Luke Skywalker arrives on Iridonia as an ambassador of the New Republic, to partake in trade negotiations about the opening of new routes to the Outer Rim. As Skywalker settles in to his chambers near Capital Square, he is attacked by a Solid-state hologram of Darth Maul. Postponing the negotiations, Skywalker embarks on an investigation into the Sith's presence."}, {"tag": "p", "text": "Skywalker is drawn to an unnatural disturbance in the Force, and after another confrontation with Darth Maul, he eventually arrives at the laboratory of Drell Kahmf. Here, he discovers the living remains of Maul, being sustained in a device created by Kahmf. Kahmf recounts how he recovered and resuscitated Maul's brain after the loss of his body during the Duel in Theed."}, {"tag": "p", "text": "Skywalker states that he will not allow Darth Maul to remain as he is, and Kahmf flees before him as he activates his lightsaber. Skywalker is left alone to finally terminate Darth Maul's existence, in the act of flicking a switch."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Parts of this story are canonized by The Complete Star Wars Encyclopedia in its entry on Kahmf, Drell. The Encyclopedia states that Kahmf was in possession of a \"mysterious brain\" that was rumored to belong to Darth Maul, but does not specify whether the brain actually belonged to Maul. The solid-state hologram goes unmentioned, and the technology, if it canonically exists, is not mentioned at all in the Encyclopedia."}, {"tag": "p", "text": ""}]}