{"url": "Phase_II_clone_trooper_armor/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Clone trooper armor variants", "Category:Stormtrooper armor"], "nodes": [{"tag": "h1", "text": "Phase II clone trooper armor"}, {"tag": "p", "text": "Phase II clone trooper armor was an enhanced version of the Phase I clone trooper armor, used by the clone troopers of the Galactic Republic's Grand Army during the Clone Wars. After the Clone Wars, it was retained by the stormtroopers of the newly-formed Galactic Empire, but was gradually replaced by new stormtrooper armor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Phase II incorporated all of its predecessor's systems in addition to polarized lenses, padding, and stronger, lighter armor plates. It could also support more modular attachments, making it superior to its predecessor. Unlike early iterations of the Phase I armor, color was used to denote unit affiliation instead of rank."}, {"tag": "p", "text": "Phase II armor was introduced around 21 BBY, and slowly replaced Phase I armor in the months following. Phase II armor was the basis of the stormtrooper armor later worn by the soldiers of Emperor Palpatine's Empire. Another variant of the Phase II armor was the Katarn armor. ARC trooper armor was also modified to be Phase II."}, {"tag": "p", "text": "The new armor incorporated a more advanced air filtration and oxygen supply system, polarized lenses, and an annunciator to make speech more comprehensible. In addition, the boots were magnetized and incorporated a grav-field alternator to ensure stability. Another useful feature was that the armor and the bodysuit could be pressurized, allowing the clones to fight longer in a vacuum environment than its predecessor."}, {"tag": "h2", "text": "Variations"}, {"tag": "p", "text": "The Phase II armor, unlike the Phase I armor in many ways, had many different variations. Some armor, was modified to suit the individual clone, while some armor, like the previous Phase I, was specialized to suit a certain 'breed' of troopers (such as clone paratroopers). It is known that some clones, like Faie and CC-1004, had more than one set of armor. Many Clone trooper commanders, Clone commandos and Shadow Clone Troopers had special attachments on their armor, and allowed some lower ranked officers to wear special attachments as well. Some special attachments included kamas and pauldrons, they could also attach electrobinoculars and sun visors to their helmets. Clone captains would occasionally have a pair of DC-17 hand blasters attached to each side of their kama."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Phase II clone trooper pilots' helmets were meant to be a fusion between the Rebel pilots' helmets and the TIE pilots' helmets, both seen in A New Hope.. The helmet of the main Phase II Clone Trooper is a fusion of the Stormtrooper helmet and Phase I clone trooper armor helmet."}, {"tag": "p", "text": "That Boba Fett's armor originally had some connection to the stormtrooper pedigree had long been a vague assertion in Star Wars lore. Design Director Doug Chiang's concept art focused on this connection, melding features of both armors into the finished clone trooper design. R. Kim Smith and Michael Patrick Murnane built a concept model of the clone trooper which implied that the first generation armor was thicker and bulkier than the lighter armor worn by the stormtroopers. This design concept was carried through by the Episode III Art Department, that further progressed the look of the clone troopers closer to the stormtroopers of the original trilogy, including variant designs that gave obvious nods to the sandtrooper, scout trooper and snowtrooper designs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}