{"url": "Phelon", "categories": ["Category:Legends articles", "Category:Columi", "Category:Criminals", "Category:Males"], "nodes": [{"tag": "h1", "text": "Phelon"}, {"tag": "p", "text": "Phelon was a male Columi who resided on Coruscant. Despite being a creature of diminutive stature, his head was so large that it required repulsorlift assistance to stay upright."}, {"tag": "p", "text": "Rumors abounded about Phelon; the Galactic Empire claimed that the Columi had been executed, but others thought him to be either a criminal mastermind, a Rebel sympathizer, or a secret Imperial agent. Either way, he was thought to be very powerful, and had an inexhaustible supply of surveillance data."}, {"tag": "p", "text": "On the planet Columus, Phelon ran into trouble and, through the help of smuggler Han Solo, relocated to Coruscant. Solo faked Phelon's death and smuggled him out, essentially erasing evidence of his continued existence. Following his relocation, Phelon lived in a castle dating back to the time of the Galactic Republic, deep in the Coruscant underworld on the shore of a lake of burning water. Phelon's castle was protected by his domesticated giant walking fish, Hobbrock. Buried in the bowels of Coruscant, Phelon constantly monitored Imperial communications, especially data dealing with finances and security. In addition, in his false role as an engineering consultant for dummy corporations of his own design, he managed to indirectly siphon Imperial credits meant for mining and starships to the cause of the Alliance to Restore the Republic."}, {"tag": "p", "text": "Sometime shortly after the Battle of Yavin, Solo and his companions—Luke Skywalker, Princess Leia Organa, Chewbacca, R2-D2, and C-3PO—became trapped on Coruscant through the scheming computer virus of B-1 series protocol droid B-1D4. The gang resorted to seek out Phelon, who repaid his long-standing debt to Solo by infecting the Imperial military's security network with B-1D4's virus, thus allowing the Millennium Falcon and her crew to escape."}, {"tag": "h2", "text": "Appearances"}]}