{"url": "Pheryon", "categories": ["Category:Canon articles", "Category:Inner Rim planets"], "nodes": [{"tag": "h1", "text": "Pheryon"}, {"tag": "p", "text": "Pheryon was a planet located in the galaxy's Inner Rim. Poe Dameron traveled to Pheryon during the Cold War to meet with the journalist Suralinda Javos."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A planet of the Inner Rim, Pheryon had stormy, purple skies wracked with fork lightning, known as the stormsea, above which were situated a number of floating island platforms. Shuttles ran between the islands a few times a day. A civilized planet, it had local security forces and hosted stormsail races. Stormsailers were tethered to the platforms with glowing hookups, and during races their pilots would dip down into the stormsea to boost their speed—although half of them never came back up again."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Cold War between the Resistance and the First Order, Commander Poe Dameron was summoned to Pheryon by his old friend Suralinda Javos. They met in a bar overlooking the stormsail races, but were attacked by thugs secretly paid off by Javos in the hopes of scaring Dameron into leading her to his secret base. Dameron stole a stormsailer and fled into the stormsea with the thugs in pursuit. He braved the storm and made it to a floating island, but the chase left him exhausted. Javos was captured by Lieutenant Weel and his stormtroopers in a tavern, and in calling to Poe for help, she accidentally ensured his capture as well. However, she used her Squamatan venom to subdue Weel, and helped break Poe out. The allies stole Weel's vessel and escaped Pheryon for the Resistance base on D'Qar. General Leia Organa later mentioned Pheryon among other intelligence reports concerning the First Order in an address to the New Republic Senate."}, {"tag": "p", "text": "Raidah Doon was a champion stormsailer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}