{"url": "Pho_Ph%27eahian", "categories": ["Category:Legends articles", "Category:Mammalian sentient species", "Category:Outer Rim Territories species", "Category:Pho Ph'eahians", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Pho Ph'eahian"}, {"tag": "p", "text": "The Pho Ph'eahians were a sentient people indigenous to Pho Ph'eah. They were generally humanoid bipeds whose four arms and bright blue fur made them stand out in a crowd. Their fur helped keep them warm on their cool, dimly lit homeworld, while their extra set of arms had such obvious advantages as allowing them to arm-wrestle two opponents at once."}, {"tag": "p", "text": "Pho Ph'eahians were mountain-dwelling omnivores, eating the small animals that lived on their planet and vegetables grown in their technologically advanced agricultural areas. They were interested in discovering new ways to improve food production. When they were first contacted by the Galactic Republic thousands of years before the Battle of Yavin, they had already developed nuclear fission and limited in-system flight. Since making contact with the Republic, their technological base quickly expanded. Soon, they became developers and exporters of a wide variety of high-technology products, from new agricultural methods to weapons and hyperdrives."}, {"tag": "p", "text": "Pho Ph'eahians were usually gregarious and cheerful, and they enjoyed being the center of attention. Though not many traveled offworld, those who did were often successful as entertainers. Others found high-paying work as starship mechanics and engineers, especially in the Corporate Sector."}, {"tag": "p", "text": "Another unique characteristic of Pho Ph'eahian culture was their concern for personal cleanliness. Pho Ph'eahians regarded their bodies as sacred, and intimately tied to their souls. Thus, any stain on their bodies could stain their souls if not quicky cleaned off. For example, Pho Ph'eahian mechanics, while not fearful of getting dirty in their work, always carried towels to wipe the grime and grease off their hands."}, {"tag": "h2", "text": "Sample Pho Ph'eahian names"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}