{"url": "Philo/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Galactic Republic senators", "Category:Gran", "Category:Males"], "nodes": [{"tag": "h1", "text": "Philo"}, {"tag": "p", "text": "Philo was a Gran male politician who gained much respect as a senator in the Senate of the Galactic Republic during the Clone Wars. In 21 BBY, he led a coalition of like-minded senators in opposition to the Enhanced Privacy Invasion Bill that was supported by Supreme Chancellor Palpatine. Philo determinedly worked with his colleagues—who included prominent senators Bail Prestor Organa, Padmé Amidala, Onaconda Farr, Riyo Chuchi, and Kin Robb—to prevent the legislation from being passed. At a meeting shortly before the vote on the bill was to take place, Philo and his associates were confronted by a group of mercenaries led by the bounty hunter Cad Bane, who took the senators hostage to force Palpatine into releasing the Hutt crime lord Ziro Desilijic Tiure from Republic custody. Although Philo, regarding Bane's audacity with contempt, attempted to walk out from the hostage situation, he was shot in the back and killed by the bounty hunter."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Gran male Philo lived during the final decades of the Galactic Republic's regime, during which time he became a politician. By the time of the Clone Wars, in which the Republic fought the separatist Confederacy of Independent Systems for galactic supremacy, Philo, a strong supporter of the Republic, became a senator within the Republic Senate. He worked out of the headquarters of the Senate on the galactic capital of Coruscant. During his career in the Senate, his employees included fellow Gran Salo, who devoted his life to serving Philo. In 21 BBY, the second year of the war, Supreme Chancellor Palpatine advocated for the passage of the Enhanced Privacy Invasion Bill in the Senate. Philo was one of the senators who did not approve of the legislation, and he formed a coalition of like-minded opponents to the proposal, including prominent senators Bail Prestor Organa of Alderaan, Padmé Amidala of Naboo, Onaconda Farr of Rodia, Kin Robb of Taris, and Riyo Chuchi of Pantora. Other members of Philo's coalition included Senators Jakker-Sun, Dantum Roohd, Zinn Paulness, and a Christophsian senator."}, {"tag": "p", "text": "As Philo and his political bloc took a stand against the Enhanced Privacy Invasion Bill, the legislation was put to a vote. The morning of the Senate's scheduled vote on the proposal, Philo called his colleagues to an important meeting in the Republic Executive Building's East Wing lobby atrium to ensure their continued opposition to the bill. Organa, Amidala, and the eight other senators of their group were in attendance, and Philo confirmed that they would all vote against Palpatine in the decision on the legislation. Their caucus was interrupted when the lobby was invaded and taken over by a group of mercenaries led by the notorious bounty hunter Cad Bane. Aided by several IG-86 sentinel droids and fellow bounty hunters Aurra Sing and Shahan Alama, Bane took Philo and his colleagues hostage, to be used as leverage to force Palpatine into freeing the Hutt crime lord Ziro Desilijic Tiure, who was currently in prison for previous crimes against the Republic. Surrounding the senators with his comrades, Bane warned the politicians to stand down if they wished to live. Philo was outraged by Bane's impudence and attempted to press pass him out of the lobby, refusing to listen to the bounty hunter's demands."}, {"tag": "p", "text": "When Philo walked past him, the unmoved Bane drew one of his LL-30 blaster pistols and shot the Gran senator in the back, instantly killing him and showing the other senators that he meant business. Bane's hostage takeover of the Senate proved effective, and his team was able to secure Ziro the Hutt's release from prison. The incident was later reported in a broadcast of the Republic's HoloNet News as part of the reporter Rule Davenbay's A Galaxy Divided segment. For the broadcast, Davenbay interviewed Salo, who expressed his sadness with Philo's death and swore to avenge Bane's murder of his role model."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Gran with three brown-colored eyes, Philo possessed the rare Gran trait of blue skin, which was sparse among his commonly tan-skinned species. He wore a set of formal robes to affairs and official proceedings associated with the Senate. A prominent Republic senator, Philo held the Republic in high esteem during the Clone Wars, a time when the Republic Senate was accused of widespread corruption and its effectiveness largely questioned. He was respected by many peers and colleagues, including his employee, Salo, who considered it an honor to devote himself to a life of service to the Gran senator. Salo subsequently directed much ire toward Cad Bane following his murder of Philo during the Senate hostage crisis. Philo was not intimidated by bounty hunters like Bane, though he underestimated the notorious mercenary's dangerousness. Refusing to tolerate \"insolence\" of any kind, Philo went so far as to press pass Bane out of the East Wing atrium in a show of contempt for the mercenary. That action cost him his life, for the unperturbed Bane killed him in a show of force to demonstrate the seriousness of his demands to the other senator captives."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Senator Philo was created for the Star Wars: The Clone Wars television series and first appeared in the series' first season finale, \"Hostage Crisis,\" which aired on March 20, 2009. In the episode, he was voiced by voice actor Phil LaMarr, who also portrayed Bail Organa and Jedi Master Kit Fisto for the series. In the episode, Philo's early and violent death at the hands of Cad Bane exemplified the \"instant effectiveness\" of Bane and his bounty hunter troupe, which was intentionally established by Series Director Dave Filoni and the series' production team for the introduction of bounty hunters in \"Hostage Crisis.\" Philo's name was misspelled once as \"Phylo\" in the annotated Decoded re-airing of \"Hostage Crisis\" on Cartoon Network, despite being spelled correctly earlier in the re-airing."}, {"tag": "p", "text": "In September 2009, Philo was referenced in an installment of the in-universe HoloNet News podcast that was released as a lead-in to the October 2009 video game Star Wars: The Clone Wars: Republic Heroes. In March 2011, Philo was featured in the non-canonical video game LEGO Star Wars III: The Clone Wars, which adapted the Senate hostage crisis and portrayed Philo as one of Bane's hostages, albeit without being killed by the bounty hunter as he was in the episode. Following the \"Hostage Crisis\" level, Philo could be purchased as a playable character for the game's \"Free Play\" mode. In the game's Nintendo DS version, he was instead made available after \"The Gungan General\" level."}, {"tag": "p", "text": "Part 9 of The Official Star Wars Fact File remake, published in March 2014, implied via a depiction of Philo that he was part of Malastare's Gran delegation to the Galactic Senate. However, such information has yet to be explicitly clarified."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}