{"url": "Phindian/Legends", "categories": ["Category:Legends articles", "Category:Outer Rim Territories species", "Category:Phindians"], "nodes": [{"tag": "h1", "text": "Phindian"}, {"tag": "p", "text": "Phindians were the native people of the planet Phindar. They were gangly, mournful-looking humanoids with arms stretching past their knees. They stood 1.7 meters tall on average. They had dark skin in shades of green or brown, sometimes with white blotches, and white circles around their yellow or golden eyes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "For most of the latter centuries of the Galactic Republic, Phindar was ruled by a criminal organization called the Syndicat. This organization controlled the Phindian people by seizing control of all of Phindar's imports and exports. Any dissenters had their minds erased in a process called \"renewal\", similar to the memory wipes applied to droids. Renewed Phindians would sometimes be dumped on other planets, so Syndicat members could bet on how long they would survive. In 44 BBY, Qui-Gon Jinn and Obi-Wan Kenobi joined with Phindian rebels (including the brothers Guerra and Paxxi Derida) and freed the Phindians from Syndicat rule, allowing the Phindians to hold democratic elections for the first time in centuries. One of their first acts was to outlaw renewal technology."}, {"tag": "p", "text": "Phindians were known for certain cultural attitudes which many offworlders found annoying. They were often hesitant about risking their life, even for a good cause. In conversation, they were fond of exaggeration, sarcasm, and talking for sheer enjoyment while avoiding the central issue of a discussion. These tendencies were, however, tempered by a sincere affection for their family and friends. When parting from a friend, they would embrace three times: once in sorrow for the parting, once in joy for the continuing friendship, and once in hope that the two friends would reunite in the future."}, {"tag": "p", "text": "The anthropologist Karke was a Phindian, as was Osi Sobeck, the insane warden of the Separatist prison, the Citadel. The criminal mastermind Moralo Eval was also a Phindian."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}