{"url": "Phineas_and_Ferb:_Star_Wars", "categories": ["Category:Real-world articles", "Category:Semi-protected articles", "Category:Articles to be expanded", "Category:Non-canon articles", "Category:Miscellaneous television productions", "Category:Parodies", "Category:Television films"], "nodes": [{"tag": "h1", "text": "Phineas and Ferb: Star Wars"}, {"tag": "p", "text": "Phineas and Ferb: Star Wars is a one-hour special episode of the Disney Animation television series Phineas and Ferb that aired in summer 2014 on Disney Channel and Disney XD. The Star Wars-themed episode was first announced at the annual San Diego Comic-Con International on July 19, 2013."}, {"tag": "h2", "text": "Opening Crawl"}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "Agent Perry the Platypus, a spy for the Rebel Alliance, infiltrates the Galactic Empire's administration offices (an oversized Star Destroyer bridge tower) and retrieves a data disc containing the schematics for the Death Star. Perry rendezvous with Princess Leia on board the Tantive IV, where Leia gives Perry his next mission: she has placed the disc in R2-D2 and intends to record a video message to explain her situation to Obi-Wan Kenobi on Tatooine. She assigns him to escort the droid, as well as C-3PO, safely to Kenobi. However, they soon discover that an Imperial Star Destroyer has tracked them. Soldiers file into the ship, including thee entry-level Stormtroopers, Candace, Baljeet, and Buford. The three, especially Candace, are excited for their first battle, but their commander instead places them on \"sock detail\", the tedious task of retrieving socks for Darth Vader. The young soldiers stumble across Leia recording her message into the R2 unit, but as she runs off in the ensuing battle, Perry is separated from the droids, who leave for Tatooine in the escape pod. Hoping that capturing the droids will be the career boost she needs, Candace, Buford, and Baljeet take the other escape pod, with Perry stowing away."}, {"tag": "p", "text": "Meanwhile on Tatooine, step-brothers Phineas Flynn and Ferb Fletcher live just one moisture farm over from Luke Skywalker. In contrast to their older neighbor, the boys love living on the planet with their wild inventions and each other. They pass on their parents' suggestions to explore the rest of the galaxy, content with playing with the planet's eccentric wildlife and taking \"Jedi lessons\" with Ben Kenobi every Tuesday."}, {"tag": "p", "text": "Landing on Tatooine, Perry tracks down R2-D2 and smuggles him out of the Lars house while Luke is distracted, but is separated from the droid again after a run-in with Phineas and Ferb's speeder. Phineas directs the droid to Kenobi's house, but neither the droid nor the brothers realize that the crash dislodged the schematics disc. The boys discover the disc the next morning, and after spotting the droid, Kenobi, and Luke en route to Mos Eisley, they head to the spaceport to return it. In town, a Toydarian merchant, Blatto, plays the data disc, and they learn about the Empire's nightmarish new weapon, as well as its very odd design flaw. Realizing that the droid must be part of the Rebel Alliance, Phineas and Ferb vow to return the disc. However, they're spotted by Candace's group of Stormtroopers, and miss the Millennium Falcon as it flies away. To follow the ship, they hire a young smuggler named Isabella Garcia-Shapiro of the Centennial Chihuahua as their pilot, and Phineas quickly forms a crush on her."}, {"tag": "p", "text": "The Rebellion believes that the plans are still inside R2-D2 and thus safely in Kenobi's possession, and so Agent P is assigned a new mission by his superior Major Hologram: a low-ranking Imperial scientist Dr. Darthenshmirtz, accompanied by his droid Norm-3PO, is working on a new machine called the Sith-Inator, and Agent P heads to the Death Star to stop him. There, he happily reunites with Phineas and Ferb, his owners from back when he was a pet platypus. However, Perry is captured by Darthenshmirtz and immobilized in carbonite. Darthenshmirtz explains that the Sith-Inator will corrupt whomever it hits into a powerfully evil Sith. Sensing Perry in trouble, Ferb splits off from Phineas and Isabella to help him, and the boy is zapped with the device."}, {"tag": "p", "text": "The other two children look for the Falcon, but are discovered by Candace. As she chases them, she slips on some grunge leaking from the trash compactor and nearly falls to her death off a ledge, but she is rescued by Phineas. Candace is confused to see a Rebel act selflessly, and contemplates the implications as the children run off. This event, along with the recent destruction of Alderaan, convinces Candace, Baljeet, and Buford, that they are on the wrong side of the war. The leak also causes Perry's carbonite trap to malfunction, and he fights Darthenshmirtz throughout the Death Star. Isabella and Phineas see the Falcon depart for Yavin 4, but Phineas refuses to leave without his brother. He entrusts Isabella to follow the Falcon and return the disc, while he goes to find Ferb. After delivering the plans, Isabella insists to a group of pilots her age, the Firestar Girls, that she has no interest in getting involved with the Rebellion, but an encounter with her smuggling rival Han Solo and some words of wisdom from Chewbacca convince her otherwise."}, {"tag": "p", "text": "Phineas finds Darth Ferb, who has modified the Sith-Inator to turn even more people to the Dark Side. When Phineas refuses to join him, a lightsaber duel breaks out between the two brothers. Candace redeems herself by coming to Phineas' aid, distracting Darth Ferb long enough for Phineas to destroy the Sith-Inator and turn Ferb back to normal. As Perry leaves with a carbonite-encased Darthenshmirtz in his custody, Candace, Buford, Baljeet, Phineas, and Ferb try to get off the battle station, but watch the last ship fly away. With Luke Skywalker flying along the trench, the group accepts that they will die in a few minutes. As they list final regrets, Phineas mentions that never learned what became of his older sister, who left Tatooine when he was very young. Candace suddenly realizes Phineas is her brother. The siblings embrace, and Phineas properly introduces Candace to their step-brother Ferb. The Death Star explodes before Phineas can explain what became of their biological father, but fortunately, they are rescued at the last moment by Isabella."}, {"tag": "p", "text": "Though there are still copies of the Death Star schematics out there and Darthenshmirtz has escaped the carbonite and vowed to fight in the sequel, the Rebels still have much to celebrate with their first great victory in the Galactic Civil War. After the ceremony commending the heroics of Luke Skywalker and Han Solo, a Twi'lek singer Vanessa leads the celebration with a victory number as the casts of both Star Wars and P&F dance. Isabella kisses Phineas, and, to the aggravation of Firestar Girl Gretchen, Jek Tono Porkins also shows up alive, completely ruining the moment."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The inspiration for the special came after The Walt Disney Company bought Lucasfilm on October 30, 2012. According to co-creator of Phineas and Ferb Dan Povenmire, \"When I saw that news break, I drew a picture of Doofenshmirtz as Darth Vader and texted it to the head of Disney TV animation and wrote, 'I smell crossover!'\""}, {"tag": "p", "text": "Robert Hughes confirmed that there are at least five songs in the special."}, {"tag": "p", "text": "Hughes later also confirmed that the Phineas and Ferb characters Vanessa and the Fireside Girls would have Star Wars counterparts that would appear in the episode."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "Walt Disney Records released a soundtrack album containing five songs; and a radio drama version of the episode in German language. The episode also inspired two online games, Agent P: Rebel Spy and Phineas and Ferb Star Wars - Droid Masters. Both playable for free on Disney web sites."}, {"tag": "p", "text": "It began streaming on Disney+ on February 28, 2020."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}