{"url": "Phoenix_Two", "categories": ["Category:Canon articles", "Category:Phoenix Squadron personnel", "Category:Squadron callsigns"], "nodes": [{"tag": "h1", "text": "Phoenix Two"}, {"tag": "p", "text": "Phoenix Two was a callsign used by Phoenix Squadron, a squadron of A-wing pilots of the rebellion against the Galactic Empire. Individuals who flew under the callsign of Phoenix Two participated in a number of conflicts against the Empire during the early days of the rebellion."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The callsign Phoenix Two was used by members of Phoenix Squadron, a squadron of RZ-1 A-wing interceptors who flew for the early rebellion against the Galactic Empire. During the Siege of Lothal, when the Sith Lord Darth Vader attacked the Phoenix fleet, the pilot who flew as Phoenix Two was shot down and killed by the Sith Lord. Another pilot used the callsign Phoenix Two when the rebels attempted to run the Imperial blockade over the planet Ibaar."}, {"tag": "p", "text": "Later, a pilot flying as Phoenix Two flew fought against the Mandalorian Protectors, a group of Mandalorian warriors who protected the Concord Dawn system on behalf of the Empire. This Phoenix Two flew under the command of Hera Syndulla, the captain of Phoenix Squadron. A short time later, a pilot flying under the call sign Phoenix Two fought in a firefight against the Empire and attempted to dock with a CR90 corvette as the battle came to a close. However, the pilot was shot down."}, {"tag": "p", "text": "After the rebels began setting up Chopper Base, a new base of operations on Atollon, a rebel using the call sign Phoenix Two reported to Sabine Wren that the squadron had finished placing sensors on the eastern side of the base, but that Lieutenant Dicer of Phoenix Squadron had not yet returned."}, {"tag": "p", "text": "During the Rebel Alliance's attack on Lothal, Mart Mattin flew under this callsign."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}