{"url": "Phoenix_Squadron", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:Phoenix Squadron personnel"], "nodes": [{"tag": "h1", "text": "Phoenix Squadron"}, {"tag": "p", "text": "Phoenix Squadron was an elite starfighter unit and part of a cell of resistance fighters who rebelled against the Galactic Empire in the years prior to the Battle of Yavin. The squadron was led by Commander Jun Sato."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Phoenix Squadron piloted A-wing starfighters that were carried aboard Sato's command ship Phoenix Home. The squadron could also be transported by the fleet's blockade runners using docking tubes. Following the destruction of Phoenix Home, the squadron lacked a permanent home and docked with the rest of the Phoenix fleet. The squadron found a new home after the rebels stole an Imperial fighter carrier from Ryloth."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early struggles"}, {"tag": "p", "text": "Several years prior to the Battle of Yavin, Phoenix Squadron flew on missions with the crew of the Ghost which included at least four A-wings."}, {"tag": "h3", "text": "Attack on Phoenix Squadron"}, {"tag": "p", "text": "Several members of the squadron perished in battle with Darth Vader. The survivors soon scattered with the rest of the fleet."}, {"tag": "h3", "text": "Blockade of Ibaar"}, {"tag": "p", "text": "Phoenix Squadron took part in the rebel relief of Ibaar where Phoenix Leader was killed during the first attempt to break the Imperial blockade. Later, because of this, Hera Syndulla was promoted as the new Phoenix Leader after she succeeded in using a prototype B-wing starfighter to break the blockade."}, {"tag": "h3", "text": "After Ibaar"}, {"tag": "p", "text": "To celebrate the tenacity of Phoenix Squadron, as well as Syndulla's promotion to Phoenix Leader, Sabine Wren created a painting as a gift for her friend. However, the artwork caught the eye of Mon Mothma, founder of the Alliance, who thought it a perfect representation of the effectiveness of rebel fighter forces. Mothma then asked Wren to complete the painting and add the phrase \"Fly For Freedom!\" as a call to action. The final artwork became a power recruitment tool for the Alliance."}, {"tag": "h3", "text": "Battle of Garel"}, {"tag": "p", "text": "Phoenix Squadron and the rest of the Phoenix rebel cell escaped an Imperial attack on rebel installations on Garel, that consisted of five A-wings."}, {"tag": "p", "text": "The squadron regrouped with rest of the fleet above the Lothal system after a raid on an Imperial depot on Lothal to acquire three Sphyrna-class Hammerhead corvettes, which had been supplied by the Alderaanian Senator Bail Organa's adopted daughter Princess Leia Organa."}, {"tag": "h3", "text": "Concord Dawn"}, {"tag": "p", "text": "After regrouping, Phoenix Squadron, under the command of Syndulla, was sent on a mission to the Mandalorian colony of Concord Dawn to request safe passage through the system, however Fenn Rau, the leader of the Mandalorian Protectors, denied their request. Acting in the name of the Empire, Rau and the Protectors opened fire on Phoenix Squadron, killing two of the pilots and severely injuring Syndulla. In retaliation, the rebels, Jedi survivor Kanan Jarrus and Sabine Wren, destroyed the Protectors' Fang fighters and captured Fenn Rau."}, {"tag": "h3", "text": "Consolidating resources"}, {"tag": "p", "text": "Phoenix Squadron sustained the loss of another pilot during a mission to steal supplies from the Empire. With the squadron lacking a place to land and house their starfighters, Commander Sato approved a mission by the crew of the Ghost to steal an Imperial fighter carrier orbiting Ryloth. The crew of the Ghost were aided by the Ryloth resistance leader Cham Syndulla and his associates Numa and Gobi Glie. Phoenix Squadron aided the operation by sending two RZ-1 A-wing interceptors to harry the TIE/sa bomber carrying the two rebel groups. After completing their part, the starfighters jumped into hyperspace. The acquisition of the fighter carrier was a boon for the squadron."}, {"tag": "p", "text": "Following the heist above Ryloth, the former Imperial fighter carrier became Phoenix Squadron's new base and headquarter. Members of the squadron fought against Imperial forces which attacked the rebel fleet. After the Ghost returned with stolen fuel supplies from Horizon Base, the fleet prepared to depart for the Yost system. However, Chopper and his new friend AP-5 informed Hera and Commander Sato that the Imperials had set a trap in that system. Instead, AP-5 and Chopper sent coordinates to Atollon, a planet with no Imperial presence. Phoenix Squadron accompanied the rest of the fleet there."}, {"tag": "p", "text": "While the unit was setting up their new base of operations on Atollon, named Chopper Base, one of the Squadron's pilots, Lieutenant Dicer (Phoenix Six) was attacked and went missing."}, {"tag": "p", "text": "Admiral Kassius Konstantine, who had been trying to deal with Phoenix Cell for some time, soon gained the help of Grand Admiral Thrawn. Thrawn had been requested by Lothal's Governor, Arihnda Pryce, following his decisive victory over the rebels on Batonn."}, {"tag": "h3", "text": "The shadow of Thrawn"}, {"tag": "p", "text": "While meeting with Grand Moff Wilhuff Tarkin, Admiral Konstantine, Agent Kallus, and Pryce, Thrawn reported that Phoenix Squadron had destroyed Mining Guild ships using the Sereeda Waypoint. He quickly deduced that the rebels planned to attack the Imperial salvage plant Reklam Station inside the planet Yarma. Later, Phoenix's A-wings engaged with Governor Pryce's Imperial TIE fighters above Yarma. Thrawn allowed the rebels to escape because he wanted to destroy the entire rebellion."}, {"tag": "p", "text": "After Commander Sato received intelligence that the Empire was planning to impose martial law on Mykapo, Phoenix Squadron and the Spectres traveled there to evacuate rebel sympathizers. The Phoenix Squadron pilots Phoenix Two and Phoenix Three escorted a Sphyrna-class Hammerhead corvette and the Phantom II which evacuated the civilians. Later, Phoenix Squadron rendezvoused with the rest of the rebel fleet in deep space. Elements of Phoenix Squadron later took part in Commander Sato's attempt to rescue his nephew Mart Mattin from Admiral Kassius Konstantine during a brief skirmish over Mykapo."}, {"tag": "p", "text": "Using the information discovered by Ezra's team, Hera began planning a strike on the Lothal Imperial armory complex. Ezra was assigned to lead the mission but was relieved after he was tormented by dark side visions created by the former Sith Maul. While Hera and the rest of Phoenix Squadron departed for Lothal, Ezra stayed behind with Kanan and Sabine to deal with the threat posed by Maul. They subsequently became involved in a mission to Dathomir which led them to discover that the Jedi Master Obi-Wan Kenobi was still alive and held the key to destroying the Sith."}, {"tag": "h3", "text": "Training at Chopper Base"}, {"tag": "p", "text": "At Chopper Base, Hera Syndulla tells Wedge Antilles and Derek \"Hobbie\" Klivian to hurry up because they were late for a training exercise."}, {"tag": "p", "text": "Knowing Kenobi was out there, Ezra commandeered Phoenix Squadron's RZ-1T trainer to find the Jedi. Ezra traveled to Tatooine where he was attacked by Tusken Raiders and the trainer was destroyed. Ezra pleaded for Kenobi's help, but Kenobi had his own responsibility on Tatooine. Therefore, Ezra was forced to return empty handed."}, {"tag": "h3", "text": "Battle of Atollon"}, {"tag": "p", "text": "The Phoenix Cell was preparing for an attack on the Imperial forces present near Lothal gathering a large portion of the Massassi Group, led by General Jan Dodonna. However, Thrawn not only knew of their intentions, but had discovered their location through a rebel spy who was recently caught. Thrawn's fleet arrived near Atollon and formed a blockade, trapping the rebels in orbit of the planet. Phoenix Squadron was led into battle by the ghost and fended off the TIEs attacking their capital ships. Though the rebels fought hard, they ultimately lost the battle, with a great many ships, being destroyed. Commander Jun Sato made one final attempt on the blockade by crashing the Phoenix Nest into Admiral Kassius Konstantine's Interdictor vessel. This allowed a single starship to push past the blockade into hyperspace to find help. Without their flagship, the remaining vessels of the rebel fleet were forced to retreat to Chopper Base."}, {"tag": "p", "text": "Thrawn's forces stormed the base and a fierce battle ensued. The base soon became overrun and the last of the rebel vessels made for the blockade. A Force-sensitive creature called the Bendu began attacking both sides after being taunted by a rebel, and chaos resulted. Although at least two more pilots were killed while the base was evacuating, rebel reinforcemnts arrived and destroyed the second Interdictor-vessel, allowing the surviving rebels to escape. However, the damage had been done to their forces and only four of the seventeen starships were still operational."}, {"tag": "h3", "text": "The cell's end"}, {"tag": "p", "text": "Very few members of Phoenix Squadron survived the Battle of Atollon, and so the survivors of Phoenix Cell, along with Phoenix Squadron joined the Massassi Group."}, {"tag": "h3", "text": "Attack on Lothal"}, {"tag": "p", "text": "Some time later, Syndulla led Phoenix Squadron through an attack on Lothal. Their attack brought the death of Imperial ace pilot Vult Skerris, but also their destruction under a second wave of TIE fighters. All ships crashed to Lothal, and what appeared to be the only survivor, found with what was left of the majority of the squadron, Secon Daree, was taken away for interrogation. The Empire soon found and captured Syndulla, as well, who had managed to survive the attack. Mart Mattin (Phoenix Two) was the only member of the squadron who was able to escape. With the sacrifice of Kanan Jarrus, Syndulla was also later freed."}, {"tag": "h3", "text": "Dogfight with TIEs"}, {"tag": "p", "text": "During a dogfight against TIE/ln space superiority starfighters, Karno's RZ-1 A-wing interceptor was damaged."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The New Republic utilized a squadron of A-wings called Phoenix Squadron during the Battle of Jakku, the battle which saw the last stand for the majority of the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}