{"url": "Phydolon", "categories": ["Category:Canon articles", "Category:Races and species stubs", "Category:Phydolons", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Phydolon"}, {"tag": "p", "text": "The Phydolon were a paired symbiotic sentient species native to the planet Mydasos that existed in the galaxy."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Phydolons were a symbiotic sentient species native to the planet Mydasos that consisted of two groups, the mammalian humanoid Agarans and the fungal rhizome Orucytes. The relationship evolved over millions of years. The fungus created tissue throughout the species bodies, and both Agarans and Orucytes had consciousnesses, although a Phydolon was both a pair of individuals and a blended whole, causing an intra-species gestalt consciousness."}, {"tag": "p", "text": "Biologists theorized that without the symbiosis, neither would be self-aware. Both mammalian pre-cursors and fungal spores were found throughout Mydasos, but only the symbiotic species had managed to achieve sentience."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "To outsiders, Phydolons seemed provincial, but they believed in a long-term wisdom and spirituality. Their perception of the Living Force was that it was familiar and welcoming, seeing that the Force connected the galaxy. In Phydolon society, they lived communal lives in close-knit groups across the planet. There was a lack of social order, and their leaders were the wisest among them, elevated by the gestalt will of the group."}, {"tag": "p", "text": "The species had developed a language, but it appeared to be primitive and underdeveloped to outsiders. Phydolons, however, when close together, could convey emotional meaning with a great degree of accuracy, but due to their unique biology, such an empathy was only understood among themselves. They found other languages to be needlessly complex."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Galactic Civil War, the species was only recently scouted, although at least one became a member of the Jedi Order before its destruction."}, {"tag": "h2", "text": "Phydolons in the galaxy"}, {"tag": "p", "text": "Phydolons rarely left their planet as if they were distanced from the rhizome, their symbiote would feel isolated. Ark ol Loor once pursued the Executioner after her mate, Alk ol Nojj, was killed. During the encounter, she was rescued by a Force-sensitive old man."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Phydolons were first described in Fantasy Flight Games' 2018 roleplaying game sourcebook Knights of Fate."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}