{"url": "Phrik/Legends", "categories": ["Category:Legends articles", "Category:Alloys", "Category:Compounds", "Category:Lightsaber-resistant materials"], "nodes": [{"tag": "h1", "text": "Phrik"}, {"tag": "p", "text": "Phrik was a rare metallic compound that was one of only a few lightsaber-resistant substances known. It was used in the construction of extremely light and durable battle armor as well as melee weapons. On a more extreme scale, at one point in the Galactic Civil War, a container of phrik was able to stay intact when it was on the surface of Alderaan during its destruction."}, {"tag": "p", "text": "One major source of phrik was the phrikite mines of Gromas 16 which would be combined with tydirium to make this compound. Phrik was extremely durable and light, but it was also very expensive and as a result it saw limited use in warfare."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Arkanian, Gorman Vandrayk, devised phrik alloy on his own before the Mandalorian Wars, and may in fact have been its inventor. Millennia before the Galactic Civil War, the extinct Fenelar used phrik in the creation of their armor. It was later used in the pole arms of IG-100 MagnaGuards' electrostaffs, not only for its lightsaber-resistant properties, but for its ability to disperse electricity. Palpatine's lightsaber, as well as the armor of the dark troopers, were also made of phrik. Phrik, while in its smelting stage, was highly malleable, and could be combined with a number of other ores, alloys, and compounds to imbue the phrik's properties with others."}, {"tag": "p", "text": "The Galactic Empire recognized the strategic value of phrik and nationalized all phrik mining operations as it became aware of them. However, many small-scale mining facilities remained unknown to the Empire and continued to process the ore for other clients, including local governments, Rebel organizations, and crime syndicates, most notably Rendili."}, {"tag": "p", "text": "Should the Rebel Base on Yavin 4 ever be discovered, Bail Prestor Organa created a holocron containing information on a list of other possible replacement planets. This holocron was left on Alderaan at the time of its destruction. However, the phrik container was so durable that it was able to withstand the Death Star's attack, and was later picked up by Han Solo's Renegade Squadron in order to find a new base.It was also thought to be used to build battle droids in the days of the Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}