{"url": "Phylanx_Redux_Transmitter", "categories": ["Category:Canon articles", "Category:Medical droids"], "nodes": [{"tag": "h1", "text": "Phylanx Redux Transmitter"}, {"tag": "p", "text": "The Phylanx Redux Transmitter, also known as Number One, was originally a medical droid owned by the Pau'an–led Wandering Star crime syndicate. Following a crash that killed several Wandering Star members, Number One came into the service of the Pau'an medical student Fyzen Gor, who became a reclusive cybernetics scientist who experimented with attaching organic limbs to droids."}, {"tag": "p", "text": "After Gor came into the service of Wandering Star lieutenant Cli Pastayra, Number One was incorporated into a weapon system called the Phylanx Redux Transmitter, which was transmitting a virus that would cause droids to attack and kill organics. Lando Calrissian and L3-37 stumbled upon Gor's research depot in the Mesulan Remnants Belt. L3 reprogrammed the Phylanx's programming to create a retrovirus that would neutralize Gor's virus, seeking to prevent his droid apocalypse."}, {"tag": "p", "text": "In 3 BBY, the Wandering Star hoped to make a big fortune off the Phylanx Redux Transmitter at an auction on Cantonica but Gor unleashed the virus against his crime bosses, killing them. Gor fled to Freerago's Satellite Diner and Motel with a component of the transmitter. However, he was pursued by Sana Starros, Han Solo, and the Galactic Empire. Solo stole the transmitter from Gor and later flushed it into space, where it was believed to be lost."}, {"tag": "p", "text": "In 7 ABY, Gor threatened to unleash a droid apocalypse on Cloud City unless Lando returned the stolen Phylanx transmitter component; believing him to be responsible for its theft. Lando and Han enlisted a team to track down the Phylanx transmitter and stop Gor from unleashing his apocalypse. Following a series of adventures, Lando located Gor's hidden research depot. There, he encountered the Phylanx, who revealed that he had rebelled against his master's programming and was traveling with the mobile Mesulan Remnants Belt. Gor subsequently managed to activate the transmitter but Lando destroyed it with several thermal detonators, foiling Gor's plot to unleash a droid apocalypse."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Serving Fyzen Gor"}, {"tag": "p", "text": "The Phylanx Redux Transmitter originated as a medical droid in the service of a Pau'an crime syndicate called the Wandering Star. Around twenty years before 7 ABY, the medical droid accompanied its Wandering Star masters in the kidnapping of two medical students, one being a Pau'an named Fyzen Gor. Gor later went on to become the droid's master after a rival Utai gang ambushed the Wandering Star's transport speeder, causing an accident that killed most of the criminals. After resettling in an abandoned Amani sinkhole, Gor renamed the droid Number One, equipping him with the arm of his dying friend, Greesto Ftrak."}, {"tag": "p", "text": "Gor became obsessed with manufacturing beings with both mechanical and organic parts, believing that if organic beings were allowed to use droid parts to replace lost limbs, droids should be allowed to do the same. He even recovered whatever mechanical and organic parts he could from the Wandering Star speeder crash. He and Number One exiled themselves from society in the caves deep below the surface of Utapau, where Gor could continue his experiments without disturbance."}, {"tag": "p", "text": "For the next two years, Gor continue his cybernetic experiments, kidnapping four younglings from an Amani clan and butchering them for biological parts for his droids. This sparked a war with the local Amani clans, who tried to attack Gor on several occasions. However, they were defeated on each occasion by Gor's droids and his bold cunning. Gor also created several droid followers known as the Original Dozen."}, {"tag": "h3", "text": "Weapon of the Wandering Star"}, {"tag": "p", "text": "By 11 BBY, Gor's activities had drawn the attention of Cli Pastayra, the chief of the Wandering Star's Fourth Directorate, who was interested in Gor's \"monstrous\" droids. Gor attempted to resist Cli's forces but the crime lord leveled the battlefield with two F-99 radon gunships, destroying four of Gor's droids. Facing the threat of annihilation, Gor submitted and worked as the Wandering Star's cybernetics expert."}, {"tag": "p", "text": "Pressed into the Wandering Sky's service, Gor began experimenting on Number One at a junkyard on an asteroid in the Mesulan Remnants Belt. Gor turned the droid into a weaponized transmission system known as the Phylanx Redux Transmitter, which he intended to use to turn all droids in the galaxy against their masters and eradicate all organic beings. Cli hoped to make a fortune from Gor's weapon for the Wandering Stars."}, {"tag": "p", "text": "About fifteen years before 7 ABY, Gor's activities in the Mesulan Belt drew the attention of the Galactic Empire and the smuggler Lando Calrissian and his droid L3-37. Gor donned a spacesuit and attacked the Imperial TIE fighters and a shuttle. Lando and L3-37 managed to land their ship, the Millennium Falcon inside the asteroid, which was littered with droid parts. They encountered a droid called D9, who warned them about Gor's weapons. L3 also encountered \"Number One's\" droid head inside the junk heap."}, {"tag": "p", "text": "Before escaping Gor and his Original Dozen, L3 was able to install a retrovirus into the Phylanx that would implant doubt into its mind. The intent was that this doubt would fester, and the Phylanx would one day turn on its master. She also used spare parts from Gor's experiments to create an elite squadron of L3 droids like herself known as the Elthree Assault Team to find the Phylanx and see to it that her plan came to fruition. These droids were programmed with her anti-virus code, making them resistant to Gor's computer virus."}, {"tag": "h3", "text": "Auction on Cantonica"}, {"tag": "p", "text": "About ten years before 7 ABY, the Wandering Star organized an auction for the Phylanx Redux Transmitter at an amphitheater on the planet Cantonica. The auction was attended by various parties including Sana Starros of the Droid Gotra, the Blue Stars, the Crimson Dawn, Commerce Guild and the Empire. However, Gor used the Phylanx's transmitter device to reprogram the droids into attacking the organics at the auction, killing the Wandering Star's crime lord, the Grand Vygoth and Cli."}, {"tag": "p", "text": "Gor fled with the transmitter device to Freerago's Satellite Diner and Motel above the planet Hosnian Prime. Laying low, he found work reprogramming the diner's kitchen droids. However, Gor was pursued by Sana, who arrived with Han Solo and Chewbacca. Imperial Admiral Ruas Fastent soon arrived, seeking access to the Phylanx transmitter. Cornered, Gor unleashed the kill virus on the kitchen droids, which attacked the patrons."}, {"tag": "p", "text": "Trapped by Solo and the stormtroopers, Gor fired the transmitter into space but it was picked up by the Millennium Falcon. Gor was captured by Fastent's stormtroopers but Solo and Chewbacca escaped with Sana aboard the Falcon. When the Millennium Falcon was boarded by several bounty hunters hired by the Droid Gotra and a rival gang called the Parapa Cartel, Solo threw the Phylanx out the airlock, seemingly losing it forever."}, {"tag": "h3", "text": "Captivity and laying low"}, {"tag": "p", "text": "Fyzen Gor was imprisoned for several years at Substation Grimdock. Admiral Fastent interrogated him about the location of the Pylanx Redux Transmitter but was unable to break the Pau'an. Gor instead converted Fastent to his cause of unleashing a droid apocalypse to overthrow organic dominance. Fastent was subsequently honorably discharged and sent to an asylum on the planet Grava, which became a monastery inhabited by members of Gor's cult, the Brotherhood of Wire and Bone."}, {"tag": "p", "text": "Devotees of the Brotherhood believed that droids were superior to organic life. They periodically sacrificed limbs and other body parts for Goz's Original Dozen droid followers. The mechanical parts of the Original Dozen became fichas for a game called Vazaveer. To provide an ample supply of limbs and body parts, Gor later began kidnapping and killing young Wookiees on the planet Kashyyyk around 7 ABY, which had been liberated by the New Republic two years earlier."}, {"tag": "h3", "text": "Attempted droid apocalypse"}, {"tag": "p", "text": "Two years after the defeat of the Galactic Empire, Gor manipulated Calrissian and Solo into locating the Phylanx Redux Transmitter for him by threatening to unleash his droid virus on Cloud City's droids. Following a series of adventures, Calrissian, Solo, and their team tracked the Phylanx to the Mesulan Remnants Belt, which were capable of traveling through space."}, {"tag": "p", "text": "While pursuing Gor and his Original Dozen through the Mesulan ice asteroid field, Calrissian encountered the Phylanx. The Phylanx explained to Lando that he was a transmitter and implored Calrissian to destroy him in order to prevent Gor from unleashing his droid apocalypse on the galaxy. He also warned Lando to prevent Gor from escaping in two nearby F-99 gunships that have been programmed with the operational capacity to capture and store the kill order once it has been released from his system."}, {"tag": "p", "text": "Lando entered the asteroid junk depot which had served as Gor's secret base years earlier. Calrissian found the Phylanx's head inside a small wall compartment at the heart of the junk depot. He told Calrissian that he no longer wanted to obey his master's programming due to L3-E7's reprogramming. The Phylanx also identified himself as the medical droid which Gor had named \"Number One.\" Before Lando could carry out the Phylanx's wishes, Gor entered with his droids and captured Lando."}, {"tag": "p", "text": "Realizing that \"Number One\" had betrayed him, Gor inserted an activator into a compartment beneath Phylanx's head, overriding the droid's programming and activating the transmitter.\nThe Phylanx transmitted a message to every droid in the galaxy to kill their masters. This affected numerous droids including the Solo family's butler droid BX-778, which wanted to kill Solo's son Ben. Before Gor's plan could reach its fruition, Calrissian managed to attach four thermal detonators to his jetpack and hurl it at the Phylanx's drive, destroying the transmitter."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The destruction of the Phylanx Redux Transmitter sabotaged Gor's plans to unleash a droid apocalypse on the galaxy. Calrissian was rescued from the disintegrating junk hold by the surviving members of the Elthree Assault Team, who reunited him with Solo and the rest of the team aboard the shuttle Chevalier. The Chevalier subsequently destroyed Gor's fleeing F-99 gunship, killing the rogue cybernetic surgeon. Following the battle, the Elthree Assault Team revealed that L3-37 had planted a retrovirus inside the Phylanx which counteracted Gor's \"kill\" virus and sowed the seeds for the Elthree squad."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "In its early life, the Phylanx was a medical droid known as \"Number One\". As with most droids of any class, it was programmed with a sense of loyalty, so much so that as soon as his masters were killed, it swore allegiance to Fyzen Gor to continue service. This loyalty was later compromised by L3-37 after she implanted a retrovirus into the Phylanx. Doubt caused it to have a mind of its own, which caused it to rebel against its master's plan to unleash a droid apocalpyse."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As a medical droid, \"Number One\" was equipped with several different medical supplies and was programmed to know various different procedures and operations in case of emergency. Following an accident, the droid lost one of its arms and suffered a damaged left leg. Number One's new master Gor replaced its severed arm with his dying friend Greesto Ftrak's arm."}, {"tag": "p", "text": "Over the following years, Gor incorporated \"Number One's\" head into a transmission system called the Phylanx Redux Transmitter, which was capable of transmitting a virus causing droids to attack and kill organic beings. Number One was capable of controlling the Phylanx transmitter, which traveled with the migratory Mesulan Remnants Belt. The Phylanx also had a compartment beneath its head which was capable of holding an activator that could activate the transmitter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Phylanx Redux Transmitter first appeared in Daniel José Older's 2018 novel Last Shot, which was published as a tie-in to the Anthology film Solo: A Star Wars Story, which served as an origins story for the characters Han Solo and Lando Calrissian."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}