{"url": "Picaroon_C._Boodle", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Dark Side Adepts", "Category:Kowakian monkey-lizards", "Category:Males", "Category:Mutants", "Category:Named Sithspawn", "Category:Seven Dark Jedi"], "nodes": [{"tag": "h1", "text": "Picaroon C. Boodle"}, {"tag": "p", "text": "Picaroon C. Boodle, later known as Pic, was a mutated Kowakian monkey-lizard who, alongside his \"brother\" Gorc, served as one of Jerec's seven Dark Jedi. After being captured by the Empire for use as research subjects, Pic and Gorc were taken by Lord Cronal, who trained and mutated them, before pressing them into the service of Jerec. The two Dark Jedi took on each other's genes and characteristics, and through a symbiotic link in the Force, they were able to sense each other's presence, emotions, and thoughts. Pic and his companion made a deadly pair: Pic's speed and intelligence when combined with Gorc's brute strength left many of their opponents dead during their time under Jerec."}, {"tag": "p", "text": "During the search for the lost Valley of the Jedi in 5 ABY, Pic and Gorc were sent to destroy the droid 8t88 and kill Kyle Katarn aboard the ship Sulon Star. The two easily deactivated the droid, but Katarn managed to kill Gorc, who had underestimated the Rebel agent. The death of his companion sent Pic into a frenzied rage, and the monkey-lizard viciously attacked Katarn, though he was eventually killed when the Rebel instinctively hit him with the heavy, dismembered head of 8t88."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A Force-sensitive Kowakian monkey-lizard, Boodle left his homeworld early in his life and became the pet of a smuggler named Az-Iban. Iban was quite unusual and secretive, and, alongside his first mate Picaroon Boodle, piloted a YT-2400 light freighter called the Rampaging Ranat. The two companions traveled the hyperspace runs together until Picaroon was quarantined by Imperial forces on the planet Eriadu, after being accused of carrying Cyborrean rabies."}, {"tag": "p", "text": "Pic, as well as a giant Gamorrean named Gorc who had been betrayed to the Empire by his brother, eventually became a research subject of Project Chubar, an Imperial experiment run by Human scientist Tuzin Gast. The project was a research effort intending to provide super-intelligent, loyal and Force-sensitive nonhumans to serve the Empire as spies."}, {"tag": "h3", "text": "Sithspawn"}, {"tag": "p", "text": "Pic and Gorc were then transferred to Cronal, known as Blackhole, an expert in Sith alchemy and genetic engineering who served under Imperial Inquisitor Jerec. Blackhole was known for his ability to turn living things into Sithspawn, which earned him the name \"monster maker.\" He needed subjects to transform, and because of their Force-sensitivity, Pic and Gorc were chosen. Cronal experimented on the pair using powerful Sith alchemy, and afterwards Pic and Gorc were mutated beyond the point of recognition. They each shared in each other's genes, abilities and characteristics, and had a symbiotic link through the Force."}, {"tag": "p", "text": "After being mutated and experimented on, Pic and his \"twin\" were handed over to Jerec, who, alongside his fellow Dark Jedi Sariss, trained the two Sithspawn in the ways of the dark side of the Force. Pic no longer resembled a brownish-skinned Kowakian monkey-lizard; his skin had turned to a dark mixture between brown and green, and his head had become hairless, unlike most other monkey-lizards. Pic and Gorc's bond meant they could fight together in unison, and were described as being almost invincible when together. Pic was also one of Lord Jerec's favored minions; the Miraluka encouraged Pic's viciousness, and criticized him far less than most of the rest of his seven Dark Jedi. Jerec referred to Gorc and Pic almost with affection, as if they were his favorite pets, and described them as \"quite an interesting pair.\""}, {"tag": "h3", "text": "Search for the lost Valley of the Jedi"}, {"tag": "p", "text": "The year after Emperor Palpatine died over Endor, the two \"twins\" assisted Jerec in his search for the fabled Lost Valley of the Jedi. Jerec wanted to harness its power and re-establish the Empire, even though, after much searching, the location of the Valley eluded him. In 5 ABY, Pic and Gorc were stationed aboard Jerec's Super Star Destroyer Vengeance over the planet Dorlo, where the Miraluka was searching for an old Jedi Master named Qu Rahn, whom Jerec believed to have information about the Valley of the Jedi. On the surface of the planet, Rahn managed to evade three of Jerec's other underlings—the Epicanthix Yun, Sariss and the giant Boltrunian Maw—and escaped on a CR90 corvette. The corvette, however, was caught in the tractor beam of the Vengeance. Boc Aseca and a group of soldiers then docked an assault shuttle with the corvette, sent in sleeping gas and transferred the unconscious Rahn and his companions to the Vengeance. The two Sithspawn found Rahn on the ship's deck. Pic then stole the old Jedi's lightsaber, which, although only Rahn knew at the time, had once belonged to the famous Jedi Grand Master Yoda. Pic placed the silver-hilted saber on his belt, though he may never have actually used it before his death. Rahn and several others were then escorted to the bridge of the Vengeance."}, {"tag": "p", "text": "On the bridge of his ship, Jerec began to question those who had been brought on board. One of them, a Klatooinian technologist named Rolanda Gron, defied Jerec, who then signaled to his group of Dark Jedi to execute the alien. The \"twins\" moved forward, as the Klatooinian unsuccessfully attempted to escape the hold the guards had on him. Just as Gorc was ready to strike the Rebel with his club-like lightsaber, Pic lunged unexpectedly at Gron, stabbing him in the throat with his Sith dagger, earning Jerec's approval. The tiny monkey-lizard then wiped his weapon off and walked away, scrambling back up onto Gorc's broad shoulders. Jerec had each of the remaining Rebels killed by his various underlings, until only Qu Rahn remained. After much beating from Pic as well as from Jerec's other minions, still the old Jedi Master refused to reveal what he knew, and so Jerec used the Force to rip it from Rahn's mind. With the information he needed in hand, the Miraluka was ready to dispose of Rahn, but the old Jedi Master, using the Force, grabbed hold of Yun's lightsaber, and began dueling with many of Jerec's minions. Boc, Maw and Sariss were defeated, before Gorc rounded on Rahn. The old Jedi knocked Gorc's huge saber out of his hands, and just as Pic readied to strike, Jerec intervened. Although Rahn proved stronger than the group, he was no match for Jerec, who used the Force to kill the old Jedi."}, {"tag": "p", "text": "Jerec then obtained a coded map from the house of Morgan Katarn on Sulon and hired a droid named 8t88 to decipher it. 8t88 eventually decoded the map and sent it to Jerec, who had Pic and his Gamorrean companion, backed up by an Imperial officer and two stormtroopers, meet the droid on the Sulon Star. 8t88 expected to be rewarded for his success, but in actuality Pic had been sent to deactivate and destroy him. The droid arrived on a shuttle and met Pic and Gorc in a dark corridor, asking for his pay. Pic sardonically told him they had it, and then decapitated him."}, {"tag": "h3", "text": "Final duel"}, {"tag": "p", "text": "The one person who stood in Jerec's way to finding the Valley of the Jedi was Kyle Katarn, the son of Morgan Katarn. Kyle had tracked 8t88 to the Sulon Star, looking for the information which would lead him to the Valley of the Jedi, where he knew he needed to go if he was to defeat Jerec. Kyle, aided by the spirit of Qu Rahn, arrived at the corridor 8t88 had been beheaded in, where Pic, tasked with killing the Rebel agent, was hiding on his fellow Sithspawn's shoulders in the shadows. As Kyle moved towards the droid, its head fell off its shoulders, landing on the floor, where 8t88's pet Hornagaunt lunged forward and digested it. Gorc attempted to crudely attack Katarn with his large weapon, overestimating the ease with which he would be able to squash his foe, and showed his lack of intelligence by standing in the way of Kyle's Bryar pistol. The Rebel agent shot Gorc in the face, destroying the Gamorrean's brain and killing him."}, {"tag": "p", "text": "Distraught at the loss of his companion, Pic lunged at Katarn, stabbing at him with his Sith dagger and driving his talons into Kyle's back and neck as well as attempting to gouge his eyes out. Kyle managed to grab hold of and wrestle with one of the monkey-lizard's arms, and moved quickly backwards, driving Pic violently against the bulkhead and breaking at least one of the Dark Jedi's bones. Pic, who was in immense pain, sent a blast of Force energy at Katarn, and then fell unconscious for several minutes. When he awoke, Pic saw Katarn standing beside the dead body of the massive Hornagaunt, searching for 8t88's head. He launched himself at the Rebel, who instinctively used the head of 8t88 to bash away the tiny creature; Pic's skull was broken and he flew limply across the room, dead."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Kyle Katarn went on to foil Jerec and defeat the other Dark Jedi. The young Jedi Knight regarded his duel with Pic and Gorc as extremely difficult, and felt angry at Mon Mothma for not fully recognizing his effort. Pic's body was left by Katarn on the Sulon Star along with Gorc's; Kyle did not realize at the time that the tiny darksider carried a weapon which had once belonged to Master Yoda. Later, after realizing the importance of the saber, Luke Skywalker sent a group of Jedi to retrieve the lightsaber, though it was unknown if they succeeded; the weapon and Pic's body could have stayed intact on the ship, or someone else might have taken it."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "After being mutated, Pic was an unpleasant creature. He was extremely lively, and some described him as evil: he liked killing, and often mocked those he had captured. The only person he seemed to actually care about was Gorc. Being in such close proximity to him, combined with the ability to see into his mind, Pic's bond to Gorc was more than just a dark side connection—it could almost have been described as a friendship. Gorc was dim-witted and slow, so Pic tried to look out for his companion's well-being. Even though he was the smaller of the two, Pic acted as a sort of \"older brother\" to his mutated friend. He became angry when people abused Gorc, and could usually be found hanging from Gorc's shoulders, often jumping from one to another. Pic did all the talking; Gorc seemed barely capable of saying anything more than a grunt, and preferred to remain quiet anyway. In return for his kindness, Pic was given a miniature set of Gorc's red-brown M'uhk'gfa armor, which the Gamorrean had crafted himself, though without the dark helmet that Gorc chose to wear."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Dark Jedi Jerec and Sariss taught each of their followers, who, including Pic and Gorc, were known as the seven Dark Jedi, much of the teachings of the Dark Force. Although they had an almost comical appearance (Pic was about a tenth of Gorc's weight and less than a third his height), the Brothers of the Sith were a deadly combination; Pic was agile, quick, and extremely intelligent, while Gorc was extremely strong, and neither of the two were afraid to slaughter their enemies. Gorc rarely moved or spoke, though when Pic stirred him up, the duo worked together as a team, covering all angles as well as each other's weaknesses, and even Jedi Knight Kyle Katarn described his battle with them as quite an ordeal. Pic became skilled at using a Sith dagger, although after he and Gorc captured Jedi Master Qu Rahn, Pic took one of the lightsabers he had carried; an orange-bladed weapon which had once belonged to former Grand Master Yoda. He adopted a style of combat to make up for his lack of height, jumping high into the air to stab at enemies' faces and throats, as well as making many wild swings with his lightsaber."}, {"tag": "p", "text": "The bond between Pic and Gorc enabled them to work together with ease; at all times, both Pic and Gorc were aware of the other's location, sense, and feelings, and they even shared basic telepathy. If the two were within several meters of each other, their powers were boosted, though their closeness also meant that if one brother was injured, the pain was shared by the other. Every time Pic used the dark side, he further corrupted Gorc, and vice versa. As a Sith abomination, Pic slowly released the dark side of the Force, making both Force-users and non-Force-users feel afraid and intimidated."}, {"tag": "p", "text": "Pic could use a variety of Force powers: he could heal himself or Gorc, enhance his abilities, and even spread a sense of fear onto his enemies using the dark side. He could also use the Force to grant him extra speed and sense what was going on around him, as well as affect the minds of enemies, which he used regularly. He usually wielded his Sith dagger or stolen lightsaber, but he was more than capable of utilizing blaster pistols, blaster rifles, primitive weapons, and even vibroblades."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Picaroon C. Boodle was created by Justin Chin for the 1997 PC game Jedi Knight: Dark Forces II. Realized by a CGI-character in the game and cutscenes, Pic was voiced by actor Denny Delk. He was drawn by artist Ezra Tucker in Dark Forces: Rebel Agent."}, {"tag": "p", "text": "Neither Pic's species nor his full name were ever stated in Jedi Knight: Dark Forces II, his first appearance. He was later referred to as a banshee in Dark Forces: Rebel Agent, and later as a monkey-lizard in The Dark Forces Saga, which also gave him his full name, Picaroon C. Boodle."}, {"tag": "p", "text": "Pic's death in Jedi Knight: Dark Forces II is slightly different to his death in Dark Forces: Rebel Agent and in The Dark Forces Saga, which is documented in this article. In the game, the player fights Pic and Gorc simultaneously, and either of them can be killed first. 8t88's pet Hornagaunt was also not present in the game."}, {"tag": "p", "text": "According to Abel G. Peña, Pic and Gorc may have been inspired by Danny DeVito and Arnold Schwarzenegger in the 1988 comedy Twins, with one of the villains being tiny and the other huge."}, {"tag": "p", "text": "When Abel Peña was writing the backstory for Pic and his companion for the Dark Forces Saga, he re-used the term Sithspawn, originally a curse word used by Corran Horn in X-Wing: Rogue Squadron, which was revealed to mean a monstrosity created though dark side magic in Tales of the Jedi Companion. Peña brought back the concept of Sithspawn, coupling two of the aliens seen in Jabba's Palace to create the \"Brothers of the Sith.\""}, {"tag": "p", "text": "The article Building a Better Jedi that appeared in Star Wars Insider 31 provided Pic's height as 4 feet, which roughly equals 1.2 meters. However, his entry in The Dark Forces Saga later contradicted that information, stating that Pic was less than a meter tall. This article uses the more recent The Dark Forces Saga's height."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}