{"url": "Pijali_palace", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Palaces", "Category:Pijal locations"], "nodes": [{"tag": "h1", "text": "Pijali palace"}, {"tag": "p", "text": "The Pijali palace was a palace located on the Inner Rim planet of Pijal. It served as the residence of Pijal's monarch, Princess Fanry."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Pijali palace was used as the residence for the Pijali monarchy. The palace was visited by Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi during their mission to Pijal in 40 BBY. By the time of the mission, the palace's winding corridors had been worn down over centuries of use."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The palace of the Pijali monarchy was situated in a thickly conifer-forested area near Pijal's capital city. It's structure was carved into white stone cliffs with various shaped windows overlooking an ocean. From above, the only visible piece was the top of the Celestial Chalice. The grounds of the royal complex had neatly manicured lawns and iron fences. From inside, the palace was richly ornamented, but in subtle ways that weren't immediately apparent. Polished stone surrounded the main entry doors to the palace, which led onto an elongated walkway."}, {"tag": "h3", "text": "Celestial Chalice"}, {"tag": "p", "text": "The Celestial Chalice was a circular amphitheater dedicated to Pijal's ancient gods. Atop blue tiled floors, an octagonal shaped altar rested. It was only used two or three times per reign for ceremonies, and viewers would watch from chairs situated around the dais. The Celestial Chalice could be accessed through a double set of wood doors at the end of the royal reception hall."}, {"tag": "h3", "text": "Regent's quarters"}, {"tag": "p", "text": "Regent's quarters were allocated in the palace and contained a spacious bedroom chamber with a fireplace. The ceiling was richly ornamented, though much of the other furniture had gotten worn over time. A formal audience chamber was also allocated for the regent."}, {"tag": "h3", "text": "Stables"}, {"tag": "p", "text": "Stables were used to house Pijal varactyls kept by the monarchy. These were brought out from the stables for recreational riding and also for the Grand Hunt. The varactyls were otherwise kept in stalls and cared for by servants."}, {"tag": "h3", "text": "Throne room"}, {"tag": "p", "text": "The throne room was an elegant space with stone scrollwork carved into it's walls. Pink-tinted glass windows let light in, and fine chairs were within, as well as a throne for the monarch. The floor was tiled, and two large doors lead out into the Grand Hall of the palace."}, {"tag": "h3", "text": "Grand Hall"}, {"tag": "p", "text": "The Grand Hall connected to the throne room by a heavy set of double doors. It consisted of a long hallway that had a large viewscreen installed."}, {"tag": "h3", "text": "Treasury"}, {"tag": "p", "text": "A treasury of precious jewelry was kept in the palace, and it utilized a datapad-based record system to document what it contained. The traditional crown used in Pijali coronations was kept in the treasury, as well as several other head ornaments."}, {"tag": "h3", "text": "Guest suites"}, {"tag": "p", "text": "The palace contained guest suites at disposal for the monarch's guests. They contained tall windows overlooking the sea, and also attached balconies."}, {"tag": "h3", "text": "Library"}, {"tag": "p", "text": "The palace contained a library that contained the records of Pijal, including census records. It was fitted with marble floor tiles and had a cavernous feel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Pijali palace first appeared in Master & Apprentice, a 2019 canon novel by Claudia Gray."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}