{"url": "Pillow/Legends", "categories": ["Category:Legends articles", "Category:Furniture"], "nodes": [{"tag": "h1", "text": "Pillow"}, {"tag": "p", "text": "A pillow was an object which came in various sizes and shapes, ranging from very small pillows to protect or display small items, to those used to support an individual's head when lying down to rest or sleep, to pillows large enough to accommodate a humanoid being's entire body or serve as items of furniture unto themselves."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Contrary to the spartan lifestyle of many Jedi, Valenthyne Farfalla had a lavish bedroom including bedding and pillows made of yellow and red silk. The aspiring Sith Set Harth had a perfumed pillow."}, {"tag": "p", "text": "During the Clone Wars, padawans Ahsoka Tano and Barriss Offee would keep their lightsabers beneath their pillows as they slept."}, {"tag": "p", "text": "During the time of the Galactic Civil War, there existed many types of throw pillows, including one type made from fragrant grasses of Kuat. These pillows were often used for meditative techniques, but they were hard to come by as the greenery of Kuat was ferociously protected. Jareck Arned owned one such pillow in a meditation room in his valley home on Corellia."}, {"tag": "p", "text": "A Gallofree Yards GR-75 medium transport, the Bright Hope, had white pillows in its storage lockers, along with bantha-wool blankets."}, {"tag": "p", "text": "The most comfortable chair ever designed, as of 5 ABY, was described as a sort of large floating pillow. Han Solo had one such chair at his sky house."}, {"tag": "p", "text": "When Han Solo absconded with Leia Organa in 8 ABY, Luke Skywalker used a psychometric imprint from Solo's pillow as one of the clues to track him down. Han Solo regularly kept a blaster under his pillow while he slept, and Ben Skywalker occasionally kept a vibroblade under his pillow."}, {"tag": "p", "text": "The Amulet of Kalara originally rested on a red velvet pillow until it was taken from its display case on Almania by Faskus Olvidan."}, {"tag": "p", "text": "Pillows could be made of a variety of materials, including foam that could yellow over time, gort feathers, velvet, and silk."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}