{"url": "Augwynne_Djo", "categories": ["Category:Legends articles", "Category:Articles undergoing major edits", "Category:Clan mothers", "Category:Females", "Category:Humans", "Category:New Republic individuals", "Category:Singing Mountain Clan members"], "nodes": [{"tag": "h1", "text": "Augwynne Djo"}, {"tag": "p", "text": "Augwynne Djo was a female Human who was the leader of the Singing Mountain Clan of Dathomiri Witches, the grandmother of Teneniel Djo, great-grandmother of Tenel Ka, and great-great grandmother of Allana Solo."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born on the planet of Dathomir decades before the founding of Palpatine's Galactic Empire, Augwynne Djo was a female Human and a member of the Witches of Dathomir, a society dominated by Force-sensitive women."}, {"tag": "h3", "text": "Clan mother"}, {"tag": "p", "text": "At some point before the rise of the Empire in 19 BBY, she had become the clan mother of the Singing Mountain Clan, a coven of witches that claimed the territory located in the vicinity of an eponymous landform. Mother Augwynne and her sisters were the guardians of a ruined Star Temple, a mysterious pyramid built by the ancient extragalactic Kwa species to protect a powerful artifact."}, {"tag": "p", "text": "During her tenure as clan mother, the life of Augwynne Djo unfolded in tragedy. All four of her daughters ended up being lost to her, either through death or betrayal. Djo's oldest daughter, Barukka, had dabbled in the forbidden teachings of the dark side of the Force, and the clan mother had been forced to cast her out. Her other daughter Allaya Djo, who acted as the clan's warmaster and had borne a daughter named Teneniel, met an untimely death in battle. But worst of all was the loss of Gethzerion, who had always been Mother Augwynne's favorite. Gethzerion and Barukka, both lost to the dark side, became Nightsisters and attempted to murder their own mother, a plan that was only foiled by the sacrifice of their youngest sister Kara'Teel, who gave her life to protect Augwynne. However, following these tragedies, Augwynne decided to adopt Aelta and Chastina."}, {"tag": "p", "text": "In 19 BBY, Jedi Knight Jax Pavan visited Dathomir in order to search a Star Temple. After landing on the Singing Mounain, Jax was escorted to Djo's quarters by sisters Magash Drashi and Duala Aidu. After conversing for a bit, Djo granted him permission to journey to the Star Temple. When Pavan returned from the temple, Djo and the other sisters agreed to help Pavan open the SD41263.I holocron in order to learn the secrets of the Sith Lord Darth Ramage. The holocron would only activate after being provided blood from a Force-sensitive being. Djo, Aida, Pavan, and Drashi each donated blood to open the holocron. When the Jedi returned from his infiltration of Kantaros Station, Pavan had his mind cleared of his dark knowledge by Djo."}, {"tag": "p", "text": "During the Galactic Civil War, Augwynne informed Jedi Knight Rachi Sitra about a danger one of the Nightsisters, Kyrisa, had represented to her clan."}, {"tag": "p", "text": "In 8 ABY, Augwynne was present when New Republic members Han Solo, Chewbacca, and Leia Organa arrived at the Singing Mountain Clan. Djo declared Han a free man from the slavery of the Nightsisters after Leia presented his case. Learning Han owned the deed to Dathomir, she gave him the chance to make three requests in order to gain it. Han asked Djo to get him off Dathomir, give him the gold and gems that were plentiful on the planet, and find a way to get Leia to marry him. However, she did not complete Han's third request, as she believed she could not force Leia to marry Han. Augwynne went to her chambers, conversing with her fellow sisters about the danger of fighting the Nightsisters. Djo had no choice but to lead the sisters of the Singing Mountain Clan against the Nightsisters in order to give Han time to get the Millennium Falcon off Dathomir. She requested help from other clans, but none came. Thanks to Jedi Knight Luke Skywalker, Chume'da Isolder of the Hapes Consortium, Han, Leia, Chewbacca, and her granddaughter Teneniel, the sisters of the Singing Mountain Clan were able to defend the clan and drive the Nightsisters away. Augwynne and the sisters were finally rid of the Nightsisters when they were shot down trying to escape Dathomir. After the Battle of Dathomir, Augwynne became the owner of Dathomir when Han Solo turned over the deed. Around the same time, her surviving daughter Barukka returned from the dark and rejoined the clan, much to Augwynne's joy."}, {"tag": "h3", "text": "Later life"}, {"tag": "p", "text": "In 23 ABY, she helped Luke and Tenel Ka find the resurgent Nightsisters and the Shadow Academy.  That same year, Augwynne's favorite rancor died and her great-granddaughter Tenel Ka Djo kept two of the animal's smaller teeth. In 24 ABY, she and the rest of the Djo family visited Tenel when she graduated from the Jedi Praxeum on Yavin 4."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Djo had pale eyes and hair the color of moonlight. She was tall and regal, with facial features considered handsome by her fellow Humans, as well as graceful, long-fingered hands. By 19 BBY, she had the appearance of a sixty-year old woman."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Djo was skilled in Allyan Magic. She exhibited many force abilities including: absorption and dissipation of energy, healing, controlling pain, conjuring shields, communicating with others at long distances, reading people's thoughts and feeling their emotions, using telekinesis, killing people telekinetically, creating storms telekinetically, comprehending speech, and transferring force."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "When in full regalia, Mother Djo wore a tunic of glittering yellow scales over a hide robe with black lizard shapes sewn around the hem. Her ceremonial headdress was made of smooth golden wood, and was decorated with cabochons of yellow tigereye. On other occasions, Djo was known to wear a coronet of aurodium."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Augwynne Djo first appeared in the 1994 novel, The Courtship of Princess Leia, written by Dave Wolverton."}, {"tag": "p", "text": "Oddly, Cracken's Threat Dossier states that she was the one to have married Han and Leia Solo, however this contradicts The Courtship of Princess Leia. This article assumes the book is correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}