{"url": "Pillio", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Core Worlds planets", "Category:Galactic Empire planets", "Category:Jinata system", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Pillio"}, {"tag": "p", "text": "Pillio was a remote and uncolonized aquatic planet on the edge of the Jinata system in the Core Worlds that was home to more than 3 million species."}, {"tag": "p", "text": "A colossal coral reef stretched across the entire planet, and vast numbers of sea life lived in its oceans. Ancient fossils, uncommon species, and other secrets laid hidden in the deep coral caves. Pillio was the main food source of the Jinata system. Both the Nautolan and Mon Calamari fishing companies quarreled over the profits that were to be made from the natural resources."}, {"tag": "p", "text": "Pillio was also the location of one of Emperor Palpatine's observatories. In 4 ABY, the Jedi Knight Luke Skywalker recovered a compass kept at the observatory."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Following the destruction of the DS-2 Death Star II Mobile Battle Station, Luke Skywalker felt a calling to Pillio and traveled to the planet. Imperial forces also arrived on the planet, including Inferno Squad's Del Meeko, who had orders to destroy an observatory belonging to Darth Sidious. Despite being on opposite sides of the conflict, Luke and Del worked together to reach the observatory, where the former retrieved a special compass before the two parted ways."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "During the Cold War between the New Republic and First Order, Del Meeko once again returned to Pillio, aiming to locate a number of kidnapped Athullans. After landing on the planet, he was captured by Jinata Security. Later, Kylo Ren arrived to interrogate Del regarding the whereabouts of the map leading to Jedi Master Luke Skywalker. Ultimately, Ren discovered the map was taken by Lor San Tekka to Bayora and promptly departed after delegating authority to Gideon Hask, who then executed Del aboard the Corvus."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pillio was first mentioned in the 2017 junior novel The Legends of Luke Skywalker. During a story named \"the Starship Graveyard,\" told by Ulina, it is claimed that shortly after the Battle of Jakku, a scavenger gifted Skywalker with a compass found in an Imperial case labeled \"Pillio.\" It later appeared in the 2017 video game, Star Wars Battlefront II as part of the single player campaign."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}