{"url": "Augustine_Smight", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Guards", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Augustine Smight"}, {"tag": "p", "text": "Augustine Smight was one of the guards of the Cog Hive Seven prison by the year 33 BBY. He also worked as an undercover employee of Jabba the Hutt."}, {"tag": "p", "text": "He was killed by using a badly-constructed lightsaber, the blade of which looped back on itself and into his face."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Working inside Cog Hive Seven"}, {"tag": "p", "text": "Augustine Smight was a young recruit who lived during the waning years of the Galactic Republic. He worked as a corrections officer on the space station prison Cog Hive Seven. As all other guards within the prison, he possessed a control unit called a dropbox, which could kill prisoners by activating the subatomic electrostatic detonators implanted into their hearts."}, {"tag": "p", "text": "Darth Maul infiltrated this prison under the name of Jagganath and it was Smight who scanned him for infections or hidden weapons. He attempted to intimidate the Sith Lord by describing the brutal life inside the prison, but his quavering voice and trembling hand betrayed his nervousness."}, {"tag": "p", "text": "When a father and son organized an escape attempt, locking themselves inside the prison's medbay, Smight was one of the guards to arrive at the scene. Along with another officer, he brought Maul up into a crowded service lift, where he kept his blaster jammed against the Zabrak's spine until the moment he received a verbal threat. He brought Maul into the office of Warden Sadiki Blirr. Smight was afterwards ordered to leave. He voiced his uncertainty at this decision, but was impatiently gestured away."}, {"tag": "p", "text": "Before one of the prison's infamous fighting matches, Smight was ordered by Sadiki to await for Maul in a corridor outside his cell. The Warden had prepared zip-tie restraints in order to make Maul's next fight more difficult. Smight fitted these restraints to Maul's ankles and weighed them to the floor. Maul noticed by the officer's twitchy behavior that Smight had taken glitterstim to nerve himself for this task. When Maul made a remark about his spice-influenced behavior, the young guard reacted with hostility and quickly exited his cell."}, {"tag": "h3", "text": "Meeting with the Prison Warden"}, {"tag": "p", "text": "Still feeling confident by the effects of spice, Smight later attended a meeting along with several other officers. While they all awaited the Warden, he spoke with a corpulent guard named Hootkins. Once Sadiki arrived, she opened a holoprojector communication channel with Jabba the Hutt."}, {"tag": "p", "text": "She then exposed Smight and his fellow officers in front of the Hutt as the Crime Lord's own foot soldiers, sent by him to work undercover in order to track down the weapons dealer Iram Radique."}, {"tag": "p", "text": "Smight felt a rising panic at the accusations, but attempted not to show any reaction. Sadiki asked Jabba to recognize his men and she would then return them to him unharmed. However, Jabba denied knowing any of them and expressed no interest in whether they would live or die."}, {"tag": "p", "text": "The Warden then slid open a panel to reveal various prison gang members approaching the meeting room. She threatened to unleash the prisoners against the unarmed guards unless someone else admitted to the truth. It was Hootkins who first caved in and betrayed all the disloyal members, a list which included Smight himself."}, {"tag": "p", "text": "Sadiki abandoned them all to their fate. As the guards were being violently slaughtered, Smight managed to escape by rushing into a dark passageway."}, {"tag": "h3", "text": "Running to Survive"}, {"tag": "p", "text": "Smight wandered around the prison tunnels in fear, until he encountered a giant Wolf Worm named the Syrox. Desperate not to be eaten, Smight rushed back through the corridors which he had come from, where he was once more caught by the gang members who had killed his coworkers. Just before he was attacked by the prisoners, he managed to warn Nailhead and Strabo of the Syrox. However, his words did not come quickly enough to save the gangs from the creature."}, {"tag": "p", "text": "Smight once more escaped by lying low and crawling quietly away into a conduit. After this event, he was plagued by what he had seen and briefly lost any enthusiasm to survive."}, {"tag": "p", "text": "He managed to accidentally locate a chemical laboratory and correctly deduced that it was the secret headquarters of Radique's operations. He explored the area and uncovered a multitude of customized weapons. Hoping to use his findings in order to earn a higher position within the Desilijic Clan, Smight did a quick inventory and armed himself with a DT-12 blaster pistol. Before he could leave, however, he was attacked by one of Radique's men and knocked out by a blow to the side of his head. By the time he awoke, he was gagged and tied by his hands and ankles."}, {"tag": "h3", "text": "Final Confrontation with Darth Maul"}, {"tag": "p", "text": "Iram Radique's inner circle met with Darth Maul inside the laboratory. They discussed synthetic lightsabers which Radique was trying to produce. Maul suggested that they were faulty and would not work correctly. He told the prisoner Zero to attack him with one of the lightsabers, as proof of his confidence in his claims. Instead of carrying out this offer, Zero asked the Chadra-Fan Coyle to bring forward Smight. The guard's bonds were cut loose and he was handed a lightsaber, but the gag over his mouth was not removed."}, {"tag": "p", "text": "Ordered to kill the Zabrak, Smight at first hesitated due to feeling humiliation, until a murderous resolve took over him. Maul thought that the prison guard felt a sacred self-actualization at the decision to use the lightsaber. Before he could cut down the Sith Lord, however, the weapon malfunctioned and instantly killed Smight by hooking through his face and chopping his body to pieces."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Augustine Smight was a jittery officer with an occasional cruel streak. Despite trying to appear brave, his fears were visible to prisoners around him and he backed down whenever Darth Maul verbally threatened him."}, {"tag": "p", "text": "Smight was prone to self-pity and considered himself cowardly, inadequate and incompetent. His feelings of self-doubt and uncertainty surfaced in particular when he was in great personal danger."}, {"tag": "p", "text": "He had a good knowledge of various weapons, being able recognize different types of guns and explosives, and whether they were up to factory specifications."}, {"tag": "p", "text": "Smight had a spice addition, which he thought helped him to gain courage and heightened his senses."}, {"tag": "h2", "text": "Appearances"}]}