{"url": "Pirate", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Criminal occupations", "Category:Piracy and privateering"], "nodes": [{"tag": "h1", "text": "Pirate"}, {"tag": "p", "text": "Pirates were individuals who engaged in the criminal activity known as piracy. Such acts included hunting, hostage taking, and theft of cargo. Notable pirates include Hondo Ohnaka who had dealings with the highest levels of leadership of both the Galactic Republic and the Confederacy of Independent Systems during the Clone Wars, and those led by Q'anah, who was thwarted by Wilhuff Tarkin during his tenure with the Outland Regions Security Force of Eriadu. Pirates were sometimes associated with bounty hunters."}, {"tag": "p", "text": "Pirates who were legitimized by a letter of marque from some government or authority were known as privateers."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Age of the Republic"}, {"tag": "p", "text": "Prior to the construction of starships that pirates could prey upon, they hunted a vast array of creatures, such as purrgil and space slugs."}, {"tag": "p", "text": "Before the Invasion of Naboo, Lord Alorg's Flesh Mongers kidnapped a child, Lo. However they lost the child when Jedi Grand Master Yoda rescued Lo. Another pirate faction carried out numerous raids on Trade Federation. Following the Battle of Naboo, Hudso Shaku and his Krypder Riders attempted to steal a Jedi holocron from a excavation on Dallenor. However, they failed due to intervention from Jedi Master Obi-Wan Kenobi and his Padawan Anakin Skywalker."}, {"tag": "h4", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, several Republic supply ships were destroyed by pirates en route to Rodia. Later the pirate gang of Captain Hondo Ohnaka captured Separatist leader, Count Dooku on Vanqor. They attempted to ransom Dooku off to the Republic. They tried to triple the ransom by capturing Jedi Master Kenobi and Jedi Knight Skywalker. However, Dooku escaped and Kenobi and Skywalker were rescued by Representative Jar Jar Binks and Clone Commander Stone's troopers. The Ohnaka Gang would continue in their operations such as extorting nysillin from farmers on Felucia, smuggling weapons to known resistance movements, and attempted to steal Kyber crystals from group of Jedi younglings."}, {"tag": "p", "text": "Several members of the Ohnaka gang were approached and bribed by former Sith Lord Maul and his brother Savage Opress into working for them. Jiro and several of the pirates joined Maul until Captain Ohnaka was able to hold them at gunpoint. The Ohnaka gang along with Master Kenobi were able to force the two zabraks to retreat. After Maul's ship crashed, the Ohnaka gang found the credit coffer and assumed that the Zabraks were dead. Another group of Weequay pirates of the Marauder  organized gladiator games aboard their ship with stolen droids."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "h4", "text": "Empire's reign"}, {"tag": "p", "text": "According to reports from the Imperial Security Bureau, pirate groups were likely to shelter in the polar regions. In order to keep control of such regions, Imperial High Command established the snowtrooper division. The Empire was able to break up the Ohnaka gang, but Ohnaka continued with his operations on his own. Enfys Nest and her Cloud-Riders were seen as pirates during their attempted thefts of Identichips and Coaxium. Gwarm, formerly Ohnaka's lieutenant, started his own gang. Angel's Culoss band hijacked the freighter Dromedar to steal its tibanna gas and captured its crew. The Culoss pretended to be its crew when a boarding party under Lieutenant Thrawn from the Imperial Navy ship Blood Crow. They were able to capture the boarding party and escape with the gas. However, three of the pirates were capture and questioned by Thrawn at Ansion's Imperial base. With Thrawn's information, the Culoss's operations on Uba, Cartherston, and Kril'Dor were targeted by the Empire."}, {"tag": "p", "text": "Ohnaka was able to briefly take Cikatro Vizago's ship, the Broken Horn and take Azmorigan's credits for the power generator. Ohnaka lost the ship, however, when Bridger helped Vizago in taking back the Broken Horn. He was able to keep the credits for himself. Ohnaka helped the Spectres of Phoenix Cell in rescuing Lasat refugees, providing locations of derelict bombers and acquiring proton bombs. He also recruited Melch as a partner. The Seventh and Third Fleets hunted down pirates that were causing problems for Director Orson Callan Krennic's Project Stardust. Thrawn discovered that Savit was working with the pirates in stealing supplies Governor Haveland and Krennic. Thrawn was able to defeat Savit's fleet and had him tried for treason on Coruscant."}, {"tag": "h4", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Galactic Civil War, Vader dealt with pirates backed by the Crymorah syndicate. The Krawg pirates attempted to buy a crate of Imperial blasters from smuggler Sana Starros. However, Starros tricked them and Lando Calrissian made sure the pirates were arrested by the Empire for the theft."}, {"tag": "p", "text": "Following the end of the Civil War, Eleodie Maracavanya and zher pirates of the Sovereign Latitudes of Maracavanya were able to capture the Executor-class Star Dreadnought Annihilator and renamed it the Liberty's Misrule. Together, Maracavany and zher pirates used it to control their small empire in Wild Space. Another pirate, Viz Moshara attempted to protect Substation Grimdock from the New Republic army, but was killed."}, {"tag": "h3", "text": "Age of Resistance"}, {"tag": "p", "text": "Pirates such as Sidon Ithano searched for treasure. During the Cold War between the First Order and the Resistance, First Order officer Commander Pyre and Major Elrik Vonreg worked with Kragan Gorr and his Warbird gang in raiding and attacking the Colossus. The First Order hoped that this would force Captain Imanuel Doza in accepting their \"help\" in protecting the platform from further attacks. Gorr sent Synara San to infiltrate the Colossus and spy on them."}, {"tag": "p", "text": "Gorr and a pair of his pirates were able to kidnap Doza's daughter Torra Doza and took her to their ship. When the First Order arrived, Gorr and his gang were double-crossed and forced to retreat when the Ace Squadron arrived to assist. Gorr was able to retrieve San after she escaped from the Colossus. Gorr and his gang then intercepted a transmission to the Resistance from the spy Kazuda Xiono. Gorr and his gang assisted the Colossus's escape from a First Order Star Destroyer. They later boarded the Colossus as it entered hyperspace towards the Resistance base on D'Qar."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}