{"url": "Pirate_Bunker", "categories": ["Category:Legends articles", "Category:Naboo locations", "Category:Pirate bases"], "nodes": [{"tag": "h1", "text": "Pirate Bunker"}, {"tag": "p", "text": "The Pirate Bunker was a bunker located on the planet Naboo and controlled by a group of pirates during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Pirate Bunker was located in an isolated area of the Gallo Mountains, on the Mid Rim world of Naboo. The building was deserted until the pirates decided to inhabit it and used it as their headquarters."}, {"tag": "p", "text": "After the Battle of Yavin, the pirates kidnapped several Naboo noble all over the planet and kept them prisoners in the bunker for ransom. People captured included Demitri Firewatcher's master, Hanna S'kiyah's sister, and even several members of the royal family."}, {"tag": "p", "text": "Circa 1 ABY, Demitri Firewatcher solicited the help of a spacer while he was in the city of Keren. He asked the the spacer rescue his master. Firewatcher used rumors of treasure in the bunker to further catch the spacer's interest. The spacer agreed to rescue the prisoners, and Firewatcher recommended that a group be formed to overwhelm the more numerous pirates. In the meantime, Hanna S'kiyah also begged a spacer to rescue her sister from the bunker. A spacer also met a man known as Ketter Yaaran in the Kaadara cantina to get information about the pirates and their bunker."}, {"tag": "p", "text": "The same year, Jabba the Hutt's bounty hunter Bronell dispatched a spacer to the pirate bunker in order to retrieve information about a CorSec officer who owned money to Jabba, as well as to the pirates."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Pirate Bunker was a location in the 2003 massively multiplayer online role-playing game Star Wars Galaxies: An Empire Divided, prior to the game's closure on December 15, 2011. The Pirate Bunker was added to the game with the update named \"Publish 1\", released on August 3, 2003."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}