{"url": "Aul_Tarrus_Vishav", "categories": ["Category:Legends articles", "Category:Bitthævrians", "Category:M'Yalfor'ac Order personnel", "Category:Males", "Category:Military personnel", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Aul Tarrus Vishav"}, {"tag": "p", "text": "Major-Guardian Aul Tarrus Vishav was a Bitthævrian, a high-ranking member of the m'Yalfor'ac Order and Colonel Quaal Tavier Catharius's personal bodyguard."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born a slave in the crystal mines of Upper Bal'ta'ran Cluster, Vishav's abnormally big size was taken advantage of by his owners: He could still work as a miner when other slaves died from exhaustion in the same conditions. The constant effort improved his physical conditions, so he was to be shackled in magnacuffs to avoid any problem. As a child, Vishav suffered from commonly-fatal illness Sinjaffe; however, his peak condition allowed him to overcame the disease in a few days. Nevertheless, his arm retained some large bands since."}, {"tag": "p", "text": "Due to his size and strength, his owners considered him a potential threat and the head slaver ordered Vishav's execution. He was imprisoned in a cell at u'Tal'ac Range but, due to a mistake, he was tied with standard shackles. Vishav managed to break the shackles and escape, killing many guards while doing so; his escape became a legend for other slaves at the same mines."}, {"tag": "p", "text": "Vishav escaped to the continent of l'Quart'a and there he joined the m'Yalfor'ac Order, the continental army of the Guiteica Militia, as a foot soldier. With training and potential, he became a remarkable warrior, and he soon ascended to Guardian, an elite rank. Even then, he became one of the personal bodyguards of m'Yalfor'ac leader, Colonel Quaal Tavier Catharius. As a Guardian, Vishav obtained great fame and honor during the challenge by personal combat of Catharius and captured traitor Jael Ganton Farvash. Farvash had made an attempt on Catharius' life, injuring him but being captured in the process. Farvash nevertheless asked for the challenge by personal combat, and the injured Catharius was bonded to accept. Catharius asked Vishav to be his Defender, a traditional role commonly used to verify that the battle was \"honorable\" and officially used to avoid interruptions by uninvited interlopers."}, {"tag": "p", "text": "During the battle, both Catharius' and Farvash's dematoils tasted blood, and then three dematoil-wielding, Farvash-aligned Guardians entered the arena. Vishav tried to protest, but the Succession Judge, who was favorable to Farvash, allowed the battle to continue. Vishav then jumped the arena unarmed and killed the three Guardians, suffering injuries in both chest and hands. Catharius then killed Farshav, and then the Judge. After this situation, Vishav was considered a hero of almost Catharius' status and received the Ransal Rhal Insignia, almost guaranteeing his post as Catharius' successor."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}