{"url": "Aura_of_uneasiness", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Sith magic"], "nodes": [{"tag": "h1", "text": "Aura of uneasiness"}, {"tag": "p", "text": "An aura or shadow of uneasiness was an ancient technique conjured through Sith magic that allowed an individual to proceed unabated by projecting a field of vague unease around themselves. While non-sentient creatures were primarily affected, cognizant beings also succumbed to its influence, experiencing feelings of confusion and discomfort when in close proximity to an individual emanating an aura of uneasiness. The technique was popular among Great Sith War–era proponents of Sith magic, and knowledge of the skill survived into the days of the reinstated Galactic Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Using the dark side of the Force to project an aura of uneasiness around oneself allowed a sentient being to rid themselves of the nuisance of creatures that might otherwise cause them distress. When inside the aura's sphere of influence, animals and insects were compelled to avoid the path of the aura's projector, thus allowing the individual to proceed without delay. When performed in the presence of other sentient beings, the aura caused individuals to suffer from a sensation of intense malaise. Force-sensitives experienced an expanding sense of darkness, as well as an inability to concentrate on whatever task they were attempting to perform at that moment. The ability was relatively simple to create and control, but its area of effect, although more potent when in close proximity to the point of origin, was restricted to the initiator's line of sight."}, {"tag": "h2", "text": "Applications"}, {"tag": "p", "text": "Knowledge of projecting a shadow of uneasiness was widely dispersed among followers of ancient Sith philosophy. The skill was one of many among the repertoire of a seasoned Sith sorcerer and was an ability that they passed down to students of the dark side. The ancient Dark Lord of the Sith Freedon Nadd, during his reign as king of the planet Onderon, possessed the ability to create auras of unease. The talent survived him, remaining within the skill set of the sorcerous inheritors to Nadd's throne: King Ommin, and his wife Amanoa, Queen of Onderon. Ommin displayed the ability while meeting with Tetan cousins Aleema and Satal Keto, the latter of whom took suddenly ill when subjected to the power of the King's aura, while Aleema remained unaffected. The Dark Jedi Warb Null also radiated an aura of uneasiness. Jedi Knight Oss Wilum was especially affected during the first battle of the Naddist Uprising, becoming disoriented and blinded by what he perceived as an all-consuming darkness. He was urged to resist the power of Null's aura by holding fast to the light side of the Force."}, {"tag": "h2", "text": "Users"}, {"tag": "p", "text": "Auras of uneasiness were popular among the Naddist Sith cult that was active on Onderon during the planet's Beast Wars. Sith sorcerers such as King Ommin and Queen Amanoa, both Naddists and one-time members of the Onderon royal family, displayed the ability to create them. The power was known and practiced by several Dark Lords of the Sith, such as Freedon Nadd and his successor, Exar Kun. Servants of the Sith, such as Freedon Nadd's guardian, Warb Null, emanated an aura of uneasiness while in the midst of combat. Many thousands of years after the Naddist Revolt, Jedi trainee–turned–Sith acolyte Kyp Durron learned to create auras of uneasiness from the spirit of the deceased Dark Lord Exar Kun, to whom Durron had recently apprenticed himself. He made a conscious effort to project a shadow of unease that kept the jungle fauna at bay as he moved through the forests of the Yavin moon. The creatures sensed Durron's power and had no desire to move closer to him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The initial appearance of the shadow of uneasiness was in author Kevin J. Anderson's July 1994 novel Dark Apprentice, second in The Jedi Academy Trilogy. It next appeared, albeit unnamed, the following month in the first issue of Tales of the Jedi's Freedon Nadd Uprising story arc, and again in September of the same year with the release of the second installment of The Freedon Nadd Uprising. Two years later, the Force power was detailed in West End Games' Tales of the Jedi Companion, wherein it was referred to as the \"aura of uneasiness.\""}, {"tag": "p", "text": "In terms of roleplaying game stats, the aura of uneasiness is an easily mastered and used Force power. Using the aura against another sentient player character automatically gives player characters a Dark Side point."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}