{"url": "Piryn_Shar_sector", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Expansion Region sectors", "Category:Piryn Shar sector"], "nodes": [{"tag": "h1", "text": "Piryn Shar sector"}, {"tag": "p", "text": "The Piryn Shar sector was located in the Expansion Region. It contained the Natalon, Noe'ha'on, and Ohratuu systems, with the Great Gran Run hyperlane passing through the former two systems. The Ohratuu system contained a planet of the same name, while the Natalon system was the origin point of the Natalon Core Bandits. Noe'ha'on was a jungle world that was home to the sentient Noehons and the predatory k'lor'slug creatures."}, {"tag": "p", "text": "The area of space surrounding Noe'ha'on was explored between 1000 BBY and 25 BBY, although off-worlders had already visited the world millennia earlier. Imperial Military forces and those of the extragalactic Nagai and Tof species traveled through the Piryn Shar sector in 17 BBY and 4 ABY, respectively. Between 3 ABY and 4 ABY, the former Rebel Alliance general Reesen Jivrak established a base on Ohratuu."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Piryn Shar sector was a part of the Expansion Region. By 0 ABY, the sector bordered the Vensensor sector in the spinward direction and formed a four-way border with the Har Worlds, the Trans-Jardeen sector, and the Vatha sector Coreward. Together with the Har Worlds and the Vatha sector, the Piryn Shar sector also formed the Expansion Region's Rimward boundary with the Oriolan, Sombure, and Wornal sectors of the Mid Rim."}, {"tag": "p", "text": "The Natalon, Noe'ha'on, and Ohratuu systems all lay in the Piryn Shar sector. The hyperlane known as the Great Gran Run passed through the Natalon and Noe'ha'on systems on its way from the Vatha sector to the Har Worlds."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As part of the Western Reaches Operation in 17 BBY, military forces of the Galactic Empire traveled along the section of the Great Gran Run passing through the Piryn Shar sector prior to the battle in the Mid Rim's Halm system. Similarly, while moving Coreward as part of secondary movements of their separate invasions of the galaxy in 4 ABY, the forces of the extragalactic Nagai and Tof species moved along the Piryn Shar sector's segment of the hyperspace route."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "The Natalon and Ohratuu systems"}, {"tag": "p", "text": "The Natalon system was the origin point of the Natalon Core Bandits. At some point between 14 BBY and 0 BBY, the Human smuggler Han Solo was involved in a shootout in the system."}, {"tag": "p", "text": "The Ohratuu system contained a terrestrial planet of the same name. It was home to a species of docile land-based herd creatures known as deripors. At some point between 3 ABY and 4 ABY, the former Rebel Alliance general Reesen Jivrak and his small group of followers established a base on Ohratuu. Jivrak utilized deripors altered by strength-increasing and aggression-heightening toxins in hit-and-run attacks."}, {"tag": "h3", "text": "Noe'ha'on"}, {"tag": "p", "text": "The jungle world Noe'ha'on was located in the eponymous system. It was the homeworld of the k'lor'slug, a species of aggressive, worm-like swamp predators that eventually found their way off-world as pests. Noe'ha'on was also inhabited by the Noehons, a species of sentient arboreal insectoid."}, {"tag": "p", "text": "The area of space surrounding Noe'ha'on was explored between 1000 BBY and 25 BBY, although off-world paleontologist expeditions had already visited the world by 3630 BBY. Noe'ha'on fell within the borders of the Galactic Republic during the Clone Wars of 22 BBY–19 BBY. During the first campaigns of that conflict, the Nineteenth Army of the Republic Military was tasked with defending the system's vicinity against the military forces of the Confederacy of Independent Systems. Between 19 BBY and 17 BBY, Noe'ha'on was incorporated into the territory controlled by the Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Piryn Shar sector was established in the StarWars.com Online Companion to the 2009 reference book The Essential Atlas, which was written by Daniel Wallace and Jason Fry. In 2012, the sector was depicted on a map designed by Modi and published in the Online Companion feature \"Essential Atlas Extra: Expansion Region.\""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}