{"url": "Pius_Dea", "categories": ["Category:Legends articles", "Category:Pius Dea", "Category:Religious organizations"], "nodes": [{"tag": "h1", "text": "Pius Dea"}, {"tag": "p", "text": "Pius Dea was a fanatic religious cult, most famous for their control of the Galactic Republic during the Pius Dea Era. The cult first came to power when one of their members, the man who would become known as Contispex I, became Supreme Chancellor of the Republic in 11,987 BBY after the impeachment and assassination of Chancellor Pers'lya."}, {"tag": "p", "text": "Through Contispex and his successors, all of whom took the name Contispex and many of whom were members of his dynasty, Pius Dea would rule the galaxy for just over a thousand years. The era of their rule was characterized by the Pius Dea Crusades: a series of over thirty bloody wars against alien species and suspected alien sympathizers. The religion was effectively destroyed by the Bureau of Ships and Services, the Jedi Order, and the Republic Navy in the year 10,966 BBY, with Jedi Grand Master Biel Ductavis assuming the role of Supreme Chancellor after the ousting of Contispex XIX."}, {"tag": "h2", "text": "Doctrine and Practices"}, {"tag": "p", "text": "The Pius Dea was a monotheistic religion that worshiped a deity known as The Goddess. Members of the Pius Dea adhered to a strict moral code emphasizing humanocentrism and spiritual purity. They associated the Outer Rim with chaos and believed that they had a divine mandate to defeat chaos in return for gaining treasures and divine secrets. While scouting of the Republic's frontiers still continued under the sect, exploration and making contact with alien civilizations was seconded to the sect's primary interests in military conquest, acquiring material wealth, and religious missionary work. Many spacers accumulated much social status and wealth by privateering for the sect."}, {"tag": "p", "text": "As a Human supremacist cult, the Pius Dea regarded many alien species as \"unredeemable\" due to their alleged inferiority and the threat they posed to the Human civilizations of the Core Worlds. They viewed their military conflicts against their opponents as crusades with the ultimate intention of gaining spiritual merit and purification. Despite their humanocentric outlook, the Pius Dea were more than willing to accept alien converts if they were wealthy or well contacted or had traits deemed useful such as Rodians, Wookiees, Hutts and Weequays. Religious conversion was associated with increased social mobility and unrestricted passage throughout Republic-controlled worlds for those who enlisted in the Republic's military which was then firmly under the sect's control. The sect also had religious commissars attached to military units to root out heretics and apostates."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Forging a Theocracy"}, {"tag": "p", "text": "The movement that would become Pius Dea began on Coruscant several centuries before Contispex I became Supreme Chancellor in 11,987 BBY. Coruscanti began calling for communities to clamp down on corruption, purging \"unredeemable\" elements to restore purity. Pius Dea would rise to prominence with the help of the man known to history as Contispex I. Contispex was born on Coruscant and became a prominent member of the Coruscant Merchants' Guild, where he became a powerful figure in the Pius Dea faith. His staunch stance against corruption and his intolerance of those who did not share his high standards made him a well-loved figure in the public eye. He quickly became a member of the Senate, and he was elected by a landslide to the position of Supreme Chancellor after the impeachment and later assassination of the Bothan Chancellor Pers'lya in 11,987 BBY."}, {"tag": "p", "text": "However, very few outside of the Pius Dea's leadership circle were aware that Contispex and Pius Dea had conspired with the Malkite Poisoners to impeach and kill the Bothan, so that they could seize power. With the rise of Contispex, Pius Dea gained full control of the key political and economic machinery of the Republic's government, purging all of their opponents from power. With a generation, most important bureaucratic positions were reserved exclusively for cult members. Within two to three generations, many of these key posts became hereditary, entrenching the sect's influence at the expense of creating a culture of nepotism within the Republic's government. By the 11,500s BBY, the sect's vast fleet of Cathedral ships were crewed by descendants of Republic Navy personnel who had converted to the faith. In contrast, opponents of the sect including dissidents, heretics and apostates were designated as Proscribed: entailing a loss of civil liberties, economic assets and stiff barriers to social mobility."}, {"tag": "h3", "text": "Pius Dea Crusades"}, {"tag": "p", "text": "Contispex I would launch the first of what would be later known as the Pius Dea Crusades in 11,965 BBY, as a preemptive strike against the Hutts in the Outer Rim Territories. Contispex's successors would continue these conflicts, with at least 34 crusades having been completed by 10,966 BBY. However, Contispex and his successors soon turned their attention to other alien species and sects which had been members of the Republic for millennia. Finally, the sect even targeted Humans accused of being alien sympathizers. Over the course of a millennium, the Republic was bogged down in unending warfare with several alien species that were judged irredeemable and subject to genocide including the Zarracines and Teirasans. The Pius Dea Republic would also be engaged in various protracted conflicts with the Hutts throughout that millennium."}, {"tag": "p", "text": "For millennia, Alsakan and Coruscant had been rivals for dominance of the Republic. Due to the Pius Dea's origins on Coruscant, the planet became a stronghold of the sect. Religious tensions coalesced with political and economy rivalry to culminate in the Sixth Alsakan Conflict in 11,820 BBY. During that conflict the Core World of Alsakan and their territories in the Perlemian Trade Route seceded from the Pius Dea Republic. Many alien worlds subsequently aligned themselves with Alsakan in return for protection from the Republic."}, {"tag": "h3", "text": "The Contispex dynasty"}, {"tag": "p", "text": "Contispex I would step down after a forty-year term in 11,947 BBY, when he was succeeded by his son Contispex II. Contispex's family would continue this dynastic tradition, with each successive member taking the name Contispex by the last centuries of the Pius Dea period. Several of the Chancellors of this era, while not related to the original Contispex, would still take the name Constipex. The dynasty would end with Contispex XIX, who was captured by the Jedi aboard the Flame of Sinthara at the Battle of Uquine. Contispex XIX was taken to Caamas, where he was tried and found guilty of crimes against the galaxy, and was imprisoned there for the rest of his life."}, {"tag": "h3", "text": "Collapse"}, {"tag": "p", "text": "The religious zeal of the Pius Dea Republic antagonized many species and powers within the galaxy. Following the Sixth Alsakan Conflict, Coruscant's rival Alsakan opened secret lines of communication with several alien species alienated by the Crusades including the Duros, Herglics, and the Hutts. By the 11,100s BBY, the Republic's military expansionism had stalled and the Pius Dea leadership began launching internal inquisitions to root out apostates, heretics, and unbelievers within their ranks. These inquisitions created much hardship and deaths. Caamasi emissaries came to the Jedi stronghold of Ossus and succeeded in convincing the Order to end its recusal in 11,100 BBY."}, {"tag": "p", "text": "The Jedi subsequently coollaborated with the Caamasi and Alsakani to engineer a heresy within the Pius Dea adherents. In 10,967 BBY, these religious heretics announced themselves during the Renunciation, creating an internal civil war which wrecked the Republic. This allowed a broad anti-Pius Dea coalition led by the Jedi to assail the Pius Dea Republic. While much of the Republic Navy defected to join the Renunciates, the Pius Dea still maintained a large fleet of thousands of Cathedral ships which they used to wage warfare on their enemies. During the Seventh Alsakan Conflict in 10,966 BBY, the sect was militarily defeated during the Battle of Uquine when the Bureau of Ships and Services seeded the Pius Dea fleet with rogue navicomputer-codes, which caused much of the fleet to leap into hyperspace. Many of these Cathedral ships would remain trapped forever in the depths of unexplored space, unable to restart their engines."}, {"tag": "p", "text": "The Jedi took custody over the machinery of the Republic with Grand Master Biel Ductavis assuming the chancellorship. Meanwhile, all members of the sect were removed from all positions of power including the Galactic Senate and their Supreme Temple on Coruscant was destroyed. The Pius Dea gradually died out within a few generations and the faith was considered extinct by the time of the Galactic Alliance. Despite the defeat of the Pius Dea, interspecies tensions between the Human-dominated Core Worlds and the predominantly alien Rimward territories lingered for millennia. These lingering tensions would be exploited by Darth Sidious during his rise to galactic dominance during the last decades of the Galactic Republic and the Clone Wars. The Pius Dea Spaceport existed on Coruscant millennia later."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}