{"url": "Planetary_Defender_starfighter", "categories": ["Category:Legends articles", "Category:SoroSuub Corporation products", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Planetary Defender starfighter"}, {"tag": "p", "text": "The Planetary Defender starfighter, also known simply as the Planetary Fighter was one of the countless products of SoroSuub Corporation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Although the Planetary Starfighter was able to travel through space, it was not a space superiority fighter for military use. Rather, it was used for corporate security by customs forces. While the craft's roll was limited, it had excellent pitch, speed, and acceleration."}, {"tag": "p", "text": "The craft required a single pilot, however, its large cockpit had space for a second crewman to aid in in-flight maintenance of the ship's systems. Alternatively, this space could be used for cargo storage, making the fighter a superb choice for privateers without much gear, or for cargo specialist organizations."}, {"tag": "p", "text": "The Planetary Fighter had dual forward laser cannons and two launchers, each of which was armed with up to six concussion missiles. The craft was lightly shielded."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Tinoon Station at Tinoon used Planetary Fighters extensively."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Planetary Fighter was created by Totally Games for the 1999 LucasArts video game Star Wars: X-Wing Alliance. The initial design was rejected by LucasArts as the engine was similar to designs for vessels in Star Wars: Episode I The Phantom Menace. A portion of the original design was realized in the game as the Pinook fighter."}, {"tag": "p", "text": "The Planetary Fighter was given the more specific name of \"Planetary Defender starfighter\" by a picture caption in the Rebellion Era Campaign Guide but that book provided no other information on the model."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}