{"url": "Planet_Killer", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Demolitions", "Category:Superweapons"], "nodes": [{"tag": "h1", "text": "Planet Killer"}, {"tag": "p", "text": "The Planet Killer was a large, spherical superweapon designed to destroy the planet it was detonated upon. In the year 22 BBY, during the Clone Wars, the Planet Killer's designer attempted to sell the superweapon to the Confederacy of Independent Systems. Count Dooku, the leader of the Separatist movement, arranged for the Planet Killer to be tested on a planet home to a number of living organisms. However, unbeknownst to the Separatists, Jedi Master Mace Windu disabled the Planet Killer before it could be activated, and Dooku, considering the Planet Killer to have failed its test, had the superweapon's designer taken prisoner."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Planet Killer was a large, spherical superweapon and bomb that was theoretically powerful enough to destroy the entirety of the planet it was detonated upon. Upon explosion, the Planet Killer would supposedly generate a bright light and huge blast as it obliterated the planet. However, the superweapon's shell was not lightsaber resistant, and if the Planet Killer's detonator was removed, it could not be successfully activated."}, {"tag": "p", "text": "Set on top of a flat base, the Planet Killer stood several meters tall and wide. Four cone-shaped protrusions extended from and around the superweapon's midsection, and each ended in a smaller sphere. The Planet Killer was colored orange, gray, and white, and had yellow light originating from small slits that encircled the weapon's perimeter."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Planet Killer was created by a non-Human designer during the waning years of the Galactic Republic. In 22 BBY, five months after the Battle of Geonosis and the start of the Clone Wars, the Planet Killer's designer attempted to sell his creation to Count Dooku, the leader of the Confederacy of Independent Systems. To test the weapons' capabilities, Dooku arranged for the Planet Killer to have its power demonstrated on Omphalos, a world teeming with a variety of living organisms. Dooku had the Planet Killer deployed on the planet, with several of his B1-Series battle droids and a pair of B2 super battle droids guarding the superweapon. Meanwhile, Dooku and the weapon's designer observed the planet aboard a starship in orbit and waited for the weapon to be activated."}, {"tag": "p", "text": "However, the Republic discovered that the Separatists were going to decimate the planet, and dispatched Jedi Master Mace Windu and a number of clone troopers to prevent the Planet Killer's detonation. Despite having his LAAT/i gunship shot down and all of his troopers killed, Windu was able to singlehandedly fight past the Separatist battle droids guarding the Planet Killer. With his lightsaber, Windu cut into the Planet Killer and removed its detonator right before it was activated and disabled the superweapon. Unaware that the Republic had interrupted the test, Dooku believed that the Planet Killer was in fact inoperable after the planet failed to explode, and had the weapon's designer taken prisoner in retaliation. With the Planet Killer proven to be a failure, Dooku instead continued to pursue other means of developing an \"Ultimate Weapon.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Planet Killer's first and only appearance in Star Wars Legends was in the comic Run Mace Run, published in Clone Wars Adventures: Volume 2 on November 17, 2004."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}