{"url": "Aurebesh", "categories": ["Category:Canon articles", "Category:Incomplete lists", "Category:Alphabets", "Category:Aurebesh", "Category:Writing systems"], "nodes": [{"tag": "h1", "text": "Aurebesh"}, {"tag": "p", "text": "Aurebesh was a writing system used to transcribe Galactic Basic Standard, one of the most used languages in the galaxy. In the Outer Rim Territories, Aurebesh was sometimes used alongside Outer Rim Basic, another alphabet."}, {"tag": "h2", "text": "Examples of Aurebesh throughout the galaxy"}, {"tag": "p", "text": "Aurebesh text could be seen on the screens of various types of technology, including screens in the cockpits of N-1 starfighters, the Separatist facility known as Skytop Station, and inside macrobinoculars."}, {"tag": "p", "text": "During the Clone Wars, some clone troopers customized their armor with Aurebesh phrases. The back of clone trooper Ponds' helmet had the phrase \"Some guys have all the luck\" written in Aurebesh. Others got Aurebesh tattoos. Clone medic Kix, had the phrase \"A good droid is a dead one\" tattooed on the side of his head, although the tattoo was eventually covered up when he grew his hair out late in the war, while trooper Sketch had his initial, Senth, tattooed on his forehead. In the same vein, some Low Altitude Assault Transports were personalized with Aurebesh, such as the Spaceward Ho! and Lucky Lekku, both of which bore their names, and the Crumb Bomber, which bore the phrase \"LAUGH THIS OFF.\" The patrol transports used on Coruscant were emblazoned with the word \"POLICE.\""}, {"tag": "p", "text": "Establishments throughout the galaxy used Aurebesh signs to identify themselves, such as the Playland Theatre and Purple Werm. The Droid Spa on Coruscant used one such sign to show the services it provided. The sign read \"OIL CHANGES, RUST REMOVA MEMORY FLUSHING, POLISHING MOTIVATOR REPAIR, DE-FLUTTERING, RESTRAINING BOLT APPLICATION AND REMOVAL, GENERAL MAINTENANCE OVERHAULS, JUNK REMOVAL\" Several posters with Aurebesh text hung in Trueping's bar during the Clone Wars, including one for \"DJ RANGTHANG,\" and one for for Sy Snootles (also seen in the bar room) which read \"THE SY SNOOTLES SHOW.\" \"IN PERSON.\" \"SY SNOOTLES.\" \"SOMEWHERE ON CORUSCANT.\" \"FRI – SAT 12 – 4.\" \"SOLD OUT.\""}, {"tag": "p", "text": "The owner of Plop Dribble's had a tattoo on his right arm of a double-heart that read \"MOM\" in Aurebesh."}, {"tag": "p", "text": "Technical readouts used by the Galactic Republic during the Clone Wars were also written in Aurebesh."}, {"tag": "p", "text": "Wanted posters in the Jedi Archives on Coruscant were written in Aurebesh text.  Similarly, bounties in Aurebesh were posted on the walls of Chalmun's Spaceport Cantina, which contained such information as \"NIM MINDBEND\" – \"WANTED\": \"DEAD\" for \"KIDNAPPING, THEFT AND MURDER\" – \"REWARD: 120,000\"; OMAR TOGGS – \"WANTED\": \"DEAD\" or \"ALIVE\" for \"RACKETEERING AND EXTORTION\" – \"REWARD: 75,000\"; \"ZUG TASSIK\" – \"WANTED\": \"DEAD\" or \"ALIVE\" for \"MASS MURDER\" – \"REWARD: 800,000\"; \"SAVAGE OPRESS\" – \"WANTED\" for \"FLEEING THE SCENE OF A CRIME\" – \"REWARD: 550,000.\" Aurebesh wanted posters saw use into the Imperial Era. One such poster for Kanan Jarrus read \"WANTED:JARRUS, KANANSPECIES: HUMANGENDER: MALEHEIGHT: 1.9 MHAIR: BROWNEYES: GREENLANGUAGE: BASICWEAPONS: BLASTERLIGHTSABEROCCUPATION: UNKNOWNLAST KNOWN LOCATION:OUTER RIM TERRITORIES,LOTHAL SYSTEMWANTED FOR:THEFT OF IMPERIAL SUPPLIESRESISTING ARRESTASSAULTING OFFICERSPILOTING WITHOUT LICENSE.\""}, {"tag": "p", "text": "The electro-proton bomb, attached to Goji and Rod's bomber and dropped during the Battle of Malastare had a warning printed on the nose cone that read \"CAUTION ION DETONATOR.\" The body of the bomb had \"CODE SWITCH DESIGNATOR\" • \"POSITION 1\" • \"POSITION 2\" • \"POSITION 3\" • \"POSITION 4\" printed on it and on one of the tail fins, the words \"THIS IS FOR YOU DOOKU\" were handwritten."}, {"tag": "p", "text": "At Hondo Ohnaka's camp on Florrum, a huge piece of superstructure read  \"HONDO'S SALVAGE\" – \"PRICES SLASHED\" stenciled on it in Aurebesh. Meanwhile, around the time of the Bombing of the Jedi Temple Hangar, protesters carried Aurebesh signs that read \"THE JEDI ARE CORRUPT\" and \"STOP CLONING VIOLENCE!.\""}, {"tag": "p", "text": "During the Imperial Period, an Imperial officer used a monitor that listed the names of a number of prisoners in Aurebesh. The list of names included LADY M'Arshington and Cay Ploon Kett. The Empire also used Aurebesh on its propaganda posters, one of which bore the slogan \"PROTECTING LOTHAL\" – \"PROTECTING YOU\" Aurebesh text was also included in the TIE/D Defender Elite blueprints stolen by the Spectres."}, {"tag": "p", "text": "Jyn Erso's kyber crystal necklace had the words \"TRUST IN THE FORCE;\" these words were also the final ones Jyn's mother said to her."}, {"tag": "p", "text": "Thirty-four years after the Battle of Yavin, Aurebesh was written upside-down on a life vest worn by Poe Dameron, a member of an X-wing starfighter squadron bearing markings similar to those of the Alliance and reading \"Pull to Inflate.\""}, {"tag": "p", "text": "The credit symbol () resembled an Aurebesh letter R with two vertical strokes at the top."}, {"tag": "h2", "text": "Letters and numerals"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An Aurebesh-like script first appeared in the 1983 movie Star Wars: Return of the Jedi, the last installment in the original trilogy of Star Wars. It could be seen on the monitor readouts on the second Death Star at the beginning of the movie, when Darth Vader's shuttle is scanned while approaching the battle station. Erik Schroeder's decoding of the technical readouts further suggest that this readout is illegible, consisting of lines of character repeats. However, it was Stephen Crane of West End Games who gave each character a name and a corresponding Roman letter or letter combination. At the time, West End Games's flagship product was the Star Wars Roleplaying Game. While he was writing the Star Wars Miniatures Battles Companion in 1993, Crane decided to develop an alphabet for gamers to use. Upon receiving Lucasfilm's approval, Crane came up with the \"Aurebesh,\" a 34-letter alphabet. It was later expanded to include punctuation marks in Imperial Entanglements, a 1996 supplement to Miniatures Battles."}, {"tag": "p", "text": "Stephen Crane's alphabet was subsequently adopted in many Star Wars works, and even made its way into the movies. In 1999, a variant appeared in Star Wars: Episode I The Phantom Menace, on a readout screen of Anakin Skywalker's Naboo fighter. As Skywalker heads toward the battle, the screen reads: \"Anakin turn the ship around and go back home right away.\" Since the 2004 DVD release of Star Wars: Episode IV A New Hope, the words on the tractor beam control on the Death Star are now in the Aurebesh."}, {"tag": "p", "text": "Since April, 2014, most stories in which Aurebesh appeared are part of Star Wars Legends, previously known as the Expanded Universe, and are therefore not canon. However, as revealed in a \"Ghost Crew Identification Card\" available on the official site of Disney XD, the West End Games mapping of Aurebesh had been kept following the redefinition of canon, although the eight letters representing English digraphs were absent. However, the letters representing digraphs were later included in the 2015 children's book Star Wars Rebels: Battle Plans from Darth Vader and two of them appear in the canon comic Chewbacca 1, while one of them is printed on Ketsu Onyo's helmet in the Star Wars Rebels episodes \"Blood Sisters\" and \"The Forgotten Droid.\" Coca-Cola products are sold in special in-universe Aurebesh designs at the Star Wars: Galaxy's Edge attraction."}, {"tag": "p", "text": "Aurebesh punctuation, originally created for the Legends game accessory Star Wars Gamemaster Screen, Revised, is also used in Star Wars canon, and can be seen in several episodes of Star Wars: The Clone Wars and Star Wars Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}