{"url": "Plasma_detonator", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Gungan weapons", "Category:Plasma weaponry"], "nodes": [{"tag": "h1", "text": "Plasma detonator"}, {"tag": "p", "text": "Plasma detonators were a type of plasma weapon used by the Gungan species native to the planet Naboo. They consisted of a brown disc with a glowing yellow circle in the center. The disc was attached by several protrusions to a platform. A plasma detonator was positioned in front of each Gungan High Council member's seat in the Gungans' High Board Room in the city of Otoh Gunga."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Plasma detonators were a type of plasma weapon that were brown in color and consisted of a disc with an incandescent yellow circle in the center. The disc was suspended from a platform by a band that extended into two crest-like protrusions and then back into a disc-shaped seat."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Plasma detonators were used by the sentient Gungan species native to the planet Naboo. By 32 BBY, five plasma detonators were built into the raised platform upon which the Gungan High Council sat in the High Board Room in the underwater city of Otoh Gunga on Naboo. The detonators were placed in front of each one of the five council members' seats and were positioned so that they were trained on the platform where supplicants would stand before the council."}, {"tag": "p", "text": "The plasma detonators were in place in the board room when Jedi Qui-Gon Jinn and Obi-Wan Kenobi stood before the council while it was led by Boss Rugor Nass in 32 BBY. They were still in place in the board room in 20 BBY, when Boss Lyonie led the council during the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Plasma detonators first appeared in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. They were built as part of a one-eighth-scale miniature set of the board room that was used for the shots of council."}, {"tag": "p", "text": "The detonators were first identified in the new Star Wars canon in the 2016 reference book Star Wars: Complete Locations, but the name originated in the 2000 Star Wars Legends reference book Inside the Worlds of Star Wars: Episode I, which was written by Kristin Lund."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}