{"url": "Aurelant", "categories": ["Category:Canon articles", "Category:Draedans", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Aurelant"}, {"tag": "p", "text": "Aurelant, a Draedan male native to the aquatic world of Sesid, was born into a family with seventeen brothers and twenty-two sisters. During the Galactic Civil War, Aurelant led a crew of pirates as the captain of the Daggadol, a subaquatic vessel, which he used in his fight against the Galactic Empire's presence on the Draedan homeworld. When Leia Organa of the Alliance to Restore the Republic came to Sesid during Operation Yellow Moon, Aurelant and his crew helped the Rebel leader with her mission."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Missing a meeting"}, {"tag": "p", "text": "Aurelant was a Draedan male who led a resistance movement opposed to the Galactic Empire on his homeworld Sesid during the Galactic Civil War. Growing up as one of eighteen brothers and with twenty-two sisters, he was from a very small family by normal Draedan standards. One of his many brothers came to own a company that collected escape pods that had been fired from Sesid's surface and then recondition and refuel them for future use."}, {"tag": "p", "text": "Following the Battle of Hoth in the year 3 ABY, the Alliance to Restore the Republic began implementing a plan to distract the Empire from the gathering of its Alliance Fleet over the planet Sullust in preparation for what would be the Battle of Endor. Titled Operation Yellow Moon, the plan was for Princess Leia Organa and a small team of Rebels to travel to the Corva sector and meet with a series of local rebel assets and resistance leaders including Aurelant in an apparent recruitment run, while secretly planting a series of hyper-transceivers that would alert the Empire to the recruitment effort and the planned meeting point for the recruits, Galaan."}, {"tag": "p", "text": "Organa arranged to meet with Aurelant on a volcanic island slightly east of Sesid's main island chain, where she also hoped to plant the second of her transceivers. Aurelant and his crew, who were aboard the submersible vessel Daggadol, were forced to miss the agreed upon meeting due to a level of Imperial activity in the area consisting of stormtroopers on waveskimmers and the Imperial-class Star Destroyer Shieldmaiden in orbit"}, {"tag": "h3", "text": "Saving the princess"}, {"tag": "p", "text": "Organa and her crew were unaware of the Imperials, and headed to the island as planned. After waiting for Aurelant and giving up hope that he would come, the rebels attempted to leave the island but ran into the Imperials who gave chase. The waveskimmers quickly disabled the boat that Organa and her allies were traveling in, but before the stormtroopers could close in, Aurelant surfaced in the Daggadol from beneath the boat and opened fire on the Imperials, while opening the doors to let the rebels in."}, {"tag": "p", "text": "Not knowing it was Aurelant onboard the Daggadol, but having few other options, the princess and her allies boarded the submarine. Wanting to test Organa's courage, Aurelant at first pretended to be a pirate interested in claiming the bounty on her head, and demanded she make him a better offer. Organa questioned if he supported the Empire, and when he claimed not to she offered him and his men a place in the Alliance. Impressed with her display of bravery in the face of apparent danger, Aurelant revealed himself to the rebels and congratulated Organa."}, {"tag": "p", "text": "The princess explained that she needed to get off world to her yacht the Mellcrawler to continue her mission, and after ensuring that Organa's communications specialist Kidi Aleri and demolitions expert Antrot were capable of tuning his Horvax-16 transmitter, Aurelant revealed a plan to get her out safely past the Star Destroyer in orbit. Using his vast network of siblings, the Draedan would launch hundreds of the escape pods that were set up all over Sesid in case of emergency. The rebels would be able to reach their starship inside one of them undetected in the chaos. Organa would be able to escape, and the Draedans would profit thanks to his brothers deal with the Empire to recondition the pods. The escape worked as planned, and Organa and her allies were able to get to their ship without detection."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Aurelant was a massive Draedan with green skin and red eyes who stood a head taller than the rest of his crew. He had a toothy grin of brilliantly white teeth and arms crowded with pale tattoos. The captain considered his family of forty siblings shamefully small by the standards of his species and believed that no self-respecting Draedan would ever support the Empire. He bore some bias against other species, claiming that Organa was brave \"for a human\" and calling the Cerean Kidi Aleri a \"cone head\"."}, {"tag": "p", "text": "Upon first meeting Princess Leia Organa he initially concealed his identity and pretended to be a pirate interested in collecting the bounty on her so that he could gauge how brave she was based on her reaction. After she offered he and his men a place in the Alliance he was satisfied with her fearlessness and offered to help, reassuring his new allies that he would still benefit from aiding them via his brother's business."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Aurelant wore dozens of bracelets on his wrists and necklaces around his neck over a breastplate and red pauldron scavenged from a set of stormtrooper armor. He carried a heavy cutlass that hung at his hip on a brown belt worn over a pair of green pants. He captained the submersible vehicle Daggadol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aurelant first appeared in the 2015 canon novel Moving Target: A Princess Leia Adventure, written by Jason Fry and Cecil Castellucci."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}