{"url": "Platform_Classic", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Battles of Castilon", "Category:Events during the Cold War", "Category:Sporting events"], "nodes": [{"tag": "h1", "text": "Platform Classic"}, {"tag": "p", "text": "The Platform Classic was a major race held on the Colossus platform on the planet Castilon. For the Classic in 34 ABY, Captain Imanuel Doza, the platform's owner, invited famous racer Marcus Speedstar to participate."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "A brother wronged"}, {"tag": "p", "text": "Following the Galactic Civil War, Jarek Yeager and Marcus Speedstar became racing pilots who made their money by participating in starship races. While both were skilled pilots, Yeager was a more skilled racer than his brother. While Speedstar raced for money and fame, Yeager raced to support his family, which consisted of his wife and his daughter."}, {"tag": "p", "text": "During one race, Speedstar sought to increase his racer Galaxy's Glory's speed by injecting hyperfuel. However, Speedstar underestimated the power of his ship and clipped his brother's racer, sending his racer out of control. Yeager crashed his racer into a grandstand where his family were sitting, killing his wife and daughter. Grieving over the loss of his family, Yeager was unable to forgive his younger brother and severed relations with him."}, {"tag": "p", "text": "While Yeager settled down on the planet Castilon's Colossus platform where he ran a starship repair business, Speedstar continued his racing career. His companions were the Nikto Oplock and the black astromech droid R4-D12. He became a successful racing pilot and won the Five Sabers three times. However, by 34 ABY, he had fallen into hard times after losing a couple of races. Speedstar borrowed loans from the Guavian Death Gang, becoming indebted to the crime syndicate."}, {"tag": "h3", "text": "An icy homecoming"}, {"tag": "p", "text": "Seeking to bring revenue to the Colossus' economy following a pirate raid, Captain Doza invited Speedstar to compete in the Platform Classic. The price money for the competition was 100,000 credits. Knowing of Yeager's reputation as a racer, Doza also invited Yeager to take part in the race. However, Yeager refused to race with Speedstar since he was still bitter towards his brother for causing the deaths of his family."}, {"tag": "p", "text": "While visiting the Colossus, Speedstar tried to mend bridges with his older brother but Yeager refused to speak with him. Unaware of the history behind the fraught relationship, Yeager's employees Tamara Ryvora and Kazuda Xiono tried to convince Yeager to race against the famous champion. This angered Yeager who decided to confront Speedstar and convince him to pull out of the race. Meanwhile, Speedstar was visited by Guavian enforcers at Aunt Z's Tavern who took Oplock hostage in an effort to force Speedstar to pay his debts."}, {"tag": "p", "text": "At Aunt Z's Taver, Yeager challenged Speedstar to pull out of the race. However, Speedstar was unwilling to pull out since he wanted to pay his debts back to the Guavians in order to get back friend Oplock. Yeager's plan backfired when several customers began putting bets on the two brothers. Yeager reluctantly agreed to take part in the Platform Classic and the two brothers prepared their racers."}, {"tag": "h2", "text": "The race"}, {"tag": "h3", "text": "The obstacle course"}, {"tag": "p", "text": "On the morning of the race, both Yeager and Speedstar climbed into their racers. They were accompanied by their droids Bucket and R4-D12 respectively. Other competitors included Ace Squadron members Torra Doza, Hype Fazon, Bo Keevil, Griff Halloran, and Freya Fenris. Prior to the race, Kaz tried to convince Yeager to make peace with his brother and told him that his brother was racing to save his friend Oplock. Still bitter over the loss of his family, Yeager said he did not care."}, {"tag": "p", "text": "While waiting for the countdown, Yeager taunted Speedstar over the comlink about his droid. Following a verbal exchange, Speedstar told Yeager that he come to the Colossus not only to race but to reconcile with his brother. Yeager responded that his brother had lost him a long time ago. During the first phase, Speedstar took the lead and flew through three hoops. He was followed by Yeager and the other racers."}, {"tag": "p", "text": "During the obstacle course, Halloran fired stun bolts at Keevil's racer, causing it to crash into the sea and Halloran to move up to fifth place. The fighters then entered the second phase which involved at atmospheric climb into space. While ascending to space, Yeager told Speedstar he could never forgive him. Speedstar responded that he had been trying to speak to his brother for years."}, {"tag": "h3", "text": "A change of heart"}, {"tag": "p", "text": "The racers then entered the third phase which involved flying through an ion ring that temporarily disabled the ships and descending powerless into Castilon's atmosphere. The exchange continued with Yeager blaming Speedstar for the loss of his family. As the ships descended back into the lower atmosphere, they entered a reignition hoop, which reactivated their engines."}, {"tag": "p", "text": "During the descent phase, Yeager entered the reignition hoop first followed by Speedstar. Halloran tried to ram Speedstar's racer but the racer made it through the hoop and reignited his engines. Halloran was forced to bail out of his fighter, allowing Fenris to move up the ranks to fifth place. During the last leg, Speedstar apologized to Yeager over the intercom for causing the deaths of his family. He also told Yeager that he needed to win this race so that he could use the prize money to save his friend Oplock."}, {"tag": "p", "text": "Seeking to bury the hatchet with his brother, Yeager pulled his racer out of the race, allowing Speedstar to charge through the final hoop and win the race. The announcer Jak Sivrak announced Speedstar as the winner."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the Platform Classic, Speedstar used the prize money of 100,000 credits to settle his debts with the Guavian Death Gang and to free his friend Oplock. Despite Yeager losing the race, the two brothers reconciled since Yeager realized that Speedstar was not solely concerned with money and fame but also cared for his friends. Yeager and his Team Fireball watched as Speedstar and his team departed on their racer Galaxy's Glory."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Platform Classic first appears in the Star Wars Resistance Season One episode \"The Platform Classic,\" which premiered on November 25, 2018."}, {"tag": "h3", "text": "Non-canon history"}, {"tag": "p", "text": "In the non-canonical game Star Wars Resistance Racer, the Platform Classic Cup is a multi-round race that can be raced by Kazuda Xiono or Tamara Ryvora. In the game, the Platform Classic Cup involves flying through sky rings over Castilon while avoiding obstacles. The first round of the race involves racing against Torra Doza, the second round races against Bo Keevil, the third round races against Hype Fazon, the fourth round races against Griff Halloran, and the fifth round races against Freya Fenris. The winner of the Platform Classic Cup is then allowed to move onto a more difficult race, the Castilon Run Cup."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}