{"url": "Plawal_Rift", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Belsavis locations", "Category:Canyons"], "nodes": [{"tag": "h1", "text": "Plawal Rift"}, {"tag": "p", "text": "Plawal Rift was a valley on the planet Belsavis."}, {"tag": "p", "text": "The quiet, humid community of Plawal was located between steep cliffs of red-black rock. The leader of Plawal, known as Chief Person was a Mluki named Jevax. Rock \"benches\" leading up to the cliff walls provided a narrow foundation for homes and orchards but most buildings there were constructed from prefabricated units and crammed together on small lots due to the rift's enclosed area. Residences in the old city were constructed directly over warm springs which meant a thick, sulfur-smelling mist would permeate the valley and restrict visibility to just a few meters."}, {"tag": "p", "text": "Flora in the Plawal Rift included starblossoms, sweetberry vines, aphor trees, orchids, hanging moss, spider plants, shalamantrees, ferns, and Wookiee-beard. Fauna included mooklas, salamanders, phosphor bugs, frogs, pittins, pellata birds, manolliums brought from Ithor, watch-critters, and the insectile kretch that infested Plawal's tunnels."}, {"tag": "p", "text": "The Jedi Master Plett built a house and laboratory in the Plawal Rift that served as a safe haven for Children of the Jedi hiding from the Great Jedi Purge. In 18 BBY, Palpatine commissioned the battlemoon Eye of Palpatine to wipe out the Jedi enclave but the ship never arrived. Palpatine's small backup force of interceptors bombed Plawal but were wiped out by Belsavis' Y-wings, and the Jedi departed for places unknown-- after erasing all knowledge of their presence from the inhabitants of the city. After their departure, Brathflen, Galactic, and Imperial/Republic arrived to dome the valley and cultivate vine-coffee and vine-silk. Nubblyk the Slyte began blasting landing pads on the glaciers around this time, and the smuggling trade began in earnest. A small force of tariff police left by the region's Imperial Governor were little use against the smugglers. Brathflen built the first of the light-amplification domes over Plawal (based on Plett's original design) before the Battle of Yavin, and the three companies teamed with Kuat to install a central computer system. About a year after the Battle of Endor, the Slyte disappeared and was replaced by his associate Bran Kemple, which caused the Belsavian smuggling industry to dry up."}, {"tag": "p", "text": "In the same year, Roganda Ismaren (one of the Emperor's Hands) came to Plawal. Han Solo and Leia Organa Solo visited Belsavis eight years after the Battle of Endor and uncovered a plot by Roganda Ismaren to forge a military alliance with the Senex Lords."}, {"tag": "h2", "text": "Jedi hidden in the Rift"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}