{"url": "Auren_Yomm_Baobab", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Character stubs", "Category:Females", "Category:Humans", "Category:Resistance fighters", "Category:Umboo Racing Team members"], "nodes": [{"tag": "h1", "text": "Auren Yomm Baobab"}, {"tag": "p", "text": "Auren Yomm Baobab (pronounced /AW-ren YOM BAY-oh-bab; IPA: /ˌɔ.ɹɛn ˈjɑm be(i).o.bab/) was a Human female from the planet Roon. The daughter of Nilz and Bola Yomm, by the age of fifteen, Auren Yomm was an accomplished athlete and served as the leader of the Umboo Racing Team during the Roon Colonial Games of 15 BBY. It was during this time that she met and befriended Mungo Baobab, whom she would later marry, and his two droids, R2-D2 and C-3PO."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A native of Umboo, a sovereign province on the Outer Rim planet of Roon, the Human female Auren Yomm was born in the year 30 BBY to Nilz Yomm, a local doctor, and his wife, Bola. An accomplished athlete by age fifteen, she specialized in the drainsweeper event, a three-stage relay race performed while riding rockhoppers, during the Roon Colonial Games of 15 BBY. While on their way to the Games, Auren and her father Nilz witnessed the crash of a cloudcraft piloted by Mungo Baobab, a merchant from the planet Manda. Rescuing Baobab and his two droids, R2-D2 and C-3PO, from a pack of meddlesome, albeit benign mudmen, Auren invited the off-worlders to accompany her and her father to the Roon Games, where they would be able to find somebody to repair their ship."}, {"tag": "p", "text": "Her original team composed of her friend Gee Long and the droid BIX. Governor Bisad Koong of Tawntoom province attempted to sabotage them by eliminating Long and Bix from the competition, but Mungo Baobab and C-3PO raced in their place and won the championship with Auren. Later, Koong poisoned Umboo province with a chemical agent called rooze. As Auren and her father were accompanying Mungo and his droids to the Pinnacles of Felth, they were not affected by the poisonous chemical, but Auren's mother Bola fell prey to the attack and became ill. Due to a malfunction on his ship, Koong also fell ill from rooze poisoning and tasked Gaff with kidnapping Nilz Yomm, who was a doctor, and his daughter in order to create an antidote. Meanwhile, Mungo Baobab, C-3PO, and R2-D2 tracked Governor Koong to the Fortress of Tawntoom, where Auren and her father were being held captive. After their rescue, the Yomms escaped the Tawntoom as Koong's fortress froze and as Koong himself dematerialized as a result of the rooze."}, {"tag": "p", "text": "Sometime after their adventures on Roon, Auren Yomm and Mungo Baobab were married and took up residence on the planet Quilken."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}