{"url": "Auric", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic starships", "Category:YT-1760 small transports"], "nodes": [{"tag": "h1", "text": "Auric"}, {"tag": "p", "text": "The Auric was a Rebel Alliance YT-1760 Small Transport active during the Galactic Civil War. Piloted by Commander Lina Graf, the Auric had a five member crew that included the technician Skritt, Lieutenant Thom Hudd, the former bodyguard droid XM-G3 and Graf's long-time companion, the droid CR-8R. The ship was forced to crash-land on Mustafar after taking damage during a mission, where it sank into lava and was destroyed."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While on a mission to the Outer Rim, the Auric's crew found themselves pursued by a group of three TIE fighters. Serving as the ship's gunner, XM-G3 successfully destroyed the enemy fighters, but not before they took out the Auric's shields and power core, along with the port thruster. With these critical systems out, Lina Graf was forced to make an emergency landing on the Imperial-controlled volcanic planet of Mustafar. The Auric landed in one of Mustafar's lava fields and quickly overheated, forcing the crew to evacuate, despite warnings from CR-8R. After the ship had been evacuated, it sank into the lava and was destroyed, leaving the crew stranded on Mustafar."}, {"tag": "p", "text": "Years later, while serving as Head Curator of the Graf Archive, Lina Graf recorded in her journal that her experience on Mustafar was the most frightening of all her adventures."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Auric first appeared in the 2018 comic Star Wars Adventures: Tales from Vader's Castle 1. Notably, the ship shares its name with Auric Graf, the father of its captain Lina Graf. The Auric marks the first canon appearance of the YT-1760 small transport, a ship that was previously exclusive to Star Wars Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}