{"url": "Pliith", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Botanical sentient species", "Category:Pliith"], "nodes": [{"tag": "h1", "text": "Pliith"}, {"tag": "p", "text": "The Pliith were a sentient species of plants. Lacking independent locomotion, the species was dependent on other species for movement. Their plant-like physiology required substantial amounts of sunshine, together with rain and fertilizer. A notable Pliith was Linkaas, president of Linkaas Corporation. Ruthless in his business endeavors, he tried to have his courier Dannen Lifehold killed so that he could retain the starship he had exchanged with the Human for a substantial debt. That plan was thwarted, however, and Lifehold fled his employ."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A sentient plant species, the Pliith were largely immobile—although they could twist and bend their body—and remained rooted in fertilizer; consequently, they had to be wheeled around by other species for locomotion. The Pliith species required plentiful sunshine to remain healthy. When such lighting was limited, as it was during extended periods of rain on Evas VI, the species utilized sunlamps as a less effective alternative. The Pliith had numerous fronds that could rapidly change color to purple when angry. They had expressive eyes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Pliith were part of the wider galaxy by at least 1 BBY when the Pliith Linkaas served as president of Linkaas Corporation. Based out of the Mid Rim world Evas VI, he had operations on other Mid Rim planets, such as Dohu VII. Linkaas was involved in criminal activities, such as spice trading and slavery. He used coercive techniques to keep his workforce indebted to him. The president took a ruthless approach to failure, on occasion executing workers for their falling short of goals."}, {"tag": "p", "text": "One of his employees was the Human smuggler Dannen Lifehold. Lifehold was supplied a starship, the Lifeline, and was to work as a courier for Linkaas until the ship debt was paid off. However, on what was to be his final run to repay his debt, Linkaas arranged for a number of his thugs to ambush the Human while on the planet Dohu VII. Lifehold managed to escape, however, gaining the friendship of a Tinnell named Purr. When confronted by Lifehold over subspace comm, Linkaas denied any culpability in the assault, but as the cargo was lost during the encounter, insisted that Lifehold was still indebted to him. When he glimpsed the Tinnell, however, he offered to forgive Lifehold his debt in exchange for possession of Purr. Tinnell were renowned for their technical genius, but rare in the galaxy, and Linkaas wanted to study the species. However, Lifehold refused the deal and foiled a final assault on his life. He then quit his employment and fled from the Pliith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Pliith were created by Dave Marron for his short story Breaking Free: The Adventures of Dannen Lifehold. Initially published in the Star Wars Adventure Journal 1 in 1994, the story was later republished at StarWars.com in 2004 as part of their Hyperspace feature. Linkaas, the sole representative of the Pliith species in Star Wars canon, lived on Evas VI; however, this is not specified as the species' homeworld."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}