{"url": "Plot_to_assassinate_Satine_Kryze/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Assassination attempts", "Category:Battles of the Clone Wars", "Category:Battles of Coruscant"], "nodes": [{"tag": "h1", "text": "Plot to assassinate Satine Kryze"}, {"tag": "p", "text": "In 21 BBY, a lone assassin representing the Mandalorian Death Watch attempted to assassinate the Duchess of Mandalore, Satine Kryze. The first attempt was when Satine was leaving the Senate Building in her speeder that was sabotaged. The second attempt was in the lower levels of Coruscant. While Satine was meeting her contact, he was shot and she became the suspect. She was running from Republic authorities as well as her assassin. Eventually, Jedi Master Obi-Wan Kenobi was able to meet up with her to help her."}, {"tag": "h2", "text": "The plot"}, {"tag": "h3", "text": "First attempt"}, {"tag": "p", "text": "Satine left the Senate Building in her private airspeeder escorted by her guards and pilot Aramis. Mid-flight, a Death Watch assassin watching from below set off a detonator attached to the vehicle. Now almost completely out of control, her pilot maneuvered towards a landing platform for Satine to jump onto. She and her guards landed safely, only to see the speeder smash into a building and erupt into a fireball seconds later."}, {"tag": "h3", "text": "Second attempt"}, {"tag": "p", "text": "Satine met secretly with her contact from the Republic Ministry of Intelligence, Davu Golec, in the lower levels of Coruscant. He delivered her a disc that contained the original recording of the message Deputy Minister Jerec created, not the altered version the Senate had seen earlier. A Death Watch assassin who had followed Golec there took aim and shot him, but did not manage to kill Satine due to the inadvertent interference of a police probe that came to respond to the scene. Mistaking her droid deactivator for a blaster, it erroneously identified Satine as the culprit. A chase ensued, but the Duchess eventually lost the Republic authorities."}, {"tag": "h3", "text": "Third attempt"}, {"tag": "p", "text": "After escaping Republic authorities, Satine contacted and met up with Obi-Wan Kenobi for help. On her way to their meeting place, the assassin continued to follow her. Once the target and Jedi were in an alley, the assassin, now on a rooftop, tossed down a thermal detonator. Kenobi noticed the explosive and pushed Satine out of its range before he himself dove to safety, all moments before it went off. He jumped down from the rooftop and began to walk slowly towards the Duchess with blaster in hand to finish her off, but Kenobi interfered, drawing the assassin's attention to him. Kenobi was later able to pass through republic security when Satine turned herself in. Kenobi then presented the message to Satine's new friend, Padmé Amidala, who presented the message before the senate, thus saving Mandalore from a Republic occupation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}