{"url": "Ploovo_Two-For-One/Legends", "categories": ["Category:Legends articles", "Category:Articles with unencyclopedic tone", "Category:Articles with elements from unlicensed sources", "Category:Crime lords", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ploovo Two-For-One"}, {"tag": "p", "text": "Ploovo Two-For-One was a Human male crime lord who operated on Etti IV. He hired Han Solo and Chewbacca as smugglers and employed Alara Fax after she was thrown out of the SoroSuub Business Academy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ploovo got his start as a low-level loan shark under the crime lord Jigoba, from whom Ploovo learned the art of swindling one's own employees. When Jigoba died, Ploovo fled to the Corporate Sector with as many profits as possible before Jabba the Hutt's organization filled the void. He began muscling his way into the Sector's nightclub circuit, first as a silent partner, later stepping up as outright boss. As he bought up many of the seedier clubs on major trade worlds, his power and influence grew, and soon he had a hand in the vast majority of protection rackets and loan sharking efforts within Corporate Sector space. At some point, Ploovo also worked as a bunko-steerer out of the Cron Drift."}, {"tag": "p", "text": "Around 5 BBY, rival loan shark Thar Lasan of the Corporate Sector died in mysterious circumstances, but it was suspected that Ploovo was involved in the demise. Lasan's organization, including Klatooinian mercenary Beatas and other assets, were assimilated in Ploovo's."}, {"tag": "p", "text": "Ploovo used a small group of criminals to collect money from debtors; Ploovo's Protocol Team, as it was known, was considered a threat by the Rebel Alliance."}, {"tag": "p", "text": "In 2 BBY, when Solo and Chewbacca required additional repairs after the Millennium Falcon was improperly fixed by Big Bunji, they acquired a considerable debt to Ploovo, which Solo eventually paid off … on his own schedule. After a gunrunning deal on Duroon went bad for Solo due to Ploovo betraying him to the Corporate Sector Authority, Solo acquired a dinko and included it with his payment to Ploovo; the dinko attacked Ploovo, biting his thumb and drenching him in the dinko's characteristically foul odor."}, {"tag": "p", "text": "The Corporate Sector Authority Security Division preferred Ploovo's presence in the Corporate Sector to bigger, more independent operations such as those of Talon Karrde or Jigoba, and thus to a certain extent tolerated his presence. He was regarded as too subtle, even timid, to be effective in the Empire, and he avoided getting his hands dirty personally, turning more unsavory work over to affiliated gangs. He was also regarded as lacking taste, despite his large collection of fake-gemstone pinky rings. However, he nonetheless had begun to use his Corporate Sector power base to expand into the rest of the Empire."}, {"tag": "p", "text": "Ploovo never got over the damage done to him by the dinko Han gave him, and for a time paid for people to bring him dinkos, dead or alive. He displayed stuffed specimens of the vicious creatures in his homes, his offices, and his ships. He also began wearing a bracelet of their fangs as a charm."}, {"tag": "p", "text": "After Alara Fax was thrown out of the SoroSuub Business Academy, she and other beings were hired by Ploovo Two-For-One for a time. This business relationship eventually ended, however, and Fax created her own company named Fax Ventures."}, {"tag": "p", "text": "After the Imperial Captain Sodarra was rescued by Han Solo some weeks after the Battle of Yavin, he claimed that he and his men had stolen a prototype cloaking device to sell to Ploovo Two-For-One and were betrayed, but it was a ruse while they recovered Darth Vader."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ploovo Two-For-One first appeared in the novel Han Solo at Stars' End."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}