{"url": "Plo_Koon/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Pages needing citation", "Category:Chefs", "Category:Jedi aces", "Category:Jedi Generals", "Category:Jedi Guardians", "Category:Jedi Purge victims", "Category:Kel Dor", "Category:Males", "Category:Pilots", "Category:Post-Ruusan Jedi High Council members", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Plo Koon"}, {"tag": "p", "text": "Plo Koon was a Kel Dor male from the planet Dorin who became a Jedi Master and a lifetime member of the Jedi High Council, holding the position from after the Stark Hyperspace War to the end of the Galactic Republic in 19 BBY. During the Clone Wars, Koon served as a Jedi General in the Grand Army of the Republic, leading soldiers in campaigns, fighting on Geonosis and at Kaliida Shoals amongst others. Koon was also an accomplished starfighter pilot."}, {"tag": "p", "text": "Koon had an uncle and a niece, Sha Koon, who was also a member of the Jedi Order, and served as a personal communicator between the Jedi strike force and the rest of the Republic during the Stark Hyperspace War. He was a close friend of fellow Masters Qui-Gon Jinn (whom he fought alongside during the Stark Hyperspace War), Micah Giiett, Ki-Adi-Mundi and noted fighter pilot Saesee Tiin."}, {"tag": "p", "text": "Plo Koon was shot down over Cato Neimoidia by his clone troopers, killing him in compliance with Order 66."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Native to the planet Dorin, homeworld of the Kel Dor species, Koon was accustomed to breathing in an atmosphere containing little oxygen, forcing him to wear an antiox breath mask when abroad. Born into a family strong in the Force, Koon's own Force-sensitivity was discovered early and he was turned over to the Jedi Order early on in his infancy for training. Like his uncle before him, Koon was trained at the Coruscant Jedi Temple's academy for most of his childhood years, eventually passing the Initiate Trials and becoming eligible to be selected as a Padawan. Selected by the esteemed Jedi High Council member, Jedi Master Tyvokka, Koon had a reputation for making quick and clear distinctions between right and wrong. Often taking swift, decisive action with little or no thought of repercussions; this attitude, combined with Koon's sarcastic wit, often tried the patience of his Jedi Master."}, {"tag": "p", "text": "Eventually Koon's niece, Sha Koon, was also discovered to be eligible for training and was inducted into the Order. While not shirking the Jedi rules of attachment, they did have a meaningful relationship, sharing insights with each other and forming a strong bond. After years of study with Master Tyvokka, Koon was ready to take the Trials of Knighthood, eventually completing them successfully and being elevated to the rank of Jedi Knight by the High Council."}, {"tag": "h3", "text": "Jedi Knight"}, {"tag": "p", "text": "Remaining close with his former master, Koon studied as a Jedi Guardian independently, taking on missions that often required that he demonstrate his skill with a lightsaber, rather than diplomacy. Additionally, Koon would return to his homeworld at some point in his career, studying the ways of the Baran Do and earning a place in their order. After years of hard work and service, Koon's former master approached him with an offer to join the ranks of the High Council. Humbly declining in favor of a stronger mind, like that of his friend Qui-Gon Jinn, Jedi Koon did accept a mission that Tyvokka was leading on the world of Troiken."}, {"tag": "p", "text": "Acting as diplomats for the Galactic Republic, Koon and the other Jedi were to negotiate peace between the Trade Federation and the pirate Iaco Stark. Stark had been stealing bacta supplies from cargo vessels and selling them at lower prices than the Trade Federation could afford to offer, forcing the Federation to petition the Galactic Senate to intervene on their behalf.However, some factions in the government wanted more decisive action, and they organized an attack on Stark's forces, which caused the negotiations to degenerate into a firefight. Plo Koon watched in disbelief as Tyvokka was killed in the crossfire. Koon was by his master's side as he died, Koon devastated by his loss."}, {"tag": "h3", "text": "Stark Hyperspace War"}, {"tag": "p", "text": "After his master's death in 44 BBY, Koon rallied the forces of the Republic and led them to a miraculous victory in the ensuing conflict with fellow Jedi Luminara Unduli, which came to be known as the Stark Hyperspace War. The Republic won the war, and this triumph made Plo Koon a hero of the Republic. During the battle, Koon befriended a Republic soldier named Jace Dallin, who later spoke of Koon's bravery and humility during the war."}, {"tag": "h3", "text": "Jedi High Council"}, {"tag": "p", "text": "Following his decisive victory over Iaco Stark, Plo Koon was promoted to the rank of Jedi Master and was given a life-time seat on the Jedi High Council in honor of his Master's dying wish. While on the Council, Koon formed a very close friendship with fellow Council member Micah Giiett and went on many adventures with him. Their constant verbal sparring made them appear as rivals, but those close to the two Jedi Masters understood that they were indeed good friends."}, {"tag": "p", "text": "Giiett and Koon were responsible for the release of the chef Slabba Drewl from the clutches of Corpo the Hutt on Ord Mantell. In a cooking contest with Corpo's kitchen droid MREM-02, Giiett was able to distract the audience while Koon swapped the droid's ingredients with volatile substances such as Rakririan Burnout Sauce. When judged, Giiett's Squirmer Stew, though average, was enough to win the competition and release Drewl."}, {"tag": "p", "text": "During a mission to Shili, Plo Koon found an infant, Force-sensitive Togruta named Ahsoka Tano. Taking her to the Temple for training, he kept an eye on her progression through the academy, nicknaming her \"Little Soka\" and maintaining a close bond with her. By the time of the Yinchorri Uprising, Koon took a permanent seat on the Council of Reconciliation with Oppo Rancisis. During the uprising in the Yinchorri system, Masters Koon and Giiett led a party of Jedi in search of the Yinchorri rebels' secret base of operations. Finding nothing on Yibikkoror's floating city, the team met up with the other two groups on Yinchorr. With Jedi Lilit Twoseas and Padawan K'Kruhk fighting alongside Koon, the Kel Dor Jedi agreed to get the other Jedi offworld while a dying Master Giiett sacrificed himself during their escape. In honor of his fallen friend, Koon took over the training of Giiett's Padawan, Bultar Swan and eventually saw her rise to the rank of Knight."}, {"tag": "p", "text": "When the High Council discovered that the terrorist group known as the Jin'ha were synthesizing cortosis ore on the planet Obredaan, Masters Koon and Eeth Koth were dispatched to investigate and put an end to the production of the illegal substance. After their transport was destroyed, the two Masters were captured; the Council immediately sent Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi when they lost communications with the two Councilors. Master Jinn was able to locate the Masters in a holding facility and released them, joining his Padawan at the synthesizing facility to defeat the terrorists there. After the fighting and the destruction of the facility, Koon joined his comrades in witnessing a Trade Federation gunship fly over the planet, suggesting a link between the Jin'Ha and the Trade Federation. Koon later had a training duel with Kenobi in the Jedi Temple, with Kenobi proving successful."}, {"tag": "h4", "text": "Battle of Naboo"}, {"tag": "p", "text": "While one of the High Council's most valued members for his knowledge and combat experience, Koon remained silent at most meetings; rarely joining in debates and simply listening to the deep discussions of his peers. During this time, Koon took on the Trandoshan Padawan Lissarkh, training her in the ways of the Force. Plo Koon was present when his friend Master Jinn reported his suspicions that the Sith Lords of the past were not extinct as once thought, but rather in hiding and preparing to reveal themselves. Additionally, Jinn claimed to have discovered a vergence in the Force, the Chosen One of prophecy: Anakin Skywalker. The Council was skeptical of the boy's suitability, and Jinn's usual headstrong attitude did nothing to help matters. Before the Council came to a final decision, Jinn was killed on Naboo by a Zabrak assassin whose training in the dark side of the Force made Jinn's assertion of the return of the Sith incontrovertible. Traveling to Naboo with half the Council for Jinn's funeral, Koon and the other Councilors allowed Skywalker to be trained as a favor to Jinn's memory."}, {"tag": "h4", "text": "Negotiations on Malastare"}, {"tag": "p", "text": "Shortly after the Battle of Naboo, Plo Koon traveled with fellow Jedi High Council members Mace Windu, Yaddle, Adi Gallia, Even Piell, Ki-Adi-Mundi and Mundi's Padawan, A'Sharad Hett to Malastare to negotiate a truce between the Lannik royals and a terrorist group known as the Red Iaro. He gave A'Sharad Hett some advice on how he could spend time by looking at the artwork that was all around them. After the first meeting the Jedi were offered a lift back to their quarters by the Lannik adviser called Hutar Zash. Zash and the Lannik pilots unexpectedly turned on the Jedi and attempted to kill them. After defeating them, Yaddle flew them down to Windu, Gallia and Piell who were falling through a podrace. The Jedi speculated that the terrorists planned to kill the Lannik Prince and made for his building. They crashed through the building just before the Prince was eaten by an akk dog. Plo Koon attempted to stop the Red Iaro leader, Myk'chur Finux Zug, but he activated his jetpack and flew through the hole the Jedi had made when they crash landed; however, he was instantly killed by a podracer."}, {"tag": "p", "text": "Partnering with Master Gallia, Plo Koon accompanied Master of the Order Mace Windu to the world of Kiffex in order to rescue Jedi Quinlan Vos. Vos, who had been sent to stop a powerful Dark Jedi called Volfe Karkko weeks before, had lost contact with the Temple and in apparent need of rescue. Warned off by Sheyf Tinté Vos, the Jedi landed none the less and were relieved to find Vos victorious after his confrontation with the Anzati Dark Jedi."}, {"tag": "p", "text": "Plo Koon remained on the High Council for the next decade, witnessing a growing public discontent with the galactic government and the Jedi Order. A splinter group known as the Confederacy of Independent Systems emerged, led by a former Jedi who had now taken the name Count Dooku. At the same time, a group calling itself the People's Inquest began enlisting support for a motion that would have forced the Jedi Order to be more accountable to the government. Plo Koon himself was forced to defend the Temple from the group, persuading them to disperse after a minor incident in the public atrium."}, {"tag": "p", "text": "When an assassination attempt on Senator Padmé Amidala's life caused an uproar in the Senate, Supreme Chancellor Palpatine held a meeting with representatives of the High Council and the Loyalist Committee—a meeting which Koon attended alongside Masters Windu, Ki-Adi-Mundi, Yoda, Kit Fisto, Luminara Unduli and her Padawan, Barriss Offee. Soon after, Koon was present to receive a coded message from Obi-Wan Kenobi, who was trapped on the world of Geonosis and taken captive by the leaders of the Confederacy of Independent Systems. This act set in motion a series of events that would lead to the start of the Clone Wars."}, {"tag": "h3", "text": "Clone Wars (22 BBY–19 BBY)"}, {"tag": "h4", "text": "Battle of Geonosis"}, {"tag": "p", "text": "Accompanying Master Windu to Geonosis as part of a massive task force of Jedi, the group charged across the plains of Geonosis to rescue Jedi Obi-Wan Kenobi, Padawan Anakin Skywalker, and Senator Padmé Amidala. Duelling his way through legions of battle droids at the Petranaki arena, Koon joined with Ki-Adi-Mundi and several other Jedi in raiding the Droid Control Ship that appeared to control all of the droids on the planet. Unfortunately for them, the CIS had a backup control device, and Koon and Mundi were captured. They were marched to the execution arena where the surviving Jedi awaited a seemingly imminent death. Koon was rescued from certain death by the newly discovered Grand Army of the Republic, a secret clone army developed for the Republic without the authorisation of the Senate or the High Council. Plo Koon would rally his new troops on the fields outside the arena, leading them into the first battle of the Clone Wars."}, {"tag": "h4", "text": "Brentaal IV"}, {"tag": "p", "text": "Returning to the Temple on Coruscant to beginning planning war strategy and military movements, Koon was made a General with in the Grand Army and given control of a fleet of ships. One of his most distinctive early commands was the Battle of Brentaal IV, where he advised Shaak Ti and Agen Kolar from orbit, leading the Republic to victory over Commander Shogar Tok. Serving alongside Master Gallia on many early missions, they rescued Senator Bail Organa from pirates and aided Jedi Skywalker and Master Mundi in locating Master Kenobi and ARC trooper Alpha-17 on Varonat."}, {"tag": "p", "text": "Early in the war, Koon and fellow High Council member Kit Fisto encountered the bounty hunter Durge while attempting to quell an inmate uprising at a galactic prison. Temporarily sealing Durge in the catacombs beneath the prison with the help of one of the inmates, the Jedi bargained with their new found comrade. For his cooperation in helping in the ending of the riots, the Jedi would petition for his early release and the lessening of the sentences of those prisoners who accommodated the Jedi."}, {"tag": "p", "text": "Serving as chief negotiator during the Battle of Rendili, Koon was monitored by Masters Saesee Tiin, Obi-Wan Kenobi, and Anakin Skywalker. Koon was joined by Captain Jan Dodonna when he boarded a Rendili Dreadnaught to open peace talks with his old comrade, Jace Dallin. During the negotiations Lieutenant Mellor Yago of the Rendili Home Defense Fleet arrived along with a security force to take command, placing Dallin, Koon and Dodonna under arrest. Because Yago was planning to turn the Republic fleet over to the Separatists, Master Tiin was prepared to open fire on all of the Dreadnaughts to prevent them from falling into enemy hands. However, Jedi Skywalker was able to lead a crippling attack against the fleet until Masters Kenobi and Vos could rescue the captive Republic officers and Jedi and kill Yago and his men, taking the ships for the Republic."}, {"tag": "h4", "text": "Battle of Gwori"}, {"tag": "p", "text": "Along with Master Tiin, Koon commanded the Republic armada during the Battle of Gwori. Koon and Tiin waited above the planet while Skywalker, Kenobi and Ahsoka Tano led a command unit of clone troopers to infiltrate Gwori's tight security system and pinpoint the location of their Separatist ship production facilities. When Tano commed in the location of their target, Koon and Tiin undertook a previously unperformed maneuver: a hyperspace jump in-between the Separatist fleets and the planet below. Stunningly, they executed the move with no casualties and successfully destroyed the Separatist facilities in a series of runs, rescuing Skywalker, Kenobi and Tano in the process."}, {"tag": "h4", "text": "The Malevolence crisis"}, {"tag": "p", "text": "In 21 BBY, Plo Koon later led a patrol fleet of three Venator-class Star Destroyers to discover an unknown Separatist super weapon that had killed many fleets of cruisers and left no survivors. During the Battle of Abregado, the Malevolence, commanded by General Grievous, wiped out his patrol fleet leaving the Kel Dor, Commander Wolffe, Sergeant Sinker and Boost trapped in an escape pod. Koon and the survivors held off the \"Pod Hunter\" that destroyed all other pods, and were picked up by Skywalker and Tano in the Twilight after Tano, drawing on her close friendship with Master Koon, was able to sense his life force amongst the debris. After being rescued, the group managed to evade a wave from the deadly ion cannons of the Malevolence, and Koon united with Skywalker's fleet and prepared the counterattack on the Separatist warship. Plo Koon was given the Blade of Dorin, a Delta-7B Aethersprite starfighter, during the crisis, a gift from Jedi Skywalker.[source?]"}, {"tag": "p", "text": "As Anakin Skywalker led his starfighter squadron through the dangerous Balmorra Run of the Kaliida Nebula, Koon realized too late the peril they were in as a flock of Neebray mantas posed a threat to their ships. Losing several starfighters, the group made it out and arrived at their destination ahead of the Malevolence. Losing half their squadron to the ship's ion cannon, Koon and Tano were able to persuade a stubborn Skywalker into attacking the ship's ion cannon, causing it to misfire and destroy itself, leaving the endangered medical center in the clear. As reinforcements arrived, Koon met up with the Republic ships and watched as the Malevolence was eventually destroyed."}, {"tag": "p", "text": "Later, Plo Koon would help the Jedi fight off the Nightsisters of Dathomir, who had formed an alliance with the Confederacy. He was instrumental in destroying the battle cruiser, the Devastation, upon which he dueled Asajj Ventress alongside Padawan Ahsoka Tano."}, {"tag": "h4", "text": "Juma 9"}, {"tag": "p", "text": "Master Koon coincidentally met with Obi-Wan Kenobi onboard the Juma 9 station, but when it came under attack by Separatist forces, the two raced across the station to the hangar bay, and then to the core of the station to prevent it from being bombed by the droids. The two soon went to the control room where they faced the leader of the droid forces, Kul Teska. After a brief confrontation with Teska, they forced his retreat, at the expense of their lightsabers which they found hurtling through space."}, {"tag": "p", "text": "Soon after that, Mace Windu and Kit Fisto arrived in time to save them from their predicament."}, {"tag": "h4", "text": "Mission to Khorm"}, {"tag": "p", "text": "Master Koon led Republic forces alongside with Master Kit Fisto, Clone Commander Wolffe and Major Kendal Ozzel on the planet Khorm in a mission to free the enslaved Khormai people from the invading Separatists and their battle droids. Fighting alongside Khormai resistance forces, Koon was reluctant to sacrifice the clones in a direct assault on a vital strategic mine and therefore decided to destroy the weather-control station to lessen the amount of casualties."}, {"tag": "p", "text": "On their way up to the weather-control station, Count Dooku's Dark Acolyte, Asajj Ventress ambushed Koon and brought down an avalanche on top of him, wounding Koon and breaking his left arm. Despite his injury, Koon still maintained a willingness to continue the mission and eventually faced off against Ventress again later on in the mission. Fighting only with his right arm, Koon was able to withstand Ventress's dark side attacks and ultimately prevented the Dark Jedi from destroying the mine by Force-pushing her detonator away, destroying it. Koon and Fisto fought off the invading battle droids and liberated the Khormai from the Separatists, letting them live free of fear again."}, {"tag": "h4", "text": "First Battle of Felucia"}, {"tag": "p", "text": "Later, Koon took part in the defense of Felucia. On-planet, the Republic forces led by Master Kenobi and Jedi Skywalker were being steadily driven back to the point that it was urgent that they retreat. While Republic starships engaged Separatist cruisers, Koon led fighters down to the planet to provide a means of transport off-world. After the successful retreat, Plo Koon sat in on the High Council meeting and heard of Ahsoka Tano's reckless actions during the battle. The Council quickly decided that the Padawan needed time away from the battlefield and would benefit from acting as a guard of the Jedi Archives for a time."}, {"tag": "p", "text": "Following Cad Bane's break in, Koon was present in hologram form within one of the Temple's comm centers when General Grievous transmitted a message, gloating to the Jedi over his capture of Councilor Eeth Koth. While the Jedi discussed battle plans, Commander Wolffe reported to the Jedi Master that he had found a series of hand codes that Koth had planted on the recorded transmission. Reporting on these findings, the Council dispatched Masters Gallia, Kenobi, and Jedi Skywalker to rescue Koth and return him to the Temple from the Saleucami system."}, {"tag": "h4", "text": "The hunt for Boba Fett"}, {"tag": "p", "text": "Following the sabotage of the Endurance by Boba Fett, Koon was briefing the High Council in a data room within the Jedi Temple when the astromech droid R2-D2 interrupted with a message. Playing a hologram which showed that Mace Windu and Skywalker were badly wounded and stranded on Vanqor, Koon and Padawan Ahsoka Tano left for the planet to rescue the two Jedi. Following the rescue mission, the Temple received a message from Aurra Sing, the bounty hunter holding a group of Republic soldiers hostage, warning them to come and find them.Once more accompanied by Tano, Koon descended into the Coruscant Underworld looking for Jango Fett's old compatriots in order to track down Sing."}, {"tag": "p", "text": "After a string of unsuccessful bar investigations, Tano discovered that Sing had recently killed her companion Castas on Florrum. Despite being forced to fight their way out of the establishment, she and Koon had a solid lead and made a beeline for the planet. When they arrived, they were greeted by Hondo Ohnaka, who warned them of a trap inside. Koon went first, to find Aurra Sing at a table. Koon sat down, and Fett came in behind him and pulled a gun on him. He was surprised to find him there, and not Windu, but was even more surprised when Tano came and held her lightsaber to Sing's throat. Sing kicked the table at Koon, and shot at Tano, who blocked it. Sing dashed away, and Tano chased after. Fett tried to escape, but Koon caught him. He asked Fett where the hostages were, but he refused to answer. Koon brought him to Ohnaka, who convinced him to reveal the information. Transmitting the information to his Padawan companion, Koon was able to see the hostages freed, Bossk and Fett captured, and Aurra Sing go down to her \"death\" in the Slave I. He then brought Fett back to Coruscant and put in the prison there."}, {"tag": "p", "text": "Koon was present at the Temple when Delta Squad brought back the remains of Master Halsey and his Padawan Knox from the massacre on Devaron. Koon surmised that there was a new threat, possibly a newly appointed Sith Lord."}, {"tag": "h4", "text": "Battle of Lola Sayu"}, {"tag": "p", "text": "When Master Even Piell was captured by the CIS and held at the Citadel fortress on Lola Sayu, Master Koon briefed Jedi Kenobi, Skywalker and their clone officers on their mission: rescue Master Piell before he could be forced to give up the coordinates of the Nexus Route. After the briefing Master Plo, went to the hangar tinkering with his starfighter. Ahsoka Tano came to him, telling Master Koon that it should be her choice to go, not her master's. Master Koon yielded little comfort to her, knowing that she must respect her master's wishes. Master Plo waited in the Jedi temple's war room with master Yoda and Windu for a message from Skywalker's and Kenobi's team. When they received from Kenobi about their means of escape being destroyed, master Plo told Kenobi and Skywalker that he would be on his way to rescue them."}, {"tag": "p", "text": "Master Koon, along with fellow council member, Adi Gallia, Saesee Tiin, and Kit Fisto went with the rescue fleet. When the fleet reached the system, Master Koon and Commander Wolffe, aboard Koon's gunship, went through blockade protecting the planet while being protected the other Jedi with him in their star fighters. Koon was successful in extracting Kenobi's and Skywalker's team from the surface. Koon's gunship was able to make it back to the Republic, and Koon then ordered Admiral Coburn to retreat back to Coruscant. When Kenobi's and Skywalker's team made it back to the Jedi Temple, Anakin asked him if he allowed Ahsoka to come along on the mission. Master Koon covers Ahsoka's claim that he did permit her to join the mission."}, {"tag": "h4", "text": "Second Battle of Felucia"}, {"tag": "p", "text": "Later in the war, Master Koon returned to Felucia along with clone Commander Wolffe, Anakin Skywalker, Captain Rex, and Padawan Ahsoka Tano. Determined to destroy a large outpost reinforced by General Grievous and the Separatists, Koon devised a plan that would see the fortress completely crippled. Leading a section of Koon's Wolfpack in flanking maneuvers, Padawan Tano led her team in tandem with Jedi Skywalker's in scaling the walls of the Separatist outpost while their AT-TE and Juggernaut assault tanks heavily opened fire on the main structure, which destroyed it after several shots."}, {"tag": "p", "text": "When the outpost eventually fell under Koon's leadership, Padawan Tano was abducted by several Trandoshan hunters during the siege, and taken off the planet to the Doshan moon Wasskah. Ordering his forces to cease in their efforts to find the Togrutan Jedi Padawan, Koon pulled out of the mission and returned to the Jedi Temple. Master Koon assured Skywalker that their other forces and their intelligence would notify them if Tano was found. Tano worked closely with other captive prisoners on Wasskah, and fought their way out of the prison they were being held in. They were then picked up by Koon and Skywalker who were waiting for them after being notified of they were rediscovered."}, {"tag": "h4", "text": "Rescuing Adi Gallia"}, {"tag": "p", "text": "After that, Master Koon was dispatched by the Jedi Council, with Commander Wolffe helped to free Jedi Master Adi Gallia from the clutches of General Grievous after he boarded her ship, took her hostage and then made her his prisoner on his Separatist ship."}, {"tag": "p", "text": "Koon and Wolffe boarded Grievous' ship shortly after, destroyed the attacking battle droids, and freed Gallia, although Grievous escaped from them. Koon then found C-3PO and R2-D2 on board Grievous' ship too who had been on adventures of their own. Koon mischievously left the bickering droids with Commander Wolffe as he continued to eliminate the droids."}, {"tag": "h4", "text": "Mission to Kadavo"}, {"tag": "p", "text": "Koon, along with Admiral Coburn, Warthog and Commander Wolffe, went to the Kadavo slave processing facility to help Obi-Wan Kenobi, Anakin Skywalker and Ahsoka Tano free the Togrutan colonists from the Zygerrian Slavers on Kadavo. However, although they were initially halted by the facility's ray shields, Skywalker was able to destroy the defensive towers. Meanwhile, Tano devised a plan in which the Republic forces evacuated everyone onto Admiral Coburn's Arquitens-class light star cruiser. Koon and the Republic strike team then destroyed the slave facility, with it's destruction dealing a crippling blow to the Zygerrian slave trade."}, {"tag": "p", "text": "Koon, in his Jedi Starfighter, and his clone troopers, in their Republic Gunships, successfully destroyed the facility, freeing the enslaved Togrutan colonists, picking Kenobi, Skywalker and Tano up from the ground when they had completed their assault on the facility. After this assault, the Jedi returned back to the Jedi Temple on Coruscant."}, {"tag": "h4", "text": "Sith Hunters"}, {"tag": "p", "text": "Koon watched via holo transmission as the resurrected Sith Lord Darth Maul sent out his communication to the Jedi on Coruscant. Maul was the Sith Lord that murdered his friend Qui-Gon Jinn over a decade before on Naboo. Maul massacred a town on the Outer Rim world of Raydonia and threatened to do much worse if Obi-Wan Kenobi did not face him."}, {"tag": "p", "text": "Sometime later, Koon learned from his contacts in the Coruscant Underworld that Darth Maul and his brother Savage Opress massacred a gang of thugs in a cantina on Yellowblade's Landing. Koon traveled there with Kenobi, Grohto, Bruu Jun-Fan and his Padawan Tatsu two rotations later to find mutilated bodies inside the Sith brothers' ship."}, {"tag": "p", "text": "When Koon and the team arrived to find the Sith, they found them holding a young female hostage. As part of their getaway, Maul tried to distract the Jedi by freeing a pack of wampas from their cage, thus distracting the strike team. Two clone troopers were killed in the resulting skirmish, but Masters Grohto and Ko Solok and Padawan Tatsu intercepted the Sith. Tatsu was injured and Kenobi was Force choked by Maul briefly, and he was saved by Grohto."}, {"tag": "p", "text": "Koon and Jun-Fan, meanwhile, continued to deal with the wampa creatures while Grohto was killed by Maul. Master Jun-Fan's abilities - after the skirmish - allowed him to see that the Sith were traveling for Pleem's Nexus. With Kenobi and Tatsu no longer on the mission due to their injuries, Koon and the others proceeded to find the Sith brothers and deal with them."}, {"tag": "p", "text": "Koon, Jun-Fan and Solok soon confronted the two brothers on Pleem's Nexus and Koon focused on a duel with Opress. Jun-Fan and Solok, meanwhile, focused on taking down Maul. In the duel with Opress, Koon's breath mask was pulled off his face. No longer able to fight, he collapsed gasping for air. Solok was killed by Maul shortly after this and Anakin Skywalker and Obi-Wan Kenobi arrived in their fighters, injuring Opress. As the two left, Maul killed Master Jun-Fan. Koon then tended to himself by putting the mask back and rushed to the fallen Jun-Fan, hearing his final words."}, {"tag": "h4", "text": "Battle of Phorose"}, {"tag": "p", "text": "When the Separatists invaded Phorose, the Jedi Council sent Koon and Padawans Ahsoka Tano and Barriss Offee to lead the defense of the planet. During the battle, the Padawans were ambushed by droid tri-fighters and fell in an underground temple, leading to the accidental discovery of a community of Ru. However, a group of battle droids ambushed the two Jedi and destroyed the Ru temple. After the temple's destruction, Tano and Offee decided to evacuate the remaining Ru to a safe location, far from the battle. Unfortunately, the LAAT/i gunship carrying the two Padawans and the Ru was ambushed by Vulture droids, leading to the death of the Ru, with only two Ru and the two Jedi surviving."}, {"tag": "p", "text": "The battle ended with the Galactic Republic's victory, however at a great cost, as most of the Phorosian capital was destroyed in the battle and the majority of the Ru were killed."}, {"tag": "h4", "text": "Kidnapped"}, {"tag": "p", "text": "During a mission on Malastare, Koon was captured by Drez Unlin who made him his hostage, until Anakin Skywalker and his Padawan Ahsoka Tano came to their colleague's rescue. Unlin promised to release Koon if one of the two Jedi could beat him on a race, but he broke his promise after Tano did so. Unlin was ultimately neutralized by his own electroshock net during a fight with the Jedi. Once Plo Koon was freed, Unlin got transferred to the planet Coruscant by Anakin, where he would spend the rest of the war in prison."}, {"tag": "h4", "text": "Temple Bombing"}, {"tag": "p", "text": "After the Jedi Temple suffered a terrorist bombing, Koon attended the funeral for the victims of the Bombing of the Jedi Temple Hangar. When Ahsoka Tano escaped from prison while she was under suspicion of organizing the bombing, Koon and Anakin Skywalker were assigned the task of looking for Tano in the Coruscant Underworld with search parties of clones, including Commander Wolffe and members of the Coruscant Guard. En route to the Underworld, they received word that Tano had been spotted heading toward Level 1312. As their Republic police gunships came in to land at terminal 24, Skywalker spotted Tano and Asajj Ventress talking, but the pair was able to escape. Later, an underworld police officer reported a disturbance on Level 1315, and Koon arrived with Skywalker and Captain Rex to find that Tano had been discovered and stunned by Wolffe in a warehouse full of nano-droids."}, {"tag": "p", "text": "Koon was one of the five Jedi, along with Obi-Wan Kenobi, Ki-Adi-Mundi, Mace Windu, and Yoda, who made the decision to expel Tano from the Jedi Order for acts of treason against the Republic. He attended her trial in front of a military tribunal, where the charges against her were ultimately dropped after Barriss Offee confessed that she was the actual mastermind behind the bombing. Afterwards, Koon and several other Jedi masters apologized to Tano for not trusting her, and offered to accept her back into the Order, but Tano chose not to rejoin."}, {"tag": "h4", "text": "Mystery ship"}, {"tag": "p", "text": "Koon, Wolffe and their clone forces soon found themselves on a wasteland surrounded by a sandstorm. They were attempting to hunt down a signal in their walkers, and a clone soldier leading the approach from the outside reported the faint signal had been found. Koon and Wolffe along with other clones disembarked to find a crashed shuttle. But Koon found something - a lightsaber from the lost Jedi, Sifo-Dyas. He immediately ordered that everything be taken back to Coruscant."}, {"tag": "h3", "text": "End of the war"}, {"tag": "p", "text": "After fighting during the Battle of Boz Pity, Koon returned to Coruscant soon after in order to complete some of his duties on the High Council. During this time, the skies of Galactic City were filled with Separatist fighters and warships as a sneak attack on the capital fell into full swing. Taking to the skies during the fighting, Koon provided leadership in Coruscant's orbit as Master Kenobi and Jedi Skywalker rescued the captured Supreme Chancellor and killed Count Dooku. After the fires on Coruscant subsided, Koon was assigned to lead a campaign on Cato Neimoidia, charged with maintaining control of the Neimoidian purse world while Republic forces drove out the last remnants of the Separatist Droid Army."}, {"tag": "p", "text": "While Plo Koon was leading clean up operations in the skies of the world, back on Coruscant Supreme Chancellor Palpatine revealed his alter ego as the Dark Lord of the Sith Darth Sidious. As the Kel Dor Jedi led Captain Jag and an escorting squadron of ARC-170 starfighters, Sidious issued Contingency Order 66 from Coruscant. Unaware of the danger he was in, Koon's craft was struck by a volley of laser fire as his escorts opened fire on their newly assigned target. His starboard wing in flames, the craft's engines exploded, consuming Plo Koon's body and ending his life. His crippled starfighter promptly went into a spin, clipping a spire-shaped clone staging area jutting up from the bridge city below and breaking apart, ejecting Koon's astromech droid in the process."}, {"tag": "p", "text": "Official reports from the newly formed Galactic Empire went to great care in fabricating the reasons behind Koon's execution in order to spin compelling anti-Jedi propaganda in favor of Emperor Palpatine's take over. Compiled by Sate Pestage, these official documents stated that Koon's death was a result of a suicidal terrorist attack on a Neimoidian grub nursery."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "During his exile on Raxus Prime, the deranged Knight Kazdan Paratus, erected junk puppets based on members of the Jedi High Council at the end of the Clone Wars. When Sith Lord Darth Vader's secret apprentice, Starkiller, fought against Paratus, the insane Jedi Knight used the Force to bring the puppets to life and and attack. The puppet based on Plo Koon was the first to engage him, with a Form V stance and a vibroblade instead of a lightsaber. Like all of the puppets, however, Koon's was destroyed by the powerful assassin, who eventually struck down the crazy Jedi Knight."}, {"tag": "p", "text": "In 43 ABY, a number of young Jedi began contracting a mysterious disease, resulting in paranoia and the ability to use rare Force powers they would not ordinarily know. Curiously, fallen Jedi Knight Jacen Solo was known to exhibit many of the new abilities. One particular ability was revealed when Valin Horn, one of the Jedi to contract the disease, was being observed and scanned by an electroencephaloscan. The device's readings showed Horn to be dead, while he was clearly still alive. Grand Master Luke Skywalker, on a forced exile under mounting pressure on the Jedi Order, and his son, Ben, embarked on a journey to discover the causes of Solo's fall. While searching for an initial lead in the Jedi Archives, Jedi Master Cilghal stumbled across an obscure interview from decades before, in which Plo Koon mentioned an ability of the Baran Do similar to the one Horn exhibited. Following this discovery, the two Skywalkers traveled to Dorin to see the Baran Do Sages."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like many of his kind, Koon had a strong sense of justice. His species tended to see issues in black and white, and favored what was termed \"rough justice\", a method of solving disputes that, to non-Kel Dor, seemed overly retributive and too close to vigilantism. In his youth, Koon's Master Tyvokka said that he was \"humble, polite, stubborn and difficult\"."}, {"tag": "p", "text": "Plo Koon had a very close bond with Ahsoka Tano, having been the Jedi that found her and brought her to the Jedi Temple, affectionately nicknaming her \"Little Soka\". Because of their bond, Tano was able to sense his presence after his fleet was destroyed by the Malevolence. Despite this special bond, Ahsoka ended up being abandoned by Koon as well as the rest of the Jedi Council when she was accused of treason. He did apologize to her after she was proved to be innocent and called her by her nickname of \"Little Soka\". However, Ahsoka was deeply hurt and disappointed by the whole ordeal and chose to leave the Jedi Order, believing she could no longer trust any member of the Council, not even the Jedi who had brought her to the Temple in the first place. Although Koon admitted and apologized for the Council's failure, his devotion to justice ultimately blinded him to the fact that he knew Ahsoka better than any other Jedi, apart from Anakin Skywalker, and that she would never murder someone in cold blood."}, {"tag": "p", "text": "During the Clone Wars, General Plo Koon developed an affinity for the clone troopers under his command and often stated how their lives meant more to him than completing a mission. For instance, he questioned Sergeant Sinker about why he had no hope of being rescued. When the clone replied that it was because all clones were created to be an expendable product, General Koon firmly stated \"not to me\" thus showing that he felt a degree of compassion for the clones, which was unfortunately partly responsible for his death when the clones followed Order 66 and killed him."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Plo Koon was a Jedi Master so powerful that the Sith Lord Darth Maul considered him to be one of the greatest Jedi warriors of his time, though they never dueled one another. Koon was a master of telekinesis, and could move objects without having to face them. He also used a forbidden Force technique called Electric Judgment. To many Jedi, this seemed to be too close to the Force lightning employed by the enemies of the Jedi—the fearsome Sith Lords. Koon also had armored talons that were based on a traditional Kel Dor design. They were used to protect his sensitive fingertips, and were also able to focus and increase the range of his Force powers."}, {"tag": "p", "text": "Plo Koon possessed an extensive knowledge of the physical sciences. In particular, he used his expert knowledge of physics along with the Force to alter the environment—the resourceful Jedi could create small whirlwinds as well as a dense fog over a limited area, freeze tiny rivers and lakes, and raise or lower the temperature of his surroundings enough to incapacitate an opponent."}, {"tag": "p", "text": "In addition to the Jedi, Koon also belonged to the Baran Do, a Force sect predating the Jedi from his homeworld of Dorin, as members of his family had been over the centuries. As such, he was a master of a number of their techniques, such as ayna-seff."}, {"tag": "p", "text": "Possessing great strength, Koon was a master of hand-to-hand combat. He was also a master of the fifth form of lightsaber combat, Shien. Master Plo was considered to be one of the most skilled swordsman in the Jedi Order, and was capable of fending off the infamous Jedi hunter Asajj Ventress while being encumbered by a broken arm. He was also trained in the use of Ataru."}, {"tag": "p", "text": "Koon was a skilled pilot and his piloting skills were as well known as his abilities with a lightsaber. Some people considered him to be the third best pilot in the Jedi Order after Anakin Skywalker and Saesee Tiin. Koon also had the ability to breathe and survive in space for a short period of time owing to his thick Kel Dor hide."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Portrayals"}, {"tag": "p", "text": "Plo Koon was portrayed by Alan Ruscoe in The Phantom Menace, and by Matt Sloan in Attack of the Clones and Revenge of the Sith. Koon was voiced by Gregg Berger in Jedi Power Battles and Star Wars: Obi-Wan, and by James Arnold Taylor in The Clone Wars TV series."}, {"tag": "h3", "text": "Origin of the name"}, {"tag": "p", "text": "During construction and planning, Plo Koon was known as \"Plonkoon\", after the nickname of Nick Dudman's son. It was amended by George Lucas before filming to \"Plo Koon\"."}, {"tag": "h3", "text": "Lightsaber"}, {"tag": "p", "text": "The lightsaber wielded by Koon in Attack of the Clones is the same design as the one worn by Mace Windu in The Phantom Menace (with the exception of the radiator grooves which are blue on Plo's lightsaber). This Windu's saber was also blue in the Expanded Universe."}, {"tag": "p", "text": "Based on his abilities in Jedi Power Battles, it could be hypothesized that Koon utilized the Form V technique of lightsaber combat. However, this was never explicitly stated in any canonical source until The Force Unleashed novel was released."}, {"tag": "p", "text": "In Jedi Power Battles, Plo Koon wields a yellow lightsaber, which was echoed in the Plo Koon figure for Episode I, under the Power of the Jedi series. He also wields a yellow lightsaber in his appearances in Emissaries to Malastare, but an orange lightsaber in The Stark Hyperspace War, Jedi Council: Acts of War, and Obsession. The figure technically had a light greenish-yellow lightsaber but this matches the Jedi Power Battles video game closely and is probably meant to be yellow (like the Power of the Force 2 Darth Vader figures having pink lightsabers instead of a true red). These two instances were contradicted by Plo's use of a blue lightsaber in Attack of the Clones and The Clone Wars TV series and a green lightsaber in the Republic: The Dreadnaughts of Rendili. It is unclear if Plo Koon had other lightsabers, replaced his lightsaber, or if the color change is a case of canon contradiction. In the latter case, the film and TV series outstrip the video game, comics and toy."}, {"tag": "p", "text": "Hasbro's toy electronic lightsaber credits Plo Koon with an orange lightsaber instead of yellow, although this is likely not canon."}, {"tag": "p", "text": "In some Revenge of the Sith concept art, Plo Koon is shown equipped with a twin-bladed lightsaber gauntlet. Though this weapon was not seen in the film, it may be found on Sideshow Collectibles' 1:6 scale Plo Koon figure. In design, this weapon is similar to one used by Uda-Khalid, though Koon's saber gauntlet has twin green blades as opposed to Uda-Khalid's paired red blades.  In Hasbro's The Clone Wars action figure line, Koon comes with the lightsaber gauntlet with blue blades, a blue bladed saber, and a blue bladed shoto."}, {"tag": "h3", "text": "Appearance without mask"}, {"tag": "p", "text": "The official Star Wars database has an image of Plo Koon without his goggles exposing his closed eyes. The canon status of this is, however, in question, as the image appears in the Behind the Scenes section as a pre-production concept model and does not necessarily reflect the reality of the character."}, {"tag": "h3", "text": "Other appearances"}, {"tag": "p", "text": "Although Plo Koon himself does not make an appearance in the GBA/DS version of the Revenge of the Sith video game, he is alluded to in one of Anakin Skywalker/Darth Vader's Force Specials, called Plo Koon's Round. Plo Koon was also the only one of the four characters whose names were used in Skywalker's Force Specials who was not a Sith Lord."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}