{"url": "Plo%27s_Bros/Legends", "categories": ["Category:Legends articles", "Category:Low Altitude Assault Transports"], "nodes": [{"tag": "h1", "text": "Plo's Bros"}, {"tag": "p", "text": "Plo's Bros was the designation given to the Republic LAAT/i gunships used by the 104th Battalion during the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The gunships were decorated with customized nose art depicting the face of Jedi Master Plo Koon between two clone troopers underneath the words \"Plo's Bros\" written in Aurebesh. The ships were also painted blue in areas that stock LAAT/i gunships were maroon in color."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the First Battle of Felucia, Republic forces under the command of High Jedi General Obi-Wan Kenobi, Jedi General Anakin Skywalker and Jedi Commander Ahsoka Tano were engaged in battle with the forces of the Confederacy of Independent Systems. They were being overwhelmed by the droid army and without support due to a Separatist blockade around the planet. Jedi Master Plo Koon was dispatched to bring break the blockade and evacuate the surviving Republic forces."}, {"tag": "p", "text": "As Koon's ships engaged the Separatist blockade force in orbit, several starfighters and gunships managed to reach the surface. They first evacuated Kenobi and Skywalker team, the two generals boarding Plo's Bros. They then proceeded to where Commander Tano's team appeared to be driving the droid army back, though they were actually drawing Tano's troops into a trap. It was a ruse that fooled the young commander, who even refused to obey a direct order from General Kenobi to withdraw. Skywalker commanded the pilot to land Plo's Bros and the other gunships between Tano's HAVw A6 Juggernaut and the battle droids forcing the Togruta Padawan to cease firing and evacuate her troops. As Plo's Bros and the other gunships lifted into the sky, Tano watched the Juggernaut she had just vacated destroyed by overwhelming enemy fire."}, {"tag": "p", "text": "Some time later, a trio of Plo's Bros gunships assisted in the rescue of Jedi Master Mace Windu and Jedi Knight Anakin Skywalker who had become trapped on the bridge of the wreckage of Endurance, a Venator-class Star Destroyer that had crashed on Vanqor's surface."}, {"tag": "p", "text": "One was used in a rescue from the Citadel, passing through the blockade over the planet with the help of three Delta 7B starfighters. This gunship had its bubble turrets replaced with two large external floodlights, and had a sealed cabin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}