{"url": "Plo_Koon%27s_Delta-7_Aethersprite-class_light_interceptor", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Delta-7 Aethersprite-class light interceptors", "Category:Jedi starfighters", "Category:Unidentified starfighters"], "nodes": [{"tag": "h1", "text": "Plo Koon's Delta-7 Aethersprite-class light interceptor"}, {"tag": "p", "text": "In 19 BBY during the Battle of Cato Neimoidia, Jedi Master Plo Koon flew a Delta-7 Aethersprite-class light interceptor with a paint job similar to that of the Delta-7B starfighter that he flew in the earlier stages of the Clone Wars. Koon's Delta-7 was destroyed when Koon was killed by his clone wingmen during the execution of Order 66, as was its integrated astromech droid, R4-F5."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Jedi Master Plo Koon gave his Delta-7 a color scheme similar to the Delta-7B starfighter that he used prior to the Delta-7, painting it blue with convergent white stripes. The astromech droid R4-F5 was integrated into the starfighter as Koon's navigator and copilot."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the early stages of the Clone Wars, Jedi Master General Plo Koon, along with the astromech droid R7-D4, flew a Delta-7B Aethersprite-class light interceptor given to him by Jedi Knight Anakin Skywalker. At some point Koon instead began using a Delta-7 coupled with R4-F5."}, {"tag": "p", "text": "Koon flew his Delta-7 during the Battle of Cato Neimoidia in 19 BBY[source?] shortly before the end of the Clone Wars. The starfighter, including its integrated astromech, was destroyed by Koon's clone wingmen when they received Order 66 from the Dark Lord of the Sith Darth Sidious, killing Plo Koon as well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}