{"url": "Podracer", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Podracer pods"], "nodes": [{"tag": "h1", "text": "Podracer"}, {"tag": "p", "text": "Podracers were repulsorcraft that were built as racing vehicles. Capable of achieving speeds over 700 kilometers per hour, podracers were used in the similarly named sport of podracing. The P-100 pick-up droid was designed to retrieve valuable components from podracers that had crashed and then bring these pieces to the storage hold of a P-100 Salvage Droid."}, {"tag": "p", "text": "Podracers came in various shapes and sizes, although the general construction of a podracer was a one-man cockpit trailed by two engines which were attached to the cockpit via two cables. Variations of this included the podracer used by Ben Quadinaros, which had four engines connected to the cockpit. Another, more unusual podracer was the one employed by Neva Kee, which was one solid unit, with the cockpit placed in front of the engines."}, {"tag": "p", "text": "Podracers could also be modified at the owner's whim. The crafty Dug pilot Sebulba, for example, had installed an illegal flamethrower on his racer. Anakin Skywalker flew a heavily modified podracer that was partially built from the ground up. Other podracers included the Ord Pedrovia, which was piloted by Gasgano, and the Vulptereen 327, which was piloted by Dud Bolt. The pilot Clegg Holdfast flew a red KT9 Wasp, a podracer which was manufactured by a company named Voltec.[source?]"}, {"tag": "p", "text": "By the fall of the Galactic Empire, podracing had lost much popularity, and was outlawed by the New Republic. Therefore, the engines were often redesigned for other uses. One such example is Cobb Vanth's speeder, which was constructed using the engine of a podracer. Some engines were even used to cook meat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sounds recorded for the podracers in Star Wars: Episode I The Phantom Menace were later used for the speeders on Jakku in Star Wars: Episode VII The Force Awakens."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}