{"url": "Podracing/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Podracing", "Category:Sporting events"], "nodes": [{"tag": "h1", "text": "Podracing"}, {"tag": "p", "text": "Podracing was a popular sport in the less-developed regions of the galaxy and was one of the most dangerous sports ever invented. Racers losing their lives during competitions was commonplace."}, {"tag": "p", "text": "Podracers were small, one-man repulsorcraft, composed of an anti-gravity pod propelled by one or more pairs of large turbine engines. The engines were not physically connected to each other, being linked instead by power couplings consisting of plasma discharges. The engines were connected to the pods themselves by means of long, Steelton cables. Podracers were custom-built, and were only as safe as the mechanic and pilot made them."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Besides housing the racer's pilot, each pod contained a repulsorlift engine that kept the craft at a specific, low-level altitude. The turbine engines were incredibly powerful, and were connected by an energy binder that kept them from flying apart. Podracing was popularized in the Outer Rim Territories during the last decades of the Galactic Republic. Its underground nature, great excitement, and almost gladiatorial propensity for carnage held immense appeal to all manner of folk living on the fringes of society."}, {"tag": "p", "text": "Because of the reflexes needed to control the pod as it raced around the course at breakneck speeds, as well as the dexterity needed to control the Podracer, human Podracers were uncommon on Tatooine by 32 BBY, apart from Anakin Skywalker, being dominated by non-humans. Inhuman physical attributes, as well as extra pairs of hands, came in handy when trying to control the pod at its top speed of around 900 km/h."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Birth of the sport"}, {"tag": "p", "text": "While the first race and racers are lost to history, Podracing traced its roots back to the days of animal-drawn carts on many different worlds. On Tatooine, these cart races evolved to incorporate hanno speeders. These events were held by Boonta the Hutt himself after his victory over the Parliament of Moralan and continued after his death. Developing across the Outer Rim and developing at pace with that of galactic technology, various sports were reported to exist at multiple times in the history of the Galactic Republic, with Czerka Arms being recognized as having produced some of the first engines for an early version of the sport."}, {"tag": "h3", "text": "Modern concept development"}, {"tag": "p", "text": "The concept of modern day Podracing was born circa 100 BBY on Malastare by alien racer Gustab Wenbus. Wenbus had entered himself in a race with a super-fast prototype pod designed by a mechanic named Phoebos. Standardizing the Podracer's configuration and promoting the first circuits, Wenbus' rules were simple: build a racer, make it fast, and race. Prizes usually consisted of parts or credits and were awarded to the first to cross the finish line or the last surviving racer."}, {"tag": "p", "text": "One of the most famous Podraces was the Boonta Eve Classic, held on Tatooine in 32 BBY. The spectacular race was especially notable for being won by a Human, nine-year-old Anakin Skywalker. Other popular races at the time included the Vinta Harvest Classic on Malastare, the Ando Overland on Ando Prime and the Aleen Classic."}, {"tag": "p", "text": "Although technically illegal, but often controlled by the Hutts, Podracing flourished during the rule of the Galactic Republic, particularly among planets in the Outer Rim and on worlds such as Malastare and Ando Prime. With hundreds of thousands of circuits in operation on just as many worlds, Podracer pilots were often venerated athletes and were known for their swaggering, jockeying demeanor. The sport was also watched by citizens from the Core Worlds; large viewscreens in seedy establishments such as the Outlander Club on Coruscant relayed Podraces from all over the galaxy. Podracing's popularity reached an all-time high following Skywalker's win, but as the political situation in the Republic deteriorated, so did the appeal of Podracing. Many of the sport's generally-accepted criminal activities were exposed, and some of the most famous racers were arrested for a variety of crimes. Podracing was soon outlawed in the Core. Shortly before the outbreak of the Clone Wars, it was reported that attendance had dropped more than fifty percent from the era of the Battle of Naboo, although betting transactions remained at an all-time high. Podracing soon gave way to swoop racing and other forms of extreme sports."}, {"tag": "h3", "text": "Imperial crackdown"}, {"tag": "p", "text": "With the Declaration of a New Order and the rise of the Galactic Empire, Podracing became outlawed across the galaxy, and under the Empire's far more stringent standards of law enforcement, the sport fell out of popularity altogether. The sponsorships, acclaim, and cash-flow that venues and racers received was brought to an abrupt end, and due to its largely non-Human appeal, racers disappeared or were arrested at a staggering rate. Imperial agents seized and auctioned off Podracers, the arenas, and all equipment they could locate, and within a few years of the Empire's rise, Podracing was effectively ended."}, {"tag": "p", "text": "Despite the Empire's best efforts, not all of the sport's racers or fans were destroyed. Racers that survived the initial purge went underground and the popularity of the sport was rekindled. Spreading to the fringes of the Outer Rim and creeping into the Unknown Territories, races popped up over night and vanished just as quickly, avoiding Imperial intervention. During one race of the Boonta Eve Classic in 1 BBY, a Star Tours-owned StarSpeeder 1000 inadvertently got entangled in the race due to having recently escaped from being caught by the Empire at the Star Tours space station for having a Rebel spy onboard. It then briefly rode alongside the racers before flying back out of the planet's atmosphere and making contact with the Alliance High Command for their next destination."}, {"tag": "p", "text": "Broadcast in some entertainment venues like the Vapor Room, a bar on Cloud City on Bespin in 2 BBY, the fans of Podracing found ways to circumvent Imperial law. The racers themselves became even more cocky, seemingly invincible after repeatedly evading Imperial agents. New teams developed in the wake of the crackdown, and continued to thrive throughout the Galactic Civil War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}