{"url": "Po_Nudo", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Aqualish", "Category:Galactic Republic senators", "Category:Males", "Category:Separatist leadership"], "nodes": [{"tag": "h1", "text": "Po Nudo"}, {"tag": "p", "text": "Po Nudo was a male Ualaq Aqualish who represented his species in the Galactic Republic's Senate around the time that the Trade Federation invaded the planet Naboo. Ten years later, he attended a secret meeting on the planet Geonosis where he and several other senators gave their support to the Sith Lord Count Dooku and left the Republic to form the Confederacy of Independent Systems. Shortly after the meeting the Republic arrived and the First Battle of Geonosis broke out, marking the start of the Clone Wars between the Republic and the Separatists and forcing Nudo to flee the planet."}, {"tag": "p", "text": "During the war the Aqualish senator withdrew from the Republic and sat on the Separatist Council. He was assigned to be the manager of the Hyper-Communications Cartel, which served as an alternative to the Republic-controlled HoloNet. In the later stages of the war, Nudo and the rest of the council were hidden on the planet Utapau being protected by the cyborg General Grievous. Following the Battle of Coruscant and the death of Dooku, Grievous informed the council that he had been ordered to move them to another world, but during the meeting the Jedi Master Obi-Wan Kenobi interrupted and attacked Grievous, starting the Battle of Utapau during which the council fled and were relocated to the volcanic world of Mustafar. Once the Clone Wars drew to a close, Darth Sidious—who had secretly been the true leader of the Separatists all along as well as Supreme Chancellor of the Republic—sent his new apprentice Darth Vader to Mustafar where he killed all of the Separatist council including Nudo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Po Nudo first appeared in the Star Wars: Episode I The Phantom Menace in 1999 in which he was played by an uncredited extra and went unnamed. The character first received a name in the Star Wars Legends 2001 novel Cloak of Deception, written by James Luceno. Po Nudo was played by extra Paul Nicholson in Star Wars: Episode III Revenge of the Sith in 2005."}, {"tag": "p", "text": "While Revenge of the Sith was in its early stages of development, a piece of concept art made by concept design supervisor Ryan Church presented an alternate fate for Po Nudo during the Mission to Mustafar sequence which went unused in the final cut. In Church's concept art, rather than be cut by Skywalker like in the finished version of the film, Skywalker used his lightsaber to decapitate Nudo before killing the other Separatist leaders."}, {"tag": "p", "text": "On page 127 of the 2018 reference book Star Wars: The Complete Visual Dictionary, New Edition, Nudo's name is mispelled as \"Po Nudu.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}