{"url": "Pochi", "categories": ["Category:Legends articles", "Category:Faarlsun system planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Pochi"}, {"tag": "p", "text": "Pochi was a planet located in the Faarlsun system, a part of Wild Space's Parthovian Cluster. It was an arid yet habitable world, the surface of which featured endless plains, covered in low grasses and small trees, and low mountain ranges."}, {"tag": "p", "text": "Pochi was the homeworld of the Tulvarees, semi-intelligent, tribe-based avians that practiced hunting. At some point, a massive tower known as Fortress Baarlos was constructed on Pochi by a group whose identity was later forgotten."}, {"tag": "p", "text": "Ten millennia later, the Human pirate and warlord Faarl established his base of operations on Pochi, running his empire from Fortress Baarlos. Faarl employed the Tulvarees as soldiers, but eventually the bounty hunter Boba Fett assaulted Faarl's fortress and claimed the bounty posted on the warlord."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Pochi was a terrestrial planet with three moons that was located in the Faarlsun system, a part of the Parthovian Cluster in Wild Space. The planet occupied the fourth orbit around its star, the yellow-white Faarlsun, and circled it once every 350 local days, which lasted 25 standard hours each."}, {"tag": "p", "text": "Pochi had standard gravity and a breathable Type I atmosphere. Pochi was an arid yet habitable world. The seasonal variation of the planet's climate was minimal except in the vicinity of the poles, which led to an almost constantly temperate-to-warm temperatures. More moisture was available near the planet's coastlines."}, {"tag": "p", "text": "Pochi's surface featured endless dry plains, low mountain ranges, and caves. There were also coastlines on the planet, along which small forests were situated. The flora of Pochi's plains consisted of low scrub grasses and groves of small trees. The planet's mountains were home to grazing herbivores."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point, Fortress Baarlos was constructed on Pochi. An estimated ten millennia later, the pirate and conqueror Faarl established control over Pochi, with the base of operations for his empire located at the fortress. Recognizing the potential of the native Tulvarees as soldiers, Faarl provided the avians with a constant supply of food, medicines, and other commodities in exchange for their allegiance, and soon they learned to follow the Human's orders and to use weapons."}, {"tag": "p", "text": "In 7 ABY, in an entry of the datafile Wanted by Cracken dedicated to Faarl, the New Republic General Airen Cracken noted that the pirate leader led his operations from a hidden base in the Parthovian Cluster. Eventually, the bounty hunter Boba Fett assaulted Fortress Baarlos, catching Faarl unprepared in the process. Fett used a Wing-Blast rocket pack to attack the Tulvaree guardians of the fortress and collected the bounty that had been posted on Faarl."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Pochi was a primitive world. It was home to the Tulvarees, a species of semi-intelligent avians that hunted the planet's mountain herbivores. The Tulvarees could understand language but did not use tools or create works of art. They also did not build structures, instead living in caves or other natural shelters. The Tulvarees lived in large tribes composed of extended families and constantly practiced inter-tribal warfare."}, {"tag": "p", "text": "Pochi was at one point inhabited by a group that built Fortress Baarlos on the planet. Over time, however, the knowledge of the identity of those builders had been lost, but it was thought they had been warlords."}, {"tag": "p", "text": "Eventually, the Human warlord Faarl took control over Pochi and established his base of operations in the fortress, employing Tulvarees as soldiers in exchange for a supply of food. Other Humans also inhabited Pochi by that time, bringing the population of the planet to a total of six million beings."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Pochi was the site of Fortress Baarlos, a massive tower-like citadel that had withstood the effects of time and environment, possibly for as long as ten thousand years. The hatching caves of the Tulvaree were located far away from the tower yet were still visible from it."}, {"tag": "p", "text": "Faarl had the fortress modified for use as his base of operations. The bedrock upon which the tower had been constructed also underwent extensive modification, with plasma drillers being utilized to excavate caverns. The latter housed dungeon cells, power generators, living quarters, and even docking bays for Faarl's fleet of aircraft and smaller starships. The generators powered planetary shields, and all of the defenses of Pochi were controlled from within the mid-section of the tower."}, {"tag": "p", "text": "The city of Vindru was also located on Pochi, and so was a spaceport offering limited services. Pochi had no major exports to offer to the wider galactic community, and low-level technology, raw materials, and luxury items were all imported from off-world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pochi was mentioned in the 1993 sourcebook Wanted by Cracken, written by Louis J. Prosperi for West End Games' Star Wars: The Roleplaying Game. In one instance, the book describes the climate of Pochi as humid, which contradicts several cases—both in Wanted by Cracken and the 2008 reference book The Complete Star Wars Encyclopedia—where the world is characterized as dry instead. This article assumes the former description is in error. The 2009 reference book The Essential Atlas placed the Faarlsun system, and therefore Pochi, in grid square T-4."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}