{"url": "Point_Nadir", "categories": ["Category:Legends articles", "Category:Cities", "Category:Point Nadir locations", "Category:Shadowports", "Category:Slavery worlds", "Category:Spaceports"], "nodes": [{"tag": "h1", "text": "Point Nadir"}, {"tag": "p", "text": "Point Nadir was a shadowport located on the comet Resh 9376 in the Outer Rim. It was formally established by the Anjiliac clan built on the remains of a base constructed by the pirate captain Salovan Fische. It was the headquarters for the criminal syndicates, Epsis and Sable Dawn."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Point Nadir was originally constructed as the base of operations for the Corellian pirate captain Salovan Fische. Fische had discovered the long-forgotten comet surveyed hundreds of years prior by astronomers from Corellia. Over more than ten years, Fische and his pirate gang constructed a very rudimentary facility within the small underground caverns within the comet. After a run of bad luck and demoralizing living conditions, Fische's gang betrayed and marooned him on the rock to die a hermit."}, {"tag": "p", "text": "The pirates then turned around and sold the location of their established base to the Anjiliac Hutt clan who showed interest in Resh 9376, given the potential of an already established base located there. However, exploiting the data was low on their list of priorities, and was not acted on until nearly a century later. The Hutts took advantage of the large amount of work accomplished by the mining droids and equipment that had continued working after Fische's death, until they shut down due to overwork and no maintenance. Using their vast wealth and resources, they were able to take Fische's rudimentary complex and build it into a central hub for several criminal organizations."}, {"tag": "p", "text": "Point Nadir was cloaked in secrecy and those who know of its location either paid for the information from the Ajiliac kajidic, the de facto rulers of the shadowport, or had been invited by one of the two other governing criminal organizations. All ships that approached the comet were recorded and cataloged by Point Nadir traffic control. Those that were authorized to land followed a strict approach vector and flight path. Those ships that failed to adhere to the established flight pattern were ordered to stand down and were questioned about their purpose, often at gunpoint by an Anjiliac boarding party. Any vessel that failed to yield to the orders of a flight controller was given a single warning, after which they were intercepted by defense fighters which rarely returned without destroying their target."}, {"tag": "h2", "text": "Government"}, {"tag": "p", "text": "The shadowport was governed by a triumvirate made up of three loosely-aligned criminal syndicates. The primary rulers were the Anjiliac clan of the Hutts, who had built Point Nadir on the groundwork laid by Salovan Fische. The other two organizations, a group of assassins called Sable Dawn, and a group of black marketeers, money launderers, and slicers known as Epsis, were always jockeying for more control over the Point Nadir."}, {"tag": "p", "text": "With their high-tech holding, Epsis had a stranglehold on all access to the HoloNet, which gave them their status as the second-largest group of Point Nadir's governing bodies. Sable Dawn, while small in number, still held sway in governing due to their shadowy presence throughout the Outer Rim, dealing in political assassinations and espionage. The Anjiliac kajidic was the leading group of the triumvirate due to their wealth and influence as the founders of the Point Nadir itself."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Those allowed to dock at Point Nadir followed a landing beacon that led them through what was locally known as the \"Jackrab Hole\", a 500 meter diameter, winding tunnel leading to the interior of the comet. The Jackrab Hole opened into Fische's Cove, an immense cavern used for docking and berthing of ships. To the right and left were areas known as the \"Tethers\", the most inexpensive places to dock before entering the port. Fische's Cove encompassed the anterior half of the comet's carved-out interior. The Slips were the luxury docking berths that separated Fische's Cove from the rest of Point Nadir."}, {"tag": "p", "text": "The rest of the city was laid out much like any other spaceport town. There were neighborhoods and districts for all walks of life, from the poorest to the exceedingly wealthy. The Fissure District was the slums of the shadowport, located at the opposite end from Fische's Cove. It housed the poorest of Point Nadir's denizens. It separated the city proper from the mines which were ruled off-limits by the government. Nest was the area that housed mercenaries and thugs. Fire fights and brawls were not an uncommon sight in this neighborhood. The Ministry Precinct was the seat of local government, such as it was. It maintained the best living conditions, air quality and security of anywhere in the shadowport."}, {"tag": "p", "text": "Business was conducted in either the Trade District or Salovan's Souk. Where as the Trade District contained permanent businesses that maintained a permanent presence, Salovan's Souk, sometimes called simply \"the Souk\", was the centralized marketplace of Point Nadir. Laid out like a bazaar, the Souk was cramped and crowded as opposed to the Trade District which had wide, straight and clean streets. The Arcade was home to the cantinas and casinos of Point Nadir. Some of the more well cantinas were The Cruelest Cut, Fische's Pub and Under the Table. The two casinos had the opportunity for any gambling needs a being might fancy. The Crown Court was the place to go for betting on all sporting events, from shockboxing to podracing. Lucky's focused more on card and dice games, such as sabacc, and was also well known for serving excellent food."}, {"tag": "p", "text": "The Utility Ward contained the machinery necessary to keep Point Nadir running. Enormous power generators, gravity generators and life support systems were all housed and maintained in this area, located behind the Ministry District. Though formally under the control of the Anjiliac kajidic, several Epsis technicians were also employed here. It was the most heavily defended area after the Ministry District."}, {"tag": "h2", "text": "Sources"}]}