{"url": "Poe_Dameron_15", "categories": ["Category:Real-world articles", "Category:Star Wars: Poe Dameron"], "nodes": [{"tag": "h1", "text": "Poe Dameron 15"}, {"tag": "p", "text": "Poe Dameron 15 is the fifteenth issue of the Marvel comic book series Star Wars: Poe Dameron. The comic is written by Charles Soule with art by Phil Noto. It was released in May 17, 2017."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On D'Qar, General Leia Organa, Admiral Ushos O. Statura, Poe Dameron, and C-3PO discussed the Resistance's lack of supplies, especially fuel. The Resistance often purchased these from the galactic underworld, but most of their contacts had gone silent. Only one remained: Captain Perrili."}, {"tag": "p", "text": "On the bulk freighter Romary, Captain Perrili went to the hangar to meet ships that she thought was the Resistance. However, stormtroopers came out and shot one of her crew members. Malarus and Terex emerged as well."}, {"tag": "p", "text": "Organa made a deal for one more freighter of fuel, and assigned Black Squadron to retrieve it. However, she was only able to authorize one fighter's worth of fuel. Despite this, all of the squadron still went, the ships running on less fuel."}, {"tag": "p", "text": "TIE fighters surrounded the Romary as Malarus interrogated Perrili."}, {"tag": "p", "text": "As Black Squadron traveled through hyperspace, they agreed the mission would succeed no matter what to honor L'ampar. When they reached the Romary, they found no signs of life but were not surprised since the original plan was for Perrili to leave the freighter. Dameron and BB-8 traveled to the cockpit to fly the ship. However, before Dameron jumped into hyperspace, BB-8 stopped him."}, {"tag": "p", "text": "The droid had discovered that the freighter was rigged to explode as soon as it stopped accelerating, which would have destroyed the Resistance base. Black Squadron was still unwilling to leave the freighter, as they had promised themselves this mission would succeed."}, {"tag": "p", "text": "Their astromech droids get to work as the freighter entered a nebula. The shields became strained from deflecting dust. The freighter entered an asteroid field, and the asteroids were difficult for Dameron to dodge. Just before hitting one, the rest of Black Squadron shot it down with their fighters. Dameron worried about their fighters running out of fuel, but they assured him they were capable. BB-8 discovered that the First Order had drained the freighter's storage tanks, and they decided to take the fuel back."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In a list of Aurebesh text, Captain Perrili's name is misspelled as \"Captain Parrili.\""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}