{"url": "Poggle_the_Lesser/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Business owners and executives", "Category:Geonosian archdukes", "Category:Separatist leadership", "Category:Techno Union members", "Category:Warlords"], "nodes": [{"tag": "h1", "text": "Poggle the Lesser"}, {"tag": "p", "text": "Poggle the Lesser was the Archduke of Geonosis before and during the Clone Wars, and was a leading member of the Separatist Council. He would later be killed by Darth Vader, along with the rest of the Council, on Mustafar at the conclusion of the conflict in 19 BBY."}, {"tag": "p", "text": "As planetary leader of the Geonosians and a member of the Techno Union, Poggle controlled the vast droid factories found on his planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Geonosian revolt"}, {"tag": "p", "text": "Originally, Poggle was a member of the Geonosian lower caste, hence his surname \"the Lesser\". He sought the position held by then-Archduke Hadiss the Vaulted and organized a revolt against him, which seemed to be of little concern to Hadiss, who easily dealt with the rebels."}, {"tag": "p", "text": "That was until the Sith Lord Darth Sidious came to Poggle's aid and secretly funded his revolution. Over time, Poggle's rebels finally seized power, and Poggle at last became Archduke of the Stalgasin hive, the ruling hive of Geonosis, and Hadiss was executed in the Geonosian arena."}, {"tag": "h3", "text": "Archduke and creating Grievous"}, {"tag": "p", "text": "Once Poggle the Lesser was in power In 33 BBY, Darth Sidious's intentions became clear: he wanted control of the droid factories to supply B1-Series battle droids to the Trade Federation for an invasion of Naboo. Poggle, grateful for Sidious's help, gladly struck a deal with the Trade Federation. The fact that Poggle and Trade Federation Viceroy Nute Gunray hated each other, but still worked together was a great testament to the influence of the Sith Lord."}, {"tag": "p", "text": "Shortly after the Trade Federation was defeated at the Battle of Naboo, Poggle was approached by the rogue Jedi Count Dooku, revealing himself as Darth Tyranus, the new apprentice of Darth Sidious. Dooku formed a partnership with Poggle; the Archduke would ensure that Geonosis was among the founding worlds of the Confederacy of Independent Systems and would supply a large amount of the Separatist Droid Army. In return, Poggle would be paid large sums of money for his trouble and Geonosis would earn a place on the high order of the new Confederacy. This partnership was lucrative; Poggle even took the liberty to create a new B2 super battle droid for the Confederacy."}, {"tag": "p", "text": "Poggle also assisted Count Dooku and InterGalactic Banking Clan Chairman San Hill with another project: the rehabilitation of the Kaleesh warlord Qymaen jai Sheelal. Poggle's engineers were responsible for the cyborg body given to the injured Sheelal. Following the procedure, Sheelal was renamed \"General Grievous\" and was promoted to Supreme Commander of the Droid Armies."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Battle of Geonosis"}, {"tag": "p", "text": "Ten years after their initial meeting, Poggle the Lesser hosted the first official meeting of the Confederacy's leaders in the Stalgasin hive. The Geonosians captured Jedi Knight Obi-Wan Kenobi, his Padawan Anakin Skywalker, and Senator Padmé Amidala soon after this meeting, and Poggle himself presided over their trials, charging them with espionage and sentencing them to execution at the Geonosian arena. Senator Amidala warned Poggle that to execute three officials of the Republic was an act of war; Poggle scoffed that as a builder of weapons, he was more than prepared for it."}, {"tag": "p", "text": "The execution did not go as Poggle planned, but despite the prisoners managing to outwit the arena beasts (and Nute Gunray's constant complaining), Poggle was satisfied by the display, until Mace Windu and several dozen Jedi arrived to rescue them. Poggle's battle droids outnumbered the Jedi and victory seemed assured, until Grand Master Yoda arrived with the newly-commissioned clone army. Poggle and the Separatists retreated to a war room and watched helplessly as the Republic Army, suddenly manned by battalions of clone troopers, engaged their droid army. Poggle ordered his soldiers to retreat and hide, but before he joined them, he turned over plans to the Ultimate Weapon—a secret project he had been contracted to build by the Separatists which would later become the Galactic Empire's feared battle station, the dreaded Death Star—to Count Dooku and erased all data from his computers. Following the battle, Geonosis was occupied by the Republic."}, {"tag": "h4", "text": "Second Battle of Geonosis"}, {"tag": "p", "text": "Later in the war, Republic resources were spread thin, allowing the Separatists to rise up and re-take Geonosis and other worlds. With his planet once again secure, Poggle made a deal with the Trade Federation, and the Banking Clan to fund a new factory complex. Poggle was present at a meeting on Cato Neimoidia along with Senators Lott Dod and Rush Clovis, representing the Trade Federation and the Banking Clan respectively. Poggle and Dod argued that they should receive a larger cut of the profits, but Clovis refused to re-negotiate. To coerce him, Dod secretly poisoned Clovis's romantic interest Senator Amidala, there to attend a supposed diplomatic meeting (and covertly spy on Clovis at the request of the Jedi Council). Though Amidala was able to steal the plans to the new droid foundry, the poison quickly incapacitated her, forcing her bodyguard Anakin Skywalker to take her back to Coruscant. Clovis, fearing for Amidala as well as himself, offered to help procure the antidote from Dod and Poggle in exchange for the stolen plans. Skywalker and Clovis attempted to quietly leave Cato Neimoidia, but were confronted by Dod. Though Clovis forced him to give Amidala the antidote, at the last minute, Skywalker refused to take Clovis with them to Coruscant. Clovis remained behind to deal with Poggle, Dod, and a squad of battle droids."}, {"tag": "p", "text": "It wasn't long before the Jedi arrived to shut down the new factory. While Poggle remained inside to oversee production, droids and Geonosian warriors defended the ray-shielded factory from an offensive strike led by Jedi Generals Skywalker, Kenobi, and Ki-Adi-Mundi. Geonosian defenses were stronger than the Jedi anticipated, injuring Kenobi and forcing Skywalker and Mundi to take alternate routes to the factory. As Mundi led his clone troops through a Geonosian-infested cave, Skywalker and his Padawan Ahsoka Tano were forced to take down a large wall armed with turrets. The ground forces were soon reinforced by the arrival of Y-Wing bombers and with the path cleared, Skywalker led a team to disable the Geonosian's scanners and allow the AT-TE's to destroy the shield generator."}, {"tag": "p", "text": "Meanwhile, Poggle's aide TX-21 informed him the factory was operating at 50% capacity and had produced ten garrisons of droid troops. Outside the factory, Skywalker was joined by Luminara Unduli and her Padawan Barriss Offee. Skywalker and Unduli used their troops to create a diversion at the bridge leading into the factory, while Ahsoka and Barriss sneaked in through the catacombs to get inside and destroy the main reactor. In response to the show of force at the bridge, Poggle authorized twenty of his new ray-shielded super tanks to be deployed and forced the Jedi forces to fall back. Inside the catacombs, Ahsoka and Barriss accidentally woke a Geonosian warrior, who quickly informed Poggle of their intrusion. While the two Padawans planted explosives in the reactor room, Poggle and TX-21 arrived with a super tank and several Geonosian warriors. Poggle left them to deal with the intruders and the explosives were quickly disable, though TX-21 was destroyed by a detonator placed on the super tank- which remained unharmed. Barriss succeeded in cutting into the tank, and left without detonators, Ahsoka realized the tank would be their best option to destroy the reactor and opened fire. The explosion leveled the factory, but the tank's durability allowed Ahsoka and Barriss to survive long enough to be rescued."}, {"tag": "p", "text": "Following the factory's destruction, Poggle fled aboard an AAT, carrying several boxes of cargo. A single box was dropped, but Poggle ordered his droids to leave it behind and continue pressing forward. Luminara managed to find this box and track him to the Progate Temple, the site of heavy bombardment during the Republic's initial strike."}, {"tag": "p", "text": "Though puzzled that he would go there, Luminara followed, but was soon captured by undead Geonosian warriors. Under Poggle's command, the Geonosians took Luminara deep into the catacombs beneath the temple, where she was presented to the Geonosian Queen, Karina the Great. Skywalker, Kenobi, and a team of clone troopers led by Clone Commander Cody followed Luminara's signal and ventured into the catacombs, only to be attacked by the undead Geonosians. Despite their best efforts, the undead were able to continue fighting even after being dealt mortal wounds, and so Kenobi altered their strategy. As the team entered the Queen's chamber, Kenobi noted that Luminara had been taken alive, and decided to try speaking with the Queen (to the dismay of Skywalker, who still preferred action). After Kenobi attempted to negotiate her surrender, Karina explained that she intended to control the three Jedi, using brain worm parasites. As Poggle attempted to insert a worm into Luminara, the clone troopers switched on their lights, disorienting the Geonosians long enough for Anakin to free Luminara and slap a pair of manacles on Poggle. Kenobi took the brain worm so that he could study it later, but dropped it in the confusion and was powerless to stop Anakin from crushing it with his boot. The Jedi fled with the captured Poggle, while clones destroyed the arch supports in the cave to slow down the otherwise unstoppable undead Geonosians, burying them along with Queen Karina. Once Poggle and the Jedi reached safety, Kenobi lamented that he wouldn't have a chance to find out how Karina's mind control worked."}, {"tag": "p", "text": "Following his defeat on Geonosis, Poggle was scheduled to be sent back to Coruscant for trial. Aboard a Republic Cruiser, Ki-Adi-Mundi and Luminara attempted to interrogate Poggle, but the Archduke refused to cooperate. When Skywalker learned that a supply ship carrying Ahsoka and Barriss had been taken over by brain worm-infested clone troopers, he decided to personally interrogate Poggle. Using a protocol droid to translate, Poggle informed Skywalker that mind tricks wouldn't work on Geonosians, as the other Jedi had already discovered. Skywalker angrily knocked him down, telling him that he wouldn't need mind tricks to get him to cooperate. Poggle defiantly told the Jedi that he would never talk, but Skywalker used the Force to choke and levitate him until Poggle finally explained that the brain worms were vulnerable to cold temperatures. Kenobi and the other Jedi were curious as to how Skywalker had managed to get Poggle to cooperate, but he didn't elaborate. The Jedi eventually reached Coruscant with Poggle, where he was transferred into a jail cell within the Republic military base, which is also where fellow Separatists General Whorm Loathsom and Emir Wat Tambor were confined."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Poggle later escaped Republic captivity and rejoined the C.I.S as the war began to draw to its close. Following a string of Republic victories, General Grievous ordered the members of the Separatist Council, including Poggle, to remain under his protection. Grievous hid them on Utapau while he prepared a strike on Coruscant; following Count Dooku's death and Grievous's failure at Coruscant, Poggle and the other Separatist leaders were sent to a fortified bunker on Mustafar, by order of Darth Sidious."}, {"tag": "p", "text": "When Anakin Skywalker, now as Sidious's new apprentice Darth Vader, arrived on Mustafar, the Separatist leaders discovered that he was sent not to reward the council, but to execute them. Poggle attempted to defend himself using his staff, to no avail, and was quickly sliced in half."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Poggle the Lesser was Human-sized and insectoid like all Geonosians, but his frame was slightly larger than his servants and he had a set of fleshy, beard-like tendrils growing around his mouth as well as a prominent head-crest. At full height, Poggle stood almost as tall as Count Dooku. As a member of the worker caste, Poggle most likely looked like an average Geonosian when he was younger; it was believed that his current physique was normal for a Geonosian of advanced age, and few outside the higher castes likely ever lived that long. He carried with him a command staff which was rumored to be made from the bones of a murdered political rival—possibly a grim trophy from the execution of Hadiss the Vaulted."}, {"tag": "p", "text": "Poggle the Lesser was described as \"analytical and pitiless, but also pragmatic… reasonable\" (in comparison to \"monster\" General Grievous). Among the Separatist Council, Poggle was the only member to be an actual head of state and military, giving him some insight into military strategy. Weaponry was one of Geonosis's primary trades and its production increased dramatically during Poggle's reign."}, {"tag": "p", "text": "Poggle the Lesser, like Nute Gunray, was aware of the existence of Darth Sidious, but like Jango Fett, he also knew that Count Dooku was Darth Tyranus. What Poggle didn't know, however, was the true identity of Lord Sidious or that the very clones used to attack him were commissioned by Sidious and Tyranus. Though not the most intelligent or diplomatically-versed being, it is notable that the Sith placed a great deal of trust in him, and that he and Count Dooku respected each other mutually (Dooku's solar sailer was a gift from Poggle), even if he was, for the most part, unaware of their true intentions. It is especially surprising in light of Dooku's Speciesist attitudes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Poggle the Lesser was voiced by Marton Csokas in Attack of the Clones. Patrick Pinney provided the voice in Star Wars: Galactic Battlegrounds: Clone Campaigns. He was voiced by Matthew Wood in the Star Wars: The Clone Wars television series."}, {"tag": "p", "text": "In the novelization of Revenge of the Sith, Poggle tried to escape, but lost his head. However, in the video game adaptation, as Anakin Skywalker used his lightsaber to cut through the door of the Separatist command center, Poggle held out his hand as he backed up against a holographic display table. When Vader finished slicing through, he Force pushed the piece of the door toward the holographic display table, crushing the Geonosian between the metal and the table. It is noted that a \"juice\" flies out of his body as Poggle the Lesser is squashed to death, almost as if he was a bug being whacked with a fly swatter (and is reminiscent of a menu animation on the Attack of the Clones DVD)."}, {"tag": "p", "text": "In the DVD commentary, it is to be said that Poggle the Lesser was made to look a lot different than other Geonosians in order to establish the fact that he was leader, just as with Boss Nass and the Gungans."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}