{"url": "Aurora_(MC80_Star_Cruiser)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic starships", "Category:MC80 Liberty Type Heavy Star Cruisers"], "nodes": [{"tag": "h1", "text": "Aurora (MC80 Star Cruiser)"}, {"tag": "p", "text": "The Aurora was an MC80 Liberty Type Heavy Star Cruiser that served in the Alliance to Restore the Republic's navy during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Aurora was an MC80 Liberty Type Heavy Star Cruiser that served as the flagship of a small Alliance fleet in the Mid Rim under the command of Admiral Gial Ackbar. The fleet consisted of nine CR90 corvettes, seven EF76 Nebulon-B escort frigates, and five GR-75 medium transports, around the time of the destruction of Alderaan."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, the Aurora notably participated in a battle at Fostar Haven, where it fought against part of a fleet of the Galactic Empire led by Imperial Commodore Rae Sloane, which was attempting to intercept a convoy of GR-75 medium transports carrying Alderaanian refugees following the destruction of their homeworld of Alderaan."}, {"tag": "p", "text": "After Echo Squadron engaged Imperial forces, the Aurora arrived behind the Imperial flagship Vigilance and other Imperial warships and began to attack. The Aurora was reinforced by several ships from its fleet, including three CR90 corvettes and one EF76 Nebulon-B escort frigate. After the convoy managed to jump into hyperspace, the rebel forces, including the Aurora, retreated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Aurora first appeared in the 2020 video game Star Wars: Squadrons by Motive Studios, a division of Electronic Arts. The Aurora was identified within the game when the vessel is targeted by the player."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}