{"url": "Poe_Dameron_8", "categories": ["Category:Real-world articles", "Category:Star Wars: Poe Dameron"], "nodes": [{"tag": "h1", "text": "Poe Dameron 8"}, {"tag": "p", "text": "Poe Dameron 8 is the eighth issue of the Marvel comic book series Star Wars: Poe Dameron. Written by Charles Soule, with art by Phil Noto, it was published on November 9, 2016."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "New Story Arc Starts Here!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While practicing hand-to-hand combat with mats, Poe Dameron vented to BB-8 about the identity of the spy. Each member of Black Squadron was a close friend of Dameron, yet each also seemed suspect."}, {"tag": "p", "text": "On the Carrion Spike, Terex is asked by his crew about their purpose being far out of First Order space, but Terex refused to answer and retreated to his quarters. He recalled his time as an stormtrooper during the Battle of Jakku."}, {"tag": "p", "text": "When a Star Destroyer crashed into the ground, Terex's corporal ordered them to keep fighting, but Terex's companion Corlac refused and shot the corporal. After convincing Terex to join him in deserting, Corlac took off his armor and buried it. Terex did the same."}, {"tag": "p", "text": "Back on the Carrion Spike, Terex gazed at his armor, now embellished and modified."}, {"tag": "p", "text": "On D'Qar, Muva repaired Dameron's starfighter. Dameron allowed Muva to take it for a test flight. C-3PO interrupted, informing Dameron that one of their droid spies on Kaddak had sent word that it acquired much crucial intelligence on the First Order, including the location of Supreme Leader Snoke. However, the transmission ended before the information could be sent, and Dameron was to take C-3PO and another Black Squadron pilot to uncover the truth. However, Dameron still did not know who the traitor was and decides to travel on a freighter with BB-8 and C-3PO."}, {"tag": "p", "text": "Captain Phasma asked for a report from Terex on his actions, but he disabled all communications, weapons, and engines on the Carrion Spike."}, {"tag": "p", "text": "Returning to Terex's Jakku flashback, Corlac and Terex built an ugly from the cockpit of an AT-AT, the engines of an U-wing, and the wings of a TIE Interceptor. Terex insisted on regrouping with the Empire, but Corlac wanted to go to the Outer Rim first. Terex went to get one last thing before they left."}, {"tag": "p", "text": "Looking at the smuggling freighter they were going to fly to Kaddak in, Dameron warned it would not be very helpful in getting out of trouble."}, {"tag": "p", "text": "On the Carrion Spike, Terex emerged from his quarters in his old armor, which was the thing he had retrieved from Jakku before he left."}, {"tag": "p", "text": "Muva thanked Dameron for allowing him on the mission, but Dameron warned that Kaddak was a completely lawless planet."}, {"tag": "p", "text": "The Carrion Spike landed on Kaddak, where Terex left the ship and the crew behind as he went out to find something important that he had lost. In the past, Kaddak was also the planet that Corlac and Terex flew to, and now Dameron arrived there as well."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}