{"url": "Poe_to_the_Rescue", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: The Resistance Rises"], "nodes": [{"tag": "h1", "text": "Poe to the Rescue"}, {"tag": "p", "text": "Poe to the Rescue was the first episode of the LEGO Star Wars: The Resistance Rises series. It details Commander Poe Dameron, along with C-3PO and BB-8 infiltrating and rescuing Admiral Ackbar from the First Order."}, {"tag": "h2", "text": "Opening Crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Resistance leader Admiral Ackbar is being held as a prisoner aboard a First Order Resurgent-class Star Destroyer. Captain Phasma and another officer enter the cell to interrogate Ackbar about the location of the Resistance base. The Admiral is still defiant and throws a watering can at the officer. Undaunted, Phasma warns Ackbar that Kylo Ren is coming to interrogate him and that he is not as \"warm and cuddly as her.\""}, {"tag": "p", "text": "Meanwhile, C-3PO, who is sporting a red arm on an acidic planet, is picked up by the Resistance pilot Poe Dameron in a captured First Order Atmospheric Assault Lander. C-3PO informs Poe that Admiral Ackbar is being held aboard a Star Destroyer in the Bakura sector. The two are also joined by Poe's droid BB-8, whom Threepio argues with during the journey. For the rescue mission, Poe disguises his lander as a First Order ship. When C-3PO waves and talks about his red arm, Poe asks about it. But the droid is too embarrassed to talk about it."}, {"tag": "p", "text": "Shortly later, Poe's ship exits hyperspace and docks in the Star Destroyer's hangar bay. The same First Order officer greets the shuttle, thinking that Kylo Ren has arrived. However, Poe and the droids flatten him with the ship's door and quickly overpower his squad of stormtroopers. Moving into the ship's corridors, Poe uses a stolen stormtrooper helmet as a bowl to knock out another squad of stormtroopers like bowling pins. Poe soon finds Ackbar's cell and tells the Admiral he has come to rescue him."}, {"tag": "p", "text": "C-3PO and BB-8 however accidentally release a whole host of Aliens and other creatures from the cell including Jawas and a Wampa. In the end, Poe blasts Ackbar's cell door open with his blaster. The newly-freed alien prisoners run over Captain Phasma and two of her stormtroopers. Phasma orders hers troops to stop the rebels from escaping but they and the aliens make it back to the atmospheric lander. Phasma then sends several TIE/fo space superiority fighters and TIE/sf space superiority fighters after them."}, {"tag": "p", "text": "Poe's ship narrowly avoids colliding with Kylo Ren's command shuttle. Kylo is forced to take evasive action to avoid crashing into the TIEs. Upon landing in the Star Destroyer's hangar bay, he is greeted by the same First Order officer; whom he hurls aside with The Force. Kylo then reprimands Phasma for failing him for the first time. Meanwhile, the TIEs pursue Poe's ship. C-3PO moans about the stress the pursuit is causing him while Ackbar thinks that they will not make it. However, Poe tells the, to hang on before leading them into an asteroid field."}, {"tag": "p", "text": "Poe hides the stolen atmospheric lander behind a large asteroid. Two First Order TIE Fighter Pilots in their TIE/sf fighter spot the ship and destroy it. However, it turns out to be a decoy and Poe destroys their fighter with his T-70 X-wing starfighter. Meanwhile, Ackbar and C-3PO have boarded an old Delta-7 Aethersprite-class light interceptor, identical to the Azure Angel. Watching the fray, C-3PO praises Poe for being full of surprises. However, they are soon pursued by the remaining TIE fighters. Ackbar's ship is soon hit by enemy fire and C-3PO falls off with part of the ship. BB-8 rescues him and fixes him back to Ackbar's ship. Poe then flies behind the two TIEs and blasts them to pieces."}, {"tag": "p", "text": "Having accomplished their mission, the rebels head back to the Resistance base. Ackbar asks Threepio about his new red arm but the protocol droid is too embarrassed to talk about it; prompting Poe to ask why he keeps on bringing attention to it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In 2016, Poe to the Rescue was adapted as a bonus level in the video game LEGO Star Wars: The Force Awakens."}, {"tag": "p", "text": "The events of this episode take place mostly after C-3PO gets his red arm in the Star Wars one-shot comic Star Wars Special: C-3PO 1. The special partly begins with the scene of Poe rescuing C-3PO from a location that is weathering acid rain, a scene that was also depicted in the comic, albeit with certain differences, such as the fact that in the comic C-3PO had not yet attached the red arm to his body, and he especially emphasized the deaths of the other survivors of the wreckage, whereas in the short C-3PO had already attached the red arm to his body and he makes no such references to any other survivors of the initial wreckage that he endured."}, {"tag": "h2", "text": "Notes and references"}]}