{"url": "Poe_Dameron_5", "categories": ["Category:Canon articles", "Category:Star Wars: Poe Dameron"], "nodes": [{"tag": "h1", "text": "Poe Dameron 5"}, {"tag": "p", "text": "Poe Dameron 5 is the fifth issue of the Marvel comic book series Star Wars: Poe Dameron. Written by Charles Soule, with art by Phil Noto, it was released on August 17, 2016."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Outside of the fortress, L'ampar wondered if they should go in and check on Dameron. However, Pava reminded him they were unarmed, and could only continue to wait or brave the angry mob outside. Terex emerged from the fortress, to the squadron's surprise, and walked outside of the wall. Instead of attacking him, the mob bowed down in respect. Dameron emerged as well, and explained the situation of the race to break out Grakkus."}, {"tag": "p", "text": "Dameron contacted BB-8, and told him to begin Operation Upside. Together, the Resistance astromechs left their starfighters and rolled out of the hangar."}, {"tag": "p", "text": "Terex met with his old criminal accomplices: Kan Be, Toren, and Isin. He revealed that he would not actually break out Grakkus, but instead use their help to kill Dameron and his fellow pilots, extract the information from Grakkus and then kill him, and break out the three."}, {"tag": "p", "text": "The droids connected themselves to the prison's system, but suddenly three prison guards walked near. Quickly, the droids flew up to the ceiling. However, R4's booster cut out, and the droid fell on one of the guards. The remaining guards discovered the droids near the ceiling, so O-R10N fell, electrocuted one guard, and hit the last guard's head with its leg. BB-8 praised O-R10N for its quick work."}, {"tag": "p", "text": "Pava scraped a device with a rock, but accidentally scraped herself. Frustrated, she threw the rock at a nearby Hutt. She complained to Dameron about being helpless and not in control. An explosion sounded at the wall's doors as the mob tried to use a battering ram to break down the doors. Dameron tried to convince Grakkus that Terex was untrustworthy, but Grakkus was confident that it was all part of Terex's plan. Black Squadron took some nearby rods as weapons as the doors began to fall apart."}, {"tag": "p", "text": "A worker warned Warden Luta of the activity around Grakkus' fortress, but she decided not to intervene. Suddenly, an alarm sounded, warning of an incursion in the primary security field generator. Guards quickly rushed to the scene."}, {"tag": "p", "text": "Hearing the alarm, the droids withdrew from the generator and rolled away in different directions. BB-8 and O-R10N moved toward a door, but they were met by a large security droid."}, {"tag": "p", "text": "The Hutts fired stun blasts into the mob, but they continued to rush in. Black Squadron used their rods to fight as well. The Hutts retreated into the fortress, closing the door and leaving the squadron to fend for themselves."}, {"tag": "p", "text": "O-R10N flew at the security droid, but it easily crushed the astromech in its fist. BB-8 activated his arc welder as the security droid activated an energy blade."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}