{"url": "Poe_Dameron_11", "categories": ["Category:Real-world articles", "Category:Star Wars: Poe Dameron"], "nodes": [{"tag": "h1", "text": "Poe Dameron 11"}, {"tag": "p", "text": "Poe Dameron 11 is the eleventh issue of the Marvel comic book series Star Wars: Poe Dameron. The comic is written by Charles Soule with art by Phil Noto. It was released on February 15, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In the Outer Rim's Kaddak system, Poe decides to travel into hyperspace after being unable to contact his fellow Resistance operative Oddy Muva. C-3PO and N1-ZX are stored in special compartments built into his T-70 X-wing starfighter Black One. Meanwhile, Terex's Carrion Spike and an armada of \"Ugly\" starfighters head out in pursuit of Poe. Oddy Muva infiltrates the Carrion Spike and overhears a conversation between Terex and the Ranc gangster Zumgi. In the bridge, Terex is informed that his men are tracking Dameron's X-wing. He orders his subordinates to prepare the fleet and to let him know when they drop back into realspace. Terex wants to use the Ranc gang because he feels constrained by the First Order hierarchy."}, {"tag": "p", "text": "In his private chamber, Terex talks via hologram with a disapproving Captain Phasma, who is displeased with him for soliciting criminals and orders him to abandon his plan to capture Dameron. Terex refuses and ends the transmission. Terex is then served by an Abednedo slave Sowa Chuan, who turns out to be Oddy Muva's wife. Meanwhile in hyperspace, Poe, C-3PO, and BB-8 discuss how Terex has been able to tail his movements. After reflecting on the past events, Poe concludes that the spy is Oddy Muva."}, {"tag": "p", "text": "Aboard the Carrion Spike, Oddy Muva accosts Terex's henchman Zumgi. Following a brief struggle, he manages to knock Zumgi's vibroblade out of his hand and forces him to lead him to his wife. Elsewhere, Poe Dameron pulls out of hyperspace and confronts N1-ZX. He tells the BX-series droid commando that he suspects that the information he is carrying is part of a trick by Terex to lure the Resistance into a trap. At that point, Terex's armada emerges from hyperspace. Terex realizes that Poe has figured out his plan and has dropped in uncharted space instead of the Resistance base. Terex orders the Ranc gang to pursue and kill Poe."}, {"tag": "p", "text": "While BB-8 tries to calculate a new set of hyperspace coordinates, Poe engages in a dogfight with the \"Uglies.\" After shooting down several \"Uglies,\" Poe's X-wing is hit by enemy fire and crashlands on a desert planet."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}