{"url": "Poe_Dameron_7", "categories": ["Category:Real-world articles", "Category:Star Wars: Poe Dameron"], "nodes": [{"tag": "h1", "text": "Poe Dameron 7"}, {"tag": "p", "text": "Poe Dameron 7 is the seventh issue of the Marvel comic book series Star Wars: Poe Dameron. Written by Charles Soule, with art by Angel Unzueta, it was published on October 26, 2016."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Having bested Agent Terex and the First Order's stormtroopers in the previous issue, Poe Dameron and the other pilots of Black Squadron have escaped from Megalox Beta and returned to the Resistance base on D'Qar to deliver the intelligence given to them by Grakkus the Hutt to General Leia Organa—the newest lead in their continued search for Lor San Tekka, who they believe possesses knowledge of the secret location of missing Jedi Luke Skywalker. For now, though, the search has been put on-hold, due to a more pressing and immediate concern. Leia believes there is a spy in their midst, and she has assigned her best pilot, Poe Dameron, to the task of tracking down the suspected leak and plugging it."}, {"tag": "p", "text": "In spite of the importance of this task, Poe Dameron has a personal mission to complete beforehand. An old friend has contacted him and urgently requested a meeting. And so, Poe departs D'Qar for the storm-wrought gas giant of Pheryon for a rendezvous. There he meets his old friend, Suralinda Javos, ex-member of the New Republic Navy and now an investigative journalist for Galaxy Beacon. As they sit down in a spacious and lavish cantina to share a drink and catch up, their reunion is prematurely cut short by the appearance of a group of thugs with Suralinda as their target."}, {"tag": "p", "text": "With haste, and dodging a flurry of blaster fire, the two make their retreat. As Poe is on leave without his ship, and they are both unarmed, they \"borrow\" (steal) a civilian's stormsailer and head for the clouds. Safe from their attackers in the moment, Suralinda reveals that she has sought out Poe to deliver her own brand of intelligence to the Resistance. She has uncovered evidence that the First Order is breaking the terms of their treaty with the New Republic by building their own military installations, shipyards, weapons research facilities, as well as something else, \"something big.\" She clarifies that she is not giving this info out freely, but for a reward, and wants Poe to take her directly to Leia so she can sell it to her."}, {"tag": "p", "text": "Their pursuers soon catch up with them in ships of their own—ships that are equipped for combat. Despite the dismal prospects for survival, Poe decides to fly the stormsailer to the lowest possible point, closest to the stormsea where the weather conditions are the most hazardous in a desperate attempt to boost their speed and lose their assailants for good. They emerge relatively unscathed, with their pursuit permanently shaken."}, {"tag": "p", "text": "Having landed safe and sound, Poe decides to catch his breath and wait with the stormsailer, while Suralinda temporarily splits up with him, and makes her way alone to a nearby tavern for a drink and directions off-world. Inside, a group of First Order stormtroopers outfitted in full armor and wrapped in grey cloaks—being led by a hooded officer who introduces himself as Lieutenant Weel—ambush her and escort her away at blasterpoint. As they are arresting her, they execute all witnesses in the tavern. She screams to Poe for help as they emerge into the streets to take her away for a \"discussion.\" But before Poe can react, Weel orders his forces to subdue him also. It seems that Weel is an associate of Terex and that Terex has put out an \"acquisition order\" for his rival, Poe."}, {"tag": "p", "text": "Tied up separately in what appears to be a warehouse on Pheryon, Lieutenant Weel identifies himself as First Order Security Bureau, and begins his interrogation of Suralinda with a knife in hand. He demands that she tell him what she has ostensibly learned about the First Order. Meanwhile, Poe attempts to appeal to the egos of his captors, demanding that they release him and challenging them to single combat. If one of them win, they get to boast that they single-handedly defeated the most famous pilot in the galaxy. If he wins, he secures his freedom. His proposal is forthrightly rejected."}, {"tag": "p", "text": "Suralinda, on the other hand, lies to Weel causing him to drop his guard, then kills him with a corrosive spray ejected from her mouth—an intrinsic biological function of her species. Weel, in his death throes, drops the vibroknife as he falls writhing in agony. After retrieving the knife and freeing herself from her bonds, Suralinda goes on to rescue Poe, taking out the stormtroopers with Weel's blaster. They then depart Pheryon aboard a First Order ship. Poe takes her immediately to the Resistance base on D'Qar and goes off to track down Leia. Forced to remain on the ship, Suralinda hacks its navicomputer to discover their location."}, {"tag": "h4", "text": "Suralinda's flashback"}, {"tag": "p", "text": "As she awaits Leia, Suralinda has some time alone to reflect on her choices. We catch a few glimpses of her most recent memories, which show her real motives in contacting Poe. Back on Hosnian Prime, at the office of the Galaxy Beacon, her boss expresses his dissatisfaction with the mediocrity of her work (another exposé on slavery under the Empire), and compels her to dig up something about Leia's secret military force, i.e. its location. Elsewhere, she pays a group of thugs to assail them on Pheryon. Back in the present, Suralinda uses the ship's comlink to contact her boss and quits her job."}, {"tag": "p", "text": "Poe soon returns, bringing with him General Organa. Expecting Suralinda to pitch her intel-for-sale and be off, they witness an unexpected change of heart. She confesses that she manipulated Poe, lying to him that she had discovered any secrets and was being hunted to be silenced (paying a group of thugs to assail them in order to make the ruse more convincing to Poe) so he would take her to D'Qar and she could report her finding to the Galaxy Beacon. Whereas journalists are supposed to remain neutral in all matters, instead, she begs to join the Resistance. Apparently her experiences with Poe, and in witnessing the violence and cruelty of the First Order, she has been convinced of choosing a side."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}