{"url": "Poe_Dameron_6", "categories": ["Category:Canon articles", "Category:Star Wars: Poe Dameron"], "nodes": [{"tag": "h1", "text": "Poe Dameron 6"}, {"tag": "p", "text": "Poe Dameron 6 is the sixth issue of the Marvel comic book series Star Wars: Poe Dameron. Written by Charles Soule, with art by Phil Noto, it was published on September 7, 2016."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "At the space station above Megalox Beta, BB-8 battles with a hulking security droid for control of the generator, which creates a grav-field dome around the Megalox prison. On the surface, Poe Dameron and his Black Squadron fight against the other prisoners outside Grakkus the Hutt's fortress. BB-8 manages to use his cable to fry the security droid's circuits, toppling it."}, {"tag": "p", "text": "Near Grakkus' fortress, the First Order agent Terex and the gangsters Isin, Kan Be, and Papa Toren observe the skirmish as the gangsters try to fight their way through Black Squadron. L'ulo L'ampar demands that Grakkus let them in if he wants them to help him escape. However, Grakkus decides to keep the offer close because he had already made a deal with Terex, his old friend. With Temmin Wexley nursing a wound to his head, Poe Dameron reassures Karé Kun to keep them at bay a little longer while the droids do their work."}, {"tag": "p", "text": "Meanwhile, BB-8 and his fellow astromech droids deactivate the grav-field dome. Poe tells his men to wear their gravity belts. The dome collapses and many of the gangsters are overwhelmed by the high gravity on Megalox Beta. While Isin, Kan, Be and Toren think that Warden Luta wanted to stop the riot, Terex realizes that Poe was behind this. Black Squadron force their way inside Grakkus' fortress and offer to help him escape."}, {"tag": "p", "text": "At the space station, Warden Luta and her crew find that they have been locked out of every system. Luta receives a message from Poe Dameron and his Black Squadron. Poe tells her that he knew that Agent Terex had bribed her into make sure that Black Squadron did not leave the planet alive, despite paying for safe passage down here. With Grakkus in tow, Poe offers to give her back control of the prison if she lets them leave Megalox Beta. Luta accepts Dameron's offer, not wanting the prisoners to be crushed to death by the gravity."}, {"tag": "p", "text": "While Papa Toren deals with the death of one of his Ximpi, Kan Be tells Terex that they will be crushed to death soon. He disagrees and summons his ship, the Carrion Spike. After activating his gravity belt, Terex tells his former criminal associates that he is abandoning them because they failed to kill Grakkus, Poe, and Black Squadron. At the space station, Poe tells a freed Grakkus that he can escape in one of the station's shuttles. They promise to escort him. They are soon joined by the astromechs with the exception of Jessika Pava's droid O-R10N, who was destroyed during the mission."}, {"tag": "p", "text": "As they leave the space station, BB-8 transmits the control codes for Megalox back to Warden Luta. Before they can turn the gravity field back on, Terex flies the Carrion Spike through the space station, disabling its systems. Grakkus panics and asks Poe to transmit the coordinates since his ship lacks a nav computer capable of doing calculations. With the space station's systems failing, Warden Luta sends emergency shuttles to evacuate the prisoners from Megalox. However, the Carrion Spike begins attacking the shuttles and their escape pods."}, {"tag": "p", "text": "Temmin warns Poe of the news but Grakkus opines they should let them kill each other and reminds them of their mission to keep him safe. Poe orders Black Squadron to attack the Carrion Spike. Terex orders his crew to kill them all but the ship sustains damage from the starfighters. With the Carrion Spike damaged, Terex reluctantly authorizes his crew to cloak the ship and jump to lightspeed."}, {"tag": "p", "text": "Back at the Resistance base on D'Qar, Poe is debriefed by General Leia Organa about the information that Grakkus had provided about Lor San Tekka. When Poe asks about following these new leads, General Organa instructs him to return to the Crèche since they were the only ones to give the information about the explorer's visit to Grakkus to Poe. Aboard the damaged Carrion Spike, Captain Phasma asks Terex about his failed mission to Megalox. She orders him to return to First Order space for debriefing. Privately, Terex decides to delay his return."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}