{"url": "Polis_Massan_medical_facility", "categories": ["Category:Legends articles", "Category:Medical facilities"], "nodes": [{"tag": "h1", "text": "Polis Massan medical facility"}, {"tag": "p", "text": "The Polis Massan medical facility (Polis Massa medical center) was an advanced surgical center located on the asteroid colony of Polis Massa. It was here that Padmé Amidala gave birth to twins, Luke and Leia."}, {"tag": "h2", "text": "Features"}, {"tag": "p", "text": "The colonists of the Polis Massa asteroid had set up archaeological dig sites with the aim of uncovering the mysteries of the lost natives of the original planet of Polis Massa. These aliens came to be known as Polis Massans themselves, and established a small yet efficient civilization on the arid asteroid. One of the major facilities on Polis Massa was the medical center, used for surgical and research purposes. Artifacts retrieved from the dig sites were brought to the medical facility for examination by Polis Massan exobiologists, who scanned the pieces for organic tissue suitable for cloning. Having learned the secrets of cloning from the natives of Kamino, the Polis Massans were experts in the field, and were renowned for their medical expertise."}, {"tag": "p", "text": "The medical facility comprised a series of squat, white buildings and domes, with the main medical center rising slightly higher from the rear of the facility. A landing pad was connected to the facility, allowing those few visitors who traveled to Polis Massa easy access to the medcenter. An observation dome overlooked the compound."}, {"tag": "p", "text": "Within the antiseptic interior of the Polis Massa medical facility lay a fully-equipped surgical theater. This operating room was supervised by several Polis Massan exobiologists and medtechs, while a GH-7 medical and midwife droids performed surgery and delivered babies. Wall displays and scanners adorned the chamber, while a transparisteel partition separated the theater from onlookers outside. A single, cushioned operating table stood in the middle of the theater room."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Padmé Amidala was brought to the Polis Massa medical facility by Obi-Wan Kenobi following the formation of the Galactic Empire. In a critical condition, and with the birth of her twins imminent, Padmé was tended to by four Polis Massan medtechs and their surgical droids. A midwife droid assisted with Padmé's labor, but the medics were unable to save Amidala. Though the twins were born and adopted by loving families, Padmé died in the operating theater—not due to her injuries, but because, perhaps, a broken heart can never truly be mended."}, {"tag": "p", "text": "During the rise of the Empire, the facility was home to a Rebel cell which Imperial Intelligence believed the Death Star plans were transmitted to. Acting on this information, the Imperial 501st Legion invaded the facility and terminated all Rebel activity in the area."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}]}