{"url": "Polis_Massa_Research_Base", "categories": ["Category:Legends articles", "Category:Galactic Republic locations", "Category:Polis Massa locations"], "nodes": [{"tag": "h1", "text": "Polis Massa Research Base"}, {"tag": "p", "text": "The Polis Massa Research Base, also known simply as Polis Massa Base, was a facility set up by the Kallidahin people on the largest of the asteroid fragments of the former planet Polis Massa. The Kallidahin archaeologists hoped to uncover an evolutionary link between their species and the extinct natives of Polis Massa, the Eellayin."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Research at Polis Massa Base continued for around five hundred years, with surveys and excavations taking place throughout the asteroid belt. Fifty years prior to the formation of the Galactic Empire, researchers uncovered the ruins of the ancient city of Wiyentaah in close proximity to the base itself. A Local Dig project was quickly set up, with artifacts found during excavation taken back to the Research Base for study."}, {"tag": "p", "text": "The researchers were not content with merely studying their finds, however. With cloning skills learned from the Kaminoans, the xenobiologists at Research Base hoped to resurrect extinct organisms from ancient biological material found at the Local Dig. This project brought about the need for a sophisticated biomedical facility, constructed as part of the Polis Massa Base."}, {"tag": "p", "text": "The sterile medical facility was stocked with the latest scientific technology, and contained rooms dedicated to the study of relics, and medcenters designed for experimentations on genetic material brought to the facility. Observation domes looked out over the complex (e.g. Wayside Dome and Topside Dome), and two landing bays provided access to the main base. Larger ships could touch down on the surface of the asteroid itself."}, {"tag": "p", "text": "Obi-Wan Kenobi brought Padmé Amidala to Polis Massa Base for immediate treatment to deliver her twins. Padmé's treatment was overseen by a GH-7 medical analysis unit, who was soon joined by a midwife droid when Amidala went into labor. Though the droid successfully delivered her twins, Padmé herself succumbed to her mental injuries, and died on the operating table after losing the will to live."}, {"tag": "p", "text": "Later, the base was attacked by the Galactic Empire. The battle was fought over the Death Star plans that were beamed from the Death Star during a prison break."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}