{"url": "Politrix", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Humans", "Category:Jedi Generals", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Politrix"}, {"tag": "p", "text": "Politrix was a Human female Jedi who lived during the last years of the Galactic Republic. After being raised at the Jedi Temple on the planet Coruscant, she reached the rank of Jedi Knight. Two months after the beginning of the Clone Wars, Politrix was killed by a plasma grenade during a Confederate ambush."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Politrix was a Force-sensitive Human female who lived in the final years of the Republic Classic era. Raised at the Jedi Temple on the Republic capital planet Coruscant after having been discovered to be sensitive to the Force, Politrix was a contemporary of fellow academy initiates Jang Li-Li and Jai Maruk. During their time at the Temple, Politrix and Maruk harbored secret feelings for each other, but they stayed true to the Jedi Code, and their relationship never blossomed. Eventually, Politrix achieved the rank of Jedi Knight after completing her Trials of Knighthood."}, {"tag": "p", "text": "When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems on the planet Geonosis in 22 BBY, Politrix received the rank of General within the newly-formed Grand Army of the Republic. Two months after the start of the war, Politrix was leading troops against the Separatist Droid Army when she was killed by a plasma grenade during an ambush. Maruk remembered his dead friend nearly three years later on a mission to Vjun."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Politrix was an athletic Human female with red curls. Fellow Jedi Jai Maruk considered her to be very attractive. She possessed the skills to become a Jedi Knight but was nevertheless killed early in the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Politrix was first mentioned in Yoda: Dark Rendezvous, a novel written by Sean Stewart and published in 2004. She later received an entry in The Complete Star Wars Encyclopedia, published in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}