{"url": "Pomi_Harchmak", "categories": ["Category:Canon articles", "Category:Females", "Category:Lutrillians"], "nodes": [{"tag": "h1", "text": "Pomi Harchmak"}, {"tag": "p", "text": "Pomi Harchmak was a Lutrillian female who served as a coordinator responsible for opening deepwaves in Pryce Mining. She was accused of embezzlement by Senator Domus Renking and Arihnda Pryce in order to exonerate the latter's mother Elainye Pryce."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Pomi Harchmak was a heavy equipment inventory operations handler who lived on Lothal during the Imperial Era. She worked for Pryce Mining and had a separate account from the main operation fund. After Governor Ryder Azadi framed Arihnda Pryce's mother Elainye Pryce for embezzlement in order to exert pressure on Arihnda to sell the company, Arihnda and Senator Domus Renking reviewed security footage from a party that Pryce Mining held two weeks ago during the company's latest financial dip."}, {"tag": "p", "text": "According to Arihnda's mother Elainye Pryce, Pomi suffered from digestive problems. She made three trips out of the room during the party to use the refresher. However, Arihnda believed that she was instead going to the central office cluster which allowed her to access the entire inventory system. While Arihnda was uncertain about Pomi's guilt or innocence since the company's financial records had detected no signs of unusual transactions, she decided to pin the blame for embezzlement on Pomi in order to clear her mother's name."}, {"tag": "p", "text": "To prevent Governor Azadi from accessing the Pryce family mine and its valuable doonium vein, Arihnda accepted Senator Renking's offer to sell the mine to the Galactic Empire. As compensation, Arihnda and her family were offered jobs on Coruscant and Batonn respectively."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Pomi Harchmak was a female Lutrillian who worked as Pryce Mining's heavy equipment inventory operations handler. According to Arihnda's mother Elainye, Harchmak suffered from digestive problems which led her to make frequent trips to the refresher. However, Arihnda thought that Harckmak was using those trips to access the company's inventory system in order to steal funds. While Pryce was uncertain of her guilt, she pinned the blame on her to clear her mother Elainye of embezzlement."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pomi Harchmak first appeared as a background character in Timothy Zahn's 2017 novel Thrawn, a rebooted origins story of the eponymous character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}