{"url": "Polus", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Ice planets", "Category:Oricho sector planets"], "nodes": [{"tag": "h1", "text": "Polus"}, {"tag": "p", "text": "Polus was an ice world orbiting the binary star Avindia of the Avindia system in the Outer Rim Territories. A frigid, mountainous planet, it had a massive frozen ocean and blizzards as well as ice storms that would frequently scour the planet's surface. Its average day temperature was 50 degrees below freezing. Polus was the homeworld of the Pyn'gani, a near-Human species."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Polus was situated in the Avindia system of the Oricho sector in the Outer Rim Territories and had a diameter of 9,562 kilometers. The planet was located between the Braxant Run and Celanon Spur and orbited the binary star Avindia. Polus was an arctic, mostly mountainous planet with one massive frozen ocean. The average daytime temperature was 50 below freezing with frequent blizzards and ice storms and a brief but seasonal warming period when the planet received light from both of its suns. Polus was also orbited by a moon and inhabited by Dral'k ice worms as well as various other aquatic life forms."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Polus was home to the Pyn'gani, a near-Human species. The Pyn'gani played a major role in creating carbon freezing, and mining produced a large proportion of income for Polus. In 995 BBY, the Pyn'gani Jedi Master Anno Wen-Chii and his Padawan Nalia Adollu traveled to the planet to study how life evolved in the galaxy."}, {"tag": "p", "text": "In 0 BBY, Polus was a head-quarters of the Alliance to Restore the Republic, equipped with a planetary ion cannon and was attacked and captured by the Galactic Empire. Around 3 ABY, the Zann Consortium raided the planet, enslaving the native Pyn'gani."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The Pyn'gani were a near-Human species native to Polus. To protect them from the extreme cold of their homeworld, their cities were shielded by heat generators. The Pyn'gani played a major role in creating carbon freezing, and they received substantial income through mining. The Planet had a population of 600,000 around the time of the Galactic Civil War, with the main spoken language was that of the Pyn'gani itself. The Pyn'gani feared foreigners, but were interested in new technology."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Polus first appeared in the game Star Wars: Empire at War and in the expansion pack Star Wars: Empire at War: Forces of Corruption. The planet was mentioned in the guides to the games, and received an entry in The Complete Star Wars Encyclopedia as well as The Essential Atlas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}