{"url": "Pomojema", "categories": ["Category:Legends articles", "Category:Deities"], "nodes": [{"tag": "h1", "text": "Pomojema"}, {"tag": "p", "text": "Pomojema was a minor god who was worshiped by natives of Mimban as a healer-god, before the planet's mining settlements grew culturally disruptive. He was believed to have a humanoid body, wings, and a face of tentacles. Priests of the Temple of Pomojema used a Kaiburr crystal to amplify their Force powers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Mimbanites, Coways, Thrella, and other sentients of the planet Mimban had thousands of deities, each of which had their own temples and sanctuaries scattered across the planet. Of these Pomojema hardly stood out. A minor god of healing, the exact nature of Pomojema's worship and powers had been all but lost to history by the time of Imperial occupation during the Galactic Civil War. Those who did know about Pomojema often thought the tales of miraculous healing done in his service were little more than superstitions. However, the Temple of Pomojema was the resting place of the fabulous Kaiburr crystal, an artifact that amplified the Force power of anyone who used it. It was possible that the tales of Pomojema's healing abilities were a result of Force healing amplified through use of the Kaiburr crystal."}, {"tag": "p", "text": "By the year 2 ABY the Temple of Pomojema had been abandoned, save for a Hssiss who had taken up residence there, possibly due to the Kaiburr crystal's connection with the Force. Princess Leia Organa and Luke Skywalker dueled Darth Vader, who sought the Kaiburr crystal in the temple, giving their associate Halla the chance to claim the crystal."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Pomojema was known for his healing ability. The statue of Pomojema in his temple depicted him as vaguely humanoid, with two leathery wings, and hands and feet with enormous claws. Beneath his eyes there was no humanoid face, but rather a collection of writhing tentacles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Author Joseph Bongiorno has hinted at a connection between Pomojema and Typhojem. While the connection has not been made explicit in any published source, comments by Bongiorno give credence to the description of Pomojema's image being quite similar to the description of the god-creature Cthulhu described in the works of horror writer Howard Phillips Lovecraft."}, {"tag": "p", "text": "Early concept art for Rogue One: A Star Wars Story used the Temple of Pomojema as a setting, before the Temple of the Kyber was developed to replace it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}