{"url": "Aut-O", "categories": ["Category:Canon articles", "Category:Masculine programming", "Category:Separatist admirals and generals", "Category:Separatist droid officers", "Category:Super tactical droids"], "nodes": [{"tag": "h1", "text": "Aut-O"}, {"tag": "p", "text": "Aut-O was an ST-series military strategic analysis and tactics droid who commanded a Separatist fleet from his flagship. His fleet was infiltrated by the D-Squad, who stole the Confederacy's encryption module. He was decapitated by R2-D2."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Clone Wars, Aut-O commanded a fleet consisting of mainly Recusant-class light destroyers and one Providence-class Dreadnought. His flagship carried an encryption module that was needed to decipher a coded transmission sent out by General Grievous to his allies. Meanwhile, the D-Squad infiltrated Aut-O's command ship with a stolen Confederate shuttle, with intent to steal the module. The droid squad, led by colonel Meebur Gascon, were able to get past the battle droid security, and got to C-Deck, where the module was being held. After multiple energy fluctuations, Aut-O decided to investigate the phenomenons himself. Taking several B1-series battle droids and B2-series super battle droids with him, Aut-O made his way to C-Deck, where he discovered D-Squad attempting to steal the encryption module."}, {"tag": "p", "text": "He first held R2-D2 at gunpoint, but the plucky little astromech was able to turn off the gravity, causing all the droids to float helplessly around. Aut-O's escort was completely destroyed by the Republic forces, while Aut-0 tried to stop R2 himself, also eliminate Colonel Gascon. In the process, Aut-O held tight onto R2's legs, trying to stop the droid, but R2 was able to burn and melt the super tactical droid's hands with his rocket boosters. Suddenly, Gascon jumped onto Aut-O's head, kicking the droid's optical sensors. Aut-O only defeated Gascon by shaking his head, but the pesky Zilkin was able to regain strength and jump back at Aut-O, who started firing on him. Aut-O was hit out of nowhere by WAC-47 holding a droid leg. Aut-O struck back in retaliation and knocked down WAC, who was distracted by Gascon. With WAC out of the way, Aut-O continued to pull down R2 who had gotten to the module. Aut-O tried at the same time to pull down the astromech and swat Gascon who was nearby."}, {"tag": "p", "text": "In the end, WAC-47 activated the gravity that was previously shut off. Aut-O fell, then proceeded to crush Gascon. Witnessing this, R2 purposely dropped onto Aut-O, beheading him. As a result, D-Squad was able to get the encryption module in their possession. Yet, after Aut-O's death, he sent out a distress signal which triggered an alarm. However, battle droids on patrol mistook D-Squad for crew members, allowing the squad to flee Aut-O's flagship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aut-O was voiced by Dee Bradley Baker who voices the clone troopers in Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}