{"url": "Pong_Krell", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Besalisks", "Category:Fallen Jedi", "Category:Jedi Generals", "Category:Jedi Masters of the Jedi Order", "Category:Males", "Category:Sith individuals", "Category:Warlords"], "nodes": [{"tag": "h1", "text": "Pong Krell"}, {"tag": "p", "text": "Pong Krell was a Besalisk male Jedi Master who, during the Clone Wars, served as a Jedi General in the Grand Army of the Republic. However, by the time of the Battle of Umbara, Krell foresaw the end of both the Jedi Order and the Galactic Republic, and he sought to join the New Order that was to come, having secretly turned to the dark side of the Force and allying himself with the Sith. Armed with two double-bladed lightsabers, Krell was an aggressive fighter and exceptionally skilled in close-quarters combat. Although he held the record for the most clone trooper casualties, his war record contained many key victories, marking Krell as one of the most successful generals in the Republic Military."}, {"tag": "p", "text": "During the campaign on Umbara, Krell temporarily replaced Jedi General Anakin Skywalker as the commanding officer of the 501st Legion. He sought to undermine the Republic's efforts to occupy the Separatist planet, believing his actions would lead to an apprenticeship under Count Dooku. The legion mutinied against Krell after the general tricked them into fighting other clones; aided by the 212th Attack Battalion, the 501st managed to capture Krell. After learning of his plans through interrogation, Clone Captain CT-7567 \"Rex\" resolved to execute Krell for committing treason, however it was trooper CT-6922 \"Dogma\" who ultimately shot the fallen Jedi, resulting in Krell's death."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "A Besalisk male Force-sensitive, Pong Krell ascended to the rank of Master in the Jedi Order by the time of the Clone Wars. As the Jedi were called into service by the Galactic Republic, Krell joined the war as a General in the newly formed Grand Army of the Republic. Despite high casualties of clone troopers under his command, Krell achieved many victories."}, {"tag": "p", "text": "As the war progressed, Krell became seduced by the dark side of the Force. He then received a premonition about the future; the Jedi were all but extinct, the Republic was destroyed from the inside, and a New Order rose in its place. This caused Krell to betray both the Republic and Jedi Order. Outwardly, he maintained his Jedi facade, but secretly he had renounced the Jedi way and became affiliated with the Sith. He acted as a double agent to sabotage the Republic's efforts and he sought to become the new apprentice of Sith Lord and Separatist leader Count Dooku and gain a position of power in the New Order. Although Supreme Chancellor Palpatine became aware of his high casualties of clone troopers and questionable character, he was content with allowing Pong Krell to wreak havoc among the clone troopers."}, {"tag": "h4", "text": "Battle of Umbara"}, {"tag": "p", "text": "In 20 BBY, Krell, along with Jedi Generals Obi-Wan Kenobi, Saesee Tiin, and Anakin Skywalker were sent by the Jedi High Council to retake Umbara back from its Confederate-aligned Umbaran Militia. Krell then provided an air strike to Skywalker's forces. Krell then met up with Skywalker, and told that he was being recalled to Coruscant at the request of both Palpatine and the Jedi Council whilst Krell was given command of the 501st Legion."}, {"tag": "h4", "text": "Taking the airbase"}, {"tag": "p", "text": "Krell then led the 501st to the outskirts of the capital. Krell, against the concerns of Captain CT-7567 \"Rex,\" decided to attack the city by going along the main road instead of flanking the capital. However, Rex and his troopers were forced to retreat away from the capital much to Krell's chagrin. Krell and his forces then held their ground against the militia and their Zenuas 33 Umbaran starfighters. Krell was then contacted by Kenobi, who told them that an airbase was re-supplying the capital. Krell and the 501st were tasked to take the airbase."}, {"tag": "p", "text": "As the 501st approached the outskirts of the airbase, Krell sent Rex and the battalion through a ravine to take the airfield. Despite Rex's and his troopers' objections, they went into the ravine. However, they came under heavy attack by the Militia's impeding assault tanks and mobile heavy cannons. Krell refused to let Rex and the battalion retreat or to send them reinforcements. After the clones took the airbase, despite heavy casualties, Krell objected to allowing the clones use stolen enemy Umbaran ships to attack a Separatist supply ship. Instead, he ordered the troopers to march directly into range of enemy missile fire. Rather than face certain death by following orders, several troopers secretly used the stolen ships anyway and successfully destroyed the supply ships, supporting Obi Wan Kenobi's attack on the Umbaran capital city. Krell still had the soldiers who disobeyed orders locked in the brig. He later ordered Jesse and Fives executed."}, {"tag": "h4", "text": "Carnage of Krell"}, {"tag": "p", "text": "The troopers refused to go through with the execution. Krell told the clones that enemy soldiers had stolen Republic weapons and armor and ordered them into battle. During the fight, the clones discovered that Krell had lied and had ordered the 212th and 501st, unbeknownst to both squadrons, to attack each other. Rex realized that Krell had intentionally orchestrated the deaths of countless clone troopers and organized the clones to arrest Krell."}, {"tag": "p", "text": "The combined forces of the 212th and 501st entered the command center under the leadership of Captain Rex and trained their weapons on General Krell. Rex informed the traitor Jedi that he was being relieved of duty. Krell turned to face the captain and calmly remarked that this was treason. Rex drew his pistols and ordered Krell to surrender. Pong ignored the clone and advised Rex that he was committing an act of mutiny. Rex demanded to know the reasoning behind Krell's actions as his clone soldiers surrounded the general. Krell feigned ignorance, asking the captain what he was referring to. Rex told Krell that he was referring to Krell turning his own forces against one another. The general proceeded to mock the captain, acting surprised that a clone was capable of discerning his scheme. As the clones drew nearer, Krell used his four arms to create a Force repulse, knocking all of his assailants off their feet. Krell drew both of his lightsabers and expressed anger that the clones would dare attack a Jedi. The Jedi then began deflecting the incoming blaster fire while simultaneously cutting through the clones. He took a brief reprieve from his slaughter to tell Rex that he would not be undermined by creatures bred in a laboratory. Smashing through the window, Krell safely landed on the ground below the command tower where he was faced by even more clone soldiers. Krell proceeded to make quick work of the clones surrounding him, before making a break for the Umbaran wilderness. As more and more clones fired at him, Krell used a Force push to stun them all, allowing him to escape the airbase."}, {"tag": "p", "text": "The clones, led by Rex, followed Krell into the forest where he was awaiting their arrival. The general began massacring isolated groups of soldiers who were searching for him, hoping to divide and conquer the clone forces. While slaughtering one group, Krell noticed Fives watching him from a distance. Krell made his way to the group and began taunting Rex from the shadows. He informed the captain that he should've listened to Fives from the beginning, as he had been using the clones all along. Krell then jumped down from the trees onto a batch of five clones, laughing as he revealed himself. Once again he began deflecting their blaster fire while killing the clones. Supremely confident, Krell put his weapons away and began fighting the clones barehanded, picking one clone up and breaking his back. Eventually, the clone trooper CT-5385 \"Tup\" called out to the general, calling him ugly and daring him to come for him next. Krell, not noticing the trap being laid down for him, ran at the clone with murderous intent. As he lunged at the clone, a native vixus grabbed Krell with its tentacles. Although Krell was able to free himself from the creature, he was caught off guard and stunned by Tup. With the general unconscious, the clones were able to cuff Krell and take him into custody."}, {"tag": "h4", "text": "Execution"}, {"tag": "p", "text": "After capturing him, the clones placed Krell in a holding cell in the airbase. When Rex, Tup, Jesse and Fives entered the cell block, Krell snarled at them in discontent. Rex approached Krell's cell and demanded to know the general's reasoning for killing his own soldiers. Krell told Rex he had simply done so because the clones were inferior and he wanted to prove it. Rex expressed anger that a Jedi like Krell would do such a thing. Krell corrected Rex, telling the clone captain that he was no longer naive enough to be a Jedi. He informed Rex and the gathered clones that he had foreseen the rise of a new power and the destruction of the Jedi Order. Krell boasted to the clones that he would rule as part of the governing body that would inevitably replace the Republic. Rex accused the general of serving the Separatist Alliance, only to be reassured by Krell that he served only himself. Pong went on to tell the clones that he would soon follow a new master, Count Dooku. Krell believed that once he escaped prison and pushed the Republic forces from Umbara, Dooku would award him by making the general a Sith and his new apprentice."}, {"tag": "p", "text": "Krell was interrupted by \"Dogma,\" the only clone who had remained loyal to him and had subsequently been imprisoned in the cell next to Krell. Dogma expressed his disappointment in the general, asking Krell how he could betray his loyalty and trust. Pong merely insulted Dogma, stating that he relied on blind loyalty like his to make his plans work. Rex told Krell that he would never escape and he would never rise to power. Krell noted that Rex would never learn, as he knew the Umbarans would soon retake the airbase and free him. Krell then began meditating and the clones proceeded to leave."}, {"tag": "p", "text": "Sometime later, Rex, Jesse and Fives returned and released Dogma from his cell. Rex told Krell to turn around and step towards the wall as he drew his pistol, intending to execute the traitorous general. Krell complied with Rex's commands and Jesse opened the door to Krell's cell. Rex ordered Krell to get on his knees. Initially, Krell simply taunted the Captain until Rex reiterated the order, at which point the general laid down on his knees. The traitorous Jedi once again taunted Rex, asking the captain how power over him felt. Krell told Rex that he could sense his fear, wondering why the clone couldn't bring himself to kill him. Eventually, Rex lowered his weapon as he didn't have the resolve to execute his commanding officer. As Krell began to respond to Rex's weakness, he was shot in the back. Dogma had seized Fives' blaster and shot Krell dead. Dogma insisted he had to shoot Krell for his treasonous deeds. Afterwards, Dogma himself was taken into Republic custody for killing an officer, but as he was led away, Rex gave him a reassuring nod to let him know that he did the right thing."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In 19 BBY, the Jedi Barriss Offee secretly bombed the hangar of the Jedi Temple in protest of the war and the decline of the Jedi Order. While investigating the scene of the crime, Jedi Padawan Ahsoka Tano expressed her disbelief to her master Anakin Skywalker that any Jedi would go so far to protest the ongoing war. In response, Anakin reminded Ahsoka that some Jedi who initially protested the corruption in the Order later turned traitor, mentioning both Count Dooku and General Krell as examples."}, {"tag": "p", "text": "After Quinlan Vos' fall to the dark side of the Force while on a mission to assassinate Dooku, most of the Council supported the idea of executing Vos, with Mace Windu citing that Vos was a Jedi Master with unique skills and that even Krell's deception did less damage. Ultimately, however, Vos was spared at the insistence of Obi-Wan Kenobi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "With his reputation as a successful general, Pong Krell was supremely confident in his command style, tolerating neither failure nor disobedience in the clones who served under him. As a battlefield commander, he secured many critical victories for the Republic, a consequence of his singular focus on achieving results no matter the cost. He cared only for results in battle, willing to sacrifice his men for tactical purposes. In contrast to many other Jedi, he did not feel a moral obligation to keep his troops safe and was not above letting them die for a form of victory or progress. This particular ideal put him at great odds with Captain Rex, who felt that it was one of his primary duties to protect the men under his command."}, {"tag": "p", "text": "Krell's atypical yet effective tactics were well known amongst the clones. When Krell temporarily relieved General Skywalker of duty and took over the 501st, several of the men immediately recognized Krell's name as the general who produced the highest casualty rates. Krell frequently pulled rank on Rex and the other clones to make sure his contentious orders were followed. He reacted disdainfully when the clones tried to improve his strategies, improvise, or think for themselves. He chalked up many of his less effective tactics to poor execution, blaming the men for nor following orders or failing to execute a part of his plan to his liking."}, {"tag": "p", "text": "Krell was unusually callous and arrogant by Jedi standards, and did not react well to constructive criticism. He held particular disdain for clones, whom he regarded as little better than droids and just as disposable. When he received a vision of how the war would end, Krell thought only of his own survival, and showed no qualms about betraying all of his allies to join the Sith. After his true allegiance was exposed by the men under his command, Krell was delighted as he went about slaughtering them in a bout of dark side-fueled madness, taunting them all the while. Like most adult Besalisks, his top arms were dominant over the lower pair."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Pong Krell was a powerful Force-user. His Besalisk anatomy allowed him to wield two double-bladed lightsabers at the same time. Krell's weapons were unique, as they could fold in the middle, making them easier to carry. He wielded his lightsabers with deadly precision, spinning them like buzz saws to have devastating effect, and he was capable of killing many clone troopers with ease. He could also deflect an innumerable amount of blaster bolts with similar ease."}, {"tag": "p", "text": "Krell was also skilled in the Force, as shown when he used all four arms to Force push the clones trying to arrest him in all directions. Krell was also able to leap extremely high using Force jump, as shown when he used it to dispatch two banshees and when he escaped the tower of the Umbaran airbase. Aside from mocking the clone troopers, he also used this ability to confuse them by making his voice echo in every direction. He was also able to sense emotions through the Force, such as Captain Rex's fear and uncertainty. Krell also had the ability to foresee future events. This ability was paramount to his conversion to the dark side, for he prophesied the near destruction of the Jedi, the fall of the Republic, and the rise of an Empire."}, {"tag": "p", "text": "Although he was undermined by his own overconfidence and the ingenuity of trooper Tup, Krell easily massacred scores of clones with a combination of deadly lightsaber techniques and powerful Force abilities. He was highly skilled in unarmed combat, which he displayed while fighting clones with his bare hands, using his considerable strength to pick up adversaries and throw them, at one point even breaking a trooper's spine over his leg. Despite his size, Krell proved himself to be a nimble and agile fighter as well, dodging and evading attacks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}