{"url": "Porax-38_starfighter", "categories": ["Category:Legends articles", "Category:Ship stubs", "Category:Buuper Torsckil Abbey Devices products", "Category:Confederacy of Independent Systems starfighter classes"], "nodes": [{"tag": "h1", "text": "Porax-38 starfighter"}, {"tag": "p", "text": "The Porax-38 (P-38) starfighter was a tough, hyperdrive-equipped starfighter used by the Utapauns as part of the Utapau Skyforce. Some models were adapted by the Confederacy of Independent Systems into the Rogue-class starfighter line."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Porax-38 had interstellar range and was fitted with highly effective, long-distance sensor systems that provided early warning of enemy activity. Each sensor was mounted in a forward facing cone along with the scanning systems, and both were connected to powerful jamming devices. These large P-38 fighters were also capable of independent hyperspace jumps, which enabled them to defend Utapau far into the Tarabba sector. Versatile thrusters, dual-reactor systems, and high-capacity deflector shielding made them a valuable asset to the Loyalist forces. Rather than using a single shield generator the ship had a deflector shield projector web. This web covered a large portion of the ship and had many individual heat sink cells embedded into it."}, {"tag": "p", "text": "The interstellar range of these vessels also allowed them to take more punishment and they could endure longer, more arduous missions than tiny, fleet-based fighters like the Confederacy's Vulture droid fighters and droid tri-fighters and the Republic's V-wings and Eta-2s."}, {"tag": "p", "text": "The Porax-38 was manufactured by Buuper Torsckil Abbey Devices and only required one pilot, who had to wear a protective breathing mask. It had enough consumables for 20 days of air, fuel, and food. Its primary armament was two High-power laser cannons. Each laser cannon is connected to a beam-amplification chamber that severely increases the laser's intensity and heat damage output. The fighter's tiny cockpit could only seat one short, stocky Utai, not the tall Pau'ans. Some Porax-38s had the cockpit modified for an IG-100 MagnaGuard."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Utapaun navy was made up almost entirely of self made ships, and their largest Rendili Dreadnought was barely one-fifth the size of a Trade Federation battleship. The Utapauns instead relied heavily on their P-38s as their primary means of planetary defense. During the Clone Wars, several Porax-38 starfighters were captured by the Confederacy of Independent Systems and were subsequently modified to begin what became the Rogue-class starfighter line."}, {"tag": "p", "text": "The CIS commander Zolghast also owned a Porax-38, which he kept on Tirahnn during the Separatist occupation of the world. However, it was captured by the Republic during the Battle of Tirahnn."}, {"tag": "p", "text": "In the last year of the war, General Grievous's forces invaded Utapau. Tion Medon, the Master of Utapau Port Administration, ordered his outnumbered yet valuable P-38s into hiding, with the intention that the existence of the ships and their skilled pilots remain a secret until a better time to strike against the overwhelming might of the Separatists arose."}, {"tag": "p", "text": "With the arrival of Republic forces under Jedi General Obi-Wan Kenobi, Tion recalled his P-38s from their hidden hangars and set them to expelling the Separatist forces. The Utapau Skyforce squadron that engaged the Techno Union light interceptors during Obi-Wan's arrival was led by the Utai Air Commodore Senin Vant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While Star Wars: Revenge of the Sith Incredible Cross-Sections gives the maximum atmospheric speed of the P-38 as being 61,000 km/h, the later published Starship Battles Preview 6 gives it as being 1,200 km/h. In addition to this, the former source gives the consumables rating as being 20 days whereas the latter gives it as being a mere 2 days."}, {"tag": "p", "text": "The P-38 shares a number of characteristics with the real-world Lockheed P-38 Lightning, a World War II fighter aircraft. Apart from having the same designation/model number, the Porax-38 also possesses a similar layout; the engines being located in twin booms mounted one the wings, with the cockpit located in a centrally-mounted nacelle. Similar to the Lightning, the Porax-38 could also be classed as a \"heavy\" fighter, due to its toughness and firepower."}, {"tag": "p", "text": "The starfighter was a late addition to the film and though a digital model was created, it was never completed to the level originally planned."}, {"tag": "p", "text": "The episode guide for the Star Wars: The Clone Wars episode Duel of the Droids refers to Rogue-class starfighters as \"P-38 fighters.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}