{"url": "Pong_Krell%27s_lightsabers", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Weapon stubs", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Pong Krell's lightsabers"}, {"tag": "p", "text": "A pair of lightsabers were owned and wielded by Pong Krell, a Besalisk Jedi Master who operated as a Jedi General during the Clone Wars. They were both double-bladed weapons, one of which was blue and the other green, and were able to fold down their middle for easier storage. During his deployment on Umbara, Krell did not fight beside his troopers unlike most Jedi and so his lightsabers were only used rarely; once to kill several banshees attacking his troops and again (in its folded state) to threaten CT-5555 into silence. When Krell was exposed as a traitor, he used the lightsabers to slaughter dozens of clones as they attempted to arrest him, though he at one point dispensed with them in favour of dispatching a few troopers with his bare hands. Krell was then lured into the clutches of a vicious vixus, a plant-like creature native to Umbara, that attempted to eat him. Krell managed to sever its tongue as it reached for him, which prompted the creature to slam him into the ground and caused him to drop his green lightsaber. Despite losing it, Krell managed to defend himself from the clones with his remaining blue lightsaber and free himself from the vixus' clutches, only to be stunned by Tup and captured."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The identical pair of lightsabers wielded by Pong Krell were primarily constructed out of a metallic material and were bulkier than ordinary lightsabers to accommodate for its owner's large paws and stature. Both featured one blade at either side of the hilt in a double-bladed configuration, a design that was uncommon among members of the Jedi Order. When activated, one lightsaber emitted two blue blades and the other emitted two green blades. Both lightsabers produced distinct thrums when activated that were lower-pitched than an average lightsaber's. A hinge at the midpoint of both lightsabers allowed Krell to fold the weapons in half for easier storage, though they could still be activated in this configuration. Kyber crystals served as the internal power source of the lightsabers. While not wielding his sabers, Krell tended to clip them to his utility belt around his hip."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pong Krell's lightsabers first appeared in \"Darkness on Umbara,\" the seventh episode in Season Four of the animated television series Star Wars: The Clone Wars, which aired on October 28, 2011. Designed by concept artist Chris Glenn, Krell's lightsabers were the first example of hinged double-bladed lightsabers in Star Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}