{"url": "Pong_Krell/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Besalisks", "Category:Fallen Jedi", "Category:Jedi Generals", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Pong Krell"}, {"tag": "p", "text": "Pong Krell was a male Besalisk Jedi Master who served as a Jedi General in the Grand Army of the Republic during the Clone Wars. A powerful Jedi and a recognized war hero, he was relentless in his tactics on the battlefield, seeking success at all costs. As a combatant, he was an especially ferocious lightsaber duelist; the advantage of four arms allowed him to wield two double-bladed lightsabers at the same time. As a general, Krell found insubordination intolerable and required strict adherence to command from all of his soldiers. During the war, Krell foresaw how the Republic would be destroyed from within, thus paving the way for the rise of a New Order. This vision, coupled with his lust for power, ultimately caused Krell to abandon the Jedi way. Outwardly, he maintained the appearance of his ties to the Jedi and Republic. In secret, Pong Krell had embraced the dark side of the Force."}, {"tag": "p", "text": "Around 21 BBY, when the shadow planet Umbara seceded from the Republic, Pong Krell was given command over the 501st Legion, serving as an interim general during Anakin Skywalker's absence. Krell deliberately crafted incompetent battle strategies in order to sabotage the Republic's campaign to retake the planet. By covertly assisting the Separatists' efforts to retain Umbara, Krell hoped to join the Sith ranks as a disciple of the Sith Lord Darth Tyranus, thus securing a place for himself in the future Empire."}, {"tag": "p", "text": "Krell's plans were ultimately thwarted by the clone troopers under his own command. When his duplicity was uncovered, Krell was confronted by Captain CT-7567 (nicknamed \"Rex\") and troopers from the 501st Legion and the 212th Attack Battalion. Although he single-handedly slaughtered scores of clones, eventually he was captured and detained. While restrained by stun cuffs, Krell was fatally shot in the back by Dogma, his most loyal soldier, thus ending the fallen Jedi's life."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "A Besalisk male from the Deep Core planet Ojom, Pong Krell ascended to the rank of Master in the Jedi Order by the time of the Clone Wars. As the Jedi were called into service by the Galactic Republic, Krell joined the war effort as a Jedi General in the newly-commissioned Grand Army of the Republic, composed mainly of clone troopers grown and trained on Kamino. Although his record for clone casualties was the highest of any Jedi officer, Krell established a reputation as a highly successful military strategist with many key victories credited to his name."}, {"tag": "p", "text": "But as the war progressed, Krell drew closer to the allure of the dark side of the Force. The tipping point for Krell came when he experienced a premonition of the future; the Jedi all but wiped out, a Republic fallen, and an Empire made to take its place as the hegemonic power throughout the known galaxy. Krell was enthralled by what he witnessed and, having grown increasingly ambitious for greater power, renounced his allegiance to both the Jedi and the Republic. From then on, he maintained only the facade of loyalty, only to act as a double agent in order to sabotage the Republic's war effort. Eventually, Krell planned to openly serve at the side of the Sith Lord Darth Tyranus, thus securing for himself a place of prominence in the New Order to come."}, {"tag": "h3", "text": "Battle of Umbara"}, {"tag": "p", "text": "In the year 21 BBY, General Pong Krell was dispatched by the Jedi High Council to Umbara, a former member-world of the Republic that joined the Confederacy of Independent Systems. Krell was not only well aware of Umbara's strategic significance in the Clone Wars. He also knew that the decisive victory in the campaign depended primarily on his success. Hence, he recognized this battle as an opportunity to prove his worth to Tyranus. He intended to ensure that Umbara remained in the Separatist fold by purposely devising ineffective strategies."}, {"tag": "p", "text": "By the time he arrived on the planet, Republic forces had already begun their invasion of Umbara with Jedi Knight Anakin Skywalker's 501st Legion leading the way to the planetary capital city. After sustaining some casualties during the initial engagement with the Umbaran natives, Krell arrived on the battlefield via a LAAT/i gunship and reported the Council's orders; Skywalker was to immediately disengage from the battle and return to Coruscant. Although Skywalker was shocked by this order, Krell stated that it was at the direct request of Supreme Chancellor Palpatine. With Skywalker away, Krell was assigned as the 501st Legion's mission commander. Krell quickly acquainted himself with the unit's captain, Rex."}, {"tag": "p", "text": "Once he assumed command of the 501st Legion, General Krell immediately dismissed Skywalker's original plan for the capture of the Umbaran capital. Claiming this move was due to the strategic importance of the capital, as well as the fact that victory or defeat depended on the 501st, Krell decided that Skywalker's guerrilla warfare tactics were too slow and ultimately a waste of time. Hence, he concluded that unhindered military force would win the battle, and thus he ordered the 501st on a direct path to the capital city."}, {"tag": "p", "text": "Before they reached their destination, however, Krell and the 501st were attacked by two flying banshees. Krell swiftly killed both creatures, employing Force Jumps in conjunction with his double bladed lightsabers. Shortly afterward, Krell sent Rex and his troopers directly into a minefield, where they were ambushed and nearly overwhelmed by a group of Umbaran soldiers. Krell expressed his apparent frustration with the clones' inability to achieve success without his support, though he ultimately chose to save their lives by dispatching extra troopers and AT-RT drivers to assist them. Rex and his troops sustained heavy casualties, but managed to repel the Umbarans with the aid of Krell's reinforcements."}, {"tag": "p", "text": "Krell made no effort to conceal his disappointment in Rex for retreating from the enemy. Advanced Recon Commando 5555 (nicknamed \"Fives\") criticized Krell's strategy in front of the other troopers, and was nearly executed by Krell in response. Rex defended his own case by explaining that he was loyal to his Jedi officer, but that he also had a duty to the safety of his troopers as well. Although he was taken by surprise due to the Captain's outspoken nature, Krell noted how Rex possessed a spark of tenacity, which he saw as a rare trait in a clone, but also an important quality in leadership. He even admitted to the unorthodox style in his leadership, but nevertheless defended his reputation as a strategist, pointing to his past victories as evidence of his efficiency. Shortly afterward, Krell left the clones to ponder his words as another ambush by the Umbarans took place."}, {"tag": "h4", "text": "Taking the airbase"}, {"tag": "p", "text": "Following this setback in the overall operation, Krell received a message from Obi-Wan Kenobi during a firefight between the 501st Legion and Umbaran soldiers. Kenobi reported how the capital city had become a virtually impregnable fortress due to the supplies it received from a nearby airbase. In order to weaken the capital's unassailable defense grid, Kenobi charged Krell and the 501st with the mission of destroying the airbase, and thus its supply lines to the capital city as well. Before cutting the link on the holocomm, Kenobi reminded his fellow Jedi Master that the entire operation depended on the success of Krell and his 501st Legion."}, {"tag": "p", "text": "Due to the high priority of his new assignment, Krell ordered Captain Rex to mobilize the clones for their deployment to the Umbaran airbase. Upon viewing their targeted location from a distance, Krell instructed Rex to lead a contingent of clone troopers through a gorge and destroy the airbase with brute force, in a full frontal assault. The Clone Captain suggested reconnaissance as an alternate approach, but Krell responded that the rest of the invasion force depended on the haste of a 501st victory, thus asserting how they did not have the time for a scouting operation. Rex kept his doubts to himself and loyally carried out his General's will."}, {"tag": "p", "text": "By this time, General Krell's influence on the 501st created animosity not just between himself and some of the clones, but also between the clones themselves. After their failed attempt to take the capital, Rex paid more respect to Krell, and took extra care to offer alternative options as opposed to outright questioning the General's orders. Fives grew increasingly bitter and resentful of Krell to the point where Rex defended Krell's proven success on the battlefield in past engagements. He also reminded the ARC trooper that a clone's duty was to faithfully support his superior officer without question or hesitation. Dogma strongly supported Krell's strategy and even stood up for him against Fives on more than one occasion. Hardcase, a hyperactive trigger-happy clone trooper, also favored the General's direct approach and paid little attention to the misgivings of his other comrades."}, {"tag": "p", "text": "When the clone troopers encountered heavy resistance from the Umbaran assault tanks, Rex instructed Fives and Hardcase to infiltrate the airbase and commandeer their starfighters. Rex then informed Krell of his deviation from the original plan, but the General was displeased at what he saw as an action that countermanded his orders. He commanded the Captain to proceed with the forward assault and left him with an ultimatum—either obey the order or be relieved of duty. Although Rex and his troopers were unable to overcome the Umbaran assault tanks, he ordered the clones to hold their ground as long as possible until Fives and Hardcase completed their task. Sergeant 1119 (nicknamed \"Appo\") offered to reinforce Captain Rex's position with the rest of the battalion, but Krell ordered them to remain behind until after he gave the order, and not before."}, {"tag": "p", "text": "Both plans ultimately succeeded in the end, with Rex's ingenuity ensuring that Krell's overall plan succeeded. With the support of the enemy's commandeered starfighters, piloted by Fives and Hardcase, Rex and his clone troopers were able to proceed with their forward assault on the airbase. While watching the burning airbase with satisfaction, Krell ordered Sergeant Appo and the rest of the 501st to converge on the fallen base. The General commended Rex, attributing his success to luck. Rex added that many clone troopers were killed while trying to take the airbase, to which Krell asserted how death was often the price for victory."}, {"tag": "h4", "text": "Dissent within the ranks"}, {"tag": "p", "text": "After the fall of the airbase, Obi-Wan Kenobi made contact with Pong Krell. He informed the Besalisk Jedi Master of his failure to conquer the capital. Despite the fact that the city's supply lines were severed by the capture of its airbase, a Separatist fleet arrived to support the beleaguered Umbarans. Before a new strategy could be fully discussed, the Umbarans jammed the communication lines, thus cutting off Kenobi's ability to coordinate the battle with Krell. Rex offered to have the clones work on reestablishing contact with Kenobi's forces, but Krell dismissed the idea and ordered the 501st to prepare for an all-out attack on the capital city. Although Rex doubted that the strategy could work without the cost of high casualties, he did not have an alternative solution. Furthermore, Krell pointed out how the Captain was loyal enough to obey a direct order without question. Hence, Rex prepared to mobilize the clones for another forward assault."}, {"tag": "p", "text": "However, before the 501st Legion carried out its assault on the capital, Fives suggested how they could use the Umbaran starfighters to infiltrate and destroy the Separatist supply ship. Krell rejected the plan on the grounds that they did not have any trained pilots to fly the starfighters. Although Rex remained skeptical about a forward assault, he ultimately concurred with the General in that Fives and his men were amateur pilots. Fives took it upon himself to disregard Krell's orders by carrying out his plan anyway, and thus he recruited Hardcase and CT-5597 (nicknamed \"Jesse\") to his cause. Together, they destroyed the supply ship, but at the cost of Hardcase's life. When Krell learned of Fives's insurrection, he sent Sergeant Appo to bring the dissenters, along with Captain Rex, to him immediately."}, {"tag": "p", "text": "When Rex, Fives and Jesse reported to the airbase's communications tower, Krell admitted that though their actions were bold, they were also clearly treasonous. Rex vouched for his men and tried to take the blame, but Fives intervened and insisted on bearing the full consequences of his actions alone. At this point, Krell was fed up with the ARC trooper's audacity—from disobeying a general's orders to dictating who should be punished for crimes of treason. Krell's decision was to arrest Fives and Jesse. He intended to have them both court-martialed, in which both would be found guilty of treachery—an offense punishable by death."}, {"tag": "h4", "text": "The carnage of Pong Krell"}, {"tag": "p", "text": "Captain Rex made one last attempt to appeal to General Pong Krell on behalf of Fives and Jesse, both of whom had been imprisoned in the airbase's detention center. Krell confided in Rex his displeasure with clone troopers, noting examples of defective behavior in some of the clones who served him in the past. Furthermore, he pointed out that the two dissenters had to die, lest their actions established a dangerous precedent that encouraged other troopers to disregard the chain of command whenever they saw fit. Rex assured Krell of the 501st Legion's loyalty, but also confessed that some believed that the General was needlessly wasting their lives. In the end, Krell agreed to dismiss the trial of a court martial. Instead, he commuted their sentence to summary execution. Rex was genuinely shocked, but still assembled a firing squad since Krell possessed the authority to execute traitors on the spot."}, {"tag": "p", "text": "A last minute plea from Fives ultimately caused the clone firing squad to disobey Krell as well. Dogma, on the other hand, was outraged and offended by his fellow clones' disregard for orders. Before Krell could respond to the situation, however, he received a report that the Umbarans had captured Republic supplies. After temporarily suspending the execution of Fives and Jesse, Krell ordered Rex and the 501st to engage the Umbarans, warning them that they might be disguised in Phase II battle armor. Rex and his men engaged what appeared to be enemy units disguised as clone troopers, until he found out that they actually were clones. Before dying, Waxer revealed how he thought that the 501st were Umbarans in disguise, due to a warning from Krell. Although he knew that his actions were nothing short of high treason, Rex convinced the 501st Legion to follow him as he returned to the airbase to arrest General Pong Krell."}, {"tag": "p", "text": "Krell calmly received Rex and his troopers in the watchtower, amused by their attempt to relieve him of command. As they took a position to surround him, the General accused them all of being traitors before repelling them back with a powerful Force repulse. Krell activated both of his double-bladed lightsabers, easily deflected their ranged attacks while cutting them down at the same time. He then jumped out of the watchtower and landed on the surface of the airbase, only to be completely surrounded by the 501st. He charged the clones without hesitation, using his blades to protect himself from their blaster fire. After breaking through their lines and killing many clones in the process, Krell escaped into the jungle with Rex and the 501st in pursuit."}, {"tag": "p", "text": "Many of the clone troopers who pursued him were easily slain by the fallen Jedi Master. As the fight wore on, however, Krell's overconfidence got the better of him. Due to the quick thinking of Tup, Krell was caught in the grip of a Vixus. Even still, Krell furiously tried to cut himself free while simultaneously blocking more blaster shots and killing several more clones as well. Though he eventually freed himself, the clones took advantage of his momentarily dazed state and attacked him with a stun blast, thus rendering the General unconscious."}, {"tag": "p", "text": "After being shackled and imprisoned in the airbase, Captain Rex asked why he had turned against the Republic, despite being a Jedi. Pong Krell revealed how he eventually came to reject the Jedi Order, which he regarded as a weak organization that only the naive could serve. He also explained how he foresaw the eventual death of the Galactic Republic, the fall of the Jedi Order, and the birth of a New Order in the imminent future. After some convincing from Fives, Rex agreed to execute Krell, but ultimately found himself unable to pull the trigger. Krell's life was ended by Dogma, the clone who had been his most loyal soldier, who unexpectedly shot the former Jedi General in the back due to his anger over Krell's betrayal. Afterward, Dogma was taken into custody for killing his Jedi officer. The fall of Krell during the battle demonstrated that Jedi could fall to the dark side if they fall to despair with the way the war was going."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In war, Pong Krell was a relentless Jedi Master who settled for nothing less than absolute victory on the battlefield. Committed to both the Jedi Order and the Galactic Republic, Krell became a successful general through his unorthodox—but efficient—strategies. He was supremely confident in his command style, and thus he expected complete obedience to the chain-of-command from his subordinates."}, {"tag": "p", "text": "During the Battle of Umbara, Pong Krell displayed a low opinion of clone troopers, but he was especially antagonized by Clone Captain 7567. He was extremely irritated by the captain's suggestion to let the troopers rest before completing their objective, as well as their failure to defeat Umbaran soldiers without the assistance of his reinforcements. Krell was also not afraid to use the threat of deadly force to put insubordinate troopers back in their place, as ARC-5555 discovered when his outspoken criticism of the general's leadership was silenced with an order at the point of a lightsaber blade. Despite this, there were times in which he gave some hints of respect towards Rex, telling him his opinions were noted and telling him he had a spark of tenacity, although this could simply be interpreted as feigning respect in order to stay above suspicion."}, {"tag": "p", "text": "In terms of military strategy, Krell was keenly aware of Umbara's significance to the Republic's war effort, including the fact that the chances of victory depended primarily on himself and the 501st Legion. Though viewed by some clones as a gruff and uncompromising tactician, the fiercely focused Krell was unshakably determined to achieve the best results in battle so that the outcome would be nothing short of a Republic victory. Consequently, however, this record for success also produced a record for the highest casualties as well, which Krell rationalized as a natural consequence of war. Although he was a highly skilled combatant, Krell did not normally get involved in the fighting unless absolutely necessary. During the Battle of Umbara, he intentionally remained away from most of the fighting in order to covertly assist the Umbarans and the Separatists."}, {"tag": "p", "text": "Far from being an incompetent general as some of the 501st initially perceived him to be due to his seemingly reckless strategies, Pong Krell revealed his true nature when his own clone troopers attempted to arrest him. He detested the clones as \"creatures\" hatched in the laboratories of Kamino. He also took immense pleasure in killing many clones with ease, as well as the fact that he no longer had to hide behind his Jedi facade. By this time, the tenets of the Jedi Order had become meaningless to Krell. In his eyes, the Jedi were too naive and the path to true power was through the Sith. As a result of his new beliefs, Krell reveled in the dark side of the Force."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Pong Krell was an incredibly powerful Force user and warrior. His Besalisk physiology allowed him to wield two double-bladed lightsabers at once with proficiency. These lightsabers both folded in the middle, making them easier to carry on his person. He wielded his dual double-bladed lightsabers with deadly precision, spinning them like buzz saws for devastating effect and was capable of easily defending himself against the joint clone forces of the 501st Legion and the 212th Attack Battalion. Although he was undermined by his own overconfidence and the ingenuity of Trooper Tup, Krell easily massacred scores of clones with a combination of deadly lightsaber techniques and powerful Force skills. He was also highly skilled in unarmed combat, which he displayed while fighting clones with his bare hands. Despite his size, Krell proved himself to be an agile fighter as well."}, {"tag": "p", "text": "In addition to being a deadly combatant, Krell was also skilled in use of the Force, using his arms to unleash a Force repulse on the first group of clone troopers that attempted to arrest him. He was also trained in Force Jump, which he used to escape from the airbase's watchtower."}, {"tag": "p", "text": "Additionally, he was capable of using telepathy to taunt the clones while stealthily hiding in the jungles of Umbara.[source?] Aside from mocking the clone troopers, he also used this ability to confuse them by making his voice echo in every direction. He was also able to sense emotions through the Force, such as Captain Rex's fear and uncertainty. In addition to these abilities, Krell possessed a powerful ability to foresee future events. This ability was paramount to his conversion to the dark side, for he prophesied the near destruction of the Jedi, the fall of the Republic, and the rise of an Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}