{"url": "Aut-O%27s_flagship", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Confederacy of Independent Systems starships", "Category:Flagships", "Category:Providence-class carrier/destroyers", "Category:Unidentified spacecraft"], "nodes": [{"tag": "h1", "text": "Aut-O's flagship"}, {"tag": "p", "text": "A Providence-class Dreadnought served in the Confederacy of Independent Systems's naval forces and served as the flagship of a Separatist fleet commanded by the ST-series military strategic analysis and tactics droid Aut-O during the Clone Wars. In 19 BBY, the dreadnought was infiltrated by a squad of Galactic Republic droids, who had been sent to retrieve an encryption module located aboard. The squad later escaped the vessel with the encryption module, but not before Aut-O was destroyed in a brief incursion with the droids."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "As a Providence-class Dreadnought, the vessel had a main hangar bay and a command bridge. The dreadnought was also equipped with a tractor beam projector, and had a passenger complement of B1-series battle droids and B2-series super battle droids."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars in 19 BBY, the ST-series military strategic analysis and tactics droid Aut-O was in command of a large fleet of Separatist warships in an area of space. The dreadnought which flagged the fleet became targeted by a squad of Galactic Republic droids led by the Zilkin Colonel Meebur Gascon, who were sent by the Republic to board the dreadnought and steal an encryption module located aboard it. The encryption module would allow the Republic to decipher an intercepted and encoded transmission of Separatist General Grievous and discover what the Confederacy was planning."}, {"tag": "p", "text": "After arriving at the fleet's location aboard a stolen Maxillipede shuttle, the DUM-series pit droid WAC-47 set the squad's shuttle on a collision course with the dreadnought. However, the dreadnought, alerted by their arrival, instead pulled the shuttle into its main hangar bay with a tractor beam, where several B1 battle droids proceeded to search the vessel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This Providence-class Dreadnought first appeared, albeit unidentified, in \"Secret Weapons,\" the tenth episode of the animated television series Star Wars: The Clone Wars' fifth season, which originally aired on November 30, 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}