{"url": "Porg", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Creatures of Ahch-To", "Category:Flying creatures", "Category:Food creatures", "Category:Porgs"], "nodes": [{"tag": "h1", "text": "Porg"}, {"tag": "p", "text": "Porgs were a species of sea-dwelling beakless bird. They were native to the planet Ahch-To, where Jedi Master Luke Skywalker made his exile in the years prior to the Battle of Crait."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Porgs were a species of non-sentient birds. They were stocky in nature, with two short wings, flat, beakless faces, and two webbed feet. They could also run quite swiftly on the ground and were good at maneuvering into small spaces."}, {"tag": "p", "text": "Porgs were sexually dimorphic; males were slightly larger than females, and males also had orange plumage around the eyes. Their eyes had brown irises and black pupils with stereoscopic vision; their telescopic eyes helped them catch fish. Porgs of both sexes were covered in dense feathers, with white coloration on the body and face, and gray to brown on the wings and back. Their coloration gave them strong natural camouflaging abilities. They were much lighter than they looked, thanks to a thick outer layer of waterproof feathers with a fluffy underlayer for warmth, and they favored colder environments."}, {"tag": "p", "text": "Porgs apparently understood certain linguistic terms. When they overheard Rey refer to Chewbacca as \"Chewie,\" they mistook it to be the word chewy, leading them to wonder whether Chewbacca would serve as her food."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "The hypercurious, cliff-dwelling creatures were found throughout the islands of the planet Ahch-To. Their young, called \"porglets,\" were hatched as pairs. Porgs exhibited a roosting behavior and built nests along the island cliffs. The nests were made using hair, fiber, or grass, and decorated with shiny objects they had acquired. The mother and father tended to the nest. Porgs were capable of performing controlled dives into the sea, where they fetched fish to feed on or pass on to their otherwise-helpless offspring; they also hunted crustaceans."}, {"tag": "p", "text": "Porgs loved water, both to drink and to play in, and they also loved tasting new things. Both wild and domesticated porgs were unusually smitten by human objects. If their curiosity ran unchecked, they could wreak havoc. Their calls ranged from burbles to squeaks to song. They crooned a special song when they were pleased. Despite their curious nature, they could be completely silent when necessary and could be shy if they felt threatened. Porgs enjoyed being petted and scratched, especially behind their ears. A group of porgs was called a \"murder.\""}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Porgs evolved from seabirds on Ahch-To. Considered quite tasty by some species, they were sometimes hunted by the resident Lanai as well as visitors to Ahch-To. At the time of the First Order/Resistance War, when Jedi Master Luke Skywalker threw his lightsaber off a cliff, two porgs investigated the weapon. The birds nearly activated the weapon, before they were scared off by Rey. Shortly afterwards, another porg watched in curiosity from its nest as the Jedi Master spearfished from an island cliff. Rey found the porgs to be helpful to her Jedi training after she used the Force to catch one in midair in order to retrieve the lightsaber it had snatched. Finding that the porg's flock was visibly fascinated by her power, Rey promised them all \"a turn.\" While staying on Ahch-To, the Wookiee Chewbacca roasted two porgs for supper. A few of the birds stared at him before he could take a bite, but Chewbacca scared them off. When Chewbacca landed on Ahch-To, he considered porgs as a tasty treat, but found it hard to kill the winged creatures when the pack turned their sad eyes on him."}, {"tag": "p", "text": "Unable to acquire a patch of blue moss for their young twins, a couple of porgs snatched wiring of the same color from the Millennium Falcon, hindering repairs that were being performed by Chewbacca and R2-D2. Following the porgs to their nest, Chewbacca tried to barter the blue wiring for a blanket but was declined. Soon realizing the plight of the porgs, Chewbacca was convinced by R2 to brave strong winds in order to harvest the moss from the high tree. Grateful for his assistance, the parents returned the wiring to Chewbacca, marking his first amicable relationship with porgs."}, {"tag": "p", "text": "Later, at least four porgs found their way aboard the Millennium Falcon and made a nest. One of them accompanied Chewbacca during the Battle of Crait. Despite having an initial antagonism with the porgs, Chewbacca grew to like them and became their friend. These stowaways eventually managed to spread their species far from the borders of their home planet."}, {"tag": "p", "text": "Boarding the Millennium Falcon, General Leia Organa observed a number of the creatures roosting aboard the vessel, prompting her to ask Chewbacca when the ship had become a birdcage."}, {"tag": "p", "text": "Among the porgs which resided on the Millennium Falcon were the Porg Stowaway, Puffy, and Snappy."}, {"tag": "p", "text": "In 34 ABY, porgs were imported to the planet Batuu and sold as pets in the Creature Stall at Black Spire Outpost. According to author and explorer Eloc Throno, porgs were brought to Batuu when a light freighter arrived in the spacesport. Oga's Cantina served a deep orange-colored fruity beverage from Ahch-To called a Cliff Dweller in mugs carved to look like porgs."}, {"tag": "p", "text": "In 35 ABY, a pair of porgs watched as Rey attempted to destroy Kylo Ren's TIE whisper and her lightsaber on Ahch-To."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Porgs were designed for the 2017 film Star Wars: Episode VIII The Last Jedi. They were conceived by writer/director Rian Johnson, who created them to digitally cover up the vast numbers of real-life puffins present on Skellig Michael, the filming site for Ahch-To. According to creature concept designer Jake Lunt Davies, Johnson \"was looking at how can he work with [the puffins]. You can't remove them. You physically can't get rid of them. And digitally removing them is an issue and a lot of work, so let's just roll with it, play with it. And so I think he thought, 'Well, that's great, let's have our own indigenous species. Porgs were first revealed in behind-the-scenes footage from The Last Jedi at the D23 Expo in July 2017. They were officially named in a StarWars.com interview with Lucasfilm Story Group creative executive Pablo Hidalgo. Along with fellow Story Group member Leland Chee, Hidalgo rationalized that the birds seen flying on Ahch-To at the end of Star Wars: Episode VII The Force Awakens were also porgs, retroactively establishing that their first appearance was in that film."}, {"tag": "p", "text": "During the concept stage of The Last Jedi, creature designer Jake Lunt Davies explored a variety of influences, drawing ideas from birds, bats, flying squirrels, and aquatic creatures such as seals, otters, and beavers. The design approved by Johnson was based on a seal combined with a pug, akin to aquatic, flightless penguins. Porgs were created using a variety of effects including puppets and CGI. About fifteen porgs were built, each for a specific moment in the film, a group of painted models, animatronic pieces, and 1 \"hero\" model. The creatures' squawks were made using a manipulation of a combination of recordings of doves, chickens, and turkeys. The recordings were pitched to create the birds' unique sounds. Additionally, Skywalker Sound team member Ren Klyce sampled imitations of a turkey call performed by an intern named Nick Doctor to further develop the sound of the porgs. When ILM created the CG porgs, they took care to match the movements made by on-set puppeteers. Concept art for the film revealed that, in the scene where porgs investigate Skywalker's lightsaber, it was considered that one of them would have activated the weapon just as another was looking down the shaft, killing it."}, {"tag": "p", "text": "At the theme park attraction Star Wars: Galaxy's Edge, porg items are sold at the out-of-universe Creature Stall. Souvenir porg mugs are included with the purchase of a Cliff Dweller at Oga's Cantina."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h3", "text": "Non-canon sources"}, {"tag": "h2", "text": "Notes and references"}]}