{"url": "Port_Nowhere", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Core Worlds space stations", "Category:Hutt Space space stations", "Category:Outer Rim Territories space stations", "Category:Shadowports"], "nodes": [{"tag": "h1", "text": "Port Nowhere"}, {"tag": "p", "text": "Port Nowhere, originally known as the Potentate's Pride, was a spaceport located in uncharted space during the Cold War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The station started out as an Azalus-class Hutt dreadnaught, originally owned by Barabulla the Hutt. The Hutt sold the station to starship mechanic Delcan Finyaft at a steep discount without his full comprehension. Finyaft spent the next six years deconstructing and refitting the station and re-opened it, renamed as Port Nowhere and advertised as a floating cantina. The spaceport was a haven for pirates, smugglers and other criminals due to its anonymous location, which shifted from time to time as the mobile station traveled between the Core Worlds, Outer Rim Territories and Hutt Space. Port Nowhere provided several features including bars, gambling, and night entertainment."}, {"tag": "p", "text": "During the start, and for the duration, of the Galactic War, the Voidhound occasionally visited Port Nowhere, and also averted an Imperial attack once while on the station, during his campaign against the Voidwolf."}, {"tag": "p", "text": "After the defeat of the Voidwolf, the smuggler-turned-crime lord known as the Voidhound began using Port Nowhere as a base of operations, managing the new criminal empire from the constantly moving station."}, {"tag": "p", "text": "Republic Strategic Information Service spy Theron Shan made a stop at Port Nowhere to gain clearances and navigation charts for Imperial space and in the process fought off and knocked unconscious a spaceport security officer."}, {"tag": "p", "text": "At some point, Port Nowhere suffered a malfunction of its hyperdrive and was stranded in space, effectively becoming a normal non-moving station."}, {"tag": "p", "text": "After the formation of the Eternal Alliance, the leader of the station, the \"Red Huntress\", began raiding Alliance settlements where military presence was next to none, being made up of farmers and peaceful civilians. As a response, the Alliance Commander lead a team of elite operatives, along with the Alliance Recon Unit, to take the station. Suffering medium casualties on the Huntresses side, herself being one, the ports remaining personnel joined the Alliance, stating they respected the Commander's aptitude in combat. Port Nowhere began taking orders from Head of Underworld Logistics Hylo Visz."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}