{"url": "Pors_Tonith/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Bankers", "Category:InterGalactic Banking Clan members", "Category:Males", "Category:Muuns", "Category:Separatist admirals and generals"], "nodes": [{"tag": "h1", "text": "Pors Tonith"}, {"tag": "p", "text": "Pors Tonith was a male Muun from the planet Muunilinst who served as admiral of the Confederacy of Independent Systems during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A member of the Tonith family, he had originally been a financier before entering military service."}, {"tag": "p", "text": "He was the leader of the Separatist force attacking Praesitlyn, a vital communications center for Coruscant and several others of the Core Worlds."}, {"tag": "p", "text": "Tonith landed a massive force that quickly overwhelmed the local defenses. The planet remained in Separatist hands until a counterattack by the reinforced Republic forces, led by Jedi Generals Anakin Skywalker and Nejaa Halcyon."}, {"tag": "p", "text": "Pors Tonith was a great believer in his own military genius and his position as a \"favored minion\" of Count Dooku, although some of this may have been hubris on the part of the Muun. That said, he did seem to have shown a high degree of tactical ability, destroying the planet's garrison by engaging it with an advance force before landing the main body of his troops behind them, catching them between his two contingents and almost completely wiping them out. He showed somewhat less finesse in dealing with a force of Sons and Daughters of Freedom, overrunning their position through sheer weight of numbers, though it should be noted that he was directly ordered to do so by Dooku—an order which he protested against at the time. Although this attack caused his forces to take severe casualties, he was nevertheless able to effectively face the clone trooper counterattack, using a mobile reserve of tank droids and underground bunkers to shield his droids from artillery."}, {"tag": "p", "text": "Despite all his careful planning, Pors Tonith's one fatal mistake was having the hostages close to the command center. He was eventually captured by Anakin Skywalker in an assault which, by all rights, should have been suicidal, after the Muun prepared to eliminate his hostages."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Despite his limited military experience prior to the outbreak of the Clone Wars, Pors Tonith proved to be a skilled strategist and tactician. However, he frequently expressed overconfidence about his talents as a commander, regarding himself as a superior battlefield leader to General Grievous and underestimating Anakin Skywalker's resolve in their final confrontation."}, {"tag": "p", "text": "Tonith also had an affection for dianogan tea, and his fondness for the drink left him with stained purple teeth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}