{"url": "Porso_Hill", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Islands", "Category:Mountains", "Category:Naboo locations"], "nodes": [{"tag": "h1", "text": "Porso Hill"}, {"tag": "p", "text": "Porso Hill was an island located on the planet Naboo. During the Invasion of Naboo in 32 BBY, the hill served as the site of a temporary prison camp for the smuggler Borvo the Hutt's captured slaves. Porso Hill was attacked by Lieutenant Gavyn Sykes, who defeated Borvo and rescued the slaves from the criminal's base."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Porso Hill was an island located in a body of water on the planet Naboo. The gray hill was flat at its top and had five extensions, which sloped down into the water. It was found inside a canyon with only two chokepoints as entrances. Many small, grassy islands surrounded the canyon, and one of the islands had trees on it."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As of the Trade Federation's Invasion of Naboo in the year 32 BBY, the islands surrounding Porso Hill had laser turrets and missile launchers placed on them. One of the islands also held a vehicular weapons upgrade hidden behind a grove of trees."}, {"tag": "p", "text": "The smuggler Borvo the Hutt established a camp on Porso Hill around the time of the invasion for his criminal organization. The camp included a docking station for his freighter as well as eight barracks. He put Naboo slaves whom he planned to sell in a makeshift prison there after rescuing them from the invading Trade Federation. Borvo's camp was destroyed by the Naboo Royal Security Forces' Bravo Flight, led by Lieutenant Gavyn Sykes, who was searching for Borvo to find justice for the Hutt's betrayal and murder of Captain Kael. Sykes subsequently rescued Borvo's slaves and destroyed Borvo's transport. The Hutt fled Porso Hill and retreated to his homeworld, Nal Hutta."}, {"tag": "p", "text": "During the attack, Sykes located and picked up the vehicle upgrade from the island before proceeding to Porso Hill."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Porso Hill appears in the 2000 video game Star Wars: Episode I: Battle for Naboo. In the level in which it appears, the player's bonus objective is to find the hidden upgrade—advanced lasers—near the hill."}, {"tag": "p", "text": "The 2008 reference book The Complete Star Wars Encyclopedia includes an entry for Porso Hill, although it misidentifies the location as \"Portho Hill.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}