{"url": "Porporite", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Cetacean sentient species", "Category:Extinct sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Porporite"}, {"tag": "p", "text": "The Porporites were a cetacean species from the Porpor system. After making first contact with the Galactic Republic shortly after the Great Hyperspace War, they became addicted to ryll spice, which had recently been discovered. It whipped them into a homicidal frenzy, prompting them to attack other worlds. They withstood everything the Republic used to stop them until they were finally exterminated by the Ganks in 4800 BBY at the beginning of what became known as the Gank Massacres."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Porporites were a sentient species of cetaceans. They had an extremely rapid reproduction cycle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Porporites were native to the Porpor system, located in the Grohl sector and the general vicinity of the Naps Fral Cluster in the Outer Rim Territories. They were first introduced to the Galactic Republic shortly after the Great Hyperspace War, which ended in 4,990 BBY. Some time after this, ryll spice was discovered on the planet Ryloth. The Neimoidian species gained exclusive distribution rights and introduced the spice to the Porporites. The drug induced homicidal rage in Porporite users, and widespread addiction to the substance swept through the Porporite population. The formerly peaceful species was transformed into violent maniacs and started assaulting other planets. Faced with waves of maddened Porporites, the Republic asked the Jedi Order for assistance. The Jedi intervened, fighting alongside newly commissioned Juggernaut war droids, but had little success in placating the Porporites."}, {"tag": "p", "text": "Concerned neighboring species of the Porpor system and various other factions responded to this threat by hiring Gank mercenaries, also known as Gank Killers, to protect them and to eliminate the Porporites. In 4800 BBY, the Ganks exterminated the entire Porporite species—only to continue their rampage in a full-scale war against the Republic. That war, later known as the Gank Massacres, was eventually put down by the Jedi Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Porporites were first mentioned in The New Essential Chronology, authored by Daniel Wallace and Kevin J. Anderson and published in 2005. They were again mentioned in the 2006 The New Essential Guide to Droids, also written by Wallace, which describes them as cetaceans. Although not defined in the book itself, cetaceans are a form of mammallian lifeform adapted to aquatic life, such as porpoises, whales and dolphins. The Porporites were also mentioned in the Codex of Star Wars: The Old Republic, a massively multiplayer online roleplaying game (MMORPG) by BioWare. The Codex entry on the Porporites was accessible when the player-character gained a datacron on Nar Shaddaa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}