{"url": "Portal", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Physics", "Category:Portals", "Category:Time"], "nodes": [{"tag": "h1", "text": "Portal"}, {"tag": "p", "text": "A portal was a tear through the Force, a gateway between life and death, which pierced the veil of time and space."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A spacebound monolith located in the Chrelythiumn system contained a vergence in the Force that transported matter into the realm of Mortis, the fulcrum of the galaxy and the Force as a result of the eternal struggle between the Daughter, the Son, and the Father—a trio of Force wielders who personified the duality and balance of the Force."}, {"tag": "p", "text": "The Sith cave on Mustafar, following the construction of Sith Lord Darth Vader's Fortress had a portal. The portal used the fortress to amplify its power. Sith Lord Darth Momin claimed the portal could bring Vader's deceased wife, Padmé Amidala, back to life. Vader attempted to open the portal but was unable to do so due to an attack by the Mustafarians. This allowed Momin to resurrect himself."}, {"tag": "p", "text": "After Vader defeated Momin, Vader was able to open the portal. As he entered the portal, Vader's soul left his body. Inside, Vader saw visions of his mother, Lord Sidious, and his younger self. Vader then saw his memories of past events in his life from his victory in the Boonta Eve Classic to a duel with his former apprentice. Vader came across vision of the Jedi Temple, where he was confronted by apparitions of his fellow Jedi, his former master and Darth Sidious. After defeating the apparitions, Vader found his wife. He asked Amidala to come with him, but she said that Vader's former self, Anakin Skywalker, was dead to her. Amidala took her life in Vader's inability to let go, and with a beam of blue light from their son Luke Skywalker, the Sith Lord was returned to his body. In his anger, Vader destroyed the portal."}, {"tag": "p", "text": "The Jedi Temple on Lothal had a portal that led to the World Between Worlds, containing countless other portals that could be accessed across the space-time continuum. Ezra Bridger heard voices emanating from many of them in the past and the future, and witnessed the duel on Malachor between Tano and Vader through one of these portals."}, {"tag": "p", "text": "Bridger soon found that he could interact with them and in doing so, was able to save Ahsoka by pulling her through the portal into the World Between Worlds. Due to Ezra's interference, the veil between dimensions was weakened and Sidious from the Ceremonial chamber in Inquisitorius Headquarters on Coruscant was also able to peer into it with the help of Sith magic. Since he captured Ezra with a fiery lasso however, he could not physically enter and needed Ezra to fully access the power the dimension held because he had been stopped by Ahsoka Tano's lightsabers. After having fought off Sidious's attempts to capture them, both Ezra and Ahsoka returned back through the portals they had come from, with Ahsoka returning to Malachor and Ezra back to Lothal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}