{"url": "Poss%27Nomin", "categories": ["Category:Legends articles", "Category:Outer Rim Territories species", "Category:Poss'Nomin"], "nodes": [{"tag": "h1", "text": "Poss'Nomin"}, {"tag": "p", "text": "The Poss'Nomin were a sentient species indigenous to the planet Illarreen. Thickly built humanoids slightly larger than the average Human, they were easily recognized by their large, shovel-shaped jaws and their three eyes."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Poss'Nomin had thick bones, which made them bulky in comparison to other humanoids of the same average height, though no more muscular. Their large jaws were filled with both flat and sharp teeth, an adaptation to an omnivorous diet. Their skin was almost entirely red, though some racial groups had brown or black forearm spots. Their wide faces were set off by angular cheek bones trimmed with knobs of cartilage, and with their three large eyes."}, {"tag": "p", "text": "The three eyes of the Poss'Nomin were widely set in a horizontal row, giving them a wide field of vision. Each eye had two fleshy eyelids, with the outer one used primarily during sleep. Their eyes were mostly orange, except for irises which ranged from yellow to dark blue."}, {"tag": "h2", "text": "Culture and History"}, {"tag": "p", "text": "The Poss'Nomin first arose on the east coast of the island continent Vhin, in the northern hemisphere of Illarreen. Though it was initially a comfortable home, intense climate change over the course of a few centuries (possibly due to solar flares from their sun) rendered it uninhabitable. This spurred the development of boat-building technologies, allowing the Poss'Nomin to explore and settle more hospitable regions of Vhin and the rest of Illarreen. Ever since those years of migration, a fundamental desire to explore was part of the Poss'Nomin psyche."}, {"tag": "p", "text": "Millennia after their great explorations, Poss'Nomin civilization had grown and fragmented into several powerful nations, each with its own political ideologies and goals. These differences led to a period of global warfare, which only stopped when a group of spice traders came across their homeworld circa 100 BBY. Within ten years of first contact, the Poss'Nomin nations put aside their differences, formed a united government, and joined forces in order to enter the galactic community."}, {"tag": "p", "text": "The united government formed by the Poss'Nomin was a loose federation, with most of the power still in the hands of regional governments. Officials in all of these regional governments were chosen through popular elections held every three standard years, with all adult Poss'Nomin allowed to vote. Most Poss'Nomin voted for leaders who would best help their people in the galactic community."}, {"tag": "p", "text": "By the time of the Galactic Civil War, one third of the population boasted galactic-standard technology. Many Poss'Nomin left their homeworld, frequently working as scouts or in other space-faring professions, such as the explorer Kiv'arwa, who worked for Rim Commercial Mining. Some of these Poss'Nomin traveled deep within Wild Space or even beyond. A less reputable heir to this Poss'Nomin exploratory tradition was the legendary pirate Reginald Barkbone."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}