{"url": "Post%E2%80%93Great_Hyperspace_War_counterinvasion", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Conflicts involving the Galactic Republic", "Category:Conflicts involving the Sith Empire", "Category:Conflicts of the Colonies", "Category:Conflicts of the Outer Rim Territories", "Category:Genocides and massacres", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Post–Great Hyperspace War counterinvasion"}, {"tag": "p", "text": "Sometime after the second battle of Korriban, Galactic Republic Supreme Chancellor Pultimo authorized a post–Great Hyperspace War counterinvasion of the Sith Empire centered on the Sith Worlds of the Stygian Caldera and outlying Sith colonial holdings elsewhere in the galaxy."}, {"tag": "p", "text": "This period of Sith history immediately following the Great Hyperspace War was characterized by internal civil conflict, rampant disease, famine, and ritual mass-suicides among the surviving Sith-blooded remnant of the Empire. These events served as the backdrop to the joint Jedi-Republic counterinvasion of the Empire, a campaign aimed at assuring the complete destruction of the Empire and any vestigial threat it posed to the safety of the Republic."}, {"tag": "p", "text": "Though some Sith survivors continued to oppose the Republic militarily, most refugees fled into exile on outlying Sith colonies like Ambria, Thule, Tund, and Vjun or joined the Sith exodus as members of Vitiate's exile fleet bound for the forgotten colony of Dromund Kaas. In addition to these diasporas, a handful of vestigial Kissai and Massassi communities persisted in isolation on Korriban well into the Old Sith Wars period."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Golden Age of the Sith"}, {"tag": "p", "text": "The Sith Empire of antiquity was founded in 6900 BBY by the Exiles, a group of Dark Jedi survivors of the Hundred-Year Darkness who subsequently ruled and interbred with the primitive Force-sensitive Sith species native to Korriban. Over the next two millennia, the half-breed descendants of this union came to rule the Sith Worlds of the Stygian Caldera and a handful of outlying colonies further afield, remaining hidden in isolation for fear of discovery by the Galactic Republic and Jedi Order. Around 5100 BBY, a particularly powerful Sith Lord by the name of Marka Ragnos overcame his rival in a duel for the rulership of the Sith Empire. During his century-long tenure as presiding Jen'ari or \"Dark Lord,\" Ragnos oversaw a period of wealth and prosperity subsequently known as the Golden Age of the Sith."}, {"tag": "h3", "text": "Preparations for war"}, {"tag": "p", "text": "Ragnos died of old age in 5000 BBY, leaving a resultant power vacuum that was soon filled by contenders Naga Sadow and Ludo Kressh. Their duel for the Dark Lordship coincided with the capture of wayward explorers Gav and Jori Daragon, siblings whose unexpected arrival to the Valley of the Dark Lords on Korriban stoked fears across the Empire of Republic rediscovery. Capitalizing upon such sentiments, Sadow orchestrated a series of events involving the Daragons that seemed to confirm the likelihood of an incoming Republic invasion. This power play ultimately allowed Sadow to portray himself as a potential savior of the Sith capable of answering to the Republic, empowering him to claim the title of Jen'ari with the backing of a Sith Council majority."}, {"tag": "p", "text": "As a noted imperialist possessed of expansionist sensibilities, Sadow was quick to use the alleged Republic invasion as an opportunity to push his own political agenda calling for the Empire to expand outward from its traditional holdings in the Stygian Caldera into new territories. As the new Dark Lord of the Sith, he called for a preemptive invasion of the Republic and cobbled together an invasion fleet mustered around his fief world of Khar Delba. Though Kressh's faction discovered Sadow's deceptions, their attempts to address his treachery ended in defeat in the battle of Khar Delba, during which Sadow allowed Jori Daragon to escape the Empire aboard her ship. Sadow and his fleet followed the homing beacon secretly placed aboard her ship soon thereafter, heralding the formal start to the Empire's lightning invasion of the Republic."}, {"tag": "h3", "text": "Great Hyperspace War"}, {"tag": "p", "text": "Establishing his headquarters in the Primus Goluud system, Sadow bolstered the numbers and military strength of his invasion forces with illusions of Sith magic cast from afar within his Sith Meditation Sphere. Though the Sith Empire initially enjoyed a series of victories against the unsuspecting Republic, their advance was halted and their momentum stalled once the forces of the Republic Military regrouped and reformed at Anaxes. Betrayed and attacked by his remorseful Sith apprentice Gav Daragon, Sadow's Force illusions disappeared from the battlefields of the war as his concentration wavered, revealing the true size of the Sith forces. The Republic and their Jedi defenders, augmented by Korosian forces under Empress Teta, drove the Sith out of the Republic and back down the Daragon Trail to Korriban."}, {"tag": "p", "text": "Sadow and his tattered fleet arrived at the Sith homeworld to find that the Empire had been claimed by a resurgent Ludo Kressh in Sadow's absence. In the subsequent battle, Sadow finally brought an end to his long-term rival, though at a great cost to the collective Sith forces of both sides. The full extent of Daragon's betrayal became evident with the sudden arrival of a Republic-Korosian task force armed with the astrogation data Daragon had managed to provide Teta prior to his death. In the resultant second battle of Korriban, the remaining Sith suffered heavy casualties, and Sadow fled in disgrace into exile on Yavin 4, leaving the Empire to its demise. After assuring the destruction of the Sith fleet, Teta and her allies departed Korriban in haste, having suffered enough casualties and lost enough ships at the hands of the Empire."}, {"tag": "h2", "text": "The counterinvasion"}, {"tag": "h3", "text": "Republic occupation"}, {"tag": "p", "text": "In the aftermath of its decisive defeat, the shattered Sith Empire was wracked by intermittent internal conflict, famine, and disease as it reverted to the state of warfare and barbarism in which the Dark Jedi Exiles had discovered it millennia before. The shame of defeat and the loss of two Dark Lords in quick succession seriously affected the morale of those Sith who survived the war and its aftermath, ultimately leading to ritualistic mass-suicides undertaken by the lower castes of Sith society."}, {"tag": "p", "text": "As the Republic began to rebuild and recover from the Sith occupation of its core worlds, Supreme Chancellor Pultimo authorized a joint Jedi-Republic counterinvasion of the Sith Worlds aimed at assuring the complete destruction of the Empire and any vestigial threat it posed to the safety of the Republic. The Chancellor and his political allies framed this invasion as a battle against the institutions of the Empire rather than a war for the extermination of its citizenry, stating that such actions were necessary to free the Sith species from the dark-sided corruption under which it had suffered for centuries."}, {"tag": "p", "text": "Across the Sith Worlds, battleships and bombers laid waste to Sith military complexes and centers of power while Republic strike teams on the ground captured Sith survivors and refugees en masse. Though some groups of Sith survivors continued to resist the Republic occupation militarily, the Jedi avoided killing captured or surrendered Sith outright—instead, adopting the practice implemented by Jedi Knight Odan-Urr, the Jedi chose to sever their respective connections to the Force."}, {"tag": "h3", "text": "Artifact purge"}, {"tag": "p", "text": "While the Republic focused on eradicating vestigial military threats posed to the Republic, the Jedi turned to the iconoclastic destruction of recovered Sith artifacts and Sith scrolls found in the tombs and sacred places of the Sith. Groups of Jedi Shadows scoured the Sith Worlds for such dark-sided objects, either overseeing their destruction or recovering them for study by Jedi Masters. Despite the Order's comprehensive effort to wipe out all significant repositories of knowledge, certain caches of artifacts and scrolls containing preserved Sith knowledge survived the Jedi purge and were subsequently rediscovered in the centuries that followed by various groups of dark-side adherents."}, {"tag": "p", "text": "During this time, a number of museum curators of the Galactic Museum on Coruscant decried the destruction of Sith artifacts as an act of cultural desecration and instead demanded that such antiquities be surrendered to the museum for preservation and display. Eventually, the Jedi Order agreed to a compromise, permitting certain artifacts to be displayed in the Galactic Museum's Sith Hall provided all Sith holocrons be handed over to the Jedi. A number of these holocrons found their way into the Great Jedi Library on Ossus following its construction. Among these, the Dark Holocron remained in the possession of the Keeper of Antiquities, Odan-Urr, until his death a millennium later in the lead-up to the Great Sith War."}, {"tag": "h3", "text": "Destruction of sacred sites"}, {"tag": "p", "text": "In addition to capturing survivors and destroying artifacts, the Jedi and the Republic concurrently oversaw a campaign to destroy Sith sacred sites rich in dark-side power and structures housing arcane Sith lore. Structures damaged or destroyed during this campaign ranged from the burial grounds of the Valley of the Dark Lords on Korriban to the monolithic statues and monuments depicting ancient Sith that lined the cliffs of Begeren."}, {"tag": "p", "text": "At some point during this period, a number of Jedi stumbled upon the Veeshas Tuwan on the world of Arkania. The Veeshas Tuwan, a city-sized library-temple located in Arkania's frozen wastes, was widely considered the foremost repository of Sith artifacts and lore in the Sith Empire. Attacking and pillaging the complex, the Jedi recovered a number of writings and scrolls from its shelves and chambers before destroying its artifacts and burning its precinct to the ground. Subsequent groups of Sith in later millennia decried the destruction of the Veeshas Tuwan as one of the worst losses suffered by the Sith in their entire history, as many priceless objects and writings of cultural significance were presumed lost during its destruction."}, {"tag": "h3", "text": "Ritual of Nathema"}, {"tag": "p", "text": "During the last days of the Republic invasion, a reclusive Sith Lord named Vitiate emerged from the solitude in which he had spent the Great Hyperspace War and called a conclave of all surviving Sith Lords on his fief world of Nathema. Transmissions began blanketing the Sith Worlds with messages of hope, warning listeners that the Jedi intended to systematically exterminate the entire Sith species and urging any surviving Sith Lords to join Vitiate in an involved ritual of Sith magic guaranteed to defeat the invaders."}, {"tag": "p", "text": "Republic invasion forces assaulting Korriban were temporarily forced to retreat from the Horuset system, driven from Korriban courtesy of a suicide attack ordered by acting Jen'ari Shar Dakhan. In the brief lull that followed, Sith survivors tentatively crawled forth from the shattered tombs and ruined cities in which they had previously taken refuge. Vitiate himself appeared in their midst in the days that followed and gathered to his side some eight thousand surviving Sith Lords and Sith Councilors. Returning to Nathema, these were joined soon thereafter by other Sith Lords from across the Empire who had likewise answered the call and converged on Vitiate's palace at his invitation."}, {"tag": "p", "text": "Unbeknownst to those present, Vitiate had assembled the remaining Sith Lords for a more nefarious purpose than defeating the Republic—the assurance of immortality and the simultaneous elimination of any remaining potential rivals among the Sith. Binding the assembled Sith Lords and their respective power in the Force to his will by means of a potent Qâzoi Kyantuska invocation, Vitiate undertook an extended immortality ritual that lasted ten days and destroyed all life on Nathema. The so-called Ritual of Nathema rendered Vitiate functionally immortal and granted him immense power in the Force at the expense of the planet and those in residence on its surface."}, {"tag": "h3", "text": "Sith exodus"}, {"tag": "p", "text": "Having achieved immortality and overseen the destruction of any remaining potential rivals in the Sith establishment, Vitiate departed his husk of a fiefdom with his loyal supporters in tow. He publicly attributed the destruction of Nathema to the Jedi, using its desolation as further proof of his claim that the Republic counterinvasion was aimed at the systematic extermination of the Sith people. Taking up the mantle of Sith Emperor and promising revenge upon the Jedi and Republic, Vitiate cobbled together a small fleet of Sith personnel carriers and Sith dreadnaughts in preparation for a tactical retreat from the Stygian Caldera and Sith Worlds."}, {"tag": "p", "text": "During this time, Vitiate once again presented himself on Korriban, gathering the dispossessed and harried remnants of the Sith still in residence on the planet. Selecting from their number the youngest generation of survivors, Vitiate and his fleet departed Korriban in haste to avoid attracting the attention of resurgent Republic forces rebounding from Darkhan's attacks. Over the next two decades, the exodus fleet perambulated at random down the Kamat Krote in the general direction of Dromund Kaas, a lost Sith colony world previously rediscovered by Vitiate's researchers prior to the Ritual of Nathema. Over the years, the young Sith survivors came to depend solely on Vitiate for guidance and direction, listening with rapturous awe as he revealed his plans for a renewed Sith Empire capable of inviting vengeance upon the Jedi and Republic. The Sith dedicated themselves to training during their time adrift in hyperspace, arming themselves with the power of the dark side and analyzing the tactical and strategic circumstances that had led to their defeat in the Great Hyperspace War."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "h3", "text": "Survivors in the Sith Worlds"}, {"tag": "p", "text": "The Jedi-Republic occupation forces temporarily forced out of the Horuset system by Shar Dakhan's suicide attacks eventually returned to Korriban and successfully concluded the counterinvasion. Though the Republic Military eventually withdrew from the Sith Worlds, Jedi Shadows continued to hunt down dark-sided artifacts during the subsequent post-Manderon period, though certain isolated caches escaped their notice and were eventually recovered by various groups of dark-side adherents. On Korriban itself, those Sith survivors who managed to evade capture by occupying Jedi-Republic forces retreated into the planet's shattered tombs and remote deserts far from the major population centers, forming vestigial communities of Kissai priests and Massassi warriors. These communities and their respective settlements persisted in the more remote corners of Korriban for centuries, continuing to haunt the red wastes of their homeworld well into the Old Sith Wars and inter-Sith Wars period."}, {"tag": "h3", "text": "Reconstituted Sith Empire"}, {"tag": "p", "text": "The Sith exodus fleet's twenty-year perambulations across the Unknown Regions came to an end around 4980 BBY with the colonization of Dromund Kaas. Formally establishing a reconstituted Sith Empire under his control, Vitiate set his people to work taming the wilderness of their new homeworld. He subsequently appointed new Sith Lords from among the population of young Sith, the most powerful of whom served on the Dark Council and oversaw the twelve Spheres of Influence. The Sith Emperor retreated into seclusion in the days that followed, leaving the day-to-day rulership of the Empire in the hands of his Council. As the centuries progressed, the Empire continued to prepare itself for the day in which it would sally forth from its hidden refuge and take back the ancestral homeworlds of the Sith."}, {"tag": "h3", "text": "Other Sith diasporas"}, {"tag": "p", "text": "At the height of its power, the Sith Empire of antiquity oversaw and ruled some one hundred and twenty worlds scattered across the galaxy. While most of these holdings were concentrated in the Sith Worlds of the Stygian Caldera, the Empire administered a number of outlying colonies situated in more distant sectors. Following the end of the Great Hyperspace War and the subsequent Republic counterinvasion of the Stygian Caldera, a number of Sith refugees fled to these disparate outlying colony worlds previously overseen by the Sith Empire. Foremost among these Sith refuges were Ambria, Thule, Tund,, and Vjun, though other Sith fled further afield into the depths of the Unknown Regions."}, {"tag": "p", "text": "On Thule, a remote Force nexus nestled outside the Caldera on its westernmost flanks, a number of Sith loyalists joined themselves to a Sith stealth regiment headquartered on the planet. Confident that the Empire's defeat at the hands of the Republic would be temporary, this special forces unit trained in preparation to serve as an advance force for the resurgent Sith Empire they predicted would eventually arise to avenge its defeat. While the Thule survivors remained in contact with other groups of survivors, their numbers depleted over the centuries, though their descendants continued to abide on Thule and serve the Sith even into the Imperial Period."}, {"tag": "p", "text": "Other Sith refugees fled to the distant planet of Tund, a heavily Forceful world lost on the northeastern borders of the Open Sea. Originally the haunt of heretical Kissai priests who interpreted the death of Adas in the 27,700 BBY Rakata invasion of Korriban as a sign to reject the dark side, Tund was subsequently used as a Sith penal colony in the years prior to the arrival of the Exiles in 6900 BBY. Over time, Sith refugees fleeing the Stygian Caldera merged with the native Sith abiding on Tund to form the Sorcerers of Tund, a mystical group of Force users who resided on Tund until its destruction in 5 BBY at the hands of Rokur Gepta."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though several sources mentioning the counterinvasion seemingly consider it a part of the Great Hyperspace War itself, the vast majority suggest that it occurred after the formal conclusion of the war in the aftermath of the second battle of Korriban. The exact timeline of events constituting the counterinvasion is also never explicitly listed in any chronological order, though details can be pieced together from various sources. For example, the The Old Republic Codex entry titled \"Galactic History 30: Rise of the Sith Emperor\" mentions that Republic occupation forces were forced to retreat temporarily from the Horuset system for some unknown reason prior to the Ritual of Nathema. This was offhandedly corroborated by The Essential Atlas, with the reason for the Republic's temporary retreat revealed to be acting Jen'ari Shar Dakhan's suicide attacks on Republic forces sometime after Pultimo initially authorized the counterinvasion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}