{"url": "Potentium", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Force philosophies"], "nodes": [{"tag": "h1", "text": "Potentium"}, {"tag": "p", "text": "The Potentium was the name of a sect of beings who had a particular way of viewing the Force as a whole (without its traditional division into light and dark sides). They also used the term to refer to the Force itself, instead of the vernacular term common to most of the galaxy—\"the Force.\""}, {"tag": "h2", "text": "Beliefs"}, {"tag": "p", "text": "Counter to millennia of Jedi teachings, the followers of Potentium claimed that there was no inherent evil in viewing the Force. They claimed that what others called the light side of the Force was actually just the Force itself, which was inherently good. This was backed up by the fact that Ashla, the ancient name of the Force, came later to describe the light side. What others therefore called the dark side was a perversion of the Force, twisted by those who used it."}, {"tag": "p", "text": "Believers of Potentium said that the potential for light and dark sides resided in the user, not the Force itself, and that the Jedi were merely afraid to explore the full potential of the Force. They also thought that the Jedi Masters refused to believe in the Potentium view because it would mean the Jedi were not needed to fight evil, for evil would not exist. And since there was no dark side, there were no dark side actions or Force techniques; in effect any action, good or evil, could be performed without risk as long as the intent was not evil. Some Jedi theorized that the Potentium may have originated as a Sith scheme to subvert Jedi teachings."}, {"tag": "p", "text": "About a century before the Battle of Naboo, the followers of Potentium were expelled from the Jedi Order, parallel to the Jedi Order's treatment of Gray Jedi as \"misguided.\" Yoda and the rest of the Jedi High Council did not consider them Dark Jedi, but they said it was the duty of the Jedi to use the Force to protect others, not study its absolute limits. The Council said that testing the Force to its limits would lead to the dark side."}, {"tag": "p", "text": "It should be noted that some followers of the Potentium still attempted to avoid the dark side. They, however, saw the dark side as something within themselves to be avoided, not something in the Force. They reasoned that if the Force was the energy that flows through all life, the dark side simply came from the corruption of humanity. They felt that if they could be perfectly moral, they could be immune to the dark side and therefore use any technique they wanted. This view was somewhat similar to the Unifying Force theory of the Force."}, {"tag": "h2", "text": "Followers"}, {"tag": "p", "text": "The Potentium was theorized in 132 BBY. At the time the Potentium were expelled from the Jedi, Leor Hal was their leader. Prior to their expulsion, Hal had recruited many students from prospective Jedi among the aristocratic families of Coruscant and Alderaan."}, {"tag": "p", "text": "Sekot, the intelligent essence of the planet Zonama Sekot, accepted Potentium after its awakening, when it was colonized by some of the outcast followers under their first Magister, Hal. The colonists felt Zonama Sekot was proof of the Potentium philosophy, and Sekot eventually came to consider itself the protector of the Force (though as some derisively pointed out, this protectorship was self-appointed). Sekot later confessed to young Anakin Skywalker, however, that indeed it was not the Potentium."}, {"tag": "p", "text": "At some point before 44 BBY, Jedi Masters Qui-Gon Jinn and Mace Windu had a run-in with a group of Potentium apprentices."}, {"tag": "p", "text": "Although many believed that Luke Skywalker's New Jedi Order practiced this belief after the Yuuzhan Vong War through Jacen Solo's insistence, it was actually closer to the philosophy of Gray Jedi as stated by Grand Master Skywalker himself after the Battle of Yuuzhan'tar. Near the end of the Swarm War, the New Jedi Order resumed the more orthodox light side and dark side approach."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Power of the Jedi Sourcebook states that the Potentium is a corrupt, misguided philosophy, and was the first source considered canonical within the continuity of Star Wars Legends that stated this outright."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}