{"url": "Power_gem", "categories": ["Category:Legends articles", "Category:Artifacts", "Category:Gemstones"], "nodes": [{"tag": "h1", "text": "Power gem"}, {"tag": "p", "text": "Power gems were extremely powerful stones capable of emitting a shield-disrupting aura. Once part of an ancient, rare meteor, power gems gradually lost their abilities over time, but were potent when first mined."}, {"tag": "p", "text": "In 23 BBY, Quenelle and Obi-Wan Kenobi attempted to locate a set of three power gems, known as the Lost Stars of Nallastia, on the moon of Nallastia. Upon finding them, they used them to dissipate an energy field."}, {"tag": "p", "text": "The Pirates of Iridium, prior to their destruction by the Jedi in 22 BBY, used these shards to great effect in their operations. By taking advantage of the gems' shield-disrupting power, they could cripple spice freighters and other spacecraft, looting their contents with little resistance. Leia learned of the event from her childhood as stories her father, Bail Organa, told her."}, {"tag": "p", "text": "While for a time it was presumed that all power gems were destroyed with their bandit owners, one of the relics survived in the possession of the smuggler and ex-pirate Raskar. Retiring to the remote Outer Rim planet of Antipose, Raskar kept the gem until a worthy foe bested him in combat. Eventually, he was trounced by a cocky smuggler and his furry companion, and was forced to relinquish control of the last power gem, the item that they were sent to retrieve by the Rebel Alliance as a last resort against the Executor."}, {"tag": "p", "text": "After joining the Rebel Alliance, Han Solo and Chewbacca, upon retrieving the power gem, turned their acquisition over to General Jan Dodonna immediately following the Battle of Yavin. In a futile effort to destroy the Super Star Destroyer Executor, Jan's son, Vrad, took the gem and flew skyward. This action did little to disrupt the warship's shield—hardly any power was left in the gem after all the years that had passed. While the general's son failed to destroy Executor, his brave attack did buy the Alliance time to successfully evacuate the Yavin 4 base. In addition, the little amount of shielding that was disrupted nonetheless allowed the Millennium Falcon to damage one of the Executor's sublight engines."}, {"tag": "p", "text": "Besides the power gem kept by Raskar, there were other power gems scattered across the galaxy, usually buried, which some spacers attempted to locate during the Galactic Civil War. While not potent enough to disrupt the shields of enemy vessels, they were nonetheless powerful enough to mitigate damage on their wielders, as well as enhance their ability to dodge. In addition, they also acted as a pink light source for various spacer houses."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The power gem first appeared in the Star Wars comic strip story arc The Power Gem, where Han Solo was dispatched by Princess Leia and the Rebel Alliance to find one to mount a defense against the Executor. It didn't see use until Doom Mission, two story arcs later."}, {"tag": "p", "text": "Despite the comic strips strongly implying that the power gem that Han Solo found was the last remaining gem in the galaxy, several power gems were found as extremely rare loot items in the online game Star Wars Galaxies: An Empire Divided, albeit with significantly different properties. The power gems, if found by players, allowed the player to access an ability called \"Power Stone Dodge,\" which increases their dodge ability by 3%, and removes a debuff. The effect was estimated to have a duration of 2 minutes, and its reuse time was 60 minutes. The description erroneously labels it as having a blue color."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}