{"url": "Power_droid/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Power droids"], "nodes": [{"tag": "h1", "text": "Power droid"}, {"tag": "p", "text": "Power droids were boxy droids with two or four legs that served as mobile batteries, capable of powering a variety of machinery and vehicles. They were commonly encountered throughout the galaxy due to their versatility."}, {"tag": "p", "text": "Some models of power droid were colloquially referred to as \"gonks,\" after the onomatopoeia of their vocalizations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Notable power droid models included the EG-6 power droid produced by Veril Line Systems, the EG-4 found in Echo Base on Hoth, and the GNK power droid manufactured by Industrial Automaton. A plunk droid served with the Open Circle Fleet during the Clone Wars."}, {"tag": "p", "text": "After C-3PO and R2-D2 were given to Jabba Desilijic Tiure by Luke Skywalker, the droids were taken to EV-9D9, who was in the middle of torturing a power droid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first of the power droid appearances is in Star Wars: Episode IV A New Hope. In the scene inside the Jawa Sandcrawler, after the capture of R2-D2, a power droid can be seen walking around the junk room voicing its trademark \"Gonk, Gonk.\" A very different-looking droid, used for the vintage Kenner action figure mentioned below, is the next power droid seen. It is visible walking behind Aunt Beru when Luke looks down into their homestead from the crater's rim (when she's telling Luke to be sure their next protocol droid can speak Bocce). This droid might only be visible on widescreen home versions. The next appearance of a power droid is in the streets of the Mos Eisely Spaceport then in the background of the Death Star's hangar bay and hallways. Several power droids can be seen in Echo Base, on the ice planet Hoth in Star Wars: Episode V The Empire Strikes Back. The droids can be seen walking near Han Solo after returning from his tauntaun patrol. An inverted power droid is seen Star Wars: Episode VI Return of the Jedi in the dungeon of Jabba the Hutt. The droid known as 8D8 is in the process of torturing a power droid with the application of a hot branding iron to its feet."}, {"tag": "p", "text": "In the videogame Star Wars: Galactic Battlegrounds: Clone Campaigns, power droids are used as mobile power generators for powering buildings."}, {"tag": "p", "text": "In Star Wars: Battlefront and Star Wars: Battlefront II, power droids allow the player to replenish their ammunition and supplies. This is achieved by standing in range of the droid and selecting the designated function."}, {"tag": "p", "text": "In LEGO Star Wars II: The Original Trilogy, Power Droids appear as a playable character. They are extremely slow, and their only use seems to be climbing steep slopes. They go under the name of Gonk Droid instead of power droid."}, {"tag": "p", "text": "The power droid's debut in figure form came in the second 1978 wave of the Kenner vintage Star Wars line and went on to be released on Empire and Jedi cards. Oddly, the droid paint and detail scheme used for the figure comes from the one owned by Aunt Beru (mentioned above) while the figure's picture is of the brown droid seen inside the Sandcrawler. So the figure consists of a blue single piece plastic molded body with orange paint detail and a white band, two black ribbed legs ending at silver spray painted feet, a small black rubber antenna towards the rear of the body and a sticker depicting the frontal control panel's detail. This figure featured a detail common to R2-D2 and R5-D4 in that movement of a body part created a sound effect, in this case, movement of the legs. This sound was created by a two small pieces of white plastic secured inside the body of the droid. When the legs were moved forward and backward together or individually, the snapping of the plastic against the ridged hinges at the top of the legs created a very distinctive hollow clicking sound.\nThere is an interesting packaging variation with this vintage figure. Inside its bubble, to save space, the power droid was packaged with one of its sides against the card and its opposite side against the bubble. The majority of the vintage power droids where packaged with their left side on the card, meaning that the front of the droid faces towards the card image. Some power droids can be found packaged with their right side on the card, meaning that the front of the droid looks away from the card image. Although this difference is a minor variation, of interest to collectors who may wish to obtain both types, there were no major variations made of this figure."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}