{"url": "Power_core/Legends", "categories": ["Category:Legends articles", "Category:Technology stubs", "Category:Reactors and power generators"], "nodes": [{"tag": "h1", "text": "Power core"}, {"tag": "p", "text": "A power core was an energy production facility that provided power for buildings and starships. Cities had numerous power cores built within their boundaries to provide energy to the various homes, facilities, and businesses established within. Colonies and encampments often had a more primitive form of power core, these being little more than an oversized energy cell. Rather than produce energy, it supplied power until it ran out. These smaller power cores were often used by survey teams, due to their much smaller impact on the environment. A damaged power core was used by the Trade Federation and the Wookiees' destruction of it was one of the catalysts of the Battle for Alaris Prime. In 28 ABY, Wedge Antilles ordered the shielding efficiency of the Mon Mothma to reduce at a set rate, tricking the Yuuzhan Vong into thinking its power core would explode. Ground-based power cores were used by the Galactic Empire, the Gungans, the Rebel Alliance, the Royal Naboo, the Trade Federation, the Wookiees, the Confederacy, and the Galactic Republic."}, {"tag": "p", "text": "Most power cores built by various cultures included their cultural architecture and design aesthetics. Many Wookiee power cores utilized Wookiee architecture and had a light-orange central energy core, while many Gungan power cores were at least partially based in biotechnology and had a white-colored energy core. The Naboo built power cores that were fanciful in design and predominantly featured yellow and silver colors. The energy cores themselves were colored yellow."}, {"tag": "p", "text": "Many Trade Federation bases across the galaxy used power core structures to supply power to other nearby buildings, and were built by OX9 labor droids. The central energy cores of the power cores were generally greenish-yellow. Probably the most infamous example of a Trade Federation power core was the one built on the moon of Alaris Prime with the intention of powering other buildings. It was later abandoned after it was attacked by gundarks. The power core was later destroyed by the Wookiees Chewbacca and Shoran when they found it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}