{"url": "Praetor_Mark_II-class_battlecruiser", "categories": ["Category:Legends articles", "Category:Battlecruiser classes", "Category:Galactic Empire starship classes", "Category:Praetor Mark II-class battlecruisers"], "nodes": [{"tag": "h1", "text": "Praetor Mark II-class battlecruiser"}, {"tag": "p", "text": "The Praetor Mark II-class battlecruiser, also known as the Praetor II-class Star Battlecruiser, was a warship class that served in the Imperial Navy. It was a model in the Star Destroyer design family, marked by a characteristic wedge-shape."}, {"tag": "h2", "text": "Details"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "Considered the largest battlecruiser design known, the Praetor Mark II possessed a dagger shape, similar to other prominent warships in the Imperial Navy and was part of the KDY Star Destroyer design family. Like the Bellator-class dreadnought and the Assertor-class Star Dreadnought, the Praetor Mark II-class battlecruiser was designed with a central \"ridge\" structure that went from the stern of the ship midway to the bow. The ridge on the Praetor Mark II also extended behind the stern, beyond the main thrusters. The Praetor Mark II's size ranged from 4,800 meters to approximately 8,000 meters (that being the equivalent of five Imperial II-class Star Destroyers). The latter length estimate technically made it a Star Dreadnought under the Anaxes War College System, although it's relatively light in armament compared to standard Star Dreadnoughts had it designated as a Battlecruiser."}, {"tag": "h3", "text": "Propulsion systems"}, {"tag": "p", "text": "The Praetor Mark II had three primary engines and four secondary engines, two of which were located on the outer areas of the ventral portion of the ship, with the other two placed directly behind the ridge extension on the stern. The Praetor Mark II, like the Executor-class Star Dreadnought, lacked a visible ventral reactor bulb, hiding its reactor equipment within thick layers of armor."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "The Praetor Mark II battlecruiser possessed at least 90 weapons systems, including various spherical turrets on the dorsal, ventral and trench areas of the ship, In addition, it also possessed hull armor and deflector shields thick enough as well as strong enough to repel conventional blaster bolts."}, {"tag": "h3", "text": "Complement"}, {"tag": "p", "text": "The Praetor Mark II possessed a triangular-shaped docking bay area at the prow, which appeared to be only slightly larger than the main docking bay of an Imperial-class Star Destroyer. The ship class also possessed rings near the very end of the ship, behind the bridge. The transport ring could store supplies, equipment and even live specimens, like the Teezl creature. It carried a crew of 109,000, including officers and enlisted crew. The Praetor Mark II could also carry 120 starfighters and any number of shuttles, barges, and walkers."}, {"tag": "h3", "text": "Bridge tower"}, {"tag": "p", "text": "Similar to the later Vengeance-class dreadnought, the Praetor Mark II lacked a T-shaped KDY-style bridge tower. Instead, the command bridge was located at the front end of the elevated ridge of the ship. Similar in appearance to the bridge tower of the Clone Wars-era Venator-class Star Destroyer and Acclamator-class assault ship, and later Secutor-class Star Destroyer, the bridge was kept closer to the surrounding superstructure, providing a smaller target profile than those designs.\nThe internal bridge section was significantly larger in volume than that of a typical Star Destroyer bridge, and was large enough to allow many fleet officers to hold meetings in the room."}, {"tag": "p", "text": "The dorsal ridge houses the crew areas, and the rest of the ship is given over to machinery, control systems, and engineering spaces."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Production history"}, {"tag": "p", "text": "The Praetor Mark II was designed and produced early on in the reign of the Galactic Empire as a follow-up to the smaller Republic-era Praetor-class Star Battlecruiser. Few ships of this class were commissioned, as Imperial strategies didn't favor battlecruiser designs. Battlecruisers were regarded as less effective terror weapons than the more massive dreadnaughts. Combined with being more expensive than individual Star Destroyers and less versatile, production on the Praetor Mark II was stopped."}, {"tag": "h3", "text": "Service record"}, {"tag": "p", "text": "As a result of the Empire's focus, the Mark IIs, along with other battlecruiser designs, were primarily used by the Empire to defend key areas in the Core region. Some battlecruisers were also used for particularly dangerous missions on the fringes of Imperial space, although they rarely left their docks except in cases of large engagements."}, {"tag": "p", "text": "A notable example of the latter was the Helmsman, captained by Admiral Mils Giel. The Helmsman was assigned to lead a secret armada on a mission to bring a Teezl to Coruscant from the Valtha Divide. The Teezl, a living hyperspace communications device, was to be installed as a communications tool for the Navy, allowing better coordination against Rebels. The Helmsman carried the creature aboard its transportation ring."}, {"tag": "p", "text": "The secret armada was attacked en route and the Teezl was killed by Rebels. The Praetor Mark IIs heavy armor and shields required the Rebel Flying Bantha Squadron to modify their stolen TIE fighters for the mission, in order to be able to penetrate the layers of defense on the Helmsman and hit the transportation cage. The vessel was damaged, but survived the assault, its gun batteries immediately attempted to retaliate, but the assailant TIE fighter escaped."}, {"tag": "p", "text": "A Praetor Mark II was assigned to a fleet exercise with several other Super Star Destroyers at some point after the Arms Race campaign. During the exercise, an Assertor-class dreadnought and an Allegiance-class battlecruiser were simultaneously refueled by a massive replenishment ship."}, {"tag": "h3", "text": "Post-Endor"}, {"tag": "p", "text": "The Thalassa was a Praetor Mark II that belonged to the forces of Admiral Sander Delvardus. Delvardus led the Eriadu Authority, which broke away from the main Galactic Empire after the Battle of Endor."}, {"tag": "p", "text": "During the New Republic's push against the Imperial warlords, a task force of EF76 Nebulon-B escort frigates together with BTL Y-wing starfighters fought the Thalassa in 4 ABY; it was confronted and destroyed by the task force in the Moorja system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Praetor Mark II-class battlecruiser was based on concept artwork made by Ralph McQuarrie during pre-production for Star Wars: Episode V The Empire Strikes Back. This concept was one of several meant for the Super Star Destroyer Executor. The artwork was later recycled to depict Admiral Giel's flagship in the secret armada in the Marvel Star Wars comics."}, {"tag": "p", "text": "Neither its ship class nor Giel's flagship were given a proper name in the comic itself, and were sometimes referred to by fans as Super Star Destroyers due to its wedge-shape and overall larger size than a Star Destroyer."}, {"tag": "p", "text": "It wasn't until the release of The Essential Guide to Warfare in 2012 that the ship class, as well as Giel's flagship, were given names. 3D fan artist Ansel Hsiao also created artwork of the ship specifically for the book."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}