{"url": "Praesitlyn", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Praesitlyn locations", "Category:Rimma Trade Route", "Category:Sluis sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Praesitlyn"}, {"tag": "p", "text": "Praesitlyn was a planet in the Sluis sector of the Outer Rim. It was the location of the Intergalactic Communications Center, a major HoloNet hub in the galaxy. The Communications Center became a strategic asset during the Clone Wars, leading to the fierce Battle of Praesitlyn."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Praesitlyn was located along the Rimma Trade Route, in the Sluis sector of the Outer Rim Territories. It was localized within 60 light-year of Bpfassh. The forested planet was home of the Intergalactic Communications Center, which acted as a key HoloNet relay for the Galactic Republic, Galactic Empire, and New Republic. The center was located 150 kilometers from the center of a major continent. The planet was buffeted by sudden dust storms."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The Praesitlyn system seceded with the entire Sluis sector from the Republic to join the Confederacy of Independent Systems during the Separatist Crisis. However, the Intergalactic Communications Center remained under Republic control. A few time later, agents of Eriadu Customs and Immigration apprehended the freighter Tandleroff's Trove while it was passing through Phelar Port on Eriadu. They found 144 hailfire droids destined to Praesitlyn."}, {"tag": "p", "text": "At some point during the Clone Wars, the Republic recaptured Praesitlyn. As the planet had few defenses, the Republic considered to dispatch reinforcements from the nearby Sluis Van Shipyards. Nevertheless, the Separatists responded by a major offensive against Praesitlyn, combined with the blockade of Sluis Van. Due to the intense fightings at Praesitlyn and the neighboring systems during the war, one of the main theaters of the Outer Rim Sieges was named after the planet."}, {"tag": "p", "text": "During the Separatist attempt to conquer the planet and the communications center, a fleet of 200 starships and a ground force of 50,000 battle droids under the commander of Admiral Pors Tonith invaded the system. They were opposed by the Praesitlyn Defense Force, the Sons and Daughters of Freedom mercenary group led by Zozridor Slayke, and clone trooper reinforcements led by Jedi Anakin Skywalker, Obi-Wan Kenobi, and Nejaa Halcyon. In several weeks of fighting, the Separatists were expelled in the Battle of Praesitlyn, leading to Anakin Skywalker's elevation to Jedi Knight."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "The Intergalactic Communications Center remained in use during the New Republic era. By the time of the Black Fleet Crisis, Praesitlyn was represented in the New Republic Senate by Senator Zilar."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places the Sluis sector and, consequently, Praesitlyn, in the Core Worlds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}