{"url": "Praster_Ommlen", "categories": ["Category:Canon articles", "Category:Males", "Category:Ottegans", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Praster Ommlen"}, {"tag": "p", "text": "Praster Ommlen was a male Ottegan gunrunner who gave up crime and joined the Sacred Order of Ramulus sect of worship. Around thirty years after the Battle of Endor, he spent time in the castle of the pirate Maz Kanata, offering spiritual advice to the other criminals there. He was present at the castle when the smuggler Han Solo arrived, and soon after witnessed the destruction of the Hosnian system by the First Order's Starkiller Base."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "An Ottegan from Ottega, Praster Ommlen worked as a gunrunner before putting his life of crime behind him and becoming a devotee of the Sacred Order of Ramulus, an Ithorian sect of worship. Around thirty years after the Battle of Endor, Ommlen spent time in the castle of the pirate Maz Kanata, where he offered spiritual advice to other criminals. While there he connected with the Narquois bandit Pru Sweevant and the Bravaisian gemologists Munduri and Sonsigo."}, {"tag": "p", "text": "He was present in the castle for the arrival of the smuggler Han Solo, who was accompanied by the scavenger Rey, the former stormtrooper Finn and the astromech droid BB-8. As Solo entered, Varmik (one of the Hassk triplets) approached Ommlen, who then moved to watch a game of Droid ball fighting being played. The game was interrupted when Kanata herself spotted Solo and yelled to him across the room, causing Ommlen and the room's other occupants to all fall silent and turn to look at the subject of Kanata's cry."}, {"tag": "p", "text": "He was amongst the crowd of patrons that rushed out of the castle to watch the destruction of the Hosnian system by the First Order's Starkiller Base superweapon. Shortly after the terrifying spectacle ended, the castle itself was attacked and destroyed by the First Order."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "While at Maz Kanata's castle, Ommlen wore faded brown ascetic robes, which offered him little comfort. He had brown skin, black eyes and gray hair."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Praster Ommlen was created for the 2015 film Star Wars: Episode VII The Force Awakens, but was first revealed to the public seven months before the films release in an exclusive article on the website of Vanity Fair in May 2015, Ommlen was not identified in the article or film, but was then named in the reference book Star Wars: The Force Awakens: The Visual Dictionary, which was written by Pablo Hidalgo and released in conjunction with the film. He was portrayed by Mason Ball in the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}