{"url": "Prauf", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Abednedo", "Category:Engineers", "Category:Males", "Category:Scrapper Guild employees"], "nodes": [{"tag": "h1", "text": "Prauf"}, {"tag": "p", "text": "Prauf was an Abednedo male who worked for the Scrapper Guild on Bracca, alongside Cal Kestis. Prauf was the only real friend that Kestis had on Bracca."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Prauf worked as an engineer on Bracca, even before the Clone Wars. He was a member of the Scrapper Guild, at a time when they refit and rebuilt broken-down ships."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "During the Clone Wars, some Scrapper Guild members aided the Separatists, almost leading them to victory over the planet. In retaliation, the newly formed Galactic Empire cut wages and lowered safety standards. Prauf continued to work under the Empire, but he noticed that most of his fellow engineers were turned into scrappers."}, {"tag": "p", "text": "Sometime before 14 BBY. he befriended Cal Kestis, a Jedi Padawan in hiding. Prauf, who was unaware of his friend's true nature, helped Kestis get jobs through the Scrapper Guild, and both were supervised by a foreman droid. Prauf mainly operated heavy duty cutters and welders, using them to dismantle derelict starships. He also believed that Kestis deserved better, as he wanted him to explore the galaxy and find his destiny, moving away from Bracca and the life of a scrapper."}, {"tag": "h4", "text": "Death"}, {"tag": "p", "text": "In 14 BBY. while dismantling the hull of a Venator-class Star Destroyer with Kestis, Prauf fell and was almost eaten by a Ibdis Maw. Kestis used the Force to lift Prauf, saving him from certain death. Prauf promised Kestis that he would keep his force powers a secret and then suggested he leave Bracca. However, an Imperial Probe Droid observed this event. The Second Sister, along with the Ninth Sister, were dispatched to Bracca with a squadron of Purge Troopers. To distract them, Prauf ranted about what the Empire had done to Bracca and the Scrapper Guild. The Second Sister agreed, before impaling him with her lightsaber."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Prauf's death led Kestis to retaliate against the Inquisitors and eventually escape Bracca, fulfilling Prauf's wishes for him to leave the planet. Kestis would later tell the Nightsister Merrin about how an “old friend” told him to find his place in the galaxy and fulfill his destiny."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Prauf was an Abednedo male with light brown skin. He remembered when the shipyards of Bracca focused on rebuilding ships instead of breaking them down. He always watched out for Cal Kestis and knew enough to not ask questions about Kestis' past."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Prauf was introduced in the 2019 video game Star Wars Jedi: Fallen Order. He is played by JB Blanc. Concept art for Prauf was done by Jose Daniel Cabrera Peña."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}