{"url": "Prakith/Legends", "categories": ["Category:Legends articles", "Category:Fortress worlds", "Category:Prakith locations", "Category:Sector 5 planets", "Category:Type I atmosphere planets", "Category:Volcanic planets"], "nodes": [{"tag": "h1", "text": "Prakith"}, {"tag": "p", "text": "Prakith was a mountainous fortress world located in the Prakith system of the Deep Core that, thanks to its unstable terrain and its isolation, was a difficult location to conquer by force. The planet was a powerful Sector 5 fortress world during the Galactic Civil War and later the personal empire of Moff Foga Brill."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Early in the planet's history, Prakith was a volatile, volcanic world, but was stable enough for Imperial survey teams to explore it during their expeditions into the Deep Core. Prakith's close proximity to the Galactic Core made it a prime location for a hidden redoubt, and was one of the first Deep Core worlds to be civilized. It had a strong Mining Guild presence."}, {"tag": "p", "text": "Prakith's major cities (such as Prak City) were built atop the planet's large plateaus, surrounded on all sides by great caverns and crevasses. Since ground travel across such terrain proved difficult, natives often used cloud cars and airspeeders for transportation. The natives were, under Imperial rule, a relatively subdued and businesslike population."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "During the time of the ancient Sith Empire, the Sith Lord Darth Andeddu built a tomb for himself on the planet, hidden inside his keep, after escaping his enemies by building a false one on Korriban. There, his mummified body lay for thousands of years."}, {"tag": "p", "text": "Millennia later, Darth Bane visited the planet following the end of the New Sith Wars in order to obtain Darth Andeddu's holocron."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "The Emperor himself selected Prakith as the base of operations for the Inquisitorius following the end of the Clone Wars."}, {"tag": "p", "text": "Circa 17 BBY, Jedi Master Denia was captured by her former Padawan, Imperial Inquisitor Valin Draco. She was held deep within the Citadel Inquisitorius on Prakith and tortured. Her allies in the Alderaanian Resistance later tried to rescue her by attacking the Citadel, but she sacrificed herself during the battle to allow the Rebels to escape."}, {"tag": "p", "text": "The Imperials on Prakith voted to continue the war against the New Republic even after the death of Palpatine, and supported the reborn Emperor during his attempt to retake the galaxy. With the destruction of Byss, the Prakith system became an independent Imperial territory led by warlord Moff Foga Brill, the Constitutional Protectorate of Prakith, who was only nominally under the authority of Grand Moff Gann. The planet was impoverished, living conditions miserable. Brill fortified Prakith and isolated his micro-empire, defended by a strong planetary defense fleet. The planet was later involved in many years of attritional warfare with the New Republic."}, {"tag": "p", "text": "Foga Brill's ships Bloodprice and Gorath were destroyed in the Prakith system by the Teljkon Vagabond in 17 ABY."}, {"tag": "p", "text": "In 18 ABY, Foga Brill was betrayed by a cabal of his officers, who killed him and attempted to broker peace with the New Republic. The Prakith system was then integrated into the New Republic and reconnected with the rest of the galaxy."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "At some point before 37 ABY, a group of dark side cultists found Andeddu's Keep and isolated themselves there for generations, drawing upon its powers. By 137 ABY, the world was still inhabited, with the keep still being located far from the nearest city, hidden amongst inaccessible terrain."}, {"tag": "p", "text": "Darth Wyyrlok the Third ventured to the planet in an attempt to find a cure for his master's illness. He was tricked by the holocron of Andeddu, which secretly contained his intellect, and was first ambushed by the cult, then the reanimated Sith Lord himself. After having bested the Sith and buried his remains, Wyyrlok took several of his texts and left the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}