{"url": "Predator-class_fighter", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Sienar Fleet Systems products", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "Predator-class fighter"}, {"tag": "p", "text": "The Predator-class fighter, also called the TIE Predator and nicknamed Eyeballs by the Galactic Alliance, was a starfighter produced by Sienar Fleet Systems and used by the New Galactic Empire as of 130 ABY."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Considered a successor to the older TIE/IN interceptor used by the Galactic Empire more than a century prior, the TIE Predator was still highly maneuverable and heavily armed, but unlike most previous TIEs, it was also equipped with hyperdrives and a deflector shield generated through its blade-shaped wings. As with the earlier Chiss Clawcraft, these wings could adjust to a variety of positions, aiding the starfighter's maneuverability. They folded back fully for docking mode. However, the complex technologies packed inside the wings of the Predator were a maintenance nightmare. In addition, the standard redesigned viewport offered poor visibility due to its narrow horizontal panes separated by thick struts."}, {"tag": "p", "text": "After much lobbying, the Imperial Navy convinced Sienar to produce Predator-class fighters with classic TIE-style cockpits that were flown by squadron leaders. Other pilots flew fighters with horizontal slats across the front of the central fuselage."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Predator-class fighters served as the primary fighter craft for the Fel Empire during the Sith–Imperial War. After the war's end they continued to stay in use throughout the Second Imperial Civil War in service to both the Empire-in-exile and Krayt's Sith Empire until the Sith-Imperial starfighter came into service in the latter to supplant them."}, {"tag": "p", "text": "In 130 ABY, Predator-class fighters were used by Moff Rulf Yage's forces in the attack on the Jedi Praxeum on Ossus. When a Jedi transport attempted to flee, they moved to shoot it down but were intercepted by Cade Skywalker's in a X-83 TwinTail starfighter, who managed to defeat several TIE Predators before being shot down, buying time for the Jedi transport to escape."}, {"tag": "p", "text": "Imperial Knights would commonly fly Predator-class fighters. In 137 ABY, Antares Draco and Ganner Krieg would take two of those fighters to Vendaxa to save Princess Marasiah Fel from the Sith."}, {"tag": "p", "text": "The Outer Rim Third Fleet used these fighters at the Battle of Dac."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Predator-class fighter was designed by Sean Cooke, a designer/illustrator handpicked by Dark Horse Comics editor Randy Stradley for the job of designing Legacy-era Imperial spacecraft."}, {"tag": "p", "text": "When the first images of the Predator appeared, some fans speculated that the fighters with a \"slatted\" central pod were pilotless droid starfighters, but this idea was ruled out by subsequent comments from the creators: in an online chat, Jan Duursema explained that the traditional cockpits were reserved for lead fighters, and in an interview for Star Wars Insider 89, Cooke discussed the redesign: \"I wanted to make sure it didn't look so much like the classic TIE fighter, so I redesigned the front cockpit screen, taking that kind of octagonal design and putting more vertical lines through that to simulate jaws or even prison bar cells, giving it this angry look.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}