{"url": "Pre_Vizsla/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Clan Vizsla", "Category:Death Watch members", "Category:Galactic Republic governors", "Category:Humans", "Category:Males", "Category:Mandalores", "Category:Separatist military members", "Category:Shadow Collective members", "Category:Terrorists"], "nodes": [{"tag": "h1", "text": "Pre Vizsla"}, {"tag": "p", "text": "Pre Vizsla (pronounced /'pri vizlɑ/) was a male Human from the planet Mandalore and was the leader of the Mandalorian Death Watch faction during the Clone Wars. Seeking to overthrow Duchess Satine Kryze and her pacifistic New Mandalorian government, in order to restore Mandalore to its widespread warrior ways, Vizsla secretly allied himself with Count Dooku and his Confederacy of Independent Systems. While governing Mandalore's moon, Concordia, and maintaining loyalty to Kryze in public, Vizsla led the Death Watch in secret from several Concordian mining camp bases. The Death Watch's terrorist attacks on Mandalore came to a head when Jedi Master Obi-Wan Kenobi arrived on Concordia with Kryze to follow leads on the Death Watch. When Kenobi discovered the Death Watch's secret base, Vizsla confronted them with several warriors and revealed himself as the renegades' leader. After engaging Kenobi in a short duel, Vizsla forced him and Kryze to flee Concordia."}, {"tag": "p", "text": "Vizsla conspired with Mandalorian Senator Tal Merrik to capture Kryze during her journey to Coruscant, where she intended to plead her case directly to the Galactic Senate, but Merrik was defeated before he could complete his assignment. Amassing an army of Death Watch troops on Concordia in preparation to take over Mandalore, Vizsla was forced to wait until his and Dooku's plot to turn Mandalore against the Republic was completed. Vizsla dispatched a Death Watch assassin to Coruscant to kill Kryze, as her death would remove the opposition to the Senate's upcoming vote to have Republic troops occupy Mandalore—an occupation which would allow the Death Watch to gain the support of Mandalore populace and \"liberate\" them from the Republic. However, the assassin failed to murder Kryze, and the plot itself fell through, with the Senate voting against occupying Mandalore. With this turn of events, Vizsla was forced to postpone his attack on Mandalore, as his forces would be unable to hold the planet without its people's support."}, {"tag": "p", "text": "At some point, Vizsla and his soldiers came across an escape pod lost in deep space which held the stranded Sith Lords Darth Maul and his brother Savage Opress. Harboring a common hatred of Obi-Wan Kenobi for his actions against them, they planned on having their revenge after their planned conquest of Mandalore. Gathering an army of criminals including the Hutts, the Pykes, and the Black Sun, Vizsla and Maul attacked Sundari, allowing Death Watch to act as heroes to a desperate population after the Duchess's forces failed to stop the criminals. With the support of the Mandalorian people, Vizsla ousted Satine and appointed himself Prime Minister and claimed the ancient title of Mand'alor. He also betrayed his Sith allies who were imprisoned but who managed to escape. Maul challenged Vizsla to a duel to determine the true ruler of the Mandalorians. After a long and difficult duel, Maul defeated Vizsla and executed him for his failures, before claiming his position as leader of the Death Watch."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Leader of the Death Watch"}, {"tag": "p", "text": "The male Human Pre Vizsla was a Mandalorian from the planet Mandalore, who lived during the Clone Wars. By around 22 BBY, Vizsla had become the leader of the Death Watch splinter group in opposition to the pacifist Duchess Satine Kryze and her peaceful New Mandalorian organization's political dominance on Mandalore, a government that Vizsla believed dishonored the Mandalorians' generations-old warrior traditions. While secretly leading the Death Watch, Vizsla publicly supported Kryze, seemingly renouncing his clan connections, and became one of her trusted allies. Rising to the position of governor of Mandalore's moon, Concordia—a separate province that operated independently of the New Mandalorians' government—Vizsla transformed several abandoned mining camps into secret staging areas."}, {"tag": "p", "text": "Vizsla eventually came into the possession of the Darksaber, a black-bladed lightsaber that his ancestors had stolen from the Jedi Temple during the fall of the Old Republic. Many Jedi subsequently died to its blade. Vizsla desired to reignite the feud between the Jedi and the Mandalorians, as the two factions had previously been enemies. In order to overthrow Duchess Kryze and her New Mandalorians, Vizsla sought the allegiance of Count Dooku and his Confederacy of Independent Systems, which promised their support to Vizsla in his fight to undermine Kryze's rule and take over Mandalore. The Death Watch began to engage in acts of terrorism on Mandalore in the New Mandalorian capital city, Sundari, and on the neighboring world of Kalevala to undermine Kryze's rule and breed discord among the people. Vizsla himself maintained Kryze's trust by appearing to spearhead the search for the Death Watch so that the warriors could be captured."}, {"tag": "h3", "text": "Campaign for Mandalore"}, {"tag": "h4", "text": "Allegiances revealed"}, {"tag": "p", "text": "When a Mandalorian saboteur attacked a Republic cruiser, word spread to the Galactic Senate that Kryze was secretly building her own army to fight for the Confederacy and Mandalore became host to Jedi Master Obi-Wan Kenobi, who had been sent by the Jedi High Council to investigate the rumors of treason. Learning of Kenobi's presence on Mandalore, Vizsla holographically contacted Count Dooku from the Death Watch's secret Concordian military camp, perturbed by Kenobi's presence. Vizsla initially could not understand Dooku's apparent unconcern with the Jedi Master's arrival, reminding Dooku of his promise to help overthrow Kryze and her government and stating that if the Republic intervened now, the Death Watch would be unable to take over Mandalore. Dooku himself advised patience, proclaiming that the Republic's continued involvement in Mandalorian affairs, combined with the Senate's impending order to send troops to keep the peace on Mandalore, would spread discontent amongst the Mandalore populace, causing them to rebel. Vizsla then realized Dooku's plan was to set up Death Watch's role as the people's liberator, and strengthen the renegade faction's insurgency."}, {"tag": "p", "text": "Eventually, Governor Vizsla and several of his guards greeted Kenobi and Kryze in the hangar of a Concordian governmental complex when the two came to Concordia in a Mandalorian shuttle to deliver the dead body of the instigator behind a Death Watch bombing of Sundari's memorial shrine. After being introduced to Kenobi, Vizsla attempted to refute the rumors of Kryze's alliance with the Separatists, to which Kenobi replied that his only instructions were to \"seek the truth.\" Vizsla then took possession of the bomber's remains, who himself had chosen to die instead of being captured, and left with his men to attend to it. Later, while Vizsla was writing a condolence letter to the man's family on his datapad in his residence on Concordia and making arrangements for the body to be retrieved, he was joined by Kryze, who stated that Kenobi would be present shortly, as he needed to meditate. Over refreshments, Kryze shared her concerns that someone was feeding misinformation to the Republic that the Death Watch was taking over Mandalore and suspected that an external force was assisting the Mandalorian renegades. Vizsla himself speculated that the party would have to be very influential in the Separatist Alliance and mused that Kryze herself was being targeted for her role as leader of the Council of Neutral Systems, which directly conflicted with the Separatists' conquest of the galaxy."}, {"tag": "p", "text": "As time passed, Vizsla noticed that General Kenobi's meditation was taking longer than he had expected and suggested that they should begin dinner without him, but Kryze—who had, in fact, been secretly contacted by Kenobi, whose investigations had led him to be captured by the Death Watch—excused herself from the governor's company. Kryze stated that she needed some fresh air and politely refused Vizsla's offer to escort her outside. Again assuming his position as the Death Watch's leader, Vizsla arrived in full Mandalorian armor at the mining base where Kenobi was being held. When Kenobi—having been rescued by the Duchess—and Kryze emerged from a mining shaft close to the camp where Vizsla and his men were waiting, the Death Watch immediately opened fire on the pair. Vizsla ordered three more of his men forward to stop Kenobi, and the trio activated their JT-12 jetpacks, flying toward the Jedi Master's position and focusing their fire on him. However, they were unable to complete their task and were stopped before they could cause the enemy pair any harm. Resolving to take care of the matter personally, Vizsla ordered the rest of his troops to evacuate Concordia. Once three of the Death Watch's Kom'rk-class transports had departed, Vizsla and several of his men advanced toward the outcrop where Kenobi and Kryze had taken refuge."}, {"tag": "p", "text": "As he approached, Vizsla shot one of his men that had been unable to stop Kenobi, disgusted by his subordinate's failure. Kenobi emerged from cover and Vizsla continued forward without his guards, removing his helmet and revealing his identity as the Death Watch's leader. Ignoring Kryze's shock at learning of her ally's betrayal, Vizsla addressed Kenobi, proclaiming that Kryze tarnished the very name Mandalorian with her peace-seeking government. Returning Kenobi's lightsaber, which his men had confiscated earlier during the Jedi's capture, Vizsla drew and activated the Darksaber. A lightsaber duel erupted, with both parties slashing at the other and dodging and blocking his opponent's attacks. Vizsla was twice forced back by Kenobi, first by a Force-push that hurled him backward several meters, then again by a kick that sent his weapon flying. Undeterred, Vizsla continued at Kenobi, using unarmed combat techniques to create a temporary gap in the fighting to retrieve his fallen lightsaber."}, {"tag": "p", "text": "This time, Vizsla used his jetpack to employ greater altitude as an advantage in the fight, but Kenobi simply jumped up and intercepted him in the air, battering him back down to the ground, where his jetpack and lightsaber deactivated. Getting back on his feet, Vizsla chose not to pursue Kenobi again and instead ordered his warriors to finish the Jedi Master themselves. The three Death Watch members each launched a missile from their rocket packs, and Kenobi and Kryze were forced to retreat, jumping back down into the mine shaft to avoid the explosives. The three warriors inspected the damage and inquired if they should pursue Kenobi; Vizsla ordered them not to, as there was no time, but noted that they would catch up with the Duchess soon enough."}, {"tag": "p", "text": "After escaping Concordia, Kenobi and Kryze returned to Mandalore, from where they then departed for the Republic capital of Coruscant under Republic escort aboard Kryze's starship, the Coronet, so that Kryze could plead her case directly to the Galactic Senate. Vizsla schemed with Mandalorian Senator Tal Merrik, a Death Watch agent and one of the Coronet's passengers, to capture Kryze. Merrik eventually reported his success in taking Kryze hostage to Vizsla and requested reinforcements so that he could transport her away. Pleased with Merrik's exploits, Vizsla replied that additional forces had been dispatched to cover his escape. In the ensuing battle aboard the Coronet, however, Merrik was killed, stabbed in the back by Anakin Skywalker, one of Kryze's Jedi escorts. Kryze was able to safely reach Coruscant, leaving the Death Watch with another failed attempt on her life."}, {"tag": "h4", "text": "Preparations for battle"}, {"tag": "p", "text": "Following the unsuccessful attacks on Kryze, Vizsla mobilized a Death Watch army at the Concordian base in preparation to take over Mandalore. The force was mainly comprised of Death Watch warriors but was also backed up by a number of Separatist Armored Assault Tanks. With his army in place, Vizsla used a comm station to contact Dooku, who was elsewhere in space with a Separatist fleet. Vizsla was impatient, as both he and his men were anxious to fight, but Dooku recalled the plot that they had set into motion of manipulating the Republic Senate into ordering an occupation of Mandalore—which would subsequently cause Death Watch to appear as \"liberators\" when they struck back at the Republic occupation force and would thus gain Death Watch the people's support. Dooku ordered Vizsla to send a Death Watch assassin to Coruscant, as Kryze had to die if the Senate vote was to move forward and their plan was to succeed."}, {"tag": "p", "text": "After failing twice to kill Kryze, the assassin reported to Vizsla that he had killed an informant that appeared to have handed something off to her. Vizsla reiterated the need to find her, emphasizing that whatever Kryze was carrying might compromise the plan. Eventually, however, word reached Vizsla and his Death Watch army that the assassin had failed to kill Kryze and that the Senate had voted against sending an occupational force to Mandalore, nullifying the Death Watch's opportunity to gain the Mandalore populace's support during the invasion. Livid about having to postpone his attack, Vizsla angrily strode through his men—who had been ordered to stand down and were rushing around the base—to a comm station and contacted Dooku. Seething, Vizsla used the Count as a target for his frustration and stated his intention to continue with the invasion. Dooku advised against such a rash action—despite the Death Watch's capability of conquering Mandalore, they would only be able to hold the planet for no more than a day if they did not have the people's support. Dooku cited Vizsla's inexperience in battle, attributing it to his rashness, and stated that he had other ways of accomplishing their goal."}, {"tag": "h3", "text": "Plot against Dooku"}, {"tag": "p", "text": "Following Vizsla's aborted conquest of Mandalore, the Death Watch leader eventually met with Dooku in person. Vizsla managed to rile Dooku to the point of where the Sith Lord released his lightsaber and slashed Vizsla across his left cheek, leaving a prominent scar across his face. Furious, Vizsla broke ties with Dooku and the Separatists and vowed to kill the Count. On the run, the Death Watch found refuge on the planet Carlac, holding the local Ming Po hostage while pillaging their villages for women and supplies."}, {"tag": "p", "text": "Vizsla found alliance with Lux Bonteri, a young Separatist from Onderon who also held a personal vendetta against Dooku for killing his mother, Mina. Vizsla sent Bonteri to Mandalore, where peace talks between the Republic and Confederacy were being hosted by Duchess Satine. By openly accusing the Count of treachery during the peace summit, he was able to provoke the Count into confronting him via hologram; this allowed Bonteri to use a holotrace device, revealing the Sith's whereabouts. Bonteri rendevouzed with the Death Watch on Carlac, where he was to present Vizsla the Count's coordinates."}, {"tag": "p", "text": "To Vizsla's surprise, however, Bonteri brought the Jedi Ahsoka Tano, who was masquerading as Bonteri's betrothed, and her droid R2-D2. Vizsla was initially fooled by Tano's illusion, and welcomed her into the Death Watch ranks. At a feast later that night, Vizsla was approached by several members of the Ming Po, who demanded Death Watch to release the native women who were keeping as servants and then leave the planet. Vizsla appeared to comply to the cheiftant's demands, swearing to leave the planet by morning. In reality, Vizsla was planning the slaughter of the natives; when he arrived at the Ming Po village to present the captured women, he ordered his men to burn the village and the people in it, much to Bonteri's horror."}, {"tag": "p", "text": "Tano revealed herself as a Jedi, taking out several Death Watch members before being subdued. Upon return to the Death Watch camp, Vizsla expressed his disappointment in Bonteri for bringing a Jedi. Despite Bonteri's pleas to spare her, Vizsla was adamant to execute her. Bonteri accused Vizsla of murderous dishonor; Vizsla then retorted to the young boy that he was no different, having a blood lust against Dooku. Bonteri insisted that he wanted justice, not revenge, yet Vizsla would not have it. Vizsla then stated that like Bonteri wanting justice for his mother's death, Vizsla would execute Ahsoka for the Jedi Order's crimes against Mandalore, which in Vizsla's eyes, was justice as well. Before Vizsla could execute Ahsoka, R2-D2 entered the hut, creating a diversion and arming Tano with her lightsabers. After freeing herself by jumping and decapitating four Death Watch warriors, Vizsla dueled her for a time; but after the Jedi's saber caused Vizsla's jetpack to explode, she and Bonteri escaped."}, {"tag": "h3", "text": "Skirmish on Carlac"}, {"tag": "p", "text": "Sometime after Tano's and Bonteri's escape, the Republic followed a Munificent-class star frigate to Carlac. They shot it down and went to the surface to finish off the surviving droids. They encountered Death Watch resistance, including three camps. The Republic set up a outpost from where they could counter the Death Watch, and so the Skirmish on Carlac began. A Jedi Knight joined the battle, destroying the three camps, killing Sergeant Kellov and infiltrating a village that the Death Watch held captive, threatening to destroy it if the Republic did not recall it's forces from the world. The Jedi Knight infiltrated the village, however they were detected and the Death Watch started to burn it. The Republic dispatched a LAAT/i to douse the fires, although it raged on. The Jedi Knight defeated Kherr Dawar, Kro Lann, Mord Jayran and Vizsla himself, although he escaped."}, {"tag": "h3", "text": "An unstable alliance"}, {"tag": "p", "text": "Following the events on Carlac, Vizsla and the Death Watch established a camp on the swamp moon Zanbar, and once again set about plotting the downfall of Duchess Satine, and the restoration of the Mandalorian's warrior creed."}, {"tag": "p", "text": "During an expedition through space the Death Watch happened across the escape pod of fugitives Maul and Savage: a pair of Zabrak siblings, who had laid claim to the titles of Dark Lords of the Sith, and who were critically wounded following their previous defeat at the hands of Obi-Wan Kenobi. Despite Bo-Katan's suggestion of executing the brothers, Vizsla spared them, realizing that they shared a common enemy in the Jedi, and seeing potential for an alliance."}, {"tag": "p", "text": "Vizsla had the brothers transported to the Death Watch's encampment on Zanbar, where Maul was outfitted with new cybernetic legs to replace the crude, makeshift prosthesis crafted for him by Mother Talzin, and Savage provided with an artificial substitute for the arm severed by Obi-Wan Kenobi's blade. Maul and Vizsla found a common enemy in Obi-Wan Kenobi, and formed an unstable alliance."}, {"tag": "p", "text": "After the creation of their alliance, Vizsla insisted that they attack Mandalore, stating that he had men standing by on Mandalore, waiting for their orders. However, Maul stated that the Death Watch warriors were not yet ready to takeover Mandalore. As an alternative, Maul suggested enlisting the help of the Black Sun who were located at Mustafar to begin creating an army. Vizsla, in addition to the members of Death Watch, would travel to the planet. When they met with the leaders of the Black Sun, Vizsla and the two brothers were mocked by the leaders, stating that they were not mercenaries for hire. However when Opress killed the leaders of the Black Sun, Ziton Moj decided to join Maul."}, {"tag": "p", "text": "After the submission of the Black Sun, Vizsla stated that they had gained the supplies that they needed for their cause. However, Maul and Vizsla would argue over the vision of taking over Mandalore, each stating that there was only one vision in gaining their success, each vision being their own. Angered that Maul was still building his army, Vizsla quietly submitted to Maul's orders, though he began plotting to put matters into his own hands. Shortly after returning to Zanbar, the Pyke Syndicate, led by Lom Pyke, were willing to join them and help overthrow the Duchess."}, {"tag": "p", "text": "After the Pykes joined Darth Maul's Shadow Collective, they headed towards Nal Hutta to enlist the help of the Hutt Grand Council. After negotiations have failed, bounty hunters pursued the brothers and Vizsla outside where Bo-Katan and her Nite Owls were awaiting the return of them. While Bo and her warriors fought on the Hutt guards, Maul, Vizsla and Savage faced off Sugi and Embo. After the fight had ended, the bounty hunters managed to flee to safety, but the Death Watch warriors were then able to capture Oruba. After stating that Jabba had fled to his palace on Tatooine, Maul ordered Opress to execute him; Oruba died instantly."}, {"tag": "p", "text": "Shortly after learning that the Hutts have fled to Jabba's Palace on Tatooine, the Brothers and Death Watch launched a small attack to give Jabba a last chance to join them. After briefly seeing what the Shadow Collective was capable of and how they performed in action, the Hutts agreed to join them. However, outside the castle Vizsla told Bo to be aware, as they are going to take over Mandalore and they would finish with Maul and Opress, alongside the Duchess."}, {"tag": "h3", "text": "Takeover on Mandalore"}, {"tag": "p", "text": "Once the Shadow Collective was created, Maul forced his leadership upon Death Watch, leaving Vizsla and Bo-Katan plotting his death. Using his 'army' to attack various targets across the capital city of Sundari, Maul sent Vizsla and Death Watch to 'capture' them and bring them to justice, acting as saviors. Vizsla gained the support of the people by demonstrating that the Dutchess was unable to protect them. He arrested Kryze, but when Maul arrived in the city, Vizsla informed Maul that he had no intention of spreading their success to the other 2,000 neutral systems. Maul was arrested by Vizsla's men, but before he and Opress were taken to the Sundari prison, Vizsla said that he would still honor their agreement about removing Kenobi, but that Maul would have to submit to Vizsla's rule."}, {"tag": "h3", "text": "Downfall"}, {"tag": "p", "text": "After imprisoning Maul and Oppress, he proceeded to claim the title of Mandalore for himself. But to Vizsla's surprise, Maul and Opress, in addition to Almec, were able to escape from the prison. Once they entered the throne room, Maul challenged Vizsla to a duel in single combat, which he accepted. He told Bo-Katan to give Maul his lightsaber. With a battle-cry, he charged at the Zabrak and the two of them engaged in a brutal fight. They fought across the throne room, Vizsla using his jetpack, blaster pistols, grenades and his Darksaber to try and gain an advantage with Maul, much as he had done with Kenobi much earlier. Vizsla's unpredictable fighting style allowed him to hold his own against the Sith Lord, but eventually, Maul proved the strongest. He forced Vizsla to the ground and performed a sai cha move with the Darksaber, Vizsla's own blade."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After Vizsla was killed by Darth Maul, Almec succeeded Vizsla as Prime Minister of Mandalore. Almec would declare in front of the people that Vizsla had been murdered by Duchess Satine Kryze, and that the people of Mandalore would remember him as a hero who had saved them in time of need while Kryze had fled. Maul, meanwhile claimed the Darksaber as his own and declared himself the new leader of the Death Watch. Some members of the Death Watch gave their loyalty to Maul; they became known as Mandalorian super commandos. Others, including Bo-Katan and the Nite Owls, refused to follow an outsider and remained loyal to Vizsla's memory. The conflict between the two factions culminated in the Battle of Sundari."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Pre Vizsla claims himself to be a defender of the Mandalorians' historic past as warriors that had once fought against the Jedi Order itself. Recognizing the Mandalorians' previous culture and what he believed that they should be, Vizsla possessed a strong desire to return Mandalore and its people to that reality by leading the Death Watch in its campaign to take control of the Mandalorians' homeworld. In the wake of the death of Mand'alor Jango Fett, during the Battle of Geonosis, Vizsla considered himself to be carrying on the traditions of the Mand'alor, embodying the Mandalorian ideal of the \"one ruler\". However, his actions and methods contradict his claims as he was willing to do things that the Mandalorians of old would greatly frown upon like cheating in his fights, senselessly massacre an entire village when it served no purpose and orchestrate an invasion to make himself look a like hero, further tarnishing and even defiling the Mandalorian warrior culture he hypocritically claims to uphold.  He also intended to reignite the ancient feud between the Jedi and the Mandalorians, seeking to make his people enemies of the Jedi once more. Vizsla opposed Duchess Satine Kryze and her New Mandalorian government, viewing them as weak-willed cowards that tarnished the very name Mandalorian. Vizsla was willing to ally himself with Count Dooku and the Confederacy of Independent Systems if it meant that the Death Watch could emerge victorious over Kryze's government and that his vision of the resurgence of the Mandalorians' generations-old warrior culture over the New Mandalorians' pacifistic goals was realized. Vizsla also schemed with the corrupt and evil Senator Tal Merrik to capture Kryze, although Merrik was unsuccessful in his exploits. However, Vizsla, as a loyal governor of Concordia and one of the officials leading the search for the Death Watch, was able to guard his true allegiances from Kryze for some time. His apparent support of Kryze was to such a degree that he came to be considered one of her trusted allies."}, {"tag": "p", "text": "Vizsla chose not to fight Kenobi when the latter was unarmed and returned Kenobi's lightsaber to him before engaging him in a duel, confident in his own abilities to make Kenobi join the many Jedi that had fallen by the Darksaber's blade. However, when the battle between them did not go as planned, he became frustrated; after being beaten back twice by Kenobi, Vizsla ordered three of his accompanying troops to finish the Jedi Master off themselves. Also, when the plot to manipulate the Republic Senate into voting to occupy Mandalore failed, Vizsla became livid from this turn of events and allowed his intense frustration to influence his decisions. He intended to continue with invading Mandalore, despite the fact that the Death Watch would not have the people's support in the take-over, and only postponed the attack at Count Dooku's urging for patience. Dooku himself attributed Vizsla's rash desires to his inexperience on the battlefield."}, {"tag": "p", "text": "Vizsla displayed incredibly brutality on Carlac by ordering his warriors to slaughter an entire village simply because they tried to stand up to him. In his mind one should never allow the weak to tell them what to do, and any who had the audacity to do so deserved to die. He was also vengeful and wanted to kill Count Dooku for betraying and scarring him. Lux Bonteri stated that Vizsla was actually no better than the Sith Lord."}, {"tag": "p", "text": "After allying himself with Darth Maul and Savage Opress, Vizsla expressed his intent to betray them to Bo-Katan and treacherously imprisoned Maul and Opress. However when the brothers broke out of prison, he accepted Maul's challenge of a one on one battle, and unlike against Kenobi, Vizsla did not permit his allies to assist him in the battle. Just before he died, Vizsla reasserted his firm belief that only the strongest should rule, and died with pride and dignity."}, {"tag": "h2", "text": "Talents and abilities"}, {"tag": "p", "text": "Pre Vizsla was a highly skilled fighter, possessing enough combat skills to hold out against the veteran Jedi Master Obi-Wan Kenobi for a short amount of time in a lightsaber duel. In close combat, Vizsla used the Darksaber blade and attempted to use both brute force and greater height with his jetpack to his advantage. Although Vizsla acquitted himself well for a warrior without the benefit of the Force, he was ultimately unable to defeat Kenobi and was bested by the Jedi Master."}, {"tag": "p", "text": "Vizsla's skill with his Darksaber improved significantly as time went on, and he fought Ahsoka Tano to a draw on Carlac. His talents even advanced to the point where he was able to hold his own against Darth Maul. Using the Darksaber, his flamethrower, jetpack, blasters and bare hands Vizsla put up a fierce fight, but was ultimately slain by the Sith Lord, who had received training from a former member of the Death Watch."}, {"tag": "p", "text": "Vizsla was also a skilled diplomat and, as the Death Watch's leader, his orders were carried out promptly, such as when he dispatched an assassin to eliminate Kryze. Furthermore, his troops were willing to sacrifice their own lives in the pursuit of their missions, such as the sabotage of a Republic cruiser and the bombing of Sundari's memorial shrine. Demanding the best, Vizsla was not above summarily executing anyone who did not perform to his expectations."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Vizsla wore a suit of black and blue Mandalorian armor complete with a T-visor helmet that was painted with a distinctive cream-colored trident symbol above his visor. He also wore a striped light gray cape that displayed his clan marking, the symbol of the Death Watch. His shoulder pads were adorned with a red-and-white rank insignia. Vizsla used a variety of equipment in combat; among his tools were a pair of WESTAR-35 blaster pistols and a JT-12 jetpack, as well as the flat-edged, black-bladed Darksaber that his ancestors had stolen from the Jedi Temple long before the Clone Wars."}, {"tag": "p", "text": "Vizsla was also in possession of a Kom'rk-class fighter/transport which he called the Gauntlet, and made use of it as his personal ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Pre Vizsla was created for the Star Wars: The Clone Wars television series and first appeared in the series' 2010 second season after being mentioned in several issues of the Star Wars Insider magazine. He was featured as the primary antagonist of the episodes \"The Mandalore Plot,\" \"Voyage of Temptation,\" and \"Duchess of Mandalore,\" all of which formed a story arc centered around the Mandalorians in the series. Vizsla was voiced in his television appearances by American actor Jon Favreau, the director of the popular Iron Man film series, whose role in portraying Vizsla marked his first contribution to Star Wars canon. Favreau was recruited for the part by Series Director Dave Filoni. According to an interview with Filoni that was featured in Star Wars Insider 115, the name \"Pre\" is a title of stature, like \"pre-eminent,\" while the \"Vizsla\" name came from Tor Vizsla, the original leader of the Death Watch who was featured in the 2002 Jango Fett: Open Seasons comic book series. Vizsla was given an entry in the The Clone Wars Character Encyclopedia book, released in June 2010. He was also featured in Hasbro's 2010 toy figure line."}, {"tag": "p", "text": "A concept art model sheet that was published in Star Wars Insider 116 indicated that Vizsla's name was originally spelled \"Visla.\" On the same model sheet, the symbol on his cape was depicted as the Mandalorian symbol, suggesting that the symbol was originally that of the Mandalorians and was adjusted for the final version of \"The Mandalore Plot.\" Because \"Voyage of Temptation\" was produced with the television series' first season, well before the other installments in the Mandalorian story arc, the character model used for Vizsla in the episode was based on the Phase I clone trooper armor design—disguised only by his serape—instead of the finalized character design used in the later episodes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}