{"url": "Precognition/Legends", "categories": ["Category:Legends articles", "Category:Dark side", "Category:Light side", "Category:Sense powers"], "nodes": [{"tag": "h1", "text": "Precognition"}, {"tag": "p", "text": "Precognition, also known as danger sense, was a universal Force power used by Force-sensitives with high experience in the Force."}, {"tag": "p", "text": "The ability of foresight was perhaps universal to the Jedi or Force-sensitives and was manifested in the form of Force visions of future events, guiding premonitions or warnings, and an inflow of prescience that helped the Jedi predict their opponent's movements."}, {"tag": "p", "text": "This ability in the Force was not restricted to the Jedi, however, as the Sith also were known to perceive direction and insight from the dark side."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Carnor Jax trained in the art. Plo Koon's former Master, Tyvokka was known to have advanced Force precognition powers."}, {"tag": "p", "text": "Jedi Master Obi-Wan Kenobi often recognized these premonitions from the Force when they began as a \"small voice,\" when instinct began ticking inside him, telling him to pursue a course of action: \"He had learned not to ignore that small voice. Qui-Gon had taught him that. If he could teach Anakin one thing, it would be to slow down enough to hear that insistent sound, sometimes no more than a whisper, that said, follow this.\""}, {"tag": "p", "text": "The Jedi Suljo Warde developed a unique form of precognition that allowed him to see the future actions and choices of others, but not his own. Additionally, Warde's visions were possible futures, and thus not guaranteed to be correct."}, {"tag": "p", "text": "Luke Skywalker and his sister Leia also enjoyed this Force gift of sensing on occasion not only premonitions, but also warnings of danger."}, {"tag": "h2", "text": "Battle Precognition"}, {"tag": "p", "text": "Battle Precognition was a variant of precognition that allowed one to sense and foretell the flows of the Force while engaged in battle."}, {"tag": "p", "text": "Skere Kaan of the Brotherhood of Darkness, for example, used battle precognition in space battles with Lord Hoth's Army of Light. Jedi Padawan Tallisibeth Enwandung-Esterhazy (better known as \"Scout\") had this power. The Jedi Knight Revan and Meetra Surik were known to be gifted users of battle precognition. Surik learned this ability from Brianna. Darth Bane also possessed a natural ability for precognition before he even began training as a Sith. Nova Stihl possessed a nearly identical ability, which he called Blink."}, {"tag": "p", "text": "The Echani were known to possess a variant of this ability which did not draw from the Force but from the warrior's own instincts. The most elite Echani warriors were able to predict battles and even the course of a war. It was probable that such outcomes grew more likely or unlikely as critical moments approached and passed."}, {"tag": "h2", "text": "Blink"}, {"tag": "p", "text": "Another variant of precognition was Blink, the name given to an unconscious ability that stormtrooper sergeant Nova Stihl possessed. This power, which was in reality a manifestation of his latent Force-sensitivity, allowed him to anticipate others' actions when engaged in a fight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}