{"url": "Pre-Republic_era", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Pre-Republic", "Category:Time periods", "Category:Years in the pre-Republic era"], "nodes": [{"tag": "h1", "text": "Pre-Republic era"}, {"tag": "p", "text": "The Pre-Republic Era (—25,053 BBY), also known as the Early Hyperspace Age, was the period before the formation of the Galactic Republic. It included the formation and evolution of all the species of the galaxy, the dawn of their civilizations and their first developments in space travel, and ended in approximately 25,053 BBY, when the Republic was founded."}, {"tag": "p", "text": "Pre-Republic history was largely dominated by ancient and mysterious species who developed interstellar travel long before Humans and other, more well-known species. Such species included the Columi, Killiks, and Rakata. The names and histories of some of these species have been entirely lost to time, including the Celestials. In their travels about the galaxy, many of these civilizations affected the evolution and cultural development of the more primitive species that would later dominate galactic affairs. Some built massive, mysterious structures for these and other purposes, including Centerpoint Station, the Maw, the Foundry, and the Star Forge."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the beginning, there was the Big Bang. Eventually, the galaxy and life on its planets came into being. For billions of years, those species evolved and formed civilizations, and eventually a few took to the stars. These first spacefarers have been forgotten, their only legacy the large artificial structures they left behind. The Corellian system was an artificial creation from this era, and the Drall and Selonians were transplanted by one of these unknown species to planets within the system. The presence of certain flora and fauna on many different worlds, such as the bantha, was likely also due to the intervention of these advanced species. The ancient species of the galaxy took a hand in the shaping of many worlds as well; Kashyyyk and Tatooine were two such planets whose biospheres were manipulated by these civilizations. Some time after this, the Devaronians became one of the first identified species to develop space travel. For a time little happened on a galactic scale; species such as the Gree and Columi rose briefly before disappearing again."}, {"tag": "p", "text": "After the independent discovery of a mystical power on several worlds across the galaxy, a group of mysterious vessels gathered Force-sensitives and brought them together to the Deep Core world Tython. In 36,453 BBY, the Je'daii Order was founded to codify beliefs and study about the Force."}, {"tag": "p", "text": "The first known civilization to seize power on a large scale was the Rakatan Infinite Empire. By 30,000 BBY it reached its peak, spanning worlds as far apart as Dantooine and Honoghr, although in actual number, it was composed of relatively few planets. The Rakata embraced slavery to fuel their Empire, ruling tyrannically over many species, including the Ghorfa, Selkath, and Humans. As a monument to their power, they built the Star Forge, an artifact of the dark side that powered their vast war machine."}, {"tag": "p", "text": "Meanwhile, on Tython, an equally important development was occurring. In 25,793 BBY, some of the mystics wished to use the power of the Force to increase their own stature, and the followers of the Bogan, as they called it, soon found themselves in conflict with the followers of the Ashla, and soon Tython was engulfed in the Force Wars. By 25,783 BBY, the side of the Ashla won, and in the wake of the war, they formed themselves into an order of monastic knights dedicated to the principles of peace and harmony. The Jedi had been born."}, {"tag": "p", "text": "The Infinite Empire soon found itself stretched too far, and the aggression that powered it turned the Rakata on themselves. A slave revolt throughout the Empire, a plague that killed only Rakata, and a civil war that broke out on their homeworld of Lehon quickly sped the Empire to its collapse around 25,200 BBY. Free from Rakatan oppression, the former slave species of Humans and Duros developed rapidly, adopting abandoned Rakatan technology to speed innovation along. Within 200 years, hyperspace travel made it feasible to travel quickly, cheaply, and conveniently between planets across the galaxy."}, {"tag": "p", "text": "In 25,130 BBY in the Outer Rim Territories, the warlord Xim came to power in the Tion Cluster. He unified its governments into a highly expansionist empire and set about conquering its neighbors. As he reached the Si'Klaata Cluster, this brought him into conflict with the Hutts, whom he fought to a standstill at the First and Second Battles of Vontor. The Hutts signed the Treaty of Vontor with the native species of the Si'Klaata Cluster, recruiting them to fight Xim. When they fought again at the Third Battle of Vontor, Xim was finally defeated and captured."}, {"tag": "p", "text": "The species of the galaxy were ready to unite. The hyperdrive had been perfected, and the Core Worlds were freely accessible. The Unification Wars were the last major conflict before this could happen, and in their wake, the Galactic Republic was created with the signing of the Galactic Constitution. Thus ended the Pre-Republic era, and so began the Expansionist and Old Republic era."}, {"tag": "h2", "text": "Civilization"}, {"tag": "p", "text": "Little was known about the details of individual civilizations. The presence of single planetary governments in the years of the Republic suggested that most worlds became unified under one government during this time. Many of the species that would become predominant in later eras originated in the Core Worlds, including Humans. However, it was notable that most of the ancient interstellar empires originated in the Outer Rim Territories and beyond, including the Rakata and Gree.[source?]"}, {"tag": "h3", "text": "Humans"}, {"tag": "p", "text": "Conflicting theories on the origins of Humans abound, but prominent historians believed that Coruscant was their most-likely homeworld. The Zhell were the earliest-known Human civilization, composed of thirteen nations, but nothing on them remained except the poem Dha Werda Verda, describing their ancient battles with the Taung."}, {"tag": "p", "text": "As Humans developed interstellar travel, they colonized many worlds, including the Core Worlds of Alderaan, Corellia, Axum, Alsakan, and Metellos. The presence of Humans on the Outer Rim world of Argai was a mark of the extent of Human colonization efforts. When the Infinite Empire arose, Corellia and Coruscant fell under their control and were forced into slavery, until the Empire's collapse."}, {"tag": "h4", "text": "Xim's Empire"}, {"tag": "p", "text": "Descended from early Coruscanti colonists, the pirate Xim built an empire in the Tion Cluster in 25,130 BBY, conquering and unifying the many governments of the cluster. To eliminate the enemies of his empire, he formed a secret police force, the GenoHaradan, who would outlast the empire by over twenty thousand years. Eventually, his imperialism brought him into conflict with the Hutts. He was defeated, and his empire destroyed, at the Third Battle of Vontor."}, {"tag": "h4", "text": "Azure Imperium"}, {"tag": "p", "text": "The Azure Imperium was an empire of Core Worlds lying along the Perlemian Trade Route. Its capital was Axum, whose sister world Anaxes provided the shipyards and defenses that guarded the Axum system. Hundreds of years before the Republic, the Imperium was peacefully annexed by Coruscant."}, {"tag": "h4", "text": "Seoularians"}, {"tag": "p", "text": "The Seoularians were a Human race from Seoul 5 whose civilization spanned many planets, and the ruins of whose garrisons could still be found on several planets eons later, after they had gone extinct. They were technologically advanced and had created a set of crystals capable of boosting mental energy and generating great power, enough to destroy a planet when brought together."}, {"tag": "p", "text": "The Seoularians were killed in a massive war, which was mistakenly believed to have destroyed their homeworld. They worshiped the mother goddess Onrai, mistress of the planet Notron, their name for the homeworld of humanity. Humans, when viewing statuary of Onrai, sometimes felt a strange familiarity with her."}, {"tag": "h3", "text": "Duros"}, {"tag": "p", "text": "The Duros were early pioneers of space travel. Like Humans, they spread amongst the stars of the Core, colonizing worlds such as Neimoidia. They too were enslaved by the Infinite Empire."}, {"tag": "p", "text": "Duro's government was a hereditary monarchy. The last ruler of the Duros before the foundation of the Republic was Queen Rana Mas Trehalt."}, {"tag": "h3", "text": "Infinite Empire"}, {"tag": "p", "text": "The Rakatan Infinite Empire spanned much of the galaxy, though its worlds numbered few. The Infinite Empire was built on the backs of slaves and powered by the Star Forge. The Rakata used the Force to carve their Empire out, as it powered their hyperdrive technology and the Star Forge itself. This use of the Force for conquest turned the Forge into an artifact of the dark side, and may have been what eventually blinded their species to the Force. That, a vicious plague that swept the Empire and killed only Rakata, and a sudden slave uprising eventually resulted in the fall of the Empire, and the Rakata retreated to their home planet of Lehon."}, {"tag": "h3", "text": "Hutts"}, {"tag": "p", "text": "Originating on Varl, the Hutts built their expansionist Hutt Empire in the Outer and Mid Rims. They colonized several worlds, including Ko Vari and Evocar, where they encroached on the native Evocii population and eventually became the dominant force in the galaxy for a few centuries, between the decline of the Rakata and the rise of the Republic. The Hutt victory over the forces of Xim at Vontor and their conscription of the Klatooinians, Nikto, and Vodran cemented their place as a permanent power in the region later known as Hutt Space."}, {"tag": "h3", "text": "Sith"}, {"tag": "p", "text": "The Sith species originated on the planet Korriban. Though they engaged in practices such as sentient sacrifice, held a strong caste system, and were in an almost constant state of war, their civilization was quite sophisticated; they saw these acts not as cruel or barbaric, but simply basic aspects of existence. Their social order was very rigid, and while many rose to the title of Sith Lord, only one, King Adas, attained the position of monarch. Circa 28,000 BBY, Adas, marked as a chosen one from a young age by his unusual black skin, united the nations of Korriban in violent warfare. He took the title of Sith'ari, meaning \"overlord,\" and was seen by his people as an immortal being who would rule forever."}, {"tag": "p", "text": "Eventually the Rakata arrived on Korriban. Pretending to ally themselves with Adas at first and giving him the technology of holocrons, they soon revealed their intentions and attempted to conquer the Sith. Adas and the Sith fought back and drove off the forces of the Infinite Empire, with the king giving his life in the process. Without Adas's strong hand, Korriban soon collapsed into civil war, with many naming themselves Sith'ari. The massive infighting eventually forced the Sith to relocate their capital to Ziost."}, {"tag": "h3", "text": "Columi"}, {"tag": "p", "text": "Around 100,000 BBY, the Columi left their homeworld of Columus and surveyed the galaxy, observing in particular the civilizations of Coruscant and Duro. Finding nothing of interest, they returned to Columus."}, {"tag": "h3", "text": "Gree"}, {"tag": "p", "text": "In the Outer Rim, the Gree built their own interstellar civilization. Gree society was centered on innovation, with all principal social castes except administrators involved in the design, creation, and use of new inventions. The Gree created several marvels of technology, many of whose secrets were lost to time. The Gree civilization, like many other such ancient civilizations, eventually decayed into a shadow of its former glory."}, {"tag": "h3", "text": "Kwa"}, {"tag": "p", "text": "A reptilian species, the Kwa, lived on Dathomir and built the Infinity Gates that allowed them to teleport between worlds. Eventually the Kwa civilization collapsed, nearly exterminated by the Rakata."}, {"tag": "h3", "text": "Sharu"}, {"tag": "p", "text": "The Sharu, a humanoid race native to the Rafa system, constructed colossal plastic pyramids and the Mindharp of Sharu, a strange object that constantly changed form as it shifted through dimensions. During this time, the Sharu developed an enormous fear of something, believed to be the Celestials, and hid underground, using mind altering life orchards to drain their intelligence and becoming the primitive Toka."}, {"tag": "h3", "text": "Killiks"}, {"tag": "p", "text": "Originating on Alderaan, the insectoid Killik species developed space travel and eventually expanded to the nearby world of Alsakan. In approximately 35,000 BBY the species was driven from the Core into the Unknown Regions by the Celestials."}, {"tag": "p", "text": "When Human colonists arrived on these worlds millennia later, the only signs of prior civilization were the massive mounds they had left behind, including the Castle Lands of Alderaan."}, {"tag": "h2", "text": "Technology"}, {"tag": "p", "text": "With most worlds isolated from each other, the technological history of the Pre-Republic era largely consisted of the typical developments required to form an industrial civilization. Worlds can be expected to have undergone their equivalents of a Stone Age, Industrial Revolution, and so forth. At some point, each species would have developed the means to leave their planet and travel at sublight speeds, resulting in a Space Age. The first warships appeared in this time period as well, primitive nuclear-powered rockets with basic laser weaponry."}, {"tag": "p", "text": "As beings sought to reach beyond their own star systems, they invented technologies such as sleeper ships that enabled them to spread their civilizations throughout the stars without traveling faster than light. It was in this way that Humans first spread to worlds throughout the galaxy.[source?]"}, {"tag": "p", "text": "In this period, quintillions of engineering pioneers helped develop and refine the hyperdrive, following the fall of the Infinite Empire. Their efforts culminated in the device that would remain the predominant way of facilitating interstellar travel for over 25,000 years."}, {"tag": "p", "text": "The discovery of hyperspace travel was the first step towards the eventual unification of the galaxy by providing species with a means to break the light barrier. The first technology to utilize this was the hyperspace cannon, a device that accelerated ships into hyperspace. It had severe limitations, however: the amount of travel possible was limited by the number of cannons, a ship needed to induce drag to revert from hyperspace at the proper time, and most importantly, it was a one-way trip unless another cannon was constructed at the other end. Such cannons first connected the Humans and the Duros."}, {"tag": "p", "text": "The peak of Pre-Republic innovation occurred with the invention of the hyperdrive, which finally allowed civilizations to freely roam the galaxy by traveling many times faster than the speed of light. It was the hyperdrive that gave rise to the Galactic Republic by connecting and uniting species from worlds across the galaxy. The invention of the hyperdrive itself is sometimes attributed to the mysterious race known as the Celestials, who are said to have given it to the other species, though it is now thought that Corellian and Duros scientists developed it by reverse engineering Rakatan technology."}, {"tag": "p", "text": "By the time of the Galactic Alliance, myths of the Pre-Republic era included \"dark knights\" who fought mounted with lances, and would later be compared to the lancer troops that fought the Battle of Muunilinst. Whether such dark knights actually existed or were just widely accepted folklore is unknown."}, {"tag": "p", "text": "One of the most notable developments of this period, as measured by the far-reaching effects it would come to have on galactic society, was the creation of artificial intelligence and the invention of droids. Droids had appeared in advanced civilizations for uncounted millennia, but they were first developed in what would become Republic space circa 30,000 BBY. Some were doubtful that this technology could ever match their own natural sentience, and their doubts were echoed by noted philosophers such as Plaristes."}, {"tag": "h3", "text": "Notable achievements"}, {"tag": "p", "text": "While most species were still in the early stages of development, a few civilizations reached their peak early in galactic history. By the time Humans, Duros, and the other later species began their spread, the ancient species had long vanished, but their sophisticated technological achievements, in the form of massive artificial structures, remained. The level of technology required to build these structures indicates an abnormally high stage of advancement compared with the rest of the galaxy. In many cases, the capabilities of these devices remained unrivaled even by later technology.[source?]"}, {"tag": "h4", "text": "The Corellian system"}, {"tag": "p", "text": "By precise control of gravitational fields, the species known as the Celestials altered the orbits of the planets in the Corellian system, resulting in the unusual case of five planets in the same system capable of sustaining life. To aid in the construction of the system, enormous planetary repulsors were installed beneath the surface of the five inhabited planets."}, {"tag": "h5", "text": "Centerpoint Station"}, {"tag": "p", "text": "The incredible feats performed in the construction of the Corellian system were made possible by the enormous space station called Centerpoint, which sat at the L1 point between Talus and Tralus. Centerpoint's abilities were due to its massive tractor-beam installation, which was even capable of moving objects through hyperspace. In later years, the Killiks would purport to have built Centerpoint; however, there is no evidence of this other than these claims. It had been speculated that the Killiks were used for manual labor by the Celestials to build the station, and that its purpose was to imprison the being known as Abeloth."}, {"tag": "h4", "text": "The Maw"}, {"tag": "p", "text": "In a similar manner to the Corellian system, the cluster of black holes known as the Maw was so precisely arranged that it too was likely the product of an ancient civilization. Similar gravitational technology was no doubt used to move the star-like masses of the black holes that composed the Maw. The Killiks claimed to have created it as well, but as with Centerpoint, there is no evidence to support their claim. Some theorized that the Maw's purpose was to serve as the prison for Abeloth."}, {"tag": "h4", "text": "The Star Forge"}, {"tag": "p", "text": "The Star Forge was the pride of the Rakatan Infinite Empire, an enormous space station and factory that turned the raw plasma of Lehon's sun into ships and weapons. Fueled by their aggression and conquest, the Star Forge was molded into an artifact of the dark side, and in turn corrupted the Rakatan people further. When the Infinite Empire collapsed, the Star Forge was abandoned, its secrets locked within the Temple of the Ancients. In worlds across the galaxy, Rakatan temples held their Star Maps, built as testaments to the power of the Infinite Empire."}, {"tag": "h4", "text": "Star Temples"}, {"tag": "p", "text": "The Star Temples were artifacts of the Kwa, built to house the power of the Infinity Gates. The Gates themselves were primarily a means of transportation between different worlds, although as a last resort they could also be activated as weapons that destroyed everything in their vicinity. The Star Temples protected the power of the Gates from being used by outsiders."}, {"tag": "h2", "text": "Terminology"}, {"tag": "p", "text": "The term Pre-Republic was occasionally used by individuals such as Jedi Master Odan-Urr to refer to only the short period between the discovery of the hyperdrive and the founding of the Republic. The end of the Pre-Republic era was known as the Expansionist Era."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Concepts that belong to this era use standard Earth terminology such as Kossak and Condottiere. The word \"robot\" and the suffix \"-bot\" are preferred over \"droid\" to refer to Pre-Republic machines. Sleeper ships are also common in science-fiction works having to do with possible future Earth technology."}, {"tag": "p", "text": "Alien Exodus was a planned novel that would have been set in the Pre-Republic era, but since it was never published, the story developments that were planned for it remain non-canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}