{"url": "Praven", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with gameplay alternatives", "Category:Former Sith", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Sith Lords of the reconstituted Sith Empire", "Category:Sith Masters", "Category:Sith rejects", "Category:Sith species"], "nodes": [{"tag": "h1", "text": "Praven"}, {"tag": "p", "text": "Praven was a Sith pureblood male who served the reconstituted Sith Empire as a Sith Lord and later protected the Galactic Republic as a member of the Jedi Order. Trained as a Sith Warrior by Darth Angral, Praven participated in the attack on the Jedi Temple on the Republic capital of Coruscant at the end of the Great Galactic War in 3653 BBY. In the subsequent Cold War, Praven took on Angral's son Tarnis as his own apprentice and trained the Human as a Sith Lord, but Praven's training was not enough to prevent Tarnis's death at the hands of a young Jedi Knight when Tarnis attempted to unleash the Planet Prison superweapon against Coruscant near the end of the Cold War. Angral's pursuit of revenge drove him to dispatch his apprentices across the galaxy in order to steal other Republic weapon projects, and Praven acquired the Shock Drum weapon on the planet Tatooine after defeating the Jedi Master Bela Kiwiiks."}, {"tag": "p", "text": "However, Praven's sense of honor caused him to disobey his Master and challenge the Jedi Knight to a duel instead of destroying Tatooine with the Shock Drum, and the Knight was able to convince the Sith Lord to abandon the dark side and become a Jedi. Finding a new purpose as a Jedi Padawan, Praven learned the ways of the light side and gladly joined the Republic Military in defending the planet Corellia during the Battle of Corellia when the Galactic War broke out with the Empire. Under the leadership of the instrument of his redemption, the Jedi Knight now known as the Hero of Tython, Praven and the rest of the Jedi reinforcements foiled the plans of the Sith Emperor and prevented the Dark Jedi Tol Braga from killing thousands of civilians."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A male member of the Sith species, Praven was born into a family that took pride in the purity of its heritage. He was found to be Force-sensitive early in his youth and underwent training in the use of the dark side of the Force while also becoming adamantly loyal to the Sith Empire and its Emperor. A true believer in Sith philosophy who developed his own code of personal honor, Praven also developed an intense hatred of Jedi, and the Sith Warrior was taken on by the powerful Sith Lord Darth Angral as his Sith apprentice sometime before the end of the Great Galactic War with the Galactic Republic. Under Angral's tutelage, Praven achieved the rank of Sith Lord himself and in turn took on Angral's own son, Tarnis, as his apprentice; Praven's student soon became a Sith Lord in his own right."}, {"tag": "p", "text": "In 3653 BBY, Praven was among the Sith who participated in a bold attack on the Republic capital of Coruscant. During the fighting, Praven engaged the Jedi Master Usma, one of the Jedi Order's most celebrated lightsaber duelists, in combat, and their duel ended when the Sith Lord killed Usma. However, Praven spared Usma's Padawan before telling her to seek him out once the Jedi had completed her training so that the two could face each other as equals. Praven also killed a Republic soldier whose son, Fir Megsan, would later set a bounty on the Sith's head in an attempt to gain revenge. In the days that followed the Sacking of Coruscant, as the battle came to be known, the Republic was forced to sign the Treaty of Coruscant, which ended the Great Galactic War and called for the immediate withdraw of Republic forces from battlefields across the galaxy."}, {"tag": "p", "text": "Robbed of his chance to destroy the Republic, Angral spent the subsequent Cold War weaving complex plots to bring about his enemy's destruction—one of which sent Tarnis on an undercover mission as Doctor Eli Tarnis, a scientist in the Republic superweapon initiative. Praven's former student quickly became the head of the Planet Prison project, while Angral took on two more apprentices, Sadic and Nefarid. Praven gained a reputation among the Imperial Military after an encounter with an Imperial major ended with the man's death: Praven was insulted by the lack of respect that the major chose to show him and choked the officer with the Force, demanding an apology before breaking the man's neck as punishment. Sometime during the Cold War, Usma's Padawan tracked down Praven as he had told her to, and the Sith Lord obliged her by sending the woman to the same fate as her Master. During his time as a Sith, Praven encountered the immortal Lord Scourge, the Emperor's Wrath, who served as the Emperor's personal executioner."}, {"tag": "h3", "text": "Angral's crusade"}, {"tag": "p", "text": "In 3643 BBY, Tarnis seized control of the Planet Prison project and set it up in the ruins of the Jedi Temple on Coruscant, intending to use it against the Republic capital while he made his escape. Praven was with Angral, Sadic, and Nefarid at a secret Imperial facility on Ord Mantell when Tarnis contacted his father and relayed via holographic transmission the success of his plans to evade his Jedi and Republic pursuers. Praven's former apprentice also sent his father copies of files on all of the Republic's superweapon projects, but the conversation was interrupted by the arrival of a young Jedi Knight and the Padawan Kira Carsen. Sadic mockingly reprimanded Tarnis for failing to tie up loose ends, but Angral urged his son to strike down his enemies, and Praven watched with the others as Tarnis engaged the two Jedi in a duel—a battle that ended in Tarnis's death. A furious Angral declared undying hatred for the Knight on account of that, and Praven promised his Master that he would personally kill the Jedi."}, {"tag": "p", "text": "Tarnis's death drove Angral to the edge of sanity, and in his rage the Sith Lord dispatched his three apprentices to take control of the three superweapons that were detailed in Tarnis's files. While Sadic and Nefarid were sent to the moon Nar Shaddaa and the planet Alderaan, respectively, Praven traveled to the desert world of Tatooine, where he commanded a detachment of Imperial soldiers in his search for the Shock Drum—a weapon that utilized seismic vibrations as an offensive weapon, literally softening up enemy defenses, though the device would destabilize the core of a planet after enough time. Storming the Shock Drum Facility in the Northern Jundland Wastes and destroying the compound's power generators, Praven discovered the Togruta Jedi Master Bela Kiwiiks was there to defend the project, and the Sith Lord defeated the Jedi in battle despite losing many of his soldiers. However, Praven's sense of honor led him to take Kiwiiks alive as a prisoner, and he destroyed the project's security droids and took the Shock Drum prototype. Informing the project staff that they were no threat and therefore did not deserve an unjust death, Praven departed the facility with his two prizes and the remaining soldiers."}, {"tag": "p", "text": "While traveling west into the Dune Sea region, Praven contacted Angral and relayed his success. Angral ordered his apprentice to activate the Shock Drum weapon and leave Kiwiiks to die alongside it, ensuring that the Jedi Master would suffer before her death, and he also commanded Praven to destroy the Shock Drum's deactivation codes so that Tarnis's killer would be unable to prevent the Shock Drum from destroying Tatooine. However, Praven was disgusted by his Master's attempts at treachery, and his honor drove him to disobey that final order after leaving the active Shock Drum and Kiwiiks beneath an abandoned mining complex in the Dune Sea. Praven contacted the recently arrived Jedi Knight, who had just finished restoring the research facility's scanners in order to locate the weapon, and interrupted the Knight's holocall to the researcher Hare'en. Informing the Jedi that he had changed the Shock Drum's deactivation codes so that only he possessed them, Praven challenged the Knight to an honorable duel in the mountains in exchange for the codes."}, {"tag": "h3", "text": "Confrontation and redemption"}, {"tag": "p", "text": "Praven sent the Jedi the coordinates for the Esus Mesa and awaited his opponent there. He was at the far edge of the mesa, gazing out across the Dune Sea, when he sensed the Knight's powerful presence in the Force approaching. Praven understood that his student had died because the Knight was more powerful than Tarnis had been, and that realization filled the Sith with a sense of regret that the Jedi was surprised to feel. When questioned by the Jedi, Praven stated that he relied on the passions of integrity and honor rather than the lesser emotions of arrogance, hatred, and fear, and he drew his lightsaber to begin their duel. The Knight and a companion battled Praven back and forth across the mesa, with Praven utilizing tactics such as physical combat, Force blasts, Force paralysis, and Force barriers in his struggle against the pair. However, the duel ultimately ended in Praven's defeat, and the wounded Sith Lord fell to his knees in submission."}, {"tag": "p", "text": "Yet to Praven's surprise, the Knight did not move immediately to kill the Sith Lord, and he questioned the Jedi as to why. Praven brushed aside the Knight's attempts to convince him to abandon the dark side, acknowledging that the Jedi would be a powerful Sith, but he admired his opponent's resolve and fulfilled his part of their bargain by giving the Jedi the deactivation codes. Praven further informed the Knight of Kiwiiks' situation, explaining that she was specifically targeted by Angral because she detected Tarnis's presence on Coruscant, and then asked the Knight to end their duel with his death. However, the Jedi refused and again asked Praven to forsake the dark side, finally convincing him to do so by sparing his life."}, {"tag": "p", "text": "Accepting the Knight's offer, Praven urged the Jedi to go and save Tatooine while he departed the Esus Mesa and contacted the nearest Republic cruiser. Praven surrendered himself to Republic authorities with the request that he speak with the Jedi Order, and to his surprise the Order accepted him into their ranks as a Padawan. Under the tutelage of the Jedi, Praven forsook his past as a Sith and devoted himself to becoming a servant of the light side of the Force. Praven later sent a message to the Knight, who succeeded in shutting down the Shock Drum, expressing his thanks and informing the Jedi that he intended to devote himself to making up for his past actions as a Sith."}, {"tag": "h3", "text": "Battle for Corellia"}, {"tag": "p", "text": "Eventually, the Cold War escalated into a full-fledged Galactic War between the Republic and the Empire. In 3640 BBY, Praven was sent to the embattled planet of Corellia, where he fought alongside the native Corellians and the Republic Military in the Battle of Corellia. Having shed his title of Lord, Praven worked to defend the citizens of Coronet City from the battle, and when the Padawan learned that the Empire had dispatched several war droids to destroy a resistance cell in the tunnels beneath the Blastfield Shipyards region, he immediately set out to save the resistance fighters. Utilizing his personal red-bladed lightsaber, Praven defended the fighters as waves of droids attacked, and during the battle Praven was joined by the same Knight whom he had fought on Tatooine—a Knight who had become known as the Hero of Tython after defeating Darth Angral two years earlier. When the Knight and a companion found Praven, the former Sith drew his lightsaber and sent it spiraling past the new arrivals to destroy the trio of war droids that were approaching from behind the Jedi. Praven then greeted the Hero, explaining that he never received the chance to thank the Knight for changing his life. Upon learning that the Hero had been appointed Supreme Commander of all Jedi on Corellia, Praven complied with the Knight's instructions to rendezvous with the other Jedi at the Socorro Freight building."}, {"tag": "p", "text": "At the freight building, Praven assumed a leadership role within the newly gathered Jedi reinforcements for the Hero in the mission to stop the corrupted Jedi Tol Braga. Braga was attempting to massacre thousands of civilians so that the Sith Emperor could begin a dark ritual and thereby consume all life in the galaxy. Under the command of the Hero's lieutenant Unaw Aharo, Praven and the other Jedi followed the Hero's orders to relocate to the Labor Valley district, and he worked alongside his fellow Jedi to liberate the weapons factories of Republic-allied corporate official Magremme Thrakus. By doing so, the Outer Rim Jedi reclaimed a valuable source of munitions for the Republic Military effort while the Hero of Tython prevented several Sith from detonating a chemical bomb in the area."}, {"tag": "p", "text": "Praven, Aharo, and the Nautolan Jedi Bengel Morr then led the Jedi to the Axial Park district, and the trio met with Colonel Brint of the Republic Military and Corellia's Senator Jol Zackin in the Corellian Science Museum. The senator asked the Jedi to rescue a large number of wrongfully imprisoned civilians from the Empire's slave camps in the area, and Zackin was engaged in a fierce argument with Brint when the Hero arrived, and Praven listened as both Brint and Zackin made their cases to the Knight. The Knight ignored Brint's attempts to bribe the Jedi with advanced combat equipment, choosing to commit the Jedi to Zackin's cause instead of that of Brint, as the colonel wanted the Jedi to strike back against the Empire in revenge for Imperial raids on the Republic's medical evacuation sites. Morr, Praven, and Aharo then complied with the Hero's orders, leading their fellow Jedi in raids against the nearby slave camps, and traveled to the Drall Library in the Government District to meet up with their commander after completing their mission."}, {"tag": "p", "text": "While the Hero infiltrated the Imperial battle cruiser Eclipse above the city and prevented Tol Braga from detonating the ship's engines, Praven and the other Jedi worked with the forces of General Var Suthra to distract the Empire's forces by raiding Imperial strongholds across the district. After the fighting, the Hero assigned the Jedi to work with Suthra while the Knight departed for a final confrontation with the Emperor, and Praven continued to fight alongside the Republic as they achieved victory in the Battle of Corellia."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Praven had red skin and fleshy tendrils in place of eyebrows above his red-orange eyes, which were common to his species. The bridge of his nose featured several natural ridges, and he typically wore a bodysuit that also covered all of his head except for his face. The suit was gray and blue-green in color, and also had headset-like attachments on either side of his head. He wore dark grey robes over his lower body, as well as a small backpack with two antennas and a silver equipment belt. The single most important principle of a warrior, in Praven's mind, was a strong sense of honor. Fiercely loyal to the Empire and an ardent believer in the strength and power of the dark side during his time as a Sith, Praven was unlike many of his fellow Sith in that he was calm and collected in his speech and actions. He followed a strict code of personal honor, eschewing the random acts of sadism and cruelty that his fellows often partook in. Despite his sense of honor, however, Praven was raised to believe that the Jedi still sought vengeance against the Sith for the Great Hyperspace War, and he considered members of the Order to be his personal enemies. Praven's pride in his heritage was so strong that he killed an Imperial officer for not showing him the proper respect that he felt was due to a pureblooded Sith."}, {"tag": "p", "text": "However, Praven grew disillusioned with Sith philosophy while witnessing Darth Angral's descent into madness. Praven's sense of duty led him to carry out Angral's orders, but the elder Sith's drive for revenge and his callous disregard for both honor and the lives of innocents clashed greatly with Praven's personal values, which ultimately drove him to defy Angral by challenging the Jedi Knight to a duel. Praven ignored the Knight's initial attempts to convert him to the Jedi way, but the Knight's refusal to kill him was the catalyst that opened Praven to the possibility. As a result, Praven was able to renounce his past as a Sith without forsaking his honor and personal values, and found that the path of a Jedi Padawan came easily when he accepted his place among the Jedi. Despite the strange contrast between saving lives and taking them, Praven felt more righteous and secure in his actions as a Jedi than he had ever felt as a Sith."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Sith, Praven was very strong in the dark side of the Force, though he felt stronger with the light side as a Jedi. He wielded a single red-bladed lightsaber as both a Sith and a Jedi, and he was skilled in the use of a wide variety of Force powers, including Force lightning, Force blasts, and Force paralysis. He was also a skilled unarmed combatant, making use of physical blows in conjunction with lightsaber combat to overpower his opponents, and was capable of guiding a thrown lightsaber with enough accuracy to destroy three war droids with one throw."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Praven was created for the BioWare–LucasArts video game Star Wars: The Old Republic, in which he is a recurring character in the Jedi Knight-class storyline. The character's first appearance is in hologram form in the mission \"Race to the Ruins\" on Coruscant. Praven is not encountered again until the planet Tatooine, where he challenges the player to a duel for the deactivation codes for the Shock Drum in the mission \"Desert Duel.\" At the end of the duel, the player has three choices: convince Praven to become a Jedi, allow him to leave, or kill him. The player can also Force persuade Praven into giving the codes before their battle begins, angering Praven. However, he can still be redeemed afterward. If Praven is killed, the player will receive dark side alignment points, and the Advozse Jedi Goril Sevintran will appear in Praven's place on Corellia in the Act III mission \"Jedi Commander.\" Praven was also mentioned in the reference guide Star Wars: The Old Republic Encyclopedia, which was released in 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}