{"url": "Preemptive-strike_laws", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Chiss Ascendancy laws and acts"], "nodes": [{"tag": "h1", "text": "Preemptive-strike laws"}, {"tag": "p", "text": "The preemptive-strike laws, or alternatively the non-aggression protocols or non-intervention policy, were a set of laws of the Chiss Ascendancy that rendered pre-emptive strikes in warfare illegal and punishable by exile. This policy, influenced by the Ascendancy's isolationism and libertarian approach to the galaxy at large, was taken very seriously as a Chiss military rule of engagement. These protocols required the Chiss military to do everything necessary to avoid preemptive combat against potential adversaries."}, {"tag": "p", "text": "While the protocols did not allow first strikes, they did allow for punitive and retaliatory strikes against confirmed aggressors, in response for encroachment on Chiss territory or trade routes. After the attack on Csilla by unknown assailants, the Syndicure and Defense Hierarchy Council decided to attack the Paataatus because, even if the Paataatus were not behind the attack, they had \"been poking at the edge of the Ascendancy again,\" which deserved a retaliatory strike."}, {"tag": "p", "text": "Part of the mission of the Chiss Expansionary Defense Fleet was to conduct reconnaissance and evaluate threats beyond the Ascendancy's borders. Between the Fleet's mission and the non-aggression protocols, there was a strong preference for stealth missions when the Fleet ventured to inhabited systems unknown to the Chiss. An incursion into someone else's territory, even just to gather data, was viewed as dangerously close to preemptive combat."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Due to his unauthorized, though militarily successful, conduct in the Vagaari pirate operations, Chiss Senior Captain Mitth'raw'nuruodo had the protocols concerning pre-emptive strikes specifically detailed to him afterwards."}, {"tag": "p", "text": "The forces of General Yiv the Benevolent's Nikardun Destiny sought to exploit the laws against preemptive strikes by conquering or otherwise subjugating several civilizations on the borders of Chiss territory. Yiv planned to encircle the Chiss, who would not be allowed to strike until it was too late. However, Yiv's plot was uncovered by Senior Captain Mitth'raw'nuruodo of the Chiss Expansionary Defense Fleet's Picket Force Six, who managed to prove the threat posed by the Nikardun and defeat them above Primea. In the process, Thrawn captured Yiv for the Ascendancy."}, {"tag": "p", "text": "During the raid on Rapacc, Thrawn was attacked by Nikardun blockade forces, and then captured a Nikardun blockade frigate and brought it back to the Ascendancy for structural and technological investigation. Supreme General Ba'kif told Thrawn that certain members of the Syndicure would see Thrawn's actions as violating the preemptive strike laws, and that it would be easier if Thrawn had just destroyed the captured vessel. (Indeed, Syndic Thurfian asserted that the ship's capture was illegal.) Ba'kif mused that some Aristocra may even demand that Thrawn return the warship to the Nikardun. Thrawn could not do so as the entire crew of the vessel committed mass suicide minutes before Chiss boarding parties boarded; leading Ba'kif to pronounce the frigate's capture as a \"gray area\" until the Syndicure decided to write the specifics into law."}, {"tag": "p", "text": "Following Yiv's capture and interrogation, he revealed the locations of the scattered remnants of his forces. The Ascendancy's ruling Syndicure, by then fully convinced of the danger posed by the Nikardun Destiny, allowed the Chiss Defense Force to bend the non-aggression policy to hunt the remnants down."}, {"tag": "p", "text": "During the Imperial Era, Imperial Navy forces discovered an exiled Chiss man named Mitth'raw'nuruodo on an uncharted world. Thrawn explained that he had been exiled for conducting preemptive strikes against a known threat to the Chiss Ascendancy, thereby violating the policy."}, {"tag": "p", "text": "Years later, Thrawn revealed to select trusted individuals of the Galactic Empire that he was not exiled. Instead, it was a ruse allowing him to get close enough to the nascent Empire to learn about it and whether it could serve as a suitable ally for the Chiss Ascendancy against the Grysk Hegemony. Thrawn had never expected to be made an Imperial Navy officer; let alone to be taken directly to the Emperor. However, the Emperor sought the Chiss's knowledge of his native Unknown Regions for his own purposes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The preemptive-strike laws were first mentioned in the relaunched canon in the 2017 novel Thrawn by Timothy Zahn. Details of the laws were first provided in the 2020 novel Thrawn Ascendancy: Chaos Rising. Though they were mentioned in numerous canonical sources, they were first definitively identified as “preemptive-strike laws” in the 2021 novel Thrawn Ascendancy: Greater Good. Even so, the policy against aggression has not been referred to with the same direct terminology on more than one occasion."}, {"tag": "p", "text": "In the Star Wars Legends continuity, the Chiss policy against first strikes was first mentioned  as a law in the novel Vision of the Future, written by Timothy Zahn and published in 1998 by Bantam Spectra. The law has a similar precedent in real-world political theory called the non-aggression principle, a fundamental axiom in individualist philosophy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}