{"url": "Prelude_to_Endor", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Galactic Civil War campaigns"], "nodes": [{"tag": "h1", "text": "Prelude to Endor"}, {"tag": "p", "text": "The Prelude to Endor was a mission prior to the Battle of Endor. During this campaign, Darth Vader captured Bothan spies associated with the theft of information concerning plans for the new Death Star aboard the Bulk freighter Suprosa."}, {"tag": "p", "text": "During the first phase of the campaign, Bothan prisoners were delivered to Lord Vader with the Dreadnought Dargon. The Rebels made several attempts to disable the ship and free the prisoners aboard it, all of them unsuccessful due to the intervention of Imperial ace pilot Maarek Stele. Eventually, the Bothans were delivered to Vader's Star Destroyer Garrett and interrogated."}, {"tag": "p", "text": "With the information extracted from the prisoners, the Garrett 's forces moved to capture more Bothans involved in the capture of the Freighter Suprosa. A number of Bothan Muurian Transports were disabled and captured at Bothawui along with a shuttle carrying a high-ranking officer. New intelligence data led the Imperial forces to attack and capture the Bothan base at Kothlis, where Stele inspected the Corvette Timoth 4, which was carrying decoding equipment, confirming the Secret Order's suspicion that the Bothans were trying to crack the supercomputer that was located aboard the Suprosa."}, {"tag": "p", "text": "Following this operation, the Garrett's forces assaulted a rendezvous, where the Bothan Dreadnought Doomer was destroyed and the Rebel Calamari Cruiser Knights - captured. The Rebel Nebulon-B2 frigate Tarken arrived to intervene, only to be captured as well."}, {"tag": "p", "text": "After this victory, the Secret Order's liaison informed Maarek Stele of the truth behind the Death Star's stolen plans - they were meant to convince the Rebels that the second Death Star was not yet operational, even though it actually was. This was a major plan to lure the Rebel Alliance to its final demise at Endor."}, {"tag": "p", "text": "Stele was then sent on a reconnaissance mission to determine if there is a major gathering of Rebel starships in the Delfii system. He inspected numerous ships, including the Calamari Cruiser Lutdze, which had Admiral Ackbar onboard. He was also given a task from the Secret Order to destroy an Escort Shuttle, carrying a computer specialists who had doubts about the veracity of the information about the Death Star's operational status."}, {"tag": "p", "text": "As a final preparation measure before the Battle of Endor, Maarek Stele was tasked with delaying the Rebel fleet by destroying a number of the their starships, as well as a squadron of starfighters."}, {"tag": "p", "text": "Stele was awarded the Medal of Guile for his participation in the campaign. Lord Vader personally informed the Emperor that all preparations had been made and the trap was set to be sprung the moment the Rebels showed up at Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}