{"url": "Preybird-class_starfighter", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Imperial starfighter classes", "Category:Preybird-class starfighters", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Preybird-class starfighter"}, {"tag": "p", "text": "The SoroSuub Preybird-class starfighter was a model of heavy starfighter."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It was a capable starfighter for both offensive and defensive purposes, with a heavy laser cannon on each wing, and fore and aft concussion missile launchers. It was perhaps best known for the fact that it never entered full production. The Preybird was also one of the first craft to utilize an automatic gun harmonization system. This helped compensate for the wide stance of the laser cannons and allowed pilots to more accurately fire upon targets."}, {"tag": "p", "text": "The Preybird was in most respects a competent snubfighter, with a heavily-armored hull and respectable speed, but significantly less maneuverable than a TIE/LN starfighter or a standard T-65 X-wing starfighter. However, its large size and intimidating, raptor–like appearance could make the Preybird appear more powerful than it really was: a tactic often employed by the smuggler Mazzic was to surprise a ship with his Preybirds, and invite the captain to surrender. Faced with aggressive, unfamiliar fighters, they often did just that."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Preybird was designed a few years before the Battle of Endor, intended primarily for sale as an escort fighter on the open market, rather than for use in Sullust's own defense forces. However, disputes over the weapons systems led to substantial cost overruns, and ultimately to the project's discontinuation: only a few production ships made it off the assembly lines. Most of these found their way into the hands of a pirate organization in the Outer Rim known as the Hurrim. Their fighter squadrons were composed exclusively of these rare ships, indicating they probably had some connections to SoroSuub."}, {"tag": "h3", "text": "Raptor and Skyclaw"}, {"tag": "p", "text": "For the next twenty years, the Preybird remained one of the rarest starfighters in the galaxy, with the best-known examples of the few in operation being a pair which had fallen into the hands of the smuggler Mazzic."}, {"tag": "p", "text": "Mazzic had managed to inspect the prototype during production, and was immediately taken by the aggressive elegance of the design, so when the production run was canceled, he managed to acquire two of the production ships well below their production cost—perhaps through the agency of his Mistryl bodyguard Shada D'ukal."}, {"tag": "p", "text": "Mazzic steadily upgraded these two fighters over the years, naming them Raptor and Skyclaw, and decorated their hulls with distinctive raptor designs—red for one ship, blue for the other. They served as supporting muscle for him in high-risk situations, notably at Hijarna in 9 ABY, when they destroyed the fleeing Niles Ferrier and his ship."}, {"tag": "p", "text": "Other fringe groups possessing small quantities of Preybirds included the Tarnished Blades, a pirate force operating in the Ringali Shell."}, {"tag": "h3", "text": "Imperial deployment"}, {"tag": "p", "text": "Late in the Galactic Civil War, the Preybird found a bizarre, belated fame as a front-line fighter, when Imperial Remnant began using them to supplement its attrited TIE fighter forces. In itself, there was nothing truly untoward or unprecedented in the Navy sourcing its starfighters outside Imperial Space: Sienar Fleet Systems, the Empire's primary starfighter supplier, had been officially a neutral third-party for many years."}, {"tag": "p", "text": "The move was seen as an indication of the weakening Imperial position, a sign that the regime could not devote sufficient resources to starfighter construction, and the sense of decline was compounded by the uncertainty over where the Preybirds were coming from. SoroSuub had been among the first major industrial conglomerates to declare for the New Republic fifteen years earlier."}, {"tag": "p", "text": "In fact, the Preybirds had been sourced as part of a corrupt scam through Moff Vilim Disra and the banker Lord Graemon, constructed illegally on secret production-lines under the control of the Cavrilhu Pirates. The entire scandal was exposed in 19 ABY, and while Preybirds would not have disappeared overnight, it is unclear how long the design remained in service with the Remnant. Few, if any, were seen in action during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Several differing depictions of the Preybird have appeared in canon, of which the best-known is probably the picture on the back cover of the novel Specter of the Past. This is an adaptation of an illustration showing Mazzic's Raptor and Skyclaw in The Last Command Sourcebook, complete with their distinctive bird-of-prey motifs; a variation of the same design has also appeared in the computer game Star Wars: X-Wing Alliance."}, {"tag": "p", "text": "Star Wars Gamer has a very different image, as shown on the left here. This is not the only case where a Gamer illustration creates a minor continuity contradiction: the illustrations of No Luck Required and the Nssis-class Clawcraft differ somewhat from the appearance of those ships as previously established in text sources. Lastly, mention must be made of the two ships which appear as Mazzic's escorts at Hijarna in the comic-book adaptation of The Last Command: although not identified explicitly as Preybirds, comparison with the novel would imply that they were Raptor and Skyclaw; but not only do they differ in appearance from the other versions of the Preybird—they also differ markedly from each other."}, {"tag": "p", "text": "It appears that the difference in appearances from Star Wars Gamer image and The Last Command Sourcebook was retconned in The Unknown Regions. It states that the Drexl-class starfighter was an early prototype that was later developed into the Preybird."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}