{"url": "Preying_makthier", "categories": ["Category:Legends articles", "Category:Creatures of Makthierse", "Category:Creatures of unspecified biology", "Category:Flying creatures", "Category:Predatory creatures", "Category:Species of undefined sentience", "Category:Subterranean creatures", "Category:Venomous and poisonous creatures"], "nodes": [{"tag": "h1", "text": "Preying makthier"}, {"tag": "p", "text": "Preying makthiers were flying predators which lived in the crystal caves of Makthierse. These creatures looked like insect larvae with leathery, bat-like wings. Their mouths had two long, thin mandibles, while their tails had a paralyzing stinger. Having evolved to live deep inside caves, they were completely sightless, navigating and seeking prey through sonar."}, {"tag": "p", "text": "Preying makthiers had a bizarre, almost comical appearance, but their voracious appetites made them fearsome predators. Though they primarily ate small, cave-dwelling rodents, groups of up to ten would swarm unwary humanoids who blundered into their lairs, and sometimes even range outside their cave homes to search for larger prey. A preying makthier could eat twice its own body mass in a single feeding. Colonists on Makthierse tried to avoid settling near preying makthiers, in order to save themselves and their domestic animals from harm. Unfortunately, the crystal caves of Makthierse honeycombed the entire northern continent, and were incompletely mapped. Two colonists, Sirloss and Tovi Brill, only learned that their ranch was in makthier country when their three-hundred-kilogram lacas were carried off."}, {"tag": "p", "text": "Preying makthiers attacked their prey first with the stingers in their tails, which contained a poison which could easily stun an adult Human. The stunned prey would be wrapped up in the makthier's flexible tail, causing further injury as the coils were tightened. Even a conscious victim would have difficulty escaping, due to the numerous tail suckers which improved the makthier's grip. Although a victim who managed to escape would not be permanently incapacitated by makthier venom, some Humans reported a terrible headache when the venom wore off."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}