{"url": "Princess_Latara", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "Princess Latara"}, {"tag": "p", "text": "\"Princess Latara\" is the fourth episode of the second season of Ewoks. Written by Paul Dini and directed by Dale Schott, the episode originally aired on ABC on September 20, 1986."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Finding a princess"}, {"tag": "p", "text": "The Queen of the Gorphs Slugga determines that her son Prince Vork must marry a princess, preferably one of breeding and wealth. Slugga orders the Gorphs to bring the candidates. The first candidate is the princess of the Mudgub tribe. Vork likes her but his mother believes the Mudgub princess is too common and orders that she be thrown into the pit. The princess tries to flee but is thrown by a guard into a pit."}, {"tag": "p", "text": "The second candidate is the princess of the Titterbugs, who giggles. Vork likes her but the Queen thinks she is not good enough. The guard throws her into the pit as well. Vork begins to be nervous but his mother tells him not to worry. She decides to get a princess from the Ewok tribe and sends two of her guards to fetch one."}, {"tag": "h3", "text": "Princess for a day"}, {"tag": "p", "text": "At Bright Tree Village, Latara is hanging a sheet on the line. However, she is disturbed by her younger brother and sister Wiley and Nippet, who pull the sheet. Latara tells them to go away, prompting them to let go. However, she is entangled in the sheet and lands in a large tub of soapy water."}, {"tag": "p", "text": "Her friend Kneesaa, who is riding her bordok Baga, visits her. Latara grumbles about her chores and wishes that she was a princess like Kneesaa. Kneesaa says that she does chores and that training to lead the tribe is a big responsibility. Latara says that is not the same and wishes she was a princess for one day. Kneesaa decides to allow Latara to be a princess for a day while whispering in Baga's ear that it is not as easy as it looks. The bordok agree."}, {"tag": "p", "text": "Later, Latara emerges from a hut dressed as a princess. Wicket thinks this is the worst idea but Kneesaa tells him to go along by promising to give her pearl of patience in return for his belt of honor. Pretending to be a princess, Latara tells her peasants to saddle her mount for a tour of her royal domain. Wicket is insulted at being called a peasant but Kneesa reminds him of his promise."}, {"tag": "p", "text": "Wicket mounts a saddle on Baga and Latara orders the bordok to move forward. However, Baga does not recognize her authority, prompting Latara to bribe him with a blumfruit tart. Baga then races through Bright Tree Village, descending down a gangway and avoiding several Ewoks. Baga races to a well prompting Latara to order him to stop. The bordok comes to a sudden halt, causing Latara to fall into the well."}, {"tag": "p", "text": "Teebo helps her out of the well but Wicket laughs at her. Latara insists on taking a tour of her domain and demands that her friends accompany here. Teebo and Wicket carry Latara on a sedan chair through the forest outside Bright Tree Village. Wicket grumbles but Kneesaa encourages him to obey by reminding him about the pearl of patience."}, {"tag": "p", "text": "The Ewoks are spied upon by two Gorphs, who believe that Latara is a princess and will please Queen Slugga. Later, Latara forces Wicket and Teebo to carry her through a stream on a sedan chair. Latara then tells them to take her back. Wicket has had enough and abandons the sedan chair, saying that Kneesaa can keep her pearl of patience. Wicket tells Latara that he only takes orders from her as a favor to Kneesaa. Teebo says that Kneesaa didn't have to bribe him and that he still likes her no matter how nasty she is."}, {"tag": "h3", "text": "The wedding and escape"}, {"tag": "p", "text": "Latara is upset by their words and runs of crying into the swamp. Latara resolves to be a princess but is soon captured by the two Gorphs. They decide to bring her to Queen Slugga. Latara cries for help as she is dragged into the Gorph throneroom, which lies in a grotto. The Queen believes that Latara will be a suitable bride for her son Vork. Slugga hopes to unite their two tribes with her as ruler."}, {"tag": "p", "text": "Vork says he likes Latara but she doesn't want to marry him. Latara tells the Queen that she is a common peasant and not a princess at all. Latara attempts to leave but is caught by the Queen's tongue. The Queen wants to throw her into the pit. Latara claims that her dad is the Chief and is happy to get new blood into the tribe. Queen Slugga decides that the wedding will take place immediately."}, {"tag": "p", "text": "Meanwhile, Kneesaa finds a piece of Latara's cape while Wicket finds a series of tracks leading to a grotto. Kneesaa, Wicket and Teebo head inside the grotto and slide down a tunnel which leads to the Gorphs' domain. They avoid two sentries, who head back to the wedding. The Ewoks are curious about the wedding and follow the trail of the guards."}, {"tag": "p", "text": "Latara tries to stall the wedding by claiming that she is too young to get married and says that she has always believed in long engagements. Her friends watch the wedding ceremony. Wicket proposes that Kneesaa and Teebo distract them while he goes down and rescue Latara. However, his friends are quickly captured by the guards. Wicket improvises and they break free of the guards."}, {"tag": "p", "text": "While Latara tries to resist Vork's kiss, Kneesaa calls up to her friend. Latara helps her up from the basin. Queen Slugga spots the Ewok intruders and orders her guards to chase them. Wicket leads them out but Latara and Teebo bump into a large critter. Wicket leads the other Ewoks through a series of tunnels to a muddy ramp, which is too slippery. The Queen catches up on them but Wicket hurls Latara's crown, causing her to slip and cartwheel into her guards back into the throne room. They fall down the pit. Vork asks his mother if the wedding his off."}, {"tag": "p", "text": "Meanwhile, the other Ewoks reach the surface. Latara apologizes for being selfish and spoiled. From tomorrow, she decides to leave all the princess business to her friend Kneesaa. Kneesaa reassures Wicket that she will come right. However, Latara tries to make her friends carry her back to the village. However, they refuse."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "While Latara is riding Baga, part of the scene shows the young Ewok with four toes on each foot, in contrast with the remaining frames. In Star Wars Legends, the Ewoks have only three toes on each foot."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}