{"url": "Princess_Leia%27s_Theme", "categories": ["Category:Real-world articles", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "Princess Leia's Theme"}, {"tag": "p", "text": "\"Princess Leia's Theme\" is the musical leitmotif in the Star Wars saga that represents Princess Leia Organa. The piece is composed by John Williams, and opens on an interval of a major sixth, which becomes significant in the prequel trilogy, when the love theme for Anakin Skywalker and Padmé Amidala, \"Across the Stars,\" in contrast begins on an interval of a minor sixth."}, {"tag": "p", "text": "The theme's first appearance is in A New Hope. It is first heard when Princess Leia is captured by Darth Vader. Later, it plays as R2-D2 plays her holographic message to Obi-Wan Kenobi. It is also heard very fully as Leia nostalgically remembers the innocent past. Strangely the theme plays when Obi-Wan Kenobi is killed by Darth Vader, even though Leia is not directly involved in this event. Finally, it plays in the end credits of A New Hope."}, {"tag": "p", "text": "In The Empire Strikes Back, the theme is again present and is also developed in the new theme \"Han Solo and the Princess,\" which acts as the film's love theme. \"Princess Leia's Theme\" plays as Han Solo tells Leia that he must leave to settle his debt with Jabba the Hutt. The only other time it plays is at the end of the movie, when Leia and Lando Calrissian rescue Luke Skywalker from Bespin's Cloud City, and Leia and Luke are reunited."}, {"tag": "p", "text": "In Return of the Jedi, the theme is heard first as Obi-Wan and Luke discuss her while on the planet Dagobah, shortly after Yoda's death. Later, it is heard as Leia shoots a stormtrooper on the Sanctuary Moon of Endor and when she reveals her relationship with Luke to Han at the end."}, {"tag": "p", "text": "The theme was revived for the prequel trilogy. Its first occurrence in a sequential viewing of George Lucas's revised Star Wars saga is in Revenge of the Sith when Bail Organa, talking with Obi-Wan Kenobi and Yoda, says that he and his wife will adopt Leia. It is next heard during the final montage of shots at the end of the film as her adoptive parents, Bail and Breha Organa, hold the newborn Leia. It reappears soon after during the end credits of the movie."}, {"tag": "p", "text": "In the episode \"Assassin\" from the TV series Star Wars: The Clone Wars, the theme plays when Padmé and Ahsoka land on Alderaan."}, {"tag": "p", "text": "\"Princess Leia's Theme\" may have had an in-universe appearance in the MMORPG Star Wars Galaxies, where the Princess Leia Statuette is described to play the Princess Leia Theme when it was approached within 12 meters."}, {"tag": "p", "text": "In The Force Awakens, the theme appears several times when General Leia appears onscreen, including her reveal and reunion with Han. It is included in the track \"Han and Leia.\""}, {"tag": "p", "text": "The first four notes of the theme play in Rogue One: A Star Wars Story as an oblique reference to Leia during a conversation about the character between Bail Organa and Mon Mothma. The statement transitions out of a rendition of The Force Theme as Bail speaks indirectly about Leia."}, {"tag": "p", "text": "In The Last Jedi, the theme plays when Leia uses the Force to propel herself towards the Raddus after being exposed to the vacuum of space during the attack on the Resistance fleet."}, {"tag": "p", "text": "In The Rise of Skywalker, the theme is present during the funeral of Leia."}, {"tag": "p", "text": "Kasan Moor's Theme may have developed from this theme, as it sounds similar."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Canon"}, {"tag": "h3", "text": "Legends"}]}