{"url": "Princess_Leia,_Imperial_Servant", "categories": ["Category:Real-world articles", "Category:Los Angeles Times comic strips"], "nodes": [{"tag": "h1", "text": "Princess Leia, Imperial Servant"}, {"tag": "p", "text": "Princess Leia, Imperial Servant is a comic strip that was distributed by the Los Angeles Times Syndicate and published in U.S. and Canadian newspapers. This story was written by Russ Helm and drawn by Russ Manning. It was collected in Classic Star Wars: The Early Adventures 5, and was also available in the Webstrips section of Hyperspace."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Princess Leia Organa and Hume are on a Rebel Alliance ship which is running out of fuel in space ruled by the Galactic Empire. Darth Vader, who is on an Imperial-class Star Destroyer nearby, sends out a TIE Fighter to investigate the ship. In order to protect Leia, Hume knocks her out, because she wouldn't leave him. Hume puts Leia in the Gossamer glider which is jettisoned from the ship. Hume then destroys his own ship."}, {"tag": "p", "text": "Leia lands on Phelarion near an Imperial harvesting operation. Leia disguises herself and follows the workers into an estate. Leia asks who runs the estate and is told it is Thalassa Tarkin. Thalassa summons Leia to be used as a diplomat in a conclave to attempt to increase efforts to destroy the Rebels. Leia then returns to the rest of the workers and while at the mess hall, sees workers Sparv and Bikum Calus planning an escape."}, {"tag": "p", "text": "Thalassa discovers that some harvested Megonite moss is missing, while Leia and the workers set up a plan to have Leia send a message out that night using a transponder. Thalassa talks to Vader, who accuses her of helping the Rebels. In her rage she destroys a vase and has Leia clean it up. Leia uses the transponder while Thalassa is away, but she is caught by Nardo. Thalassa starts asking all the workers who is stealing the Megonite, while Leia kills Nardo. She then uses the transponder and gets the message out, but is also overheard by Vader."}, {"tag": "p", "text": "Thalassa checks on her room after hearing a commotion and finds the dead body of Nardo, but she does not suspect a thing, because Nardo had a display of Megonite in the room. Sparv and Calus check on the Megonite while Leia is at the conclave. Leia tries to plan her escape, but Darth Vader enters. The workers are getting the Megonite ready, when a stormtrooper walks by the cave they are in. They defeat the trooper to keep him quiet after he finds Leia's glider."}, {"tag": "p", "text": "Vader and Thalassa investigate the glider while Leia comes along. Sparv and Calus find Leia and take her into the caves. They are spotted escaping and make their way more quickly through the caves. The stormtroopers following them catch up, but the workers and Leia take an elevator to the roof. The ship called by the message from the transponder makes its way to land on the roof and Leia and the workers get on the ship, which happens to be the Millennium Falcon piloted by Han Solo and Chewbacca. Once in the ship, they make their safe escape."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "External links"}]}