{"url": "Privateer/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Law enforcement occupations", "Category:Privateering", "Category:Privateers"], "nodes": [{"tag": "h1", "text": "Privateer"}, {"tag": "p", "text": "A privateer was a civilian ship or individual serving a governmental organization in a paramilitary role, or a member of its crew. Often basically legitimized pirates, privateers would operate under a government contract known as a letter of marque and reprisal, giving their captain authority to harass, seize and destroy the shipping of another organization—typically one that was considered an enemy in times of war."}, {"tag": "p", "text": "In the Galactic Civil War, the Rebel Alliance would hire a number of privateers to harass Imperial shipping, a policy supported particularly by Ral'Rai Muvunc of Ordnance and Supply. The Alliance was hesitant to use privateers, as they did not trust the mercenary nature of the groups. After some initial trials, Mon Mothma approved a procedure that allowed various Ministries to issue letters of marque with Executive approval. The relationship between the Alliance and privateers was considered to merely be one of employee and employer. The Imperials also utilized privateers, with Palpatine giving explicit permission for privateers to raid enemy shipping on his behalf, and the Imperial Military tolerated their actions in the Outer Rim so long as they did not directly interfere with the Imperials' activities."}, {"tag": "p", "text": "After the Battle of Endor, the use of privateers by the New Republic shrank considerably, reflecting the increased size and status of the fleet under Admiral Ackbar, who had always opposed their use. Many retired with their pardons and hoarded wealth, but some continued to raid shipping in the Outer Rim. Others joined the New Republic and continued operations against the Imperial Remnant. However, Imperial Moffs and warlords started issuing their own letters of marque, and during the crisis of the reborn Emperor, the New Republic once more made use of privateers. By 11 ABY, privateering sponsored by the New Republic, as well as by the Imperial Remnant, was nearly completely phased out."}, {"tag": "p", "text": "Privateers were common in the Hapes Cluster, where they seemed to serve the interests of political factions in the Hapes Consortium. Prince Isolder famously went undercover with the crew of Corellian pirate Grov Bricker to track down Harravan, the Hapan privateer who killed his brother, Kalen."}, {"tag": "p", "text": "Han Solo had once operated as a privateer, including a close encounter with Hapan naval forces on the edge of the Cluster."}, {"tag": "p", "text": "Other governments that issued letters of marque included the Allied Tion sector and the Centrality. Some corporations also sponsored privateer-like mercenaries, including TaggeCo, Santhe/Sienar Technologies, SoroSuub Corporation, the Corporate Sector Authority and the Mining Guild."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}