{"url": "Princess_Leia_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Princess Leia"], "nodes": [{"tag": "h1", "text": "Princess Leia 4"}, {"tag": "p", "text": "Princess Leia 4 is the fourth of five issues of the Marvel comic book series Star Wars: Princess Leia. The issue, written by Mark Waid with art by Terry Dodson, was released on June 3, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After escaping Imperial forces on Sullust, the Alderaan Enclave's Mellcrawler is docked with the Lord Junn. Evaan Verlaine and Nien Nunb embrace each other, with Verlaine telling the Sullustan that she is ferrying Princess Leia Organa around. When Verlaine asks about the cargo aboard the Mellcrawler, Nien Nunb tells her in Sullustese that it is not being sold to the Empire."}, {"tag": "p", "text": "Verlaine brings Nien Nunb to Princess Leia and shows off his cargo of blasters. To honor Nien Nunb for his role in leading the Alderaanian survivors off Sullust, Leia awards him the Chalcedony waves. However, the ceremony is interrupted when Jora Astane and another Alderaanian named Covis brings Tace, whom they accuse of spying for the Empire. Leia demands that Jora explain herself and orders that he remove her restraints and leave them. Leia's perceived ingratitude towards Jora for their services lets him and Covis to question her authority."}, {"tag": "p", "text": "In private, Princess Leia serves Tace tea but the musician declines on the grounds that she as a commoner should be serving the Princess. Princess Leia asks Tace who the calls were from. Leia swears to Tace that no harm would come to any innocent person if she tells the truth. Tace tells Princess Leia about her sister Tula."}, {"tag": "p", "text": "When Leia asks Tace where is Tula, Tace replies that she cannot get her sister to talk about herself. Tace explains that they talk about music and that Tula is interested in Leia's travels and ship. Leia realizes that those calls originated from an Imperial base and that the Empire attacked them on Sullust because they knew their location. Leia and Tace deduce that Tula is doing the Empire's bidding under duress. Leia quips how she envies Tace having a sibling."}, {"tag": "p", "text": "In the meeting room, Leia tells her subjects that she believes Tace is innocent and tells them about her plot to draw Tula out. Verlaine then raises the matter of Espirion where they have reunification talks. Verlaine is upset about the prospect of cancelling the Espirion mission until Leia asks Uwa Pareece about Espirion."}, {"tag": "p", "text": "Pareece tells her that Espirion is a heavily militarized planet that is open to refugees to the point of engineering micro-ecologies to support diverse lifeforms. She adds that Espirion is home to an Alderaanian diaspora community. Princess Leia tasks Pareece and Jora as serving as her emissaries to Espirion. Returning to her quarters, Princess Leia tells Tace about her plan to free her sister Tula from Imperial captivity. She tells her to act naturally and lie to her sister when she calls tonight."}, {"tag": "p", "text": "On Espirion, Pareece and Jora meet with the Espirion Consul Rill, who tells them that while Espirion would miss any member of its Alderaanian family, they would still allow them to choose their new home. The emissaries are soon greeted by the half-Alderaanian, half-Espirion Chief Beon Beonel. Beonel takes offense at Pareece's shock at his half alien features and Jora's contempt."}, {"tag": "p", "text": "While Pareece is apologetic, Jora expresses the xenophobic sentiment that she doesn't want to celebrate her people's dilution. Pareece tries to apologize but Chief Beonel refuses to have anything to do with his fellow Alderaanians. She orders Jora to apologize but she doesn't believe he has caused any offense."}, {"tag": "p", "text": "Back aboard the Lord Junn, Tace talks to her sister Tula via computer. Tace wants to know more about her sister's whereabouts but Tula apologizes for getting them into trouble. However, Tula's controller Commander Dreed realizes that the rebels have discovered their mole. He orders his stormtroopers to bring her to detention so that she can be disposed of. Dreed then taunts Tace about bringing the demise of her sister."}, {"tag": "p", "text": "When Tace blames herself, Princess Leia speaks to the commander. While a distraught Tace weeps, Leia strikes a deal to trade Tula's life for herself. Later, Verlaine objects to Leia's plan to trade her freedom for Tula's life. However, Leia says she had no choice because she had to show that she was willing to sacrifice herself for the least of the Alderaanians. Verlaine tries to talk Leia out of her plan to surrender herself but the Princess then tells Verlaine her true plan."}, {"tag": "p", "text": "As Leia proceeds on her mission to surrender herself, Covis tries to talk her out but Leia is adamant. Before leaving, she tells R2-D2 to take care of Verlaine and that she will see him on the other side. Overhearing her remarks, Leia's subjects believe she is planning to die."}, {"tag": "p", "text": "Back on Espirion, Pareece pleads with Consul Rill to seek Chief Beonel's help, emphasizing that their unpleasant first contact was a mistake. However, Consul Rill is unwilling to help. When Pareece suggests that they return to Leia and admit they failed, Pareece disagrees. Consul Rill remarks that if Princess Leia truly cared, she would have come to Espirion herself. In response, Pareece pleads with Rill to tell Beonel that Leia will come to visit Espirion personally."}, {"tag": "p", "text": "Believing that Leia is going to surrender herself into Imperial custody, a tearful Tace pleads with the Princess not to go but Leia tells her that she needs her own strength and purpose. Covis then informs her that they are approaching an Imperial Star Destroyer above the desert planet of Skaradosh."}, {"tag": "p", "text": "On Skaradosh, a jubilant Commander Dreed asks Princess Leia why the young woman Tace is so important. Leia counters that every Alderaanian is important. Leia then reiterates her demand that Tula and her people be allowed to pass safely once she has surrendered herself. Dreed responds that the ship is only here to ensure that she did not bring reinforcements."}, {"tag": "p", "text": "Above Espirion, the Lord Junn encounters a large armada of starships exiting hyperspace. Back on Skaradosh, Tula thanks Leia for her sacrifice. Commander Dreed takes Leia into custody, regarding her arrest as a triumphant historical moment. He believes that Leia is back in Imperial custody \"without a prayer of rescue.\""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}