{"url": "Prison/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Prisons"], "nodes": [{"tag": "h1", "text": "Prison"}, {"tag": "p", "text": "Prisons were installations primarily used for incarcerating individuals."}, {"tag": "h2", "text": "Types of prisons"}, {"tag": "p", "text": "Different prisons used various methods to contain individuals, either through locking them in a physical cage, or with the use of simple force field barriers or containment fields, such as those used by the Geonosians. Hutt palaces sometimes contained dungeons with barred cells. Some containment devices, such as Force cages, could also be modified to project electrical currents through the captured individuals as a form of torture."}, {"tag": "p", "text": "The Rakata were known to utilize an incarceration method called the mind prison, where the prisoner's mind would be stripped from his or her body and be locked away within the prison, presumably forever. According to one prisoner, the only means of escape was by transferring the imprisoned mind into the body of another who had inadvertently become trapped, although this required the consent of both involved."}, {"tag": "p", "text": "Entire planets were occasionally used as prisons. Planets such as Mytus VII, also known as Stars' End, was known as one of the most dreaded prison planets in the galaxy. Despayre was another prison planet used by the Galactic Empire, but was destroyed by the Death Star's superlaser as part of a test of its firepower."}, {"tag": "p", "text": "The Jedi Order also kept a secret prison to hold dangerous sometimes Force-sensitive beings."}, {"tag": "h2", "text": "Notable prisons"}, {"tag": "p", "text": "Belsavis prison was one of the oldest prisons in existence, a super-prison constructed by the Infinite Empire. It contained extremely ferocious prisoners, and was adapted for use by the Galactic Republic during the Great Galactic War. Unfortunately for the Republic, in the early years of the Cold War, the Sith Empire's Imperial Intelligence discovered its location and sent agents into the prison to liberate important Imperial prisoners, causing the planet to become a battleground."}, {"tag": "p", "text": "Desolation Alley was a notable prison on Oovo IV, which held a number of prisoners such as Meeko Ghintee and Bendix Fust. It was also used for podracing, which was virtually the only form of entertainment available to the prisoners. Jango Fett and Zam Wesell both attempted to recover Fust from the heavily guarded prison. It was during this successful escape attempt that Jango Fett procured the Firespray-class patrol ship that he later named the Slave I, after the loss of his original ship in the skirmish."}, {"tag": "p", "text": "During the waning days of the Galactic Republic, Coruscant housed criminals in the Republic Judiciary Central Detention Center located in Galactic City, not far from the Senate District."}, {"tag": "p", "text": "Possibly the most notable, however, is the prison camp on Kessel which was home to the galaxy's largest spice mining operation. Under Imperial rule, slave labor was extensively used in the mines. Kessel would hold many Rebels prisoners of war during the Galactic Civil War such as Wedge Antilles, who would be rescued by Rogue Squadron. The crime lord Tyber Zann was also incarcerated at Kessel for stealing a Sith holocron from the Empire and the Hutt Cartel. He would later escape thanks to Urai Fen creating a prison riot diversion."}, {"tag": "p", "text": "Ysanne Isard maintained a private prison in the belly of the her star cruiser Lusankya, from which Corran Horn escaped in 7 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}