{"url": "Princess_Leia_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Princess Leia", "Category:True Believers"], "nodes": [{"tag": "h1", "text": "Princess Leia 1"}, {"tag": "p", "text": "Princess Leia 1 is the first of five issues of the canon Marvel comic book mini-series Star Wars: Princess Leia. The issue, written by Mark Waid with art by Terry Dodson, was released on March 4, 2015 and was the highest-selling single comic book in March 2015."}, {"tag": "p", "text": "The issue begins during the award ceremony in the Rebel base on Yavin 4, picking up moments after Star Wars: Episode IV A New Hope left off. Princess Leia Organa grapples with her role in the Rebel Alliance after the destruction of Alderaan and partners with Evaan Verlaine, a fellow Alderaanian, to save the surviving Alderaanians from the Galactic Empire."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After the Rebel pilots returned from successfully destroying the Empire's greatest weapon, the Death Star, the personnel of the Yavin 4 honors newcomer heroes, Luke Skywalker, Han Solo and Chewbacca, by orchestrating a medal ceremony for them, with Princess Leia Organa handing them a Medal of Bravery. As the applauses end, General Jan Dodonna looks to Organa, silently letting her know the celebration is over, now being the time to reflect upon the lost. She starts by thanking the Rebels for their courage and sacrifice during the Battle of Yavin. She knows though, that their casualties were not small—Alderaan, an entire world had been destroyed, along with Bail Organa and Queen Breha. They were not only the princess' parents, however, as Bail had been a founding member of the Rebel Alliance. The Alderaanian asks the Rebels to take a moment of silence to honor them, and all those who had died when her homeworld was destroyed. She wishes for them, and all the other beings lost, to be remembered forever."}, {"tag": "p", "text": "General Dodonna takes over for Organa and states that this was not the proper time to mourn, though. The Empire knows their location, so now the Alliance's top priority is to evacuate Yavin 4. The Rebel fleet from throughout the galaxy are converging upon Yavin to assist in the evacuation, while others help in the effort of scouting for a new base location. With the ceremony over, the evacuation begins."}, {"tag": "p", "text": "Before Solo, Chewbacca and Skywalker depart, Organa jokingly tells the owners of Millennium Falcon that the Alliance could use the help of \"a hairy beast and his copilot.\" Solo retorts that Chewbacca is the copilot not him, but Organa leaves it at two words: \"I know.\" She greets Skywalker next, asking if he is staying with the Alliance. He insists he is not leaving any time soon, though he admits to feeling strange toward the princess. He feels that way because Organa had comforted him when he had lost his mentor, Obi-Wan Kenobi, and he wishes for her to have someone to comfort her for the loss of her homeworld and family. As Skywalker departs with R2-D2 and C-3PO, Organa notices a lone female in a flight suit]], paying respects to a statue of Organa's parents."}, {"tag": "p", "text": "Afterwards, Organa changes into a less luxurious outfit and goes to find Admiral Gial Ackbar to ask an audience with Dodonna. The Mon Calamari points her in the right direction after scolding several Rebel soldiers for their clumsiness. She approaches the General, who is currently searching for a location for the new base on a 3D holographic map. He greets her as Senator Organa, before remembering that, with the Imperial Senate disbanded and Alderaan destroyed, the princess was no longer a senator. She informs Dodonna that she yearns to take action, if only to scout for a new base location. But the General disagrees, telling her the best thing for her to do for the time being is to grieve her losses as the Empire had placed a 10,000,000 credit bounty on her just hours before. He states the princess will not leave Yavin \"under anything less than a full military escort\", and dismisses her."}, {"tag": "p", "text": "Defeated, Organa leaves and again briefly runs into Ackbar. As she moves on, she hears two Rebel pilots, including the female pilot she had noticed earlier, talking about her. Evaan Verlaine refers to Organa as the \"ice princess\", before Organa barges in and dismisses the other pilot. Verlaine bows to Organa, but she lets her know that formality is no longer required, only for her to ask the pilot why she had stayed behind earlier when the ceremony ended. Verlaine mutters a reply that Organa cannot hear, and the princess becomes frustrated. After coaxing Verlaine into revealing her past as a Royalist mentored directly by Queen Breha; she openly wonders why Verlaine respects the throne but not its keeper now. Verlaine lets her know she plans on preserving as much of Alderaan's culture as possible, before pledging herself to \"Queen Leia Organa of Alderaan\". Organa, however, disagrees in that she is no Queen; Verlaine tells her the Imperials are currently hunting down all surviving Alderaanians throughout the galaxy."}, {"tag": "p", "text": "Shortly thereafter, Leia enlists the help of R2-D2 and records a holographic message of herself apologizing to Dodonna for disobeying his orders and leaving. She then sends the message and a decoy hologram of the astromech droid to the General's quarters while he sleeps. Meanwhile, the trio make their escape at the dead of night in an elegant T-1 shuttle; their goal being to save all the remaining sons and daughters of Alderaan from the Empire. Just after departing Yavin 4, Organa insists that they both will be totally honest with each other. Verlaine agrees, yet tells Organa that leaving the Alliance's protection is ill-fated since Dodonna would put lives at risk to recover her. The princess dismisses her worry, and asks the small droid his opinion. R2-D2 types his response on a screen: \"I've got a bad feeling about this.\""}, {"tag": "p", "text": "The next moment, Verlaine notices that they are being pursued by two X-Wing starfighters piloted by Skywalker and Wedge Antilles, the only two survivors of Red Squadron during the Battle of Yavin. The two pilots order them to turn back, but Organa refuses. The fighters tries to box the T-1 in with a herding maneuver while Verlaine tries to outmaneuver the two of them. In the process, Verlaine recklessly collides with Antilles' X-wing, knocking off the shuttle's alluvial damper. As Organa accuses her pilot of deliberately sabotaging the mission because she disagreed with it, the two fighters back off, prompting Verlaine to hit the hyperdrive and escape the X-wings by jumping into hyperspace. Verlaine then explains to a confused Organa that the whole maneuver had been a rouse that she and R2 had cooked up. With her mind changed, Organa thanks Evaan for her magnificent work and asks her to get them to Naboo."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "On September 23, 2015, Marvel re-released Princess Leia 1 as part of its \"True Believers\" budget reprint program, which reprints popular comic titles for the suggested retail price of $1."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Star Wars: Princess Leia, Part I was the highest selling single comic book in March 2015."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}