{"url": "Prisoners", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Prisoners"}, {"tag": "p", "text": "\"Prisoners\" is the third episode of the Star Wars: The Clone Wars television series' fourth season. It aired on September 23, 2011 and concluded a three-part story arc that began with the previous episodes, \"Water War\" and \"Gungan Attack.\""}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"The Republic and Gungan forces have been captured by Riff Tamson and his Karkarodon enforcers. Now, it is up to Ahsoka and the young Prince Lee-Char to unite the fractured people of Mon Cala and drive out the Separatist invaders.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Anakin Skywalker, Padmé Amidala, Kit Fisto, and Representative Jar Jar Binks are brought before Riff Tamson, who imprisons them with droids and Mon Calamari eels and begins to question them about the whereabouts of Prince Lee-Char. AQ-series battle droids search far and wide, forcing Lee-Char and Ahsoka to keep on moving. In order to restore the peace between the Mon Calamari and the Quarren, the prince decides to free the prisoners, whose numbers would overpower their captors, and draw the Quarren back to their side. For this purpose, Lee-Char and Ahsoka Tano follow a column of prisoners to an underwater cave used as a prison camp, where Lee-Char addresses his people to restore their courage. But an aqua droid spots them and they are surrounded by the guards, but Lee-Char demands an audience with their commanders, which is granted."}, {"tag": "p", "text": "Meanwhile, Nossor Ri expresses his growing doubts about this war and the planned eradication of the prince to Count Dooku, and has to learn to his consternation that Tamson has brought his own troops to garrison the occupied city instead of allowing the Quarren to rebuild. Tamson returns to interrogate the prisoners and attempts to force them to talk by biting a tiny hole into Padmé's helmet, allowing her suit to fill up with water. But then he learns that Lee-Char has been apprehended and orders the droid troops to take him and Ahsoka to the Mon Calamari throne room, where he (as he gloats at a startled Ri) would receive the prince as the planet's new ruler, as per an agreement between himself and Dooku. However, Lee-Char denounces him face-to-face, boldly challenging Tamson's claim of leadership over both Mon Calamari and Quarren, and appeals to Nossor Ri's friendship with his late father and the tense but respectful relationship the Mon Calamari and Quarren had enjoyed under his rule. Spiteful, Tamson orders the prince to be publicly executed."}, {"tag": "p", "text": "As soon as Tamson and Ri have left, Anakin and Fisto remove the water from Padmé's helmet by forming an air pocket around it with the Force, and Jar Jar uses his mucus to seal the puncture, saving her from drowning. Shortly afterward, the prisoners are all taken to witness the prince's execution, but as the preparations are underway, Ri, who has finally had a change of heart, secretly communicates his people's support to Ackbar. At the critical moment Ri saves Lee-Char, and the Quarren, Mon Cala, Jedi, Gungans, and clones unite under the prince, engaging the Separatist droid forces in battle. Lee-Char prevents Tamson, who cruelly confesses to being the one who killed his father, from fleeing, engages him, and kills him with one of his own explosive knives. After restoring the peace, Lee-Char, now recognized by both Mon Calamari and Quarren, is crowned the new king."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "During Lee-Char's audience with Tamson, after the Karkarodon mocks him for believing that Nossor Ri will help him, Ahsoka's lightsabers are visible on her belt in the background even though she was disarmed upon her capture. The weapons are also visible when the Karkarodon soldiers begin shoving Ahsoka and Lee-Char towards the door as the prince shouts to Ri."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}