{"url": "Princess_Leia_-_An_Unexpected_Friend", "categories": ["Category:Real-world articles", "Category:Star Wars Galaxy of Adventures episodes"], "nodes": [{"tag": "h1", "text": "Princess Leia - An Unexpected Friend"}, {"tag": "p", "text": "\"Princess Leia - An Unexpected Friend\" is the twenty-fourth episode of Star Wars Galaxy of Adventures. It premiered on the StarWarsKids.com YouTube channel on April 19, 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The episode opens with a short of the second Death Star hovering over the Forest Moon of Endor before zooming down onto the forest. Princess Leia Organa is chasing a scout trooper on her stolen 74-Z speeder bike. However, the scout trooper manages to use his blaster pistol to damage her speeder bike's engines, causing her to crash and fall to the ground."}, {"tag": "p", "text": "The narrator explains that in a \"galaxy of adventures\" making new friends can make all the difference. Leia is woken up by the Ewok Wicket W. Warrick, who prods her with his spear. Leia tells Wicket to cut it out but Wicket waves his spear at her defensively. Leia smiles and reassures Wicket that she is not going to hurt him."}, {"tag": "p", "text": "Leia invites him to sit beside her on the log and tells him that maybe he could help her. Wicket accepts her gesture of friendship but then smells something approaching. He points his spear at the distance while Leia scans the horizon. The two are thrown off their feet by a blaster bolt. Leia is surprised from behind by a scout trooper who orders her to get up."}, {"tag": "p", "text": "Leia is about to surrender but Wicket attacks the scout trooper from behind. Leia helps Wicket to subdue him and shoots down the second scout trooper's speeder bike, which crashes into a tree. Leia then stops Wicket from beating the fallen scout trooper with his spear. She wants to find her rebel comrades but accepts Wicket's offer to bring her back to his village."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}