{"url": "Princess_Leia_5", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Princess Leia"], "nodes": [{"tag": "h1", "text": "Princess Leia 5"}, {"tag": "p", "text": "Princess Leia 5 is the fifth and final issue of the Marvel comic book miniseries Star Wars: Princess Leia. The comic, written by Mark Waid with art by Terry Dodson, was released on July 1, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the planet Espirion, Uwa Pareece and Jora Astane prepare to depart following their failed diplomatic mission. As they are heading to their ship, Pareece makes a second attempt to reach out to Chief Beon Beonel but he refuses to consider meeting Princess Leia Organa or hearing what she has to say. Jora tells Pareece that this is quite enough for one diplomatic mission."}, {"tag": "p", "text": "Back on the desert planet Skaradosh, Commander Dreed's stormtroopers handcuff Princess Leia when they hear the rumble of noise. However, Evaan Verlaine arrives aboard the Mellcrawler and ambushes the Imperials. Verlaine uses her blaster to kill Dreed and his stormtrooper escorts. The rebels then flee on the Mellcrawler with Tula, R2-D2, and Nien Nunb."}, {"tag": "p", "text": "In orbit, the crew of Commander Dreed's Star Destroyer learn that Commander Dreed is dead. Their homing beacon detects a starship escaping the atmosphere. Aboard the Mellcrawler, Tula demands to know where Princess Leia is taking her but the Princess chastises her for betraying her people. She adds that she only saved Tula because she made a vow to save every Alderaanian from the Empire. The rebels escape Dreed's Star Destroyer because Nien launches a decoy."}, {"tag": "p", "text": "Dreed's second-in-command Venk believes they have avenged their commander by destroying Leia's escaping ship. He then recalls that Dreed talked about the Alderaanian refugees gathering in orbit above Espirion. He decides to kill a few more only to learn some unexpected news from one of his comms officers."}, {"tag": "p", "text": "Verlaine realizes that the Imperial Star Destroyer is still following but that it is heading towards Espirion. Leia says the Imperials think they are dead and that they want to finish the other Alderaanians off. She instructs Verlaine to contact the Lord Junn when they are in range above Espirion. Leia says that they are fortunate that their caravan is small and nimble enough to get away from the Empire."}, {"tag": "p", "text": "Above Espirion, the Mellcrawler arrives to find themselves in the midst of Alderaanian ships. Leia tells R2-D2 to boost their signal so that she can contact the Lord Junn and ask where these new ships came from. A crew member of the Junn tells her that thousands of Alderaanian survivors have gotten word of her mission to unite their people and have gathered to joined them. Leia tells them to get ready for battle stations."}, {"tag": "p", "text": "After the Mellcrawler docks with the Lord Junn, Tula tries to greet her sister Tace, who has shaved her hair. Tace does not want to have anything to do with her sister, blaming her for giving their position away to the Empire."}, {"tag": "p", "text": "Princess Leia then meets with Pareece and Jora and tells them that she sent them to Espirion because the planet has starships powerful enough to combat Star Destroyers. To her dismay, Leia learns that their mission failed because the Alderaanians took offense at Jora's xenophobic remarks that they had intermingled with the natives. An enraged Leia orders Pareece and Jora to leave but tells Evaan to stay."}, {"tag": "p", "text": "In private, Leia admits ordering Pareece and Jora to leave so that she did not have to reprimand him for dooming them. Leia blames herself for going after Tula but decides to tackle the new problem herself. Verlaine reassures Leia that she had achieved a lot by uniting Alderaanian survivors, hustling supplies, and getting them through the Empire's attacks. She reassures Leia that she can tackle his problem."}, {"tag": "p", "text": "Leia gives a speech which is broadcast on hologram to the Alderaanian fleet and the people of Espirion. She tells the assembled Alderaanians that an Imperial Star Destroyer is heading their way within minutes and vows to fight even without the support of the Espirion fleet. As Leia speaks, the Imperial Star Destroyer arrives and the Alderaanian ships attack the Star Destroyer despite being outgunned, With R2-D2's help, Leia's speeh is beamed to Chief Beon Beonel, causing him to reconsider."}, {"tag": "p", "text": "Despite fighting valiantly, several Alderaanian starships are destroyed. However, Leia continues speaking that every Alderaanian life is precious. Tace and Tula reconcile and embrace each other. At that moment, the Espirion warship Espirion Multi attacks Dreed's Star Destroyer, destroying the ship."}, {"tag": "p", "text": "Following the battle, the Alderaanian survivors celebrate. When Leia asks Chief Beonel why he came to their aid, Beonel says her speech made him change his mind. Leia realizes that R2-D2 beamed the speech directly to him. When Pareece asks if Beonel is afraid that his actions would bring the Empire down upon Espirion, Beonel replies that the Empire would have to come at them with something bigger next time."}, {"tag": "p", "text": "After Verlaine asks where they will be going next, Leia tells her that she needs to return to the Rebellion. Leia reassures Verlaine that she will make a good leader. When Verlaine replies that they need their Princess, Leia tells her to get them to elect one but not to let Jora win. Before leaving, the two embrace each other."}, {"tag": "p", "text": "As Leia returns with R2-D2 to the Great Temple on Yavin 4, she reflects that Alderaanians answer rage with wisdom, fear with imagination, war with hope, and that each and everyone survives. While Leia again joins with Han Solo, Luke Skywalker, Chewbacca, and R2-D2 reunites with C-3PO, the Alderaanian diaspora including Chief Beonel, Pareece, and Jora elect Verlaine Princess in Leia's absence."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}