{"url": "Proclamation_of_the_New_Order", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Galactic Empire stubs", "Category:Changes of government", "Category:Galactic Republic laws and acts", "Category:Imperial laws and acts", "Category:Political documents and media", "Category:Speeches"], "nodes": [{"tag": "h1", "text": "Proclamation of the New Order"}, {"tag": "p", "text": "The proclamation of the New Order was the event that marked the founding of the Galactic Empire. At the end of the Clone Wars, during an emergency session of the Galactic Senate, Supreme Chancellor Sheev Palpatine—secretly Darth Sidious, the Dark Lord of the Sith—claimed that the Jedi Order had attempted to overthrow the government. The Jedi were declared enemies of the state, and Sidious transformed the Galactic Republic into the first Galactic Empire, with himself as absolute ruler. The proclamation was met with widespread support in the Senate and in public, though some—such as Senators Bail Organa and Padmé Amidala—quietly watched in disappointment. Empire Day was an annual holiday that marked the declaration of the New Order."}, {"tag": "h2", "text": "Partial text"}, {"tag": "h2", "text": "Reactions"}, {"tag": "p", "text": "The speech announcing the transition from the Galactic Republic into the Galactic Empire was received with majority support and without open dissent. Some senators were in support of it because it meant a chance at a time of peace after three years of war and the carnage that had occurred. Others, notably the senators who signed the Delegation of 2,000, personally disagreed with the speech, but did not speak out.[source?] During the speech, the Naboo senator, Padmé Amidala, mused that liberty had just died to \"thunderous applause.\""}, {"tag": "p", "text": "While the speech was going on, Jedi Masters Obi-Wan Kenobi and Yoda, who had survived Order 66, forcibly entered the occupied Jedi Temple to investigate the attack that had occurred there, taking advantage of Palpatine being publicly elsewhere."}, {"tag": "p", "text": "On the clone trooper homeworld of Kamino, Palpatine's speech was played live from Coruscant. The clones in Tipoca City attended a mandatory general assembly to listen to the Supreme Chancellor as he delivered an address on the state of the Republic. Additionally, a detachment of Coruscant Guard clone shock troopers and the members of Clone Force 99 attended the assembly, as did the city's Kaminoan administrators Prime Minister Lama Su, Taun We, and Doctor Nala Se. The clone troopers cheered as Palpatine announced that the Republic would be reformed into the Empire. News would soon spread throughout the clone ranks, however, that the New Order had plans to halt the cloning operation on Kamino; the Empire was interested in introducing service conscription to the Imperial Army, believing it was a cheaper alternative to cloning."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Proclamation of the New Order was created for the 2005 film Star Wars: Episode III Revenge of the Sith, the third and final installment of the Star Wars prequel trilogy."}, {"tag": "p", "text": "Back in 1981, during a conference transcript meeting for the 1983 film Star Wars: Episode VI Return of the Jedi, George Lucas discussed with Lawrence Kasdan the backstory of Anakin Skywalker's fall to the dark side and how the Emperor subverted the Galactic Senate. This ultimately materialized into what became the Proclamation of the New Order in the prequel trilogy."}, {"tag": "p", "text": "In the DVD commentary of Revenge of the Sith, George Lucas stated that the interwoven scenes of the Proclamation of the New Order and the mission to Mustafar was a homage to the christening and assassination sequence of the 1972 classic film The Godfather, directed by his friend Francis Ford Coppola."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}