{"url": "Profit_(Lucrehulk-class_battleship)", "categories": ["Category:Legends articles", "Category:Lucrehulk-class battleships", "Category:Pirate starships", "Category:Trade Federation starships"], "nodes": [{"tag": "h1", "text": "Profit (Lucrehulk-class battleship)"}, {"tag": "p", "text": "The Profit was a Lucrehulk-class battleship commanded by Dool Pundar. The Neimoidian captain absconded with his vessel during the Invasion of Naboo and was still using it at the time of the Clone Wars. It was abandoned after a Jedi crashed onboard."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Dool Pundar's Lucrehulk-class pirate ship was a modified freighter. It was equipped with a centersphere and two cargo arms. The vessel was circular, with the arms terminating in a crescent-shape. Three engines propelled the vessel through space. Like other vessels of its class manufactured by Hoersch-Kessel Drive, Inc., it was 3,170 meters in diameter. The battleship was equipped with escape pods and had turreted weapons on the top of the right arm. It had a force of B1-Series battle droids and approximately 100 Vulture droid starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Profit served in the Trade Federation Defense Fleet until the Blockade of Naboo, when it was highjacked by Pundar and several of his associates, who proceeded to space their shipmates using reprogrammed battle droids."}, {"tag": "p", "text": "Pundar became a pirate and used the Profit as his headquarters. Despite being hunted by both Republic and Trade Federation forces, the ship evaded capture and eventually amassed a small fleet of minor capital ships."}, {"tag": "p", "text": "Years later, during the Clone Wars, Pundar and his vessel captured a freighter, which belonged to Noggox the Hutt. Pundar mercifully let the crew depart while he and his Lucrehulk took off from the area. Pundar subsequently set up position in the Fondor Shipyards at the behest of Count Dooku, a former Jedi and now leader of the Confederacy of Independent Systems. Pundar planned on capturing Noggox's last freighter, which was carrying droid brains for the Galactic Republic. When it arrived, Pundar launched twelve of his Vulture starfighters to attack. The freighter had a Jedi escort, though, and Nuru Kungurama was able to pilot the freighter to a crash-landing in one of the Lucrehulk's cargo arms. A pirate informed Pundar of the infiltration, who ordered the crew to abandon ship. The pirate ship was then seized by the Fondor Space Patrol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lucrehulk-class pirate ship was first mentioned in a Wizards.com article for a bounty storyline, Dool Pundar: Pirate Lord. The ship later appeared in 2011's The Clone Wars: Strange Allies comic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}