{"url": "Auxi_Kray_Korbin", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic members", "Category:Females", "Category:New Republic bureaucrats", "Category:Togruta"], "nodes": [{"tag": "h1", "text": "Auxi Kray Korbin"}, {"tag": "p", "text": "Auxi Kray Korbin was a female Togruta who served as an advisor to Chancellor Mon Mothma in the months following the Battle of Endor and the beginning of the New Republic. Following the Battle of Naalol and the rebellion on Akiva, Auxi continued serving Chancellor Mothma as the New Republic consolidated more territory from the Galactic Empire and entered into peace talks with Grand Admiral Rae Sloane. In the lead-up to the Battle of Jakku, Auxi continued serving Chancellor Mothma and urged her to find a second advisor. Ultimately, this role was filled by the former Imperial loyalty officer Sinjir Rath Velus. Auxi was killed when Mothma's senatorial rival Tolwar Wartol planted a bomb in her Chandrilan office."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A new galactic order"}, {"tag": "p", "text": "Auxi Kray Korbin served as one of Chancellor Mon Mothma's advisors in the months following the Rebel Alliance's victory at the Battle of Endor. She frequently argued with her fellow advisor Hostis Ij. Following the Battle of Naalol, Auxi toured the planet Naalol with Chancellor Mon Mothma and Hostis Ij. While the Chancellor and Hostis were discussing the merits of war, Auxi reminded Mothma that they had to return to the New Republic capital Chandrila for the reconstituted Galactic Senate's opening ceremony."}, {"tag": "p", "text": "While walking, Auxi told Hostis that they were going to proceed with their plan to relinquish the Chancellor's emergency powers; a prerogative that had been derived from the former office of Supreme Chancellor. However, Hostis countered that it was not the right time due to the Galactic Civil War. Chancellor Mothma agreed with Auxi and announced her plan to relinquish the Chancellor's emergency powers in the near future since they had been used by the late Palpatine to seize power during the Clone Wars."}, {"tag": "p", "text": "When Hostis expressed dismay at the Chancellor's plans to demilitarize the New Republic Defense Force, Mothma informed her advisors that she would submit a vote at the Galactic Senate to reduce the New Republic's military presence by 90% once they were able to officially confirm an end to the Galactic Civil War. When Hostis warned that demilitarizing the New Republic would not bring peace to the galaxy, Auxi remarked that he would fit in well with the Empire. Before the two could argue, Chancellor Mothma intervened and reiterated that she would relinquish her emergency powers and submit a vote on the demilitarization of the New Republic. Auxi then accompanied Chancellor Mothma and Hostis back to Chandrila."}, {"tag": "h3", "text": "Civil servant"}, {"tag": "p", "text": "In 5 ABY, Auxi continued serving as one of Chancellor Mon Mothma's advisers alongside Hostis Ij. During a meeting, Auxi opposed Hostis' suggestion that they expand the New Republic military in order to obtain new lines of food, fuel, and other vital supplies. In response, Hostis urged the New Republic to undertake a recruitment effort in order to secure more supply lines."}, {"tag": "p", "text": "A month later, Auxi attended a state function called Liberation Day to celebrate the liberation of Rebel Alliance prisoners from Ashmead's Lock prison on the planet Kashyyyk. However, the Imperial Fleet Admiral Gallius Rax had implanted the prisoners with inorganic bio-chips. At Rax's command, the prisoners began attacking Chancellor Mothma and other officials and military personnel. During the chaos, Auxi helped the wounded Chancellor Mothma to her feet. Her colleague Hostis Ij perished during the attack."}, {"tag": "h3", "text": "Supporting Chancellor Mothma"}, {"tag": "p", "text": "In the months following the Attack on Chandrila, Auxi moderated a meeting of the Committee for Imperial Reallocation to discuss redistributing the resources of the Galactic Empire. After Chancellor Mothma indicated that she was feeling tired and distracted, Auxi stressed that the Chancellor had made herself clear and ordered an end to the meeting. She also instructed the senators to reconvene on Nakadia, the newly-designated capital of the New Republic. When the Hosnian Prime councilman Sondiv Sella delayed his departure to talk to Mothma, Auxi reiterated that the meeting was over but allowed the two to speak."}, {"tag": "p", "text": "After Sondiv had left, Auxi poured two mugs of Deychin tea. When Auxi offered to serve brandy, Mon declined the offer. The two women discussed Mothma's wranglings with Senators Ashmin Ek and Tolwar Wartol. Auxi counseled Chancellor Mothma to find a second adviser in order to replace her colleague Hostis. When Mothma asked about her Senate approval rate, Auxi revealed that the Chancellor had a 39% approval rating while her rival Wartol had a 61% approval rating. Despite her low ratings, Mothma vowed to continue as Chancellor."}, {"tag": "p", "text": "Auxi reassured the Chancellor that she was doing the right thing by reallocating the Empire's resources to repairing worlds afflicted by the Empire. Auxi added that Mothma had also managed to keep the New Republic military strong without making it look like she was trying to impose her will on the galaxy. When Auxi mentioned the liberation of Kashyyyk, Mothma explained that the situation was complicated because the Senate had opposed intervention but that her friend Princess Leia Organa had gotten involved. Auxi then tried to raise the matter of the resurgence of the crime syndicates. However, one of the Chancellor's protocol droids R-K77 informed Mothma that she had received an urgent transmission from Princess Leia."}, {"tag": "p", "text": "After Senator Wartol leaked news about the discover of Imperial forces on the planet Jakku to the media, Auxi remarked that chaos would ensue thanks to the senator from Orish. Chancellor Mothma instructed Auxi to contact HoloNet News so that she could issue a press statement. Auxi and Admiral Ackbar supported Chancellor Mothma when she delivered her address to the Galactic Senate urging the senators to pass a bill sending New Republic forces to Jakku. Following the reconvening of the Galactic Senate on Nakadia, Auxi complimented Chancellor Mothma for her second speech urging the Senate to send Republic forces to Jakku. Mothma managed to secure a majority after the former Imperial loyalty officer–turned New Republic operative Sinjir Rath Velus managed to convince five senators to vote in favor of Mothma's motion in return for receiving pardons. Auxi brought the good news to Chancellor Mothma."}, {"tag": "h3", "text": "Death on Chandrila"}, {"tag": "p", "text": "Following the second vote to send military forces to Jakku, Chancellor Mothma heeded Auxi's advice to appoint a second adviser. Mothma picked the former Imperial loyalty officer Sinjir Rath Velus due to his role in exposing the Black Sun and Red Key syndicates' plot to blackmail five senators into voting against intervention. However, Mothma and her allies incurred the wrath of her political opponent Senator Wartol, who had coerced the five senators into initially voting against Mothma's bill in the Senate. Seeking revenge, Wartol planted a remote-controlled bomb in Mothma's office on Chandrila."}, {"tag": "p", "text": "Sinjir and his boyfriend Conder Kyl caught Wartol redhanded but were unable to stop him from triggering the bomb. The bomb blew a hole in Mothma's office. However, Chancellor Mothma had departed from the office and left Auxi in her place. Auxi was killed in the service of Chancellor Mothma. Mothma was saddened by the passing of her friend but endeavored to continue as Chancellor in the wake of the New Republic's victory at the Battle of Jakku. Following the arrest of Senator Wartol, Auxi was succeeded by both Sinjir and Sondiv."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Auxi Kray Korbin was a female Togruta who served as a chief adviser to Chancellor Mon Mothma during the early days of the New Republic. She supported Mothma's proposal to abolish the emergency powers of the Chancellor's office and to demilitarize the New Republic military once the Empire had been defeated. Her anti-militarism put her at odds with the more hawkish Hostis Ij. Chancellor Mothma likened Auxi and Hostis to playing both the devil and angel, depending on the situation."}, {"tag": "p", "text": "Despite her ideological and philosophical differences with Hostis Ij, the two were friendly outside of work. Auxi was distraught by the death of Hostis Ij. Auxi's professionalism led her to urge Chancellor Mothma to appoint a second adviser who would be more cynical of the political system. Auxi also moderated meetings between the Chancellor and Senators. Auxi was well liked and respected by Chancellor Mothma, who was saddened by her death during a failed assassination attempt on Mothma's life."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Auxi Kray Korbin appears as a supporting character in Chuck Wendig's Star Wars: The Aftermath Trilogy, which ran between 2015 and 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}