{"url": "Procursator-class_Star_Destroyer", "categories": ["Category:Legends articles", "Category:Galactic Empire starship classes", "Category:New Republic starship classes", "Category:Star Destroyer classes"], "nodes": [{"tag": "h1", "text": "Procursator-class Star Destroyer"}, {"tag": "p", "text": "The Procursator-class Star Destroyer was an Imperial warship in the Star Destroyer design family."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "The Procursator-class was similar in appearance to the Imperial-class Star Destroyer. It was slightly shorter, at 1200 meters in length."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "The class was armed with three prominent axial gun batteries, and eleven other smaller guns across the ship."}, {"tag": "h3", "text": "Propulsion"}, {"tag": "p", "text": "The Procursator-class was built with a reactor dome that jutted out on the ventral side of the vessel and covered with protective armor, similar to other Imperial warships. The design was propelled by three thrusters."}, {"tag": "h3", "text": "Bridge tower"}, {"tag": "p", "text": "The T-shaped bridge tower was similar to the command tower on other Imperial Star Destroyer designs, like the Imperial-class. Much like the T-shaped tower on the contemporary Victory-class, it was smaller in scale than the modular KDY tower on the Imperial."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The class was in service by 3 ABY, when Captain Firmus Piett and Admiral Kendal Ozzel observed three Procursator-class Star Destroyers that were part of a high-mobility fleet. This fleet rendezvoused with Death Squadron at some point prior to the Battle of Hoth. At another point, a ship of this class underwent repairs and refurbishment."}, {"tag": "p", "text": "Years later, during the reign of the New Republic, one of these Star Destroyers was seen in formation with a Bellator-class dreadnought and several Imperial-class Star Destroyers with Republic markings."}, {"tag": "p", "text": "During the rise of the Dark Empire, two Procursators escorted the Allegiance at the Battle of Calamari in 10 ABY. The three ships were assaulted by a New Republic task force and destroyed. Around the same time, at least one Procursator was seen flying alongside a Bellator-class dreadnought among the Byss Defense Fleet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This design originated as a fanon vessel made by Ansel Hsiao, based on a ship from Dark Empire 3, which was cataloged by Curtis Saxton as \"anonymous star destroyer #2\" on his fansite. The name chosen by the artist for its class is the Latin word for \"skirmisher/forward-runner\"."}, {"tag": "p", "text": "When approached by Lucas Licensing to provide artwork for The Essential Guide to Warfare, Hsiao submitted his own designs in addition to new models, along with their names. The names were recorded in LFL's Holocron continuity database, according to the artist, later confirmed by Warfare author, Jason Fry."}, {"tag": "p", "text": "According to Hsiao, the ship appeared not in one of his own pictures for the book, but was used in another artist's painting. He also designed it from spare parts left over from the Bellator-class dreadnought to see how quickly he could design and build a Star Destroyer. He completed the ship over a weekend, citing its design as being similar to a little \"War Emergency Programme-esque no-frills ship\"."}, {"tag": "p", "text": "The design can be seen in two paintings, both by Tommy Lee Edwards. The latter of which uses a picture from Hsiao's personal gallery as a background, where the ship appears, albeit blurred, as well as another ship of the same class being obscured slightly by a TIE Advance X1, as well as a third above an Imperial-class Star Destroyer, which itself is above and to the right of the aforementioned X1, although significantly farther away from the others. The Hsiao picture in question was named \"Strategic Reserve\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}