{"url": "Prod", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Non-canon Legends articles", "Category:Guards", "Category:Individuals of unidentified species", "Category:Individuals of unspecified gender", "Category:Officers", "Category:Torturers and interrogators"], "nodes": [{"tag": "h1", "text": "Prod"}, {"tag": "p", "text": "Prod was an institutional harassment professional and torturer from Sqra Castle on Newenurf. Growing up largely uneducated, Prod worked at several jobs of violent nature, including as a terroga trainer for a circus, a henchcreature for despot Hortentious Clee, and a cell block disciplinarian, as well as serving as Sergeant-at-Claws for the Special Loathsome Forces during the Megalomaniac Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born on Newenurf and a member of a species that could display a large cranium, Prod had little to no education, and the being's first notable job was as a terroga trainer for the Freklas Snarl Circus, where Prod invented the concept of Random Audience Death. Sometime later, Prod moved on to work as a cell block disciplinarian for Our Mistress of the Bad Boys Prison."}, {"tag": "p", "text": "Prod served as Sergeant-at-Claws in the Special Loathsome Forces during the Megalomaniac Wars. After the conflict, Prod saw employment as a henchcreature, or private guard, for tyrannical despot Hortentious Clee, torturing individuals with techniques such as air drowning, tooth removal, and dismemberment."}, {"tag": "p", "text": "Sometime after these professional experiences, an unemployed Prod, living in the Sqra Castle on Newenurf, looked for a job in the field of institutional harassment and torture, creating a comprehensive resume. According to the document, employer references could be available upon request."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Prod had a violent background, working mostly with torture and harassment. Prod's interests included mouth rocks, nubile feather serpents, and blood, according to a professional resume. Prod's set of self-professed skills included bludgeoning, stabbing, pinching, slapping, stomping, smacking, punching, jabbing, yelling, pounding, poking, crunching, squeezing, strangling, pulling, stretching, scraping, bruising, and burning."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Prod was introduced in a segment meant to look like a professional resume, written by Bob Carrau for the 1993 book Monsters and Aliens from George Lucas, a publication that combines creature designs and photographs from various projects of George Lucas, creator of the Star Wars franchise, with original text by Carrau. Lucasfilm employee Leland Chee, who maintains the Holocron continuity database, has indicated that information contained in the book is non-canonical. Prod's species and gender were not identified in the book."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}