{"url": "Project_Chubar", "categories": ["Category:Legends articles", "Category:Zsinj projects"], "nodes": [{"tag": "h1", "text": "Project Chubar"}, {"tag": "p", "text": "Project Chubar was a scientific program under the command of Warlord Zsinj."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The project was originally commissioned by Emperor Palpatine, who wanted Gamorrean agents with Humanlike self-control. It is unknown when Zsinj assumed control of the project, or whether the project was originally as far-reaching as it was when it was terminated."}, {"tag": "p", "text": "Named after Chubar, a character from a series of animated holoprograms for children, Project Chubar was intended to enhance the intelligence of nonhuman sentient or near-sapient beings with a variety of genetic, chemical, and behavioral techniques. These beings would then serve as agents for the organization which created them. Ironically, Garik Loran, one of the new Republic operatives to later expose the project, actually voiced Chubar in his childhood."}, {"tag": "p", "text": "Based at the Binring Biomedical Product facility on Saffalore, the project was led by Doctor Tuzin Gast, who was assisted by his niece Edda Gast. A facility on Xartun supplied transparisteel cells for the lab."}, {"tag": "p", "text": "In the case of near-sapient or less intelligent sapient lifeforms, the program increased their intellect to Human standards. In the case of species that were already intelligent, the program altered the quality and specialization of intelligence characteristics to be more in line with Human brains and sometimes endowed the subject with intellect beyond that of a Human."}, {"tag": "p", "text": "Subjects of the program included Bilars, Chadra-Fan, Ewoks, Gamorreans, Kowakian monkey-lizards, Ortolans, Ranats, Talz, and even Dianogas. Some of the subjects were Force-sensitive. One notable success of the program was known as Subject Gamma-9104, a Gamorrean who took the name Voort saBinring when his creator allowed him to escape. Other subjects included the Dark Jedi Gorc and Pic, who were further enhanced by Agent Blackhole's Sith alchemy."}, {"tag": "p", "text": "The project suffered a minor setback when Tuzin Gast committed suicide by causing an explosion in the lab's Epsilon Wing, but it continued on Saffalore under Edda Gast and Novin Bress. A secondary laboratory was located onboard Zsinj's flagship, Iron Fist. After Zsinj learned that New Republic pilot Voort saBinring was an escapee of the program, his escape enabled by Tuzin Gast and covered up by the explosion, he had the laboratories consolidated on Iron Fist and ordered Edda Gast to turn the Saffalore facility into a trap for Wraith Squadron."}, {"tag": "p", "text": "A large number of subjects were released by Gara Petothel, and they escaped aboard a Sentinel-class landing craft piloted by Kolot, an Ewok subject of Project Chubar. They may have accompanied Petothel to Corellia, but their fates remain unknown. Kolot at least seems to have been with Gara, since she wanted to show him to Myn Donos."}, {"tag": "p", "text": "Project Chubar served as the basis for Zsinj's chemical brainwashing program, Project Minefield. The program was presumably terminated along with the rest of Zsinj's projects when Iron Fist was destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}