{"url": "Project_Blackwing", "categories": ["Category:Canon articles", "Category:Imperial projects and operations", "Category:Weaponized plagues and viruses"], "nodes": [{"tag": "h1", "text": "Project Blackwing"}, {"tag": "p", "text": "Project Blackwing referred to the Galactic Empire's Imperial Military Department of Advanced Weapons Research project that oversaw unlocking immortality. The project resulted in the accidental creation of the Blackwing virus, also known as \"the Sickness,\" an infectious viral agent which was accidentally created while working on an experiment to revive necrotic tissue in a secret research facility located on Dandoran."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Project Blackwing was created by Sith scientists using science and Sith alchemy from the Galactic Empire's Imperial Military Department of Advanced Weapons Research division, it was initially designed to achieve immortality. The virus was accidentally created while working on an experiment to revive necrotic tissue, however, it killed its hosts instead, attacking their biological tissue and turning their lifeless bodies into cannibalistic, brutal zombies."}, {"tag": "p", "text": "The virus was then known as \"the Sickness\" or the Blackwing virus, and altered the body's stamina and strength, making its host move slower than they did prior to exposure but increased their resilience to physical damage, allowing victims to take punishment which would be more critical or possibly even fatal to the being of origin without falling. They also seemed to experience a change in skin texture, with human hosts' skin being altered to a grayish-green color. The virus communicated with itself and allowed the zombies to act as a single entity and to learn things from the survivors, including how to utilize blasters, operate turrets, and pilot starships."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 13 BBY, Project Blackwing was active, and to capitalize on rumors of the top secret project, Emperor Palpatine named the death troopers of Imperial Intelligence after the Undead Troopers of Project Blackwing, which were also referred to as Death Troopers."}, {"tag": "p", "text": "At some point between the Battle of Yavin and the Battle of Hoth, Imperial stormtroopers stationed at the secret research facility on Dandoran were infected by the virus, leading to their transformation into Undead Troopers. There was an outbreak at the facility, and the infected soldiers threatened to spread across the galaxy. The Undead Troopers would be supplemented by Heavy Undead Troopers and Scout Undead Troopers as the virus killed more and more Imperial troopers, eventually earning the name, \"Army of the Dead.\""}, {"tag": "p", "text": "Operations were undertaken by the Empire and the Rebel Alliance to combat the threat, and was contained. Rumors began cropping up soon after that surviving samples had been retrieved by criminal organizations, gangs, cartels, extremist, and other nondescript factions for trade or possible weaponization. The Rebel Alliance continued operations against the virus when a second outbreak occurred, although the outbreak was again contained."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Project Blackwing first appeared in Star Wars canon in Star Wars: Commander, a mobile strategy game released by Disney Interactive on August 21, 2014."}, {"tag": "p", "text": "The Blackwing virus originated in the 2009 Star Wars Legends novel Death Troopers, written by Joe Schreiber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}