{"url": "Project_32", "categories": ["Category:Legends articles", "Category:Republic Strategic Information Service operations"], "nodes": [{"tag": "h1", "text": "Project 32"}, {"tag": "p", "text": "Project 32 was an operation conducted by the Republic Strategic Information Service during the Great Galactic War, around 3660 BBY. Its exact purpose highly classified, the project resulted in births of twelve near-identical Human females - either clones or otherwise closely related - who were supplied with extremely high-tech facial implants, which allowed them to have instance access to HoloNet. For unknown reasons, one of the subjects called Mako ended up on the streets of Nar Shaddaa, where she eventually met a fellow cybernetically enhanced individual named Anuli, with no memory of Project 32. The Project presumed her dead for the next twenty years."}, {"tag": "p", "text": "By the time of the Galactic War in 3642 BBY another one of Project 32 subjects, Coral went rogue and began hunting and killing everyone involved in Project 32. SIS agent Carteri had an encounter with Mako, mistaking her for Coral; while agent Izak actively hunted Coral with the help of two other Project 32 subjects. Mako obtained Coral's holofrequency and called her, only for Coral to set her up into meeting with Izak on Dromund Kaas. An encounter in Kaas City safe house went wrong and Mako and her bounty hunter were forced to kill both girls and escape before Izak could arrive."}, {"tag": "p", "text": "Mako went digging deeper into Republic systems and found that of twelve birth certificates matching her DNA, ten now had death certificates, leaving her and Coral as the only survivors of the Project. She eventually contacted Izak directly, who notified her that SIS had tracked Coral on Nar Shaddaa and warned not to interwene. Mako and her companion went to Gudnem's Gadget Emporium regardless and confronted Coral, who called Mako a \"cheap copy\". Izak and his men arrived shortly after and took Coral into custody. Izak promised Mako to contact her later and explain everything, but never did."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Project 32 appears in Star Wars: The Old Republic during Mako companion storyline."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}