{"url": "Progga%27s_starship", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Pirate starships", "Category:Unidentified spacecraft"], "nodes": [{"tag": "h1", "text": "Progga's starship"}, {"tag": "p", "text": "Progga the Hutt, a crime lord and pirate, owned a starship by the year 27 BBY. He used the vessel to attempt to board the Bargain Hunter, a smuggler's ship, in that year to take its cargo. However, the Bargain Hunter led Progga and his ship on an extended chase, which left them in a star system in the Unknown Regions. There, both parties were confronted by Picket Force Two of the Chiss Ascendancy Expansionary Fleet, and Progga and his ship were destroyed after Progga engaged the newcomers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Progga's starship was equipped with laser cannons as armaments, and had a hyperdrive installed. The vessel was large enough to have cap drains and other measures to protect the vessel from electromagnetic pulses that were designed to knock out the ships' systems. The ship was crewed by multiple beings."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Progga, a minor Hutt crime lord and pirate, owned the starship by 27 BBY. That year, he attempted to hijack a cargo of firegems and furs that was being carried by the Bargain Hunter, a smuggling ship captained by Dubrak Qennto. Qennto was transporting the cargo to Drixo, a Hutt rival of Progga, on the planet of Comra. Although Progga's ship fired upon the Bargain Hunter with its armaments, the latter ship jumped to hyperspace, leaving Progga and his ship to pursue the smugglers. Progga and his vessel managed to follow the Baragain Hunter's course, and attacked them again once they came back to realspace. The Bargain Hunter's crew, realizing that they were still being chased, made another jump to hyperspace, and Progga had his ship's crew follow the smugglers' vector once more."}, {"tag": "p", "text": "Both starships traveled for four hours, and arrived in the Unknown Regions after passing through the regions of the Outer Rim Territories and Wild Space. Upon coming out of hyperspace, Progga had the starship go to the nearest star system after they tracked the Bargain Hunter there. Because the star system was in the middle of nowhere, the starship's captain thought that Qennto had a hidden smuggler's base there, though in fact the Bargain Hunter had arrived in the Unknown Regions and that particular system by accident after the crew had taken a blind hyperspace jump. However, as Progga commed the other ship and demanded to know where the base was, both ships were attacked with Conner nets, which released electromagnetic pulses."}, {"tag": "p", "text": "The Bargain Hunter's systems were knocked out, but since Progga's starship was designed to be able to resist these, it stayed operational. Progga had his starship's crew engage the attackers, who were elements of the Chiss Ascendancy Expansionary Fleet known as Picket Force Two, which was led by the cruiser Springhawk and its commander, Mitth'raw'nuruodo. Although Progga's starship managed to target the Springhawk with its fire, Progga and his ship were both destroyed after six minutes of combat with the larger Chiss force, leaving the ship's hull peeled open."}, {"tag": "h2", "text": "Commander's and crew"}, {"tag": "p", "text": "The captain of the vessel was Progga, who sometimes jumped to conclusions and acted rash, such as when he engaged the Chiss, who were much more heavily armed. This course of action led to the ship's destruction, and the deaths of the entire crew and Progga."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Progga's starship first appeared in 2006's Outbound Flight, by Timothy Zahn. The vessel was also later mentioned in Progga's entry in The Complete Star Wars Encyclopedia, released in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}