{"url": "Prophecy_of_the_Three", "categories": ["Category:Canon articles", "Category:Lasat culture", "Category:Prophecies"], "nodes": [{"tag": "h1", "text": "Prophecy of the Three"}, {"tag": "p", "text": "The Prophecy of the Three, also known as the Chronicles of the Three, was an ancient Lasat prophecy foretelling the rediscovery of the species' original homeworld, Lira San, after the loss of their Outer Rim colony world Lasan. As recounted by the mystic Chava the Wise, the prophecy centered around three individuals: the Child, the Warrior and the Fool. The Fool would lead the Warrior to hunt the Child, and only if the Child saved both the Warrior and the Fool would the future of the Lasat species be assured."}, {"tag": "p", "text": "According to Chava, there were two possible interpretations of the prophecy. The first was that the Child, Warrior and Fool were three separate individuals. Under this interpretation, Garazeb Orrelios, former captain of the Lasan High Honor Guard, was the Child, much to his irritation. The Child's role in the prophecy was to find Lira San, which Orrelios did by using his bo-rifle in the ancient manner to pinpoint the planet's location on a map, and guide the starship Ghost through a prophesied \"maze\" of collapsed stars that hindered access to the planet. Chava interpreted the Warrior's role, to hunt down the Child, as being filled by Imperial Security Bureau Agent Alexsandr Kallus, who had a long-standing enmity with Orrelios over his involvement in the Siege of Lasan, which Kallus had once claimed to have commanded in order to enrage Orrelios and make him easier to defeat. Kallus, determined to capture the Ghost crew, had followed them all the way to the star cluster in an attempt to do so. The identity of the Fool, however, remained unclear."}, {"tag": "p", "text": "Chava's other interpretation was that all three roles could be played by one person at different stages of their life. As she explained it, the Fool in someone's personality was unable to see potential futures, while someone's Child was filled with hope for the future, and it was up to the person's Warrior to make that future possible."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}