{"url": "Promised_Land", "categories": ["Category:Legends articles", "Category:Mythology", "Category:Taris locations"], "nodes": [{"tag": "h1", "text": "Promised Land"}, {"tag": "p", "text": "The \"Promised Land\" was a legendary underground city located in the lowest levels of Taris, beneath the Undercity and its sewers, as well as below the Lower City, Middle City and the Upper City. It was where the first Tarisians first discovered and settled on the planet, which was a millennium before the the planet became a major trade center, back when the world was still forest and oceans. It was governed by the Taris Civil Authority. It was before the Tarisian Civil War turned the portion of the planet's surface that was not covered by an urban sprawl into a wasteland. Once someone entered the colony, they were unable to exit, thus protecting the Promised Land's secret. According to Gendar, it would have taken weeks or even months to reach the entrance and the traveler had to cross many rakghoul infested areas."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Colonial Origins"}, {"tag": "p", "text": "Some time during the Manderon Period, a fleet of human ships from unknown origins colonized the planet and started to build a city underground in which according to Rukil would become the site of the Promised Land. By 5300 BBY the city was completed and the realm was governed by the Taris Civil Authority. As population spread, Transport Station 5 was constructed atop and around the original colony site, and another city was built on top of it which would become the Undercity which housed the sewers, then the Lower City and then the Middle City above that and finally the Upper City was constructed and the Promised Land was abandoned and was eventually lost and forgotten. After over a single century of prosperity, new and shorter trade routes were found and Taris became obsolete. By this point, the Promised Land had been rediscovered. A hundred years later, in the aftermath of the Tarisian Civil War the criminals were banished to the Undercity, the outcasts built a village, but suffered from starvation, rakghoul attacks, and rakghoul infections; all hope for them was lost save for the legendary Promised Land which by then its location had been forgotten."}, {"tag": "h3", "text": "Outcast Legends"}, {"tag": "p", "text": "The legends about the Promised Land were told from generation to generation between the Outcasts. They were still relatively popular in the time of the Jedi Civil War, although almost nobody believed in tales about a land where life conditions were much better than in the Tarisian Undercity. Still, Rukil, the oldest of the Outcasts as of 3956 BBY, believed he could retrieve the forgotten location of the Promised Land by assembling the journals of his dead father and grandfather. He also sent his apprentice, Malya, to seek the Promised Land, but she did not return. Rukil's efforts were opposed by the shifty shopkeeper Igear, who was fearful that the discovery of the Promised Land would deprive him of the status and importance he derived from his salvage shop, the Outcasts' main source of income."}, {"tag": "p", "text": "When Revan visited the Undercity in 3956 BBY during his forced stay on Taris, searching for the Galactic Republic escape pod that Jedi Bastila Shan used to escape the Republic capital ship Endar Spire, he found the three journals—those of Rukil's apprentice, father and grandfather—and brought them to Rukil. This information was enough for him to determine where the Promised Land was. The next night, the Outcasts left the Undercity, heading for the lost colony."}, {"tag": "h3", "text": "Destruction of Taris"}, {"tag": "p", "text": "Unfortunately for the Outcasts, this was the time when Darth Malak ordered a massive orbital bombardment of Taris. It was discovered by a group of heroes during the Cold War that the Outcasts have in fact found the Promised Land; it was, however, vastly different from the legends, or at least after the destruction of Taris."}, {"tag": "p", "text": "The buildings, equipment, generators and possibly the droids had been destroyed and therefore the Outcasts had to start over. Whilst being a difficult task, they had survived the bombardment. However, many generations had passed since then - each having a \"Promised One\", who would keep the memories of the terrible apocalypse and be in charge of the colonists."}, {"tag": "h3", "text": "Realm of the Outcast"}, {"tag": "p", "text": "The anti-Rakghoul serum which Revan discovered was enough to protect the first few generations, but the Rakghouls had evolved to become resistant to to the antidote, it was obvious that babies couldn't be born immune. Some of the Rakghouls even evolved into the sentient Nekghouls but unlike the Rakghouls, the Nekghouls couldn't spread infection. The Outcast later left the Promised Land and recolonised the Undercity and renamed themselves the Tarisians. This however was in vain as the Tarisians continued to die out on the surface from starvation, disease and Rakghouls. It was also shown, in the last successfully preserved time recording, that the last generation alive had lost so much information about the world, they didn't even know how or what brought them there and the remaining members died from toxic waste which ultimately resulted in their extinction. The information about them was lost until Republic forces retrieved the information about their post-apocalyptic history both in the Promised Land and in the Undercity and gave it to a local Republic history keeper. The Promised Land, like the rest of Taris during the Cold War, was later conquered and subsequently occupied for an unknown period of time, by the Resurrected Sith Empire. By 3 ABY, much of Taris had been rebuilt, including the four cities above the sub terrain realm, but it is unknown if the underground city below had ever recovered."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the non-canon dark side ending, if Revan chooses to give the journals to Igear and he destroys them, the Outcasts never find the Promised Land."}, {"tag": "p", "text": "The fate of the Promised Land is revealed in a side quest for Republic players during their visit to Taris in Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}