{"url": "Prosecutor", "categories": ["Category:Legends articles", "Category:Acclamator-class assault ships", "Category:Captured starships", "Category:Galactic Republic starships"], "nodes": [{"tag": "h1", "text": "Prosecutor"}, {"tag": "p", "text": "The Prosecutor was an Acclamator-class assault ship in the Republic Navy during the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Battle of Geonosis"}, {"tag": "p", "text": "Commanded by Captain Martz, the Prosecutor participated in the First Battle of Geonosis. When the clone commandos of Delta Squad successfully managed to sabotage a Separatist Lucrehulk-class core ship that was still waiting to launch, a Republic LAAT/i gunship from the Prosecutor evacuated the commandos from a side breach in the hull of the enemy warship, and Delta Squad returned to the Prosecutor."}, {"tag": "h3", "text": "Capture"}, {"tag": "p", "text": "After the First Battle of Geonosis, the Prosecutor was given the task of defending trade routes in the Corellian sector in 21 BBY. During this assignment, the ship's crew managed to intercept important information from a Separatist transmission. The data was later captured by Trandoshans, who had boarded the Prosecutor. Most of the clone troopers on board were killed by the intruders, though the sheer number of clones possibly allowed them to keep the vessel from being fully captured for the two weeks that it was out of contact with the Republic."}, {"tag": "h3", "text": "Infiltration"}, {"tag": "p", "text": "When the Prosecutor reappeared two weeks later in the Corbantis system, within the Chaykin Cluster and nowhere near Corellia, on the edge of Confederacy-controlled territory, the highly renowned clone commandos of Delta Squad were called in to investigate the matter. They found the Prosecutor drifting in space, powerless. Using a CR25 troop carrier, they infiltrated the ghost ship via the four starboard heavy proton missile tubes. Their primary objective was to retrieve the four data cores—the flight recorders that would have detected what had happened to the Prosecutor and left it hanging dead in space. Each commando was responsible for a single data core."}, {"tag": "p", "text": "As the commandos entered at their respective ingress points, a sensor jammer was activated and cut off their communication from the tactical coordinator on the CR25 carrier, clone advisor CC-01/425. As they made their way aft through the labyrinth of catwalks, corridors, and mazes of coolant pipes in the engineering section, the commandos were ambushed by scavenger droids and slavers. Meanwhile, Boss, the commander of Delta Squad, arrived at Sev's location and watched helplessly as the trooper was ambushed. He also discovered that many surviving clones were still on the ship. However, the majority of these were later killed by either enemy scavenger droids or the Trandoshans that had taken control of the ship."}, {"tag": "p", "text": "To add to the mystery of the Prosecutor, Boss found a lightsaber in a service corridor during his mission on the ship. However, instead of the lightsaber lying next to the body of a Jedi, it was found beside a dead clone trooper. He then found a group of three survivors who tried to charge a heavy Trandoshan mercenary when he went to investigate a clone trooper who flew into the room. After a tense fight in which three troopers were slaughtered, Boss continued on."}, {"tag": "p", "text": "Making his way through damaged corridors while fighting off Trandoshans and aiding surviving clone troopers, Boss rendezvoused with Fixer, rescued Sev from interrogation, and broke Scorch out of a detention cell. After rendezvousing, Delta Squad began encountering droids."}, {"tag": "p", "text": "Upon reaching the bridge, the Deltas destroyed the sensor jammer. CC-01/425 then accessed the ship's systems, providing them with information they needed. The squad then proceeded to one of the ship's hangars to destroy the Trandoshan dropship docked there and acting as a command center for the enemy."}, {"tag": "p", "text": "The situation immediately worsened when a Lucrehulk-class Droid Control Ship appeared to salvage the ship, as part of a deal made between the Trandoshans and the Confederacy. Delta Advisor proceeded to send out a distress signal, which was answered by the Acclamator-class assault ship Arrestor. Battle droid dispensers were sent into the starboard hangars of the Prosecutor as the Separatists prepared to claim their prize from the Trandoshans. Delta Squad was deployed to secure several hangars against the incoming wave of Confederate droids, and did so by destroying the hangar shield power regulators. With the regulators disabled, the hangar force fields intensified, preventing more dispensers from entering."}, {"tag": "p", "text": "Fighting their way through the swarms of battle droids already taking control of the ship, Delta Squad arrived at an automated turbolaser control room where they set the controls to fire on the Droid Control Ship while simultaneously fighting off approaching droids. Together with the newly-arrived Arrestor, their combined firepower proved too much for the Separatist ship, which was destroyed. As a result, all battle droids aboard the Prosecutor were deactivated."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}