{"url": "Proto_One", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Junk droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "Proto One"}, {"tag": "p", "text": "Proto One, also known as Proto Number 1, was a rickety Proto Droid who rebuilt himself using assorted replacement parts after he was discarded by his original organic masters. Although he resembled an odd mixture of different droid types and walked with the assistance of a cane, he was proud that he was his own Maker and considered himself one of a kind. In 15 BBY, Proto One was more than a century old, and he worked as the proprietor of a scrapyard on the planet Boonta."}, {"tag": "p", "text": "When the starship Sand Sloth crashed into the scrapyard, Proto One was happy to fix it for its owner, a Human named Kea Moll. After completing the repairs, he discovered that Moll's own droids, C-3PO and R2-D2, had unwittingly befriended BL-17, a treacherous droid who belonged to the Mandalorian bounty hunter Boba Fett. Proto One helped thwart BL-17's plan to capture Moll and her friends, and when the nefarious criminals of the Fromm Gang afterward attempted to seize them, the Proto Droid fired a blaster at the gangsters and scared them off."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Junk droid"}, {"tag": "p", "text": "The Proto Droid who in 15 BBY was known both as Proto One and Proto Number 1 was originally active before the year 115 BBY. After a century of mechanical service, he was discarded by his organic masters. The broken droid rebuilt himself with assorted replacement parts. Proto One eventually became the proprietor of a scrapyard on the planet Boonta. At some point before 15 BBY, he met and took a disliking to the BL-series droid BL-17."}, {"tag": "p", "text": "One day in 15 BBY, the starship Sand Sloth crash-landed in the scrapyard. Proto One approached two of its occupants—the protocol droid C-3PO and the astromech droid R2-D2—who had been ejected from their vehicle during the crash. He introduced himself and earned the affection of R2-D2, but C-3PO was reluctant to trust him, even after he directed the protocol droid's three Human masters to a nearby medical unit to tend to the injured arm of Jord Dusat, one of their own. Before the five newcomers departed in their landspeeder, the White Witch, Proto One was recruited to fix the Sand Sloth by its owner, Kea Moll."}, {"tag": "h3", "text": "Showdown with BL-17"}, {"tag": "p", "text": "Proto One completed the repairs before the day's end and left the scrapyard to seek out Moll and the others. He found C-3PO and the White Witch at a processing plant with BL-17, who had deceptively befriended the protocol droid in order for his master, the Mandalorian bounty hunter Boba Fett, to capture Moll and her friends. Proto One charged at his old enemy but was easily tossed aside. However, C-3PO realized BL-17's treachery and defeated him when R2-D2 arrived and helped the protocol droid push their foe under a rain of falling machinery. Moll and her friend Thall Joben showed up soon after, but Fett emerged from the shadows and began to fire laser blasts at them. During the commotion, a downed Proto One witnessed Tig Fromm and Vlix Oncard—Annoo-dat Blue gangsters of the Fromm Gang criminal organization who had hired Fett and who sought to thwart Moll and her friends—plant a thermal detonator aboard the White Witch and reveal that it would activate after the vehicle completed ten laps of the upcoming Boonta Speeder Race. By the time Proto One got up and warned Moll and C-3PO, Joben and R2-D2 had already boarded the speeder and fled from a pursuing Fett."}, {"tag": "p", "text": "Although Joben entered the race before his friends could contact him, he won the event after Fett's own Silver Speeder shook the detonator loose and took the brunt of the ensuing explosion. Proto One made his way to the racetrack and saw Oncard, Tig Fromm, and Tig's father Sise Fromm confront Joben, Moll, Dusat, C-3PO, and R2-D2. The gangsters fled when Proto One fired a blaster at them, but a furious Fett captured them and decided to deliver them to their rival crime lord Jabba the Hutt. Proto One declined an invitation from an apologetic C-3PO to leave Boonta aboard the Sand Sloth, and he waved goodbye to his new friends as they returned to their ship and departed the planet."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "After refitting himself with diverse replacement parts, Proto One resembled a strange mixture of different droid types. He was in fact a masculine-programmed Proto Droid, although cobbled-together mechanical beings were more broadly known as junk droids. Proto One stood approximately 1.71 meters tall and was humanoid in shape. His head, torso, left hand, and right upper leg were olive-green in color, while his midsection, photoreceptors, right forearm and left leg were red. His left arm, right upper arm, and right foreleg were gray, as were portions of his face, chest, and his right foot, which was also partly black. Proto One's body sported several scattered red patches, and a red rectangular prism was fitted to his back."}, {"tag": "p", "text": "The rickety droid walked on two legs with the use of a cane; his left foot was roughly the shape of a Human's, but his right foot was conical with three tripodal legs of its own. Proto One had three fingers and an opposable thumb on each hand. His face sported red piping above his photoreceptors that simulated eyebrows, and additional red piping around the back of his head gave him the look of a balding Human. The bottom of his face contained his vocabulator and was vertically elongated to resemble a chin and mouth."}, {"tag": "p", "text": "Proto One was friendly and helpful to strangers who wandered into his scrapyard, but he was quick to beligerently point out that he was his own Maker. Despite the junk droid's mostly polite demeanor, BL-17 earned his ire at some point in his operational history. R2-D2 took an instant shine to Proto One, but C-3PO was hesitant to trust the old droid until he discovered BL-17's deception. A skilled mechanic, Proto One was confident in his abilities despite his advanced age, and he was happy to fix the Sand Sloth for Kea Moll and her friends. He considered Boonta to be his home and declined an invitation from C-3PO to leave the planet. Proto One spoke Basic and also understood Binary."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Proto One first appeared in \"A Race to the Finish,\" a 1985 episode of the Star Wars: Droids cartoon series. The episode was written by Peter Sauder and Steven Wright, directed by Raymond Jafelice, and first broadcast on television on September 28, 1985. In 1987, the episode was adapted into a children's storybook by Dragon Picture Books, which first identified the character as both \"Proto Number 1\" and a \"Proto Droid.\" The book does not include Proto One in its climax, instead depicting Boba Fett as seizing the Fromm Gang immediately after they confront the heroes in the wake of the Boonta race."}, {"tag": "p", "text": "A Droids toy line was produced by Kenner toys in 1985, and although it did not include a Proto One figure, Star Wars artist Jeffery Carlisle named the character in an interview on StarWars.com as a toy he wished had been produced."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}