{"url": "Protector_(Victory_II-class)", "categories": ["Category:Legends articles", "Category:Flagships", "Category:Starships of the Imperial Remnant", "Category:Victory II-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Protector (Victory II-class)"}, {"tag": "p", "text": "Protector was a Victory II-class Star Destroyer in the service of the Imperial Navy during the Galactic Civil War and later the Yuuzhan Vong War."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "The Protector attempted and failed to stop the Mon Calamari Cruiser Independence from rendezvousing with the rest of the Rebel fleet at Sullust just before the Battle of Endor."}, {"tag": "p", "text": "This ship survived the Battle of Endor and later became one of the ships under the command of Grand Admiral Gilad Pellaeon."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "In 28 ABY, following the starfleet's failure at the Battle of Bastion and its subsequent tactical withdrawal from Yaga Minor, forces were amassed at the planet Borosk for a defense against the Yuuzhan Vong invaders. During the battle that ensued, Protector was tasked with leading Fleet Group Protector, one of four temporary battlegroups created for the planet's defense."}, {"tag": "p", "text": "Following the battle, Protector was among the Star Destroyers ordered deployed to assist in the defense of Yaga Minor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 2008, The Complete Star Wars Encyclopedia stated there were three different Victory-class Star Destroyers called Protector in the Expanded Universe. Two were used by the Empire : this one and an other, flagship of Admiral Harkov."}, {"tag": "p", "text": "The Complete Star Wars Encyclopedia also identified the Imperial Remnant's Protector from The New Jedi Order: Force Heretic I: Remnant as the same ship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}