{"url": "Proton_bomb", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Weapon stubs", "Category:Proton bombs"], "nodes": [{"tag": "h1", "text": "Proton bomb"}, {"tag": "p", "text": "Proton bombs were powerful explosive weapons carried by bomber craft such as BTL-A4 Y-wing starfighters and TIE/sa bombers. The bombs themselves were spherical in appearance, although when stored in cylindrical containers, they could also be used as high-yield explosives capable of producing great damage to heavily armored vehicles such as AT-ATs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Confederacy of Independent Systems' Navy used Hyena-class Droid Bombers that carried proton bombs during the Battle of Christophsis. The Galactic Republic Navy's BTL-B Y-wing starfighter/bombers also used proton bombs extensively during the War. During the Ryloth Campaign, the Separatist forces once again employed Hyena bombers, this time to carpet-bomb numerous villages on Ryloth in a failed attempt to scapegoat the inevitable Republic victory as a bloodbath."}, {"tag": "p", "text": "Proton bombs were used by the Galactic Empire during the war against the Rebellion. These bombs were highly sought after by the rebels."}, {"tag": "p", "text": "Decades later, during their war with the First Order, the Resistance carried proton bombs into combat by MG-100 StarFortress SF-17 bombers. Proton bombs in Resistance StarFortresses were often decorated with cartoons or defiant messages towards their enemies. They were used to bomb the Fulminatrix, a Mandator IV-class Siege Dreadnought during the evacuation of D'Qar. While the bombers suffered heavy losses - especially when three bombers were lost in an explosive chain reaction from a TIE fighter crashing into one of the bombers' bomb bays - a lone bomber crewed by one survivor, Paige Tico, managed to drop its entire payload on the dreadnought, destroying both itself and the dreadnought."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}