{"url": "Protosaber", "categories": ["Category:Legends articles", "Category:Lightsaber variations"], "nodes": [{"tag": "h1", "text": "Protosaber"}, {"tag": "p", "text": "Archaic lightsabers—commonly referred to as protosabers—were the first known design of lightsaber. Like later lightsabers, their focusing crystal was set inside a hilt from which a blade of energy was emitted. The main difference between protosabers and later lightsabers was that the hilt was connected via cable to an external power pack due to limitations in power pack technology."}, {"tag": "p", "text": "These lightsabers had limited operational time and the mobility of the user was restricted by the cable linking the hilt of the weapon to the power supply."}, {"tag": "p", "text": "As technology improved, the protosaber design was abandoned in favor of the modern lightsaber design, with some archaic lightsabers modified to remove the necessity of an external power supply. Some later attempts were made to reintroduce the external power supply using modern technology, trading less mobility for a stronger power source."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "Protosaber design called for an external power supply that would be carried by the user on their back, hip, or a belt. This power supply would be connected to the bottom of the lightsaber hilt, opposite of the lightsaber's blade emitter."}, {"tag": "p", "text": "An external power supply was required for archaic lightsabers as no sufficient miniaturized power pack existed at the time that was capable of powering a lightsaber plasma energy blade. Even these larger power packs provided only temporary power, limiting the weapon's effectiveness."}, {"tag": "p", "text": "Another limitation of the protosaber design was that the power cable between the hilt and the power pack limited the mobility of the user, preventing techniques such as the saber throw and telekinetic lightsaber combat."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Protosabers were used during the Hundred-Year Darkness and Great Hyperspace War by Jedi, Dark Jedi, and Sith alike. During these conflicts, they clashed with Force weapons, conventional weapons, and exotic weapons such as those made of Mandalorian iron."}, {"tag": "p", "text": "The protosaber design was eventually rendered obsolete by improvements in technology and materials. The invention of more potent power cell technology allowed users to replace external power packs with small power cells fitted within the hilt of the lightsaber. An internal superconductor was also introduced that transferred the returning looped energy from the negative-charged flux aperture back into an internal power cell. With this modification, the power cell would only expend power when the energy loop was broken by coming into contact with other material. It was possible to modify protosabers to take advantage of these improvements in technology, thereby making them into standard lightsabers. Vima-Da-Boda's lightsaber is one example of a protosaber that was \"upgraded\" at some point to match modern lightsaber designs. The First Blade was apparently installed with these improvements as well."}, {"tag": "p", "text": "With these improvements granting the wielder greater freedom of movement and more efficient power consumption, the protosaber design would be abandoned until further advancements were made in lightsaber technology."}, {"tag": "h2", "text": "Retrosaber"}, {"tag": "p", "text": "At least one Jedi artisan eventually returned to the archaic lightsaber design, improving it with modern materials and engineering. The resulting weapon—dubbed a \"retrosaber\"—greatly resembled the original protosabers, but far exceeded their abilities. A retrosaber was just as potent as modern lightsabers, but offered a few advantages along with the disadvantage of the external power pack. The primary advantage was that modern belt-mounted power packs allowed for a brief \"power surge\", creating a more powerful blade for a short time and therefore a temporary advantage in combat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}