{"url": "Providence-class_Dreadnought", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic starship classes", "Category:Battleship classes", "Category:Carrier classes", "Category:Confederacy of Independent Systems starship classes", "Category:Destroyer classes", "Category:Dreadnought classes", "Category:Providence-class carrier/destroyers", "Category:Trade Federation starship classes"], "nodes": [{"tag": "h1", "text": "Providence-class Dreadnought"}, {"tag": "p", "text": "The Providence-class Dreadnought, also known as the Providence-class cruiser-carrier, the Providence-class carrier/destroyer, the Providence-class Separatist destroyer, and more commonly known as the Separatist dreadnought, was a model of dreadnought designed by Quarren engineers and manufactured by Free Dac Volunteers Engineering Corps and Rendili StarDrive for use by the fleets of the Trade Federation. During the time of the Clone Wars, the Providence-class Dreadnought was incorporated into the naval forces of the Confederacy of Independent Systems and saw extensive use throughout the war as flagships."}, {"tag": "p", "text": "The Providence-class Dreadnought was among the largest and most powerful warships that served in the Confederacy navy, consisting of two variants, one model that measured to 1,088 meters, and a second that stretched to over 2,000 meters in length. The warship also possessed an armament which provided the vessel with enough firepower to withhold a planetary blockade alone. Its armament consisted of fourteen heavy quad turbolaser batteries, thirty-four dual heavy laser cannons, twelve twin light point-defense ion cannons, two heavy ion cannons, twelve heavy flak guns, and 102 proton torpedo launchers."}, {"tag": "p", "text": "These vessels also sported a large hangar for a complement of 120 Vulture-class droid starfighters, 120 droid tri-fighters, 10 Hyena-class Droid Bombers, HMP droid gunships, several hundred armored vehicles, such as Armored Assault Tank Mk Is and Multi-Troop Transports. They could also carry shuttles, while also ferrying a passenger capacity of over 40,000 troops, as well as 1.2 million deactivated battle droids, and manned by a crew of 900 officers, droids, and other enlisted crew, and a cargo capacity of 18,000 metric tons for encumbrance."}, {"tag": "p", "text": "During the reign of the Galactic Empire, the Providence saw later use in the naval forces of the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "The Providence-class Dreadnought, a class of dreadnought, was designed by Quarren engineers of Free Dac Volunteers Engineering Corps as well as Rendili StarDrive for the fleet of the Trade Federation. The dreadnought also served within the naval forces of the Confederacy of Independent Systems, and was among the largest powerful known starships within their navy."}, {"tag": "p", "text": "Consisting of two models, one that measured to 1,088 meters, and another at 2,000 meters in length, the Providence-class possessed a long, roughly cylindrical hull with a tapered, cone-like bow. Towards the vessel's aft, the dreadnought's dorsal surface was dominated by a bulky superstructure, as well as a towering fin-like spire that arose from its hull. The hull also supported both the craft's command bridge and observation platforms. Within the spire, were the private quarters of the commanding officer, a sole command center that sported tactical displays and briefing tables, and was located in an observation deck with a viewport of the surrounding space."}, {"tag": "p", "text": "Due to simple construction and a highly modular interior, the Providence-class was configurable for a variety of different roles. Such roles included planetary assault, theater command, and a carrier variant for starfighters, which gave the craft versatility and made it more useful to their operators in contrast to other specialized vessels."}, {"tag": "h3", "text": "Weapon systems and shielding"}, {"tag": "p", "text": "Along its hull, the cylindrical surface of the Providence-class was dotted with variety of weapon emplacements, and therefore provided the craft enough firepower to maintain a planetary blockade alone. Its weapons were also powerful enough to pierce through the deflector shields of other enemy warships. The armament of a Providence-class consisted of fourteen port and starboard heavy quad turbolaser cannons, thirty-four dorsal and ventral turret-mounted dual heavy laser cannons, twelve port and starboard twin light point-defense ion cannons, and two forward-mounted battleship heavy ion cannons. Additionally, the dreadnought was also armed with 102 proton torpedo launchers, which could each fire a total of five torpedoes, as well as twelve heavy flak guns, and ten port and starboard heavy tractor beam emitters."}, {"tag": "p", "text": "In terms of shielding, the Providence-class was equipped with deflector shields as well as thermal shields, which were powerful enough to turn or absorb the heaviest laser fire from opposing starships. While extremely potent vessels, the Separatist admiralty deployed the Providence-class ships with great caution, and due to the high cost of operating these vessels at their peak efficiency, they were deployed only when their sheer, overwhelming force was called upon."}, {"tag": "h3", "text": "Complement"}, {"tag": "p", "text": "Despite possessing a fearsome armament, the Providence-class Dreadnought was designed to often take the role of a carrier for starfighters and landing craft of the Separatist armada. Sporting a large hangar for its complement, the dreadnought could carry up to 120 Vulture-class droid starfighters, 120 droid tri-fighters, and 10 Hyena-class Droid Bombers. These vessels were also capable of transporting several hundred droid armored vehicles, such as Multi-Troop Transports and Armored Assault Tanks, as well as shuttles, and HMP droid gunships, while also ferrying a passenger capacity of 48,247 troops and manned by a crew of 900 officers, droids, and other enlisted crew. The Providence-class was also able carry over one million deactivated battle droids, and maintained a cargo capacity of 18,000 metric tons."}, {"tag": "h3", "text": "Propulsion and navigation"}, {"tag": "p", "text": "Boasting a speed of 2,000 kilometers per hour and a speed of 70 megalight per hour from three Nubian Creveld-4 radial ion drives, the Providence-class was equipped with a Class 1.5 hyperdrive generator as well as a backup Class 10 hyperdrive. The vessel was also equipped with long-range sensors, as well as a navigation computer."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The primary role of the Providence-class Dreadnought was to act as the command ship of fleets. However, it could also take the role of a battleship and cruiser-carrier, where it could ferry a large passenger complement as well as a vehicle and starfighter complement in its hangars."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Battle of Christophsis"}, {"tag": "h5", "text": "Repelling the Republic"}, {"tag": "p", "text": "In 22 BBY, during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, the Confederacy dispatched its Droid Army under the command of Kerkoiden General Whorm Loathsom and Sith assassin Asajj Ventress to the crystalline planet Christophsis, due to its resources and strategic position along the Corellian Run. After managing to occupy the planet's surface, the Confederacy proceeded to establish a thirty-craft blockade of at least six Lucrehulk-class Battleships and at least twenty-three Munificent-class star frigates in orbit under the command of Harch Admiral Trench aboard his flagship, the Providence-class Dreadnought Invincible."}, {"tag": "p", "text": "Following the blockade's establishment, the Republic dispatched a fleet of three Venator-class Star Destroyers and three Pelta-class frigates under the command of Jedi General Anakin Skywalker to Christophsis, where they were to break through the blockade and deliver relief supplies to the surface. As the two fleets exchanged fire with one another, the Invincible proceeded to make its advancement on the Resolute unopposed, which forced the Republic fleet to increase power to their forward shields. Releasing a barrage of turbolaser fire upon Skywalker's fleet, the Invincible managed to separate the Republic frigates from the Venators, destroying one of the frigates in the process."}, {"tag": "p", "text": "As the Invincible continued its bombardment, Skywalker ordered his fleet to over-fire their reactors, with the intent of charging through the blockade. In response, Trench ordered the blockade to maintain their position and intensify their forward deflector shields. Shortly after, Jedi General Obi-Wan Kenobi arrived in the system aboard his flagship, who advised Skywalker to withdraw his forces behind the moon of Leesis, informing him that he had devised a plan, to which Skywalker followed suit. As the Republic fleet fled to the other side of the moon, Trench's T-series tactical droid TI-99 inquired as to whether or not they should pursue, to which the Harch responded that their orders were to hold a blockade and that the Republic would return. After the Republic retreated, Trench ordered two B1-series battle droids of the dreadnought's crew to recharge the vessel's shields and to allow their cannons to reset."}, {"tag": "h5", "text": "Destruction of the Invincible"}, {"tag": "p", "text": "While the Republic recuperated behind the moon, Trench ordered TI-99 to provide an update on the surface engagements, to which the tactical droid explained that he estimated a half rotation before the Confederacy could take control of the planet. In response, Trench, who believed that a two-pronged attack would draw the Republic out, dispatched a squadron of Hyena-class Droid Bombers to the surface, where they were to bomb Senator Bail Organa's position. As the bombers made their approach on Senator Organa, the squadron unknowingly flew directly over General Skywalker, who was ordered by Kenobi to use a prototype stealth ship and deliver the relief supplies to surface."}, {"tag": "p", "text": "Not long after the bombing run, Skywalker, resolute in defeating the blockade, went on the offensive and attacked the Invincible. Deactivating the stealth ship's cloaking device, the Jedi Knight revealed himself to Trench and fired several torpedoes on the Invincible's command bridge. Repelled by the dreadnought's thermal shields, the Harch proceeded to order his crew to fire a wall of turbolaser fire, but were unsuccessful as the ship reactivated its cloaking device. Despite being unsuccessful, however, Trench came to the realization that a clone trooper would be unable to navigate a spread of lasers, and that they were instead battling a Jedi, to which the Harch proceeded to contact Skywalker aboard the stealth ship. As Trench spoke with the Republic crew, the Harch warned them to turn back while they were, and that despite them being in possession of an impressive vessel, he informed them that he has fought with similar vessels in the past."}, {"tag": "p", "text": "After the transmission ended, Trench hypothesized that, in spite of his message, Skywalker was unlikely to retreat and would strike again, understanding that a stealth ship would have been able to slip by the blockade without being noticed, but instead chose to attack. Affirming Trench's hypothesis, Skywalker once again disengaged the cloaking device, firing torpedoes at the dreadnought, which were repelled once more and allowed Trench to track the stealth ship's magnetic signature before it could disappear again. Upon locking onto its magnetic signature, the Invincible, lowering it shields to do so, fired several tracking torpedoes toward the stealth ship, which managed to evade the torpedoes, disengaging the cloaking device once more as it increased engine power, heading straight for the unshielded Invincible and sending the torpedoes into its bridge, destroying the vessel as a result. With the Invincible destroyed, Kenobi and the Republic fleet returned and continued their attack on the blockade, which had been thrown into disarray following the dreadnought's destruction."}, {"tag": "h4", "text": "Attacking the Felucia medical station"}, {"tag": "p", "text": "Some time after the Confederacy's triumph over the Republic on Felucia to gain access to the Perlemian Trade Route in 21 BBY, the Separatist navy launched an attack on Felucia Medical Station HCTFF2, a Republic Haven-class medical station located in the Felucia system, led by a Providence-class Dreadnought and two Munificent-class star frigates, which resulted in the medical station's destruction."}, {"tag": "h4", "text": "Battles of Kamino and Sullust"}, {"tag": "p", "text": "Despite the failure of their first attempt earlier in the Clone Wars, the Kaleesh cyborg General Grievous and Dark Acolyte Asajj Ventress of the Confederacy planned to launch a second invasion attempt on the cloning planet of Kamino. However, the Republic intercepted a transmission between the two detailing the invasion of Kamino, which resulted in the clones of the 501st Legion being deployed to help defend the planet."}, {"tag": "p", "text": "When he arrived in the Kamino system, Grievous commanded the fleet from his personal Providence-class Dreadnought, which was flanked by several Munificent-class star frigates and Recusant-class light destroyers."}, {"tag": "p", "text": "Later, a Providence-class Dreadnought flagged a Separatist fleet that was placed under the command of the dark side assassin Asajj Ventress, crossed paths with a Republic fleet commanded by both Jedi Generals Skywalker and Kenobi, which resulted in a battle to claim control over the planet Sullust."}, {"tag": "p", "text": "By the end of the battle, Count Dooku, who was ordered by his master Darth Sidious to destroy his assassin to prove his loyalty, instructed Ventress' tactical droid, TJ-912, to withdraw their forces and open fire on the Separatist command ship, where the dark acolyte was caught in a brief lightsaber duel between Skywalker and Kenobi, ultimately causing the dreadnought's destruction, but not before Ventress could narrowly escape the doomed vessel."}, {"tag": "h4", "text": "Discovering the Nexus Route"}, {"tag": "p", "text": "After Jedi Master Even Piell had discovered the location of the strategic Nexus Route hyperspace lane, Piell's forces were ambushed by a small fleet of Separatist warships led by a Providence-class carrier/destroyer, which led to the Jedi Master being imprisoned in the seemingly inescapable Citadel on the volcanic planet Lola Sayu."}, {"tag": "p", "text": "Following Master Piell's capture by Separatist forces, the Republic dispatched a Jedi-led rescue team to extract their fellow Jedi from the Citadel to prevent the Confederacy from learning the hyperlane's coordinates. Entering the Lola Sayu system aboard a stolen Sheathipede-class Type B shuttle, the Republic's rescue team crossed paths with the Separatists' planetary defense fleet which was commanded by a Separatist dreadnought."}, {"tag": "p", "text": "After the Jedi freed Master Piell from the Citadel, the stolen shuttle in which the Republic arrived on was destroyed while trying to make their escape, resulting in the Republic dispatching a task force of four Venator-class Star Destroyers led by Jedi Master Plo Koon to extract the trapped rescue team, forcing the dreadnought and the rest of the planetary defense fleet to engage the Republic task force."}, {"tag": "h4", "text": "Capture and rescue of Adi Gallia"}, {"tag": "p", "text": "At some point during the Clone Wars, the Kaleesh cyborg General Grievous and his fleet of Separatist cruisers launched a surprise attack on Jedi Master Adi Gallia and her flagship near the planet Patitite Pattuna aboard his personal Providence-class cruiser-carrier, and successfully managed to capture her after engaging one another in a lightsaber duel aboard her Star Destroyer."}, {"tag": "p", "text": "Some time after her capture, Grievous aboard his Providence crossed paths with the Weequay pirate ship Marauder, and immediately ordered the bridge crew to use it for target practice and destroy it. And while still being held captive aboard the dreadnought, a fleet of Republic Star Destroyers led by Jedi Master Plo Koon entered the system and began to fusillade the Separatist dreadnought, and successfully managed to retrieve Master Gallia while Grievous made his escape from the heavily damaged cruiser."}, {"tag": "h4", "text": "Battle of Umbara"}, {"tag": "p", "text": "Around the second year of the war, the Umbaran government seceded from the Republic after the death of Senator Mee Deechi, who had represented the planet in the Galactic Senate, and aligned themselves with the Separatist Alliance. The Separatists established a blockade, led by a dreadnought when the Republic forces undertook a planetary-wide invasion to reclaim the planet."}, {"tag": "p", "text": "As the battle raged on, the Separatists dispatched a DH-Omni Support Vessel to reinforce the crumbling Umbaran forces in hopes of defeating the Republic troops led by Jedi Generals Kenobi, Skywalker and Pong Krell. To ensure that the supply ship reached its destination, the Separatists defended the vessel with a fleet including at least three Separatist dreadnoughts, four Recusant-class light destroyers, and eight Munificent-class star frigates."}, {"tag": "h4", "text": "Massacre of the Nightsisters"}, {"tag": "p", "text": "After Asajj Ventress' failed attempt to kill her former master Count Dooku and the betrayal of his new apprentice Savage Opress, and upon learning that his former assassin had returned to the planet Dathomir, Dooku ordered General Grievous to launch an invasion on the planet with the intent of exacting revenge on Ventress and Mother Talzin and wiping out the entire Nightsister clan."}, {"tag": "p", "text": "Commanding his fleet of four Munificent-class star frigates, two Recusant-class light destroyers, two Separatist supply ships, and his personal Separatist dreadnought, Grievous and his forces traveled to the Dathomir system. Upon their arrival, Grievous ordered the Separatist forces to begin landing their droids on the surface below, successfully killing the Nightsister clan."}, {"tag": "h4", "text": "Infiltration of Aut-O's flagship"}, {"tag": "p", "text": "Later on in the war, the Republic, fearful of a major Separatist offensive on the verge of occurring after a secret transmission of General Grievous was cut off, dispatched a squad of droids led by Zilkin Colonel Meebur Gascon to infiltrate a Separatist dreadnought commanded by the super tactical droid Aut-O which was carrying an encryption module that would allow the Republic to learn of the Separatists' plans."}, {"tag": "h4", "text": "Ambushing Kenobi"}, {"tag": "p", "text": "Sometime later, General Kenobi and his task force were ambushed by the Separatist fleet of General Grievous. The fleet consisted of two Providence-class Dreadnoughts, one Recusant-class destroyer, and three Munificent-class star frigates, one of which was destroyed in the battle. The ambush resulted in the destruction of much of Kenobi's fleet, including his flagship Negotiator."}, {"tag": "h4", "text": "Defense of Cato Neimoidia"}, {"tag": "p", "text": "In the final year of the war, the Separatists invaded the Trade Federation planet of Cato Neimoidia, but were met with a Republic defense led by Skywalker, his Padawan, Jedi Commander Ahsoka Tano, and the 501st Legion. After punching through the Separatist fleet in orbit, the two Jedi led a squadron of Z-95 Headhunters to the surface to engage the command ship and its accompanying cruisers."}, {"tag": "h4", "text": "Battle of Ringo Vinda"}, {"tag": "p", "text": "During the Battle of Ringo Vinda, Separatist forces commanded by Admiral Trench used five Providence-class vessels while trying to repel the Republic forces on and outside the planet's ring-shaped space station. The dreadnoughts were paired with two Recusant-class vessels, and suffered severe damage from the Republic's fleet of twenty Venator-class Star Destroyers, one Arquitens-class light cruiser, one Acclamator-class assault ship and three Consular-class cruisers during the battle."}, {"tag": "h4", "text": "Invasion of Scipio"}, {"tag": "p", "text": "During the invasion of the InterGalactic Banking Clan world of Scipio, Count Dooku commanded the battle from his personal Providence-class Dreadnought. After he had completed his mission to trick Rush Clovis into raising interest rates on the Republic and not the Separatists, with the arrival of a Republic fleet commanded by Anakin Skywalker, Dooku and his flotilla fled the system, allowing the Republic to gain control of Scipio."}, {"tag": "h4", "text": "Fighting the Shadow Collective"}, {"tag": "p", "text": "During the Confederacy's campaign against the Shadow Collective, a criminal organization founded by the former Sith Lord Maul, Grievous commanded a large Separatist fleet in a battle on the moon of Zanbar after the Zabrak managed to escape from the Spire prison on the planet Stygeon Prime. The fleet consisted of Grievous' Providence-class Dreadnought, at least two Recusant-class warships, at least eighteen Munificent-class star frigates, at least five DH-Omni Support Vessels, and at least five C-9979 landing craft."}, {"tag": "p", "text": "Following their defeat at Zanbar, Maul and Mother Talzin, who had suspicions that the Sith and Separatists were attempting to draw her out, devised a plan to lure Count Dooku and Grievous to the planet Ord Mantell where they set a trap to capture both. The Separatists, after landing their droid forces on the surface, were immediately engaged by the Shadow Collective, while Maul made his way onto the dreadnought, where Grievous was ordered to deactivate his army or be killed, to which the cyborg chose to shut down his army, allowing himself to be captured. Dooku, meanwhile, who had engaged and defeated the Nightbrothers on the surface, was also captured by the Collective forces."}, {"tag": "h4", "text": "Outer Rim Sieges"}, {"tag": "h5", "text": "Battle for Anaxes"}, {"tag": "p", "text": "During the Outer Rim Sieges, the Separatists, under Trench's command, launched an assault on the planet Anaxes in an attempt to secure the Republic's shipyards that were instrumental to its navy. The Harch commanded the battle from aboard his new flagship in an orbiting fleet with two other Providence-class Dreadnoughts, seven Munificent-class star frigates, two Recusant-class light destroyers, and six DH-Omni Support Vessels. In the initial phases of the battle, the Republic managed to keep Trench's forces contained, but after weeks of endless fighting, the Separatists were able to gain the upper hand by using a strategy algorithm designed by Clone Captain Rex, which had been extracted from clone trooper CT-1409, who was thought to have been killed during the Battle of Lola Sayu earlier in the war, on Skako Minor, the Techno Union headquarters."}, {"tag": "h5", "text": "Later sieges"}, {"tag": "p", "text": "Later in the Outer Rim Sieges, Grievous commanded a fleet of six Providence-class vessels against a fleet of six Republic Star Destroyers. During the battle, at least two Separatist dreadnoughts sustained heavy damage to their hulls as clone Z-95 Headhunters and droid tri-fighters engaged in dogfights around them."}, {"tag": "p", "text": "As the end of the war neared, the Republic sought to capitulate the planet Cato Neimoidia, seeing it as an instrumental goal that would help bring an end to the conflict. The Jedi Council dispatched Plo Koon to lead the 442nd Siege Battalion and ensure the planet's capture. Koon and Clone Captain Jag led starfighter squadrons against a trio of Separatist dreadnoughts and droid tri-fighters in the skies of Cato Neimoidia."}, {"tag": "h4", "text": "Battle of Coruscant"}, {"tag": "p", "text": "Nearing the end of the war, the Confederacy—under orders of Darth Sidious, the secret persona of the Republic's Supreme Chancellor Sheev Palpatine, and the CIS' shadow leader—launched a massive and unanticipated assault on the Republic's capital of Coruscant in the Core Worlds to capture Palpatine in order to bring Jedi Knight Anakin Skywalker closer to the dark side of the Force."}, {"tag": "p", "text": "Despite the high belief that the Separatists would never make such an attempt, Grievous made his move on the Republic's capital with a fleet of over 1,000 starships aboard the Separatist navy's flagship, the Providence-class Dreadnought Invisible Hand, which managed to catch the ill-prepared Coruscant Home Defense Fleet off guard and quickly overwhelm them, with the Chancellor, after a lengthy chase through the Federal District, taken captive aboard the flagship."}, {"tag": "p", "text": "Despite being outnumbered, the Home Fleet attempted to prevent the Invisible Hand from escaping with the Chancellor. Before the Separatists could escape from Coruscant, the Republic's Open Circle Fleet and Jedi Generals Kenobi and Skywalker arrived and immediately engaged the Separatists' Munificents, Recusants and Lucrehulks, which were escorting the Invisible Hand, and allowed the two Jedi to enter the heart of the chaos of turbolaser fire and starships. After a brief struggle to reach the flagship, Skywalker deactivated the ships deflector shields, which allowed the pair to land inside the vessel's main hangar."}, {"tag": "p", "text": "While aboard the Invisible Hand, the Jedi released the Chancellor from captivity and killed Count Dooku. Shortly after, the dreadnought came into a brief broadside battle with the Venator-class Star Destroyer Guarlara, and during the battle, the dreadnought took extensive damage from the Venator, which sent it plummeting towards the planet below before the crew regained control. Despite the Chancellor's rescue and a third of the Confederacy navy being destroyed, Grievous escaped from his doomed flagship aboard an escape pod, which was retrieved by the Lucrehulk-class Battleship Profusion. As Grievous fled, Skywalker and Kenobi still aboard the Invisible Hand, managed to land the dreadnought on Coruscant's surface, with half of the vessel breaking off in the process."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Following the end of the Clone Wars and the transition of the Republic into the Galactic Empire in 19 BBY, the Providence-class Dreadnoughts were decommissioned and sent to the junkyard world of Bracca to be dismantled. While on Bracca, the dreadnoughts began to deteriorate as their hulls became rusted. Later during the Empire's reign in 14 BBY, a rebel cell led by Berch Teller made use of a modified and downsized version of a former Separatist Providence-class Dreadnought well-known for jamming signals and destroying HoloNet relays during the war. The dreadnought was an amalgamation of several of dreadnoughts used by the Separatists, including the Lucid Voice, which made up the vessel's sensor array tower, and the Invincible, the former flagship of Admiral Trench during the Battle of Christophsis, which were recovered and put on the market after the battle, and used as part of the warship's modules."}, {"tag": "p", "text": "The dreadnought participated in the cell's attack on the Imperial Sentinel Base during Moff Wilhuff Tarkin's stay at the base. The Lucid Voice later participated in a battle near the Gulf of Tatooine, where it was destroyed by Imperial forces led by Tarkin. Another Providence found its way into the naval forces of the Alliance to Restore the Republic, taking part in a battle against the Imperial Navy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Providence-class Dreadnought first appeared in Star Wars: Episode III Revenge of the Sith, and was featured in a number of episodes from the Star Wars: The Clone Wars television series. In the original continuity, the Expanded Universe established the ship as the Providence-class carrier/destroyer, but with the discarding of the Expanded Universe in favor of a new continuity on April 25, 2014, the initial official name was \"Separatist dreadnought.\" The official Star Wars Encyclopedia uses the \"dreadnought\" spelling, though the actual URL for the ship's entry uses the \"dreadnaught\" spelling."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}