{"url": "Avar_Kriss%27s_network", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Stub", "Category:Light side powers"], "nodes": [{"tag": "h1", "text": "Avar Kriss's network"}, {"tag": "p", "text": "Avar Kriss's network was a rare application of telepathy that allowed a user to detect the natural bonds between Force-sensitives and connect the individuals' minds through the Force. The ability was inexact in its connection, able to transmit mostly only sensations along its system. Nevertheless, it was faster than speaking, as an effected Force-sensitive could feel the opinions and emotions of others after suggesting a strategy. With a great amount of concentration, a user could employ a version of this network that allowed them to have a much deeper connection with the beings around the individual."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Jedi Master Avar Kriss utilized the technique during the Great Hyperspace Disaster around 232 BBY. From aboard the bridge of the Third Horizon on the planet Hetzal Prime, Kriss was able to connect the senses of hundreds of Jedi across the Hetzal system during their efforts to prevent hyperspace debris from destroying the planet and its moons. Her network allowed her to sense the feelings of Jedi across the system in what she viewed as melodies in the Force. One of these melodies belonged to Burryaga Agaburry, a Wookiee Padawan who alerted Kriss through the network that the pieces of debris actually contained living beings."}, {"tag": "p", "text": "Kriss used her ability to continually observe and direct the efforts on Hetzal until it was discovered that one piece of debris, a container of liquid Tibanna, was hurtling towards the system's R-class star. If the two collided, a massive chain reaction would occur and the entire system would be destroyed. Kriss placed herself on the surface of Hetzal Prime, surrounded by the abundant life of the agriworld. Using the Force, she rapidly spun her lightsaber in the air until it made a single harmonious note. She used this sound to help her concentrate and tap deeper into her network, connecting with all life in the system and focusing her fellow Jedi on moving the container away from the star. Fighting great weariness, the combined effort of the Jedi was able to push the object just out of reach of the star, saving the Hetzal system."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}