{"url": "Psychometry", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Force powers"], "nodes": [{"tag": "h1", "text": "Psychometry"}, {"tag": "p", "text": "Psychometry, also known as Sense Echo, Force Echo, or retrocognition, was the Force ability of acquiring information about people or events associated with an object solely by touching it. Whoever used the ability experienced a blinding white light, before receiving slightly distorted input from sight, sound, and emotions associated with the object. At the time of the Clone Wars, the Jedi Master Quinlan Vos was known for being proficient in psychometry, which made him an expert tracker. However, the Jedi Order did not approve of their members using psychometry to handle weapons of violence. The Order feared that, as the wielder's emotions could be sensed, the Jedi using his psychometric skill could be exposed to the dark side of the Force. Cal Kestis' third encounter with the Inquisitor known as Second Sister had a moment of this danger. At the end of the fight, Kestis took the Second Sister's lightsaber and immediately had a vision that showed the pain and suffering that took her to the dark side. The sight momentarily left Kestis without action, which allowed the Inquisitor to flee. Jedi Master Rey Skywalker was able to use the ability."}, {"tag": "p", "text": "Psychometry was not a power that could be achieved through careful cultivation, as only those that were born with the power could use it, such as Jedi Padawan Cal Kestis and Karr Nuq Sin. The power did not always manifest directly at birth, as in the case of Nuq Sin, who began experiencing visions caused by objects at age thirteen. Though an innate skill, it nonetheless still required some study and practice to properly control it. To an unpracticed individual touching an object that induced a vision could also cause severe headaches and seizures, consequently making these episodes appear more like symptoms of a serious illness rather than a rare and powerful Force ability."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Psychometry first appeared in the new Star Wars canon in \"Hunt for Ziro,\" the ninth episode in Season Three of the animated television series Star Wars: The Clone Wars, which aired on November 12, 2010, and was first identified in the accompanying episode guide on StarWars.com. The power was originally introduced in the Star Wars Legends continuity in the 1994 novel The Courtship of Princess Leia, written by Dave Wolverton."}, {"tag": "p", "text": "The power featured prominently in both the 2019 novel Force Collector and video game Star Wars Jedi: Fallen Order, which starred the psychometry users Karr Nuq Sin and Cal Kestis respectively.  According to Force Collector author Kevin Shinick, he wrote the first draft of the novel without knowing about Kestis' powers in the other developing project and only learned of it around a year before the book's release. What Shinick had already written was close enough to Star Wars Jedi: Fallen Order that only minor details of the rules and effects of the power needed tweaks to bring the two stories in line, such as the blinding white light Nuq Sin saw when touching an object to match what happens in the game when Kestis uses his \"Sense Echo\" power."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}