{"url": "Pryce_Mining", "categories": ["Category:Canon articles", "Category:Mining companies"], "nodes": [{"tag": "h1", "text": "Pryce Mining"}, {"tag": "p", "text": "Pryce Mining was a mining company on Lothal owned and operated by the Pryce family. During the early Imperial Era, Governor Ryder Azadi attempted to take over Pryce Mining by framing Arihnda Pryce's mother Elainye. In return for helping Elainye, Senator Domus Renking coerced Arihnda into selling the company to the Galactic Empire. Renking then struck a deal with the Empire to keep ten percent of the profits. After ascending to Governor of Lothal, Pryce settled scores with Renking by shutting down the company."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Pryce Mining was a family mining company owned by the Pryce family. It was based in the Pryce family mine near Lothal's Capital City. The mine had a doonium vein, which was valuable since the Imperial Navy used the metal to build starships."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Talmoor Pryce owned and managed Pryce Mining, inheriting the mine from his family. His wife Elainye Pryce managed the company's financial accounts while the Lutrillian Pomi Harchmak worked as the company's heavy equipment inventory operations manager. By the time Talmoor's daughter Arihnda Pryce was in her mid thirties, she took a more active role in managing her parents' company."}, {"tag": "h3", "text": "The takeover"}, {"tag": "p", "text": "During the early Imperial Era, Governor Ryder Azadi owned a 30 percent stake in the company. Desiring a controlling stake in the company, Governor Azadi sent his aide Arik Uvis to purchase a 21 percent in Pryce Mining; giving him a controlling stake. When Arihnda rejected his offer, Governor Azadi had Arihnda's mother Elainye framed for embezzlement."}, {"tag": "p", "text": "Arihnda turned to Lothal's Senator Domus Renking for help. To clear Elainye's name, Senator Renking convinced Arihnda to frame Pomi. Seeking an opportunity to expand his own business interests, Renking coerced Arihnda into selling the company to the Galactic Empire under the pretext of keeping it out of Ryder's hand. In secret, Renking planned to keep ten percent of the profits from Pryce Mining for himself."}, {"tag": "p", "text": "As compensation, Senator Renking offered Arihnda a job as his aide managing one of his citizen assistance offices on the galactic capital Coruscant. Renking also offered Talmoor and Elainye as foreman and assistant administrator on the mining world of Batonn. Caught between a rock and a hard place, Pryce reluctantly accepted Renking's offer but vowed to settle scores with him."}, {"tag": "h3", "text": "Liquidation"}, {"tag": "p", "text": "A few years later, Pryce ascended to the Governorship of Lothal after helping to expose the insurgent leader Nightswan's spy ring on Coruscant. After completing her internship on Coruscant, Pryce returned to Lothal to assume office. There, she learned from industrial Minister Maketh Tua that Senator Renking had exhausted the Pryce family mine's doonium vein, leading to a 20 percent drop in revenue."}, {"tag": "p", "text": "Seeking revenge against Senator Renking for exploiting her on Coruscant, Governor Pryce shut down the company on the pretext that it was no longer profitable. She instructed Minister Tua to transfer the workers to other mining projects based on their seniority. Since Renking drew a ten percent cut from the company, he objected to the liquidation of Pryce Mining and vowed to bring his own experts. However, Pryce reasserted her authority over her former tormentor by reminding him that she was protected by powerful Imperial decision-makers."}, {"tag": "p", "text": "In secret, Governor Pryce knew that half of the doonium vein remained and allowed Renking's competitor the Anx Eccos to extract the remainder as a jab at Renking."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pryce Mining first appeared in Timothy Zahn's 2017 novel Thrawn, a rebooted Canonical origins story of the eponymous character. Pryce Mining was first illustrated in Thrawn 3, a comic adaptation of the novel released on April 11, 2018. Pryce Mining was written by Jody Houser, drawn and inked by Luke Ross, and inked by Nolan Woodard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}