{"url": "Psychometry/Legends", "categories": ["Category:Legends articles", "Category:Sense powers"], "nodes": [{"tag": "h1", "text": "Psychometry"}, {"tag": "p", "text": "Psychometry, also known as postcognition, tai vordrax or telemetry, was a Force power that was a mental technique of picking up impressions and traces of information about the object touched and the events that have surrounded it."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "This power allowed the user to view events as if they were there, including the sights, sounds, and feelings, both emotional and physical, that the wielder of the object experienced. This power was easier to use on personal objects that were used frequently. Objects that were used once or by several people often made the use of this power difficult, though it was still possible. This skill was useful for tracking, though it was not useful in open battle and would fail to render useful information at times."}, {"tag": "p", "text": "The power could taint the user if the object had been used to execute dark-side-related actions, like murder. Wielders of the Dark Side could use it on living beings, ripping memories from their brains (see Drain Knowledge)."}, {"tag": "p", "text": "The Jedi Council strongly discouraged the use of psychometry on dead bodies, as the emotions prior to a violent death were so strong that the deceased would have likely brushed with the dark side. This endangered Jedi by exposing them to these powerful emotions. Additionally, at the time of the Invasion of Naboo, the Jedi Council frowned upon excessive use of this power, as it allowed the user to experience intense emotions, which might make him or her more susceptible to the dark side of the Force. Extreme cases caused the psychometric's mind to become trapped, and rarer still, caused death."}, {"tag": "h2", "text": "Users"}, {"tag": "p", "text": "About one in one hundred Kiffar were able to use this power. The Vos line of Kiffar had more than their share of psychometrics. Most with this ability became Kiffu Guardians. Quinlan Vos often used psychometry, being the Kiffar of his time most skilled at it."}, {"tag": "p", "text": "The Dark Jedi Boc Aseca was adept with this skill."}, {"tag": "p", "text": "As a young man, Luke Skywalker visited the Valley of the Spirits. His untrained psychometric abilities gave him enough insight into the massacre that he could read some of the scene and know where Shmi Skywalker Lars had been restrained. The experience unsettled him to the point where he described it as \"worse than a nightmare.\""}, {"tag": "p", "text": "Years later, when Leia Organa was kidnapped by Han Solo as part of an attempt to woo her, Luke Skywalker used this ability to track Han's emotional \"scent\" to the casino where he had won the planet Dathomir from the Drackmarian warlord Omogg."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}