{"url": "Aveca_Dunn", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Females", "Category:Humans", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Aveca Dunn"}, {"tag": "p", "text": "Aveca Dunn, also known as Vex, was a female Human freelance spy who often worked for the Bothan Spynet, but also worked for Imperial Intelligence. In 3 BBY, she was hired by Rodas Borgin to kidnap Bron Dooku but was stopped by her former lover Jahan Cross."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vex was a freelance operative who often worked for both the Bothan Spynet and for Imperial Intelligence. She also became a lover to Imperial agent, Commander Jahan Cross."}, {"tag": "p", "text": "In 3 BBY, Vex was hired by Duke Rodas Borgin to kidnap Count Bron Dooku. In her first attempt she hired the services of a lover, Captain Ramchak and his crew of the Bloodskull to attack the Windrunner while she would take the young Count. However her former lover, Cross was onboard the Windrunner. Vex was able to take the young Count unconscious to one of Ramchak's starfighters"}, {"tag": "p", "text": "However she was pursued by Cross. Vex then took the young Count to the freighter Starhaven at the Carannia Spaceport. Once there she was confronted by Cross, who disabled the ship. Vex tried to fight Cross, but was subdued by him, and then they shared a kiss. Cross was able to convince her to act comatose and to await her rescue. Vex was them taken to the Spike for interrogation. Soon, Vex was rescued by Cross. Vex put on a guard's uniform and the two of them made their way out. Unfortunately, Vex was discovered by Count Dooku's Security Chief, Captain Candra Tymon, but Cross was able to knock her out. They were able to escape the Spike by getting Tymon to a med center. Vex was then able to get off planet. Before leaving, Vex told Cross that Duke Borgin was the one who hired her."}, {"tag": "p", "text": "Vex then hired bounty hunter Boba Fett to finish her job of kidnapping the young Count. This was in fact done at the behest of Jahan Cross as part of his scheme to fake Bron's death, although Fett believed that Borgin actually hired him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The cover of Agent of the Empire – Hard Targets 3 depicts Vex with red hair. However, internally she is consistently depicted with brown hair. The cover also incorrectly depicts Alessi Quon's skin color."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}