{"url": "Prozzen_Fosky", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bith", "Category:Force-sensitives", "Category:Males", "Category:Musicians"], "nodes": [{"tag": "h1", "text": "Prozzen Fosky"}, {"tag": "p", "text": "Prozzen Fosky, also known as Prozzen \"Mozzy\" Fosky, was a male Bith jazz musician who lived on the Bith homeworld Clak'dor VII. Despite the fact that he was a legendary mozz box performer to music aficionados in the Outer Rim Territories and the Mid Rim, Fosky was practically unknown to the public. While going between various jobs, Fosky frequently became embroiled in shady dealings and unknowingly used his connection to the Force to influence people to help him out of dangerous situations where he could have been killed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Bith male named Prozzen Fosky lived on the Bith home planet of Clak'dor VII. He was a skilled mozz box performer who played jazz music and was sometimes called Prozzen \"Mozzy\" Fosky. Although he was extremely well-liked by music connoisseurs in the Mid Rim and Outer Rim Territories, Fosky was largely unknown by the general public. Due to his position, Fosky was frequently without credits to spend."}, {"tag": "p", "text": "During his career, he played in situations ranging from a few people in a tapcafe to private audiences and even large music halls. In between his jobs as a musician, Fosky was a participant in many marginally illegal activities where his life was put in danger. Due to his unconscious use of the Force to influence people and his large number of friends, Fosky was able to avoid being killed during times of danger."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Prozzen Fosky was a highly skilled mozz box performer, and was able to perform for both small informal gatherings and at large audience halls. He was fluent and literate in Galactic Basic Standard, the Bith language, and Huttese, while he was also able to speak Bothese, Durese, the Neimoidian language, Rodese, the Twi'lek language, and the Zabrak language. Although he did not know that he was Force-sensitive, Fosky still was able to unconsciously use the Force to influence others into helping him out of his problems."}, {"tag": "p", "text": "In addition to his Force abilities, Fosky was also adept in deceiving and persuading others in conventional ways. He was additionally skilled in using computers, and unlike most Biths, Fosky was not a pacifist and was marginally skilled in using blaster pistols. While he was often mixed up in illegal activities and was nearly always short on funds, the main things that Fosky thought of as important were the stories he told and the music he played for other people."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Prozzen Fosky owned a high quality mozz box for his performances. He also had a sporting blaster pistol for personal defense."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Prozzen Fosky is featured in Geonosis and the Outer Rim Worlds, a 2004 sourcebook written by Craig R. Carey, Jason Fry, Jeff Quick, and Daniel Wallace, for the revised edition of the Star Wars Roleplaying Game by Wizards of the Coast. Fosky is featured in the book as a non-player character in the section of the book about Clak'dor VII. Due to the fact that Fosky is intended to be usable as a non-player character in any era, it is impossible to determine in which timeframe Fosky lived."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}