{"url": "Pulsemass_generator", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Gravitational technology", "Category:Hapes Consortium", "Category:Hyperspace technology"], "nodes": [{"tag": "h1", "text": "Pulsemass generator"}, {"tag": "p", "text": "The pulsemass generator was a type of technology developed by the Hapes Consortium."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "These generators were developed by the Hapans from Imperial gravity well projectors. These variants of the gravity well technology were deployed as mines in hyperspace[source?] where they created a false image of realspace masses. Thus, starships were kept in realspace near the generators or brought them out of hyperspace near them."}, {"tag": "p", "text": "The pulsemass generator were noted as being small devices that were launched from firing tubes on a vessel. The Hapan Battle Dragon carried them and their use of the weapon resulted in a similar effect to those of the large gravity well projectors on an Immobilizer 418 cruiser. A Hapan Battle Dragon features four tubes with four pulsemass mines per tube, each mine works for some minutes within a short radius."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Only Hapans made frequent use of this technology and they restricted it to military use."}, {"tag": "p", "text": "A Hapan fleet deployed pulsemass generator mines during the Battle of Dathomir, a risky tactic that blocked hyperspace travel for ten to fifteen minutes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pulsemass generator is the name used in The Courtship of Princess Leia, however Cracken's Threat Dossier names it pulse mass generator while Starships of the Galaxy calls it mass pulse generator."}, {"tag": "p", "text": "Each mine lasts 1 minute according to Starships of the Galaxy, but Starships of the Galaxy, Saga Edition states 10 minutes."}, {"tag": "p", "text": "The Hapan pulsemass generator works on a similar principle as the Imperial Hyperspace pulsemass generator, deploying mines, however the Imperial device destroys enemy starships instead of blocking hyperspace travel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}