{"url": "Aven_Rolk", "categories": ["Category:Legends articles", "Category:Individuals of unspecified species", "Category:Jedi Purge survivors", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Aven Rolk"}, {"tag": "p", "text": "Aven Rolk was a male Jedi Knight serving the Jedi Order and the Galactic Republic during the final decades of the Republic Classic era. Surviving the execution of Contingency Order 66 after being stranded in an escape pod frozen, Jedi Rolk tried and failed to reestablish the Jedi Order on Zissh."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Aven Rolk was a Jedi Knight and a member of the Jedi Order during the reign of the Galactic Republic. At some point during his service to the Order, Rolk was forced into an escape pod and placed into suspended animation in a stasis field. During his time in stasis, the Clone Wars consumed the galaxy, and when the conflict ended, both the Republic and the Order had been destroyed and the Galactic Empire and the Dark Lords of the Sith reigned freely over civilized space."}, {"tag": "p", "text": "Later, during the Galactic Civil War between the Empire and the Alliance to Restore the Republic, Rolk was freed from his drifting prison and brought up to speed on galactic events. Determined to rebuild the Order, Rolk attempted to summon all surviving Jedi to the frozen world Zissh where he planned to construct a new Temple and overthrow the Empire. As news spread of his ambitious plan, even the up and coming hero of the rebellion, Force-sensitive Luke Skywalker planned to answer the summons. However, before Rolk's movement could gain much momentum, the Empire heard of his plot and decided to eliminate him. Led by Darth Vader, a group of Dark Side Adepts hunted down Rolk and murdered him, leaving his body in an ice cave far in the world's frozen wastelands. While dead, Rolk's spirit lingered, wandering the desolate ice fields and waiting for the return of the Jedi."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}