{"url": "Pummel", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Energy pummels"], "nodes": [{"tag": "h1", "text": "Pummel"}, {"tag": "p", "text": "Pummels, or Energy Pummels, as many soldiers dubbed them, were large tank-like siege engines in use by many organizations, civilizations, and factions from the time before the Clone Wars and throughout the Galactic Civil War."}, {"tag": "p", "text": "Pummels utilized powerful short-range laser panel arrays to grind down enemy defensive fortifications, including walls, antipersonnel turrets, and even localized ground-based shields, allowing lighter units and infantry to breach strong points and engage entrenched enemy forces. Though heavily armored, pummels were also very slow and vulnerable to land and air-based attacks; to compensate for this, pummels were often sent into battle either heavily escorted, or once the enemy's mobile opposition had been dealt with and/or distracted."}, {"tag": "p", "text": "There were two types of energy pummel; a standard version, and a heavy version which was larger, sported thicker armor and inflicted greater damage due to the addition of more and/or larger laser panels."}, {"tag": "p", "text": "Functionally speaking, there was little difference between the various pummels used by the Rebel Alliance, Empire, Wookiees, Trade Federation, Grand Army of the Republic, and Royal Naboo Security Forces beyond their appearance, and the same held true for their heavier counterparts. The only exceptions to this were the pummels donated to the CIS by the Corporate Alliance, which had their speed increased by Geonosian engineers."}, {"tag": "p", "text": "The Gungans on the planet Naboo used a living creature known as a Cerrabore in the same role as a pummel, with larger specimens serving as the equivalent to a heavy pummel."}, {"tag": "p", "text": "They were very similar to the aquatic destroyers seen on the water, which used similar laser panels to literally dissolve enemy ships at a very close range."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pummels appear in the 2001 video game Star Wars: Galactic Battlegrounds, as well as its 2002 expansion pack, Clone Campaigns. The Star Wars: Galactic Battlegrounds: Prima's Official Strategy Guide uses a picture of the Wookiee Energy Pummel as an example of this type of unit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}