{"url": "Pulsipher", "categories": ["Category:Legends articles", "Category:Biologists", "Category:Humans", "Category:Males", "Category:Mandalorian Neo-Crusaders"], "nodes": [{"tag": "h1", "text": "Pulsipher"}, {"tag": "p", "text": "Pulsipher was a member of the Mandalorian Neo-Crusaders whose fascination with Force artifacts led him to unearth the powerful Sith relic known as the Muur Talisman during the Mandalorian Wars. Originally assigned as the assistant to the notorious Mandalorian scientist Demagol, Pulsipher reluctantly aided in Demagol's experiments on captured Jedi, believing the doctor's efforts to discover the source of Jedi abilities to be pointless—Pulsipher believed that the Force was a myth and Jedi powers were derived from magical possessions, and he became fixed on one in particular: the Muur Talisman, which be believed to be on the Outer Rim world of Taris. Pulsipher gathered a survey team and went to Taris in search of the artifact after the Mandalorians captured the world, and managed to unearth the Talisman deep within the planet's Undercity. However, after bringing the Muur Talisman back to the Mandalorian staging point of Jebble, Pulsipher realized exactly what he had gotten into. The Talisman, moving with a mind of its own, bonded with Pulsipher and transformed the Mandalorians around him into mindless rakghoul beasts that he controlled. Pulsipher embraced the power of the Talisman as a way to earn respect and unite all under the Mandalorian banner, but was killed by the mutants he once commanded when the Talisman abandoned him for a more suitable host, Jedi Shadow Celeste Morne."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Pulsipher served in the rampaging army known as the Mandalorian Neo-Crusaders during their war with the Galactic Republic several millennia before the Battle of Yavin. After several years of cold conflict, Mandalore the Ultimate began the attack on the Republic in earnest in 3963 BBY. As the Mandalorians sped towards the Outer Rim Republic planet Taris, the Mandalore assigned Pulsipher to be an assistant to the notorious scientist Demagol in his experiments upon captured Jedi in an outpost on the airless world of Flashpoint—the two often clashed in their efforts to study the source of Jedi Force powers, as Pulsipher believed their abilities stemmed from their possessions. Pulsipher was present when former Jedi Padawan Zayne Carrick and rogue Mandalorian warrior Rohlan Dyre successfully faked a Republic attack, captured Demagol and convinced the Mandalorians to abandon their outpost, and was among those who escaped Flashpoint. Pulsipher was later reassigned to the Mandalorian rallying point of Jebble, where he was given his own laboratory at the top of the planet's Ice Citadel and toiled in vain to earn the same type of respect from Mandalore the Ultimate that Demagol had. Searching for something to make his name, Pulsipher deciphered a series of half-purged Jedi transmissions convinced Pulsipher that the rakghoul-infested wasteland known as the Undercity might contain an ancient Sith artifact: the Muur Talisman, which was enough for Pulsipher to gather a survey team and travel to Taris in the shuttle Mar'eyce."}, {"tag": "p", "text": "After arriving on Taris, and after extensive mining activity in the Undercity's depths, Pulsipher found his prize: the Muur Talisman, buried under meters of rock piled up by a cave-in decades before. Pulsipher also managed to find several other Sith artifacts, including the life-preserving Dreypa's Oubliette, which he added to his haul. Thrilled with his find, Pulsipher gathered his team and returned to Jebble, finding only disrespect from the \"real\" Mandalorian warriors who welcomed him home. Pulsipher believed the Muur Talisman contained some sort of power, but was not sure exactly what it did—he learned when Jedi Shadow Celeste Morne, who was tracking the Muur Talisman and had stowed away on the Mar'eyce, attempted to mind trick Pulsipher into throwing the artifact out the ship's airlock. Pulsipher's rejection of Morne's Force suggestion and resolution to keep the Talisman for himself triggered something in the ancient amulet, as the previously lifeless medallion began to move and fuse itself to Pulsipher's arm. Briefly overcome by the Talisman's power, Pulsipher killed one of his crewmembers with a single touch, and was frightened to realize he could no longer remove the Muur Talisman from his left hand. Afterward, several of his survey team had to help a weakened Pulsipher to the Ice Citadel, which had become the Neo-Crusaders' headquarters on a world that was a staging point for millions of newly enlisted Mandalorian warriors."}, {"tag": "p", "text": "Although Pulsipher was hoping to quickly remove the Talisman and feel better, but he soon realized that the real power of the Talisman had already been unleashed, when the Mandalorians who had been with him on the Mar'eyce began transforming into rakghouls and quickly spreading their plague to the people around them. The Mandalorian rakghouls—whom, as the holder of the Muur Talisman, Pulsipher commanded—quickly ripped through the uninfected Mandalorians on Jebble and converted them into mindless beasts. No longer afraid of the Talisman's power, Pulsipher instead saw a way that he could complete the Mandalorian crusade and bring every living being into his clan. However, he could tell that he had only scratched the surface of the Talisman's power. A stray transmission led him to Zayne Carrick, who had stowed away with Morne on the Mar'eyce, and Pulsipher had his rakghouls capture the former Padawan in the hopes that Carrick could help him unlock the true potential of the artifact. Carrick refused to play along, and as Pulsipher threatened to place him in suspended animation within Dreypa's Oubliette, the Talisman began to move and separated itself from his body. No longer in possession of the Muur Talisman—which moved onto a more worthy host, Celeste Morne—Pulsipher was swiftly ripped apart by the same rakghouls he commanded only moments before."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Always finding himself in the shadow of Demagol or master strategist Cassus Fett, Pulsipher was driven by his desire to prove his worth and earn the respect of Mandalore the Ultimate. Pulsipher was best known to most Mandalorian warriors as Demagol's assistant and not as a \"real warrior,\" a label at which he chafed—Pulsipher saw his pursuits as just as important as military conquests, and that finding the Muur Talisman was an even greater prize than seizing Taris itself. His relationship with Demagol was an often hostile one, as while they shared an interest in the powers of the Jedi, Pulsipher believed their abilities came from magically-imbued objects, an idea that Demagol ridiculed. In turn, Pulsipher, who did not believe the Force existed at all, derided Demagol's experiments on Jedi, which he saw as completely pointless. Pulsipher's fascination with Jedi possessions drove him to pursue the Muur Talisman, taking it as self-evident that seizing the Jedi's magical tools would ultimately give the Mandalorians victory. After seizing and bonding with the Talisman, Pulsipher was initially frightened by the amulet's power, but soon began to see its potential as a tool to achieve the goal of unifying all beings under the Mandalorian banner and finally earning the trust and respect of the Mandalore. Despite that, Pulsipher never understood the true power or properties of the Muur Talisman, and died being ripped to shreds by a group of rakghouls he believed he still controlled after the Talisman deserted him. Pulsipher had blond hair that was thinning out by 3963 BBY, along with gray eyes and light skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pulsipher first appeared in Knights of the Old Republic 10, an issue of the Knights of the Old Republic comic book series, written by John Jackson Miller and released in 2006. The name \"Pulsipher\" was an invention of Miller's, a result of him putting together \"some creepy-sounding syllables.\" After a brief appearance in Flashpoint, Pulsipher later reappeared as a major supporting character in the later story arc Star Wars: Knights of the Old Republic: Vector, which ran in 2008. During his appearances in Knights of the Old Republic, Pulsipher was illustrated by Dustin Weaver and Scott Hepburn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}