{"url": "Avenger", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Imperial II-class Star Destroyers of the Galactic Empire", "Category:Starships of Death Squadron"], "nodes": [{"tag": "h1", "text": "Avenger"}, {"tag": "p", "text": "The Avenger was an Imperial II-class Star Destroyer in the Imperial Navy's Death Squadron, under the command of Captain Lorth Needa. As a part of the Galactic Empire's Project Swarm, the Avenger was responsible for deploying thousands of Viper probe droids across the galaxy in hyperdrive pods, in an attempt to discover the Rebel Alliance's secret base."}, {"tag": "p", "text": "In 3 ABY, one of the probes deployed from the Star Destroyer reached the ice planet Hoth, where the rebels' Echo Base was hidden. The probe identified the base, which led to the Empire forcing the rebels off the world.  After the battle, the Avenger took part in the pursuit of the Millennium Falcon in the Hoth asteroid belt."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An Imperial II-class Star Destroyer, the Avenger was equipped with a hangar bay, a communications tower, a solar ionization reactor, and two deflector shield generator domes. Measuring 1,600 meters long, it was propelled by three destroyer-I ion engines and four emergency use gemon-4 ion engines. The Star Destroyer carried with it numerous hyperdrive pods containing Viper probe droids."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Project Swarm"}, {"tag": "p", "text": "In 3 ABY, the Avenger was owned by the Imperial Navy, and commanded by Captain Lorth Needa. It was involved in Project Swarm, an Imperial operation to dispatch Viper probe droids across the galaxy in order to locate the Rebel Alliance's secret base, from which they waged war on the Empire. During its assignment to the project, the Star Destroyer seeded thousands of probe droids."}, {"tag": "p", "text": "At one point that year, the Avenger flew over the ice planet Hoth, the sixth planet of the Hoth system. There, it dispatched at least eight of the probe droids in hyperdrive pods, which could enter hyperspace independently. At least one of the pods it dispatched was sent to Hoth itself, which was the location of the rebels' Echo Base. The pod's probe droid soon identified the base and alerted the rest of Death Squadron, prompting the fleet to engage the rebels on Hoth, and eventually drive them off the planet."}, {"tag": "h3", "text": "Pursuing the Millennium Falcon"}, {"tag": "p", "text": "Following the battle, the Avenger and the rest of Death Squadron pursued the rebel vessel Millennium Falcon, although its captain, Han Solo , evaded the Star Destroyer. The Falcon flew further into the asteroid field evading TIE fighters. To answer a call from Emperor Palpatine, the Executor left the asteroid field. After the Millennium Falcon  underwent repairs in an asteroid cave, it was sighted by the Avenger's Captain  Lorth Needa.He ordered the ship to fire and landed a shot on the Falcon's stern. Solo turned his ship around and charged the Star Destroyer, heading towards the bridge. Needa ordered for the shields to be raised but lost the  Falcon. The rebel ship had hidden itself on the back of the Avenger's conning tower in a sensor blind spot. Needa decided to take full responsibility for losing the Millennium Falcon and left to apologize to Vader. Aboard the Executor, Vader ordered to disperse the fleet after killing Captain Needa. Following standard Imperial procedure, the Avenger dumped its garbage and flew into hyperspace while the Millennium Falcon detached and \"drifted away with the garbage\"."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Avenger first appeared in the opening scene of the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. Although Star Wars Character Encyclopedia: Updated and Expanded and Star Wars Helmet Collection 9 both identify the Star Destroyer that deployed the probe droid to Hoth as the Avenger, Star Wars: Complete Locations conversely calls the vessel the Stalker, which was the name of the ship in the Star Wars Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}