{"url": "Pursal", "categories": ["Category:TOR dates usages without act argument", "Category:Legends articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Pursal"}, {"tag": "p", "text": "Pursal was a lieutenant who served aboard the passenger liner Stardream on its final voyage in 3639 BBY when it became infected with the rakghoul plague. In charge of the ship's log, Pursal recorded the final days of the Stardream and its passengers before it crashed on the planet Tatooine."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Pursal lived during the Galactic War between the Galactic Republic and the Sith Empire, and held the rank of lieutenant on the passenger liner Stardream. In 3639 BBY, the Stardream departed the planet Ord Mantell with 492 civilian passengers under the command of Captain Magnus, and Pursal was in charge of maintaining the ship's official log. On the fifth day, food poisoning cases were reported, but by the seventh day the illness—in actuality the rakghoul plague—had spread among the passengers, causing decks 1-5 to be quarantined."}, {"tag": "p", "text": "Two days later, Pursal had become infected as well, and recorded that Magnus had fallen ill and lost his mind as a result, seizing control of the bridge and sending the Stardream off course. Three days later, Pursal made a final entry in the log, reporting that the starship was lost in hyperspace and that the crew was going to attempt to retake the ship from Magnus's control. The Stardream ultimately crashed on the planet Tatooine, and Pursal's log was partially reconstructed from the wreckage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pursal was mentioned in the Codex entry \"The Final Flight of the Stardream\", part of the Rakghoul Pandemic World Event that was added to the video game Star Wars: The Old Republic in 2012 with Game Update 1.1."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}