{"url": "Pursuit_of_Peace", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Pursuit of Peace"}, {"tag": "p", "text": "\"Pursuit of Peace\" is the eleventh episode of the Star Wars: The Clone Wars television series' third season. It aired on December 3, 2010. This episode chronologically takes place before \"Senate Murders.\""}, {"tag": "h2", "text": "Official summary"}, {"tag": "p", "text": "\"Padmé, Bail Organa and Onaconda Farr attempt to rally Senators in opposition to a bill that would appropriate funds for millions of new clone troops and have disastrous financial consequences for the Republic. Their opposition to the measure, however, soon makes them targets for intimidation and attacks by hired guns. After escaping two hired thugs — Chata Hyoki and Robonino — in a harrowing speeder bike chase, Padmé, is able to sway the Senate with a stirring account of how the war has affected an everyday civilian, her handmaiden Teckla Minnau.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The droid suicide attack has dramatically swung the Senate towards continuing the war and funding the creation of more clone troopers. Padmé Amidala desperately tries to convince her fellow senators that not all Separatists are warmongers, but this turns the general mood against her. In addition, Count Dooku suddenly contacts the Senate and declares that the Republic forces have carried out a devastating attack on Confederate territory, killing Mina Bonteri in the process (though the Republic contends that she was murdered by Dooku's agents for her peace efforts), and officially withdraws the Confederate Senate's peace proposal, further agitating the diplomats."}, {"tag": "p", "text": "In a private conversation afterward, Padmé, Onaconda Farr, and Bail Organa decide to approach the Banking Clan for a loan for more logistic supplies in order to gain some means of fighting the deregulation bill. From the Banking Clan representative, Padmé and Farr learn to their outrage not only that the Clan is charging the Republic an extraordinarily high interest rate of 25 percent, which by itself would drain public funds for many of their social programs, but also that they are financing more than three million Separatist battle droids as well. Also, Senator Organa tells Padmé that several of the more upright senators were threatened into voting in favor of the bill, which frightens other senators so much that they decide not to fight the bill, the alternative being ending up like Bonteri."}, {"tag": "p", "text": "The same night, Farr is accosted and brutally beaten by bounty hunters Robonino and Chata Hyoki but doesn't back down from his decision to fight the bill, making Count Dooku urge the two deadbeats to employ some more drastic measures. The next night, Padmé asks Organa to speak to the assembled Senate and present the facts, while Padmé tries to personally approach those still undecided. After she and Farr pay a rather futile visit to Senator Christo, Padmé decides to take a walk to relax her mind. Robonino and Hyoki assault her, but two police droids buy her just enough time to prevent worse. Bereft of her driver, she promptly mounts a nearby speeder bike and manages to shake off her attackers in a vicious chase, but that results in the police taking an undue interest in her, and Padmé is held up while the thugs escape. Back in her quarters, Padmé is taken care of by the handmaiden Teckla Minnau, who expresses her admiration to the senator. Upon learning that Teckla's family is severely affected by the war, the two young women get into a talk."}, {"tag": "p", "text": "The next morning, Robonino and Hyoki attack Senator Organa as well. Organa manages to summon his guards and the police, and the two thugs are arrested, but he is severely injured in the struggle and therefore asks Padmé to deliver his speech. After some encouragement by Teckla and Farr, Padmé steps before the Senate and delivers an impromptu and passionate speech, recounting the problems of the simple people (like Teckla's family) due to the financial strain the war has already brought upon the Republic, arguing that the bill's passage would harm the citizens of the Republic they've sworn to protect. The speech wins reluctant favor and respect from the entire Senate."}, {"tag": "p", "text": "Later in his quarters, Chancellor Palpatine angrily muses to Mas Amedda about the success one passionate voice can have over his own power, showing his true face for the first time. But he decides to wait until fate—and the Senate—will work in his own favor once again."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}