{"url": "Pyrokinesis", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Alter powers"], "nodes": [{"tag": "h1", "text": "Pyrokinesis"}, {"tag": "p", "text": "Pyrokinesis was a Force power that allowed a Force-user to manipulate and generate fire by rubbing and heating up air molecules together."}, {"tag": "p", "text": "The power seemed to have two major applications, the manipulation, and the generation of fire. In generation, a force user typically generated fire from an already existing material. Yarael Poof exemplifies this by being famed for his ability to trigger fires by manipulating the molecules of combustible objects. Leia Organa Solo also demonstrated the ability to generate fire, as shown when she lit several candles through the force—commenting that Luke Skywalker had taught her how to do so."}, {"tag": "p", "text": "In manipulation, a Force user was capable of directing and controlling an already existing flame with relative ease. In 52 BBY, Darth Sidious used the ability to kill Senator Pax Teem, by coaxing a gentle flame from a gas powered fireplace into a raging inferno. Although not directly seen doing so, a dream that Darth Vader had shortly before the Battle of Endor had Sidious creating a wall of fire separating Vader from his son, Luke Skywalker, after revealing his survival. Jedi Master Knol Ven'nari was so proficient in this ability that she was capable of controlling and redirecting an explosion, something that she did in order to save her friends, though at the cost of her life."}, {"tag": "p", "text": "The power was neutral in nature, with both Jedi and Sith showing equal ability in its use. Even other Force traditions, such as the Nightsisters of Dathomir, were known to use the ability. This is shown by Dresdema when she attempted to cast a \"spell of flame\" against attacking Sith, alluding to the existence of a Nightsister equivalent power of Pyrokinesis. Asajj Ventress used this power to make surrounding flames part and create a path she could pass by without any injury, then let them reunite as she prepared to fight Anakin Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}