{"url": "Pythea", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Scout starships"], "nodes": [{"tag": "h1", "text": "Pythea"}, {"tag": "p", "text": "The Pythea was an exploratory ship owned by Panha, a female Chiss, and Sarkkin, a male Wookiee. In 25 ABY, the ship intercepted a fleet crewed by the Yuuzhan Vong—a species of extragalactic invaders—bound for the planet Artorias. The crew of the Pythea attempted to contact Artorias, but they were at such a distance that the crew had to reroute all power to the transmission to send it successfully. Realizing the Yuuzhan Vong wanted to take them alive rather than kill them, Panha and Sarkkin sacrificed themselves by ramming the ship into a Miid ro'ik cruiser to prevent the Yuuzhan Vong from capturing them. The message to Artorias, however, was in vain, as the being who had received it, Dulac, was in actuality a Yuuzhan Vong spy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Pythea was an exploratory ship that was colored red and had several long blaster cannons on the front and back of the cockpit. The cockpit also housed the piloting equipment. The ship was equipped with a hyperdrive, a cargo hold, deflector shields, scanners, and communications equipment. The Aurebesh letters \"Usk\" and \"Dorn\" were emblazoned on the side of the ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 25 ABY, the Pythea was on an exploratory mission when the female Chiss Panha and the male Wookiee Sarkkin, the owners and operators of the vessel, received a transmission from Arbeloa, the last surviving member of the Cilare. Arbeloa's message warned them about the extragalactic invaders known as the Yuuzhan Vong, whose fleet had obliterated his homeworld. At the same time, the Pythea's long-range scanners detected the incoming fleet. The crew attempted to send a transmission to Artorias, the first inhabited planet in the fleet's trajectory, but they were too far away for it to be received. Deciding that it was more important to get closer and warn Artorias than it was to escape, the crew of the Pythea edged the ship toward the Yuuzhan Vong fleet and rerouted all power to the transmission. Noticing the vessel, the Yuuzhan Vong sent several ships commanded by Azca to intercept the Pythea."}, {"tag": "p", "text": "Before the Pythea could defend itself against the incoming vessels, Yorik-Vec ships began to fire on the exploratory ship. While the Yuuzhan Vong began to breach the Pythea's hull, the transmission finally reached Artorias. Panha and Sarkkin informed Dulac, the transmission's recipient and friend to the planet's king, of the fleet and sent to him all of the data that they had gathered on the armada as well. After Dulac received the information, the Yuuzhan Vong successfully penetrated the Pythea's hull and warriors began to board the vessel. The boarding party was killed by the crew, and—realizing that the Yuuzhan Vong wanted to take them alive rather than kill them—Panha and Sarkkin rammed the Pythea into a Miid ro'ik cruiser. The impact destroyed both the cruiser and the Pythea, as well as several Yorik-Vecs nearby. The Pythea's sacrifice became one of the first strikes against the Yuuzhan Vong during their invasion of the galaxy. The warning to Artorias, however, was in vain, as Dulac, the being who received the message, was in reality a Yuuzhan Vong spy. Because of this, the Yuuzhan Vong attack on Artorias took the planet's population by surprise, allowing the invaders to conquer the world."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Pythea was owned and operated by Panha and Sarkkin until their deaths and the ship's destruction."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Pythea first appeared in Refugees, Prologue, an online preview of Star Wars: Invasion, a comic series published by Dark Horse Comics. The preview was released on May 8, 2009, on the official Star Wars website."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}