{"url": "Pyria_system", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Alsakan star systems", "Category:Colonies star systems", "Category:Galactic Empire star systems", "Category:Galactic Republic star systems", "Category:Imperial Remnant star systems", "Category:New Republic star systems", "Category:Yuuzhan Vong empire star systems"], "nodes": [{"tag": "h1", "text": "Pyria system"}, {"tag": "p", "text": "The Pyria system, also known as the Borleias system, was a star system located in the Colonies region of the galaxy, at the edge of the Galactic Core. Centered around the star Pyria, it included the planets Borleias and Pyria VI, the Blackmoon, as well as the Versieds asteroids. It was located only hours from the Mirit and Venjagga systems."}, {"tag": "p", "text": "The New Republic codenamed it the Blackmoon system and Phenaru system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 27 BBY, the Outbound Flight expedition traveled through the system on its voyage from Yaga Minor to the Unknown Regions."}, {"tag": "p", "text": "The system's fourth planet and only inhabited world was Borleias. During the Galactic Civil War, it was the base of operations for Imperial General Derricote. After the New Republic routed the Imperials, it fortified Borleias as a forward base even as ships sent by Warlord Zsinj began making reconnaissance raids into the system."}, {"tag": "p", "text": "In 27.5 ABY, during the Yuuzhan Vong War, Borleias served as a New Republic fortress. Its lose led to the Battle of Coruscant. The system was later the site of a significant battle, which saw the annihilation of a large Yuuzhan Vong contingent including the Domain Hul worldship and consequently a morally important New Republic victory."}, {"tag": "p", "text": "In 40 ABY, Jacen Solo offered the system to the Imperial Remnant if they supported the Galactic Alliance at the Second Battle of Fondor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}