{"url": "Q%27anah_(pirate)", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Articles in need of updating", "Category:Brentaalans", "Category:Cyborgs", "Category:Females", "Category:Humans", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Q'anah  (pirate)"}, {"tag": "p", "text": "Q'anah was the assumed name used by a female human who led the Senex-Juvex pirate group known as Q'anah's Marauders. The daughter of a former bodyguard, she fell in love with a young noble from House Elegin of the planet Asmeru and joined the pirate crew he secretly led. Following his death, however, she took charge of the crew and sought revenge on the ships and settlements of the Senex-Juvex worlds, earning a name for herself and becoming a folk hero."}, {"tag": "p", "text": "Following a violent encounter with the Judicial Department, Q'anah and her men were forced to relocate to the Greater Seswenna region of the galaxy where they began to prey upon the lommite shipments from the planet Eriadu. The Marauders were hugely successful in their lommite raids for sometime, using a pattern devised by Q'anah which essentially spelt out her name across each shipment. The pattern was eventually worked out by a young Outland Regions Security Force lieutenant named Wilhuff Tarkin, who used the information to predict the Marauders raids. Using a virus rigged into the cargo containers Q'anah tried to steal, the security forces were able to capture her and execute her by leaving her on a ship programmed to fly into a nearby sun."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A noble's mistress and a pirate queen"}, {"tag": "p", "text": "This female human was born on the Core World planet Brentaal IV as the only daughter of a former bodyguard for House Cormond. After her birth, her father received a lucrative offer to leave the Core and oversee security for House Elegin on the planet Asmeru, which he accepted. The daughter moved with him to the world, where she adopted a new name, Q'anah, which in an ancient language native to Asmeru referred to a festival celebrated on the 234th day of the planet's 16th month. While on Asmeru, she fell in love with the youngest son of the House her father served and became his mistress. The young noble lived a double life leading a group of pirates which Q'anah eventually joined up with and fought alongside. While serving with her lover's crew, she gave birth to his triplets, but the father of her children was eventually captured and sentenced to death, being executed on the planet Karfeddion."}, {"tag": "p", "text": "Following the death of her lover, Q'anah took lead of his crew, who became known as Q'anah's Marauders, and began targeting starships and settlements across the Senex-Juvex sectors and, due to her audacious raids, became a folk hero in the Senex. During this time she became the subject of many HoloNet News stories and rumors, surviving starship collisions, starfighter crashes, blaster-bolt and vibroblade wounds, fistfights, and personal duels. On one occasion she became stranded on an isolated moon while awaiting rescue and was forced to chew off her own infected hand. Twice she was captured, but instead of being sentenced to death she was given lengthy sentences in maximum security prisons due to her connections to House Elegin, although both times her pirates rescued her from incarceration. After destroying six vessels in a battle against the Judicial Forces, the Republic placed a bounty on her head which forced her to move to the Greater Seswenna region, where the Judicials rarely patrolled."}, {"tag": "h3", "text": "Raiding in the Greater Seswenna"}, {"tag": "p", "text": "In the Greater Seswenna, the pirate and her crew allied with several other pirate groups who agreed to an alliance in order to prey upon the planet Eriadu's lommite shipments to the Core. One set of pirates would monitor or engage the limited number of vessels of the local Outland Regions Security Force and keep the others informed of their location, meaning Q'anah could safely lead the rest of the Marauders in raids on the poorly protected lommite convoys. The fastest of the Marauder's ships would attack the shepherd vessel accompanying the convoy and any security ships, while others would deliver troops to board five specific slave-rigged cargo containers carrying the lommite. The containers targeted were decided by a simple pattern Q'anah employed using the digits 23416, from the date of the Q'anah festival, with each number linked to a letter from her adopted name. The ships corresponding to these numbers would then be chosen, although the way the pattern was applied varied, sometimes starting at the front vessel, sometimes at the back, sometimes in reverse and sometimes carried over multiple convoys. These containers would then be unslaved from the convoy's shepherd vessel and instead slaved to a pirate vessel, which would lead them away to be pillaged."}, {"tag": "p", "text": "Q'anah and her men would then sell the lommite or turn it over to whatever group had hired them for that specific raid. Eriadu Mining, the company who owned the lommite, eventually accepted that handing over the containers to the Marauders was cheaper than trying to defend them, which almost invariably lead to the loss of expensive company ships. Attempts were made to include dummy or explosive containers, but Q'anah's Marauders never once targeted these traps and they were discontinued due to expense. Eventually a young lieutenant in the Outland Regions Security Force named Wilhuff Tarkin worked out the pattern Q'anah used by spending months studying all her previous raids, and managed to persuade the security forces and mining company of his success, with evidence from several further raids which followed the lieutenant's predictions. Tarkin's cousin Ranulph, a commander in the security force, then proposed that the predicted containers be rigged with a hyperdrive motivator virus which would allow the security force to control the pirate's hyperspace jumps."}, {"tag": "p", "text": "Following the costly implementation of the virus, Q'anah and her crew did not strike for some time; however, when they did finally carry out another raid the virus successfully diverted their ships to travel to a predetermined spot where a large fleet of Outland Region Security Forces' vessels awaited them. 46 years prior to the Battle of Yavin, Q'anah and her men were shackled and brought before the young Wilhuff, whom she mocked and defied, even after realizing he had worked out her pattern. The pirate queen and her crew were then placed in a cargo container which was programmed to fly slowly toward the sun of the system Q'anah had been captured in. Wilhuff had the audio and video feeds from the container left on so that both the security forces and other pirates could witness the Marauder's demise, as all the captured pirates onboard, including Q'anah, were cooked alive by the heat of the sun. Several other Marauder vessels arrived in the star system and attempted to rescue their leader, but all were destroyed on site by security force vessels. Those members of Q'anah's flotilla that didn't perish with her or died trying to save her went into hiding after witnessing her gruesome demise."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Before becoming the mistress of the young Elegin noble, Q'anah was trained in combat by her father, and became eager for adventure. While serving with her lover's crew she lived a colorful and bawdy life, but became bent on revenge against the Senex-Juvex after his death. Rumored to be both incredibly quick on the draw and an extremely flexible dancer, Q'anah inspired great loyalty in her crew, who practically worshipped her and rescued her from imprisonment several times. She was a vain individual and created a pattern for raiding lommite convoys which consisted of spelling out her own name across the vessels. This arrogance lead to her downfall, but even after capture she refused to admit defeat and mocked her captor Wilhuff Tarkin for his age, although she was briefly shocked when she realized he had worked out her raid pattern. When speaking with Tarkin she showed no fear of death and claimed others would replace her, but while roasting in the doomed cargo container she eventually broke and wailed along with the rest of her dying crew."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During her time as pirate queen, Q'anah had two artificial arms and one artificial leg from the knee down. She also had one ocular implant and possibly other cybernetic enhancements. She commanded a pirate flotilla that contained large numbers of corvettes and frigates."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Q'anah first appeared in a flashback to Tarkin's youth in Tarkin, a novel released in 2014 and written by James Luceno. The book does not reveal her birth name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}