{"url": "Q-3PO", "categories": ["Category:Legends articles", "Category:3PO-series protocol droids"], "nodes": [{"tag": "h1", "text": "Q-3PO"}, {"tag": "p", "text": "Q-3PO was a protocol droid that worked as a species relations droid for the Galactic Republic during the Clone Wars. Later he was given to Doctor Deena Kinnet, after she became a spy for the Galactic Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Clone Wars, Q-3PO was a species relations droid for the Galactic Republic. However, due to the droid's many years in foreign and hostile environments, his memory core became riddled with viruses. Seemingly destined to the scrap yard, an unidentified Jedi—with the help of R2-D2—took on the task and successfully repaired him."}, {"tag": "p", "text": "Q-3PO was coated with white enamel that gave it a more \"medical\" appearance. It was actually a collection and transmission droid from which Deena got her information."}, {"tag": "p", "text": "Early in 1 ABY, Q-3PO was stationed on an Imperial space station. Here, he helped an unknown spacer take a shuttle back to his home."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Before the New-Game Enhancements of 2005, Q-3PO actually appeared as a Non-Player Character in the MMORPG Star Wars Galaxies. He was part of a tutorial which helped players get accustomed to the game. He would bring players to a planet of their choice to end the tutorial. He was later removed, however, when the Tansarii Point Station became the new in-game tutorial. Outside the game, Q-3PO was the forum handle for Star Wars Galaxies' first community relations manager, Kevin O'Hara, who left the team after the Jump To Lightspeed expansion released in 2004."}, {"tag": "p", "text": "Q-3PO made a minor appearance in Sony Online Entertainment's 2010 Star Wars MMO, Star Wars: Clone Wars Adventures video game in the minigame Droid Programming."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}