{"url": "Avenue_of_the_Core_Founders/Legends", "categories": ["Category:Legends articles", "Category:Coruscant monuments", "Category:Coruscant roadways", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Senate Building locations"], "nodes": [{"tag": "h1", "text": "Avenue of the Core Founders"}, {"tag": "p", "text": "The Avenue of the Core Founders was a large avenue which served as the ceremonial pathway to the Great Door of the Senate Building on Coruscant. Lined with statues of the original founders of the Galactic Republic from the Core Worlds. Access ways to the Senate Commercial District were located on the Avenue."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Constructed around the Senate Tower on Coruscant, the large avenue bisected the expansive Senate Plaza. Dotted with towering, thirty meter tall impressionistic statues of the all Human Core Founders who drafted the Galactic Constitution, the avenue was flanked by the Gardens of Justice and Equality on either side. Following the attack on Coruscant by the Sith Empire during the final days of the Great Galactic War and the signing of the Treaty of Coruscant, the Avenue of the Core Founders was cleaned up of debris and reopened to the public. Frequented by Senators and their aides, lobbyists, petitioners, and Jedi, the Avenue connected the Coruscant Spaceport during the Cold War, terminating at a transportation terminal."}, {"tag": "p", "text": "Over the next three millennia, the spaceport was removed and the Avenue expanded. During the final decades of the Republic, mounting opposition to the Avenue's Human-dominated statuary plagued the Senate and the Office of the Supreme Chancellor as many Senators from the alien-dominated Mid and Outer Rims found them to be distasteful and narrow-minded, if not speciesist. Senator Palpatine of Naboo himself publicly stated that diversity should be incorporated into the Avenue's statuary; however, even after being elected Supreme Chancellor, he apparently failed to implement his idea."}, {"tag": "p", "text": "During the Chancellorship of Finis Valorum, a large protest took place in the Plaza, with vocal citizens lining the Avenue; some called for the dissolution of the Trade Federation, others for the retirement of the Chancellor for his ineffectual trade policies. As Supreme Chancellor Valorum made his exit from the Senate Building through the crowd of protesters on the Avenue, a band of terrorists attacked him and his contingent of Senate Guards. While the Chancellor sustained injury, the intervention of Jedi Masters Qui-Gon Jinn and Adi Gallia prevented his death and the terrorists were routed."}, {"tag": "p", "text": "Following the fall of the Republic and the rise of the Galactic Empire, the Avenue continued to serve as the main road to the Senate, even after the building's closure during the Galactic Civil War. Years after the Empire's dissolution, the Avenue was ruined during the Battle of Coruscant as the Yuuzhan Vong invaded the galaxy. Under Yuuzhan Vong control, the Avenue became home to a massive and deadly hedge maze designed to keep intruders out of the newly christened Well of the World Brain. Despite the destruction of the Avenue, at least one of the large impressionistic statues survived; it was at one point owned by a group of Colicoids during the reign of the Galactic Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}