{"url": "Pyre", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Colossus garrison members", "Category:Males", "Category:Stormtrooper officers of the First Order"], "nodes": [{"tag": "h1", "text": "Pyre"}, {"tag": "p", "text": "Pyre was a human male who served in the First Order as a stormtrooper commander during the era of the New Republic. He worked closely with agent Tierny to track down the Resistance, specifically the Colossus."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Commander in the First Order army"}, {"tag": "p", "text": "Pyre was a human male who served as a commander in the forces of the First Order during the Cold War. He and Major Elrik Vonreg proposed to Captain Phasma that the First Order collaborate with pirates, which led to a partnership with Kragan Gorr and his pirate gang. The plan was for Kragan and his pirates to attack the Colossus enough so that Captain Imanuel Doza ceded control of the vital fueling station to the First Order. After a failed attack by the pirates, Kragan reported to Phasma and Vonreg, where Phasma stated her disappointment to Kragan and remarked that she had been skeptical from the beginning of the idea."}, {"tag": "h3", "text": "Searching for Kel and Eila"}, {"tag": "p", "text": "Later, Pyre was sent to the Colossus along with several stormtroopers in search of two young fugitives, Kel and Eila, who had escaped the destruction of their village on the planet Tehar. He and his troops eventually cornered the two children in the engineering room, where Kel declared that he and his sister would rather die than be captured before apparently leaping to their deaths. Afterwards, Pyre reported to Phasma that his mission was complete, as the children were \"no more.\" Unbeknownst to Pyre, Resistance spy Kazuda Xiono, his friend Neeku Vozo, and the Chelidae engineering staff had faked Kel and Eila's deaths."}, {"tag": "h3", "text": "Discussing sanctions"}, {"tag": "p", "text": "Following another pirate attack on the station, Captain Doza messaged Pyre and asked to make arrangements. The First Order officer replied that he would arrive in person to discuss it."}, {"tag": "p", "text": "Pyre returned to the Colossus, where he met with Doza to discuss sanctions that would allow the First Order to garrison an occupational force on the station to protect them from the pirates. When asked how many troopers would be stationed, Pyre assured Doza that there would be enough to stave off any further threats and that his men were more than capable of eliminating them. Doza then inquired to how long the occupation would last, to which Pyre replied that it was difficult to map out a timeline, citing that pirates can be unpredictable. The meeting concluded when Doza said he would need time to review the sanctions before coming to a decision. Pyre advised him not to too take long, for he was expecting an answer soon, then was escorted off the station."}, {"tag": "p", "text": "As Pyre was about to board his shuttle, Jace Rucklin came running up, asking to speak with Doza. When asked if there was anything that should concern him, Doza assured Pyre that it was nothing he couldn't handle. Pyre soon departed the Colossus afterwards."}, {"tag": "h3", "text": "Attempted theft of a phase connector"}, {"tag": "p", "text": "Pyre later sent First Order agent, Teroj Kee, with a pair of stormtroopers to the Colossus to acquire a phase connector from the Office of Acquisitions while its owners, Orka and Flix, were absent. Since the phase connector was already pre-ordered for a mining colony offworld, Kee resorted to stealing it. Kee later reported to Pyre that his transport carrying the device was sabotaged and destroyed. Pyre stated that this turn of events was unfortunate and that Phasma would not be pleased. He then ordered Kee to return at once."}, {"tag": "h3", "text": "Kidnapping of Torra Doza"}, {"tag": "p", "text": "Pyre and Phasma later converse with Kragan Gorr, having grown impatient that his raids had failed to drive Captain Doza into the First Order's arms. Gorr demanded triple payment to compensate for his losses, threatening to back out of their deal. With a nod from Phasma, Pyre instructed Gorr to kidnap Torra Doza to force her father to relinquish the station."}, {"tag": "p", "text": "After Gorr's inside agent on the Colossus helped abduct young Torra, Pyre later sent Vonreg to meet with Gorr, under the guise of delivering payment when in truth it was to pull a doublecross and fake a rescue; Pyre also instructed Vonreg to give Gorr his regards. The ruse successfully convinced Doza to allow the First Order to garrison stormtroopers on the Colossus, as well earning goodwill among some of the platform residence."}, {"tag": "h3", "text": "Occupation of the Colossus"}, {"tag": "h4", "text": "Searching for a pirate spy"}, {"tag": "p", "text": "Pyre later communicated with Captain Doza, who complained that his stormtroopers were actively undermining his authority. The ex-Imperial administrator reminded that the First Order was to remain only until after the pirate threat had been dealt with. Pyre argued that the First Order was doing what was necessary to protect the Colossus and its residents and insisted that Doza needed their protection."}, {"tag": "h4", "text": "Searching for a pirate accomplice"}, {"tag": "p", "text": "Shortly afterwards, Pyre himself arrived to meet with Captain Doza. Doza informed him that the pirate spy he was looking for had recently escaped and thus he believed there was no need to maintain so many stormtroopers on the Colossus. Pyre argued that someone on the platform aided in her escape and stated he would find them. Doza then stressed that he was still in command, to which Pyre was forced to agree."}, {"tag": "p", "text": "Pyre later inquired Doza as to why he left the Empire years ago. Doza insisted it was a personal choice and that Pyre wouldn't understand even if he explained why. Just then, Sergeant CS-812 and his squad entered Doza's office. Pyre requested Doza leave so he could speak with his troopers in private. As soon as Doza had left, Pyre informed that Phasma was sent a full garrison to the Colossus and instructed that sympathizers on the platform may remain while the dissidents shall be arrested or otherwise \"dealt with.\""}, {"tag": "p", "text": "Pyre then demanded their personal reports and CS-812 volunteered CS-515, who summarized his patrol in an unprofessional manner. Having been earlier informed by CS-812 suspecting CS-515's conditioning to be erratic, Pyre ordered that the defective stormtrooper be brought to their transport for a full mental wipe and reprogramming. CS-515 soon escaped, in which CS-812 initiated pursuit. CS-515 was eventually captured, though the First Order was unaware that Resistance spy Kazuda Xiono had replaced him earlier."}, {"tag": "h4", "text": "Taking control"}, {"tag": "p", "text": "Later, while the Colossus was hosting a race, Pyre communicated with Doza via hologram, insisting that the races held a security risk. When Doza defended that the benefits of \"positive morale\" outweighed the risk, Pyre asked if he knew how the pirates were able to infiltrate the Colossus, to which Doza reminded that so long as he was in charge, so were the races. Pyre then conceded, but promised the discussion was not over."}, {"tag": "p", "text": "Pyre later returned to the Colossus to meet with Doza, stating that he wanted to brief him on security matters and insisted he cancel the all future races until further notice. Though Doza protested that this would jeopardize the station's livelihood and community, Pyre refuted that he couldn't risk an accident with undisciplined, non-military pilots. Doza was ultimately forced to concede to Pyre's demands, knowing that openly defying the First Order would put his constituents at risk."}, {"tag": "p", "text": "Pyre later led a group of stormtroopers to Jarek Yeager's Repair Station, where he found all of Team Fireball, save Kazuda Xiono. Once Xiono and CB-23 entered the hangar, Pyre declared him and his friends under arrest."}, {"tag": "p", "text": "However, Kaz and his friends managed to escape Pyre and his stormtroopers save for Tamara Ryvora, who decided to join the First Order. Later, Pyre took control of the Colossus, arresting Captain Doza for \"insubordination\" and shot his bodyguard droid 4D-M1N when she tried to help him."}, {"tag": "h3", "text": "Battle of Castilon"}, {"tag": "p", "text": "When Kazuda Xiono and his Resistance group retook the Colossus, Pyre and First Order Agent Tierny tried to capture Yeager but failed and fled with Ryvora who joined the First Order."}, {"tag": "p", "text": "In the aftermath, he returned to his Star Destroyer with Agent Tierny. Captain Phasma ordered him to find the Colossus after it fled into hyperspace, or destroy it to keep it out of the hands of the Resistance. She warned him that the consequences of failure would be his execution. Pyre then inducted Ryvora into the First Order as a TIE fighter pilot."}, {"tag": "h3", "text": "Ventures following the Battle of Castilon"}, {"tag": "p", "text": "After Ryvora, now Cadet DT-533, joined the First Order, she turned in her comlink, which Pyre was able to use and find the location of the Colossus orbiting D'Qar. They caught the Colossus cell in the middle of salvaging coaxium from the Fulminatrix, which had been destroyed following the Evacuation of D'Qar. Though they almost got it, the Colossus was able to escape at the right time."}, {"tag": "p", "text": "In their efforts to destroy the last of the Resistance, Pyre worked closely with General Armitage Hux in a planet-by-planet sweep, destroying everyone who opposed the First Order. At another point, Hux and Pyre were both to attend an important meeting aboard the Titan, a supertanker fuel depot in the service of the First Order. Prior to the meeting, Lieutenant Galek mentioned Pyre's meeting to Rvyora, as the lieutenant wanted her and Jace Rucklin, a fellow cadet and also a former inhabitant of the Colossus, to go on a supply run to the station. Unknown to them, Xiono, Neeku Vozo, and CB-23 were also aboard, as they were undercover to steal a trans-binary deflector for the Colossus. However, Xiono, due to his disguise as a technician, was separated from his compatriots by Hux, as the officer needed a guide to take him to the tower briefing room. Once their turbolift had arrived, Pyre stood outside its door and greeted the general, making Xiono hide his face behind his datapad and disguise his voice. Pyre went on to apologize for not meeting Hux directly when he arrived, explaining that they had not expected to have a meeting aboard the Titian on short notice."}, {"tag": "p", "text": "In response, Hux revealed that Supreme Leader Kylo Ren wanted an update on the First Order's stock of refueling stations. After being asked, Pyre confirmed there had been difficulties in taking some stations, mentioning that one had become a Resistance cell, although he stated new intelligence would give them the chance to acquire it. Hux demanded that they take control of it and that there should be no more excuses, as the general wanted every Resistance cell destroyed. Once at the meeting room, Hux, Pyre, and the general's stormtroopers entered, but the disguised Xiono was left outside, allowing him to reunite with his allies. After doing so, he warned Vozo that Pyre was aboard, meaning they needed to leave before he recognized them."}, {"tag": "p", "text": "CB-23 learned the deflector they needed was in the hyperdrive chamber, which the three eventually made it to. However, CB-23 was spotted by Rucklin, leading him to the hyperdrive chamber as well. Recognizing Xiono from his time on the Colossus, he informed security about their presence. In the meeting, Pyre mentioned that, planet by planet, the First Order was moving in the last of the Resistance cells, but the station's security alarm soon interrupted the conference. After Hux demanded to know what was happening, Pyre was informed there had been a Code Three in Engineering, which upset Hux, as the stormtrooper commander had stated the Titan was secure. After Xiono and Vozo, who had managed to take the deflector, made it to sector 1305's blast door, Pyre, two stormtroopers, and Hux spotted them. Pyre was surprised to see Xiono aboard, although he needed to tell Hux that Xiono was a Resistance spy. Pyre ordered the stormtroopers to fire, but CB-23, who was currently in the hangar, closed the blastdoor to save Xiono and Vozo. Hux demanded they get the blastdoor open, but the two Resistance agents escaped to the hangar. Hux and Pyre did make it to the hangar, but they were unable to stop Xiono, Vozo, and CB-23 from entering an AAL-1971/9.1 Troop Transport."}, {"tag": "p", "text": "Pyre was one of the stormtroopers who fired on their transport and ordered to not let them escape, but the Resistance forces managed to escape to lightspeed. Afterwards, Hux demanded to know why Pyre could let the infiltration happen, but Pyre stated it was of no consequence, as they had only taken the defector, making him believe the Colossus was becoming desperate. In response, Hux told the commander that desperation could be dangerous, and he ordered Pyre to find and destroy the Colossus. Pyre then contacted Tierny and informed her that Xiono had been on the Titan, taken a binary deflector, and escaped. She asked if Ryvora contacted him, making Pyre say she was reportedly with Rucklin. After hearing this, Tierny noted that, if they worked the situation correctly, Ryvora could help them destroy the enemy station."}, {"tag": "h3", "text": "Battle on Aeos Prime"}, {"tag": "p", "text": "After sending out probe droids, Pyre was informed that the Colossus had taken refuge in the Aeos system. After tracking down the ship, he sent TIEs and First Order TIE bombers after them, but the ship still managed to escape."}, {"tag": "h3", "text": "Final stand"}, {"tag": "p", "text": "In retaliation for helping the Colossus, Agent Tierny and Commander Pyre participated in the suppression of the Aeos system with 13 other Resurgent-class Star Destroyers. Pyre and Tierny then reported the successful suppression to General Hux via hologram, but the General then moved aside and Supreme Leader Kylo Ren addressed them. Ren made it known that he wanted the Colossus resistance cell destroyed and used the Force to make them to stand and aim their blasters at each other, wanting them to understand that he would not tolerate anymore failures."}, {"tag": "p", "text": "Once Ryvora betrayed the First Order and Jace Rucklin revealed the location of the Colossus, the final hunt began. Pyre fought Xiono and his friends during the final battle against the Colossus resistance and his Star Destroyer fought the Colossus. He managed to badly damage CB-23 before he was defeated Xiono, who knocked him unconscious with a riot baton. Shortly the Resurgent-class Star Destroyer exploded, killing Jace Rucklin, Pyre, and the entire crew."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Pyre wore gold-plated stormtrooper armor and a black pauldron, and utilized a gold-plated F-11D blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pyre is a character created for the animated series Star Wars Resistance. He is voiced by Liam McIntyre."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}