{"url": "Qektoth_Confederation_Space_Station", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Kathol sector space stations"], "nodes": [{"tag": "h1", "text": "Qektoth Confederation Space Station"}, {"tag": "p", "text": "The Qektoth Confederation Space Station was located in the Qu'mock system. It was used as a research facility by the Qektoth Confederation."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Original purpose and hijacking"}, {"tag": "p", "text": "Built over one hundred years prior to 8 ABY, the space station was originally intended to serve as a scientific outpost to study the Gandle Ott region. Several months after going on line, the station was attacked by a group of crime lords and escaped criminals. Capturing the station, they used their strike craft to tow the station to their hidden base for use as a communications center. None of this was known to the outside galaxy - the station was logged as disappeared with all crew missing. Thirty-four years later, an earthquake devastated the planet that the station orbited, and the station was left abandoned since no one on the surface survived."}, {"tag": "h3", "text": "Under the control of the Qektoth Confederation"}, {"tag": "p", "text": "In 18 BBY, Drigor Tarrens discovered its location, and brought it to the attention of the Qektoth Confederation when he joined them. The Confederation restored the station to its scientific purpose, and transported it to the Qu'mock system so they could do their research work in secret."}, {"tag": "p", "text": "In 8 ABY, an assault team from the New Republic corvette FarStar boarded the station with the intention of downloading computer files in order to create an antidote to a Confederation-created disease. However, the station personnel were evacuating the station anyway, and they used their own biochemical agent to destroy the station during the Battle of Qu'mock."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "The station was cylindrical, with a cone-like module at each end which were topped by various antennae. At one end of the station, four Durasteel alloy arms protruded from the hull, each topped with a hexagonal solar energy array. The station was divided into several levels, and a shaft containing two turbolifts ran through the center of the facility. In addition, four ladder shafts were placed around the edge of the station at ninety degree intervals."}, {"tag": "h3", "text": "Hangars"}, {"tag": "p", "text": "The docking bays of the space station were located in the center of the station. Four bays were arranged around the central column that housed the turbolift shafts. Each bay had an opening to space protected by a force-field."}, {"tag": "h3", "text": "Crew decks"}, {"tag": "p", "text": "The station's crew decks were simple affairs, with bunks and plasteel trunks."}, {"tag": "h3", "text": "Storage"}, {"tag": "p", "text": "The station's storage bay was four levels high and contained a vast amount of metallic debris ranging from transponders to hyperdrive casings. Part of the storage bay was sealed off by a force field, and contained oval cases and large rectangular containers. The atmosphere inside the section was used for refrigeration, and the containers held the mutilated corpses of hundreds of Human and aliens that were the remnants of the Confederation's experiments."}, {"tag": "p", "text": "One of the containers held the prisoner Fasha Dansun, who was rescued by the crew of the FarStar during the Battle of Qu'mock."}, {"tag": "h3", "text": "Science labs"}, {"tag": "p", "text": "The science lab filled the bottom cone of the station, and each room housed experimental equipment that the Confederation used to conduct their research."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}