{"url": "Qat_Chrystac/Legends", "categories": ["Category:Legends articles", "Category:Expansion Region planets", "Category:Galactic Empire planets", "Category:High-gravity planets", "Category:New Republic planets", "Category:Parnabe sector", "Category:Type IV atmosphere planets", "Category:Volcanic planets"], "nodes": [{"tag": "h1", "text": "Qat Chrystac"}, {"tag": "p", "text": "Qat Chrystac was a volatile, radioactive, and volcanic world that was a point of contention between Rebel (later New Republic) and Imperial forces for over ten years."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet's surface was covered with molten rock, with large mesas of volcanic glass rising up from this unstable waterless ocean. Radioactive lava that scrambled computers and sensors spewed from the many fissures and crevasses that scoured the surface. The searingly hot temperatures and the toxic Type IV atmosphere made environmental suits an absolute necessity. Qat Chrystac's gravity was 1.4 times standard. Its day was twelve standard hours long, and its year was 166 local days long."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A Rebel cell, consisting of some of the fiercest fighters of the Alliance, buried a heavily armored and shielded ship deep into the rock of the planet, creating a well-hidden outpost. An Imperial counterattack was launched, but beaten back by the staunch Rebel warriors."}, {"tag": "p", "text": "At the time of the Thrawn crisis, the fighting was still raging on Qat Chrystac, with elite radtroopers still scouring the planet's surface for the hidden base, and with the New Republic supplying the base in order to continue the harassment of one of the few elite units remaining after the fall of the Emperor. By this point, the New Republic had some two thousand personnel on the surface, while an orbiting Imperial siege platform was crewed by 1,500 Imperial troops."}, {"tag": "p", "text": "General Garm Bel Iblis and his forces were fighting at Qat Chrystac when they received Lando Calrissian's distress signal from Nomad City after the battle there. Nomad City's personnel were all brought there with the rest of Iblis's fleet after Calrissian issued the evacuation order."}, {"tag": "p", "text": "A few weeks before the Battle of Bilbringi, Wedge Antilles recalled Rogue Squadron having to combat two squadrons of TIE Fighters during the Empire's most recent assault on the system, crewed by Thrawn's new cloned pilots, which put even Rogue Squadron's elite abilities to a severe test."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion and Star Wars: Rebellion: Prima's Official Strategy Guide mistakenly place Qat Chrystac in the Sumitra sector of the Outer Rim Territories. Additionally, the in-game encyclopedia entry for the planet describes Qat Chrystac as having a surface with a variety of different grasses, some growing several meters long, which seems to be a direct contradiction to its radioactive surface described in other sources."}, {"tag": "p", "text": "Star Wars: Rebellion: Prima's Official Strategy Guide misspells the planet as \"Qat Chrystal.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}