{"url": "Qahsa", "categories": ["Category:Legends articles", "Category:Data storage and processing", "Category:Yuuzhan Vong technology"], "nodes": [{"tag": "h1", "text": "Qahsa"}, {"tag": "p", "text": "Qahsas were an organic creation of the Yuuzhan Vong and served as a type of computer."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "These creatures were capable of storing the knowledge of the Yuuzhan Vong empire's Shapers thus serving as living memory banks. They came in a variety of sizes from personal devices to databases for worldships. A qahsa was accessed through the use of a cognition hood. They were capable of being grown quickly on demand with portable versions of the device being present. It was possible to place a lock on the qahsa that was coded-genetically that was only capable of opening to an incredibly complex biochemical key."}, {"tag": "p", "text": "The information within these computers was maintained in increasingly dense cortices with each successive one being accessed only by an experienced individual. The Shaper caste maintained seven cortices which surrounded the ultimate eighth cortex. Master Shapers were capable of accessing data beyond the fifth cortex, while Shaper Adepts were restricted to the fifth. Being analogous to computers or memory banks, qahsas stored information on history, techniques, and other past events."}, {"tag": "p", "text": "The data within a qahsa was believed among the Yuuzhan Vong to have been bestowed upon them by the Yun'o. Those that sought new information through innovation suffered from being labeled as heretics."}, {"tag": "p", "text": "Genetic splicers were used to access them. A special type of qahsa was the Qang qahsa which held the eight Shaping protocols"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Yuuzhan Vong War, Jedi Klin-Fa Gi and Bey Gandan attempted to follow Wurth Skidder's example and pose as slaves. They were later taken aboard a Shapers vessel before the galaxy became aware of that caste. At the time, they were assigned to tending to one of the living information systems known as a qahsa. While the Shaper sects were assigned on creating anti-Jedi weaponry, they encoded data inside a qahsa that was to be delivered to Warmaster Tsavong Lah. It was at that point that Klin-Fa Gi and Bey Gandan sabotaged the ship in an attempt to recover the qahsa. However, as it was coded-genetically, she was incapable of opening it which led to her infiltrating Wayland to find a method of opening the biot."}, {"tag": "p", "text": "Onboard the worldship Baanu Miir, Shaper Adept Nen Yim attempted to consult the qahsa's knowledge to determine a means of healing the dying Rikyam brain of the ancient vessel. However, she discovered that the knowledge was insufficient for the task and attempted to consult the Qang Qahsa's database only to discover that the Eighth Cortex was nearly empty of knowledge."}, {"tag": "p", "text": "When Tahiri Veila, Nen Yim, Corran Horn, Harrar and Nom Anor went to Zonama Sekot in 28 ABY, Nen Yim brought along a qahsa to gather information. The qahsas also contained protocols in case Zonama Sekot proved to be a danger. Nom Anor used these protocols to try and destroy Zonama Sekot."}, {"tag": "p", "text": "Nen Yim later made use of a qahsa during her study of the living planet of Zonama Sekot. After studying the native life, she discovered many organisms that were similar to ancient Yuuzhan'tar which was later proved by the existence of relatives of the lim tree's which were extinct with only their blueprints present in the qahsas."}, {"tag": "p", "text": "In order to test her theory about The Force, Nen Yim used a newly grown qahsa to link her mind with that of Zonama Sekot thus discovering its secret as being a child of their ancient homeworld. She was killed for her knowledge by Yu'shaa, who was really Nom Anor, who in turn used one of her qahsa's to release a replicative disease onto Zonama Sekot in order to destroy it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}