{"url": "Qektoth_Confederation", "categories": ["Category:Legends articles", "Category:Military units", "Category:Scientific companies"], "nodes": [{"tag": "h1", "text": "Qektoth Confederation"}, {"tag": "p", "text": "The Qektoth Confederation was an organization whose members had decided to abandon inanimate technology in favor of biological technology. Founded around 17 BBY by a group of scientists from a colony in the Kathol sector, the Qektoth Confederation believed that traditional technologies sapped at a being's spirit, leading to a weakened immune system and premature death. The scientists performed several experiments to prove their theories, but their findings were widely disbelieved, especially by those companies engaged in the production of non-biological technology."}, {"tag": "p", "text": "Over the following years, the Confederation drew more like-minded scientists to its cause. Slowly, the goal of the group changed, becoming a militant group who targeted those who they believed kept the beings of the galaxy in a weakened state. Its new focus led many of the original founders of the Confederation to leave, disgusted at what the organization had become. Under Trann Shoame, the Confederation continued its biological research, and branched off into chemical research as well. They began to develop a powerful biological weapon that they intended to use against the galaxy at large, using a research facility in the Qu'mock system."}, {"tag": "p", "text": "Shoame planned to begin the Confederation's war against its enemies once its new weapon was ready, a fusion of a biochemical agent and an unknown technology discovered by an expedition sent into the Kathol Rift. The Confederation's work came to the attention of Moff Kentor Sarne, who wished to trade the unknown technology for several new ships. Sarne provided the Confederation with the ships and crews, and one of the assault shuttles was used for testing their new weapon on."}, {"tag": "p", "text": "In 8 ABY, the New Republic corvette FarStar engaged the Qektoth attack cruiser Scourge in the Qu'mock system. The New Republic vessel staged a mission to recover data from the research station in the system to formulate a cure for the Confederation's new weapon."}, {"tag": "h2", "text": "Known members"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}