{"url": "Q9-X2", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Astromech droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "Q9-X2"}, {"tag": "p", "text": "Q9-X2 was a Q9-series astromech droid. Made as an experimental model by Industrial Automaton, Q9-X2 had a very strong personality, much like R2-D2. This led to him making countless modifications to himself, including adding repulsorlifts and a vocabulator, giving him the ability to speak Basic, something extremely rare among astromech droids. Despite all his tinkering, he still believed there was more work to be done on himself. During the Corellian Insurrection of 18 ABY, Q9-X2 was owned by Ebrihim, and helped end the crisis."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "The Q9 series was based on the R7 series. It was very complex, designed for versatility and also featured superior analytical and data access skills. This complexity was the line's undoing as it resulted in system failures and costly repairs when the droid was subject to stress. However, Q9-X2 was one of the few successes from this line."}, {"tag": "p", "text": "Q9 was built with a highly advanced personality matrix, giving him a strong personality unlike most droids. It also caused him to perform numerous modifications in an effort to make himself even more advanced. Q9-X2 fitted himself with low-power repulsor pads so he could hover above obstacles, as well as a vocoder so he could speak Basic. The ability to speak anything other than binary was rarely seen among astromech droids, making this his most radical change. But while these modifications were extreme, Q9-X2 still felt that they were not enough. Next he added a sophisticated detection package, that included a molecular backtrack sniffer, a residual heat-trend directionalizer, and retractable sensor wands."}, {"tag": "p", "text": "He also added a powerful forward-mounted floodlight and two additional lamps that folded into either side of his cylindrical chassis. Q9-X2 then fitted himself with a high-tech photography system into his front section, reasoning that his holographic projector was not able enough to capture images clearly. Pictures the droid took were then dispensed through a printout slot. He also upgraded his sensor package when Ebrihim became the tutor for the Solo children."}, {"tag": "p", "text": "In addition to Q9-X2's modifications he was also equipped with the standard \"factory-installed\" astromech equipment from Industrial Automaton. This equipment included a retractable grasper arm, an arc welder, and a fire extinguisher. However, even with all these new changes, Q9 still believed there was more work to be done on himself."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The droid was purchased by the Drall Ebrihim. During Leia Organa Solo's visit to Corellia in 18 ABY, Ebrihim became the tutor to the Solo children, Jacen, Jaina and Anakin. He brought his droid along with him, fascinating the children when they learned Q9 could talk. After the children's parents were trapped in a building by rebels led by Thrackan Sal-Solo, Q9, Chewbacca and Ebrihim headed for Drall, where they met Ebrihim's aunt Marcha. On Drall, Anakin Solo, who had a gift for machinery, discovered a strange device that beings on all of the Five Brothers were searching for. He activated it, dumping Q9 into a garbage chute. The droid saved himself only by activating his repulsors, and flying out of the hole."}, {"tag": "p", "text": "Later, the group (the children, Chewie, Ebrihim, his aunt and Q9) fled to the Drall repulsor, where they hid in the massive chamber. However, Thrackan discovered where they were hidden and took them prisoner, although the children, with Q9's help, were able to escape in the Millennium Falcon. Thrackan gave chase in an assault gunboat, although the children out-flew him and were rescued by New Republic forces, who took Thrackan prisoner. The others, still imprisoned, were freed. Anakin was able to activate the repulsor again, and used it to shut down Centerpoint Station, which was being used the Sacorrian Triad to destroy planets. The Corellian Insurrection had ended, with Q9-X2 having played a part in aiding the New Republic."}, {"tag": "p", "text": "In 25 ABY during the Yuuzhan Vong War the New Republic prepared to fire Centerpoint, and called in Anakin. Anakin, along with his brother Jacen, arrived at the station, where they found Q9 and Ebrihim. The two urged them not to fire it, only to have their warnings rendered moot when the now-free Thrackan Sal-Solo fired the station on the Yuuzhan Vong, killing many but also devastating the Hapan fleet which had been sent to aid the New Republic."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Q9-X2 was sarcastic, constantly showing off his wit and insulting others. His owner Ebrihim found this somewhat annoying, although he tolerated it. However, despite his insults, the droid was dedicated to his master, and showed off this trait during the Corellian Insurrection. Q9 held the opinion that typical astromech droids were unprepared for anything other than flying a starship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Q9-X2 was created for Star Wars: The Corellian Trilogy. He was described as having a black exterior in the Corellian Trilogy, but was drawn with other colors in Star Wars Fact File image above."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}