{"url": "QC-ME", "categories": ["Category:Canon articles", "Category:Coruscant Security Force", "Category:Galactic Republic droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "QC-ME"}, {"tag": "p", "text": "QC-ME, also known as Q-See, was a droid that worked in the morgue of a Coruscant Security Force facility during the time of the Galactic Republic. When the body of a Trandoshan, who worked for the crime lord Cenevax in a plot to gain profit from the sabotage of the racer Ramil during the forty-eighth annual Dragonfire Air Rally, was brought to the morgue, the corrupt Inspector Sartori visited QC-ME to cover up the crime. The Jedi Dooku and Qui-Gon Jinn entered the morgue to investigate for themselves, and Dooku destroyed QC-ME with his lightsaber, as part of an act to intimidate Sartori into fleeing to Cenevax."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the time of the Galactic Republic, QC-ME worked as a mortuary droid for the Coruscant Security Force on the planet Coruscant. Sometime between 68 BBY and 42 BBY, the Coruscant Security Force was involved in investigating the crash of the racer Ramil during the forty-eighth annual Dragonfire Air Rally race. However, Ramil had been sabotaged by the crime lord Cenevax after betraying an agreement in which the racer would purposefully lose to give profits from those who bet on his victory to Cenevax's underground gambling ring. Several Trandoshans working for Cenevax removed Ramil's airspeeder to hide the evidence, but were pursued by the Jedi Master Dooku and his Padawan, Qui-Gon Jinn. The sole surviving Trandoshan was killed by a sabotaged Coruscant Security Force police droid, and the corpse was delivered to the morgue in which QC-ME operated."}, {"tag": "p", "text": "Inspector Sartori, a corrupt member of the Coruscant Security Force who also worked for Cenevax, visited the morgue to view the body. QC-ME questioned whether an inquiry would be made into the Trandoshan's death, but Sartori had already filed a report. Dooku and Jinn, still attempting to investigate the events, entered the morgue, surprising both QC-ME and Sartori. Intending to intimidate Sartori into fleeing to his employer, Dooku demanded that the Trandoshan's body be handed over to the Jedi. Dooku activated his lightsaber, slicing QC-ME in two and destroying the confused droid."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "QC-ME, known for short as Q-See, was a droid with masculine programming. When he and Sartori were confronted by Dooku and Qui-Gon Jinn, QC-ME was unsure how to respond."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "QC-ME first appeared in the 2019 audiobook Dooku: Jedi Lost, written by Cavan Scott. QC-ME's full designation was given in the script release of the audiobook."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}