{"url": "Qar_Jalunn", "categories": ["Category:Legends articles", "Category:Businesspeople", "Category:Genarius residents", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Qar Jalunn"}, {"tag": "p", "text": "Qar Jalunn was a wealthy male investor who had business dealings in the Cularin system around the time of the Invasion of Naboo. Jalunn held occasional secret meetings with the Thaereian military, an armed force chartered by the Galactic Republic to main security in the Cularin system. He also funded advanced cybernetics and genetics research led by the disgraced scientist Yush Baskalar."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Qar Jalunn was a wealthy male private investor who was active around the time of the Invasion of Naboo. Around 31 BBY, while still in his youth, Jalunn ventured to the Cularin system after being attracted by an expansion in industry on the floating cities of the planet Genarius, the system's third planet. Following his arrival on Genarius, Jalunn invested large sums of money in any business opportunity that appeared profitable, though roughly half of his investments failed. Jaluun also hired pirate groups based in the Cularin system asteroid belt to undertake jobs on his behalf."}, {"tag": "p", "text": "Jalunn had occasional dealings with the Thaereian military, an armed force from the Thaereian system that had been chartered by the Galactic Republic to maintain security in the Cularin system. When meeting with the Thaereians, Jalunn liaised directly with Tira Wils, the unofficial head of security of the commander of the Thaereian forces in the Cularin system, Colonel Jir Tramsig, because she was the only person who Tramsig trusted to deal with Jalunn."}, {"tag": "p", "text": "After the scientist Yush Baskalar was dismissed from the university where he worked for conducting highly risky advanced cybernetics and genetics research, Baskalar caught Jalunn's attention. Julunn immediately offered Baskalar unlimited resources to continue the research that had resulted in his dismissal if the disgraced scientist pledged his services to the Thaereian military. Baskalar accepted the offer and Jalunn had him relocated to the Cularin system to continue his research from new state-of-the-art facilities. Despite being well-equipped, Baskalar found his new working environment to be unpleasant and threatened to leave, however Jalunn persuaded him to stay."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Qar Jalunn was renowned for having more credits than he knew how to spend. He invested money in any opportunities that demonstrated even the slightest profit-making potential. He did not appear to notice any losses from his investments, even when a large portion of his business portfolio performed poorly."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Qar Julunn was first mentioned in the Living Force Campaign Guide, a sourcebook by Robert Wiese that was published in 2001 at set the scene for the Living Force roleplaying campaign. He later received an entry in the 2008 compendium The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}