{"url": "Qawohl", "categories": ["Category:Legends articles", "Category:Abyssins", "Category:Males", "Category:Sith Empire individuals", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Qawohl"}, {"tag": "p", "text": "Qawohl, also known as Maggot, was a male Abyssin slave who accompanied Teneb Kel around 3678 BBY during the Great Galactic War. Maggot was present during the Invasion of Begeren, where he killed a large number of Republic soldiers, but was wounded in the fight. Maggot was saved by his master, and they were both arrested by the Sith for the crimes of Calypho. He continued to accompany Kel during his hunt for the rogue apprentice of the Emperor, Exal Kressh."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Invasion of Begeren"}, {"tag": "p", "text": "By 3678 BBY, Qawohl was a slave to the Sith Teneb Kel, who referred to him as \"Maggot\". He was with the Sith army at the Battle of Begeren. During the battle he was injured with wounds that would have killed a human, yet survived and even brought down several enemy soldiers before falling unconscious. After his master killed the Republic governor on the planet, he found Maggot and the pair left the battlefield."}, {"tag": "h3", "text": "Arrest"}, {"tag": "p", "text": "After the invasion of Begeren, Maggot's master was arrested by Sith officers for the crimes of his former Sith master, Lord Calypho. Kel and Maggot were brought to the Imperial capital of Dromund Kaas. On the way to meet with the Dark Council, Maggot suggested to Kel that he should flee to the border worlds, but Kel refused and chose to face the council. Maggot was left outside of the council chambers until the Sith brought him to a ship, where he found his master unconscious and in need of attention. Maggot fed the incapacitated Sith until he recovered. Immediately upon his recovery, Kel ordered his slave to chart a course for the Lenico system, for he had been given a quest from the council to bring the Emperor's rogue apprentice Exal Kressh to justice."}, {"tag": "h3", "text": "The Hunt for Exal Kressh"}, {"tag": "p", "text": "The pair went to several colonies in the Lenico system for information on the whereabouts of Kressh. At the fourth, Lenico Colony Blue, they had a confrontation with Ybann the Hutt, who it turned out knew little about their quarry save that she had been on the station for a short while before disappearing again. Maggot later asked Kel for more information about the identity of Kressh, but Kel refused, saying that it was a \"Sith concern\". Kel then told Maggot to enjoy the aliens in the Hutt's suite, saying that he earned the night.\nShortly thereafter, Maggot found himself rescuing his master after Kel's duel with Exal Kressh sent Lenico Colony Blue tumbling in flames to the planet's surface."}, {"tag": "h3", "text": "Respite on Lenico IV"}, {"tag": "p", "text": "While Teneb Kel searched the wreckage of the colony for parts to repair his ship, Maggot kept watch over the ship, spending some time in parley with the padawan of Jerbhen Hulis, a youth who spoke the Abyssin language. Upon Kel's return, Maggot was ordered to set course immediately for Korriban, where Exal Kressh was leading a Republic assault force."}, {"tag": "h3", "text": "Showdown in the Korriban Sith Academy"}, {"tag": "p", "text": "When they arrived in the Horuset system, Teneb Kel and Maggot found a battle raging between a Republic assault and Korriban's Imperial defenders. Kel prepared to seek out Kressh on foot, ordering Maggot to take his freedom should he not return alive, before jumping from his ship to enter the Academy through a secret entrance.\nWhen Teneb Kel set off into the Academy, Maggot surreptitiously followed him, arriving in the middle of Kel's duel with Exal Kressh. Maggot managed to wound Kressh with several bolts from his blaster rifle, giving Kel a shred of breathing room, perhaps helping him defeat his opponent. Upon seeing the duel concluded, Maggot revealed his birth name, Qawohl, and demanded his freedom in his native tongue, none of which Kel could understand. Kel, upon then learning that his servant had overheard certain secrets related to him by Kressh, suddenly turned on Qawohl and stabbed him through the torso with his lightsaber with a whispered apology, killing him so as to keep the information private."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Qawohl was a loyal slave, which endeared him to his master, Teneb Kel."}, {"tag": "p", "text": "Qawohl displayed the great strength his species is known for, brutally killing multiple Republic soldiers during the Invasion of Begeren and remaining conscious, despite heavy injuries, until his master arrived to help him."}, {"tag": "h2", "text": "Appearances"}]}