{"url": "Qalydon", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Galactic Empire planets", "Category:Rocky planets"], "nodes": [{"tag": "h1", "text": "Qalydon"}, {"tag": "p", "text": "Qalydon was a planet located in the galaxy that was populated by Lurmen."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Qalydon was a planet that was fully covered in hills, mountains, and plains, that was located in the Qalydon system of the galaxy. The Lurmen species had at least one Lurmen village located on Qalydon. The planet had an atmosphere breathable to oxygen-breathers, such as humans. Qalydon also had a population of kaadu, who were domesticated by the Lurmen."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Qalydon was settled by Lurmen migrants who wanted to peacefully worship the Force, using kyber crystal necklaces. During the Imperial era, the planet was considered remote. During the quest to build the Arrowhead, the Freemakers visited the Lurmen village on Qalydon seeking information on how to obtain kyber crystals. Though the villagers were initially hostile, they accepted them as guests after Kordi Freemaker convinced them that they were not working for the Galactic Empire."}, {"tag": "p", "text": "Later the Imperial officers Durpin and Plumestriker raided the village and stole the villagers' crystals. After Rowan Freemaker shot down their Gozanti-class cruiser in the mountains, the Freemakers undertook a mission to recover the crystals with the help of Chief Biz's daughter Maynar. Despite being attacked by the Imperial hunter droid M-OC, the Freemakers managed to recover the crystals from the Imperials."}, {"tag": "p", "text": "Later, M-OC lured Rowan into a trap on Qalydon by impersonating Maynar, exploiting Rowan's friendship with her. However, he was ambushed by Darth Vader, the Emperor's second in command, who captured Rowan for the Emperor. Roger managed to return back to the Alliance Fleet and warn Zander and Kordi about their brother's kidnapping."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Qalydon first appeared in LEGO Star Wars: The Freemaker Adventures Season Two \"The Lost Crystals of Qalydon\", which first appeared on Disney XD on August 7, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}