{"url": "QS-2D", "categories": ["Category:Legends articles", "Category:Administrative droids", "Category:Business owners and executives", "Category:Planetary leaders", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "QS-2D"}, {"tag": "p", "text": "QS-2D was a heavily-modified protocol droid-turned-entrepreneur. Its left hand had been turned into a weapon mount for a blaster pistol, it had been fitted with deep black armor plating, and it had been reprogrammed to serve as an administrative droid. It had been altered to serve basically as a combination of personal assistant and body guard, and was given a heuristic processor which gave it a capacity for a great deal of independence."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "QS-2D was originally owned by two Twi'leks who tried to scout the moon of Uffel around 90 BBY. When the Twi'leks were killed in the landing, QS-2D decided that its independence was permanent. The droid, along with its companions R4-S2 and R4-J9, began a self-repair routine extracting components from the beached ship, and while doing so, QS-2D reprogrammed the droids to became their master. They then surveyed the planet and, satisfied with the results, decided to started up a small mining operation."}, {"tag": "p", "text": "QS-2D established a financial relationship with Riboga the Hutt in order to do this. In exchange of a part of its profits, Riboga provided QS-2D with droids, including power droid, miner droids, more astromech droids, and at least one protocol droid and one medical droid, 4-KT, who would become one of QS-2D's droid development expert. All of the droids of Uffel were programmed to acknowledge QS-2D as their master, but QS-2D worked under its former master's name, who was officially still alive but never seen, so as not to draw attention to itself."}, {"tag": "p", "text": "Although QS-2D obtain good profits with the mines, it understood the mines would eventually dry out, so it decided to diversify its business venture: It re-invested in droid factories and developed different droid designs, including a variant of the MSE-series known as MSF-series: message-carrier and mechanic repair expert, it could hover with little repulsorlifts and work in cramped conditions. The MSF was a commercial success and it became the main credit influx after the mines stopped working. QS-2D retained the MSF prototype, silver MSF-F2, and used him to openly and relentlessly follow any visiting organic."}, {"tag": "p", "text": "In a few years, QS-2D was rich and owned more than one hundred droids. QS-2D built a city for his droids, X2-4, around the droid factory. The city had a spaceport operated by a single droid, but it lacked commodities for air-breathing organics because QS-2D did not trust them: Clients wanting to visit needed breath masks and pressure suits. As the droids knew no greed, QS-2D assigned any income to maintain, enlarge or improve the city it ruled. QS-2D, worried about security even in a pressurized environment, designed a local model of battle droid to protect the city, including its security chief HG-211."}, {"tag": "p", "text": "QS-2D also built engineering droid G-8Y5 to maintain and modify existing droids and to develop new designs. G-8Y5 collaborated in the security effort by designing and constructing droid-based space defense weapon platforms."}, {"tag": "p", "text": "When the droid made enough of a fortune, it bought out Riboga's part—just in time, as Riboga left the Cularin system soon afterward."}, {"tag": "p", "text": "The droid moon produced some of the highest-quality specialty droids of the Old Republic. QS-2D was demanding, wanting perfection in everything, but practical enough to realize it could not always achieve it. It was creative and had an ability for administration which it had not been programmed for. However, QS-2D also grew to distrust living beings, believing they would take away all he had created. The droid could become impatient with the living beings it dealt with if it did not feel they were being direct in their dealings with it."}, {"tag": "p", "text": "In 32 BBY, QS-2D owned more than one thousand droids and counting, all of them happy to work for a fellow droid instead of an organic. However, to keep a low profile, QS-2D still maintained that he was working for an unseen Twi'lek master. Its droids were used all around the system, except by crime lord Nirama, who mistrusted droids that could include espionage programming."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}