{"url": "Qiilura", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Agriworlds", "Category:Confederacy of Independent Systems planets", "Category:Galactic Republic planets", "Category:Qiilura locations", "Category:Qiilura sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Qiilura"}, {"tag": "p", "text": "Qiilura was a temperate planet in the Mid Rim, 40 light-years away from Ord Mantell. It was the home world of the Gurlanins—a race of shapeshifting intelligent predators, but by the time of the Clone Wars, Human colonization had been well established, with a population of two hundred thousand farmers. The economy of the planet mostly revolved around agriculture, specifically the production of barq, kushayan, and other luxury foodstuffs, merlie meat was a known export and source of income and food for the farmers of this planet. Qiilura produced a large proportion of the luxury foodstuffs and beverages in the galaxy. However, the planet was controlled by the Neimoidian merchant Lik Ankkit who passed little of the profit on to the farmers, thus most inhabitants lived in squalor and would sell information and outlaws to the warlord Ghez Hokan and his militia for a couple of credits or a bottle of urrqal."}, {"tag": "p", "text": "The planet fell within the area conquered by the Yuuzhan Vong during their galactic invasion."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "Qiilura had many islands with fertile soil, deep river inlets, rolling plains, deciduous forests, lakes, and gameboard fields. The planet also had gem mines, sources of zeka quartz and green silicates."}, {"tag": "h3", "text": "Fauna"}, {"tag": "p", "text": "The planet was home to a number of native non-sentient species such as gdans, merlies and vheks."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Mission to Qiilura"}, {"tag": "p", "text": "During the Clone Wars, Qiilura was the location of a Separatist biological weapons lab that was developing a pathological agent specifically designed to kill clones. During the Mission to Qiilura, Omega Squad—a squad of Republic commandos—was sent to destroy the biological weapons lab and, if possible, locate Jedi Master Kast Fulier and his Padawan Etain Tur-Mukan. Although Master Kast Fulier was dead prior to their arrival, Omega Squad was ultimately successful in destroying the lab after joining up with Padawan Tur-Mukan and enlisting the help of a native Gurlanin, Jinart."}, {"tag": "p", "text": "Due to the Separatist droids burning the barq fields in the search of one of Omega's members, there was a galactic shortage of the grain, causing economic problems for both the Trade Federation and the already impoverished farmers who lost their crops."}, {"tag": "h3", "text": "Occupation by the Republic"}, {"tag": "p", "text": "After the success of the mission to Qiilura, a deal was struck between the Republic and the Gurlanins to remove the Human colony. The terms of the agreement specified that the Gurlanins, with their ridiculously effective espionage skills, would act as spies for the Republic, and the entire Human colony would immediately be evicted from the planet by Republic forces. For the members of the dwindling population of Gurlanins, this meant that the merlie herds would once again reach their previous numbers in the wild, restoring balance to the environment. Failing to keep their end of the bargain, a Republic garrison was established and led by General Arligan Zey and Commander Etain Tur-Murkan. Their objective was to train the Human colonists in guerrilla warfare in case of another Separatist attack. However, because the Separatists had no other interests in the system, all that the training and equipping accomplished was the further encroachment of Gurlanin territory by Human colonists."}, {"tag": "p", "text": "Furious, the Gurlanins decided that the only way to get the Republic to listen was to grab it by the ears. An entire Republic troopship was destroyed due to information leaked to the Separatists by Gurlanin agents. This caused the Senate to immediately understand the tremendous threat the Gurlanins could be, and a decision was quickly made to remove the Human colonists on Qiilura."}, {"tag": "p", "text": "The Senate Committee on Refugees was informed by Republic Intelligence that at least two, and possibly a much larger number of other Gurlanins, had infiltrated Coruscant, where they were in place and standing by to inflict significant damage to the Republic in retaliation for the continued occupation of Qiilura. Tur-Murkan, now a General, led a contingent of clone troopers to expedite the evacuation of the Human colonists. The colonists resisted leaving their homes, and openly engaged Republic forces with the militias trained by Zey and Tur-Murkan. The evacuation quickly became an eviction, and when clone casualties grew out of hand, Tur-Murkan regretfully gave the order to use lethal force, if necessary, to remove the remaining colonist hold-outs."}, {"tag": "h3", "text": "Wrath of the Empire"}, {"tag": "p", "text": "When the Empire rose into power, Qiilura was conquered by Imperial stormtroopers."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "During the Yuuzhan Vong's incursion into the galaxy, Qiilura fell within space conquered by the invaders."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}