{"url": "Qesya_Vth%27naar", "categories": ["Category:Legends articles", "Category:FarStar crewmembers and personnel", "Category:Females", "Category:Gladiators", "Category:Sludir"], "nodes": [{"tag": "h1", "text": "Qesya Vth'naar"}, {"tag": "p", "text": "Qesya Vth'naar was a female Sludir. She was the mate of Rokarn Vth'naar, and the sister of Quyik Vth'naar. During the early years of the New Republic, she was a slave of Moff Kentor Sarne, and was later a member of the crew of the FarStar."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Gladitoral combat"}, {"tag": "p", "text": "Qesya was imprisoned on Kal'Shebbol as a slave alongside her mate and her brother. However, Qesya discovered she was pregnant. Due to the violent and unsafe environment she found herself in, she utilized the Sludir's ability to keep her fetuses in a state of stasis until the child could be born in a safe environment."}, {"tag": "p", "text": "When her mate Rokarn and her brother Quyik were forced to fight one another, Rokarn knew that his bloodline would continue and lost the match. Shortly afterward, Qesya was forced to fight her own brother, and he yielded to her. Sarne threatened to kill them both if Qeysa didn't kill him. To protect the bloodline, she was forced to slay her brother."}, {"tag": "p", "text": "Qeysa was considered one of the best gladiators in the arena, and Sarne would often send new arrivals to her to test their mettle. She befriended Gunthar during her time as a gladiator, and became a sort of protector to the seemingly-simple alien. Like many of Sarne's slaves, Qesya was freed from slavery when the New Republic liberated the planet."}, {"tag": "h3", "text": "Onboard the FarStar"}, {"tag": "p", "text": "Qesya joined the crew of the FarStar in an effort to track down Sarne and avenge the deaths of her family. She joined the crew to lend combat support to ground teams, and was a fierce fighter."}, {"tag": "h3", "text": "Motherhood"}, {"tag": "p", "text": "Several weeks into the FarStar mission, Qesya's fetus came out of stasis. When on a layover at Yvara, she gave birth to a forty-kilogram baby boy. With her new responsibilities as a mother, she no longer wished to travel with the FarStar. She remained on Yvara with Gunthar, and agreed to train a new warrior caste of Yvarema."}, {"tag": "p", "text": "Shortly after the FarStar left, Yvara became a stopping point for several sets of ships all heading towards Kathol. Concerned that the FarStar was in trouble, Qesya convinced Gunthar to send a force of ships to aid the corvette. Qesya commanded the force alongside Gunthar, and they fought in the Battle of Kathol System."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "While on Yvara, her genetic template, along with Gunthar's, was used by the Majjvara to create a new warrior caste of Yvarema. In tribute to the crew of the FarStar, they were named the FarStar warriors. Each warrior looked like a cross between Qesya and Gunthar."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Due to Moff Sarne's involvement in the deaths of her mate and brother, Qesya swore revenge upon him. She kept her desire and motivations secret from the rest of the FarStar crew. However, with the arrival of her child, and the continuation of her bloodline, she realized that her offspring took priority over everything else."}, {"tag": "p", "text": "Qesya was a fierce fighter, and had a strong sense of battle honor. She often hesitated in the use of a blaster, preferring her two handed vibro-ax. Due to her sense of honor, hiding, retreating and taking cover were alien concepts to her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Qesya's child was never named in The Kathol Rift, and players were free to chose a name for the newborn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}