{"url": "Qid_Proko", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Jedi Consulars", "Category:Jedi Purge survivors", "Category:Males", "Category:Mechanics", "Category:Post-Ruusan Jedi Knights", "Category:Quarren"], "nodes": [{"tag": "h1", "text": "Qid Proko"}, {"tag": "p", "text": "Qid Proko was a male Quarren Jedi Knight and a survivor of Order 66, which Supreme Chancellor Palpatine issued in an attempt to wipe out the Jedi Order following the Clone Wars. Proko managed to evade the Great Jedi Purge and traveled the galaxy for a time. He eventually settled down for a life as a mechanic on the planet Poderis, in the Inner Rim."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Qid Proko was a male Quarren Jedi Knight who served in the Jedi Order. A follower of the path of a Jedi Consular, Proko served the Galactic Republic during its final years."}, {"tag": "p", "text": "In 19 BBY, as the Clone Wars ended, Supreme Chancellor Palpatine declared himself Emperor, took over the Republic that Proko and the Jedi had defended, and transformed it into the Galactic Empire. With the issuance of Order 66, Palpatine instructed the Republic's clone troopers to kill their own Jedi commanders; Proko was located in the Core Worlds at the time, but he managed to escape. As the Emperor's New Order rose to power, Proko traveled the galaxy and survived the threat of the Great Jedi Purge."}, {"tag": "p", "text": "Proko's travels brought him to the storm-swept Inner Rim world of Poderis, where he made a new life for himself as a technician and worked in a speeder bike repair shop. Throughout the local settlement, Proko was known as a quiet but honest being. Despite having given up his life as a Jedi for a simpler profession, and having taken to using a blaster rifle, Proko still kept his lightsaber hidden in storage."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In his life after the fall of the Republic, Qid Proko was known as a quiet and honest being. Proko was multilingual: he spoke Basic, Quarren, Mon Calamarian, and Rodese."}, {"tag": "p", "text": "In the Quarren tongue, Proko's full name meant \"quick-witted seeker of lights\"."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Among the Force powers Proko mastered during his time as a Jedi were telekinesis, telepathy, Force healing, empathy, and Force stealth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Qid Proko was first mentioned in the Rebellion Era Sourcebook, a supplement for Star Wars: The Roleplaying Game written in 2001 by Bill Slavicsek, Steve Miller, and Owen K.C. Stephens. According to the book, Proko was designed as an example of a Jedi mentor whom player-characters might seek out to further their Jedi training."}, {"tag": "p", "text": "Qid Proko's name appears to be a reference to the Latin phrase quid pro quo, which roughly translates to \"something for something\"."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}