{"url": "Qu_Rahn", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Force ghosts", "Category:Humans", "Category:Jedi affiliated with the Alliance to Restore the Republic", "Category:Jedi Consulars", "Category:Jedi Purge survivors", "Category:Males", "Category:Post-Ruusan Jedi Masters", "Category:Socorrans"], "nodes": [{"tag": "h1", "text": "Qu Rahn"}, {"tag": "p", "text": "Qu Rahn was a Human male Jedi Master native of the planet Socorro who served the Galactic Republic during its waning years. When the Republic was reformed into the Galactic Empire in 19 BBY and the Great Jedi Purge began, Rahn went into hiding, evading numerous Imperial Inquisitors. At some point during the Purge, Rahn visited his former Jedi Master, Yoda, from whom he learned the secret of living as a Force ghost after physical death. Elevating Rahn to the rank of Jedi Master, Yoda also told him about the long-lost Valley of the Jedi, a powerful Force nexus which contained numerous trapped Jedi souls. Rahn swore to find it and free the spirits, but after many years of obsessive and fruitless search, he almost gave up."}, {"tag": "p", "text": "A vision led Rahn to a common farmer called Morgan Katarn, who had accidentally stumbled upon the Valley. Having foreseen that he would soon be captured, Rahn instructed Morgan to pass the information about the Valley to his son, Kyle. During this time period, Qu Rahn eventually joined the Rebel Alliance during the early years of the Galactic Civil War, being one of the few Jedi left in the galaxy to fight against the Empire."}, {"tag": "p", "text": "In 5 ABY, just as he had seen in his vision, Rahn was captured by one of the Inquisitors, Jerec, and his band of Dark Jedi. Jerec, who also wanted to find the Valley in order to harness its power, probed Rahn's mind and learned about Morgan and his discovery. Having become a traitor in his own mind, Rahn aggressively attacked Jerec's Dark Jedi, but was killed by the Inquisitor himself."}, {"tag": "p", "text": "Following Yoda's teachings, Rahn continued to live as a Force ghost, appearing to Kyle Katarn and instructing him to stop Jerec. Rahn also appeared to the youngest of Jerec's Dark Jedi, Yun, guiding him toward the light side. Under Rahn's guidance, Katarn killed Jerec and freed the souls of the Jedi trapped in the Valley. Yun also played his part by giving his life in order to save Katarn's."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Qu Rahn was a Force-sensitive Human male born on the planet Socorro, and chosen to be trained as a Jedi. As a youngling, Rahn was a member of the Katarn Clan, in which he trained under Jedi Master Yoda. Rahn grew to become an extremely loyal, steadfast Jedi.\nBy 22 BBY, Rahn held the rank of Jedi Knight. During the Separatist Crisis, which saw many planets seceding from the Galactic Republic, Rahn led a special joint task force of Judicial Department and Senate Bureau of Intelligence agents investigating suspected Separatist terrorist Gavrilonnis Tejere, who had tried to sabotage the repulsorlift assembly on the Yag'Dhul Ambassadorial Landing Platform. Rahn was active during the Clone Wars that followed and was one of the few survivors of Order 66 and the Great Jedi Purge initiated by Emperor Palpatine. Like many of the Jedi that escaped death, Rahn went into hiding."}, {"tag": "h3", "text": "Imperial years"}, {"tag": "p", "text": "Shortly after the formation of the Galactic Empire, he was listed as one of the Jedi fugitives by Imperial HoloVision, along with Kai Justiss, Ydra Kilwallen, Maw, Ranik Solusar, and Halagad Ventor."}, {"tag": "p", "text": "As the Purge progressed, it became known to Rahn that many Jedi, such as Anakin Skywalker, Jerec, and Ventor, had fallen to the dark side of the Force and, in some cases, become servants of Palpatine. Skywalker became the Dark Lord of the Sith Darth Vader, and Jerec joined the Inquisitorius, an organization dedicated to extermination of every last Jedi. Rahn also discovered that Yoda had survived Order 66 and was living in self-imposed exile on the planet Dagobah following his failure to defeat Palpatine. Later, Rahn would be part of the group of Jedi that was betrayed by Ventor to Darth Vader. Rahn, however, somehow managed to evade the Dark Lord of the Sith."}, {"tag": "p", "text": "Troubled and confused about how those Jedi could turn to the dark side, Rahn made the dangerous journey to Dagobah to visit Yoda. Rahn hoped that Yoda's wisdom would help to give clarity to the thoughts that were troubling him. Instead of a reassuring conversation, Yoda merely spoke enigmatically about a planet, on which was located a \"valley of Jedi souls,\" a place of great power. Yoda bestowed upon Rahn the rank of Jedi Master, giving him a gold lightsaber in the process and sending him on his way, but not before teaching Rahn the ability to live on after death as a Force ghost. The new knowledge and Yoda's gift baffled Rahn, but he accepted the lightsaber and vowed to protect the weapon as it would him."}, {"tag": "h3", "text": "Search for the Valley of the Jedi"}, {"tag": "p", "text": "After his meeting with Yoda, Rahn became determined to find the Valley of the Jedi and free the spirits trapped there in order to prevent any possibility that the valley's power would be used for evil. For the next several years, Rahn searched obsessively for any information about the history or location of the valley. Time and time again, any leads Rahn found to the valley's hiding place left him empty-handed. In his mind, the valley seemed unreachable—as mythic as the planet Millinar or the Lost City of the Jedi. To make matters worse, the relentless task of the Galactic Empire's Inquisitorius to find every last Jedi made travel perilous. Ultimately, Jerec caught wind of Rahn's search. Hoping to find the valley in order to obtain its power, the Inquisitor initiated his own search. The race to be the first to find the Valley of the Jedi was on."}, {"tag": "p", "text": "During this time, Rahn heard a report that Halagad Ventor, the man who had caused so many Jedi deaths, had been found by a group of Rebel Alliance soldiers and redeemed before he died. Rahn scoffed at such rumors, refusing to believe the tale that had found its way to his ears and remembering that Yoda had once told him that the dark side would forever dominate the destiny of those who had chosen it."}, {"tag": "p", "text": "After countless years of dead ends and false leads, Rahn was close to admitting defeat in what was increasingly appearing to be a fruitless quest, but then a vision helped to restore his resolve. The vision led him to a simple farmer living on the planet Sullust's moon Sulon—a man named Morgan Katarn. Rahn arrived on Sulon and stopped at Katarn's farm for some time. From Katarn, Rahn learned that the valley did in fact exist. Katarn also shared with Rahn a thousand-year-old prophecy that the native Bouncers had told him about the valley. Katarn wanted to tell Rahn the valley's exact coordinates, but the Jedi Master strongly forbade him to do so, having seen in the same vision that he might be captured before he could reach it. Still, Rahn told Katarn that he would try to assemble a team in order to study the valley. Rahn then entrusted his personal green-bladed lightsaber to Morgan and urged him to pass down the location of the valley and the lightsaber to Morgan's own son—the stormtrooper-in-training Kyle Katarn. Rahn had sensed that Kyle was strong with the Force and had a vision that showed him that Morgan's son would be the one who would unlock the secrets of the Valley."}, {"tag": "p", "text": "Katarn did exactly as Rahn had asked. He embedded the map to the valley on the ceiling of his house and left instructions for Kyle on a holodisc, which could only be accessed through Katarn's family droid, WeeGee. Morgan was later killed by Jerec for his ties to the Rebel Alliance, but Jerec was still oblivious to Katarn's discovery. By that time, Rahn had apparently made contact with the Rebel Alliance and its leader, Mon Mothma. During her meeting with the recently defected Kyle Katarn, Mon Mothma spoke of Rahn, calling him a mutual friend and delivering Rahn's greetings to Morgan's son."}, {"tag": "h3", "text": "Confrontation with Jerec"}, {"tag": "p", "text": "In 5 ABY, one year after the Rebel Alliance had dealt a massive blow to the Galactic Empire on the forest moon of Endor, Rahn led a team of Rebel Alliance agents—a young pilot named Duno Dree; the female wire-thin weapons expert Cee Norley; and Rolanda Gron, a Klatooinian technologist—to the planet Dorlo. Their mission was to find the linguistics expert Nij Por Ral, who was working at an excavation site there, and convince him to join Rahn's group. Arriving on Dorlo in a CR90 corvette, the Rebels rode a skimmer to the site of Por Ral's work, where they were able to convince the linguist to join them."}, {"tag": "p", "text": "Having acquired Por Ral, however, they faced opposition from a group of stormtroopers led by three Dark Jedi—the former Jedi Maw, the Prophetess of the Dark Side Sariss, and the young Epicanthix Yun—who had been sent by Jerec to capture Rahn. Rahn and the Rebels decided to try to reach their corvette in order to escape from the Dark Jedi. Rahn told his group not to use the skimmer, fearing that the Imperials might spot its heat signature; instead, he ordered them to set out to the corvette on foot. However, Maw had the unique ability to sense others' fear. He spotted Rahn's group and soon the Imperials, riding skimmers themselves, started gaining on them. To buy the Rebels some time, Rahn formulated a plan that included Norley remaining behind with a rocket launcher. She managed to destroy one of the two skimmers, but was killed after doing so. However, her sacrifice bought some time for Rahn, Dree, Gron, and Por Ral to reach the starship. Dree managed to pilot the corvette off the planet, destroying Jerec's remaining skimmer in the process, although not managing to kill its crew of Dark Jedi."}, {"tag": "p", "text": "Once in space, the corvette was caught in the tractor beam of the Vengeance, Jerec's personal battleship. An assault shuttle then docked with the corvette, carrying another of Jerec's Dark Jedi, Boc. The Rebels were asked to surrender, but did not comply. In response, the Imperials filled the corvette with coma gas. Rahn and his group tried to reach for space suits, but fell prey to the effects of the gas. Unconscious, they were transferred first to the shuttle and then to the Vengeance. The corvette itself was used for target practice by the Vengeance's artillery crew."}, {"tag": "p", "text": "Rahn soon awoke from the effects of the gas, only to find two more Dark Jedi—Gorc and Pic—staring at him. Rahn tried to reach for his lightsaber, but found out that Pic had taken Yoda's gift. Rahn and his companions were then escorted to the Vengeance's bridge, where they faced Jerec and all of his Dark Jedi. Jerec began questioning Rahn about the valley, but the Jedi Master refused to answer, so Jerec ordered his men to kill Rahn's comrades. One by one, Gron, Por Ral, and Dree were killed, but Qu Rahn still did not answer, even after being beaten to his knees by the Dark Jedi. Rahn attempted to will himself to die and asked Jerec to strike him down. Instead of killing Rahn, Jerec used the Force to rip the information he needed about the Valley of the Jedi from his mind. The Dark Jedi discovered that Morgan Katarn, the man he had killed years ago, knew the whereabouts of the valley and had left the coordinates somewhere on his farm."}, {"tag": "p", "text": "Rahn was devastated; in his own mind, he had become the very thing he had despised—a betrayer of the Jedi. Not only had he lost Yoda's lightsaber, but he had betrayed Morgan Katarn and a secret that had been kept for generations. In that moment, the Jedi Master, gave into despair and, using telekinesis, he stole Yun's lightsaber and attacked his captors. Rahn put up a valiant fight, with Jerec's followers proving unable to land a single blow on him. Rahn managed to sever Maw in half at the waist, only to be brought to his knees by a blast of the Force from Jerec. As Jerec moved in for the kill, Yoda's voice echoed in Rahn's head the promise that one day he would understand. At that moment, Jerec struck the killing blow, decapitating the helpless Jedi Master. However, in his final moments of life, Rahn saw the spirits of Anakin Skywalker and Halagad Ventor, two Jedi that he knew that had fallen to the dark side many years back, and yet were eventually redeemed, and finally realized what Yoda had wanted him to understand; that no one was beyond redemption."}, {"tag": "h3", "text": "The spirit of Rahn"}, {"tag": "p", "text": "Even after his physical death, Rahn was successful to transcend the physical plane and lived on as a Force ghost, as he had been taught by Yoda years earlier. Meanwhile, having acquired the information he needed from Rahn's mind, Jerec hired the droid information broker 8t88, who found Morgan's holodisc on Sulon. Being unable to decipher it, the droid arranged a meeting with Kyle Katarn on Nar Shaddaa. Katarn refused to cooperate and was attacked by several bounty hunters hired by 8t88. Rahn contacted Katarn and taught him how to use the Force, in this manner helping Morgan's son evade death and obtain the disk from 8t88. While Katarn was recovering from the encounter with the information broker, Rahn appeared to him in a dream, telling Katarn about the Valley of the Jedi and Jerec's plans."}, {"tag": "p", "text": "Guided by Rahn, Katarn returned to his home on Sulon, where he found Rahn's lightsaber and decoded the disc, learning about the stone map embedded on the ceiling. He soon discovered, however, that the map had been taken to Jerec's palace in the city of Barons Hed, where it was to be deciphered by 8t88. As soon as he reached the city, Katarn was attacked by a female bounty hunter with a remote. Rahn once again contacted Katarn, helping him to familiarize himself with the newly acquired lightsaber. With Rahn's guidance, Katarn was able to defeat both the woman and her remote. As a disembodied voice, Rahn contacted Katarn several more times, providing Morgan's son with information on Jerec's Dark Jedi. Despite Katarn's efforts, however, Jerec discovered that the valley was located on the planet Ruusan. Soon, his forces reached the planet and began excavation works at the valley."}, {"tag": "p", "text": "Sensing that there was something good left in the youngest of Jerec's Dark Jedi, Yun, Rahn contacted him on Ruusan. Yun had been tasked by Jerec with getting rid of the Jedi and Sith spirits that roamed around the valley; he tried to defeat them by shaping the Force and hurling it towards them, but did not succeed. Rahn appeared as a voice in the young darksider's head and advised Yun to try another tactic—to sense the spirits' pain. Yun followed Rahn's advice and was able to make the spirits depart, and Rahn then explained that Yun would play an important part in the events that would follow. The Epicanthix asked what part, and Rahn answered that it was entirely up to him. The encounter with Rahn made such a deep impression on Yun that several days later, when a groundquake caused a rock to fall on an Imperial called Jaru, he used the light side of the Force to help him. After that, Rahn appeared to Yun again, telling him that the dark side was not the only source of power."}, {"tag": "p", "text": "Eventually, Katarn also reached Ruusan, where he killed Maw in anger and confronted Jerec near the Dark Jedi's cargo ship, the Sulon Star. There, Jerec offered Katarn the chance to join his cadre. Although he had been driven close to the dark side by Maw's taunts, Katarn was able to hold off his anger and refuse. In response, Jerec pushed him into the Sulon Star and sent the ship crashing towards the surface. Rahn helped Katarn evade death by telling him that Kyle's ship, the Moldy Crow, had been kept in the hangar bay of the Sulon Star. Katarn managed to escape the doomed Sulon Star, but could not handle the controls of his own ship and crashed the Moldy Crow near the valley. He was found, unconscious, by Boc, Sariss, and Yun. Before leaving to assist Jerec, Boc crushed the lightsaber that had once belonged to Rahn with a rock. Sariss then moved in for the kill, but Yun, driven close to the light side by Rahn, blocked her blow. Accidentally, Sariss deflected her lightsaber into Yun himself. Before dying, Yun told her that Katarn, as a Jedi, deserved a battle. This way, he was redeemed and returned to the light side."}, {"tag": "p", "text": "Katarn picked up Yun's lightsaber and killed Sariss. He then proceeded further and ultimately killed Boc and faced Jerec, who was in possession of the valley's power. During his confrontation with Jerec, Katarn nearly fell to the dark side, but managed to hold off with the help of Rahn and kill the Dark Jedi. With Jerec's death, the spirits that had been trapped inside the valley were finally freed. After the events on Ruusan, Qu Rahn was not seen or heard contacting Katarn. To honor Rahn's memory and that of his father, Katarn carved their images in the two statues near the entrance to the valley."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rahn was a dark-skinned man with black hair and brown eyes. Although raised as an extremely loyal Jedi, he was sometimes haunted by thoughts of vengeance and hatred. He was deeply troubled by the actions of Jedi traitors and considered that such turncoats like Jerec, Anakin Skywalker, and Halagad Ventor had sealed their own fates—they could never be saved. Not even knowing most of them, Rahn truly hated those who had betrayed the Jedi Order. Sometimes, Rahn almost hoped that Jerec would find him so that he could exact justice on the Inquisitor. When Jerec ripped information about Morgan Katarn from Rahn's mind, the Jedi Master believed that he had become a traitor to the Order himself. At that moment, he gave into despair and attacked Jerec's Dark Jedi in anger. However, immediately before his death, Rahn realized that he had been wrong in his beliefs as he glimpsed the spirits of the redeemed Ventor and Skywalker. Rahn finally understood that Yoda wanted him to see that no one was beyond redemption. This understanding led Rahn to appear to Yun, helping the young darksider to turn to the light."}, {"tag": "p", "text": "Following his meeting with Yoda on Dagobah, Rahn became obsessed with finding the Valley of the Jedi. This obsession led him to many years of passionate search and, ultimately, to his demise at the hands of Jerec. However, it also made Rahn's meeting with Morgan Katarn possible. During the brief period that he stayed at Katarn's farm, Rahn and Katarn became good friends. Rahn was also on good terms with the Rebel Alliance leader, Mon Mothma."}, {"tag": "p", "text": "When not searching for the valley, Rahn spent a lot of time in contemplation, eventually realizing that there were worse things than death. He possessed a journal, where he wrote his thoughts regarding the Force, Jerec, and Jerec's Dark Jedi. After Rahn's death, Kyle Katarn inherited that journal, and he often consulted its wisdom in order to better understand the ways of the Force. Rahn was a kind and wise individual, and those traits could be easily seen in him by others. Nevertheless, the Jedi was a strong-willed man, able to leave Cee Norley behind, fully realizing that she would be killed. After that, he refused to tell anything to Jerec, even after being beaten and forced to watch as his comrades were killed one by one. When it was Duno Dree's turn, Rahn displayed his leadership qualities by turning to the frightened young man and willing him to die in order to protect the valley's secret."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "A fully-trained Jedi recognized as a Jedi Master by Yoda himself, Rahn was skilled with both the Force and the lightsaber, being able to single-handedly defeat five of Jerec's minions and severely wound one of them. For the most part, however, Rahn preferred to concentrate on his Force abilities. He was capable in telekinesis, which he demonstrated by stealing Yun's lightsaber from his belt. In addition, Rahn knew Force speed, and was one of the few Jedi to appear as a Force ghost, having been taught this secret by Yoda."}, {"tag": "p", "text": "Rahn's Force sense ability was especially developed, to the point that it even allowed him to see the future. It was a vision that led him to Morgan Katarn, and in the same vision, Rahn foresaw that he would be captured. Never meeting Kyle Katarn in person, Rahn sensed that Morgan's son was very strong in the Force and that his path was different from the one he had initially chosen and had a premonition showing him that Kyle would play a key role in finding the Valley. After becoming a ghost, Rahn foretold that Yun would play an important part in the events on Ruusan."}, {"tag": "p", "text": "Rahn could write, read, and speak two languages, his native Socorran and Basic, and was skilled in computer use, some simple weapons, and martial arts. He also had some knowledge of how to treat injuries."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Qu Rahn first appeared in the 1997 LucasArts video game Star Wars: Jedi Knight: Dark Forces II, where he was portrayed by Bennet Guillory. Rahn appeared twice in the game—first in the introductory cutscene, where he was killed by Jerec, and then as a ghost in Katarn's dream. His voice guided the main protagonist throughout the rest of the game. Rahn later appeared in the 1998 novella adaptations of the game—Dark Forces: Rebel Agent and Dark Forces: Jedi Knight—and, subsequently, in the audio drama adaptations of the two novellas. In the audio dramas, Michael Tezla portrayed Rahn. Rahn was also mentioned in the first installment of the Dark Forces trilogy, Soldier for the Empire, and its audio drama adaptation. Rahn's backstory was expanded in The Dark Forces Saga, a series of game scenarios released by Wizards of the Coast on their web site."}, {"tag": "p", "text": "Rahn was listed among the surviving Jedi in the Special Edition of HoloNet News, published in the 84th issue of the Star Wars Insider magazine. Rahn's image was originally going to appear in Insider but it was instead made into another Jedi, Koffi Arana. In an interview published in the Star Wars: Jedi Knight: Dark Forces II: The Official Strategy Guide, the lead writer of the game, Justin Chin, presents a slightly different backstory for Rahn, which contradicts his later portrayal. According to Chin, in his youth, Rahn was a wanderer and \"sort of\" an orphan, instead of a loyal steadfast student as described in more recent sources. Chin also states that at some point during his search for the Valley, Rahn ran into Jerec, who attempted to recruit him into his cadre. Although Rahn was somewhat borderline between the light and the dark sides, he refused the offer. As none of this information was published elsewhere outside of the interview, this article gives precedence to more recent sources."}, {"tag": "p", "text": "In Dark Forces II: Jedi Knight, he only appears as Rahn. The first name Qu is given only in the game's manual. The multiplayer feature of Dark Forces II has a model named \"Dark Rahn\" among its playable characters. This \"Dark Rahn\" wears pants and a jacket, and his face is covered in white tattoos. The same model is available in Jedi Knight's expansion pack, Star Wars: Jedi Knight: Mysteries of the Sith. Rahn's name is misspelled \"Qu Rhan\" in HoloNet News. Rahn was also mentioned in the online preview of the Jedi Academy set of Star Wars Miniatures. The preview features a continuity error, as it states that it was the spirit of Rahn who informed Kyle Katarn of his father's affiliation with the Rebel Alliance. Katarn's discovery of Morgan's Rebel sympathies, however, is featured in Soldier for the Empire, which takes place several years prior to Rahn's contact with Kyle."}, {"tag": "h3", "text": "Non-canon ending"}, {"tag": "p", "text": "In the non-canon ending of Jedi Knight: Dark Forces II, where Kyle Katarn chooses the dark side path, Rahn abandons him during the crash of the Sulon Star. Still, Katarn survives and becomes the new Emperor after killing Jerec and absorbing the valley's power. It is possible, however, to have Rahn say the above line to Katarn much earlier in the game. This event can be triggered at the start of level four if Katarn chooses to destroy his family droid WeeGee, although Rahn continues to guide Katarn as normal, and the player can still attain the light side ending afterward."}, {"tag": "h3", "text": "Differences between versions"}, {"tag": "p", "text": "Jedi Knight: Dark Forces II, the Dark Forces novellas, their audio dramatizations, and The Dark Forces Saga scenarios are all different in a number of ways and sometimes provide conflicting information. Apart from minor dialogue changes, the most notable difference is the depiction of Rahn's death scene in the audio dramatization. Unlike the game and the novel, Rahn does not attack the Dark Jedi in it; instead, he begs Morgan Katarn to forgive him. Additionally, there is some inconsistency over Rahn's part in Jerec's defeat. Both the game and the Jedi Knight novel depict Katarn not responding to Jerec's taunts. The audio drama, however, shows Katarn giving in to anger and almost turning to the dark side, and only thanks to Rahn's help, he manages to hold off. The Dark Forces Saga also implies that Rahn has foreseen his capture by Jerec. On the other hand, Rebel Agent makes no mention of such vision. Instead, Rahn intends to gather a team to study the valley and free the spirits all by himself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}