{"url": "Quadex_power_core", "categories": ["Category:Canon articles", "Category:Freighter and transport components", "Category:Quadex products", "Category:Reactors and power generators"], "nodes": [{"tag": "h1", "text": "Quadex power core"}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Quadex power core were a model of gray circular power core which could be installed into modified YT-1300 light freighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While it was owned by the junk dealer Unkar Plutt on the planet Jakku, the modified YT-1300 light freighter known as the Millennium Falcon was equipped with a Quadex power core located in its central section between its laser cannons. Around thirty years after the Battle of Endor, the Falcon was stolen from Plutt by the scavenger Rey, the former stormtrooper Finn and the astromech droid BB-8, who used it to escape from the First Order."}, {"tag": "p", "text": "Plutt's poor maintenance of the starship's SSP05 hyperdrive meant that the take off led to a flux in the motivator, which bled back into the power core. This caused a surge that sent a faulty signal to the fuel distributor, leading to the distributor's propulsion tanks and the ship's auxiliary systems to flood with fuel. This caused systems to overheat and a junction to rupture, allowing the fuel to fill the ship in a gaseous state. Rey was able to fix the issues causing the leak, but then reversed the fix in order to create a trap when the Falcon was captured by the smugglers Han Solo and Chewbacca, two of its former owners. Once the smugglers and the trio onboard the ship began working together, Rey repaired the issue again so Solo could take control of the ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Quadex power cores were first mentioned in the Star Wars Legends reference book Star Wars: Incredible Cross-Sections, which was written by David West Reynolds and released in 1998. The core was confirmed to be canon when it was mentioned in the film Star Wars: Episode VII The Force Awakens in 2015. The core was then pictured in, which was illustrated by Kemp Remillard and released in conjunction with the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}