{"url": "Qu_Rahn%27s_lightsaber", "categories": ["Category:Legends articles", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Qu Rahn's lightsaber"}, {"tag": "p", "text": "This green-bladed lightsaber was created by Jedi Master Qu Rahn. He passed it on to Morgan Katarn, who in turn gave it to his son, Kyle Katarn, who used it in his duel with the Dark Jedi Yun, Gorc, Pic, and Maw. It was later destroyed by Boc Aseca."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point, Jedi Qu Rahn built a green-bladed lightsaber for himself. After meeting Morgan Katarn, Rahn entrusted Katarn with his lightsaber and began using an orange-bladed lightsaber that once belonged to Master Yoda instead. Morgan kept the lightsaber hidden in his home, placing it inside the body of the family droid, WeeGee. In his holorecording, Morgan left the lightsaber to his son, Kyle Katarn, urging him to use the lightsaber for good."}, {"tag": "p", "text": "The lightsaber remained hidden during the raid on Sulon and Morgan Katarn's capture, and even the homestead's ransacking by the Seven Dark Jedi and the Grave Tuskens in 5 ABY in their quest to learn the location of the Valley of the Jedi. Kyle, on a mission to stop Jerec from using the power of the Valley, then came across the lightsaber after reactivating WeeGee and watching his father's holorecording."}, {"tag": "p", "text": "Kyle decided to test the weapon, using it along with his arsenal to fight his way out of the homestead and through the irrigation channels. Kyle carried it throughout his mission on Sulon, through Barons Hed, and subsequently used it in his duel against the young Dark Jedi Yun. Katarn further used the lightsaber in his hunt for 8t88 on the Sulon Star, and then used it once more against the Dark Jedi \"brothers,\" Gorc and Pic."}, {"tag": "p", "text": "Katarn used the saber throughout his mission on Ruusan, using it to defend himself in his duel against Maw. Upon slaying Maw in anger after Maw taunted him over his father's death, Jerec prompted Kyle to strike down the captured Jan Ors with the saber and embrace the dark side. However, Kyle refused. Upon escaping Jerec, Kyle crashed the Moldy Crow, and the saber was destroyed with a rock shortly thereafter by Boc Aseca. Kyle, upon Yun's sacrifice, took up the latter's lightsaber for the remainder of the mission, until he constructed his own lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}