{"url": "Quariped", "categories": ["Category:Legends articles", "Category:Creatures of unspecified diet", "Category:Flying creatures", "Category:Species of undefined sentience", "Category:Vertebrates"], "nodes": [{"tag": "h1", "text": "Quariped"}, {"tag": "p", "text": "Quaripeds were an alien species. They boasted four limbs, and green wing-like appendages. The \"bodies\" of the Quaripeds were ringed by three red hoops."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Quariped was an alien creature found in the galaxy. They possessed four limbs, and two wing-like appendages, which were green, and covered with sharp points. Sprouting from each of the wing-like appendages were extensions that ended in antennae. The \"body\" of the Quariped featured a black and white pattern, and was ringed by three red hoops. The joints of the Quariped's limbs were circular, and the soles of its feet were covered in an array of points not unlike those on its wing-like appendages. At the upper end of its \"body\" was a conical extension, out of which came a tongue-like appendage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Quariped was created by Jack Perkins, through the \"Design An Alien\" competition held in Star Wars Galaxy magazine, which was launched in Star Wars Galaxy Magazine 3 (1995). The competition called for readers to create entirely new aliens inspired by the universe presented in the original trilogy of Star Wars films. When the winners were published in Star Wars Galaxy Magazine 7 (1996), Perkins' entry was amongst the \"honorable mentions\" section of the \"Under 16 years old\" subdivision, as Perkins was only 9 years of age at the time. The artwork was computer generated, and was one of the few such pieces to have been submitted into the competition. Unlike all the other artwork published in Star Wars Galaxy Magazine 7, however, the submission was accompanied by no text. Star Wars continuity editor Leland Chee later stated that the published material from \"Design an Alien\" was to be considered canon. The Quariped, however, has yet to be referenced in any other Star Wars works."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}