{"url": "Quano", "categories": ["Category:Legends articles", "Category:Bartenders", "Category:Males", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Quano"}, {"tag": "p", "text": "Quano was a male Rodian bartender who lived on the planet Doan. In 980 BBY, he took the Jedi Knight Medd Tandar to meet with Doan's mining caste; however, the Jedi and miners were all assassinated by an Iktotchi assassin. Later, the Dark Jedi Set Harth forced Quano to show him where the Sith artifacts on the planet were located. Upon their arrival, Harth killed the miners present, and Quano fled. Shortly afterward, when the Sith apprentice Darth Zannah arrived on a mission to investigate Tandar's death, she convinced Quano to help her, and he took her to his friend, Pommat, a janitor and smuggler. Pommat told her of his spice smuggling business and revealed that he was aware that she had come from Ciutric IV. Zannah then killed both Quano and Pommat immediately, as she could not let either of them live with the knowledge of where she and her Master lived."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Quano was a male Rodian bartender who lived on the planet Doan during the time following the New Sith Wars. In 980 BBY, the Jedi Knight Medd Tandar was sent to Doan to investigate the presence of Sith artifacts on the world and to mediate the rising tensions between the mining caste and the Doan Royal House. He approached Quano regarding the location of the miners who were in charge of the operation and Quano gave him their location. However, during Tandar's meeting with the miners, they were attacked and massacred by an Iktotchi assassin. After this, the miners told Quano that if they saw him again, they would kill him."}, {"tag": "p", "text": "Soon after, the Dark Jedi Set Harth went to Quano to find information regarding the Sith artifacts that had been dug up earlier. Harth offered Quano credits to reveal the location of the artifacts. Quano believed that Harth was simply a rich smuggler, so he called his bar's bodyguards over to mug Harth. However, Harth killed the bodyguards and forced Quano to lead him to Draado, the miner who had dug up the artifacts. Draado had become corrupted by the power of the artifacts, so Harth decided to attack him and the other miners present. During the ensuing fight, Quano fled."}, {"tag": "p", "text": "Later, the Sith apprentice Darth Zannah arrived on Doan to investigate who was responsible for Tandar's death. She eventually came to believe that this person was Harth. After confronting Quano about it, she persuaded him to take her to his friend Pommat, a janitor and smuggler at the local spaceport. After Pommat revealed his information regarding the murderer, Zannah gave him and Quano 200 credits each. Pommat also discussed his side business, in which he sliced into visitor's starships and hid shipments of the spice glitterstim aboard. He then got in touch with his contact on the starship's homeworld to sell it. After Zannah asked, he informed her that he did not store any spice on her starship since he had never seen a ship from Ciutric IV before and had no contacts there. Zannah then killed both Quano and Pommat with her lightsaber, knowing that she could not allow anyone to hold the knowledge of where she lived. To leave no trace of her visit on Doan, Zannah jettisoned both bodies into Doan's sun."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Quano was a poor but confident bartender who served the lowest of the mining caste on Doan. With his bodyguards, he was not afraid to take advantage of those with greater wealth who ventured into his bar, as he did when visited by Set Harth. After the massacre on Doan and his run-in with Harth, he became more wary and afraid of others since his most recent meetings led to his misfortune. Due to his fear and abuse, Darth Zannah found him easy to manipulate, especially when credits were involved—as witnessed in her meeting with Quano and Pommat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Quano was created by author Drew Karpyshyn for his 2009 novel Darth Bane: Dynasty of Evil. Quano was both introduced and killed in Dynasty of Evil."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}