{"url": "Quanto", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Articles with conflicting sources", "Category:Individuals of unidentified species", "Category:Males", "Category:Members of Bogga's gang"], "nodes": [{"tag": "h1", "text": "Quanto"}, {"tag": "p", "text": "Quanto was a male gangster living in the Stenness star system four thousand years before the Battle of Yavin. A space pirate, Quanto was in the employ of crime lord Bogga the Hutt as one of his enforcers. He often worked under the direction of Bogga's senior enforcer, Gudb, whom Quanto considered a friend. Quanto's feelings of camaraderie were not reciprocated by Gudb, however, and he was often treated as an underling by Gudb rather than an equal."}, {"tag": "p", "text": "In 3999 BBY, Quanto was on the Stenness Hyperspace Terminal when he and Gudb accosted Jedi Knight Andur Sunrider and his family in an attempt to steal the Adegan crystals in their possession. Quanto was sent to distract the family while his partner went to obtain Bogga's permission to proceed. The robbery was unsuccessful, and though the Jedi was killed, so too was Quanto—having been sliced from shoulder to hip by the deceased Jedi's wife, Nomi, using Andur's lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Stenness pirate"}, {"tag": "p", "text": "Quanto was a male gangster who resided in the Stenness system. He found employment as a pirate with the system's resident crime lord, Great Bogga the Hutt. As one of Bogga's enforcers, Quanto prowled Stenness, usually in the company of his senior enforcer and comrade, Gudb, looking for those he could take advantage of. Quanto and his partner favored the local hyperspace jump station, which was regarded by many as a haven of illegal activity, where they surveyed incoming starship traffic for potential victims. Though Bogga usually gave Gudb orders, it was Quanto, whom Gudb treated like a subordinate, that carried them out more often than not."}, {"tag": "p", "text": "In 3999 BBY, Quanto and Gudb were at the Stenness spaceport, browsing eavesdropping equipment for starships to potentially plunder. Quanto monitored the viewscreen, where he noticed several ships arrive at the space station, each of interest to him. The first ship, a cruiser carrying a considerable load of illegal spice, made Quanto eager. His partner shrugged it off, stating that the distance between them made intercepting the spice hauler impossible. Gudb nearly dismissed Quanto's second choice as well, before realizing that this ship's passengers, the Sunrider family, brought rare Adegan crystals with them. This excited Quanto, who had no knowledge of what Adegan crystals even were. Nonetheless, Quanto went to follow the family while his partner alerted Great Bogga."}, {"tag": "h3", "text": "Stalking a Jedi"}, {"tag": "p", "text": "Quanto approached the man, a Jedi Knight named Andur Sunrider, propositioning him with a hefty load of Novanian grog alcohol. As the Jedi declined, Quanto attempted to steal the purse of Sunrider's wife, Nomi. Quanto was immediately stopped by the Jedi, who demanded that Quanto return the stolen purse to his wife. Exposed, Quanto lied and pretended that the purse had accidentally ended up in his possession, before tossing it back to Sunrider. He then departed and returned to Gudb to report his findings."}, {"tag": "p", "text": "Bogga desperately craved the crystals, and sent Gudb to retrieve them from Sunrider, though not without cautioning the diminutive gangster of his quarry's Jedi status. Gudb, however, was accompanied by Quanto, and felt that along with another of Bogga's enforcers, Rek, the three of them would be able to easily ambush Sunrider and steal his valuables. Quanto preceded them in pursuit of the Jedi, blending back into the bustle of the station, while his comrades spread out and inconspicuously surrounded the Sunrider family. His part in the mission was to distract Sunrider long enough for Gudb to get into place. Catching sight of A-3DO, the Sunriders' protocol droid, Quanto positioned himself so that the droid would cross his path. Rek then pretended to accidentally bump the droid, which caused A-3DO to drop the tray of foodstuffs he had gathered for his masters."}, {"tag": "p", "text": "When A-3DO begged the thug's pardon, Quanto drew his blaster pistol and threatened to destroy him on behalf of Rek, who felt that automatons had no business questioning the activities of sentient beings. Sunrider then arrived and broke up the commotion, insisting that his droid be left alone. Quanto continued to distract Sunrider while Gudb approached him from behind, preparing his pet gorm-worm to deliver a poisonous bite to the unsuspecting Jedi. Quanto refused to release the droid, and when Sunrider ignited his lightsaber, the gangster trained his blaster on the Jedi. Gudb's pet then attacked, biting Sunrider on the neck and injecting him with its deadly toxin. Sunrider momentarily struggled but died soon thereafter, leaving his bewildered wife to both mourn him and fend for herself."}, {"tag": "h3", "text": "Fatal countdown"}, {"tag": "p", "text": "Quanto and his partners surrounded Nomi Sunrider and attempted to force her to renounce her claim on the Adegan crystals, but became alarmed when she began conversing with someone whom Quanto could not see. He continued to demand the crystals from her, even threatening to jettison her husband's body into space. His colleagues' alarm increased when the woman picked up the deceased's lightsaber, and wielded it like she was a trained Jedi. Quanto, however, remained unshaken by the display; he knew that Sunrider was no Jedi, and offered her fractions of a second to put the weapon down before he opened fire on her and her child. His threat was met with equal force—as he rounded the end of his short countdown, Nomi Sunrider killed him, bisecting him from his right shoulder to the left hip. When Rek attacked Sunrider in retaliation for the self-defense killing of his friend, Sunrider cut him down as well. Gudb was spared and immediately fled in disbelief that a seemingly timid woman had just sliced Quanto in two."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Quanto was a yellow-skinned bipedal being, with bulbous red eyes that protruded from stalks on either side of his face. He had one long, whisker-like appendage on either side of his pincer-like mouth as well. His entire body was covered in black markings, and when they were closed, the markings on his eyelids gave the appearance of eyes."}, {"tag": "p", "text": "Quanto was a criminal by profession, and displayed many of the characteristics associated with such beings. He, along with his fellow enforcers, preyed upon unsuspecting visitors of the Stenness Hyperspace Terminal, hoping to pilfer what he could when an opportunity presented itself. He was dishonest, evidenced when he lied to Andur Sunrider about how he acquired the coin purse of Sunrider's wife, Nomi. When confronted by Jedi Sunrider, Quanto backed down and immediately returned the stolen property before fleeing. He was ignorant to the nature and worth of Adegan crystals, even though his excitement equaled Gudb's upon learning of their presence in the hyperspace terminal. He became easily excited with the prospect of looting new vessels."}, {"tag": "p", "text": "Though Quanto considered Gudb a friend, he was regarded as a lackey by the senior enforcer, who often ordered Quanto into skirmishes while Gudb himself played the background. He frequently spoke in slang while using intimidation as a tactic, and was quick to draw his blaster to end confrontations, though he offered both Andur and Nomi Sunrider opportunities to stand down before he fired upon them. Just prior to his death, he displayed a dispassionate demeanor toward Nomi Sunrider in her moment of bereavement, further aggravating Sunrider's hysteria. His aggressive and persistent nature contributed to his death, as he was killed by the female Sunrider after receiving repeated warnings from her to leave her and her child in peace."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Quanto could operate basic surveillance equipment such as the eavesdropping technology he and Gudb employed while scanning for potential ships to despoil. He carried a personal blaster pistol with him that he wielded in his right hand. Quanto was also a pickpocket, though he was caught immediately after attempting to relieve Nomi Sunrider of her pouch. Quanto was not Force-sensitive, nor did he recognize Andur Sunrider's Force ghost when it appeared, believing that Nomi Sunrider was seeing things."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Quanto first appeared in the third issue of writer Tom Veitch's Tales of the Jedi comic series, titled, The Saga of Nomi Sunrider, Part 1. Quanto is also featured in the audio adaptation of the Tales of the Jedi series, where his exploits are explored in more detail. In the Tales of the Jedi Companion, The Essential Chronology, Power of the Jedi Sourcebook, Star Wars: The Ultimate Visual Guide, The Official Star Wars Fact File 67, Jedi vs. Sith: The Essential Guide to the Force, and The Complete Star Wars Encyclopedia, Quanto is indirectly referred to in conjunction with the rest of Bogga's enforcers as one of the thugs who participated in the murder of Andur Sunrider."}, {"tag": "p", "text": "Aside from minor differences in dialogue, Quanto's role in the series of events that eventually lead to his death differ between his comic appearance and that of the audio rendition. First, in the comic, Gudb overhears the Sunriders discussing the Adegan crystals in their possession and relays this to Bogga, with Quanto standing beside him. In the audio drama, however, Quanto and Gudb are monitoring their arrival, and Gudb's sensor alerts him to the presence of the crystals. He then sends Quanto off to follow the Sunriders while he goes to speak with Bogga. Also, in the comic version, Rek is the individual who initially bumps A-3DO, causing the droid to drop the tray in its hands. In the audio drama, Quanto bumps the droid, not Rek. When Quanto is finally killed in the comic, Nomi Sunrider does so immediately after Quanto gives her a millisecond to put the lightsaber away. In the audio version, Quanto gives Sunrider a count to three before she cuts him down."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}