{"url": "Quarmall", "categories": ["Category:Legends articles", "Category:Abyssins", "Category:Dark Side Adepts", "Category:Fallen Jedi", "Category:Jedi Generals", "Category:Jedi Purge survivors", "Category:Males", "Category:Philosophers"], "nodes": [{"tag": "h1", "text": "Quarmall"}, {"tag": "p", "text": "Quarmall was a male Abyssin Jedi Master who served the Jedi Order and the Galactic Republic as a General in the Grand Army of the Republic during the Clone Wars. A controversial Master, the Jedi High Council censured him for taking the entire Bergruutfa Clan as his Padawans. While thought dead when he encountered General Grievous during the war, Master Quarmall survived and was trained as a Dark Side Adept by the Sith Lord Darth Sidious."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Separatist Crisis"}, {"tag": "p", "text": "A Force-sensitive male Abyssin, Quarmall was trained in the ways of the Force by the Jedi Order, eventually taking on the mantle of Jedi Master after constructing a green-bladed lightsaber. Master Quarmall took on several missions from the Jedi High Council during his career, partnering with Jedi Stass Allie and Tassida Judrelle during the Separatist Crisis which plagued the Galactic Senate. Together, the three Jedi dismantled a salt smuggling cartel on Arcona and arrested fifteen smugglers, including cartel kingpin Lojrak Shrag."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Master Quarmall took up the rank of General in the Grand Army of the Republic. Taking up stewardship of the Bergruufta clan of Jedi Initiates, Master Quarmall came under fire from the High Council after he claimed to have taken the ten Initiates as his Padawans in direct defiance of the Jedi Code."}, {"tag": "p", "text": "While escorting his Padawans aboard a Mon Calamari capital ship, the vessel was boarded by General Grievous and an army of B1-Series battle droids. Quarmall engaged the group of droids, he was overpowered and shot several times. Leaving the Jedi Master for dead, Grievous confiscated the Abyssin's lightsaber, and captured the clan of Padawans. Due to Master Quarmall's tenacious Abyssin physiology, the Jedi was able to survive the wounds and keep himself alive."}, {"tag": "h3", "text": "The New Order"}, {"tag": "p", "text": "Sitting out the rest of the war, Master Quarmall was captured by agents of the Dark Lord of the Sith Darth Sidious who twisted him to the dark side of the Force. When the Jedi Order was disbanded by Sidious' alter-ego Supreme Chancellor Palpatine and the Galactic Empire came to power, Quarmall became a sleeper agent for his Imperial Highness."}, {"tag": "p", "text": "Following the Battle of Endor, Quarmall reemerged, spreading a disingenuous message of interplanetary unity and peace to cause a weakening of the New Republic Military. His plan was soon foiled by New Republic agents and fledgling Jedi of the reformed Order who exposed his plan to his followers by showing Imperial-coded messages and holovids of his dark plot. Soon after, they confronted and defeated the Dark Side Adept in a furious battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}