{"url": "Quarsh_Panaka/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Articles with conflicting sources", "Category:Humans", "Category:Males", "Category:Moffs of the Galactic Empire", "Category:Naboo", "Category:Royal Naboo Security Force officers"], "nodes": [{"tag": "h1", "text": "Quarsh Panaka"}, {"tag": "p", "text": "Quarsh Panaka was a Human male who served as the head of the Royal Naboo Security Forces before, during, and after the Invasion of Naboo, and later was the Moff for the Chommell sector during the Galactic Civil War. He was a vocal militarist among the peaceful people of Naboo, a fish out of water amongst his peers. Shaken by the murder of King Ars Veruna, he installed various security measures to make sure that the same thing did not happen to his second monarch, Queen Padmé Amidala. By learning from the mistakes of his predecessor, Maris Magneta, he was able to successfully defend her in several periods of danger, and continued to serve Naboo, the Republic, and eventually, the Empire."}, {"tag": "p", "text": "Notoriously conservative, Panaka often clashed with the Jedi Master Qui-Gon Jinn during the Invasion of Naboo, deriding the Jedi's controversial methods and retaining the utmost faith in his own. Nevertheless, with Jinn's help he was able to get his chance at military action, in the Battle of Naboo. Panaka thereafter became a staunch supporter of Supreme Chancellor Palpatine and the New Order of the Galactic Empire, rising to the position of Moff of his home sector with Palpatine's patronage."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "Quarsh Panaka was born on Naboo, but was educated offworld in several guilds, specializing in threat analysis and personal combat. Panaka's education was broad, designed to give him the full spectrum of knowledge and training he would need to become an effective security chief. In his education, he traveled to Tolan, and was given instruction from a Zabrak in the Tracker's Guild. He later joined a Republic Special Task Force and gained combat experience against pirates. This experience and education served him in good stead upon his return to Naboo and subsequent enlistment in the Royal Naboo Security Forces. While he was off-world, his older sister was killed during a training exercise."}, {"tag": "p", "text": "To deal with this grief, Panaka became increasingly dedicated to his job and to serving the current monarch, King Ars Veruna. He served under Captain Maris Magneta as a Lieutenant and was paired with Sergeant Bialy. He was not known for being sociable—a character trait he would exhibit throughout his life—being more focused on being the consummate professional. Panaka was constantly working to improve the security force, and actually invented the liquid-cable grappling hook shooter that became standard amongst his colleagues' weapons."}, {"tag": "p", "text": "In 36 BBY, Panaka and Bialy were charged with bringing in a Gungan, Kroke Modbom, who had apparently been causing trouble in Port Landien. The pair cornered Modbom at the Port Landien Perfumery, and while Panaka waited to ambush his target in the store's cellar, Bialy went upstairs to confront the Gungan. The lieutenant heard blaster shots ring out, before Modbom burst into the room."}, {"tag": "p", "text": "Panaka fought with the Gungan, trying to prevent him from escaping the perfumery. He was successful in subduing the target, although he sustained several injuries to his face in the process. Bialy noted that the Gungan did not have a blaster, and so she supposed that Modbom had an accomplice, who had escaped. Returning to the Palace, Panaka was commended by Magneta, who then introduced him to an aide of Senator Palpatine's, Sate Pestage. Pestage was taking Modbom's punishment into Palpatine's hands, much to Panaka's confusion. He mentioned Modbom's supposed accomplice, but Magneta had already assigned the lieutenant to traffic control, as a sea creature had beached itself north of Port Landien."}, {"tag": "p", "text": "While blocking off the coastal road near the cove containing the beached creature, Panaka was almost killed when a speeder broke through the roadblock. Calling officers Bialy, Pestrak and Dunni on his comlink for backup, Panaka set off in pursuit, chasing the felon to the cove. There, he saw the beached creature for the first time: a legendary sando aqua monster. Making his way down into the cove, the lieutenant spotted a white-garbed figure who tried to run him over. Panaka fired off warning shots, but the figure jumped into one of the many nearby rock tunnels. Cautiously, the lieutenant followed, venturing into the pitch black abyss of the Naboo's unmappable rock tunnel network. As he moved further into the tunnels, blindly, he was ambushed by a man codenamed Veermok, who was wielding a blaster. Forced to surrender, Panaka was at Veermok's mercy, and was led even deeper into the tunnel network."}, {"tag": "p", "text": "Veermok claimed that the tunnels held a stash of secrets that could incriminate King Veruna. He claimed to be fighting for Naboo, and against the lies of its monarchy—something that Modbom had been doing as well. Panaka was not deterred by the accusations, but before the pair could reach the alleged evidence, the sando aqua monster's movements above caused a cave-in, releasing a torrent of water. Released in the torrent was a wide array of disturbing objects, including eight corpses—humans and Gungans alike—and several storage lockers. Panaka was able to reclaim his blaster, and once the commotion was over, Veermok attempted to escape. In response, the lieutenant attempted to shoot him in the back of the knee, but his blaster malfunctioned. Acting quickly, he utilized the liquid grappling cable, and reeled Veermok in. Before he could restrain his captive, Veermok broke free of Panaka's hold, and ran off down the tunnel once more. The lieutenant prepared to utilize his grappling hook again, but before he could, a blaster shot rang out, and Veermok fell to the ground."}, {"tag": "p", "text": "The man who had fired the shot was none other than Pestage. Veermok had not perished immediately, but died soon afterward. Panaka was angry at the result, but Pestage, who had intercepted the lieutenant's earlier distress call, pointed out that he had his man. Returning to the palace, Panaka was convinced that Pestage's actions indicated a cover-up of evidence, and that the matter required further attention. He mentioned the bodies, but Magneta claimed that they could have been regurgitated by the monster, or killed by pirates. Nevertheless, Panaka wanted Pestage arrested, but Magneta insisted that everything was being taken care of. Before Panaka could examine the room and its potentially incriminating evidence, Captain Magneta had the area blasted with proton torpedoes from an N-1 starfighter. The evidence, which could have pointed at King Veruna or even Senator Palpatine, was destroyed forever."}, {"tag": "p", "text": "Three years later, King Veruna abdicated in the wake of a corruption scandal and was killed mysteriously. Magneta failed to prevent this death and resigned in disgrace. Panaka was appointed Head of Security in Magneta's stead; one of Queen Amidala's first acts as regent. Panaka took the death of Veruna particularly hard, and he felt the late King's death was his fault. To ensure this never happened again, he developed an elaborate security setup, which involved using the Queen's handmaidens as decoys. The ploy saved the life of Amidala more than once."}, {"tag": "p", "text": "During a diplomatic mission to Coruscant in 32 BBY, Panaka and other members of the Royal Naboo Security Forces were fired upon by an unknown attacker. Lieutenant Gavyn Sykes received permission from Panaka to drive away the attacker."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "When the Trade Federation blockaded Naboo, Panaka was among the first to recognize the significant threat they posed to the world. When they subsequently invaded Naboo, Panaka and his security force were less than well-equipped to defend Theed from them. His forces put up minor resistance, though they surrendered when they fully realized the sheer size of OOM-9's force. The droids stormed the palace, and took both him and the Queen into custody. Shortly before, Panaka had initiated his decoy scheme, and although the real Queen was captured too, the Neimoidians fell for the ruse, and focused on the decoy."}, {"tag": "p", "text": "As they were being escorted out of Theed, two Jedi Knights, ambassadors that had been sent to resolve the dispute behind the blockade, rescued Panaka, the Queen, the Governor, Sio Bibble, and several security guards. Qui-Gon Jinn, one of the Jedi, wanted to take Amidala to Coruscant, against Panaka's initial instincts. The Queen decided against Panaka's judgment, and chose to travel to the capital with the Jedi. Grudgingly, Panaka joined her while Bibble chose to remain behind and look after the Naboo."}, {"tag": "p", "text": "After the Jedi seized the Theed Hangar from the droids stationed there, the group entered the Queen's personal starship, and blasted away from Naboo. Before he left the planet, Panaka issued an evacuation order to the Royal Naboo Security Forces, ordering them not to engage the enemy except in self-defense. In trying to get through the blockade, the ship's hyperdrive was badly damaged. Jinn's apprentice, Obi-Wan Kenobi, suggested that they land on Tatooine, a desert planet, for repairs. Panaka was outraged at the suggestion, claiming that the Hutts who ruled the planet were gangsters. When Jinn took the suggestion before the Queen, she sided with the Jedi, leaving Panaka in disbelief at her rashness."}, {"tag": "p", "text": "While Jinn, Jar Jar Binks, Amidala, and R2-D2 went scouting for parts for the hyperdrive, Panaka remained behind and guarded the ship—ostensibly guarding the Queen. During a sandstorm, the ship received a falsified transmission from Naboo from Governor Sio Bibble, pleading with the Queen to contact him. Kenobi ordered Panaka and the others not to respond, warning it was bait to establish a trace so that the Trade Federation could locate Amidala."}, {"tag": "p", "text": "One night, a band of Tusken Raiders invaded the ship and absconded with the Queen. Panaka asked Kenobi to rescue the Queen from the Tusken Raiders while he stayed on-board to guard the handmaidens. Kenobi successfully defeated the Tusken War Chief and returned with the Queen."}, {"tag": "p", "text": "Thanks to the efforts of one Anakin Skywalker, Jinn and Amidala had been able to obtain the parts needed to get the ship fully operational again. With the hyperdrive repaired, the group traveled to Coruscant, where they were met by Senator Palpatine. Panaka kept a close eye on Amidala, anticipating an ambush by the Trade Federation, and went with her to the Senate Rotunda as she and Palpatine put forth their case against the Trade Federation. The Queen's request fell on deaf ears, and she was left with a shaken faith in the Republic. The experience had hardened her resolve, and she decided to return to Naboo, over Panaka's objections, although he tried to explain to her that she would be captured and forced to sign the treaty."}, {"tag": "h3", "text": "Return to Naboo"}, {"tag": "p", "text": "The Queen had a plan. First, she made contact with Boss Rugor Nass and the Gungan Grand Army and swayed them to her side. Then she sent Panaka to make contact with the Naboo Security Force on the emergency channel. He met with them on the plains of Naboo atop Rasker Hill where they were ambushed by a Trade Federation patrol. Fortunately, the Gian speeders made short work of the Single Trooper Aerial Platform. Panaka made contact with Lieutenant Sykes, who had discovered a Trade Federation convoy. Panaka ordered the pilot to destroy the convoy. He brought back the leaders to plan strategy—the Gungans would draw the droid army out of the city and engage in battle. Meanwhile, the Jedi together with the Naboo would sneak into the palace in Theed and attempt to capture Viceroy Nute Gunray."}, {"tag": "p", "text": "Using the secret entrance, Panaka split his forces in two. One group was to distract what droids remained behind while the other, including the Jedi, would liberate the starfighters from the Theed Hangar, allowing pilots to disable the Lucrehulk-class Droid Control Ship Vuutun Palaa in orbit. Panaka directed Sykes as part of the diversionary forces to commence the diversion by firing on an Armored Assault Tank. As Panaka, Amidala and the Jedi set out to find the Viceroy, they were met by the Sith Lord Darth Maul, who had been tracking them since their stay on Tatooine. Panaka and Amidala's group were forced to go the long way around while the Jedi stalled the Sith."}, {"tag": "p", "text": "Panaka and Amidala faced heavy resistance as they battled through the streets of Theed to reach the Royal Palace, but they were able to breach the security zone and enter the palace. Once inside the palace, Panaka assisted Amidala in finding the passkeys to unlock blocked portions of the palace. Progress was frustratingly slow battling through the halls of the Palace, but Panaka came up with an idea. Half the group split off from the main force, clambered out onto a window sill, and used their ascension guns to bypass a level of the Palace. The group made their way through the palace while Sabé led the other half through the main Palace defense force. Unfortunately, Amidala's group were swiftly captured by droidekas and escorted to the Viceroy."}, {"tag": "p", "text": "Sabé's group made it to the Throne room and drew out the droids inside while Amidala grabbed a couple of blasters from a secret compartment in the throne, tossed one to Panaka and they eliminated the droids in the room. Defenseless and humiliated, the Viceroy was forced to sign a treaty of surrender."}, {"tag": "p", "text": "After the battle, Nute Gunray and Rune Haako were handed over by Panaka to the Republic for trial who dryly observed that their time as a successful trade franchise was over. Panaka then attended the funeral of Jinn, who was killed in the fight with the Sith, before participating in the celebrations following the liberation of Naboo."}, {"tag": "h3", "text": "After the Battle of Naboo"}, {"tag": "p", "text": "When Amidala's term as queen of Naboo ended, Panaka remained on Naboo to protect the new Queen, Jamillia. Amidala eventually became the Senator for the Chommell sector. Although Jamillia was his primary concern, he still looked after Amidala. During the Separatist Crisis, when Count Dooku and his backers seceded from the Republic and formed the Confederacy of Independent Systems, a group of spice miners rallied outside the Palace while Amidala was there. After ensuring that Jamillia was safe, Panaka checked on his former charge. His reason for meeting with her was twofold: He also wanted to make sure she would be safe to return to Coruscant, to vote against the Military Creation Act. In a matter of weeks, a security plan was formulated, and Panaka assigned his nephew, Captain Gregar Typho, to protect Amidala. Before she departed for the capital, Panaka informed her that Viceroy Gunray, having escaped punishment, had fallen in with Dooku's Confederacy. Although Typho felt that Amidala, being against the Military Creation Act, would be considered an informal ally of the Confederacy, Panaka was concerned, and cautioned the Senator, as the Confederates had been known to utilize violence against their enemies."}, {"tag": "p", "text": "Some time later, after the Clone Wars had broken out, he learned of the marriage between Padmé Amidala and the now-Jedi Anakin Skywalker. Panaka informed Palpatine, who used this information to his advantage when turning Anakin to the dark side. The ramifications of Panaka's choice would eventually lead to the Imperialization of the galaxy, a change that would work to his advantage. As Palpatine installed himself as Galactic Emperor, Panaka remained extremely loyal to him."}, {"tag": "h3", "text": "Fighting the Skaak Tippers"}, {"tag": "p", "text": "In the early days of the Galactic Civil War, Panaka, now a Colonel, was working with the Royal Security Forces in the city of Kaadara to stop the criminal organization known as the Skaak Tippers from terrorizing the peaceful inhabitants of Naboo. One of Panaka's agents, Sergeant Willoc, went missing while investigating a Skaak Tipper plot to steal bank terminals from Kaadara, hack into them, and gain access to the bank accounts of everyone in the city. Having not heard from Willoc in over a week, Panaka was surprised to receive an unidentified transmission from Willoc's comlink. A spacer investigating an old war bunker on Naboo discovered the comlink and used it. Panaka urged the spacer to report to him immediately, and seizing the opportunity, enlisted the individual to disrupt the Skaak Tippers' activities in the surrounding area. The spacer obliged, and helped Panaka by wiping out a number of Skaak Tippers, finding one of their radios, and gaining intelligence on a Skaak Tipper plan to smuggle weapons."}, {"tag": "p", "text": "Panaka surmised that this was related to the Skaak Tippers' bank heist plot. To discourage the Skaak Tippers from carrying out their crimes, Panaka devised a plan with his newly recruited operative to raid their nearby Island Hideout, kill at least sixteen of their members, and assassinate their leader, Jonni Skaak, who was actually a former Royal Security Forces agent named Jonthol Mazoon. The assault was a success, and had the effect of crippling the Skaak Tippers' operations. In appreciation for their bravery, Panaka formally inducted his operative as a private in the Royal Security Forces, and rewarded the agent with a special Royal Security Forces jacket and a considerable amount of credits."}, {"tag": "h3", "text": "Later service in the Empire"}, {"tag": "p", "text": "Panaka was eventually promoted to Commander, and tasked with leading an expedition to the uncharted planet of PL-40112-CE-021105 of the Salfrem system in the Wastes region of Wild Space. It was during this expedition that he met with Bertroff Hissa, a Human-Sephi hybrid, and also went into a forced alliance with the near humans of the planet to drive off an invasion of interdimensional Rozzums. Panaka, alongside Hissa, were the only survivors of the conflict. After returning, Panaka managed to recruit Hissa into the Imperial Military, despite its Human supremacist nature at the time. Panaka even fought for Hissa against his prejudiced peers, up until he himself was promoted to Moff of the Chommell sector."}, {"tag": "p", "text": "As reward for remaining close to Palpatine during the tumultuous years of the early Rebellion, Panaka was promoted after the Dissolution of the Imperial Senate in 0 BBY. As Moff, he represented the Chommell sector, replacing Senator Pooja Naberrie in the process. To show his continued admiration of Palpatine, Panaka gave him an ornate statue. The statue was placed in the Emperor's receiving chamber aboard the second Death Star. It was destroyed in the station's subsequent destruction at the Battle of Endor."}, {"tag": "p", "text": "Following the death of the Emperor during the Endor debacle, the Galactic Empire shattered, while the Rebellion reorganized itself into a burgeoning New Republic. In 5 ABY, Moff Panaka traveled to Hosk Station and met Princess Leia Organa of Alderaan, a preeminent figure of the New Republic. Organa, who wished to avoid conflict between her troops and those of the Chommell sector, had arranged that meeting on a neutral site. She attempted to convince the Moff by evoking the memory of the late Amidala, whom he had once served. Panaka did not see any legitimacy in Organa's resurrected Republic, and was not moved by his remembrances of the dead queen. He pointed out that the late Amidala had attracted danger on Naboo and done very little to restore the planet's defenses in the wake of the Trade Federation's invasion. The meeting turned short when Organa told him some members of the Republic were thinking of seizing Naboo, although that threat left Panaka unimpressed."}, {"tag": "p", "text": "By 13 ABY, Panaka's fortunes had reversed. The Empire had been defeated and replaced by a New Republic. In the new political order, Panaka was replaced with the Gungan senator Boma in the New Republic Senate."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Quarsh Panaka was a very pessimistic man and prepared for the worst. During the Naboo crisis, he was clearly annoyed at the fact that Naboo did not have its own planetary army. He often expressed his opinions on this matter, and regularly disagreed with Amidala's Jedi protectors."}, {"tag": "p", "text": "Captain Panaka was often humorless and grim, constantly striving to do the best he could at his job. Panaka was usually on the alert, and was often called \"the quickest eyes on Naboo.\" He possessed keen senses, and was quite intelligent. His fellow officers found him distant, demanding, and professional. Panaka took orders, but would voice his opinion when given an order he felt was questionable. One of Panaka's most excited moods occurred when he was successful in protecting his monarch and defeating the Trade Federation."}, {"tag": "p", "text": "Panaka was raised harboring feelings of bigotry towards the Gungans of his homeworld, a view that was common among the Naboo prior to their alliance with the Gungans in the Naboo crisis. This was reinforced by the fact that the Gungans he encountered during his early career were criminals and exiles. Despite this, during the reign of the Galactic Empire, he was willing to allow aliens to serve in the Imperial Military as long as they were extremely capable, as evidenced by his allowing the human-Sephi hybrid Bertroff Hissa to serve in the Imperial Military."}, {"tag": "p", "text": "Panaka was bilingual, and could speak Huttese in addition to Galactic Basic Standard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 1999's The Phantom Menace, Panaka was played by Hugh Quarshie. He was voiced by Jeff Coopwood in the games Star Wars: Episode I The Phantom Menace video game, Star Wars: Episode I: Battle for Naboo and Star Wars: Galactic Battlegrounds. The plot of the video game adaptation of The Phantom Menace diverges from that of the film, when, shortly after landing on Coruscant, the Queen is assaulted by an assortment of mercenaries. The player, as Panaka, fends off the attackers, but the Queen, now isolated from the rest of her entourage, is kidnapped by more mercenaries, in the employ of a Sun Guard. Panaka subsequently ventures through Coruscant and saves the kidnapped Queen, killing the Sun Guard in the process. Panaka then leads the Queen to the Galactic Senate to meet with Palpatine."}, {"tag": "p", "text": "In the 2001 video game Star Wars: Obi-Wan, the player, taking the role of the titular Jedi, meets Panaka inside the Theed Royal Palace during an altered scene from the movie. Panaka was fighting the Trade Federation occupation with other soldiers while the Queen was being taken to Camp Four by a battle-droid escort. In the movie, Panaka was captured along with the Queen. This article assumes his presence during the mission is non-canon."}, {"tag": "p", "text": "The character of Panaka was originally intended to appear in Attack of the Clones, but Quarshie decided not to return, feeling that he wasn't being offered enough money. So, in Panaka's absence, the character of his nephew Gregar Typho was created."}, {"tag": "p", "text": "Panaka was included as a non-player character in the 2003 massively multiplayer online role-playing game Star Wars Galaxies: An Empire Divided, developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The character was added to the game as part of the Legacy Quest, an expansive series of quests that was released as part of Publish 25's New Game Enhancements on November 15, 2005. In the game, players could assist Colonel Panaka by participating in a number of quests to disrupt the Skaak Tippers. By completing his final quest, titled Tipping the Balance, Panaka would award the player with a Royal Security Forces jacket and 5901 credits. Panaka would then reassign the player to Captain Typho. This eventually presented a continuity error, as Gregor Typho was shown to be killed well before the events of Star Wars Galaxies in Coruscant Nights II: Street of Shadows, a novel released on August 26, 2008."}, {"tag": "p", "text": "Panaka was originally slated to appear in Star Wars: The Clone Wars episode \"Destroy Malevolence.\" He was going to be captured alongside Padmé and be brutally murdered by Grievous. He was eventually cut, because at the early stages of production the studio didn't have the ability to include many new characters because of the time it took to create a digital model."}, {"tag": "p", "text": "\"Panaca\" is the name given to the ancient Incan royal families."}, {"tag": "p", "text": "In Brazil Panaka's name was changed to \"Panassi\" due to the fact that his name is similar to \"panaca\" which means \"douchebag.\""}, {"tag": "p", "text": "Panaka is featured in both LEGO Star Wars: The Video Game and LEGO Star Wars: The Complete Saga as a playable character."}, {"tag": "p", "text": "Panaka's first name, Quarsh, was revealed in the article Star Wars: The Essential Guide to Warfare Author's Cut, Part 6 — Showdown at Naboo on the Official Star Wars Blog. The name is an obvious reference to Hugh Quarshie, the actor who plays him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}