{"url": "Quay_Tolsite", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Males", "Category:Pyke Syndicate members", "Category:Pykes"], "nodes": [{"tag": "h1", "text": "Quay Tolsite"}, {"tag": "p", "text": "Quay Tolsite was a male Pyke capo who administered the Pyke Syndicate's operations on Kessel. He was a ruthless individual who enslaved several sentient beings, including Wookiees, to work as miners at the spice mines of Kessel in order to acquire spice for the Pykes. In 10 BBY, Tolsite participated during the raid on Kessel, where he was killed by Qi'ra."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Pyke Syndicate capo, Quay Tolsite was a male Pyke from the planet Oba Diah. He served as the administrator of the Pykes' operations at Kessel, supervising along with the droids operating the command center of the spice mines, where he employed a large number of slaves to extract the spice, some of these slaves including the con artist Tak and the Wookiee Sagwa. As such, due his labor as director from the Syndicate, Tolsite had to oversee the enslaved miners and exploited Kessel's resources for profit."}, {"tag": "p", "text": "Ten years before the Battle of Yavin, as part of the raid on Kessel organized by Crimson Dawn leader Dryden Vos, Tobias Beckett and his gang, along with the smuggler Lando Calrissian and his droid L3-37, came to the spice mines in order to steal the unrefined coaxium stored there. While Qi'ra distracted Tolsite at his office, Han Solo stole the coaxium, and L3-37 started a prison riot. It did not take Tolsite long to conclude that they were being attacked, but it was too late. Qi'ra attacked the Pyke and killed him by using Teräs Käsi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Quay Tolsite was a male Pyke who served as capo of the Pyke Syndicate at Kessel. He was a corrupt and greedy individual and often prioritized profit rather than the lives of his miners."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Quay Tolsite protected himself in concealing robes and armor with a helmet to protect himself from Kessel's atmosphere, to which he was allergic. To breathe on Kessel, Tolsite had breathing tubes filled with mucus. Tolsite carried with him a set of keys to access certain systems in the mining facility."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Quay Tolsite was portrayed by Dee Tails in the 2018 Star Wars Anthology film Solo: A Star Wars Story. Tails stated that he loved every minute he played the character, feeling that it was a great part to play."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}