{"url": "Quarren/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Aquatic sentient species", "Category:Cephalopoids", "Category:Quarren", "Category:Sentient species of Mon Cala"], "nodes": [{"tag": "h1", "text": "Quarren"}, {"tag": "p", "text": "The Quarren, were one of several aquatic sentient species from the planet Dac, called Mon Calamari by off-worlders. The Quarren shared their homeworld with the Mon Calamari, another sentient species hailing from Dac. The Quarren had many conflicts and a tense relationship with the Mon Calamari. However, in order to make their planet prosperous, they were forced to provide resources from the ocean depths so that the Mon Calamari could build starships for off-worlders."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Quarren were amphibious humanoids with squid-like heads, at least four tentacles on their faces, and leathery skin. Quarren tentacles were prehensile, and they were able to manipulate food with them. Quarren had small mouths, with two fang-like teeth jutting from their faces on either side, and a long, thin tongue sticking out in between. Quarren had two long protrusions that extended from either side of their faces. In these protrusions were several gill-like structures that were actually aural structures, used for hearing instead of ears. Quarren also had holes on either sides of their neck that were most likely used for breathing. Quarren had two sac-like organs that hung from the back of their heads as well."}, {"tag": "p", "text": "The species was also able to change the color of their skin during mating rituals. Most Quarren had orange skin, although some Quarren had gray-green skin; this trait, however, was extremely rare. Pink or purple-skinned Quarren existed, though presumably in small numbers. All Quarren also had two shimmering blue eyes. Being aquatic in nature, Quarren had to keep their skin moist in order to stay alive, although clawed Quarren seemed to need less moisture than other Quarren. The average Quarren lifespan was 79 standard years."}, {"tag": "p", "text": "There were three different types of Quarren, although the only difference lay in their hands. Some Quarren had suction-tipped fingers, either with three or five fingers. Other Quarren had thick fingers that lacked suction cups on the tips of their fingers, yet had sharp claws instead. Whether these three groups were actually distinct subspecies is unknown."}, {"tag": "p", "text": "Having evolved in the depths of Mon Calamari, Quarren could descend to depths of 300 meters without any breathing or pressure apparatus. However, upon ascending from depths of 50 meters or below, a time, equal to the amount that they had spent below 50 meters, would have to be spared, so to as allow their bodies to decompress and thus adjust to the lower surface/water pressure."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Quarren were a very self-centered and proud species, almost to the point of being xenophobic, which would coincide with their isolationist behavior. Quarren found Humans to be very crude beings and thought their language (Galactic Basic) to be very cumbersome, and unsuitable for speech. The Quarren instead spoke their native language more frequently, in contrast to the Mon Calamari who spoke Basic far more often, in order to deal with off-worlders, which the Quarren seldom did."}, {"tag": "p", "text": "In sharp contrast to the Mon Calamari, the Quarren were far more conservative and practical in their thinking. While the Mon Calamari looked towards the future, the Quarren remembered yesterdays. Also, while the Mon Calamari often traveled throughout the galaxy, the Quarren were far more isolationist, staying, for the most part, in the depths of the oceans of their homeworld. However, some Quarren followed suit after the Mon Calamari, and made their living in the galaxy as business managers and accountants."}, {"tag": "p", "text": "While the Mon Calamari manufactured starships in orbital shipyards, the Quarren diligently mined metal ore for their brethren from the deepest parts of the ocean. The Quarren also helped build massive floating cities for the Mon Calamari. While most Mon Calamari lived on the few scattered islands on Dac, or on the upper levels of their floating cities, the Quarren lived in their own cities, deep beneath the waves, or in the lower levels of the cities, for the cities stretched far below the surface, and the Quarren loved the dark far more than did the Mon Calamari."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early History"}, {"tag": "p", "text": "The Quarren species evolved in the high pressure depths of Dac's oceans. Here, they mined the mineral-rich sea floor. They shared the depths of the planet's ocean with the Whaladons, the Moappa, and the Knowledge Bank."}, {"tag": "p", "text": "In ancient times, the Kokad was a warrior caste encharged with the protection of fellow Quarren from threatening sea creatures."}, {"tag": "h3", "text": "Meeting the Mon Calamari"}, {"tag": "p", "text": "Circa 4500 BBY, the Quarren met the Mon Calamari, who lived in the shallow parts of the ocean, for the first time. Rather than meeting in friendship, the Quarren were suspicious of the Mon Calamari and attacked them. This instigated a long war between the Quarren and the Mon Calamari. The Mon Calamari, though less aggressive by nature, had a superior level of technology, and won the war. The Mon Calamari however did not wish to risk further wars, which they thought would only lead to the extinction of the Quarren."}, {"tag": "p", "text": "While the Quarren recovered from the previous war, the Mon Calamari prepared for a daring cultural experiment. In order to prevent future wars, the Mon Calamari took hundreds of young Quarren captive, and taught them the ways of Mon Calamari civilization, teaching them the arts, sciences, and ethics. Once they had fully educated the Quarren, the Mon Calamari released them back to their homes. The elder generations of the Quarren distrusted the younger Quarren, and viewed them as brain-washed usurpers. The Quarren youth, on the other hand, viewed their elders as uneducated barbarians. However, the youth eventually grew up and assumed control of Quarren society, and peace between the Quarren and the Mon Calamari continued for centuries (though it was sometimes a tense relationship as followup generations of Quarren slowly began to sink back into their traditional values)."}, {"tag": "h3", "text": "Integration into the Old Republic"}, {"tag": "p", "text": "Soon, many Quarren headed off-planet and became business managers and accountants. During these years, Quarren went as far as Taris, Telos IV, and Nar Shaddaa. Several Quarren joined the Exchange, managing the criminal syndicate with efficiency."}, {"tag": "p", "text": "During the New Sith Wars, Quarren fought in both the Army of Light and the Brotherhood of Darkness."}, {"tag": "p", "text": "Around five hundred years before the Battle of Naboo, a number of needy Mon Calamari and Quarren locals were approached by recruiters sent by Hugo Bartyn. Bartyn wanted amphibian fishermen to settle a new city in Lamaredd and tempted these poverty-stricken individuals with promises of untouched seas in a new frontier. Once they arrived, however, they became slave laborers. Besides, all the aliens were forced to live in crowded conditions and, as Mon Calamari and Quarrens could never stand each other, this eventually caused inter-species violence – and the eventual creation of a Quarren colony, The Shoals, and at least one Quarren swoop gang."}, {"tag": "p", "text": "Later, Mon Calamari joined the Galactic Republic and eventually gained representation in the Senate. During at least the last decades of the Old Republic, the government of Mon Calamari, and its representation in the Galactic Senate, was shared between the Mon Calamari and the Quarren."}, {"tag": "h3", "text": "During the Clone Wars"}, {"tag": "p", "text": "Just before the Clone Wars, the corrupt Quarren Senator Tikkes allowed Thalassian slavers to operate in Calamari sector. Eventually this decision was uncovered, and Tikkes was put under house-arrest. Under immense pressure, Tikkes took the easy road out, and defected to the Confederacy of Independent Systems, taking his sector with him. Many citizens on Dac, however, opposed this decision, and moved against Tikkes and his allies. Tikkes formed the Quarren Isolation League and using reinforcements from the CIS, Tikkes moved against the Mon Calamari Council, the ruling legislative body of Dac. The Republic, however, supported the Mon Calamari, and the few loyal Quarren."}, {"tag": "p", "text": "A civil war on Mon Calamari ensued, with the Republic loyalist Mon Calamari Knights joining Republic forces against the Quarren Isolation League and Separatist Mon Calamari (led by Merai). After a long series of skirmishes, the Republic defeated the Quarren Isolation League during the Battle of Mon Calamari. New accords between the Quarren and Mon Calamari were signed, with pro-Republic Senators Tundra Dowmeia (a Quarren) and Meena Tills (a Mon Cal) jointly representing Dac in the Senate. Meanwhile, remnants of the Quarren Isolation League formed the Free Dac Volunteers Engineering Corps, an organization of predominantly Quarren exiles on Separatist worlds (primarily Minntooine and Pammant), who continued to support the Confederacy of Independent Systems by manufacturing the majority of its warships. As a result of this, Quarren were among the species deported from Coruscant by Tannon Praji, under pressure from the Human-supremacist Commission for the Protection of the Republic."}, {"tag": "p", "text": "A second battle for control of the planet Mon Calamari occurred around 21 BBY when the Quarren, backed by the Confederacy of Independent Systems, attempted to seize the Calamari system from the Mon Calamari people and the Galactic Republic. The Jedi Order intervened in the conflict, bringing reinforcements from the Grand Army of the Republic and the Gungan Grand Army. However, Separatist commander Riff Tamson, a Karkarodon, proved to be a more formidable opponent than imagined and his tactics resulted in the capture of all Republic forces except Ahsoka Tano and Prince Lee-Char, heir to the Mon Calamari throne. Quarren leader, Nossor Ri, realized that Tamson and Count Dooku were plotting to take Dac for themselves, and not the Quarren people, so they re-allied with the Republic and routed the Separatists."}, {"tag": "h3", "text": "Under the Empire"}, {"tag": "p", "text": "With the dawn of the Galactic Empire, Imperial forces invaded Mon Calamari. This was fueled by the Humanocentric Imperials seeing the people of Dac—the Mon Calamari in particular—as slaves whose industries and resources could be used to power the Imperial war machine. Also, prior to the formation of the Empire, both of Dac's senators signed the Petition of 2000, an anti-Palpatine document (Chancellor Palpatine was now Emperor of the Empire). Some sources indicated that Quarren agents, motivated by their hatred and long-standing prejudice towards the Mon Calamari, sabotaged the planetary shields shortly before the Imperial attack, facilitating a swift Imperial victory. Seggor Tels, a Quarren leader, later admitted to being one of these saboteurs."}, {"tag": "p", "text": "Despite the compliance of some with the Empire, both the Quarren and the Mon Calamari were enslaved by the Empire. The Quarren may have been enslaved due to their involvement with the Confederacy. The Mon Calamari, however, tried to lead a passive resistance movement, but they were unsuccessful. Emperor Palpatine ordered three Mon Cal cities to be destroyed in reprisal. Eventually, however, many Quarren joined the Mon Calamari in driving the Imperials off Dac. Seggor Tels, ironically, was one of the Quarren leaders responsible for rallying the Quarren to resist the Empire. After the liberation of Mon Calamari, many Quarren wanted nothing to do with the Rebel Alliance, or later, its successor government the New Republic. As a result, many Quarren left Mon Calamari for other worlds, in order to avoid the Imperial reprisal that was to come."}, {"tag": "h3", "text": "Emperor reborn"}, {"tag": "p", "text": "After the reborn Palpatine's assault on Mon Calamari in 10 ABY, the Quarren threatened to leave in a mass exodus, though it is unknown how many actually did. Eventually, many Quarren could be found scattered among the many worlds of the galaxy. The Quarren population that continued to thrive on Mon Calamari were still loyal to their people, but personal and cultural relationships began to blossom between the Quarren and the Mon Calamari. The most famous such relationship was the romantic relationship between the male Quarren Nrin Vakil and the Mon Calamari female Ibtisam, both of whom were members of the elite Rogue Squadron."}, {"tag": "h3", "text": "Yuuzhan Vong invasion"}, {"tag": "p", "text": "During the Yuuzhan Vong War, a Quarren, Pwoe, represented Mon Calamari alongside the Mon Calamari Gron Marrab. After the loss of Coruscant to the Yuuzhan Vong, Pwoe tried, and failed, to usurp the New Republic Presidency and eventually joined the Ylesian Republic on Ylesia. His Mon Cal counterpart, however, remained loyal and represented his homeworld in the Senate of the Galactic Alliance."}, {"tag": "h3", "text": "The New Sith Empire"}, {"tag": "p", "text": "By 130 ABY, following the end of the Sith–Imperial War and the rise of Darth Krayt as Galactic Emperor, Quarren gained a position of power as they were placed in the government of Dac, possibly because the new Sith Order held several Quarren amongst its members. Two of these Sith Lords were Darth Maleval and Darth Azard."}, {"tag": "p", "text": "Following the Battle of Mon Calamari, the Quarren were spared from Emperor Krayt's edict ordering the execution of ten percent of Mon Calamari, starting with the members of the Mon Calamari Council including Quarren. However, the Quarren who voiced their opposition to the orders were executed as well."}, {"tag": "p", "text": "When the genocide reached a stonewall with the destruction of Vul Isen's Sea Leviathan, Krayt's successor Darth Wyyrlok ordered Isen and Darth Azard to execute the Final Protocol, which would poison the oceans of Dac and render the planet uninhabitable in seven days. When Azard asked about the wellbeing of the Quarren, who had collaborated with the Sith Empire, Wyyrlok merely told him that the Quarren would be allowed to leave the planet, but without any kind of Imperial aid. After the Final Protocol became known to the galaxy, Regent Morlish Veed was confronted by a number of Quarren ministers. As the public face of the Imperial throne, Veed had to answer for the actions of the Sith, just as Lord Wyyrlok had intended."}, {"tag": "p", "text": "During the evacuation of the planet organized by Admiral Gar Stazi of the Galactic Alliance Remnant, a Quarren delegation demanded that their species receive greater priority than the Whaladons and Moappa in the evacuation efforts. While non-bipedals, the Whaladons and Moappa were another sapient species native to Dac. Since the Quarren had been collaborators with the Empire, Admiral Stazi ordered that they would only be given every tenth ship in the evacuation fleet and that those who tried to board other ships would be shot."}, {"tag": "h3", "text": "Galactic Triumvirate"}, {"tag": "p", "text": "Following the defeat of the One Sith, the Sith were driven underground again and a Galactic Federation Triumvirate, consisting of the Fel Empire, the Jedi Order, and the Galactic Alliance, assumed power in Coruscant. In 138 ABY, a large number of Quarren and Mon Calamari were lured back to Dac under the pretext that the planet was being \"renewed\". Instead, these unfortunate Quarren and Mon Calamari were enslaved by a pirate syndicate led by the rogue Sith Darth Luft, who forced them to build a fleet of ships. Darth Luft and his pirates also kept their children and elderly relatives hostage. The Quarren and Mon Calamari ship builders were also beaten and mistreated by their pirate captors."}, {"tag": "p", "text": "One Quarren named Tikin befriend a Mon Calamari environmental engineer named Luen. These two encountered the Imperial Knight Jao Assam and the junk dealer Ania Solo, who learnt about their predicament and quickly transmitted word of the pirates and their slaving operation to the Triumvirate authorities in Coruscant. Later, Tikin was murdered by Darth Luft and his death triggered a slave uprising by the Quarren and Mon Calamari, who joined forces to rebel against the pirates. This uprising coincided with an attack by the Galactic Triumvirate led by Admiral Stazi and the Imperial Knight Yalta Val, who liberated the slaves and apprehended the pirates. Darth Luft himself was killed during a duel by Jao Assam. The Quarren and Mon Calamari then settled in the space station, which had been flooded with water by Admiral Stazi, to provide a comfortable atmosphere for the former slaves. As a gesture of reconciliation between the Quarren and Mon Calamari, Tikin's son Tilin was raised by Aunt Luen."}, {"tag": "h2", "text": "Quarren in the galaxy"}, {"tag": "p", "text": "Quarren in Lamaredd achieved certain renown as the co-engineers, along with the Gungan, of the popular gondola skimmersub. Other Quarrens who succeeded in that planet were shipping manager Kurline, maximum responsible of the Sailor's Union Landing Union chapter in Little Mon Cal; Trusty Trikker, former outlaw turned weapon dealer in Bartyn's Landing; and The Red Quarren, a pirate."}, {"tag": "p", "text": "Some Quarren became Jedi; both Qid Proko and Sarn Vals became Jedi Knights and managed to escape the destruction of the Order."}, {"tag": "p", "text": "Some Quarren followed Jabba Desilijic Tiure, serving in his criminal empire as guards and thugs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Ambiguously-canon appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}