{"url": "Quasar_Fire-class_bulk_cruiser", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic starship classes", "Category:Carrier classes", "Category:Cruiser classes", "Category:New Republic starship classes", "Category:Quasar Fire-class bulk cruisers"], "nodes": [{"tag": "h1", "text": "Quasar Fire-class bulk cruiser"}, {"tag": "p", "text": "The Quasar Fire-class bulk cruiser, also referred to as the Alliance escort carrier or the Quasar Fire-class cruiser-carrier, was a modular starship typically used for freight."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Designed by the Sullustan megacorporation SoroSuub, the Quasar Fire-class bulk cruiser resembled a triangle, with the bridge at the frontal point and the cargo bay at the base. The cargo bay could be modified to house various freight modules or, in some cases, passenger modules."}, {"tag": "p", "text": "They were armed with two forward light turbolaser batteries."}, {"tag": "p", "text": "Thin armor and shielding ran the 350-meter length of the Quasar Fire class, and while the stock model featured no weapons, freight companies and smugglers often added laser or turbolaser cannons. A typical crew for this ship ran around 250 personnel. However, most of those were dedicated to the cargo hold/hangar bay."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Once cargo freighters, several stripped-down ships were given by the Sullustans to the Virgillian Free Alignment Forces to aid them in the Virgillian Civil War. In turn, the Virgillians converted the cargo hold into a hangar, as well as installing stolen Imperial-grade shields and weapons. At the conclusion of the Virgillian Civil War, and once the Imperial presence was removed from the system, the Virgillian Alignment donated their fleet of carriers to the Rebel Alliance through one of their agents via an auction some time before the Battle of Endor. The Rebels then stripped them down to the keel at a secret shipyard and modified them to be dedicated carriers in a matter of months. A small number of Quasar Fire-class ships, such as Flurry and Battle Dog, made their way to the Rebel Alliance via the Virgillian Free Alignment, where their large cargo bays were modified to act as starfighter bays. By the time of the Battle of Yavin, they had lost two of the original ships, although many still remained active."}, {"tag": "p", "text": "Due to their efficiency and fragility, they were accompanied by their own battlegroup. They were scattered across the galaxy, and only brought together when the Alliance needed a large concentration of starfighters."}, {"tag": "p", "text": "A Quasar Fire-class cruiser named the Thurse served at a battle near the Bilbringi system in 25 ABY. The ship was commanded by Mak Jorlen."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In The Truce at Bakura, the starship Flurry was of this class, but was not specifically identified as such until the release of The Truce at Bakura Sourcebook."}, {"tag": "p", "text": "In the video game Star Wars: Rebellion, the Quasar Fire is referred to as the \"Alliance escort carrier,\" and is treated as the equivalent of the standard Ton-Falk-class escort carrier, which are only used by the Galactic Empire. Both vessels had identical gameplay value, being able to house six squadrons of starfighters, but were vulnerable from both capital-ship and fighter attacks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}