{"url": "Quarzite", "categories": ["Category:Canon articles", "Category:Planet stubs", "Category:Crystalline planets", "Category:Inner Rim planets", "Category:Type I atmosphere planets", "Category:Type IV atmosphere planets"], "nodes": [{"tag": "h1", "text": "Quarzite"}, {"tag": "p", "text": "Quarzite was a small planet located in the Inner Rim whose high atmospheric pressure rendered its surface uninhabitable. However, the planet's crystalline caverns were capable of supporting life, and were home to the warring Belugans and Kage. During the Clone Wars, it was ruled by the Belugan dictator Lord Otua Blank. When the Belugans kidnapped the Kage girl Pluma Sodi so that Blank could marry her, Major Rigosso hired a group of bounty hunters to defend a subtram, the primary method of travel on the planet, that would deliver the girl to Lord Blank. The hunters traveled to Quarzite in the Hound's Tooth and took a massive turbolift, which, due to the overwhelming atmospheric pressure, was the only way to reach Quarzite's suface."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Situated in the Inner Rim, not far from the Colonies, the small planet Quarzite was located in the Quarzite system, at grid square M-13 on the Standard Galactic Grid. Flanked by the two super-hyperroutes, the Corellian Trade Spine to the west and the Hydian Way to the east, Quarzite was located along the Shipwrights' Trace hyperspace route. When viewed from space, Quarzite appeared a tranquil world covered in a greyish layer of clouds with violet flashes, but in reality, the planet's surface was unreachable as a result of its thick atmosphere, lightning and heavy rain, which was unable to sustain any form of society as the planet's high-pressure Type IV atmosphere was nearly impossible for most organisms to survive in."}, {"tag": "p", "text": "With a hollow crust, Quarzite was home to many underground caverns which featured fields of crystals and crystalline structures beneath the surface. The crystal emanated a violet light that was the key to evolution on the planet, together with the oxygen-rich Type I atmosphere found within the caves. The violet light glowed perpetually and the subterranean realm had its own underground water basins, lakes, fungal growths and lichens."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}