{"url": "Que-Mars_Redath-Gom/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Males", "Category:Post-Ruusan Jedi Knights", "Category:Weequays"], "nodes": [{"tag": "h1", "text": "Que-Mars Redath-Gom"}, {"tag": "p", "text": "Que-Mars Redath-Gom was a male Weequay Jedi Knight serving the Jedi Order during the waning years of the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Que-Mars Redath-Gom was discovered to be Force-sensitive at an early age and was sent to the Coruscant Jedi Temple for training in the ways of the Force. Growing up within the Temple's academy, Redath-Gom was independent from his species noted reliance on the Quay totem that traditionally decided the fate of his people. Ostracized by fellow Weequay because of this, Redath-Gom was seemingly unaffected as he graduated the academy and was selected by a Jedi Master for training as a Padawan. Navigating his way through his apprenticeship, Redath-Gom forged for himself a green-bladed lightsaber using crystals from Ilum before preparing to undergo the Trials of Knighthood. Passing the trials successfully, Redath-Gom was elevated to the rank of Jedi Knight by the Jedi High Council and ready to begin his service to the Republic independently.[source?]"}, {"tag": "p", "text": "When the Separatist Crisis between the Republic and the Confederacy of Independent Systems reached a powder-keg, Redath-Gom was stationed at the Coruscant Temple and responded to Master of the Order Mace Windu's summons to join a strike team to rescue Jedi Obi-Wan Kenobi, Anakin Skywalker, and Senator Padmé Amidala from execution on Geonosis. Journeying to the Outer Rim world with his colleagues, Redath-Gom helped storm the Petranaki arena and meet head on with the Separatist Droid Army. While Redath-Gom fought bravely, he was overwhelmed by the sheer number of battle droids and succumbed to blasterfire.[source?]"}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Because of Redath-Gom's independence from the Quay totem, his people held no esteem for him, despite his service to the Republic as a Jedi Knight. Even after word of his demise in battle reached his homeworld, the general Weequay populace did not celebrate his life as he was viewed as a non-believer and a heretic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}