{"url": "Quartermaster-class_supply_carrier", "categories": ["Category:Legends articles", "Category:Corellia StarDrive products", "Category:Freighter classes", "Category:Galactic Republic starship classes", "Category:Quartermaster-class supply carriers"], "nodes": [{"tag": "h1", "text": "Quartermaster-class supply carrier"}, {"tag": "p", "text": "The Quartermaster-class supply carrier was a freighter used by the Republic Navy and civilian users after the Great Sith War and during the Mandalorian Wars. It had a reinforced duranium hull which allowed it to withstand punishing damage without breaching and spilling its cargo into space."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Quartermaster-class was designed specifically to carry a variety of goods and raw materials to worlds in desperate need of reconstruction or relief following the devastation of the Great Sith War. Since military ships were ill-equipped to carry supplies and materials, the need arose for a specific supply carrier, and the Quartermaster-class was mostly cargo space outfitted to carry a variety of cargoes, including liquids and gases, which made it a popular supply vessel."}, {"tag": "p", "text": "By the time of Mandalorian Wars some ships have been retired and some served as supply vessels for the Republic Navy. It generally required escort of some type, often by traveling in a convoy including one or more Praetorian-class frigates."}, {"tag": "p", "text": "At least one ship of this class, the Little Bivoli, was operated by a fringer group which provided provisions to the Courageous battle group. It was stolen from its original operators by Slyssk and Marn Hierogryph but continued to serve in its intended role until it was destroyed in the Battle of Serroco."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Quartermaster-class was originally created for the Days of Fear arc of the Knights of the Old Republic comic series. Its class name was not established until the publication of the Knights of the Old Republic Campaign Guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}