{"url": "Queen%27s_Shadow", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Canon young-adult novels"], "nodes": [{"tag": "h1", "text": "Queen's Shadow"}, {"tag": "p", "text": "Queen's Shadow is a canon young-adult novel written by E. K. Johnston. It was published by Disney–Lucasfilm Press on March 5, 2019. Set four years after the events of Star Wars: Episode I The Phantom Menace, Queen's Shadow focuses on Padmé Amidala and her transition from queen to senator."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The end of her reign is just the beginning...."}, {"tag": "p", "text": "When Padmé Amidala steps down from her position as Queen of Naboo, she is ready to set aside her title and return to life out of the spotlight. But to her surprise, the new queen asks Padmé to continue serving their people—this time in the Galactic Senate. Padmé is unsure about the new role but cannot turn down the request, especially since, thanks to her dearest friend—and decoy—Sabé, she can be in two places at once. So while Padmé plunges into politics, Sabé sets off on a mission dear to Padmé's heart."}, {"tag": "p", "text": "On the glistening capital planet Coruscant, Padmé's new Senate colleagues regard her with curiosity—and with suspicion for her role in ousting the previous chancellor. Posing as a merchant on Tatooine, Sabé has fewer resources than she thought and fewer options than she needs."}, {"tag": "p", "text": "Together with Padmé's loyal handmaidens, Padmé and Sabé must navigate treacherous politics, adapt to constantly changing landscapes, and forge a new identity beyond the queen's shadow."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Transition of roles"}, {"tag": "p", "text": "On the day of the election to decide Padmé Amidala's successor as queen, the outgoing monarch and her handmaidens, along with their guards, are in seclusion at Varykino, as is traditional. Relations between Padmé and Captain Quarsh Panaka have been strained for some time due to disagreements over the ion pulse being installed for planetary defense, and she thinks his impending retirement from the Royal Naboo Security Forces is a good thing for him. A surprise visit from Supreme Chancellor Palpatine, come home to vote in the election, has the handmaidens scrambling to make Padmé presentable with the resources they have on hand. After Palpatine's departure, Rabé, skilled in lip-reading and trained to read body language, tells Padmé that he was concerned about something, but she couldn't tell what. Padmé discusses her desire to free the slaves on Tatooine, and Sabé vows to stand by her no matter what."}, {"tag": "p", "text": "When Sergeant Tonra arrives with the election results, it turns out that Saché's bid for a seat in the legislative assembly has been successful. The new queen is Réillata, a former monarch who had initially chosen to step down after one term, before declaring her intent to run again this year. Padmé privately would have preferred that candidate Jamillia win. The handmaidens discuss their plans for their future: Rabé is attending Theed's most prestigious music academy, Yané wants to care for children and orphans, and Eirtaé has managed to arrange to study in Otoh Gunga."}, {"tag": "p", "text": "The Day of Ascendancy comes, and Réillata is crowned Queen of Naboo for the second time. At the inaugural government meeting afterwards, the new Queen surprises Padmé by making an unexpected request of her: Senator Oshadam intends to step down from the Galactic Senate, and Réillata thinks that Padmé is the perfect replacement. Padmé needs time to think about the offer, and after discussing it with her handmaidens that evening, she decides to accept. Sabé offers to go to Tatooine, doing what Padmé had originally planned to do. Discussing things with newly-promoted Captain Mariek Panaka, she offers to guard Padmé along with her nephew, Sergeant Gregar Typho. Tonra, now a captain as well, will go to help Sabé. It is also decided that Padmé will need new handmaidens. Mariek suggests her niece Versaat, Rabé suggests a girl named Cordyn who could serve as a body double, and Typho suggests a former classmate of his named Dorra. Padmé's final task of the night is calling her parents, Ruwee and Jobal, who offer their blessing and advice for her new role."}, {"tag": "h3", "text": "Novice Senator"}, {"tag": "p", "text": "By the end of her mandatory six-week Senate orientation, Senator Amidala has had enough. Padmé, always a fast learner, is frustrated by the slow pace of things and the unwieldy traditions, taking it out on the Senate-issued protocol droid, NON-3. However, the orientation has given her the time to get to know her new handmaidens, now Cordé, Dormé and Versé. An attempt by NON-3 to take Padmé on a scheduled private tour of the Senate Building's lower levels sets off alarm bells with the Senator and her staff, who decide to take the opportunity to test Cordé's impersonation of Amidala. The droid takes Padmé and the disguised Cordé to an area of the building that, as Alderaanian Senator Bail Organa informs \"Amidala\" when he unexpectedly appears, is scheduled for demolition. After returning home, Padmé and her inner circle wonder who was behind the assassination attempt, and why Organa was even there."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The novel establishes that the Monarch of Naboo could only reign for two terms, with two years per term. However, the 2016 reference book Star Wars: Complete Locations previously stated that King Veruna of Naboo reigned for thirteen years."}, {"tag": "p", "text": "In one instance, Gregar Typho's first name is misspelled as \"Gregor.\" When Padmé talks to Sabé on Alderaan about what her life could have been like if she had not become a handmaiden, the musical instrument hallikset is misspelled as \"halliket.\""}, {"tag": "p", "text": "Queen's Shadow references a number of Clone Wars episodes, such as \"The Rise of Clovis,\" which first mentioned Padmé Amidala and Rush Clovis's proposal to save the planet Bromlarch."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}