{"url": "Queen_of_Empire", "categories": ["Category:Legends articles", "Category:Corellian Engineering Corporation products", "Category:Liners"], "nodes": [{"tag": "h1", "text": "Queen of Empire"}, {"tag": "p", "text": "The Queen of Empire was a luxury liner that belonged to Haj Shipping Lines."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "At 150 meters long, it could carry tens of thousands of passengers, but its carrying capacity was restricted to only 5,000 to ensure luxury accommodations for the affluent. Equipped especially for the upper echelons of society, the Queen of Empire had all the amenities available for beings of wealth, including lavish casinos, exercise rooms, day spas, shopping areas, and exotic restaurants. Passengers would travel between decks using transfer tubes. Its nightclubs featured many famous bands, including the Rughja orchestra-band called Umjing Baab and His Swinging Trio, which played in the Star Winds Lounge. The Queen of Empire also had a gaming parlor, where passengers could go to play games of chance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "An unfortunate stigma was associated with the Queen of Empire since it had been raided several times by pirates and even agents of the Yuuzhan Vong during its long history navigating the space lanes. Some referred to the vessel as being jinxed or cursed."}, {"tag": "p", "text": "At approximately 2 BBY, Commander Bria Tharen was using the luxury liner as transport from her Rebel cell on Corellia to Nal Hutta where she hoped to enlist aid from some of the Hutt lords in fighting the Empire. It was then that Boba Fett captured her and was ready to transport her back to Teroenza who had offered the bounty on her head. Fortunately for her and Lando Calrissian who had gotten mixed up in the mess when he asked Bria out for a dance, the pirate Drea Renthal had knocked the liner out of hyperspace between Corellia and its layover at Gyndine by dragging a massive asteroid through the Queen of Empire's path. When her pirates raided the vessel, they encountered Boba Fett and his two captives and convinced the bounty hunter to let them go by paying off the 100,000 credit bounty using money they had acquired from raiding the vessel."}, {"tag": "p", "text": "The liner was also stopped during the Yuuzhan Vong invasion of the galaxy. During this era, the Queen of Empire was serving to transport refugees from Ord Mantell to the Bilbringi system, moving helpless sentients away from the invasion corridor. The Queen's many luxuries were converted to refugee usage, closing down most of their restaurants and nightclubs for use as living space for the displaced masses. Agents of the Peace Brigade pulled the ship out of hyperspace just short of Bilbringi using a dovin basal in an attempt to capture a defecting priestess named Elan. Han Solo was also aboard, and Reck Desh forced him into a deactivated transfer tube drop shaft, but Solo was able to grab Droma's tail and survive."}, {"tag": "p", "text": "The Queen of Empire had a sister ship also produced by Haj Shipping Lines, named Star of Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}