{"url": "Quellor/Legends", "categories": ["Category:Legends articles", "Category:Colonies planets", "Category:Fortress worlds", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Quellor"}, {"tag": "p", "text": "Quellor was a planet in the Colonies region of the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Old Republic era"}, {"tag": "p", "text": "Quellor joined the Galactic Republic early in its history, sometime between 25,000 BBY and 22,000 BBY."}, {"tag": "p", "text": "During the Mandalorian Wars, the Quellor system was attacked by the Mandalorian Neo-Crusaders, as part of the Mandalorian Triumph campaign."}, {"tag": "p", "text": "The planet did not secede during the Clone Wars."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Galactic Civil War, Moff Toggan was the governor of Quellor."}, {"tag": "p", "text": "Sometime between 2 BBY and 0 BBY, Princess Leia Organa went on a mission to Quellor."}, {"tag": "p", "text": "In the aftermath of the Battle of Yavin, Quellor became the site of peaceful, anti-Imperial rallies. At one such rally in Terrina Square, Moff Toggan called up a legion of stormtroopers to watch over the crowd and maintain order. Though Moff Toggan specifically ordered his troops to hold their fire unless ordered otherwise, the stormtroopers opened fire on the protesters when they burned an effigy of Emperor Palpatine."}, {"tag": "p", "text": "By 4 ABY, Quellor had become an Imperial fortress world. It was still under Imperial control in 7 ABY."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "New Republic forces fleeing the Yuuzhan Vong invasion of Gyndine retreated to Quellor. The Yuuzhan Vong would later attack and capture the planet itself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}