{"url": "Queen_of_Ranroon/Legends", "categories": ["Category:Legends articles", "Category:Ghost ships", "Category:Treasury ships", "Category:Xim's empire starships"], "nodes": [{"tag": "h1", "text": "Queen of Ranroon"}, {"tag": "p", "text": "Queen of Ranroon was the treasure ship of the powerful pre-Republic warlord Xim the Despot. One of the largest vessels of its day, the Queen of Ranroon was reputed to hold the treasure of a thousand conquered worlds, and was one of the few Xim vessels that escaped his climactic defeat at the Third Battle of Vontor. The ship reached its final destination at Dellalt and offloaded its cargo, but for millennia was popularly believed to have disappeared. The legend of the Queen of Ranroon attracted great numbers of treasure hunters over the eons—in 1 BBY, a group led by Alexsandr Badure and Han Solo put the mystery to bed when they found the ship's bounty in Xim's Dellalt treasure vaults."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Queen of Ranroon was constructed in the pre-Republic era, built by the legendary galactic conqueror Xim to carry spoils from his conquests. Considered the largest ship constructed in its time, the Queen of Ranroon held copious amounts of tribute and treasure, and was reputed to hold the plunder from a thousand worlds. The treasure ship also carried 1,000 war droids of Xim's famed Guardian Corps, the droids that were the engine of his war machine and served as guards aboard the ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The son and heir of the formidable pirate chieftain and Cronese King Xer VIII, Xim the Despot arose to be one of the most famed conquerors of the pre-Republic era, expanding on his father's holdings to carve out a significant empire in the Tion Hegemony. The Queen of Ranroon—named for Xer's eighth wife, Hylei Indrexu Cortess of Ranroon— eventually became one of the most well-known ships in Xim's fleet, reputed to hold treasures from a thousand looted worlds. Its holdings were such that Xim constructed a deep and extensive system of treasure vaults on the Tionese world of Dellalt to house the ship's wealth."}, {"tag": "p", "text": "Towards the end of Xim's long-running conflicts with the Hutts, the Tionese despot contested the Hutts' claims to the Si'Klaata Cluster, a coveted region near Hutt Space. Xim's great nemesis, Kossak the Hutt, rallied his fleet near Vontor, an uninhabited planet Xim knew well—he had clashed with the Hutts there twice before. However, Xim arrived at Vontor to find that Kossak had bolstered his forces with over a million Vodrans, Klatooinians and Nikto, recruited from within the Si'Klaata Cluster. Xim's fleet was utterly destroyed, and the Queen of Ranroon was one of the few ships to escape."}, {"tag": "p", "text": "The 1,000 war droids serving as guards aboard the Queen of Ranroon were the only to survive from Xim's famed forces, and the ship itself managed to reach its final destination at Dellalt, with its treasure vaults. There, the ship's cargo was offloaded and maintained for millennia by Xim's honor guard, which eventually devolved into an inbred cult called the Survivors. The ship itself passed into legend, with popular stories saying that it had disappeared, never to be seen again. About 10,000 years after the Third Battle of Vontor, the Queen of Ranroon appeared as a a setting in Peshosloc's holoplay Xim at Vontor, and referred to in literary and dramatic works for millennia afterward."}, {"tag": "p", "text": "By the Galactic Civil War, the Queen of Ranroon was regarded as little more than a children's tale, but that did not deter centuries' worth of treasure seekers from attempting to track down the legendary ship. However, while the ship itself was long gone, the treasure was still hidden in Dellalt's treasure vaults, under the nose of the galaxy. Its location continued to be a mystery until a contract laborer on Dellalt named Lanni Troujow stumbled upon the Queen of Ranroon's log-recorder in 1 BBY, providing a valuable clue for her sister Hasti and father figure Alexsandr Badure to launch a renewed treasure hunt centered on Dellalt. With the aid of smugglers Han Solo and Chewbacca, along with Ruurian scholar S. V. Skynx, the Queen of Ranroon's long-lost treasure was finally uncovered from its hiding place. Although light on the gold and gems that had been popularly rumored, the Queen of Ranroon's haul—which was mostly war materiel—became an incredibly valuable archaeological find that was studied for years to come."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "One of the crown jewels of Xim's fleet, the Queen of Ranroon was staffed by Xim's elite honor guard, which continued to protect the treasure for millennia after as the cult known as the Survivors. It was also protected by one thousand of Xim's Guardian Corps war droids."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Queen of Ranroon was first mentioned in Han Solo's Revenge, a novel written by Brian Daley and released in 1980, and became a key plot point in Daley's subsequent novel, Han Solo and the Lost Legacy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}