{"url": "Quermian/Legends", "categories": ["Category:Legends articles", "Category:Mammalian sentient species", "Category:Outer Rim Territories species", "Category:Quermians", "Category:Spacefaring species", "Category:Telepathic species"], "nodes": [{"tag": "h1", "text": "Quermian"}, {"tag": "p", "text": "Quermians were a mammalian species of sentients hailing from the planet Quermia after being genetically designed from Xexto DNA by the Arkanian race."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Created by Arkanian scientists from the DNA of the Xexto race, the Quermians were designed to be taller than their fore-bearers and were left to evolve without any predators on their terraformed homeworld of Quermia. Equipped with long necks for peering over vegetation mats, bulbous heads with a permanently bemused smile, and two sets of spindly arms, they also had two brains, one located in the chest cavity. Their two brains could cause mental problems when each brain developed a different personality but also gave them a type of telepathy which they attributed to an ability to better observe and understand body language. Possessing no noses, the olfactory glands of this species were found in the hands."}, {"tag": "p", "text": "It was widely believed among xenobiologists that Quermians had the ability to communicate telepathically with members of their own species. Their claim was justified by unusual brain activity in Quermians, initially believed to be a result of their genetic manipulation, though it was postulated that it was in fact a natural trait the Xexto would also pick up in time. The Quermians held that their keen ability to read one another's body language was mistaken for telepathy by observers."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "A peaceful society developed on Quermia as the Quermians evolved on their own in the absence of any predators or outside intervention. As a race they were dedicated to complex philosophical ideas, and many of the galaxy's most prominent diplomats and thinkers were found among their ranks. While they had four arms and were capable of using both sets with ease, they preferred to keep the lower set hidden beneath their robes when dealing with offworlders."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Quermians were directly related to the Xexto, having been genetically modified by Arkanian geneticists around 17,000 BBY. The Arkanians ultimately abandoned their work, fearing legal repercussions, allowing the Quermians to evolve on their own on the terraformed garden planet of Quermia. These two species rediscovered one another when both joined the Galactic Republic, though the Xexto initially denied any genetic link with the Quermians. Even after the connection was proven, Xexto held only grudging respect for Quermians, seeing them as a lower species. Fortunately for the Quermians, this attitude generally changed for the better when members of both species worked alongside one another after joining the New Republic. By this time, the Quermians were known to be technologically advanced."}, {"tag": "p", "text": "A Quermian colony was established on the moon Ploo II, after a small group migrated from Quermia early in the planet's spacefaring history. The famed Quermian professor Murk Lundi hailed from this colony."}, {"tag": "p", "text": "Due to their latent telepathy, many Quermians became members of the Jedi Order in the Galactic Republic. Some of the most notable were Loo Raelo, Kindee Ya, Vinian Ska and the High Councilor Yarael Poof. During the time of the Galactic Empire, these natural traits saw Quermians persecuted and propaganda claiming the species was made up entirely of Jedi spread rapidly. This anti-Quermian bias forced many to adopt a life of solitude on Quermia. With the fall of the Empire and the unification of the galaxy during the Yuuzhan Vong War, this isolation came to an end, and saw many Quermians rejoining galactic society. Quermia eventually did gain representation in the New Republic as a Senator for the system was appointed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": "Star Wars Episode I: I Am a Jedi"}, {"tag": "h2", "text": "Notes and references"}]}