{"url": "Quest_Knights", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:New Jedi Order organizations"], "nodes": [{"tag": "h1", "text": "Quest Knights"}, {"tag": "p", "text": "The Quest Knights was a group of ten Jedi Knights of the New Jedi Order formed in 44 ABY to locate the powerful Dagger of Mortis. Immediately following the conclusion of the Jedi's war with the Lost Tribe of Sith and the destruction of the dark side entity Abeloth, a member of the Force deity family of the Ones, the Jedi decided to arm the future generations against Abeloth's eventual return. Grand Master Luke Skywalker knew that the Dagger of Mortis had been used to kill other members of the Ones during the Clone Wars, and though the Jedi had no idea where Mortis was, it was their only hope in permanently killing Abeloth. As such, Skywalker sent the Quest Knights on a mission to find the Mortis monolith that led to the planet Mortis, where they hoped to be able to find the Dagger."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime after 100,000 BBY, the being Abeloth—the only mortal member of the powerful Force-sensitive family of the Ones who lived on a jungle planet in the Maw—drank from two Force nexuses on the world—the Pool of Knowledge and Font of Power. Doing so transformed her into a dark side Force deity bent on destroying civilizations across the galaxy. The Ones imprisoned Abeloth on the world and moved to the planet Mortis, but they were killed during the Clone Wars when the Jedi Anakin Skywalker and Obi-Wan Kenobi arrived on a mission there."}, {"tag": "p", "text": "As such, when Abeloth broke free of her prison in 44 ABY, there was no one left to stop her. While the Lost Tribe of Sith arose and began a war with the New Jedi Order, Abeloth initiated her own plan to take over the galaxy. Ultimately, the Jedi defeated the Tribe, and along with help from the Galactic Alliance and two Sith—apprentice Vestara Khai and Lord Darth Krayt—were able to defeat Abeloth as well, killing her bodily manifestations in a duel in the Force realm beyond shadows, an assault in the New Jedi Temple, and a duel at the Font of Power. Although Abeloth was destroyed, she quickly began to reform her body, and the Jedi realized that she had not truly been killed."}, {"tag": "p", "text": "Jedi Grand Master Luke Skywalker, who had heard of the events on Mortis during the Clone Wars from his Master, Yoda, recalled that the Ones could only be permanently killed by the Force-imbued Dagger of Mortis. As the Jedi had no idea where Mortis was located, Skywalker formed the Quest Knights in order to find the Mortis monolith, a structure in space that led to the planet, and recover the Dagger of Mortis. That way, future generations would be armed against Abeloth's inevitable return, and could prevent her from destroying civilizations in the galaxy. The Ten Knights embarked upon their solitary mission in StealthX starfighters from a hangar of the Super Star Destroyer Megador in 44 ABY. They immediately broke formation and piloted their ships off in ten separate directions to begin their search."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Quest Knights was a group that consisted of ten Jedi Knights of the New Jedi Order. They were each equipped with their own personal StealthX starfighters."}, {"tag": "h3", "text": "Knights"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Quest Knights first appeared in Troy Denning's Fate of the Jedi: Apocalypse (2012), the ninth and final installment in the Fate of the Jedi novel series. In Apocalypse, none of the Knights are individually named, until Soroc's appearance in Crucible."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}