{"url": "Querdan_Dei", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Sith Sabers"], "nodes": [{"tag": "h1", "text": "Querdan Dei"}, {"tag": "p", "text": "Querdan Dei was a male Human born on Kesh in 4 ABY. He had become a Sith Saber by 44 ABY, and was usually assigned to difficult assignments that were often unrewarding."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "He was part of a fleet commanded by fellow Sith Saber Gavar Khai, who assigned Dei to find and assassinate Queen Mother Tenel Ka Djo, in order to try and prevent the birth of a Jedi Queen that High Lord Sarasu Taalon had seen in a Force vision. He was given the Cryptic Warning to carry out this task, which was one of two EE-104 Fisheye stealth ships the Lost Tribe had captured. After spending several days in the Hapes system near Hapes, Dei and his crew, which included his son Fardan, detected a flotilla of Hapan Battle Dragons leaving the planet, and determined that Tenel Ka was aboard, and that they were heading to Klatooine."}, {"tag": "p", "text": "After following the Battle Dragons to Klatooine, Dei ordered Fardan to approach the planet in stealth mode, and followed down a landing craft launched by one of the Battle Dragons. After landing outside the camp where the shuttle set down, Dei and his crew determined that in addition to Tenel Ka being there, the Millennium Falcon, and therefore Jedi Knight Leia Organa Solo and Captain Han Solo, were also present. Dei left the ship and walked to a ridge near the camp to observe the Hapan shuttle, and noticed a group of five Humanoids, four adults and one child, whose gender he couldn't determine, and two droids watching the ship as well. Eventually he saw the shuttle open, and the four adults take positions around the landing ramp while the child and two droids went inside. Dei found this curious, and wondered who the child was. An hour later, the child reemerged, and Dei attempted to track the child and its bodyguards through the camp but was unable to."}, {"tag": "p", "text": "Dei then returned to the Cryptic Warning, and asked his crew for details about the camp. His archive analyst Sazat told him that it was the location of an unofficial negotiation assembly to determine the future of the planet after a uprising by the native Klatooinians against their Hutt masters. Farden briefed him on the camps defenses, informing him that the camp was pretty low tech except for the shield and weapons emplacements, and that there was a large amount of comm traffic coming from the numerous parties in the camp. Dei determined that he would need to infiltrate the camp and attempt to find a way to assassinate Tenel Ka on the ground, since the shields would be too strong to bomb. He asked for a disguise to infiltrate the camp, and his youngest crew member, Viti, told him she had set up an identity for him as a journalist for Heuristic Financial Analysis reporting on the economic impact of the slave revolt. Dei decided to install some fear in her in order to prevent her from getting to lazy or complacent, and demanded if that was the best she could do, and that it was an unattractive profession. Viti began to offer a defense for why she had chosen it, but Dei told her that he had just been joking and that she had done a good job. He then turned recordings of his monitoring over to Fardan and Sazat, and ordered them to learn whatever they could from them."}, {"tag": "p", "text": "Dei infiltrated the camp the next day, and hid in the shadows of a tent where drinks were sold, where he could monitor the tent where negotiations were taking place. He paid a Klatooinian child to toss a ball towards the delegates as they approached the tent in order to monitor their guards' reactions. One guard jumped on top of the ball, while the others shielded the delegates. Dei noticed that the two droids he had spotted belonged to the Solos, and also spotted the droids moving to guard one of the cloaked figures in the delegation. He determined that that must be Tenel Ka, and was interested in the fact that the droids seemed concerned about her safety, and that she had taken the time to talk with them after the incident as well. Dei began to form a plan using the droids, and waited in the tent until all the onlookers who had been nearby where gone, except for the boy he had recruited. He paid the child, and told him that he might need his services again later. He returned to his ship and met with his crew, and Fardan informed him that the two droids were R2-D2 and C-3PO, and that they had severed the Solos for several decades. Dei finished formulating his plan, and ordered Fardan to strip the Cryptic Warning of non-essential equipment they could sell so they could get some bribe money, and ordered his chief engineer, Tooley, to cut down a missile and convert it into a bomb that could destroy everything in three to five meters."}, {"tag": "p", "text": "Dei captured C-3PO, and after deactivating him, planted the bomb Tooley had built inside of the droid, along with a camera in the droids optics. He then paid a 2-1B surgical droid that was part of a droids rights group to take C-3PO, and pretend it had captured him itself for its own agenda. Dei monitored the droid, and two minutes before it was supposed to be reactivated, the child he had seen, Allana Solo, arrived and rescued the droid with her security detachment. Dei was unconcerned, as C-3PO was called away to help Tenel Ka with some translation, and waited for him to get close enough to activate the bomb. As he waited, he realized how much Allana looked like Tenel Ka, and determined that she must be her daughter. Dei resolved to find and kill her as well, and when C-3PO got into position, he reached down to activate the detonator remote, but realized it was no longer where he had put it. He turned around and discovered Allana behind him, holding the remote. He demanded she give it to him, but she refused and told him he wasn't going to kill her. Dei asked her if she meant her mother Tenel Ka, and sensed through her surprise that his suspicions were correct. Dei apologized to her, saying he regretted having to kill her and her mother, but that his duty came first, and he would try to make it as painless for her as possible."}, {"tag": "p", "text": "Dei pulled out his lightsaber and charged at her, but was suddenly attacked by Allana's pet Nexu, Anji. It attacked his face, knocking him to the ground, and ripped into his right eye. He managed to fling the creature off of him, but lost his eye in the process. Filled with anger, he stood up and turned back toward Allana, but found Leia Organa Solo in between him and his target, with her own lightsaber activated. She asked him if he wished to surrender, but he refused, and she charged at him. They dueled for several minutes, and Dei was delighted by the beauty of the duel. They continued to fight until their blades locked, and when Dei spun away to his left, he realized he had made a mistake since he could no longer see out of his right eye, and lost sight of Leia earlier than he expected. She took advantage of this and decapitated Dei, and he spent several seconds still alive, before his head fell backwards and he watched his back and legs for a few seconds before it hit the ground and rolled, with the last thing he saw being Anji. Fardan sensed his death on the Cryptic Warning."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dei was a patient individual, and often wished that his crew and family members would understand its value. Unlike other members of the Lost Tribe, he was uninterested in advancement, only wishing to advance the interests and power of the Tribe. Dei appreciated the beauty and intelligence of all things, and regretted having been assigned to carry out the assassination of Tenel Ka and Allana Solo, but believed that his duty to the Lost Tribe came first."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}