{"url": "Quesoth/Legends", "categories": ["Category:Legends articles", "Category:Insectoid sentient species", "Category:Quesoth", "Category:Unknown Regions species"], "nodes": [{"tag": "h1", "text": "Quesoth"}, {"tag": "p", "text": "The Quesoth were a sentient insectoid species that resided on the planet of Quethold."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Quesoth were ruled by a Queen and were divided into four castes—the Circlings, the Midli, the Soldiers and the Workers—each of which served a different purpose. The Circlings were the most intelligent Quesoth and they acted as advisers to the Queen, while the Midli were tasked with overseeing the Workers, who had almost no intelligence. The Soldiers possessed a level of intelligence on par with that of the Workers and they took their orders directly from the Queen, whom they served with unquestioning loyalty."}, {"tag": "p", "text": "The Quesoth resided in three cities on Quethold, the Black City, the Red City and the White City, and each city was occupied intermittently, depending upon the seat of power of the reigning Queen. The Quesoth underwent a cycle, whereby Quesoth Queen of the Red would reign from the Red City for a number of years until her death in a process known as the \"changing of the air.\" The Queen of the White would then arise in the White City, to which all of the Midli, Workers and Soldiers of the Red Queen would subsequently migrate, to join the entourage of the Queen of the White. Following the demise of the White Queen, the Queen of the Black would arise in the Black City, and on the Black Queen's death, the Queen of the Red would emerge and the process would repeat itself. Following the death of a Queen, the Circlings would remain behind in their home city and enter hibernation, before eventually re-awakening to breed a new Queen."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During an era known as the Expansion Period, the Quesoth engaged in hostilities with the Stromma species. The Quesoth were victorious and later became firm allies of the Stromma. In about 8 ABY, the alien warlord Nuso Esva traveled to Quethold and made a pact with the reigning Queen of the Red, whereby he would assist the Queen in attacking the White City and killing the Queen of the White, to prevent the Red Queen from ever being replaced by her successor. However, the Empire of the Hand sent forces to Quethold, to attack Esva and the Quesoth. The Imperials were victorious and both Esva and the Queen of the Red were killed, preventing the Red Queen from eliminating the Queen of the White."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}