{"url": "Queluhan_Nebula_Imperial_remnant", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Military stubs", "Category:Imperial remnants"], "nodes": [{"tag": "h1", "text": "Queluhan Nebula Imperial remnant"}, {"tag": "p", "text": "A remnant of the fallen Galactic Empire had secretly established themselves from the disbanded Imperial Navy and were based in the Queluhan Nebula within the Unknown Regions. Commanded by Grand Moff Randd, the remnant upgraded its TIE fighters by giving them stronger weapons that nullified enemies' shields."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Following the Galactic Empire's fragmentation in the aftermath of the Battle of Endor in 4 ABY, brought upon by Galactic Emperor Darth Sidious's death, the Empire became leaderless. This imbalance resulted in a massive power vacuum, leading to a number of warlords seizing control of territories for themselves within a few weeks. Grand Vizier Mas Amedda acted as proxy Emperor, but in reality, he held little influence beyond the throneworld of Coruscant. His reign was troubled from the beginning, with his powers and influence fading as Grand Admiral Rae Sloane, bestowed unto her by the mysterious Fleet Admiral Gallius Rax, served as the public face of the Empire while he ruled from behind the scenes. Rax soon did away with her and declared himself de facto emperor."}, {"tag": "p", "text": "Within a year of Endor, Rax had proclaimed himself as Counselor to the Empire and oversaw the Empire which was decisively defeated by the New Republic after his death at the Battle of Jakku in 5 ABY, resulting in the end of the war and the Empire signing an armistice called the Imperial Instruments of Surrender, setting the stage to a formal end to hostilities. This was followed by the peace treaty sighing of the Galactic Concordance with the Republic that called for the disbanding of the Galactic Empire, leading to it collapsed, with scattered Imperial remnants emerging to fill the void in it place."}, {"tag": "h3", "text": "Regrouping"}, {"tag": "p", "text": "In the wake of rising factionalism across the former Empire, Grand Moff Randd and some of his forces who had retreated from Jakku into the Queluhan Nebula reorganized into an Imperial remnant and prepared for a renewed offensive against the New Republic. The nebula's ionized gases ensured that the Republic's sensors could not detect them, allowing these Imperials to amass a large fleet without being noticed."}, {"tag": "p", "text": "A month after the Battle of Jakku, Randd and several other Imperial officers, including Nash Windrider, nominated Ciena Ree, who was believed to have perished on Jakku, for the Distinguished Medal of Imperial Honor, the highest honor in the Imperial Military. As flight commander, Nash restored \"proper discipline\" among his crew to the extent that none of them turned away from their work when he left the command bridge. Windrider was also assisted by Thane's estranged older brother Dalven Kyrell, a third-class desk officer who held the rank of Lieutenant. After listening to a New Republic \"propaganda broadcast,\" Windrider believed that the rebels had grown complacent and were underestimating the remnants of the Empire. He watched as an Randd fleet prepared for a strike against the Republic and vowed to avenge Ciena's purported death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}