{"url": "Quest_to_build_the_Arrowhead", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Quest to build the Arrowhead"], "nodes": [{"tag": "h1", "text": "Quest to build the Arrowhead"}, {"tag": "p", "text": "In 4 ABY, the Freemakers, a family of scavengers embarked on a quest to obtain parts to help the Rebel Alliance build the Arrowhead."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Galactic Civil War, the Mon Calamari starship builder Quarrie dreamed of building a starship that could turn the tide of the war for the Rebel Alliance. Following a salvage mission to the planet Tibalt, his young apprentice Rowan Freemaker experienced a Force vision about using the Force to build a starship powered by a kyber crystal called the Arrowhead."}, {"tag": "p", "text": "Rowan related his vision to Quarrie the following day but had trouble reproducing a model of the ship. Seeking inspiration, Quarrie convinced Rowan and the B1-series battle droid Roger to travel with him to the city of Alistan Nor to get a sense of style and craftsmanship. After climbing to the top of the Tower of Alistan Nor, Rowan experienced another Force vision about the Arrowhead and gained clarity on how to build the starship. Despite being attacked by the Imperial hunter droid M-OC, Rowan and his friends managed to escape back to the Alliance Fleet."}, {"tag": "p", "text": "After returning to the Rebel Alliance's flagship Home One, Rowan enlisted the help of his older brother Zander and sister Kordi Freemaker in obtaining the parts to build the Arrowhead. After consulting with Quarrie, the Freemakers were tasked with gathering several items including embersteel blades, a Farium fusion conduit, a proton suspension housing, an energy matrix activator, and a bantha–sized Kyber crystal. Though the quest was difficult, Rowan was still determined to build the Arrowhead."}, {"tag": "h2", "text": "The Quest"}, {"tag": "h3", "text": "Obtaining embersteel blades"}, {"tag": "p", "text": "Seeking embersteel blades for the Arrowhead, Kordi managed to convince Admiral Ackbar to loan them 100,000 credits to buy a Theta-class H-2 executive star shuttle, which had embersteel wings, from a Mygeeto Auction House. She and her family traveled to Mygeeto disguised as the Clawdite Princess Alo Kortessi of Zolan. However, the mission was complicated when Zander bid 30,000 credits on an Eta-2 Actis-class light interceptor, leaving them with insufficient funds to buy the shuttle."}, {"tag": "p", "text": "The Freemakers encountered another problem when their old enemy Graballa the Hutt kidnapped Kordi after his henchmen Baash and Raam accidentally bid for the Theta-class shuttle. Believing Kordi to be Princess Kortessia, Graballa hoped to extort a ransom from her wealthy parents. Rowan and Zander mounted a rescue mission and managed to fight Graballa's bounty hunters, who flew starfighters. Meanwhile, Kordi managed to charm her way out of captivity and drive a wedge between Graballa and his underlings. The Freemakers managed to escape with the Theta-class shuttles and its embersteel blades but Zander's Jedi starfighter was destroyed in the process."}, {"tag": "h3", "text": "Mission to Taul"}, {"tag": "p", "text": "While on a mission to rescue the rebel agent Major Bren Derlin, Rowan convinces Kordi and Zander to visit Takodana Castle for information on obtaining a proton suspension housing for the Arrowhead's kyber crystal. At the advice of the Weequay pirate Hondo Ohnaka, the Freemakers traveled to the dangerous, acidic and stormy world of Taul. Despite the dangerous conditions, the Freemakers managed to retrieve the proton suspension housing from a Corellian Defender that had fallen into a lake of acid."}, {"tag": "p", "text": "However, the unscrupulous Hondo stole their starship StarScavenger and escaped offworld. Fortunately for the Freemakers, Hondo was subdued and locked in a crate by Roger, who returned to Taul. Meanwhile, M-OC caught up with the Freemakers. Following a pursuit, the Freemakers managed to subdue him temporarily by getting him electrocuted in a lake of acid. After being picked up by Roger, the Freemakers rescued Major Derlin and returned Hondo to Takodana to face justice at the hands of the bounty hunter Zek."}, {"tag": "h3", "text": "Return to the Wheel"}, {"tag": "p", "text": "Seeking an energy matrix activator, the Freemakers traveled to their former home on the Wheel. Kordi's plan was for the Freemakers to infiltrate their former home Freemaker Salvage and Repair, which had been converted into a cantina owned by Wick Cooper, at night. Roger was tasked with slicing into the station's guidance systems in order to guide the and unlock the doors."}, {"tag": "p", "text": "However, their mission was complicated by several factors. First, Roger was attacked by a group of Ranats who wanted to steal his datapad. Second, Furlac reported the Freemakers to the Hutt crime lord Graballa, who wanted to collect an Imperial bounty on Rowan's head and obtain more kyber crystals. The Freemakers were captured by Graballa and his bounty hunters Dengar, IG-88, Bossk, Zuckuss, and 4-LOM. Graballa informed Darth Vader about Rowan's capture."}, {"tag": "p", "text": "Despite their predicament, the Freemakers managed to escape when Kordi managed to sow discord between the droid and organic bounty hunters. After losing the bounty hunters in a speeder bike chase, the Freemakers managed to steal stormtrooper armor and recover the energy matrix activator. They attempted to travel back to the Lower Ring to meet Roger but their lift was commandeered by Darth Vader. Meanwhile, Roger managed to escape the Ranat gang and used a trapdoor to rescue the Freemakers. The group then returned to the rebel fleet with the energy matrix activator."}, {"tag": "h3", "text": "Mission to Qalydon"}, {"tag": "p", "text": "With the help of Roger, Kordi and the Lothal astromech droid BG-81 obtained a list of planets with kyber crystals from an Imperial Star Destroyer. However, Roger accidentally substituted a document on fake rebel plans with his Ugnaught bean casserole recipe. This enabled M-OC to track them down."}, {"tag": "p", "text": "Using the list of planets, the Freemakers traveled to the planet Qalydon, which was home to a Lurmen village. The Lurmen villages used their kyber crystal necklaces to commune with the Force. Though the villagers were initially hostile, their Chief Biz welcomed the Freemakers to their village."}, {"tag": "p", "text": "The Imperial officers Durpin and Plumestriker raided the village, seeking to use the kyber crystals to build the second Death Star. Rowan and Biz's daughter Maynar used the StarScavenger's firepower to drive the Imperials away, causing their Gozanti-class cruiser to crash in the nearby mountains."}, {"tag": "p", "text": "The Freemakers undertook a mission to recover these crystals with the help of Maynar. Despite being attacked by M-OC, the Freemakers managed to recover the crystals from Durpin and Plumestriker, who had fled to the Marriten system. After returning the crystals and Maynar, a grateful Biz offered his people's crystals. Unwilling to deprive the Lurmen of their crystals, Rowan and his siblings continued their search for the crystals."}, {"tag": "h3", "text": "Building the kyber crystal"}, {"tag": "p", "text": "While meditating in hyperspace, Rowan managed to sense a planet that was rich in kyber crystals at twelve parsecs past the planet Terminus in the Outer Rim. Despite being pursued by M-OC, the Freemakers managed to flee into hyperspace. Following a crashlanding, Rowan and Kordi searched for the crystal while Zander and Roger repaired the damaged StarScavenger."}, {"tag": "p", "text": "After a series of trials inside an underground temple, Rowan learned that he had to build the kyber crystal by fusing several smaller crystals through the Force. Overcoming his doubts, Rowan managed to forge a large kyber crystal. Meanwhile, Zander got Roger to distract several mynocks by leading them away with his jetpack while he finished repairing the damaged starship. Having obtained the crystal, the Freemakers returned to the Alliance Fleet."}, {"tag": "h3", "text": "Saving the rebel fleet"}, {"tag": "p", "text": "The Freemakers traveled back to the rebel fleet only to find it under attack from Imperial forces. Quarrie convinced the Freemakers and the rebel pilot Lieutenant Valeria to travel to the planet Jakku in order to assemble the Arrowhead since it was too dangerous to do it aboard the Home One in the middle of a space battle."}, {"tag": "p", "text": "Braving Imperial forces, the Freemakers and their rebel allies traveled to Jakku. Though Zander managed to land the StarScavenger safely, Valeria landed the Arrowhead in a patch of quick sand, which caused the ship to explode. Though the group managed to recover most of the pieces, they discovered that the energy matrix activator had fallen into the hands of the Imperial officers Durpin and Plumestriker."}, {"tag": "p", "text": "Following a botched attempted by Zander and Roger to recover it, Kordi disguised herself as Darth Vader and managed to distract the Imperials long enough for Valeria to knock them out. Meanwhile, Rowan and Quarrie worked on rebuilding the Arrowhead. Valeria and the other Freemakers soon returned with Durpin and Plumestriker in pursuit. Valeria and Zander managed to hold off the Imperial officers' AT-ST walker long enough for Rowan and Quarrie to finish rebuilding the Arrowhead."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After Zander used the Arrowhead to destroy Durpin and Plumestriker's walker, the Freemakers used the starship to save the rebel fleet. Zander destroyed an Imperial Star Destroyer, which forced the Empire to retreat. Due to their efforts to save the rebel fleet, the Freemakers were treated as heroes by the rebels. Rowan was promoted to Master Ship Builder, Kordi as Admiral Ackbar's new quartermaster, and Zander to flight cadet."}, {"tag": "p", "text": "Enraged that Rowan was using the Arrowhead to tear his fleet apart, Emperor Palpatine tasked Darth Vader and M-OC with working together to hunt down Rowan, obtain the Kyber Saber, and capture the Arrowhead. In the Alliance's service, the Freemakers used the Arrowhead to attack Imperial walkers on Kashyyyk and later to destroy an Imperial fleet near Alzoc III. However, M-OC managed to lure Rowan into a trap on Qalydon. Lord Vader then ambushed M-OC and claimed Rowan for the Emperor, taking him back to the Emperor on Coruscant."}, {"tag": "p", "text": "Determined to save Rowan, Kordi, Zander, and Roger embarked on an unsanctioned mission to rescue Rowan from the Empire. Despite rescuing Rowan, the Freemakers lost the Arrowhead to M-OC, who delivered the ship to the Emperor. The Emperor then sent M-OC to hunt down and destroy the Freemakers. With the help of Quarrie, the Freemakers managed to lure M-OC into a skirmish on Shantipole where both the Arrowhead and StarScavenger were destroyed."}, {"tag": "p", "text": "Though the Arrowhead was destroyed, M-OC took parts of the ship including the giant kyber crystal and several engines, which he used to travel to the second Death Star in the Endor system. Rowan also incorporated other parts of the Arrowhead including its Embersteel Blades into a rebuilt version of the StarScavenger, which took part in the Battle of Endor, which saw the demise of M-OC and the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}