{"url": "Quiggold", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Cleanup", "Category:Gabdorins", "Category:Males", "Category:Sidon Ithano's crew members"], "nodes": [{"tag": "h1", "text": "Quiggold"}, {"tag": "p", "text": "Quiggold was a male Gabdorin pirate from Gabdor and the first mate of Captain Sidon Ithano's crew in the Outer Rim in the decades after the Galactic Civil War. Assisting Ithano in the hunt for a possible lost shipment of kyber crystals that was originally meant to be delivered to Count Dooku during the Clone Wars, Quiggold and the rest of the crew ended up finding a clone trooper frozen in stasis named Kix and locations to long-forgotten former Separatist bases."}, {"tag": "p", "text": "He would also accompany Captain Ithano on a visit to Takodana Castle thirty years after the Battle of Endor where a fugitive First Order defector named Finn offered to join their crew in exchange for safe passage into the Outer Rim, away from the First Order's reach."}, {"tag": "p", "text": "Quiggold wore a simple brown hood and had a peg leg fashioned from a fuel funnel and carried a set of prayer beads fashioned from hyperdrive plotter pins."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Quiggold first appeared in the short story \"The Crimson Corsair and the Lost Treasure of Count Dooku\", which was written by Landry Q. Walker and released as the Journey to Star Wars: The Force Awakens multi-media campaign leading into the release of Star Wars: Episode VII The Force Awakens in 2015. The character then made a minor appearance in the film itself played by real-life leg amputee Scott Richardson, and was controlled and voiced by key animatronic designer Chris Clarke with additional cover provided by Patrick Comerford. The mask of the Quiggold costume was an animatronic that allowed Clarke to manipulate the character's facial expression using a performance delivery system while delivering his lines. Richardson expressed interest in return for Star Wars: Episode VIII The Last Jedi, but neither he nor the character returned in that film."}, {"tag": "p", "text": "Quiggold appeared in the Star Wars: Episode VII The Force Awakens toy line in a two-pack with Delphidian Captain Sidon Ithano. His name on the packaging was \"First Mate Quiggold.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}