{"url": "Quor%27sav/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Avian and airborne sentient species", "Category:Endothermic species", "Category:Mammalian sentient species", "Category:Outer Rim Territories species", "Category:Oviparous species", "Category:Quor'sav"], "nodes": [{"tag": "h1", "text": "Quor'sav"}, {"tag": "p", "text": "Quor'sav, or Quor'savs, were a species of warm-blooded sentients with both avian and monotreme characteristics. Their stilt legs and long necks made them tower over most other species at 3.5 meters in height. Quor'sav were more vulnerable to illnesses and pollutants than many other species. They laid eggs, which took over a year to hatch, and the females often took on a motherly persona when around friends and youth."}, {"tag": "p", "text": "The Quor'sav were native to the planet Uaua in the Ua system of the Centrality. They had a history of poor relations with alien species. At one point, mammalian colonists introduced a virus to Uaua that was deadly to avian biology. As a result, the Quor'sav came to distrust and shun non-avians on their homeworld. During the Imperial Period, Quor'sav were forced into Imperial service as tribute to the galactic government. Waywa Fybot became a narcotics agent in this manner. Kal'Falnl C'ndros, on the other hand, operated as an independent trader. Due to their unique appearance, Quor'sav were often subjected to insults from members of other species."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Quor'sav or Quor'savs were a species of large, warm-blooded sentients with characteristics of both avians and monotreme mammals. Their birdlike natures were more pronounced, manifest in both their appearance and biology. They had a fragile constitution, much like that of a canary. In fact, members of the species who lived on worlds with high levels of air pollution were at risk for respiratory diseases such as dioxo-brionchiectasis shock, hemorrhagic molting, lungrot, and silicalung. Rather than sitting on their posteriors or reclining on their backs like many other species, Quor'sav perched. A certain perching posture brought on a sleep reflex and compelled the Quor'sav to fall into a deep slumber during which they were prone to vivid dreams and, at least in some specimens, snoring. Among the adaptations unique to their species was their heart being located in the abdomen."}, {"tag": "p", "text": "Most non-Quor'sav found the species' appearance bizarre. For one, Quor'sav were larger than most sentient lifeforms, and their bodies demanded extra room for ease of movement. Even shorter Quor'sav towered as high as 2.5 meters, and the average height was 3.5 meters. Their round, bean-shaped body terminated in a pointed tail. A pair of short, jointed arms—actually vestigial wings attached to the chest by membranes— hung from their shoulders. These ended in four-fingered hands, which lacked a great deal of manual dexterity. Quor'sav moved about on two long, stilt-like legs with knobby knees that bent backward like a bird's. Their feet were scaly. Members of the species could be powerfully muscled, some to such an extent that other beings found them grotesque. This strength allowed their long legs to kick with devastating force, and their long neck and sharp beak to peck with penetrating results, although this left the Quor'sav vulnerable to counterattack."}, {"tag": "p", "text": "A long, straight neck extended from the bulbous body at a roughly 45-degree angle. Despite its length, the neck was not particularly flexible, and the head could not be tucked under the arm in the manner of many bird species. The neck supported a small, round head. Their visage, though mostly static, featured a few mutable areas. Two large, blue eyes were situated to either side of the head, protected by blinking eyelids. A downward-curving, pointed, orange beak stuck out between them, pierced by two small, round nostrils. Wattles grew both between the eyes and under the beak. Some members of the species had high, squeaky voices that other beings found annoying."}, {"tag": "p", "text": "With the exception of the legs, the body was covered in a layer of down and an outer layer of yellow feathers. The plumage of the arms was particularly thick, and that on the top of the head relatively long. Despite their natural covering, Quor'sav often wore clothing tailored to their unique body plan. Some, for example, had customized flight suits and environment suits."}, {"tag": "p", "text": "Quor'sav females laid several eggs upon fertilization. The eggs took more than a standard year to hatch."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Quor'sav hailed from Uaua, the major planet of the Ua system in the Centrality region of the Outer Rim Territories, and a world notorious for its pesky insects. Their region of space was thinly inhabited, with average populations of fewer than one million sentients per inhabited world in 25 ABY. The Quor'sav Waywa Fybot lived in a town with homes built of cement and steel beams and covered with roofs of thatched straw, although synthetic materials had grown common there too. Fybot's home featured a lawn of magenta grass tended by domesticated lawn lice. Individual properties in his neighborhood were separated by fences."}, {"tag": "p", "text": "They were nervous and anxious by nature, yet proud of their avian heritage and willing to shrug off jibes aimed at their large size or strange appearance. Members of the species were wary of non-avians and reserved special insults for mammalian species—especially for primates like Humans."}, {"tag": "p", "text": "Quor'sav mothers were known for their protective natures. Their eggs took more than a standard year to hatch, during which time the mother carefully guarded and protected them from predators and other dangers. This behavior was prevalent even in childless females; many Quor'sav took on a matronly persona when around friends whom they perceived as small and vulnerable. This could result in misunderstandings and annoyance for friends who did not wish to be babied, but it reassured and calmed strangers."}, {"tag": "p", "text": "Quor'sav could manipulate their feathers to express emotion and aid communication. One greeting used by the species was to wave their arms and ruffle their feathers. Smooth and still feathers indicated calmness, those set erect expressed surprise or shock, and those shaking indicated extreme anger. Portions of the face could be altered to express emotion. For example, scrunching up the face in what appeared to be a grimace was a sign of joy. Quor'sav could speak Basic. They tended to take two-part names such as Kal'Falnl C'ndros and Waywa Fybot."}, {"tag": "p", "text": "The species had access to advanced technology, although much of this was customized for their unique anatomy. For example, Quor'sav preferred perch-like seating racks, which looked like distorted chairs, and resting racks, which resembled a pair of sawhorses. They found perching on this latter device to be reassuring and comforting. Nevertheless, a Quor'sav in this position risked drowsiness and falling asleep. Their starships, in particular, had to be custom-built and modified to allow for their large frames to operate comfortably."}, {"tag": "p", "text": "Quor'sav cuisine was considered unappetizing to Humans. Nevertheless, some members of the species took cooking very seriously and became professional chefs. Quor'sav ate various creatures, including centipedes and nerfs. The dish Quor'sav-fried steak and eggs, for example, consisted of nerfsteak fried in a pom seed batter."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Quor'sav evolved on Uaua, a world in the Ua system. The species' ancestors were winged avians capable of flight. Eventually, the species' wings developed into hands capable of fine manipulation but no longer capable of generating lift. Much later, the species evolved sentience and mastered the use of stone tools. Their technology progressed until they eventually reached the same standards as much of the rest of the galaxy."}, {"tag": "p", "text": "The Quor'sav made contact with the outside galaxy at some point between 3956 and 3000 BBY, and their world became part of the remote region known as the Centrality. Such extra-planetary contact opened the door to colonists from other worlds, and alien settlers, many from mammalian species, arrived on Uaua. They were accompanied by another colonizer: a deadly virus to which mammals were immune but avians were susceptible. After a plague ravaged their world, the Quor'sav came to distrust and shun non-avian visitors to Uaua. The experience also sowed anti-Centrality sentiment among the population."}, {"tag": "p", "text": "As with the rest of the Centrality, Uaua remained independent from the Galactic Republic. The world fell within the domain of the Brotherhood of Darkness from 1004 to 1000 BBY, and the Quor'sav remained neutral during the Clone Wars."}, {"tag": "p", "text": "At least some Quor'sav emigrated from the world to take up residence on Republic planets. In 22 BBY, Quor'sav had moved to Coruscant, for example. With the rise of the Empire, Uaua suffered from the general economic malaise that affected the Centrality as a whole. Uaua and the Centrality joined the Galactic Empire in exchange for monetary aid and the promise of autonomy. The region's fortunes improved under the new regime."}, {"tag": "p", "text": "With the Empire's downfall at the Battle of Endor in 4 ABY, Uaua and the Centrality were once again independent. The region signed goodwill treaties with the nascent New Republic but remained suspicious of the new government and resisted overtures to join it. The economy once again suffered as the lack of Imperial buyers for goods took its toll. As the Yuuzhan Vong War raged throughout the New Republic from 25 to 29 ABY, the Centrality carefully built up its military and took in New Republic refugees, but did its best to stay out of the conflict. Years later, Uaua fell within the bounds of Darth Krayt's Galactic Empire."}, {"tag": "h2", "text": "Quor'sav in the galaxy"}, {"tag": "p", "text": "As early as 22 BBY, Quor'sav could be found as far from Uaua as the middle-class CoCo District of Coruscant. Quor'sav in the greater galaxy faced prejudice and discrimination from Humans and similar species, who often made jokes about the species' size, appearance, and avian heritage. They had to stay alert for oviparous species such as Yam'rii, for whom Quor'sav eggs were an irresistible treat."}, {"tag": "p", "text": "During the Imperial Period, at least some Quor'sav left their homeworld to enter Imperial service as part of a mandatory conscription program. Waywa Fybot left Uaua in this way and became a narcotics agent for the Empire, despite his own ambitions to be a chef. In 4 BBY, Fybot struck a deal with a man who called himself Bohhuah Mutdah to deliver the Human gambler Lando Calrissian; in exchange, Mutdah promised to relieve Fybot of his duty to the Empire. Meanwhile, Fybot's superior officer, Lob Doluff, pressed Calrissian to go along with the Quor'sav and a Human agent named Bassi Vobah so that Calrissian might arrange a fake drug deal and the Quor'sav and Human might nab Mutdah. Fybot betrayed his true loyalties when he sabotaged Calrissian's environment suit and shot Bassi Vobah on Oseon 5792. Nevertheless, Fybot was himself betrayed when Bohhuah Mutdah revealed himself to be Rokur Gepta, a Sorcerer of Tund, and killed the avian."}, {"tag": "p", "text": "Other Quor'sav-at-large, such as Kal'Falnl C'ndros, operated independently. C'ndros worked as a pilot-for-hire from her base of operations, a starship known as the Shelltooth, custom-modified with high ceilings to fit her giant frame. C'ndros was known for her matronly demeanor and protectiveness, traits that endeared her to clients but sometimes annoyed friends. C'ndros often took smuggling runs to help with the costs of raising her many children. On one of these trips, C'ndros visited the planet Yuvern and took the Yuvernian Cane Adiss under her wing. The two traveled to dozens of worlds as C'ndros taught her apprentice the ins and outs of starship piloting. In 0 ABY, the duo parted ways on Tatooine. C'ndros was present in Mos Eisley on the same day Luke Skywalker sold his landspeeder to the Vuvrian dealer Wioslea. Her presence in the spaceport came to the attention of the Yam'rii Kitik Keed'kak, who soon became obsessed with finding and eating the eggs C'ndros had on her ship. Three years later, C'ndros was among the smugglers given part of a cargo by the Shistavanen Mal Biron on the planet Sriluur as part of a race to see who would receive a more lucrative cargo later. Working solo at this time and with another clutch of eggs to protect, she sought to team up with other participants."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A pair of stilt-like legs appear briefly in Star Wars: Episode IV A New Hope, released in 1977; the legs walk across the screen from right to left in the scene where Luke Skywalker sells his speeder in Mos Eisley. Similar legs appear in the manga adaptation of Star Wars Episode IV: A New Hope, published in 1998, as Luke Skywalker and Obi-Wan Kenobi enter Mos Eisley. It is unclear whether these are supposed to belong to the same creature as shown in the film or another member of the same species."}, {"tag": "p", "text": "The legs went unnamed until 1995, when Decipher's Premiere Limited set of cards for the Star Wars Customizable Card Game identified them as belonging to Kal'Falnl C'ndros, a member of the Quor'sav species. The card reveals a few details about the unseen body above, describing the Quor'sav as tall avian–monotreme hybrids. Keeping with her large size, the game allows C'ndros to move further per turn than most other characters, but it forbids her to enter starships. Another card, that of the Yam'rii character Kitik Keed'kak, establishes the notion that Quor'sav must be alert for egg-eating predators and will defend their brood fiercely. The card's rules stipulate that Keed'kak is immediately lost if she finds herself at the same location as C'ndros."}, {"tag": "p", "text": "Six years after the release of A New Hope, L. Neil Smith included a tall, birdlike character named Waywa Fybot in his novel Lando Calrissian and the Flamewind of Oseon. Fybot's species is never identified in the book, although several details about his homeworld and culture are detailed. Author Dan Wallace attempted to identify Fybot as a Quor'sav while writing The Essential Chronology with Kevin J. Anderson. Nevertheless, Anderson edited out Wallace's retcon as unnecessary. In 2001, Michael Kogge named the Quor'sav homeworld and placed it in the Centrality, the location of Smith's novel. The Complete Star Wars Encyclopedia conclusively identified Fybot as a Quor'sav in 2008."}, {"tag": "p", "text": "Later sources add extra details about C'ndros and the Quor'sav species. Secrets of the Sisar Run, a supplement to Star Wars: The Roleplaying Game released by West End Games in 1997, contains the first and only image of a Quor'sav from the knees up. According to the game's rules, the Quor'sav's large size causes them to suffer penalties to attempts to hide and dodge. On the other hand, they move at 1.5 times the rate of a typical Human."}, {"tag": "p", "text": "Other footage cut from A New Hope features another tall, stilt-legged creature that may be a Quor'sav. The fuzzy-legged, stubby-toed alien walks across the screen and scares the Bimm smuggler Rycar Ryjerd in the streets of Mos Eisley. The smuggler runs away, leaving the creature to stumble about perplexed. The footage was shown as part of The Star Wars Holiday Special, which aired on American television in 1978. It is supposed to be part of the Imperial program \"Life on Tatooine.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}