{"url": "Qulok%27s_Fist", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Criminal organizations", "Category:Qulok's Fist"], "nodes": [{"tag": "h1", "text": "Qulok's Fist"}, {"tag": "p", "text": "Qulok's Fist was a criminal gang active during the early years of the New Republic. Comprising four individuals—Thanis Gul-Rah, Kolig, Padak, and Sufar—Qulok's Fist engaged in various criminal activities, including slave trafficking, mercenary work, smuggling, and bounty-hunting. They used a modified YT-1300 light freighter called Steel Fist as their headquarters, transportation, and main combat vessel, operating in the Outer Rim Territories, Minos Cluster, and Kathol sector. In 8 ABY, the group was contracted by Moff Kentor Sarne, warlord of the Kathol sector, to keep track of the New Republic CR90 corvette FarStar. As the FarStar was actively tracking Sarne after forcing him to flee from his capital, Sarne employed Qulok's Fist to provide him with information and, on one occasion in the Shintel system, attack the corvette directly."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Working for Moff Sarne"}, {"tag": "p", "text": "Qulok's Fist was a group of criminals who operated throughout the Outer Rim Territories, the Minos Cluster, and the Kathol sector during the early years of the New Republic. The gang participated in several questionable endeavors, such as bounty-hunting, smuggling, slavery, and mercenary work. The team consisted of four members—former Imperial Army soldier Thanis Gul-Rah, pilot Kolig, armored bounty hunter Padak, and the murderer Sufar. The modified YT-1300 light freighter Steel Fist, owned and operated by Kolig, was used as the group's transport and headquarters. Their symbol was a clenched fist with spikes on the knuckles, emblazoned with the Aurebesh symbol for Qek."}, {"tag": "p", "text": "When Sufar joined Qulok's Fist, he was on the run from Imperial bounty hunters who were tracking him after he had been exiled from his homeworld. The gang rescued him, then proceeded to assist Sufar in tracking down his assailants. Sufar then tortured the bounty hunters to death."}, {"tag": "p", "text": "Around 7 ABY, Qulok's Fist was engaged in a hunt on a backwater planet. The hunt took a turn for the worse, ending in a massacre at one of the world's settlements. Feeling guilty for his part in the slaughter, Thanis Gul-Rah left the group and retired to Kal'Shebbol, the capital of the Kathol sector. The rest of Qulok's Fist continued their activities, and, in 8 ABY, they found a new benefactor in the shape of Moff Kentor Sarne, the Imperial warlord who ruled the Kathol sector in the wake of the fragmentation of the Empire. Following the liberation of Kal'Shebbol in 8 ABY by New Republic forces, Sarne was forced to flee his capital. Learning that the New Republic had sent the CR90 corvette FarStar after him, Sarne contracted Qulok's Fist to tail the ship and gather intelligence on their movements and goals for him. Sarne also gave them license to sabotage the ship's efforts if the opportunity arose."}, {"tag": "h3", "text": "Showdown at Shintel"}, {"tag": "p", "text": "Several weeks into the FarStar's mission, Sarne contacted Qulok's Fist and contracted them to stage an assault on the corvette in orbit of the planet Shintel. Sarne had arranged for a deep cover agent on the planet Gandle Ott, Colonel Olaver Lansel, to feed false information to the FarStar's crew that indicated that Sarne himself had traveled to Shintel. The FarStar journeyed to the Shintel system and discovered that it was home to an outpost affiliated with the Moff, although one he had abandoned by destroying all hyperspace-capable ships and stranding the base personnel. Captain Kaiya Adrimetrum, commanding officer of the FarStar, agreed to an alliance with the base commander, Colonel Heget. In return for navigational data and information, Adrimetrum would provide Heget with transport to the Tanquilla Beach shadowport so that he could contact Imperial authorities."}, {"tag": "p", "text": "However, one member of the base's personnel was another deep cover agent of Sarne's. Lieutenant Palme arranged for the navigational data to contain a trapdoor program when it was uploaded into the FarStar's computer systems. As the corvette broke orbit and engaged its hyperdrive, the trapdoor program triggered an overload in the FarStar's engines. The resulting explosion destroyed the hyperdrive, stranding the corvette. As planned, Qulok's Fist emerged from hyperspace in the Steel Fist, and conducted several attack runs on the ship. As the crew of the FarStar recovered from the initial sabotage and began to rally to the defense of the ship, Qulok's Fist broke off their attack and jumped to hyperspace."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Qulok's Fist initially comprised four members: Thanis Gul-Rah, Kolig, Padak, and Sufar. This group was reduced to three when Gul-Rah left the group in 7 ABY, retiring to Kal'Shebbol after a hunt on a backwater planet ended in a massacre of a local settlement. All four were experienced bounty hunters and possessed a myriad of other skills, including piloting, demolitions, computer slicing, poisoning, and unarmed combat techniques among them."}, {"tag": "p", "text": "Thanis Gul-Rah was a soldier with the Imperial Army before joining Qulok's Fist, and served in the occupation of Siluria III. After leaving Qulok's Fist, Gul-Rah signed onto the crew of the FarStar on Kal'Shebbol when they put out a general call for civilians with combat or technical skills to augment the regular New Republic naval crew. He found himself in the position of facing his former comrades during the engagement in the Shintel system."}, {"tag": "p", "text": "Kolig was the owner and operator of the modified YT-1300 light freighter Steel Fist, which served as the group's headquarters, transport, and main combat vessel. Dapper and presentable, Kolig was the unofficial leader of Qulok's Fist and often planned the operations they were contracted to perform. Padak was an armored bounty hunter who lived for the thrill of combat and relished every kill he made. Destructive and violent, he felt no remorse over the deaths he caused. Sufar was a murderer, exiled from his homeworld after killing several people. He was hunted by Imperial bounty hunters before joining Qulok's Fist, then used his membership in the organization to capture and torture his pursuers to death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Qulok's Fist appeared in The DarkStryder Campaign, a roleplaying game sourcebook published by West End Games. They were described in the Rogues Gallery of the book and were featured in the adventure Shintel Downtime. However, the organization and its members were given detailed backgrounds so that the Gamemaster could use them in original adventures if they wished."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}