{"url": "Quockran", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Gastropod sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Quockran"}, {"tag": "p", "text": "The Quockrans were a sentient species of slugs native to the planet Quockra-4. The species had a large, fat body that tapered to a tail. Their torso also had two arms, ending in stubby digits. The black-skinned Quockrans had no differentiated internal organs. During their evolution, their homeworld was a moist planet. Nevertheless, the climate changed, becoming dry and hot. This drove the Quockrans' society underground, apart from short forays to the surface. The Quockrans were a xenophobic species, desiring isolation from all other species. When the Minos Cluster was colonized late in the administration of the Galactic Republic, offworlders reached Quockra-4. The Quockrans responded to this violation of their isolation by manufacturing an entire society of droids to act as intermediaries with the offworlders. These droids traded with offworlders, largely keeping the existence of the Quockrans a secret."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Quockrans were a sentient species of giant slugs. Their bodies had a large, fat torso that tapered to a tail marked with large rolls of fat. Quockrans averaged between 1.4 and 1.7 meters in length, although some had the ability grow as long as two meters. The Quockrans had a significant paunch and large drooping breasts. They had two arms that ended in four stubby fingers. The slug-like creatures had black skin, with splotches and other growths running down their midline and tail, as well as down the top of their arms. They had no differentiated internal organs, which limited the injury a single wound could do to their bodies."}, {"tag": "p", "text": "Quockran heads appeared knobbly. Each Quockran had a nose high on its forehead, with its eyes below this, one on each side of its heads. Below its nose was a large mouth, filled with sharp teeth. Quockran chins were large and drooping."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Quockrans were a xenophobic species, avoiding contact with other species if at all possible. While they despised offworlders, this rarely manifested as violence toward them. They were indifferent to galactic affairs and refused to get involved in political causes such as the Rebellion. If a Quockran was forced to interact with other species, they were surly and uncooperative, preferring, simply, to be left alone."}, {"tag": "p", "text": "To facilitate their isolation, the Quockrans manufactured an entire society of droids to interact with offworlders in their homeworld's sole city. Composed of thousands of different designs, both Imperial models and other, more exotic styles, and numbering over ten million individual units, the droids appeared to manage all the affairs of Quockra-4. The automata followed a clearly delineated hierarchy: three-armed yellow repair droids were superior, giving out orders in their machine language; red worker models were in the middle; Imperial droids were at the bottom, functioning as translators for those of higher rank. With this system in place, the Quockrans were able to live far below ground, only emerging on the surface at night to loll about in the cooling desert sands."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Quockrans evolved on Quockra-4, the fourth planet in the Quockra system, located in the remote Minos Cluster of the southern Outer Rim Territories. The planet was originally moist, and the Quockrans lived on the surface. The climate changed, however, becoming a homogeneous desert, with several large salt flats. The surface temperature reached polar extremes, with soaring highs during the day and frigid temperatures at night. This drove the Quockrans deep underground, although they still occasionally emerged at night to enjoy the cooler, damper air."}, {"tag": "p", "text": "When the Minos Cluster was colonized, late in the administration of the Galactic Republic, the Quockrans created a droid society to interact with the newly arrived offworlders. The Quockrans used these droids as intermediaries for trading, and most inhabitants of the Minos Cluster were unaware the species existed. Any who were aware of the Quockrans' existence and who tried to interfere with their affairs quickly found themselves in trouble."}, {"tag": "p", "text": "Shortly after the Battle of Yavin, a researcher from the Core Worlds tried to discover the \"real natives of Quockra-4.\" To facilitate his research, he offered a reward of up to 3,000 to traders for information on the architects of the exotic droids on Quockra-4. This led to some adventurers exploring tunnels below the planet's surface, encountering numerous groups of droids along the way—who progressively ignored them, ordered them to leave, and finally attacked them—before discovering Quockrans. These Quockrans refused to communicate with the adventurers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Quockrans were created by Mark Rein-Hagen and Stewart Wieck for Galaxy Guide 6: Tramp Freighters, a roleplaying game sourcebook published by West End Games in 1990. This book, and its second edition, include an adventure seed in which players try to discover the Quockran species, although no canonical ending for this encounter is specified. This information was republished, albeit slightly condensed, in Alien Encounters in 1998. Alien Encounters changes their height from the two meters established in Galaxy Guide 6: Tramp Freighters to 1.4–1.7 meters."}, {"tag": "p", "text": "Alien Encounters also includes an illustration of a Quockran. The image used is a reworking of early concept art by Ralph McQuarrie of the character Jabba Desilijic Tiure, who appears in Star Wars: Episode VI Return of the Jedi, first released in 1983, and who has been identified as a member of the Hutt species. The concept art was published in The Art of Star Wars Episode VI: Return of the Jedi later that same year. A mirrored version of the same image by McQuarrie is included in Monsters and Aliens from George Lucas, a non-canonical work published in 1993, which collects concept designs created in various George Lucas projects. This book accompanies the image with a small blurb in the form of a personal advertisement. This identifies the species as a \"Ytha\" and requests a \"hard-shelled creature for friendship / possible relationship.\""}, {"tag": "p", "text": "In the West End Games roleplaying game, Quockrans are given statistics for players to use them as their own characters. Compared with the average Human, their perception attribute is slightly higher, while their technical skills are significantly higher. Their knowledge and dexterity scores are slightly lower than Humans, while their mechanical- and strength-based attributes are significantly lower. An exception is made to this low strength score when resisting damage, for which their score is significantly higher than the average Human."}, {"tag": "h2", "text": "Sources"}, {"tag": "h3", "text": "Non-canon sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}