{"url": "Quiyyen", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Anx", "Category:Diplomats", "Category:Galactic Republic individuals", "Category:Males"], "nodes": [{"tag": "h1", "text": "Quiyyen"}, {"tag": "p", "text": "Quiyyen was a male Anx ambassador of the Galactic Republic during the Clone Wars. In 20 BBY, Quiyyen was kidnapped by the Confederate General Grievous, who planned to use him as bait to lure several Jedi into a trap in a dug-out cave on the planet Vandos. To rescue the Anx Ambassador, a Jedi and clone trooper team, led by Jedi Master T'chooka D'oon, was dispatched to the planet. Despite being quickly overrun by Grievous's battle droid force, D'oon's Padawan, Flynn Kybo, nonetheless retrieved the captive Quiyyen from Grievous's possession. As D'oon's team made its way toward its LAAT/i gunship, Grievous killed D'oon, but his team, along with Quiyyen, fled the area aboard the gunship."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Anx, Quiyyen served as an ambassador for the Galactic Republic during the Clone Wars. In 20 BBY, Quiyyen was kidnapped by the Confederate General Grievous, a Kaleesh cyborg who was regarded as a threat to the Republic by the Jedi. Grievous himself took the captive Anx Ambassador to the Outer Rim planet Vandos, where he was confined in a dug-out cliff cave. There, the cyborg general plotted to use Quiyyen as bait to lure several Jedi into a trap in the cave. His plan worked, as a team of Jedi and clone troopers, led by Jedi Master T'chooka D'oon, was sent to Vandos to retrieve the captured Ambassador."}, {"tag": "p", "text": "Unknown to D'oon's team, Grievous had organized a battle droid force to help fight off any threat. When it entered the cave, D'oon's team was quickly overrun by Grievous's battle droids. During the firefight, D'oon's Padawan, Flynn Kybo, found Quiyyen and brought him to safety. With the Ambassador rescued, the two Jedi and clone troopers prepared to retreat to their LAAT/i gunship, which was hovering outside the cliff cave's entrance. To give his team and Quiyyen more time to enter the transport, D'oon attacked the approaching Grievous but was slain by the cyborg general. Although he killed D'oon, Grievous failed to stop the Jedi Master's companions, as their gunship—with Quiyyen aboard—departed from the area."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Quiyyen first appeared in the 2005 comic General Grievous 1. He was later briefly mentioned in The New Essential Chronology and in author Abel G. Peña's story Unknown Soldier: The Story of General Grievous. In 2008, Quiyyen received a short entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}