{"url": "Quork", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with elements from unlicensed sources", "Category:Mammalian sentient species", "Category:Quorks", "Category:Sentient species of Endor"], "nodes": [{"tag": "h1", "text": "Quork"}, {"tag": "p", "text": "The Quorks were a species of sentient, furry, horned humanoids found on the Forest Moon of Endor. They were burly creatures known more for brawn than brains. Nevertheless, they were apt warriors who employed wooden and stone weapons as well as domesticated devil beasts against their foes. The Quorks inhabited Quork City and were ruled by a king. They were sworn enemies of Endor's native Ewoks."}, {"tag": "p", "text": "Circa 3 ABY, the Quork King Marlox laid a trap for the Ewoks of Bright Tree Village, who came each year to harvest sacred wood to make hang gliders. The Quorks captured three Ewoks, and the King compelled two of them to construct a glider for him lest their friend be given to a devil beast to eat. However, the Ewoks escaped while the Quorks fought over who would be the first to use the completed flying machine. When Marlox pursued them in his new conveyance, he learned that it had been built to fall apart. The glider collapsed around him, and the Ewoks stole off with the sacred wood."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Quorks were stocky, sentient humanoids covered in shaggy, tangled fur. Their hair was brown all over except on the head, where a white mane framed the hairless, pale-colored face. The hands and feet were hairless as well. Their legs were short and their arms long in proportion to the body. They had four digits on every extremity, each sporting a hard nail. Members of the species stood around 1.5 meters tall on average and were heavily muscled. One Quork, for example, could carry a large bundle of wood one-handed."}, {"tag": "p", "text": "In the opinion of the Forest Moon of Endor's Ewoks, Quorks smelled foul and appeared unintelligent. Members of the species had large, wide-set nostrils, a wide mouth, and thick brow ridges—covered in scraggly black eyebrows—over the eyes. Their snaggle-teeth were large and sharp, and their two short, pointed, yellow or pink horns were on top of the head."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Quorks were quarrelsome beings concerned with personal status and power. By 3 ABY, Quorks on the Forest Moon of Endor had founded a settlement called Quork City, which was under the rule of a king. The city was located on a cliff in a canyon-shrouded valley near the grove where the Ewoks of Bright Tree Village gathered the sacred wood from which they built their hang gliders. In that population center, the Quorks constructed hive-shaped homes of stone with open doorways and windows. A few buildings had multiple stories, although most were no taller than ground level. The king ruled from a room where his yellow, stone throne was located. He was distinguished from other members of his species by his golden crown. Most members of the species were hunters and gatherers."}, {"tag": "p", "text": "Endor's Quorks lived at a relatively low level of technology. By 3 ABY, they had trained a devil beast to help capture prisoners. They constructed tools from stone and wood, including carts that rolled on wooden wheels, cloth that hung from doorways, and knotted ropes that could subdue a devil beast. The Quork king had glass containers of victuals and wax candles in his throne room. Fruits were among the items that made up the species' diet."}, {"tag": "p", "text": "The Quorks of Endor were adept at warfare. They understood the importance of ambushing an enemy and attacking with the element of surprise. Quork warriors signaled an imminent attack with drums made of skin stretched across a hollow base and beaten with cloth-wrapped sticks. The species' warriors attacked with spears, which were wielded in close combat and hurled at the enemy. These weapons were made from a wooden shaft attached by cord to a stone point. If the aim of a raid was to capture a living being, the Quorks tried to snag their target using rope lassos."}, {"tag": "p", "text": "Prisoners of war were marched on foot back to the Quorks' city. Ill treatment was commonplace, as the Ewok Wicket Warrick discovered when his cries of defiance were met by the butt of a spear. Once within the city confines, prisoners were locked away in a prison that, unlike most Quork buildings, had a wooden door and wooden bars on the windows. There, torture by means of food and water deprivation was an accepted practice."}, {"tag": "p", "text": "Endor's Quorks had sworn their enmity for Ewoks. In their eyes, Ewoks were simply another form of property to be taken at will. For their part, Ewoks held a dim view of the Quorks and considered them stupid and oafish. Nevertheless, the Quorks envied the Ewoks' advanced technology, especially their hang gliders, and coveted the expertise to build similar vehicles for themselves."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A group of Quorks on the Forest Moon of Endor came to be the sworn enemies of the moon's native Ewoks. By mid-3 ABY, the Quorks had established Quork City, a population center situated where the moon's forest gave way to mountains. A Quork named Marlox came to power as their king."}, {"tag": "p", "text": "From their base, the Quorks observed that a group of Ewoks traveled to the region on hang gliders and collected wood each year. Circa 3 ABY, however, the Quorks beat them to the grove and felled the forest first. A group of Quork warriors lay in wait for the Ewoks that would inevitably come. When a group of three did show up—Kneesaa a Jari Kintaka, Teebo, and Wicket W. Warrick—the Quorks sprang their ambush as the new arrivals investigated the desolate landscape. The Ewoks managed to escape on their gliders, but the Quorks unleashed a devil beast that engaged the airborne Ewoks and snatched Warrick from his glider. With Ewok and sacred wood in tow, the Quorks returned to their home."}, {"tag": "p", "text": "Back in Quork City, King Marlox ordered the prisoner to construct a glider from the sacred wood. The Ewok refused and was cast into a prison cell, where he would be denied food and water until he complied. When the other Ewoks showed up in the city and attacked, the prisoner escaped. Nevertheless, the Quorks managed to gather all three Ewoks and throw them together into the prison. King Marlox threatened to turn the devil beast loose on Kintaka unless the other two Ewoks made him the glider he desired, and they agreed."}, {"tag": "p", "text": "Some time later, Warrick announced that the glider had been completed, but that only the smartest of Quorks could fly it. The information sparked a tussle between the Quorks over the privilege of taking the craft out for its maiden voyage, and the male Ewoks escaped. The king tried to give chase in his new glider, but it disintegrated immediately. Enraged that he had been tricked, King Marlox ordered the release of the devil beast."}, {"tag": "p", "text": "The male Ewoks took to their gliders and diverted the creature away from their tethered friend. The Ewok Teebo swooped low and cut Kintaka's bonds, and Warrick took her aboard his glider. Still being chased by the devil beast, the Ewoks swooped close to Marlox's throne room and caused the pursuing creature to crash into the king's hut. The Ewoks escaped on their gliders with the sacred wood in tow."}, {"tag": "p", "text": "Later, Marlox and his Quorks captured Kneesaa a Jari Kintaka while she was away from her village collecting sacred rocks. The Quork King placed the Princess in a cell to hold her as a bargaining chip in negotiations with her father, Chief Chirpa of the Ewoks. Meanwhile, the Ewok Chief dispatched Wicket W. Warrick to find his missing daughter. Warrick infiltrated Quork City, where he overheard Marlox's plans to use Kintaka for ransom—Warrick speculated that the Quork King would try to trade her for the Ewoks' invisibility soap. The Quork guards soon found themselves under attack as Warrick burst into the jail and freed his fellow Ewok. Marlox himself was prevented from stopping the Ewoks after Warrick threw sand in his face. The Quorks could only watch impotently as the Ewoks jumped off a nearby cliff and flew to safety on their hang gliders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Quorks feature as the major villains of the comic book Ewoks 3, written by David Manak and illustrated by Warren Kremer. The story was originally published in September 1985. The Quorks also feature in \"The Princess in a Predicament,\" a Spanish story that was published in 1986 under the MyComyc label. In the decades that followed their initial publication, the MyComyc strips were mostly forgotten, and were only rediscovered in 2013. Randy Stradley, Vice President of Publishing for Dark Horse Comics, expressed interest in including the MyComyc strips in a future Star Wars Omnibus publication, but Lucasfilm Ltd. found no formal proof that those titles were actually licensed, despite the presence of appropriate copyright information. Because of that uncertainty over licensing, \"The Princess in a Predicament\" and the events it relates are considered of ambiguous canonicity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}