{"url": "Axela_Zin", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Humans", "Category:Lost Tribe of Sith strike team", "Category:Sith Sabers"], "nodes": [{"tag": "h1", "text": "Axela Zin"}, {"tag": "p", "text": "Axela Zin was a female Human from the remote planet of Kesh and a Sith Saber in the Lost Tribe of Sith. She gave birth to one son, who had become a Sith Tyro by 43 ABY. Zin was a member of the strike team handpicked by Grand Lord Darish Vol and Lady Olaris Rhea to search for Ship, a Sith Meditation Sphere, and hunt down Jedi Grand Master Luke Skywalker. She was part of the search party who looked for Ship on the planet to which the Sith tracked the Meditation Sphere, but she was killed when vines on the jungle world attacked her."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Axela Zin was a female Force-sensitive Human from the remote Wild Space world of Kesh. She was trained in the ways of the dark side of the Force with the Lost Tribe of Sith, a group of Sith who had been stranded on Kesh during the days of the Sith Empire. Zin completed her training with the Tribe and rose to the rank of Sith Saber. She also gave birth to a boy, who became a Sith Tyro by 43 ABY."}, {"tag": "p", "text": "In 41 ABY, Ship, a Sith Meditation Sphere, arrived on Kesh and began to assist the Tribe in the creation of a new Sith armada. Two years later in 43 ABY, shortly after Jedi Grand Master Luke Skywalker's presence was felt by the Tribe, Ship abruptly left Kesh to follow a call in the Force. Zin was chosen by Grand Lord Darish Vol and Lady Olaris Rhea to be a member of the strike team whose task it was to track Ship and hunt down Skywalker. Zin traveled with the strike team in the warship Eternal Crusader, and they followed Ship to a planet in the Maw. Once there, Zin was chosen to be a part of the search party to go planetside, while the Eternal Crusader remained in orbit under the command of Sith Saber Baad Walusari. As the search for Ship began, Zin was almost instantly impaled by three thorned boughs. Zin freed herself with her lightsaber, but was quickly ensnared by more vines and killed. She died without making a sound of pain, however, and the expedition's commanders, Lady Rhea and Sith Master Yuvar Xal, decided to commend her son for her bravery."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Axela Zin was exceptionally brave, as illustrated when she heeded Rhea's orders and remained calm and silent even as she was killed by the trees. Zin was commended for her honorable death, and Rhea decided that her son, at the time a Sith Tyro, would be given a Master upon their return to Kesh."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Zin was a Force-sensitive, trained in isolation on Kesh in the ways of the Sith. By 43 ABY, she had completed her training in the dark side and was granted the rank of Sith Saber. Zin was also known to be strong-willed, as this was one of the criteria for being chosen as a member of the Sith strike team sent after Ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Axela Zin was created by established Star Wars author Troy Denning for Fate of the Jedi: Abyss, the third installment in the nine-novel Fate of the Jedi series, released on August 18, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}