{"url": "R-3X", "categories": ["Category:Canon articles", "Category:Droid stubs", "Category:Batuu residents", "Category:Masculine programming", "Category:RX-Series pilot droids", "Category:Star Tours personnel"], "nodes": [{"tag": "h1", "text": "R-3X"}, {"tag": "p", "text": "R-3X, also known as Rex, and formerly known as RX-24, was an RX-Series pilot droid who flew a Star Commuter 2000 from Lothal to Garel five years before the Battle of Yavin. The shuttle was used by the rebels from Lothal in their mission to steal arms from the Galactic Empire. While RX-24 was not necessarily a stickler for the rule that droids could only stand behind the passenger area, he had the authority to enforce it and would do so if there was a complaint. The droid later went on to work for Star Tours, where he piloted a Starspeeder 3000. At some point while working for Star Tours, Rex accidentally brought his StarSpeeder into a battle between the Imperial Navy and the Rebel Alliance. Though no one was hurt, the accident resulted in him being fired from the company. In the time after, Rex became a cargo pilot for the Alliance and claimed to have been present during the Battle of Jakku."}, {"tag": "p", "text": "At some point, Rex crash landed on Batuu, where he was reprogrammed into a DJ by Mubo at the Droid Depot, and his appearance was slightly altered. Thereafter, Mubo gave the droid to Oga Garra to pay off a debt, and \"DJ Rex\" started providing the musical entertainment inside Oga's Cantina."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "RX-24 was originally a character (nicknamed Captain \"Rex\") from Star Tours, a simulator ride at several Disney Parks worldwide (first opened at Disneyland in 1987), where he was voiced by Paul Reubens, who reprised the role in the Star Wars Rebels episode \"Droids in Distress.\" Reubens voiced the droid again for his appearance in Star Wars: Galaxy's Edge at Disneyland and Disney's Hollywood Studios, where RX-24 is a DJ at Oga's Cantina and now goes by the name R-3X."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}