{"url": "R-1_recon_droid", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Arakyd Industries products", "Category:Fourth-degree probe droid models"], "nodes": [{"tag": "h1", "text": "R-1 recon droid"}, {"tag": "p", "text": "The R-1 recon droid was a standard-issue reconnaissance droid used by Galactic Empire during the Galactic Civil War. It was built by Arakyd Industries and was based on design of the DRK-1 Dark Eye probe droid, originally created by the Sith. The R-1 was popular with snipers, planetary garrisons and shock troops. Some of them had also found a way into the hands of smugglers, bounty hunters, and other independent operations."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A small floating droid, the Arakyd Industries R-1 recon droid lacked any tools or hands, but could move through the openings that most of its potential targets could not. It could easily track possible targets, and its internal blaster allowed it to kill a target if need be. The recon droid could be used to scout areas without risking a living observer, spot targets for snipers or starship Orbital bombardment, seek out wanted criminals, or follow suspected individuals."}, {"tag": "p", "text": "The R-1 recon droid was equipped with an internal orbital strike beacon with a high-power transmitter, although the range was limited to one planet. Once active, friendly starships in orbit could lock onto the beacon's position and deliver a devastating, high-precision orbital strike. While not specifically intended as a self-destruct mechanism, per se, by using the beacon the droid was essentially calling in an orbital strike against its location, which it typically did not survive."}, {"tag": "p", "text": "The droid's sensors were red and had a black outer plating. It was a fourth-degree droid and cost 16,000 credits. It was based on a Sith probe droid design."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Arakyd manufactured the R-1 droids for use by the time of the Clone Wars. They were used by clone snipers for scouting and target acquisition in a number of battlefronts. During the post-Clone Wars rise of the Galactic Empire, recon droids also saw use with planetary garrisons and independent operators such as bounty hunters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the 2004 video game Star Wars: Battlefront, clone sharpshooters, droid snipers, scout troopers, and Rebel marksmen all carry recon droids to the battlefield. Although all the recon droids are identical to each other, the Star Wars Battlefront: Prima Official Game Guide classifies them as different models. The clone sharpshooters' recon droids are called the R-1 recon droids, the droid snipers have Mark IV recon droids, and the Rebel marksmen and scout troopers both use R-4 recon droids. To date, the R-1 and Mark IV Mark IV are the only variants that has been mentioned in another source, The Force Unleashed Campaign Guide, as the game itself does not give any model designation. By Star Wars: Battlefront II, however, all the recon droids became identified in the game guide as Mark IV and the orbital beacon had been replaced with a self-destruct mechanism."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}