{"url": "Axe_Woves", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Humans", "Category:Males", "Category:Mandalorian resistance members"], "nodes": [{"tag": "h1", "text": "Axe Woves"}, {"tag": "p", "text": "Axe Woves was a human male Mandalorian who served with the Mandalorian resistance during the New Republic's reign. Around 9 ABY, Woves was on the moon of Trask alongside resistance fighters Lady Bo-Katan Kryze and Koska Reeves, where they rescued another Mandalorian named Din Djarin from a group of Quarren. Djarin was initially put off by their removal of their helmets, but soon joined forces with Woves and his comrades after they rescued him a second time."}, {"tag": "p", "text": "Woves, Kryze, and Reeves collaborated with Djarin to board an Imperial Gozanti-class cruiser, with Woves opening the door for the group. After killing numerous stormtroopers, the four Mandalorians reached the cargo bay area, where they vented out a number of their enemies and then inspected the cargo. As they rushed for the bridge, the Mandalorians were pinned down and Woves doubted that they would be able to make it past a squad of stormtroopers. With Djarin's help, they successfully captured the bridge, then Djarin parted ways with the trio."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rescuing Din Djarin"}, {"tag": "p", "text": "During the reign of the New Republic, Axe Woves operated with the Mandalorian resistance, a collective of Mandalorians led by Lady Bo-Katan Kryze who wished to regain control of the planet Mandalore. Around 9 ABY, Woves, Kryze, and fellow Mandalorian Koska Reeves targeted transports flying for a remnant of the Galactic Empire led by Moff Gideon in hopes of seizing weapons and also locating Gideon to retake the darksaber. The Imperials chose to run life-form scans to prevent the Mandalorians from stowing away on their starships. The three eventually were present on the estuary moon Trask, where an Imperial Gozanti-class cruiser was purchasing weapons at a local black market port."}, {"tag": "p", "text": "The presence of Woves and his comrades on Trask caught the attention of Din Djarin, a Mandalorian bounty hunter who was seeking out others of his kind. When Djarin arrived at the port on Trask, he was quickly spotted by Reeves. A Quarren boatman and his brothers took the bounty hunter aboard their boat and tried to kill him for his beskar armor. That was when Kryze, Woves and Reeves came to Djarin's rescue, ambushing the Quarren boatmen. Woves took on multiple Quarrens in hand-to-hand combat before Kryze and Reeves pulled the remaining two to the floor with their grappling lines, Woves shooting both after. Kryze pulled Djarin out of a mamacore pen, Reeves rescued the bounty hunter's foundling, Grogu, from the mamacore."}, {"tag": "p", "text": "After Djarin thanked the three Mandalorians for his and Grogu's rescue and began explaining his mission, the trio removed their helmets. Djarin accused them of being fake Mandalorians for not covering their faces, to which Woves and Kryze identified him as part of the Children of the Watch, a cult of Mandalorians which followed an ancient version of the Way of the Mandalore. Djarin denied this claim, insisting that there is only one true \"way\" before flying off with Grogu. Woves, Kryze, and Reeves then proceeded to destroy the ship before flying off."}, {"tag": "h3", "text": "Collaboration"}, {"tag": "p", "text": "That night, Djarin was confronted by some Quarren led by the brother of the one that had tricked him before. Woves, Kryze, and Reeves arrived to aid their fellow Mandalorian and gunned down the Quarren. Djarin joined the trio at a nearby inn, where Kryze and the bounty hunter exchanged on their intentions while Woves, Reeves, and Grogu listened. Djarin agreed to help the three Mandalorians on their mission in exchange for information from Kryze."}, {"tag": "p", "text": "Later, Woves and the other Mandalorians sat atop Djarin's gunship, the Razor Crest, watching the Imperial Gozanti-class cruiser from afar. Kryze explained to Djarin their plan to seize weapons from the cruiser. When the Mandalorian bounty hunter asked about stormtroopers aboard the Gozanti cruiser, Kryze claimed there was a squad at most, and Woves remarked that the troopers could not hit the side of a bantha."}, {"tag": "h3", "text": "Hijacking above Trask"}, {"tag": "p", "text": "Woves, Kryze, Reeves, and Djarin begun their attack and jetpacked up to the Imperial Gozanti-class cruiser as it took off at dawn. Woves landed onto an outside walkway, knocking a stormtrooper off of the ship while his comrades dealt with more nearby. He then used a data probe to open a door to the inside of the cruiser, the Mandalorians entering the vessel. More stormtroopers engaged Woves and his allies, but the group gunned down the troopers, taking cover on intervals. The Mandalorians continued to kill more Imperial defenders, eliminating one squad under the cover of a gas bomb used by Djarin. The group soon arrived at the cargo bay and engaged a force of stormtroopers led by an Imperial deck officer, killing a number of his men."}, {"tag": "p", "text": "After being locked in the cargo control room, the group vented the cargo bay which ejected the deck officer and all of his troopers out of the ship. Woves and Reeves then inspected the cargo, while Kryze then exchanged with the Gozanti-class cruiser's captain over comms, promising to capture the vessel. While the Mandalorains departed for the bridge, the captain was instructed by Gideon to destroy the ship and forced the vessel into a nose dive towards Trask's ocean. The Mandalorians were shaken by the sudden ship in the Gozanti cruiser's course and made for the bridge, being met by another squad of stormtroopers."}, {"tag": "p", "text": "As the four took cover, Kryze asked of the number of enemies, for which Woves peaked around the corner and estimated six to ten stormtroopers including two with heavy repeating blasters. He further shut down Kryze's suggestion of advancing, claiming the enemy had too much firepower and fearing the group would not reach the bridge in time. Djarin, though, asked for the other three to cover him, and Woves and the other two fired at the troopers the bounty hunter advanced under heavy fire. Djarin obliterating the squad with some detonators, and the Mandalorians made for the bridge, with Woves staying behind to cover their flank. The other three liberated the bridge and stopped the Gozanti-cruiser from crashing into Trask. Djarin then parted ways with them to complete his own mission and Reeves prepared to jump to hyperspace."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Axe Woves was a human male with light skin, broad shoulders, black hair, and brown eyes. Serving as the muscle of Bo-Katan's covert on Trask, Axe was the only male in the group. He also frequently observed the conversations between Bo-Katan Kryze and Din Djarin with a neutral expression. After hearing Djarin accuse him and his comrades of not being Mandalorians, Woves remarked that the bounty hunter was \"one of them,\" referring to the Children of the Watch. When Djarin and Kryze discussed stormtrooper numbers on the Imperial Gozanti-class cruiser, Woves joked that the troopers could not hit the side of a Bantha. As the Mandalorians were pinned down near the bridge by stormtroopers, he stressed that the troopers had too much fire power to advance on and that they would not be able to reach the bridge in time to stop the Gozanti cruiser's descent towards Trask."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Axe Woves was able to take on multiple enemies in hand-to-hand combat as well as gun down some of adversaries swiftly."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Woves wore a set of Mandalorian armor which had a blue and dark grey color scheme. His underclothing was a lighter grey color, with black gloves and a brown, silver buckled belt with compartments. Woves was equipped with a blue JT-12 jetpack and blue Mandalorian vambraces that could extend a data probe and fire blaster shots. He also wielded a WESTAR-35 blaster pistol which he kept in a holster. His Mandalorian helmet was blue and brown with a grey stripe encircling the upper hemisphere and a rangefinder extending from his right."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Casting"}, {"tag": "p", "text": "Axe Woves first appeared in \"Chapter 11: The Heiress\" of Jon Favreau's Disney+ series The Mandalorian, which was directed by Bryce Dallas Howard and released on November 13, 2020. He was portrayed by British actor Simon Kassianides, with Kofi Yiadom serving as the stunt double."}, {"tag": "p", "text": "According to Kassianides on Instagram, he auditioned for the role of Axe Woves on November 13, 2019, exactly a year prior to the release of \"Chapter 11: The Heiress.\" He also claimed that, according to Favreau and executive producer Dave Filoni, his name was created by George Lucas, the creator of the Star Wars franchise, one day when he visited the set of the show. Kassianides was apparently unaware of his role until days after being chosen for it, when he was revealed his Mandalorian helmet, which he stated gave him tears as he had been a fan of the character Boba Fett. Wove's costume was designed by costume designer Shawna Trpcic."}, {"tag": "h3", "text": "Performance"}, {"tag": "p", "text": "Kassianides told Preeya Kalidas on BBC Asian Network that despite using an American accent during his audition, he was allowed to use his own English accent, which he attempted to make more South London like, as he grew up in that area. During filming for the cargo bay battle, he was apparently was overwhelmed during the first shoot when he studied the details around him like the costumes, elevator buttons and stormtroopers. Kassianides claimed that he froze because of this, asking his colleagues to give him a moment to take in the experience."}, {"tag": "p", "text": "When filming the action scenes aboard the Gozanti-class cruiser, second unit director Sam Hargrave wanted Reeves and the other Mandalorians to adopt shoot-and-hide tactics similar to classic Star Wars gunfights. Favreau wanted Woves, Kryze, and Reeves to work in as their own group separate to Djarin to differentiate the three from the fourth member of the team."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}