{"url": "R%27ora_stronghold", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Settlements", "Category:Unidentified cities"], "nodes": [{"tag": "h1", "text": "R'ora stronghold"}, {"tag": "p", "text": "A rock-island stronghold was located on the planet Luprora and occupied by the R'ora, a native species of the planet. It was in close proximity to the last remaining village of the emigrated Lupr'or species."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The R'ora stronghold was located on an island near the humanoid Lupr'or village. It was a rocky island with high cliffs that served as walls. The island was surrounded by several Tsw'ells, tentacled monsters of great size and strength. The inside of these cliffs were ringed with wooden pikes latched with ropes. A tall tower lay at the center of the R'ora stronghold."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The R'ora stronghold was the home of a community of R'ora who had migrated from the sea onto Luprora's rocky and inundated landmass due to rising sea levels. After the First Order lieutenant Sol Rivas was taken by the R'ora into their stronghold, the Lupr'or leader Jair'i assigned the Lupr'or guide Dar'en to show Captain Phasma and TN-3465 the stronghold in an attempt to convince them of the futility of rescuing their \"friend.\""}, {"tag": "p", "text": "Using generators salvaged from a Lupr'or starship, Captain Phasma and the R'ora electrocuted the Tsw'ells in the lake. This allowed Phasma, TN-3465, and the Lupr'or to row across the lake unhindered. After climbing the cliff, Phasma, TN-3465 and their Lupr'or allies attacked the Lupr'or. While the Lupro'or fought the R'ora, Phasma took the opportunity to kill Rivas in order conceal her role in the destruction of Starkiller Base."}, {"tag": "p", "text": "Phasma and TN-3465 then left, abandoning the Lupr'or to the R'ora and the rising sea. Phasma rationalized her abandonment of the Lupr'or on the grounds that they were a colonizing species who were unsuitable to the planet's evolution. She believed that the aquatic R'ora would triumph over the Lupr'or."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The R'ora stronghold first appeared as a plot setting in Star Wars: Captain Phasma, a 2017 four-issue comic published by Marvel Comics as part of the Journey to Star Wars: The Last Jedi promotional material. The stronghold was created by Kelly Thompson, illustrated by Marco Checchetto, and colored by Andres Mossa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}