{"url": "Qwohog_(species)", "categories": ["Category:Legends articles", "Category:Amphibian sentient species", "Category:Aquatic sentient species", "Category:Mid Rim species", "Category:Qwohog"], "nodes": [{"tag": "h1", "text": "Qwohog  (species)"}, {"tag": "p", "text": "The Qwohog were amphibious humanoid sapients indigenous to Hirsi, a planet mostly covered in freshwater lakes and seas. They remained isolated from the rest of the galaxy until they were swept up in the Galactic Civil War, when they aligned themselves with the Alliance to Restore the Republic. Small-boned, agile, and delicate in appearance, they were sometimes called Wavedancers for their graceful movement through the freshwater oceans and lakes of their homeworld."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Qwohog had smooth iridescent skin, blue to green in color. They had no hair, though they did have raised silvery-blue scales on their heads, wrists, waists, and ankles which could be mistaken for hair at a distance. Their faces had no visible noses, long, pointed ears, and round, black eyes. Though they were delicate in appearance, Qwohog were quite strong for their size."}, {"tag": "p", "text": "Qwohog were completely amphibious, with their lungs connected to their mouth and to gill slits under their arms. They easily adapted to a variety of freshwater environments, though saltwater damaged their lungs and gills. They therefore required protective suits to swim in the saline oceans found on most other habitable planets."}, {"tag": "p", "text": "The Wavedancers had a spoken language, Qwohog, but since their voices were adapted for underwater communication, their voices only carried 4 meters in air. They used Qwohog sign language instead to communicate on the surface. After making contact with offworlders, they began to use the vocalizer masks developed by the Anomids as well."}, {"tag": "h2", "text": "Society"}, {"tag": "p", "text": "The Wavedancers never developed sophisticated technology on their own before their first contact with offworlders. Qwohog communities farmed various water plants, gathered floating basin-pods, and hunted skitterflies and fish. Qwohog hunting parties also went ashore to search for lizards and small mammals, which they considered delicacies. Most Qwohog wore simple clothing made from tenidit plants, with male leaders often decorating their ears with seashells."}, {"tag": "p", "text": "Qwohog were hard workers who were equally eager to seek pleasure and quick to make friends. If wronged or threatened, however, they would fiercely defend themselves or their homes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Scouts from the Rebel Alliance discovered them while exploring Hirsi for valuable rudic crystal deposits. The Rebels quickly befriended the Qwohog, and soon started trading with them. Unfortunately for the Qwohog, the Galactic Empire was not far behind. The Imperial occupation of Hirsi was brief, but brutal—the Rebel scout team was killed, the crystal mining continued without regard for the natural environment, and several Qwohog were taken prisoner."}, {"tag": "p", "text": "When the Imperial occupation ended, a second Rebel team arrived on Hirsi. The Qwohog leaders asked the Rebels to establish a permanent base to protect their homeworld, and renewed their relationship with the Alliance. They began trading rudic crystals, food, cloth, and medicines made from the local shellfish, which were particularly effective against burns."}, {"tag": "p", "text": "Thousands of Qwohog also left on Alliance ships at this time, either to serve in the Galactic Civil War or to set up colonies to ensure the survival of their species in case the Empire returned to Hirsi. Qwohog colonists and those serving with the Rebellion quickly learned galactic-level technology and the Basic language. Many Qwohog became scouts, technicians, medics, or pilots for the Alliance, and later, for the New Republic. Though their homeworld was destroyed by the reborn Palpatine's Galaxy Gun, offworld Qwohog endured, and by the time of the Yuuzhan Vong War, their prosperous colonies were found throughout the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Galaxy Guide 12 and other West End Games supplements imply that the second contact of the Rebel Alliance with the Qwohog occurred fairly early in the Galactic Civil War, with the Imperial occupation of Hirsi being brief. Wizards of the Coast's Ultimate Alien Anthology, however, describes a protracted occupation which lasts until the Battle of Endor—though the Qwohog are described as joining the Rebel Alliance rather than their successors the Alliance of Free Planets or the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}