{"url": "R0/5T.N1_tree_feeder", "categories": ["Category:Legends articles", "Category:Agricultural droid models", "Category:Publictechnic products"], "nodes": [{"tag": "h1", "text": "R0/5T.N1 tree feeder"}, {"tag": "p", "text": "The RO/5T.N1 tree feeder was a gardening droid manufactured by Publictechnic. The droid was commonly referred to as the 5T tree feeder or even just a tree feeder."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The 5T moved on six limbs with spades toward the bases of each leg, with the limbs connected to a dorsal support rod. Packed with retractable items like trimmers and saws for normal upkeep of expansive gardens, the droid was regarded as one of the most competent gardening droids on the market. Much of the \"abdomen\" contained a large water tank. It also wielded pH probes, hoses, and two large, fine-tuned and accurate manipulator arms. The photoreceptors located on the 5T's head could move 360 degrees."}, {"tag": "h3", "text": "Programming"}, {"tag": "p", "text": "5Ts normally didn't concern themselves with what occurred outside an assigned patch of land. However, if someone walked on freshly clipped grass or picked a flower inside a 5T's work area, the droid had a tendency to become annoyed and would go back and carefully correct what had been mussed. RO/5T.N1s were very protective of their charges; if a single flower was looking ill, a 5T would drop its current action to tend for it, through watering or even by performing complex pollination programs to revitalize the plant."}, {"tag": "p", "text": "5Ts were used mostly in fertile worlds like Kuat and the Plawal Rift on Belsavis."}, {"tag": "p", "text": "The 5T was often complemented by the much larger CD-2 Harvester and the HD-234-C \"Berry Picker\" produced by the Corporate Sector Authority."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The model number RO/5T.N1 is a reference to editor Sue Rostoni, who is also a gardener."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}