{"url": "R1-J5", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Alliance to Restore the Republic droids", "Category:Colossus resistance members", "Category:Masculine programming", "Category:Members of Team Fireball", "Category:R-series droids"], "nodes": [{"tag": "h1", "text": "R1-J5"}, {"tag": "p", "text": "R1-J5, commonly known as \"Bucket,\" was an R-series astromech droid owned by Jarek Yeager, the leader of Team Fireball, a racing team headquartered on the Colossus refueling platform."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "R1-J5 served the former New Republic starfighter pilot–turned–mechanic Jarek Yeager for several years. During Yeager's racing days, Bucket served as his copilot on his racer. Yeager ended his racing career after his younger brother Marcus Speedstar caused the deaths of Yeager's wife and daughter during a racing accident. By 34 ABY, Bucket was part of Yeager's Team Fireball, a group of mechanics and pilots who operated from Yeager's repair shop on the Colossus platform on the planet Castilon. Bucket's colleagues were the mechanics Tamara Ryvora, a female human pilot, and the Nikto Neeku Vozo."}, {"tag": "h3", "text": "Enter Kazuda Xiono"}, {"tag": "p", "text": "In 34 ABY, the Resistance pilot Poe Dameron convinced Yeager, his old friend, to take the Resistance spy Kazuda Xiono as his mechanic. Xiono had been tasked with finding out who on the Colossus platform was helping the First Order to build their military. Xiono was also accompanied by the BB astromech droid BB-8, who had been sent by Dameron to keep an eye on Xiono. After Xiono accidentally volunteered to compete in a race against Ace Squadron pilot Torra Doza, Yeager summoned Bucket when the crew began work on refurbishing the aging racer Fireball for the race. Taking a dislike to the newcomer, Bucket slammed into Xiono, prompting the latter to call him a \"bucket of bolts.\" When Doza came to visit her competitor, she patted Bucket."}, {"tag": "p", "text": "While Xiono continued working undercover as a mechanic, the spy's lack of experience as a mechanic rankled both Bucket and Ryvora. On one occasion, Xiono accidentally pressed a dashboard, causing everyone to hear a loud, screeching sound. During the pirate Kragan Gorr's raid on the Colossus, Bucket and the other members of Team Fireball with the exception of Xiono took shelter. They returned after Xiono managed to jam the pirates' communications, forcing them to retreat."}, {"tag": "h3", "text": "Rucklin's heist"}, {"tag": "p", "text": "Bucket was later present when Xiono unsuccessfully demonstrated an engine he had been working on. When Yeager scolded Xiono for the slow progress of his repair work, Bucket and Ryvora giggled that Xiono was in trouble. Bucket also tried to obstruct Xiono's path, prompting the pilot to grumble that the droid was now on his case. When Xiono and the local racer Jace Rucklin snuck into Yeager's private hangar to view Yeager's racer, they hid from Bucket, who had entered the room to retrieve a macro-fuser. Unable to find the macro-fuser, Yeager decided to order a new one."}, {"tag": "p", "text": "While inside, Rucklin took the opportunity to steal a canister of hyperfuel for his own racer. Bucket later discovered that the hyperfuel canister was missing and alerted the other Fireballs that the volatile fuel was missing. Xiono realized that Rucklin had stolen the fuel and managed to save Rucklin at the cost of destroying his racer. Later, during a power outage, Xiono tripped over Bucket, who grumbled in Binary."}, {"tag": "h3", "text": "The \"salvaging run\""}, {"tag": "p", "text": "Under Yeager's direction, Bucket used his alarm to wake Xiono up at dawn for a \"salvaging mission.\" This \"mission\" turned out to be a training exercise that Dameron had organized for Xiono to fly his T-70 X-wing starfighter and to take a break from his undercover work. As a result, Xiono and Dameron responded to a pirate raid on a Darius G-class freighter in Sector Six."}, {"tag": "h3", "text": "The second pirate raid"}, {"tag": "p", "text": "While the other members of Team Fireball were fixing the Colossus' defensive tracking computer, Bucket wheeled past them in Yeager's repair shop. During the second pirate attack on the Colossus, Bucket and Vozo hid in the supply closet and managed to avoid arousing the Warbird gang's attention by remaining silent. Following the battle, Vozo recounted his and Bucket's exploits to a weary Yeager."}, {"tag": "h3", "text": "Yeager and the Platform Classic"}, {"tag": "p", "text": "Prior to the Platform Classic, Bucket got into an argument with BB-8. When Yeager decided to race against his estranged younger brother, Bucket served as Yeager's copilot and sat in the astromech socket of Yeager's racer. As a team, the two acquitted themselves well and took the lead in the race with Speedstar coming second place. Following a prolonged confrontation, Yeager decided to forgive Speedstar for causing the deaths of his wife and daughter and to allow Speedstar to win so that Speedstar could save his Nikto mechanic Oplock, who had been taken hostage by the Guavian Death Gang. By winning the race, Speedstar was able to pay his 20,000-credit debt to the Guavians and free his friend."}, {"tag": "h3", "text": "Mission to Station Theta Black"}, {"tag": "p", "text": "After Kaz borrowed the Fireball for a mission with Poe Dameron to Station Theta Black, Bucket entered Yeager's office and asked him about lending the Fireball to Kaz. Yeager claimed that he did not have much of a choice and that Tam would find out soon. Tam was upset that Yeager had allowed Kaz to borrow her ship and revealed that she had not finished installing a new stabilizer. Fortunately, Kaz was picked up by Poe and the two embarked on their mission to Station Theta Black."}, {"tag": "h3", "text": "A game of darts"}, {"tag": "p", "text": "Later, Bucket was present at Aunt Z's Tavern along with Kaz, Neeku, BB-8, Torra, Bolza Grool, and Al for a game of holodarts. Bucket was not impressed with Kaz's three shots which all missed the bull's eye. Bucket took off his helmet and collected Kaz's darts from the floor. To the surprise of Torra, Bucket volunteered for a round. To the surprise of everyone, Bucket's first two shots hit the bull's eye. However, his third holodart ricocheted off several objects before striking Kaz in the backside. An enraged Kaz chased Bucket."}, {"tag": "h3", "text": "The missing helmet"}, {"tag": "p", "text": "On one occasion, Bucket lost his helmet. While searching Yeager's repairs, he asked Kaz, who responded that he did not know where Bucket's helmet was. When Bucket remarked that he felt naked without his helmet, Kaz suggested retracing his steps through the Colossus. In the marketplace, several droids laughed at Bucket for losing his helmet."}, {"tag": "p", "text": "Visiting the Office of Acquisitions, Orka and Flix offered to sell Bucket a new helmet, which he accepted. When Bucket returned to Yeager's repairs, he found BB-8 sporting his missing helmet. Bucket was angry and slammed into BB-8, causing the helmet to fly off BB-8 and hit Kaz in the leg. Kaz told Bucket that he had found his helmet but Bucket hit Kaz in the leg."}, {"tag": "h3", "text": "The Bibo Incident"}, {"tag": "p", "text": "Bucket was present in Yeager's repair shop after Neeku adopted a new pet Bibo. After climbing on the Fireball, Bibo jumped onto Bucket, startling the droid and causing him to crash into several crates. In response, Yeager ordered Neeku to get rid of his pet. An upset Neeku left the repair shop after Bibo disappeared. Following the so-called \"Bibo incident\", Neeku returned Bibo to his mother, a large sea creature known as a rokkna."}, {"tag": "h3", "text": "BB-8's prank"}, {"tag": "p", "text": "Prior to the kidnapping of Torra Doza, BB-8 played a prank on Bucket by knocking on his door. This annoyed Bucket, who chased BB-8. Kaz, who was working on a speeder bike with Neeku, told the two droids to keep it down."}, {"tag": "h3", "text": "First Order occupation"}, {"tag": "p", "text": "Following the First Order's rescue of Torra Doza, her father Captain Imanuel Doza allowed the First Order to occupy the Colossus. Stormtroopers patrolled the platform and began identifying the platform's residents. When stormtroopers visited Yeager's shop, Bucket informed Yeager of the visitors' presence. The stormtroopers questioned them about the whereabouts of the pirate fugitive Synara San before leaving."}, {"tag": "p", "text": "Later, Bucket was electrocuted while wielding a landing strut. His hard cap was knocked off and BB-8 retrieved it and gave it back to Bucket. When the orphans Kel and Eila visited Yeager's repairs seeking Kaz's help, Bucket declined Neeku's invitation to accompany them and stayed at home."}, {"tag": "p", "text": "Later, Bucket and BB-8 found Xiono trying to transmit a message to the Resistance, which he was unable to do due to a communications blackout. Shortly later, Dameron visited Yeager's repairs and invited Xiono for a mission to the Dassal system. Bucket and the rest of Team Fireball were servicing a racer when Xiono returned with another BB-series droid named CB-23."}, {"tag": "p", "text": "Following Xiono's return from the Dassal system, Bucket and CB-23 helped Tam repair the Fireball, whose injection turbine and hull had sustained damage during a dogfight with First Order forces. Bucket was present when Kaz denied that he had been in a dogfight. Later Bucket was present when Commander Pyre and his stormtroopers raided Yeager's garage."}, {"tag": "h3", "text": "Joining the Colossus resistance"}, {"tag": "p", "text": "Commander Pyre charged Team Fireball with conspiring with the First Order since the Fireball had been spotted in Sector Epsilon 51-3. Before Pyre could take them into custody, Bucket under Yeager's orders unleashed white foam on the stormtroopers, allowing them to escape. During the escape, Pyre shot Bucket, causing him to fall off the platform."}, {"tag": "p", "text": "Though Yeager, Kaz, and Neeku believed that Bucket was lost, he was rescued by Kel, Eila, and the Chelidae, who resided in the engineering deck. Bucket reunited with his Team Fireball comrades except Tam, who had been captured by the stormtroopers. Bucket was repaired by Kel, Eila, and Chelidae. Yeager and Kaz then submerged the Colossus so that they could send a distress transmission to the Resistance. Though they managed to send the message, Yeager was captured. Bucket and the others then joined a resistance cell led by Xino."}, {"tag": "h3", "text": "Retaking the Colossus"}, {"tag": "p", "text": "Bucket, Neeku, Kel, Eila, CB-23 and the Chelidae were privy to Kaz's plan to rescue Yeager and escape the Colossus in order to bring reinforcements from Hosnian Prime. During the expulsion of First Order forces from the Colossus, Bucket stayed in the hyperdrive room with Neeku, Kel, and Eila. They helped to flush out First Order stormtroopers from the Colossus and later fired the Colossus' engines as the space station ascended into space. After the Colossus escaped into hyperspace, Bucket joined Kaz and the others in the hangar as they watched the station traveling through hyperspace."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "R1-J5 was an astromech droid with masculine programming. Though noted for his peculiar personality, a consequence of the droid's outmoded and defective programming, Bucket was a reliable mechanic and a loyal servant to his master. As an astromech droid, Bucket also spoke in Binary."}, {"tag": "p", "text": "Bucket took a dislike to the newcomer Kazuda Xiono, slamming into him on several occasions. On another occasion, Bucket took delight in waking Kaz with his alarm."}, {"tag": "p", "text": "Bucket was also hostile to the newer astromech droid BB-8 and expressed jealousy when BB-8 borrowed his helmet. Another time, BB-8 played a prank on Bucket. Despite their antagonistic relationship, BB-8 once retrieved Bucket's hard cap when the latter was electrocuted while wielding a landing strut."}, {"tag": "p", "text": "Bucket appeared to get along better with Xiono's new astromech droid CB-23. On one occasion, CB-23 handed Bucket a wrench while repairing the Fireball following Kaz's mission to the Dassal system."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Bucket was equipped with an alarm which he could use to wake others. Bucket also wore a helmet which he was deeply attached to. He felt naked without it and took offense when BB-8 borrowed it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R1-J5 is a character created and developed for Star Wars Resistance. Similar to Chopper in all Star Wars Rebels episodes before the series finale, Bucket is credited as being voiced by \"himself.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}