{"url": "R1-series_astromech_droid", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Astromech droid models", "Category:R-series models", "Category:R1-series astromech droids"], "nodes": [{"tag": "h1", "text": "R1-series astromech droid"}, {"tag": "p", "text": "The R1-series astromech droid, also known as the R1 reactor drone, was a model of R-series astromech droid manufactured by Industrial Automaton."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A part of the R-series of astromech droids manufactured by Industrial Automaton, the R1-series astromech droid, also known as the R1 reactor drone, was tall compared to later R-units, standing 1.94 meters in height. It moved slowly on a single foot and some, though not all, featured a long antenna atop their dome. R1 units had a single red photoreceptor and black, blue, or gray plating. They were so large that they could only be used on the biggest of starships. R1 units were the first droids to be able to communicate in droidspeak, though they were far less personable than later R-units. They were equipped with a pair of arms tipped with manipulators and a holoprojector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The R1 unit was one of the oldest astromech models in the galaxy."}, {"tag": "p", "text": "By the time of the Invasion of Naboo, the Toydarian junk dealer Watto owned an R1 astromech, which was behind the counter in his shop—situated in Mos Espa on the planet of Tatooine—when Jedi Master Qui-Gon Jinn, Padmé Amidala, and Gungan Jar Jar Binks entered the shop. Said unit worked as a shopkeeping drone, handling most of Watto's daily business operations."}, {"tag": "p", "text": "Over thirty years later, an R1 unit designated R1-G4 fell into the hands of a group of diminutive Jawa scavengers traveling in a sandcrawler on Tatooine. Those Jawas attempted to sell the astromech to the moisture farmer Owen Lars and his nephew Luke Skywalker. Lars, however, rejected the tall droid in favor of an R2 unit and a 3PO protocol droid—both of which were in fact Rebel Alliance droids trying to carry out a secret mission at the behest of Princess Leia Organa. Around the same time, two other R1 units were known to be present in the Tatooinian spaceport of Mos Eisley."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The R1-series astromech droid was originally created for the 1977 film Star Wars: Episode IV A New Hope. Set decorator Roger Christian designed the R1 unit that would later be identified as R1-G4 in homage to the art of illustrator Chris Foss, specifically a cover he had painted for a 1973 Panther Science Fiction reprint of Isaac Asimov's 1957 novel The Naked Sun. The R1-G4 costume would be used to depict another R1 unit in Mos Eisley and would become the basis for the R1-series astromech droid's appearance in most future sources. A second R1 costume with a distinct design was also used in the film, appearing in the background when Obi-Wan Kenobi and Luke Skywalker are stopped and questioned by stormtroopers in Mos Eisley."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}