{"url": "Axela_Zin%27s_son", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Humans", "Category:Sith in the Lost Tribe of Sith", "Category:Unidentified sons"], "nodes": [{"tag": "h1", "text": "Axela Zin's son"}, {"tag": "p", "text": "Axela Zin's son was a Tyro in the Sith Tribe from the planet Kesh. In 43.5 ABY, Axela Zin was selected as a member of the strike team sent to recover the Meditation Sphere Ship and kill the Jedi Luke Skywalker. During the mission, Zin died honorably, and Lady Olaris Rhea declared that her son would be given a Master upon the team's return. However, before they could return, the team was nearly eliminated, yielding only one surviving member."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male Force-sensitive was born on the remote planet Kesh sometime prior to 43 ABY. He was the son of the Sith Saber Axela Zin, and he had become a Sith Tyro in the planet's Lost Tribe of Sith within two years of the conclusion of the Second Galactic Civil War. In 43.5 ABY, the boy's mother was chosen to be a member of the strike team sent to recover the Sith Meditation Sphere Ship and eliminate the Jedi Grand Master Luke Skywalker."}, {"tag": "p", "text": "During the mission, Zin was killed on a planet in the Maw. The Sith Master Yuvar Xal noted to the mission's commander, Lady Olaris Rhea, that the Sith Saber had died quietly and honorably, and added that Zin's son was a Tyro. Rhea then ordered her apprentice, Vestara Khai, to record the Saber's name and add that her son would be commended upon the team's return to Kesh by having a Master assigned to train him. However, before they could return to the Tribe's homeworld, the strike team was defeated during the attack on Skywalker, yielding Khai as the sole Sith survivor."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The son of Sith Saber Axela Zin was a Force-sensitive born into Kesh's Sith Tribe. He was made a Tyro by 43.5 ABY, although Rhea planned to initiate his full training in the dark side of the Force by giving him a Master upon the strike team's return to Kesh."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Axela Zin's son was first mentioned briefly in Fate of the Jedi: Abyss, the third novel in the Fate of the Jedi series, written by Troy Denning and released August 19, 2009. The Tyro has yet to be mentioned in any other Star Wars material to date."}, {"tag": "p", "text": "In Abyss, Khai was present during Zin's death, and Rhea gave Khai the order to assign Zin's son a Master. Later in the novel, the entire strike team, excepting Khai, was killed during the attack on Skywalker. Subsequently, in the fourth and fifth Fate of the Jedi novels, Khai contacted and even met in person with other members of her Tribe, but the novels did not mention whether she ever relayed to the Tribe Rhea's order for Zin's son to be given a Master."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}