{"url": "R2-D2:_Beneath_the_Dome", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Documentaries", "Category:Internet video series", "Category:Parodies", "Category:Television films"], "nodes": [{"tag": "h1", "text": "R2-D2: Beneath the Dome"}, {"tag": "p", "text": "R2-D2: Beneath the Dome is a 2001 mockumentary that utilizes fake interviews, fake archive photos, film clips, and behind-the-scenes footage to tell the \"life story\" of the astromech droid R2-D2. The film was made by the cast and crew of Star Wars: Episode II Attack of the Clones based on an idea by Don Bies (ILM Modelmaker and head of the R2 production unit) and friends."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The film is narrated in a tongue-in-cheek style, giving the ups and downs of Artoo's life—from his humble upbringings in Bollux, England to his successful life as an actor. The mockumentary achieves this by using interviews by those who \"know\" him, such as George Lucas, Ewan McGregor, Francis Ford Coppola, Richard Dreyfuss, Samuel L. Jackson, Natalie Portman, Hayden Christensen, Steven Spielberg and others. We are introduced to his human \"family,\" complete with a brother and a sister (Artoo's birth name, \"Reginald Dillingham,\" was apparently changed for show business). It is revealed that the Star Wars films weren't his first acting roles, and that he had many leading parts in plays and movies both before and after the original trilogy; he was even Coppola's first choice to play Michael Corleone in The Godfather, and Spielberg's to play Indiana Jones."}, {"tag": "p", "text": "Artoo is shown to be quite the ladies' man, with plenty of bikini-clad women riding in his limo. After a successful career in movies and theater, a shortage of new work sends him into a deep depression. He goes so far down in this spiral, that in an attempt to prove his worthiness, he bungee jumps and is nearly killed when he forgets to use the cord. His career is then reinvigorated when asked by George Lucas to do Star Wars: Episode I The Phantom Menace. Finally, with his life and career back in an upswing, his human girlfriend reveals that she may be pregnant."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "A trailer for R2-D2: Beneath the Dome accompanied the US Thanksgiving broadcast of Star Wars Episode I: The Phantom Menace. It then aired, beginning on November 25, 2001, in three weekly installments on the US television channel FOX. The segments were released simultaneously on StarWars.com as three web featurettes. This trailer was later included as a special feature on the DVD release of Star Wars: Episode II Attack of the Clones."}, {"tag": "p", "text": "The film was released on DVD in Region 1 on December 26, 2002. It contained all three segments that were originally aired on US TV and released on StarWars.com, plus the ending credits and an easter egg of photos of R2-D2 on the sets of the Star Wars films. The DVD was made available exclusively at Best Buy and Musicland stores, which includes SunCoast Motion Picture Company, MediaPlay and Sam Goody outlets."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Noters and references"}, {"tag": "h2", "text": "External links"}]}