{"url": "R2-Q5/Legends", "categories": ["Category:Legends articles", "Category:Galactic Empire science and engineering personnel", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:R2-series astromech droids"], "nodes": [{"tag": "h1", "text": "R2-Q5"}, {"tag": "p", "text": "R2-Q5 was an R2-series astromech droid produced by Industrial Automaton and working for the Galactic Empire. R2-Q5 had black coverings highlighted by bronze access panels, and was a well-equipped droid with tools for repairing starships and special, hidden spy devices. The droid also possessed a hidden blaster cannon under one of its dome flaps."}, {"tag": "p", "text": "R2-Q5 was charged with storing the Emperor's plans against the Rebel Alliance within its memory bank as well as being personally responsible for programming hyperspace co-ordinates directly into Emperor Palpatine's shuttle during covert missions."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In the year 2 BBY, R2-Q5 was present in the Vapor Room bar on Bespin, where the droid was caught in a firefight between Imperial troops and Galen Marek, who had traveled to Bespin to find Jedi General Rahm Kota, on the order of Senator Bail Organa."}, {"tag": "p", "text": "R2-Q5 also became aware of IG-88A's infiltration of the Death Star II and subsequent plan to reprogram every Imperial droid to follow his commands. The droid took it upon itself to prevent IG-88A's plans. It was also present during Darth Vader's unexpected arrival at the station to pressure Moff Tiaan Jerjerrod with finishing the weapons systems of the station prior to the Emperor's inspection of the station, and was also present among the other droids when Emperor Palpatine's shuttle arrived at the Death Star's Hangar 272 shortly afterward."}, {"tag": "p", "text": "A subsequent Rebel attack destroyed corridors in the second Death Star, resulting in the immobilization of an R4-series agromech droid that was carrying a vital message for the Emperor. R2-Q5 was forced to download the data from the R4 and deliver it personally. Whether the droid fulfilled the mission, prior to the Emperor's death, is unknown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R2-Q5's picture is shown labeled as R2-Q2, and listed as an ally of IG-88 in the Jedi Force File included with the year 2000 release of Hasbro's Star Wars: Power of the Jedi IG-88 figure."}, {"tag": "p", "text": "R2-Q5's name is incorrectly written as R2-D5 in the #6211 Lego Imperial Star, Destroyer set."}, {"tag": "p", "text": "In Star Wars: Jedi Knight II: Jedi Outcast, R2-Q5 can be spawned by typing \"npc spawn R2D2_imp\"."}, {"tag": "p", "text": "R2-Q5 is an unlockable minikit character in the GBA release of Lego Star Wars II: The Original Trilogy, but only the GBA version."}, {"tag": "p", "text": "In LEGO Star Wars: The Complete Saga, R2-Q5 can be unlocked for purchase by entering the code \"EVILR2\", but he also becomes available after completing every level in the game. During gameplay, R2-Q5 has identical abilities to other astromechs in the game, but his droidspeak is different, and the droid's attitude jets emit red efflux rather than blue."}, {"tag": "p", "text": "In Star Wars: Empire at War and Star Wars: Empire at War: Forces of Corruption, R2-Q5 is part of the Help Droid and Encyclopedia display for the Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}