{"url": "R2-R9/Legends", "categories": ["Category:Legends articles", "Category:Masculine programming", "Category:R2-series astromech droids"], "nodes": [{"tag": "h1", "text": "R2-R9"}, {"tag": "p", "text": "R2-R9 was an R2-series astromech droid that served the Royal House of the planet Naboo during the Invasion of Naboo by the Trade Federation in the year 32 BBY. It was onboard the J-type 327 Nubian royal starship when Queen/Legends Padmé Amidala used the vessel to flee from Naboo. When the starship took damage from Trade Federation fire, R2-R9 and several other astromech droids traveled to the ship's exterior to try and repair damage to the shield generator. While trying to carry out repairs, R2-R9 was struck by enemy fire and destroyed."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Escaping Naboo"}, {"tag": "p", "text": "The R2-series astromech droid designated R2-R9 served the Royal House of the planet Naboo during the reign of Queen Padmé Amidala. In the year 32 BBY, Naboo was invaded by the Trade Federation and the planet's capital Theed was captured. With the aid of the Jedi Qui-Gon Jinn and Obi-Wan Kenobi, Amidala and some of her staff managed to escape from the Federation and board the J-type 327 Nubian Royal Starship in one of the hangars of the Theed Royal Palace. R2-R9 was one of at least five astromech droids on board the starship when it departed the hangar to try and escape Naboo."}, {"tag": "p", "text": "As the starship left Naboo's atmosphere, Kenobi brought the Gungan Jar Jar Binks down to the room in the starship where R2-R9 and the other astromechs were docked and told him to wait there. The royal starship then came under fire from Trade Federation Lucrehulk-class LH-3210 cargo freighters blockading the planet."}, {"tag": "h3", "text": "Lost in the line of duty"}, {"tag": "p", "text": "A shot from one of the freighters damaged the Royal Starship's shield generator which set off an alarm in the room the astromechs were waiting in. R2-R9 and the other droids immediately left their docking stations and rolled over to a lift that would take them to ship's exterior. R2-R9 was second onto the surface after G8-R3 and the droids quickly set about attempting repairs."}, {"tag": "p", "text": "As R2-D2—the last droid to reach the ship's exterior—reached the damaged generator, R2-R9 was struck by a shot from one of the Trade Federation vessels and destroyed. Each of the other droids were then picked off one by one until only R2-D2 remained; however, he was able to complete the repairs to the generator and save the ship, which successfully escaped the blockade."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "R2-R9 was an R-series astromech droid with red and silver paneling. Like all R2 units it was manufactured by Industrial Automaton and stood 0.96 meters tall. Like other members of its model make, it demonstrated great bravery in the face of danger, as evidenced by its last moments being to risk exposing itself to turbolaser blasts to fix the ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R2-R9 first appeared in the film Star Wars: Episode I The Phantom Menace, which was released on May 19, 1999. The droid was not named in the film, but first received identification in the Star Wars Legends (at the time considered the canonical Expanded Universe) Star Wars: Episode I Insider's Guide released on June 23, 1999."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}