{"url": "R2-SHP", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Masculine programming", "Category:R2-series astromech droids", "Category:Resistance droids"], "nodes": [{"tag": "h1", "text": "R2-SHP"}, {"tag": "p", "text": "The R2-series astromech droid R2-SHP, also known as \"Shep,\" served the Resistance with his counterpart R6-LE5 during the war against the First Order. The pair performed routine maintenance on the CR90 corvette Tantive IV while it was in the Resistance base on the moon Ajan Kloss. He was among those in the base who mourned the death of General Leia Organa in 35 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "R2-SHP, also known as \"Shep,\" was a masculine R2 series astromech droid who served in the Resistance during its war with the First Order. He and his counterpart R6-LE5, who were considered \"siblings,\" carried out routine maintenance on the CR90 corvette Tantive IV to ensure its function while it was used as the command hub of the Resistance base on the moon Ajan Kloss."}, {"tag": "p", "text": "In 35 ABY, R2-SHP stood beneath the Tantive IV when the Jedi trainee Rey returned to the base from a training session and met with General Leia Organa, the Resistance's leader. With Lieutenant Kaydel Ko Connix's assistance, Organa later passed by the droid near the corvette in order to reach out to her son, Ben Solo, through the Force."}, {"tag": "p", "text": "The general successfully communicated to her son with all her strength, but at the cost of her life. R2-SHP was then among the large crowd that gathered around Organa's body to mourn in silence. The droid was again present near the Tantive IV when Organa's successor, General Poe Dameron, learned that the planet Kijimi had been destroyed by the Final Order and listened to a galaxy-wide broadcast of theirs, which claimed that the Resistance had failed."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "R2-SHP was more gregarious than R6-LE5 and rolled to help whereever he thought it was needed. As an older R2 unit, he had undergone frequent upgrading to stay contemporary and showed an earnestness that may have stemmed from a fear of obsolescence. The droid had blue and silver plating, a black sensor, and a blue logic function display. R2-SHP stood 0.96 meter (3 feet, 2 inches) tall and was manufactured by Industrial Automaton."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R2-SHP was created for the sequel trilogy film Star Wars: Episode IX The Rise of Skywalker, which was released in December, 2019. The droid was revealed beforehand in a Star Wars: Droid Factory pack of figures tied into the film and released by Hasbro Inc. in November 2019. The droid was then identified as \"Shep\" in Star Wars: The Rise of Skywalker: The Visual Dictionary, a reference book written by Pablo Hidalgo and released alongside the film."}, {"tag": "p", "text": "The prop used for R2-SHP is predominantly made from aluminum, including an all-aluminum external shell as well as steel feet for durability. In order to be in keeping with the \"used future\" aesthetic established for Star Wars by director George Lucas, R2-SHP was deliberately aged and distressed for usage in the film, and sustained further minor wear-and-tear during use. The prop is equipped with light up elements including its holoprojector and strips of LEDs on its dome that can cycle through various colors."}, {"tag": "p", "text": "Controlled with a Spektrum™ DX6i remote control, the prop is also capable of turning its head and could move forward or backward as well as turn its position. R2-SHP's head was removable to allow access to the internal components, and during filming, the dome was swapped out with an R6 type head in order to create R6-LE5 for additional scenes. The signature of Lee Towersey, a lead droid technician on the film, can be found inside R2-SHP's dome. The dimensions of the prop are 75 centimeters by 70 centimeters by 110 centimeters (29.5 inches by 27.5 inches by 43.5 inches)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}