{"url": "R2-D6", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic droids", "Category:R2-series astromech droids"], "nodes": [{"tag": "h1", "text": "R2-D6"}, {"tag": "p", "text": "R2-D6, or Deesix as he was referred to, was an R2-series astromech droid owned by the Rebel Alliance prior to and during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 1 BBY, R2-D6 served aboard the Y-wing of Rebel pilot Wedge Antilles during the Kamino uprising. During the fighting, Deesix was used as a handhold by Starkiller, a clone of Galen Marek who was attempting to infiltrate the cloning facilities on the planet in order to rescue Rebel fighter Juno Eclipse. Although nervous about the escalating conflict, Deesix nevertheless stayed true to the current mission and survived the battle."}, {"tag": "p", "text": "Deesix was later assigned to a Y-wing on recon duty in the Muugrah system searching for a pirate base. Though the Y-wing did find the base, it was soon attacked by the pirates and the pilot was forced to eject. Deesix became trapped in his socket due to the damage dealt to the ship, and played dead as the Y-wing was tractored aboard a pirate ship, which proceeded to take it to a nearby pirate outpost. Once the outpost commander saw what his men had brought in, he panicked and ordered the fighter disposed of lest he be linked with the Rebel Alliance. The fighter, with Deesix still aboard, was loaded into a cargo container and dumped in Squarn's Junkyard on the planet Muugrah."}, {"tag": "p", "text": "Rewiring his socket to draw power from the Y-wing, Deesix was determined to return to the Alliance with the information he had gathered, and was keen to regroup with the crew of the fighter. He was eventually discovered by a group of Rebels who were looking for spare parts to fix their hyperdrive. They managed to free Deesix from his socket with the help of a repulsorlift skiff, which they had repurposed as a VTOL vehicle. Deesix insisted on accompanying them with their searches. While the group continued their search, however, they were attacked by the same group of pirates who had previously sent Deesix to the junkyard, operating on orders to retrieve the droid for Imperial Intelligence. The fight ended with the Rebels victorious thanks to the help of Squarn's mercenary forces, and they soon left the world with Deesix in tow."}, {"tag": "p", "text": "Once Deesix was delivered to a Rebel base, the information in his memory was downloaded, saving many Rebel lives from the pirate attacks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}