{"url": "R2-HA", "categories": ["Category:Canon articles", "Category:Black Squadron (Resistance) personnel", "Category:R-series droids", "Category:Resistance droids"], "nodes": [{"tag": "h1", "text": "R2-HA"}, {"tag": "p", "text": "R2-HA was a pink and blue R-series astromech droid that served the Resistance. It assisted Black Squadron during its mission to Megalox and teamed up with BB-8, O-R10N, and R4 in an attempt to free Grakkus the Hutt."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "R2-HA was an astromech droid that served the Resistance starfighter squadron Black Squadron during the early Cold War. He accompanied BB-8, O-R10N, and R4 on a mission to Megalox Beta. After Poe Dameron's negotiations with Grakkus the Hutt was complicated by the presence of the First Order Agent Terex, Poe dispatched R2-HA and the other droids on a mission to sabotage the gravity shield protecting Megalox prison from Megalox Beta's high gravity. The primary security generator controlling the gravity shield was located in a space station above Megalox Beta."}, {"tag": "p", "text": "Under BB-8's leadership, R2-HA and the other droids headed towards the generator. While R2-HA and R4 were trying to access a network terminal, BB-8 and OR-10N spotted three prison guards approaching. The droids activated their rocket boosters in an effort to stay hidden. However, R4's boosters malfunctioned and crashed onto one of the guards. O-R10N was forced to knock out the two remaining guards. The droids then headed to the primary security field generator in Deck Twelve."}, {"tag": "p", "text": "The droids began deactivating the gravity field generator but were interrupted by a security droid. O-R10N attacked the droid but was thrown down a bridge to its disintegration. Following a fight, BB-8 managed to disable the security droid by electrocuting it. Meanwhile, R2-HA and R4 managed to disable the gravity field generator. This allowed Poe and the rest of Black Squadron to rescue Grakkus. The droids met with Black Squadron and Grakkus when they returned to the space station."}, {"tag": "p", "text": "After returning control of the prison to Warden Luta, the droids departed with their pilots aboard their T-70 X-wing starfighters. When Agent Terex attacked the space station above Megalox Beta, Black Squadron turned around and drove his ship away. After obtaining the necessary information from Grakkus, Black Squadron allowed him to escape while they returned to the Resistance base on D'Qar."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "R2-HA was an R-series astromech droid. He was equipped with a rocket booster that allowed him to fly. R2-HA also knew how to operate network terminals and gravity field generators."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name of R2-HA is based on the initials of the assisant editor Heather Antos. The droid's design resembles that of the R9-series astromech droid from the Star Wars Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}