{"url": "R2-D2/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles in need of updating", "Category:Articles with elements from unlicensed sources", "Category:Alliance to Restore the Republic droids", "Category:Bright Tree tribe honorary members", "Category:Droids of the Jedi Order", "Category:Endor strike team personnel", "Category:Galactic Alliance individuals", "Category:Galactic Republic droids", "Category:Masculine programming", "Category:Naboo", "Category:New Republic droids", "Category:R2-series astromech droids", "Category:Red Squadron personnel", "Category:Rogue Squadron personnel", "Category:Shadow Squadron personnel", "Category:Slicers", "Category:Tansarii Point Station residents"], "nodes": [{"tag": "h1", "text": "R2-D2"}, {"tag": "p", "text": "R2-D2, pronounced Artoo-Deetoo and often referred to as Artoo, was an R2-series astromech droid manufactured by Industrial Automaton prior to 32 BBY. Resourceful and spunky, the droid developed an adventurous personality during his over a century of operation. Inside of his cylindrical frame were many arms, sensors, and other tools that could be extended to fulfill various needs, such as slicing computers, extinguishing fires, projecting holograms, repairing starships, and flying. Along with his counterpart, the protocol droid C-3PO, R2-D2 constantly found himself directly involved in pivotal moments of galactic history. His bravery, coupled with his many gadgets, played large roles in saving the galaxy time and time again for more than a century. Like other astromech droids, R2-D2 could walk on two legs or use a third leg to roll across the ground."}, {"tag": "p", "text": "In 32 BBY, R2-D2 was serving the Royal Engineers of Naboo aboard Queen Padmé Amidala's royal starship when the Trade Federation blockaded the planet. His maintenance work on the ship's hull while it was under fire allowed the queen and her crew to bypass the blockade and flee the sieged world. R2-D2 was then recognized before the queen for his work in ensuring the ship's safety. Afterwards, R2-D2 directly served the queen, playing a decisive role in liberating Naboo and remaining with Amidala for another ten years, even as she transitioned to the role of senator eight years later. When attempts on her life were made in 22 BBY and the Jedi Padawan Anakin Skywalker was assigned to protect her, R2-D2 and C-3PO accompanied the two to Geonosis and participated in a battle that started the Clone Wars, a galaxy-wide conflict between the Galactic Republic and the Separatist Confederacy of Independent Systems. Amidala gave R2-D2 to Skywalker when he became a Jedi Knight, and the astromech droid faithfully served him throughout the war, often flying in the droid socket of Skywalker's starfighter or fighting next to him on the front lines."}, {"tag": "p", "text": "The war was in fact orchestrated by the Republic's Supreme Chancellor Palpatine, who was secretly the Sith Lord Darth Sidious, and who brought the conflict to an end three years in, taking Skywalker as his Sith apprentice, wiping out the Jedi, slaying the Separatists and reorganizing the Republic into a Galactic Empire. In the aftermath of the war, R2-D2 and C-3PO were assigned to the corvette Tantive IV of Alderaan, where they served Alderaan's viceroy Bail Organa for nineteen years. They were, however, separated from Organa during that time period, and got caught up in a wide variety of misadventures, ruining the gangster Tig Fromm, helping restore the Tammuz-an monarchy, and aiding the merchant Mungo Baobab in reviving his family's fortune, among other exploits. After rejoining the crew of the Tantive IV, they became embroiled in the Galactic Civil War, and in 0 BBY, Leia Organa of the Rebel Alliance entrusted R2-D2 to bring a copy of the Death Star plans to the Jedi Master Obi-Wan Kenobi on Tatooine. After meeting Skywalker's son Luke and the smuggler Han Solo, the droids helped rescue Princess Leia from the Empire's Death Star and became directly attached to the three Humans, helping them and their rebellion defeat the Empire and restore freedom to the galaxy. R2-D2 also assisted Luke in his training as the galaxy's last Jedi Knight."}, {"tag": "p", "text": "When the Rebellion later became a New Republic, R2-D2 continued to serve Luke and the now-married Han and Leia Solo, helping them defeat remnants of the Empire; R2-D2 notably sliced into Palpatine's Galaxy Gun and used it to destroy the Emperor's fortress world of Byss, teamed up with C-3PO and a young mechanic named Cole Fardreamer to foil a plan to bomb the galactic capital of Coruscant, and recovered a copy of the Caamas Document, which allowed peace to be forged between the New Republic and the final remnants of the Empire. When an extra-galactic race of religious zealots known as the Yuuzhan Vong invaded the galaxy in 25 ABY, R2-D2 participated in the four-year conflict that eventually saw the invaders defeated. Six years later, Luke and Leia discovered the identity of their mother via holorecordings found inside of R2-D2's memory, and R2-D2 remained at their side during the subsequent Second Galactic Civil War. The astromech droid was passed down to many subsequent generations of Skywalkers, and in 137 ABY, aided Cade Skywalker in fighting against a revived Sith Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "R2-D2 was a diminutive droid, standing 0.96 meters tall. He rolled on three legs, one of which could retract into his body, and had a silver and blue domed head. His white, blue, and silver body housed many arms, sensors, and other apparatuses, many of which were not readily seen by the typical humanoid eye. This often made the droid seem like a box of tricks, unexpectedly pulling out some previously unseen but very much needed device at a critical moment. It also contained a carousel device that contained a specific arm related to a specific duty, to economize space within his cylindrical body. Because of the quickness in utilizing a specific arm, it often gave off the illusion that he had an endless supply of tools."}, {"tag": "p", "text": "While R2-D2 contained many specialized gadgets, he was also quite good at taking the initiative and often employed unorthodox means to help his friends."}, {"tag": "p", "text": "R2-D2's horizontal blue slots could also be opened further, which would then send out a two-pronged, whip-like appendage, which he could use to taunt others."}, {"tag": "h3", "text": "Known Features"}, {"tag": "p", "text": "Even by R2-series standards, R2-D2 had an extensive amount of features, which were both part of the R2 line and modified."}, {"tag": "p", "text": "R2-D2, during the Clone Wars, utilized a Brooks Propulsion rocket booster, which he used to escape and, in the case of the Battle of Coruscant, offensively. After the Clone Wars, however, Brooks Propulsion Devices, the company responsible for the development of his boosters, was shut down, and his rocket boosters were eventually damaged and thus could not be repaired. Despite this, however, R2 hardly regretted the loss of his ability to fly."}, {"tag": "p", "text": "He had an extendable neck, in large part so he could be fitted into the droid section of the Naboo N-1 starfighter. However, he rarely used it, as it would result in foreign agents gaining entrance to his internal systems."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "In the service of the Naboo"}, {"tag": "h4", "text": "The Invasion of Naboo"}, {"tag": "p", "text": "In 32 BBY, R2-D2 was in the possession of the Royal Engineers of Naboo, and was assigned aboard Queen Amidala's Royal Starship as a maintenance droid. The Royal Engineers were famous for making after-market additions to their R2 units, which rendered the droids some of the most sought after units in the galaxy. During that year, the Trade Federation created a blockade of battleships around Naboo in response to legislation passed by the Senate of the Galactic Republic which called for the taxation of trade routes to outlying star systems, and began landing their army of battle droids on the planet. Accompanied by the Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi, the Queen and a group of her royal personnel boarded the royal starship in the capital city of Theed and attempted to flee the planet by breaking the blockade. When the turbolasers of one of the Federation's battleships damaged the royal starship's shield generator, R2-D2 and several other astromech droids made their way through a turbolift to the ship's hull to effect repairs; R2-D2 bumped into the Gungan Jar Jar Binks on his way out of the ship. As R2-D2's droid companions were systematically blown off of the hull by laser blasts, the deflector shields gave out completely until R2-D2 was able to bypass the main power drive and bring the shields back online. With the shields again intact, the pilot Ric Olié was able to break the blockade and flee the planet."}, {"tag": "p", "text": "As the ship traveled through hyperspace to the planet Tatooine, a dirtied R2-D2 was brought before the queen by Captain Quarsh Panaka, the head of the Royal Naboo Security Forces. Sabé, a decoy posing as the queen, thanked him for saving the lives of everyone aboard, and ordered Padmé Naberrie, actually the queen posing as a handmaiden, to clean the droid up. Amidala cleaned R2-D2's exterior while Jar Jar Binks watched; the trio later accompanied Qui-Gon Jinn to the city of Mos Espa on Tatooine in search of a new hyperdrive generator. R2-D2 accompanied Jinn and the others to the junk shop of the Toydarian merchant Watto, and later to the home of Anakin Skywalker, a young slave working for Watto who offered his home to the party as a reprieve from a coming sandstorm. In Skywalker's home, R2-D2 was introduced to C-3PO, a protocol droid that the boy was building. As C-3PO was yet to be covered with an outer plating, R2-D2 candidly remarked that his parts were showing, even calling him \"naked.\" The astromech droid then stood in the home's kitchen as the guests dined with Skywalker and his mother, Shmi Skywalker, and later helped Skywalker make final adjustments to his podracer in time to race it in the Boonta Eve Classic race. Despite C-3PO's shock at R2-D2's initial candor, the two droids fast developed a friendship of sorts, working on the podracer together, discussing space travel, and noting the clumsy actions of Binks."}, {"tag": "p", "text": "On the day of the race, R2-D2 helped pull Skywalker's racer onto the course, and later stood on the sidelines with C-3PO and two of Skywalker's playmates, Kitster Banai and W. Wald, who cheered their friend on. Skywalker won the race, which secured the hyperdrive generator and freed the boy from his enslavement. R2-D2 was waiting inside the royal starship and next to its boarding ramp as Skywalker entered the ship, and was present shortly thereafter when Jinn entered, having just dueled a Sith Lord on the planet's sand dunes. The ship and its crew traveled to the galactic capital of Coruscant and remained there for several days, before returning to Naboo in an effort to rid the planet of its Trade Federation presence. Onworld, R2-D2 accompanied the queen's party to the Gungan Sacred Place as she requested help from Boss Rugor Nass of the Gungans in the impending battle. After Nass accepted, R2-D2 attended an informal council of war, and projected a hologram of Theed as plans were made to lay siege to the city."}, {"tag": "p", "text": "Amidala, along with her handmaidens, bodyguards, Jinn and Kenobi, Skywalker, and R2-D2 stormed the Theed Royal Palace through its hangar; after the area was cleared of battle droids, R2-D2 was pulled into the droid socket of a Naboo Royal Starfighter that Skywalker had taken refuge in the cockpit of. After locating the firing controls, Skywalker destroyed several droidekas with the ship's guns, but found the ship in an automatic pilot mode. R2-D2 was able to override the auto-pilot, but only after the ship had made its way to a space battle that was raging above the planet's atmosphere. The astromech droid instructed his pilot to return to the hangar, but Skywalker refused, and joined Bravo Squadron of the Naboo Royal Space Fighter Corps as they assaulted the Trade Federation's Droid control ship. Shortly into the battle, Skywalker's fighter was hit and made a crash landing inside one of the control ship's hangars. Firing proton torpedoes at the ship's main reactor, Skywalker was able to destroy it, which played a large part in the day's victory over the Trade Federation."}, {"tag": "p", "text": "Following the victory, R2-D2 attended the Funeral of Qui-Gon Jinn, who had been slain during the battle by the same Sith Lord he had fought on Tatooine. R2-D2 was later present at a ceremony which celebrated the battle's victory, and stood by as Amidala presented Boss Nass with the Naboo people's Globe of Peace."}, {"tag": "h4", "text": "Serving a Senator"}, {"tag": "p", "text": "R2-D2 would remain in Amidala's service for another ten years, even transitioning with her from the Royal House of Naboo to the Galactic Senate in 25 BBY. Three years after her appointment to the senate, Amidala traveled from Naboo to Coruscant to vote against the senate's proposed Military Creation Act, but chose a handmaiden to pose as her and to make the journey in an official ship, while Amidala flew in a Naboo Royal starfighter with R2-D2 in the droid socket. After their arrival at a landing platform on Coruscant, a bomb detonated and killed most of the crew of the yacht; R2-D2 followed as Amidala's head of security Captain Typho rushed her to safety. Anakin Skywalker, now a Jedi Padawan, and his Master Obi-Wan Kenobi were assigned by the Jedi Council to protect the senator from further assassination attempts, and R2-D2 was programmed to warn the two Jedi if anyone intruded into her apartment while she slept. Despite his programming, R2-D2 failed to detect the insertion of two poisonous kouhuns into Amidala's bedroom, which had been administered through a hole in the window created by an ASN courier droid. Although Skywalker sensed and killed the creatures, Supreme Chancellor Palpatine of the Republic felt that Coruscant was an unsafe place for Amidala, and agreed to delay the vote on the Military Creation Act so that she might lay low on Naboo under the watchful eye of Skywalker."}, {"tag": "p", "text": "R2-D2 accompanied the two onto a freighter whose voyage saw them posing as refugees, and brought them food in spite of the protests of a serving droid. After the ship's arrival at Theed, R2-D2 accompanied Skywalker and Amidala to the Royal Palace and quietly waited outside the Royal Court as the two met with Queen Jamillia. Several days later, he journeyed with the two to Tatooine in Amidala's yacht as a restless Skywalker searched for his mother, and accompanied them to Watto's junk shop in Mos Espa. When Watto directed them to a moisture farm, the yacht was flown to the Great Chott salt flat, and Amidala instructed R2-D2 to remain with the ship while she and Skywalker went to the farm. While aboard the ship, R2-D2 received a holocomm message from Kenobi, who was on Geonosis and whose long-range transmitter had been damaged by Jango Fett; Kenobi asked Skywalker to relay the message to the Jedi Council on Coruscant. Leaving the ship, R2-D2 found Skywalker, Amidala, C-3PO, and the Lars family attending a funeral for Shmi Skywalker, and informed them of the message. When C-3PO translated his binary beeps and whistles, Skywalker and Amidala returned to the ship and relayed the message to Coruscant. Seeing that Kenobi had been captured by droidekas while recording the message, the two decided to fly to Geonosis and rescue him. They were joined by R2-D2 and C-3PO, the latter having been given to Skywalker by his stepbrother Owen Lars."}, {"tag": "h3", "text": "Entering the Clone Wars"}, {"tag": "h4", "text": "The Battle of Geonosis"}, {"tag": "p", "text": "Landing the yacht inside an exhaust vent on Geonosis, Skywalker and Amidala set out, leaving the droids behind. R2-D2 insisted on following them, but C-3PO disagreed and claimed to be in charge. R2-D2 ignored his friend and set out, and was ultimately followed by a reluctant C-3PO. Within the planet's catacombs, Geonosian warriors swarmed by the droids in flight from Skywalker's lightsaber; the droids soon discovered an entrance to a battle droid factory, within which Skywalker and Amidala were battling Geonosian warriors. Hoping to reach them, R2-D2 knocked C-3PO off of the platform on which they stood, before activating his booster jets and soaring through the factory. Finding Amidala trapped in a large bucket, R2-D2 landed on a bridge and sliced into a computer terminal with his scomp link, successfully saving the senator from being doused by molten ore. He also loosed the bucket from the mechanical arm which held it, spilling Amidala onto the factory floor. Surrounded by enemies, Amidala and Skywalker were captured and sentenced to die with Kenobi in a Geonosian execution arena. The timely arrival of 200 Jedi saved them, but the Jedi soon found themselves in a fierce battle with hundreds of armed droids fighting in the name of the Separatist Confederacy of Independent Systems. R2-D2 entered the battle and discovered C-3PO's head attached to a battle droid's body. Using his cable gun to detach the head, R2-D2 dragged it across the arena and grafted it to the correct torso. As the battle droids overwhelmed the Jedi, the Jedi Master Yoda arrived with a large force of the newly commissioned Grand Army of the Republic, and the fighting spilled out of the arena, soon leaving R2-D2, C-3PO, and the young clone Boba Fett as its sole occupants."}, {"tag": "p", "text": "The Republic Army won the battle, launching a galactic war between the Republic and the Confederacy. Shortly after the battle, R2-D2 and C-3PO accompanied Amidala and Skywalker back to Naboo, where they were the lone witnesses to a wedding between the two in the planet's Lake Country."}, {"tag": "h4", "text": "From Amidala to Skywalker"}, {"tag": "p", "text": "R2-D2 remained with Amidala on Coruscant during the initial battles of the war, as did C-3PO, who had been given to the senator by Skywalker as a wedding gift. The three witnessed Skywalker depart the planet in a starfighter on his way to lay siege to Muunilinst. Some time later, the droids were traveling with Amidala in her Royal yacht while the ship was host to Yoda. After Yoda convinced Amidala and Captain Typho to make a detour, the ship headed to Ilum on a rescue mission of the Jedi Luminara Unduli and Barriss Offee. The Jedi Master set out into the planet's blizzard alone, but a worried Amidala, after being assured by R2-D2 that his sensors were functioning properly in the snowy weather, soon set out to find him with the droids in tow. During the search, R2-D2's sensors detected several incoming objects, which turned out to be three cloaked Separatist Chameleon droids. Amidala destroyed all three, and the trio was greeted by their three wayward Jedi, Yoda concerned that the location of Ilum's Crystal Caves had been discovered by the Separatists. Slicing into one of the destroyed droids, R2-D2 discovered and revealed a hologram of Count Dooku, Head of State of the Confederacy, giving instructions to destroy the caves."}, {"tag": "p", "text": "After Skywalker was elevated to the rank of Jedi Knight, he gave his former Padawan braid to Amidala as a gift. R2-D2 was present when she received the hairpiece; in return, Amidala gave the astromech droid to her husband. Traveling to a hangar, R2-D2 showed Skywalker a hologram of Amidala indicating the droid's new ownership, much to Skywalker's delight. R2-D2 was then locked into the Jedi Knight's starfighter, and the two departed the planet. R2-D2 flew with Skywalker in space combat throughout much of the war, including a battle where Skywalker saved Jedi Master Saesee Tiin from droid tri-fighters. Skywalker programmed a large amount of tactical data and locations of Republic bases into the droid's memory, and broke protocol by never giving R2-D2 a memory wipe. The droid was with Skywalker when he returned to Coruscant to visit Amidala."}, {"tag": "h4", "text": "The new Padawan, the missing Huttlet"}, {"tag": "p", "text": "When the native population of the planet Christophsis appealed to the Jedi for aid in repelling an invading Separatist force, Kenobi, now a High Jedi General, and Skywalker, a Jedi General, arrived in the planet's Crystal City with a contingent of Clone troopers and R2-D2. Following a disastrous ambush by battle droids, R2-D2 watched as Clone Commander CC-2224, nicknamed \"Cody,\" and Clone Captain CT-7567, nicknamed \"Rex,\" analyzed the recovered head of TJ-55, a T-series tactical droid, in the communications center of the Republic base. When the two troopers discovered a spy in their midst, they rushed out of the center, but later returned and employed R2-D2 in locating any transmissions the spy had made. Plugging into a computer terminal, R2-D2 discovered a number of external communications that had taken place every few days in an irregular pattern. He traced them to the barracks of the Clone trooper sergeant Slick, which ultimately resulted in Cody and Rex fettering out the traitor."}, {"tag": "p", "text": "A large force of battle droids marched on the city, but was repelled by the Jedi and the Republic army. As a second wave arrived, R2-D2 was in the thick of the battle, but retreated to the safety of the Republic's AV-7 Antivehicle Cannon as the cannons fired at the droids' Armored Assault Tanks. After the droids retreated from the overwhelming cannon fire, a shuttle arrived on-planet from Coruscant and landed in the City's plaza. R2-D2 followed Kenobi and Skywalker to the plaza, and squealed in delight as the shuttle's lone occupant disembarked: Ahsoka Tano, Skywalker's new Padawan learner. As the Separatist army set up a deflector shield, R2-D2 joined Skywalker, Kenobi, Tano, and Rex at a council of war, where a plan was hatched to disable the shield. During the ensuing firefight, R2-D2 again remained with the Republic's cannons, which decisively ended the battle following the sabotage of the Separatists' shield generator. In the wake of the victory, Yoda arrived in Crystal City and ordered Skywalker and Tano to Teth to rescue the kidnapped son of the notorious crime lord Jabba the Hutt; R2-D2 traveled with them to the Outer Rim world and was present in the hangar of Skywalker's Acclamator-class transport while Skywalker was briefed on the situation planetside, and while Tano bragged of her exploits on Christophsis to a group of clone troopers."}, {"tag": "p", "text": "Skywalker and Tano led their troops to a successful siege of a B'omarr Order Monastery occupied by Separatist forces, and rescued Rotta the Huttlet from within. Outside the castle, R2-D2 sat in Skywalker's starfighter and projected a holographic transmission from Kenobi, which was cut short by the arrival of several Confederate C-9979 landing craft and vulture droids. R2-D2 jettisoned himself from the starfighter mere seconds before it received a barrage of blasterfire and exploded. As B1 and B2 battle droids swarmed the exterior of the castle, R2-D2 followed Tano inside, and was joined by Skywalker and several clone troopers before the castle's door slammed shut. Tano quickly devised an escape plan, and brought R2-D2 and Skywalker to a computer terminal where the astromech droid sliced in and located a backdoor landing platform. En route to the platform, the trio was met by the Dark Acolyte Asajj Ventress and several B2 droids, but before a skirmish could ensue, R2-D2 activated a trap door in the floor, sending everyone present plunging down a long chute and into a small arena. As Skywalker dueled Ventress, Tano neutralized the droid threat; a second group of B2 droids arrived in an overhead gallery but were assailed by R2-D2 and knocked into the arena below. The distraction offered by a jungle rancor present in the arena allowed an outgunned Ventress to escape, and the trio continued to the landing platform."}, {"tag": "p", "text": "Arriving at the platform, they were again greeted Ventress, this time with several droidekas in tow, but R2-D2 was able to close the door to the platform before their foes arrived. After Skywalker leapt off of the platform and onto the back of a large, winged insectoid, he tamed the beast and used it to tackled Ventress, who had cut through the door with her lightsabers and was dueling Tano. As Tano joined her Master on the beast's back, R2-D2 activated his booster rockets and followed them to Ventress's secret landing platform, located on a nearby mesa. The Huttlet was strapped to R2-D2 as the two Jedi attempted to start the engines of the Twilight, a freighter they discovered, but it was R2-D2 who was able to successfully get the ship running. Unable to rendezvous with the Star Destroyer Spirit of the Republic, the trio was forced to take the freighter to Tatooine and deliver the Huttlet directly to his father. R2-D2 programmed the coordinates into the ship's navicomputer, and it jumped to hyperspace."}, {"tag": "p", "text": "Above Tatooine, the freighter was attacked by vulture droids, the last of which was destroyed when R2-D2 plugged into a computer terminal and fired the freighter's cannons at it. Damaged in the firefight, the freighter crashed into the planet's Dune Sea, which forced the trio to journey to Jabba's Palace on foot. When Skywalker sensed the presence of the dark side of the Force, he suspected a nearby Dark Jedi and set off to draw it towards him and away from the Huttlet. He left Rotta with R2-D2 and Tano, who made it to Jabba's Palace without incident until three IG-100 MagnaGuards rose from the sand and attacked them. R2-D2 electrocuted one with his droid shock arm before being knocked away, and it fell to Tano to destroy all three with her lightsaber. The two then entered the palace and returned the Huttlet, which, coupled with a holo-transmission from Senator Amidala on Coruscant identifying Jabba's uncle Ziro as the responsible party for the kidnapping, placated an angry Jabba and saved the lives of the two Jedi."}, {"tag": "h4", "text": "In the hands of Grievous"}, {"tag": "p", "text": "When the Jedi Council received intelligence that General Grievous, Supreme Commander of the Separatist Droid Armies, intended to invade the planet of Bothawui, they dispatched three Venator-class Star Destroyers under Skywalker's command to blockade the Both system. When six Confederate frigates arrived in the system, Skywalker led the starfighters of Gold Squadron out to meet them, with R2-D2 flying in the general's droid socket. When the frigates were outflanked by several Republic AT-TE Walkers hiding on an asteroid, Grievous fled his flagship in his personal starfighter, and was pursued closely by Skywalker and R2-D2. A piece of shrapnel from an exploding frigate became lodged in Skywalker's fighter, and he lost both control of the ship and consciousness; the Jedi was soon recovered by Rex, but R2-D2 was salvaged from the starfighter's remains by the Trandoshan scavenger Gha Nachkt and brought aboard Nachkt's freighter, the Vulture's Claw."}, {"tag": "p", "text": "Nachkt suspected that the droid's memory contained valuable Republic information, and accordingly fitted R2-D2 with a restraining bolt and contacted Grievous, offering the droid in exchange for credits. En route to a rendezvous with the General, Nachkt slept in the freighter's bridge, which allowed R2-D2 to lose his restraining bolt and escape from the closet in which he was being held captive. As he rolled down the ship's corridors, he was pursued by an IG-86 sentinel droid, but managed to slice into a computer terminal, shutting a blast door between the sentinel and himself, and opening a trap door beneath the sentinel that jettisoned it into space. However, the mayhem woke Nachkt, who found R2-D2 and refitted the droid with his restraining bolt. Again a captive, R2-D2 was inspected by Passel Argente, the Magistrate of the Separatist-allied Corporate Alliance, who boarded the Vulture's Claw with the hope of purchasing a spy droid. Although he showed an interest in R2-D2, Nachkt informed him that the astromech already had a customer."}, {"tag": "p", "text": "As the Vulture's Claw arrived at Skytop Station, a Confederate listening post in the Hoth's Brand system, R2-D2 again worked at escaping his confinement. Cutting through a wall in the closet with his buzzsaw, he accessed a control panel and sent an audio transmission through the freighter's broadcast antennae, which was ultimately picked up by Skywalker. Nachkt discovered the droid's actions and electrocuted him with an ion prod; the Trandoshan then landed the freighter at the listening post and brought R2-D2 before Grievous. The General instructed Nachkt to take the droid apart and extract any information on the Republic from his memory, and Nachkt complied, discovering that R2-D2's memory contained every single Republic formation and strategy. Grievous killed Nachkt for demanding more credits, and then instructed several of his Magnaguards to reconstruct R2-D2 and bring him to a secure location after learning that Republic troops had boarded the station. As the astromech was carried through the station's corridors, Skywalker, who had traced R2-D2's broadcast to the system, located him and destroyed every Magnaguard with his lightsaber. As the skirmish occurred, a partially reconstructed R2-D2 managed to mostly reattach his arms and dome, and then electrocuted a Magnaguard as its destroyed arm attempted to grab Skywalker's leg."}, {"tag": "p", "text": "Skywalker was happy to see his friend again, but was promptly commed by R3-S6, his replacement astromech droid who was in fact a Confederate spy. After R2-D2 and Skywalker raced back to the Twilight, which Skywalker had docked in one of the station's hangar bays, R3-S6 revealed his true allegiance by shutting all the doors to the hangar and activating several derelict vulture droids, who, along with a group of B2 battle droids, attacked Skywalker, R2-D2, and a group of clone troopers. Skywalker ordered R2-D2 to an outer platform to see if there was a way to open the hangar door. After rolling across a bridge, R2-D2 began to interact with a computer terminal, but was accosted by R3-S6, who had followed him to the platform. The two astromechs began shooting electricity at each other, but R2-D2's lightning proved to be more powerful and incapacitated his foe. He successfully opened the hangar door, but was again attacked by R3-S6, and responded by shooting oil at his opponent. Having been rigged with explosives that had been recently been detonated, the station began to weaken, causing the bridge to buckle and begin to collapse. R3-S6 began to tumble off, but held on by firing his cable gun at R2-D2. As the two droids slowly began to slip towards the edge of the collapsing bridge, R2-D2 fired his booster rockets, setting fire to the space between them, and used his buzzsaw to cut the cable, sending R3-S6 rocketing off of the bridge and towards his destruction. R2-D2 then flew into Skywalker's waiting starfighter with the aid of his rockets, and the ship sped away from the exploding station."}, {"tag": "h4", "text": "Chasing the Malevolence"}, {"tag": "p", "text": "News began to spread through the Republic of a Separatist weapon that had destroyed over a dozen Republic warships and left no survivors; when Jedi Master Plo Koon's fleet was presumed destroyed in the Abregado system, Skywalker, Tano, and R2-D2 took the Twilight from the Bith system to investigate, despite instructions from Master of the Order Mace Windu stating that they were to remain with their fleet and protect vital convoy missions. Arriving in the Abregado system, R2-D2 tuned the Twilight's scanners to detect lifeforms, and received a HoloNet transmission from Kenobi, who instructed Skywalker to rendezvous with his fleet. As the three prepared to leave the system, R2-D2 discovered a lifeform reading on the ship's emergency channel and traced the signal to a specific area of the shattered remains of Koon's fleet. When Tano sensed Koon's presence, the three were able to employ a tow cable in bringing an escape pod aboard their ship which was housing Koon and three clone troopers. The joy of the recovery was cut short when the Separatist's secret weapon arrived in-system: A heavy cruiser of prodigious proportions called the Malevolence, which sported massive ion cannons that it used to disable its prey. R2-D2 was shut off with the rest of the Twilight's systems in a bid to avoid detection from the battleship's sensors, but when the gambit failed, the astromech droid was reactivated and plotted a hyperjump away from the system. Having successfully escaped from the ion cannons' blast, the Twilight rendezvoused with the Star Destroyer Resolute."}, {"tag": "p", "text": "Hoping to acquire a group of Y-wing bombers to use against the heavy cruiser, Skywalker brought R2-D2, Tano, and the clone pilots of Shadow Squadron in the Twilight to the Bormus Testing Facility, a space station orbiting the planet of Bormus that possessed such a group. Aboard the station, R2-D2 plugged into a computer terminal and uploaded falsified documents that a protesting worker needed into the station's computer system, which claimed that Skywalker had permission to take the untested fighters. With new fighters to their name, Shadow Squadron returned to the Resolute, where they were briefed by Skywalker and Admiral Wullf Yularen; R2-D2 assisted in the briefing by projecting a hologram of the Malevolence while Skywalker outlined the squadron's attack strategy: bomb the cruiser's bridge superstructure. R2-D2 then joined Skywalker and Tano in one of the bombers; Skywalker would be commanding Shadow Squadron while Tano acted as his gunner. Having received intelligence that their target was heading towards the Republic's Kaliida Shoals Medical Center, Shadow Squadron took a shortcut through the Balmorra Run in order to cut the Malevolence off."}, {"tag": "p", "text": "The shortcut necessitated passage through the Kaliida Nebula, which saw the squadron and Master Koon, acting as its fighter escort, dodge through nesting giant Neebray mantas. Passing through mostly unscathed, the squadron beat the Malevolence to the medical center, but was reduced to half of its strength when five bombers were lost to vulture droids and the cruiser's massive ion cannons. Unable to destroy the bridge, the squadron directed its efforts at one of the ion cannons at Tano's suggestion, firing proton torpedoes at the weapon. The damage inflicted caused the Malevolence to nearly tear itself apart when it attempted to fire, incapacitating both weapons and its hyperdrive. The Resolute prepared to destroy the derelict cruiser, but held off when Senator Amidala's yacht, having arrived in-system due to false intelligence, was brought aboard by the damaged ship's tractor beam. Bringing R2-D2 with them, Skywalker and Kenobi took the Twilight aboard to rescue her."}, {"tag": "p", "text": "Arriving inside the Malevolence, R2-D2 was ordered to remain at the airlock entrance, where he was soon commed by Skywalker and told to shut down a rail jet hovertrain. After complying by means of a sliced computer terminal, the astromech droid was told to locate C-3PO, who had arrived with Amidala but had gotten lost. R2-D2 found his friend, and the two rendezvoused with Skywalker and Amidala before meeting Kenobi at the Twilight. The task of powering up its engines and releasing its docking clamp fell to R2-D2, who then scanned the Malevolence and discovered that it was powering up its hyperdrive. Owing to sabotage performed by Skywalker and Amidala, the hyperdrive caused the cruiser to explode as the Twilight sped to safety."}, {"tag": "p", "text": "Despite the victory, Grievous, who had been in command of the cruiser, escaped, and Skywalker began dedicating his efforts to tracking the General down. R2-D2 stayed by his owner's side aboard the Resolute as Skywalker forsook sleep in his task. However, the Jedi Knight's focus would soon shift to Count Dooku; R2-D2 aided Skywalker in making his starfighter appear damaged in a ruse that ended with Skywalker allowing himself to be captured by a Confederate Munificent-class star frigate commanded by Dooku near Vanqor."}, {"tag": "h4", "text": "A white truce, a blue shadow"}, {"tag": "p", "text": "R2-D2 and C-3PO were again reunited during a trip to Orto Plutonia, the latter having been lent to Skywalker by his wife for the mission to the icy world. When contact was lost with a planetside military outpost, Skywalker and Kenobi brought the droids and a contingent of Clone cold assault troopers to investigate, and were accompanied by Senator Riyo Chuchi of Pantora, as well as Chi Cho, Chairman of the Pantoran Assembly, due to the planet's location in Pantoran space. When the Jedi discovered that the clone troopers stationed on Pantora had been wiped out by a group of local Talz, Cho declared war on the natives, but the conflict was quickly halted when Chuchi received permission from the Pantoran Speaker of the Assembly to negotiate peace. R2-D2 and C-3PO accompanied Chuchi, the Jedi, and what clone troopers were not fighting to the scene of the battle, where Chuchi made peace with Thi-Sen, the Talz's tribal leader."}, {"tag": "p", "text": "The two droids met again when R2-D2, Kenobi, Skywalker, and Tano landed on Naboo in a Low Altitude Assault Transport, having been sent by the Jedi Council in response to intelligence suggesting that a Separatist bio-lab had been set up on the planet. After being greeted by C-3PO, Typho, and the Gungan Peppi Bow in a hangar of Theed's Royal Palace, Skywalker sent Tano and Bow to locate the laboratory, while he, Kenobi, and R2-D2 were shown a hologram of the scientist Doctor Nuvo Vindi that had been discovered inside the head of a B1 battle droid. The Jedi managed to locate Vindi's laboratory in the planet's swamps and arrest the mad doctor, but Skywalker, Kenobi, and R2-D2 were forced to take the Twilight to Iego when Tano, Amidala, Jar-Jar Binks, Rex, and several other clone troopers became trapped in the laboratory with an airborne stream of the deadly Blue Shadow Virus that Vindi had been synthesizing."}, {"tag": "p", "text": "The two Jedi were able to obtain a root of Iego's Reeksa plant, which was a necessary ingredient in the antidote for the virus, but were unable to leave the planet due to the presence of Drol, a LaserWeb Defense Station that the Separatists had installed in the planet's orbit. After one unsuccessful attempt to pass through it, the Twilight landed in the spaceport city of Cliffhold, and R2-D2 received and amplified a HoloNet transmission from Amidala and Tano, both of whom were suffering from the effects of the virus. A plan was hatched to break through Drol, and as the Twilight left the city, several vulture droids that the Separatists had left on the planet were slave-rigged to the control of R2-D2. Via a computer terminal, R2-D2 sent the droid ships on suicide runs into Drol's laser generators, destroying the defense system and allowing the Twilight passage out of the system. R2-D2 set a course for Naboo, where the antidote was synthesized and the affected parties cured."}, {"tag": "p", "text": "The Resolute, along with the Star Destroyers Defender and Redeemer, were soon after called to the planet of Ryloth after its inhabitants were enslaved by Wat Tambor, Emir of the Separatist-allied Techno Union. An initial skirmish above the planet saw the destruction of the Redeemer, and when its companion ships fled, R2-D2 assisted Skywalker in working on his Padawan's starfighter while Skywalker and Tano concocted a plan to break the blockade. The damaged Defender was evacuated, save for R2-D2 and Skywalker, who piloted it straight into the lead Separatist control ship. Prior to the crash, the two fled the Defender in an escape pod, which was recovered by the Resolute. With the blockade broken, Kenobi's troops could mount a ground assault of the planet."}, {"tag": "h3", "text": "New threats"}, {"tag": "h4", "text": "A cunning bounty hunter"}, {"tag": "p", "text": "In the employ of Darth Sidious, the secret leader of the Confederacy, a Duros bounty hunter named Cad Bane stole a holocron from the archives of the Jedi Temple, but was subsequently pursued to Devaron by the Resolute. The Resolute targeted the hyperdrive of a Munificent-class frigate that Nute Gunray, the Viceroy of the Separatist-allied Trade Federation, had lent to Bane, and the bounty hunter found himself trapped in the system; R2-D2, Skywalker, Tano, Rex, and a group of clone troopers took several AT-TE walkers to the hull of the frigate in an attempt to board and recover the holocron. R2-D2 opened a hatch, allowing the party to board, and joined them as they stormed the bridge. Plugging into a computer terminal, R2-D2 discovered a hologram of Bane indicating that he had taken the Kyber crystal from the captured Jedi Master Bolla Ropal, and located the detention area where Ropal was being held. The party found Ropal dead, but were able to locate Bane with the help of R2-D2's glowrod. They followed him into a hangar that was filled with battle droids, and a fierce firefight ensued that saw Bane disable the ship's artificial gravity. Using his booster rockets, R2-D2 turned the gravity back on, and, with the droids defeated, the boarding party fled the ship in a Sheathipede-class transport shuttle. Upon their return to the Resolute, it was discovered that Bane had donned the armor of a clone trooper and had fled with them; Bane quickly escaped the Resolute with a list of all known Force-sensitive children in the galaxy that he had obtained by combining the holocron and the Kyber crystal."}, {"tag": "p", "text": "Skywalker and Tano captured Bane on Naboo and brought him to the Resolute, where, with the aid of R2-D2, they investigated the bounty hunter's fighter and discovered that he had recently been to Mustafar. Hoping to find a higher power that they suspected Bane to be working for, the three took the Twilight to the volcanic planet. After landing, R2-D2 opened the door to a mining station and allowed Skywalker and Tano access, and followed them inside, later opening another door that allowed the two Jedi to flee the station with two recovered infants, Zinn Toa and Wee Dunn."}, {"tag": "h4", "text": "Deadly new weapons"}, {"tag": "p", "text": "Soon after the mission to Mustafar, R2-D2 and Skywalker accompanied C-3PO, Amidala, Typho, and Senator Rush Clovis of the InterGalactic Banking Clan on Amidala's star skiff from Coruscant to Cato Neimoidia, where Amidala parleyed with Senator Lott Dod of the Trade Federation while simultaneously spying on Clovis; both Dod and Clovis were suspected of being in league with the Confederacy. R2-D2 and Skywalker initially remained with the skiff outside Dod's palace, but Skywalker, disguised as a pilot, infiltrated the fortress and returned with a datacard that Amidala had stolen. R2-D2 took the datacard and prepared the skiff for takeoff, which Typho piloted away from the planet after Skywalker, Amidala, and C-3PO returned. The datacard contained tactical coordinates for a new droid foundry being constructed on Geonosis, and R2-D2 accompanied Skywalker and several other Jedi to the planet as Republic forces laid siege to the factory. R2-D2 projected a hologram of the target as Skywalker and Jedi Master Luminara Unduli planned an attack."}, {"tag": "p", "text": "R2-D2 later joined a clone escort that included Skywalker, Kenobi, Cody, and Rex; the group was aboard the starship Coronet in an effort to ensure the Duchess Satine Kryze of Mandalore and several other Senators belonging to Kryze's Council of Neutral Systems safe passage from Satine's homeworld to Coruscant. As it was suspected that Kryze's enemies, the Death Watch, were allied with the Confederacy, R2-D2 and the clone troopers aboard patrolled the ship's cargo hold in search of any suspicious droid activity. When R2-D2 discovered a solitary clone trooper helmet, his agitated beeping and whistling, coupled with the disappearance of troopers Mixer and Redeye, prompted Rex to contact Skywalker, whose arrival resulted in R2-D2's discovery of an empty cargo box and an assassin probe droid. The probe was destroyed by Skywalker and the clones, but its mangled remains began spewing legions of tiny probe killers, some of which R2-D2 electrocuted with his droid shock arm. The astromech went on to electrocute one more probe killer, just as it was about to strike at Rex's throat. Skywalker and the clone troopers destroyed the remaining probes, as well as several B2 battle droids that arrived on the ship via three Droch-class boarding ships and the traitorous Senator Tal Merrik, and the ship arrived safely at Coruscant."}, {"tag": "p", "text": "When Separatist forces attacked the native Dug on the planet Malastare, the long campaign worried the Supreme Chancellor, who was interested in the planet's fuel resources. Palpatine approved the use of the Republic's newest weapon, the electro-proton bomb, and R2-D2 accompanied Skywalker and Mace Windu to Malastare to oversee the weapon's detonation. The bomb was dropped on advancing Separatist forces, releasing an electromagnetic pulse that short-circuited the systems of the battle droids, but creating a sinkhole in the ground. R2-D2 joined Skywalker, Windu, Rex, Dug leader Nakha Urus, creator of the bomb Doctor Sionver Boll, and a hologram of the Supreme Chancellor at a round-table discussion regarding the retrieval of clones that had fallen into the sinkhole and the signing of a treaty that would secure the planet's fuel reserves for the Republic. Skywalker left to negotiate with the Dug Council, but soon commed R2-D2 and told him to ready his starfighter. The two piloted the ship into the sinkhole, where Windu and several clones were battling a Zillo Beast, a massive creature that the bomb's detonation had awakened."}, {"tag": "p", "text": "A swipe from the beast caused the fighter to crash, and as it approached the downed craft, Skywalker yanked R2-D2 out of the droid socket and rode the droid to safety via R2-D2's booster rockets. He told the droid to get to safety, but R2-D2, again using his rockets, remained in the vicinity of the beast as Skywalker attacked it. When the Jedi Knight leapt off of the Zillo Beast's head, R2-D2 positioned himself beneath his master's trajectory, allowing Skywalker to land on the droid and safely ride him out of the sinkhole. The Dugs began dropping bombs into the sinkhole, but found the weapons unable to penetrate the beast's armored scales. R2-D2 joined the two Jedi, Rex, and Boll as they contacted the Supreme Chancellor and requested permission to spare the innocent creature's life. Skywalker proposed using stun cannons on gaps in the beast's armor to put it to sleep and transport it off of the planet, and when Boll convinced Palpatine to acquiesce, the plan was successfully executed. R2-D2 was present in Urus's palace as the Council signed a treaty welcoming them into the Republic. The Zillo Beast was then transported to Coruscant, and R2-D2, Skywalker, and Windu accompanied it there, meeting the Supreme Chancellor on a landing pad as he placed the beast in Dr. Boll's care."}, {"tag": "p", "text": "Opinions on what to do with the beast differed greatly within the small circle of those who knew of its existence. When Senator Amidala caught wind of Palpatine's plan to kill it, she contacted Kenobi, who invited Skywalker to meet him in the Senate building. R2-D2 accompanied his master and greeted C-3PO, who was attending Amidala and Kenobi. The Senator convinced her husband to appeal to his friend Palpatine, and the droids joined their masters in appearing before Palpatine in the Chancellor's Suite. As Skywalker and Amidala discussed their options with Palpatine and Vice Chair Mas Amedda, the Zillo Beast meanwhile escaped from its captivity and began charging through Coruscant's cityscape. R2-D2 displayed a hologram to Skywalker from one of the clone troopers attempting to halt it, but when the beast reached the Chancellor's office, everyone present evacuated through an emergency escape route. Amedda had previously excused himself from the discussion, but Palpatine, Skywalker, Amidala, R2-D2, and C-3PO boarded an executive ship piloted by a Senate Commando. As the commando took the ship into the air, it was grabbed by one of the Zillo Beast's massive hands."}, {"tag": "p", "text": "Skywalker used his lightsaber to cleave the ship clean in half, sending the bow and all six passengers sliding down the exterior of the Senate Rotunda. R2-D2 skidded down the side of the building, and used his tow cable to catch himself in place. C-3PO landed atop him, but the astromech droid soon disengaged himself from the cable and used his booster rockets to make his way over to Palpatine. The Senate Commando sacrificed himself to the rampaging Zillo beast as the Chancellor rode a flying R2-D2 to safety. Clone troopers in LAAT gunships used gas bombs to kill the creature and end the threat it posed to Coruscant's citizens, and the poison they emitted was held back with the Force by Skywalker, as well as Yoda and Aayla Secura, who had been attempting to engage the beast. R2-D2, Palpatine, and the three Jedi remained safe from the poison gas, as did Amidala and C-3PO, who had also safely landed. The following morning, the entire party was present as the Zillo Beast's corpse was taken away from the scene."}, {"tag": "h4", "text": "The fighting thickens"}, {"tag": "p", "text": "When Skywalker and Windu were sent to the Star Destroyer Endurance to greet a detachment of Clone cadets from the Clone Youth Brigade, R2-D2 stayed at his master's side, and was present when the group of youngsters were shown the ship's bridge. Several of the cadets were given the opportunity to fire the Destroyer's guns at skeet targets launched by Sergeant Stew, and R2-D2 bore witness to Boba Fett, now a bounty hunter, hit all of his targets with one shot. Fett was infiltrating the group of his brethren in an attempt to avenge his father's death and kill Windu. When Fett sabotaged the ship, R2-D2 was on the bridge when Skywalker unsuccessfully attempted to persuade Admiral Shoan Kilian to evacuate the failing Destroyer, and then evacuated with Skywalker in the Jedi Knight's interceptor. As the Endurance crashed onto the planet Vanqor, R2-D2 and Skywalker took their interceptor to rescue the young clone cadets from an escape pod that Fett had left them in after escaping on his ship, the Slave I."}, {"tag": "p", "text": "As the occupants of the many jettisoned escape pods were rescued, Skywalker and Windu took their fighters planetside to search for Kilian and his command crew. Setting down behind the crashed Star Destroyer, they proceeded on foot along with R2-D2 and Windu's astromech R8-B7. R2-D2 spotted several gundarks following them, but the group soldiered on, and R2-D2 discovered the corpse of a clone trooper that had been shot following the crash. The two Jedi proceeded to the ship's bridge and ordered the droids to remain on the ground and scan for any additional survivors. Instead, the droids found two gundarks, who ripped R8-B7 apart. R2-D2's attempts to help his companion saw him swatted away. Before the gundarks could seize him, however, they were scared off by falling debris from an explosion on the bridge. R2-D2 boarded the downed vessel and found the two Jedi trapped under a pile of debris; when he attempted to move it, Skywalker warned him that the effort would cause the entire bridge to collapse. The droid was thus instructed to return to the starfighters and call the Jedi Temple for help. On his way out of the ship, he spotted Fett and fellow bounty hunters Aurra Sing and Castas approaching on speeder bikes. As the bounty hunters climbed a turbolift shaft into the ship, hoping to find Windu's corpse, R2-D2 repeatedly dropped debris on them. After he dropped a downed clone trooper's grenade, the bounty hunters fled the ship, deciding to destroy it instead."}, {"tag": "p", "text": "R2-D2 proceeded to Skywalker's fighter, but was met by a gundark who lifted him from the ground. The astromech droid shot one end of his tow cable to the creature's forehead and the other to the fighter, and after escaping from the gundark's grasp, set the fighter to autopilot, sending it and the attached gundark rocketing into the side of the Star Destroyer. R2-D2 then climbed inside of the droid socket of Windu's starfighter and lifted off of the ground, but was pursued by the Slave I, whose occupants believed that Windu was flying the interceptor. R2-D2 evaded their laserfire and took the ship out of the planet's atmosphere, but a shot from Fett destroyed his communications dish. As he neared the two parked hyperdrive docking rings, Fett destroyed one, but R2-D2 managed to lock into the other and take the fighter into hyperspace. Arriving at the Jedi Temple on Coruscant, he raced through the temple's hallways and into a briefing room, where Plo Koon and Tano were in the midst of a briefing. In a frenzy, R2-D2 attempted to shove Koon's astromech out of the room's computer terminal, but the scuffle was broken up by Tano. When she identified R2-D2 to Koon, the Jedi Master allowed him to play a recording he had taken of Skywalker issuing his instructions, and Koon and Tano immediately prepared to leave. They brought R2-D2 and a contingent of clone troopers to Vanqor, where they found the Endurance suffering from compounded damage and in its final throes. From an LAAT gunship, Koon and Tano used the Force to hold the Star Destroyer together while several clones rescued Skywalker and Windu. The gunship was taken a safe distance away from the exploding vessel, and as Skywalker and Windu were taken away on gurneys, the Master of the Order thanked R2-D2 for his assistance."}, {"tag": "h4", "text": "A curious caper"}, {"tag": "p", "text": "When a deadly series of groundquakes shook the planet Aleen, R2-D2 and C-3PO were assigned to a Republic relief team that was dispatched to the world—while the protocol droid acted as a translator between the clone trooper Wolfpack and the native Aleena, instructions on how to operate the delivered equipment were uploaded into R2-D2. After riding LAATs into a ruined city, the droids and Clone Commander Wolffe were greeted by the Aleena King Manchucho, who heralded their arrival as a sign that the \"Gods below\" would once more know peace. When a brief aftershock rumbled through the city, Wolffe dismissed Manchucho's puzzling claim that his team needed to \"make peace in the ground\" and dispatched R2-D2 and Sergeant Sinker to the mainframe computer station. Inside the destroyed building, the astromech droid ran metrics on structural degradation. The results were negative, and he began to download his program into the main computer. Another aftershock hit, but an unworried Sinker left R2-D2 to his task. C-3PO arrived just as his friend was finishing up, and a small group of Aleena declared that they had something to show the two droids. R2-D2 and C-3PO followed them to a large hole in the ground that was mostly covered by a heavy seal. When yet another aftershock sent C-3PO tumbling into the hole, R2-D2 ignited his booster rockets and followed him down."}, {"tag": "p", "text": "The droids found themselves in a dark, subterranean cavern, and R2-D2's glowrod aided them as they searched for a way out. What they initially took to be daylight ahead revealed itself as phosphorescent plants in the midst of an underground forest. R2-D2 sprayed fire extinguishing foam at a beleaguered C-3PO when what appeared to be glowing insects kept surrounding him, but the action caused several of the trees to stand up and menacingly surround them. In fact members of the Kindalo species, they demanded to know why the droids had come underground and why the surface dwellers has disturbed their peace. As C-3PO parleyed with them, one Kindalo revealed that the ground had shaken to keep the surface air—deadly to their kind—out of the underground. The protocol droid offered to help them, and he and R2-D2 quickly departed when they were pointed in the direction of a being called Orphne. They made their way to a chamber, where the glowing insects reappeared and metamorphosed into a radiant female being: Orphne."}, {"tag": "p", "text": "Orphne told the droids that a covenant had once existed between the Aleena and the subterranean dwellers, but the movement of surface air to their world without going through the natural filtering process had effectively breached the covenant. Consequently, the underground dwellers had caused the groundquakes. When C-3PO offered to seal the breach and prevent more Aleena deaths, Orphne spoke a riddle before disappearing: \"You can run but can not walk. You have a mouth but cannot talk. You have a head but never weep. You have a bed but never sleep. Ask yourself, who are you?\" R2-D2 played back a recording of her telling the riddle, and as C-3PO pondered the puzzle, the astromech examined several decorated circles on the chamber floor. He realized that they represented the four elements, and when he reached water, he sprayed some on the circle. He had solved the riddle—the answer was a river—and he joined C-3PO inside the central circle as it rose into the air on a jet of water and carried them back to Aleen's surface."}, {"tag": "p", "text": "The two were thrown high into the air and sent to a landing next to the hole through which they had initially fallen. The underground air was rising through it and causing the nearby Aleena to become sick, and R2-D2 began pulling on it with his cable gun. An added push from C-3PO helped seal the hole, and the two worlds were once more separated. Several clone troopers arrived at that moment to retrieve them, and as they made their way back to an LAAT to leave the planet, Manchucho thanked C-3PO while an Aleena child hugged R2-D2. With the clones ignorant of the droids' adventure, the group launched to return to their ship and proceed to a rendezvous with Jedi Master Adi Gallia."}, {"tag": "p", "text": "En route to Republic space aboard Gallia's Venator-class Star Destroyer, R2-D2 displayed a holographic image of Amidala, who told C-3PO that he was needed back on Coruscant. An attack from a Separatist fleet ruined those plans, however, as the Venator's main reactor was hit and an evacuation was ordered amidst the arrival of a Separatist boarding party. When the droids spotted General Grievous engaged in a lightsaber duel with Master Gallia, they fled to search for an escape pod but ended up in a hangar. R2-D2 knocked the R5-series astromech droid R5-L26 out of the way and rocketed up into the droid socket of a Y-wing, and after C-3PO reluctantly entered the cockpit, the astromech took them out into the unfolding space battle. After destroying one vulture droid, he turned and fled to the nearby planet Patitite Pattuna as the Venator was turned into stellar debris. A lone vulture droid followed them into the atmosphere and knocked out the fighter's reactor, but when it lost them in the cloud cover, R2-D2 brought the Y-wing around behind it and destroyed it. However, the Y-wing's reactor shut down, and the droids crash-landed into a marsh."}, {"tag": "p", "text": "R2-D2 and C-3PO exited the damaged ship and were quickly greeted by the world's powered spear-wielding natives: the Patitites, a diminutive species who stood less than half a meter tall. Both droids dismissed them as a threat just before being electrocuted by the spears and knocked to the ground. The Patitites tied both droids to the ground as they awaited the arrival of their leader; \"the Big Hay-Zu\" soon arrived on the scene and banished the droids from the planet, but an offended R2-D2 confronted him after being cut loose. He appealed to C-3PO to \"let me at him,\" and the protocol droid's attempts to prevent a fight ended with him inadvertently knocking R2-D2 down and turning Hay-Zu into a pile of goo. The Patitites cheered the droids for freeing them from Hay-Zu's despotism and set to work helping R2-D2 fix the Y-wing. While the astromech droid was completing repairs, C-3PO tried to introduce the Patitites to democracy, but his ersatz election caused the group to immediately begin squabbling over who had in fact won. The droids quickly boarded the repaired starfighter and left the Patitites to their new system of government; the backwash of the ship's ion drive knocked all of the Patitites over as it lifted off."}, {"tag": "p", "text": "On their way out of the world's atmosphere, the droids realized that both they and their ship were running out of power. They accordingly touched down on the nearby planet of Balnab, where R2-D2 scanned for a viable power source and led his companion off into the fog. It did not take long for a group of Balnab hunters to find them, ensnare them in a net, and bring them before their leader: an enormous hologram of Albee Dewaw, a being who appeared to be of the same species as most of the Balnab hunters. Dewaw immediately killed one of the hunters with a bolt of lightning for showing independent thought by bringing non-living things before him, and as C-3PO negotiated with him, R2-D2 wheeled off and discovered a computer terminal in a nearby canyon wall. After opening a hidden door with his scomp link, the astromech discovered that Dewaw was nothing more than a hologram controlled by four DUM-series pit droids. One of the droids told R2-D2 to find his own organic slaves, and R2-D2 responded by shoving him out into the open. With the ruse revealed, the Balnab hunters stormed the hidden room, and R2-D2 and C-3PO walked away from the ensuing lightfight as a series of explosions rocked the canyon."}, {"tag": "p", "text": "As they neared their crashed Y-wing, both droids were halted by their quickly depleting power supplies. R2-D2 was the first to run out of power completely, and his companion soon followed suit. However, it wasn't long before a group of Weequay pirates discovered them beneath the cover of a large mushroom; the salvagers brought both the droids and the Y-wing aboard their pirate ship, the Marauder, and plugged them both in. When both droids woke up aboard the vessel, they were ushered into a droid fighting ring, where the ASP-series droid K0-5D was destroying all challengers with his flamethrowers. When it was R2-D2 and C-3PO's turn to fight, they were saved by a hull breach—General Grievous's flagship had arrived in-system and fired on the Marauder for target practice."}, {"tag": "p", "text": "With C-3PO holding onto his frame, R2-D2 used his booster rockets to fly through the vacuum of space and land in a hangar aboard the Confederate vessel. Present B1 battle droids arrested them and sent them to the incinerator, where a conveyor belt edged them toward their doom. Both droids were saved when a Republic fleet arrived and attacked; R2-D2 rocketed himself and C-3PO away from the incinerator in the midst of the chaos and found both Adi Gallia and Plo Koon destroying a small resistance force of battle droids. Grievous had fled, leaving the Republic forces triumphant, and a stunned Commander Wolffe recognized R2-D2 and C-3PO. As the droids rejoined their allies, C-3PO regaled Wolffe with an account of their adventures."}, {"tag": "h4", "text": "Work with D-Squad"}, {"tag": "p", "text": "Soon after, R2-D2 was posted to D-Squad, along with M5-BZ, U9-C4, QT-KT and WAC-47, which was commanded by Colonel Meebur Gascon, on a mission to steal a data encryption module. Before the mission, Doctor Gubacher modified the droids, R2-D2 receiving upgraded rocket boosters. After being brought aboard Aut-O's flagship by a tractor beam, D-Squad went instantly to the vault, in which the module was housed. U9-C4 cut the power momentarily, so the vault was in manual override, while WAC-47 distracted the two B2 super battle droid guards, and locked them in an elevator."}, {"tag": "p", "text": "Later, M5-BZ was incapacitated trying to crack the vault. M5 was the mission's only Republic loss. While trying to retrieve the module, the Super tactical droid Aut-O burst into the room. R2-D2 turned off the gravity, and a skirmish between D-Squad and the Separatists broke out. Later in the skirmish, WAC-47 turned the gravity back on, and Aut-O fell to the ground. Then, R2's cable snapped, and he landed on Aut-O, decapitating him."}, {"tag": "p", "text": "On their way out of the Dreadnought, WAC and R2-D2 paused at the destroyed body of M5-BZ. While Gascon did not approve at first, they were allowed to bring the droid with them for repairs once they got home."}, {"tag": "p", "text": "They then attempt to return to Coruscant, but they ended up caught in an ice-storm. As a result of the damages to their shuttle from an ice storm, R2 and the rest of D-squad managed to lead the rest of the group, save for WAC and Gascon, who had gotten separated from them due to internal squabbles, to a settlement on the barren planet. They rendezvoused with Gascon and WAC (the latter being promoted to Corporal due to \"thinking like him.\")"}, {"tag": "p", "text": "Upon rendezvousing with each other, R2 and the rest of D-squad informed Gascon and WAC the presence of Separatists on Abafar. They eventually encountered a chef named Gregor, who was actually a clone commando presumed MIA during the Battle of Sarrish, who was suffering amnesia, also revealing that Borkus hid the truth from him. Eventually Gregor managed to turn the tables on Borkus, and left him to be tied up, although not before he and the rest of D-Squad learned that the Separatists had planned to use mined rhydonium fuel on one of the Republic's Venator-class Star Destroyers to blow it up. D-Squad deduced that Borkus was indeed honest about this revelation, and decided to save the cruiser. They were able to escape with Gascon when caught in an ambush, although Gregor ended up sacrificing himself to hold the Separatists off."}, {"tag": "p", "text": "D-Squad then located the Venator-class Star Destroyer, the Renown, and proceeded to try to locate it. However, R2 and the other members save for Gascon were suspicious at the lack of crew members and the closed blast doors, with their suspicions eventually being confirmed when the \"clone officers\" turned out to be holograms and the Renown entered hyperspace. R2 eventually deduced a device onboard as a bomb trigger, and upon discovery that the vessel had rows of rhydonium canisters deduced that they planned to take out several Republic ships. R2 and the other members of D-Squad also encountered BNI-393, also learning that the target of the Renown was the Republic strategy conference. After caught in an ambush by Buzz droids, R2 and the rest of D-squad (except for BZ, who didn't make it in time before the gravity was restored and sucked out) and Bunny, was able to open the door and temporarily shut off gravity to suck the Buzz droids into hyperspace. R2 later stayed with the ship to ensure it didn't take out the space station Valor, nearly resulting in its destruction. Skywalker, however, was determined to find his friend when he learned of what had occurred, and managed to have him recovered and repaired."}, {"tag": "h4", "text": "Battle of Cato Neimoidia"}, {"tag": "p", "text": "During the defense of Cato Neimoidia, R2-D2 flew as a copilot for Anakin Skywalker in Skywalker's starfighter. During the battle, a Tri-fighter launched a discord missile at the fighter, and it became covered in buzz droids. Skywalker was able to remove most of the droids on the dorsal side of the starfighter with the Force and R2-D2's assistance, but he did not realize that many remained on the ventral side, and one of the droids drilled into the cockpit and shocked Skywalker, knocking him unconscious. Ahsoka Tano, Skywalker's wingmate, instructed R2-D2 to fly the fighter to a nearby cliff, and she jumped from her own starfighter to Skywalker's, cut the cockpit open with her lightsaber, and pulled Skywalker out as R2-D2 tried to land. Tano jumped away from the fighter with Skywalker as it flew over the cliff with R2-D2 still in the astromech socket. However, the droid escaped the fighter with the use of his rockets and rejoined the two Jedi on the cliff."}, {"tag": "h4", "text": "Mission to Scipio"}, {"tag": "p", "text": "Later, R2-D2 accompanied General Skywalker on a mission to Scipio to pick up Senator Amidala, who had been arrested by the local authorities for espionage. Senator Amidala had been sent to procure funds from the Banking Clan for the Galactic Republic. During her visit, she encountered her former friend, the Separatist Senator Rush Clovis. Clovis revealed that he had obtained evidence of the InterGalactic Banking Clan's corruption. After securing Senator Amidala's release, Skywalker and Amidala traveled to Clovis' alpine retreat where they the files from Clovis' vault. Together with Clovis, the couple escaped an attack by the bounty hunter Embo. Under Skywalker's orders, Artoo rendezvoused with the three humans and picked them up before Empbo could finish them off."}, {"tag": "h4", "text": "Yoda's Jedi trials"}, {"tag": "p", "text": "Under Skywalker's orders, R2-D2 later accompanied the Jedi Master Yoda on a quest as part of his Jedi trials. Earlier, Master Yoda had been contacted by the Force ghost of the late Master Qui-Gon Jinn. During the journey, Artoo sat in the socket of Yoda's Jedi starfighter. Their first stop was the remote swampy world of Dagobah. There, Yoda received further instructions to travel to the Origin of Life, a strange planet that lay in the middle of a cloud of golden energy."}, {"tag": "p", "text": "During their journey to the mysterious planet, R2-D2 and the starfighter's systems malfunctioned, forcing Yoda to place his faith in the Force to guide them to safety. After landing near a geyser, Yoda instructed R2-D2 to stay behind while he continued his journey into the geyser. After completing his Jedi trials there, Yoda traveled with R2-D2 to the planet Korriban, the ancient homeworld of the Sith. Yoda instructed the astromech droid to wait with his starfighter and to return to Coruscant if he had not returned within three days. Yoda completed his Jedi trials and saw a vision of the Great Jedi Purge, the rise of the Galactic Empire, and a new hope. However, he did not share any of his experiences with Artoo or his Jedi peers."}, {"tag": "h3", "text": "War's end"}, {"tag": "h4", "text": "Cleaning up messes"}, {"tag": "p", "text": "Thirty-one months into the war, Skywalker and Kenobi had both been serving on the front lines for nearly an entire uninterrupted year, and were consequently granted a ten-day reprieve. Skywalker and R2-D2 traveled to Naboo to visit Amidala in the lake country for some peaceful time away from the fighting. Shortly into the vacation, Kenobi arrived, and recruited a reluctant Skywalker to help him hunt Asajj Ventress, whom he alone believed to be still alive following a duel with Skywalker on Coruscant. Kenobi left immediately, and Skywalker and R2-D2 took Skywalker's Eta-2 Actis-class interceptor to rendezvous with him above Maramere in the Karthakk system. Kenobi flew an interceptor of his own, and as they waited in an empty system, a large Separatist capital ship emerged from hyperspace. Skywalker blasted battle droids that waited on its hull, and the two Jedi entered the ship to search for Ventress."}, {"tag": "p", "text": "The arrival of the ship had in fact been orchestrated by the Separatist commander Durge, who planned on using Kenobi's obsession with finding Ventress to kill the Jedi Master. R2-D2 waited in Skywalker's starfighter as the two Jedi explored the ship. While Skywalker battled Durge, Kenobi commed R2-D2 and had the astromech droid locate the ship's secondary hangars. Skywalker lured Durge into an escape pod and fired it into Maramere's sun, and Kenobi found a travel log inside one of Durge's droids indicating Ventress's presence at Boz Pity. They returned to their starfighters and escaped from the ship, which Durge had programmed to self-destruct. R2-D2 and the two Jedi prepared to take on a group of vulture droids that were waiting in space for them, but the timely arrival of senator Bail Organa of Alderaan in the Star Destroyer Intervention prevented the need. R2-D2 did not accompany Skywalker during the subsequent siege of Boz Pity, but the siege saw the end of Ventress's role in the war, as the Dark Jedi fled both the planet and her role in Separatist command."}, {"tag": "p", "text": "After three years of fighting, Senator Amidala was still seeking new member worlds for the Republic. R2-D2 was assigned to accompany her, Captain Typho, and C-3PO on a mission to the planet Bri'ahl, where Amidala negotiated with President Vuul. Although she told the droids to not stray too far from the Presidential Palace, the two took a ride on a Bri'ahlian Sky-sled and crashed it into a forest. C-3PO's head was separated from its body in the crash, and after a brief argument between R2-D2 and the head over whose fault the accident had been, the astromech left to retrieve the body. As he dragged it up a hill with his tow cable, his companion's head came tumbling down, and R2-D2 rocketed after it before retrieving it from the bottom of a river. On the river bank was a large mammoth, who did not take kindly to being electrocuted by R2-D2, and who responded by swatting both droids high into the air."}, {"tag": "p", "text": "R2-D2 and C-3PO's rough landing crushed three Bri'ahlian rebels who had secretly thrown their lot in with Count Dooku. The rebels had planned to storm the Presidential Palace and had outfitted their soldiers with clone trooper armor. R2-D2 made a minimal effort to reattach his companion's head, and when the droids came across the faux-troopers, loose servomotors in C-3PO caused his hand to slap one trooper in the face. The rebel fell to the ground and accidentally blasted his companion, which caused the other rebels to panic and begin blasting. When a thermal detonator was thrown, R2-D2 and C-3PO found themselves the last ones left standing. Unaware of the plot they had just foiled, they returned to the Palace, where Amidala chastised them for being out too late."}, {"tag": "p", "text": "As the Confederacy was pushed further and further from its former bases in the Core worlds, Skywalker and Kenobi participated in the Outer Rim Sieges, attacking key Separatist strongholds on the far side of the Galactic Slice. Thirty-six months into the war, Nute Gunray, still the viceroy of the Trade Federation, stopped at his purse world of Cato Neimoidia to loot his citadel before fleeing with the rest of the Separatist Council to the Outer Rim, and R2-D2 accompanied Skywalker and Kenobi in an attempt to capture him. Although Gunray escaped, a mechno-chair of his was discovered. In the citadel's launching bay, R2-D2 conversed with TC-16, Gunray's protocol droid, and then plugged his scomp link into the chair to run a diagnostic. The chair began walking away, and brought a frantic R2-D2 into a compact data room, where it plugged into a control console and programmed itself to self-destruct. Skywalker was able to disrupt the sequence, and in the process uncovered a hologram of Gunray addressing Darth Sidious. Kenobi had heard the name from Count Dooku on Geonosis, who had told him that Sidious was in control of the Republic Senate. As such, Master Yoda assigned Skywalker and Kenobi to hunt Sidious down."}, {"tag": "p", "text": "After following a lead to Xi Char, the two Jedi were en route to Escarte when new orders from the Jedi Council redirected them to Belderone to capture Grievous. R2-D2 flew in Skywalker's interceptor as he, Kenobi, Clone Fight Squad Seven, and sixty Republic capital ships engaged Grievous's Separatist fleet. Skywalker fought his way through enemy starfighters and attacked Grievous's flagship, the Invisible Hand, but the General and his fleet fled shortly into the battle. R2-D2 sustained damage and remained on Belderone while Skywalker and Kenobi continued their pursuit of the wayward Sith Lord; after being repaired by technicians, he rejoined his Jedi companions on a MedStar orbiting the planet before traveling to Tythe. Republic Intelligence claimed that Dooku was currently on the desert planet."}, {"tag": "p", "text": "R2-D2 flew in Skywalker's interceptor as a Republic battle group engaged a Separatist fleet over Tythe. With the space battle acting as a diversion, Skywalker and Kenobi took Red Squadron down the planet's gravity well to infiltrate the Separatist base. Separatist ground defenses destroyed every clone fighter in the squadron, but the two Jedi managed to land at and enter the base after spotting Dooku's signature starship. The Dooku they found was merely a hologram, however, and after the overwhelmed Separatist fleet departed the planet, the Republic battle group followed the Count's trail to Nelvaan. Skywalker lost his cybernetic arm battling forces of the Techno Union there, and afterwards, R2-D2 helped him fit himself with a new one aboard the Star Destroyer Integrity. The astromech droid then received and played an urgent message from Mace Windu on Coruscant: A Confederate fleet had struck at the galactic capital and kidnapped Chancellor Palpatine, and Skywalker and Kenobi were needed to return to Coruscant and rescue him."}, {"tag": "h4", "text": "Rescuing the Chancellor"}, {"tag": "p", "text": "Darth Sidious had planted false intelligence regarding Dooku's location in order to draw Skywalker, Kenobi, and much of the Republic's military strength away from its capital. Nevertheless, Skywalker and Kenobi brought the Fifth Fleet of the Republic Navy's Open Circle Fleet back to the ecumenopolis, themselves flying Eta-2's; R2-D2 was stationed in Skywalker's fighter while R4-P17 flew in Kenobi's. As the battle raged in the skies of Coruscant, the two Jedi took Clone Flight Squad Seven towards the Invisible Hand, but were met with resistance from several vulture droids and tri-fighters. R2-D2 helped Skywalker evade two missiles that had been fired at him, and electrocuted a buzz droid that made its way from Kenobi's fighter onto Skywalker's. When the two fighters landed in a hangar of the Invisible Hand, R2-D2 plugged into a computer terminal and located the Chancellor's homing beacon on the ship's observation deck. He was then instructed to remain with the fighters while the Jedi infiltrated the destroyer in search of the Chancellor. R2-D2 followed the orders, and hid himself when two B2 battle droids entered the hangar; he placed his comlink inside of his dome in order to mute the sound of a hailing from Kenobi. The sentries were alerted to his presence; however, as he plugged into the terminal to activate a turbolift that Kenobi was in, and lifted him off of the ground. R2-D2 responded by spraying them with fuel and setting it ablaze with his booster jets, destroying the two battle droids."}, {"tag": "p", "text": "After Skywalker and Kenobi succeeded in killing Count Dooku and rescuing the Chancellor; Skywalker commed R2-D2 and told him to activate another turbolift. However, due to damage inflicted by the Star Destroyer Guarlara, the artificial gravity, tensor fields, and inertial compensators of the Invisible Hand all began to fail, causing the astromech droid to plummet across the hangar into a pile of battle droid parts. When the ship's Neimoidian pilot brought its gravity back online, R2-D2 left the hangar and discovered the Jedi and the Chancellor caught in a ray shield in one of the ship's corridors. Before he could free them, a group of B2 battle droids and droidekas arrived and took the four captive, bringing them before General Grievous on the ship's bridge. Following some banter between the General and the Jedi, R2-D2 opened all of his panels and began shrieking; the distraction allowed the Jedi to recall their lightsabers from Grievous's cloak and to begin destroying the battle droids and Magnaguards present on the bridge. When the droids were subdued, Grievous fled, bringing all of the ship's escape pods with him. As the Invisible Hand continued to be battered by the Republic's Home Fleet Strike Group Five, it broke in half and began plummeting towards the planet's surface. R2-D2 helped Skywalker and Kenobi perform a crash-landing, extending the ship's drag fins in the process. With the Chancellor safe, the remnants of the Separatist armada fled to the Outer Rim, and R2-D2 accompanied Skywalker, Kenobi, and the Chancellor to the Senate Building where they were greeted by Mace Windu and the Senate's Loyalist Committee. R2-D2 was greeted by C-3PO, who was attending Senator Amidala, and entertained his golden friend with tales of the rescue."}, {"tag": "h4", "text": "A hero's fall"}, {"tag": "p", "text": "Over the next several days, R2-D2 witnessed several conversations between Skywalker and Amidala, and holographically recorded them. The days were harrowing ones for Skywalker, and they ultimately saw him fall to the dark side of the Force under the sway of Chancellor Palpatine, who was secretly also Darth Sidious. As Jedi across the galaxy were killed, Skywalker, now known as Darth Vader, brought the 501st Legion of clone troopers to the Jedi Temple and slaughtered all of the Jedi present; he afterwards took R2-D2 in his starfighter to Amidala's apartment, where R2-D2 had a brief conversation with C-3PO. Vader then traveled to the planet Mustafar on Sidious's orders, where, after instructing R2-D2 to remain with his starfighter, he killed every member of the Separatist Council, ending the war. When Amidala and C-3PO arrived on the planet, Vader saw that Kenobi had stowed away aboard their skiff, and began choking his wife with the Force; R2-D2 holographically recorded the incident. As Vader and Kenobi left the platform and engaged in a lightsaber duel, R2-D2 and C-3PO brought Amidala back aboard the skiff and attempted to stabilize her condition."}, {"tag": "p", "text": "Kenobi soon returned, having defeated Vader, and took the skiff to the planetoid Polis Massa to rendezvous with Yoda and Bail Organa. Amidala was brought to a medical center, where R2-D2, C-3PO, Kenobi, Organa and Yoda bore witness to the birth of two twins she had been carrying: Luke and Leia. Weakened and without the will to continue living, Amidala passed away on the operating table. As the five survivors brought her body to Naboo on Organa's corvette, the Sundered Heart, Kenobi and Yoda discussed the situation with Organa: The Jedi Order had nearly been completely wiped out, and the Republic had been reorganized into a Galactic Empire with Palpatine as its Emperor. Yoda and Kenobi went into hiding, the latter watching over Luke, who was entrusted to the Lars family on Tatooine. Leia was adopted by Organa and his wife; the twins would be kept safe from the Sith in the dark times ahead. Organa entrusted R2-D2 and C-3PO to Raymus Antilles, the Captain of the Tantive IV, who was instructed to treat them well and to wipe C-3PO's memory. Organa's hope was that the droids would one day belong to his daughter. Although R2-D2's inability to speak basic spared him from experiencing a memory wipe, it did undergo reprogramming to restrict access to the holo-recordings of Leia's birthparents, including Vader choking Amidala and her deathbed during delivery, to ensure that Leia's true parentage remained a secret."}, {"tag": "h3", "text": "Early Imperial era"}, {"tag": "h4", "text": "Separated from the Tantive IV"}, {"tag": "p", "text": "In the early years of the Empire's reign, the droid duo were in an escape pod of the Tantive IV while the ship's Chief Petty Officer, Corla Metonae, was supervising test launches of the pods in the Maramere system. When the pirates known as the Lok Revenants attacked the Tantive IV, it was forced to flee and to abandon its jettisoned pods. Bail Organa made the finding of such valuable property an imperative priority, but both R2-D2 and C-3PO were captured by the Lok Revenants, with whom they shared an adventure or two. After suddenly finding themselves free of their captors, the droids sought out the Intergalactic Droid Agency, who put them aboard a shuttle to the planet Dodz and their new master, the crystal merchant Lott Kemp."}, {"tag": "p", "text": "Upon arrival, they discovered that Kemp's home had been destroyed and that he had gone missing; a young orphan named Jost Ellon found them and became their de facto master. Ellon spent his life hiding from Dodz's Governor Kugg and his war droid Destroyer, but when R2-D2 and C-3PO discovered Ranger X-1, an old labor droid laying dormant in Ellon's home, they activated the ranger and brought it to the Dodz Citizen's Monthly Council to fight against Kugg. Threatened by Destroyer, the council had already agreed to pay the exorbitant taxes that Kugg was demanding; too late to stop him, C-3PO, R2-D2, and Ellon brought the Ranger to Kugg's mansion and saw it defeat Destroyer with help from R2-D2, who suffered micro-synapse damage during the battle. Kugg was sent to face intergalactic trial, and R2-D2 and C-3PO were placed aboard an Intergalactic Droid Agency shuttle that had been dispatched to retrieve and repair them."}, {"tag": "p", "text": "R2-D2 and C-3PO were brought to the droid repair station of the scientist Lonn Idd, but the Annoo-dat gangster Tig Fromm was aboard the space station in order to steal a powerful laser from the scientist. R2-D2 and C-3PO helped Idd's children, Vik and Nikki, free their father; C-3PO was able to destroy all of Fromm's hover guard droids while dressed as a guardian droid, allowing Vik to trap Fromm in a packing net and turn him over to the authorities. A grateful Lonn Idd repaired R2-D2 and assigned his children to ferry both droids to an Intergalactic Droid Agency station, where they could find new masters. The two counterparts were purchased almost immediately by Ambassador Zell of Majoor to act as tutors and companions of Zell's son Llez, who had dreams of dismantling C-3PO and using R2-D2 for entertainment purposes. During a diplomatic mission to Armath that saw Zell command a fleet of Majooran consular ships, Llez fled from his father and took up with the pirate Reddjak, but returned to his father when Reddjak was personally defeated by Zell."}, {"tag": "h4", "text": "A wrinkle in time"}, {"tag": "p", "text": "Following the encounter with Reddjak, Zell vowed to take a more active role in raising his son, and accordingly dismissed the droids. The Intergalactic Droid Agency arranged for their sale to an impoverished branch of the Republic Diplomatic Corps in the Thanium sector, where they were to be diplomatic couriers. When they arrived at the Royal Palace of the planet Sooma, they found Sooma's King Zornog being strangled by Plooz, the son of nearby Alzar's King Gokus. The furious Gokus believed that Zornog had kidnapped his son, but Sludd, First General to Alzar's forces, had in fact concocted a scheme to overthrow his King and had tricked Plooz into stowing away aboard a Sooman freighter. Zornog gave the droids his fastest starship in order to ferry the Prince back to his father, but en route, battleships under the command of General Sludd appeared. C-3PO hailed the vessels and informed them that Plooz was on board, but Sludd prepared to attack anyway; R2-D2 was ordered by the protocol droid to prepare the ship's hyperdrive. Hoping to help, Plooz inadvertently disrupted the ship's anti-matter pods, but with electron torpedoes incoming, R2-D2 was ordered by his counterpart to jump to hyperspace regardless."}, {"tag": "p", "text": "A bright pink opening surrounded the ship, and R2-D2 realized that they had created a time warp by causing an anti-matter overload upon jumping to hyperspace. The vessel sped through the Endor Gate which they had created, the ship traveled years into the future and into the Endor system. Plooz dashed for an escape pod while C-3PO was issuing instructions to R2-D2; as the infant's pod made its way towards the forest moon of Endor, R2-D2 and C-3PO landed the ship to give chase. On the moon, they met with Kneesaa a Jari Kintaka, an Ewok Princess and the daughter of Chief Chirpa of the Ewok's Bright Tree Village, who spoke an obscure dialect of the Inner Zuma Region that C-3PO was able to understand. Kneesaa brought them to a peace summit occurring between Chirpa's Council of Elders and King Gorneesh of the Duloks, another sentient species native to the moon. Gorneesh was holding a terrified Plooz over a chasm, and C-3PO demanded that he be let go. Just then, rays from Endor's primary star Ibleam reflected off of C-3PO's plating, giving him the glowing appearance of what the Duloks perceived to be an Ewok demon. The Duloks fled, and Ploz was rescued from the chasm by R2-D2 and the Ewok Wicket Wystri Warrick."}, {"tag": "p", "text": "After the Ewoks escorted the droids and Plooz back to their Sooman craft, the trio piloted the ship through the time warp seconds before it closed and returned to their own time. Sludd's fleet remained where they had left it and began firing on them, but C-3PO took control of the situation and was able to direct R2-D2 to land the damaged craft outside of Gokus's palace. As Plooz entered the palace to find his father, Sludd landed his own ship and held the two droids at gunpoint. When Gokus arrived, demanding an explanation from his general, R2-D2 played a recording of Sludd's earlier threat to kill Plooz and seize control of both Alzar and Sooma. Livid, Gokus had his general and his co-conspirators thrown in prison. The droids remained in Zornog's service but annoyed the fidgety king with their incessant bickering. When R2-D2 mistook a power socket for a computer port and inadvertently shorted out the palace's power system, Zornog abandoned them on the planet R-Duba. They made their way to The Droid Store of businessman Van P. Quist."}, {"tag": "p", "text": "R2-D2 was soon purchased by the human Kirk Windjammer, but was reunited with his counterpart when Baron Starlock of R-duba purchased C-3PO and betrayed his Prince, Jagoda of R-duba, by helping the people of Dorande attempt to conquer the planet. His efforts were thwarted by R2-D2, C-3PO, and Windjammer. The reunited droids left Jagoda's court and suggested Windjammer as Jagoda's new Chief Advisor. Their journey through the stars continued when they stowed away aboard a ship headed for Ord Gertoth."}, {"tag": "h4", "text": "Troubles with Tig Fromm"}, {"tag": "p", "text": "R2-D2 and C-3PO were summarily kicked off the ship at a one-woman refueling station operated by a Bimm businesswoman named Sindee. She became their new master and taught R2-D2 how to play dejarik, but a gambling addiction she harbored saw her lose both droids to the smuggler Zevel Hortine in a game of Liar's Cut. In the year 15 BBY, Hortine was arrested abover the planet Ingo, and he jettisoned a large amount of contraband from his ship's cargo bay. Both droids were in the bay at the time, and they landed in the planet's Vaj Desert. The droids began trekking across the sands and were soon spotted by two speeder jockeys, Thall Joben and Jord Dusat. Having been in search of an R2-unit, the two declared themselves the new masters of the droid duo and welcomed them into Joben's speeder. While traveling to the jockeys' auto-shop, they crossed into the desert's restricted zone and were pursued by seeker probe droids, but successfully evaded them. At the shop, R2-D2 and C-3PO helped fix up Joben and Dusat's speeders and were shown the White Witch, a heavily modified C/L-82 landspeeder speeder that the jockeys intended to enter into an upcoming race, with R2-D2 flying in its droid socket. When Joben left the shop for the night, he brought the droids with him, but noticed pursuit by an unknown party and hid his speeder accordingly. With the pursuers dodged, the trio returned to the shop, only to find that Dusat had been kidnapped. Following the arrival of Kea Moll, a young resistance fighter seeking a mechanic, R2-D2's sensors detected movement outside the shop. Investigating, Joben discovered that his speeder had been sabotaged, and soon found himself surrounded by hostile droids. R2-D2, C-3PO, and Moll took the White Witch outside and saved Joben, and then tracked the droids to a base belonging to Tig Fromm, the Anoo-Dat gangster that R2-D2 and C-3PO had previously encountered while in the service of Lonn Idd."}, {"tag": "p", "text": "R2-D2 infiltrated the base and intentionally alerted the guards to his presence. A Fromm Tower Droid opened the doors to the base in an effort to find the intruder and was swiftly decapitated by the White Witch, which zoomed into the open doors and made its way through a cave system after locating Dusat on a map of the complex. After coming to a locked door, Joben cut his way through with a lightsaber that a customer had previously left him, before taking R2-D2 in the White Witch through the base's tube system and rescuing Dusat. After recovering C-3PO and Moll, Joben piloted the speeder to the base's exit, only to find several droid cruisers waiting outside and firing at them. C-3PO activated several dormant tower droids, which began battling the cruisers; the White Witch was able to escape in the midst of the confusion, destroying several seeker probes that attempted to follow it. The speeder was then taken to Moll's ship, the Sand Sloth, where Moll, the droids, and their masters prepared to take the Witch to the Boonta Speeder Race. Aboard the ship, R2-D2 and C-3PO held a discussion regarding speeder racing before the ship jumped to the Annoo system. Following the jump, the droids made their way to the ship's hull to enact repairs. When C-3PO and the hyperdrive began to float away, R2-D2 was able to recover the protocol droid by wheeling him back towards the ship via a rope. The crew of the Sand Sloth needed a new hyperdrive, however, and traveled to Annoo to find one."}, {"tag": "p", "text": "Following a scuffle with another droid at Annoo customs, R2-D2 and C-3PO spotted two members of the Fromm Gang and began to cause a scene, offering a distraction that allowed their human companions to escape. Joben, Dusat, and Moll took the droids to the home of Kea's mother Demma, where R2-D2 and C-3PO cleaned several Sand sloth stalls while their masters slept. Adjacent to the stalls, C-3PO unintentionally activated a secret door leading to a rebel base of the Annoo Resistance. When the droids went to wake Joben up and inform him of their discovery, they found an assassin droid spraying the jockey with gas. A brief skirmish ensued that concluded with Moll arriving and shooting the assassin; her mother promptly arrived home and informed her guests that Sise Fromm, the leader of the Fromm gang, was trying to kill Joben and Dusat for having discovered his secret base on Ingo. In that base, the Fromm gang was developing a secret and deadly weapons satellite called the Trigon One."}, {"tag": "p", "text": "When Tig Fromm hid the Trigon One among Ingo's desert cliffs, Joben and Dusat found out as much after intercepting a transmission between Tig and his father. R2-D2 and C-3PO joined them as they raced to the weapons satellite in the White Witch and another speeder; while C-3PO and Joben fired their vehicle's blasters and distracted some guards, Dusat and R2-D2 entered the Trigon One. They successfully disconnected the computer's main memory, and the group returned to the speeder racers' shop to celebrate."}, {"tag": "p", "text": "The next morning, Dusat and Moll took the White Witch to a ship belonging to the Fromm gang, hoping to ride it back to Ingo and sabotage the Trigon One. When Joben, still in recovery from the gas, later woke up, he took the droids and followed his friends, finding them held captive by a pair of Annoo-Dat thugs at one of the gang's freighters. R2-D2 aided in knocking the gangsters unconscious in the ensuing confrontation, and Joben and Moll hid themselves in two cargo containers, giving C-3PO a thermal detonator to hold still until they reached Ingo. The droids and Dusat posed as laborers when more gang members passed by; Dusat then left the scene, intending to remain on Annoo and protect Demma. R2-D2and C-3PO were soon after witnesses to a conversation between Sise and Tig Fromm regarding their plans for the Trigon One. Under their guise as laborers, they boarded the freighter, and were accosted by two other droids during the journey to Ingo. However, a chance passage through a meteor shower saved them."}, {"tag": "h4", "text": "To take the Trigon"}, {"tag": "p", "text": "At the Fromm gang's base on Ingo, C-3PO saved the life of the gang's head of security, Vlix Oncard, by pushing him out of the way of falling debris. The grateful security chief agreed to take the container that Joben and Moll had hid inside of to the hangar that held the Trigon One. The droids began making their own way to the hangar, dropping Oncard's name in order to avoid trouble with rowdy gangsters that they passed. Two of the gangsters, however, unintentionally activated the thermal detonator. With only ten minutes until its detonation, the droids hurried to the hangar and rendezvoused with their companions. When several guard droids arrived, R2-D2 covered them with foam and knocked another one onto the ground; the astromech droid also closed a door before more members of the gang could arrive. R2-D2, C-3PO, Joben, and Moll boarded the Trigon One, and the thermal detonator destroyed the scaffolding holding the satellite in place. The team took the Trigon One into atmosphere, where R2-D2, having activated its weapons systems, destroyed several attacking droid fighters."}, {"tag": "p", "text": "Agents of the Fromm gang retaliated for the loss of the weapons satellite by kidnapping Moll. Oncard traveled to the racers' shop on Ingo and presented Tig Fromm's demands: the return of the Trigon One in exchange for Moll's freedom. Instead, R2-D2 devised a plan to rescue their friend, and the droids took a starship to Sise Fromm's stronghold on Annoo and infiltrated the palace. R2-D2 used a blinding ray to distract several guards, and knocked a guardian droid out of commission with his circuit board disruptor beam. The droids then rescued Moll, escaped, and returned to Ingo."}, {"tag": "p", "text": "R2-D2 and C-3PO were soon afterward kidnapped by the Fromm Gang and brought to their mining facility on the planet Aaron. Imprisoned at the bottom of the complex's eight levels, the droids managed to escape from their cell and ascend all eight levels, evading various Fromm Tower Droids, ceiling-mounted gun emplacements and other hazards along the way, and activating turbolifts by entering correct sequences of colored keys. After exiting the facility, the droids found Joben and Dusat waiting to rescue them."}, {"tag": "p", "text": "Back in Joben's care, R2-D2 devised a plan for destroying the Trigon One, and after taking it back to Ingo, he and Joben hid and sabotaged it, ensuring that any subsequent activation of its drives would send it on a collision course with the Fromm gang's stronghold on Annoo. Upon returning to Joben's auto-shop, they found the building surrounded by members of the Fromm gang. They recovered C-3PO and Moll in their speeder, but a subsequent chase through a nearby city concluded with the Fromm gang trapping them in a warehouse. The four were taken prisoner and brought to the Fromm gang's Annoo stronghold, where Joben informed Sise Fromm that he had taken the Trigon One to Ingo. They were then locked in a cell with Dusat, who had been previously captured along with Demma. R2-D2 hatched an escape plan, and C-3PO, preying on their guard's avarice, loudly claimed that his counterpart's dome was filled with jewels. Investigating, the guard was covered with foam by R2-D2, who then used his shock arm to zap Joben's binders. Joben freed his four companions and took Moll to rescue Demma, while Dusat and the droids made their way to a hangar and commandeered a ship. After discovering that the Trigon One was inbound, R2-D2 informed Dusat and C-3PO of the sabotage, and consequently took a cargo sled with C-3PO to aid Joben and Moll, knocking over several patrol droids in the process. The droids activated an evacuation alarm and brought Joben, Moll, and Demma back to the ship, which Dusat had hotwired. Aided by C-3PO's servomotors, he guided the ship away from the exploding base."}, {"tag": "p", "text": "With the Trigon One destroyed and the Fromm gang finished, Joben and Dusat could finally focus on the upcoming speeder race. En route to Boonta, R2-D2 and C-3PO were on the Sand Sloth's hull enacting repairs to the White Witch's power couplings when another starship appeared and began firing at them. R2-D2 quickly activated the hyperdrive via external controls, and the droids rode through hyperspace on the hull. After arriving at Boonta, an engine damaged in the firefight caused the Sand Sloth to crash into a scrapyard. An old Proto Droid named Proto One appeared and, after befriending R2-D2, offered to fix the ship. Moll agreed, and along with Joben and the droids, brought Dusat to a local hospital, as Dusat had injured an arm during the firefight. The White Witch had also been damaged in the crash, and when R2-D2 suggested that Proto One fix it, a jealous C-3PO enlisted the help of a droid named BL-17 instead. BL-17 offered the used of a garage that he claimed was owned by his master, and Moll accepted the offer, unaware that BL-17 was actually working for the bounty hunter Boba Fett. Fett had been hired by Sise Fromm, who wanted revenge on the group that had ruined his gang."}, {"tag": "p", "text": "While R2-D2 and Moll were fixing the Witch, C-3PO, unaware of BL-17's duplicity, became fast friends with the droid. When BL-17 remotely triggered a gas leak in the garage's welding tanks, Moll began losing consciousness, and R2-D2 found himself unable to open the doors. Thinking quickly, he programmed a heavy lifter to knock the door down, and brought Moll to safety outside just as Joben was arriving. Joben took Moll to the hospital and charged R2-D2 with guarding the Witch, but when C-3PO and BL-17 returned, the protocol droid blamed his old friend for any trouble that might have happened and agreed to BL-17's suggestion to move the speeder to the safety of a nearby processing plant. R2-D2 followed them to the plant, where he found that BL-17 had attacked Proto One. Distracting the duplicitous droid with his arrival, R2-D2 allowed C-3PO to body-check BL-17 into a pile of rubble which then buried him. Joben and Moll arrived, but when Fett appeared and began shooting at the group, Joben and R2-D2 fled in the Witch to participate in the imminent Boonta Race."}, {"tag": "p", "text": "During the race, Fett pursued the Witch in his own speeder, attempting to both harpoon and blast his quarry. R2-D2's shock arm and fire extinguisher counteracted the bounty hunter's efforts, however. When a thermal detonator that Tig Fromm had placed aboard the Witch shook free and landed on Fett's speeder, Joben won the race. While celebrating, he and Dusat were approached by Zebulon Dak, the owner of a powerful speeder corporation, who offered them both jobs. The jockeys eagerly accepted, but their mirth was interrupted by the arrival of Sise Fromm, Tig Fromm, and Vlix Oncard, who were fuming at having once again been foiled. Proto One arrived as well, however, and arrested them, but Fett was unimpressed by their meddling in his work after having hired him, and captured them in order to deliver them to Jabba the Hutt. R2-D2 and C-3PO joined their masters and Moll aboard the Sand Sloth, where they overheard a conversation between the humans: Dak would not allow R2-D2 and C-3PO to accompany the jockeys unless they were reprogrammed. Having grown attached to the droids' personalities, Joben and Dusat decided not to take the jobs. Accordingly, the droids fled the ship in an escape pod, hoping that their masters would be free to pursue their dreams."}, {"tag": "h4", "text": "The lost Prince"}, {"tag": "p", "text": "R2-D2 and C-3PO found their way back to the Intergalactic droid agency, whose agents found them a new owner in the form of Doodnik, a cantankerous chef who owned and operated a café on the planet Tyne's Horky. Arriving at the establishment in one of the world's mining colonies, the droids anticipated respectively being put to work as maintenance and translator droids, but were instead relegated to waiting tables. After tripping over one another and disrupting the meal of the crime lord Kleb Zellock, they were disowned by Doodnik and told never to return to the café. Desiring a master, R2-D2 and C-3PO found their way to a public auction within the colony, where an asking price of 500 keschels was given for the two of them and an android. C-3PO picked a young Human male out in the crowd and asked if he would buy them, but the sale was made for sixty keschels to Yorpo Mog, the bodyguard of Zellock whom R2-D2 had earlier sent face-first into his boss's soup. When Mog began manhandling the android, the young man that C-3PO had appealed to intervened and traded his mining droid for Mop's three acquisitions. Named Jann Tosh, the young man took his new comrades to his wheel bike, but was pursued by Mog after the bodyguard remembered that Zellock had charged him with acquiring the android. C-3PO piloted the vehicle away from Mog, but the bodyguard managed to board it before being quickly shaken off. Tosh and his companions then to return to Tosh's mine."}, {"tag": "p", "text": "Tosh's uncle Gundy was less-than-impressed that Tosh had returned home without a mining droid, and his vexation only increased when R2-D2's sensors discovered that the android was in fact an addle-brained member of the Tammuz-an species. Gundy kicked R2-D2 but injured his foot in the process, and put all three of his new acquisitions to work. R2-D2 and C-3PO were often helped by the Tammuz-an stranger, who displayed great strength and impressed Gundy by using it to rescue the miner from a collapsing mineshaft. Tosh dubbed the stranger Kez-Iban, a Bocce word meaning \"He That Returns from Death,\" and took him and the droids along as he brought an injured Gundy to a local hospital. When R2-D2 witnessed Mog take Kez-Iban away from the medical facility, Tosh took the droids back to Doodnik's, where they confronted Zellock, leading to a brawl erupting throughout the café. After a young female Human paralyzed one of Zellock's thugs with a miniature stunner, Tosh and the droids rushed out of the eatery, only to find Mog and several more thugs waiting for them. They were brought to Zellock's Nergon-14-filled mine and sentenced to perform labor, but escaped their chains when R2-D2 used a detached foreleg of C-3PO to deactivate the power restraints of the mine's power conductor. When the Tammuz-an Sollag arrived and presented Kez-Iban with a scepter, Kez-Iban's vitality was restored, and he revealed himself as Mon Julpa, Prince of Tammuz-an. He thanked Tosh for his kindness, but the joyful moment was cut short when R2-D2's sensors detected rising levels of combustible gas. Fearful of the Nergon-14's impending activation, Tosh, Julpa, Sollag, and the droids rushed out of the mine."}, {"tag": "p", "text": "Several mining droids attempted to repulse them, but were neutralized by R2-D2, C-3PO, and the power of Julpa's scepter. Commandeering a bulldozer, the desperate team drove it through a large door before ascending to Zellock's control platform in a turbolift. The Nergon-14 was activated by the gas leak just as they confronted Zellock and Mog, who fled from the base, pursued by Tosh and his allies. When the latter group slit up in order to find their way out of the mine's twisting tunnels, it was R2-D2 and C-3PO who came upon Zellock and Mog arriving at their getaway ship. C-3PO's foreleg, having gained some independence after being reattached by R2-D2, sprang forward and knocked a miniature stunner from Zellock's hand into Mog's, and Mog, having just been betrayed by his boss, fired the weapon at Zellock. Tosh, Julpa, and Sollag arrived, and the group brought Zellock's prone form onto the ship and escaped from the base just prior to its destruction. Returning to his mine, Tosh discovered that his uncle had found a large deposit of keschels where the mineshaft had earlier collapsed; Gundy polished and shone R2-D2 and C-3PO up, but informed them that he intended to keep them working hard at the mine."}, {"tag": "p", "text": "Hoping to help Julpa regain his rightful place as King of Tammuz-An, Tosh enlisted the help of a stranger named Old Iron Pants to take him, his droids, Julpa, and Sollag to the planet. Before he left his mine, Gundy recorded a farewell hologram inside of R2-D2 and instructed him to ensure that only Tosh received it. On the bridge of Iron Pants's ship, she revealed to Tosh that she was actually Jessica Meade, the stranger who had saved him inside Doodnik's Café. R2-D2 and C-3PO then rushed onto the bridge, where the astromech droid played the hologram to both Tosh and Meade in spite of Gundy's request. Afterwards, Julpa and Sollag entered the bridge, and the ship was attacked by the Dianoga, a hostile starship belonging to the pirate Kybo Ren. R2-D2 successfully detached the bridge, a starship in its own right, from the rest of the vessel, before the bounty hunter IG-88, having been hired by Tammuz-an's Vizier Zatec-Cha to take Julpa alive, arrived in-system in his own ship and crippled the Dianoga. Free of pirate trouble, Meade brought her ship to ground level on the planet and was hailed by ships belonging to the forces of Zatec-Cha. C-3PO asserted that it was the ineptitude of the ships' guards that had allowed them to be attacked by pirates; the guards, fearful of retribution from Zatec-Cha, left Meade's ship alone."}, {"tag": "p", "text": "Injured from the firefight, Meade was taken to a hospital by Sollag, while the others booked a room at a local inn. At the inn, Julpa revealed that he needed to infiltrate Zatec-Cha's fortress and reach the royal tower in order to hold his scepter up to the rising sun at dawn and be crowned King. Tosh noticed a spy outside their room and gave chase, while the droids left the inn to check on Meade at the hospital. Discovering that the Vizier's guards had escorted Meade and Sollag out of the hospital, they attempted to return to the inn but got lost on the way, eventually discovering Tosh surrounded by the spy, Vinga, and several of his companions in an alleyway. The distraction of their arrival prompted Tosh to start a fight with his foes, which R2-D2 and C-3PO helped him win by each grabbing a guard's wig and pulling at it, spinning the guard around until he collapsed. With under three hours until dawn, they rushed to the Vizier's palace to save their missing comrades, whom Julpa had joined the ranks of after being captured by IG-88. After entering the palace via a secret door that Julpa had revealed to them, Tosh and C-3PO fell through a trap door and were followed down by R2-D2. Landing without injury, they were chased by a giant droid that fired lasers from its photoreceptors, but their foe fell from a partially extended bridge into a pit of lava. The next room that the trio found their way into saw its ceiling begin to press in on them, but the crisis was averted when R2-D2 pressed a floor panel that caused the walls to follow suit; the stress created by the walls acting against the ceiling caused both elements to cease their pressure, allowing the trio to escape."}, {"tag": "p", "text": "Unfazed by the hazards, the trio pressed on, soon entering a pit where Julpa was being chased by a Durkii. The beast, however, lost its aggression and fell asleep when R2-D2 was able to remove several kleexs from its body. R2-D2 quickly grew affectionate toward the sleeping giant, but pressed on. He, C-3PO, and Tosh were joined by Julpa and Sollag, and rushed after Zatec-Cha to rescue Meade and recover the scepter. They dodged several barrels before Tosh mounted a Floater-935 repulsorlift vehicle to chase Zatec-Cha and his henchmen, who rode Ubrikkian Airhooks. In a chase around the royal tower, the scepter changed hands repeatedly before R2-D2, riding on an Imperial Sniper vehicle awkwardly piloted by C-3PO, grabbed it with his claw-arm. It fell again into the hands of Zatec-Cha, who readied himself to approach the Keeper of the Tower and present it at dawn. Landing his vehicle, C-3PO stood atop R2-D2's dome and donned a cloak over both of them, posing as Vinga, Zatec-Cha's assistant. When Meade wrestled the scepter from the Vizier's hands, C-3PO recovered it and tossed it to Julpa, who presented it to the keeper of the tower and was declared King of Tamuz-an. Now loyal to Julpa, the guards took Zatec-Cha and Vinga away. R2-D2 and C-3PO received medals, were polished and shined, and, along with Tosh, were appointed advisors to Julpa's court."}, {"tag": "h4", "text": "The revenge of Kybo Ren"}, {"tag": "p", "text": "Desperate to power his R-22 Spearhead fighters, Julpa tasked Tosh, Meade, and the droids with obtaining fuel and bringing it to Tammuz-an. Tosh flew in a Spearhead while Meade brought the droids aboard her ship. On the return flight to Tammuz-an, a ship was sent ahead containing the fuel, but R2-D2 and C-3PO were kept in the dark and told that it was a decoy meant to attract pirates. The pirate Kybo Ren fell for the ploy, and brought the Dianoga and several stolen Imperial TIE fighters against Meade and Tosh. Tosh was able to cripple the TIEs, but Ren and several of his crew boarded and seized control of Meade's ship. C-3PO was stunned with an ion bolt while contacting Tosh, and after Tosh surrendered, Ren brought his quarry to his base, an island grotto on Tarnoonga. R2-D2 reactivated his friend during the trip."}, {"tag": "p", "text": "Enamored with her fiery spirit, Ren personally brought Meade as a guest of honor to his court, while Tosh and the droids were separately escorted by guards. When C-3PO was too slow to step onto a turbolift and fell off a ledge, R2-D2 released an inflatable mattress from inside his dome to catch the falling protocol droid. Brought before Ren, Tosh and the droids learned that the pirate was planning to invade Tammuz-an, and had pursued the fuel in order to leave the planet defenseless. The following morning, he brought the trio on his skiff to the ocean surrounding his base, fitted Tosh with stun cuffs, and threw him into the ocean to be eaten by a Miridon sea monster. R2-D2 plunged into the water after his master, bringing an unwitting C-3PO with him, and activated a propeller to allow him to begin swimming through the ocean's depths. After fitting Tosh with a breath mask and breaking his stun cuffs with a shock of electricity, R2-D2 began evading the Miridon, Tosh hanging onto the droid and C-3PO hanging onto Tosh. The monster found itself stuck inside of a sunken ship, and R2-D2 propelled his allies back to Ren's base, which the trio entered via an underwater pipe."}, {"tag": "p", "text": "Back inside the base, they pulled two fishing guards into the water, and the droids donned their uniforms in order to infiltrate the base and rescue Meade. When C-3PO mistakenly woke a sleeping guard, a scuffle ensued that saw Tosh and the droids commandeer a boat and pilot it through the base's waters. Several guards gave chase in a boat of their own, but were intercepted by the Miridon, the beast having entered the base through the same pipe as Tosh and the droids. With the guards distracted, Ren stood alone against the trio, and was caught in a net by Meade, who had escaped from her cell. She joined Tosh and the droids in racing to their ships and escaping the planet, with the droids inside of Tosh's Spearhead. Several TIE fighters gave chase, leading the starfighter into the tractor beam of Ren's Gladiator-class Star Destroyer Demolisher that the pirate had stolen from an Imperial repair dock. When the spearhead was brought into a hangar of the Star Destroyer, Tosh was imprisoned and the droids were put to work loading arms as the warship jumped to Tammuz-an."}, {"tag": "p", "text": "As R2-D2 and C-3PO worked at loading proton torpedoes, the astromech droid inverted one before trapping their droid overseer on a magnetic hoist. The two then made their way to the detention level and freed Tosh, who raced to the bridge while the droids further sabotaged the ship's weapons systems. Having arrived at Tammuz-an, the Demolisher fired its turbolasers at Meade's ship, and Ren was shocked to discover that it was a decoy. The fully fueled Tammuz-an space navy arrived from the planet's atmosphere and engaged the Demolisher, which became crippled after attempting to fire the inverted torpedo. Tosh and the droids fled the ship in his Spearhead and returned to Tammuz-an, where the droids were treated to an oil bath, and Ren and his crew were placed in the dungeons."}, {"tag": "p", "text": "Soon after capturing Ren, Julpa invited the warrior chief Toda to his court, proposing a peace treaty and hoping to end a longstanding rivalry between the royal court and the warrior chief. R2-D2 and C-3PO prepared dessert for the occasion, and after accidentally tossing the prepared food out a window, made a second cake and rushed into the courtroom, crashing into a wall and ending up covered in the cake. Their hijinks cut tension that had been mounting between Toda and Sollag, but Toda remained suspicious of Julpa's motives and decided to wait until the following morning to give Julpa his answer. Later that evening, the doids and Tosh were working on Tosh's spearhead when C-3PO unintentionally sealed the hatch, trapping Tosh and R2-D2 inside. The two could only watch helplessly as Kybo Ren, having escaped from his cell, fired a miniature stunner at both Julpa and Toda's daughter Gerin. Tosh managed to free himself before being stunned himself, and Ren took Gerin and fled the planet in another spearhead. Toda was furious, but Julpa placated the warrior chief by sending Tosh and Meade to rescue Gerin and surrendering himself to Toda until she was safely returned."}, {"tag": "p", "text": "C-3PO hatched a plan to discover where Ren had brought Gerin. He entered the prison cell of Ren's first mate Jyn Obah and began shouting, with R2-D2 in tow, many of the astromech droid's weapons and tools extended menacingly. C-3PO begged a confused and frightened Obah to reveal the location, and gleaned the word \"Bogden\" from Obah's babbled response. The two droids then brought the news to Tosh and Meade, who took R2-D2 and C-3PO in spearheads to Bogden. In the planet's orbit, R2-D2 detected life-form readings in a shipwrecked starcruiser on the surface, and the rescue team proceeded to Ren's makeshift base. After they split up, R2-D2 and Meade came across Ren in a transmission room. They rushed at their foe but were repulsed by an energy web, and were promptly hung upside-down by several ensnaring vines. When Ren left the room, R2-D2 was able to free them with his buzzsaw, and the two used the surveillance system inside the room to contact Tosh and warn him that Ren was wandering the base. R2-D2 made his way to Tosh's location, leading several snarling Sungwas to begin chasing Ren. Along with Meade, he found Tosh, C-3PO, and Gerin, and the group followed their pirate foe to one of the base's landing platforms. Obah and several of Ren's other henchmen had arrived in Ren's ship with a captive Julpa, as Ren had contacted Toda and arranged a prisoner swap. When Ren refused to make the trade, Toda and several of his warriors burst forth from a secret compartment in Ren's ship and attacked Ren's gang. R2-D2 rushed into battle and began covering Ren's cronies with red goop, and C-3PO tripped Ren, allowing Julpa and Toda to subdue the pirate."}, {"tag": "p", "text": "Back on Tammuz-an, Meade prepared to return to Tyne's Horky, and Toda's young son Coby insisted that R2-D2 and C-3PO entertain him with tales of the rescue. Coby was soon after accepted into the Imperial space academy, and the droids and Tosh were assigned to escort him there. A passenger ship took them from Tammuz-an to Chuzalla, where they would be taking a connecting flight from the planet's spaceport Zallakesh. As Tosh searched for the connection, the droids watched over Coby, holding onto the inheritance he had received from his great-uncle and forbidding him to spend it foolishly. When members of Starhunter's Intergalactic Menagerie spotted Ingey, Coby's pet tessellated Arboreal binjinphant, they stole the creature and fled aboard their ship. Coby pounded on its door, but he and C-3PO ended up crashing to the ground when the ship lifted off."}, {"tag": "p", "text": "R2-D2 used Coby's money to purchase a Blackhawk Destroyer from a local merchant, and took Coby and C-3PO in the vessel to pursue the starhunters. C-3PO intervened and attached the destroyer to the side of the starhunters' vessel via magnetic landing gear; the trio thus traveled with the starhunters through hyperspace to the planet Dandelo. Within Dandelo's atmosphere, they detached the destroyer, but discovered that it was out of fuel and promptly crashed into the forested ground. Although the ship was destroyed, R2-D2 was able to send out a distress signal immediately before Dandelo's native Fuzzums subdued the trio. C-3PO understood their language, and was able to divert their spears by explaining Coby's missing pet. Moved by the boy's plight, the Fuzzums took the trio to the starhunters' base, where they witnessed Ingey being placed in a cell. After R2-D2 and C-3PO restrained Coby from rushing out of their hiding place in the woods, a plan was concocted to rescue both Ingey and several Fuzzums that the starhunters also held captive."}, {"tag": "p", "text": "A diversion was created by C-3PO, who imitated the call of a native spotted jugadoo and caused the starhunters to rush from their base into the forest in an attempt to catch the rare animal. R2-D2 and Coby rushed the base, climbing onto a catwalk and finding Ingey in a cell with a man named Greej. When R2-D2 sliced into the door controls and opened the cell, a patrol droid approached, but Greej rushed in front of Coby to protect the boy. R2-D2 fired a flare into the sky to signal the Fuzzums to enter the base, but was knocked over by the patrol droid and lost power. When he was later repaired, he discovered that Tosh had received his distress signal and had traveled to Dandelo, helping to subdue the starhunters. Coby and Greej made plans to return all of the starhunters' captive creatures to their natural habitats, and Tosh revealed that he had been accepted into the Imperial academy. After heartfelt goodbyes were exchanged, Tosh, Greej, and Coby departed the planet."}, {"tag": "h4", "text": "Later owners"}, {"tag": "p", "text": "While traveling coreward to the Imperial Academy on Raithal, Tosh dropped the droids off on the planet Manda, where he was scheduled to catch a commercial starliner. For weeks, R2-D2 and C-3PO worked at the spaceport's hotel, scrubbing saltwater tanks every morning after the checkout of aquatic guests. A new owner came in the form of Mungo Baobab, a wealthy heir to the Baobab Merchant Fleet, who purchased them while staying at the hotel. The droids made their way to the planaet Biitu to meet their new master but found him imprisoned by the Empire's Admiral Screed and a monstrous droid known as the Great Heep. After thwarting the Heep, the droids adventured with Baobab on Roon, where they found some Roonstones, participated in the Roon Colonial Games, and defeated Governor Koong of Tawntoom province."}, {"tag": "p", "text": "Following Koong's defeat, R2-D2 and C-3PO remained in the service of Baobab as their master expanded his family's Merchant Fleet and established lucrative trade between Roon, Manda, and Ryloth. When C-3PO discovered an epic poem etched into the crystalline structure of the Roonstones, their master sent both droids to the Baobab Archives to translate all of the engravings. The researchers had TelBrinTel science droids assigned to the task and were disinterested in the aid of an astromech or a protocol droid; they also took issue with R2-D2's pushiness and C-3PO's know-it-all attitude. As such, the researchers \"mistakenly\" arranged for the droids to be sold to the Arkanian Krellus Barzane, a trafficker of used technological goods and a renegade technolord. Without electronic confirmation of their orders, the droids had little recourse, and they helped their new owner stay one step ahead of her enemies for a time. Misfortune eventually caught up with her, and C-3PO and R2-D2 also discovered, to their horror, that the Fromm Gang had been released by Jabba the Hutt."}, {"tag": "p", "text": "At some point in time, the masterless droids made their way to a ship garage on Roon in a damaged hotrod. When R2-D2 fixed it, he made a special modification that allowed him to override the ship's controls. The ship was soon afterward stolen, and C-3PO alerted a technician named Nik, who revealed that the ship had taken off several minutes beforehand. The droids told Nik their secret communication code, which allowed the three of them to view the ship thief on a computer monitor: the Fromm Gang's own Vlix Oncard. R2-D2 simply jacked into the computer and overrode the craft's controls, however, and the ship returned to the garage. Oncard asked to be locked up for a long time rather than face the wrath of his boss."}, {"tag": "p", "text": "After being re-united with Jann Tosh, R2-D2 and C-3PO accompanied their master to Roon's communications satellite in order to pay a visit to Tosh's old friend, Professor Akary Smith. However, the trio were seized by Smith's droid, XR, upon their arrival, and brought before Smith, who revealed that his droid had been sabotaged. When one of Smith's friends appeared on a wallscreen, XR aborted the conversation with a laser blast, and the droids learned from Smith that the evil General Koong was controlling XR via a television camera. R2-D2 and C-3PO vowed to search for said camera, but R2-D2 instead fired his blaster at a mirror. The ricocheting blast destroyed XR, which set Smith free and foiled Koong's plans."}, {"tag": "p", "text": "During a visit to a space station, Tosh was making some purchases, and C-3PO fell through a trap door. R2-D2 began to cut his way into the floor, which confused Tosh, but the two eventually fell into the laboratory of one Professor Cantebarius H. Broom, who intended to capture and experiment on C-3PO. The professor drew a blaster on them, but the distraction allowed C-3PO to club the professor in the head with a piece of metal."}, {"tag": "p", "text": "While masterless, the droid duo visited Kea Moll on Annoo, and she offered to serve as their master for the duration of their visit. While they were aboard a starship, several fighters began to fire on them, and Moll surmised that they were intentionally missing in order to secure a top-secret information disk that she possessed. The disk contained instructions on how to build a nuclear-powered missile, and Vlix Oncard appeared on the starship's monitor and demanded that they make their way to Tig Fromm's fortress. En route, R2-D2 copied the disk's contents, and C-3PO blanked the original; when they were brought before Fromm, they happily gave him the empty disk and went on their way."}, {"tag": "p", "text": "While the droids were traveling in a starship in search of new adventures, they flew into a strange cloud, where C-3PO saw several phantom-like apparitions. They then discovered and boarded a satellite that they realized was producing smoke and thus the cloud—the satellite belonged to Tig Fromm, who intended for the cloud to eliminate all trace of passing vessels. The droids learned as much when they saw a video of Fromm revealing it on a monitor, so they simply flipped a switch to deactivate the device and left the satellite."}, {"tag": "p", "text": "Menial and unremarkable assignments followed until R2-D2 and C-3PO were purchased by the indulgent Governor Wena Havid of the Kalarba system, who explored the galaxy as a roving ambassador. Every droid aboard his opulent diplomatic starship was retuned, recalibrated, and treated to a lavish oil bath at least once daily. R2-D2 found that there was little for him to do in the fully automated environment, but he nevertheless enjoyed himself. When Wena's superiors caught wind of his extravagance, his funds were cut off and he was forced to repay millions of credits. Most of his possessions, including R2-D2 and C-3PO, were auctioned off, and a junk trader bought the two droids for a low price. In 5.5 BBY, the trader's new \"junk\" was placed onto a barge bound for Hosk Station, a city-covered moon that orbited Kalarba in Wena's own home system."}, {"tag": "p", "text": "Between Hosk Station and Kalarba, the droids had a number of adventures with Nak Pitareeze and his family, Olag Greck, and Jace Forno. R2-D2 and C-3PO later went with a police droid named Unit Zed to Nar Shaddaa, where Jace Forno blasted off C-3PO's right leg below the knee. However, the replacement leg that he got contained secret programming that overrode his regular personality. The new C-3PO led a droid rebellion against Boonda the Hutt. His original programming was later restored when R2-D2 replaced his leg. After that, the two droids were owned by an Ithorian botanist named Zorneth and then a diplomat, Counselor Harthan, before finding their way into the possession of Mistress Larka Nimondro, a young Tahlboorean who dreamed of seeing the stars."}, {"tag": "p", "text": "Larka gave way to other masters and mistresses, but R2-D2 and C-3PO eventually found their way back to the Royal House of Alderaan. After at least one year, they were reassigned to the Tantive IV and its droid labor pool. Both droids were instructed to never again enter an escape pod unless explicitly ordered to do so."}, {"tag": "p", "text": "In 2 BBY, R2-D2 accompanied Princess Leia Organa to Kashyyyk, where, officially, she was a Senatorial observer to the base construction to house Wookiee slaves, but unofficially, her trip was to keep Bail from speaking out against the Empire. When Galen Marek came to Kashyyyk, freeing the pair, Leia and R2-D2 left the planet."}, {"tag": "p", "text": "At some point between 2 BBY and 0 BBY, Captain Raymus Antilles lent the two droids to the Star Tours travel agency, a new intergalactic space line that sought to preserve unrestricted travel despite the tightening grip of the Galactic Empire. The Royal House of Alderaan was suspected by the Empire to have ties to the Rebel Alliance, and Antilles's move fueled Imperial suspicion that Star Tours was in fact operated by the Rebels."}, {"tag": "p", "text": "Prior to the departure of Star Tours Flight 1401, the agency's first flight, which was due to depart from Spaceport THX1138, R2-D2 and C-3PO were tasked with making last-minute repairs to the StarSpeeder 1000 that would be taking civilian passengers across the galaxy. Just before the scheduled takeoff, R2-D2 settled into the droid socket while the pilot droid, AC-38, left to inspect the exterior of the vessel. C-3PO settled into the pilot's seat to inspect a binary motivator, but the ship was quickly elevated to the passenger boarding level. The two droids were forced to fly the ship, even as Imperials attempted to halt them after discovering a Rebel spy on board. After fleeing the space station and into hyperspace, the droids piloted the ship through a harrowing experience and eventually received coordinates to a Rebel rendezvous point. They were able to safely deliver the Rebel spy. After the fiasco, R2-D2 and C-3PO were quietly delivered back to Antilles."}, {"tag": "p", "text": "The Rebel operative Shen-and-Gretta Pikeual-Angeles once won R2-D2 from Captain Antilles in a game of sabacc but traded him back for a field position."}, {"tag": "h3", "text": "Accidental heroes"}, {"tag": "h4", "text": "The secret mission"}, {"tag": "p", "text": "By 0 BBY, the Rebel Alliance's insurrection against the Empire had escalated into a full-scale Galactic Civil War. R2-D2 and C-3PO's service aboard the Tantive IV continued; as units of the droid pool, they were paired together, with the latter acting as the interpreter counterpart of the former. The corvette journeyed to the planet Ralltiir in that year, as Princess and Senator Leia Organa delivered military-grade equipment to Alliance operatives under the guise of being on a diplomatic mission to deliver supplies to the Ralltiiri High Council. The Empire was subjugating the planet, but contact from the Alliance operatives on-world, paired with information leaked by the Empire's Lord Tion during a dinner with Organa and her father Bail back on Alderaan, alerted the Royal House of Alderaan to the existence of a secret Imperial construction project: the Death Star, an immense battlestation with enough power to destroy an entire planet. A horrified Bail tipped off Alliance agents on Toprawa, who were then able to intercept the plans to the Death Star. Leia Organa prepared to take the Tantive IV there to retrieve them, and as the corvette was readied to depart Alderaan, R2-D2 and C-3PO boarded while father and daughter hugged farewell."}, {"tag": "p", "text": "En route to Toprawa, R2-D2 and C-3PO were pressed into service by the labor pool overseer, who needed an astromech droid and an interpreter for special work detail. The two reported to Captain Antilles and Princess Organa, who gave them a voice override ordering them to protect all references to the Princess being aboard the vessel and to unquestionably follow her orders. When the Tantive IV reverted to realspace in the Toprawa system, Organa ordered R2-D2 to exit through an airlock and pretend to make repairs on the navigation computer sensor suite, all the while making periodic reports to C-3PO via comlink. She hoped the deception would excuse their presence in restricted space, but the Imperial I-class Star Destroyer Devastator did not buy the ruse. A transmission containing the Death Star plans was beamed to the Tantive IV, and R2-D2 returned to the ship's interior just in time to make the jump to lightspeed and away from the pursuing Devastator."}, {"tag": "p", "text": "Organa's destination was Tatooine—her father believed that the Rebellion would need the assistance of Obi-Wan Kenobi in such a desperate hour. However, the Devastator followed them to the Tatoo system and attacked, as the Imperials were aware of the transmission that had been made. Antilles suspected a homing beacon had been smuggled aboard and realized that he could not trust any of the ship's crew; in a desperate bid to get the stolen plans to safety, Organa recalled that she still had restrictive access to R2-D2. Meanwhile, the astromech droid and his counterpart navigated their way through the Tantive IV's corridors as explosions rocked the ship. When the corvette was brought aboard the Devastator via tractor beam, Imperial stormtroopers boarded and engaged the stationed Rebel troopers in a firefight, and the two droids weaved their way through the laser blasts. When a hit was scored on the wall behind C-3PO, the exposed circuitry shot an electric current through the protocol droid, and R2-D2 helped free his counterpart from the tangled wires. They escaped the notice of Darth Vader, the Imperial Dark Lord of the Sith, as he passed by with a stormtrooper escort that had conquered the Rebel defenders."}, {"tag": "p", "text": "R2-D2 and C-3PO got separated in the melee, and the astromech made his way to the labor pool, where Organa was searching for him. She used her voice override and bid R2-D2 to holographically record a personal message to Kenobi, then gave the droid the coordinates of the old Jedi Master's location on-world. Her final gift was the stolen data tapes themselves and an order to deliver them at any cost. Organa snuck away when C-3PO caught up with his counterpart, and R2-D2 immediately made his way to an escape pod. C-3PO only joined him in the restricted area when a laser blast struck a nearby bulkhead, and the two launched for the surface of Tatooine. Captain Antilles had already jettisoned a number of decoy escape pods, and the Devastator's gunners neglected to shoot down the droids due to a lack of detected life forms aboard."}, {"tag": "p", "text": "R2-D2 steered the pod toward Kenobi's location, but they nevertheless landed in the middle of a desert. R2-D2 had to be helped out of the crashed pod by his counterpart. The astromech began to make his way in the Jedi's direction, but a skeptical C-3PO dismissed his claims of a secret mission and refused to follow him toward rocky terrain. The two set off in different directions, but C-3PO turned around to give his counterpart one last warning. A steadfast R2-D2 continued on his way until he suddenly fell through the sand and into a system of subterranean tunnels. C-3PO landed next to him after falling through himself, and the two were quickly surrounded by a group of mole creatures. C-3PO was able to communicate with them, and he told R2-D2 that the moles wished to serve the droids, their new Masters. R2-D2 was not so quick to trust them, but the underground dwellers carried the new arrivals through the tunnels, all the while chanting the word \"Gotar.\" Gotar turned out to be the name of a giant hungry acid lizard—C-3PO has misinterpreted the moles' declaration of \"serving them.\" The lizard gobbled the droids up but kept them in his mouth in order to allow the acid there to dissolve them, but R2-D2 shorted out his electrical system, which caused Gotar to spit them out so hard that they landed back on the sand above. Unfazed, R2-D2 continued on his way, but C-3PO refused to follow him, and the two finally parted ways."}, {"tag": "h4", "text": "Another Skywalker"}, {"tag": "p", "text": "R2-D2's journey took him through the rocky mesas of Tatooine's Jundland Wastes, where he was ambushed by a group of native Jawas. A shot from an ion blaster shut the astromech droid down, and when he awoke, he was inside their Sandcrawler with a restraining bolt attached to his torso. Also aboard were an assortment of other captured droids, including C-3PO, and the two counterparts had a joyful reunion. The Sandcrawler plowed through the desert, and R2-D2 shut himself down both to conserve energy and to tune out the protocol droid's complaints. Guided by a signal flare that was launched by the homestead's occupants, the Jawas made their way to a dwelling: The Lars homestead, which R2-D2 had once visited long ago. The astromech was woken up by his companion, and the two joined the line of droids who were marched outside to be displayed in front of a potential buyer. While they waited, R2-D2 covertly slipped out of line and made some modifications to fellow astromech droid R5-D4. After he finished, Owen Lars, now a much older man, approached the Sandcrawler along with his nephew: a nineteen-year-old Luke Skywalker."}, {"tag": "p", "text": "Lars dismissed R2-D2 as a potential purchase due to his beat-up look and talkative nature. R5-D4 was instead chosen, as was C-3PO, who sold himself as a droid who could understand both the binary language of moisture vaporators and the Bocce trade language. As C-3PO and R5-D4 followed Skywalker to the homestead, R5-D4's motivator blew, and the protocol droid convinced his new owners to purchase R2-D2 instead. The young Skywalker brought the droids into the homestead's tech dome, where R2-D2 recharged and C-3PO received an oil bath. Skywalker, meanwhile, passed the time by working on a T-16 skyhopper and complaining about his life on a dull planet. As he manually cleaned R2-D2, he grew excited when the talkative C-3PO revealed that the droids had been involved in the Rebellion. When Skywalker came across the datacard that the Princess had inserted into R2-D2, the astromech droid—hoping to trick the youngster into removing his restraining bolt—played an excerpt from Organa's holographic recording. In it, she spoke a single line: \"Help me, Obi-Wan Kenobi. You're my only hope.\" Skywalker was mesmerized by the image of the Princess, and R2-D2 suggested that he might be able to play the entire message if his bolt were removed. Skywalker obliged, at which point the astromech ceased playing the message entirely. A frustrated Skywalker left to eat dinner with his aunt and uncle, and R2-D2 promptly left a stammering C-3PO behind in order to cross the desert and find Obi-Wan Kenobi."}, {"tag": "p", "text": "After Tatooine's twin suns fell below the horizon, R2-D2 came across a camp of Tusken Raiders blocking a mountain pass. After sneaking up on a sentry and using his claw arm to twirl the raider into dizziness, the droid slipped underneath a bantha beast and traveled through the camp while hidden by the creature's hair. A raider eventually noticed the marks left in the sand by his treads, and R2-D2, now at the other side of the camp, fled. The Tuskens pursued him but were scared off when he projected a giant holographic image of C-3PO. R2-D2 continued across the Jundland Wastes, but Skywalker and C-3PO caught up to him in a landspeeder the next morning. They were intent on bringing him back to the homestead, and C-3PO suggested deactivating him, but the astromech detected some approaching lifeforms, and the group was soon attacked by the Tusken Raider URoRRuR'R'R. As Skywalker fainted and C-3PO tumbled backward over a sand dune, R2-D2 hid inside a nearby cave and shut down all but his most vital functions. He watched a group of Tuskens inspect the speeder, but they quickly ran off when they heard the call of a local Krayt dragon."}, {"tag": "p", "text": "As it turned out, the call had been imitated by an elderly Human man, who checked on the unconscious Skywalker and spied the astromech in his hiding place. He called on the droid to come out, and R2-D2, finding his voice reassuring, obliged. When Skywalker woke up, he recognized the old man as the local hermit Ben Kenobi; when he mentioned R2-D2's insistence on locating an \"Obi-Wan Kenobi,\" Ben revealed that Obi-Wan and he were one and the same. The sounds of more Tuskens reached their ears, and the group retrieved C-3PO before traveling to the safety of Kenobi's desert hut. Once in Obi-Wan's small hut, R2-D2 was finally able to play Leia's message to the correct recipient. Obi-Wan decided to follow her orders and take R2-D2 to Alderaan. After coping with the deaths of Luke's aunt and uncle, the group found transport in Mos Eisley; a young smuggler named Han Solo agreed to transport them to Alderaan in his ship, the Millennium Falcon. When they arrived where Alderaan should have been, it was no longer there, having been blown away by the Death Star."}, {"tag": "p", "text": "The Millennium Falcon was then captured by the Death Star I, which was still in the system. Evading stormtrooper inspections of the ship, this allowed the group the chance to rescue the Alderaanian Princess Leia Organa. As the Wookiee Chewbacca and the three Humans went searching for the Princess' cell and the tractor beam controls, R2-D2 and C-3PO took position in a communications room. Once discovered, the pair pretended to be Imperial droids, and managed to communicate with the group in time for R2-D2 to rescue them from a trash compactor. After escaping from the Death Star I, at the cost of Obi-Wan's life, R2-D2 was finally delivered to the Rebel Alliance on Yavin 4, bringing the Death Star I plans with him and allowing the Alliance to defend themselves against the battle station. R2-D2 acted as Luke's astromech during the attack on the station. He was severely damaged during the battle, ironically by his former friend and owner Darth Vader, but Rebel mechanics were able to restore him. During the restoration process, the mechanics uncovered an image of Darth Vader's TIE Advanced x1 and his wingmen that the droid had recorded just prior to being shot out, which was later added to Voren Na'al's report on the Death Stars."}, {"tag": "h3", "text": "Robotic rebel"}, {"tag": "p", "text": "R2-D2 remained in the service of the Heroes of Yavin, participating in several missions alongside them. One of his first missions since his repairs was to accompany Luke and Leia to the Rebel Base at the Akuria System, as only he and C-3PO could understand any droids located there. Unfortunately, because he wasn't completely repaired, he inadvertently got the Millennium Falcon to veer severely off course, which resulted in a near run-in with an Imperial Fleet as well as escorting four droid children and a Keeper to another world. In another mission, when Luke reluctantly returned to Tatooine to investigate a crashed transport capsule and ended up infected by Bledsoe's Disease, R2 planned a rescue effort by operating a Sandcrawler used by the Jawas who picked up the transport capsule. Unfortunately for him and C-3PO, the plan backfired after breaching the wall of the Imperial Base that Luke was being held at, resulting in his and 3PO's capture and near dismantling before Luke rescued them."}, {"tag": "p", "text": "Around 1 ABY, C-3PO and R2-D2 visited a droid factory on Corellia in order to study the programming of the helper droids manufactured there. C-3PO requested a spacer to retrieve several droid interfaces for further analysis."}, {"tag": "p", "text": "When the Rebel Alliance established Echo Base on the icy planet of Hoth, he used his sensors to attempt to locate Luke when he failed to return from a scouting mission. Soon after Luke healed from his wampa attack, Echo Base suffered a mass coordinated attack by several of the ice creatures. R2-D2 himself narrowly escaped a wampa attack. During the fracas, R2-D2 and C-3PO were instrumental in helping the base's defenders discover a way to capture the creatures. They informed Major Bren Derlin, head of security at the base, that the high-shrilled beeping of astromech droids drove the wampas into berserker rages. Most of the wampas attacking from outside the base were driven off, but many still remained hiding within the base. Recordings of astromech droids were used to force out the remaining wampas from their dark crevasses so they could be stunned and captured. When the Empire attacked Hoth, R2-D2 was readied in Luke's X-wing fighter while Luke flew a snowspeeder in the Battle of Hoth. He thus did not board the Millennium Falcon with his usual companion, C-3PO, when it left the planet."}, {"tag": "p", "text": "When Luke returned to Echo Base following the destruction of its shield generators, he took R2-D2 to Dagobah. After Luke's crash-landing in the planet's swamps, R2-D2 became the potential meal of a Dragonsnake when he fell from the X-wing's hull. However, the beast found him inedible, and spat him into the jungle. R2-D2 later re-encountered Yoda at Dagobah, although their reunion resulted in R2 getting into a fight regarding Yoda taking a lamp from Luke Skywalker. R2-D2 was present during all of Luke's Jedi training from the Jedi Master Yoda on Dagobah, and was often levitated by Luke along with stones and other inanimate objects. The droid stayed with Luke as he flew to Cloud City. After being separated from his master in the city, he was spotted by C-3PO, who was in a disassembled state and tied to Chewbacca's back. When Chewbacca, Leia, Lando and the droids escaped to the Falcon, R2-D2 helped to repair a heavily damaged C-3PO. He also played a part in the escape from Cloud City, slicing computer systems, providing smoke screen, and fixing the Millennium Falcon's hyperdrive at the last minute, having learned it from the city's computer, facilitating escape from the Empire."}, {"tag": "p", "text": "C-3PO later complained about his leg, and said that he had an unnatural urge to kick himself all the time. But R2-D2 stated that 'there was nothing unnatural about that'."}, {"tag": "p", "text": "As part of his plan to rescue a carbonite-frozen Han Solo from the clutches of the gangster Jabba the Hutt, Luke sent R2-D2 and C-3PO to Jabba's Palace on Tatooine. After receiving an audience with Jabba, R2-D2 displayed a holographic image of Luke Skywalker, who greeted the notorious gangster, and offered the droids as gifts to the avaricious Hutt. The news came as a surprise to C-3PO, but R2-D2 had been aware of the impending offer for some time."}, {"tag": "p", "text": "The droid EV-9D9 put R2-D2 to work serving drinks on Jabba's sail barge. He did not see C-3PO again until Jabba brought his court to the Great Pit of Carkoon to witness the execution of his prisoners, Luke Skywalker, Han Solo, and Chewbacca. C-3PO was unaware that R2-D2 had smuggled Luke's newly constructed lightsaber into the palace, which he launched into the air, allowing Luke to catch it with the aid of the Force. This allowed Luke, Han, and Chewbacca to avoid being fed to the Sarlacc, and stirred up confusion in the sail barge, which in turn allowed Leia to kill the Hutt."}, {"tag": "p", "text": "R2-D2 later joined the Rebel strike team on Endor, where he helped to bring down the deflector shield so the fleet could destroy the new Death Star. While on Endor, he befriended the Ewok Wicket Wystri Warrick. During the Battle of Endor, he was hit by the laser blast of an Imperial stormtrooper while attempting to override a door-locking mechanism, and was severely damaged. He was soon repaired, however, and joined in the celebrations that took place that evening in Bright Tree Village."}, {"tag": "h3", "text": "After Endor"}, {"tag": "h4", "text": "Continued service"}, {"tag": "p", "text": "The Alliance was called into action just one day after the victory at Endor when an Imperial message drone addressed to the late Emperor was intercepted by Wedge Antilles in Endorian space. It spoke of an invasion of the remote planet Bakura by a mysterious alien species called the Ssi-ruuk, and when Rebel High Command agreed to send representatives to help repel the invasion and attempt to gain the allegiance of Bakura, R2-D2 and C-3PO joined the Leia Organa–led team. They arrived at Bakura and negotiated with Imperial governor Wilek Nereus while Rebel and Imperial fleets cooperated in order to ward off attacks by the Ssi-ruuvi Imperium. C-3PO was able to translate the Ssi-ruuvi language and help decipher the aliens' codes, and when he and R2-D2 managed to translate the Ssi-ruuvi communiqués, they learned that the invaders planned to attack Bakura in one hour."}, {"tag": "p", "text": "The Ssi-Ruuk were repelled by the combined fleets, and a Bakuran revolt ousted from power the treacherous Nereus, who had arrested and imprisoned Organa. The Ssi-Ruuk proved not to be the only invaders from beyond—after the Rebel Alliance transitioned into the Alliance of Free Planets, it found itself at war with the Nagai, a warfaring species from the satellite galaxy known as Firefist. R2-D2 served in the conflict, which ended when the Alliance and the Nagai united against the latter's old enemy, the Tofs. One of the war's major architects had been the Dark Lady of the Sith, Lumiya. The Alliance of Free Planets was ultimately short-lived, and a New Republic was declared early in 4 ABY."}, {"tag": "p", "text": "However, R2, alongside 3PO, did not participate during the incursions against the Tofs during the same conflict, as they had been loaned to the Star Tours travel agency in 4.3 ABY. At this time, the travel agency had been sending their new StarSpeeder 3000 models on an Endor Express tour in an attempt to cash in on the moon's sudden fame. Although C-3PO doubted the competency of the pilot droid, RX-24, who sported a \"Remove Before Flight\" factory tag, Star Tours Flight 45 left from a Star Tours spaceport with R2-D2 in the ship's droid socket. RX-24's questionable piloting saw the passenger vessel come out of lightspeed too late and into a field of icy comets, and soon afterward a battle with an Imperial Star Destroyer. R2-D2 repaired a damaged stabilizer during the battle, and RX-24 took the starship to join in a New Republic attack run against a massive Imperial battlestation. The attack was a success, and RX-24 ordered R2-D2 to take the craft into hyperspace. They returned to the spaceport whence they had come."}, {"tag": "p", "text": "One year after Endor, R2-D2 and C-3PO were with Solo, Organa, Skywalker, and Chewbacca during the Battle of Mindor against the Imperial Warlord Lord Shadowspawn. After the battle, R2-D2 overrode the Millennium Falcon's trash ejector system and launched himself into space in order to find Skywalker, who was missing following a personal encounter with Shadowspawn. The astromech droid located Skywalker via the Human's personal chemical signature—the Jedi Knight was inside an asteroid that was floating, derelict, in Mindorian space. Although he calculated both of their odds of survival as very low, R2-D2 hung on to the side of the asteroid on the off chance that he would somehow be able to help his master. When a Lambda-class T-4a shuttle passed by, the astromech droid made contact with it—and since such an outcome had literally incalculable odds, R2-D2 reflected that the universe was indeed an astonishing place."}, {"tag": "p", "text": "As the year progressed, the rogue Central Committee of Grand Moffs claimed the Imperial throne. R2-D2 and C-3PO became members of the Senate Planetary Intelligence Network (SPIN) for a short time, and underwent transformation by the Droid Modification Team to be disguised as Kessel droids in order to infiltrate a gathering of Committee-loyal Imperials and find out who was planning to take control of their Imperial faction. It turned out to be the three-eyed mutant Trioculus, who was later defeated by the New Republic."}, {"tag": "p", "text": "In the New Republic's early years, Luke Skywalker traveled the galaxy in search of any surviving records of the old Jedi Order. R2-D2 often accompanied him, including on a trip to the planet Toola in 8 ABY where the droid helped him find records of a Force-using sect called the Witches of Dathomir. Skywalker and R2-D2 later traveled from Coruscant—now the capital of the New Republic—to Dathomir, accompanied by Prince Isolder of the Hapes Consortium. Isolder sought Skywalker's sister, whom he hoped to marry as part of a proposed alliance between the Consortium and the New Republic, but a jealous Solo had spirited Organa off to Dathomir in order to reaffirm his love for her. The adventure on Dathomir saw R2-D2 and his friends encounter the Dathomiri Witches, including the dark side–using Nightsisters, as well as the Imperial Warlord Zsinj. R2-D2 intercepted a recording of a conversation between the Nightsisters and Zsinj, who were in league with one another, and both the Warlord and the Nightsister Gethzerion were ultimately defeated. Solo and Organa realized their true love for each other while Isolder fell for a witch named Teneniel Djo, and R2-D2 afterward attended the wedding of Han Solo and Leia Organa in Coruscant's Alderaanian Consulate."}, {"tag": "h4", "text": "The Empire strikes back"}, {"tag": "p", "text": "In the year 9 ABY, five years after the Battle of Endor, the New Republic was ruling from Coruscant as the dominant galactic power. The continuing war against the remnants of the Empire experienced a resurgence in that year, however, when the last Imperial Grand Admiral, Thrawn, returned from exile in the Unknown Regions and was given control of the Imperial fleet. R2-D2 flew in the droid socket of Luke Skywalker's X-wing during several battles of the subsequent Thrawn campaign. During the conflict, Skywalker heard of a reclusive old Jedi Master named Joruus C'baoth who lived on the backwater world of Jomark, and he and R2-D2 traveled there. Skywalker briefly trained under the erratic old man, reluctantly leaving R2-D2 with the X-wing so as not to displease C'baoth. Skywalker often returned to his starfighter at night to muse on C'baoth's strange teaching methods and to seek the astromech droid's advice; when R2-D2 suggested that C'baoth was a Dark Jedi, Skywalker startled the droid into speechlessness by opining that the old man was merely insane. The two departed the planet when Mara Jade—smuggler and former Emperor's Hand, and an enemy-turned-friend of Skywalker's—arrived and requested the Jedi Knight's help in springing her boss Talon Karrde from imprisonment aboard Thrawn's flagship, the Imperial Star Destroyer Chimaera. C'baoth refused to let Skywalker leave, and in the subsequent skirmish, R2-D2 knocked him unconscious by firing the X-wing's laser cannons close enough to C'baoth to hit him with their sonic shock."}, {"tag": "p", "text": "The rescue was a success, and R2-D2 and Skywalker later journeyed to the planet Poderis, where they barely escaped an ambush set by Thrawn and the Chimaera. The damage done to the X-wing during the battle prompted them to refuel on the planet Honoghr, home of the Noghri, whom Skywalker's sister was in the process of freeing from Imperial servitude. Upon their return to Coruscant, they learned that Organa Solo had given birth to the twins she had been carrying: Jacen and Jaina Solo. With help from Mara Jade, the Skywalker/Solo clan learned of a cloning facility on the planet Wayland, where Thrawn was producing clones in order to fuel his war machine. A strike team consisting of Skywalker, Solo, Calrissian, Chewbacca, Jade, R2-D2, C-3PO, and several Noghri commandos thus undertook a mission to Wayland in order to sabotage the clone production. On the planet's surface, R2-D2 cleared a path for the strike team through dense undergrowth, and they eventually reached their destination. There, the astromech droid accessed the facility's floor plans, and learned that C'baoth was inside of the building's throne room. A confrontation with the insane old man and a clone of Skywalker saw Jade kill both of their foes, and the mission was a success. Meanwhile, Thrawn was murdered during a battle with New Republic forces over the Bilbringi Shipyards, and his campaign was brought to a halt."}, {"tag": "p", "text": "Following Thrawn's death, surviving members of the Imperial Ruling Council joined forces with the remaining Imperial Fleet Commanders and launched from the Deep Core with stunning violence. With its fleet out of position in the Rim, the New Republic lost several key systems within days, and Coruscant once again fell to the Empire. The Imperial Mutiny soon followed, which saw various Imperial factions turn on each other in their attempts to reap the spoils of the Empire's recent successes. The New Republic took advantage of the confusion of the Imperial Civil War by using two captured Star Destroyers to conduct hit-and-run attacks inside of war zones. R2-D2 was on one such mission to Coruscant aboard the Star Destroyer Liberator, but the ship crashed into Imperial City, stranding R2-D2, Skywalker, Calrissian, Antilles, and the rest of the crewmembers on-world. They waited on Coruscant while Imperials battled around them, and Skywalker felt a great disturbance in the Force—someone using a powerful amount of dark side energy."}, {"tag": "p", "text": "Rescue came from Solo, Organa Solo, Chewbacca, and C-3PO aboard the Millennium Falcon several days later, but Skywalker refused to go with them, believing that he had to remain and confront the evil that he felt. When a powerful Force storm erupted and opened a hyperspace wormhole, Skywalker let it engulf him while the New Republic forces fled. R2-D2 remained steadfastly at his master's side, and the two of them were sucked into the hole. The storm carried them into an Imperial dungeon ship, which shuttled them to the Deep Core world of Byss. On the dark planet's surface, they were placed in an energized cage and taken to the Emperor's Citadel, where robed guards allowed them to proceed to the throne room. There, both R2-D2 and Skywalker confronted the Jedi Knight's dark opponent: Emperor Palpatine, alive in a clone body that contained the Sith Lord's essence. Palpatine invited Skywalker to become his apprentice, and R2-D2 responded by offering his master his lightsaber, which had been secured inside the droid's dome. Deciding that the only way to conquer the dark side was by learning its secrets, Skywalker knelt at his new master's side."}, {"tag": "p", "text": "As the new Supreme Commander of the Imperial Fleet, Skywalker commanded from Byss the Emperor's World Devastator superweapons as they ravaged the surface of the planet Mon Calamari. Solo, Chewbacca, Organa Solo, and C-3PO arrived on Byss to rescue the fallen Jedi, but the former two were imprisoned while the Emperor attempted to turn Organa Solo to the dark, as well. Skywalker, meanwhile, secretly stored Palpatine's master control signal and priority battle plans inside R2-D2, and everyone save for Skywalker was able to escape the planet. When the Millennium Falcon arrived back at Mon Calamari, R2-D2 beamed his new codes into the World Devastator's control computers, which caused the massive machines to turn on and destroy each other. The planet was saved, and not long afterward, Skywalker and Organa Solo were able to combine their powers to defeat the Emperor."}, {"tag": "p", "text": "Palpatine, however, was able to transfer his essence into another clone body and unite the squabbling Imperial factions under his banner, and his Dark Empire unleashed a devastating campaign against the galaxy. Hope was born within the storm on the planet of Nespis VIII, when Organa Solo gave birth to a third child: Anakin Solo. R2-D2 and C-3PO were on Nespis VIII and were nearly destroyed when they spotted an Imperial installing a homing beacon on the Millennium Falcon, but the timely arrival of Captain Solo and Chewbacca saved their platings. After the Emperor's final death in 11 ABY, R2-D2 played a significant role in ending the conflict by slicing into the computer systems of the Emperor's Eclipse II battleship and sending it on a collision course with the Galaxy Gun superweapon. The resulting impact destroyed both vessels, and a final missile fired by the latter was pulled into Byss's atmosphere, destroying the Imperial fortress world. With the Empire in ruins, the New Republic was able to retake Coruscant."}, {"tag": "h4", "text": "Return of the Jedi"}, {"tag": "p", "text": "With the New Republic again in control of the galaxy, Skywalker was given the blessing of the New Republic Ruling Council to finally found a New Jedi Order. R2-D2 and C-3PO aided him in his quest to track down Force-sensitives by searching through records stored in the former Imperial Information Center, located deep in Coruscant's Imperial Palace. While the Jedi Master was off investigating leads of his own, R2-D2 discovered a lead after several straight days of searching: a man called Tymmo, who displayed extraordinary luck in betting on the Blob races of the planet Umgul. Organa Solo sent the droids, accompanied by Lando Calrissian, to Umgul to investigate, but there they discovered that Tymmo had been cheating his way to victory by inserting chips into the Umgullian blobs that incited their fight-or-flight instincts. R2-D2 checked through a database and discovered that there was a one million credit reward offered for the safe return of Tymmo to his wife, Duchess Mistal of Dargul, and Calrissian negotiated a deal with the stable master: the two would split the reward money, and a reluctant Tymmo would be returned to his overbearing wife rather than face Umgul's death penalty."}, {"tag": "p", "text": "The droids next accompanied Calrissian and Skywalker to Kessel in search of Solo and Chewbacca, who had disappeared during a mission to the barren world. While being given a tour by Moruth Doole, administrator of the Spice Mines of Kessel, R2-D2 jacked into the mines' network in search of any mention of Solo but found none. He did, however, later on spot the Millennium Falcon in the hangar bay, and the group commandeered the ship in a flight from Doole's Defense Fleet. During the subsequent space battle, a previously unknown Imperial superweapon called the Sun Crusher emerged from the nearby Kessel Maw, piloted by Solo and Chewbacca in an escape from the hidden Imperial Maw Installation. The three Star Destroyers of the renegade Admiral Daala's Maw fleet were in hot pursuit, and although the Falcon and the Sun Crusher both escaped, Daala began her own guerrilla campaign against the New Republic. R2-D2, meanwhile, took his place at Skywalker's side as the Jedi Master began training the next generation of Jedi Knights at the new Jedi Academy on Yavin IV."}, {"tag": "p", "text": "R2-D2 and Skywalker prepped the academy by repairing the power-generating station of the old Rebel base, and when Skywalker's inaugural class arrived, the astromech droid served as an assistant to Skywalker, helping ferry the trainees from one exercise to another. He frequently found himself lifted in the air during telekinesis exercises. When the spirit of the long-dead Sith Lord Exar Kun possessed Skywalker's prize student, Kyp Durron, the two attacked Skywalker with the dark side and left him comatose. R2-D2 took to guarding his master's unconscious body in the following days, and when Kun's spirit set Sithspawn battle hydras upon the helpless Skywalker, it fell to R2-D2 and the two-year-old Jacen Solo to defend him. Guided by Skywalker's spirit, Jacen took up his uncle's lightsaber, and with help from the astromech's electric welding arm was able to fell the attackers. Kun's spirit was later defeated by the Jedi trainees, and a redeemed Kyp Durron helped destroy the Sun Crusher and end Daala's campaign."}, {"tag": "p", "text": "12 ABY saw R2-D2 and C-3PO accompany Skywalker, Solo, Organa Solo—by then the New Republic's Chief of State—the Solo children, and Chewbacca to a Herd Meet on the planet Ithor, where Skywalker hoped the Ithorian healers could in some way help one of his Jedi students, Nichos Marr. After contracting Quannot's Syndrome, Marr had used Ssi-Ruuk technology to transfer his consciousness into a droid body, and Skywalker wanted to help him re-become the man he had once been. On Ithor, R2-D2 recorded a conversation between Skywalker and Marr that saw the latter reach deep into his memory to recall hiding in a system of tunnels known as Plett's Well during the Great Jedi Purge. With R2-D2's help, the group was able to identify the well as a location on the planet Belsavis, and the astromech accompanied the Solos there to locate the fabled Children of the Jedi. R2-D2's access to various databases proved vital during the mission, and while he and Organa Solo were walking through the city of Plett's Well, he spotted Roganda Ismaren, a former Emperor's Hand."}, {"tag": "p", "text": "Ismaren was the mastermind of a plot to overthrow the New Republic, and her son, Irek, had had a subelectronic converter inserted into his brain that allowed him to perform mind tricks on droids. As such, R2-D2, under Irek's influence, planted overloaded blasters in a cupboard of the room where the Solos were staying. When Solo and Organa Solo awoke, R2-D2 brandished his welding arm menacingly, but a blaster bolt from Solo and a basin of water tossed by Organa Solo neutralized him and allowed Solo to remove the blasters' power packs at the last instant. Solo and Chewbacca repaired the droid and placed a restraining bolt on him, but Organa Solo, who still trusted R2-D2, listened to the Force and removed it while alone with him. She and R2-D2 then tracked down Ismaren and discovered that the former Hand was in league with the Imperial engineer Ohran Keldor."}, {"tag": "p", "text": "The two found the tunnels from Nichos Marr's memory, where an encounter with the Ismarens saw R2-D2—owing to having been patched together in a different fashion than before—able to resist Irek's control. The astromech escaped and led Solo and Chewbacca through the tunnels, where they rescued Organa Solo. When Skywalker and C-3PO arrived on Belsavis following an adventure on the lost Imperial superweapon Eye of Palpatine, the Jedi Master introduced R2-D2 to his new love: Callista, a Jedi of the Old Order who had recently been freed from imprisonment within the Eye's computers. R2-D2 returned to the Jedi Academy with the new couple, but Callista, whose essence had been transferred into the body of Skywalker's former student Cray Mingla, found herself insensitive to the Force. The astromech was left in the Solos' care on Coruscant when Skywalker took Callista across the galaxy on a quest to rediscover her Force connection, and R2-D2 and C-3PO discovered that Durga the Hutt, a recent diplomatic visitor to the galactic capital, had stolen the Death Star plans from the Imperial Palace."}, {"tag": "p", "text": "The droids accompanied Solo, Organa Solo, and Chewbacca on a followup mission to the Hutt world of Nal Hutta, but R2-D2 and the Wookiee took the Millennium Falcon to its moon, Nar Shaddaa, while the others remained on-world. There, a decrepit old slicer revealed to them that Durga had an Imperial customer named General Sulamar. Sulamar was in fact helping Durga build his own superweapon, the Darksaber, but even graver news was that Admiral Daala had unified the surviving Imperial Warlords into a united fleet and was planning to attack the Jedi Academy. R2-D2 helped during the defense of the world by activating the door controls of the temple hangar to crush an Imperial AT-ST walker, and Skywalker's Jedi students were ultimately able to repel the attack. Durga was meanwhile foiled when the incomplete Darksaber attempted to fire its superlaser and ended up destroying itself. Callista vanished into the galaxy to rediscover the Force on her own, and R2-D2 returned to the Academy."}, {"tag": "p", "text": "One year later, R2-D2 and his counterpart accompanied Organa Solo on a diplomatic mission to Nam Chorios, where she met with Representative Seti Ashgad aboard her flagship, the Borealis. Ashgad ended up kidnapping the Chief of State, and he and his ally Dzym unleashed the Death Seed plague upon the Borealis's crew, which forced the droids to escape in a lifeboat along with Yeoman Marcopius, who soon afterward died of the plague's effects. Unable to make their way to the New Republic base on nearby Cybloc XII, the droids were picked up by a scout named Bortrek and taken aboard his ship, the Pure Sabacc. The scout claimed the droids as his own and adapted R2-D2 as part of the ship's central core, which prompted the astromech to lock him in a hold, decrease its oxygen level, and demand to be dropped off on the nearby world of Nim Drovis. The stranded droids' many attempts to secure passage off of Nim Drovis at last got them to Cybloc XII, where they encountered Admiral Daala, now the leader of the pro-Imperial Independent Company of Settlers. She tortured R2-D2 and C-3PO into revealing that Ashgad had unleashed the Death Seed plague on the entire Meridian sector, and she subsequently pledged herself to a fight against Ashgad's corrupt ally, Moff Tol Getelles of the new Imperial Remnant. The Battle of Nam Chorios also involved a New Republic fleet, and it resulted in the defeat of Getelles, the rescue of Organa Solo, and the containment of the plague."}, {"tag": "p", "text": "R2-D2 was on Munto Codru wih Organa Solo, Chewbacca, and the Solo children in 14 ABY, when Jacen, Jaina, and Anakin were kidnapped. Afterward, the astromech droid continued to bother a broken Organa Solo until she followed him to her yacht, the Alderaan, where he showed her the electronic trace of a ship that had rocketed away from the planet in the kidnapping's aftermath. Before she could blast off in pursuit, R2-D2 covertly let Chewbacca—gravely injured during the kidnapping—onboard, and a furious Organa Solo ceased speaking to the astromech altogether when she discovered the Wookiee lying in the yacht's bunk. By following the trace and listening to the Force, Organa Solo found a sleeper ship deep in space, which R2-D2 revealed did not match the signature of the kidnappers' ship. Nevertheless, the trio explored the seemingly empty vessel, where they found the Firrerreon Rillao, trapped in a torture net. R2-D2's attempts to free her by jacking into a nearby data port saw him violently ejected and sprayed with a web silk countermeasure."}, {"tag": "p", "text": "After finally freeing her, the trio took Rillao aboard the Alderaan and continued on their hunt. The Firrereon led them to the bureaucratss of Chalcedon, who in turn pointed them toward Rillao's former husband, Lord Hethrir of the Empire Reborn, who had imprisoned her aboard the sleeper ship and later masterminded the kidnapping. After locating Hethrir's worldcraft, the Rebirth, Organa Solo and Chewbacca rescued Jacen and Jaina while R2-D2 and Rillao took over worldcraft piloting duties. Their destination was Crseih Station, where Organa Solo rendezvoused with Skywalker and Solo and prevented Hethrir from sacrificing Anakin Solo to the extradimensional being known as Waru. R2-D2 broke away from the main group to rescue C-3PO, who had been with Skywalker and Solo on the station but had been imprisoned by Hethrir. The group prepared to depart the station, which was due to be destroyed by the nearby crystallizing star Crseih, but R2-D2 delayed their flight by convincing the station to follow them out of the system and thus save the lives of all of its inhabitants."}, {"tag": "h4", "text": "Ghost ships and droid armies"}, {"tag": "p", "text": "When Skywalker left the Jedi Temple on a personal quest in 16 ABY, he brought C-3PO to Yavin IV to manage the Academy's administrative needs. Concurrently, Lando Calrissian was recruited by Admiral Hiram Drayson of the New Republic Intelligence Service to investigate the mysterious ghost ship known as the Teljkon Vagabond, and he came to the jungle moon to enlist both R2-D2 and C-3PO on his mission. Led by the Belarus-class medium cruiser Glorious of the New Republic Defense Fleet, the Teljkon Vagabond task force traveled to deep space near Gmar Askilon and trailed the ghost ship for twenty-two days, during which time it did nothing to acknowledge their presence. When they finally received a communication from it, R2-D2 and C-3PO matched it to a signal it had broadcasted during a sighting four years earlier, but the protocol droid was unable to translate the mysterious language. The cyborg Lobot—Calrissian's former assistant on Cloud City—matched it to the extinct Qella species, and R2-D2 determined that it was a partial representation of the Qellas' genetic code. Determined to find more answers inside the mysterious vessel, and worried that the task force's impatient Colonel Pakkpekatt would botch the mission with his next move, the four of them flew Calrissian's Lady Luck toward the Vagabond, which protected them from the Glorious's tractor beam after C-3PO sang the missing fragment of the genetic code over an open channel."}, {"tag": "p", "text": "After securing the retroactive blessing of a furious Pakkpekatt, Calrissian, Lobot, and the droids followed various flashes of light that emanated from the Vagabond's hull, which elicited the ship to open a portal on its surface. The four of them ventured inside, although Calrissian and Lobot required space suits in the zero-gravity environment. Lobot provided R2-D2 with a set of perceptual parameters that allowed the astromech to view the interior of the airlock from the viewpoint of the Khotta, a genetic relative of the Qella, and when R2-D2 projected the image for all to see, a lone spot on the membranous bulkhead stood out from its surroundings. Nothing happened when R2-D2 prodded it with his claw arm, but when Calrissian removed his space suit's glove and touched it with his bare skin, the portal closed and the Vagabond fled into hyperspace. Now separated from the rest of the task force, the quartet began planning their next move. R2-D2 searched for inflow vents leading into the airlock while C-3PO attempted to communicate with the ship on a secondary comm channel. R2-D2 found no vents, which prompted Calrissian and Lobot to use a cutting blaster to open a hole in the bulkhead and enter the rest of the ship. The Vagabond responded by dropping out of hyperspace and attempting to vent them into space, but the quartet scrambled through the hole and out of the airlock before the hole sealed itself."}, {"tag": "p", "text": "As the quartet explored the mysterious vessel, they found their progress impeded by the lack of gravity and the seemingly random arrangement of the ship. Their goal was to gain control of it before the droids ran out of power and the Humans ran out of oxygen. R2-D2 was able to create a holographic map as they went on, and seventy-one hours in, they located a control panel, which C-3PO inadvertently touched. He was electrocuted and shut down as a result, and R2-D2, who blamed Calrissian, refused to let the man near the protocol droid while he and Lobot enacted repairs. When they heard the Vagabond re-enter realspace, Calrissian rocketed toward the outer hull with his blaster and attached a tracking limpet. R2-D2 was mostly able to fix C-3PO, but he continued to blame Calrissian and refused to follow any more of the man's orders until Calrissian pointed out that such a refusal would get them all killed. The astromech's thoughts of mutiny faded away completely after everyone took a nap to recharge, and the quartet were able to make their way through various chambers when Calrissian and Lobot again used the touch of their bare hands to create doorways—each room contained a history lesson on the Qella. The Vagabond, meanwhile, had reverted to realspace within the Constitutional Protectorate of Prakith, and it was consequently attacked by two Protectorate frigates of the Protectorate's Grand Imperial Navy. The frigate Bloodprice was destroyed by the ghost ship, but the Gorath followed the Vagabond into hyperspace."}, {"tag": "p", "text": "During the hyperspace journey, the quartet deduced that the limpet had been destroyed, but Calrissian revealed a beckon call that he could use to summon the Lady Luck, which he did not want to use until they gained control of the Vagabond. C-3PO, however, activated it after they dropped out of hyperspace and were attacked by the Gorath. The frigate was destroyed, and Calrissian left to inspect the damage while Lobot and the droids continued their exploration of the ship, with R2-D2's map acting as a guide. Lobot left them to seek what he called the \"threshold of awareness\" of the Vagabond, a biological organism, and there he discovered that the ship was returning home to Maltha Obex, the Qella's ancestral homeworld, bearing the seeds of Qellan civilization. R2-D2 and C-3PO briefly powered down, and when they were turned back on by Calrissian, the ship had arrived at Maltha Obex. Lobot persuaded the Vagabond to turn a section of the hull transparent, and R2-D2 spotted and identified both the Lady Luck and a Dobrutz DB-Four starliner—commanded by Pakkpekatt, it had followed the Lady Luck after the activation of the beckon call."}, {"tag": "p", "text": "The Vagabond sat in space, awaiting contact from its homeworld, but Maltha Obex was in in the throngs of an ice age. R2-D2 and C-3PO soon used up the last of their power; when they were recharged, Skywalker had arrived aboard the Vagabond to lend aid to Calrissian. The Jedi Master and Lobot convinced the ship to use its energy beams to thaw the ice on Maltha Obex, which would eventually allow it to deposit the genetic material of the Qella that it carried, in turn reviving the species. The group finally evacuated the ship aboard Skywalker's Mud Sloth. R2-D2 returned to the Jedi Academy, but when Skywalker rushed to Coruscant in 17 ABY following a bombing of the Senate Hall, the astromech accompanied him. R2-D2 recruited C-3PO to help him investigate Skywalker's X-wing, which he believed was being sabotaged, but their efforts saw them briefly imprisoned by a Kloperian mechanic for trespassing in the hangar. When the droids were set free, they found Skywalker's X-wing wrongfully disassembled, and R2-D2 scooped up the starfighter's memory chips to bring to his master."}, {"tag": "p", "text": "Skywalker and R2-D2 returned to the hangar, where a young Human Tatooinian mechanic named Cole Fardreamer explained that General Wedge Antilles had authorized the reconditioning of all older X-wing models in the New Republic Starfighter Command complement to the new T-65D-A1 model. Although not part of the fleet, Skywalker's fighter had run afoul of the order; R2-D2 and Fardreamer set to work putting the Jedi Master's X-wing back together while Skywalker left Coruscant on a hunt for those responsible for the Senate bombing. Fardreamer viewed R2-D2 as an outdated model and had trouble seeing him as an individual rather than a generic droid unit, but he finally warmed up to the astromech when R2-D2 discovered a hidden bomb aboard the fighter. Investigating, Fardreamer found the same bomb inside several of the reconditioned X-wings within the same hangar, but his efforts saw him accused of sabotage by several Kloperians. The mechanics also shot and disabled R2-D2, but not before the astromech transmitted an emergency message to his counterpart. C-3PO arrived in the hangar at the same time as Antilles and Organa Solo, whom Fardreamer had insisted be summoned, and the New Republic's Chief of State was able to reactivate R2-D2. Realizing the danger posed by the far-reaching sabotage, Organa Solo ordered that all reconditioned X-wings be grounded."}, {"tag": "p", "text": "The two droids headed to the Senate Hall to independently investigate the bombing site, and R2-D2 found five detonators emblazoned with Imperial insignia identical to that found on the X-wing bombs. After rushing to inform Organa Solo, they discovered that she had taken a leave of absence from her presidency—a warlord named Kueller had wiped out the populations of Auyemesh and Pydyr, two moons of Almania, and had taken Skywalker hostage. Unable to see Mon Mothma, who was serving as Organa Solo's temporary replacement, R2-D2 sent an emergency message to Fardreamer and met the mechanic in a hangar. The astromech insisted that he knew the location from where the detonators came, and, despite C-3PO's protests, the three of them left Coruscant immediately in a stock light freighter, using Organa Solo's codes to get past space traffic control. R2-D2 guided them to a droid construction facility on the moon of Telti, where Fardreamer spoke with its owner, Brakiss, and R2-D2 snuck into the facility. He found himself stuck in a junk heap of unwanted astromech droids, and when he spoke to them, they revealed that detonators had been planted inside of them. R2-D2 then found himself facing the security droids of Kueller's Red Terror army, who had captured C-3PO, but R2-D2's new astromech friends charged at the Red Terror and allowed the two counterparts to escape."}, {"tag": "p", "text": "Making their way through the facility along with an army of hundreds of other astromechs, C-3PO and R2-D2 came across Brakiss, who threatened to use a droid scrambler on C-3PO if R2-D2 did not stop. More astromechs crashed through a glass panel, however, prompting Brakiss to flee. R2-D2 then jacked into a computer terminal and shut down all of the droid detonators throughout the galaxy, with the help of a button pushed by C-3PO. Their efforts were successful mere seconds before Kueller, who was dueling Skywalker on Almania, attempted to detonate all of his remaining droid weapons. Organa Solo subsequently shot Kueller in the face and ended his uprising for good. Back on Telti, R2-D2 and C-3PO rescued Fardreamer from a droid torture chamber and contacted Lando Calrissian, who came to the moon to pick them up."}, {"tag": "h4", "text": "End of the war"}, {"tag": "p", "text": "R2-D2 and C-3PO were recruited by Skywalker in 18 ABY to accompany him on a quest of Calrissian's to find a potential bride. When the bachelor became smitten with Karia Ver Seryan of the planet Leria Kerlsil and nearly married her, the droids put a halt to the union at the last moment after uncovering some disturbing information: Ver Seryan was a life-witch, who had the power to give men good health for a few years before sucking their life out of them and leaving them dead. Calrissian fled the world, and his quest eventually brought him to Tendra Risant of Sacorria. Quite enamored of her, he reluctantly left the world when the Sacorrian Triad—who had deemed it illegal for a Sacorrian to marry an off-worlder—chased the group off of Sacorria. The four of them then discovered a mysterious interdiction field that blocked hyperspace travel within the Corellian system, and upon their return to Coruscant, R2-D2 displayed a graphic depiction of the field to Admiral Ackbar, Mon Mothma, and Captain Showolter of New Republic Intelligence. The group was then tasked with procuring four Bakura-class destroyers from the Bakuran Defense Fleet, as the destroyers were all equipped with interdiction-countering hyperwave inertial momentum sustainer systems. As the gathered fleet traveled to Corellia, R2-D2 received a radionics communication from Risant, but had no time to examine its contents. He boarded Skywalker's X-wing, which departed from the belly of the Bakuran Namana-class light cruiser Intruder along with the Lady Luck and fought in a space battle against the Pocket Patrol Boats of the Corellian Defense Force, whose pilots were loyal to the insurrectionist Human League."}, {"tag": "p", "text": "R2-D2 and Skywalker followed the Lady Luck to Centerpoint Station, a massive space station in the center of the Corellian system that had lately been destroying stars. Within, they were met by Administrator Jenica Sonsen, who took them to Hollowtown in the space station's center. There, C-3PO discerned that Hollowtown's temperature was dangerously rising, and the group fled. They were soon afterward reunited with the Solos, who had been on Corellia to attend a trade summit, and the crisis was averted after Anakin, who had earlier imprinted himself upon the planet Drall's planetary repulsor, used the Force to aim the repulsor at Centerpoint Station and stop the station from destroying the star Bovo Yagen. R2-D2 and Skywalker flew in the crisis's final battle, and the Human League and their Sacorrian Triad overlords were defeated. During the crisis's aftermath, R2-D2 found himself arguing with the Q9-series astromech droid Q9-X2. Calrissian and Risant were soon afterward married, but one year later, a new galactic crisis erupted when a partial copy of the Caamas Document was discovered in the Emperor's former storehouse on Wayland."}, {"tag": "p", "text": "The document implicated members of the Bothan species in the destruction of Caamas, which had occurred thirty-eight years earlier, and anti-Bothan sentiment rose up across the galaxy. While the Solos embarked on a quest to find a complete copy of the document, which would implicate specific Bothan perpetrators and thus vindicate the species as a whole, Skywalker and R2-D2 infiltrated the Cavrilhu Pirates at their base in the Kauron asteroid field. They were rescued from the base's self-destruct sequence by the timely arrival of Mara Jade, who was working on behalf of Talon Karrde. When Jade went missing on the planet Nirauan, to where she had followed a mysterious ship, Skywalker and R2-D2 followed her trail in her own ship, the Jade's Fire. On the world's surface, they tracked Jade to a cave but were required to walk there in order to avoid the world's mysterious alien starfighters. Skywalker constantly levitated R2-D2 as they traversed craggy canyons, and they eventually located Jade with the help of Child Of Winds, a member of the avian Qom Qae species. The related Qom Jha species had brought Jade to the cave after she had fallen unconscious days beforehand."}, {"tag": "p", "text": "The Qom Qae and Qom Jha agreed to help them infiltrate the mysterious aliens' fortress, and they made their way through underground caves and tunnels on a days-long journey. During the hike, Skywalker and Jade rigged a datapad to translate R2-D2's warbles into Aurebesh. When they arrived at their destination, R2-D2 jacked into a computer port and downloaded a floor plan, but he ended up tripping the base's flags and alerting the aliens to their presence. The aliens turned out to be Chiss—members of the same species as the late Grand Admiral Thrawn. R2-D2's arc welder helped subdue one of the Chiss guards during a lightfight that saw Skywalker's Force senses dulled by ysalamiri worms. The astromech then used the floor plan to lead Skywalker and Jade through the facility, and Jade, separated from the group, encountered and spoke to Voss Parck and Baron Soontir Fel —leaders of the Empire of the Hand, who occupied the fortress. The Imperial splinter group had been secretly established by Thrawn years beforehand to guard the galaxy against the myriad alien threats that lurked within the Unknown Regions, and they wanted Jade's help in opening communications with the Imperial Remnant."}, {"tag": "p", "text": "Fel and Parck wanted to turn their vast resources over to the Remnant, but Skywalker and Jade feared that the Remnant's Grand Admiral Gilad Pellaeon would consequently turn against the New Republic and capture Coruscant. As such, Jade remotely piloted the Jade's Fire into the fortress's hangar, destroying a large complement of ships that were housed there. The three of them made an underground escape and came across a clone of Thrawn, growing inside a vat, which they ended up destroying. When R2-D2 jacked into a computer terminal to get information on the parts of the Unknown Regions that the Empire of the Hand had mapped, he found and retrieved a complete copy of the Caamas Document. After the three escaped from Nirauan, the galactic crisis was averted, and the New Republic's President Gavrisom signed peace accords with Grand Admiral Pellaeon, who had sued for peace after realizing that the Imperial fleet could no longer challenge the New Republic. The Galactic Civil War was brought to an end, and, having fallen in love while on Nirauan, Skywalker and Jade were soon afterward married on Coruscant. R2-D2 served as the ring bearer."}, {"tag": "p", "text": "In 22 ABY, three years after the wedding, young Anakin Solo came to Yavin IV to join the New Jedi Order's Junior Jedi Academy. When he and his friend Tahiri Veila began to have nightmares about drowning in a river, they snuck out of the Praxeum with R2-D2 and began rafting down the river, where R2-D2 and Anakin were required to save Veila when she fell off and almost drowned. They then found the Palace of the Woolamander and the mysterious Golden Globe inside, which Exar Kun had created thousands of years before in order to trap the souls of Massassi children. They also found the ancient Kushiban Jedi Master Ikrit, who had been in a Jedi Trance for 400 years. Ikrit explained that only a child could free those who were trapped inside the Golden Globe, and Anakin and Tahiri were later able to do so. R2-D2 and Ikrit later accompanied Anakin and Tahiri to Dagobah after Anakin became troubled by dreams of his namesake, Anakin Skywalker, and R2-D2 guided the group to Yoda's hut. The astromech droid stuck by Anakin and Tahiri's sides during later missions to Bast Castle on Vjun and to Exis Station. In 24 ABY, R2-D2 attended Jacen and Jaina's graduation from the Jedi Academy inside of Yavin IV's Great Temple."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "During the Battle of Borleias, when Han and Leia were arrested on Aphran for setting up resistance cells, he and C-3PO staged a daring rescue attempt. R2-D2 sliced into the prison's computer and changed the images of the Solos' weapons into the image of several foodstuffs. C-3PO then was able to arm the Solos by giving them a last meal. R2-D2 saw plenty of battles during the war, serving on the starfighters of both Luke Skywalker and Jaina Solo."}, {"tag": "h3", "text": "Dark Nest Crisis"}, {"tag": "h4", "text": "The unusual discovery"}, {"tag": "p", "text": "In 35 ABY, R2-D2 continues to served Luke and his family; although the little droid is stubborn and well-behaved, however, R2-D2 began to malfunction. When Luke was fixing R2-D2, the Jedi encountered a recording of his father and mother discussing a dream of Anakin's in which his mother had died in childbirth, and another recording of Padmé talking to Obi-Wan Kenobi about Anakin. The recordings, however, were apparently encoded, probably by Alderaanian technicians. Even it haven't been removed for years, R2-D2 himself refused to show Luke or Leia the recordings and insisted he was trying to protect them. The only way to remove the recordings safely was to either find the original designers of the unit, a prototype, or erase R2-D2's memory, an idea only C-3PO seemed to take seriously."}, {"tag": "h4", "text": "The Swarm War"}, {"tag": "p", "text": "By 36 ABY, a year after the first recording was shown, R2-D2 seemed to be functioning again, though he remained unwilling to show the recordings. It wasn't until the Swarm War, when Luke needed to see it to help him in his fight against Lomi Plo, that R2-D2 finally revealed Padmé's death to Luke, as well as his and Leia's birth."}, {"tag": "h3", "text": "Second Galactic Civil War"}, {"tag": "p", "text": "R2-D2 would continue to travel with Luke while he tried to rebuild the Jedi Order, and still belonged to him as of 40 ABY."}, {"tag": "p", "text": "After the Millennium Falcon nearly broke apart upon returning to Coruscant from Corellia in 40 ABY, Han Solo asked R2-D2 to perform repairs on the ship while he and Leia traveled back to Corellia on a different shuttle, and under assumed identities. R2-D2 spent a number of days performing repairs to the Millennium Falcon."}, {"tag": "p", "text": "R2-D2 also flew with Luke Skywalker in the Battle of Kashyyyk, where he and R2-D2 faked having their starfighter destroyed to make it seem as though Luke was dead so he could confront Jacen Solo."}, {"tag": "h3", "text": "War's fallout"}, {"tag": "h4", "text": "Assigned to the Solos"}, {"tag": "p", "text": "Two years after the defeat of Darth Caedus, Natasi Daala, the former Imperial Admiral who had recently been elected Chief of State of the Galactic Alliance, issued an arrest warrant for Skywalker, claiming that dereliction of duty on his part had caused Jacen Solo to fall to the dark side. Skywalker struck a deal with Daala that nevertheless resulted in his exile from the Jedi Order, and set out on an Odyssey with his son Ben to learn more about Jacen's fall to the dark side. As a result, R2-D2 was assigned to the Solos, and joined his longtime friend C-3PO in their service. The Millennium Falcon had an additional crewmember, however, as Solo and Organa Solo had adopted their granddaughter Allana Solo, the daughter of Jacen and Tenel Ka Djo, following the end of the war. All five crewmembers took a trip to Kessel after Lando Calrissian requested their aid in discovering why his glitterstim mines on the planet were being rocked by groundquakes. As the Solos dined with Calrissian, his wife Tendra, and the Sullustan Nien Nunb, R2-D2, C-3PO, and a nanny droid watched over Allana and Lando's son Chance. While the Solos later investigated the Kessel mines, Allana insisted on going outside to bounce around in the planet's low gravity, and was permitted to by R2-D2 despite C-3PO's protests. The droids watched her play from a safe distance, but caught up with her after she disappeared from their watchful photoreceptors around some rises on the surface. Allana was eager to return with them, having just received unpleasant contact from the dark side entity known as Abeloth, who lived in the Kessel Maw."}, {"tag": "p", "text": "When her grandparents became trapped behind a rockfall within the glitterstim mines, Allana insisted on searching for them, but both droids were firm in their refusals. R2-D2 remained at the foot of Allana's bed while she slept, weathering the groundquakes that continued to rock the planet. The Solos eventually returned, revealing that the groundquakes were being caused by hidden chambers within the planet's mines that were collapsing when the mysterious ancient technology within them initiated a self-destruct pattern. The pattern was increasing in intensity and would soon destabilize the Great Kessel Fault, destroying the entire planet. Calrissian invited a motley crew of retired pilots to Kessel to help conduct a controlled demolition of the remaining self-destruct equipment, and both R2-D2 and C-3PO served aboard the Millennium Falcon during the mission. R2-D2 stationed himself in the ship's engineering space, ready to deal with any mechanical problems that may occur. Although one of the mines' energy spiders latched onto the Falcon's hull, Solo was able to shake it off, and the mission went off without a hitch."}, {"tag": "p", "text": "During this time, many young adult members of the Jedi Order began succumbing to a mysterious illness that affected their perception of reality. While the Solos and C-3PO spoke with some of the inflicted Knights in the basement of the Jedi Temple, the Jedi Knight Bazel Warv looked after Allana. R2-D2 remained with them, however, with standing orders to contact the Solos if anything looked out of the ordinary. The Solos began working closely with the Jedi Council in attempting to counter both the illness and Chief of State Daala's attempts to encase the afflicted Jedi in carbonite, and R2-D2 and C-3PO often babysat Allana while her grandparents were away. Bazel Warv eventually did succumb to the illness, and as tensions continued to rise, the Solos opted to smuggle four of the infected Knights from Coruscant to the Jedi Academy on Shedu Maad: Seff Hellin, Natua Wan, Yaqeel Saav'etu, and Warv. Also aboard the Falcon were three Barabel Jedi Knights acting as gunners: Wilyem, Dordi, and Zal. Although Allana acted as co-pilot to her grandfather while he bluffed his way past planetary security and the pursuit frigate Fast Death, R2-D2 in fact performed many of the co-pilot's tasks, working the comm board and many other systems."}, {"tag": "p", "text": "After dropping the Barabel and the afflicted Jedi off on Shedu Maad, the Solos received a hypercomm message from Ben Skywalker informing them of a group of Sith that he and his father had encountered while aboard a space station in the Maw. The Skywalkers had pursued the sole survivor of the Sith to Dathomir, and Ben asked if the Solos could come to the planet to lend some support. The Falcon was brought to Dathomir and landed at its primary spaceport, and Solo and Organa Solo departed to locate Luke and Ben, leaving Allana in the care of R2-D2 and C-3PO. R2-D2 spotted a nearby SoroSuub yacht in the spaceport and informed his friend, but C-3PO forbade him from investigating. R2-D2 left anyway after C-3PO had tucked Allana into bed, telling the protocol droid not to contact Solo and Organa Solo unless he was absent for a certain amount of time. The astromech droid discovered the presence of the Jedi Knight Zekk and his partner Taryn Zel in a nearby Batag Skiff, who had been assigned by Solo and Organa Solo to secretly watch over Allana and the Falcon. He was told not to reveal their presence to C-3PO or Allana. R2-D2 then made his way into Monarg's Mechanic Works, where he found the yacht but was in turn found by the large mechanic Monarg, who fitted him with a restraining bolt and shut him down."}, {"tag": "p", "text": "The following evening, R2-D2 awoke when C-3PO issued him a wake-up command. He discovered the presence of C-3PO and Allana in the shop; the latter had come to rescue him and had removed his restraining bolt, and the former had woken him up in the hope that R2-D2 could rescue them all from the Monarg, who was in the process of throwing C-3PO around the shop. After contacting Zekk and learning that he and Zel were in the shop and had been secretly aiding Allana in her scuffle with Monarg, R2-D2 wheeled past the astonished girl and electrocuted Monarg's buttocks. A surprised Monarg ran away, allowing the droids, Allana, and her pet Nexu Anji to escape his shop. R2-D2 closed and locked the door before they made their way to the Falcon. Monarg gathered two friends and pursued them, prompting Allana to attempt to contact her parents. When no answer immediately came, Allana and R2-D2 began powering up the Falcon and flying it away from the spaceport. Allana was able to land the Falcon in nearby marshes, and R2-D2 suggested covering it with camouflage netting. Allana once again commed her mother, and when Organa Solo answered, Allana and C-3PO relayed the events to her and her astonished husband."}, {"tag": "h4", "text": "Prison break"}, {"tag": "p", "text": "After returning to their ship, the Solos took it back to Coruscant after learning of a Mandalorian raid on the Jedi Temple that had been sanctioned by Daala. After landing at the capital, the five crewmembers of the Falcon were greeted by Daala, her aide Wynn Dorvan, and several members of Coruscant Security. The next day, the five of them joined Jaina Solo and Jagged Fel, now her fiancé, for a dinner at the Pangalactus restaurant; R2-D2 and C-3PO situated themselves against a wall while their masters dined. The meal was soon interrupted, however, when a terrorist named Kester Tolann and two YVH-series battle droids blew a hole through the wall from the next room and attacked the party. The attackers were quickly neutralized, with a blaster bolt to R2-D2 being the only harm done. Fel's diplomatic speeder then dropped everyone save for himself and Jaina off at the Solos' safehouse."}, {"tag": "p", "text": "Several days later, C-3PO was busying himself with a task assigned to him by Luke of translating the language used by the Lost Tribe of Sith, whom Luke and Ben had formed a shaky alliance with to counter the mysterious being Abeloth who lived on a planet in the Maw, and often spoke with R2-D2 as he completed the assignment. While he reported his success to Luke via a holocomm message, Allana eavesdropped and, misunderstanding the situation, believed that her great-uncle had defected to the Sith. R2-D2 entered the room with the Solos after C-3PO fetched them and gave C-3PO a questioning tweedle, but was waved to silence by his counterpart."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In the decades following the Second Galactic Civil War, R2-D2 was passed down from generation to generation within the Skywalker family. A century after participating in the Battle of Endor, R2-D2 told the Keeper of the Whills of the Skywalker family. In the year 130 ABY, following three years of war between the Galactic Alliance and Emperor Roan Fel's Galactic Empire, the Jedi Order was devastated and scattered when agents of the Sith Lord Darth Krayt's Sith Order attacked the Jedi Academy on Ossus. Kol Skywalker, a leading member of the Jedi Council, was killed. Following the massacre, R2-D2 was kept hidden in a secret sub-basement of the Ossus academy and serviced by several Yuuzhan Vong who hoped to honor Kol's legacy. He was later recovered by the Whipid Jedi Master K'Kruhk, who had the droid updated to current specifications. Seven years after the massacre, K'Kruhk gave R2-D2 to Cade Skywalker, Kol's son. Although Cade had forsaken his Jedi heritage and had been working as a bounty hunter for seven years, he had recently returned to Ossus to complete his Jedi training under K'Kruhk, Wolf Sazen and Shado Vao. R2-D2 was given to Cade to serve as a mechanic as he prepared to leave the planet in mid-training in order to rescue the Jedi Hosk Trey'lis from the clutches of Darth Krayt on Coruscant. Seated on Coruscant, Darth Krayt and his new Empire had been ruling the galaxy since the Massacre at Ossus."}, {"tag": "p", "text": "Aboard Cade's ship, the Mynock, R2-D2 was surprised when he was instructed to input hyperspace coordinates for Coruscant into the navicomputer, but he obeyed Cade nonetheless. The bounty hunter explained that he didn't care about the Jedi Order, but, having turned Trey'lis over to the Sith himself, desired to right his wrong. On Coruscant, the Mynock was pursued by the Imperial starfighter group Skull Squadron. After evading the squadron of Predator-class TIE fighters, Cade landed the Mynock in the depths of Coruscant's undercity and left to infiltrate the Temple of the Sith, placing R2-D2 in charge of his ship. The droid's instructions were to allow no one access save for Jariah Syn and Deliah Blue, who were respectively the ship's co-pilot and mechanic. Cade downloaded a holo-message for them into R2-D2 before disappearing into the planet's depths. The two of them found the Mynock by way of the Hutt Queen Jool, whom Cade had left its access codes with at nearby Rik's Cantina. Syn and Blue brought R2-D2 into the cantina, where he played Cade's holo-message for them, Jool, and Jool's bodyguard Jak. Although the hologram instructed them to take the Mynock and leave Coruscant, Syn and Blue teamed up with the smugglers Chak and Kee, as well as Cade's mother, Morrigan Corde, and rescued Cade from the Temple of the Sith."}, {"tag": "p", "text": "As Cade and Syn set a course for Iego to visit Cade's uncle \"Bantha\" Rawk, R2-D2 helped Blue tinker with the ship's innards. Cade joined them and began discussing with Blue their rocky romantic relationship, which quickly escalated into a physical affair. R2-D2 was shooed away by Cade as the magic happened. The Mynock soon after landed on Iego, and its crew relaxed at the home of Rawk and his family. After four days, R2-D2 served fruit from a hat as everyone relaxed at Rawk's swimming pool. The peace and quiet was shattered when Azlyn Rae—an Imperial Knight serving Roan Fel's Empire-in-exile and an old friend of Cade's— arrived. She was closely followed by agents of Krayt's Empire but was able to drive them off with a mind trick. Rawk informed Cade of a Hidden Temple where a group of Jedi were living in hiding, and he brought Rae and the crew of the Mynock to the Temple on the planet of Taivas. There, Skywalker formulated a plan to assassinate Darth Krayt, and although he received no support from the Jedi Council, he was joined on his mission by Shado Vao, Rae, and two other Imperial Knights, Antares Draco and Ganner Krieg. Before Cade could approve of the Imperial Knights' inclusion, R2-D2 opened the cargo bay doors of the Mynock and allowed Draco and Krieg to load their TIE Predators into the ship's hold."}, {"tag": "p", "text": "Cade formulated a plan to lure Krayt to the planet Had Abbadon. En route, the Mynock was drawn out of hyperspace by the interdiction field of the Star Destroyer Iron Sun, which Old Republic Jedi Celeste Morne had commandeered ten years before and kept dormant in the Deep Core. Syn, in the cockpit, began taking his frustration out on R2-D2 until he spotted the massive warship before them. Everyone save for the droid boarded the seemingly empty Iron Sun, where they were able to recruit Morne for their mission. After arriving on Had Abbadon, they baited Krayt into coming, and the ensuing battle resulted in the Sith Lord's apparent death. While striking one of the finishing blows on him, Rae was grievously wounded by Force lightning. She was taken by the crew of the Mynock to Kiffex, where Rawk and his wife Droo had relocated to. While they attempted to heal her, R2-D2 busied himself at their home by making pancakes, but Cade, frustrated with his inability to heal Rae, berated the droid for not helping Blue repair the damaged Mynock. After fitting Rae with life-preserving armor, Rawk and Droo bade Cade leave their home."}, {"tag": "p", "text": "The Mynock's crew resolved to get lost in the Outer Rim and had a misadventure on Tatooine before going to visit Queen Jool on Zeltros. They were approached by their old boss Rav on the latter planet and hired for a job on Wayland, but the gig turned out to be a trap engineered by Rav and the Sith lady Darth Maladi. Wolf Sazen joined them on Wayland and convinced Cade, who had traditionally drawn on the dark side when using his healing powers, to use the light side of the Force in order to cure Blue of a Yuuzhan Vong plague. They escaped the trap, and Cade resolved to make war on the Sith. When the Sith scientist Vul Isen used viral spores to commit a holocaust of every sentient being on the planet Dac, he found himself at the top of Cade's list. Intel from the Sakiyan Naxy Screeger led the Mynock to Daluuj, and Cade, Sazen, and Blue fought off stormtroopers and Sith stationed inside Isen's laboratory while R2-D2 and Syn rigged an explosive charge. The \"Butcher of Dac\" was long-gone, and R2-D2 used his booster rockets to propel him away from the explosion as the ship's crew escaped from the destroyed Imperial base. The astromech droid was in the Mynock's cockpit as Cade and Syn tried to form a game plan for hunting the butcher, and after Cade was visited by and given advice from the Force ghost of Luke Skywalker, Jool contacted him and summoned him to Nal Hutta."}, {"tag": "p", "text": "On the Hutt homeworld, Cade learned that Vedo Anjiliac Atirue had set a plan into motion to lure Isen to Utapau. The Mynock headed there to catch him, and onworld, Cade and Sazen searched for him while R2-D2, Syn, and Blue met with representatives of the Galactic Alliance Remnant and offered to sell them weapons. R2-D2 displayed a hologram of the \"Rawk signal\" to Lieutenant Ona Antilles to prove that their blasters were made by Rawk himself, but when Cade contacted Syn and informed him that there was an assassin in the company of the Alliance's Admiral Gar Stazi, Syn insisted on meeting with Stazi himself. R2-D2 and his companions were brought to see the Admiral, and as Blue negotiated a price with him, Syn located the assassin and took him out with his amphistaff, Heartstriker. Meanwhile, Cade and Sazen were able to kill Isen and the Sith Lord Darth Azard and stop them from unleashing viral spores in to Utapau's seas."}, {"tag": "p", "text": "R2-D2 often flew the Mynock solo while its crew performed guerrilla strikes on Sith and Imperial bases. He ceded control to Syn and Blue when they attacked the Star Destroyer Darklight above Falleen, but remained in the cockpit with them during the operation. As Cade and Sazen infiltrated the Destroyer and sabotaged its reactor core, the Mynock and the Galactic Alliance's Rogue Squadron dogfought Imperial starfighters. They later fled the exploding scene and joined the Rogues aboard Gar Stazi's flagship, the Alliance. From there, Cade and his crew traveled to the space station the Wheel to rendezvous with Cade's mother, but were attacked by the Sith Hand Darth Talon while on-station. She first infiltrated the Mynock, however, and left them a gift—Antares Draco, frozen in carbonite. R2-D2 was with the icy Knight while the ship's crew battled Talon, but after she fled, Cade returned to the Mynock and orderd the droid to unfreeze him. Draco had been a prisoner of the Sith and had revealed the location of the Jedi's Hidden Temple under torture, news of which prompted the crew to travel to Taivas with all due haste."}, {"tag": "p", "text": "Cade met with the Jedi Council and a delegation of Imperial Knights at the Hidden Temple, where a plan was hatched to lure Krayt's forces to Taivas and trap them behind the fleets of the Galactic Alliance Remnant and the Empire-in-exile—allies of the Jedi in a recently solidified three-way alliance directed against Krayt's Empire. The Mynock flew against Skull Squadron, an elite starfighter squadron in Krayt's service, during the battle, and were again aided by the Rogues. Krayt meanwhile unleashed his secret Sith trooper army and wreaked havoc on the allied forces, who were forced to evacuate to Bastion, the fortress world of Roan Fel's Empire-in-exile. From there, they launched an immediate counterstrike on Coruscant. The Mynock infiltrated the galactic capital and dropped a strike team off on the surface, who successfully brought down the planetary shields. Syn and Blue kept the ship in atmosphere as the allied fleets arrived and attacked, but they took heavy damage during the space battle and were crippled by an ion blast."}, {"tag": "p", "text": "After taking the ship down, R2-D2, Syn, and Blue all worked feverishly to repair the Mynock. Morrigan Corde contacted them with the news that Cade has slain Krayt and had taken the Sith Lord's body to be incinerated in Coruscant's sun; Corde had, however, given him a locket with a homing beacon hidden inside. The crew doubled their efforts, but the Mynock nevertheless required a number of hours to become spaceworthy again. Krayt's Sith troopers went insane in the meantime, as their wills had been linked to that of their master, and Krayt's forces had fled the planet and ceded control of the capital to the allies. When the Mynock finally caught up with Cade, wearing an enviro-suit and floating in space near the sun, R2-D2 used his booster rockets and a length of cord to exit the ship and pull Krayt's slayer back inside. Cade was not breathing, and as R2-D2, Syn, and Blue grieved, he awoke and revealed that he had been in a hibernation trance. The crew celebrated, and with the war over, Cade vowed to move forward with his life, rather than hiding from his problems and letting the pain of his father's death rule his emotions."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "R2-D2, possibly due to his memory never being erased or reprogrammed, had more personality than average droids, and Anakin Skywalker regarded him as a friend rather than merely a droid. R2 was very loyal and courageous, and though he was not designed for combat, he was not afraid to fight when the situation demanded it. When forced into combat, R2 held his own by using his wide variety of mechanical features to serve as weapons, such as using oil to blind his opponents or make them slip, shocking them with his shock prod, tying them up in a cable, or simply bashing into them."}, {"tag": "p", "text": "General Grievous noted that he possessed a defiant and quirky personality. It had been heavily suggested that in his numerous interactions with C-3PO that R2 had a spunky, if not sarcastic sense of humor. He also seems to have little reservations of behaving in such a matter, as suggested in his relationship with his current owner Cade Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Although R2-D2 and C-3PO did not appear in 1973's original fourteen-page story synopsis of \"The Star Wars,\" their characters were featured in the 132-page rough draft of \"The Star Wars,\" completed in May 1974, as ARTWO DETWO and See Threepio. ARTWO is described as a short, old and battered claw-armed tripod whose face is a mass of computer lights surrounding a radar eye, and the two droids are written as construction robots in an Imperial Space Fortress. As the Fortress is attacked by Aquilaean starships, Threepio is the robot who decides to abandon ship, while ARTWO is hesitant to desert their duty. The two then land in the dune sea of Utapau, where they meet Starkiller. By 1975, when George Lucas had written Adventures of the Starkiller, Episode I: The Star Wars, the story began with the two droids aboard a Rebel Spacefighter and oriented itself around their evacuation, landing on Utapau, and being captured by Jawas. With relatively few changes, this storyline went on to appear in the original Star Wars film."}, {"tag": "p", "text": "When creating the characters of R2-D2 and C-3PO, Lucas looked to Akira Kurosawa's 1958 film The Hidden Fortress, which he credits as one of his inspirations for Star Wars. The Hidden Fortress is told from the point of view of the peasants Tahei and Matashichi, who are the film's comic relief duo that travel Japan in the company of a General and a Princess, and, despite coming from the lowest possible social class, are privy to an adventure taking place on a grand level of international diplomacy. Lucas thus wrote R2-D2 and C-3PO into Star Wars as similar comic characters and narrators to The Hidden Fortress's peasants."}, {"tag": "p", "text": "Lucas felt that the two droids had to be very different from one another in both personality and appearance. After creating their characters, he took his character concept of R2-D2 to artist Ralph McQuarrie, who began working on sketches. The name R2-D2 was derived from the shorthand for \"Reel 2, Dialogue 2,\" the heading on a cue sheet during the making of THX 1138. Lucas wrote the name down and later included it in his rough drafts of Star Wars. However, according to a trivia question in Star Wars: Behind the Magic, the \"Reel 2, Dialogue 2\" explanation is just a tale. Lucas himself corrected it in Star Wars: The Annotated Screenplays and revealed the character's name was created by repeating common phonetic sounds until he discovered one that he enjoyed."}, {"tag": "p", "text": "John Stears, the mechanical effects supervisor of the original Star Wars film, was responsible for building the first working version of R2-D2. Told by animatronics experts that it would be virtually impossible to create mechanical beings with the functionality required of the character, he abandoned the experts and turned to his own crew, who had R2-D2 and other droids ready within a few months. During the creation of R2-D2, the walls of the special-effects shop were lined with many posters of the robots Huey, Dewey, and Louie from the 1972 film Silent Running, who influenced the design of the character."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "When the role of R2-D2 was being cast, the approximately eighty-pound costume negated the idea of a child being able to make it move. Three-foot-five stage comedian Kenny Baker was in London, England, performing a musical comedy act with his friend Jack Purvis, and heard that some American people were looking for a small person to fit inside a robot suit. After going to the London office of Twentieth Century Fox, Baker was immediately cast after meeting George Lucas. He was measured and left the studio, only finding out more about the part later on. He initially turned down the role three times, hesitant to appear in a film where his face would not be shown and hoping to continue the success of his comedy act, which had recently started to appear on television. He acquiesced upon being told by Lucas that R2-D2 was a great character and essentially the narrator of the film."}, {"tag": "p", "text": "Baker performed the role of R2-D2 inside a standing unit of the droid, wearing a specially made suit and manipulating the droid's lights and appendages, turning his head, rocking his body back and forth, and moving his eye with a rod. In addition to Baker's unit, every Star Wars film has made use of a number of remote control units, as Baker's was largely immobile. R2-D2's third leg and various tools that deployed from his body panels, as well as his ability to roll along as a tripod, proved too much for a single body. The original Star Wars film, released in 1977, had just one radio-controlled unit to complement Baker's performance, being used in scenes that required use of R2-D2's third leg, but improvements in miniaturized technology saw remote control R2-D2 units end up with most of the character's screen time by 1983's Return of the Jedi. During the filming of the original trilogy, the remote control units continually malfunctioned."}, {"tag": "p", "text": "When Star Wars: Episode I The Phantom Menace was being filmed in 1999, around eighteen R2 units were used, including the costume originally worn by Baker over twenty years prior, modified to be more comfortable. Other R2 units from the original trilogy were disassembled and re-engineered for specific purposes, such as traveling through sand and crossing deep sliding door thresholds. The R2 mini-department was led by Jolyon Bambridge, an experienced radio control operator in film, whose expertise steered R2-D2 smoothly along with actors as they walked. To ensure that the units didn't bang into any actors or extras, the R2-D2 operators found vantage points up to seventy feet overhead in stage rafters. While in the rafters, they often steered the R2 units in chases after the children of crewmembers, and sometimes had the droids shadow George Lucas as a faux fan club. 2002's Episode II Attack of the Clones had fifteen units on set, two of which were costumes worn by Baker and eight of which were radio-controlled and prone to failure, particularly during filming in Tunisia. The remaining five were stunt models moved by puppet strings or towed by wires. A computer-generated R2-D2 was also used in many scenes of the prequel trilogy, including a scene in Episode II where the character walks up a staircase. Baker has stated that he would never have been able to do that in his costume."}, {"tag": "p", "text": "Despite the multitude of units, Baker's performance has been credited as imbuing a sense of personality into the character, adding a living touch and making the character a little more human. Many of Baker's manipulations of the costume were based on emotions that R2-D2 felt such as fright and excitement, and George Lucas loved the performance, feeling that Baker made R2-D2 into more than just a robot. During filming of the prequel trilogy, Lucas preferred when Baker was wearing the suit."}, {"tag": "p", "text": "Baker performed as R2-D2 in all six primary films of the Star Wars saga, although C-3PO actor Anthony Daniels claims to be the only person to appear in every film. Daniels has stated that Baker did not film any scenes for the final installment, Episode III Revenge of the Sith, and Baker has admitted that most footage of his R2-D2 unit appearing in the film was reused from Episode II, though he did film bits and pieces. Baker received credit for playing R2-D2 in the film.[source?] He has also worn the costume in several Star Wars documentaries, on The Muppet Show and Jeopardy!, in Disney's Star Tours,[source?] and in an anti-smoking public service announcement. Notably, Baker was not involved in The Star Wars Holiday Special, for which R2-D2 was operated via remote control by Mick Garris. In both the Holiday Special and the animated series Star Wars: Droids, R2-D2 was credited as playing himself."}, {"tag": "p", "text": "On November 19, 2013, StarWars.com confirmed that R2-D2 would appear in Star Wars: Episode VII The Force Awakens. The droid model has been provided and will be overseen by members of the R2-D2 Builders Club."}, {"tag": "h4", "text": "Voice"}, {"tag": "p", "text": "R2-D2's voice was created by Star Wars sound designer Ben Burtt. Burtt was unhappy with electronic sounds that he initially created on a small electronic synthesizer, feeling that they didn't sound alive enough. He was searching for a voice that sounded truly electronic while simultaneously possessing character and personality. R2-D2's personality was developing like a toddler's, and Burtt decided that, like a baby, the droid should communicate with recognizable but inarticulate emotional sounds. He added modified human-generated squeaks and sounds into the electronic mix, and the final product ended up being roughly fifty percent synthesizer and fifty percent Burtt doing baby talk. Burtt has long considered R2-D2's voice to be the most difficult challenge of all of his sound-design work on the original trilogy."}, {"tag": "h3", "text": "In Star Wars media"}, {"tag": "p", "text": "One of few characters to appear in all six primary Star Wars films, R2-D2 is notable for functioning as a deus ex machina of sorts and saving the rest of the heroes from certain death in each film. Along with C-3PO, his role in the original film was as its narrator."}, {"tag": "p", "text": "Outside of Episodes I through VI, R2-D2 has appeared in myriad works within the Expanded Universe. Along with his counterpart C-3PO, he starred in an animated series that ran from 1985 to 1986 on ABC, in which he was credited as playing \"himself.\" The two also starred in comic books based around the series published by Marvel and Dark Horse Comics. R2-D2 and C-3PO played prominent roles in many of the novels published by Bantam Spectra throughout the 1990s taking place in the years following Return of the Jedi, sometimes accompanying Luke, Han, and Leia, and sometimes being caught up in adventures of their own. When Del Rey took over Star Wars novel publishing in 1999, the droid duo faded into the background somewhat as a new generation of heroes began to develop, although 2005's Dark Nest trilogy saw Luke and Leia discover the identity of their mother via old recordings discovered inside R2-D2. In-universe, R2-D2 is faithfully serving Luke Skywalker's descendant Cade 137 years after the events of the original Star Wars. Scenes written from R2-D2's perspective are rare and have happened only a handful of times."}, {"tag": "p", "text": "Although relatively absent from the original Clone Wars multimedia project, R2-D2 has thus far played a recurring role in the CGI-animated series The Clone Wars. In the episode Duel of the Droids, he is taken apart by the Confederate General Grievous, and staff working on the episode animated a pea shooter and a boxing glove inside of the droid as a joke at Director Rob Coleman's expense."}, {"tag": "h3", "text": "Actor and author comments"}, {"tag": "p", "text": "Kenny Baker credits R2-D2, as well as C-3PO, as telling the story of Star Wars, linking scenes together and acting as the continuity. Filming scenes, however, proved quite uncomfortable for both he and Anthony Daniels. Baker cites controlling the droid's movements as having been a struggle, but one that worked out all right in the end."}, {"tag": "p", "text": "George Lucas has named R2-D2 as his favorite Star Wars character. Following completion of Revenge of the Sith, he stated that R2-D2 was the character he would miss the most, owing to the droid's tendency to come through and save everyone. Lucas also claimed to want a friend like that of his own."}, {"tag": "p", "text": "While seeking writers for Dark Horse Comics' Droids series, editors Ryder Windham and Dan Thorsland were dismayed that many of their potential hirees regarded R2-D2 and C-3PO as little more than comic relief. The two eventually settled on Thorsland himself to write the series, who felt that the droid duo were intelligent machines that often found themselves in an unfortunate plight, being treated worse than slaves."}, {"tag": "h3", "text": "Impact on popular culture"}, {"tag": "p", "text": "As a principal character in a wildly popular film saga, R2-D2 has become a cultural icon. He was ranked the best robot from film or television of all time by Amazon.co.uk and the Internet Movie Database in 2004, and the best movie robot of all time by Rotten Tomatoes in 2009. In 2003, he was inducted into the Robot Hall of Fame. Baker's work as the droid has garnered widespread support as well; when rumors began circulating that the character would be appearing in Episode I, a campaign on the Internet asking for Baker to reprise the role reached the attention of George Lucas."}, {"tag": "p", "text": "A wide variety of R2-D2 merchandise has been produced over the years, including scores of action figures, a telephone, a USB humidifier, a DVD player, and a wireless webcam. In 2007, around 400 mailboxes across the United States were made over to look like R2-D2 in celebration of Star Wars's thirtieth anniversary. The Phalanx CIWS anti-ship missile defense system used by the United States Coast Guard and the United States Navy is nicknamed R2-D2, owing to its resemblance to the droid."}, {"tag": "p", "text": "R2-D2 has popped up in several other films, including appearances as debris in 2009's Star Trek, Star Trek Into Darkness and Transformers: Revenge of the Fallen, and as a hieroglyphic in 1981's Raiders of the Lost Ark. He and C-3PO were presenters at the fiftieth Academy Awards. The droid has also been parodied in a wide variety of media, including appearances on the American cartoons The Simpsons, Futurama, Robot Chicken, and Family Guy. In Family Guy's Star Wars–themed episodes \"Blue Harvest,\" \"Something, Something, Something, Dark Side\" and \"It's a Trap!,\" the character Cleveland Brown plays the role of R2-D2.[source?] In a 1980 episode of the children's television show Sesame Street, R2-D2 and C-3PO visited Sesame Street, and the astromech droid fell in love with a fire hydrant."}, {"tag": "p", "text": "Rhett Alain, a physicist at Southeastern Louisiana University, examined R2-D2's flight in Attack of the Clones. Including thrust, gravitational fields, and air resistance in his calculations, he concluded that the droid would need to weigh 0.1 kilograms (100 grams) in order to take flight."}, {"tag": "p", "text": "R2-D2 had a cameo in the 2009 Star Trek reboot film. In the scene where the Enterprise arrived at the planet Vulcan upon learning that Romulans are attacking the planet, R2-D2 can be seen among the wreckage of the Federation starships that were destroyed by Nero's ship. R2-D2 also cameos in Star Trek Into Darkness as wreckage."}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "In the alternate comic series Star Wars Infinities: A New Hope, Luke's proton torpedoes fail to destroy the Death Star, and the Rebel Alliance is wiped out. Leia is taken as Darth Vader's Sith apprentice, and Luke travels to Dagobah to train with Yoda for five years, before taking Yoda, Han, Chewbacca, and R2-D2 to the renamed \"Justice Star\" to confront the Emperor. After Luke redeems Leia, Yoda uses R2-D2 to control the orbit of the Justice Star to crash it into Coruscant. R2-D2 is destroyed along with the Empire, but his memory is reinserted into a new, identical body on Naboo. Its sequel, Star Wars Infinities: The Empire Strikes Back, sees Luke die in a Hoth snowstorm and R2-D2 accompany the others to Cloud City."}, {"tag": "p", "text": "R2-D2 and C-3PO similarly star in another alternate take on the original Star Wars trilogy: Vader vs. Artoo & Threepio, published in Tokyopop's Star Wars Manga: Silver. Merging the endings of the trilogy's latter two installments, the comic tells their story with the droids in place of Luke and Leia."}, {"tag": "p", "text": "R2-D2 appears in every entry in the LEGO Star Wars series. An online Browser game was developed called LEGO Star Wars: The Quest for R2-D2 that sees the player, as either Anakin Skywalker or Asajj Ventress, hunt for the droid, who is lost in space and possessing intelligence vital to the war effort during the Clone Wars. A two-part short film was created to supplement the game, depicting R2-D2 relaxing on a hammock at an oasis on Tatooine before being found by Jawas. The Jawas bring him to General Grievous, who takes the droid to a Trade Federation Droid Control Ship to confront Count Dooku and Ventress. The timely arrival of Anakin, Ahsoka, Obi-Wan, Yoda, Cody, and Rex saves the day, and the victorious heroes travel to a \"Skywalker world\" theme park."}, {"tag": "p", "text": "The cast and crew of Attack of the Clones created a twenty-minute mockumentary entitled R2-D2: Beneath the Dome. The short film is a tongue-in-cheek look at the life of R2-D2, born Reginald DillMingham, as he found fame, spiraled into depression, and had his career reinvigorated when invited to star in The Phantom Menace. A deleted scene from The Phantom Menace involves R2-D2 using his booster rockets, which went on to debut in Attack of the Clones."}, {"tag": "p", "text": "In the book The Making of Star Wars Revenge of the Sith, George Lucas remarks that R2-D2 recounts the story of Star Wars to a Shaman of the Whills one hundred years after the Battle of Endor. Leland Chee, the Keeper of the Holocron continuity database, has stated that in terms of canon, such a comment has to be taken with a grain of salt."}, {"tag": "p", "text": "R2 was featured in the special LEGO Star Wars: The Padawan Menace, where he was a guardian of the Jedi younglings alongside C-3PO, and joins the group on their misadventures."}, {"tag": "p", "text": "Robots resembling R2-D2 and C-3PO briefly appears in the 19th episode of Japanese anime series Transformers Victory."}, {"tag": "h2", "text": "Translations"}, {"tag": "p", "text": "In Italian, in the original trilogy, R2-D2 is called C1-P8 (\"Ciuno-Piotto\" or \"Ciuno\")."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}