{"url": "Axton_Tredway", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi Generals", "Category:Jedi Purge victims", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Axton Tredway"}, {"tag": "p", "text": "Axton Tredway was a male Human Jedi Knight who served the Jedi Order and the Galactic Republic during the final years of both institutions. A survivor of the rise of the Galactic Empire and the beginning of the Great Jedi Purge, Tredway was eventually killed by Dark Lord of the Sith Darth Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi"}, {"tag": "p", "text": "A Force-sensitive male Human, Axton Tredway was born into the wealthy Tredway family. As a youngling, Tredway was given to the Jedi Order for training in the ways of the Force. Tredway married a woman, and fathered two children, Dena and Erling, and kept them with their mother at his family's estate on the asteroid 24 Tredway in the Sil'Lume asteroid belt. While not on assignment for the High Council, Tredway returned to his home and aided in the family's mining business. Tredway became well acquainted with fellow Knight Anakin Skywalker, and introduced Skywalker to his family."}, {"tag": "h3", "text": "The purge"}, {"tag": "p", "text": "In 19 BBY, Supreme Chancellor Palpatine revealed himself to the Jedi Order as the mysterious Dark Lord of the Sith Darth Sidious, defeating the Jedi's leaders and issuing Order 66, which caused the clone troopers of the Grand Army to turn on their Jedi commanders, executing thousands across the galaxy. Hidden within his estate, Tredway avoided the beginning of the Great Jedi Purge."}, {"tag": "p", "text": "Tredway did not stay hidden for long, as he had made a costly error in showing Skywalker the location of his secret abode. Skywalker had fallen to the dark side of the Force and became known as Darth Vader, Sidious's most powerful Jedi hunter. Not long after the rise of the Galactic Empire, Imperial forces arrived in the asteroid field, seeking Tredway. The Jedi fled his home, hoping to draw attention away from his family and their business, but the Empire continued their harassment. Though they did not harm the Tredway family, Tredway's son Erling grew resentful of his father for leaving them with such a burden, too young to understand what was going on. At one point, Tredway returned, and Erling confronted him, furious over his absence."}, {"tag": "p", "text": "Tredway was stirred by his son's words, and decided to fight the Imperial presence. When the Imperials returned, seeking to further punish the family, Tredway fought them, defeating the entire force. His victory was short-lived, however; his stand had drawn the attention of Vader, Tredway's former friend. Vader appeared in orbit over the asteroid, quickly storming the estate and confronting Tredway. After a brief lightsaber duel, Vader executed Tredway, but allowed his family to live."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Gravely shaken by their patriarch's death, the Tredway family carried on, with his wife supporting the children until they were old enough to join the Alliance to Restore the Republic and fight the Empire in their own way. However, the two earned Imperial Governor Sebastian Parnell's anger, and in his attempt to hunt down Erling, he destroyed 24 Tredway, killing Tredway's wife and injuring Dena."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}