{"url": "Axxila/Legends", "categories": ["Category:Legends articles", "Category:Capital cities", "Category:Confederacy of Independent Systems planets", "Category:D'Astan sector planets", "Category:Ecumenopolises", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Imperial Remnant planets", "Category:Shadowports", "Category:Type I atmosphere planets", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Axxila"}, {"tag": "p", "text": "Axxila was a planet in the D'Astan sector of the Outer Rim Territories."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "Axxila was an ecumenopolis, often described as \"Coruscant, but inside-out\". It was located at the intersection of the Celanon Spur and the hyperlane of industrial worlds that also contained Edusa and Vandyne. The Axxila system was known as a notable spice-smuggling system."}, {"tag": "p", "text": "The system was home to the Axxila antipirate fleet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Jedi Civil War, Axxila was the site of a battle won by the Sith."}, {"tag": "p", "text": "It was the homeworld of Imperial Admiral Firmus Piett, the last commanding officer of Darth Vader's Death Squadron. During the Clone Wars, Axxila was part of the Ciutric Hegemony. When the Hegemony, along with Axxila, joined the Separatists, many Axxilan, known as the Free Axxilans, fled the planet and relocated to the planet Halmad."}, {"tag": "p", "text": "Following the end of the Clone Wars, many Separatist forces retreated to the neighboring Ciutric sector. The Crimson Dagger Command was relocated to Axxila in order to launch a reconquest campaign. Several months after the Battle of Endor, Ysanne Isard sent Admiral Delak Krennel to attack the planet in order to prevent Sate Pestage from giving Coruscant to the New Republic. Krennel wiped out many civilians in the strike. Krennel later took control of the Ciutric Hegemony, excepting Axxila."}, {"tag": "p", "text": "Axxila was conquered by the extra-galactic Yuuzhan Vong during the Yuuzhan Vong War after their acquisition of Vinsoth in 25 ABY, though it was not attacked outright. In 27 ABY, the world was used by the invaders as a platform for a string of assaults on Pedd 4, Celanon, Feriae Junction and Yavin 4. It remained under Yuuzhan Vong control until the end of the war in 29 ABY. Located in Galactic Alliance space during the Second Galactic Civil War, Axxila was later a member state of Darth Krayt's Galactic Empire, situated near the edge of Roan Fel's Empire-in-exile."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Axxila first appeared in the 1998 comic Star Wars: X-Wing Rogue Squadron: Masquerade from the comic book series Star Wars: X-Wing Rogue Squadron published by Dark Horse Comics."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}