{"url": "R3-Y2", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Alliance to Restore the Republic droids", "Category:R3-series astromech droids"], "nodes": [{"tag": "h1", "text": "R3-Y2"}, {"tag": "p", "text": "R3-Y2 was an R3-series astromech droid that served in the Alliance to Restore the Republic during the Galactic Civil War. It was stationed in the command center of Echo Base, the Alliance's headquarters on the planet Hoth. After the base was discovered by the Galactic Empire, R3-Y2 helped to evacuate the rebel forces stationed there during the Battle of Hoth."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Galactic Civil War, R3-Y2 served in the Alliance to Restore the Republic and was stationed in the command center of Echo Base, the Alliance's secret headquarters on the planet Hoth. Shortly before the Battle of Hoth in 3 ABY, R3-Y2 stood by one of the command center's display panels when Captain Han Solo entered the room and passed by the droid while searching for General Carlist Rieekan."}, {"tag": "p", "text": "The droid later stood by the base's senior controller, Wyron Serper, when he reported to Solo and Rieekan on signals coming from the Imperial Viper probe droid XJ9-CS14, which had landed nearby. The probe droid's discovery of the rebels on Hoth led to the Empire attacking Echo Base. During the ensuing battle, R3-Y2 helped to evacuate the base's personnel, most of whom successfully escaped the base before it was captured by the Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "R3-Y2 was an R3-series astromech droid that was manufactured by Industrial Automaton and stood 1.09 meters tall. The R-series astromech droid had a transparent dome with gold panels and a white chassis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R3-Y2 first appeared in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. The command center scenes featuring R3-Y2 were filmed on Stage 1 at Elstree Studios between March 22 and 28, 1979. In the new Star Wars canon, the droid was first identified by name in the Star Wars: R2-D2 Deluxe Book and Model Set, which was written by Michael Kogge and released in 2016. The droid's designation originated in the Star Wars Legends continuity, where it was first given in the 2006 \"Astromech Droid Pack Series II\" action figure set released by Hasbro Inc. as part of Star Wars: The Saga Collection."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}