{"url": "R3-S6", "categories": ["Category:Canon articles", "Category:Espionage droids", "Category:Masculine programming", "Category:R3-series astromech droids", "Category:Separatist droids"], "nodes": [{"tag": "h1", "text": "R3-S6"}, {"tag": "p", "text": "R3-S6, also known as \"Goldie\" or \"Stubby,\" and as \"Agent R3\" to the Separatists, was an R3-series astromech droid assigned to Anakin Skywalker, during the Clone Wars to replace his lost astromech droid R2-D2. Serving as a double agent for the Confederacy of Independent Systems, R3-S6 often sabotaged Republic missions."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The search for R2"}, {"tag": "p", "text": "Following the loss of R2-D2 during the Battle of Bothawui, R3-S6 was assigned to Jedi General Anakin Skywalker as a replacement. R3, secretly an agent of Separatist leader General Grievous, accompanied Skywalker and his\nPadawan, Ahsoka Tano, as they searched for R2. In an attempt to gain Skywalker's appreciation for R3, Tano nicknamed the droid \"Goldie,\" pointing out that Skywalker was Gold Leader of Gold Squadron. Despite this, Skywalker still disliked R3, giving him the name \"Stubby,\" as he felt something suspicious about the droid."}, {"tag": "p", "text": "While searching the remains of the battle, the trio encountered a Trandoshan scavenging freighter. Believing the vessel may have collected R2, the group boarded, and were welcomed by Gha Nachkt, who claimed R2 was not aboard. Nonetheless, they continued to browse the scavenger's collection. Eventually, they gave up their search and returned to Skywalker's Corellian freighter, the Twilight."}, {"tag": "h3", "text": "Confederate agent"}, {"tag": "p", "text": "Unbeknownst to Skywalker, R2-D2 was aboard Nachkt's freighter, as the Trandoshan intended to sell the droid to Grievous for the vital information it contained. As Nachkt neared Skytop Station, a Confederate listening post, R2 sent a message to the Twilight allowing Skywalker to track him. Skywalker, Tano, R3-S6, and a group of clone troopers infiltrated Skytop Station, where Skywalker set off in search of his droid, and the rest set out to destroy the station's reactors. While Tano and the clones were distracted, R3 contacted Grievous, alerting them of the Jedi's presence. The general soon arrived, separating Tano and R3 from the clones. As Tano hid from Grievous, R3 revealed their location, and a brief lightsaber duel ensued before Tano fled. Tano, now aware of R3's allegiance, attempted to reunite with her team in the station's hangar. However, R3 reached them first, proceeding to close the hangar door and activate three vulture droids. Concluding that R3 was a spy, Skywalker ordered the recently found R2-D2 to reopen the doors so they could escape the exploding station via the Twilight."}, {"tag": "h3", "text": "Duel with R2-D2"}, {"tag": "p", "text": "R3 followed R2 to the catwalk where the access port was located, and the two astromech droids battled for control of the access port to the hangar doors. A variety of tools were used by both droids in the fight. After R3 bashed into R2 to interrupt his interface with the access port, both droids produced an electro-shock prod and tried to electrocute the other, as the arcs clashed, R3 was briefly disabled, but after a short time, it recovered and attempted another bash at his opponent. R2 then sprayed oil at R3 and ignited it with his rocket booster. While R3 was reeling from the flames, R2 tried to bash him off the catwalk but as he began to fall R3 fired his tow cable at R2 to secure himself. R3 dangled helpless for a moment before R2 produced a circular saw to cut the cable, and R3 tumbled from the catwalk before being struck by debris from the falling station and destroyed."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "R3-S6 was an R3-series astromech droid with masculine programming manufactured by Industrial Automaton. He served Grievous of the Confederacy of Independent Systems, feigning incompetence to sabotage missions of the Galactic Republic. However, R3-S6's attempts at such were so over-the-top that, although no one realized he was a spy for some time, he quickly drew the ire of General Skywalker and various clone troopers for appearing to be defective."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Like many other astromech droids, R3-S6 was equipped with a computer interface arm, an electro-shock prod, a holoprojector, a retractable third leg, and a scanner antenna."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R3-S6 was created for the animated television series Star Wars: The Clone Wars, being first mentioned in the Legends sourcebook Star Wars: The Clone Wars: The Visual Guide and first appearing in the series' sixth episode, \"Downfall of a Droid,\" in 2008. According to Dave Filoni, R3's black-and-gold color scheme was inspired by Filoni's love of the Pittsburgh Steelers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}