{"url": "R3-T6", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Semi-protected articles", "Category:R3-series astromech droids"], "nodes": [{"tag": "h1", "text": "R3-T6"}, {"tag": "p", "text": "R3-T6, or Arthree-Teesix, was an Imperial R3-series astromech droid serving aboard the first Death Star in 0 BBY. Compared to their R1 and R2 predecessors, R3-series droids like R3-T6 possessed sophisticated circuitry and a larger memory, which increased their efficiency in astrogation plotting. R3-T6 was present onboard the Death Star during the Battle of Yavin and was subsequently annihilated when the station was destroyed by the Rebel Alliance."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "An R3-series astromech droid, R3-T6 was in the service of the Galactic Empire and tasked with calculating hyperspace coordinates. By as late as 0 BBY, the astromech droid was stationed aboard the first Death Star battlestation, a superweapon capable of obliterating entire planets. During the Battle of Yavin, R3-T6 was roaming the corridors of the battlestation and was present when Imperial Lieutenant Tanbris informed the Dark Lord Darth Vader that the Death Star's turbolasers were unable to track—and therefore destroy—the attacking Rebel starfighters."}, {"tag": "p", "text": "Despite the deployment of TIE Fighters to deal with the threat, one Rebel T-65 X-wing starfighter, piloted by Luke Skywalker, managed to launch a pair of proton torpedoes into the Death Star's thermal exhaust port. The torpedoes reached the Death Star's reactor core and detonated, destroying the battlestation. R3-T6 was destroyed in the explosion."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like all R3-series astromech droids, R3-T6 possessed an increased memory and superior circuitry compared to earlier models such as the R1 and R2 astromech droids. These benefits gave R3-T6 increased efficiency in plotting hyperspace jumps. R3-T6 boasted a transparent dome and a red-on-white color scheme on its body."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R3-T6 first appeared as an unidentified droid extra aboard the Death Star in Star Wars: Episode IV A New Hope. The droid would be properly identified on the \"R3-T6 (Arthree-Teesix)\" card of the A New Hope Limited expansion set of the Star Wars Customizable Card Game, released in July of 1996."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}