{"url": "R4-K5", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Droids of the Galactic Empire", "Category:Droids of the Jedi Order", "Category:Galactic Republic droids", "Category:R-series droids"], "nodes": [{"tag": "h1", "text": "R4-K5"}, {"tag": "p", "text": "R4-K5 was an astromech droid that accompanied Sith Lord Darth Vader, formerly Jedi Knight Anakin Skywalker, on missions for the Galactic Empire early during the Imperial Period. Once owned by a Jedi, R4-K5 was chosen for its dark hue by Vader to replace his former astromech droid, R2-D2."}, {"tag": "p", "text": "R4-K5 occupied the droid socket of Vader's customized Eta-2 interceptor during missions to the worlds of Murkhana and Ostor. While competent at its duties, the droid never shared a close relationship with its Sith master as R2-D2 once had with Skywalker; R4-K5 was treated by Vader as simple equipment."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "An astromech droid, R4-K5 was once owned by a member of the Jedi Order. In 19 BBY, Anakin Skywalker, recently minted as the Sith Lord Darth Vader, sustained extensive injuries at the hands of his former Master, Obi-Wan Kenobi, on the Outer Rim world of Mustafar. Forced to don a black suit of armor, Vader also acquired a black Eta-2 Actis-class interceptor in the first days of the Imperial Period. R4-K5 was chosen by Vader as his new astromech droid, replacing Skywalker's astromech R2-D2, as the Sith Lord saw its drab shell as a reflection of his own darkness."}, {"tag": "p", "text": "R4-K5 was stationed on the new Imperial Star Destroyer Exactor, in the vessel's number three launching bay, along with Vader's interceptor. Over two weeks after the rise of the Galactic Empire, the droid occupied the astromech socket of the Sith Lord's interceptor during an attack on fugitive Jedi Knights Roan Shryne and Olee Starstone, as the pair made an escape from the formerly Separatist-aligned Outer Rim world of Murkhana. R4-K5 was instrumental in assisting Vader in grasping the tactical situation, supplying him with information regarding the escape plan of the CloakShape fighter being used by the Jedi, as well as alerting him to their imminent absconsion by way of a hyperdrive ring. Despite the droid's assistance, Vader was unable to destroy his targets before they outran his interceptor."}, {"tag": "p", "text": "Months later, R4-K5 flew with Vader as part of Green Squadron during the second phase of the Shrouded Offensive, an extensive and ultimately ill-fated campaign against a Separatist holdout on the planet Ostor. Vader, on orders from Emperor Palpatine to launch a direct airborne strike after the failure of an initial ground assault, led the squadron in an attack on a shielded city, and engaged in a dogfight with V-19 Torrent fighters piloted by followers of rogue clone trooper Kaddak. During the combat, Imperial clone pilot CT-5539 realized that the squadron had left the Star Destroyer from which they had launched vulnerable, and so Vader and R4-K5 made an about-face to defend it. The battle ultimately ended in a pyrrhic victory for the Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "R4-K5 featured a round silver dome with tool panels and a sensor, both of which were black, and the dome also possessed a red status indicator. The droid's plating was dark-gray with black tool coverings. A second-degree droid manufactured by Industrial Automaton, R4-K5 stood at a height of 0.96 meters. Additionally, R4-K5 was able to interface with the systems of the Eta-2 Actis-class interceptor and analyze possible targets such as skiffs and hyperdrive rings, transferring this data to the interceptor's cockpit displays upon the pilot's request. R4-K5 did not share the close bond Skywalker had maintained with his former astromech, R2-D2; rather, the droid was simply regarded by Vader as another piece of machinery."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Notable appearances"}, {"tag": "p", "text": "R4-K5 made its first appearance in the novel Dark Lord: The Rise of Darth Vader, which was written by James Luceno and released in 2005. Not referred to by designation, R4-K5 is initially described as an astromech with a black dome, and is mentioned twice more as \"the astromech.\" The R4-K5 designation was provided by Hasbro in 2006 alongside an action figure based on the droid."}, {"tag": "p", "text": "The droid later appeared briefly in the 2008 non-canon Soulcalibur IV tie-in comic book Star Wars: Visions of the Blade, in which R4-K5 makes an appearance in one panel socketed aboard Vader's interceptor. The droid accompanies the Sith Lord to a planet in the Cowl Crucible nebula, where Vader encounters Soulcalibur character Mitsurugi. In the comic arc Star Wars: Darth Vader and the Lost Command, Vader's now heavily modified interceptor is equipped with an astromech droid; however, it is depicted inconsistently between frames and is not confirmed to be R4-K5."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "R4-K5 is presented inconsistently in terms of color across sources. In the 2005 reference book The New Essential Chronology, in which the droid was first pictured, R4-K5 is seen as having a black dome, with a white body. Later, several Hasbro figures of the droid portray R4-K5 with a dark-gray body, silver dome, and black panels, or alternatively with a purple body. In the comic Darth Vader and the Cry of Shadows 4, R4-K5 is shown with a black body with silver tool panels. This article treats the version of R4-K5 depicted in the StarWars.com Databank as the correct one."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}