{"url": "R4-P17/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Droids of the Jedi Order", "Category:Feminine programming", "Category:Galactic Republic droids", "Category:R4-P astromech droids"], "nodes": [{"tag": "h1", "text": "R4-P17"}, {"tag": "p", "text": "R4-P17, nicknamed R4, or Arfour, was the astromech droid attached to Obi-Wan Kenobi's Delta-7 Aethersprite-class starfighter and was often on board his Delta-7B Aethersprite-class starfighter and Eta-2 Actis-class light interceptor prior to and during the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The droid originally possessed the R4-series's trademark conical head dome but was involved in a messy incident while trying to repair a trash compactor on Gyndine, resulting in the droid being crushed. Anakin Skywalker, on a visit to the shipyards to inspect the Jedi customization to the Delta-7, found R4's wreck and rebuilt her with an R2-series dome. From that point on the communal property of the Jedi Temple, R4 became the prototype for other integrated droid navigators in Jedi ships. As part of the Delta-7, the astromech had a truncated body, which was, after her destruction, permanently attached to the ship."}, {"tag": "p", "text": "Prior to the Clone Wars, she helped Jedi Master Obi-Wan Kenobi to follow Jango Fett's Slave I from Kamino to Geonosis. The fighter that she was in was recovered after or during the battle that took place later."}, {"tag": "p", "text": "During the Clone Wars, the Jedi began to transition away from the Delta-7. R4 was given a full astromech body, white, with red trim, to make her compatible with the new Delta-7B Aethersprite-class interceptor and Eta-2 Actis-class interceptor used by General Kenobi. However, before she received her full body, Obi-Wan temporarily used a droid called R4-G9. After he switched back to R4-P17, Obi-Wan requisitioned a direct link between the two droids to ensure all flight performance records could be transferred between them."}, {"tag": "p", "text": "R4 also journeyed to Tatooine, to negotiate with Jabba Desilijic Tiure and participated in the Battle of Teth. Later on in the war, she traveled to Rodia to stop the bounty hunter Cad Bane from kidnapping Wee Dunn, and to Mandalore when Kenobi was investigating rumors of the Duchess Satine Kryze creating an army for the Confederacy of Independent Systems."}, {"tag": "p", "text": "R4-P17 later suffered extreme damage due to her dome being pulled apart by a buzz droid attack in the Battle of Coruscant while aboard Kenobi's Eta-2. The remains of the droid were lost for good when the rear half of Invisible Hand was severed while Skywalker and Kenobi tried to land the damaged flagship."}, {"tag": "p", "text": "Obi-Wan lamented the loss of R4-P17, as the droid had been a competent unit. He was soon after assigned R4-G9, who had served as his interim astromech during the later stages of the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R4-P17 was originally supposed to be chained to one of the posts in the Geonosian execution arena along with Obi-Wan Kenobi, Padmé Amidala, and Anakin Skywalker. However, this was changed, and her destruction was moved to the Battle of Coruscant.[source?]"}, {"tag": "p", "text": "In the novelization of Attack of the Clones, Boba and Jango Fett are able to recognize R4-P17 as an R4-P class droid. However, since the droid had the turret dome of an R2 unit, and since only her head was visible, the Fetts would not have been able to guess its true class."}, {"tag": "p", "text": "In the Revenge of the Sith novel, R4-P17 is mistakenly (and repeatedly) referred to as retaining male programming. In the same book, she is also described as being partially crippled by a cannon shot from a droid fighter before her destruction, which in turn is not described in detail, other than the fact that Anakin Skywalker witnessed it. Moreover, at some points in the actual movie R4-P17's body appears red with a white trim."}, {"tag": "p", "text": "In LEGO Star Wars: The Video Game and LEGO Star Wars: The Complete Saga, R4-P17 is a playable character. In this game, she accompanies Obi-Wan Kenobi into Tipoca City; this change was made to enable the two-player drop-in/ drop-out co-op functionality created for the game. However, R4-P17's dome in the game does not feature a mostly red color scheme; instead, it has a color scheme similar to that of R2-M5. This essentially complies with the 2002 Jedi Starfighter model, which features R4-P17 in this color."}, {"tag": "p", "text": "In the Gameboy Advance version of the game, R4 also accompanies Kenobi to Utapau, even though, in the official canon, she was destroyed during the Battle of Coruscant and replaced by R4-G9. In order to ensure co-op mode, she helps Kenobi fight Grievous. This was most likely done to avoid confusion, as the game was primarily geared towards a younger audience."}, {"tag": "p", "text": "In LEGO Star Wars III: The Clone Wars, R4-P17's head is correctly colored, but the droid's body is entirely red."}, {"tag": "p", "text": "George Lucas decided that R4-P17 was of feminine programming as she was primarily operated by female droid operator Zeynup \"Zed\" Selcuk."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}