{"url": "R5-D4", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic droids", "Category:Industrial Automaton products", "Category:Masculine programming", "Category:R5-series astromech droids"], "nodes": [{"tag": "h1", "text": "R5-D4"}, {"tag": "p", "text": "R5-D4, also called \"Red\" by Luke Skywalker, was a red and white-striped R5 astromech droid owned by a group of Jawas on Tatooine in the early days of the Galactic Civil War. Shortly before the Battle of Yavin, the Jawas attempted to sell him to Owen Lars, but the droid purposely malfunctioned his motivator at the advice of R2-D2, so that Lars could purchase R2-D2 in R5-D4's place. The droid survived an Imperial attack on the sandcrawler soon after, and went out to find the Rebellion. R5 was still active by the time of the New Republic Era, and eventually came into the service of Mos Eisley hangar manager Peli Motto. He projected a map of Tatooine in order to assist the Mandalorian Din Djarin."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The astromech droid R5-D4 was one of the last droids produced in Industrial Automaton's low-cost R5 astromech droid line, which was hampered by malfunctions. He served a master in Mos Espa on Tatooine twenty-two years before the Battle of Yavin and was traveling the streets when Anakin Skywalker returned to Tatooine."}, {"tag": "p", "text": "He was later involved with the rebellion against the Galactic Empire. Four years before the Battle of Yavin, however, he fell into the possession of a group of Jawas, where they worked as junkers, and wiped the droid's memory. For the next four years, R5-D4 longed to be sold and repaired. One evening, R5 was overjoyed when two Jawas inspected him and decided that he was ready to be sold. They scooped sand out of his tool compartments, wiped down his photoreceptors, and added lubricant to his chassis and joints."}, {"tag": "h3", "text": "Encounter with R2-D2"}, {"tag": "p", "text": "Hours later, he was awaken by a jolt and saw several Jawas manhandling an R2 unit. This droid turned out to be R2-D2, who had been captured by the Jawas following the events of the secret mission to Tatooine. R5-D4 watched as R2 was fitted with a restraining bolt. Later that night, R5 was awoken by the R2 droid, who was in the process of sabotaging him to ensure he would be the only remaining functional astromech that the Jawas had for sale. R5 bleated angrily, and R2 apologized explaining he was on an important mission. R5 responded that he was on no mission and that his memory had been wiped four years ago."}, {"tag": "p", "text": "R2 responded that he had to escape the sandcrawler tomorrow and that the fate of the galaxy depended on his sale. Unknown to R5, R2 was carrying the stolen Death Star plans within his memory banks. R2 then added that the Rebellion needed his help. The word Rebellion triggered something, the phantom of a memory. When R2 begged again, R5 responded that if he did not escape this sandcrawler and find a new master soon, he would cease to function. R2 was sympathetic but stressed that if he did not find his master, the galaxy would be doomed. As a couple of Jawas approached, R2 promised not to hurt him again."}, {"tag": "h3", "text": "Self-sacrifice"}, {"tag": "p", "text": "The following morning, the sandcrawler stopped at the moisture farm owned by the Lars family, including Owen Lars and his nephew, Luke Skywalker. Lars and Skywalker were interested in purchasing droids from the Jawas. The droids which included R5 as well as R2 and the protocol droid C-3PO were lined up for Lars to choose and he chose R5 and C-3PO. As Lars talked to the Jawas about the purchase, Skywalker began leading C-3PO and R5 towards his home. When R2 moaned, R5 reassured him that someone would buy him."}, {"tag": "p", "text": "R2 then reiterated that the galaxy was doomed and told R5 that he was his only hope. Realizing how important R2's mission was, R5 loosened the hinge on his head plate and redirected the lubricant into a mass just behind his photoreceptors. When that was ready, R5 purposely discharged the power, causing his head plate to pop off. This led Skywalker to think that R5 had a bad motivator. In his place, Lars instead purchased R2-D2, C-3PO's companion and, along with the protocol droid, secretly a member of the Rebel Alliance. Only powering his auditory receptors, R5 heard R2's farewell, thanking him for his sacrifice and that he would never forget him."}, {"tag": "p", "text": "R2's warning was proven right when Imperial stormtroopers stopped the sandcrawler and interrogated the Jawas about the two droids they had sold. While the stormtroopers blasted the Jawas, R5 played dead and was overlooked by the stormtroopers. Later, R5 recomposed himself and made a trek along the Jawas' trade route in hopes of finding a new owner in the next valley and potentially finding the Rebellion."}, {"tag": "p", "text": "R5's malfunctioning led to Skywalker discovering a message within R2 from Leia Organa, the Princess of Alderaan, which was soon delivered to Jedi Master Obi-Wan Kenobi as per Organa's instruction to R2. As a result of owning R2 instead of R5, Skywalker joined with Kenobi and soon destroyed the Death Star during the Battle of Yavin. At some point, he later found his new place within the Rebellion, just like his old friend R2."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "Around 9 ABY, R5 traveled to the Mos Eisley spaceport. He was present in Chalmun's Spaceport Cantina when the Mandalorian bounty hunter Din Djarin entered the cantina in search of work. R5 strolled by him and later bumped into one of the patrons by the counter. Sometime later, R5 was acquired by Peli Motto, and once again crossed paths with Din Djarin in the Mos Eisley spaceport. R5 projected an old map of Tatooine at the request of Motto, who thought that he took an unacceptably long time to do so. The map revealed the location of Mos Pelgo. R5 accompanied Motto to the Mos Eisley Cantina when she helped Din Djarin find someone who knew of the location of Mandalorians."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "R5-D4 was an R5 unit with a white and red chassis. As R5 faced the same problems that plagued his line of astromech droids, he became frustrated over time as a result. R5 was once part of the rebellion but was captured by Jawas who wiped his memories. For the next four years, R5 longed to be sold so that he could find a new master and escape the sandcrawler, which had become his prison. R5 was angry when R2 tried to sabotage him to ensure that he could continue his mission for the Rebellion. R5 regarded the well-maintained R2 unit as snobbish initially. However, R5 became sympathetic to R2's cause when the other droid explained that the fate of the galaxy depended on him being sold. This led R5 to make the difficult decision to sacrifice his own opportunity of being sold by blowing off his own head plate. R5 kept a low profile while the stormtroopers killed his Jawa captors, allowing him to escape and find a new master. R5 had a holoprojector which could be used to project a map of Tatooine. While working for Peli Motto, the woman commented that R5 was slow and ancient, apologizing to Djarin for R5's performance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "After the character appeared in the 1977 film Star Wars: Episode IV A New Hope, R5-D4 was featured in a number of Star Wars Legends stories. One such story was \"Skippy the Jedi Droid,\" an Infinities story from the 1999 comic book anthology Star Wars Tales 1. The story posited that the character, nicknamed Skippy, could use the Force. After seeing a vision of Luke Skywalker's future, Skippy made it appear that his motivator malfunctioned so that Owen Lars could purchase R2-D2 and Skywalker could fulfill his destiny as a Jedi Knight."}, {"tag": "p", "text": "Another storyline, first included in the 1989 roleplaying game sourcebook Galaxy Guide 1: A New Hope, had R5-D4 as an ordinary droid who was eventually purchased by Rebel Alliance historian and spy Voren Na'al. As part of the Rebel Alliance, R5-D4 helped Na'al spy on the Imperial forces on Tatooine and provided background information for official Alliance profiles for R2-D2 and C-3PO."}, {"tag": "p", "text": "Star Wars: Episode IV A New Hope began location filming on March 22, 1976. One of the first scenes shot was Scene 26, where Luke Skywalker purchases the droids. Originally, R5-D4's head was supposed to be where an explosion occurred, although this could not be done for the radio–controlled robot. Production designer Les Dilley fixed this by repainting the stand-in for R2-D2 red, and used that for the explosion instead."}, {"tag": "p", "text": "R5-D4's canonical origins story was retold in Rae Carson's short story \"The Red One,\" which was published in the 2017 anthology collection From a Certain Point of View. As in the Legends Star Wars radio adaptation, R2-D2 still attempts to sabotage R5-D4 but relents when the droid wakes up. R2-D2 instead convinces R5-D4 that the fate of the galaxy depends on him being sold. After R2-D2 mentions he is fighting for the Rebellion, R5 decides to sacrifice his own opportunity of being sold in order to guarantee the success of R2-D2's mission."}, {"tag": "p", "text": "R5-D4 appeared in the fifth episode of the 2019 Disney+ television show The Mandalorian, whose appearance was teased by the show's creator Jon Favreau many months prior to its release."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}