{"url": "R5-J2/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Masculine programming", "Category:R5-series astromech droids"], "nodes": [{"tag": "h1", "text": "R5-J2"}, {"tag": "p", "text": "R5-J2 was a masculine-programmed Imperial R5-series astromech droid stationed aboard the second Death Star battlestation in the Endor system in 4 ABY. The cheap astromech droid was present in one of the hangar bays when the Sith Lord Darth Vader arrived to oversee the station's construction. R5-J2's service with the Empire was short-lived, however, as the droid perished when the battlestation was destroyed by the Rebel Alliance during the Battle of Endor."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "R5-J2 was a cheap, masculine-programmed second-degree R5-series astromech droid that served the Galactic Empire. After the destruction of the first Death Star by the Rebel Alliance, the Empire commissioned the construction of a second Death Star. By 4 ABY, construction of the battlestation had begun over the forest moon of Endor. R5-J2 was one of the droids assigned to the station; he was present in one of the Death Star's hangar bays when the Sith Lord Darth Vader arrived to order the station's commander to speed up construction on the superweapon, and was also present among the other droids when Emperor Palpatine's shuttle arrived at the Death Star's Hangar 272 shortly afterward."}, {"tag": "p", "text": "In 4 ABY, the Rebel Alliance gained knowledge of the second Death Star's existence. Additionally, they learned that Emperor Palpatine was personally overseeing the superweapon's final stages of construction. Determined to destroy the Death Star and kill the Emperor in one act, the Alliance launched an assault on the incomplete battlestation. The Alliance ultimately proved victorious and the Death Star was obliterated. R5-J2 perished in the resulting explosion."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "R5-J2 was an R5-series astromech droid that possessed masculine programming. He boasted a black-and-silver body, though some of his panels were painted bronze. R5 was cheap—his primary selling feature. His tool arms were his instruments of choice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R5-J2 appeared in 1983's Star Wars: Episode VI Return of the Jedi as an unidentified droid extra, barely visible in the Death Star's hangar bay at the beginning of the film. The droid would go without a proper designation until 2006's The Saga Collection line, which included an action figure of the droid that provided the designation R5-J2."}, {"tag": "p", "text": "Because part of the filmed footage of Vader's arrival on the Death Star was reused for Vader's arrival aboard the Executor following his duel with Luke Skywalker on Cloud City at the end of the Special Edition release of Star Wars: Episode V The Empire Strikes Back, R5-J2 can be glimpsed in the Executor's hangar bay. However, this droid is not necessarily R5-J2."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}