{"url": "R5-D4/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Masculine programming", "Category:R5-series astromech droids"], "nodes": [{"tag": "h1", "text": "R5-D4"}, {"tag": "p", "text": "Hear R5-D4 (A New Hope)"}, {"tag": "p", "text": "R5-D4, Arfive-Deefour, or Red as Luke Skywalker called him, was a white and red striped R5-series astromech droid on Tatooine."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "R5-D4, also known as Red, was one of the last droids produced in the low cost Industrial Automaton R5 line, a line plagued with malfunctions. As a result, R5-D4 was owned by many beings and in a constant state of used sale. His programming became jealous of other droids that were capable of serving without failure and had loyal masters."}, {"tag": "p", "text": "The droid eventually came into the possession of Chief Nebit's Jawa tribe, that sold used droids to Owen Lars. He grew angrier as he suffered the abuse of the Jawas, but before he acted on that anger, a Power Droid on board Nebit's sandcrawler suggested that if he cooperated, he would eventually be sold to masters who had to be better than the Jawas. Aboard the sandcrawler, the new arrival R2-D2 sabotaged R5-D4's motivator, acting under the orders of Princess Leia aboard the Tantive IV to find Obi-Wan Kenobi by any means possible, even if it involved modifying other droids, an action usually prohibited by basic droid programming laws. Eventually, the sandcrawler arrived outside the Lars homestead. Owen Lars purchased the inexpensive R5-D4, but within seconds of the transaction, the droid's motivator malfunctioned. After Lars accused the Jawas of selling faulty merchandise, the Jawas hastily let Owen have R2-D2 as a consolation."}, {"tag": "p", "text": "After failing to make a sale, the Squib trader Macemillian-winduarté stole R5-D4 from the Jawas, saving the droid from destruction at the hands of stormtroopers. R5-D4 then changed hands once again in Mos Eisley, being sold to Voren Na'al, Rebel Alliance historian and spy. While communicating with the droid through a datapad, Na'al learned a great deal about the sale of R2-D2 and C-3PO to Owen Lars. Na'al then refurbished the maltreated droid and installed an intelligence gathering software package. Decades of low self-confidence and jealousy were reversed: R5-D4 had a purpose. R5-D4 was placed as an intelligence gathering source in the office of the Imperial Prefect's administrative assistant in Mos Eisley. He continued to serve in that capacity, providing important and valuable data to the Alliance, until the Battle of Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Five action figures of R5-D4 have been made so far. The first figure was part of the original vintage toy line from that ran from 1977 to 1985. R5-D4 was one of the second wave of 8 cards released in 1978, a total of 20 Star Wars cards being released before 1979. The R5-D4 figure was similar in design to that of R2-D2, using the same hollow, white plastic tube shaped body, topped with a band of silver detail separating the head from the body. A printed body sticker was used with same picture detail as R2-D2's, except the details were printed in an orange/red color, orange/red paint details finished off the two side legs. The second figure was to be released in 1996 as part of the Power of the Force 2 toy line, again in the same 3 and 3/4 inch scale. This figure has become reviled as a terrible rendition of the droid. The addition of its over-sized leg-mounted rockets and spring-loaded missile launcher, a feature accessed by opening up the two halves of the R5-D4 body, the missile is then released by a small yellow plastic tag that protrudes from the bottom of the body. Neither of these additions were featured in the character's film appearance. As an aid to the secret missile design, the two side legs were joined together at the base of the feet via a piece of plastic, this made the figure's legs unable to move independently of each other. The figure was out of proportion with other astromech droid figures. This missile launcher design spawned a rare variant of this figure. The first Power of the Force 2 release came on a red card with gold picture border and featured a \"straight\" missile release lever, but this was soon replaced by an easy to use lever with a downward bend, so nicknamed the \"bent\" release lever. This newer figure was released on a green Power of the Force 2 card. The earlier \"straight\" lever has become a sought after item by variant collectors.\nKenner released an 6 inch tall R5-D4 with retracting 3rd leg and removable antenna as a part of the Kenner Action Collection back in late 90's. The next figure was based on an R2-D2 mold and released in 2006 as part of the Saga Collection's Tatooine wave. This figure had a removable dome antenna and a damaged motivator that popped up when the head was turned. The most recent figure was released in 2011 and was a repaint of the R5 mold established in the \"build a droid\" sets. This version of the figure was packed in a way to mimic its predecessor's packaging from 1978. The Sideshow/Medicom Toy Company released a 1/6 scale version of R5-D4 in 2011 as part of their Star Wars Real Action Hero line-up."}, {"tag": "p", "text": "On the DVD of A New Hope, there is a menu screen-shot which displays a clearer image of R5-D4's malfunctioning motivator sky-rocketing into the air."}, {"tag": "p", "text": "There is a continuity error in A New Hope, involving R5-D4. Just after the red droid's motivator has blown, C-3PO puts a good word in for R2. For a second, we are shown R2, with R5 inexplicably replaced beside him. The next shot shows the Jawas running over to retrieve the droid from where he stands (correctly) next to Luke and Threepio."}, {"tag": "p", "text": "The R5-D4 card from the Star Wars CCG series, claims that R5-D4 purposely blew his motivator to prevent splitting up R2-D2 and C-3PO. This seems to be in line with the non-canon explanation from \"Skippy the Jedi Droid\"."}, {"tag": "p", "text": "Luke refers to R5-D4 as an \"R2 unit\". The name R5-D4 was created by Kenner for the action figure, and seems not to have taken into account the line in the film referring to it as an R2 unit. The later introduction of the R2-AG agromech droid seems to be a retcon for this discrepancy. R2-AG units were established in the Star Wars Technical Journal as being a line of R2 units housed in R5-series droid casings."}, {"tag": "p", "text": "The non-canon comedic story \"Skippy the Jedi Droid\" identifies R5-D4 as \"Skippy\", a Force-sensitive droid who is responsible for the entire Star Wars saga; his \"bad motivator\" was actually deliberately destroyed by 'Skippy' himself when he had a Force-vision of what would happen if he was purchased by Owen Lars instead of Artoo. The article Droids, Technology and the Force: A Clash of Phenomena, alluded to this story as a wild rumor."}, {"tag": "p", "text": "During the assault on the Death Star in Star Wars: Episode IV A New Hope, the X-wing piloted by Jek Tono Porkins appears to have a droid identical to R5-D4 in the astromech socket. This droid has been identified as a different R5 unit, R5-D8 in Star Wars: Power of the Jedi."}, {"tag": "p", "text": "In the Christmas in the Stars, Star Wars Christmas album, R5-D4 accidentally stood beneath some mistletoe at C-3PO's party, and was kissed by Chewbacca. R5 did not sound happy about it afterward."}, {"tag": "p", "text": "The vintage R5-D4 figure had no major variations but there was a variation in the way R5's name was written on the card. The Star Wars and The Empire Strikes Back card releases featured the name \"R5-D4\", while the Return of the Jedi and the later European Tri-Logo card featured two versions of the name. Arfive-Defore was to be found at the top of the name plate while R5-D4 was found directly underneath."}, {"tag": "h2", "text": "Translations"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}