{"url": "R5-S9", "categories": ["Category:Canon articles", "Category:Galactic Republic droids", "Category:R5-series astromech droids"], "nodes": [{"tag": "h1", "text": "R5-S9"}, {"tag": "p", "text": "R5-S9 was an R5 unit manufactured by Industrial Automaton that served the Galactic Republic during the Clone Wars. It was working in the power control room of the Senate Office Building on the planet Coruscant when the bounty hunter Cad Bane and a posse of bounty hunters entered looking to cut the power to the building before taking a group of senators hostage. Bane and his colleagues then destroyed R5-S9."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "R5-S9 was the designation of an R5 unit that served the Galactic Republic during the Clone Wars against the Confederacy of Independent Systems. It was present in the Senate Office Building when the bounty hunter Cad Bane led a posse of other bounty hunters into the building in order to take a number of senators hostage and force Supreme Chancellor Sheev Palpatine to release the criminal Ziro Desilijic Tiure from the Republic Judiciary Central Detention Center."}, {"tag": "p", "text": "While trying to cut off power to the building, Bane and his posse found R5-S9 and several other Republic droids working in the power control room and gunned them down, with one of Bane's IG-86 sentinel droids destroying R5-S9. Ultimately Bane and his mens' gambit was successful and Ziro was released."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "As an R5 unit of the R-series of astromech droids, R5-S9 was manufactured by Industrial Automaton and stood ninety-seven centimeters tall. The droid had black sensors and blue and white paneling."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R5-S9 first appeared in \"Hostage Crisis\", the twenty-second episode of the first season of Star Wars: The Clone Wars, which was released in 2009. In the new Star Wars canon, it was first identified in the phone app Star Wars: Card Trader on a card released in 2017. The name originally appeared in the 2011 Star Wars Legends magazine Star Wars: The Clone Wars Comic UK 6.23."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}