{"url": "R5-M2/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alliance to Restore the Republic droids", "Category:R5-series astromech droids"], "nodes": [{"tag": "h1", "text": "R5-M2"}, {"tag": "p", "text": "R5-M2 (Arfive-Emmtoo) was an R5-series astromech droid belonging to Rebel Alliance Captain Shawn Valdez, an evacuation officer assigned to Echo Base on the Outer Rim Territories ice planet Hoth during the Galactic Civil War. Specially programmed to plot sublight tactical courses for starships, R5-M2 played an invaluable role during the Battle of Hoth in 3 ABY by assisting Valdez in planning evacuation routes from Echo Base."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "R5-M2, or Arfive-Emmtoo, was a member of the R5-series astromech droid line, which proved to be commercially unsuccessful but was nonetheless in high demand during the Galactic Civil War for use in combat starships. By 3 ABY, R5-M2 was owned by and served alongside Rebel Alliance Captain Shawn Valdez, a popular and charismatic evacuation officer stationed at Echo Base, the Alliance High Command headquarters on the Outer Rim Territories ice planet Hoth."}, {"tag": "p", "text": "R5-M2 was present inside Echo Base's central hangar, chirping melodiously, when Captain Han Solo returned from conducting a routine scouting mission of the base's exterior with Commander Luke Skywalker, who ultimately went missing after falling prey to an ambush from a native wampa ice creature. The astromech droid passed in front of Solo's path as the latter made his way through the congested hangar."}, {"tag": "p", "text": "During the Battle of Hoth, R5-M2 played a small but pivotal role in helping the Rebellion successfully evacuate Echo Base in the face of overwhelming Imperial assault. Specially programmed to plot sublight tactical courses for space travel, R5-M2 proved extremely valuable by coordinating plans, providing tactical support to Valdez, and planning evacuation routes from the base during the battle."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The astromech R5-M2 became but another droid who played an invaluable role in the Rebel Alliance's struggle against the Galactic Empire. The Rebellion put R5-M2's special sublight course-plotting programming to good use during the Battle of Hoth, as the droid assisted in the Rebel escape from the besieged planet by planning evacuation routes from Echo Base."}, {"tag": "p", "text": "R5-M2's exterior plating included a black head and a blue-and-white color scheme with silver trim. The droid also had silver photoreceptors. During R5-M2's service time at Echo Base, one of the droid's forward manipulator arms was missing from its body, and the plating covering its three legs and bottom chassis was rusted."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R5-M2 appeared in the 1980 film Star Wars: Episode V The Empire Strikes Back. The astromech is one of many droids in the Echo Base hangar during the scene in which Han Solo first enters the base following his Hoth patrol with Luke Skywalker. R5-M2 was later identified by number and given a brief role with the Rebels of Echo Base on the \"R5-M2 (Arfive-Emmtoo)\" card from the November 1996 Hoth Limited expansion set of the Star Wars Customizable Card Game."}, {"tag": "p", "text": "The 1998 Star Wars Encyclopedia, which contains a character entry for R5-M2, includes on the same page a picture of R5-A2, an astromech droid from the film Star Wars: Episode IV A New Hope. The accompanying image caption of the R5-A2 picture misidentifies that droid as R5-M2, while the actual R5-M2 is pictured in an adjacent image with a caption identifying him simply as an \"R5 unit.\" The Star Wars Encyclopedia does not include a character entry for R5-A2."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}