{"url": "R6-series_astromech_droid", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:R-series models", "Category:R6-series astromech droids"], "nodes": [{"tag": "h1", "text": "R6-series astromech droid"}, {"tag": "p", "text": "The R6-series astromech droid was the sixth astromech droid model made by Industrial Automaton under their R-series of droids."}, {"tag": "p", "text": "Released soon after the Battle of Endor, the R6 was IA's attempt at repairing their own reputation after the tremendous failure that was their R5 series. To prove that each new series beyond their famous R2-series would not be inferior, the designers of the R6 took their time in working out every problem and glitch that plagued the previous model. After years in planning, IA released the R6 model with obvious intent to try and recapture the hearts of their consumers."}, {"tag": "h2", "text": "Conception"}, {"tag": "p", "text": "The R6 series had many things in common with the older yet still popular R2 series, which goes to show what Industrial Automaton's engineers had in mind. Originally IA planned on releasing their military model that would be made exclusively for FreiTek's E-wing escort starfighter. But as the E-wing project would take some years before fruition IA felt it an opportune time to reach out to civilian buyers once more. With a winning design and eager consumers IA made sure the R6 would sell by giving their shelf models a somewhat auspicious price tag. It was more expensive than the R5 and R4-series, which also had less dynamic goals in mind, but was less expensive than the price of the R2 series upon its original release."}, {"tag": "p", "text": "In the time before Grand Admiral Thrawn introduced his campaign to retake the galaxy in the name of the Galactic Empire, the R6 was said to be \"selling like QuickSnacks.\" Although R2-series astromech droid had better sales than the R6, the latter still was a profitable model and was competitive in terms of sale with the former.[source?]"}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "Though the conical-frustum style of the head was like that of the R5 (which might have given consumers a scare at first glance) rather than the classic dome, that was where the similarities ended. The R6 had the same kind of \"do it all\" attitude in its programming and array of gadgets reminiscent of the veteran R2 units, but with updates to key systems such as its sensor package and processor. The standard R6 could store 12 hyperspace jump coordinates in its astrogation buffer and had many of the tools and compartments that were found lacking on earlier models that were not intended for serious space service. Though the R6 offered little in the way of innovation it supplied the demand left hollow in loyal IA consumers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}