{"url": "R8-series_astromech_droid", "categories": ["Category:Legends articles", "Category:R-series models"], "nodes": [{"tag": "h1", "text": "R8-series astromech droid"}, {"tag": "p", "text": "The R8-series astromech droid was a part of Industrial Automaton's line of R-series astromech droids. This model was produced during the rule of the New Republic, following the death of Grand Admiral Thrawn. This was also the only R-series astromech to not have a sensor \"eye,\" instead featuring a miniature satellite dish on its dome."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "During development, it was rumored that the R8 unit would be the first Industrial Automaton astro-droid to speak Basic, though the final product communicated in Droidspeak. It came with a full-frequency comm system as standard equipment, making it (along with the venerable R2 astromech unit) a recommended choice for those needing long-range comm interface capabilities."}, {"tag": "p", "text": "The R8 was designed to have the piloting power of the R7s without focusing on just the antiquated E-wing, as well as having the usefulness, versatility, and most of all, customizability of the previous R-series droids. The R8 was better with repairs, navigation, and piloting than any other R-series droid, and provided far-superior software customizability. Additionally, in times of emergency, the R8 was capable of piloting small craft (and mid-sized craft if so programmed) with a great deal of skill directly from its astromech socket or while connected to a computer terminal, though dynamic piloting and intuitive thinking was still a stretch. Similarly, to the interest of smugglers, pirates, and others, an R8 was capable of manning the weaponry of smaller ships, with capabilities possibly even matching an organic crew member."}, {"tag": "p", "text": "Externally, the R8 resembled any R-series droid. In keeping with the \"return to their roots\" slogan, the R8 head was once again dome shaped, like that of the R2-series. Instead of the metal shell of previous models, the head and body of R8 droids were frosted plasteel, with \"gel\"-style plasteel coloring for aesthetic purposes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Though Industrial Automaton's initial release of the highly specialized R7 droid was a moderate success, thanks to continuous attacks from the Imperial Remnant, and later the war with the Yuuzhan Vong, the R7 line of droids eventually and inevitably became obsolete when the New Republic's E-wing were phased out in favor of newer models. As a result, the company decided to market the incredibly versatile and powerful processing power of the R7 series and \"return to their roots,\" as was the company's slogan for the new droid. The R8 series was born."}, {"tag": "p", "text": "Much like its R6 predecessor, the R8 sold incredibly well. However, before Industrial Automaton announced the new model, it ventured a major risk in overproducing the required parts for the R8. The gamble paid off in spades."}, {"tag": "p", "text": "R8 units were sold at a droid outlet on the Imperial world of Bastion shortly before the signing of the Pellaeon–Gavrisom Treaty. Lando Calrissian and Han Solo used these units to block Imperial sensors that were pursuing them onworld."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In The Clone Wars episodes \"Death Trap\" and \"R2 Come Home,\" Mace Windu has an astromech unit designated R8-B7. Since the R8-series was supposedly not created until several decades after the Clone Wars, it is likely that he is an earlier model with an R8 designation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}