{"url": "R5-D2", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Articles with gameplay alternatives", "Category:Masculine programming", "Category:R5-series astromech droids", "Category:Star Tours personnel"], "nodes": [{"tag": "h1", "text": "R5-D2"}, {"tag": "p", "text": "R5-D2, often referred to simply as R5, was a masculine R5-series astromech droid who served part of Star Tours' technical pool until he burnt out in a tour accident and had to have parts replaced by the maintenance droid G2-9T. The droid eventually became the property of a Tatooine moisture farmer and was involved in the Disciples of Ragnos crisis in 14 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Star Tours"}, {"tag": "p", "text": "Around the year 21 BBY, R5-D2, often referred to simply as R5, was on the planet Ukio. Around 1 BBY, he served as a navigator in Star Tours' technical pool at Spaceport THX1138 until he burnt out on a routine flight and had to undergo repairs, including the replacement of his logic module, by the maintenance droid G2-9T in Tomorrowland Starport. However, due to the droid's low productivity, it was unknown how long it would take to fix R5-D2. In 4.3 ABY, he was still being repaired by G2-9T prior to the departure of Star Tours Flight 45 on an ill-fated flight to the Forest Moon of Endor."}, {"tag": "h3", "text": "Service to a moisture farmer"}, {"tag": "p", "text": "Years later, R5-D2 ended up in service of a moisture farmer who lived on the desert planet Tatooine in 14 ABY."}, {"tag": "p", "text": "The farmer ordered the droid to record a conversation about the Disciples of Ragnos—a Sith cult that was trying to revive the dead Sith Lord Marka Ragnos—that the farmer overheard in a local cantina. When the farmer became fearful of reprisals from the cult, the individual sold the R-series droid to a band of Jawa scavengers, before leaving Tatooine."}, {"tag": "h3", "text": "Jaden Korr's mission"}, {"tag": "p", "text": "When the New Jedi Order found out about the droid, the Human male Jedi Padawan Jaden Korr journeyed to purchase the droid from the Jawas. The Jedi had to fight his way through Tusken Raiders that had attacked and killed all the Jawas, but eventually he located the R5 unit aboard the Jawas' sandcrawler and retrieved it."}, {"tag": "p", "text": "After the two reunited with Korr's Master, Kyle Katarn, the droid was taken by the Jedi to the Jedi Praxeum on the moon Yavin 4. There, Jedi Master Luke Skywalker intended to have his astromech droid R2-D2 analyze the Tatooine droid's memory banks in order to learn more information about the Disciples of Ragnos."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "R5-D2 was a masculine R5-series astromech droid, a low-cost model of the popular R-series astromech droid line manufactured by Industrial Automaton. He had white plating with a red trim, portions of which were battered and scorched black after the droid burnt out during a routine flight that necessitated him undergoing repairs, a pair of blue photoreceptors. The droid stood one meter tall, and was a second-degree unit specializing in technical works. The droid communicated with other individuals by using droidspeak."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R5-D2 was created for the 1987 Disney simulator ride theme park attraction Star Tours, where he was featured in the ride's queue at each of its locations, which included each of Disney's resorts excluding Hong Kong Disneyland and Shanghai Disney Resort. He first appeared in a 1986 Star Tours promotional film that aired on The ABC Sunday Night Movie. Although information on the droid was provided in Complete Guide to Star Tours, he was without a proper designation until an action figure of the droid designating him R5-D2 was released in 2003 as part of the Disney Parks exclusive Star Wars: Star Tours toy line."}, {"tag": "p", "text": "An R5-series astromech droid also appeared in the 2003 LucasArts video game Star Wars: Jedi Knight: Jedi Academy. While not identified by name in the game itself, the game files referred to the droid as \"R5-D2.\" The game requires the player—taking on the role of Jaden Korr—to complete four out of five optional missions in order to proceed with the main story line, with the mission to recover the droid being one of such optional assignments. This article assumes full completion of the game, therefore it includes Korr's mission to retrieve the droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}