{"url": "R5-SK1", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic droids", "Category:R5-series astromech droids", "Category:Red Squadron personnel"], "nodes": [{"tag": "h1", "text": "R5-SK1"}, {"tag": "p", "text": "R5-SK1 was an R5-series astromech droid that served as part of the Alliance to Restore the Republic's Red Squadron. It was stationed on the moon of Yavin 4 as part of the Massassi Group of Rebels headquartered in the Great Temple. It participated in the battle above the planet Scarif while docked into a T-65B X-wing starfighter."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "R5-SK1 was a R5-series astromech droid that served the Alliance to Restore the Republic during the reign of the Galactic Empire. It was stationed with the Massassi Group of Rebels on the moon Yavin 4. In the year 0 BBY, the astromech was part of the Alliance forces that scrambled from Yavin 4 to the planet Scarif in order to aid the recently recruited Rebel Jyn Erso and a group of Rebels who had attacked the Imperial Citadel Tower there to try and steal the plans for the Death Star superweapon."}, {"tag": "p", "text": "R5-SK1 arrived above Scarif docked into a T-65B X-wing starfighter in Red Squadron that jumped from hyperspace with the rest of the Alliance Fleet. The Rebels took heavy casualties in the battle that followed, but were able to successfully steal the plans. Several Red Squadron members survived the battle."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "R5-SK1 had white and red paneling and black sensors. Like all droids in the R-series, it was manufactured by Industrial Automaton."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "R5-SK1 was created for the stand-alone film Rogue One: A Star Wars Story, which was released on December 16, 2016. The character was revealed prior to the film in the form of a figure released by Hasbro Inc. in 2015 as part of a set with three other astromechs from Rogue One as part of the Star Wars: Star Tours line."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}