{"url": "RC-1140/Legends", "categories": ["Category:Legends articles", "Category:Clone commandos", "Category:Clone stormtroopers", "Category:Mechanics", "Category:Slicers"], "nodes": [{"tag": "h1", "text": "RC-1140"}, {"tag": "p", "text": "RC-1140, also known as Delta-40 or by his nickname of Fixer, then known as IC-1140 as part of the Imperial Commando Special Unit, was a clone of Mandalorian bounty hunter Jango Fett. Born in 32 BBY on the watery world of Kamino, Fixer was trained by the Mandalorian Cuy'val Dar training sergeant Walon Vau to become a clone commando in the Grand Army of the Republic. Together with three other commandos, Fixer was a part of the elite special forces unit, Delta Squad, and served as the squad's slicer, corporal, and technology expert."}, {"tag": "p", "text": "When the Clone Wars broke out between the Galactic Republic and the Confederacy of Independent Systems, Fixer took his place in the Grand Army's Special Operations Brigade under Jedi General Arligan Zey, and served alongside his clone brothers in Delta Squad on a number of battlefields, ranging from the deserts of Geonosis, the halls of the RAS Prosecutor, and the streets of Coruscant, to snowy Mygeeto and the plains of Haurgab. A by-the-book type of soldier, Fixer preferred to do his job according to procedure, and often took it upon himself to reign in his clone brothers Scorch and Sev when they bantered."}, {"tag": "p", "text": "Following the transformation of the Republic into the Galactic Empire, Fixer and the other members of Delta Squad—minus Sev, whom the squad was forced to abandon on Kashyyyk in the final days of the Clone Wars—served in the new Imperial Army, as members of the Imperial Commando Special Unit, a specialized unit within the 501st Legion tasked with hunting down clone deserters, fugitive Jedi Knights and Jedi sympathizers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and training"}, {"tag": "p", "text": "RC-1140 was born in the year 32 BBY, in the cloning facilities of Tipoca City, on the aquatic planet of Kamino. A clone of the Mandalorian bounty hunter Jango Fett, RC-1140 was created to serve in the Grand Army of the Republic as a clone commando and placed under the direct training of the Mandalorian Cuy'val Dar training sergeant, Walon Vau. During the course of his training, Vau was so amazed by RC-1140's proficiency in data slicing, that he requested the removal of the data terminal in his dormitory, for fear of Four-Oh breaching the Kamino mainframe during his unsupervised hours. He was assigned to Delta Squad, one of the first commando units established by the Kaminoans, along with, RC-1207, and RC-1262, and under the command of sergeant RC-1138—nicknamed \"Sev\", \"Scorch\", and \"Boss\", respectively. Such was his skill with data slicing that Four-Oh became Delta's de facto technology expert, often handling computer-slicing and code-breaking duties, and he took on the nickname of \"Fixer\" as well as the role of the unofficial second-in-command for Delta. The Kaminoan project coordinator for the Republic's clone army, Taun We, regarded Fixer as \"pure and uncomplicated\", and believed that he formed the steady foundation for Delta Squad."}, {"tag": "h3", "text": "Geonosis"}, {"tag": "p", "text": "The Grand Army would finally see real action in 22 BBY, when Jedi Grand Master Yoda took the army to the Outer Rim world of Geonosis to rescue Jedi Knight Obi-Wan Kenobi, his Padawan Anakin Skywalker, and Galactic Senator Padmé Amidala. Fixer and the rest of Delta Squad would be sent to Geonosis in a deployment so hastily ordered and carried out that it would leave Delta with no time to say goodbye to their training sergeant, Vau. Delta Squad was tasked with assassinating Geonosian Archduke Poggle the Lesser's chief lieutenant, Sun Fac. The four commandos split up, each boarding a single LAAT/i gunship independently, with the intention of rendezvousing once on the surface of Geonosis."}, {"tag": "p", "text": "On the ground, Fixer met up with Boss and Scorch before continuing on to Fac's command center where they reunited with Sev. Together again, Delta Squad attacked Sun Fac in his command center, although the Geonosian leader would manage to escape. They tracked Fac through the Geonosian catacombs, eventually catching up with him in Fac's private hangar as the Geonosian attempted to escape in his starfighter. Fac's escape was prevented by the timely actions of Sev, Delta Squad's sniper, who used the sniping attachment of his DC-17m blaster rifle to shoot down the starfighter, killing Fac. Fixer and the other members of Delta Squad were then tasked by clone advisor CC-01/425 to complete the failed objective of their fellow Republic commando squad, Theta Squad: destroying an underground droid factory. The commandos infiltrated the factory and targeted weak points in the facilities design, together causing enough damage to destroy it."}, {"tag": "p", "text": "Following the destruction of the droid factory, Delta Squad was given new orders, tasked with the infiltration of a Lucrehulk-class Core Ship. Deployed in a nearby canyon from an LAAT/i gunship piloted by clone pilot Delta 42, Delta Squad made their way to the Core Ship, using a downed gunship's composite-beam turrets to fend off enemy Geonosians along the way. As they continued toward the Core Ship, the squad was called upon to take out an anti-aircraft cannon. Fixer and the other commandos fought through a number of B1-Series battle droids and their super battle droid counterparts, before finally destroying the large anti-aircraft emplacement. When the squad finally reached the Core Ship, they were met with resistance from an advanced spider droid, and a ray shield blocking the ship's entrance. The four commandos were able to destroy the spider droid with considerable effort and they then called in air-support to blow through the ray shielded entrance. Once inside, Delta Squad again split up, each of its members sabotaging and destroying various crucial systems. When Fixer and Scorch came under attack by a group of droidekas, Boss and Sev came to their rescue, ensuring that neither were injured. Their primary objective, however, was the capture of vital launch codes housed on the ship's bridge. On the bridge, Delta came under heavy fire from numerous battle droids and stationary autoturrets, but still managed to acquire the codes before retreating down a branching corridor. By this point in time, the squad's efforts to sabotage the Core Ship had come to full fruition, with several primary systems overloading. With no time to make an escape back the way they had come, Delta Squad was extracted via LAAT/i gunship through a hole forcefully blown in the hull of the ship."}, {"tag": "p", "text": "The First Battle of Geonosis would be the first action Fixer and his brothers from Delta Squad would see, but with the Clone Wars breaking out throughout the galaxy between the Galactic Republic and the Confederacy of Independent Systems, it would not be the last. Delta would prove to be one of the lucky minority of Republic commando squads to depart Geonosis intact and with no casualties; 4,982 other commandos perished on Geonosis' red sands."}, {"tag": "h3", "text": "Mission to the Prosecutor"}, {"tag": "p", "text": "On the day before the second anniversary of the Battle of Geonosis, three hundred and sixty-seven days into the Clone Wars, Fixer and the rest of Delta Squad were called upon to investigate the Acclamator-class assault ship, Prosecutor. Having recently reappeared in the Chaykin Cluster following a two-week-long disappearance while tasked with defending trade routes in the Corellian sector, the Prosecutor was found drifting, without power or communication capability. Delta Squad had spent a substantial amount of time aboard the capital ship during the early portion of the war, even coming to think of it as their \"first home\". Arriving on scene in the Corbantis system aboard a CR25 troop carrier, Delta Squad was tasked with retrieving flight records from the Prosecutor's four data cores and securing the derelict assault ship."}, {"tag": "p", "text": "The four members of Delta Squad disembarked from the CR25 via a jump through the vacuum of space, splitting up and entering the Prosecutor at four different locations. Interference in their comms would quickly cut Fixer and the others off from the guidance of CC-01/425, who was again serving as mission advisor to the squad. While searching through the ship, Delta Squad came across few survivors, and several members were set upon by scavenger droids; Scorch was ambushed and incapacitated by the droids. Shortly after, the squad found that the Prosecutor has been attacked by Trandoshan slavers and mercenaries when Sev was captured at the starboard data core. Fixer and Boss were able to complete their original objectives, battling through heavily armed and armored Trandoshan mercenaries and the ship's very own autoturret defenses that had been sliced by the Trandoshans, before rendezvousing and proceeding to rescue Sev. Once Sev was free of the violent interrogation from his Trandoshan captors, the incomplete squad moved to retrieve Scorch from where he was being held in the Prosecutor's detention area. After a brief skirmish in the detention area, Delta Squad was able to locate and revive an incapacitated Scorch, and together make their way to the bridge where they destroyed a Confederacy jamming device and re-established communication with their advisor."}, {"tag": "p", "text": "A brief scan revealed that a Trandoshan dropship had touched down in one of the Prosecutor's hangar bays. Proceeding to the hangar—after being sidetracked through the detention center by a booby-trapped turbolift—Fixer and the other members of Delta Squad found that a Lucrehulk-class battleship had entered the system and was rapidly approaching the Prosecutor. While their advisor called for assistance, Delta Squad was charged with repelling the droid boarding parties and sealing the assault ship's hangars. By the time Fixer and the others reached the final hangar, it was completely overrun with droids and the commandos had to resort to commandeering the roof-mounted mass-driver cannon of an AT-TE walker to deal with the droid threat. Following these events, the Separatist battleship opened fire on the Prosecutor, deciding to cut its losses and destroy the Republic warship before reinforcements could arrive. In an attempt to hold off the battleship, Delta Squad struggled to get the Prosecutor's turbolaser battery array back online amidst a continuing assault from droid forces already aboard. Reinforcements would come in the form of Republic Navy Captain Talbot and the RAS Arrestor, the only Republic force to respond to CC-01/425's calls for assistance. Between the combined strength of the Arrestor and Prosecutor—even as the latter's hull integrity was compromised—the Confederacy droid control ship was destroyed, shutting down the battle droids aboard the Prosecutor, and saving the ship and the lives of Delta Squad. Fixer and his Delta Squad brothers were commended by High Jedi General Mace Windu for their actions aboard the Prosecutor, and the data that they retrieved would help enable the Wookiees to better combat Trandoshan slaving operations in the Kashyyyk system."}, {"tag": "h3", "text": "Operating with Omega"}, {"tag": "p", "text": "Fixer and the rest of Delta Squad departed the Prosecutor aboard a captured Neimoidian shuttle. Shortly thereafter, they received a Red Zero signal—the GAR code requesting immediate extraction—from their fellow commando unit, Omega Squad. Delta Squad was closest Republic unit to Omega's position aboard a damaged freighter at the Corellian–Perlemian hyperspace intersection, in the Tynna sector, and the first on sight to recover both their commando comrades and the trio of prisoners Omega Squad had apprehended. Scorch deployed from the captured shuttle, and cut through the forward viewport of Omega's freighter before attaching a docking tube that allowed his fellow commandos and their terrorist captives to cross-deck to Delta's vessel. Once safely back on board, both Delta and Omega Squad docked aboard the Acclamator-class ship, Fearless, and returned to Coruscant."}, {"tag": "p", "text": "On Coruscant, Fixer and the other Delta Squad members were recruited by the former Cuy'val Dar sergeant Kal Skirata for a black ops mission to be conducted on Coruscant itself. In the days and weeks prior, Coruscant had suffered a number of terrorist attacks on GAR facilities, and Skirata had devised a means of covertly striking back at the terrorists culprits. Together with Omega Squad, Delta's former trainer Walon Vau, the Null-class Advanced Recon Commandos Ordo and Mereel, and Jedi Generals Bardan Jusik and Etain Tur-Mukan, Fixer and the rest of Delta began an investigation into the terrorists whereabouts from the seedy Hutt-owned cantina, Qibbu's Hut, in Coruscant's Entertainment District. Despite a grudge between Delta Squad's Sev and Omega Squad member, Atin, the two squads grew to respect each other. Using Qibbu the Hutt's criminal contacts, the counter-terrorist strike team was able to lure their targets—later identified as hailing from Jabiim—under the pretense of having a supply of high yield thermal plastoid explosive that they were willing to sell. After a meeting between Skirata and the terrorist leader Perrive establishing a time when they would supposedly make the explosives sale, Delta Squad spent an evening enjoying themselves at Qibbu's bar with the other member's of the strike team, at least until the revelry was cut short by a call from Perrive stating they would need to move up their time and change the pre-established location. Fortunately, the new location for the trade was a CoruFresh produce distribution depot in Quadrant F-76 of Galactic City, a location Delta Squad had personally reconnoitered earlier."}, {"tag": "p", "text": "The squad split up upon arrival, Fixer teaming with Atin for an attack on the warehouse's front, while Boss and Scorch covered the depot's landing strip together and Sev partnered with Ordo on the roof. Once Skirata and Jusik passed the explosives off to the terrorists and cleared the area as planned, the assembled troops struck, shutting off the lights and attacking from every direction, including the roof. Delta Squad neutralized the terrorists who fled into the repulsor truck they had loaded the explosives in, ensuring that there would be no desperate suicidal detonation. When the terrorists had been killed, Fixer found that he was unimpressed by the Jabiimi radicals, noting that they looked very ordinary for an enemy, unlike the battle droids Delta Squad so often fought. But with their deaths, Fixer and the others returned to Qibbu's for a final night, and then attended an evening as guests of the CSF Social Club. But just six days later, Delta Squad was back on assignment, shipped off to Skuumaa and tasked with battlefield preparation consisting of sabotaging strategic targets ahead of the main Republic assault."}, {"tag": "h3", "text": "Mission to Devaron"}, {"tag": "p", "text": "Fixer and the clone commandos of Delta Squad were later dispatched to Devaron to search for survivors of the engagement. Finding none, they recovered the corpses of Halsey and Knox and returned them to the Jedi Temple on Coruscant. The Jedi High Council concluded that the deaths of the Roonan Jedi and his apprentice were a sign of a new threat to the Republic; their suspicion was confirmed when security footage of the massacre, including Halsey's death, was recovered."}, {"tag": "h3", "text": "Mygeeto and hunting Ko Sai"}, {"tag": "p", "text": "Four hundred and seventy days after Geonosis, Delta Squad had been sent to the Outer Rim world of Mygeeto. The squad was tasked with calling in air strikes and sabotaging Mygeetan ground defenses near the city of Jygat in preparation for Clone Commander Bacara and the Galactic Marines' main assault. Delta completed their assignments as ordered, but instead of exfiltrating as they were supposed to, Fixer and the other commandos instead decided to assist their former training sergeant Vau in his personal mission, one that consisted of robbing Mygeeto's own Dressian Kiolsh Merchant Bank. While Fixer kept a look out from their snowspeeder on the surface, Boss, Scorch, and Sev followed their former sergeant into the underground bank. Once inside, Vau refused to allow the squad to assist him any further in the heist, determined not to compromise his trainees' integrity by directly involving them in the actual act of stealing. It was during Vau's raid on the vault's numerous safety deposit boxes that Fixer learned via shared comlink circuit of his former training sergeant's past as a disinherited aristocrat from Irmenu, and that the purpose of the theft was to regain the inheritance his mother and father had denied him. When Vau ordered Delta to leave him and continue on with their assigned mission, however, the squad refused—reminding Vau that he was no longer a sergeant, just a civilian—and instead assisted Vau and his strill, Lord Mirdalan, carry the stolen loot out of the bank. Their exit would become complicated when one of the bank's alarms was triggered, and although Fixer brought the snowspeeder closer to the extraction point, Delta and Vau would have to fight their way through an armed patrol of Muuns and battle droids to escape. During the skirmish, Vau fell through a hole in the ice and into one of the countless crystal-worm tunnels that ran beneath the frozen surface of Mygeeto; although Delta Squad was determined to retrieve him, Vau forcefully commanded them to leave him and get themselves to safety. Despite severe reservations, Delta Squad did as ordered and exfiltrated from Mygeeto, although each would have some difficulty coming to terms with their perceived abandonment of their former sergeant. However, Boss contacted Kal Skirata and Null Captain Ordo once they were off planet to inform them of Vau's situation; Skirata and Ordo immediately traveled to Mygeeto and managed to extract a hypothermic but still alive Vau from beneath the Mygeetan ice."}, {"tag": "p", "text": "Upon their return to Coruscant from Mygeeto, Delta Squad was debriefed by the Director of Special Forces, Jedi General Arligan Zey, at Special Operations Brigade Headquarters. Zey then informed Delta of their newest orders: Supreme Chancellor Palpatine had ordered the capture of the rogue Kaminoan scientist, Kamino's own former Chief Scientist Ko Sai. Considering her capture as near a priority as locating the Confederacy's Supreme Commander, General Grievous—if only to deny her expertise to the Separatists, but primarily so as to have an experienced cloner unassociated with Tipoca under Republic control—Palpatine insisted that Zey put his most qualified squad on the assignment, from which Zey selected Delta Squad for the task. Ko Sai had gone missing during the Battle of Kamino, and was suspected to have defected to the Confederacy by Kamino's Prime Minister, Lama Su. Despite the length of time between her disappearance and Delta Squad's tasking of her retrieval, Kaminoan intelligence was able to track Ko Sai's movements to the planet Vaynai. Zey insisted that Delta Squad not inform Kal Skirata of their assignment, knowing of the Mandalorian's extreme hate for Kaminoans. Unknown to Delta, Skirata was also already hunting for Ko Sai, but for his own reasons: he wished to use the Kaminoan scientist to find a way to halt the accelerating aging that plagued the Grand Army's millions of clones."}, {"tag": "p", "text": "Delta Squad followed the Kaminoans' intelligence reports to Vaynai, and then on to Aquaris, and from there to Napdu, the fourth moon of the planet Da Soocha, in Hutt Space. There, Fixer sliced into the systems of the Nar Hej Shipping Company, acquiring files that helped Delta to further trace a pattern of movement for Ko Sai, tracking her across the Outer Rim's numerous aquatic worlds toward the Tingel Arm. When the squad's TIV vessel came under attack while leaving Napdu, they were forced to touch down on Da Soocha's third moon, with the Crusher-class starfighter that had attacked them continuing pursuit; on the ground, Boss used the TIV's laser cannon to blast away one of the Crusher's wings, and both Scorch and Sev attacked the wrecked starfighter. Though Sev killed the female pilot and her male copilot, Fixer was able to access the ship's computer and determine that the pair were bounty hunters hired by the Kaminoans to track Ko Sai. Using the data acquired from the Nar Hej Shipping Company, Delta Squad tracked down the Twi'lek pilot, Leb Chura, on Bogg 4. They interrogated Chura as to Ko Sai's whereabouts with the assistance of General Bardan Jusik: Chura had been moving cloning materials from Arkania to Dorumaa, but the Twi'lek had already relayed this information to Skirata and Vau. In order to keep Skirata and his quest a secret, Jusik influenced Chura to recall Mandalorians wearing different colored armor than Skirata or Vau's more recognizable sets when asked, and upon learning that Chura had delivered the consignment to a location near Dorumaa's Tropix Island Resort, Jusik erased the pilot's memory of both Delta and Skirata's band, along with deleting the records on his datapad."}, {"tag": "p", "text": "With this lead, Delta Squad traveled to the watery resort world of Dorumaa. When they arrived, Fixer and the other members of Delta acted as part of a maintenance crew in order to gather surveillance; intercepted communication on the police frequency led them to a collapsed area underneath Tropix's neighboring ActionWorld island. There, they found the skeletal remains of a dead human that had been chained beneath the water, and the collapsed entrance facility that had previously belonged to Ko Sai. Skirata and his crew had arrived first, capturing the Kaminoan scientist, destroying the laboratory, and taking her back to Skirata's home on Mandalore. The squad was tasked with the slow excavation of the area; at one point they were able to insert a small strip-cam through an available opening, finding the armored remains of the Mandalorian bodyguards Ko Sai had hired. Though Delta found no further evidence over the next few weeks of excavation, they remained unyieldingly loyal in covering for General Jusik's absence while the Jedi Knight secretly sneaked away to aid Skirata. Five hundred and forty-eight days into the Clone Wars, the commandos of Delta Squad were called back to Special Operations Brigade on Coruscant where they were met by Kal Skirata. There, Skirata gave Sev a package containing Ko Sai's severed head to deliver to General Zey; the rogue Kaminoan had taken her own life while being held on Mandalore, and was cut into pieces post-mortem."}, {"tag": "h3", "text": "Battle on Haurgab"}, {"tag": "p", "text": "Approximately nine hundred and seventy days into the Clone Wars, Fixer and the other members of Delta Squad found themselves on the Separatist-aligned Mid Rim planet of Haurgab. Originally, while Jedi General Mlaske and the Grand Army's 85th Infantry Brigade were already operating on Haurgab, the only Republic commando presence on the dusty backwater world had been Omega Squad, sent to assassinate a key leader of the pro-Separatist Maujasi. However, as time passed, the Republic began to assign more and more Grand Army forces to Haurgab and Delta Squad, much to their displeasure, soon joined them."}, {"tag": "p", "text": "During a visit from General Etain Tur-Mukan—having replaced Bardan Jusik as commander of Delta Squad's Commando Group, Zero Five Commando, following his resignation as a Jedi General and his departure from the Jedi Order—the four members of Delta Squad joined a number of other clone troops in the mess hall of the Republic's base on the outskirts of the Haurgab city of Hadde. While Delta was sitting down at a table with their food—trading jokes and theories on assorted topics—the base was struck by a missile from within the city limits; though numerous troopers were killed and wounded in the attack both from the blast and the resultant shrapnel, Delta Squad had been spared the worst injuries thanks to their hardy Katarn armor. Together with Omega Squad, General Tur-Mukan, and elements of the 85th and 14th Infantry Brigades, Delta Squad moved in a retaliatory strike against the rebel forces. When they had arrived at the house where the missile had originated, Scorch insisted on being part of the assault team for the raid while Fixer the rest of Delta stood by as security to deal with any potential attack from another source. During the shootout, four rebels were taken captive, while another three were killed. Scorch, infuriated by the idea of being attacked in a place that had always been perceived as safe and the sight of so many dead and injured clones, dragged the rebels' lifeless bodies out into the street where he riddled them with blasterfire before finally spitting on each of the charred corpses as Fixer and the other commandos of Delta Squad stood by until he had finished."}, {"tag": "h3", "text": "Kashyyyk"}, {"tag": "p", "text": "Around one thousand and seventy days after the Battle of Geonosis, Delta Squad was sent to the Wookiee homeworld of Kashyyyk in the Mytaranor sector. Following a Separatist-backed invasion by Trandoshan slavers, the Wookiee chieftain Tarfful had been taken prisoner. Tarfful had spent years combating Trandoshan slaving parties, and without him the Wookiees turned to the Republic for assistance. In response, Delta Squad was deployed to Kashyyyk in order to extract Tarfful from captivity, in a mission that would see Delta under the oversight of Advisor CC-01/425 yet again. Fixer and the rest of Delta Squad covertly inserted into Kashyyyk via LAAT/i gunship, rappelling down to the planet's surface from the troop bay. Once on the ground, the squad moved through the planet's dense jungle until coming upon the camp of the Trandoshan slavers. Battling their way inside, the squad was ambushed in a narrow corridor by Trandoshan mercenaries on the overhead catwalks, forcing them to make an escape through a maintenance shaft toward a landing zone. After securing the landing zone, the commandos caught a glimpse of a Belbullab-22 starfighter, matching its profile to General Grievous' ship, Soulless One. Continuing through the slaver's base, Delta freed a number of imprisoned Wookiees on their way to locate Tarfful before Delta's advisor tasked the squad with another objective: confirming Grievous' presence on Kashyyyk. Climbing a tower close to the General's landing pad, Fixer and Delta managed a visual confirmation on the General himself, before nearly being attacked by one of Grievous' IG-100 MagnaGuards. Rushing down the tower, Delta Squad found Tarfful being escorted to Grievous' fighter by two MagnaGuards; although Tarfful was able to successfully destroy the droids on his own, Grievous fled the planet in his starfighter, leaving behind another pair of MagnaGuards. Though Grievous had initially wanted the Wookiee chieftain alive for questioning, now that the opportunity had been taken from him, the commander of the Separatist Droid Army instead ordered Tarfful dead so as to deny the Republic the valuable intelligence Tarfful possessed. Fixer and the other commandos of Delta Squad engaged the deadly droids in an effort to protect Tarfful, although the Wookiee warrior refused to back down from his attackers. Together, the commandos and their Wookiee ally defeated the droids, and Tarfful was taken to Coruscant in order to enlist further Republic assistance."}, {"tag": "p", "text": "Delta Squad destroyed another Trandoshan encampment not long after, before moving on the bridge near the Wookiee village of Kachirho. By this point in time, Delta had been joined by Jedi General Etain Tur-Mukan on order of General Arligan Zey, who believed that she would prove beneficial to the mission. She informed the squad of the bridge's significance—were the bridge to be destroyed, the Separatist supply lines would be cut off, while the Wookiees would be able to construct smaller bridges to circumvent the loss, an option the Confederacy's battle droids didn't have—and tasked the squad with taking it out. Moving through an occupied market concourse, Fixer and Delta fought their way through numerous Trandoshan grenadiers and heavily armed mercenaries along with another advanced spider droid and countless battle droids to reach the Kachirho Bridge, where Delta Squad placed a detonation pack at the center of the bridge where it was weakest. However, when Boss attempted to detonate the charge, the explosives suffered a misfire. Undeterred, Scorch borrowed a rocket launcher from a female Wookiee, and used it to destroy the bridge. Thirteen days later, Delta would continue operations on Kashyyyk, even as Coruscant came under attack by General Grievous. While preparing to ambush a Separatist droid patrol, Scorch and Sev listened in to the comlink traffic from Coruscant—learning that only commandos in the Inner Rim had received the Code Five signal to return to Coruscant immediately—as Fixer discussed the nature of droid sentience with General Tur-Mukan. When Tur-Mukan expressed her concern for her loved ones residing on the Republic's besieged capital, Delta took it upon themselves to comfort her and promised to keep her secret, when she revealed she had a son. Though the battle droid patrol would fall victim to Wookiee-made pitfalls, Delta and Tur-Mukan ambushed a small group of Trandoshans scouting through the Wroshyr trees, disposing of their dead bodies via a carnivorous plant."}, {"tag": "p", "text": "Five days later, with the crisis on Coruscant over, Delta Squad was joined on Kashyyyk by the clone forces of Jedi General Quinlan Vos, arriving from Boz Pity. In addition, General Yoda was inbound with the 41st Elite Legion and Wookiee Chieftain Tarfful, set to land within thirty standard minutes. However, a Recusant-class light destroyer had taken up position to engage Yoda's cruiser and halt the debarking of additional ground troops. With a bit of good-natured coaxing from General Tur-Mukan, Fixer and Delta Squad infiltrated a Separatist turbolaser battery complex with the intent to commandeer the contained firepower to take out the Recusant-class destroyer. With Clone Commander Gree considering alternative landing sites—each too far removed from the main offensive to be effective—Delta Squad captured one Wookiee dual missile turret for each commando, and opened fire on the Commerce Guild destroyer, joined in the attack by a wing of General Vos' LAAT/i gunships. After sustaining heavy damage, the Recusant destroyer began to fall, but while the majority of Delta Squad planned for a hasty exit, Sev radioed in with a report of coming under attack from multiple hostiles. When Boss ordered the squad to go back for Sev, Vos' Forward Air Controller instead ordered Delta to leave, stating that the order had come directly from General Yoda himself. Though Scorch argued to the point of tears, Fixer reiterated the need to comply with their orders and Boss forced him to comply. All three remaining members of Delta Squad onto the gunship that had arrived to extract them. Aboard the gunship, Advisor CC-01/425 confronted Delta and patching through a transmission from General Yoda, who stated that Delta Squad's efforts had enabled the Republic to establish forward command in Kachirho, and that the Republic would continue to rely on their skills in the coming battle. Fixer and Delta Squad were then retasked with a new set of objectives for Kashyyyk."}, {"tag": "h3", "text": "Imperial service"}, {"tag": "p", "text": "Not long after the conclusion of Republic action on Kashyyyk and the issuing of Order 66, which branded the Jedi traitors to the Republic who were to be shot on sight, the Clone Wars would come to an end when the old Republic was transformed into the new Galactic Empire, under the leadership of the now Emperor Palpatine. Nearly eleven-hundred days after the Battle of Geonosis, the three remaining members of Delta Squad found themselves stationed at the Imperial Army Training Center on Centax-2, one of the moons of Coruscant and the location of the secret Spaarti cloning cylinder-based second clone army that Palpatine had created. There, they would continue to lament the loss of Sev, especially in the face of the revelation that although Omega Squad members Atin and Corr had deserted the Grand Army, Darman and Niner had joined Delta in the new Imperial Army because Darman had refused to leave a badly wounded Niner behind on his own."}, {"tag": "p", "text": "Three weeks after the formation of the new Empire, Delta Squad—with a new replacement for Sev among their ranks—gathered at the 501st Legion headquarters on Coruscant with a number of other former Republic commandos and Advanced Recon Commandos for an audience with Darth Vader. There, Vader reformed the Republic's former special forces soldiers as the Imperial Commando Special Unit, an elite unit within the Imperial 501st Legion that would be tasked with hunting down Jedi who managed to escape Order 66, along with clone deserters, Jedi sympathizers, and other Imperial dissidents. Their serial numbers' \"RC\" prefix replaced with an \"IC\" to denote their new position as Imperial Commandos, the squad would also find themselves given a different and more numerically-based name, similar to the former Omega Squad being deemed \"Squad 40\". Although initially under the command of the Emperor's Hand, Sa Cuis, the Imperial Commando Special Unit would be taken over by Imperial Commander Roly Melusar—a native of the planet Dromund Kaas and a man with a firm hatred of all Force-users—following Cuis' death. Fixer was impressed by Melusar's earnest style of command, appreciating that the man did not distance himself from his troops, and he preferred Melusar to Cuis."}, {"tag": "h2", "text": "Personalities and Traits"}, {"tag": "p", "text": "Fixer was the acknowledged second-in-command of Delta Squad, a position he attained due to his reliable nature. A soldier who believed in doing his job by the book, Fixer was gruff and preferred calling his squadmates by their numerical designations while in combat, rather than by their acquired nicknames. His own nickname was a product of Fixer's expertise with technology, and his exceptional skill as a slicer, a talent which he was proud of and enjoyed putting to use. Fixer was usually quiet, keeping his opinions to himself unless called for, and often took it upon himself to curtail the playful teasing of his squadmates Sev and Scorch. Fixer chose to decorate his commando armor with green stripes and markings, and he could fluently speak Basic and significant degree of Mando'a. In spite of his by-the-book nature, however, Fixer disliked his new Imperial Commando armor like many of his more unconventional fellow commandos, most likely due to the new equipments ineffectiveness compared to its predecessor and the unnecessary use of valuable Credits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "RC-1140—Fixer—made his first appearance in the 2005 video game Star Wars: Republic Commando, where he was voiced by actor Andrew Chaikin. He would later feature in the Republic Commando series of novels by author Karen Traviss, beginning with an appearance in Republic Commando: Triple Zero, and continuing in True Colors, Order 66, and Imperial Commando: 501st."}, {"tag": "p", "text": "Fixer, along with the rest of his squad, was seen in Star Wars: The Clone Wars Season Three, in the episode, \"Witches of the Mist\", but unlike the rest of his squad, he is almost completely covered by the shadow of the ship they come in, and is undistinguishable from his teammates until their paint schemes single Fixer as being the one who hangs behind to stand near the coffins of the deceased Jedi they brought back to the temple. As with all of his teammates, Boss excluded, he has no dialogue, in contrast to Republic Commando, where he had plenty of dialogue, along with his squad."}, {"tag": "p", "text": "Fixer's out-of-universe nickname origins come from the nickname of famed Star Wars character Luke Skywalker's friend, Laze \"Fixer\" Loneozner, with whom he had lived on Tatooine as a youth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}