{"url": "Ayar", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Clone troopers", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "Ayar"}, {"tag": "p", "text": "\"Ayar\" was the nickname of a clone trooper in the Grand Army of the Republic. In 22 BBY, he fought as a part of Torrent Company in the Battle of Teth. During the ensuing battle, Ayar was killed by battle droid forces of the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 22 BBY, during the Clone Wars, members of the Galactic Republic's Grand Army of the Republic were deployed to the Outer Rim planet Teth. to rescue Rotta, the child of Jabba Desilijic Tiure from the Confederacy of Independent Systems. In the assault, 501st Legion's Torrent Company scaled the sheer walls of the B'omarr Order monastery where the Huttlet was being held. Although the company took heavy casualties, many survived the ascent, including Ayar."}, {"tag": "p", "text": "Upon entering the monastery, the troops were met by 4A-7, a Confederate spy droid posing as the monastery's caretaker. Ayar, along with clone troopers Lunn, Coric, and Vaize, led by Jedi General Anakin Skywalker, confronted the droid. After incorrectly determining 4A-7 to be nothing but a simple caretaker droid, the men of Torrent Company prepared a defense against Confederacy counterattacks. Although Ayar survived the initial assault, he was killed along with all but six members of Torrent Company during the reactionary attacks from the Confederacy on the monastery."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a male Human clone of bounty hunter Jango Fett, Ayar stood 1.83 meters tall, and was born on the Wild Space planet Kamino."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ayar was equipped with a set of standard Phase I clone trooper armor, and a night-vision visor affixed to his helmet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ayar first appeared in the 2008 novelization of the Star Wars: The Clone Wars film by Karen Traviss. Although his death is not explicitly detailed, it is noted in the novel that only six clone troopers of Torrent Company survived, and Ayar was not one of those listed, so this article assumes he was killed at some point after the confrontation with 4A-7."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}