{"url": "RA-7_protocol_droid/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Fifth-degree droid models", "Category:Protocol droid models", "Category:RA-7 protocol droids"], "nodes": [{"tag": "h1", "text": "RA-7 protocol droid"}, {"tag": "p", "text": "The RA-7 protocol droid was a fifth-degree primary, low-intelligence model of protocol droid produced by Arakyd Industries specifically for the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Humanoid in shape with an insectoid head, and similar in build to the 3PO-series of protocol droids, the RA-7 was covered in reflective plating and commonly found in the offices of high-ranking Imperial officials, military officers, courtiers, and Coruscant dignitaries. It was intended to help its owner with scheduling and translating. Unlike 3PO-series with their delicate personalities, RA-7s were programmed to be \"stern,\" but bland."}, {"tag": "p", "text": "It had a secret surveillance system installed in its head, hidden beneath layers of benign cognitive circuitry. The espionage unit was hidden behind sensor bafflers that were disguised as soldering welds. It would record everything using extremely sensitive audio pickups and low-light photoreceptors and would make periodic dumps of data via encrypted frequencies on standard public comm units to the Imperial Security Bureau."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The RA-7 series was first shown at the North Quadrant Intergalactic Automaton Show. The model was an attempt by Arakyd Industries to duplicate most of the abilities of the 3PO series of protocol droids, and in most aspects it failed. A prototype, 4A-7, saw use by Separatist agent Asajj Ventress during the Clone Wars in 22 BBY."}, {"tag": "p", "text": "While not particularly useful, the RA-7 became nearly ubiquitous in the Empire by 0 BBY in a plot by the Imperial Security Bureau to spread the droids. The Bureau had ordered thousands of RA-7s from Arakyd and installed special programming in the droids to use them as spies. Almost no one would willingly buy an RA-7 as an assistant—so the ISB gave them away as gifts. As those targeted by the droids began to uncover hidden recording devices and surveillance equipment in the nigh-useless droids, they began to hide, misplace or lose them to avoid attention and branding as traitors for spurning a gift from the Emperor. This often led them to be found in junk shops, droid auctions, or swap meets."}, {"tag": "p", "text": "A number of RA-7 droids were used aboard Star Destroyers to monitor medical equipment, such as life support capsules."}, {"tag": "p", "text": "A combination of the destruction of the majority of their droids and the detection of their program caused the Bureau to cancel the RA-7 droid surveillance initiative shortly after 1 ABY."}, {"tag": "h2", "text": "Ominous nickname"}, {"tag": "p", "text": "As the first Death Star came online, the Bureau grew concerned that Grand Moff Wilhuff Tarkin would attempt to use the superweapon to overthrow the Empire. Unable to trust the Grand Moff or any of his subordinates, the Bureau stationed thousands of RA-7 droids on the Death Star, earning them the nickname \"Death Star droids.\""}, {"tag": "h2", "text": "Known units"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An RA-7 appears inside the Jawas' sandcrawler after R2-D2 is dropped in after being disabled by the Jawas in Star Wars: Episode IV A New Hope. A second, black-colored RA-7 appears briefly later in the film, walking past Han Solo, Chewbacca and Luke Skywalker outside the Death Star elevator doors."}, {"tag": "p", "text": "Kenner released a Death Star Droid as part of its second wave of action figures in 1978. The droid was also a Power of the Force 2 Freeze Frame Fan Club Exclusive in 1999. Along with the Freeze Frame slide, this black Death Star Droid came packaged with a mouse droid model."}, {"tag": "p", "text": "In Star Wars 2, the adaptation of A New Hope by Marvel Comics, Darth Vader tortures Leia Organa with an RA-7 unit rather than an IT-O Interrogator."}, {"tag": "p", "text": "In Star Wars: Jedi Knight II: Jedi Outcast, the \"Death Star Droid\" can be spawned by typing \"npc spawn protocol_imp\"."}, {"tag": "p", "text": "The droid appears, somewhat ironically, as the \"guide\" droid for the Zann Consortium in the place of where R2, or a black Imperial astromech droid, would in the game Star Wars: Empire at War: Forces of Corruption."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}