{"url": "RGL-80_electronet_grenade", "categories": ["Category:Legends articles", "Category:Electrical weaponry", "Category:Golan Arms products", "Category:Grenades"], "nodes": [{"tag": "h1", "text": "RGL-80 electronet grenade"}, {"tag": "p", "text": "The RGL-80 electronet grenade or simply \"electronet\" was a type of grenade designed by Golan Arms to stun and capture targets."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The electronet was a composite of sticky fibers inside a grenade-like canister, with a thin control wire or trailing guide wire communicating it with a control panel. It could be fired through any standard grenade launcher. When it struck a target, it unraveled the conductive fibers, producing a sticky net with a diameter of up to 3 meters. If the shot was precise, then the target—commonly a living being—would be ensnared at this point. The operator of the launcher might then use a control panel under the weapon to unleash an electric charge that would go through a trailing guide wire from the panel to the net, stunning the captured target. The amount of electrical charge could be varied depending on the target, allowing for lethal or nonlethal applications."}, {"tag": "p", "text": "A single electronet grenade weighed five kilograms and had a maximum range of a grenade launcher, which was 375 meters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The electronet was developed by the company Golan Arms. In the days that followed the Battle of Yavin, it was hard to obtain, but it did find some use between bounty hunters who wanted to capture fugitive prey. One bounty hunter who favored this weapon was Garim Ayrvn. Another was Remel Fud, who relied heavily on his technology to bring down his targets. He called his electronet \"The Agony Inducer.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The electronet was mentioned in two role-playing guides: Galaxy Guide 10: Bounty Hunters (1994), written for West End Games' Star Wars: The Roleplaying Game; and Scum and Villainy (2008), written for Wizards' Saga Edition Roleplaying Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}