{"url": "RC-1572", "categories": ["Category:Legends articles", "Category:Clone commandos", "Category:Spies", "Category:Thyrsians", "Category:Zeta Magnus' Empire members"], "nodes": [{"tag": "h1", "text": "RC-1572"}, {"tag": "p", "text": "RC-1572, nicknamed Quo was a Republic commando and member of the elite clone commando squad led by Captain Nilo known as Tark Squad, which was part of the Special Operations Brigade of the Galactic Republic in 21 BBY. Quo was nicknamed by his genetic template and trainer Sarsius Torne after the Thyrsian letter for two."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "RC-1572, nicknamed \"Quo,\" was a Republic commando and a of the Galactic Republic Tark Squad. In actuality, Quo and his squad were Thyrsian mercenaries trained by Sarsius Torne of the Sun Guards to infiltrate the Grand Army of the Republic as part of a deal made with Zeta Magnus and Palpatine to recover Anakin Skywalker. To ensure obedience Quo was implanted with a cybernetic control band. In 21 BBY, Quo and his squad were sent to assist Jedi General Obi-Wan Kenobi in liberating the planet Skye from Zeta Magnus while disguised as a relief team."}, {"tag": "p", "text": "Quo and the rest of the liberation team snuck into Zeta Magnus' fortress through Entyrmion's subterranean tunnel system located beneath the fortress.While in the cave, the liberation team was attacked by multiple Oskan blood eaters created by Zeta Magnus which killed many of their S'kytri guides as well as the Lord of the S'kytri Highland Clans, Lord Klarymére. The commando squad was able to kill the blood eaters with a Class-D detonator which angered Obi-Wan, as he believed it was \"affront to the force\". When the liberation team arrived in Zeta Magnus' fortress, Quo and the rest of Tark Squad led the Jedi commanders into a field of R-TechApp Man Traps. Quo and his squad revealed to the Jedi Commanders that they were allied with Zeta Magnus and left them to be tortured by Zeta Magnus and his torture droid. Quo was killed in the fortress by Halagad Ventor when the Jedi Knight beheaded him with his Lightsaber."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Quo wore specialised Katarn-class commando armor with a silver finish like the rest of his squad. Quo used a DC-17m interchangeable rifle with a Grappling spike launcher attachment."}, {"tag": "h2", "text": "Appearances"}]}