{"url": "RC-1207/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Clone commandos", "Category:Sharpshooters and snipers"], "nodes": [{"tag": "h1", "text": "RC-1207"}, {"tag": "p", "text": "RC-1207, also known as Delta-07 or by his chosen nickname of Sev, was a clone of Mandalorian bounty hunter Jango Fett. Born in 32 BBY on the watery world of Kamino, Sev was trained by the Mandalorian Cuy'val Dar training sergeant Walon Vau to become a clone commando in the Grand Army of the Republic. Joining with three other commandos to form the elite special forces unit Delta Squad, Sev served as the unit's star sniper. When the Clone Wars broke out between the Galactic Republic and the Confederacy of Independent Systems, Sev took his place in the Grand Army's Special Operations Brigade under Jedi General Arligan Zey and served alongside his clone brothers in Delta Squad on a number of battlefields, ranging from the deserts of Geonosis, the halls of the RAS Prosecutor, and the streets of Coruscant, to snowy Mygeeto and the plains of Haurgab. Known for his morbid sense of humor and a hatred of Geonosians, Sev was an efficient killer and loyal soldier who completed several covert operations within Delta Squad until the squad's fateful mission to Kashyyyk. There, while in the process of destroying a Separatist warship over the Wookiee city of Kachirho, Sev fell under attack, and the other members of Delta Squad were ordered to pull out of the area without him, forced to leave Sev behind. With the rest of his squad unsure whether he was alive or dead, Sev became one of many clone soldiers listed as missing in action."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and training"}, {"tag": "p", "text": "RC-1207 was born in the year 32 BBY, in the cloning facilities of Tipoca City, on the aquatic planet of Kamino. A clone of the Mandalorian bounty hunter Jango Fett created to serve in the Grand Army of the Republic as a clone commando, RC-1207 took the name \"Sev\" for himself, the name originating from the last digit of his numerical designation, and was placed under the training of the Mandalorian Cuy'val Dar training sergeant, Walon Vau. Vau believed in training his clones hard, giving them his worst in training so that they could perform to their best once out in the field—to do anything less would compromise them. Though there were those who believed that Vau's methods were too brutal, Sev was grateful to Vau for making him and his clone brethren into survivors. Sev looked up to Vau, and had a desperate desire not to ever let his training sergeant down. As a result, Sev would push himself to the point of daily exhaustion, often collapsing into his bunk at the end of each day of training. Sev was assigned to Delta Squad, one of the first commando units established by the Kaminoans, along with, RC-1140, and RC-1262, and under the command of sergeant RC-1138—nicknamed \"Fixer,\" \"Scorch,\" and \"Boss,\" respectively. As his training progressed, Sev stood out in ambush training and quickly displayed his skill as a sniper; the Kaminoan project coordinator for the Republic's clone army, Taun We, regarded Sev as a fierce hunter."}, {"tag": "h3", "text": "Geonosis"}, {"tag": "p", "text": "The Grand Army finally saw action in 22 BBY, when Jedi Grand Master Yoda took the army to the Outer Rim world of Geonosis to rescue Jedi Knight Obi-Wan Kenobi, his Padawan Anakin Skywalker, and Galactic Senator Padmé Amidala. Sev and the rest of Delta Squad were sent to Geonosis in a deployment so hastily ordered and carried out that it left Delta with no time to say goodbye to their training sergeant, Vau. Delta Squad was tasked with assassinating Geonosian Archduke Poggle the Lesser's chief lieutenant, Sun Fac. The four commandos split up, each boarding a single LAAT/i gunship independently, with the intention of rendezvousing once on the surface of Geonosis. Once on the ground, Sev was the first member of Delta to reach the appointed rendezvous and was soon joined by his squadmates. Reunited, Delta Squad attacked Sun Fac in his command center, although the Geonosian leader managed to flee and escape. Delta tracked Fac through the Geonosian catacombs, eventually catching up with him in Fac's private hangar as the Geonosian attempted to escape in his starfighter. However, Fac's escape was prevented by the timely actions of Sev, who used the sniping attachment of his DC-17m blaster rifle to shoot down the starfighter, killing Fac. Sev was also the first of the Deltas to spot the personal starfighter of General Grievous as it departed Geonosis, though none of the commandos were able to recognize it for what it was at the time. Sev and the other members of Delta Squad were then tasked by clone advisor CC-01/425 to complete the failed objective of their fellow Republic commando squad Theta Squad: destroying an underground droid factory. The commandos infiltrated the factory and targeted weak points in the facility's design, together causing enough damage to destroy it."}, {"tag": "p", "text": "Following the destruction of the droid factory, Delta Squad was given new orders, tasked with the infiltration of a Lucrehulk-class Core Ship. Deployed in a nearby canyon from an LAAT/i gunship piloted by clone pilot Delta 42, Delta Squad made their way to the Core Ship, using a downed gunship's composite-beam turrets to fend off enemy Geonosians along the way. As they continued toward the Core Ship, the squad was called upon to take out an anti-aircraft cannon. Sev and the other commandos fought through a number of B1-Series battle droids and their super battle droid counterparts, before finally destroying the large anti-aircraft emplacement. When the squad finally reached the Core Ship, they were met with resistance from an advanced spider droid, and a ray shield blocking the ship's entrance. The four commandos were able to destroy the spider droid with considerable effort, and they then called in air support to blow through the ray-shielded entrance. Once inside, Delta Squad again split up, each of its members sabotaging and destroying various crucial systems; Sev infiltrated the repulsorlift control room, and sliced into the system, shutting down all repulsors and jarring the ship. When Scorch and Fixer came under heavy fire from a small number of droidekas, Sev met up with Boss to rescue them, with Sev even leaping on an unshielded droideka while it rolled by, finishing it off with his blaster. Their primary objective, however, was the capture of vital launch codes housed on the ship's bridge. Once on the bridge, Delta came under heavy fire from numerous battle droids and stationary autoturrets, but still managed to acquire the codes before retreating down a branching corridor. By this time, the squad's efforts to sabotage the Core Ship had come to full fruition, with several primary systems overloading. With no time to make an escape back the way they had come, Delta Squad was extracted via LAAT/i gunship through a hole forcefully blown in the hull of the ship."}, {"tag": "p", "text": "The First Battle of Geonosis was the first action Sev and his brothers from Delta Squad saw, but with the Clone Wars breaking out throughout the galaxy between the Galactic Republic and the Confederacy of Independent Systems, it would not be the last. Delta Squad would prove to be one of the lucky minority of Republic commando squads to depart Geonosis intact and with no casualties; 4,982 other commandos perished on Geonosis' red sands. The death of these nearly five thousand clones influenced Sev's lasting hatred of Geonosians, and throughout the Clone Wars, Sev would attempt to kill 4,982 Geonosians in vengeance for the commando losses that day."}, {"tag": "h3", "text": "Mission to the Prosecutor"}, {"tag": "p", "text": "On the day before the second anniversary of the Battle of Geonosis, three hundred and sixty-seven days into the Clone Wars, Sev and the rest of Delta Squad were called upon to investigate the Acclamator-class assault ship Prosecutor. Having recently reappeared in the Chaykin Cluster following a two-week-long disappearance while tasked with defending trade routes in the Corellian sector, the Prosecutor was found drifting, without power or communication capability. Delta Squad had spent a substantial amount of time aboard the capital ship during the early portion of the war, even coming to think of it as their \"first home.\" Arriving on scene in the Corbantis system aboard a CR25 troop carrier, Delta Squad was tasked with retrieving flight records from the Prosecutor's four data cores and securing the derelict assault ship; Sev was charged with acquiring the data from the ship's starboard data core."}, {"tag": "p", "text": "The four members of Delta Squad disembarked from the CR25 via a jump through the vacuum of space, splitting up and entering the Prosecutor at four different locations. Interference in their comms quickly cut Sev and the others off from the guidance of CC-01/425, who was again serving as mission advisor to the squad. While searching the ship, Delta Squad came across few survivors, and several members were set upon by scavenger droids; Scorch was ambushed and incapacitated by the droids. Shortly after, the squad found that the Prosecutor has been attacked by Trandoshan slavers and mercenaries when Sev was captured at the starboard data core. He was beaten and interrogated by the Trandoshans before Boss and Fixer were able to battle their way through heavily armed and armored Trandoshan mercenaries to rescue Sev. Once Sev was free of the violent interrogation from his Trandoshan captors, the still incomplete squad moved to retrieve Scorch from where he was being held in the Prosecutor's detention area. After a brief skirmish in the detention area, Delta Squad located and revived an incapacitated Scorch, and together made their way to the bridge, where they destroyed a Confederacy jamming device and re-established communication with their advisor."}, {"tag": "p", "text": "A brief scan revealed that a Trandoshan dropship had touched down in one of the Prosecutor's hangar bays. Proceeding to the hangar—after being sidetracked through the detention center by a booby-trapped turbolift—Sev and the other members of Delta Squad found that a Lucrehulk-class battleship had entered the system and was rapidly approaching the Prosecutor. While their advisor called for assistance, Delta Squad was charged with repelling the droid boarding parties and sealing the assault ship's hangars. By the time Sev and the others reached the final hangar, it was overrun with droids, and the commandos had to resort to commandeering the roof-mounted mass-driver cannon of an AT-TE walker to deal with the droid threat. Following these losses, the Separatist battleship opened fire on the Prosecutor, deciding to cut its losses and destroy the Republic warship before reinforcements could arrive. In an attempt to hold off the battleship, Delta Squad struggled to get the Prosecutor's turbolaser battery array back online amidst a continuing assault from droid forces already onboard. Reinforcements came in the form of Republic Navy Captain Talbot and the RAS Arrestor, the only Republic force to respond to CC-01/425's calls for assistance. Between the combined strength of the Arrestor and Prosecutor—even as the latter's hull integrity was compromised—the Confederacy droid control ship was destroyed, shutting down the battle droids aboard the Prosecutor, and saving the ship and the lives of Delta Squad. Sev and his Delta Squad brothers were commended by High Jedi General Mace Windu for their actions aboard the Prosecutor, and the data that they retrieved would help enable the Wookiees to better combat Trandoshan slaving operations in the Kashyyyk system."}, {"tag": "h3", "text": "Work with Omega"}, {"tag": "p", "text": "Sev and the rest of Delta Squad departed the Prosecutor aboard a captured Neimoidian shuttle. Shortly thereafter, they received a Red Zero signal—the GAR code requesting immediate extraction—from their fellow commando unit Omega Squad. Delta Squad was the closest Republic unit to Omega's position aboard a damaged freighter at the Corellian–Perlemian hyperspace intersection, in the Tynna sector, and the first on site to recover both their commando comrades and the trio of prisoners Omega Squad had apprehended. Once safely on board, Sev nearly provoked a physical confrontation with Omega Squad member Atin; Atin had been a trainee of Walon Vau back on Kamino, the same as Sev and the other Deltas, though Atin had sworn to kill Vau for the brutality that he had suffered during training and after returning from the Battle of Geonosis as the sole survivor of his original squad. Omega Squad's sergeant, Niner, was able to keep the conflict from turning violent, although Sev remained ill-at-ease with Atin. Both Delta and Omega Squad docked aboard the Acclamator-class ship Fearless and returned to Coruscant."}, {"tag": "p", "text": "On Coruscant, Sev and the other Delta Squad members were recruited by the former Cuy'val Dar sergeant Kal Skirata for a black ops mission to be conducted on Coruscant itself. In the days and weeks prior, Coruscant had suffered a number of terrorist attacks on GAR facilities, and Skirata had devised a means of covertly striking back at the terrorists culprits. Together with Omega Squad, Delta's former trainer Walon Vau, the Null-class Advanced Recon Commandos Ordo and Mereel, and Jedi Generals Bardan Jusik and Etain Tur-Mukan, Sev and the rest of Delta Squad began an investigation into the terrorists' whereabouts from the seedy Hutt-owned cantina Qibbu's Hut, in Coruscant's Entertainment District. Though Sev's grudge against Atin remained, and even grew to include Atin's squadmate Fi—whose talkative and jovial nature grated on Sev, and who had rallied to Atin during his initial confrontation with Sev—the two squads grew to respect each other, and Sev was able to lay his grudge with Atin to rest. Using Qibbu the Hutt's criminal contacts, the counter-terrorist strike team was able to lure their targets under the pretense of having a supply of high-yield thermal plastoid explosive that they were willing to sell. While Skirata acted as the strike team's public face, meeting with members of the terror cell—including its leader, Perrive—Sev and Scorch teamed with Omega Squad's Darman and Fi to mark the terrorists with specially designed tracers using Skirata's personally owned Verpine sniper rifles. Later, while performing reconnaissance on the marked terrorists—now identified as hailing from Jabiim via their accents—Sev dislocated his shoulder while attempting to outperform Fi. Fortunately, Fi was a trained medic and was able to put the joint back into its socket, and Sev was able to continue operating. After a meeting between Skirata and the terrorist leader Perrive establishing a time when they would supposedly make the explosives sale, Delta Squad spent an evening enjoying themselves at Qibbu's bar with the other members of the strike team, at least until the revelry was cut short by a call from Perrive stating they would need to move up their time and change the pre-established location. Fortunately, the new location for the trade was a CoruFresh produce distribution depot in Quadrant F-76 of Galactic City, a location Delta Squad had personally reconnoitered earlier."}, {"tag": "p", "text": "Sev partnered with Ordo, Fixer and Atin on the depot's roof, awaiting Skirata and Jusik's signal once they had finished making the fake trade of illegal goods. When the signal came, Sev and every other member of the strike team launched their full assault, killing every member of the terrorist cell present and securing the explosives. Once the terrorists were dead, Sev and the others returned to Qibbu's for a final night, and then attended an evening as guests of the CSF Social Club. But just six days later, Delta Squad was back on assignment, shipped off to Skuumaa and tasked with battlefield preparation consisting of sabotaging strategic targets ahead of the main Republic assault."}, {"tag": "h3", "text": "Mission to Devaron"}, {"tag": "p", "text": "Sev and the clone commandos of Delta Squad were later dispatched to Devaron to search for survivors of the engagement with Savage Opress. Finding none, they recovered the corpses of Jedi Master Halsey and his Padawan Knox, returning both to the Jedi Temple on Coruscant. The Jedi High Council concluded that the deaths of the Roonan Jedi and his apprentice were a sign of a new threat to the Republic; their suspicion was confirmed when security footage of the massacre, including Halsey's death, was recovered."}, {"tag": "h3", "text": "Mygeeto"}, {"tag": "p", "text": "Four hundred and seventy days after Geonosis, Delta Squad had been sent to the Outer Rim world of Mygeeto. The squad was tasked with calling in air strikes and sabotaging Mygeetan ground defenses near the city of Jygat in preparation for Clone Commander Bacara and the Galactic Marines' main assault. Delta completed their assignments as ordered, but instead of exfiltrating as they were supposed to, Sev and the other commandos instead decided to assist their former training sergeant Vau in his personal mission, one that consisted of robbing Mygeeto's own Dressian Kiolsh Merchant Bank. Sev followed Vau into the underground halls of the bank with Boss and Scorch, while Fixer kept a look out from their snowspeeder on the surface."}, {"tag": "p", "text": "Vau successfully infiltrated the vault, though once inside, he refused to allow the squad to assist him any further in the heist, determined not to compromise his trainees' integrity by directly involving them in the actual act of stealing. It was during Vau's raid on the vault's numerous safety deposit boxes that Sev learned of his former training sergeant's past as a disinherited aristocrat from Irmenu, and that the purpose of the theft was to regain the inheritance his mother and father had denied him. When Vau ordered Delta to leave him and continue with their assigned mission, however, the squad refused—reminding Vau that he was no longer a sergeant, just a civilian—and instead helped Vau and his strill, Lord Mirdalan, carry the stolen loot out of the bank."}, {"tag": "p", "text": "Their exit became complicated when one of the bank's alarms was triggered, and although Fixer brought the snowspeeder closer to the extraction point, Delta and Vau had to fight their way through an armed patrol of Muuns and battle droids to escape. During the skirmish, Vau fell through a hole in the ice and into one of the countless crystal-worm tunnels that ran beneath the frozen surface of Mygeeto; although Delta Squad was determined to retrieve him, Vau forcefully commanded them to leave him and get themselves to safety. Despite severe reservations, Delta Squad did as ordered and exfiltrated from Mygeeto, although each would have some difficulty coming to terms with their perceived abandonment of their former sergeant, none more so than Sev. However, Boss contacted Kal Skirata and Null Captain Ordo once they were off planet to inform them of Vau's situation; Skirata and Ordo immediately traveled to Mygeeto and managed to extract a hypothermic but still alive Vau from beneath the Mygeetan ice. Sev still looked upon the incident as a personal failure, believing he let his old sergeant down, and swearing to never leave another comrade behind."}, {"tag": "h3", "text": "The hunt for Ko Sai"}, {"tag": "p", "text": "Upon their return to Coruscant from Mygeeto, Delta Squad was debriefed by the Director of Special Forces, Jedi General Arligan Zey, at Special Operations Brigade Headquarters. Zey then informed Delta of their newest orders: Supreme Chancellor Palpatine had ordered the capture of the rogue Kaminoan scientist, Kamino's own former Chief Scientist Ko Sai. Considering her capture as near a priority as locating the Confederacy's Supreme Commander, General Grievous—if only to deny her expertise to the Separatists, but primarily to have an experienced cloner unassociated with Tipoca under Republic control—Palpatine insisted that Zey put his most qualified squad on the assignment, from which Zey selected Delta Squad for the task. Ko Sai had gone missing during the Battle of Kamino, and was suspected to have defected to the Confederacy by Kamino's Prime Minister, Lama Su. Despite the length of time between her disappearance and Delta Squad's tasking of her retrieval, Kaminoan intelligence was able to track Ko Sai's movements to the planet Vaynai. Zey insisted that Delta Squad not inform Kal Skirata of their assignment, knowing of the Mandalorian's extreme hate for Kaminoans. Unknown to Delta, Skirata was also already hunting for Ko Sai, but for his own reasons: he wished to use the Kaminoan scientist to find a way to halt the accelerated aging that plagued the Grand Army's millions of clones."}, {"tag": "p", "text": "Delta Squad followed the Kaminoans' intelligence reports to Vaynai, and then on to Aquaris, and from there to Napdu, the fourth moon of the planet Da Soocha, in Hutt Space. During this time, Boss was also battling a cold; his repetitive cough and clearing of his sore throat over the shared comlink in the Delta's helmets annoyed Sev until he insisted Boss take care of the issue. Files acquired from the Nar Hej Shipping Company on Napdu helped Delta to further trace a pattern of movement for Ko Sai, tracking her across the Outer Rim's numerous aquatic worlds toward the Tingel Arm. The squad came under attack from a Crusher-class starfighter while leaving Napdu in one of the Grand Army's TIV vessels. They touched down on Da Soocha's third moon, with the Crusher continuing pursuit; on the ground, Boss used the TIV's laser cannon to blast away one of the Crusher's wings, and both Scorch and Sev attacked the wrecked starfighter. During the action, Sev killed the female pilot and her male copilot to Boss's annoyance—dead, they couldn't be interrogated. However, Fixer was able to access the ship's computer and determine that the pair were bounty hunters hired by the Kaminoans to track Ko Sai."}, {"tag": "p", "text": "Using the data acquired from the Nar Hej Shipping Company, Delta Squad tracked down the Twi'lek pilot Leb Chura on Bogg 4. Sev caught the panicked pilot after a brief chase in Kerif City, and the Deltas interrogated Chura as to Ko Sai's whereabouts with the assistance of General Bardan Jusik. Chura had been moving cloning materials from Arkania to Dorumaa, but the Twi'lek had already relayed this information to Skirata and Vau. In order to keep Skirata and his quest a secret, Jusik influenced Chura to recall Mandalorians wearing green armor instead of Skirata and Vau's more recognizable golden and black sets when asked, and upon learning that Chura had delivered the consignment to a location near Dorumaa's Tropix Island Resort, Jusik erased the pilot's memory of both Delta and Skirata's band, along with deleting the records on his datapad. Sev noticed Jusik's odd behavior, and commented on it privately with the squad, but chalked it up to Jedi eccentricities. In spite of this, Delta acquired SCUBA trooper armor and traveled to the resort world of Dorumaa. There, Delta acted as part of a utilities maintenance crew in order to gather surveillance which led them to a collapsed area underneath Tropix's neighboring ActionWorld island. Upon investigating, the squad found the skeletal remains of a dead human that had been chained beneath the water, and the collapsed entrance to the facility that had previously belonged to Ko Sai. Skirata and his crew had arrived first, capturing the Kaminoan scientist, destroying the laboratory, and taking her back to Skirata's home on Mandalore. The squad was tasked with the slow excavation of the area; at one point they were able to insert a small strip-cam through an available opening, finding the armored remains of the Mandalorian bodyguards Ko Sai had hired."}, {"tag": "p", "text": "Though Delta found no further evidence over the next few weeks of excavation, they remained unyieldingly loyal in covering for General Jusik's absence while the Jedi Knight secretly sneaked away to aid Skirata. Five hundred and forty-eight days into the Clone Wars, the commandos of Delta Squad were called back to Special Operations Brigade on Coruscant, where they were met by Kal Skirata. There, Skirata gave Sev a package containing Ko Sai's severed head; the rogue Kaminoan had taken her own life while being held on Mandalore, and was cut into pieces post-mortem. Sev then delivered Ko Sai's head to General Zey for confirmation of death, neglecting the details of how it had come into Delta's possession while still telling Zey as much of the truth as he knew using tightly wound word games."}, {"tag": "h3", "text": "Continued fighting"}, {"tag": "p", "text": "Seven hundred and thirty-six days after the Battle of Geonosis—on the second anniversary of the start of the Clone Wars—Delta Squad was stationed at Arca Company Barracks on Coruscant awaiting assignment. There, while Sev partook of some spiced warra nuts, Scorch discreetly spied on a meeting of Cuy'val Dar sergeants Kal Skirata and Walon Vau on the barracks parade ground. Though Sev was initially uninterested—preferring to instead discuss Ko Sai and the possible accelerated aging cure Skirata was after for the clones—he soon joined Scorch and found the two Mandalorians were engaged in reciting the names of fallen clone commandos in the Mandalorian custom for honoring dead comrades and loved ones. Both Sev and Scorch joined the two sergeants in the commemoration ritual, along with a number of other commandos who joined in as the list of names went on. When they reached the list's end, Skirata took the time to say a few encouraging words to the assembled soldiers, and wished them all to stay safe so that they might be able to see his young grandson grow up. As the crowd dispersed, Sev turned his attention toward calibrating his helmet's HUD, although Scorch kept an eye on his former training sergeant long enough to see Vau and Skirata meeting with fellow former Mandalorian Cuy'val Dar trainers Mij Gilamar and Wad'e Tay'haai for reasons unknown to the two commandos."}, {"tag": "p", "text": "Several months later, approximately nine hundred and seventy days into the war, Delta Squad found themselves on the Separatist-aligned Mid Rim planet of Haurgab. Originally, while Jedi General Mlaske and the Grand Army's 85th Infantry Brigade were already operating on Haurgab, the only Republic commando presence on the dusty backwater world had been Omega Squad, sent to assassinate a key leader of the pro-Separatist Maujasi. However, as time passed, the Republic began to assign more and more Grand Army forces to Haurgab, and Delta Squad, much to their displeasure, soon became among them. Sev and the other three members of Delta Squad joined a number of other clone troops in the mess hall of the Republic's base on the outskirts of the Haurgab city of Hadde, during a field visit from Commando Group Zero Five commander, General Etain Tur-Mukan. While Delta was sitting down at a table with their food, the base was struck by a missile from within the city limits; though numerous troopers were killed and wounded in the attack both from the blast and the resultant shrapnel, Delta Squad had been spared the worst injuries thanks to their hardy Katarn armor—without his helmet on, Sev incurred a bloodied face from flying debris. Their Omega Squad compatriots survived without injury as well, and together the two commando squads led the counterattack on the rebel forces, along with them General Tur-Mukan and elements of the 85th and 14th Infantry Brigades. When they arrived at the house from which the missile had originated, Omega and Scorch breached the door and assaulted the home, killing three rebels and capturing four others while Sev, Boss, and Fixer stood outside as security."}, {"tag": "h3", "text": "Kashyyyk"}, {"tag": "p", "text": "Around one thousand and seventy days after the Battle of Geonosis, Delta Squad was sent to the Wookiee homeworld of Kashyyyk in the Mytaranor sector. Following a Separatist-backed invasion by Trandoshan slavers, the Wookiee chieftain Tarfful had been taken prisoner. Tarfful had spent years combating Trandoshan slaving parties, and without him the Wookiees turned to the Republic for assistance. In response, Delta Squad was deployed to Kashyyyk in order to extract Tarfful from captivity. Sev and the rest of Delta Squad covertly inserted into Kashyyyk via LAAT/i gunship, rappelling down to the planet's surface from the troop bay. Battling their way through the Trandoshan slaver camp, Delta freed a number of other Wookiee captives before rescuing Tarfful from the clutches of General Grievous himself. Defeating two of the general's IG-100 MagnaGuards, Delta Squad's assault prompted Grievous to flee Kashyyyk aboard his personal starfighter."}, {"tag": "p", "text": "Sev and Delta Squad destroyed another Trandoshan encampment not long after, before moving on the bridge near the Wookiee village of Kachirho. By this point, Delta had been joined by Jedi General Etain Tur-Mukan on order of General Arligan Zey of Special Operations Brigade. She informed the squad of the bridge's significance—were the bridge to be destroyed, the Separatist supply lines would be cut off, while the Wookiees would be able to construct smaller bridges to circumvent the loss, an option the Confederacy's battle droids didn't have—and tasked the squad with taking it out. After battling another advanced spider droid and countless battle droids atop the Kachirho Bridge—Sev making a point to stop and pick off as many Geonosians as he could, all the while—Delta Squad placed a detonation pack at the center of the bridge, where it was weakest. However, when Boss attempted to detonate the charge, the explosives misfired. Undeterred, Scorch borrowed a rocket launcher from a female Wookiee, and used it to destroy the bridge."}, {"tag": "p", "text": "Thirteen days later, Delta continued operations on Kashyyyk, even as Coruscant came under attack by General Grievous. While preparing to ambush a Separatist droid patrol, Sev and Scorch listened in to the comlink traffic from Coruscant, learning that only commandos in the Inner Rim had received the Code Five signal to return to Coruscant immediately. When General Tur-Mukan expressed her concern for her loved ones residing on the Republic's besieged capital, Delta Squad took it upon themselves to comfort her, and when she revealed that she had a son, they promised to keep her secret. She also inquired whether the squad thought the droids they were fighting were sentient, to which Sev replied that he did, but he killed them because they were trying to kill him. Though the battle-droid patrol fell victim to Wookiee-make pitfalls, Sev and Tur-Mukan led Delta's ambush of a small group of Trandoshans scouting through the Wroshyr trees, disposing of their dead bodies via a carnivorous plant."}, {"tag": "p", "text": "Five days later, with the crisis on Coruscant over, Delta Squad was joined on Kashyyyk by the clone forces of Jedi General Quinlan Vos, arriving from Boz Pity. In addition, General Yoda was inbound with the 41st Elite Legion and Wookiee Chieftain Tarfful, set to land within thirty standard minutes. However, a Recusant-class light destroyer had taken up position to engage Yoda's cruiser and halt the debarking of additional ground troops. With a bit of good-natured coaxing from General Tur-Mukan, Delta Squad infiltrated a Separatist turbolaser battery complex with the intent to commandeer the contained firepower to take out the Recusant-class destroyer. With Clone Commander Gree considering alternative landing sites—each too far removed from the main offensive to be effective—Delta Squad captured one Wookiee dual missile turret for each commando, and opened fire on the Commerce Guild destroyer, joined in the attack by a wing of General Vos' LAAT/i gunships. After sustaining heavy damage, the Recusant destroyer began to fall, but while the majority of Delta Squad planned for a hasty exit, Sev radioed in with a report of coming under attack from multiple hostiles. When Boss ordered the squad to go back for Sev, Vos' Forward Air Controller instead ordered Delta to leave, stating that the order had come directly from General Yoda himself. Though Scorch argued to the point of tears, Boss forced him to comply and moved the remaining three members of Delta Squad onto the gunship that had arrived to extract them, but not without first making a guilty apology to Sev."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "In the wake of Sev's abandoning in the battery complex, he was listed as missing in action. The remaining three members of Delta Squad were wracked with guilt over being forced to leave him behind, and once they joined the new Imperial Army following the transformation of the Republic into the Galactic Empire, the squad was given a replacement member whom Scorch insisted on viewing as only a temporary replacement. The clone commandos of Yayax Squad were disgusted by Delta's abandonment of Sev, while Omega Squad's members considered volunteering to search for their missing comrade. General Tur-Mukan was angered that Sev had been left behind, when previously in the war ARC troopers had been sent to extract Jedi officers from danger. When news reached Walon Vau, Sev's former training sergeant took it upon himself to journey to Kashyyyk in an attempt to locate the missing commando, but was unsuccessful in his search."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sev was a master sniper and a fierce fighter who enjoyed the thrill of combat. He decorated his armor with blood-red markings; some had trouble distinguishing whether it was paint he had used, or real blood. Sev possessed a grim sense of humor and a powerful drive to succeed, believing that any failure of his would be letting down his training sergeant, Walon Vau, and disappointing him. Though he deeply respected and revered Vau, Sev also felt a sense of jealously toward the commandos who had been trained by Kal Skirata, who treated his trainees as though they were his sons. Sev masked these inner insecurities beneath an outward personality of aggressive strength that led the rest of Delta Squad to tease that Sev was a bit of a psychopath, even joking that his cloning tank had been spiked during gestation—Vau even suggested the Kaminoans recheck his DNA for mental aberrations."}, {"tag": "p", "text": "Sev maintained a close relationship with his squadmate Scorch, trading jokes and quips with him almost constantly. He also had a close friendship with Boss, having great respect for him as a squad leader and someone he could trust. Sev found the Wookiees' tendency to blend their technology with the surrounding nature to be strange, though his time on Kashyyyk near the end of the war gave him an interest in acquiring a Wookiee bandoleer. He enjoyed warra nuts, though the spiced kind gave him gas if he ate too many—a fact Scorch would tease him about. Sev also intensely hated Geonosians, and kept a count of Geonosian kills as a means of avenging the large number of clone commando deaths in the Battle of Geonosis: he intended to kill specifically 4,982 Geonosians, one for every fallen commando. However, he harbored an even stronger hatred for the Trandoshans, due to their raid on the Prosecutor and killing of his fellow clones as well their attempt to interrogate him and the rest of the squad."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "RC-1207—Sev—made his first appearance in the 2005 video game Star Wars: Republic Commando, where he was voiced by actor Jonathan Cook. Sev went on to feature in the Republic Commando series of novels, appearing in Republic Commando: Triple Zero, True Colors and Order 66, all written by author Karen Traviss. Traviss also gave Sev a number of brief mentions in the series' fifth novel, Imperial Commando: 501st. Though she indicated a desire to further his story—a desire shared by a number of fans—Sev originated in a LucasArts game and thus was withheld so that should there ever be another game featuring Delta Squad, the company would not be bound by a story Traviss had written. Brett Douville, engineering lead for the Republic Commando game, has also indicated that a sequel was planned involving Sev, and that he would be intricately involved in starting the Rebellion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}