{"url": "RH-series_research_droid", "categories": ["Category:Canon articles", "Category:Cybot Galactica products", "Category:Science droid models"], "nodes": [{"tag": "h1", "text": "RH-series research droid"}, {"tag": "p", "text": "The RH-series research droid was a model of science droid. Manufactured by Cybot Galactica, the droid was designed as a research assistant and mobile database. The RH-series proved to be unpopular, thus resulting in only a few thousand such droids being produced. The Alliance R&D division of the Rebel Alliance used many RH-series research droids during the Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A series of science droid, the RH-series research droid was designed to aid field scientists on research missions. The droid could act as a research assistant, possessing a built-in science database. The RH-series was a variant of the 2R-series medical droid."}, {"tag": "p", "text": "Possessing a humanoid chassis covered in protective plasteel plates, the RH-series stood just under two meters tall. Their hands contained a number of manipulators, probes, lights, tools, and other devices with which the droids could carry out their scientific and research functions. The head of the RH-series droid was flat and oval-shaped, with a singular curving sensor window that resembled the visor of a helmet."}, {"tag": "p", "text": "The RH-series was relatively agile and surefooted, subsequently requiring little maintenance for its continued operation. Detail oriented and often work-obsessed while working in the field, the droids gained a reputation for both mechanical and personal reliability. If the RH-series went for a time without a memory wipe, the droids could become fussy and develop compulsive behaviors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Produced by Cybot Galactica, the RH-series research droid proved to be unpopular in the scientific community, resulting in only a few thousand units being manufactured. Despite this, by the time of the Galactic Civil War, a majority of the droids were still active, and could be purchased for 11,000 credits."}, {"tag": "p", "text": "RH-series droids were often found in remote laboratories undertaking or assisting in experiments that were too dangerous for organic beings. They could also be found leading field research in anthropological, archaeological, or biology. Many RH-series droids were utilized by Rebel Alliance, both in Alliance R&D and working alongside the freelance scientists and scholars that the rebels employed to discover planets and make contact with foreign species."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The RH-series research droid was created for Fully Operational, a 2018 sourcebook for Fantasy Flight Games' Star Wars: Age of Rebellion roleplaying game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}