{"url": "RK-242", "categories": ["Category:Canon articles", "Category:Humans", "Category:Males", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "RK-242"}, {"tag": "p", "text": "RK-242 was an Imperial stormtrooper who was stationed on Jakku shortly before the Battle of Jakku. He was among the Imperial forces that had relocated to the barren desert world under the orders of Counselor to the Empire Gallius Rax. The harsh conditions affected RK-242 and he voiced the opinion that he did not want to be on Jakku anymore. As punishment, he was beaten up by Sergeant Rylon and his fellow stormtroopers."}, {"tag": "p", "text": "The altercation was intercepted on radio by Grand Admiral Rae Sloane and the former rebel operative Brentin Lore Wexley. The two found a battered and brutalized RK-242 and comforted him. Sloane reassured him that she had come to restore order and told him not to tell anyone of their meeting. While he was putting on his helmet, Sloane shot him dead to conceal their presence. When Brentin objected, Sloane countered that they could not help him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "RK-242 was a stormtrooper who lived during the Age of the Empire. Following the Attack on Chandrila, RK-242 and his unit were part of Gallius Rax's Imperial forces which relocated to the planet Jakku. Rax claimed that the desert planet's harsh conditions would sharpen the Imperial forces into a fiercer and more cruel fighting force. In truth, Rax had brought the Imperial forces to Jakku in order to destroy them along with the planet as part of the late Emperor's Contingency plan. The Emperor had no intention of letting his Empire survive following his death and had tasked Rax with executing the Contingency."}, {"tag": "p", "text": "As the months wore on, RK-242 came to question why he and his comrades were on Jakku. He voiced these concerns to his commanding officer Sergeant Rylon and asked if there was any work anywhere in the galaxy that he could be doing. For questioning Rax's orders, RK-242 was dragged out into the desert, stripped of his armor, and beaten up by Rylon and his fellow comrades. RK-242 survived the beating but was brutalized and left in a fetal position. RK-242's conversation and the beating were intercepted by the former Grand Admiral Rae Sloane and the rebel operative Brentin Lore Wexley, who had built a crude listening device."}, {"tag": "p", "text": "Several days later, Sloane decided to visit RK-242 to find out about Rax's activities. RK-242 was grateful to meet Sloane and listened as she explained that Rax had committed a coup and stolen the Empire from her. RK-242 accepted Sloane's explanation that Rax was going to destroy them. While RK-242 knew nothing about the Valley of the Eremite and the Plaintive Hand plateau, he told her that Rax regarded Jakku as a \"place of purification\"for the Empire. Rax also agreed with Sloane's view that Rax needed to be overthrown before he could do any more damage. RK-242 also mentioned that Rax had built a new Imperial base beyond the Goazon Badlands."}, {"tag": "p", "text": "When Sloane questioned him again about the Plaintive Hand, RK-242 told her that he had hear rumors of an old weapons facility hidden beneath the sands. After the trooper had told her everything he knew, Sloane thanked him and told RK-242 to put on his stormtrooper armor and not to speak of their meeting with anyone else. While RK-242 turned to pick up his helmet, she shot him in the back of the head. When Sloane's companion Brentin said that they could have helped him, Sloane responded that he could not be helped. She had already decided that she would be unable to save her Empire from Rax's machinations."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "RK-242 was a loyal stormtrooper whose loyalty was tested by Counselor Gallius Rax's decision to relocate the Empire to Jakku. For questioning Rax's orders, he was brutally beaten up by his fellow stormtroopers. RK-242 was traumatized by the incident and his spirit was broken. RK-242 had a deep sense of respect for Rae Sloane and came to accept her explanation that Rax posed a threat to the survival of the Galactic Empire. While Sloane took pity on him, she believed that he was beyond help and killed him in order to put him out of his misery. Brentin disagreed and believed that they could have helped him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "RK-242 first appeared as a minor character in Chuck Wendig's Aftermath: Empire's End, the third installment of Star Wars: The Aftermath Trilogy which was released on February 21, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}