{"url": "RIC-1200", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Droid models"], "nodes": [{"tag": "h1", "text": "RIC-1200"}, {"tag": "p", "text": "The RIC-1200, also known as the tour guide droid, was a model of RIC-series general labor droid designed to give guided tours. Tour guide droids were covered in plating colored in several different shades of gray, had two arms that each ended in a hand with three clawed digits, and moved around on two wheels located at the base of their bodies. Their heads featured a screen that could switch between several facial expressions. Tour guide droids shared their body type with the RIC-series general labor droid. During the Shadow Collective's takeover of the planet Mandalore, a tour guide droid was welcoming a group of Shadow Collective soldier to Peace Park, located in the New Mandalorians' capital city of Sundari, when one of them blasted him in the face, destroying the hapless droid."}, {"tag": "p", "text": "In 2 BBY, the former Sith Lord Maul made use of several reprogrammed tour guide droids after capturing the crew of the starship Ghost and taking both them and their ship to an old Mandalorian supply outpost. These droids were armed with E-5C blaster rifles and watched over the imprisoned crewmembers for Maul, who held the crew hostage in order to reclaim a Sith holocron from the Jedi Kanan Jarrus and Ezra Bridger. As Maul awaited the Jedi's arrival, the captives attacked their droid guards, stealing their blasters to use against Maul, however they were quickly defeated and placed under guard again."}, {"tag": "p", "text": "After arriving at the outpost, Bridger and Jarrus met with Maul, who was flanked by two of the reprogrammed tour guide droids. Maul ordered the droids to escort Bridger to the outpost's command center, while he had Jarrus sucked out into space through one of the outpost's airlocks. Though Jarrus was caught by surprise, he quickly managed to make it back inside the outpost. At the command center, Maul ordered one of the droids to kill the prisoners, however just before the droids could carry out the order, Jarrus rushed in and destroyed them with his lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This model of droid first appeared in \"Shades of Reason,\" the fifteenth episode of the canon animated series Star Wars: The Clone Wars' fifth season. The tour guide who appeared in this episode was voiced by Dave Filoni, the supervising director of Star Wars: The Clone Wars. Although the model's name was never spoken in the episode itself, it was given the name tour guide droid in the credits."}, {"tag": "p", "text": "The tour guide droid was designed by concept artist Chris Glenn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}