{"url": "RQ_protocol_droid", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Imperial droids", "Category:Protocol droid models", "Category:RQ protocol droids"], "nodes": [{"tag": "h1", "text": "RQ protocol droid"}, {"tag": "p", "text": "The RQ protocol droid, also known as an RQ unit or Lothal protocol droid, was a model of protocol droid manufactured by Lothal Logistics Limited."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Also known as an RQ unit or Lothal protocol droid, the RQ protocol droid was manufactured by Lothal Logistics Limited, a technology firm based on the planet Lothal. Standing 1.85 meters tall and weighing 75 kilograms, they were equipped with TranLang II communications modules and had many of the same features and functions of expensive protocol droids found in areas of the galaxy. They often lacked the expensive metallic plating on other protocol droids, which meant they did not require costly cosmetic upgrades, making them ideal for use in governments, military, and private ownership. An RQ unit's plating was colored in various combinations of black, blue, brown, gold, gray, green, orange, and silver, while their photoreceptors could be colored blue, orange, white, or yellow."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Built and programmed locally for service in government and private business offices, RQ protocol droids were common in the star systems surrounding Lothal. Lothal Port Authority used one of them as a controller droid, overseeing Capital City spaceport from a control station. The Jablogian crime lord Azmorigan owned an RQ unit, which he used as a servant aboard his C-ROC Gozanti-class light cruiser, the Merchant One. Four force pike-wielding RQ units finished with the symbols and blue coloring associated with the Imperial Senate were part of Senator-in-exile Gall Trayvis' personal guard. The smuggler Lando Calrissian transferred the logic unit of his personal attendant droid W1-LE in the body of an RQ unit. The E-XD-series infiltrator droid outwardly resembled this model while in protocol droid mode."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The RQ protocol droid was based on early concept art of C-3PO by Ralph McQuarrie."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}