{"url": "Rab%C3%A9/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Galactic Republic individuals", "Category:Humans", "Category:Naboo Royal Handmaidens"], "nodes": [{"tag": "h1", "text": "Rabé"}, {"tag": "p", "text": "Rabé was a female Human who served as one of Queen Padmé Amidala's handmaidens during the last years of the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Training"}, {"tag": "p", "text": "Rabé was born on Naboo, and at some point from Quarsh Panaka. Alongside Sabé, Eirtaé, Saché and Yané, Rabé learned how to train in self-defense and marksmanship. Their rigorous training was supervised by Amidala's head of security, Captain Panaka. Rabé excelled with weapons and could also use more subtle forms of persuasion."}, {"tag": "p", "text": "Rabé's primary duty as a handmaiden, other than bodyguard, was to prepare Queen Amidala's elaborate hairstyles. She also had a lot of patience and was often assigned to soothe Amidala's nerves. Rabé was bilingual and was able to speak Sullustese."}, {"tag": "p", "text": "At some point, a new maid called Padmé joined them and accompanied them during training. Only later did it turn out that she was the newly elected queen. On that day, Yané ventured first across the training ground, followed by Eirtaé."}, {"tag": "p", "text": "Both maids mastered the stations exemplary. Rabé himself was third in the series. Although she was able to hit the training droid with her blaster, he persistently refused to shut it down. Instead, he kept responding to the fire on Rabéâ € \"even if it were just stun shots, too many hits would sooner or later kill her. Even the shots of Sabé and Padmé could not handle the droid, so Rabé had to flee from him. She reached a waterfall and hoped to hide there while Yané hurried to the droid rescue service. In the end, Sabé and Padmé, in a daredevil joint action, succeeded in putting the droid out of action and thus saving Rabé. She sprained her ankle, but Padmé looked after her caringly."}, {"tag": "p", "text": "Subsequently, Panaka confessed to them that Padmé was not a maid, but her queen. This event, and the salvation of Padmé, who was to serve her for years to come, shaped Rabé, strengthening her loyalty to the Queen, as well as her friendship with Sabé and the other maids."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "h4", "text": "Escaping Naboo"}, {"tag": "p", "text": "In the year 32 BBY, half a year later, Rabé's home was circled by Trade Federation warships and blocked any import and export. A little later, the invasion of Naboo began as a result of failed negotiations during which the maids and their queen were arrested. Sabé, in her role as Amidala's personal bodyguard and decoy, had refused to sign a contract mentioned by Nute Gunray to legalize the blockade."}, {"tag": "p", "text": "In order to force the Queen to sign, he sent her, along with her little entourage, including Rabé, to a prisoner camp, where they were guarded and escorted by B1 combat droids. However, Rabé and the others were soon rescued on the way there by two Jedi Qui-Gon Jinn and Obi-Wan Kenobi, along a gungan named Jar Jar Binks. Then they fled into the hangar and arrived at the royal ship, with which they managed to escape to Coruscant."}, {"tag": "h4", "text": "Tatooine"}, {"tag": "p", "text": "Since the spaceship was damaged during the spectacular escape and only by the use of R2-D2 was able to fly, an emergency landing on the desert world of Tatooine. Padmé, still in the form of a maid, accompanied Qui-Gon to Mos Espa, while Rabé remained on the side of Eirtaé and the queen with Obi-Wan and pilot Ric Olié. When they received a rescue call from Sio Bibble in the form of a hologram, they were unable to act, as none of them, not even Sabé, could decide without the queen."}, {"tag": "h4", "text": "Coruscant"}, {"tag": "p", "text": "The stay lasted a few days, but eventually they traveled on to Coruscant, their real destination. They now had another companion, the boy Anakin Skywalker, who would join the Jedi Order. Attending the Senate Building, Rabé and Eirtaé were present at the time when Queen Amidala addressed the Senate of the Trade Federation's involvement."}, {"tag": "h4", "text": "Battle of Naboo"}, {"tag": "p", "text": "Amidala did not want to be satisfied with the circumstances and set off home, where Rabé continued to accompany her. To convince the Gungans to cooperate, it was again Sabé, who acted as Queen, Rabé stood during the negotiations directly behind her and Padmé. The real queen made herself known and so Rugor Nass was convinced of her honesty. The appearance of Amidala moved him to help the people in the recapture of Theed. While the Gungans fought the droid army in the open field battle, Rabé, Sabé and Eirtaé led their mistress to infiltrate the palace. As a result of numerous battles inside this building, they were able to win the day."}, {"tag": "h4", "text": "Aftermath"}, {"tag": "p", "text": "Rabé was also present during the funeral of Qui-Gon Jinn killed in the course of the fighting by Darth Maul and attended the subsequent parade."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rabé was portrayed by Brazilian actress Cristina da Silva in Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}