{"url": "Raada_resistance", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Stub", "Category:Rebel cells"], "nodes": [{"tag": "h1", "text": "Raada resistance"}, {"tag": "p", "text": "In 18 BBY a resistance group was formed on the Outer Rim moon Raada by the former Jedi Padawan Ahsoka Tano. The group fought in an uprising against the recent Imperial occupation of the moon, however was forced to escape with the aid of Bail Organa's Forces, however the Imperial crops on the planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Just over one year after the fall of the Jedi Order and rise of the Galactic Empire, Imperial official Jenneth Pilar made the decision to exploit Raada as a source of crops for the Imperial Military due to its small population and placement far from systems he viewed as important, seeing the moon as an expendable resource. The official planned to exploit the planet's farming communities to grow a crop which was the primary ingredient in an Imperial nutritional supplement, which would also happen to leech the nutrients from the soil making it impossible for any crops to grow for many seasons following the harvest."}, {"tag": "p", "text": "Soon after the unexpected Imperial occupation of the moon, Ahsoka Tano (then disguised under the alias \"Ashla\") who worked as the mechanic of the primary settlement, met with her friends Kaeden, Miara, Hoban, Neera, and Vartan, discussing their distaste for the new occupation over a game of crokin discussing ways they could remove the Imperial occupants from their home. Upon arrival, an Imperial notice was posted in Selda's Cantina including strict rules such as forbidding activities such as large meetings, night curfews for residents, and restrictions on things such as food, alcohol, and the cantina's opening hours. Ahsoka then advised the group of local farmers to begin stockpiling rations."}, {"tag": "p", "text": "The following evening, Ahsoka and her friends continued their discussion of the situation, hoping to find a way to free their world from Imperial occupation. Hoban suggested the use of explosives to scare off the Empire, which Ahsoka countered explaining it would only encourage Imperial reinforcements to the moon. Tano learned from the farmers that the Empire was adding two hours to the workers' shifts and importing a mass of seeds, to which the group deduced they would use to produce crops at the expense of the local labour forces. Later that evening, a local farmer named Tibbola came into a drunken dispute with an Imperial officer who then had the man executed by an accompanying stormtrooper, shocking the residents within the cantina."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}