{"url": "RX-24/Legends", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Masculine programming", "Category:RX-Series pilot droids", "Category:Star Tours personnel"], "nodes": [{"tag": "h1", "text": "RX-24"}, {"tag": "p", "text": "RX-24, nicknamed Rex, was an RX-Series pilot droid manufactured by Reubens Robotic Systems. The masculine-programmed droid was purchased by the Star Tours travel agency at some point after the rise of the Galactic Empire, and prior to 1 BBY, but he was defective as of 1 BBY and saw no service until after the company upgraded its fleet of StarSpeeder 1000 spacecraft to the newer StarSpeeder 3000 sometime around the Battle of Endor in 4 ABY. By that time, RX-24 had been repaired, and the company placed him into service. His initial duty to Star Tours constituted multiple firsts: Rex's first flight as a pilot, the first official Star Tours use of the StarSpeeder 3000 shuttle, and the first outing of the Endor Express with non-stop service to the Forest Moon of Endor. With the astromech droid R2-D2 as his copilot, Rex took off on Star Tours Flight 45. He never reached Endor. Instead, Rex nearly crashed the shuttle leaving the spaceport, emerged from hyperspace too late and overshot the Forest Moon, stumbled into a comet field, wandered into a battle between New Republic and Imperial forces, and joined an attack run on an Imperial battlestation. The pilot droid then returned to the spaceport from which the flight originated."}, {"tag": "p", "text": "Rex's programming and appearance were standard for the RX series. He had a segmented body with wider sections of burnished metal trimmed in gold and purple, and narrower sections in black. He had three arms with clawed hands, blue photoreceptors that glowed with a white light, a retractable purple visor, and a repulsorlift generator at his base to facilitate movement. Rex was friendly with organic beings, and he affected a brave demeanor even during his disastrous flight to Endor. He was in a romantic relationship with a fellow droid, ROX-N."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "RX-24 was an RX-Series pilot droid manufactured by Reubens Robotic Systems. The droid was one of several purchased by the galactic travel agency known as Star Tours circa 1 BBY. RX-24 was shipped to the agency defective; once removed from his shipping crate, the droid was almost completely non-functional, muttering random phrases in Basic, speeding up and slowing down his speech at irregular intervals, and sparking at the neck. With a decal reading, \"DEFECTIVE\" and \"RETURN TO FACTORY\" on his base, he sat outside his crate up to the time of Star Tours Flight 1401, which took place at some point between 2 and 0 BBY. Nevertheless, Star Tours decided to keep RX-24 at the company and had its in-house repair droids restore him to working order."}, {"tag": "p", "text": "By 4.3 ABY, shortly after the Battle of Endor, RX-24 had been brought online as a fully functional pilot droid. He also struck up a romantic relationship with another Star Tours droid, ROX-N. Star Tours had upgraded its fleet of StarSpeeder 1000 passenger starships to the newer StarSpeeder 3000 model. Seeking to cash in on the moon of Endor's sudden fame after the defeat of Galactic Emperor Palpatine by the Alliance to Restore the Republic there, Star Tours assigned RX-24, now nicknamed \"Rex,\" to captain the StarSpeeder 3000 on its maiden voyage, taking it to the forest moon with a full complement of passengers as part of the newly implemented Endor Express service. Rex was to follow the Sanctuary Pipeline, a hyperlane that had been created by the Galactic Empire to bring supplies to the Endor system during the construction of the Death Star II battlestation. Without the Empire to maintain the hyperroute, however, the Pipeline began to decay soon after the battle had ended. Nevertheless, Star Tours gave the go-ahead for Rex to pilot Star Tours Flight 45 (ST-45). Only the protocol droid C-3PO, temporarily working for the travel agency, saw the folly of the plan, noting that Rex still had his \"Remove Before Flight\" factory tag on him."}, {"tag": "p", "text": "Rex took his post in front of the StarSpeeder's cockpit shield. Promising a smooth ride, the droid lowered the shield and greeted his passengers as his navigator, R2-D2, was loaded into the craft's astromech slot. With approval from control, Rex lurched the starship into motion but then took a wrong turn while still inside the Star Tours spaceport. Unable to find the StarSpeeder 3000's brakes, he nearly collided with a wall before wrenching the craft up and over the obstruction and into space. Despite this inauspicious beginning, RX-24 then ordered R2-D2 to launch the craft into hyperspace."}, {"tag": "p", "text": "The pilot's next mistake was to come out of lightspeed too late, passing Endor completely and inadvertently moving the StarSpeeder into a field of icy comets instead. He deftly piloted the craft through the comet field only to emerge within a restricted combat zone, where several New Republic X-wing starfighters were in the midst of a battle with an Imperial Star Destroyer and its complement of TIE/LN starfighters. Rex found his passenger craft caught in the Star Destroyer's tractor beam, but a tip from one of the New Republic pilots to ease up on his main thruster allowed the droid to escape capture. The voyage nearly came to an end when an Imperial fighter shot the ship and caused it to lose altitude, but R2-D2 repaired the damaged stabilizer on the Captain's orders. Rex then moved the starship to join the New Republic's Red Squadron in an attack run against a massive Imperial battlestation. After following two X-wings through a giant trench and helping them shoot down enemy TIE fighters, Rex and his passengers saw that the attack was a success. Rex then ordered R2-D2 to take the craft to lightspeed; they returned to the spaceport from which Flight ST-45 had originated, scathed but intact."}, {"tag": "p", "text": "RX-24's flight proved something of a harbinger for the future of the Star Tours travel agency. Within months of the Battle of Endor, accidents and poor management drove the company to go out of business."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "RX-24 was a standard RX-Series model, making him a second-degree droid, that is, one of a category of droids who aided in spaceflight and vehicle or starship maintenance. He possessed standard equipment for his model, including three clawed arms with which to manipulate starship controls, a heuristic processor to facilitate learning and creativity, two photoreceptors with which to see, a repulsorlift platform at his base for locomotion, and a vocabulator with which to speak. The droid was programmed with a masculine personality, and he was able to speak and understand Basic and Binary. Rex's photoreceptors were blue unless illuminated, which made them shine with a white light. The wider sections of his chassis were burnished metal trimmed with gold and purple; between these were narrower sections in black. Rex's clawed fingers, upper anterior facial plating, and vocabulator were also gold. The droid pilot had a retractable purple visor that he could lower over his photoreceptors."}, {"tag": "p", "text": "Upon his arrival at the Star Tours travel agency, RX-24 suffered from severe factory defects, sputtering random phrases and shorting out frequently. Once restored to normal working order, Rex enjoyed the same programming as other RX units. He was skilled at starship piloting, ship maintenance, and computer use. His photoreceptors had great acuity to allow him to efficiently locate obstacles in spaceflight, and his dexterity enabled him to fly through dangerous situations. Nevertheless, Rex had yet to become accustomed to actual spaceflight on his first mission; indeed, he exhibited some confusion and insecurity on the flight, nearly crashing the StarSpeeder 3000 and narrowly escaping several other hazards. Ultimately, his reflexes and daring allowed him to return to the Star Tours dock intact."}, {"tag": "p", "text": "Similarly, the fully functional Rex exhibited his model's ease of interaction with organic beings. He was friendly and upbeat even in dire situations. When his first flight went awry, he tried to keep a professional veneer of calm, claiming that some of his mistakes had been intentional. Still, his anxieties manifested at particularly harrowing moments in screams and cries of exasperation. Despite his claims that he wanted to keep his passengers safe, RX-24 showed a daredevil streak on his maiden voyage; for instance, when he stumbled upon an Imperial battlestation, he chose to join a New Republic attack on it rather than retreat to safety. The pilot droid interacted smoothly with other mechanicals, such as his first navigator, R2-D2, as well as RX-24's romantic interest, ROX-N."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Conception"}, {"tag": "p", "text": "When Lucasfilm Ltd. and the Walt Disney Company teamed up to create an attraction for the Disneyland theme park in Anaheim, California, the two sides chose to use flight simulator technology to allow the park guests to feel like they were traveling into space on a passenger liner. Creating the film to be projected to audience members proved a challenge, since all the drama had to come from either the visuals created by Industrial Light & Magic or from dialogue; the ride, therefore, needed a compelling and sympathetic narrator."}, {"tag": "p", "text": "George Lucas proposed a droid pilot for the role to help connect audience members to the greater experience the ride was intended to mimic. Lucas's original idea for the robot was to call him \"Crazy Harry\" and make him a sarcastic, wisecracking veteran of the Clone Wars, an idea based on the skippers of the Jungle Cruise attraction in the park's Adventureland area in the 1980s. However, the ride's director, Tony Baxter, suggested the pilot be more of a jittery beginner and that the ride's harrowing narrative arise from the pilot's beginner's blunder; such a character would be more sympathetic, Baxter suggested. The team ran with the idea, also making the robot a stand-in for the audience members. For instance, the team felt that the pilot's insistence on participating in an attack run on a Death Star—along with his exclamation, \"I've always wanted to do this!\"—would mirror the feelings of anyone who had seen Luke Skywalker's trench run in Star Wars: Episode IV A New Hope."}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "The team then had to find a voice actor to perform the droid's lines. The idea that Rex had lost control of the StarSpeeder suggested the character would need to scream frequently on the audio track. Tom Fitzgerald, lead writer and producer on the project, and Mark Eades, media producer for the ride, have both claimed credit for eventually casting comedian Paul Reubens for the role. Fitzgerald says that he thought Reubens might fit the bill after seeing the comedian's television special as the character Pee-wee Herman, a role that required Reubens to scream frequently and humorously. Fitzgerald felt the actor would fit the idea of a slightly comical, inexperienced pilot well. Eades's version of the story says that in seeking a voice actor who could portray a \"slightly cracked' character, they auditioned over two dozen talents, including Billy Barty and Frank Welker. When Eades heard Reubens as the voice of a robot spaceship in the Disney film Flight of the Navigator, he thought the comedian would suit the part. Reubens soon signed on to the project."}, {"tag": "p", "text": "Lucas provided basic ideas for Rex's physical appearance. Based on these, Imagineer Chris Runco sculpted a prototype Rex puppet from green foam. Two other ride designers, Larry Sheldon and Lance Updyke, used this template to create the Rex puppets from aluminum. With four separate StarSpeeder 3000s that audience members might board in the attraction after its opening in 1987, four separate animatronic Rex puppets were also needed. The character first appeared in a 1986 TV promotion that aired on ABC's Sunday Night Movie feature, shortly before the ride officially opened at the start of the next year."}, {"tag": "h3", "text": "Further developments"}, {"tag": "p", "text": "The Star Tours ride spread to other Disney parks, which required more Rex puppets to be created. With the opening of Star Tours at Disneyland Paris, the designers added a new robot to the queue area of the attraction, ROX-N, whom they designed as Rex's girlfriend. Expansion to new parks meant finding new voice talents for non-English versions of the ride; for Disneyland Paris, the company cast voice actor Luq Hamet to portray Rex."}, {"tag": "p", "text": "When Lucasfilm and Disney teamed up again to update Star Tours in 2005, designers decided to set the new version in the era between Star Wars: Episode III Revenge of the Sith and Star Wars Episode IV: A New Hope, well before the timeframe of the original ride. To preserve continuity with the original ride, wherein Rex tells guests that it is his first flight, the team decided to create a new pilot. The droid AC-38 (\"Ace\") was the result, and the new pilot exhibits similar physical and behavioral features to Rex. Nevertheless, the newer ride's plot sees the protocol droid C-3PO replace Ace by mistake. As a nod to the original ride, the designers included an RX-24 animatronic puppet in the queuing area audience members must pass through as they wait to board the attraction. There, the pilot-to-be is non-functioning and marked defective, uttering lines from the original Star Tours seemingly at random. Star Tours: The Adventures Continue opened to the public in 2011."}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "Sources disagree as to the manufacturer of the RX line of pilot droids. According to Scum and Villainy and Scavenger's Guide to Droids, sourcebooks for the Saga Edition of the Star Wars Roleplaying Game from Wizards of the Coast published in 2008 and 2009 respectively, RX-Series pilot droids were produced by Industrial Automaton (IA). However, RX-24's entry in 2008's The Complete Star Wars Encyclopedia notes that he was manufactured by Reubens Robotic Systems. This article assumes that despite the different manufacturer, as a factory-new droid, RX-24 still had all the standard features outlined in the roleplaying sourcebooks for IA's RX droids."}, {"tag": "p", "text": "The short story \"One Last Night in the Mos Eisley Cantina: The Tale of the Wolfman and the Lamproid,\" written by Judith and Garfield Reeves-Stevens and published as part of Tales from the Mos Eisley Cantina in 1995, includes a montage that sends the lovers Lak Sivrak and Dice Ibegon skipping through time. At one point, they arrive at the Battle of Endor. As Alliance General Lando Calrissian orders all fighters to attack the Death Star, Sivrak hears a droid exclaim that it \"had always wanted to do this,\" mimicking Rex's line from Star Tours. The story leaves the question of whether or not it is RX-24 unanswered, however."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}