{"url": "Race_for_the_Holocrons", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Incomplete lists", "Category:LEGO Star Wars: The Yoda Chronicles"], "nodes": [{"tag": "h1", "text": "Race for the Holocrons"}, {"tag": "p", "text": "\"Race for the Holocrons\" is the fifth episode of the LEGO short film series  The Yoda Chronicles. It aired on June 15, 2014 on Disney XD."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "Luke Skywalker, Leia, C-3PO and R2-D2 are at Utapau trying to find a ship to travel to Tatooine, but a Varactyl attacks them after it gets a rock kicked at it by Luke. It chases them down a hole, including itself as Luke jumps down to save them. As for Han Solo and Chewbacca, Darth Vader attacks the Millennium Falcon in his personal TIE fighter, thinking Luke is with them. Han and Chewie manage to destroy Vader's fighter, but he manages to sneak in and interrogate Han Solo and his Wookiee about Luke's whereabouts, but not before insulting the Falcon."}, {"tag": "p", "text": "While Luke is falling down the hole attempting to save his friends, the ghost of Obi-Wan Kenobi appears to tell him that he might have been able to find the holocrons himself, but Darth Vader is also looking for them. Obi-Wan also tells Luke that they are buried under the Dune Sea and go get them, after he gets himself out of the situation he is in. Luke manages to build a bungee out of rocks and jump to safety, also sending the Varactyl tumbling to its doom. Unfortunately, it starts climbing up the chasm wall after them. The group manages to get a starship, and C-3PO tells R2-D2 to intercept the computer port. R2 refuses because of its uncleanness, but pushes on after using sanitizer. The ship is started after the Varactyl climbs onto it, but it sends the creature back down the hole for good."}, {"tag": "p", "text": "During Vader's interrogation on Han and Chewie via Force choke, Luke contacts them about the location of the Jedi holocrons. Vader is also there, and Luke quickly tries to trick Vader into thinking that the Holocrons are actually on Naboo and not on Tatooine, but Vader isn't fooled and now knows the whereabouts of the holocrons and Skywalker. While Vader is distracted by the message, Han and Chewie manage to hide in the Millennium Falcon's escape pod. Unfortunately, Vader notices and ejects the pod to the planet below, leaving him to venture to the Dune Sea. However, a small group of Jawas manage to find the holocrons first."}, {"tag": "p", "text": "Things become a problem for Luke and his friends when a squadron of X-Wing fighters led by Wedge Antilles attack him because the ship he chose was an Imperial starship. Luke helplessly fights back to defend himself after an unsuccessful attempt to tell Wedge what the issue is. Meanwhile, Vader has the same experience with a squad of Imperial TIE Fighters, and he complains on them finally deciding to have good aim, (and unlike Luke, Vader have some fun shooting at his attackers and comments \"It's fun to win every once in a while.\")"}, {"tag": "p", "text": "Han and Chewbacca's escape pod crash-lands on Dagobah, and seek to find shelter. But a bad choice, as they enter the cave that Luke faced in Episode V, and run out screaming. They soon encounter Yoda right next to the cave, and they come to a realization. Han and Yoda greet each other again, as they have not been together since an earlier installment."}, {"tag": "p", "text": "Darth Vader reaches Tatooine first, arriving in Mos Eisley. While running toward his target, he runs into Ponda Baba and Dr. Evazan, who repeats the same threat he told to Luke in A New Hope. Vader chops off Evazan's arm with the lightsaber in frustration, which also had happened to Ponda Baba in Episode IV. Luke and company then encounter them as well, but the criminal amputees flee in panic as to not get further injured. Vader then walks into the famous cantina to ask for a vehicle, but the bartender calls him off as the metal detector went off, mistaking him for a droid. The Sith Lord destroys the detector and sends the bartender head-first into the ceiling with the Force. Realizing the consequence, he changes his mind and permits droids into the cantina, resulting in a small group of droids walking in and celebrating. Vader asks for a vehicle, which the bartender is happy to loan, (possibly to keep Vader from getting mad again)."}, {"tag": "p", "text": "Luke and his friends then arrive on Tatooine, and meet Watto to find a vehicle to travel to the Dune Sea. Luke demands a podracer, but is fresh out of money. Attempting a Jedi mind trick, Watto does not fall for it. But when Leia assists him in the mind trick, The creature finally falls into hypnosis, including C-3PO. They have the podracer loaned to them, and Threepio is left with Watto. The bartender loans Darth Vader a landspeeder, but he takes off with it after Skywalker and co. passes him, but after they both comment on their foe having their vehicle (Luke in Vader's podracer)."}, {"tag": "p", "text": "Meanwhile, Han, Chewbacca and Yoda are sitting by campfire, eating popcorn while Yoda tells them a story about Luke and the holocrons. The aged Jedi master suddenly stops after he realizes Luke might be in danger. He sends Han and Chewie back in the escape pod, set for Tatooine."}, {"tag": "p", "text": "At the Jawa Sandcrawler, Bib Fortuna is visiting check if there is anything good to purchase. Apparently, the Jawas had also put a pile of holocrons (labeled shiny cubes) up for sale. But before the Twi'lek can decide, they notice Luke and Darth Vader speeding towards them. Their endangerment sends everyone outside the crawler into a panic, and R5-D4's motivator malfunctioning again. After they arrive at the sandcrawler, the Jedi and Sith engage in a short lightsaber duel. But their fighting allows the Jawas to escape with the holocrons, with their power giving the sandcrawler super-speed. They take off for the crawler (in their proper vehicles this time) and leave Leia and R2-D2 behind. But at that moment, Han and Chewie land on Tatooine, realizing Luke had already left. They then have to get in the pod yet again, this time with the Princess and R2."}, {"tag": "p", "text": "Meanwhile, Luke and Darth Vader continue their lightsaber duel, also running through Jabba the Hutt's sail barge. Vader gets inside the sandcrawler and gets rid of the Jawas, but Luke then shows up before his foe can take the holocrons. Unfortunately, the vehicle is headed straight for the streets of Mos Eisley, and chasing C-3PO, who is no longer is hypnosis. Luke stops the sandcrawler, but Vader manages to steal every holocron and escape in his shuttle."}, {"tag": "p", "text": "Yoda and Obi-Wan's spirit are on Dagobah, discussing the consequence of Vader wielding the holocrons. Fortunately, they call for the help of veteran hero Jek-14 to assist them in their to recover the sacred artifacts."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}