{"url": "RZ-2_A-wing_interceptor", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:A-wing models", "Category:New Republic starfighter classes", "Category:Resistance starfighter classes"], "nodes": [{"tag": "h1", "text": "RZ-2 A-wing interceptor"}, {"tag": "p", "text": "The RZ-2 A-wing interceptor, also known as the RZ-2 A-wing starfighter or the Resistance A-wing, was a wedge-shaped starfighter manufactured by Kuat Systems Engineering after the success of the former RZ-1 A-wing interceptor used by the Alliance during the Galactic Civil War. The RZ-2 incorporated and standardized years of RZ-1 field modifications by the Rebellion, along with making the chassis slimmer and longer to yield even more speed. As such, piloting the ultra-fast yet temperamental starfighter was a matter of pride for various Resistance pilots regarding their skills and daring."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The RZ-2 was a single-seat starfighter manufactured by Kuat Systems Engineering. The ship featured a liquid-cooled flight computer, hyperdrive, deflector shielding, and port gyro stabilizer. The two upright stabilizers at the rear of the ship were adjustable for atmospheric flight, and were made of corrugated carbo-plas, a strong but lightweight material. The front of the ship featured a small \"slit,\" which served as a towing slot used to maneuver the craft in hangar or on the ground. Manning the cockpit was room for a single pilot, who was protected by a reinforced canopy augmented with a cockpit deflector shield generator. A cargo storage area in front of the cockpit held survival gear and medical supplies."}, {"tag": "p", "text": "For armaments, the ship featured two Zija GO-4 laser cannons attached to a swiveling cannon mount. This allowed pilots to target enemies behind them without having to worry that the finicky mounts would jam in the rear-facing position—a chronic problem that crippled many Rebel RZ-1s until they returned to base for maintenance. Two concussion missile launchers, fired through depressed exits along both sides of the ship, held enough space to house six missiles per launcher, giving the pilot a total of twelve concussion missiles to use."}, {"tag": "p", "text": "Like its RZ-1 predecessor, the RZ-2 was ideal for missions requiring speed: hit-and-run raids, surgical strikes on capital ships, and intelligence-gathering missions. The RZ-2 improved on its predecessors' capabilities, with more powerful sensors for faster data collection and upgraded jammers to impede detection. However, one of the more noticeable changes from the RZ-1 was a streamlined chassis, which not only delivered more speed but also made the starfighter's notoriously sensitive control system slightly more forgiving in flight."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The RZ-2 A-wing starfighter rose out of the stunning performance of the Rebel RZ-1 during the Galactic Civil War. With the original RZ-1 based on Kuat Systems Engineering's original R-22 Spearhead, the company resurrected its forgotten prototype to create the RZ-2. The RZ-2 incorporated and standardized years of Rebel field modifications, made the chassis slimmer for more speed, and featured generations of improvements to its many systems."}, {"tag": "p", "text": "The RZ-2 was part of the demilitarized New Republic Defense Fleet by seven years after the Battle of Yavin. Squadrons of the interceptors were deployed aboard the Tribulan Vort during the blockade of Substation Grimdock. They took casualties as they strafed the pirate warships."}, {"tag": "p", "text": "By the time the RZ-2 was used by the Resistance during their war with the First Order, it was already decades old. With the New Republic cutting A-wing production to a minimum, the Resistance acquired several fighters to be used for everything from reconnaissance patrols to bomber escort missions. As with the previous generation of Rebels, Resistance pilots took pride in proving they had the skills and daring to master the ultra-fast, yet temperamental, starfighter."}, {"tag": "p", "text": "One notable example of the RZ-2 being used was during the evacuation of D'Qar, in which they were piloted by Blue Leader Tallissan \"Tallie\" Lintra and Zizi Tlo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first footage of the RZ-2 A-wing was shown in the Star Wars: Episode VIII The Last Jedi teaser trailer on April 14, 2017. They made their canonical debut, however, in the video game Star Wars Battlefront II."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}