{"url": "RZ7-6113-23", "categories": ["Category:Legends articles", "Category:Chopani sector", "Category:Galactic Empire planets", "Category:Outer Rim Territories planetoids", "Category:Type I atmosphere planets", "Category:Volcanic planets"], "nodes": [{"tag": "h1", "text": "RZ7-6113-23"}, {"tag": "p", "text": "RZ7-6113-23 was a rocky, volcanic class-6 planetoid that was devoid of life. It was located in the Chopani sector of the Outer Rim Territories."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in a remote sector of the galaxy, RZ7-6113-23 was a small class-6 planetoid. A largely barren and volcanic planetoid that was devoid of life, RZ7-6113-23 was nevertheless the site for a large military storehouse."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the early days of the Galactic Empire, a storehouse was secretly built on the planetoid. Various outdated hardware officially known to be retired from the Imperial army, such as the Acclamator-class assault ship and the AT-AP, were rerouted from impoundment to the storehouse. By 13 ABY, the warlord Ennix Devian had established his headquarters in the storehouse, leading a splinter faction of the Galactic Empire known as the \"Restored Empire\", otherwise known as the hard-liners. Having lost faith in the direction of the Imperial Remnant under Admiral Gilad Pellaeon, Devian planned to use the storehouse's supplies to assemble an army large enough to launch an attack on the Imperial capital Orinda, establishing a new order worthy of the late Emperor Palpatine's vision. At one point, the New Republic Dauntless-class heavy cruiser Endor was destroyed by an Imperial hard-liner projectile cannon fired from the surface of the planet."}, {"tag": "p", "text": "As part of his plot, Devian had the former Imperial Royal Guard member Kir Kanos abducted and taken to RZ7-6118-23 in an attempt to recruit him. However, Kanos's conflicting code of honor led him to reject the offer, and escaped the planetoid in a stolen shuttle after a massive firefight in the Imperial storehouse; however, this was part of Devian's plan. Soon after Kanos left, a New Republic warship arrived in the system, investigating the disappearance of the Endor. Devian was forced to abandon his base, commanding a diversionary attack on the ship while the rest of his forces retreated. The storehouse was rigged to self destruct, and once a Republic ground force infiltrated it, the entire complex exploded."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planetoid RZ7-6113-23 made its first appearance in Star Wars canon in the first issue of Star Wars: Crimson Empire III—Empire Lost, the third installment of the Crimson Empire trilogy. Clone Wars-era ship designs on RZ7-6113-23 mark the debut of prequel trilogy starship designs in the Crimson Empire series, as the previous installment, Crimson Empire II: Council of Blood, released in 1998, a year before the release of Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}