{"url": "RZ-1T_trainer", "categories": ["Category:Canon articles", "Category:Wookieepedia former Comprehensive articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:A-wing models", "Category:Alliance to Restore the Republic starfighter classes", "Category:RZ-1 A-wing interceptors"], "nodes": [{"tag": "h1", "text": "RZ-1T trainer"}, {"tag": "p", "text": "The RZ-1T, also known as RZ-1T A-wing, was a model of A-wing trainer starship used by the early rebellion against the Galactic Empire and later the Rebel Alliance, to train aspiring rebel pilots. The starship, developed in the early days of the rebellion, bore many similarities to the base RZ-1, such as a wedge-shaped hull, dual laser cannons and sublight engines, and an internal hyperdrive. Due to its role as a pilot training vehicle, the RZ-1T also featured an additional seat reserved for an instructor in the back of the cockpit."}, {"tag": "p", "text": "One RZ-1T was stationed at Phoenix Cell's secret base in 2 BBY and used to train the rebel cell's new recruits. During this time, Padawan Ezra Bridger and Jedi Knight Kanan Jarrus used the RZ-1T to travel to Vizsla Keep 09 and rescue their friends from the former Sith Lord, Maul. Some time later, Bridger took the trainer without authorization to the desert planet of Tatooine in order to meet with Jedi Master Obi-Wan Kenobi and warn him of Maul. However, after landing, Bridger and C1-10P, who had stowed away aboard the vessel, were ambushed by the native Tusken Raiders. After taking six bolts from the Raiders' blaster rifles, the RZ-1T exploded."}, {"tag": "p", "text": "In 0 ABY, a dilapidated RZ-1T was in the possession of the Dreamers, an extremist rebel group formed from the remnants of Saw Gerrera's Partisans. The trainer was kept in a cache of stolen ships in the cell's encampment on the planet Jeosyn. During a mission conducted by the Empire's Inferno Squad to infiltrate and integrate within the rebel cell, Agent Gideon Hask often went flying in the RZ-1T with the group's leader, Staven."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The RZ-1T was a model of starship that first appeared, albeit identified only as a \"trainer,\" in \"The Holocrons of Fate,\" the second episode of the third season of the canon animated series Star Wars Rebels, released on October 1, 2016. It was later identified as an RZ-1T in the starship's Databank entry on StarWars.com."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}