{"url": "Raan_Calrissian", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Raan Calrissian"}, {"tag": "p", "text": "Raan Calrissian was a male individual who visited Cloud City on the planet Bespin during the time of the Clone Wars. After assisting a Tethan youngling who had escaped from captivity, Calrissian planned to depart from Cloud City in his starship, the Jostaar Express. However, before he could leave Bespin, Cloud City fell under attack from the Confederacy of Independent Systems. Believing that he could not abandon the Tethan on Bespin, Calrissian went and found the child, and they departed Cloud City together in the Jostaar Express."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Raan Calrissian was a male individual who lived during the waning years of the Galactic Republic."}, {"tag": "p", "text": "In circa 21 BBY, Calrissian was present in Cloud City on the planet Bespin, and he planned to deliver a shipment of minerals to a client on the world Socorro in his starship, the Jostaar Express. However, before he could gain clearance to depart from the city, Calrissian had to wait for his ship to be searched by a security droid."}, {"tag": "p", "text": "As he waited, Calrissian sighted a group of Jedi who were present in the city. Shortly afterward, a starship was held up at a security checkpoint near to where Calrissian was lingering. He observed as a Tethan child, who was being held captive aboard the craft, escaped and hid behind a stack of crates. However, Calrissian noticed that the security droid that had been searching the Express was approaching, so he told the Tethan to remain hidden, to prevent the droid from seeing the child. The droid informed Calrissian that it had finished checking the Express and that Calrissian was cleared for departure from Gate 134 of Cloud City. When the droid left, Calrissian went behind the crates and removed the youngling's security bracelets, then left to board the Jostaar Express."}, {"tag": "p", "text": "Moments later, the Confederacy of Independent Systems initiated an attack on Cloud City. Calrissian decided that he could not leave the youngling alone in the city, so he set out to find the Tethan. He eventually found the child, and the pair hurried through Cloud City's departure bay, hoping to get to Calrissian's starship before the spaceport was closed by Cloud City's security force. A group of security droids allowed Calrissian and the Tethan to barge past a queue, which Calrissian claimed was something that had cost him a lot of credits, and the pair arrived at Gate 134. They boarded the Jostaar Express, and Calrissian told the youngling to take up a position in the craft's gun turret, in case the ship came under attack. Calrissian then flew the starship out of the hostile airspace surrounding Cloud City and prepared to leave for Socorro."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Calrissian was a skilled pilot who believed in putting business before pleasure. He thought that the Tethan was gutsy, because of the nature of the child's escape, and he also considered members of the Jedi Order to be unscrupulous."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Raan Calrissian was created by Sue Behrent and appeared in The Clone Wars: Decide Your Destiny: Tethan Battle Adventure, a book in the Star Wars: The Clone Wars: Decide Your Destiny series. In the book, there are many different possible outcomes depending on choices made by the reader, and Calrissian features in one of the possible plot strands. After the Tethan's initial encounter with Calrissian, the reader can choose for the youngling to try and find him again, to travel off Cloud City with Calrissian. Raan has the same surname as the character Lando Calrissian, but there is currently no canonical connection between the two."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}