{"url": "Ra-Lee", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Cleanup", "Category:Bright Tree tribe", "Category:Ewoks", "Category:Females"], "nodes": [{"tag": "h1", "text": "Ra-Lee"}, {"tag": "p", "text": "Ra-Lee was a female Ewok who lived on the Forest Moon of Endor. Sometime after the year 0 BBY, she was married to Chirpa, chief of the Bright Tree Village."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ra-Lee was born on Endor prior to 0 BBY. At one point, she met Chirpa, the chief's son, and they fell in love. At one point, Ra-Lee and Chirpa were sent borra hunting and told her lover to stop moaning and to blow the borra horn and that Chukha-Trok had given the signal a long time ago. He responded that he was about to, and that everyone would think that it was her hunt, not his. She then asked if he was ready to catch the borra, with him responding yes. They both leaped on the borra and when Chirpa began attacking the borra, she asked what he was doing, and he responded saying that the borra was going the wrong way and that they were going to miss Chukha's trap. He steered the borra to the trap, with Ra-Lee saying they should make the borra jump closer, but Chirpa said that it wasn't time yet. They then forced the borra to jump into the trap."}, {"tag": "p", "text": "After catching and defeating the big borra, they went to Bright Tree Village, expecting to be welcomed as celebrities, but it wasn't meant to be. As they went, she asked why the village was so quiet, Chirpa told his father that the hunt was a success, but Buzza said he had more important matters on his hands. Chief Buzza and Shaman Makrit who were talking about woklings that had been snatched out of their beds during the night. She asked them what they were talking about and after witnessing everything that happened, she suggested that the Duloks had to be behind this as no one else would do this crime. Buzza agreed, but Makrit was against it. Buzza tried to reason with Makrit, but Makrit possessed him and Buzza said that the most likely woklings had run away and that they would conduct a search a search the next morning. Ra-Lee was suspicious and asked Chirpa when his father started taking orders from Makrit, with the other responding that Makrit was the shaman and knows best. However, Logray disagreed and said that the Duloks had to be and told them all that they would go on a rescue mission to save the woklings."}, {"tag": "p", "text": "As they approached the Duloks, Ra-Lee was shocked to see the village deserted and the others wondered if a giant creature called a condor dragon had attacked them, but Ra-Lee found tracks that suggest otherwise, and said that it looked like a species of monster, just as a Dulok leaped on her and threatened her with their spear, much to Chirpa's horror. He demanded the Dulok let Ra-Lee go, but they refused saying that she and the others will be sacrificed. When Chirpa asked to whom, the Dulok's mind went empty due to the sunstar. Chirpa was confused, but it was revealed that Makrit had followed Logray and owed Buzza an apology as the Duloks had been part of the kidnapping."}, {"tag": "p", "text": "The Dulok refused to be in any way related to the situation, and said that a \"great one\" had come and destroyed their village and now they must offer him a sacrifice to stop him from returning beyond the Salma Sands, at the foot of Mount Krana. Ra-Lee then said that if that's the case, that will be where they will go, punching him in the face and breaking him from his trance. When informed by Chirpa, she attacked the Dulok, saying that she will break more than that and that they had woklings to save. She then pushed the Dulok onto the ground, and repeatedly jumped up and down on his face."}, {"tag": "p", "text": "They then all went went to Mount Krana. The woklings were there, with Ra-Lee saying that the only way to get them to move is to cut them free of their ropes. As Logray, Chirpa, and Ra-Lee came inside to free the woklings, Makrit locked them inside and revealed that he had kidnapped the woklings for the sacrifice for the Gorax. Logray told Ra-Lee to use her ax to cut them free. Ra-Lee replied that they didn't have enough time, and took the borra horn, with Chirpa pondering its use. Ra-Lee blew into it, and Logray said he thinks he knows the answer."}, {"tag": "p", "text": "Several borras arrived, and Ra-Lee told everyone to unload the woklings onto the borras, which they did. They then headed back to Bright Tree Village, with Ra-Lee repeatedly blowing the borra horn and Logray bidding a final farewell to his master, as he was eaten by the Gorax."}, {"tag": "p", "text": "Ra-Lee went on to marry Chirpa, who succeeded his father as Chief of Bright Tree Village's Council of Elders. They soon had a daughter named Kneesaa together. Kneesaa followed her father's footsteps and became the chief of Bright Tree Village as well."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Years after the incident with the woklings, Lina Graf's crew was stranded on Mustafar after their ship the Auric. The technician, Skritt, was afraid of everything and told XM-G3 he wasn't brave enough. G3 told him he had to summon up his \"bravery circuits,\" which Skritt declined. G3 then decided to tell him the story as \"The Legend of the Gorax.\" Skritt was reluctant at first, but finally agreed as G3 said that it will help him become braver. After hearing the story, Skritt replied that it didn't help at all due to Makrit's death, but G3 was killed shortly after. The story had an effect on Skritt, as he did learn and became braver in the end and saved his friends, as confessed by Lina Graf."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ra-Lee had red hair and black eyes. She cared for her fellow Ewoks and was shocked when Chief Buzza listened to Makrit, as he had never done so before. She was also determined to save the woklings."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Ra-Lee was a skilled warrior, as shown when she skillfully hunted borras, and defeated a dulok. She also possessed skill in blowing a borra horn and was good with an ax."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ra-Lee owns an ax, which she uses in several situations. She knows when she needs to use her ax, as she refused when Logray asks her to use it as she said there wasn't enough time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ra-Lee originally first appeared in the Star Wars Legends animated television series Ewoks in 1985."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}