{"url": "Radiant_VII/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles with conflicting sources", "Category:Consular-class space cruisers", "Category:Galactic Republic starships"], "nodes": [{"tag": "h1", "text": "Radiant VII"}, {"tag": "p", "text": "The Radiant VII was one of many Consular-class space cruisers that were used by the Galactic Republic to provide transport to the government's diplomats."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Consular-class cruiser Radiant VII was a 115 meter-long Space Cruiser. It had three Dyne 577 radial atomizer engines, and its Long Voltrans tri-arc CD-3.2 hypderdrive engine was a class 2. It had a crew of eight, and a passenger capacity of 16. It was equipped with two 8-person escape pods. The salon pod was capable of being ejected."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Radiant VII was built in the shipyards of Corellian Engineering Corporation above Corellia. Since 66 BBY it was in the service of the Republic Diplomatic Corps. Under Captain Maoi Madakor, it flew at the Battle of Galidraan."}, {"tag": "p", "text": "Madakor and a new copilot, Lieutenant Antidar Williams, fly the ship on the mission (which would become its last one) that took place in 32 BBY: delivering Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi to Naboo. The Jedi were trying to end the blockade that was placed on the planet by the Trade Federation. However, soon after landing inside the Saak'ak, the Trade Federation destroyed Radiant VII (upon Darth Sidious' orders). Both crew members died. This also prevented an easier escape for Qui-Gon Jinn and Obi-Wan Kenobi. The two Jedi were then forced to escape from the Saak'ak. On their way through the vessel's hangar bay, Jinn and Kenobi took cover behind the Radiant VII's wreckage while they disabled a laser turret."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Radiant VII first appeared in 1999 with Star Wars: Episode I The Phantom Menace."}, {"tag": "p", "text": "The early designs of the Radiant VII had a smooth, \"Coruscant-look\" to it. After several iterations, George Lucas and Doug Chiang decided that the cruiser should have a strong visual link to the original trilogy. With that direction, Chiang and the Art Department devised a ship with a more rectilinear profile that echoed the design of Star Wars: Episode IV A New Hope's Tantive IV. One of the last additions to the cruiser was the small antenna array that rests above the cockpit. Lucas felt that the ship needed \"a little extra something\" to guide the audience's eyes to that section of the ship."}, {"tag": "p", "text": "The vessel's destruction in the video game adaptation differs slightly from the the movie. In the movie, the Radiant VII was destroyed before the Jedi leave the conference room, but in the game, it explodes after Kenobi escaped the conference room and reached the hangar bay."}, {"tag": "p", "text": "The vessel was also reimagined in LEGO form in 2005 for the opening cutscene of LEGO Star Wars: The Video Game, which was also included in the 2007 compilation re-release."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}