{"url": "Raddus_(MC85_Star_Cruiser)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Heavy cruisers", "Category:Mon Calamari cruisers", "Category:New Republic starships", "Category:Resistance starships"], "nodes": [{"tag": "h1", "text": "Raddus (MC85 Star Cruiser)"}, {"tag": "p", "text": "The Raddus, formerly known as the Dawn of Tranquility, was an MC85 Star Cruiser that served as the flagship of General Leia Organa. It was used by the Resistance during its war against the First Order. It was one of the last ships built before the signing of the Military Disarmament Act by the Galactic Empire and New Republic. The vessel gained the moniker Raddus upon its entry into the service of the Resistance, when Admiral Gial Ackbar petitioned to rename it in honor of the famed Admiral Raddus, who had died in service of the Alliance at the Battle of Scarif after defying the Rebel Alliance's political leaders and choosing to fight against seemingly insurmountable odds."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Engines"}, {"tag": "p", "text": "The Raddus possessed eleven sublight ion modules for engines, which also included an ion injection manifold and turbo injectors."}, {"tag": "h3", "text": "Complement and crew requirements"}, {"tag": "p", "text": "The vessel maintained a skeleton crew of 1,139, although it can via augmentation undergo complete automation. Owing to it formerly being a Mon Calamari-built MC85 Star Cruiser, the vessel maintained multiple aquatic species waterways. Leia's quarters were located at the top of the ship just above the primary command bridge. In addition, it contained crew accommodation levels, which were located around the same area as the shield operations center. The ship was also equipped with the main hangar bay as well as vehicle maintenance and repair bays. The ship carried various RZ-2 A-Wing Interceptors, T-70 X-wings, and various U-55 Loadlifters. The Raddus had a dedicated hangar that could accommodate four full bomber squadrons."}, {"tag": "h3", "text": "Bridge"}, {"tag": "p", "text": "The primary command bridge was located at the bow of the ship, although in the event that it was left critically damaged, it had an emergency bridge located in the ventral area."}, {"tag": "h3", "text": "Armaments"}, {"tag": "p", "text": "It was equipped with 18 heavy turbolasers, 18 heavy ion cannons, 12 point-defense laser cannons, and 6 proton torpedo launchers. It was also outfitted with experimental deflector shields that could withstand immense damage when correctly angled for incoming fire. Likewise, its advanced deflector shield envelope could extend far beyond its hull. The shields were proven powerful enough to withstand the First Order's assault on the fleeing Resistance fleet significantly longer than other vessels in the fleet."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early service"}, {"tag": "p", "text": "The Raddus was a part of the New Republic's home fleet under the name Dawn of Tranquility, before being retired and remodeled by the Resistance to be less crew intensive, eliminating systems and computerization deemed unnecessary. In large part because of these modifications, it was considered a valued resource within the Resistance's cause and was renamed Raddus in honor of the fallen Rebel Alliance hero, Admiral Raddus at the request of Admiral Ackbar. It was likewise constructed at multiple shipyards with several different species contributing to the construction efforts."}, {"tag": "h3", "text": "Fighting the First Order"}, {"tag": "p", "text": "Following Black Squadron's failed mission to retrieve the explorer Lor San Tekka from Cato Neimoidia, they rendezvoused aboard the Raddus. Commander Dameron and BB-8 worked on repairing Black One. General Organa then ordered them to prepare to launch in an instant once they tracked Tekka out of hyperspace. When Pava realized that the tracker had been disabled, they returned to brief Organa."}, {"tag": "p", "text": "Immediately after the destruction of Starkiller Base, the Raddus participated in the evacuation of D'Qar. While Poe Dameron and a team of bombers engaged the retaliating First Order forces, the remaining Resistance personnel was successfully transferred to the orbiting ship. The Raddus jumped to lightspeed, but was tracked through hyperspace by Snoke's flagship, the Supremacy, and attacked."}, {"tag": "p", "text": "Deploying TIE fighters, Kylo Ren in his TIE Silencer, attacked the cruiser, destroying its main hangar, then directed towards the bridge. Sensing his mother's presence on the ship through the Force, Kylo hesitated and at last decided to not to fire. His two wingmen, however, including Lieutenant Poldin LeHuse, carried on with the attack. The bridge was torn apart and exposed to the vacuum of space, killing most of Resistance High Command, including Admiral Gial Ackbar. General Organa was the only one who survived, as she used the Force to get back to safety."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "Upon arrival at Crait, the ship was evacuated by thirty lifeboats, with Vice Admiral Amilyn Holdo deciding to stay behind and command the vessel from its secondary command bridge, in order to draw the First Order away from the fleeing vessels. When the Supremacy started to target the lifeboats, Holdo turned the Raddus around and rammed the Mega-class Star Dreadnought at lightspeed, destroying itself and inflicting serious damage to the Supremacy, along with destroying several of the escorting First Order Resurgent-class Star Destroyers in the process."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}