{"url": "Radanthus_Mandelatara", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with gameplay alternatives", "Category:Articles with cut elements", "Category:Authors", "Category:Humans", "Category:Males", "Category:Naboo"], "nodes": [{"tag": "h1", "text": "Radanthus Mandelatara"}, {"tag": "p", "text": "Radanthus Mandelatara was a Human male playwright who lived on Naboo during the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. Sometime following the Battle of Yavin in 0 BBY, he stayed at the hotel in Moenia, a city on the planet Naboo. While overseeing the production of a performance titled Hearts of Empire at Theed's Templexus of the Dramatic Arts, Mandelatara commissioned a spacer to acquire an animal pelt for use as a theatrical prop. His touring company ran into another problem when their female lead, named Mairlenn, lost her pet voorpak named Dotti to a pack of ravenous beasts. Hoping to placate the irritated actress, Radanthus yet again commissioned a spacer, this time to hunt down and kill the vicious beasts as a means of vengeance."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male playwright, Randanthus Mandalatara lived at the time of the major galactic conflict known as the Galactic Civil War, during which the Alliance to Restore the Republic won a decisive victory against the Galactic Empire at the Battle of Yavin in 0 BBY. At some point following the battle, Mandelatara elected to stay at the hotel in the city of Moenia, an artists' retreat on the planet Naboo. During his time on Naboo, Mandelatara and his touring company began production on an upcoming theatrical production titled Hearts of Empire, which was to be played at Theed's Templexus of the Dramatic Arts. Lacking a sufficient prop budget, but demanding palpable authenticity for his scenes, Mandelatara required a fierce predator's pelt to use in his production. To that end, he submitted a jobs posting on mission terminals looking for able-bodied spacers to acquire one such pelt in exchange for credits."}, {"tag": "p", "text": "At least one such spacer was up to the task, and successfully hunted down creatures in order to secure a pelt for Mandelatara's production. Meanwhile, Mandelatara's touring company encountered a problem when their female lead named Mairlenn lost her pet voorpak called Dotti to a pack of beasts during a visit to the Naboo countryside. After having witnessed the grizzly ordeal herself, Mairlenn insisted that Mandelatara find someone to \"punish\" the pack of beasts. Seeing that the woman was quite upset, Mandelatara relented and posted another job's posting, this time for individuals solely on Naboo, to hunt down the beasts and kill them. At least one spacer was up to the task of meeting Mairlenn's demands, and the creatures responsible for consuming her pet voorpak were duly defeated. During his stay at the Moenia hotel, Mandelatara also encountered a spacer who wished to speak to him. However, Mandelatara did not want to speak to the spacer, because he was distracted and was trying to remember something he had forgotten."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mandelatara had fair skin, brown hair and a beard, and amber-colored eyes. As a playwright, he demanded authenticity in his performances, going so far as to acquire a freshly hunted animal pelt for use as a theatrical prop. He was also prone to forgetting things, as evidenced by his encounter with the spacer in Moenia."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "At the time of his stay in Moenia, Mandelatara wore a vest and padded jacket. The jacket was a type of clothing worn by both Imperial Surface Marshals and Alliance recruitment agents, and was similar to the vest and tunic worn by Rebel troopers stationed at Echo Base on the planet Hoth. However, his jacket differed from those worn by the Hoth Rebels, in that the padded collar was an integral component of his under-jacket rather than the vest. Furthermore, Mandelatara's jacket was colored differently than those worn by Imperial and Rebel forces. His consisted of a brown-colored vest, with a beige-colored under-jacket. The belt he wore around his vested jacket was a dark shade of brown, with a silver-colored buckle. In addition to the vested jacket, Mandelatara also wore brown pocketed work pants and brown standard boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Radanthus Mandelatara was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. In the game, Mandelatara served no particular purpose, merely telling players who attempted to converse with him that he was distracted and trying to remember something. Radanthus Mandelatara is listed in a couple reference guides for Star Wars Galaxies, including Star Wars Galaxies: An Empire Divided: Prima's Official Strategy Guide (2003), and Star Wars Galaxies: Jump to Lightspeed: Prima Official Game Guide (2004). In both of these reference guides, he is listed as a townsperson found on Naboo. Despite the NPC serving no purpose, Radanthus Mandelatara was featured in the descriptions for a couple mission terminal missions, completion of which would award the player with credits. One of these missions was a destroy mission titled Theatrical Prop Needed. The other, available only from mission terminals on Naboo, was a destroy mission titled Punishment of Naboo Predator Needed. The latter mission was available in two varying levels of difficulty, including easy and medium, but the content was identical."}, {"tag": "h3", "text": "Cut content"}, {"tag": "p", "text": "In the game's directory tree files and source data, Mandelatara is placed among the many NPCs who gave players simple kill, delivery, and escort quests. The files contain additional dialogue for the two aforementioned missions which are not definitively known to have appeared on the live servers. For the mission titled Theatrical Prop Needed, the game files include dialogue where Mandelatara expresses dismay regarding the pelt that was acquired for him. He remarks that the pelt was bloodied and gave off an unpleasant aroma, and that he would be unwilling to use such a thing in a live performance. However, in the dialogue, he also muses to himself that the animal remains were providing him with a source of inspiration. Likewise, the mission titled Punishment of Naboo Predator Needed contains additional cut dialogue, in which Mandelatara expresses relief after the mission is accomplished. He also states that due to a budget line item for Mairlenn's demands, he would have no problem processing payment for completion of the job."}, {"tag": "p", "text": "The game data also include information on a series of three other quests which were intended to be provided by the NPC itself, the first of which would have required the killing of at least one peko-peko, and the other two requiring the retrieval of specific items from two separate NPCs. As no conversational text string files are associated with these three quests, the exact context of this cut content remains unclear. However, each quest would have awarded the player 100, 150, and 200 credits respectively."}, {"tag": "p", "text": "While in Moenia, Mandelatara commissioned a spacer to hunt down a peko-peko. The bird was accompanied by yet another peko-peko, both of which were killed. After having accomplished this, Mandelatara tasked the spacer with meeting a mercenary messenger named Hiddi. While en route to meet Hiddi, the spacer was ambushed by yet another couple peko-pekos, both of which were killed. Hiddi then gave the spacer a sealed container of freshly plucked pinfeathers from two fine peko-pekos to give back to Mandelatara. As one final task, Mandelatara hired the spacer to obtain a finely crafted electrical device from a scavenger known as Thogo the Annihilator. Despite being attacked by an aggressive female tusk-cat while on the way to meet Thogo, the spacer was successful in slaying the feline, and delivering Thogo's electrical device back to the playwright. For accomplishing these tasks, Mandelatara provided payment for a job well done."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}