{"url": "Radiant_IX", "categories": ["Category:Legends articles", "Category:Consular-class space cruisers", "Category:Galactic Republic starships"], "nodes": [{"tag": "h1", "text": "Radiant IX"}, {"tag": "p", "text": "The Radiant IX was a Consular-class space cruiser."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Radiant IX was once used to transport Jedi Et Rex and Alysun Celz to Coruscant to be tried before the Jedi Council for falling to the dark side of the Force. Before the ship arrived, however, a group of mynocks managed to leech energy from the external electrical couplings causing the ship to lose power and be sucked into the gravity well of the Hoth system. The crew landed on an asteroid known by pirates as the \"Poison Moon\", where they managed to transmit a distress signal before they were killed by Celz who had somehow managed to escape. Rex, however, managed to escape the ship and befriended some mynocks on the asteroid's surface before Celz could kill him also."}, {"tag": "p", "text": "Jedi Master Obi-Wan Kenobi and his Padawan Anakin Skywalker were sent to investigate the distress signal and, upon entering the ship, they discovered the dead bodies of the crew as well as the smell of o-zone; evidence they had been killed either by a lightsaber or Force lightning. They discovered Celz behind a door leading from the bridge whom managed to convince them that she was the pilot of the ship and it was in fact Rex who had murdered the crew. Kenobi left Skywalker with Celz as he went to search the surface of the asteroid for Rex."}, {"tag": "p", "text": "Kenobi found Rex almost immediately, who explained that he had been framed and that Celz was in fact the killer. Back on board, Celz attempted to convince Anakin to leave without his master unsuccessfully and instead used Force lightning to incapacitate him, revealing herself to be the Dark Jedi rather than Rex. Kenobi and Rex arrived just in time to save Anakin, Kenobi attacking with his lightsaber but being hit by Force lightning also while Rex unleashed a pair of mynock's upon her, which fed on her lightning as they would any other electricity."}, {"tag": "p", "text": "The Jedi left the Radiant IX on the \"Poison Moon,\" leaving with their prisoners on board their own ship and heading back to Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}