{"url": "Raid_above_Corellia", "categories": ["Category:Legends articles", "Category:Battles of Corellia", "Category:Battles of Operation Skyhook"], "nodes": [{"tag": "h1", "text": "Raid above Corellia"}, {"tag": "p", "text": "The Raid above Corellia was a minor skirmish during the Galactic Civil War. Han Solo was rescued by the Alliance to Restore the Republic over Corellia."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After having captured a pirate informer over Atzerri, the Rebel Alliance had learnt that Grand Moff Wilhuff Tarkin was personally overseeing the Imperial superweapon project from a space station orbiting Corulag. But before attacking the station, the Rebels needed to find a way to disable the defenses of the station."}, {"tag": "p", "text": "After hearing of Han Solo's success at rescuing Chewbacca and a number of Wookiees earlier on Kashyyyk, Mon Mothma strived to contact him to help the Rebellion's investigations. They eventually found him caught in a Star Destroyer's tractor beam over Corellia."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "The rebels sent a small fleet in the system to rescue him. While the Rebel fleet attacked the Imperial-class Star Destroyers, the Y-wings moved in to disable the tractor beam of the command Star Destroyer. They eventually managed to destroy it before it could reach the Cardan-class space station. The Millennium Falcon escaped and hyperspaced out of the system."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Mon Mothma later personally recruited Han Solo and Chewbacca, despite Solo's reluctance, to assist the Rebels in the raid on the Imperial research facility over Corulag. Solo was hired to plant a tracking device and EMP in one of the cargo containers bound for the research station."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle was the seventh mission of the Rebel campaign in the 2006 video game Star Wars: Empire at War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}