{"url": "Ragnos_Lakes", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Kesh locations", "Category:Lakes"], "nodes": [{"tag": "h1", "text": "Ragnos Lakes"}, {"tag": "p", "text": "The Ragnos Lakes were a location on the remote planet Kesh, named by the Sith castaway group known as the Lost Tribe after the former Dark Lord of the Sith Marka Ragnos. Surrounded by eight villages, the farthest from the center of Sith power on Kesh being Tetsubal, the area played host to the deaths of thousands of local Keshiri in 4985 BBY at the hands of the Sith Ravilan Wroth and, without his knowledge, prominent Sith Seelah Korsin. As a result, the region was abandoned."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Ragnos Lakes were a group of lakes on the planet Kesh to the south of one of the world's major cities, Tahv. The lakes were surrounded by eight villages, including Tetsubal and Rabolow, containing hundreds of thousands of Keshiri natives. The lakes themselves were home to a several different types of fluorescent algae."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 5000 BBY, a group of Sith crash-landed on Kesh, the crew of a wayward starship known as the Omen. The Lost Tribe of Sith, as the survivors were known, quickly took over the planet, naming the lakes after the deceased Dark Lord of the Sith Marka Ragnos. In 4985 BBY, the local Keshiri residents began harvesting a kind of fluorescent algae from the Ragnos Lakes. Lost Tribe leader Yaru Korsin sent one of his advisors, Ravilan Wroth, to the area to discern whether the algae could be used for lighting Sith structures. Wroth, who desired to escape seclusion on Kesh, decided to use the opportunity to convince the Sith to withdraw from Keshiri matters and focus on finding a way off the planet. Using the deadly compound cyanogen silicate, he and several accomplices poisoned the water supply of Tetsubal, killing the entire Keshiri population. However, Wroth's misdeeds were discovered, and Yaru Korsin's wife Seelah conspired to poison the rest of the Ragnos Lakes villages and frame Wroth. Her plan went off without a hitch, and Wroth and the other members of the Sith species on Kesh were systematically purged from Kesh as a result. The Ragnos Lakes region was subsequently abandoned, with its empty settlements regarded as ghost towns—by 3960 BBY, the area was commonly believed to be haunted."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ragnos Lakes are mentioned in three eBooks by John Jackson Miller—Lost Tribe of the Sith: Paragon, Purgatory, and Sentinel. However, the lakes themselves have not appeared."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}