{"url": "Ragez_D%27Asta", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Business owners and executives", "Category:D'Asta family", "Category:Humans", "Category:Imperial Inner Circle members", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ragez D'Asta"}, {"tag": "p", "text": "Ragez D'Asta was a powerful shipping magnate and Baron of the Galactic Empire, as well as a firm supporter of Emperor Palpatine. Commanding the largest privately-owned fleet in the galaxy, producing most of the cargo ships used by the Empire, and controlling the strategically important D'Astan sector, D'Asta was a respected and influential individual. He was a member of the Imperial Ruling Council until illness forced him to step down, leaving his daughter Feena to take his place on the Council and represent his interests, although she was soon abducted by the Black Sun criminal organization and—unbeknownst to the Baron—replaced with a clone."}, {"tag": "p", "text": "Feena's clone was part of a successful conspiracy to end the life of Emperor Palpatine, and afterward became part of the Imperial Interim Ruling Council, the new ruling body of the Empire, where she continued to represent D'Asta. When the Council was taken over by Xandel Carivus, who declared himself the new Emperor, the clone Feena was arrested as a traitor. Still considering her to be his true daughter, D'Asta commanded his armada in an attack on Ord Cantrell, headquarters of the Council. When he learned of Carivus' involvement in the conspiracy against Palpatine from Royal Guardsman Kir Kanos, D'Asta aided Kanos in assassinating the self-proclaimed Emperor. With the last of the former Imperial government dismantled, D'Asta declared his sector independent from the Empire and the New Republic."}, {"tag": "p", "text": "Ragez arranged a peace treaty between the New Republic and the Imperial Remnant in 13 ABY, sending his daughter Feena as a proxy due to his ailing health. This action caught the ire of the Imperial splinter group known as the \"Restored Empire\", bent on preserving the Empire under the vision of the late Emperor Palpatine. After his daughter was killed by the forces of Ennix Devian, the leader of the Restored Empire, D'Asta deployed his fleet to the Imperial capital world of Orinda, allying with Kir Kanos once again to provide backup for the Imperial forces in combat with the hardliner fleet in orbit. Following the battle, Ragez adopted Feena's clone as his own daughter."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Businessman of the Empire"}, {"tag": "p", "text": "Ragez D'Asta was a Human Baron of the Galactic Empire, the leader of the strategically important D'Astan sector and a member of the D'Asta family, the most influential family of the galaxy's New Territories. A powerful shipping magnate and supporter of Emperor Palpatine, D'Asta owned a number of companies that produced most of the Empire's cargo vessels. In addition, the Baron controlled the largest privately-owned fleet of starships in the galaxy. D'Asta had business dealings with Jahren Sinn, a farmer from Nez Peron; his daughter Feena and Sinn's wife Mirith were friends as well."}, {"tag": "p", "text": "In the years after Palpatine's first death in 4 ABY, D'Asta was a member of the Imperial Ruling Council. However, he eventually grew too ill to participate in the Council and his seat was taken up by his daughter Feena, who represented D'Asta's interests she was granted latitude on the Council because of the respect for her father. For five years after 6 ABY, D'Asta had no contact with his daughter. Unbeknownst to the other members of the Council and her own father, Feena was kidnapped in 7 ABY and replaced with a clone by the criminal organization Black Sun, who used the clone to stake their own interests on the Council while Feena was kept imprisoned by their ally Grappa the Hutt. D'Asta had no contact with the clone either, and he remained unaware of the switch. During his attempt to reunite the Empire, Grand Admiral Thrawn earned the allegiance of the D'Astas with his attacks against the New Republic, but when the Admiral was killed in 9 ABY the fragments of the Empire fell apart once more."}, {"tag": "p", "text": "In 10 ABY, Palpatine, reborn into a new clone body, once again became the public leader of the Empire. Working to secure their own power, a thirteen-person conspiracy— including the cloned Feena, though this was unknown to D'Asta, who continued to think of Palpatine as his emperor— sabotaged Palpatine's clones, eventually leading to his final death in 11 ABY. In the wake of these events, the conspirators formed the Interim Ruling Council, which became the new rulers of the Empire. Feena's clone continued to serve as her \"father\"'s voice on the Interim Council in their headquarters on Ord Cantrell."}, {"tag": "h3", "text": "The machinations of Carivus"}, {"tag": "p", "text": "One of the members of the Council, Xandel Carivus, sought to take over the Empire. By arranging the assassinations of a number of prominent councilors, Carivus ensured his election as head of the Council. The clone Feena believed him to be ineffectual and opposed him, but she received little support from the rest of the body. Eventually, Carivus had all non-Human members of the Council arrested, claiming suspicion that they were behind the assassinations, and arrested the clone Feena as well, accusing her of being a traitor. Councilor Mahd Windcaller warned Carivus that D'Asta would break from the Empire, inciting others to join him in rebellion. Carivus ignored her concerns, however, considering D'Asta to be too sick and old to be a threat. Windcaller and other members of the Council later met to decide what was to be done about D'Asta and other problems besetting the Empire. They had decided to smooth the situation with D'Asta by freeing his daughter from imprisonment when Carivus announced that he was dissolving the Council and instituting himself as Emperor."}, {"tag": "p", "text": "Shortly thereafter, D'Asta sent a message to Carivus, in which he threatened to leave the Empire, taking his resources with him. Carivus again ignored the threat, despite the fact that the Empire was still at war with the New Republic and was suffering internal dissension from the Whiphid species ever since their representative to the Council had been killed by Carivus' soldiers after resisting arrest. Carivus left one of his admirals to deal with any possible danger from D'Asta."}, {"tag": "h3", "text": "The Battle of Ord Cantrell"}, {"tag": "p", "text": "D'Asta, meanwhile, assembled his entire armada and launched an attack on Ord Cantrell. With the Imperial Navy scattered due to the New Republic and Whiphid problems, D'Asta's fleet routed the Imperial fleet, breaking the defenses over Ord Cantrell and driving what ships remained into retreat. Moments after the admiral in charge of the world's defense lost communications with Carivus in the Council Tower, D'Asta contacted the ersatz Emperor from his flagship, a Marauder-class corvette, informing him that his fleets were in ruin and his fate was sealed. With D'Asta's starfighters attacking the Council Tower itself, Carivus gave in and released Feena, on the condition that D'Asta would cease hostilities. Though irritated that he would be calling off his attack short of victory, D'Asta accepted. A temporary cease-fire was called as D'Asta's flagship docked with an Imperial Carrack-class light cruiser to have Feena transferred over."}, {"tag": "p", "text": "D'Asta embraced what he believed to be his daughter, but their reunion was interrupted by the arrival of a group of visitors: Mirith Sinn, now of the New Republic, Kir Kanos, one of the Emperor's Royal Guard, and the real Feena D'Asta, rescued from Black Sun imprisonment. The clone drew a blaster on the real Feena, but D'Asta disarmed her and demanded an explanation from Sinn. When D'Asta questioned her, the clone Feena confessed. Kanos, who sought to avenge all the conspirators who had killed Palpatine, drew his blade on the clone, demanding her life. D'Asta was shocked that she had been part of the conspiracy, but asked Kanos for mercy. Sinn convinced Kanos to stand down and to pursue his real target, Xandel Carivus, instead."}, {"tag": "p", "text": "D'Asta broke off the attack and contacted Carivus, requesting a personal meeting; if he was granted this, he said, he would call off his armada with no further hostilities. Carivus allowed his shuttle to land, and D'Asta and his party—Sinn, Feena, and Kanos' friend Tav Kennede—arrived in Carivus' throne room. D'Asta announced that his sector would be withdrawing from the Empire and that once news of the conspiracy against Palpatine spread, other sector leaders would join him. Carivus did not believe D'Asta would reveal the plot, as his daughter had supposedly been part of the conspiracy, but when D'Asta told him that it had actually been a clone of her, Carivus declared them all traitors and ordered his personal guards to arrest them. Just then Kanos arrived, and Carivus commanded his guards to kill everyone in the room. As Kanos fought off the guards, Sinn hurried D'Asta and Feena away from the fighting, fending off those guards that pursued. Tav Kennede leapt in front of a shot meant for D'Asta, but he was only injured."}, {"tag": "p", "text": "Meanwhile, Kanos pursued the fleeing Carivus. Cornering him, the Royal Guardsman ended the life of the self-proclaimed Emperor. D'Asta and the others arrived shortly thereafter, as Kanos decided he would spare the imprisoned members of the former Council. With that, the war against the conspirators was ended; D'Asta still desired revenge on Grappa the Hutt, but unknown to him, Grappa was at that moment en route to be sacrificed by his former allies, the Zanibar species. Sinn offered a position in the New Republic to D'Asta, but the Baron turned her down, preferring that the D'Astan sector remain independent; he nonetheless remained in debt to her for saving his daughter. Kennede chose to join D'Asta as the Baron returned to his sector."}, {"tag": "h3", "text": "Truce with the New Republic"}, {"tag": "p", "text": "By 13 ABY, D'Asta was continually urged to rejoin the Imperial Remnant. However, D'Asta observed the Empire's resources being dwindled due to the their continued support of the Galactic Civil War. He arranged a conference with Admiral Gilad Pellaeon on the planet Orinda with the hope of convincing the latter to arrange a truce with the dominant New Republic. However, after falling ill, D'Asta sent his daughter to the meeting as his proxy. Feena announced D'Asta's full backing of an Imperial treaty, swearing that he would rejoin the Imperial ranks and intercede any potential rebellious Moffs who refused to adhere to the treaty's terms."}, {"tag": "p", "text": "However, plans for a ceasefire were immediately sabotaged by the forces of Ennix Devian, who led a rogue Imperial hardliner faction known as the Restored Empire. Feena was killed by stormtroopers during the peace talks, an act which was witnessed by Kir Kanos and Mirith Sinn. Kanos, discovering the emblem of the Restored Empire tattooed upon the assailants' wrists, opted to personally deliver Feena's body to her father. Kanos explained the situation to Baron D'Asta: by attacking the peace summit, Devian would frame the act on the New Republic and force Admiral Pellaeon into launching a retaliatory strike on Coruscant, which would leave Orinda undefended, allowing for Devian to strike and usurp the power of the Imperial Remnant. D'Asta made contact with Pellaeon and urged him to call off the attack on Coruscant. D'Asta and Pellaeon formed a battleplan: Pellaeon's fleet would distract the hardliners while three of D'Asta's fleets lay in wait behind Orinda's moon. Accompanied by Kanos, Sinn, and the clone of his daughter Feena, D'Asta launched the attack on the hardliner fleet and boarded Pellaeon's flagship, which was being overrun by Devian's forces. D'Asta narrowly saved Pellaeon from execution at the hands of Devian, and used his daughter's clone as a decoy in order to confuse Devian into believing he had failed at murdering Feena. By distracting Devian in this way, D'Asta gave Kanos the time to kill Devian."}, {"tag": "p", "text": "Soon after the battle, D'Asta adopted the clone as a daughter and offered a wounded Kanos sanctuary in an undisclosed area in the D'Astan system, where he would remain for several months under his hospitality. D'Asta provided Kanos the first steps into letting go of his past, providing him with an X-wing starfighter in order to find a new life."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Baron D'Asta was respected amongst Imperials, including the members of the Interim Council. When his daughter Feena was arrested, many of them considered him to be a great threat to the Empire, as his breaking away from them would inspire others to do the same. D'Asta, being pro-Imperial and a supporter of Emperor Palpatine, was aghast when he learned of the conspiracy to end the Emperor's life. He still considered Palpatine to be his Emperor, even after the man's death, refusing to acknowledge Xandel Carivus' claim to the throne. D'Asta had little in the way of respect for Carivus, considering him a coward and weakling."}, {"tag": "p", "text": "Carivus considered D'Asta to be a man of honor. D'Asta lived up to his debts to those who had aided him, such as Mirith Sinn. He also understood the need for revenge, allowing Kanos to carry out his own quest for it and seeking it himself against Grappa the Hutt. D'Asta also did not like to call off successful attacks when they were still short of definitive victory. As he grew ill, D'Asta required the constant supervision of doctors, yet he remained strong enough to oppose the Empire when Carivus took over."}, {"tag": "p", "text": "D'Asta cared greatly for his daughter, placing her safety above his personal pride. He sought vengeance for slights inflicted upon her, aggressively pursuing those like Carivus who did her harm. D'Asta nonetheless asked for mercy for the clone who replaced her, letting her free after the war against Carivus was finished. Following the death of his true daughter, D'Asta displayed his love for her clone by taking her in as his own."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ragez D'Asta was created for the comic miniseries Crimson Empire II: Council of Blood, by Mike Richardson and Randy Stradley. While D'Asta is mentioned throughout the series, it is not until the penultimate issue that he briefly appears over a viewscreen on the last page, and not until the final issue that the Baron appears in person. He was later referenced in Star Wars Handbook 2: Crimson Empire—which established that \"Ragez\" was his first name—and in The Essential Chronology and its second edition. The character later appeared in Star Wars: Crimson Empire III—Empire Lost."}, {"tag": "p", "text": "While Council of Blood does not distinguish between the \"Imperial Ruling Council\" and \"Imperial Interim Ruling Council,\" using them interchangeably and establishing D'Asta simply as having been a member of \"the Council,\" the comic makes it clear that he could not have been in the Interim Council. The conspiracy to kill Palpatine takes place after D'Asta is replaced by his daughter on the Council, and the Interim Council is established as having been formed by the conspirators in the wake of Palpatine's death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}