{"url": "Raid_on_Bespin", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Battles of Bespin", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Raid on Bespin"}, {"tag": "p", "text": "The Raid on Bespin was a minor engagement by the Alliance to Restore the Republic against the Imperial-occupied tibanna gas mining facility Cloud City. The Rebel's Rogue Squadron engaged Imperial TIE fighters and siege balloons to secure the tibanna gas platforms and allow transports to move in and take the gas. The squadron then moved into Cloud City to secure the remaining platforms. The Imperials launched a reprisal strike with TIE bombers, but the Rogues shot them all down."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3 ABY, the Galactic Empire pressured the Baron Administrator of Cloud City, Lando Calrissian, into giving them Han Solo and his friends with the threat of an occupation of Cloud City. Shortly thereafter, the Empire reneged on its half of the bargain and conquered the planet. Some time after, the Rebel Alliance, which was fighting the Empire, received intelligence about a new, powerful superweapon, the Death Star II battlestation. The Alliance therefore planned an attack against the station in 4 ABY. As part of the lead-up, the Alliance launched a raid against Bespin to capture valuable tibanna gas for the Alliance Fleet. Rogue Squadron was assigned to the raid some time after their Mission to Prefsbelt IV."}, {"tag": "h2", "text": "Raid"}, {"tag": "p", "text": "However, the Imperials has had anticipated the Rebel's raid, and planted seven siege balloons on guard near a series of six tibanna gas platforms. The balloons were also ordered to target and destroy the platforms, preferring it to the alternative of letting the Rebels secure the tibanna gas."}, {"tag": "p", "text": "Rogue Squadron, under the command of Commander Wedge Antilles, was assigned to the mission to raid Bespin by securing the platforms and escorting three Rebel Transports while they were in route to Cloud City itself. Rogue Squadron first targeted the siege balloons in order to ensure that they didn't blow up the platforms."}, {"tag": "p", "text": "By the time the Rebels arrived at the second tibanna gas platform, Rogue Leader Wedge Antilles shot down an Imperial tanker, and uncovered some homing concussion missiles to which he procured, although it came at the cost of most of the tibanna gas containers on the platform."}, {"tag": "p", "text": "Afterward, Rogue Squadron had to deal with several squadrons of TIE/LN starfighters and TIE interceptors that were proceeding to target both the platforms and the transports. Antilles and the Rogues engaged and destroyed the Imperial starfighters. The three transports then docked with the platforms as Antilles ordered the Rogues to form up."}, {"tag": "p", "text": "A Rogue pilot spotted three main power generators in Cloud City on his targeting computer and suggested destroying them to weaken the turbolaser defenses. Antilles ordered them to destroy the generators and wished them luck. Rogue Squadron also started using Storm Iv Twin-Pod Cloud cars shortly before Wedge's attack on the generators. After destroying the generators, Antilles reported the objective's success and ordered the squadron to save the gas platforms. Rogue Squadron commenced with mopping up operations by destroying more siege balloons near the final two tibanna gas platforms, as well as destroying a newly-dispatched TIE bomber squadron."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the Imperial presence threatening the gas platforms removed, Antilles congratulated the Rogues and informed the transports they could move in. Soon after, the Alliance Fleet left for the Battle of Endor, where they survived Emperor Palpatine's trap and destroyed the Death Star II superweapon/battlestation. The loss of the station resulted in both the Emperor's and Darth Vader's death, and the eventual fragmentation of the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Raid on Bespin appears in the 2001 video game Star Wars: Rogue Squadron II: Rogue Leader. It is possible to find a vehicular upgrade in the mission, but it is not necessary to win the mission. This article assumes the player did so. In the second half of the mission, the player may destroy more balloons but it is not necessary. The player also has the option of jumping into one of three cloud cars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}