{"url": "Raid_on_Rakata_Prime", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Battles of the Galactic War", "Category:Battles of Lehon"], "nodes": [{"tag": "h1", "text": "Raid on Rakata Prime"}, {"tag": "p", "text": "A raid on Rakata Prime was undertaken by allies of Theron Shan and Lana Beniko following the Operation on Manaan."}, {"tag": "p", "text": "Sith Lord Lana Beniko and Republic SIS agent Theron Shan, in pursuit of their respective superiors, Darth Arkous of the Dark Council and Colonel Rian Darok of the Republic Army, discovered that the Revanites had a factory on Rakata Prime designed to create their Infinite Army, implanting salvaged parts of the Star Forge to create nearly unstoppable cyborgs. So Beniko and Shan dispatched a strike team, aided by the Wookiee smuggler Jakarro, to destroy the factories, hoping to expose the conspirators."}, {"tag": "p", "text": "The strike team succeeded in destroying the Infinite Army within the Rakatan Temple of the Ancients, the Revanite headquarters. On the roof of the temple, the strike team killed Darok and Arkous. Yet soon afterwards, a massive combined fleet of both Republic and Imperial ships arrived above the planet carrying the true leader of the Order of Revan, Revan himself; the fleet launched an orbital bombardment in hope to slay all his opponents but only managed to destroy the Temple of the Ancients."}, {"tag": "p", "text": "Afterwards, Revan, saying that the failure of the Infinite Army was only a minor setback, used more subtle methods to discredit his opponents through the Revanite influence within both galactic governments. Theron Shan was declared a rogue agent by the Republic Strategic Information Service, which dismissed him from the corps; Lana was framed for the assassination of Darth Arkous and considered an intergalactic terrorist; and twelve death marks were placed on Jakarro's head. However, the members of the strike team were considered too high profile to frame, leaving them free to operate against the Revanites. Theron, Lana and Jakarro then went into hiding to find a way to expose the Revanites."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Raid on Rakata Prime is a tactical flashpoint on the Star Wars: The Old Republic video game, available to both Republic and Empire players, either playing solo or in a group. It is the final mission in the Forged Alliances storyline."}, {"tag": "h3", "text": "Gameplay alternatives"}, {"tag": "p", "text": "For Republic players, upon reaching the cyborg recruitment center, in the ensuring cutscene, Theron distracts Lana before telling the player(s) that they can't risk Rakata technology falling into Imperial hands and advised to overload the console and destroy the cyborgs."}, {"tag": "p", "text": "For Imperial players, upon reaching the cyborg recruitment center, in the ensuring cutscene, Theron suggests overloading the console. Lana distracts Theron, before telling the player(s) that an overlord would also destroy the data that would help the Empire building a cyborg army augmented by Rakata technology and suggests instead preserving it."}, {"tag": "p", "text": "If the player(s) choose not to destroy the cyborgs, they are forced to fight their way through, earning light side points as a result. If the player(s) choose to destroy the cyborgs, a fight is avoided, earning dark side points. For Imperial players, either dialogue option affects the post-mission cutscene on Manaan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}