{"url": "Raid_on_Todirium", "categories": ["Category:Legends articles", "Category:Battles in the Demetras sector", "Category:Battles of the Hunt for Zsinj"], "nodes": [{"tag": "h1", "text": "Raid on Todirium"}, {"tag": "p", "text": "The raid on Todirium was an operation carried out by Wraith Squadron during the New Republic's campaign against Warlord Zsinj. The Wraiths destroyed the planet's factories giving matériel to Zsinj, all the while pretending to be Rogue Squadron to entice the Warlord. It had the desired effect as Zsinj would later devise a trap for the famed unit but ended up having his forces defeated at the Battle of Ession."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After escaping from the Battle of Folor, Wraith Squadron was pulled out of hyperspace by Empion mines laid by the Night Caller, which was aligned with Warlord Zsinj. When the Night Caller came into the system to look for survivors, the Wraiths managed to capture the ship with unorthodox tactics. Due to the swift capture of the ship, its crew was unable to send out a distress signal, which meant that Zsinj's forces were not aware of its capture. Acting on his own initiative, Antilles hatched the plan of the Wraiths pretending to be its crew and following the ship's original orders, hoping to find a way to lure Zsinj into a trap. With each of their stop though, they learned that Zsinj was setting up businesses on each world to fund his operation. The Wraiths then began destroying each business so as to give the impression that the ship was being shadowed."}, {"tag": "h2", "text": "The Raid"}, {"tag": "p", "text": "Wedge Antilles ordered the squadron's mechanic, Cubber Daine, to paint their X-wing's with Rogue Squadron's colors. This was so that the spy satellites they left behind posing as the Night Caller would record the raid being performed by the famed New Republic squadron."}, {"tag": "p", "text": "During the raid, they broadcast out in the open and used Rogue call signs to further the deception. They encountered minimal resistance from the planet's forces, which consisted of Ultra-Light Assault Vehicles. They easily disposed of the ULAVs and successfully destroyed the factories without any losses."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The raid was a success on another level, as Warlord Zsinj took notice of the attack. He contacted Night Caller's captain, Zurel Darillian, who was being impersonated by Garik Loran, to construct a plan of ambushing Rogue Squadron. After a bit of improvisation from Loran, he managed to convince Zsinj into committing more of his forces to the plan. The trap ended with a New Republic victory at the Battle of Ession."}, {"tag": "p", "text": "Despite the appearance of Rogue Squadron performing the mission, Antilles assured his squadron that they would receive the credit on the official records as soon as their mission is over and the files declassified."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}