{"url": "Raid_on_New_Cov", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Churba sector", "Category:Battles of the Thrawn campaign"], "nodes": [{"tag": "h1", "text": "Raid on New Cov"}, {"tag": "p", "text": "The Raid on New Cov was a small Imperial attack launched by the forces of Grand Admiral Thrawn to capture Luke Skywalker and Han Solo."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In order to find Delta Source, the believed source in the New Republic that is spying for Thrawn, and prove the innocence of Admiral Ackbar, Han Solo, Lando Calrissian and Luke Skywalker tried to find evidence at the planet New Cov. They chose to go to New Cov because it was one of the only planet the Bothans defended personally during the entire Galactic Civil War."}, {"tag": "h2", "text": "The Mission"}, {"tag": "p", "text": "At Ilic, they first discovered the presence of Tav Breil'lya, one of Senator Borsk Fey'lya's advisers, and believed that he was a traitor to the New Republic for Thrawn, and is thus a primary suspect for Delta Source. They followed him and met the contacts of the Bothan: Irenez and Sena."}, {"tag": "p", "text": "But before Han, Lando and Luke could find any real evidence to whether or not Fey'lya's adviser was a traitor, Grand Admiral Thrawn's forces had arrived on the planet."}, {"tag": "p", "text": "The Imperial forces regularly raided Ilic to obtain drugs and medicines—a cover for the city's clandestine payments to the Empire—but they discovered the Lady Luck and Luke's X-wing and consequently the presence of the former Rebels. Some Stormtroopers tried to catch them in the hangars but they eventually managed to escape in their starships,"}, {"tag": "h2", "text": "Space Battle"}, {"tag": "p", "text": "In space, Luke engaged the TIE fighter with his X-wing while Han and Lando tried to escape the system in the Lady Luck. They were saved by a third party with the arrival of three Dreadnaught-class heavy cruisers"}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Luke Skywalker left them to go to Jomark in order to meet Joruus C'baoth."}, {"tag": "p", "text": "Meanwhile, Han Solo and Lando Calrissian were taken by a Dreadnaught cruisers to an unknown location, Peregrine's Nest, where they meet the legendary General Garm Bel Iblis, one of the initial founders of the Alliance to Restore the Republic. The Bothan Tav Breil'lya was in fact on New Cov to organize a meeting between Borsk Fey'lya and Bel Iblis with the aim to rally him to Fey'lya's political faction."}, {"tag": "p", "text": "Han Solo and Lando later convinced Garm Bel Iblis to join the new Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}