{"url": "Raid_on_an_Imperial_heavy_freighter", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Raid on an Imperial heavy freighter"}, {"tag": "p", "text": "During the Galactic Civil War, in 3 ABY, the Rebel Alliance's 61st Mobile Infantry undertook a raid on an Imperial heavy freighter."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3 ABY, following a victory at Coyerti, the 61st Mobile Infantry was attacked at the edge of the Metatessu sector by an Imperial Destroyer. Their CR90 corvette, the Thunderstrike managed to escape under the cover of its escort, the Braha'tok-class gunship Apailana's Promise."}, {"tag": "p", "text": "Thirty hours later, they were ambushed by an Arquitens-class light cruiser and a Squadron of TIE Fighters. The Thunderstrike and Apailana's Promise decimated the attacking force with ease and moved on, only to be attacked again nineteen hours later in the Chonsetta system. A squadron of TIE Interceptors ravaged the port side of the 61st's troop transport."}, {"tag": "p", "text": "The Thunderstrike's chief of engineering, M2-M5, deduced that they were being tracked through a leakage in the Thunderstrike's hyperdrive. So Everi Chalis, the former Governor of Haidoral Prime, planned to get the Thunderstrike the resources it needed for repairs."}, {"tag": "h2", "text": "The Raid"}, {"tag": "p", "text": "The Thunderstrike and Apailana's Promise went to the Redhurne system where the Empire had been mining for sometime. There, they ambushed an Imperial heavy freighter and launched boarding pods at the ship. Each boarding pod carried a squad of Rebel troopers and once inside the ship, they began tearing through the defending stormtroopers. Sergeant Fektrin led a trio of engineers to help extract the resources they needed. One of Fektrin's soldiers, an alien named Cappandar, took a dozen shots before hitting the floor. Meanwhile, Sergeant Maximian Ajax's squad formed a blockade to contain the flow of defenders in the ship and Sergeant Zab and Carver's heavy fire teams stormed through more doors."}, {"tag": "p", "text": "The Thunderstrike shot at the heavy freighter in intervals to keep the ship wary but the battle soon got desperate when an Imperial Gozanti-class cruiser arrived in the system and began to approach the battle. Captain Micha Evon gave the squad five minutes to get back to their pods. Ajax's squad soon found themselves backed into a corner. First Sergeant Hazram Namir's squad were able to free Ajax's men but not Ajax. The man died with a grenade in his hand shouting obscenities. Fektrin's squad were scattered and the stormtroopers tried to pick them off, killing Fektrin. Charmer's squad made it back to the pod and soon did the others. Namir took Fektrin's pod back to the Thunderstrike and once all of the survivors had returned, the Thunderstrike and Apailana's Promise jumped out of the system."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The 61st lost eight soldiers in the battle, but they had the supplies needed for repairs. The Thunderstrike and Apailana's Promise took some shots escaping the battle and the Apailana's Promise had drained its shield generator. The two ships went to a flotilla in the Elochar sector where they underwent repairs until Imperial spies infiltrated the Thunderstrike and killed the officers onboard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}