{"url": "Raid_on_Chelloa", "categories": ["Category:Legends articles", "Category:Battles of Chelloa", "Category:Battles of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Raid on Chelloa"}, {"tag": "p", "text": "The Raid on Chelloa was the second stage of Operation Influx—a Jedi hit–and–run operation against the Sith in 1032 BBY during the New Sith Wars. Operation Influx aimed to disrupt the Sith warlord Daiman's extraction and export of baradium on Chelloa. Baradium was a volatile compound used in the manufacture of munitions including thermal detonators. Chelloa was exporting baradium to Daimanite war forges near the front lines. Since the Jedi feared that the baradium lode would provide Daiman with a tactical advantage that would allow him to end the stalemated civil infighting in the Grumani sector, Jedi Master Vannar Treece advocated knocking a portion of the Chelloan export offline. For Operation Influx, Treece recruited a volunteer force of several Jedi including his former apprentice Kerra Holt, who had recently passed the trials to become a Jedi Knight."}, {"tag": "p", "text": "The Chelloan resistance led by the undercover former Knight Gorlan Palladane had supplied the Jedi with intelligence about Daiman's baradium mining operations. The Jedi strike team landed at the spaceport in the town of Jenith and overwhelmed a small Daimanate security force with the assistance of local miners who were members of the resistance. Their attack was interrupted by the arrival of Sith Lord Odion's forces which had deployed a kinetic corruptor, which ignited a large area and killed many Jedi, Daimanate guards and miners. Vannar himself was slain during a duel by Odion with Kerra being the sole Jedi survivor. Gorlan managed to evacuate several of the survivors including Kerra to Jenith. From that point, Kerra was forced to operate undercover within Daiman's realm. This skirmish on Chelloa effectively terminated Operation Influx while giving Odion a foothold in the Chelloan system. Kerra's later operations on Chelloa became subsumed into the Chelloan affair."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "During the Republic Dark Age, the New Sith disintegrated into several factions including the Chagras Hegemony. These factions fought the Galactic Republic and the Jedi Order in a protracted and stalemated war. In 1040 BBY, the Hegemony had collapsed into several warring factions led by rival Sith Lords such as Daiman and Odion. By 1032 BBY, the planet Chelloa in the Grumani sector had became an exporter of baradium, a substance used in the production of munitions, for Daiman's war effort against both the Republic and his estranged brother Lord Odion, the ruler of a rival Sith princedom called the Odionate. This mining operation was dangerous and he utilized slave labor during the extraction efforts."}, {"tag": "p", "text": "Daiman's mining operations attracted the attention of the Jedi who dispatched a mission of Jedi Knights under Vannar Treece to disrupt shipping and to liberate the slaves. Master Treece devised a three–stage operation called Operation Influx. Firstly, his Jedi strike team would infiltrate the Daimanate transport hub on Oranessan. There, the Jedi would steal one of the massive ore transports that regularly traveled to Chelloa. Secondly, the Jedi team would launch a lightning raid on Chelloa to disrupt a portion of the baradium being shipped to Daiman's munitions factories near the front lines. Thirdly, the Jedi team would depart Chelloa via a direct hyperspace lane to neutral space where they would find their way back to the Galactic Republic."}, {"tag": "p", "text": "Due to the weakened state of the Republic's finances, Treece had personally raised the funds for the trip and recruited the Jedi volunteers. The operation was a hit-and-run raid aimed at sabotaging the export of baradium from Chelloa. With the supplies to the frontline cut, the Jedi hoped to forestall Daiman's ambitions of galactic domination. Gorlan Palladane, a relief-worker and former Jedi, had supplied the Jedi with intelligence on Daiman's baradium mining operation. To communicate with his Jedi counterparts offworld, Palladane and the local Rodian mechanic Skodo had activated one of the dormant hyperspace relay networks within the Chelloan system. Unknown to the Jedi, their transmissions had been intercepted by Lord Odion. Despite being brothers, both Sith Lords hated each other with the insane Daiman viewing himself as the Creator of the universe with Odion being seen as the \"evil\" Destroyer. Meanwhile, Odion was the leader of a Sith death cult that glorified death and destruction as a means of bringing peace to himself."}, {"tag": "p", "text": "The first stage of Operation Influx went well without any serious delays. The Jedi traveled to Oranessan on one of their own starships. While descending, they shot down a small Daimanate personnel shuttle. Master Treece, the Jedi Knight Kerra Holt and two other Jedi including the Celegian Dorvin Eltrom then went to the wreckage and retrieved several cloaks and identification badges from the dead flight crew. Posing as pilots, the Jedi advance team killed a party of Daimanate sentries and then commandeered an empty Daimanate Heavy-Lift Starcrosser from the Sith transport landing zone. After giving the signal for the other Jedi to enter the transport, the Jedi planned to use the transport to take them to Chelloa, but discovered that the transport's navigation computer was missing its activation cylinder. Holt stole a replacement cylinder from a nearby hangar, and after fitting the device, the Jedi departed Oranessan."}, {"tag": "h3", "text": "The raid on Jenith"}, {"tag": "p", "text": "Daiman's slaves were loading crates of baradium onto cargo liners destined for the war effort under the supervision of several Sith troopers. During the process, Treece's Jedi team used their Starcrosser cargo liner to ram into several waiting liners, igniting several baradium crates and creating chaos among the Sith ranks. With the aid of the enslaved workers, the disembarking Jedi quickly overwhelmed the Sith defenders before attending to the wounded. Amidst the fighting, Treece sent Kerra to reconnoiter with Gorlan Palladane in the South Work Yard. She arrived just in time to save him and his companions from being executed by a T'surr Sith trooper and his Human colleague. Despite a warm reunion between Treece and his old friend Gorlan, tensions simmered when Gorlan realized that Vannar's mission was actually a \"filibustering raid\" rather than a mission to evacuate the Chelloan people. As a compromise, Treece agreed to evacuate those Chelloans who were willing to come with them to Republic Space. Meanwhile, the other Jedi began demolishing the spaceport facilities."}, {"tag": "p", "text": "However, this short-lived victory was interrupted by the arrival of Lord Odion's forces above Squatter's Hill. Odion's forces included a massive kinetic corruptor, a massive mobile machine capable of igniting baradium deposits. During the fighting, Odion's forces overwhelmed the unsuspecting Jedi team. Master Treece and the Jedi Knight Kerra engaged Lord Odion in a lightsaber duel. During an interval in the duel, Treece sent Kerra away to carry out her mission to evacuate the Chelloan slave miners they had encountered. Kerra returned to the freighter only to discover that Gorlan was reluctant to leave because he still had a family in Jenith. Gorlan also stressed that there were still sixty thousand people in the slave cities of Chelloa and he was still needed as the de facto leader of the Chelloan resistance. Upon learning this fact, Kerra correctly deduced that Odion was trying to destroy Chelloa since it was too far from his supply lines to defend effectively. She then reentered the fray in an attempt to kill Lord Odion."}, {"tag": "p", "text": "Meanwhile, Vannar's duel with Odion brought the two men on top of automated repulsorlift platform. Meanwhile, the Kinetic corruptor began its activation process. Kerra interrupted the duel and attempted to stop the Kinetic corruptor by damaging its cables. However, Odion hurled the young Jedi onto the repulsorlift platform. During a break in the fighting, Vannar ordered his former apprentice to carry out her orders to evacuate the civilians. Amidst the fighting, Odion's kinetic corruptor generated a large explosion which destroyed much of the surrounding area and killed many assembled workers and combatants. While Treece was distracted, Odion took the opportunity to kill him with his lightsaber. Kerra was recovered by Gorlan who took her aboard the Starcrosser transport which was protected from the resulting magma flow due to its distance from the site. As a result of Odion's attack, Treece's entire Jedi expedition with the exception of Kerra were killed in the molten explosion."}, {"tag": "h3", "text": "Behind enemy lines"}, {"tag": "p", "text": "Gorlan Palladane, Kerra Holt, and several workers managed to escape the kinetic corruptor's explosion by sheltering inside cargo liner. Following Odion's attack, Kerra and Palladane began to attend to the wounded including both slaves and Sith troopers. The blast created by the kinetic corruptor had ignited the vast baradium deposits beneath Jenith's surface. While the survivors began attending to the wounded, Lord Daiman arrived on a repulsorcraft. Ignoring the plight of his subjects, Daiman demanded to see Palladane, the leader of the Jenith workers. Palladane pleaded for help in treating the wounded but Daiman was more concerned with wanting to know how his rival Odion and the Jedi discovered his secret baradium mining operations. When Palladane expressed his ignorance of the matter, Daiman used Force choke to strangle the former."}, {"tag": "p", "text": "However, Kerra intervened and tried to force Daiman to stop tormenting Palladane at gunpoint. Amused by her courage and dismissing her as an orphan, Daiman relinquished his grip on Palladane and fondled with her. He mockingly told her to embrace her anger as a diversion and released her since he was preoccupied with the threat of Odion to his goals. Showing little concern for the well-being of his subjects, Daiman ordered them to erect up one of his statues in the village square before dismissing the crowd. Following Daiman's departure, Palladane held a public meeting outside his Jenith home, instructing his fellow workers to use the runoff water from the electric fuel cells on the excavators for basic consumption like washing food, clothes and bathing. Consumed by hatred for the Sith, Kerra embarked on a mission to assassinate Lord Daiman."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Raid on Chelloa first appeared in Knight Errant: Aflame 1 which debuted on October 13, 2010. As a plot device, it introduced the main characters of the comic series including Kerra Holt, Gorlan Palladane, Daiman, and Odion. It also acted as the exposition of the plot of the comic arc which was told from the point of view of Kerra Holt. The battle also introduced several new plot elements including the planet Chelloa, the particle baradium, and the kinetic corruptor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}