{"url": "Raid_on_Spacestation_1138", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Occupation of Karthakk"], "nodes": [{"tag": "h1", "text": "Raid on Spacestation 1138"}, {"tag": "p", "text": "The Raid on Spacestation 1138 was an attempt made by Nym, leader of the Lok Revenants, to rescue prisoners, Captain Orsai in particular, on board the infamous prison called Spacestation 1138."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The pirate band Lok Revenants was engaged in a struggle against the Trade Federation for control of the Karthakk system. After joining forces with the Revenants, Nym agreed to rescue prisoners. But first they had to find them in a raid on a Federation base. After learning the location of the infamous space station, they set a course for it."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The strike force arrived with codes stolen from a Trade Federation outpost on Maramere. Jinkins entered the codes into the station, allowing Captain Orsai and his crew to escape and break into an armory. Meanwhile, Nym, Jedi Master Adi Gallia and the others destroyed the station's anti-starship and anti-starfighter laser turrets because the Liberator, piloted by Kole, could not approach without being targeted by the defenses. The station attempted to destroy the Liberator by sending Scarab starfighters and Droid starfighters."}, {"tag": "p", "text": "Jinkins' codes unwittingly activated a number of B1-Series battle droids that subsequently pinned down Orsai and his men. Orsai told Nym to destroy the airlock door to send them flying into space. Nym complied, and the droids were blown out of the hangar."}, {"tag": "p", "text": "When the rest of the station's defense was eliminated, the Trade Federation sent troop transports with droid starfighter escort to reinforce the station. Despite the fighter escort, the troop transports were all destroyed one by one before they could dock."}, {"tag": "p", "text": "Orsai then met some Neimoidian support staff who attempted to stall the prisoners. The Neimoidians, however, weren't brave enough to risk their own lives and didn't put up much resistance. Eventually, the prisoners got onto the Liberator, and with a friendly starfighter escort the Liberator escaped into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although the mission was a success, Adi Gallia knew with the Trade Federation sensor station still online they would be soon be under attack again. Jinkins calculated two probable locations for it, and Nym decided to go for the nearest one to search for and if necessary destroy it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This article was created based on a mission in the video game Star Wars: Jedi Starfighter. The name of the station itself is yet another reference to THX 1138."}, {"tag": "h2", "text": "Appearances"}]}