{"url": "Raid_on_Polis_Massa", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Battles in the Outer Rim", "Category:Battles of Operation Skyhook"], "nodes": [{"tag": "h1", "text": "Raid on Polis Massa"}, {"tag": "p", "text": "The raid on Polis Massa was a large skirmish between the Galactic Empire and the Alliance to Restore the Republic on the mining asteroid colony of Polis Massa. This colony was being used by the Rebels in the early days of the Galactic Civil War in 0 BBY."}, {"tag": "h2", "text": "Prologue"}, {"tag": "p", "text": "When cleaning up after the seemingly minor Death Star Uprising, the Empire had discovered that a few Rebels were able to transport vital information on Imperial plans away from the Death Star. Imperial Intelligence uncovered an active Rebel base on Polis Massa and Darth Vader decided to send troops from his elite fighting legion, the 501st Legion, to recover the plans there before the Rebels could decode them."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Once the 501st Legion arrived at the asteroid base, they executed their raid, taking control of the Rebel radar facility effortlessly."}, {"tag": "p", "text": "Next, they attempted to storm an elevated command room where the holodisk, supposedly holding the stolen plans, had been located. However, approaching the stairs to the room, dozens of Rebels, including Wookiee warriors, swarmed the hallway at the base of the stairs, killing nearby stormtroopers. A new Imperial wave cut down the exposed Rebels in short order."}, {"tag": "p", "text": "The data was then removed from the disk and uplinked to the Imperial systems while the 501st were forced to hold strong the radar-communications facility which was now surrounded on all sides by Rebel soldiers."}, {"tag": "p", "text": "Meanwhile, Imperial agents analyzing the data on the holodisk were shocked to discover it was a decoy. The 501st were left entirely cornered in the radar area."}, {"tag": "p", "text": "Rebel charges were held off until the uplink was complete. When the 501st were contacted about the questioned legitimacy of the holodisk—now fighting for a lost cause and without further orders—their leaders commanded the men to fight on nevertheless. The tides turned miraculously and the 501st, in an astounding maneuver, broke free and scattered into the rest of the base."}, {"tag": "p", "text": "While regrouping in different sections of the base, the 501st Legion was thankful to be at last given further instructions: they had to destroy a databank, in an area called the Cavern, which the Rebels were using to eavesdrop on the Empire's transmissions. Determined to stop this, the stormtroopers of the 501st fought their way deep into the base and destroyed the databank."}, {"tag": "p", "text": "Secretly, exhausting stealth work by Bothan spies on the Rebel side had enabled them to beam the plans out of the Empire's grasp once again, substituting them with the copies on the holodisk."}, {"tag": "p", "text": "However, with no other objectives, the 501st Legion at least wanted to crush the Rebels of this base—the insurgents who had humiliated their legendary reputation in an obvious ambush—and escape from the asteroid with their lives. In the end, both would occur."}, {"tag": "p", "text": "Rebel and Imperial sides piloted the same AAC-1 Hovertanks in the outside perimeters of the base until Rebels captured the central hangar. Always prepared, stormtroopers raided the hangar furiously, though, and it was firmly secured."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "When the fighting died down, 501st officers now realized how much they had really diminished the Rebel defenders. With just a few more firefights, the base had been eradicated of Rebels completely. The conquered stronghold was not occupied for much longer, however, before the 501st shut it down and were shipped off on another mission to the Tatooine system."}, {"tag": "p", "text": "It was not too long later that a rogue ambassador CR90 corvette, Tantive IV of Alderaan, had been traced by the Empire-acquired holodisk and was suspected to be the location of the genuine plans. The Empire was not about to be fooled again. Darth Vader would be leading the next attack personally."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raid on Polis Massa first appeared in the Pandemic Studios video game Star Wars: Battlefront II, which was released on November 1, 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}