{"url": "Raid_on_The_Spike", "categories": ["Category:Legends articles", "Category:Battles in the Grumani sector", "Category:Battles of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Raid on The Spike"}, {"tag": "p", "text": "The Raid on the Spike was a battle of the Republic Dark Age in 1032 BBY during the Chelloa campaign that took place on the space station The Spike. It pitted two rival Sith factions against each other: Sith Lord Daiman's Daimanate and his estranged brother Sith Lord Odion's Odionate. The battle also involved the Jedi Knight Kerra Holt, the lone survivor of the illfated Operation Influx, who was determined to destroy both Sith Lords particularly Odion who had planned to deploy world-devastating Kinetic corruptors on Chelloa to harvest its vast baradium deposits."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "In 1032 BBY, the Sith Lord Daiman began baradium mining and shipping operations on the planet Chelloa in the Outer Rim's Grumani sector. The former Jedi Gorlan Palladane leaked intelligence on Daiman's operations to the Jedi Order which dispatched Jedi Master Vannar Treece to disrupt the baradium operations during Operation Influx. However, the transmissions were also intercepted by the rival Sith Lord Odion who desired to exploit Chelloa's baradium deposits while destroying the planet with kinetic corruptors. Despite initial successes on Oranessan, the entire strike team with the exception of Kerra Holt was wiped out on the Chelloan mining colony of Jenith during an attack by Odion."}, {"tag": "p", "text": "Daiman sought to find out the source of the leak, torturing to death the Rodian mechanic Skodo, a member of the Chelloan resistance and an associate of Palladane. However, he was attacked during a duel by Kerra Holt, who quickly learnt from Daiman of the threat of Odion to Chelloa. Odion's mobile space station The Spike was producing more kinetic corrupters, vast mobile superweapons capable of releasing baradium gases by igniting veins on the surface of Chelloa. Driven by her animosity to the Sith in general and her determination to protect Chelloa's people, Holt ended her duel with Daiman and stole one of his starfighters."}, {"tag": "h3", "text": "Infiltration"}, {"tag": "p", "text": "Viewing Odion as a threat to his control of baradium extraction on Chelloa, Daiman dispatched a small strike force of Daimanate starfighters in an attempt to knock out The Spike. However, his light starfighters were wiped out by Odion's gunships which included his flagship the Sword of Ieldis. In the midst of the attack, Holt bailed out from her starfighter into space and infiltrated The Spike by entering through an open hatch. Discarding her spacesuit, she disabled a service droid and then made her way to the Pod Seventeen in the vast assembly area. There, Holt overpowered a labor droid known as GAD-3 and then reset his motivation center."}, {"tag": "p", "text": "In exchange for Kerra fixing back his robotic arms, Gad-3 revealed learnt that The Spike was dedicated solely to the production of kinetic corruptors and that all floors were decentralized from the main structure for security reasons. Gad-3 then added that Holt should not have come alone. At that moment, they were interrupted by the arrival of Odion and his Givin second-in-command Jelcho to Pod Seventeen. However, he did not sense them initially since they were hidden under the catwalk. Odion was preoccupied with using his corrupters to extract Chelloa's baradium deposits."}, {"tag": "p", "text": "When Odion inquired about Daiman's movements, Jelcho informed him of an informant that supplied intelligence on the existence of Daiman's baradium operations. From a recorded transmission, the informant claimed that all of Daiman's mining operations were permanently offline in an attempt to draw Sith attention away from Chelloa. However, Odion dismissed the informant's latest reports as an attempt by Daiman or other parties to undermine his planned baradium operations. Meanwhile, Holt released GAD-3 and sent him back to his station with instructions to open another door when she gave the signal."}, {"tag": "p", "text": "Odion then concluded the meeting by ordering all his kinetic corrupters to be prepared for landing on Chelloa to harvest all the baradium. Due to the volatile nature of baradium, much of Chelloa would be destroyed and rendered uninhabitable. While gloating of his recent victory over the Jedi particularly Master Treece, Odion suddenly sensed the presence of an intruder through the Force. In a fit of rage, he ripped apart the catwalk and discovered Holt."}, {"tag": "h3", "text": "Jedi versus Sith"}, {"tag": "p", "text": "Brushing away Jelchro's concerns that he would damage the space station's infrastructure, Odion pursued Holt in a heated lightsaber duel. Kerra was also pursued by a mob of armed Gamorrean guards, followers of Odion who craved dying in combat. The fighting led the combatants through a series of catwalks to the upper levels of the Spike, the main structure supporting the various assembly lines. In a verbal confrontation, Kerra told Odion that she had attacked him aboard his space station to drive him away from Chelloa thus saving the lives of thousands of sentients. She also revealed that Daiman's mobile munitions factories were bringing in thousands more slaves by the day."}, {"tag": "p", "text": "Odion shrugged away Holt's concerns for innocent lives, arguing that all sentients existed only to be killed by him. Due to his nihilistic philosophy, Odion saw himself as the destroyer of all life in the galaxy and embraced death. As he prepared to strike Holt down with his lightsaber, she played her final card by ordering the reprogrammed Gad-3 to open all containment fields, thus opening much of the space station to zero-gravity space. This triggered an explosion that wrecked large areas of The Spike, destroying many labor droids and killing many workers. Further destruction was averted only by Jelcho reactivating the emergency shielding. As with all Givin, Jelcho had a tough exoskeleton that could seal all external orifices for protection against depressurization, allowing him to survive in hard vacuum."}, {"tag": "p", "text": "In the midst of the chaos, Holt hijacked a construction shuttle, incapacitating the pilot and then fleeing into space. Meanwhile, Odion ordered his entourage back to his flagship Sword of Ieldis. Understanding his Jedi opponent, Odion knew that Holt would return to confront him which was proven right. In an ensuing cat-and-mouse race in space, Holt's shuttle engaged Odion's gunship. Anticipating that Holt was going to ram her shuttle into his ship, he ordered his crew to open fire. However, the duel was interrupted by an incoming transmission from Lord Daiman."}, {"tag": "p", "text": "In a live broadcast from his Chelloan headquarters, a furious Daiman revealed to Odion that he had seized and tortured his informant: Gorlan Palladane. In response to the intelligence leakage, Daiman had ordered a military crackdown on all mining settlements on Chelloa with his troops razing and pillaging the homes of the masses. Witnessing the plight of her friend, Holt aborted her run by doing a quick jump into hyperspace. To the relief of Jelcho, Odion chose to spare his crew due to the intelligence on Daiman's mining operations he had learnt from Holt. Rather than using his kinetic corruptors to destroy the surface of Chelloa, he ordered his elite Lightning Guard to be loaded into landing ships to counter Daiman's war forges near the baradium mines. He also planned to conquer Chelloa and annex to his interstellar principality—the Odionate. Meanwhile, Holt returned to the mining settlement of Jenith in an attempt to protect Palladane's family from Daiman's retribution."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}