{"url": "Raid_on_Yirt-4138-Grek-12", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Fakir sector", "Category:Battles of the Separatist Crisis"], "nodes": [{"tag": "h1", "text": "Raid on Yirt-4138-Grek-12"}, {"tag": "p", "text": "In 22 BBY, during the Separatist Crisis, the Corporate Alliance conducted a raid against a group of slicers on an asteroid named Yirt-4138-Grek-12. Upon learning of a secret slicer compound on the asteroid used to supply espionage agents who were stealing data from the Corporate Alliance, the corporation deployed its NR-N99 Persuader-class droid enforcers on the asteroid, and the droid tanks attacked the base. Following the attack, twenty-five slicers lay dead, and the base was annihilated. While some senators of the Galactic Republic believed the attack to be excessive, it nonetheless fell within legal boundaries."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Separatist Crisis in 22 BBY, a secret industrial espionage training center was located on a remote asteroid named Yirt-4138-Grek-12 in the Corporate Alliance–controlled Fakir sector. The base was used to supply and train industrial espionage agents by building them starships and performing cybernetic surgeries on them, thus turning them into cyborgs. The base's operations were unauthorized by the Galactic Republic and, as such, were kept hidden by the parties who funded the facility."}, {"tag": "p", "text": "One of the base's agents was Denlace Sachoore, a twenty-four-year-old female who underwent surgery and came out with a cranium-implanted vessel drive. However, while working as a Corporate Alliance clerk, she was caught embezzling corporate data in the vessel drive and was questioned by Corporate Alliance expeditors. Approximately a month later, the source of her training and surgery was traced to Yirt-4138-Grek-12, and the facility was discovered. Viewing the base as a potential threat to corporate revenues, the Corporate Alliance Directorate, led by Magistrate Passel Argente, decided in a 7–2 vote that instant eliminating actions were required."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "The Corporate Alliance sent transports containing NR-N99 Persuader-class droid enforcers to Yirt-4138-Grek-12, deploying them ten kilometers from the base. The droid tanks then proceeded to travel across the asteroid to the facility, where they breached the pressurized structure by using their laser and missile weaponry, and, as a result, twenty-five cybernetically-enhanced data thieves perished inside the base, which was completely destroyed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the raid, Argente dispatched a holomessage to Corporate Alliance shareholders, in which he explained the details of the raiding mission and assured that the corporation would do everything it could to protect its business interests. The raid was later reported by HoloNet News. While the raid was perfectly legal, as it took place in Corporate Alliance space, a number of senators of the Galactic Senate, including Senator Gopple of Erigorm, objected to the attack, believing that the use of armored tank droids was too extreme."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raid was first mentioned in the in-universe HoloNet News Vol. 531 #48 article Corporate Alliance Attacks Slicer Compound, part of the HoloNet News volume released on March 21, 2002."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}