{"url": "Raid_on_Golrath_Station", "categories": ["Category:Legends articles", "Category:Battles in the Outer Rim", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Raid on Golrath Station"}, {"tag": "p", "text": "The raid on Golrath Station was a battle between the Galactic Empire and the Rebel Alliance in 3 ABY for control of a former Rebel base, Golrath Station."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After the Rebel Alliance abandoned their base on an abandoned magma smelting plant on Golrath, the Galactic Empire took control of the facility known as Golrath Station. It was later discovered by the Alliance that the bedrock that comprised the station's foundations harbored several strange characteristics. When heated, the mineral compounds absorbed ambient light rays, but when it cooled, it released those rays, playing them back in the form of a hologram. Fearing these images could reveal Alliance secrets to the Empire, Princess Leia Organa ordered an immediate assault on Golrath and the destruction of the former Rebel base."}, {"tag": "p", "text": "Recently demoted Imperial Lieutenant Mils Giel discovered the rock's properties while leading a small group guarding the base and ordered a contingent of TIE fighters to defend Golrath Station if the Rebels returned."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Two starfighter squadrons led by Commander Luke Skywalker and Captain Hanc Thorben, and composed of X-wings and Y-wings, launched from Haven Base on Arbra. Among the fighters was Princess Leia piloting a Y-wing. Upon arriving at Golrath, the Rebel fighters engaged the TIE fighters in battle above the surface, hoping to draw them northward, away from the station to allow for an infiltrator to enter the facility and destroy it."}, {"tag": "p", "text": "As the TIEs were drawn away, Princess Leia exited her craft in midair, flying to the surface with a parabelt, and entered the base. She headed for the reactor core, making her way past stormtroopers and coming face to face with Lieutenant Giel. Considering the Princess' death more valuable to the Empire than the information Golrath Station may have held, Giel set the base's reactor to overload. His ploy failed when Leia made her escape and was picked up by Lando Calrissian's Y-wing flying past the facility."}, {"tag": "p", "text": "The overload of the reactor was irreversible and Giel was forced to flee, but not before angrily firing at a passing X-wing with his blaster pistol. Golrath Station was destroyed and the remaining Rebel fighters escaped."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Giel's stray blaster shot made contact with the engines of Luke Skywalker's X-wing fighter, causing enough damage to prevent Skywalker from escaping into hyperspace with the rest of the fleet. He eventually escaped the Imperial fighters and was forced to land on the planet Beheboth before finally returning to Arbra. Unknown to the Rebels at the time, Giel's vessel also sustained damage during the battle, forcing him down on Beheboth where he would be stranded for the next five years."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}