{"url": "Raid_on_the_Armand_Isard_Correctional_Facility", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Raid on the Armand Isard Correctional Facility"}, {"tag": "p", "text": "A raid was attempted in 43.5 ABY by rogue Jedi Seff Hellin to free Jedi Knight Valin Horn from the Armand Isard Correctional Facility, a Galactic Alliance prison. The two Jedi were affected by the same psychosis—an illness which caused the affected being to believe that everyone they knew had been replaced by impostors except for other beings that suffered from the disease. Hellin hoped to free Horn, who had been encased in carbonite and placed in the prison. The Galactic Alliance hoped to capture Hellin, while Darkmeld—a covert organization formed by Knight Jaina Solo to counter Chief of State Natasi Daala's efforts to weaken the Jedi Order—hoped to capture the Jedi as well, in order to study the disease."}, {"tag": "p", "text": "As his raid began, Hellin was attacked by two Darkmeld members—Imperial Remnant Head of State Jagged Fel and bounty hunter Tahiri Veila. He managed to defeat them, but the two attacked again, and Hellin was forced to abandon his goal. As he left the prison, Hellin was caught by Galactic Alliance bounty hunters Dhidal Nyz and Zilaash Kuh, who were serving in Daala's special-missions force. Solo, however, seized him from the bounty hunters, and loaded him into a speeder piloted by Darkmeld affiliate Mirax Terrik Horn, Valin's mother. A speeder chase ensued, and the bounty hunters and several security speeders pursued them, but Darkmeld managed to shake off all of their pursuers. Hellin was taken to the Jedi Temple on Coruscant, where he was to be studied in secret by Mon Calamari Jedi healer Cilghal."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 43.5 ABY, Jedi Knight Valin Horn suffered a psychotic breakdown, which caused him to believe that everyone he knew—except for other beings suffering from the same disease—had been replaced by impostors. He dueled his father, Jedi Master Corran Horn, and attempted to flee, but was stopped by his family and placed in the Jedi Temple. Horn escaped later that night, but after a destructive rampage he was finally captured and placed in the Mon Mothma Memorial Medical Center. After Jedi Grand Master Luke Skywalker's trial and exile for failing to prevent his nephew Jacen Solo's descent to the dark side of the Force, Horn was moved back to the Jedi Temple, but he was eventually taken by the Galactic Alliance—who didn't trust the Jedi to have custody of Valin Horn—frozen in carbonite, and placed in the Armand Isard Correctional Facility, a prison on Coruscant."}, {"tag": "p", "text": "Rogue Jedi Seff Hellin, who suffered from the same disease, felt compelled to free Horn, as he believed that Horn was the only being he knew that had not been replaced by an impostor. Hellin was spotted outside the prison by former Jedi Knight and Sith apprentice Tahiri Veila, who—in the years since the Second Galactic Civil War—had become a bounty hunter. She was also a member of Darkmeld, a secret organization formed by Jedi Knight Jaina Solo to counter Galactic Alliance Chief of State Natasi Daala's efforts to undermine the Jedi Order. Veila informed Solo of the sighting, and they instantly realized that Hellin's intention was to break Horn free. They also realized that if they could capture Hellin, they would be able to study the disease, and hopefully develop a cure for it."}, {"tag": "p", "text": "Hellin created an intricate plan to enter and exit the prison undetected. As a last-minute addition, Solo and Imperial Remnant Head of State Jagged Fel decided to include Mirax Terrik Horn, Valin's mother, to their group of conspirators in order to make use of her contacts, skills, and funds. Terrik Horn would have to keep the group's existence hidden from her husband, Corran Horn, because the Jedi Masters were not supposed to know of the organization so that—if they were ever questioned by the Galactic Alliance—they could answer truthfully that they knew nothing about Darkmeld."}, {"tag": "h2", "text": "The raid"}, {"tag": "h3", "text": "First confrontation"}, {"tag": "p", "text": "Hellin burned a hole in the permacrete above a riot raid tunnel outside the prison. The tunnel had two points of access: a law enforcement station and the prison, but the side that was connected to the prison could not be opened. A few days later, Hellin put his plan to free Horn into motion. He went into the tunnel, where he was intercepted by Veila and Fel. Hellin believed Veila to be an impostor, and because of Fel's distinctive armor, Hellin thought Fel was a Mandalorian. Hellin attacked them, sending Fel flying backwards with the Force."}, {"tag": "p", "text": "Hellin and Veila began a lightsaber duel, and Fel stood and shot a stun bolt at Hellin, who deflected the shot into Veila's leg. Next, Hellin turned and ran for a blast door that led into the prison and threw a thermal detonator at Veila. Fel picked up Veila and took off running down the tunnel. Hellin Force-pushed the detonator, keeping it rolling after them. When Fel and Veila were far enough away that Hellin believed the blast would not kill them—he had not come to kill imposters, merely to free Horn—Hellin triggered the detonator. Hellin knew that the blast would make the prison guards think that there had been a fuel explosion outside the prison, or that someone was trying to break free; so his entry would—at least, temporarily—remain a secret. Hellin then began to melt through the blast door with his lightsaber."}, {"tag": "p", "text": "Fel's Mandalorian armor protected him and Veila from the blast, and Darkmeld member and former Intelligence agent Winter Celchu called in to check on them. Fel informed her of the situation, and told Celchu to call the rest of Darkmeld to the prison."}, {"tag": "h3", "text": "Escape"}, {"tag": "p", "text": "As Hellin neared his goal, he was confronted by three security guards in a turbolift. He quickly incapacitated them and moved on, fuzzing holocams with the Force as he passed them. Hellin reached the room in which Horn was being kept, and began to melt his way through the blast door with his lightsaber. Veila, however, was not far behind, and reached the corridor outside the room. Veila began jumping up and down in front of one of the holocams in an attempt to draw all of the security guards to the area. Hellin quickly made it through the blast door and found the carbonite slab which held Valin Horn, but when he attempted to release Horn, an error code came up, setting off an alarm. Fel, whom Hellin still believed to be a Mandalorian, came through the door, and Hellin slashed at him with his lightsaber."}, {"tag": "p", "text": "Fel caught the blow on his beskar crushgaunts, and Hellin continued the attack, but failed to land a blow on anything but the impenetrable armor. Veila entered the room as well, and as he realized that he would not be able to fight off his combatants and be able to free Horn, Hellin Force-threw the slab of carbonite containing Valin at Fel and Veila. Veila dodged it, but Fel was not quite quick enough to get out of the way, and he was hit by the slab and knocked aside. Hellin then ran out of the room, leaving the carbonite slab in the doorway to block the exit behind him. He ran down the corridor to the turbolift shaft and jumped blindly in, dropping a few meters. Luckily for Hellin, the lift was above him, and it slowed to a halt at the corridor which he had just left behind. Several security guards looking for Hellin took to the corridor, slowing down Fel and Veila's pursuit."}, {"tag": "p", "text": "Hellin continued out through his escape route, returning to the tunnel which he had used to enter the prison, when—as he passed by the place where his thermal detonator had exploded—he was cut off by more security troopers. He Force-flung the debris created by the detonator blast at the troopers and charged them, quickly incapacitating them. He then took a blaster rifle from one and a pistol from another. As he made for his escape, Celchu attempted to cut Hellin off, and Hellin quickly shot her with a stun bolt from the rifle. Sensing the presences of many security guards closing in around him, Hellin made a break for a shaft to the surface."}, {"tag": "h3", "text": "Capture"}, {"tag": "p", "text": "Outside the prison, Terrik Horn arrived in a speeder she had stolen from outside her family's suite. She spotted Hellin escaping and flew towards him, but was sideswiped by a cargo hauler piloted by bounty hunter Zilaash Kuh, who was working for Natasi Daala's special-missions force. Kuh's Quarren partner, inventor and bounty hunter Dhidal Nyz, fired an electric net at Hellin, who attempted to dodge the shot. The net, however, was too large. It wrapped about Hellin and immobilized him, sending paralyzing electrical surges through his body every few seconds. The connecting cable from the net to the gun went taut, and Hellin was yanked into the air behind the moving cargo hauler."}, {"tag": "p", "text": "Solo arrived on the scene, having managed just minutes earlier to get away from Dab Hantaq, her Jedi supervisor—an agent that was tasked to keep track of a Jedi—and witnessed the bounty hunters' capture of Hellin. She contacted Terrik Horn—who was coming back around in her speeder—and told her to go after Hellin, who was being dragged along through the air. The cargo hauler passed over Solo, and she threw her lightsaber at the cable connecting the net to the gun and severed it. Hellin fell from the sky, still paralyzed by the electric net, and Solo slowed his fall with the Force, letting him hit the ground just hard enough to incapacitate him. Solo knocked Hellin out with a swift blow to his head with her lightsaber hilt. Terrik Horn quickly landed the speeder beside Solo, who lifted Hellin aboard and climbed in. The bounty hunters came around in pursuit, and four of the prison security's speeders took off after them. Not far behind, Veila and Fel—carrying with them the unconscious Celchu—quickly stole a speeder and joined the chase as well."}, {"tag": "h4", "text": "Speeder chase"}, {"tag": "p", "text": "Five security speeders—one piloted by Veila—and the cargo hauler now followed Terrik Horn and Solo. Terrik Horn took the speeder into a tunnel used for maintenance and waste haulers, while Veila quickly maneuvered past two of the security speeders, passing just above the second one so that her speeder's repulsor wash knocked the security speeder into the wall. The security speeder crashed to the tunnel surface, and Veila piloted up underneath the bounty hunters' cargo hauler. Fel—fighting the hauler's repulsor wash—slowly stood up and began destroying servos and repulsor nozzles with his crushgaunts. At last, he found an auxiliary energy cell, which exploded as he squeezed it, peppering him with shrapnel. Smoke poured from the area, and the cargo hauler slowed, falling behind Veila's speeder."}, {"tag": "p", "text": "Meanwhile, in the stolen speeder, Solo injected Hellin with a sedative. Turning back to the nearest pursuing security speeder, Solo Force-pushed it sideways into the tunnel wall, holding it there until the pilot was forced to decelerate and drop to the ground in order to keep control of the vehicle. She repeated this process twice more, until the only speeder remaining was that of Veila and Fel. Solo guided the group out of the maintenance tunnels to a small niche off of a major thoroughfare, where they parked the speeders."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After they parked, Celchu removed all forensic evidence from the two speeders so that they could not be traced back to any of them. Fel was returned to the Imperial Remnant embassy, while Veila, Terrik Horn, and Celchu met up with Tekli—a Chadra-Fan Jedi healer and Darkmeld affiliate—back at the speeder hangar of the Jedi Temple, where nearby Jedi Masters would be less likely to sense them. They met up with Solo, who had checked in with Hantaq, and was free of the supervisor once more. They took a turbolift to the second medical level, where Tekli opened up a special chamber which only she and fellow healer Master Cilghal were authorized to enter, and Tekli strapped Hellin to a bed inside."}, {"tag": "p", "text": "The next day, the raid was featured in the news. Suspicion fell upon the Jedi Order, but there was no hard evidence of the Jedi's involvement. Galactic Alliance Security forces, under the command of Captain Oric Harfard, arrived at the temple to take Hellin into custody, but since Solo had kept Darkmeld's actions secret from the Jedi Masters, acting Grand Master Kenth Hamner told them truthfully that he did not know where Hellin was. Terrik Horn and the non-Jedi members of Darkmeld also escaped scrutiny, as the only being who had been close enough to recognize any of them during the raid was Seff Hellin."}, {"tag": "p", "text": "Later, Hantaq revealed to Solo that he had guessed that she had taken part in the raid, but had no proof, and so planned to do nothing about it. Solo returned to the room where Hellin was hidden and found Cilghal inside. The Mon Calamari Jedi Master decided to help them run tests on Hellin in order to find out more about the disease from which he and Horn suffered."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raid was created by author Aaron Allston for Fate of the Jedi: Outcast, the first novel in the 9-part Fate of the Jedi series, released on March 24, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}