{"url": "Raid_on_the_Black_Sun_headquarters", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Desolator crisis", "Category:Missions to Coruscant"], "nodes": [{"tag": "h1", "text": "Raid on the Black Sun headquarters"}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the Sith Empire, the Coruscant Security Force's special tactical unit and a Jedi Knight raided the headquarters of the Black Sun crime syndicate on the Republic capital of Coruscant in order to rescue the scientist Doctor Eli Tarnis. Tarnis, the creator of the Planet Prison superweapon, had been kidnapped by Black Sun and taken to the gang's territory, and the former apprentice of Jedi Master Orgus Din—now a Jedi Knight on an assignment on Coruscant— was sent to rescue the scientist. With the aid of Sergeant Nidaljo and the special tactical unit, the Knight and the astromech droid T7-O1 successfully invaded the gang's headquarters, but instead of finding Tarnis, the Jedi discovered that Tarnis was in fact a Sith Lord. Together, the CSF and the Jedi defeated the Black Sun leader Salarr, and put a major dent in the syndicate's operations, and the Knight returned to the Senate Building determined to hunt down the traitorous Tarnis."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3643 BBY, during the Cold War between the Galactic Republic and the Sith Empire, the Sith Lord Tarnis—who was posing as a scientist working on the Planet Prison superweapon—felt that his undercover mission was threatened by the arrival of four Jedi on the Republic capital of Coruscant: the Jedi Masters Bela Kiwiiks and Orgus Din, Kiwiiks' Padawan Kira Carsen, and Din's recently Knighted former apprentice. Arranging for the Migrant Merchants' Guild crime syndicate to steal the Planet Prison's design files, Tarnis then staged his own kidnapping from the Senate Building with the help of the Black Sun syndicate in exchange for Imperial weapons and technology. After capturing the kidnappers' leader, a man named Zeer, following a standoff in the Coruscant Spaceport, Carsen and the Knight learned that the firefight had been a distraction while Tarnis was whisked away to Black Sun territory. The two Jedi alerted Agent Galen of the Republic Strategic Information Service, the Republic's intelligence agency, of the developments before returning to the Senate Building, and Galen immediately reached out to his contacts in the Coruscant Security Force (CSF)."}, {"tag": "p", "text": "At Galen's request, the CSF's special tactical unit diverted from their assignment of fighting Black Sun to gather information on the syndicate's headquarters and set up a perimeter around the building. However, Tarnis had never actually made it to Black Sun territory, as he had traveled to the territory of his allies in the paramilitary Justicars' Brigade instead. Back at the Senate Building, the two Jedi updated their Masters and General Var Suthra of the Republic Military on the situation. While the design files had been recovered earlier by the Knight, Galen's analysts had determined that the files had actually contained information on the entire Republic superweapon initiative and had been copied by Black Sun, putting the Republic's weapons projects at risk. As a result, Galen and the Jedi Masters decided to depart Coruscant in order to secure each of the three off-world weapons facilities, and Galen left all of his available resources at the Jedi Knight's disposal. Galen also notified the Knight of the location of the special tactical unit and told the Jedi to make contact with the unit's leader, Sergeant Nidaljo, as he would be able to help retrieve both the copied data files and Doctor Tarnis."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "While Carsen remained behind at the Senate Building, the Knight departed with an astromech droid companion, T7-O1, or \"Teeseven,\" and took an an air taxi to Black Sun territory. While the duo were fighting their way to Nidaljo's location in the Lower Gangland region, the special tactical unit was suddenly attacked by heavily armed Black Sun members, who overwhelmed the police officers and drove them into a nearby building, killing six of the unit's members in the process. Nidaljo's men set up a hasty barricade in an attempt to hold off the criminals, and the Knight's timely arrival saw the Jedi cut down the Black Sun attackers and grant the police a reprieve. Speaking with the Sergeant, the Knight learned what had happened, and the death of a seventh officer—a man named Jorin—during their conversation only served to dampen Nidaljo's spirits further."}, {"tag": "p", "text": "However, the Jedi was able to inspire the downtrodden CSF officers to continue their mission, and Nidaljo's men soon rallied to the Knight's call and prepared for an assault. While Nidaljo's men readied themselves for the attack, the Jedi and Teeseven took out the base's main security network and defenders near the front entrance, and both groups then launched assaults on the headquarters from opposite directions. When the Knight and Teeseven finally reached the command center, they found the leader of Black Sun—a Human named Salarr—speaking with a hooded Tarnis via holocomm. Listening to Tarnis, the Jedi learned that the scientist was in fact a Sith Lord, and that he had traded weapons and armor to Black Sun in return for them faking his kidnapping. Salarr was furious with Tarnis for betraying him, as he thought that the Sith had set him up, but Tarnis brushed aside the criminal's anger and warned the Jedi that Coruscant was already doomed. When Tarnis ordered Salarr to kill the Knight and ended the transmission, one of Salarr's men tried to shoot the Jedi in the back. However, Sergeant Nidaljo and two of his men arrived at that moment and dispatched the criminal before he could pull the trigger. The Knight greeted Nidaljo and ordered Salarr to surrender, but the gang leader attacked regardless. With the advantage of numbers, Nidaljo and the Jedi were able to defeat Salarr and the other criminals without further loss of life."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Nidaljo and his men celebrated briefly before the Knight was contacted by Carsen via Salarr's holoterminal. She had intercepted Salarr's holocall to Tarnis, and was astonished to learn that the doctor was a Sith. Carsen also had worse news—the Planet Prison that was in the lab was a fake, and Tarnis had stolen the real one. The Jedi ordered Carsen to trace the holocall, and the Knight and Teeseven returned to the Senate Building. Despite their victory, Nidaljo knew that his men could not hold the base successfully, and the unit retreated from the area."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raid on the Black Sun headquarters was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. It appears in the Jedi Knight class story mission \"Kidnapped!,\" in which the player ventures into Black Sun territory to rescue the kidnapped Doctor Tarnis. The quest features several points at which alignment choices can affect the outcome, but this article assumes that the Knight chooses the light side options as a light side character. The first turning point is when Nidaljo is about to give up hope, and the player can choose how to encourage him. For dark side points, the player can Force Persuade the Sergeant to help, or they can choose to insult the officer and leave without him for no alignment points and no aid in the battle with Salarr. The light side option is to inspire Nidaljo to help through words, which will also results in Nidaljo coming to aid the player against Salarr. If Nidaljo is present at the fight, the player can gain additional dark side points by ordering the CSF officers to attack Salarr without asking for his surrender."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}