{"url": "Raido", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Devlikk", "Category:Males", "Category:Podracers"], "nodes": [{"tag": "h1", "text": "Raido"}, {"tag": "p", "text": "Raido was a Devlikk male Podracer pilot who flew a yellow J930 Dash-8 Podracer around 22 BBY. That year, Raido participated in a qualifying race for the Mon Gazza Maze course located on the Mid Rim planet of Mon Gazza. Before the race began, the Devaronian Podracer San Maxus paid off Raido to knock out a competitor, the Togruta Podracer Ahsoka Tano, who was actually a Jedi Padawan in disguise. Raido tailed Tano for the majority of the following race and was successful in obliterating her Podracer, though he wrecked his own pod in the process. However, Raido's efforts were ultimately wasted, as Tano obtained a spare Podracer for the next race."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Devlikk male, Raido performed as a professional Podracer pilot during the early part of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, which began in 22 BBY. Piloting a yellow JAK Racing J930 Dash-8 Podracer, a vehicle known for its high traction ratings, he participated in a Podrace on the Mid Rim planet of Mon Gazza—the second qualifier for a race being held on the course known as the Mon Gazza Maze."}, {"tag": "p", "text": "During the first qualifying race, Raido remained in the Podracer hangar, inspecting his vehicle alongside the Toong pilot Ben Quadinaros, though both were momentarily distracted by the arrival of the Jedi Knight Anakin Skywalker. Skywalker's Togruta apprentice, Ahsoka Tano, was also preparing to enter the second qualifying race, going undercover as a pilot in order to uncover spies working for the Confederacy. One of the Confederate spies was the Devaronian male pilot San Maxus. Maxus caught onto the Jedi, however, and sought out Raido. Maxus ended up hiring the Devlikk Podracer to knock Tano out of the race."}, {"tag": "p", "text": "As the second qualifying race began, Tano managed to stay up in front with the leaders, shadowing Maxus for most of the race. Raido, in turn, followed closely behind Tano. Pilots crashed as the race course became increasingly hazardous, but the three leaders remained in their positions—as eagerly announced by the race's droid commentator when the pilots made it through a portion of the track known as the Doom Pipes and headed to the final stretch of the course, the Dust Gaps. Tano suddenly fell behind, ending up in the rear of the pack moments before she reached the finish line. Raido followed suit, remaining behind her as opposed to surging ahead. Skywalker, noting the turn of events, warned Tano through a comlink to watch out for Raido's yellow Dash-8 tailing her. However, as the finish line drew closer, Raido finally made his move against Tano and accelerated to rear-end her cockpit."}, {"tag": "p", "text": "The move proved to be successful—at first. Tano's racer was destroyed, crossing the finish line in pieces. Raido, however, was unable to regain control of his Podracer and crashed right behind Tano. The pilots skidded across the finish line, with Tano finishing in tenth and Raido in eleventh. While Maxus was pleased that Tano no longer had a Pod to race in, he was subsequently angered by the action of his friend and crew leader, Kidd Kareen, who, having taken a liking to the young Togruta girl, offered Tano one of his spare Podracers to compete with for the Maze. During the following Maze race, Maxus attempted to make a delivery to the Confederate agent Asajj Ventress, but the Devaronian crashed after Tano damaged his Podracer."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Raido was a skilled pilot, with the sharp reflexes one needed to pursue a career like Podracing, and was able to tail Ahsoka Tano at varying speeds for the entirety of their race together. Raido was also not above accepting bribes to demolish the competition and accepted such an assignment from San Maxus."}, {"tag": "p", "text": "A Devlikk, he was covered in short, tan fur and had green plumage that topped his head and ringed his neck. Raido also had black-colored eyes and brown skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Raido favored a JAK Racing J930 Dash-8 Podracer, a vehicle that was well known for its high traction ratings and also renowned for its maneuverability and speed. However, the vehicle lacked durability, as proven by Raido's ill-fated attempt to knock out competitor Ahsoka Tano from their race on Mon Gazza. Raido's Podracer's color scheme was yellow with some black detailing on the engine fins and on the engine housing itself. The cockpit was uniformly yellow, while the seat cushioning inside the cockpit was orange."}, {"tag": "p", "text": "When racing, Raido protected his eyes with a pair of brown goggles with black straps that wrapped around his head."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Raido was created by Henry Gilroy and appeared in the 2008 graphic novella The Clone Wars: Crash Course, in which he was illustrated by Matthew and Shawn Fillbach and colored by Ronda Pattison. The 2012 publication Book of Sith: Secrets from the Dark Side later mentioned a city named New Raido, which, according to Daniel Wallace, the writer of Book of Sith, was intended as a reference to the Podracer Raido. In the endnotes to Book of Sith, Wallace suggested that the name \"Raido\" may have seen common usage among the Devlikk and could be linked back to a famous historical figure from among their species, after whom both the Podracer pilot and the city were named."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}