{"url": "Raid_on_the_Imperial_Intelligence_Outpost", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Desolator crisis", "Category:Battles of Taris"], "nodes": [{"tag": "h1", "text": "Raid on the Imperial Intelligence Outpost"}, {"tag": "p", "text": "In 3643 BBY, during the Sith Lord Darth Angral's campaign of vengeance against the Galactic Republic for the death of his son, Tarnis, a young Jedi Knight raided the Imperial Intelligence Outpost in the depths of the ruined Transport Station 5 on the planet Taris. The Jedi Knight and a companion sought to rescue the Republic scientist Doctor Nasan Godera, who had been captured by Watcher One, an agent of Imperial Intelligence. The duo were too late to prevent Watcher One from using a truth serum on Godera to interrogate him about his work on superweapons, and Angral ordered the operative to capture the Jedi—the same Jedi who was responsible for Tarnis's death. Watcher One was defeated, however, and the Knight allowed the man to depart Taris and go into hiding, while the Jedi returned Godera to Republic custody."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3643 BBY, during the Cold War between the Galactic Republic and the Sith Empire, the Sith Lord Darth Angral declared war on the Republic when his son, Tarnis, was killed by a young Jedi Knight. Seizing control of several Republic superweapons, Angral also dispatched Watcher One, a high-ranking operative of the Empire's intelligence organization, with a complement of Imperial Army personnel to the planet Taris to capture the former Republic scientist Nasan Godera. However, the same Jedi Knight who had killed Tarnis was sent by General Var Suthra to locate Godera as well."}, {"tag": "p", "text": "Watcher One managed to stay one step ahead of the Jedi and escaped with Godera, and, in order to secure time to interrogate the scientist, he contacted the Jedi and made a deal: In exchange for time, the operative revealed the presence of a Sith assassin who was about to attack a nearby colony, and he promised to give Godera to the Jedi once his mission was complete. The Knight prevented the assassin from wiping out the colony, meanwhile, Watcher One—who had returned to the Imperial Intelligence Outpost in the depths of a ruined complex known as Transport Station 5—injected Godera with a truth serum and questioned him on his knowledge of superweapon design."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "After securing the colony, the Knight and a companion followed the coordinates for Godera's bioscan that the doctor's droid RE-M0 had given them, and they fought through the hostile rakghoul creatures that inhabited Transport Station 5 as they headed into the ruins. Unaware of the Knight's deal with Watcher One, the dozen Imperial operatives stationed at the facility attacked the Jedi upon sight. The Knight and the Jedi's companion dispatched the dozen Imperial snipers and scouts before heading into the outpost's main chamber, where Watcher One was reporting success to Angral via a holotransmission. Angral ordered Watcher One to bring Godera to the Empire's capital, Dromund Kaas, but when the Knight arrived, the Sith was enraged to learn that Watcher One had compromised with the Jedi. The furious Sith ordered Watcher One to capture the Jedi before ending the transmission, and the operative apologized to the Jedi for betraying their agreement before drawing his blaster. In the resultant battle, Watcher One was supported by two Imperial operatives, but they were eventually defeated by the Knight and the Jedi's companion; while his subordinates were killed, Watcher One was only injured."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Stumbling backward, Watcher One questioned his opponent as to what would happen next. Recognizing that he was a man of honor, the Knight allowed Watcher One to depart and find a new life away from the Empire."}, {"tag": "p", "text": "The Knight then released Doctor Godera from his restraints and returned the scientist to the Republic settlement of Olaris, where Agent Fau-Kes of the Republic Strategic Information Service—the Republic's intelligence agency—had returned after his team failed to make contact with the Knight. At General Suthra's request, Fau-Kes took Godera to the Republic capital of Coruscant, and the Knight's crew headed to the moon of Nar Shaddaa to secure the Republic's stolen Power Guard Project."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raid on the Imperial Intelligence Outpost first appeared in the Jedi Knight-class mission \"The Rescue\" in Star Wars: The Old Republic, a video game released by BioWare in 2011. Dark-side players will be tasked with retrieving Jedi Covenant artifacts, while light-side players are sent to stop an assassin; players can also refuse Watcher One's offer and proceed straight to \"The Rescue.\" After defeating Watcher One, players are presented with a choice: They can kill him for dark-side points, attempt to capture him and fail, or allow him to leave for light-side points. As the Knight is a Republic class and therefore is assumed to choose only light-side alignment options, this article assumes that the Jedi Knight went after the assassin and allowed Watcher One to leave."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}