{"url": "Azool_Phantelle", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Ortolans", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Azool Phantelle"}, {"tag": "p", "text": "Azool Phantelle was an Ortolan criminal and the brother of the musician Max Rebo. During the reign of the Galactic Empire, Phantelle once swindled several of the inhabitants of the Mos Eisley spaceport on the planet Tatooine. After the victims mistook the musician for his thieving brother, Phantelle had to rescue Rebo, who threw the criminal's stolen money back into the crowd chasing them. The Hutt crime lord Jabba Desilijic Tiure later learned of Phantelle's crimes, which had taken place within his territory, and punished Phantelle by forcing him to serve drinks aboard the Hutt's sail barge, the Khetanna."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Brothers reunited"}, {"tag": "p", "text": "Azool Phantelle was an Ortolan who worked as a thief during the reign of the Galactic Empire. He was the brother of the musician Max Rebo, leader of the Max Rebo Band. After Phantelle swindled several of the inhabitants of the spaceport Mos Eisley on the planet Tatooine, the victims mistook Rebo for Phantelle and began chasing the musician. Rebo then collided with two Imperial stormtroopers while fleeing toward Chalmun's Spaceport Cantina. Before the troopers could punish him for the collision, Phantelle spotted Rebo while passing on a speeder bike and pulled his brother out of harm's way and onto the bike."}, {"tag": "p", "text": "As the pair sped away from the angry stormtroopers and locals, Rebo admonished Phantelle for his life of crime and fretted that the Hutt crime lord Jabba Desilijic Tiure, who employed Rebo, would punish both brothers for Phantelle's crimes, as they had taken place within the crime lord's territory. Unconcerned, Phantelle avoided a missile fired by one of their pursuers, after which Rebo stopped the chase by grabbing Phantelle's bag of stolen funds and throwing the contents out to those chasing them."}, {"tag": "h3", "text": "Crime never pays"}, {"tag": "p", "text": "Upset by the loss of his ill-gotten goods, Phantelle stopped to watch the locals fighting over the scattered currency. As the brothers stood watching, Jabba and his entourage confronted the pair and demanded to know what was going on. Rebo informed the crime lord of what had happened, after which Jabba angrily threatened Phantelle. As the criminal was related to Rebo, Jabba chose to spare him and punished him by forcing him to work as a waiter aboard his personal sail barge, the Khetanna."}, {"tag": "p", "text": "Sometime later, the cartographer Emil Graf was reminded of Phantelle and Rebo's case of mistaken identity when he was falsely accused of stealing a pair of laser-calipers from his BB-series astromech droid, BB-00, when the true culprit was the Kowakian monkey-lizard Noni. Graf then told the story to BB-00, Noni, and the droid CR-8R. During the era of the First Order, Graf imagined himself riding with Phantelle on the Ortolan's speeder bike while experiencing a stream of disjointed memories that were being fed upon by a Tarinna on the planet Nelgenam."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Azool Phantelle considered swindling civilians to be fun and believed his brother, Max Rebo, was too afraid of letting go. When Rebo hurled Phantelle's stolen currency from the back of the speeder bike they were riding to distract their pursuers, Phantelle was upset by the loss of wealth. He was unconcerned about the risk of Jabba catching him stealing on the Hutt's territory, but when he was actually confronted by the crime lord, Phantelle was intimidated and submitted to a humiliating punishment. Phantelle had blue skin and black eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Phantelle wore a black jacket and rode a speeder bike. While being forced to work on the Khetanna, he wore a drinks tray on top of his head."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Azool Phantelle first appeared in \"Tales from Wild Space: The Blue Brothers,\" a comic strip written and illustrated by Nick Brokenshire and published in the 2018 comic book Star Wars Adventures 13."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}