{"url": "Raider-class_corvette/Legends", "categories": ["Category:Legends articles", "Category:Corvette classes", "Category:Galactic Empire starship classes", "Category:Raider-class corvettes"], "nodes": [{"tag": "h1", "text": "Raider-class corvette"}, {"tag": "p", "text": "The Raider-class corvette was a starship manufactured by Kuat Drive Yards in 6 BBY. The 150 meter-long corvette was used by the Galactic Empire to support the TIE fighters used to engage the fleet of the Alliance to Restore the Republic during the Galactic Civil War. Lira Wessex, chief designer of both the Venator-class and Imperial-class Star Destroyers, designed the Raider-class corvette to fill a tactical void the Empire had against the Rebel Alliance's starfighter-oriented strategies. The hardy corvette was armed with dual heavy laser cannons, turbolasers, and ion cannons, with some variants carrying concussion missiles. The corvette was equipped with a hyperdrive to complement its use in the Outer Rim Territories as a patrol ship. There were two sub-classes for this line of vessel, the Raider I-class and the Raider II-class corvette."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Raider-class corvette was produced by starship construction company Kuat Drive Yards for the Galactic Empire's naval forces; its design was reminiscent of the dagger-shaped hulls of larger ships used by the Galactic Empire, such as the Imperial-class Star Destroyer. The ship's hull, 150 meters in length, was largely colored gray, with black blade-like protrusions jutting out from the corvette's sides and bottom. The Raider-class was outfitted with multiple weapon hardpoints, including single turbolasers, ion cannon batteries, and dual heavy laser cannons—the latter weaponry proving more accurate against smaller fighters than turbolasers. Centralized command in the ship contributed to its success, and the Raider-class corvette was built to be durable. Acting in an anti-starfighter role found to be lacking in the Imperial fleet, the ship was designed to counter the Rebel Alliance's hit-and-run single-pilot fighter tactics and operated much like the Alliance's own CR90 corvette. A hyperdrive allowed the Raider-class to conduct hit-and-run missions against Alliance forces. Like the Imperial-class Star Destroyers, the Raider-class also came in two sub-types: the Raider I-class and the Raider II-class corvettes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Lira Wessex, daughter of famed engineer Walex Blissex and designer of the Venator and Imperial Star Destroyers, noted a lack of a vessel to complement the Imperial TIE fighters in the interception of single-pilot starfighters—a tactic the Alliance to Restore the Republic later used to great effect during the Galactic Civil War."}, {"tag": "p", "text": "Lira Wessex designed and presented the Raider-class corvette to fill the tactical breach, and in 6 BBY production of the corvette by Kuat Drive Yards began. Considered useful in the Outer Rim Territories by the Empire due to its hyperdrive, the ship offered Imperial officers an opportunity to counter the Alliance's preferred tactics during the Galactic Civil War and saw success in its role. Some time after its construction, a Raider-class corvette was used to test a prototype TIE Advanced x1 starfighter in the Outer Rim Territories. Though the TIE Advanced would prove to be too costly for mass production, the starfighter's hyperdrive allowed it to operate well with the Raider-class corvette."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Raider-class corvette was created by Fantasy Flight Games as a additional component of their Star Wars: X-Wing Miniatures Game. The ship was first announced on the company's website on December 19, 2014, in a news piece detailing a then-upcoming expansion pack to the base game. Intending to create a similar starship to the Rebellion's Corellian corvette, which acts in-game in an anti-starfighter role, the game's development team, including Andrew Navaro, Frank Brooks, and Steve Kimball, first looked to existing material in the Star Wars Legends continuity. The Imperial Lancer-class frigate was considered for the role, but the ship's 250 meter length was considered too unwieldy for game play. Failing to find a suitable candidate, the development team worked with Lucasfilm Ltd. to create a new ship, which would eventually become the Raider-class corvette. The look of the Raider-class corvette was designed and created by artist Ben Zweifel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}