{"url": "Raiders_of_the_Lost_Gundark", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2017) lead stories"], "nodes": [{"tag": "h1", "text": "Raiders of the Lost Gundark"}, {"tag": "p", "text": "\"Raiders of the Lost Gundark\" is a comic story featuring Padmé Amidala and Jar Jar Binks. It was published as the lead story of Star Wars Adventures 18 on February 20, 2019."}, {"tag": "p", "text": "The story's title is a reference to the 1981 film Raiders of the Lost Ark."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Queen Padmé Amidala was interrupted by the Gungan, Jar Jar Binks who brought good news for the queen. Binks was in the swamps when he discovered a map to a powerful Gungan relic. Amidala was reluctant at first but then agreed to join Binks on the quest. A few minutes after, Amidala joined Binks and they headed off to the swamps."}, {"tag": "p", "text": "On their way there, the queen asked Binks if he knew what the relic was. Binks told her that Boss Rugor Nass believed that it was Bombad magic. Amidala and Binks entered a dark vine forest. But Amidala and Binks quickly realized that they were not surrounded by vines. Instead they were surrounded by slitherfish who quickly wrapped the Gungan up. Reacting quickly, Queen Amidala pulled out her blaster pistol and shot at the fish. The two dashed out of the forest."}, {"tag": "p", "text": "Amidala and Binks continued on their journey when they reached a bridge. The bridge was in bad condition but Binks decided to cross it anyway. When he took his first step part of the bridge broke off. Amidala instead shot a grappling hook across to the other side and walked across the railing of the bridge. Binks though made a run for it and ran across the bridge as it broke behind him."}, {"tag": "p", "text": "The reached a cave that frightened the two of them. They descended through the cave, making their way around small caverns and dangerous areas until they reached an entrance to another chamber. Binks noted that there seemed to be no danger lurking around. Amidala told him to wait while she went up to grab the relic. The relic was a round grey ball on a table. But when she picked it up, a large gundark came out of the shadows. Binks started to scream very loudly which damaged the gundarks ears, causing it too retreat. Amidala thanked Binks as they rode back to Otoh Gunga."}, {"tag": "p", "text": "At Otoh Gunga, Binks gave Boss Nass the relic, but Nass went ahead and took a bite into it. The relic was really just a snack called, soshinyday blobball. He thanked Binks and asked him to go fetch him another one, much to the dismay of Jar Jar Binks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}