{"url": "Raid_on_the_communications_tower", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Battles of the Early rebellion against the Galactic Empire", "Category:Battles of the Great Jedi Purge", "Category:Battles of Lothal", "Category:Duels", "Category:Missions of the Ghost"], "nodes": [{"tag": "h1", "text": "Raid on the communications tower"}, {"tag": "p", "text": "In the fourth year before the Battle of Yavin the activities of a rebel cell operating on the Outer Rim planet Lothal drew the attention of Grand Moff Wilhuff Tarkin, a high-ranking officer in the Galactic Empire by launching a raid on the communications tower. Having heard the stories of the rebel cell, and that their leader, Kanan Jarrus, was a Jedi, Tarkin put a plan in motion that led to the capture of Jarrus. He was captured during a rebel mission to hack into Lothal's Imperial Communications Center to send out a transmission to Lothal to set the record straight about their rebellion. The rebels were able to send out the signal, after Jarrus allowed himself to be captured so they could escape, but the Empire destroyed the tower to end the broadcast."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Age of the Empire, a rebel cell known as the \"Spectres\" emerged on the Outer Rim planet of Lothal. This six-member cell consisted of the Twi'lek captain Hera Syndulla, the former Jedi Padawan Kanan Jarrus, the astromech droid Chopper, the Lasat warrior Garazeb Orrelios, the Mandalorian weapons expert Sabine Wren, and the Lothalian youth and Jedi trainee Ezra Bridger. For a period, this rebel cell disrupted Imperial operations on Lothal, assaulted Imperial personnel, and eluded numerous attempts by the local Imperial authorities to capture them."}, {"tag": "p", "text": "The rebel cell's activities eventually attracted the attention of Grand Moff Wilhuff Tarkin, the Governor of the Outer Rim. Frustrated with his subordinates' incompetence, Tarkin travelled to Lothal to put an end to the rebels. He questioned reports that one of the rebels Kanan was a Jedi. After executing Commandant Cumberlayne Aresko and Taskmaster Myles Grint for their incompetence, Tarkin put in motion a plan to capture the rebels. He ordered the Imperial Security Bureau Agent Kallus to dispatch probe droids to every known location of \"insurgent\" activity."}, {"tag": "h2", "text": "Raid on the Imperial communications tower"}, {"tag": "h3", "text": "A message of hope"}, {"tag": "p", "text": "Meanwhile, the Spectres at the urging of Kanan decided to seize control of the Imperial Communications Center near Jalath in order to broadcast a message to the people of Lothal. The Spectres had been hurt by the betrayal of Senator-in-exile Gall Trayvis, a high profile critic of the Empire whom the rebels had exposed as an Imperial agent. The rebels were further incensed with the official Imperial propaganda on HoloNet News which depicted them as terrorists. By seizing control of the main communication tower, Kanan wanted to broadcast the rebels' side of the story."}, {"tag": "p", "text": "While Hera stayed behind on the Phantom to provide an escape vessel, Kanan and the other four rebels Ezra, Zeb, Sabine, and Chopper would take part in the raid. Chopper's primary mission was to upload a data spike into the tower's communication system that would temporarily overload the system and allow Kanan to attach a holotransmitter to the tower in order to broadcast his message. As they were infiltrating the communication tower's compound, the rebels encountered and disabled one of Agent Kallus' probe droids. Before it was disabled, however, the droid managed to transmit footage of them to Grand Moff Tarkin."}, {"tag": "p", "text": "Despite discovering the rebels' location, Tarkin ordered Kallus not to take any further action since he wanted the rebels to believe that they still had the element of surprise on their side. Later that night, the rebels put their plan into action and invaded the communications tower. They managed to overpower the paltry stormtrooper garrison there with relative ease. After securing the tower, Chopper uploaded his data spike into the main tower's communication system. This overloaded the tower's system and allowed Kanan to attach a holotransmitter. Before Kanan could begin his broadcast, the other rebels sighted Imperial reinforcements approaching."}, {"tag": "h3", "text": "Springing the trap"}, {"tag": "p", "text": "While the other rebels fled up the tower to rendezvous with Hera, Kanan stayed behind in order to delay the Imperials. Kanan was soon surrounded by several Imperial Troop Transports and stormtroopers led by Agent Kallus. When Kanan refused to surrender, Kallus then sprang the trap. A patrol transport carrying the Grand Inquisitor landed above Kanan and the two Force-users engaged in a lightsaber duel. Meanwhile, the other rebels reached the top only to be cornered by another patrol transport. However, Sabine threw a grenade at the transport; causing it to crash to the ground."}, {"tag": "p", "text": "Back on the ground, the Grand Inquisitor reiterated his ultimatum to Kanan. He offered to spare the lives of Kanan and his companions if they surrendered and added that someone was interesting in meeting him. Kanan however rejected the Grand Inquisitor's ultimatum and destroyed the elevator's control panel in order to delay the Imperials. Meanwhile, Hera arrived in the Phantom and shot down a second police gunship. She then evacuated Ezra, Sabine, Zeb, and Chopper to safety. Despite her protests, Kanan insisted on staying behind and turned himself in to the Imperials."}, {"tag": "p", "text": "At dawn, Grand Moff Tarkin arrived in a police gunship to meet the Jedi Kanan. However, Tarkin's victory was offset by news that the rebels were remotely controlling the main communications tower. In Kanan's absence, Ezra had taken it upon himself to broadcast a message to the people of Lothal condemning the Empire and calling for them to rise up. Having failed to stop the rebels from disseminating their propaganda, Tarkin ordered his patrol transport to destroy the main communications tower. In the presence of Kanan, he stressed that he was willing to do anything to win the war."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Despite capturing Kanan Jarrus, Grand Moff Tarkin failed to contain the spread of the rebellion on Lothal. The destruction of the main communications tower had the effect of disrupting all offworld communications on Lothal. As a result, the Imperial government and military on Lothal was forced to rely on courier droids to transport information to Arquitens-class command cruisers orbiting the planet. After failing to break Kanan, Tarkin ordered that the Jedi be transferred for further questioning to the Mustafar system. In addition, the Empire tightened offworld travel on Lothal."}, {"tag": "p", "text": "Meanwhile, the Spectres grappled with the dilemma of rescuing Kanan. The rebels' ally Fulcrum cautioned Hera not to rescue Kanan in order to avoid exposing the rebellion to the Empire. Defying Hera's orders, Ezra, Sabine, Zeb, and Chopper put into motion a plan to rescue their co-leader. After a tip-off from the crime lord Cikatro Vizago, the rebels used Chopper to infiltrate an Imperial light cruiser. After learning that Kanan was scheduled to be transported to Mustafar, the Spectres put into motion a plan to rescue Kanan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raid on the communications tower first appeared in the Star Wars Rebels episode \"Call to Action\", which premiered on February 2, 2015. It later appeared in Michael Kogge's Battle to the End, a chapter book adaptation of the final arc of the first season of Star Wars Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}