{"url": "Raid_on_the_Flesh_Raider_weapons_cache", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Flesh Raider uprising"], "nodes": [{"tag": "h1", "text": "Raid on the Flesh Raider weapons cache"}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the reconstituted Sith Empire, the native Flesh Raiders of the planet Tython began to attack the world's other inhabitants, the Jedi Order and a group of Twi'lek Pilgrims, in greater numbers. In 3643 BBY, as part of the Order's attempt to quell the natives' uprising, the apprentice of Jedi Master Orgus Din raided a weapons cache belonging to the Flesh Raiders in the Upper Hollows of the Tythos Ridge. Fighting through the Flesh Raider forces, the Padawan recovered the natives' blasters and rescued an astromech droid by the name of T7-O1 after defeating the native's warmaster. Upon returning to the Twi'lek settlement of Kalikori village, the Padawan gave the weapons to Ranna Tao'Ven, the daughter of the village's Matriarch, and the other Pilgrims so they could better defend themselves."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3643 BBY, after defeating the Dark Jedi Callef and halting an invasion of the area of the planet known as the Tythonian Gnarls by the native Flesh Raiders, a young Jedi apprentice was ordered to the Jedi Temple by Jedi Master Orgus Din. There, the learner came before the Jedi Council and was taken on by Din as an official Padawan."}, {"tag": "p", "text": "When the Council decided to investigate Callef and the natives' recent uprising, Orgus Din gave his apprentice an assignment. The Padawan's first mission was to journey to the nearby Kalikori village, an illegal settlement of Twi'lek Pilgrims, and find out what the settlers knew about the shadowy influence behind the Flesh Raiders' increased attacks. There, the Padawan met with Matriarch Sumari, the village's leader, and learned that the Flesh Raider attacks had been increasing in the area as well. When the Matriarch was forced to retire out of illness, her daughter Ranna Tao'Ven and the village's Scout Chief Moorint took over the conversation."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "Moorint's scouts had learned of a Flesh Raider weapons cache in the Upper Hollows region of the nearby Tythos Ridge, and he asked the Padawan to destroy the weapons in order to deny the natives a tactical and technological advantage. However, Tao'Ven disagreed, believing that the weapons would be more useful if the Padawan recovered them for the villagers. Thinking over the matter, the Jedi agreed with Tao'Ven and decided to retrieve the weapons."}, {"tag": "p", "text": "Moorint warned the Jedi, however, that an access key from one of the Flesh Raiders' leaders would be required to enter the cache. Fighting through the Flesh Raiders along the mountain path, the Padawan ascended into the mountains and entered the cave system known as the Upper Hollows. Using only a vibrosword, the young Jedi fought past at least nine Flesh Raiders and a manka cat before facing the natives' Warmaster. Despite the Flesh Raider's size and brute strength, the Padawan was able to defeat the native and claim the access key."}, {"tag": "p", "text": "Inside, the Jedi found a supply of blasters and other weapons, and recovered them for the village. However, the Padawan also found an astromech droid, T7-O1, who revealed that he had been working as a survey droid for the Jedi Order when he was captured by the Flesh Raiders. T7 also showed the Padawan a holorecording that the droid had taken while faking deactivation, which revealed that a hooded figure—Callef's master—had ordered the Dark Jedi to attack the Gnarls. After the Padawan removed T7's faulty restraining bolt, the pair brought the weapons back to Kalikori Village and gave them to Tao'Ven and Moorint."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Padawan was surprised to see that Orgus Din had also arrived at the village, but interrupted an argument between Tao'Ven, Moorint, Din, and a villager named Saylew. While the Padawan had been recovering the weapons, the Flesh Raiders had attacked the village and Saylew's wife had been killed. After the argument ended with Saylew storming off in disappointment, the apprentice wasted no time in showing T7's recording to the Jedi Master. Troubled, Din refused to answer his apprentice's questions about the identity of the figure, and took the droid back to the Temple with him, though not before giving the Padawan a new mission: investigate the recent sightings of Flesh Raiders near the ancient ruins of Kaleth, a temple of the Jedi Order's precursors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raid on the Flesh Raiders weapons cache appears in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. The events of the raid occur in the Jedi Knight class story mission \"High-Tech Savages,\" part of the character's storyline on Tython. For dark-side points, the player may choose to destroy the weapons and deprive the village of the tactical advantage, or they can choose to recover the weapons for light-side points. Also, players can choose to remove T7's restraining bolt for light-side points, or refuse and have Orgus Din remove it later for dark-side points. As the Jedi Knight is a Republic character, it is assumed that they choose only light-side options."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}