{"url": "Raid_on_the_Mummer_bunker", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Naboo"], "nodes": [{"tag": "h1", "text": "Raid on the Mummer bunker"}, {"tag": "p", "text": "The Raid on the Mummers' bunker was a mission delegated to agents of the Royal Naboo Security Forces during the Galactic Civil War."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "While known as a peaceful haven prior to the rule of Palpatine, Naboo became infested with criminal gangs and organizations during the rule of the Galactic Empire. At the time of the Galactic Civil War, the Mummers were a strong presence on the planet. Sergeant Bragg of the RSF Intelligence Division had gathered that, in addition to their usual bootlegging, the Mummers were involved in a terrorist attack in the capital city of Theed. RSF officer Harriet Brunser came up with a simple plan to solve this problem: namely, to raid the Mummers' headquarters outside of Theed. However, Mummers were known to often use toxins in combat. Lieutenant Dunnels, a RSF science officer, was thus tasked to produce neural boosters to help protect against the Mummers' toxins during the attack."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "Brunser dispatched an unknown number of RSF troopers to raid the bunker in a mission consisting of three stages. The objective of the first stage was to thin the Mummer numbers by eliminating some of its most dangerous members. From her command post in the Theed Hangar, Brunser ordered the RSF agents to specifically aim at killing Mummer Salvers, Toxers, and Banes, whom she considered to be essential to the Mummers' terror operation."}, {"tag": "p", "text": "Having disposed of a large proportion of Mummers, the RSF agents were ordered by Brunser to locate and disarm nine dangerous biochemical bombs, which were scattered all over the Mummer base. The bombs were intended to be an integral part of the Mummers' terror operation. Subsequently, the RSF agents received an order from Brunser to locate and destroy the local Mummer leaders, the Chief Scientist Crimsol Vaighn and the Commander Jaye Hawkson. The RSF agents succeeded in assassinating both leaders, and subsequently escaping the base."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The raid left the Mummers severely crippled, rendering them unable to complete their planned terror operations. The RSF agents were recommended and were dispatched on many other missions against the Mummers and the other criminal organizations pestering the lives of the peaceful residents of Naboo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}