{"url": "Raid_on_the_New_Jedi_Temple", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Battles of the Jedi Temple"], "nodes": [{"tag": "h1", "text": "Raid on the New Jedi Temple"}, {"tag": "p", "text": "A Galactic Alliance-sanctioned raid on the Jedi Temple took place in 43.5 ABY. Several Jedi Knights had begun to fall prey to a Force psychosis, and the Alliance wanted the Jedi Order to turn over its affected Knights to government custody. When the Jedi continually refused to comply, Galactic Alliance Chief of State Natasi Daala ordered a group of Mandalorian commandos to attack the Jedi Temple on the galactic capital of Coruscant in retaliation. The Mandalorians feinted an attack on the Temple's Main Hall, but the brunt of their raid was directed on the Temple hangars and food warehouses."}, {"tag": "p", "text": "Jedi Master Kyp Durron led the Jedi defenses in the Temple's food-preparation level, while Jedi Knights Jaina Solo and Tyria Sarkin Tainer defended against commandos in the StealthX hangar, defeating them even though Tainer was knocked unconscious during the fight. When another group of Mandalorian commandos broke into the hangar area, Jedi Knight Raynar Thul assisted the apprentice Bandy Geffer in defeating the assailants. Although the raid was considered a failure and the Jedi suffered no casualties, the Mandalorians overran the hangars and food warehouses and successfully crippled the Temple's communications and coordination, and the Galactic Alliance subsequently blockaded the Temple. Not long afterward, Daala issued a Mandalorian siege of the Jedi Temple to try to force the Order to hand over the psychotic captives."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 43.5 ABY, several Jedi Knights on the galactic capital planet Coruscant began to contract a Force psychosis that caused them to believe that everyone they knew had been replaced by impostors. The Galactic Federation of Free Alliances attempted to apprehend the affected Jedi due to the danger that they presented to the public, and the government decided to encase the psychotic Knights in carbonite. The Jedi Order objected, however, as they wanted to study the afflicted Jedi and the psychosis themselves, in hopes of finding a cure for the illness."}, {"tag": "p", "text": "The disagreement led to various confrontations between the government and the Jedi Order, as the Jedi began to undermine the Galactic Alliance's efforts to seize the psychotic Knights. The Order captured several of the afflicted Jedi and ferried them to safety in the Hapes Cluster, and even made their situation appear more sympathetic to the public by showing how Galactic Alliance Security forces were treating some of the carbonite-encased Jedi as prizes. Meanwhile, the Jedi became aware of a Sith tribe active in the galaxy and decided to prepare a StealthX fighter team to assist exiled Jedi Luke and Ben Skywalker in dealing with the Sith. In that same year, Jedi Master Cilghal captured the psychotic Jedi Knight Sothais Saar after he developed the illness while meeting with Wynn Dorvan, aide to Alliance Chief of State Natasi Daala. Daala sent Coruscant Security Force officers to request that the Order turn the psychotic Knights in to Alliance custody. When the Jedi refused, she decided to issue a raid on the Jedi Temple, recruiting a group of Mandalorian warriors for the task."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "Following Saar's capture, Cilghal quickly returned with him to the Jedi Temple, where Jedi Knight Jaina Solo was tasked with taking Saar offworld to the Transitory Mists to keep him safe from the government's persecution. Fellow Jedi Knight Tyria Sarkin Tainer helped prepare a shuttle for Solo's use, but, as a live news feed played on a wall-mounted monitor, Tainer suddenly noticed that the feed had looped. Solo recognized the loop as a sign of a potential imminent attack and contacted the Temple's communications center, ordering the Jedi there to warn interim Grand Master Kenth Hamner. Jedi throughout the Temple scrambled to ready themselves for an attack, preparing to counter flanking maneuvers in order to ensure minimum damage."}, {"tag": "p", "text": "The exterior doors on the Temple's hangars were immediately locked down, and a Jedi apprentice, Bandy Geffer, approached Solo and Tainer from the main starfighter hangar. As Solo told Geffer to stay with them, Mandalorian commandos launched an attack on the Temple's Main Hall that was, unbeknown to the Jedi, a feint. Solo was soon informed of the assault via comlink, and she began organizing the defense of the hangar area; she ordered Geffer to find a hardwired intercom away from any exterior wall. The Mandalorians then began to use charges on the door to the StealthX hangar, and, as Solo and Tainer moved to defend against the intruders, they found that their comlinks were being jammed. Meanwhile, another group of Mandalorians launched an assault on the food warehouses, where Jedi Master Kyp Durron led the defense at the food-preparation level."}, {"tag": "p", "text": "The door to the StealthX hangar was quickly demolished by explosives, and four holes were also blown in the walls around the door. Five Mandalorian commandos entered through the openings and attacked Solo and Tainer. The first Mandalorian fired a series of mini rockets toward the Jedi, but Solo and Tainer leapt into the air, dodging the rockets. As the commando prepared to fire again, Solo used the Force to move debris from the damaged hangar wall into the path of the second round of rockets, causing them to explode near the Mandalorians and knock three of the attackers off their feet. Tainer ordered Geffer to report the intrusion through the intercom while she and Solo continued to fight the Mandalorians. Another round of mini rockets forced Tainer to jump aside, but Solo charged straight past the weapons and into the midst of the assailants. As one commando charged Solo with a vibrosword, another fired a net at her. Solo used the Force to wrap the net around the Mandalorian with the vibrosword and toss the commando out one of the holes in the hangar wall—the commando who had fired the net was still attached to the net via a cord and was dragged outside as well."}, {"tag": "p", "text": "Tainer attacked one of the remaining commandos with her lightsaber, but the Mandalorian blocked it with a crushgaunt—the Jedi weapon could not cut through the Mandalorians' beskar armor. Solo charged two more of the Mandalorians, but one of them activated a rocket pack to carry herself away from Solo's attack, so the Jedi engaged the other commando in combat. Tainer, meanwhile, found a hole in her opponent's armor and drove her lightsaber in; but the commando who had earlier fired his net at Solo returned and punched Tainer in the jaw, knocking her unconscious. Suddenly, a second group of five Mandalorians blasted their way into another position in the hangars, moving toward the turbolifts that led up into the Temple. Geffer moved out from his post to defend against them, using the Force to propel a nearby desk at the assailants, but they destroyed it with mini rockets. As Geffer activated his lightsaber and prepared to make a stand, Jedi Knight Raynar Thul arrived on the scene and challenged the Mandalorians."}, {"tag": "p", "text": "While Solo continued fighting the four remaining Mandalorians from the first group, Thul grabbed a durasteel panel and used it to block the mini rockets fired on him by the second group of commandos. Thul leapt over the panel as it was demolished by the rockets and landed behind the attacking Mandalorians, grabbing hold of the arm of one and firing her mini rockets at two of her companions. Thul sustained shrapnel damage from the detonation of the rockets, but all five of his assailants were knocked to the ground. Still, one wrapped a line around Thul's ankle, tripping him and catching the Jedi's left arm in his crushgaunt. The commando broke Thul's arm, but Geffer came to his aid, using the Force to boost his speed as he attacked the Mandalorian who was holding Thul, causing him to lose his grip on Thul's arm."}, {"tag": "p", "text": "As Geffer engaged the commando in combat, Thul quickly knocked out another one of their assailants. The woman whose mini rockets he had fired earlier charged him with a vibroblade, but Thul landed three straight kicks to her jaw, knocking her out. He then turned to the commando who was battling Geffer and used the Force to lift him up and slam him into the ground until he finally fell unconscious. With the commandos incapacitated, Thul ordered Geffer to make him a sling for his broken arm and joined Solo, who had defeated the first group of Mandalorians and was carrying Tainer with her. Recognizing that the hangars had been made indefensible by the holes the Mandalorians had blown into the walls, the Jedi retreated up to the next level and locked down the lifts."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Mandalorians were defeated, and Hamner reported that Solo's early warning had allowed the Jedi to counter the attack successfully. Despite the Jedi's efforts—as well as the fact that no Jedi had died during the attack—the Mandalorians had dealt heavy damage throughout the Temple. Due to the amount of explosives and jamming equipment they had carried with them, the commandos had created numerous indefensible passages throughout the Temple, crippling its coordination as well as its communications. The Mandalorians had also retrieved their fallen comrades, so the Jedi remained unsure of the number of casualties that their assailants had suffered. Furthermore, the Galactic Alliance subsequently set up a blockade around the Jedi Temple, preventing anyone and anything from entering or leaving, and placing artillery at all known entrances to the Temple."}, {"tag": "p", "text": "After the raid, as Solo conversed with Durron, he revealed that the StealthX hangar was being watched too closely for the starfighters to fly out; the Galactic Alliance had turbolaser emplacements waiting to open fire on any attempted escape. Durron also revealed that the government was calling for the Jedi's surrender, and that the Alliance had ordered the arrest of all of the Jedi who had been recognized during the attack, including Hamner, Solo, Tainer, Thul, Saar, and Durron himself. Although the blockade was soon loosened, tensions between the government and the Jedi continued to increase. Footage captured during the Mandalorian raid showed the buildup of StealthXs, and Alliance Admiral Nek Bwua'tu feared that they might be intended for a strike at the government. Soon after the raid, in 44 ABY, Jedi Knight Turi Altamik contracted the psychosis and was captured by the Jedi Order following a manhunt in full view of the media. When the Jedi refused to turn her or Saar over, Daala ordered a Mandalorian siege of the Temple."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raid on the Jedi Temple first appeared in Aaron Allston's Fate of the Jedi: Backlash, the fourth installment in the nine-part Fate of the Jedi series. The event later received mention in the fifth, sixth and seventh novels in the series, titled Fate of the Jedi: Allies, Fate of the Jedi: Vortex, and Fate of the Jedi: Conviction, respectively. In 2012, the raid was mentioned in the guidebook The Essential Reader's Companion, which included an illustration of the attack by the artist Chris Scalf."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}