{"url": "Raid_on_the_Tythos_Ridge_shield_generator", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Flesh Raider uprising"], "nodes": [{"tag": "h1", "text": "Raid on the Tythos Ridge shield generator"}, {"tag": "p", "text": "During the Flesh Raider uprising on the Deep Core world of Tython during the Cold War, the apprentice of Jedi Master Orgus Din was ordered to disable a shield generator in the Tythos Ridge, a region controlled by the hostile native Flesh Raiders. While a strike force of Jedi prepared to attack the natives' command base, which was protected by the shield generator, Din's Padawan ventured into the Ridge mountains to locate and shut down the shield. Successfully fighting through the Flesh Raider forces, the apprentice deactivated the shield and allowed Din to lead the strike against the command base."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3643 BBY, near the end of the Cold War between the Galactic Republic and the Sith Empire, the native Flesh Raiders of the Jedi Order's homeworld of Tython began attacking in greater numbers under the influence of two Dark Jedi—Bengel Morr and Callef. The Nautolan apprentice of Jedi Master Orgus Din during the Great Galactic War, Morr had been inside the Jedi Temple during the Sacking of Coruscant, and had gone insane after witnessing the of the devastation. When his body was not recovered, the Jedi assumed he was dead, but Morr turned to the dark side and took on Callef as his apprentice. The two spent the next ten years plotting the downfall of the Jedi, influencing the Flesh Raiders against the Order."}, {"tag": "p", "text": "The new apprentice of Din, who had killed Callef in an earlier encounter, was sent by Din to the ruins of the ancient temple of Kaleth to investigate recent activity in the area. The Padawan had also rescued an astromech droid designated T7-O1 while recovering weapons for the Pilgrims of Kalikori village, and the droid had recorded a hooded figure giving orders to Callef. Orgus Din had recognized the figure, but would not tell his apprentice who it was before sending the Padawan to Kaleth."}, {"tag": "p", "text": "While at Kaleth, the Padawan encountered Force-wielding Flesh Raiders, and was forced to defeat them when they attacked. Master Bela Kiwiiks, who had arrived as reinforcements for the Padawan, was alarmed to find that the leader had been carrying a holocron, and instructed the apprentice to install security cameras in the area so the Order would know if the natives returned. The Padawan was then contacted by Din via holocomm, who ordered his apprentice to return to Kalikori village."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "When the Padawan arrived, Din revealed what he had been holding back: the identity of Callef's master, Bengel Morr. However, Morr was not the issue at the moment—the Twi'lek Ranna Tao'Ven, the daughter of the deathly ill Matriarch Sumari, had received information from her scouts about the location of a Flesh Raider command base in the native-controlled Tythos Ridge mountains. Unfortunately for the Jedi, the base was located several miles away and was protected by a shield generator. The shield generator was located in a cave system in a different mountain nearby, and the shield needed to go down before the Jedi could attack."}, {"tag": "p", "text": "Din tasked his Padawan with disabling the shield while he gathered a team of Jedi to eliminate the base. Leaving the village, the apprentice fought through the Flesh Raider–infested territory of the Tythos Ridge, heading up the mountain paths toward the cave where the generator was located. Despite the presence of many Flesh Raiders and a trained manka cat in the cave, the Padawan was able to defeat their chieftain and reach the generator console. However, upon the shield's deactivation, the Padawan was contacted by Bengel Morr himself."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Morr told the Padawan of his interest in the young Jedi, but was ultimately confident that nothing would be able to stop his plans. The Nautolan also revealed his goal in instigating the uprising: he, like his apprentice Callef, believed the Jedi Order had become weak and needed to be replaced. Morr and Callef were training the Flesh Raiders to destroy the Order and rebuild it into something stronger. This new Order would be able to take the fight to the Sith, wiping them from existence. Despite the Padawan's attempts to convince Morr to come back for healing, the Dark Jedi ended the transmission. Concerned about Morr's plans, the Padawan rushed back to Kalikori Village to find Master Din and warn him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raid on the Tythos Ridge shield generator appears in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. The raid represents the events of the Jedi Knight class story mission \"The Face of the Enemy\", where the player is sent by Orgus Din, Ranna Tao'Ven, and Moorint to the Tythos Ridge to shut down the shield generator so the Jedi can attack the Flesh Raider base on another mountain. After deactivating the shield and talking with Morr, the next stage of the quest is to return to Kalikori Village to seek out Din."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}