{"url": "Rainboh", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Hapes Consortium planets", "Category:Rocky planets"], "nodes": [{"tag": "h1", "text": "Rainboh"}, {"tag": "p", "text": "Rainboh was a planet in the Rainboh system of the Hapes Cluster. Its surface was composed of multi-colored rocks, and its sky contained a round, four-colored satellite. Rain storms brought rainbow-colored rain drops to the planet. Rainboh was home to the Jeby, a species with multiple heads and limbs."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Rainboh was a planet located in the Rainboh system of the Inner Rim's Hapes Cluster. Positioned among the Hapan Rim Worlds, Rainboh could be reached from the Great Rim Route or the Rynmar Trail hyperlanes via Rynmar itself."}, {"tag": "p", "text": "Rainboh was covered with rocky terrain, which appeared in several different colors. Bands of purple, green, red, brown, and blue rocks made up the planet's surface. Whenever there was rainfall on Rainboh, the raindrops fell as rainbow-colored. There was at least one raised surface on Rainboh and one vaguely round, four-colored satellite in the planet's skyline."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Rainboh was home to the Jeby, a three-headed, four-legged, tentacled, and spotted species. Whenever the Jeby would laugh boisterously, it would shed its pink spots, littering the surface of Rainboh. However, the creature would suck the spots back up and replace them on its body."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rainboh was created by seven-year-old Star Wars fan Paul Rice for the backstory of his Jeby entry in the \"Design An Alien\" contest, held through Star Wars Galaxy Magazine. Rice's submission was part of a school art project, for which his first-grade teacher had selected the \"Design An Alien\" contest for students to complete. As such, the editors of Star Wars Galaxy Magazine received many submissions from that class. Rice's entry was published in 1996's Star Wars Galaxy Magazine 7, under the \"Honorable Mentions – Under 16\" category."}, {"tag": "p", "text": "Leland Chee, keeper of the Star Wars Holocron continuity database, stated in 2006 that published content from the \"Design An Alien\" contest was canon. Rainboh went on to be included in The Essential Atlas, published in 2009, establishing its location in the Hapes Cluster."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}