{"url": "Raina_Temple", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Alliance individuals", "Category:Chiss Expansionary Defense Force officers", "Category:Cipher Nine's crew", "Category:Females", "Category:Force-sensitives", "Category:Humans", "Category:Imperial Intelligence personnel of the resurgent Sith Empire", "Category:Military personnel of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Raina Temple"}, {"tag": "p", "text": "Raina Temple was a Human female daughter of two Cipher Agents of the reconstituted Sith Empire. Born Force-sensitive, she was about to be taken by the Sith to train on Korriban, but Cipher Three hid his daughter and gave her a new identity instead, making Raina a fugitive for life. She enlisted into Imperial Military and managed to secure a transfer into the allied Chiss Ascendancy, serving in the Chiss Expansionary Defense Force away from the Sith eyes. Early in the Galactic War she was posted in the secret Zero Station under Aristocra Saganu and assisted him in investigating suspicious activities of Imperial Admiral Layek Davos. She convinced the Aristocra to bring in Imperial Agent Cipher Nine, who had their own interest in Davos, and assisted them in tracking the Admiral to the Starship Graveyard. After evacuating with the agent on the Starbreeze after the mission, she was offered a position in the Imperial Intelligence, which she eagerly accepted."}, {"tag": "p", "text": "Raina joined Cipher Nine's crew aboard their X-70B Phantom-class prototype and began training in the art of espionage, subterfuge and manipulation. During this time, she learned that the Sith have finally tracked down her father, and chose to execute him herself rather than let him be tortured. Temple accompanied Cipher Nine during the Hunt for the Star Cabal and remained loyal to the agent even after the Imperial Intelligence was dissolved. She spend over five years at the agent's side, until Cipher Nine went missing during the Eternal Empire conquest, prompting Raina to abandon Dromund Kaas and return to the Chiss Ascendancy. After spending another five years passing her knowledge of Imperial espionage to Ascendancy soldiers, she accompanied Aristocra Saganu on a diplomatic visit to the Eternal Alliance, which led to her joining the Alliance Commander on a mission to the Chiss world of Copero. Though the mission was unsuccessful, Raina Temple decided to stay and continue working with the Alliance, believing her connections in the Ascendancy could be valuable there."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born on Dromund Kaas in 3666 BBY, Raina was the daughter of two Cipher Agents of the Imperial Intelligence and was raised in Kaas City. Exposed to the best money could buy, the girl adored her father Cipher Three, who once gave her a felinx for her birthday, and reached the age of twelve before she realized that the fresh scars from his work were left after Intelligence operations. She was also Force-sensitive, which by laws of the Sith Empire meant that she had to undergo training in the Dark side of the Force in the Sith Academy on Korriban. Afraid that she would not survive the training, Cipher Three was determined to keep his daughter from that fate and took necessary precautions."}, {"tag": "p", "text": "By the time the Sith came for her, both of them were gone, and Cipher Three had changed his child's name, birthdate and other records to ensure that no traces of her identity remained in either Imperial Enlisted Records or files of the Imperial Citizenship Bureau. He then went into hiding from the Sith, while young Raina was left on her own, desperate not to reveal her connection to the Force to any Sith or high-ranking Imperials. Under her new name, the young fugitive enlisted in the Imperial Military when she was of age and was able to secure a transfer to the Chiss Expansionary Defense Force, despite neither CEDF having to official transfer program with the Sith Empire. Even though the Chiss themselves had a strong stigma against Force-sensitives, the Chiss Ascendancy kept Raina Temple safely away from the attention of the Sith in return for her dedication, granting her the rank of Ensign."}, {"tag": "h3", "text": "Service on Hoth"}, {"tag": "p", "text": "In 3643 BBY, late in the Cold War, Raina Temple was assigned to the ice planet Hoth, where she was posted in the Zero Station, a top secret Ascendancy installation that was kept hidden from the Imperials fighting in the Battle of Hoth. Initially Temple wasn't trusted because of her Human heritage, which made everyone suspect she was a spy. However, Raina soon learned her way around and proved her competence to the Chiss, making quite a few friends inside the base, though she still missed Dromund Kaas. Temple was posted on Hoth for less than a year when Zero Station Commander Aristocra Saganu began investigating unusual activities of Imperial Admiral Layek Davos. Their suspicions were raised when the Admiral brought in his own crew of officers loyal to him, ensuring their dedication with bribes, and were later confirmed when he bought arms and heavy equipment for an excursion into the Starship Graveyard. Davos launched his expedition in 3642 BBY just when Cipher Nine of the Imperial Intelligence arrived with the intention to join him. To the surprise of everyone who monitored him, Davos revealed his true intentions by ordering his men to interrogate and kill the agent. The Cipher overcame the attackers and survived, prompting Raina to convince Saganu that the situation warranted bringing the agent in, after which Chiss sergeant Ath'en'terro attached to Imperial Search and Recovery directed them to Zero Station."}, {"tag": "p", "text": "Temple personally welcomed Cipher Nine to their secret base and introduced them to Aristocra Saganu, who explained the situation and revealed the Chiss knowledge of the Admiral's activities. Cipher Agent joined the Chiss in their effort to stop Admiral Davos, and Raina asked them to investigate the supply caches that were being buried in the White Maw territory by Davos' men for the past few weeks. The investigation revealed that the caches contained stolen Imperial military-grade equipment and were given to the pirates in exchange for a safe passage through their territory. Temple specifically identified that Davos was paying a group called the Marauders and assembled a team to raid their camp inside Tromper Crags mineral mine, asking Cipher Nine to join them there. By the time the agent arrived her team was pinned down by the pirates, and to save her men Raina was forced to tap into her Force abilities. She used a simple mind trick to briefly distract the Marauders, giving Cipher Nine the opportunity to gun them down. After Temple quickly explained her situation to the agent, they were contacted by Saganu. The Aristocra informed them that Marauders' data revealed that the pirates agreed to meet the Admiral in their main base in the Tromper Crags and suggested Cipher Nine to spy on the meeting from a cave network below."}, {"tag": "p", "text": "From the Bone Pits, the agent used a laser drill and a microcord camera to burn a whole through the ice wall and observe the entire meeting, during which the pirates agreed to escort Davos and his men to the crashed Republic dreadnought Star of Coruscant in exchange for getting part of the salvaged valuables. Temple and Saganu waited for Cipher Nine at the Imperial Frostwake Outpost, where the Aristocra outlined the plan of their joint attack, which required the agent to slip inside and deactivate the blast doors, allowing Raina and her team inside. Inside the dreadnought, Temple and her team faced the opposition from Marauders and Scourge pirates, armed with blasters and flamethrowers. While Saganu's team held off the escape route, Raina and her men engaged the pirates, allowing Cipher Nine to reach Admiral Davos and stop him from retrieving the shuttle Starbreeze from the hangar bay. While the agent neutralized the Admiral, his men, and the pirate leaders that were present, Temple's unit came under increased assault which ended with all of them wiped out. Raina herself only survived thanks to the Force and managed to reach Cipher Nine in the hangar, the two of them escaping on the Starbreeze."}, {"tag": "h3", "text": "Training under Cipher Nine"}, {"tag": "p", "text": "Landing the Starbreeze in a remote ice field, Raina and the agent were met by the man who introduced himself as Minder Seventeen and announced that he would be taking her over to its final destination. Before leaving his own shuttle to Cipher Nine as a way out, Minder Seventeen also informed Ensign Temple that she would be transferred to the Imperial Intelligence, effective immediately. Though surprised, Raina was eager to pursue the same career opportunity as her father and accepted the transfer without arguing, parting ways with the Expansionary Defense Force. After being debriefed in the Imperial Intelligence Headquarters on Dromund Kaas, she was assigned to the crew of Cipher Nine, joining the Rattataki Kaliyo Djannis, Killik Joiner Vector Hyllus and Doctor Eckard Lokin aboard the agent's X-70B Phantom-class prototype. Raina quickly got along with Doctor Lokin, who knew her father during his own Intelligence career and was eager to tell stories about him, even though Temple suspected most of them were not entirely true. She also got Cipher Nine's permission to bring a melodium aboard, having sudden urge to play after not touching the instrument for years."}, {"tag": "p", "text": "Fully intending to commit to her new career, Raina was eager to begin her undercover training with Cipher Nine. She learned combat drills and covert maneuvers, as well as interpersonal manipulation and information extraction methods. Eventually Temple put herself through the Imperial Intelligence training program, which she successfully completed, granting her the credentials necessary to become an official covert agent. Cipher Nine and their crew were assigned to investigate a massacre on Isen IV, which revealed that both sides of the Galactic War were being manipulated by a shadowy conspiracy known as the Star Cabal. The agent uncovered the origins of Star Cabal on Belsavis and investigated their activities on Voss, but the conspiracy struck back and used their influence to dissolve the Imperial Intelligence. Cipher Nine's team was drafted into Sith Lord Razer's unit to fight in the Battle of Corellia, but they managed to escape notice and regroup with other Intelligence loyalists looking to bring down the Star Cabal. With their help, Cipher Nine tracked the conspiracy to the Star Chamber in the Null Zone, where they killed or exposed its most prominent members and obtaining the Black Codex that held their most valuable secrets."}, {"tag": "p", "text": "While scanning Chiss frequencies to pass the time, Raina found a message left for her by a friend from the Defense Force that contained a holotransmission the Chiss intercepted from Korriban. The message from Lord Darrok revealed that her father was discovered after decades in hiding and was about to be executed for the crime of hiding a Force-sensitive. To spare her father from torture and public humiliation, Temple reached him before the Sith could and executed her father for his crimes against the Empire. Because of her time on Hoth flagged her as hostile-environment capable, Raina received a personalized transfer offer from Major Yanus to join his Toxi-Trooper Brigade on Quesh. Though at one time she would consider the promotion for the sake of hiding, her time with Cipher Nine and the work they were doing for the Empire caused her to reject the offer."}, {"tag": "h3", "text": "The Eternal Alliance"}, {"tag": "p", "text": "Raina Temple remained alongside Cipher Nine for over five years, until in 3636 BBY the galaxy was invaded by the Eternal Empire of Zakuul. During the Eternal Empire conquest Cipher Nine disappeared, leaving Raina with no protection, and believing it too dangerous to remain on Dromund Kaas, she went off the grid and eventually returned to the Chiss Ascendancy. By this time Aristocra Saganu had brokered a deal between the Ascendancy and Eternal Emperor Arcann, which earned him a promotion to supreme commander of the Chiss Expansionary Defense Force, and Temple agreed to share her knowledge of Imperial espionage tehcniques with Chiss soldiers. Promoted to the rank of lieutenant, she spend the next six years mostly cut off from the galaxy at large."}, {"tag": "p", "text": "In 3630 BBY, the Eternal Empire was overthrown by the Eternal Alliance, which was part of neither the Empire nor the Galactic Republic. After Theron Shan betrayed the Alliance on Umbara, he took refuge on the Chiss world of Copero, and was sheltered by Syndic Zenta of House Inrokini in exchange for Alliance secrets. Aristocra Saganu saw Zenta's actions as betrayal of the Chiss but was unable to act against her without igniting a political war and resorted to asking the Alliance to take care of their mutual problem. Saganu traveled to Alliance capital of Odessen with a small escort, which included Temple, and met with the the Alliance Commander and their advisor Lana Beniko. Explaining to them the situation, Saganu offered to take the Commander to Copero where they could take care of both traitors at once, while Raina Temple would accompany them and watch for the interests of Ascendancy, which would formally not be involved."}, {"tag": "p", "text": "Saganu personally delivered Temple and the Commander to Copero, where they fought Zenta's soldiers in Copero City and the neighboring shipyards, eventually enganing the Syndic herself. During the fight, the Commander disarmed Zenta while Raina claimed her rifle and established a holocall with the Aristocra. Defeated and subdued, the Syndic explained that Theron had betrayed her as well, pretending to seek refuge only to steal from her the location of a secret holomap that the Chiss stole from the Sith Emperor Vitiate decades ago. After receiving Theron's location from Zenta, the Commander and Temple continued their pursuit, catching up with him and Zenta's brother Valss in the ancient ruins. By this point they have already extracted the coordinates they were after and destroyed the holomap, preparing to depart on a Zakuulan shuttle. Valss stayed behind to buy Shan time to escape, and the Commander and Raina engaged the Chiss and struck him down but were too late to prevent Theron's escape. They returned to Odessen empty-handed, where Temple delivered to Commander the status update she received from Aristocra Saganu and volunteered to join the Eternal Alliance, believing she could provide valuable connection between the Alliance and the Ascendancy."}, {"tag": "p", "text": "After the Eternal Alliance decided to pick a side in the Third Galactic War, Raina asked that her name and role in the Alliance as an Ascendancy liaison not be shared with the Alliance's new allies, preferring discretion."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Raina Temple was an unusual example of an Imperial patriot who spend her entire life on the run for what only the Empire saw as crimes. When her father was about to be discovered by the Sith, she chose to execute him for the crime of saving her life, rather than to try and save or relocate him. A strong lover of the Empire and its culture, Raina wasn't even able to spend time on Dromund Kaas without sufficient protection from the Sith attention. Having a strong sense of duty and honor, Temple admired and appricated the Sith, despite detesting cruelty and casual violence that they were so fond of. Groomed in an environment that promoted patriotism and a deep, abiding respect for the ideology and philosophy of the Sith, Raina worked to serve the interests of the Empire while minimizing her personal contact with them."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Raina Temple was Force-sensitive, but never received any proper training. Her Force abilities were unrefined, and she rarely made use of them in the open, fearing discovery by the Sith, which would lead to her death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Raina Temple appears in Star Wars: The Old Republic as a companion character for the Imperial Agent class, voiced by Georgia Van Cuylenburg. Male agents can romance Temple and eventually marry her, provided they don't choose Kaliyo Djannis instead. After the completion of \"A Traitor Among the Chiss\" flashpoint storyline, Raina becomes available as a companion for characters of all classes. If the Commander is an Imperial Agent, they will have unique dialogue with her, during which they can resume their relationship with Temple or break up with her. During the flashpoint, Aristocra Saganu will ask players to kill Syndic Zenta in exchange for a political deal; if the player refuses or hesitates, Raina will note that Zenta is guilty of crimes against the Alliance as well and at the very least deserves imprisonment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}