{"url": "Raioballo_sector/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems sectors", "Category:Galactic Empire sectors", "Category:Galactic Republic sectors", "Category:New Republic sectors", "Category:Outer Rim Territories sectors", "Category:Raioballo sector"], "nodes": [{"tag": "h1", "text": "Raioballo sector"}, {"tag": "p", "text": "Raioballo sector was a sector in the Outer Rim Territories encompassing thousands of inhabited worlds. These included the stormy Tertiary Kesmere, tranquil Dantooine, oceanic Shusugaunt, the industrial world Sinsang, and Anx Space, containing the Anx homeworld of Gravlex Med and a number of their colony worlds. The hyperspace route Myto's Arrow ran through the sector, connecting Dantooine to the Obtrexta sector."}, {"tag": "p", "text": "Numerous battles were fought in Raioballo sector during the major galactic wars. Fighting occurred at Dantooine during the Clone Wars, the Galactic Civil War, and the Yuuzhan Vong War. The last major fleet battle between the New Republic and the Imperial Remnant occurred within Anx Space."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "For many years, Raioballo sector was represented in the Galactic Senate by Horox Ryyder, an Anx renowned for his level-headed impartiality. On his retirement, Ryyder was awarded the Royal Chalcedony Shield, typically only given to Alderaanians. Ryyder was replaced as Raioballo sector senator by fellow Anx Zo Howler and his aide Fo Kuna."}, {"tag": "p", "text": "Early in the Galactic Civil War, the sector was home to an Alliance to Restore the Republic base on Dantooine. However, the base was abandoned before the Battle of Yavin. Shortly after this, Imperial defector Tycho Celchu tried to hide on the planet, but his defection was detected and an Imperial strike force attacked the planet. Celchu was rescued by the intervention of Luke Skywalker and a rebel strike team. Later, when the New Republic came to power, they established a small colony on Dantooine for the refugees from Eol Sha. This was discovered by the renegade Imperial Admiral Daala who massacred the colonists as a political strike against the Republic in 11 ABY."}, {"tag": "p", "text": "During the period of the New Republic, the sector contained a large shipyard at Gravlex Med, used for scrapping mothballed capital ships. The Imperial Remnant paid slicers to get the Imperial II-class Star Destroyer Chimaera transferred there, and then proceeded to steal the ship which had once been Grand Admiral Thrawn's flagship."}, {"tag": "p", "text": "Years later, another key engagement between the New Republic and the Imperial Remnant occurred in the sector. In 17 ABY, the navies engaged over Anx Minor, with both sides led by their top commanders; Admiral Ackbar and Fleet Admiral Gilad Pellaeon, respectively. The battle resulted in victory for the Republic, and was the last large scale fleet engagement fought between the two powers."}, {"tag": "p", "text": "During the Yuuzhan Vong War, Raioballo sector lay along the initial invasion path of the Yuuzhan Vong. As such, one of the early engagements of the war took place on Dantooine, in 25 ABY. New Republic refugees from the further rimward worlds of Dubrillion and Destrillion were being processed on the planet, when the Yuuzhan Vong launched an attack. The invaders killed as many as 45% of the refugees and many soldiers before Admiral Traest Kre'fey arrived, facilitating escape for the remaining Republic forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Raioballo was first named in Cloak of Deception, although with no planets named within the sector. That content was supplied by The University of Sanbra Guide to Intelligent Life: The Anx and Kyle Katarn's Tale, which placed a number of worlds. The specific history of those worlds from other sources could then be extrapolated for the sector."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}