{"url": "Rakata_Prime", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Terrestrial planets", "Category:Unknown Regions planets"], "nodes": [{"tag": "h1", "text": "Rakata Prime"}, {"tag": "p", "text": "Rakata Prime, also known as Lehon, was the homeworld of the Rakata species, and was one of the few navigable worlds located in the Unknown Regions. At some point, the Resistance pilot Venisa Doza visited the planet along with her astromech droid, Torch. The Zabrak pirate Tryki was also once arrested for attempting to board a First Order cruiser near Rakata Prime."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Rakata Prime, also known as Lehon, was a terrestrial planet located in the grid area G-11 of the Unknown Regions. The Rakata, a species of humanoid amphibians that were rumored to have pioneered hyperspace travel, hailed from the world. Even though the cosmic bramble of hyperspace anomalies known as the Galactic Barrier prevented the exploration of the region, Rakata Prime was one of the few navigable worlds that were found by rare exploratory missions, and the planet could be reached by cautiously stepped hyperspace jumps."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A legend suggested that the Rakata of Lehon first pioneered hyperspace travel, although they were rumored to have gone extinct in ancient times due to corruption by the dark side of the Force. The Zabrak pirate Tryki was once arrested for attempting to board a First Order cruiser near Rakata Prime, and her starship was destroyed as a result. At some point, the Resistance pilot Venisa Doza and her astromech droid, Torch, also traveled to the planet. Later, in 34 ABY, when the duo was about to be captured by the First Order, Doza brought up their time on Lehon while planning how to escape their present predicament."}, {"tag": "p", "text": "The world shared its names with the historical Rakatan Infinite Empire, the mystical antiquities known as Rakatan wraith boxes, and the Legend of Lehon. The legend suggested that the desert planet of Tatooine was once covered by lush jungle and inhabited by the Kumumgah."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rakata Prime was first mentioned as Lehon—an alternate name for Rakata Prime in the Star Wars Legends continuity—in the new Star Wars canon in the forty-seventh issue of the Star Wars: Build the Millennium Falcon series of magazines, published by De Agostini around November 25, 2015. The name Rakata Prime was introduced to canon on a map of the galaxy created for Star Wars: The Force Awakens: The Visual Dictionary, a reference book written by the Lucasfilm Story Group's Pablo Hidalgo for the film Star Wars: Episode VII The Force Awakens and released on December 18, 2015. The aforementioned map was initially revealed prior to the book's release through an article by Empire magazine on November 26, 2015."}, {"tag": "p", "text": "Rakata Prime originally first appeared in the 2003 Legends video game Star Wars: Knights of the Old Republic as the \"Unknown World.\" The 2005 reference book The New Essential Chronology, written by Daniel Wallace, introduced the name Rakata Prime, while the 2006 novel Darth Bane: Path of Destruction, written by Drew Karpyshyn, introduced the name Lehon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}