{"url": "Rakamat", "categories": ["Category:Legends articles", "Category:Ground vehicles", "Category:Yuuzhan Vong vehicles"], "nodes": [{"tag": "h1", "text": "Rakamat"}, {"tag": "p", "text": "The rakamat was a reptilian Yuuzhan Vong siege creature, similar in scale and purpose to an Imperial All Terrain Armored Transport."}, {"tag": "p", "text": "Rakamats' scaly skin was a mottled blue-green, spotted by patches of dark orange and the silver glow of yorik coral spikes that rimmed their heads and spinal plates. Over twenty meters in length, the rakamat advanced on enemy positions on six massive legs, projecting microsingularities via onboard dovin basals and firing its protruding Yaret-Kors at a range of two kilometers. The use of the rakamats' singularity elongated its mass, leading to early reports of rakamats as large slug-like creatures."}, {"tag": "p", "text": "In addition to its firepower, the titanic rakamat served as a transport for reptoid Chazrach warriors. While the rakamats strode into battle, Chazrach would grip the creatures' thick outer skin until they reached enemy lines. The rakamats also were used as platforms for dovin basals used to control Chazrach in battle. If a rakamat was destroyed, the Chazrach associated with it would scatter."}, {"tag": "p", "text": "The New Republic forces found the reptilian colossi nearly indestructible. At the Battle of Dantooine, Jedi Master Luke Skywalker drained himself manipulating the Force in such a way that the rakamat's gravitic singularity closed in on itself; Wedge Antilles required the use of six X-wings, and a hidden cache of explosives to kill one rakamat, and tricking a coralskipper to crash into a second to destroy it."}, {"tag": "p", "text": "Rakamats' tremendous field of fire, and their resemblance to a mountain would earn them the nickname \"range\" amongst starfighter pilots; field commanders referred to them as \"warkeepers\" for their indication that a battle would be long and costly."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}