{"url": "332nd_Company", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Grand Army of the Republic companies"], "nodes": [{"tag": "h1", "text": "332nd Company"}, {"tag": "p", "text": "The 332nd Company, with its members informally known as Ahsoka's Clone Troopers, was a company within the 332nd Division of the 501st Legion of the Galactic Republic, and was characterized by the distinctive helmet design of its troopers. It was active during the late Clone Wars after Jedi Padawan Ahsoka Tano left the Jedi Order. When she returned to help Republic forces stage an invasion of Mandalore, the company alongside Clone Commander CT-7567 \"Rex\" and Clone Captain CT-0292 \"Vaughn\" were selected to help."}, {"tag": "p", "text": "The company reinforced the Republic troops in the invasion, successfully defeating Maul and the Shadow Collective. However, on the way back to Coruscant onboard the Venator-class Star Destroyer Tribunal, Order 66 was enacted and the 332nd Company attacked Ahsoka Tano and Maul, held prisoner. They were unsuccessful in killing either Force-user, however, and all of the troopers except Rex were killed when the ship crashed on a moon."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The 332nd Company was an infantry company of clone troopers within the 501st Legion of the Grand Army of the Republic. It was led by Clone Captain CT-7567 \"Rex,\" who was promoted to Clone Commander in order to lead the newly established 332nd Division, which was being created for the Siege of Mandalore. The 332nd Company was part of the division, and shared names. As a company of the Republic, it consisted of four platoons, including a platoon that was present on Ahsoka's return."}, {"tag": "p", "text": "The clone troopers of the company were equipped with Phase II clone trooper armor, with the standard blue markings of the 501st. Their helmets, however, were painted red-orange in a stylized version of Ahsoka Tano's facial markings and skin tone—representing their camaraderie to Tano, a former Jedi Commander, and as such they were informally referred to as \"Ahsoka's Clone Troopers.\" There were also some troopers, who hadn't painted their helmets and had their 501st original armor."}, {"tag": "p", "text": "Throughout the missions and skirmishes that the 332nd Company participated in, they employed the use of infantry weapons, jetpacks, and certain military vehicles, mainly the LAAT/i gunships, which served as their primary method of transportation, and the AT-TE walkers, which were present with the company at times. The company was stationed on the Venator-class Star Destroyer Tribunal."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Return of Ahsoka Tano"}, {"tag": "p", "text": "After the former Jedi Padawan Ahsoka Tano's departure from the Jedi Order, she later returned to serve the Galactic Republic in 19 BBY. Tano, along with members of the Mandalore resistance, had arrived to propose a joint operation in order to oust the Shadow Collective and renegade Sith Lord Maul from Mandalore. After the meeting, Tano met with her former master, Jedi Knight Anakin Skywalker."}, {"tag": "p", "text": "Skywalker led her to a hangar, where Captain Rex stood with the company and called them to attention. Tano walked among them in surprise, noting that their helmets were painted in a stylized version of her face. Skywalker told her that as soon as they knew she was returning, they had customized their helmets. Captain Rex continued that, although the paint job was crude, it was effective, and they were glad she had returned."}, {"tag": "p", "text": "Since Tano was no longer a Jedi Commander within the Grand Army of the Republic, and therefore wasn't officially permitted to lead a unit of Republic forces, Captain Rex was promoted from Captain to Commander so that he could lead the new division, which was created with the same designation as the company, and take Tano as an advisor."}, {"tag": "h3", "text": "Siege of Mandalore"}, {"tag": "h4", "text": "Initial assault"}, {"tag": "p", "text": "Preparing for the siege, three Venator-class Star Destroyers arrived above Mandalore and deployed a large contingent of LAAT carriers and LAAT/i gunships containing infantry forces, including the 332nd Company. The Republic ships were escorted by a force of Kom'rk-class fighter/transports."}, {"tag": "p", "text": "Mandalorian Prime Minister Almec, a puppet of Maul, prepared his forces of Mandalorian super commandos and readied Sundari's defenses. As the Republic-Mandalorian attack force neared the capital city, several gunships and transports were downed by incoming missiles. Shadow Collective commandos used their jetpacks to intercept the gunships in the sky, and troopers along with Mandalore resistance warriors flew out to repel them. The surviving ships touched down at Sundari, deploying the infantry troops, and a battle ensued."}, {"tag": "h4", "text": "Pursuit in the Undercity"}, {"tag": "p", "text": "The Shadow Collective commandos were pushed back by the invaders, and they retreated into the Undercity—with a squad of 332nd Company troopers in pursuit. Ahsoka Tano and Captain Vaughn led the group through the tunnels, but having lost track of the Shadow Collective, they were left vulnerable trying to find their bearings. Mandalorian super commando Rook Kast then revealed herself and fired a missile at them, which knocked Tano to the ground. She called after the clones to wait as they ran past her, but Vaughn didn't hear her warning. By the time she reached the clones, they had been ambushed and were all killed, including Vaughn."}, {"tag": "p", "text": "The Mandalorian super commandos then emerged from the tunnels and surrounded Tano, along with Maul. He was surprised that she had come instead of Kenobi or Skywalker. While he was talking, Tano covertly transmitted a beacon from her wristcomm to alert Commander Rex of her location. He led a squad of 332nd Company troopers into the Undercity to rescue her, following the signal. Rex and his men rescued Tano, but Maul and his followers escaped."}, {"tag": "p", "text": "Shortly after, a detachment of the 332nd Company was sent to reinforce C-deck. They were ambushed and massacred by the Shadow Collective. Maul took ARC Trooper CT-5597 \"Jesse\" hostage in order to torture him for information. A while later, after a pivotal duel between Tano and Maul, the Shadow Collective surrendered and the siege ended with a Republic victory."}, {"tag": "h3", "text": "Order 66"}, {"tag": "h4", "text": "Returning to Coruscant"}, {"tag": "p", "text": "Following the battle, with Maul in custody inside a Mandalorian vault, Republic forces returned to the Tribunal to transport Maul to Coruscant—although on the way, Order 66 was enacted. All of the clone troopers, including the 332nd Company, suddenly became hostile towards Tano. They were determined to kill her and Maul."}, {"tag": "p", "text": "When Order 66 was given, Rex opened fire on Tano. She deflected the shots with her lightsabers, and narrowly escaped from the room while under fire from multiple troopers of the 332nd Company. Rex ordered the troopers to search the ship for her. The 332nd Company split up into squads and hunted the ship. During the search, Ahsoka abducted Rex with the help of onboard astromech droids, knocking the commander out and taking him to the medical bay. She held off hostile clone troopers as Rex's inhibitor chip was surgically removed. After the removal of his chip, Rex was no longer affected by Order 66. He and Tano worked their way to the hangar, fending off troopers of the 332nd along the way."}, {"tag": "p", "text": "Meanwhile, Maul, who had been released by Tano as a diversion, fought his way to the hyperdrive room, killing many 332nd Company troopers, and collapsed the hyperdrive mid-jump, causing the Venator-class Star Destroyer to fall out of hyperspace in pieces. He then walked over to the hangar, and was confronted by more clone troopers. He used the Force to pick up metal siding to impale or decapitate the clones. A group of 332nd Company troopers, including Ridge, attempted to intercept Maul as he moved towards the hangar, but were unsuccessful. Ridge was knocked down and another clone was impaled by a piece of the wall."}, {"tag": "h4", "text": "Faceoff in the hangar"}, {"tag": "p", "text": "When Ahsoka and Rex reached the main hangar, a formation of the remaining clone troopers was waiting for them, led by the ARC Trooper Jesse. The formation included the remaining troops of the 332nd Company as well as other 501st units. Rex and Ahsoka came up with a plan, in which Rex brought Ahsoka down to the clone troopers at gunpoint, and claimed that she was no longer a Jedi so they had no reason to kill her. Jesse and Rex argued about the matter for a while, and then Jesse accused Rex of treason."}, {"tag": "p", "text": "However, the debate was a diversion to buy time, and at that moment Tano's group of astromechs dropped the hangar lifts which some of the troopers were standing on. This caught the clones by surprise, but they recovered and opened fire on Tano and Rex. The droids kept changing the elevation of the hangar lifts, to disorient them. By then, the vessel they were all on was about to crash into a nearby moon. Ahsoka and Rex escaped in a Y-wing, and Maul in a Nu-class attack/transport shuttle, but the clones on board were all killed when the ship crashed on the surface of the moon. Rex and Tano visited the crash site and buried the clone troopers they could find."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Years later, during the reign of the Galactic Empire, Anakin Skywalker—who had become Darth Vader —visited the site of the crash during an Imperial excavation. He observed the helmet of a 332nd Company trooper in the snow, and retrieved one of Ahsoka Tano's lightsabers which lay in front of the helmet."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Along with the officers Commander Rex and Captain CT-0292 \"Vaughn\", clone trooper Ridge was also assigned to the 332nd Company. As a company within the Grand Army of the Republic, the unit consisted of 144 clone troopers organized into four platoons when at full strength."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 332nd Company first appeared in the seventh season of Star Wars: The Clone Wars, in the episode \"Old Friends Not Forgotten\". When The Walt Disney Company cancelled Star Wars: The Clone Wars, a four-episode arc about the Siege of Mandalore was still in production. The company was first identified as the 332nd Company on April 14, 2020 in a StarWars.com blog post by Brendan Nystedt."}, {"tag": "p", "text": "The arc had production numbers 7.21, 7.22, 7.23, and 7.24, and was to depict Ahsoka Tano and this company of clone troopers attacking Mandalore. As part of the production process, Dave Filoni drew a sketch of the helmet worn by the company, and was shown in Celebration Europe in 2016. The sketch was labelled as the \"332nd.\" A portion of the arc was adapted into the prologue of the 2016 canon novel Ahsoka."}, {"tag": "p", "text": "On July 19, 2018, it was announced that Star Wars: The Clone Wars was returning with twelve new episodes, which would include the Siege of Mandalore. The helmet of the company was featured on the poster for the revival season, and finally appeared in completed animation in a trailer shown during Celebration Chicago in 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}