{"url": "Rakghoul_serum", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Tarisian culture", "Category:Vaccines and cures"], "nodes": [{"tag": "h1", "text": "Rakghoul serum"}, {"tag": "p", "text": "The Rakghoul serum was a medicine that cured the rakghoul plague, that once infected, would cause people to turn into rakghouls."}, {"tag": "p", "text": "During the Jedi Civil War a sample of the serum was created by Republic scientists and then replicated a few thousand times to cure the Outcasts during the Republic's restoration of Taris. The Republic had a base in the Upper City as the center of restoration as well as the location where the scientist perfected the cure. However, the Sith armada had taken notice of the planet and invaded. After driving the Republic out, they took control of the base for themselves. The Sith troopers used samples of the rakghoul serum for patrolling in the Undercity, in search of the crashed Republic escape pods from the destroyed Endar Spire. The Sith had so many encounters with the rakghouls that they ran out of serum by the time Revan entered the Undercity, although some troopers who were killed still had serum samples on their corpses."}, {"tag": "p", "text": "During his quest to leave Taris, Revan found a sample of the serum in the Undercity and gave it to Zelka Forn, the Upper City doctor. He was able to synthesize the serum, providing it for all infected, and gave a large amount to the Outcasts' healer Esala, who used it to treat the infected Outcasts during their journey to the Promised Land. When they reached the Promised Land, it was not as they expected. The buildings, resources, and defenses had all been bombed by the Sith. Without defenses, the rakghouls continued to attack the Outcasts, but the spread of the disease was held off by the serum. The rakghouls continued to evolve, however, and over several generations, developed an immunity to the serum. With no way of defending against the spread of the rakghoul disease, and with a bombed-out and diseased world all around them, the Outcasts were eventually wiped out."}, {"tag": "p", "text": "Around 3643 BBY, the rakghoul serum was rediscovered by pirates, who found a sample of the serum in Zelka Forn's long abandoned second medical facility in the Undercity. The serum was given to a Jedi, and eventually made its way into the hands of a Republic doctor. Unfortunately, the rakghouls had developed an immunity to the serum even before the Outcasts had been wiped out, so it was hardly any more effective over three hundred years later. A new serum would have to be created, and for that, a new person would need to be infected to produce new antibodies, which could then be analyzed and synthesized. The controlled infection was spread to a subject, the antibodies were collected, a new and improved serum was created, and once again, it was produced in masses."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The player can, for 1000 credits, sell the rakghoul serum to Zax in the Lower City bounty office. If the player's persuade skill is sufficiently high, they can convince Zax to pay 1500 credits instead. This course of action is considered non-canon."}, {"tag": "h2", "text": "Appearances"}]}