{"url": "Rakghoul_plague", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Articles to be expanded", "Category:Diseases and maladies", "Category:Sith magic", "Category:Tarisian culture", "Category:Weaponized plagues and viruses"], "nodes": [{"tag": "h1", "text": "Rakghoul plague"}, {"tag": "p", "text": "The rakghoul plague or rakghoul disease was a disease engineered by the ancient Sith Lord Karness Muur. Muur, seeking a means to escape death and achieve galactic conquest, forged a Sith amulet that came to be known as the Muur Talisman, an item into which Muur poured his mind, will, and Sith magic. The Muur Talisman's power could almost instantaneously turn any nearby sentient being into a mindless rakghoul, a Sith-spawned mutant subservient to Muur's will. But the talisman's power was not perfect, and it could not transform Force-sensitives or beings belonging to certain non-Human species into rakghouls, and thus Muur designed the rakghoul plague to compensate for this weakness. The virus-like plague, carried by every rakghoul in existence at the time, could be spread to another being by a bite or a scratch from a rakghoul's claw. The victim would then suffer through an incubation period lasting approximately six to forty-eight hours before being transformed into a rakghoul, one fully capable of spreading the Sith-made disease on to further victims."}, {"tag": "p", "text": "In the years before, during, and after the Mandalorian Wars, the rakghoul plague spread nearly unchecked through the Undercity of the planet Taris, and well over a million Mandalorian Neo-Crusaders fell victim to the plague's effects on the ice-covered world of Jebble. Though the rakghouls were widely thought to have become extinct at a time prior to the rise of the Galactic Empire in 19 BBY, the rakghoul plague—and by extension, the rakghouls themselves—would continue to exist in the galaxy by the powers of the Muur Talisman until 137 ABY, when the dangerous Sith artifact was finally destroyed by the Jedi Cade Skywalker on the Deep Core Imperial world of Had Abbadon."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The primary means for the spread of the Sith-spawned rakghouls was through the Sith magic of the Muur Talisman, a Sith amulet forged by the ancient Sith Lord, Karness Muur. In the hands of Muur, or in the possession of another Force-user following Muur's death, the talisman's power transformed any sentient being without a connection to the Force into a rakghoul. Even protective suits designed to shield a wearer from harmful germs or chemicals could not hold off the effects of the Sith magic. But the rakghoul plague in its most infamous form existed as a virus-like disease, which Muur engineered as a means of circumventing the talisman's weakness: Force-sensitives and a number of non-Human species were immune to the effects of the talisman. This disease, as its name implied, was a plague that could be spread from an existing rakghoul by means of a bite or scratch from its claw, infecting the victim from even the smallest wound. Following contact with a rakghoul, the progression of the infection was a rapid and painful experience. Incubation periods for the disease differed between species, but a period of six to forty-eight hours was typical. A victim's body would become twisted, and the pigmentation of the skin became paled to a whitened, corpse-like state, and bleeding from the eyes, mouth, and skin were not uncommon. Not long after this point, the victim underwent a bodywide mutation, their body growing and transforming into a rakghoul similar to the creature that infected them, and capable to spreading the rakghoul plague to another. This included the victim`s five toes would become feet with three big claws, Spikes growing over their body, teeth becoming much larger, sharper, and deadlier, and victims's hands becoming huge clawed tearing machines. The transformation was usually very painful for any victim. In some cases a victim had been so badly injured by a Rakghoul that they wanted the transformation to happen sooner so the pain would end."}, {"tag": "p", "text": "Aside from the physical effects of the rakghoul plague, the mental and psychological effects the disease had upon its victims was significant. Once transformed into a rakghoul, the original being's intelligence was seemingly lost, and most thought so little of the mental capacity of the common rakghoul as to denote them as \"mindless\". In truth, however, the plague destroyed only the personality of the infected, leaving behind the being's knowledge and skills they had accumulated in their former lives. Left on their own, rakghouls behaved as beasts, serving their base instincts and existing as slaves to their own hunger. But if a being skilled in the powers of the Force were to wield the Muur Talisman, the rakghouls would be able to draw upon those latent skills and abilities to be used in service to the talisman's possessor, even utilizing weapons and operating equipment. Unfortunately for the transformed beings, though, their original personalities could not be restored once they became rakghouls, and these seemingly more intelligent creatures operated only on an imprint left behind of their former lives."}, {"tag": "h3", "text": "Variants"}, {"tag": "p", "text": "There were two known variants of the rakghoul plague virus: the Bozan strain and the Hirano strain. They differed because of the mutation of a Clawdite-derived gene sequence although it was not expanded on which was modified from which."}, {"tag": "p", "text": "The rakghoul plague was often thought to be without a cure, and that the most merciful option was to kill the unfortunate afflicted before the plague could be spread further, but there were two known methods that did indeed exist with the capability to halt the rakghoul transformation in a victim infected with the plague. A serum had been found during the time of the Jedi Civil War, by Darth Revan and Malak's Sith Empire, and their Sith troopers often carried vials of the curative serum on their person during trips into the Undercity of the planet Taris, where the number of rakghouls was highest. The serum would be administered in the period of time prior to the victim's transformation, halting the progression of the infection and preventing the rakghoul mutation. Another means was discovered by a Jedi by the name of Cade Skywalker thousands of years later, during the Second Imperial Civil War. After he and his companion, Azlyn Rae, had been infected with the rakghoul plague, Skywalker used his radical healing ability to purge them of the plague, curing and saving them both."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Introduction to the galaxy"}, {"tag": "p", "text": "The rakghoul plague was originally created by the Sith Lord Karness Muur. Muur was one of the Dark Jedi Exiles who were banished to the Sith-controlled world of Korriban, following their defeat at the Battle of Corbos which ended the Hundred-Year Darkness. Like many of his contemporaries, Muur used the power of the dark side of the Force to manipulate life. Muur's prized achievement was the flesh-eating rakghouls and he believed that the rakghouls would be the army he would use to conquer the galaxy, using the rakghoul plague to turn his enemies into his slaves. Using his Sith magic, Muur could transform any nearby sentient into a mindless rakghoul, but he found there were exceptions, however, as both Force-sensitive beings and beings from a number of non-Human species proved immune to the talisman's effects. To combat this flaw, Muur engineered a new form of the rakghoul plague, a virus-like disease that could be spread from a rakghoul's bite or a scratch from its claws. The infected victim, no matter the species or Force-sensitivity, would then slowly mutate into a rakghoul within a timeframe spanning mere hours. Muur's ambitions for galactic conquest would be dashed after he was killed by jealous rivals, but Muur's spirit lived on through the Sith amulet he had forged in life, into which the Sith Lord had poured his mind, will, and the power to transform nearby beings into rakghouls. Possession of Muur's talisman was fleeting following his death, and eventually the talisman fell into the hands of a being who brought it to the Outer Rim world of Taris where a cave in deep within the decrepit Undercity left the talisman's owner dead and the Sith amulet forgotten in the bowels of the planet. There, the rakghoul plague ran rampant, and countless beings were infected. However, the government of Taris made little effort to fight the spread of the plague as it was contained in the lower levels of the ecumenopolis, a region occupied in large part by Taris' criminal underclass."}, {"tag": "p", "text": "It was not until the Mandalorian Wars that the talisman would be rediscovered, by a Mandalorian Neo-Crusader search team led by the Mandalorian scientist Pulsipher. Pulsipher took the talisman from Taris to the Mandalorian-held world, Jebble, infecting a cadre of his soldiers with the rakghoul plague aboard his ship while en route. There, the infected Mandalorians transformed into rakghouls and attacked their former comrades, spreading the plague further in a cascading chain that led to the transformation of almost every Mandalorian and Neo-Crusader recruit on Jebble. Pulsipher lost possession of the talisman to the Jedi Knight Celeste Morne, who chose to entomb herself and the dangerous Sith artifact inside the Sith Lord Remulus Dreypa's oubliette—on Jebble and among other Force-related items Pulsipher had been collecting—in order to prevent the further spread of the plague. Mandalorian commander Cassus Fett, upon being warned of the rakghoul plague outbreak on the planet's surface by Jedi Padawan Zayne Carrick, chose to orbitally bombard Jebble with nuclear missiles in order to destroy the infection. The rakghouls were all destroyed in the attack, and the oubliette containing Morne sunk beneath the seas formed as Jebble's glaciers melted from the immense heat."}, {"tag": "p", "text": "Though the Muur Talisman was gone, Taris continued to be afflicted by the rakghoul plague in the years leading up to the Jedi Civil War. The Undercity remained heavily infested and more were infected with the rakghoul plague regularly, after being scratched or bitten. By that point, it was estimated that over sixty million beings on the planet had been infected by the rakghoul plague. The Sith Empire formed by the former Jedi Knights-turned-Sith Lords, Darths Revan and Malak came to occupy Taris during the new war between their new Sith and the Jedi Order. With them came a curative serum for the rakghoul plague, capable of healing those infected by the rakghoul plague who had yet to complete the transformation, but the Sith restricted access to the serum to those Sith troopers that were sent down into the Undercity."}, {"tag": "p", "text": "An amnesiac Revan—his memory of his time as a Sith Lord after falling to the dark side removed by the Jedi Council—later found a vial of the curative serum on the body of a dead Sith trooper while on Taris, and used it to heal several Undercity residents infected with the rakghoul plague before finally giving it to the Upper City doctor, Zelka Forn. Forn was able to use this sample to synthesize a mass-produced serum that could be sold at a low price to all Tarisians."}, {"tag": "p", "text": "Shortly after, Taris was subjected to a devastating orbital bombardment by Darth Malak's Sith armada, killing an untold number of beings on the planet, including a significant number of rakghouls."}, {"tag": "h3", "text": "The Cold War"}, {"tag": "p", "text": "However, many rakghouls survived the bombardment, and terrorized the Outcasts and other survivors. The Outcasts, who had rediscovered their Promised Land—which was actually the original Taris colony site—survived through use of the rakghoul serum that Revan had given them, but their later generations ran out of the serum and were eventually killed."}, {"tag": "p", "text": "Almost three hundred years after the bombardment, the Republic decided to begin a resettlement project on the planet. Many believed that restoring the planet would serve as a symbol that the Republic would recover from the Great Galactic War and triumph over the Sith Empire, and the Republic Military established a presence there to protect the settlers. The rakghouls had thrived and once again terrorized the inhabitants of the planet, roaming the overgrown ruins of the city. Around 3643 BBY, a group of rakghouls were discovered in the eastern Tularan Marsh that had been exposed to a mixture of chemicals and radiation, mutating and strengthening them."}, {"tag": "p", "text": "Around that same time, Professor Sadus Vraal and Mola Haxtor discovered that a subspecies of rakghoul had developed nearby—the Force-sensitive nekghouls. With the help of a Republic-allied individual, they investigated the factory that the nekghouls were inhabiting, but the individual discovered that the holocron of Bay-Yon Siu, a Jedi of the Sanej Temple, was teaching the nekghouls. The Jedi Knight Danah Jor had attempted to destroy the nekghouls, but had been captured, and Siu convinced the individual to allow the nekghouls to live while he taught them the ways of the light side."}, {"tag": "p", "text": "The Tionese scientist Doctor Sannus Lorrick weaponized and released a strain of the plague on the planet Kaon to get revenge on the Tion Hegemony for disgracing him. He fled to Ord Mantell, where he set up an island base and continued his experiments."}, {"tag": "p", "text": "Lorrick also gave an infected risp to the smuggler Zama Brak, who boarded the passenger liner Stardream departing Ord Mantell. The risp spread the plague among almost all of the crew and the 492 passengers aboard in the matter of fifteen days, causing the infected captain Magnus to crash the ship into the Dune Sea on the planet Tatooine. As the ship broke up on its descent, it spread wreckage and escape pods filled with infected passengers across the Dune Sea and the neighboring Jundland Wastes, forcing both the Republic and the Empire to declare the planet a quarantine zone. Imperial and Republic containment troops deployed immediately to the planet, stopping all infected from leaving the planet. The plague also infected many of the native Tusken Raiders and wildlife, including banthas, reeks, and wraids. The outbreak would eventually turn to a massive pandemic."}, {"tag": "h3", "text": "Outbreak"}, {"tag": "h4", "text": "Awakening"}, {"tag": "p", "text": "Over time, the rakghouls were isolated on Taris and—likely due in part to the serum Revan recovered—driven to extinction. However, while the Muur Talisman remained, the threat of the rakghouls did as well. Approximately fourteen hundred years before the galaxy-spanning Clone Wars, ice miners discovered the oubliette of Dreypa beneath the surface of Jebble. A mystery to it finders, the oubliette became known as the \"Jebble Box\", and the inability to open it or scan what was inside bred numerous rumors as to its origins. Collectors bought and sold the box they believed to be an ancient Jedi treasure, and wars were even fought over the mysterious object. In 19 BBY, the crew of the starship Uhumele brought the box to a desolate moon with the intent to sell it to the scholar and antiquities collector Fane Peturri; Peturri was in league with Darth Vader and his Sith Master, Darth Sidious, and the black-armored Sith Lord released Celeste Morne from stasis. Upon finding her rescuer to be a Sith, Morne attacked Vader and engaged him in a battle of lightsabers. When Vader proved too powerful, Morne was forced to use the Muur Talisman to unleash the rakghoul plague and save herself, transforming Vader's stormtroopers into rakghouls that subsequently attacked their former commander. Vader fled, but the activation of the talisman's magic had an unintended side effect: the talisman transformed the only human member of the Uhumele's crew into a rakghoul as well, and the ship's captain was forced to kill her. Vader fled, as did the Uhumele crew, leaving Morne alone on the moon with only the rakghouls she had spawned and the spirit of Karness Muur for company."}, {"tag": "h4", "text": "Spreading infection"}, {"tag": "p", "text": "Close to twenty years passed, but Vader did not forget the events that transpired on that barren moon. Nine months after the Battle of Yavin, Vader ordered a scouting party to the desert moon to ascertain the fate of Morne. When the shuttle of stormtroopers neared the moon's surface, Morne used the Force to drag the shuttle down before transforming everyone aboard with the talisman-borne rakghoul plague. Now sure that Morne did indeed still live, Vader tasked his spy, Wyl Tarson, with instructions to leak word of a secret Imperial weapon located on the moon, and ensure that it was noticed by members of the Alliance to Restore the Republic, a group of rebels that had been formed in the years since Vader had first confronted Morne as a force to oppose the oppressive Empire and restore the Republic that it had once been. A small team of \"Rebel Alliance\" members traveled to the moon, unable to resist the lure of the potential victory over their Imperial enemies. Almost immediately upon setting down, however, the strike team was beset by Morne's rakghoul horde, and a number of them were infected by the rakghoul plague during the resulting skirmish. One group of rebels were able to escape the attack aboard Captain Han Solo's personal ship, the Millennium Falcon, while rebel leader Princess Leia Organa and friend Luke Skywalker were momentarily left behind with the former clone trooper, Able."}, {"tag": "p", "text": "Morne, having suffered through nearly twenty years with none but the corrupting presence of Karness Muur's spirit as a companion, had become convinced that the Jedi had abandoned her and attacked the Force-sensitive Skywalker. When Organa attempted to assist him and Morne turned her blade on her instead, Able rushed to the Princess' defense only to fall victim to the rakghoul plague and be transformed into a rakghoul. When Muur's spirit realized the untapped Force potential within both Skywalker and Organa, he detached his talisman's hold on Morne and attacked Skywalker. Coming to her senses, Morne batted the Sith amulet away and retook the burden onto herself. Her control over Muur regained, Morne turned away from the two rebels and boarded the shuttle they had arrived on the moon with, and departed with her legion of rakghouls, leaving Skywalker and Organa to flee aboard the returned Millennium Falcon. As she passed out of the moon's orbit, Morne flew by a waiting Imperial-class Star Destroyer, turning the crew into rakghouls with the talisman's plague before vanishing into space as the capital ship crashed into the surface of the moon and was destroyed."}, {"tag": "h3", "text": "A partial remedy"}, {"tag": "p", "text": "Over a hundred years passed as Morne traveled the galaxy, before being taken aboard the Pellaeon-class Star Destroyer, Iron Sun in 127 ABY. Believing the cruiser to be in the employ of the Empire she had awoken to under Vader and Palpatine, Morne unleashed the rakghoul plague upon the Star Destroyer, transforming the Iron Sun's crew into a new rakghoul army. Another ten years passed before the commandeered Iron Sun took on new captives: the crew of the Mynock, led by Cade Skywalker and on a mission to assassinate the current Dark Lord of the Sith, Darth Krayt. The crew was shortly attacked by rakghouls, and during their efforts to repel the beastly aggressors, Skywalker was bitten and his Imperial Knight companion, Azlyn Rae, scratched, both becoming infected with the rakghoul plague. Celeste Morne was able to halt the rakghouls' attack after reasserting control, but when she discovered the two had been infected, the Jedi took it upon herself to isolate Skywalker and Rae from their companions, imprisoning them within a detention cell while she promised each a swift death after the transformation occurred. To her surprise, however, Skywalker was able to use his tremendous Force-healing ability to cure himself and Rae of the plague, impressing Morne and earning the Mynock crew a new ally against Krayt."}, {"tag": "p", "text": "Skywalker's team launched an attack on the Imperial base located on the Deep Core planet of Had Abbadon, shortly after. There, Morne transformed a number of the base's stormtroopers into rakghouls, who then aided the group in battle against the Devaronian Sith Lord, Darth Reave. Reave was wounded by the rakghouls, and fled back to Coruscant where he delivered a report to Darth Krayt at the Temple of the Sith. During the meeting, Reave succumbed to the effects of the rakghoul plague and transformed into a rakghoul, attacking his former Sith allies before being struck down by Darth Stryfe. Taking the bait laid before them, Krayt and a cadre of his loyal Sith traveled to Had Abbadon where they were ambushed by Skywalker and his group; Morne unleashed her rakghoul horde on Darth Krayt, but the combined force of Krayt's Force lightning and Darth Stryfe's protective lightsaber defense cut the rakghouls down in droves. Still, the Sith fell to Skywalker's team and Krayt himself was dealt a mortal wound by Azlyn Rae that left everyone involved believing Krayt dead. In the battle's aftermath, Morne asked that Skywalker end her life, knowing she was losing her battle for control with the spirit of Karness Muur. Skywalker solemnly granted her wish and took her life with his lightsaber, only for the Muur Talisman to target Skywalker as its new host. However, Skywalker had no interest in the power Muur offered, and instead used the Force to destroy the talisman once and for all, putting an end to its ability to spread the rakghoul plague. Though the Muur Talisman was gone, any rakghouls that continued to live after the events on Had Abbadon, still carried the potential to spread the rakghoul plague to other victims."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}