{"url": "Rako_Hardeen/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Assassins", "Category:Bounty hunters", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Rako Hardeen"}, {"tag": "p", "text": "Rako Hardeen was a Human male bounty hunter and marksman from the planet Concord Dawn who was active during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Originally from Concord Dawn, Hardeen was once a member of the mercenary group known as Marvasa's Marauders in the Cyrillian Protectorate. During the Clone Wars, Hardeen found himself a pawn in a complex plot to foil an assassination attempt on Supreme Chancellor Palpatine organized by Moralo Eval and Count Dooku. He was hired by an anonymous client, actually members of the Jedi High Council, to murder Jedi Master Obi-Wan Kenobi by shooting at him from the top of a building on Coruscant. After shooting Kenobi in the chest as he had agreed, Hardeen was pursued by Anakin Skywalker. The bounty hunter managed to escape using smoke grenades and a speeder bike."}, {"tag": "p", "text": "While celebrating his high-profile kill at Trueping's cantina, he was summoned into the back room to meet his employer and receive payment. There, he was met by Jedi Masters Mace Windu and Obi-Wan Kenobi–his supposed victim, now physically altered to look like him. Hardeen was apprehended by the two Jedi, and his identity assumed by Kenobi in order to plant himself in a Republic prison. Hardeen's reputation for having killed a Jedi was essential to the plan, as Kenobi used it to gain the trust of other prisoners and attract the attention of Moralo Eval, from whom Kenobi was to acquire intelligence that would help the Jedi prevent the assassination attempt. To gain intel, Obi-Wan Kenobi had to join Eval and Cad Bane to escape from the prison through the morgue. Bane had the security code wrong, which prompted Kenobi to use the Force to open the security door, saying he needed Moralo and Bane to watch for guards to conceal his true identity. After making a hasty escape from the prison, the trio headed for Nal Hutta for a new ship and weapons. After arriving onto the planet, Kenobi, still disguised as Hardeen, was betrayed by Cad Bane, and was arrested shorty after. Eventually, he got free from the planet after the betrayal of Bane. They both went to the planet where Eval had a test for some bounty hunters. Kenobi, as Hardeen, passed all the tests and gained the trust of Bane. Moralo, however, wanted to prove that \"Rako Hardeen\" was not going to be as effective of a leader as him, after Count Dooku suggested the two fight to the death. Eval lost his fight against Kenobi, and Dooku gave the order to kill Eval, but Kenobi couldn't bring himself to kill him. Kenobi then had to execute the plan but took contact with the Jedi guarding the Sun Festival."}, {"tag": "p", "text": "The plan was executed perfectly. They lost some bounty hunters and Kenobi revealed himself when Anakin and Mace Windu showed up."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rako Hardeen first appeared in the Star Wars: The Clone Wars television series episode \"Deception.\" He was voiced by James Arnold Taylor, who also provided the voice of Obi-Wan Kenobi on the series."}, {"tag": "p", "text": "The helmet that Obi-Wan wore while impersonating Hardeen was based on early concept art for Boba Fett's helmet."}, {"tag": "p", "text": "Originally, the episode \"The Box\" would have included a storyline in which Anakin Skywalker would have searched for the real Hardeen once he discovered that Kenobi was alive. Though the Jedi High Council would have denied Hardeen's existence, Skywalker would have intercepted Captain Rex transferring Hardeen off-world, leading the Council to divulge the truth. The thread was cut for time constraints, clarity and character focus, in addition that Rex would have kept a secret from Anakin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}