{"url": "332nd_Division", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Grand Army of the Republic divisions"], "nodes": [{"tag": "h1", "text": "332nd Division"}, {"tag": "p", "text": "The 332nd Division of the Grand Army of the Republic was active late in the Clone Wars fought between the Galactic Republic and the Separatist Alliance. The division was created as part of the 501st Legion when the legion's commanding officer, Jedi General Anakin Skywalker, had to divide his forces so that half could participate in the Battle of Coruscant while the other half could launch the Siege of Mandalore."}, {"tag": "p", "text": "In order to lead the division, Clone Captain CT-7567 \"Rex\" was promoted to Clone Commander, while former Jedi Padawan Ahsoka Tano served alongside the unit as an advisor. The 332nd Company, which predated the unit's formation, became part of the new division."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The 332nd Division was created within the 501st Legion of the Grand Army of the Republic during the Clone Wars. It was led by Clone Commander CT-7567 \"Rex,\" who was promoted to lead the military unit, with former Jedi Padawan Ahsoka Tano serving as an advisor to the sub-unit."}, {"tag": "p", "text": "Clone Captain CT-0292 \"Vaughn\" and Clone Lieutenant CT-5597 \"Jesse\" served as officers within the division, commanding the 332nd Company, which consisted of clone troopers equipped with Phase II clone armor and the standard blue markings of the 501st and existed prior to the division's formation. However, their helmets featured red-orange markings in a stylized version of Ahsoka Tano's facial markings and skin tone— representing the clones' camaraderie to the 501st's former Jedi officer. A number of All Terrain Tactical Enforcers and troopers who utilized JT-12 jetpacks were also part of the division."}, {"tag": "p", "text": "The 332nd Division containing the 332nd Company was also made up of clone trooper pilots in armor with green or grey and dark red markings manned gunships and fighters of the division with the assistance of clone trooper flight crew. The military unit worked alongside the Supreme Chancellor's clone shock troopers, who accompanied the division aboard the Venator-class Star Destroyer Tribunal designated from Mandalore to Coruscant, as well as clones without armor markings, in addition to clone troopers bearing the standard blue markings of the 501st."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "Following her trial, former Jedi Padawan Ahsoka Tano eventually returned to serve the Galactic Republic even after her departure from the Jedi Order. Tano, along with members of the Mandalore resistance, had arrived to propose a joint operation to remove the Shadow Collective and defeat renegade Sith Lord Maul from Mandalore. After the meeting, Tano met with her former master, Jedi Knight Anakin Skywalker, and walked towards a hangar while conversing that clone troopers shouldn't be saluting her and calling her Commander. Skywalker stated that it was a sign of respect and loyalty, as the clone troopers were aware of her efforts during the Clone Wars."}, {"tag": "p", "text": "Eventually, they reached the hangar where Clone Captain CT-7567 \"Rex\" stood beside the 332nd Company and called them to attention. Tano walked among them in surprise, noting that they had customized their helmets in a stylized version of her face. Skywalker told her that as soon as they knew she was returning, they customized their helmets. Captain Rex continued that, although the paint job was crude, it was effective and that they were glad she had returned."}, {"tag": "p", "text": "After Kenobi arrived to the hangar relaying the news that the Battle of Coruscant had commenced and that their forces would be enroute shortly, Tano argued that the Jedi was once again turning their back on people in need. In an attempt to find a solution, Skywalker recommended that he would divide the 501st Legion and create a new division that Tano could lead. Kenobi countered, however, stating that Tano was no longer a Jedi Commander within the Grand Army of the Republic and as such no longer being able to officially lead a contingent of large Republic forces. Skywalker then suggested that Captain Rex should be promoted from Clone Captain to Clone Commander so that the seasoned officer could lead Republic Military forces independently, including the 332nd Company, and take Tano as an advisor, which Kenobi agreed to."}, {"tag": "h3", "text": "Initial invasion"}, {"tag": "p", "text": "Preparing for the siege, three Venator-class Star Destroyers arrived above Mandalore and deployed a large contingent of LAAT/i gunships and LAAT carriers that were accompanied by a large force of Kom'rk-class fighter/transports. Mandalorian Prime Minister Almec, a puppet of Maul, contacted Republic leadership about the invasion, complaining of their forces' violation of a long-before established peace as his forces of Mandalorian super commandos prepared for combat. With Sundari's defenses readied, Maul's men made for their battle stations. As the Mandalorian-Republic attack force neared the capital city, a salvo of missiles were fired, downing several gunships and transports."}, {"tag": "p", "text": "Shadow Collective commandos then attacked the joint force by boarding the transports and killing their passengers. Mandalore resistance troopers and several troopers launched from numerous gunships to repel the attackers as anti-aircraft fire pelted the attack group. Tano joined in the defense, jumping from transport to transport while defeating the commandos. She then jumped to a nearby gunship that was critically hit and began descending. After rescuing the pilot, Tano held on to the gunship until it was near the Sundari shipping docks and leapt to the surface. As she engaged Mandalorian super commandos, the rest of the joint force began arriving with the arrival of Mandalore resistance fighters and the division's troopers, despite losing several gunships and a carrier. Shortly after, gunships began landing at the docks and deployed standard clone troopers, and the Republic managed to quickly capture the area."}, {"tag": "p", "text": "The Mandalorian-Republic joint force began making inroads into the city, with the Republic division and Mandalore resistance engaging the Shadow Collective's forces on pedestrian walkways and city buildings. Despite the defenses of Shadow Collective, the joint attack force managed to give the Mandalorian commandos stronger opposition than they anticipated, and began reaching the Sundari Royal Palace. Captain CT-0292 \"Vaughn\" and his force of troopers engaged Mandalorian Commander Gar Saxon, one of the leadership of the Shadow Collective, and forced him and his commandos into the Undercity."}, {"tag": "p", "text": "Giving chase, the skirmish continued there until Saxon and his troops retreated deeper into the Undercity's tunnel system. By this time, Tano, Mandalore resistance leader Lady Bo-Katan Kryze, Commander Rex, and their forces looked on from a staging area as the battle widened throughout the city. Gunships flew sorties as the 332nd's clone troopers and the Mandalore resistance fighters fought against Shadow Collective forces. After Saxon retreated, Captain Vaughn contacted Commander Rex and informed him that he and his troops located and fought Saxon in the Undercity. Tano advised Commander Rex to secure the docks and cut off escape routes, while Kryze and her forces stormed the Sundari Royal Palace and captured Almec."}, {"tag": "h3", "text": "Ambush in the Undercity"}, {"tag": "p", "text": "While Kryze stormed the palace, Tano and several clone troopers arrived to an access point and linked with Captain Vaughn and the surviving clones who were cutting off an access point in the Undercity. After Vaughn gave Tano a status update, Tano led Vaughn and the other clones into the tunnel system in an attempt to locate the Shadow Collective's forces. Shadow Collective leader Rook Kast and a large group of commandos began to flank them from adjacent tunnels, waiting for the right moment to ambush. Kast then launched a missile at the Republic unit which killed a trooper and disoriented the others, including Tano. Although Tano told the others not to advance, Vaughn led a charge and was followed by the remaining clone troopers. As Tano attempted to locate her unit, the Mandalorian commandos began attacking and killing off the clones."}, {"tag": "p", "text": "Eventually, Tano reached a central point in the tunnel system and discovered several dead clones and Vaughn critically injured and laying on the floor from a chest wound. As Tano grabbed Vaughn's hand, Vaughn apologized for failing his commander and perished. Tano was then surrounded by the Mandalorian commandos, and confronted by Maul himself, who expected Kenobi instead."}, {"tag": "h3", "text": "Tracking down Maul"}, {"tag": "p", "text": "Eventually, Tano and Maul separated and a contingent of standard division clone troopers moved through the Undercity with the mission of reinforcing C-deck. The contingent, however, was ambushed by Maul and sustained heavy casualties. The contingent was being accompanied by Clone Lieutenant and Advanced Recon Commando CT-5597 \"Jesse,\" who was kidnapped by Maul during the encounter. Eventually, reinforcements arrived, including Tano and Rex. After a clone trooper of the unit updated Tano and Rex on the contingent's objective, Tano advised Rex to confirm that C-deck was properly reinforced. As Rex left, Tano walked to clone trooper Sterling, who had been wounded in the fight by a blaster wound to the chest. Sterling updated Tano on the events of the encounter, including that Jesse was taken alive by Maul after Maul ascertained that he was older and looked into Jesse's mind."}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "After the Siege of Mandalore, the division was heading back to Coruscant on the Venator-class Star Destroyer Tribunal when Order 66 was enacted. All clone troopers aboard became hostile towards Ahsoka Tano. After Tano abducted Commander Rex and surgically removed his inhibitor chip, the division turned on Rex and fell under Jesse's command. They intercepted Tano and Rex in the hangar, blocking them from escaping. Jesse and his men accused Rex of treason and opened fire. A skirmish occurred, with Tano and Rex narrowly escaping the merciless division before the ship crashed into the surface of a moon, killing everyone who remained on board."}, {"tag": "p", "text": "Tano and Rex landed on the moon and recovered the bodies of Jesse and as many of their former comrades as they could. The pair honored the soldiers by burying them and placing their helmets on posts of wood as grave markers. Before departing, Tano stood over the graves and mourned the loss of life before abandoning her remaining lightsaber at the crash site."}, {"tag": "p", "text": "Elsewhere, the newly-formed Galactic Empire chose to take control of Mandalore by launching a planetary occupation with the clone troopers still on planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 332nd Division first appeared in the seventh season Star Wars: The Clone Wars episode \"Old Friends Not Forgotten\" albeit unnamed, directed by Saul Ruiz and released in 2020. It was first named in The Star Wars Book, published by Dorling Kindersley in the same year."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}