{"url": "Ramming", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Naval tactics"], "nodes": [{"tag": "h1", "text": "Ramming"}, {"tag": "p", "text": "Ramming was a naval tactic in which starships would be used as physical weapons and collided with enemy starships. It was used during the Clone Wars, the Galactic Civil War, and the First Order/Resistance War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The ramming tactic consisted into using the mass of a starship hull as a weapon and thrust it at maximum speed into another ship, so that it would damage or destroy either critical systems or the whole target. It was mostly regarded as a last chance action, as the end result would also damage, if not destroy the ship who engaged in such tactic. Its effects would vary, depending of the sizes of both ships, and where they made contact."}, {"tag": "p", "text": "The usage of the ramming tactic knows some variety. It could be prepared in advance (by adding explosive to a ship, for example), or be the result of a snap decision. Either way, in certain case, it could be classified as a suicidal attack, as pilots were well aware that engaging in such maneuver could damage or destroy their spacecraft."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "Both the Galactic Republic and the Confederacy of Independent Systems had recourse of the ramming tactic during the Clone Wars. Anakin Skywalker employed such tactic to destroy Mar Tuuk's Lucrehulk-class Battleship during the Battle of Ryloth, while himself escaped by using an escape pod.. Earlier during the battle, swarms of Vulture Droids had done the same to the Defender, as well as the Resolute and the Redeemer. The damage was so great to the Redeemer that it blew apart. In the same fashion, Venator-class Star Destroyer hijacked by CIS droids commanded by a super tactical droid, and equipped with rhydonium canisters, was to collided with the space station Valor. This plan was thwarted by D-Squad. At the Battle of Sullust, Hyena-class Droid Bombers were ordered by TJ-912 to ram into the hangar of a Providence-class Dreadnought in order to kill Ventress, while in a confrontation with Obi-Wan Kenobi and Anakin Skywalker."}, {"tag": "p", "text": "Later in the war, the Silver Angel, piloted by Trace Martez, engaged in a ramming maneuver against a pursuing Pyke patrol ship, after its gun was destroyed. However, the Pyke ship tried to dodge, and ended up crashing itself."}, {"tag": "h3", "text": "Rebellion against the Empire"}, {"tag": "p", "text": "During the Battle of Atollon, Commander Jun Sato rammed Phoenix Nest into Admiral Kassius Konstantine's Interdictor-class Star Destroyer to allow Ezra Bridger to escape so that he can get help from Sabine Wren. Later, at the Battle of Scarif, Admiral Raddus ordered the Sphyrna-class Hammerhead corvette Lightmaker to ram into the Imperial I-class Star Destroyer Persecutor, pushing it into another Star Destroyer, the Intimidator, causing all three ships to crash into and destroy Scarif's Shield Gate. In the Battle of Endor, a Rebel pilot, Green Leader Arvel Crynyd, piloted his severely damaged A-wing into the bridge of the Super Star Destroyer Executor. This sent the massive, out of control dreadnought straight into a doomed collision with the Death Star II."}, {"tag": "h3", "text": "Resistance against the First Order"}, {"tag": "p", "text": "During the attack on the Resistance fleet, after the Supremacy started shooting down escaping U-55 orbital loadlifters, Vice Admiral Amilyn Holdo used the Raddus to ram into the Mega-class Star Dreadnought at lightspeed, destroying itself and twenty of the escorting Resurgent-class Star Destroyers in the process. The same maneuver was later used over the forest moon of Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}