{"url": "Ralph_McQuarrie", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Articles to be expanded", "Category:Concept artists", "Category:Deceased actors", "Category:Star Wars: Episode V The Empire Strikes Back actors", "Category:Comic book cover artists", "Category:Reference work artists", "Category:Card game artists", "Category:Cover artists"], "nodes": [{"tag": "h1", "text": "Ralph McQuarrie"}, {"tag": "p", "text": "Ralph McQuarrie was a conceptual designer and futurist responsible for many of the designs and aesthetics featured in the original trilogy. He also provided concept illustrations for Star Wars: Shadows of the Empire and the illustration of the Ark of the Covenant seen in a Bible near the beginning of Raiders of the Lost Ark. He often went by the initials \"RMQ,\" which he used as his signature. McQuarrie was tuckerized via a cameo in The Empire Strikes Back as General Pharl McQuarrie."}, {"tag": "p", "text": "Most of his concept art is featured in The Illustrated Star Wars Universe and The Art of Ralph McQuarrie. It was also featured in the 2014 title The Adventures of Luke Skywalker, Jedi Knight, authored by Tony DiTerlizzi. In the 30th Anniversary toy series, McQuarrie's concept art is turned into actual action figures. Such figures include a concept Chewbacca, a concept Han Solo, a concept Darth Vader, a concept Starkiller hero (the precursor to Luke Skywalker), two separate releases of the concept stormtrooper and a concept snowtrooper."}, {"tag": "h2", "text": "Star Wars work"}, {"tag": "h3", "text": "Films"}, {"tag": "p", "text": "Star Wars Art: Ralph McQuarrie, a collection of McQuarrie's Star Wars artworks, was released on September 27, 2016. The set had a foreword by George Lucas and featured over 2,000 illustrations rescanned and rephotographed from conceptual paintings, costume designs, storyboards, book covers, and Lucasfilm holiday cards."}, {"tag": "h3", "text": "Influence on Star Wars Rebels"}, {"tag": "p", "text": "McQuarrie's work has influenced the TV series Star Wars Rebels in multiple ways."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}