{"url": "Rally_Master", "categories": ["Category:Legends articles", "Category:Mandalorian titles", "Category:Military ranks"], "nodes": [{"tag": "h1", "text": "Rally Master"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Neo-Crusader Rally Master was the middle rank of the Mandalorian Neo-Crusader movement during the Mandalorian Wars. Wearing the crimson armor of the Neo-Crusaders, they were easily recognized as figures of authority by the Mandalorian ground forces, and generic Neo-Crusaders were expected to look for and listen to them."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the early days of the Neo-Crusader movement, the Rally Masters worked independently. The position was originally earned by impressing Field Marshals, making the position very valuable. Being the closest thing the Mandalorians ever came to officers, they functioned as drill sergeants, commanders and more importantly political officers, spreading the ideals of the Neo-Crusaders amongst the Mandalorian forces. As the Field Marshals increased in numbers, many Rally Masters complained about too much division, as they began to lose their independent command. Rally Masters also oversaw the training of new converts during the Mandalorian Wars, and in training centers on captured worlds they indoctrinated these recruits to the Neo-Crusader way."}, {"tag": "p", "text": "Later in the Mandalorian Wars, the position became corrupt and the quality of warriors who held the position declined rapidly. The position became increasingly devalued, and to achieve promotion later on a warrior only needed to know Mando'a and some of the Mandalorian ways."}, {"tag": "p", "text": "During the Cold War between the Sith Empire and the Republic, long after the demise of the Neo-Crusader movement, the rank of Rally Master was still present among the Mandalorian forces. In that time, the colors signifying the rank had changed from crimson to a dark gold with silver and blue highlights."}, {"tag": "h2", "text": "Known Rally Masters"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}