{"url": "Ranat/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Outer Rim Territories species", "Category:Ranats", "Category:Rodent sentient species", "Category:Semi-sentient species"], "nodes": [{"tag": "h1", "text": "Ranat"}, {"tag": "p", "text": "Ranats, known as Con Queecon in their own language, were a species of meter-tall rodents with long, tusk-like incisors jutting from their lower jaws. Though originally from Rydar II, the Ranats there were nearly wiped out by Human colonists in 200 BBY. Three Ranats stowed away on a spice freighter and crash landed on Aralia, where they re-established their species."}, {"tag": "p", "text": "Ranat tribes lived in large, maze-like tunnel networks, where they raised their young communally and lured intruders into dead ends to be killed. Ranats had simple personalities, showing little evidence of emotion beyond the desire for food. Though almost always hostile toward one another, tribes did cooperate to kill pest-control teams after entrepreneurs arrived on Aralia to turn it into a planetary amusement park. The government of the Antemeridian sector declared the Ranats semi-sentient, permitting sentient beings to kill the rodents in self-defense and forbidding them to arm members of the species. The governor restricted the movement of well-armed groups to Aralia to cover up the species' existence and its questionable level of sentience."}, {"tag": "p", "text": "Few Ranats were seen away from Aralia, and those that left the world occupied the lowest levels of society. Ranats established themselves on Tatooine, where they lived in the more populated areas as scroungers and traders. One group overran crime lord Jabba Desilijic Tiure's Palace after his death, and the Vriichon brothers once owned the Mos Eisley Cantina. During the Galactic Civil War, the Imperial military tested Ranat mercenary bands for possible use against Rebel Alliance forces. Ranats were also found in the employ of the mage Orloc, who attempted to start his own Jedi Order. The Ranat Rik-tak was a member of the Justice Action Network who operated in the Tapani sector."}, {"tag": "p", "text": "Ranats were omnivores and strongly preferred meat, especially that of Aralia's native robas. Their sharp incisors and claws were useful as both weapons and tunneling tools. Burrowing wore down their teeth but also released hormones that stimulated tooth growth; unchecked, the incisors could reach prodigious lengths, so most Ranats gnawed constantly to keep them filed back."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Ranats were a species of small rodents. They shared many features in common with sentient species such as their distant cousins, the Tintinna, and with other sentient mammals of similar physiology, including Chadra-Fan and Squibs. Nevertheless, the status of Ranats as fully sentient or merely semi-sentient was the subject of galactic debate for centuries."}, {"tag": "p", "text": "With few exceptions, Ranats stood about a meter high. This small size made them seem innocuous to many who encountered them and belied their power. They had short, well-muscled limbs with four digits on each forepaw and three per hindpaw. All four paws were nimble and capable of fine manipulation. Ranats had short, heavy-duty, retractable claws that, while of limited use in hunting or self-defense, allowed a Ranat to dig through as much as one meter of soil and loose rock in a mere 15 seconds."}, {"tag": "p", "text": "The Ranat body was tough, wiry, and partially flattened. Exceptional flexibility allowed Ranats to squeeze through small openings that would prove impenetrable to other beings of similar size; the Shi'ido shapeshifter Mammon Hoole often assumed the form of a Ranat to take advantage of this very ability. Although a typical Ranat had a long, scaly, hairless tail, the rodents were almost entirely covered in fur that ranged from dirty blond to dark reddish or grayish brown. Some Ranats groomed themselves, but for most, the coat was filthy and foul-smelling. Understandably, many non-Ranats considered the species to be visually unappealing. Ranats stooped when they stood and scampered and scurried when they ran. They tended to wear little more clothing than cloth hoods, leather belts, and ornamental tooth bands. However, those Ranats who integrated into galactic society often wore full-length tunics and footwear."}, {"tag": "p", "text": "The Ranats' eyes, located at the sides of the head, varied in color from beady and black, to red. Their hairless, pink ears were small and round and typically lay flat against the head. A Ranat's long, pointed snout was full of sharp teeth and terminated in a yellowish-white nose surrounded by long, black whiskers. Their senses were acute: they could see in the dark and detect others' moods by scent. Ranats spoke in a voice of squeaks and screeches."}, {"tag": "p", "text": "A Ranat's bottom two incisors were sharp, pointed, and discolored yellow or brown from tartar and dirt. Gnawing stimulated glands in the Ranat's jaw to produce growth hormones. Unchecked, this caused the incisors to grow up to a centimeter in a standard hour. The only way to counter the growth was to gnaw even more and wear the teeth down. Some members of the species managed to keep these teeth small enough to fit inside the mouth, but others had incisors that poked out and overlapped the upper lip like tusks. Coupled with their sharp teeth and powerful jaws, these incisors gave Ranats a dangerous bite."}, {"tag": "p", "text": "Ranats were fecund. Females went into heat at least twice each standard year, during which period they mated with as many males as possible. After fertilization, the fetuses gestated for about 120 standard days. The mother then gave birth to a litter of three to six young. The species' signature incisors began to grow in at adolescence. Members of the species were considered adults at three standard years of age, and the average Ranat could expect to live to be 20 standard years old."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Although they were not intelligent by most metrics, Ranats were resourceful and crafty. They lacked the higher emotions associated with other species, consumed instead by the simple desires to eat and fight. This made them preeminent survivors and experts at scrounging, foraging, and getting into places that they did not belong. However, it made them come off as belligerent, temperamental, self-centered, and stubborn to outsiders. Notions of honor and keeping one's word were only good as long as they did not interfere with the search for food. Ranats insisted on their superiority to other lifeforms, calling themselves Con Queecon (\"the conquerors\") in their own language—Ranat was an appellation from others that referred to their rodent-like appearance. A few Ranats did develop more individual personality quirks, often coming off as paranoid. They gnawed incessantly to keep the growth of their incisors in check."}, {"tag": "p", "text": "Ranat culture was otherwise uncomplicated. Although Ranats used simple tools, such as rocks to stone intruders, they created no goods of their own, and only one Ranat in a hundred ever learned any advanced technological skills. Nevertheless, they readily adopted technology from without. They especially valued shiny knickknacks that they could hang from their clothing or stash with their personal belongings. Unlike most other sentient species, Ranats had no art, diplomacy, poetry, philosophy, or technology and had a difficult time mastering complex devices or fields that required abstract reasoning. Nevertheless, relatively simple tasks were within their reach, such as firing a blaster. For example, Ranats enjoyed a game wherein they threw dice at one another and tried to snap them up in their jaws. Ranats familiar with the concept of credits were willing to work for little compensation."}, {"tag": "h3", "text": "Diet and hunting"}, {"tag": "p", "text": "For Ranats, life revolved around obtaining food; all other impulses took a back seat. Ranats were omnivores capable of eating almost anything. In fact, their concept of food encompassed everything from carpets and tapestries to sentient beings. They were particularly notorious for eating the young of species such as Humans. They preferred meat to other foods and spent much of their time pursuing prey."}, {"tag": "p", "text": "The species hunted in packs of at least five members. Their preferred prey were mammals, especially the roba, a porcine behemoth native to Aralia. Upon locating their quarry, Ranat hunters surrounded it and then went in for the kill. One by one, the hunters ran up to their prey, bit it, and tore off pieces of flesh, retreating before the quarry had a chance to retaliate. Once the prey finally succumbed to its injuries, the hunters descended upon it, gorging themselves and carrying the remains back to the town to feed the rest of the tribe. The entire process was so efficient that soon after arriving on Aralia, the Ranats had depressed the populations of several game species."}, {"tag": "h3", "text": "Combat and war"}, {"tag": "p", "text": "The only other drive for a Ranat aside from that of food was that of the fight. Limited resources on Aralia, exacerbated by the Ranats' high fertility rate and overhunting, frequently placed Ranat tribes in conflict with one another. Ranats showed loyalty to only their own tribe; members of other groups were always rivals and enemies. Nevertheless, by the time of the Galactic Empire, some Ranat tribes showed signs of cooperation to oust offworlders from their planet. One favored tactic was to stalk a hunting party from a rival tribe. After the enemy had tired themselves out making a kill, their stalkers attacked."}, {"tag": "p", "text": "Ranats were unflappable opponents and unrepentant killers. They preferred to fight with their sharp teeth, getting in a bite and then shaking their target furiously. Ranats who felt trapped by an enemy became even more savage as they tried to escape from a corner. They had no concept of surrender; a fight lasted until one side had been wiped out or forced to flee. If under blaster fire, for example, Ranats scattered and fled. Prisoners of war were killed and eaten."}, {"tag": "p", "text": "Ranats held grudges. Any surviving Ranats from the losing side of a fight rallied their tribemates to mount a retaliatory strike known as a vengeance party. Preparations for such tit-for-tat offensives took on an air of festival, as the whole tribe prepared the warriors for their mission. The concept of revenge was so compelling that some tribes hatched even suicidal schemes to get back at a rival."}, {"tag": "h3", "text": "Social structure and habitat"}, {"tag": "p", "text": "Ranats originally hailed from Rydar II, but after being driven from that world, they adopted Aralia as their new homeworld. Aralia was a planet of tropical and semi-tropical climes. The Ranats' communities preferred the tropical forests found along the coasts of Aralia's landmasses, but the rodents could be found across the world. The species was divided into tribes of about 100 members."}, {"tag": "p", "text": "These groups dug out and inhabited subterranean tunnel complexes known as towns, cities, or warrens. These labyrinthine habitations had many levels that could sprawl to three square kilometers in area with more than 50 km of tunnels. The convoluted passageways acted as a natural defensive mechanism, since intruders were unlikely to know the paths as well as their inhabitants. For additional safety, Ranat engineers dug out several dead ends in which interlopers might be trapped and killed. They also built several exits per warren and camouflaged them with branches, foliage, and twigs. The tunnels widened into large chambers in places, each of which was devoted to a single task, such as sleep, meals, storage, refuse disposal, or caring for the young."}, {"tag": "p", "text": "Defective newborns were eaten, but healthy infants were placed in their tribe's nursery. There, the adult females took turns tending to and suckling them while the other mothers continued to fight and hunt. Accordingly, Ranats rarely knew the identity of their biological mother. These caretakers were rarely doting parents, and some were known to kill a particularly troublesome infant rather than put up with it. Once a young Ranat managed to grasp objects with both fore- and hindpaws, he or she began to venture out into the larger warren and onto the surface. Ranat children enjoyed roughhousing, although some youths were accidentally killed in such tussles. Still, the adults largely left them be."}, {"tag": "h3", "text": "Language"}, {"tag": "p", "text": "Ranats spoke a simple language named for them. Spoken Ranat sounded like a string of short, high-pitched chitters and shrieks. Ranats squealed when in distress or having fun and shrieked when in pain. Still, Ranat communication relied on non-verbal cues as well. Members of the species smiled to show contentment, blinked rapidly to show desperation, and grabbed their tails to express intense fear. The Ranat's whiskers twitched to express satisfaction and trembled to show happiness. Most Ranats could write their language."}, {"tag": "p", "text": "Members of the species were capable of learning other languages, including Basic. Ranats tended to take simple names, such as Kleef, Marbor, Reegesk, Targan, and Veerz. Others, however, took two-part names, such as Engal Jeers, Nestra Pallik, and Nevar Yalnal. While at least one Ranat, Nitram Con Queecon, had a three-part name, \"Con Queecon\" was the name of his species."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Evolution and exodus"}, {"tag": "p", "text": "The Ranats evolved on Rydar II, a planet in the Outer Rim Territories' Rydar system. There, the species developed tool use, language, and complex social structures. The world had been reached by outsiders by 4000 BBY, even falling nominally under the control of Darth Revan during the Jedi Civil War. Sometime during the days of the Galactic Republic, the Ranats were joined on Rydar by Human colonists. The rodent-like natives soon discovered that these strangers brought with them a delicious new source of food: their children. As the Ranats kidnapped and ate their fill of Human young, the settlers, who called themselves Rydarians, grew increasingly agitated. In 200 BBY, the Ranats soon found themselves beset by an orchestrated campaign to wipe them from the face of Rydar II. The campaign very nearly succeeded in killing every last Ranat on the world."}, {"tag": "p", "text": "Only three Ranats survived—two males and one female, who had stowed away on a spice smuggler's vessel. The ship soon left Rydar II with the stowaways aboard and headed for the Andron system, nearby in the same sector. Before long, the Ranats ate the ship's crew, and the ship crash landed on the Andron system planet of Aralia. There, the Ranats reproduced, eating any defective young and starting a new colony. Within a few decades, they had a thriving group in the coastal jungles of the world."}, {"tag": "p", "text": "The population eventually reached the millions. This pressured the Ranats to expand beyond the coastal forests. By the time of Galactic Civil War, Ranats could be found from the prairies to the mountains, even in colder climes that received regular snowfall. This population boom and the Ranats' natural inclinations toward hunting put undue pressure on Aralia's native fauna. As prey species became rarer and rarer, conflicts between rival tribes became inevitable."}, {"tag": "h3", "text": "Amusement park boom"}, {"tag": "p", "text": "Despite their previous encounters with outsiders, Ranats remained largely unknown on the galactic stage. Eventually, new strangers arrived, the developers of an amusement park, drawn by Aralia's location near the Perlemian Trade Route. Ignorant of the rodent-like species' presence, the entrepreneurs began constructing a large facility. Unbeknownst to the Ranats, the endeavor was headed by an entrepreneur named Hayzo Trebors, who had obtained permission to build on Aralia from Governor Targan of Rydar II, and from the government of Antemeridian sector. The park was called Project Aralia."}, {"tag": "p", "text": "At first, the Ranats ignored the newcomers, tunneling out their warrens as they had for centuries. The construction crews soon noticed when these warrens made their site unstable, and the construction manager reported the problem to Trebors. The businessman hired pest control specialists, and the Ranats took notice: they responded to this affront by hunting down and killing their exterminators."}, {"tag": "p", "text": "News of the massacre spread, and, with it, news of the Ranats' intelligence. If the Ranats were deemed sentient, the project would have to show them to be \"useless and undesirable\" to obtain an Imperial permit to continue to kill them. Nevertheless, Trebors took a different course. He argued to the Imperial government that the Ranats were only semi-sentient and thus unprotected by such laws. For its part, the sector government feared that ruling the Ranats fully sentient and then still allowing them to be exterminated would not play well with environmentalists and high-ranking Imperial officials. They agreed with Trebors' assessment; the Ranats were heretofore labeled \"semi-sentient.\" Trebors' people, continually fighting the rodents off, managed to complete Project Aralia."}, {"tag": "p", "text": "Word of the development's legal wranglings spread throughout the sector. By 0 BBY, fearing the rodents might come to other planets, the sector government passed a law that forbade the selling of arms to a Ranat. The government also took action to prevent armed groups from traveling to Aralia, ostensibly to protect the native ecosystem, but in reality to avoid further knowledge of the way the Ranats were treated from becoming more widely known."}, {"tag": "p", "text": "After another amusement park, known as Galaxy Ways, was completed, much of the world's landmass was given over to resorts. Aralia grew more and more popular as a tourist destination, famed for its unique rides and attractions, shops, and dining, all at affordable prices. The Ranats continued to expand with abandon, paying no heed to who officially owned each parcel of land."}, {"tag": "p", "text": "Nevertheless, Ranat predations drove their forest prey extinct. Ranat tribes searched for a new food source, and they found one: Aralia's burgeoning tourist population. The problem got particularly bad at Galaxy Ways. The park's management hired exterminators, but just like with Project Aralia, the Ranats simply killed them. The owners eventually resorted to tracking Ranat populations under the park and, should an attack occur, quickly quarantining the area until it could be contained."}, {"tag": "p", "text": "During one particularly gruesome off-season, several Ranat tribes decided to raid Galaxy Ways simultaneously. They carefully planned the assault. First, they gnawed through the park's power supplies, leaving it dead and dark. Next, they disabled any starships on the premises, stranding their prey there. They knew they easily outnumbered the guests ten to one."}, {"tag": "p", "text": "Then they struck. They carried away any tourists they could find, leaving nothing but bloodied strips of clothing, tell-tale claw marks, and shrieks of horror to warn the rest of the park's guests. For their part, the park visitors had no weapons with which to defend themselves. Escaping their grisly fate became the order of the day."}, {"tag": "h3", "text": "Galactic spread"}, {"tag": "p", "text": "Despite the government quarantine on Aralia, Ranats spread across the galaxy to worlds as far afield as Tatooine. By 0 ABY, \"son of a Ranat\" had entered galactic parlance as a pejorative. That same year, the Empire had taken an interest in the Ranats that went beyond Aralia's local troubles. Military scientists took Ranats from Aralia to investigate whether the rodents might be trained as weapons against the Alliance to Restore the Republic and then used as mercenaries. The project proved a success, and the Empire fielded Ranat spies, happy with the low wages expected by members of the species."}, {"tag": "p", "text": "After the defeat of the Emperor in 4 ABY and the subsequent rise of the New Republic, the galactic government initially ignored the Imperial precedent and labeled Ranats as non-sentient animals. However, as evidence gathered that the species had language, the government reapplied the Imperial \"semi-sentient\" label. The matter was appealed and remained under consideration for a time. On Aralia, at least for a time, the point was moot, as the planet became part of the contested Borderland Regions during the Thrawn campaign of 9 ABY. During the New Republic's rule, Mammon Hoole included an entry on the Ranats in his publication The Essential Guide to Alien Species."}, {"tag": "p", "text": "During the Yuuzhan Vong War, Ranats became one of the many species to flee the chaos. In 25 ABY, a group of them from Gyndine were placed with a group of Ryn aboard a refugee vessel called the Wanderhome, which joined the New Republic refugee convoy. Their ship's navigation computer developed problems, however, and the Wanderhome failed to make a rendezvous at the Ralltiir system. Leia Organa Solo convinced the captain of the convoy to send a rescue team, but most of the pilots were reluctant to risk themselves for members of two species that were generally disliked. Nevertheless, a group of spacers eventually decided to follow through. They escorted the ship back to the convoy, sparing it from members of the Yuuzhan Vong–sympathizing Peace Brigade."}, {"tag": "p", "text": "Ranats were among the enslaved beings held aboard a Yuuzhan Vong worldship orbiting the planet Myrkr in 27 ABY. Tenel Ka Djo, Anakin Solo, and other Jedi formed a strike team and hit the moon to destroy a cloning lab. More than a century later, the planet Aralia was part of Darth Krayt's Sith Empire."}, {"tag": "h2", "text": "Ranats in the galaxy"}, {"tag": "p", "text": "Prior to their exodus from Rydar II, Ranats were uncommon in the greater galaxy; after their move to Aralia, they were still little-known. Those who did manage to leave Rydar II faced intense discrimination in the galaxy at large. To beings who were unfamiliar with the species and their culture, Ranats were considered regular animals at best, pests or vermin at worst. Those who were familiar with Ranat behavior often reacted even more negatively toward them; the Ranats' taste for sentient flesh—particularly that of infants—placed them squarely in the company of the most hated beings in the galaxy."}, {"tag": "p", "text": "The Imperial designation of \"semi-sentient,\" which was brought back and persisted well into the New Republic period, meant that Ranats could not legally own property and had no recourse against being killed in self-defense. In reality, other sentient beings could kill Ranats without consequence, as exemplified by Doctor Cornelius Evazan's use of Ranats in his medical experiments. For their part, very few Ranats were able to overcome the solipsistic behaviors that others found reprehensible in their species, and those who could found it hard to keep on good terms with non-Ranats."}, {"tag": "p", "text": "Over time, the very name Ranat took on a pejorative tone, and other rodent-like sentients took umbrage to being mistaken for a member of the species. Being compared to a Ranat indicated an undesirable demeanor, and calling someone a Ranat was a grave insult. In 3 ABY, the pirate Az-Iban flew a freighter called the Rampaging Ranat, a name that pointed out the species' reputation as mindless killers. Similarly, the Aqualish smuggler Ponda Baba owned a freighter named the Angry Ranat during the Galactic Civil War. In the early days of the New Republic, the musical group the Palpatones made light of anti-Ranat sentiment in their hit song \"Kick the Ranat.\" To \"not give a Ranat's whisker\" or a \"Ranat's sneeze\" were galactic curses."}, {"tag": "p", "text": "Still, some Ranats did manage to eke out a living in galactic society, often settling in large, populated areas. A sizable number made their way from Aralia to the planets Gyndine and Tatooine. On the latter, they attained some modicum of acceptance, taking on the role of scavengers and merchants. They were often compared to Tatooine's native Jawas and came into competition with them, although the Ranats stayed mostly within the confines of Mos Eisley, while the Jawas roamed the deserts. Members of the two species traded with one another following a strict protocol. Still, people on Tatooine had little respect for the rodents, giving them the disparaging nickname \"womps,\" after the native womp rat."}, {"tag": "p", "text": "One small tribe of Ranats inhabited Mos Eisley on Tatooine, where they had grown more accustomed to using technology than others of their kind. In 0 BBY, they were building themselves a moisture vaporator and other items to ease their life on the desert world. Members of this tribe were present in the Mos Eisley Cantina in 0 BBY on the day Luke Skywalker and Obi-Wan Kenobi chartered the Millennium Falcon. One of these was the thief and scavenger Reegesk, who sat with a group of Jawas and traded a Tusken battle talisman to the Jawa Het Nkik. Meanwhile, he palmed the power pack from the Jawa's blaster to run his tribe's moisture vaporator. Nevar Yalnal, an outcast from the other Ranats on Tatooine, lived as a spy and laborer in Mos Eisley. He took odd jobs spying for clients and doing manual labor for the Saurin droid trader Hrchek Kal Fas. The Ranat Vriichon brothers owned the Mos Eisley Cantina, where they had set up an illegal spice den. They eventually sold the place to the Wookiee Chalmun, after which they made themselves scarce in fear of retribution should the corpses they had buried in the cantina basement be discovered."}, {"tag": "p", "text": "Despite this relative acceptance on the planet, Ranats still met with prejudice; seven months ABY, Mammon Hoole and his charges encountered a Ranat being tortured in Jabba the Hutt's desert palace. After the crime lord's death in 4 ABY, a group of Ranats overtook the abandoned palace. There, they ran about chewing on everything. Although Jabba's father, Zorba the Hutt, reclaimed his son's property in 5 ABY, memories of its Ranat infestation haunted his dreams."}, {"tag": "p", "text": "Nitram Con Queecon was a Ranat who lived in the ruins of Nub Saar on Genarius. He hated other beings and tried to scare them away with signs and traps. Nevertheless, in 21 BBY, a group known as the Heroes of Cularin arrived in the city and convinced Nitram to help them track down Togorians hiding out nearby. Silver Station also had a colony of Ranats living on it. The Rebel Alliance operative Una Poot tried but failed to exterminate them when she arrived there. In retaliation, they threatened to blow the station up with JL-12-F explosives in 0 ABY. The arms heiress Tinian I'att disarmed their device and prevented their plan from coming to fruition."}, {"tag": "p", "text": "During the Galactic Civil War, the Empire abducted Ranats from Aralia—as well as other species deemed semi-sentient, such as aga, Avogwi, cidwen, and Zelosians—and trained them as soldiers. The program was administered by Palpatine and Darth Vader themselves, using drugs and mind control to mold their Ranat subjects into obedient guards. The procedure began with the delivery of a hallucinogenic drug, such as brain-jagger or Black Hole, to affect the Ranats' fear centers. The Emperor and his apprentice then used the dark side of the Force to render the drugs' effects permanent. The fear-crazed Ranats came to be even more aggressive than normal, attacking any being who came within their range. The Ranats served in capacities where stormtroopers were needed for other tasks, heeding the personal telepathic whims of the Emperor. The experiments continued even after the defeat of the Empire at the Battle of Endor. In 7 ABY, Ranats were among the beings undergoing intelligence enhancement in a program authorized by the warlord Zsinj aboard his Star Destroyer, the Iron Fist. The Ranats were later freed by Lara Notsil and helped her to escape the ship. The Empire simply paid other Ranats to do their bidding; the beings were willing to work for very little compensation. Around 15 BBY, a female Ranat acting on Imperial orders approached Mechis III in a ship searching for rogue IG-88 assassin droid models. When the droid 3D-4X sent back doctored footage of Hekis Durumm Perdo Kolokk Baldikarr Thun, the Ranat continued to the next system on its itinerary."}, {"tag": "p", "text": "Later, private interests, such as security companies, tried similar experiments. In 22 ABY, the self-proclaimed mage Orloc retained the services of a cadre of Ranat enforcers on Exis Station. He used a \"voice of command\" to order them to do his bidding, but in reality, this was only a technological gimmick. The Ranats salvaged components from the station's ruins when off-duty. They captured the Jedi trainee Uldir Lochett and delivered him to their master. When Lochett's companions from Luke Skywalker's Jedi Praxeum came to rescue him, the Ranats stood in their way but were defeated."}, {"tag": "p", "text": "A small number of extraordinary Ranats managed to adjust to galactic society and use galactic-standard technology. Some of these found work as assassins and bounty hunters. Due to the preconceptions about their species being primitive and mindless, such Ranats often gained the advantage in combat due to their opponents' underestimation of their capabilities. Others worked as fringers or scoundrels. No Ranat was ever known to be able to use the Force. One member of the species served in the retinue of Decca the Hutt on Mawan in 26 BBY. Later, during the Galactic Civil War, the Ranat Rik-tak worked as an air taxi driver and Justice Action Network operative in the Tapani sector; he defied stereotypes as an amiable and helpful guide to his clients, although he did listen for interesting chatter from his passengers so he could pass anything useful along to the JAN cell operating in Tapani. The smuggler Han Solo encountered a well-groomed member of the species who was a patron at the Yarith Bespin lounge in 11 ABY, while another Ranat served as an assistant to the Hutt information broker who operated from Shanko's Hive on Borgo Prime in 23 ABY and 24 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During production of Star Wars: Episode IV A New Hope, first released in 1977, artist John Mollo included a rat-like alien among his costume sketches for the patrons of the film's cantina sequence. The production team dubbed the character \"Rodent\" and \"Rat Face.\" Although Mollo's drawing gave the cloaked and hooded figure a breath mask, the design team eliminated this detail in the final production. The character was later given the proper name Aceatta. Someone wearing the rat-faced mask appears as a background extra in outdoor scenes set in Mos Eisley spaceport and in the Mos Eisley Cantina. The scenes were filmed as part of principal photography in London, England; in at least the cantina scenes, the mask was worn by actress Sadie Eddon and was featured more prominently in an early cut of the cantina sequence. This character appears as an audience member in \"The Emperor's Court,\" a non-canonical story from Star Wars Tales, first published in December 2002."}, {"tag": "p", "text": "In 1989, Troy Denning included the rat-like Ranats in his book Galaxy Guide 4: Alien Races, a supplement for the Star Wars: The Roleplaying Game from West End Games. The statistics for the species make Ranats comparable to other species in their agility but deficient in their alertness, intelligence, mechanical aptitude, strength, and technical aptitude. The game also makes Ranat characters work twice as hard as members of other species to learn technological skills. Still, the rodents receive a bonus to attacks using their sharp teeth. The Star Wars Roleplaying Game from Wizards of the Coast also offers Ranats as a playable species. Its statistics give them a bonus to dexterity but penalties to intelligence and likeability. Ranat characters enjoy special abilities to bite in combat, see in the dark, and slip through small holes. Nevertheless, this version of the game also makes Ranats learn technology-based skills at a slower rate than other species."}, {"tag": "p", "text": "In 1995 and 1996, Decipher, Inc., established that two different rat-like aliens appear in A New Hope and identified them both as Ranats. Decipher named the one from the cantina Reegesk and the one from the streets Nevar Yalnal. The cards' game mechanics reflect their Ranat namesakes. For example, the Reegesk card allows a player to \"scavenge\" through lost cards to recover devices, droids, and weapons. The Nevar Yalnal card, on the other hand, gives its player a chance to remove an opponent's spy from the game."}, {"tag": "p", "text": "Ranats have since appeared in various roleplaying adventures, some of which offer multiple versions of the same scenario. For example, the adventure seed \"Trouble at Galaxy Ways,\" published in the 1992 book the Star Wars Gamemaster Screen, is designed to emulate a horror film, with Ranats standing in for zombies. However, the book offers a lighter variant that has the Ranats searching not for sentient prey but for merchandise featuring the park's mascot, Ronnie the Rocketpack Rodent. The Ranats have become enamored of the plucky rodent and have even taken to worshipping him as a god. Accordingly, the only visitors who have to worry about being kidnapped, according to this variant, are those dressed in Rocketpack Rodent costumes. The later adventure \"The Refugee Trail,\" published in the 2002 The New Jedi Order Sourcebook, is designed to test the player characters' morality. If they opt not to mount a rescue mission to save a shipful of Ranats and Ryn, the Yuuzhan Vong–allied Peace Brigade takes them instead. The 2009 article \"Dining at Dex's\" lists \"Ranat's cheese soup\" as a food item for sale at Dex's Diner on Coruscant. The article does not reveal whether this dish was simply named for the Ranat species or if it was an item of their own cuisine."}, {"tag": "p", "text": "The book Ultimate Alien Anthology contradicts other sources with regard to the average Ranat lifespan. According to the book, Ranats entered adolescence at four or five, were considered adults at nine, and could expect to live to 55. Several sources contradict this, so this article therefore assumes that Ultimate Alien Anthology is in error."}, {"tag": "p", "text": "Several rodent-like aliens of unidentified species appear in Star Wars comic books. For example, a hooded and cloaked rat-like figure is seen in a cantina on Diado in \"It Takes a Thief,\" a story set in 19 BBY. Similarly, the bosun of the pirate Krayn's ship in Jedi Quest is rodent-like. Finally, a Ranat-like alien is pictured aboard a space station run by a Black Sun Vigo in Darth Maul 2, set in 33 BBY. However, without explicit species identifications, it is impossible to tell whether these characters are Ranats or members of other species, such as Squibs or Tintinna. The article \"Action Figure Archive,\" in Star Wars Insider 75, mislabels the Chadra-Fan character Kabe as a Ranat, a misidentification the character suffered in-universe, as well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}