{"url": "Ranat", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Ranats", "Category:Rodent sentient species"], "nodes": [{"tag": "h1", "text": "Ranat"}, {"tag": "p", "text": "Ranats were a species of rodent-like humanoid sentients. Ranats had long tails, facial incisors, long whiskers, sharp teeth, and sharp sense of smell. Ranats were found throughout the galaxy and worked in various occupations including bounty hunters and soldiers."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "They had a long tail, long incisors that protruded from their lower jaw, and long whiskers. Their eyes could see through infrared and their teeth could chew through duracrete plate. Ranats also had a sharp sense of smell."}, {"tag": "h2", "text": "Ranat in the galaxy"}, {"tag": "p", "text": "Ranat often encountered prejudice in the galaxy even during the time of the New Republic. Five years before the Battle of Yavin, a Ranat bounty hunter and his Nimbanel colleague attempted to collect a bounty on the Trandoshan bounty hunter Bossk on the Outer Rim planet of Lothal, which had been issued by the corrupt Imperial Security Bureau Lieutenant Jenkes. However, Bossk overpowered them and knocked them unconscious."}, {"tag": "p", "text": "Later, another Ranat, Nevar Yalnal, was spotted at Chalmun's Spaceport Cantina on the planet Tatooine during Luke Skywalker and Obi-Wan Kenobi's fateful encounter with the smuggler Han Solo and his Wookiee companion Chewbacca. During the Battle of Jakku, the Ranat soldier Musmuris Reetgeet was part of a predominantly human boarding party that captured the Immobilizer 418 cruiser Glaciate. Reetgeet personally disabled the cruiser's reactor governor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ranat first appeared in Star Wars: Episode IV A New Hope in 1977 as a background costumed character."}, {"tag": "p", "text": "The Ranat also appeared in the non-canon 2017 LEGO Star Wars: The Freemaker Adventures episode \"Return to the Wheel.\" In the episode, a group of Ranat attack the B1-series battle droid Roger after he stops one of their group from stealing a datapad during a mission to obtain an energy matrix activator."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}