{"url": "Ran_Kether", "categories": ["Category:Legends articles", "Category:Chandrilans", "Category:Humans", "Category:Males", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Ran Kether"}, {"tag": "p", "text": "Ran Kether was the communications officer for Rogue Squadron during the Zsinj campaign. He flew as Rogue Seven, and his wingmate was Koobis Nu. During the Yuuzhan Vong War, Kether was flying refugee transports at Kalarba, where he was killed."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Flying with Rogue Squadron"}, {"tag": "p", "text": "Ran Kether flew as Rogue Seven during the Hunt for Zsinj, a New Republic Defense Force operation to eliminate the threat of former Imperial admiral turned warlord Zsinj. Kether flew alongside his wingman Koobis Nu during the campaign, and participated in the raid on Kidriff 5, among other theaters."}, {"tag": "h3", "text": "Death at Kalarba"}, {"tag": "p", "text": "In 25 ABY, the New Republic was invaded by a race of extragalactic aliens known as the Yuuzhan Vong, who sought to conquer the galaxy and claim it as their new home. The Yuuzhan Vong made rapid progress, dealing defeat after defeat to the New Republic. The Senate Select Committee for Refugees was created to deal with the flood of displaced persons engendered by the war and Kether joined the service as a pilot for refugee transports. When the Yuuzhan Vong moved on Kalarba, a Mid Rim world, Kether participated in the evacuation of the planet."}, {"tag": "p", "text": "The Yuuzhan Vong began their offensive by depositing a dovin basal—a creature capable of manipulating gravity—on the surface of Kalarba. The dovin basal subsequently focused a powerful gravitic pull on Hosk Station, an artificial space station built into Kalarba's moon of Hosk, and began dragging the moon down toward the planet. The evacuation of both Kalarba and Hosk Station that ensued was further complicated by the arrival of a Yuuzhan Vong fleet. Flying SELCORE refugee transports in the evacuation effort, Kether was killed during the battle. Ultimately, only a few thousand of the Kalarba system's inhabitants were evacuated in time."}, {"tag": "p", "text": "Kether's role in the Yuuzhan Vong War was not yet finished, despite the pilot's death. In 27 ABY, Senator Viqi Shesh of Kuat, who had collaborated with the Yuuzhan Vong throughout the early years of the invasion, was discovered as a traitor to the New Republic. The former senator fled into the underlevels of Coruscant, the galactic capital. Determined to kidnap Ben Skywalker, the son of Jedi Master Luke Skywalker, as a prize for her Yuuzhan Vong masters, Shesh adopted the persona of \"Welda Kether\" as a way to ingratiate herself with Han and Leia Organa Solo, who were acting as the child's guardians on Coruscant."}, {"tag": "p", "text": "Welda Kether, according to Shesh's story, had been Ran's girlfriend back in the days of the war against the Galactic Empire and had met Han Solo twice, on Ran's homeworld of Chandrila. Shesh planned to use the story as a way to earn Solo's trust before kidnapping the infant Ben Skywalker. To lend credence to the scheme, Shesh located a young boy, Dab Hantaq, and bribed him to act as Tarc, who was Ran's son in the deception. Although the primary stage of Shesh's plan worked, in that she was able to convince the Solos that she had known Ran Kether and secure passage on the Millennium Falcon—the personal starship of the Solos—during the chaotic evacuation of Coruscant, Shesh was foiled in her plot to abduct Ben Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kether was not mentioned again until the ninth installment in The New Jedi Order series of novels, The New Jedi Order: Star by Star. In Star by Star, Kether is mentioned as having died during the evacuation of Kalarba, an event depicted in The New Jedi Order: Balance Point, an earlier novel in the series. The only source for Kether's death, however, is Viqi Shesh, who is in the process of deceiving the Solos. The pilot's demise at Kalarba was only verified in The Complete Star Wars Encyclopedia, published in 2008."}, {"tag": "p", "text": "Whether or not Welda and Tarc Kether actually existed and had their identities stolen by Shesh and Hantaq is unclear. While Han Solo does not claim to remember \"Welda Kether\" from their time on Chandrila, the fact that Kether's death and previous acquaintance with Solo were known to Shesh could suggest that Welda and Tarc Kether did exist and that the former senator had gone far enough as to appropriate their identities. This article assumes, however, that Welda and Tarc Kether were concoctions of Shesh and that Kether had no wife or child at the time of his death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}