{"url": "Rampa_II", "categories": ["Category:Legends articles", "Category:Corporate Sector Authority planets", "Category:Corporate Sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Rampa II"}, {"tag": "p", "text": "Rampa II was a heavily industrialized planet in the Corporate Sector, which had a landscape so barren and polluted that drinkable water was an extremely precious resource. The need for water set up a thriving smuggling route known as the Rampa Rapids between Rampa II and nearby R'alla, which had an abundance of clear, refreshing water. In 4 BBY Rampa II was the site of a popular uprising against the Galactic Empire, which was brutally crushed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in the Outer Rim Corporate Sector, Rampa II was located a short jump off the Solenbaran Merchant Route, connected to R'alla by a route called the Rampa Rapids. By the era of the Galactic Civil War, Rampa II was arid and polluted, and was constantly riddled by drought."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As of the Imperial Period, Rampa II had become heavily industrialized, dotted with Corporate Sector Authority labor camps and factories. The Authority made it a practice to send prisoners and the sector's least fortunate to Rampa II, and the planet's landscape had become extremely polluted, with very little drinkable water. As such, a bustling smuggling trade sprung up between Rampa and nearby R'alla, which was well-known for its sweet, clear water. That run, known as the Rampa Rapids, was heavily patrolled by both Authority gunships and the native Rampa Skywatch, and was known for being highly perilous. Many smugglers cut their teeth running water to Rampa II, including a young Han Solo, who ran the Rampa Rapids during his early career. Gunrunner Tiv \"Poke\" Pocarno was less successful than Solo, as the Captain of the Broken 'Spanner, in a futile effort to pay back a sizable debt to Reuss VIII crime lord Torel Vorne, botched a smuggling run to Rampa II and died penniless."}, {"tag": "p", "text": "During the Galactic Civil War, the Galactic Empire manned emplacements on Rampa II, which became the target of a popular uprising in 4 BBY. Although the rebels were brutally suppressed by the Empire— which claimed in its propaganda that the revolters had turned their guns on innocent civilians—they inspired a similar insurrection on Rampa I, which was located in the unrelated Rampa Minor system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rampa II is first mentioned in Han Solo's Revenge, a novel written by Brian Daley and released in 1979. In 2009's The Essential Atlas, Rampa II is inaccurately referred to as \"Rampa III.\" The same source introduces the Rampa Minor system, establishing that Rampa II and Rampa I are not in the same system."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}