{"url": "Rampage_of_the_Phlogs", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "Rampage of the Phlogs"}, {"tag": "p", "text": "\"Rampage of the Phlogs\" is the third episode of the first season of Ewoks. Written by Paul Dini and directed by Raymond Jafelice, the episode originally aired on ABC on September 21, 1985."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Morag separates a baby Phlog from his parents and blames the Ewoks, prompting an attack."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The phlog travelers"}, {"tag": "p", "text": "Kneesaa and Latara are floating down a river when they are knocked over by a giant wave, capsizing their raft. The two Ewoks look up to see a Phlog making waves in the water with his club. Behind the Phlog appears two more, a male and a female with a baby Phlog in her arms."}, {"tag": "p", "text": "As the Phlogs travel down the river, Kneesaa and Latara return to Bright Tree Village to warn the Elders that the Phlogs have returned to the forest. As Wicket listens intensely to the conversation, Malani appears behind him and flirtatiously tries to get his attention. Wicket, however, shows no interest, instead listening closely to Logray, who warns the Ewoks to stay out of the Phlogs' way. While the Phlogs are peaceful, they are dangerous if disturbed."}, {"tag": "h3", "text": "Morag's conspiracy"}, {"tag": "p", "text": "Meanwhile, the Phlogs are resting by the river when the baby Nahkee wanders off. He encounters a Zakool, which the young Phlog treats like a pet. When the Zakool runs off, the Phlog crawls after him. Instead of finding the Zakool, however, he is surrounded by Rakazzak beasts, which are controlled by Morag the Tulgah witch. Morag puts a spell on Nahkee, which puts him to sleep. The Rakazzak beasts carry Nahkee away, and Morag leaves behind a bow, two spears, and an Ewok hood. When the other three Phlogs search for Nahkee, they discover the items, and immediately assume that Nahkee was captured by Ewoks, much to Morag's delight. Morag and the Rakazzak beasts take Nahkee to the Duloks, who are ordered to care for him until the Phlogs destroy the Ewok village."}, {"tag": "p", "text": "Back at the Ewok village, Malani is playing with a Munyip when she sees Wicket, Kneesaa, Latara, and Teebo climbing through the trees. Wicket begins remarking on how he \"likes Malani far away from him,\" which Malani overhears. She runs off in distress. The Munyip tells Malani's brother Teebo, and the four Ewoks search the woods for Malani. Instead of Malani, however, the Ewoks find an enraged Phlog, who chases after the Ewoks. The Ewoks hide in a log, which rolls down a hill and shatters on a rock, sending the Ewoks flying into the river. Teebo and Wicket decide to continue their search, while Kneesaa and Latara return to the village to warn the Elders that the Phlogs are on a rampage."}, {"tag": "p", "text": "Gorneesh, King of the Duloks, cares for the Phlog child, which consumes food at an alarming rate. Gorneesh grows tired of watching over the Phlog, and decides to tie his foot to a tree stump, giving Gorneesh a chance to rest. The young Phlog, however, simply pulls the stump from the ground while Gorneesh is sleeping. He then crawls away, dragging the stump behind him."}, {"tag": "h3", "text": "The lost child"}, {"tag": "p", "text": "Malani, who is in the woods alone in tears, hears crying something behind her. She turns around and sees the young Phlog, who has become immobilized, the stump he is dragging wedged between two trees. She unties the rope from the stump, and the Phlog tells her in his own primitive way that he has lost his parents. Teebo and Wicket finally find Malani, who is being carried by her new friend. Teebo believes that if the Phlog is brought back to his parents, they might leave the Ewoks alone. However, before they can act on this plan, Nahkee smells cooking food, and runs off in the direction of the scent. Teebo and Wicket grab onto the rope, which is still being dragged by the Phlog. The scent, however, leads the Phlog and the Ewoks back to the Dulok village. Gorneesh is pleased to see that the Phlog has returned with three young Ewoks."}, {"tag": "p", "text": "While the Ewok village is under siege from the three adult Phlogs, Logray explains to Chief Chirpa that the mother Phlog claims the Ewoks stole her baby. Chirpa believes Morag is behind the crime, and Malani and Kneesaa set out to find the missing child. They are soon captured, however, and taken to the Dulok village, where the five young Ewoks care for the baby Phlog under the eye of King Gorneesh. While Wicket apologizes to Malani for the things he said, Teebo and Latara secretly concoct a plan for their escape."}, {"tag": "h3", "text": "Reunion and victory"}, {"tag": "p", "text": "Teebo enlists the help of nearby Humming peepers, who help Kneesaa and Latara serenade the Duloks to sleep. The Ewoks, carrying the sleeping Nahkee, escape to the Ewok village, which is fighting a losing battle against the Phlogs as Morag looks on. The young Ewoks arrive and reunite Nahkee with his family, just in time to save their village from destruction. The Duloks are not far behind, but are forced to flee back to their village when they are attacked by angry Phlogs and an angrier Morag. Malani and Nahkee share a tender goodbye, while Chirpa makes peace with the mother and father Phlog."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "This episode shows the return of the Phlogs, a species which was introduced in How the Ewoks Saved the Trees: An Old Ewok Legend, albeit with a much different look. The Phlogs would also later appear in the first season episode entitled \"Blue Harvest\"."}, {"tag": "p", "text": "The character of Asha is first mentioned but not seen in the episode, but is introduced on screen in the episode entitled \"Asha\". She is later mentioned in the season 2 episode entitled \"The Raich\", and she appears in the season 2 episodes entitled \"Home is Where the Shrieks Are\", \"Night of the Stranger\", \"Horville's Hut of Horrors\" and \"Battle for the Sunstar\"."}, {"tag": "p", "text": "This episode was released on DVD in 2004 as part of the feature film The Haunted Village. It can be found on side 1 of the disc."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}