{"url": "Rancor/Legends", "categories": ["Category:Legends articles", "Category:Carnivorous creatures", "Category:Creatures of Dathomir", "Category:Domesticated creatures", "Category:Endothermic species", "Category:Jungle and forest creatures", "Category:Rancors", "Category:Reptomammals", "Category:Semi-sentient species"], "nodes": [{"tag": "h1", "text": "Rancor"}, {"tag": "p", "text": "Rancors were large carnivorous reptomammals native to the planet of Dathomir. They were usually born brown, but in special circumstances, such as the mutant rancor, jungle rancor, and the bull rancor, their color may have differed. Although found on other worlds such as Lehon—where they were brought by crashed starships—Ottethan, Carida, Corulag, and Felucia, those from Dathomir were said to be stronger and more intelligent than others. They had been used for many things, ranging from mounts for the Witches of Dathomir, to pets for crime lords such as Jabba Desilijic Tiure, to being a source of food, and as a means of entertainment by dropping someone into its pit."}, {"tag": "p", "text": "Vonnda Ra of the Nightsisters used a stuffed rancor head as a chair. In her youth as a Jedi trainee, Hapan Queen Mother Tenel Ka Djo used two trophy rancor teeth for handles to create both her first lightsaber and second lightsaber. Rancors were also the source of the delicacy (or at least an edible meal) known as raw rancor-beast liver."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Warm-blooded rancors fell into the reptomammal category, along with other creatures such as the wampa. Rancors were attracted to other rancor mates by a smell, or a pheromone. While it is known that rancors did care for their young—usually born two at a time—they did not suckle and hatched from eggs like those of a reptile. The 3 meter tall hatchlings rode the mother, one dorsal, one ventral, until reaching maturity, though despite this nurturing nature, it was not entirely unheard of for a mother to eat her young."}, {"tag": "p", "text": "Rancors walked on two relatively stubby legs, with longer forelimbs utilized for catching prey, though they also walked on all fours at times and had a short tail. A rancor's flat face was dominated by a large mouth full of razor-sharp teeth. Although it had sharp teeth, it would often swallow smaller prey (such as humanoids) whole. The skin of a rancor was tough enough to deflect blaster bolts, making it an efficient killing machine—and an excellent source of leather for expensive vests and boots. At least on Dathomir, rancors had good night vision, but their eyesight was not as sharp as a Human's in daylight."}, {"tag": "p", "text": "Rancors had a symbiotic relationship with gibbit birds, an avian species that would clean their teeth, an action that provided the birds with food and the rancors with a form of \"dental hygiene.\""}, {"tag": "p", "text": "In certain cases, rancors were sentient enough to be able to form and recite complex oral traditions, such as Tosh, herd-mother of a rancor family that belonged to the Singing Mountain Clan on Dathomir. Tionne Solusar recorded one such narrative surrounding a witch identified as the fallen Jedi Allya, who lived over six centuries before."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Dathomir"}, {"tag": "p", "text": "Though they were usually considered unintelligent beasts, the rancors of Dathomir at least were semi-sentient, caring creatures who mourned their family members when they died, and who passed on oral histories of the matriarchal herds into which these were organized. Their native way of life seems to have been very primitive, using their strength and size to hunt live prey across the planet's savannahs—with the planet's Human population at one point becoming their primary prey species; but in the last centuries of the Galactic Republic, the rancor was \"domesticated\" by the Witches of Dathomir (though Force-sensitivity was apparently necessary to accomplish the difficult task) and the symbiosis of rancor sow and female rider seems to have played a major role in dictating the subsequent structure of Dathomiri society. According to the rancors' own traditions, the symbiosis began when a warrior-woman met and healed an injured female; by mounting the rancor's back, her sharper eyesight enabled it to hunt better prey during the day, so that it grew in size and status to become a mighty herd-mother."}, {"tag": "p", "text": "By the time of the New Republic, most of Dathomir's rancor population lived in symbiosis with the planet's Witches of Dathomir clans, being used as mounts, and learning to make and use armor and bladed weapons with their help. Rancors of a clan were marked to show clan ownership, but younger ones were not marked and could basically serve as undercover mounts, belonging to no clan."}, {"tag": "p", "text": "Around the years of the Galactic Empire, it was believed that the last herds of untamed mountain rancors were driven into the plains and destroyed; but a few decades later, a wild herd wandered into the Great Canyon, indicating that a population had survived in the vast tracts of Dathomir's surface area that remained unexplored, far beyond the knowledge of the planet's Human population. On Dathomir they would often eat pig-like rodents."}, {"tag": "h3", "text": "The wider galaxy"}, {"tag": "p", "text": "The rancor was relatively well known in the wider galaxy, having spread across various planets with early spacefaring civilizations even before the rise of the Old Republic; but the rancor's homeworld had been forgotten, and its sapience was rarely recognized. Among the planets that housed rancor populations were Carida, Corulag, Dantooine, Ohma-D'un, Trinta and Regosh. The Jedi Order named the Niman style of lightsaber combat after the rancor. This was a style that was known for being well rounded, with no certain offensive or defensive attributes. This might have suggested something about the rancor's predatory style."}, {"tag": "p", "text": "On a few worlds like Ottethan, rancors were used as mounts by warrior clans as they were on Dathomir. Herds of young rancors roamed wild on Lehon, descended from those brought by the Infinite Empire, and some were domesticated as beasts of war by the Black Rakata under The One. Several of those rancors attacked Revan after he betrayed the promise given to The One to kill the Elder Rakata. Revan also had to fight his way to the Ancient Temple and to the Elder Rakata's enclave through rancors who surrounded the former and guarded the latter. While stranded on Taris, the reformed Revan had to pass a rancor in order to infiltrate the Black Vulkars base. He did this by placing a synthetic odor that made the rancor think that its prey was nearby within a pile of corpses, where a grenade was placed. The rancor, grabbing what it thought was food, swallowed the grenade, which exploded in its mouth and killed the beast. Thousands of years later Darth Bane encountered more rancors of Lehon while following Revan's path."}, {"tag": "p", "text": "Rancors were perhaps most closely associated with the criminal underworld, where individual creatures were kept as pets, guards and status-symbols. Rancors were occasionally used for gambling matches, pitting one beast against another or unleashing one upon slaves and seeing which one survived the longest. One such gambling ring existed on Nar Kreeta. Infamous slaver Phylus Mon, who dealt in rancors, also used two crossed rancor claws as the symbol of his organization. Sometimes Phylus Mon used rancors to attack his personal enemies, and sometimes his enslaved Force adepts created illusions of rancors to attack his enemies. Rancors were also kept by such criminals as Nirama, Hlisk Squin, Borvo the Hutt, and the crimelord from Nar Kreeta."}, {"tag": "p", "text": "The inhabitants of Felucia managed to tame the local rancors in a manner similar to Dathomiri Witches. They also used the rancors as mounts, and the bones of the deceased creatures were made into weapons. In addition, they usually painted the rancors with fluorescent paints to make them look more intimidating. These rancors were used by the Jedi Shaak Ti and Maris Brood. Several of those rancors were slain by Galen Marek during his mission in 2 BBY. The Zann Consortium used many rancors with Nightsisters astride them in their campaign to corrupt the galaxy, most notably Nightsister Silri's pet, Cuddles."}, {"tag": "p", "text": "Perhaps the most famous such rancor was the one owned by Jabba Desilijic Tiure, who kept it in a pit beneath his palace courts, dropping in victims who displeased him in some way in order to feed it. His rancor was cared for by Malakili, a famous beast tamer who had traveled with the Circus Horrificus. Malakili formed an unlikely bond with the animal, even going so far as to sneak the rancor out of Jabba's palace for a run in the desert, and wept when the beast was killed by Luke Skywalker."}, {"tag": "p", "text": "The Galactic Empire attempted to exploit the combat potential of the rancor—perhaps not a great surprise given that a fully grown Dathomiri rancor was capable of single-handedly destroying an entire AT-ST unit."}, {"tag": "h3", "text": "Subspecies"}, {"tag": "p", "text": "Many subspecies of rancors existed, both on Dathomir and other worlds. Among the subspecies of Dathomiri rancors were the gnarled rancor and the rancor pygmy. Offworld breeds had evolved into such distinct subspecies, such as the amphibious Tra'cor found on Socorro or the gigantic tyrant rancor. An extremely rare variant was the bull rancor of Felucia, an ancient and near-mythical beast that was marked by its paler flesh, elongated tail and immense horns that sprouted from its massive head. One such rancor was tamed and used as a pet by the Dark Jedi Maris Brood."}, {"tag": "p", "text": "Several subspecies did not evolve naturally, but were instead bred, using either genetic manipulations or Sith alchemy. One such variant was the jungle rancor, which was quite different from its common brethren and was found on worlds such as Teth. The Sith Lord Quorlac Fornayh used the Sith Alchemy to create Coloi, a rancor with lighter bones and large wings, who had the skin replaced with black metallic plating that could serve as armor. Only one such creature existed and was subsequently destroyed. The reborn Emperor Palpatine also kept several alchemically altered Chrysalide rancors at his citadel on Byss in order to defend it."}, {"tag": "p", "text": "Other mutant rancors were unique and impossible to classify. In 14 ABY a mutant rancor was bred by the Disciples of Ragnos, who planned on releasing the beast in Taanab cities so that during the chaos they could steal arms, credits, and other needed goods. The beast was much larger than normal rancors, had green capsules on its back, could breathe a stream of green toxic gas, and had an unnatural green hue to its skin. However, once released, the rancor began attacking the Disciples themselves, who were unable to stop it, as the mutant was immune to conventional weapons. Eventually it was killed by the Jedi Jaden Korr, who managed to pin it between a force field and a large crate on a conveyor belt."}, {"tag": "p", "text": "Another example of a mutant rancor is the Undead rancor, which was mutated by Imperial Bioweapons Project I71A, and resided on Dathomir in the Imperial Quarantine Zone. This rancor was later killed by a group of spacers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The concept for the rancor in Return of the Jedi was described by its creators as \"a cross between a bear and a potato.\" It was first to be played by an actor in a suit, but no one was satisfied with the results. The rancor was then made as a rod-operated puppet, filmed with a high-speed camera to slow its movements down to give the illusion of a much larger creature. A combination of matte painting, cartoon rotoscoping, and CG elements were added around the creation to make it look bigger and more menacing. Some of these changes were later omitted or replaced with CG effects in the 2004 DVD release of the original trilogy."}, {"tag": "p", "text": "In contrast to the rancor's classification in other sources, Star Wars Galaxies states they're a hybrid of a crustacean and an arachnid."}, {"tag": "p", "text": "Ben Burtt, sound designer for all seven movies, said in the Galactic Phrase Book & Travel Guide that he created the rancor's sounds from those of a dachshund."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}