{"url": "Azzim_Anjiliac_Atirue", "categories": ["Category:Legends articles", "Category:Hutts of the Anjiliac clan", "Category:Males"], "nodes": [{"tag": "h1", "text": "Azzim Anjiliac Atirue"}, {"tag": "p", "text": "Azzim Anjiliac Atirue was a Hutt of Anjiliac kajidic, who oversaw the Hutt business on Da Soocha. He also owned a high-end spa called Maya Armus on Napdu, a moon of Da Soocha, which utilized the water of the sacred planet's to aid in its relaxation. He wore a metal cap over his head. Azzim was also the nephew of Vedo Anjiliac Atirue, the leader of Anjiliac kajidic and a member of the Hutt Grand Council."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 137 ABY, Azzim helped the Galactic Alliance Remnant to smuggle offworld multiple Mon Calamari refugees fleeing from the Imperial genocide of Dac, despite the risk to both himself and his business."}, {"tag": "p", "text": "Later, the Pellaeon-class Star Destroyer War Hammer bombarded Napdu, destroying the Hutt's spa and killing Azzim in the process under orders from Darth Azard. Moff Rulf Yage, who officially called the attack, felt terrible for his actions, but carried out the orders regardless. Yage knew that many innocents would be killed in the bombardment, and rebuked Azard's order to send clean-up crews to be overkill. The Moff attempted to picture Azzim's final moments, wondering as to what he thought as he died under tyranny. Azzim's death and its surrounding events greatly angered the Hutt Grand Council, and prompted them to action, albeit secretly, against the Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Unlike many Hutts, Azzim was compassionate towards others and was disgusted by the purging of Dac, and allowed refugees from the planet to take shelter in his domain. Nevertheless, he was a businessman, and knew not to openly rebel against the Sith Empire. Additionally, he would allow the scum and villainy of the galaxy to use his facilities, providing they had the credits. Azzim kept a security force of droids and personnel on hand to deal with any troublemakers."}, {"tag": "h2", "text": "Appearances"}]}