{"url": "Rancor", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Carnivorous creatures", "Category:Domesticated creatures", "Category:Jungle and forest creatures", "Category:Rancors", "Category:Reptiles", "Category:Semi-sentient species"], "nodes": [{"tag": "h1", "text": "Rancor"}, {"tag": "p", "text": "Rancors were large semi-sentient reptilian carnivores native to the planet Dathomir."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Standing around five meters tall, with their long arms, immense jaws, and armored hides that could withstand blaster fire, they were formidable predators. A subspecies known as the jungle rancor populated the planet Felucia. Rage rancors were taller and had an even nastier temperament than an average rancor. Shadow rancors were notorious for their penchant for destruction, gaining their name from their black skin. The proper term of venery for rancors in Galactic Basic Standard was a crash of rancors."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Rancors responded to a social hierarchy where an alpha was dominant over other rancors unless defeated. Despite their extremely intimidating appearance,  the creatures were inherently benign and were even domesticated by the Witches of Dathomir, but could be provoked over time into a violent nature."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pre-Clone Wars"}, {"tag": "p", "text": "When the Fromprath came to Dathomir, they exploited the natural resources of the planet, which caused the Nightsisters to form a symbiotic alliance with rancors in order to drive out the colonizers."}, {"tag": "h2", "text": "Rancors in the galaxy"}, {"tag": "p", "text": "The jungle rancor subspecies lived on the world of Felucia; after the destruction of Felucia Medical Station HCTFF2, Jedi General Obi-Wan Kenobi, Jedi General Anakin Skywalker, and Jedi Commander Ahsoka Tano saw a group of such rancors on planet. While they were careful to not scare the creatures, the jungle rancors lived a relatively peaceful co-existence with the native Felucian farmers."}, {"tag": "p", "text": "After the rise of the Galactic Empire, Clone Force 99 was hired by Cid to rescue Muchi, an adolescent rancor on Ord Mantell, though they were not informed she was a rancor. Muchi was released by Omega in order to help the squad and some slaves escape from a group of Zygerrian slavers, and Echo expressed surprise upon discovering that Muchi was the rancor, not one of the slaves."}, {"tag": "p", "text": "A rancor named Pateesa was kept as a pet by Jabba the Hutt in a pit below his palace court, to which he fed any who displeased him. The beast was killed by Luke Skywalker, after which its human handler, Malakili, mourned its death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The concept for the rancor in Return of the Jedi was described by its creators as \"a cross between a bear and a potato.\" It was first to be played by an actor in a suit, but no one was satisfied with the results. The rancor was then made as a rod-operated puppet, filmed with a high-speed camera to slow its movements down to give the illusion of a much larger creature."}, {"tag": "p", "text": "A combination of matte painting, cartoon rotoscoping, and CG elements were added around the creation to make it look bigger and more menacing. Some of these changes were later omitted or replaced with CG effects in the 2004 DVD release of the original trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}