{"url": "Rand_Ecliptic/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Captured starships", "Category:Imperial II-class frigates", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Rand Ecliptic"}, {"tag": "p", "text": "The Rand Ecliptic was an Imperial II-class frigate during the time of the Galactic Civil War, captured by Imperial defectors to the Rebel Alliance among its crew."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Rand Ecliptic was an Imperial II-class frigate and was first commanded by Captain Heliesk, serving the Galactic Empire early in the Galactic Civil War."}, {"tag": "p", "text": "Upon the graduation of pilots Biggs Darklighter, Derek Klivian, and their classmates from the Imperial Academy, they were assigned to the Rand Ecliptic as part of its complement of TIE/LN starfighters, Twilight Squadron. Both Darklighter and Klivian were involved with different rebel cells on the ship, two of the Rand Ecliptic's four such cells, none of which knew of the existence of the others."}, {"tag": "p", "text": "While Darklighter and his cell were having a secret meeting discussing their planned defection, they were discovered by Klivian, leading to a confrontation between Klivian and Darklighter, and forcing Darklighter and his cell to defect from the Empire sooner than they had originally planned. Unbeknownst to Darklighter, Klivian, likewise accelerating his plans, began his own insurrection with his rebel cell with the help of the other pair of cells aboard the Rand Ecliptic. Klivian was able to lead the mutiny to success, taking over the frigate. Ironically, unbeknownst to any of the rebel cells, the captain himself was a Rebel agent codenamed Starfire, though he could not afford to reveal himself."}, {"tag": "p", "text": "Meanwhile, Darklighter and his group escaped the Rand Ecliptic during the chaos on TIE fighters—which lacked hyperdrives. Hiding out in deep space for hours with few supplies and little air, they eventually decided to return to Rand Ecliptic to raid the ship's fuel and oxygen supplies, only to find that Klivian had commandeered the vessel. Under the command of Klivian, with Darklighter as his first mate, the Rand Ecliptic set out to join the Rebel Alliance."}, {"tag": "p", "text": "At some point after the mutiny, Imperial forces attempted to stop the Rand Ecliptic from escaping to the Rebellion, but the mutineers, with the assistance of Lindy, a friend of Hobbie's, dumped the ship's cargo into the path of the pursuing TIE fighters, destroying them and allowing the ship to escape to hyperspace."}, {"tag": "p", "text": "Taken to the Rebel base on Yavin 4, the Rand Ecliptic participated in a strike at an Incom Corporation facility, carrying captured Incom X-wing starfighters back to Yavin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rand Ecliptic was mentioned by Biggs Darklighter in a scene cut from A New Hope, and has appeared several times in various sources, with numerous inconsistencies in its appearance, role, and history, identified by West End Games roleplaying material as a merchant freighter, and depicted by X-Wing Rogue Squadron 25 as a distinct model of starship from its later appearance in Star Wars: Empire: Darklighter. The latest incarnation, Darklighter, depicts the Rand Ecliptic as a wedge-shaped Imperial frigate, as described in this article."}, {"tag": "p", "text": "The mutiny and events leading to the mutiny in Darklighter differ greatly from Hobbie's retelling of them in Galaxy Guide 3: The Empire Strikes Back's short story \"Mutiny on the Rand Ecliptic\". It is not known which source is more accurate, although this article presents Darklighter's version of events for the sake of clarity."}, {"tag": "p", "text": "According to \"Mutiny on the Rand Ecliptic\", Klivian and Darklighter planned to jump ship together, meeting Lindy and his Rebel contact \"Starfire\" while the Rand Ecliptic was delivering a consignment of rubindum ore in the Bestine system. Through the covert efforts of \"Starfire\", in fact Alliance sympathizer Captain Heliesk, Lindy and his rebel allies were taken aboard the ship, while Darklighter and Klivian staged a mock mutiny. With Lindy's rebels as their crew, they took control of the Rand Ecliptic by threatening to set the ship to self-destruct, allowing the Rebel Alliance to take possession of the frigate's cargo of rubindum without exposing Heliesk's allegiance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}