{"url": "Rank_insignia_plaque", "categories": ["Category:Canon articles", "Category:Articles needing additional sources", "Category:Incomplete lists", "Category:Imperial Military", "Category:Insignia", "Category:Military ranks", "Category:Republic Military", "Category:Uniforms"], "nodes": [{"tag": "h1", "text": "Rank insignia plaque"}, {"tag": "p", "text": "Rank insignia plaques, also referred to as rank pins, were badges used in the military forces of Sheev Palpatine's Galactic Empire as a means to indicate and distinguish officer ranks. They were originally used by Republic officers during the Clone Wars, when Palpatine was still Chancellor of the Galactic Republic. The plaque, which was worn on the left side of the regulation tunic over the heart, consisted of translucent, colored rectangular tiles mounted on a metal bar. Those plaques could comprise one or two rows of tiles mounted on top of another. Double-row plaques were made from two separate parts of one row each, rather than two rows of caps on a single backing piece. The different types of tiles came in blue, red, gold yellow, and grey. Rank plaques could be encoded with information readable by devices such as electronic locks. Members of media organizations such as the Imperial Press Corps wore Imperial media badges."}, {"tag": "h2", "text": "Galactic Republic insignia"}, {"tag": "p", "text": "As exemplified by Wullf Yularen, Shoan Kilian, Barton Coburn, and Wilhuff Tarkin, a fleet admiral wore an insignia that bore three red tiles on the top bar and two blue tiles on the bottom bar. Many clone navigation officers, some of whom held the rank of captain, wore a single-rowed plaque, with two red and one blue tiles (from left to right). Some clone troopers at the rank of corporal wore a single-rowed plaque of one blue tile followed by two red."}, {"tag": "h2", "text": "Galactic Empire insignia"}, {"tag": "p", "text": "Although the designs of the Republic plaques remained in use for a brief period after the rise of the Empire, new designs were soon made. However, these designs were sector-specific, which created a jumble of non-uniform markings. Rank plaques weren't just worn by officers, but also by Imperial Navy Troopers and even members of the Stormtrooper Corps such as Snowtroopers."}, {"tag": "p", "text": "While it was theoretically possible to put a comlink in an Imperial rank plaque by hollowing out the tiles from behind, there was not enough room for all the encryption chips and a proper battery fit for long-range use. However, it was possible to put a functional beckon call into a rank plaque."}, {"tag": "h3", "text": "Imperial Military"}, {"tag": "p", "text": "The rank of ensign was shown by one red square over one blue, and that of Junior Lieutenant by two red squares over two blue, or a row of two blue squares. A standard lieutenant was also shown by two red squares over two blue. Alternatively, a single row of three, four or six blue squares could be used, or a single row of two red squares followed by one blue (which also denoted a Second Lieutenant)."}, {"tag": "p", "text": "The rank of captain, or commandant for those commanding academies, was signified by three red squares over three blue. A captain could also wear a row of six yellow squares, three red squares followed by one blue, or three blue squares followed by two red. A commander also wore a plaque with three red over three blue, or a line of two red squares, or a line of four blue followed by two red. Chiefs wore a plaque of four yellow squares followed by two red or three blue followed by two red. A major, a colonel and a commodore were all shown by four red squares over four blue, along with the rank of general, although in this case the squares were spaced out further than other ranks. A general could also be shown by six blue squares over six red, a line of six red squares, or four yellow squares followed by two red."}, {"tag": "p", "text": "An Imperial Vice Admiral wore a rank plaque depicting five red squares over five blue. An admiral was shown by six red squares over six blue, or a single row of either four red squares followed by two yellow, two blue squares followed by four red, or a row of six blue squares. Both Grand Admiral and Grand General bore a plaque with three blue squares followed by three yellow, over trios of blue and red."}, {"tag": "h3", "text": "Imperial Security Bureau"}, {"tag": "p", "text": "Both lieutenants and majors of the Imperial Security Bureau had two red squares over two blue on their plaques. A loyalty officer featured a plaque bearing one blue square followed by three red ones. Agents of the ISB wore either two blue squares next to one grey and one red, or at a higher level three blue squares next to two yellow ones. An ISB Inspector General wore a plaque with three red followed by one blue, and a colonel wore a plaque with three red squares followed by three blue ones. An admiral, as with the regular military, was six red over six blue."}, {"tag": "p", "text": "A Lieutenant Commander in the Imperial Military Department of Advanced Weapons Research division of the ISB wore a plaque with a row of six red squares. A director in Advanced Weapons Research wore six red squares over six blue. A scientist in Project Celestial Power, which existed within Advanced Weapons Research's Tarkin Initiative, wore a plaque with four yellow squares followed by one red."}, {"tag": "h3", "text": "Inspectorate"}, {"tag": "p", "text": "An inspector in the Inspectorate wore a plaque with three red squares over three blue, and a Captain-Inspector had a plaque of three red squares followed by one blue."}, {"tag": "h3", "text": "Governance"}, {"tag": "p", "text": "A Moff's plaque had five blue squares over three red and two yellow. A Grand Moff had six blue squares over trios of red and yellow, as was a governor's."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The rank insignia plaque first appeared in the 1977 movie Star Wars: Episode IV A New Hope, although they were unnamed. They received identification in the 2014 reference book Star Wars Rebels: The Visual Guide."}, {"tag": "p", "text": "Costume designer Glyn Dillon has released an Imperial rank chart reconstructed by co-designer and military expert David Crossman for use on Rogue One and Solo: A Star Wars Story."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "According to Pablo Hidalgo, the rank badges \"only mean anything in Empire Strikes Back.\" In A New Hope, the plaques look different than in The Empire Strikes Back, despite many officers holding the same rank. In Return of the Jedi, all of the plaques were mistakenly made as commander plaques due to a costuming error, even those of Admiral Firmus Piett and Moff Tiaan Jerjerrod. Both Rogue One: A Star Wars Story and Star Wars Rebels feature both styles of plaques."}, {"tag": "p", "text": "In Inspector Thanoth's debut issue, Darth Vader 8, he wore a rank insignia featuring three blue squares over three red. However, in all subsequent issues, up until his death in Darth Vader 20, he wore a plaque with three red over three blue. This article assumes the more recent and more numerous depiction of the plaque is correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}