{"url": "Rann_I-Kanu", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi Guardians", "Category:Jedi healers", "Category:Jedi Purge victims", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Naboo Underground"], "nodes": [{"tag": "h1", "text": "Rann I-Kanu"}, {"tag": "p", "text": "Rann I-Kanu was the a male Human Padawan of Jedi Master Ali-Vor and served the Jedi Order during the final years of the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Life"}, {"tag": "p", "text": "Rann I-Kanu, a Force-sensitive male Human, was born in 47 BBY. Soon after, he became a member of the Jedi Order, accepted for training and was considered to be strong in the Force. I-Kanu was later selected as a Padawan by Jedi Master Ali-Vor, a Jedi scholar."}, {"tag": "h3", "text": "Battle of Naboo"}, {"tag": "p", "text": "At some point prior to 32 BBY, at the age of 15, Ali-Vor brought I-Kanu to the planet of Naboo, furthering the Padawan's education by enrolling him in the Royal House of Learning in Theed. When Ali-Vor learned that a group of smugglers were taking local fauna off-world, he tasked I-Kanu with finding out the truth to the rumors. I-Kanu enlisted the help of his friends and classmates; Galak, a young volunteer soldier of the Royal Naboo Security Forces; Rorworr, the son of a Wookiee ambassador; and Arani Korden, the adventurous daughter of a House Korden nobleman."}, {"tag": "p", "text": "Korden managed to obtain a map to the smuggler's base via one of her contacts, which led the group to the precise location. There, they indeed discovered a hidden base, secreted inside an overgrown jungle shrine, and made their way inside. Once inside, they battled and defeated small group of smugglers, then learned that the group was smuggling dangerous veermoks off the planet. I-Kanu and the others then discovered Professor Tasrah Boh, a local Naboo archeologist from the House of Learning who had been taken captive by the smugglers when he drove his speeder too close to their hideout. After defeating a Remote programmed to attack intruders, they freed Boh from his cage. After conversing with I-Kanu and his friends, Boh fled the hideout."}, {"tag": "p", "text": "I-Kanu and the others then encountered Saidle Frex, an armored mercenary who hired the smugglers, as well as another man wielding a Vibro-ax. The Padawan and his friends were able to defeat both men and return to I-Kanu's master with information regarding the smuggling operations. He played a minor role as a member of the Naboo Underground in defending Naboo from Trade Federation forces during their occupation of the planet. Along with his old friends, as well as new allies from the House of Learning, they participated in weapons theft and liberation of prisoners against the Droid army and the Neimoidians. In one particular operation, he freed the Naboo Minister of Culture, Kyu Tane."}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "Years later when the Clone Wars came to an end, Emperor Palpatine ordered the galaxy-wide execution known as Order 66, in which every clone troopers were to execute their own Jedi Generals and Commanders without question, leading to the Great Jedi Purge. After the Republic was transformed into the Galactic Empire under the control of the Sith, Rann I-Kanu was one of the surviving Jedi that avoided the execution of Order 66, but were being pursued by Darth Vader, the apprentice of Emperor Palpatine. Along with Sia-Lan Wezz, he was declared eliminated by the Sith, while some, including Rorworr, believed he was missing during the Empire's reign across the galaxy."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Among the Force powers I-Kanu mastered during his time as a Jedi were battlemind, Force healing, and Force sight. He was also considered to be strong in the Force and an able combatant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}