{"url": "Rannon", "categories": ["Category:Legends articles", "Category:Arboreal planets", "Category:Rannon system planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Rannon"}, {"tag": "p", "text": "Rannon was a forested planet that was located in the Outer Rim Territories' Instrop sector. It was settled centuries before the reign of the New Republic and was inhabited by a population of ten million Humans and Rodians, who governed their settlements via cooperative council."}, {"tag": "p", "text": "Following the Battle of Endor in 4 ABY, the Dark Jedi Danaan Kerr took up residence in Rannon's Valley of Ternaax. By 7 ABY, Kerr had sensed that the Galactic Emperor Palpatine had survived his death at Endor, which caused Kerr's dark side corruption to manifest, transforming the valley he resided in. Kerr began to terrorize Rannon's populace, with rumors concerning atrocities committed by the Dark Jedi spreading off-world. Eventually, a group of individuals investigated the Valley of Ternaax and encountered Kerr himself."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Rannon was a remote terrestrial planet located in the Rannon system, a part of the Instrop sector in the Slice portion of the Outer Rim Territories. The planet occupied the third closest orbit to its star, the yellow-white Rannon, and had two moons of its own. Rannon completed one revolution around its sun every 380 local days, each of which was twenty standard hours long."}, {"tag": "p", "text": "Rannon had standard gravity, a Type I breathable atmosphere, and a pleasant temperate climate. Its terrain features included mountainous forests and a moderate hydrosphere."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The abode of a Dark Jedi"}, {"tag": "p", "text": "Rannon was first colonized several centuries before the reign of the New Republic. Following the death of Galactic Emperor Palpatine at the Battle of Endor of 4 ABY, the insane Dark Jedi Danaan Kerr also settled on the planet, living in Rannon's Valley of Ternaax as a hermit."}, {"tag": "p", "text": "At some point by 7 ABY, Kerr began to sense stirrings in the dark side of the Force indicating to him that Palpatine, who had in fact survived in a clone body, was still alive. Since that revelation, Kerr's evil and corruption became to manifest, transforming the valley where he resided."}, {"tag": "h3", "text": "Spreading rumors"}, {"tag": "p", "text": "Kerr began to influence Rannon's populace and terrorize the natives, with rumors concerning atrocities committed by the Dark Jedi beginning to spread across the Instrop and other sectors. In addition, Kerr trained several initiates in the use of the Force. Eventually, General Airen Cracken of the New Republic noted the rumors that Kerr had taken up residence in the Rannon system in Wanted by Cracken, a datafile that served as a compilation of reports on various threats to the New Republic."}, {"tag": "p", "text": "At some point, a group of individuals visited Rannon. A Force-sensitive member of the group perceived a disturbance in the Force caused by Kerr, although the individuals learned little by talking to the natives about it. Eventually, a local who was considered to be crazy revealed to the group the existence of Kerr and the Valley of Ternaax. The group subsequently investigated the valley, encountering the Dark Jedi himself."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Rannon was home to a population of ten million Humans and Rodians, who maintained a society of space-level technology. Although the local populace exported foodstuffs and gems off-world, their homeworld lacked any outstanding resources. To most people, Rannon seemed a simple world, albeit one that could serve as home, and no significant goods were imported from elsewhere."}, {"tag": "p", "text": "Settlements were spread across Rannon's surface, and the native society governed itself via cooperative council consisting of representatives sent from each town. The council decided on standardized laws that applied to each settlement. During the reign of the New Republic, the Dark Jedi Danaan Kerr also lived on Rannon as a hermit."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Valley of Ternaax was a lush and beautiful area of Rannon that was covered with forests. It was located far from the planet's settlements and at first was only known to the Dark Jedi Danaan Kerr. Due to the manifestation of Kerr's dark side corruption, the valley's landscape eventually became rotted, dark, and evil. Rannon also had a spaceport that offered limited services."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rannon was first mentioned in the 1993 Star Wars: The Roleplaying Game supplement Wanted by Cracken, which was written by Louis J. Prosperi for West End Games. The 2009 reference book The Essential Atlas placed the Rannon system, and therefore the planet itself, in grid square T-17."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}