{"url": "RapidResponse_police_speeder/Legends", "categories": ["Category:Legends articles", "Category:Aratech Repulsor Company products", "Category:Coruscant police vehicles", "Category:Galactic Republic repulsorcraft", "Category:Speeder bikes"], "nodes": [{"tag": "h1", "text": "RapidResponse police speeder"}, {"tag": "p", "text": "The RapidResponse police speeder was a civilian/police variant of the military BARC speeder and was used by the Coruscant Security Force as a police speeder during the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The RapidResponse Speeder had a dark, blue and gray paint scheme. Flashing red and blue lights were fixed near the aft and stern thrusters. On the rear was the Coruscant Security Force symbol."}, {"tag": "p", "text": "The speeders were powered by repulsors and a turbine engine mounted on the frontal prong. The speeder was controlled via twin steering vanes atop the bike and pedals fitted below. Two blaster cannons protruded from the bottom of the forward prong."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The RapidResponse police speeder was based on the BARC speeder utilized by the Grand Army of the Republic during the Clone Wars. Originally developed for military use by Aratech Repulsor Company, the BARC speeder saw such great success that Aratech repackaged it for police use on Coruscant. Mostly, they were driven by CSF police droids."}, {"tag": "p", "text": "Tera Sinube and Ahsoka Tano rode a borrowed speeder to a train station to catch Ione Marcy and Cassie Cryar via homing beacon cleverly placed on Marcy's back by Sinube."}, {"tag": "p", "text": "When it appeared Satine Kryze had murdered Davu Golec CSF police droids used the speeders to pursue a civilian RGC-16 airspeeder which the Coruscant Guards thought she was escaping in."}, {"tag": "p", "text": "The speeders were also used to chase down Senator Padmé Amidala when she was escaping from an assassination attempt by two thugs, Chata Hyoki and Robonino."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The RapidResponse police speeder was designed for the Star Wars: The Clone Wars TV series. It first appeared in the episode Lightsaber Lost where Master Sinube and Jedi Tano borrow it from one of the police droids. The speeder would later appear in subsequent episodes including Duchess of Mandalore, Pursuit of Peace, Senate Murders, and To Catch a Jedi where it would be used by the Coruscant Security Forces as a patrol and pursuit speeder. A concept art image of the RapidResponse speeder for use by the Coruscant Underworld Police in the cancelled Star Wars: 1313 game, appeared in Star Wars Art: Concept which was published on October 15, 2013."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}