{"url": "Rappertunie/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Males", "Category:Max Rebo Band members", "Category:Shawda Ubb"], "nodes": [{"tag": "h1", "text": "Rappertunie"}, {"tag": "p", "text": "Rapotwanalantonee Tivtotolon, also known by the stage name of Rappertunie, was a Shawda Ubb musician from Manpha and member of the Max Rebo Band. He was able to spit paralyzing poison at individuals when threatened. This poison was able to paralyze a Human for a quarter of an hour."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Filled with the desire to explore, Rappertunie took up the growdi to finance his travels. He played his instrument, the Growdi Harmonique (a combination of a flute and water organ), as well as the bi-tuminal wind cuspers[source?] and the pit horn[source?], at scattered settlements, eventually reaching the capital and gaining passage offworld. Despite his preference for the swampy atmosphere of Manpha, Rappertunie took a position in the Max Rebo Band playing on Tatooine. Eventually, the arid heat affected Rappertunie's playing and attitude, which prompted him to push for the band to leave the lucrative gig. He declined to accompany the group assembled to execute Luke Skywalker, Han Solo, and Chewbacca. Fortunately for him, this was his salvation, as Jabba Desilijic Tiure died in the explosion of his sail barge at the Great Pit of Carkoon."}, {"tag": "p", "text": "Rappertunie continued his music career for a short while after departing Tatooine, but settled down to be a computer engineer for Rebaxan Columni, working on their MSE-6 droid line."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rappertunie was added to the extended musical number in the Special Edition of Return of the Jedi. He was played using a traditional puppet digitally inserted into the film."}, {"tag": "p", "text": "Rappertunie's backstory has similarities with that of Muppet character Kermit the Frog. Both start their music careers playing an instrument in a swamp, which leads to them going on to bigger and better things and eventually achieving stardom. It is uncertain whether or not this was intentional."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}