{"url": "Ranso_Li", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified gender", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Ranso Li"}, {"tag": "p", "text": "Ranso Li was a Twi'lek who was employed by the crime lord Nirama during the era of the New Republic. In 19 ABY, Li and the Twi'lek Cruva Lenda journeyed to the moon Nar Shaddaa to acquire some freighters on Nirama's behalf."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ranso Li was a Twi'lek who worked for Nirama, an Oblee crime lord who operated a smuggling concern in the Cularin system. In 19 ABY, during the reign of the New Republic, Li and the Twi'lek Cruva Lenda traveled from the planet Cularin to the moon Nar Shaddaa to acquire some fast, second-hand freighters for use by Nirama's organization. There, the pair attended a banquet that was held by the Hutt Popara Anjiliac Diresto inside Popara's penthouse, in honor of the Hutt's guests Eddey Be'ray, Reen Irana, and Mander Zuma."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "During Popara's party, Li spoke to some of the other guests about the Cularin system's merits as a tourist destination. Li was multi-lingual and could speak Basic, Huttese, and Twi'leki. The Twi'lek wore high-quality clothing and carried a blaster pistol and a datapad."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ranso Li was created by Jeff Grubb and Owen K.C. Stephens, and appeared in the 2002 paperback role-playing supplement Tempest Feud. The book includes a seating plan for Popara's party, showing that during the event, one of Nirama's Twi'lek agents sat a table with the Corporate Sector Authority representative Miltar Dolor, the Hutt Lungru, and the Cerean Kir Sesad, while the other Twi'lek sat with Popara's son Mika and some Bimms. However, the adventure does not specify which of the seating placements applied to Li, and which one applied to Lenda. The supplement also does not reveal Li's gender. While Tempest Feud has no timeline setting and as such can take place in any publishing era, Scourge—a novelization of the events of Tempest Feud that was written by Grubb and released in 2012—revealed that the events of the adventure are set in 19 ABY, thus making the New Republic era the period in which Li lived. Furthermore, Li and Lenda make a possible appearance in Scourge, which notes that a pair of male Twi'leks were in attendance at Popara's party."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}