{"url": "Rasi_Tuum_family", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Families", "Category:Force-sensitive bloodlines"], "nodes": [{"tag": "h1", "text": "Rasi Tuum family"}, {"tag": "p", "text": "The Rasi Tuum family was a family of Cathar that, during the time of the Second Imperial Civil War, consisted of the littermates Ahn, Zho, and a brother known only as Rasi Tuum. All three were members of the New Jedi Order. Ahn was killed by the One Sith in 137 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The three Rasi Tuum brothers were born as a litter sometime before 130 ABY and served as Jedi is the New Jedi Order during the Sith–Imperial War. Rasi Tuum took on a Force-sensitive Human Padawan known as Azlyn Rae during this time and trained her in the ways of the Jedi. Around this time, Tuum was sent on a mission to the planet Roon where he saved a mining camp from the pirates Rav and Zareb Syn. During the battle he cut Rav's leg off and killed Syn."}, {"tag": "p", "text": "All three of the brothers survived the massacre at the Jedi Temple on Ossus in 130 ABY. After this event, the surviving Jedi were scattered across the galaxy ."}, {"tag": "p", "text": "In 137 ABY, Ahn Rasi Tuum met with fellow Jedi Wolf Sazen, Shado Vao, and a Human Jedi on the planet Daluuj to discuss the possibility of searching for Cade Skywalker.Ahn warned Sazen of the dangers of meeting in a group however his concerns were disregarded. During the debate, Ahn assumes that in the seven years since the fall of Ossus, Cade Skywalker must have perished. Shortly after, his suspicions come true as the group are ambushed by the Sith. They make their presence at the meeting known by hurling a spear at Ahn Rasi Tuum, impaling him through the chest. The Sith engage the Jedi, force pushing Tuum into the Ravine where he met his end below. The Human Jedi that accompanied him was cut down by the Sith during the battle but ultimately Sazen and Vao emerged victorious, deciding to begin their search for Skywalker."}, {"tag": "p", "text": "Elsewhere, Rasi Tuum and Zho Rasi Tuum made their way to the Hidden Jedi Temple on the planet Taivas. Rasi Tuum remained at the temple whilst Zho ventured out into the galaxy in order to bring any surviving Jedi to the Temple. Tuum was at the Temple when Cade Skywalker and his crew arrived. Among the pirates was his former Padawan Azlyn Rae who was now working as an Imperial Knight. The pair were reunited in which Rae expressed the belief that her master had perished. She inquired about Tuum's brothers to which he explained Ahn's death and Zho's mission to locate other Jedi. He did not seem phased by his brother's recent demise and instead focused on telling Rae of the fate of Jho. Tuum raised concerns about whether her allegiances were with the Jedi or the Imperials. Shortly after this interaction, Rasi Tuum was attacked by another member of Cade's crew, Jariah Syn the son of Zareb Syn, in an act of  vengeance for killing his father. He was unsuccessful in his attack as Tuum forced Syn to face up to the fact that his father was a bad man and he was only trying to protect the miners."}, {"tag": "p", "text": "Rasi Tuum later fought alongside his old Padawan once again on Agamar when a meeting between the Jedi and Emperor Roan Fel was interrupted by the Sith who attempted to assassinate the Emperor. Tuum and Rae attempted to escort Princess Marasiah Fel to an Imperial Shuttle in order to escape the Sith. However, the ship was destroyed as the trio reached it. Tuum and Rae were caught in the blast and rendered unconscious. They awoke to find the Princess gone. Reaching out in the force, they discovered that she was being taken to Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}