{"url": "Raskane_IV", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Sepan sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Raskane IV"}, {"tag": "p", "text": "Raskane IV, also known as Raskane Four, was an Expansion Region planet located in the Sepan sector. Political tensions nearly led to a civil war on the planet around 3643 BBY, but the situation was diffused by an individual affiliated with one of the sides in the ongoing struggle between the Galactic Republic and the reconstituted Sith Empire. During the Galactic Civil War, the Rebel Alliance agent Matt Talon once claimed that he had caused the agony and death of an alien on Raskane IV."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Raskane IV, alternatively known as Raskane Four, was a terrestrial planet. It occupied the fourth orbital position in the Raskane system, a part of the Sepan sector in the Slice portion of the Expansion Region."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 3643 BBY, tensions between political factions on Raskane IV nearly led to a civil war. An individual affiliated with one of the sides in the ongoing struggle between the Galactic Republic and the reconstituted Sith Empire dispatched a companion to the planet in order to determine the faction that would be the easiest to manipulate in the future. The companion was also tasked with ensuring the success of that party once it was identified. Eventually, the companion tactfully eased the political tensions on Raskane IV and directed the resentment of the planet's political leaders toward the most vocal proponents of the civil war."}, {"tag": "p", "text": "The Rebel Alliance agent Matt Talon, who worked undercover as a slaver and had a violent personality and past, attempted to intimidate an individual during the Galactic Civil War. According to Talon's claims, he had once inflicted a trauma upon an alien on Raskane IV, with the victim dying after three days of agony."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Raskane IV was first mentioned in Galaxy Guide 9: Fragments from the Rim, a 1993 sourcebook written by Simon Smith and Eric S. Trautmann for West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed the Raskane system, and therefore Raskane IV, in grid square P-13. Star Wars: The Old Republic, a 2011 massively multiplayer online roleplaying game developed by BioWare, introduced the planet's alternate name \"Raskane Four.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}