{"url": "Rasi_Tuum", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Cathar", "Category:Jedi Masters of the New Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Rasi Tuum"}, {"tag": "p", "text": "Rasi Tuum was a Cathar male who, along with his brothers, Ahn and Zho, served the Jedi Order during the Sith–Imperial War and Second Imperial Civil War. Eventually ascending to the rank of Master, Tuum took the Human female Azlyn Rae as his Padawan, training her in the ways of the Force. At one point, during a mission to the planet Roon, he defended a camp of miners that the pirates Rav and Zareb Syn were attacking. During the ensuing skirmish, Tuum maimed Rav and slew Syn, earning the hatred of Syn's son, Jariah. In 130 ABY, at the end of the Sith–Imperial War, the Sith forces of Dark Lord of the Sith Darth Krayt assaulted the Jedi Temple on the galactic capital Coruscant. During the attack, Tuum told Rae to flee the Temple and later managed to escape the battle. The Jedi Order was scattered, but Tuum eventually made his way to the Hidden Jedi Temple on the planet Taivas."}, {"tag": "p", "text": "Seven years after the fracturing of the Order, Tuum was reunited with Azlyn Rae—now an Imperial Knight serving Emperor Roan Fel's Empire-in-exile—when she, the bounty hunter Cade Skywalker, and their companions arrived at the Hidden Temple. After speaking with Rae, Tuum was attacked by Jariah Syn, one of Skywalker's companions, who tried to avenge the death of his father. The Cathar Jedi Master managed to restrain Syn and explained the actual events of Zareb Syn's death and why he had killed the pirate. Sometime after Rae, Skywalker, Syn, and their allies seemingly assassinated Darth Krayt, Tuum traveled with a Jedi contingent, led by Jedi Master K'Kruhk, to the planet Agamar in order to meet with Emperor Fel and his Imperial Knights to discuss an alliance between the Jedi and Fel's Empire. After K'Kruhk and Fel reached an agreement for a mutually beneficial alliance, Sith–Imperials attacked the Jedi and Fel–Imperial delegations, and Tuum participated in the ensuing battle. In its aftermath, both he and Azlyn Rae were unsuccessful in their attempt to rescue Princess Marasiah Fel from Sith forces above Agamar. Both Tuum and Rae traveled to the Imperial stronghold of Bastion and informed Fel's Imperial Knights of the Princess's location on Coruscant, allowing the Imperial Knights and the Jedi to rescue her. Krayt was soon revealed to be alive and the war escalated anew. Tuum later participated in the allied attack on Coruscant, which saw the final death of Krayt and the defeat of the Sith."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Rasi Tuum, a Cathar male, was born along with his brothers, Ahn and Zho, in the decades leading up to the Sith–Imperial War. Both he and his littermates were found to be sensitive to the Force and were trained in the ways of the Jedi Order, with Rasi eventually becoming a Jedi Master. During this time, he took the Human female Azlyn Rae as his Padawan."}, {"tag": "p", "text": "At some point Tuum was sent on a mission to the planet Roon. While he was there, the Jedi Master felt a disturbance in the Force and came across the pirates Rav and Zareb Syn raiding a miner's camp. He pursued the pirates, who kidnapped a young Arkanian girl, as they retreated to their ship. After Tuum used his lightsaber to cut off Rav's right leg, Syn grabbed Tuum from behind, causing both himself and the Jedi Master to fall off the ship's loading ramp. The Cathar killed Syn and used the Force to jump on the ship's loading ramp in an attempt to pursue the pirates. However, Rav shot Tuum in the chest, causing him to fall to the surface. The Jedi Master managed to survive both the shot and the fall, and from that point would wonder if the girl he attempted to rescue was all right."}, {"tag": "p", "text": "In 130 ABY, both the Jedi Order and the Galactic Alliance were defeated by the Galactic Empire and One Sith forces at the end of the Sith–Imperial War. Both Tuum and Rae were present at the galactic capital Coruscant's Jedi Temple when the Dark Lord of the Sith Darth Krayt's Sith forces attacked. During the attack, Tuum instructed Rae to flee the Temple. Tuum survived the attack and managed to escape himself, eventually making his way to the Hidden Jedi Temple, which had been built by Jedi Master Nat Skywalker and the Jedi Council on the planet Taivas. Two days after the fall of Coruscant, the Sith attacked the Jedi Praxeum on Ossus, killing many Jedi and scattering those who survived. Krayt then established himself as Galactic Emperor and began hunting the remaining Jedi Knights."}, {"tag": "h3", "text": "Second Imperial Civil War"}, {"tag": "h4", "text": "Confronting Jariah Syn"}, {"tag": "p", "text": "In 137 ABY, during the Second Imperial Civil War, Tuum was at the Hidden Jedi Temple when the bounty hunter Cade Skywalker and his crew arrived, having been guided there by his uncle, Nat, now called \"Bantha\" Rawk. An Imperial delegation loyal to the deposed Emperor Roan Fel arrived shortly after Skywalker's starship landed. While Skywalker, the Imperial Knights, and Rawk met with the Jedi Council, Tuum recognized his former Padawan, Azlyn Rae—who was now an Imperial Knight and had arrived at the Temple with Skywalker—and approached her. After a joyous reunion, she asked about his brothers, and Tuum told her that while Ahn had been slain by the Sith, Zho was alive and searching for any remaining Jedi to bring to the Temple. As they headed to Meditation Garden Orenth, Tuum began questioning whether or not Rae felt loyalty to the Jedi or to the Imperial Knights, who had rescued her after the Massacre of Ossus and completed her training. After Rae explained that she swore an oath of loyalty to Emperor Fel, Tuum opined that her heart would always long to serve the Jedi way. He asked her to meditate on their conversation as she departed."}, {"tag": "p", "text": "A few moments later, as Tuum began to meditate in the garden, he was attacked by Cade Skywalker's companion Jariah Syn, who sought to kill the Cathar and avenge the death of his father, Zareb Syn. He was hit in the back by one of Syn's Yuuzhan Vong thud bugs but managed to evade Syn's blasterfire, disarming the man by using the Force to call Syn's blaster to him. The Jedi asked Syn why he was attacking him as he cut three more bugs in half with his lightsaber. When Syn accused Tuum of murdering his father, the Jedi used the Force to throw and pin Syn against a pillar and tangle him with nearby vines. Inquiring as to the identity of his attacker, Tuum allowed Syn, who had witnessed the Jedi kill his father, to tell his version of the events. After listening to Syn, Tuum explained that he sought to protect the miners who were being attacked by Syn's father and Rav, and implored Syn to admit to himself that his father was a bad man. When the Cathar asked about the girl whom Rav had taken, Syn told him that she was not all right, and left Tuum in the meditation garden. Later that night, Tuum—along with Skywalker's crew, Rawk, Azlyn Rae, and the Jedi Shado Vao and Wolf Sazen—witnessed as Skywalker's plan to assassinate Darth Krayt was rejected by the Jedi Council. Despite this, Skywalker's crew, Vao, Rae, and the Imperial Knights Ganner Krieg and Antares Draco traveled to the planet Had Abbadon. After ambushing Krayt, they believed they had successfully killed him."}, {"tag": "h4", "text": "Ambush on Agamar"}, {"tag": "p", "text": "Sometime after Shado Vao informed the Council that Krayt had been killed, Tuum traveled with a Jedi contingent, led by Jedi Master K'Kruhk, to the planet Agamar, in order to rendezvous with Emperor Fel and discuss an alliance between the Jedi and Fel's Empire. On the night before they met with Fel, Tuum had a discussion with Masters K'Kruhk, Hira, and Shado Vao about Fel and his Empire, with K'Kruhk insisting that the alliance was necessary for the moment. The next day, Tuum, Hira, and Vao were present for the successful negotiations between K'Kruhk and Fel for an alliance between the two organizations. Shortly thereafter, Moff Nyna Calixte, who served in Krayt's Empire, betrayed the organization by arriving and warning the Jedi and Fel's Imperial Knight bodyguards that the Sith knew of the meeting and were coming with a task force to capture or eliminate the Emperor."}, {"tag": "p", "text": "Tuum, his fellow Jedi, and the Imperial Knights prepared for battle as the Sith revealed themselves. K'Kruhk instructed the Cathar and the other Jedi to defend the Emperor, believing that the galaxy's fate depended on Fel's survival. During the battle, Tuum and Azlyn Rae escorted the Emperor's daughter, Imperial Princess Marasiah Fel, to the Imperial delegation's shuttle, Defender One. As the three of them approached the shuttle, a group of TIE Predators shot at the ship. The ensuing explosion incapacitated Tuum and Rae, allowing the Sith to capture Princess Fel after the Emperor was evacuated aboard the shuttle without her. After Tuum and Rae awoke to find that the Princess had been captured, they reached out with the Force and sensed that the Sith were taking her to Coruscant."}, {"tag": "p", "text": "Three days after the Sith's attack on Agamar, Tuum and Rae ambushed the Sith Yuln and Bokar, who were searching for survivors of the battle, and killed them. After finding the deceased Sith's attack ship, Rae expressed her distress over failing her duty to protect Princess Fel. Tuum insisted that it was the Force's will that she was captured, but he eventually agreed to help Rae with her attempt to save the Princess. They strove to infiltrate the Sith–Imperial fleet above Agamar aboard the Sith attack ship, and tried to board the Pellaeon-class Star Destroyer War Hammer. However, the War Hammer's docking codes had been changed, and Tuum and Rae were assaulted by other Sith attack ships. They managed to escape and headed for Bastion to inform Emperor Fel and the Imperial Knights of the Princess's location on Coruscant. After arriving, Tuum and Rae transmitted the proper clearance codes to Fel's forces, which enabled them to bypass the mines in Bastion's orbit. They landed on a docking pad with Imperial Knights Antares Draco and Ganner Krieg, Master armorer Hogrum Chalk, and the Jedi Shado Vao waiting for them. After disembarking, Draco verbally berated Rae for not successfully protecting Princess Fel. Tuum attempted to calm him down but was Force-pushed across the landing platform by Draco. Vao then warned the Imperial Knight not to strike his ally. Ultimately, Draco, Krieg, and Vao successfully rescued Princess Fel from the Sith world Korriban, although Draco was captured during the mission."}, {"tag": "h4", "text": "The war's end"}, {"tag": "p", "text": "In 138 ABY, the Hidden Temple was attacked by the reborn Darth Krayt's Sith forces, and the Jedi had to evacuate to Bastion. There, the joint forces of the Jedi Order, Fel's Empire, and the Galactic Alliance planned to strike at the heart of Krayt's Empire, Coruscant, and attempt to retake the planet. Tuum joined a strike team that was supposed to infiltrate Coruscant before the main invasion force and disable the computers that controlled Coruscant's orbital defenses. The strike team was led by Morrigan Corde—the alter ago of Moff Calixte—and also included Skywalker, Vao, Sazen, Rae, and Masters Krieg and Sigel Dare. The team was covertly brought to Coruscant on Skywalker's ship, the Mynock, and reached the computer center two minutes before the main attack was set to begin. The strike team's appearance surprised the Imperial technicians and stormtroopers stationed there, and Tuum and the rest of the group engaged them in battle. Krieg, Vao and Skywalker managed to destroy the computers, disabling the orbital defenses and allowing the allied fleet to safely emerge from hyperspace near the planet. As the full-scale battle erupted, the strike team, led by Skywalker, set off toward the Temple of the Sith to confront Darth Krayt. At the entrance to the temple, however, they were confronted by a number of Sith, including the high-ranking Sith Darth Talon and Darth Stryfe. Intent on stopping Skywalker, Talon led the Sith into an attack on Skywalker's group."}, {"tag": "p", "text": "During the following battle, Dare was wounded, and Sazen was struck down, although he managed to take Stryfe with him. Bested by Skywalker, Talon left the scene in order to warn Krayt of the impending attack. Urged by Vao, Skywalker followed her, while Tuum and the others remained to hold off the Sith. Skywalker was able to kill Krayt, and Krayt's death drove his loyal Sith troopers insane, as they attacked the allies and the Sith alike. Tuum and the strike team cut down the Sith troopers, and the battle—and the entire war—was soon over as the remaining Sith fled from Coruscant. In the aftermath of the battle, Tuum was present at the funeral of Roan Fel, who had fallen to the dark side during the battle and had been killed by Draco. During the funeral, the new galactic government was announced, the Galactic Federation Triumvirate, consisting of the Duros Admiral Gar Stazi, Master K'Kruhk, and the newly-crowned Empress Marasiah."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Cathar male Rasi Tuum believed strongly in the will of the Force and felt that every action was guided by the Force. Although he did not enjoy taking an individual's life, he believed that the Force willed that a Jedi ended a life on occasion, and also felt that sometimes a wicked person's life needed ending. However, Tuum never killed anyone when there was another choice and sought only to protect those he deemed innocent. Despite questioning whether the Jedi could trust Emperor Fel after the Sith were defeated, he nonetheless helped to protect him when the Sith–Imperials attacked the delegations on Agamar. After reuniting with Azlyn Rae, his former Padawan, and discovering that she was an Imperial Knight, Tuum questioned her as to whether she was loyal to the Jedi or the Imperial Knights. While he understood that the Imperial Knights completed her training, he believed that Rae was truly a Jedi in her heart and that she would always yearn for the Jedi way, despite the fact that her duty to the Imperial Knights was clear in her mind. During the battle of Coruscant, Tuum was determined to protect the other members of the strike team from the attacking Sith led by Talon."}, {"tag": "p", "text": "Tuum wore a set of brown Jedi robes and a necklace. He used a lightsaber containing a green crystal up to the time of the Sith's attack on Agamar. During that battle, Tuum utilized a blue crystal in his lightsaber. When fighting during the assault on Coruscant against Darth Krayt's empire, Tuum made use of a lightsaber with a yellow crystal."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Rasi Tuum possessed powers with telekinesis, often using this to shove his enemies or disarm them. He could also use the Force to manipulate plant life in order to disable his enemies. Tuum was capable of utilizing the Force to leap large distances. On Roon, he was able to sense a disturbance in the Force and successfully traced the source of the disturbance. He was also able to sense Princess Marasiah Fel's presence after the battle on Agamar. Tuum was proficient at lightsaber combat, using his lightsaber to deflect enemy blasterfire, and managed to surprise and kill the Sith Bokar by cleaving him in two."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rasi Tuum was created by John Ostrander for the Star Wars: Legacy comic series. He was first featured, along with his brothers, Ahn and Zho, in an image in the resource comic Star Wars: Legacy 0. The character seemingly died in the series' second issue; however, Legacy's twenty-fifth issue revealed that the Cathar who died was Rasi Tuum's brother, Ahn. When The Complete Star Wars Encyclopedia was released a few months later, the authors used Ahn's biography for Rasi Tuum's entry. Tuum was later featured in the third and fourth issues of Legacy's Monster story arc, and was also included in the first and second issues of the Extremes story arc. Tuum has been penciled by Jan Duursema in all of his appearances in Legacy. The cover of Star Wars: Legacy's forty-ninth issue was originally set to feature Rasi Tuum and Azlyn Rae, before being swapped for a cover depicting Cade Skywalker and Wolf Sazen instead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}