{"url": "Rattataki/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Accuracy disputes", "Category:Human and Near-Human species", "Category:Outer Rim Territories species", "Category:Rattataki"], "nodes": [{"tag": "h1", "text": "Rattataki"}, {"tag": "p", "text": "The Rattataki were a Near-Human species characterized by their chalk-white skin and bald heads. Virtually isolated from the rest of the galaxy, the Rattataki developed a violent society on their home planet of Rattatak, which involved extensive gladiatorial combat. Warrior Aidus and criminal Kaliyo Djannis were both Rattataki. The Nightsister and Dark Acolyte named Asajj Ventress was generally thought to be a Rattataki, while in fact she was a similar Zabrak-Human hybrid species called Dathomirian."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Rattataki were commonly thought to be descendants of a long-lost Republic expedition. While most other inhabitants of Rattatak came from the Unknown Regions, there were a significant number of off-worlder mercenaries who would come to Rattatak from time to time, likely to view or participate in gladiatorial combat, only to be stranded there permanently. The remarkably harsh conditions on the planet nearly drove its population to extinction. For eons, the Rattataki constantly battled amongst themselves and their fellow inhabitants (represented primarily by Humans, Zabraks,. Siniteens, Vollick, and Weequay) over the planet's limited resources. Despite being nearly completely isolated from the outside galaxy, the Rattataki displayed remarkable initiative and continually created new ways to kill each other."}, {"tag": "p", "text": "Shortly after the Great Galactic War broke out, Sith Lord Darth Vich, upon noting the relatively-unknown Rattataki's considerable combat prowess and affinity for battle, captured hundreds of tribes of native Rattataki to forge them into his own personal army. Vich soon recognized that a number of these Rattataki showed sensitivity to the Force, and seeing the potential in this, trained many of these as Sith Acolytes who would answer to him personally. Unsurprisingly, the Rattataki's natural abilities in battle were quickly manifest, and Vich's Army became a force to be reckoned with. This new-found power caused Darth Vich, who was eager for more sway in the Empire, to grow increasingly ambitious. This ultimately resulted in a failed power-grab known as Darth Vich's insurrection, after which most of his Rattataki forces were killed outright or enslaved. However, rumors persisted during the post war period that a small number of Vich's acolytes had defected during the failed insurrection, later being taken in by the Sith for full training."}, {"tag": "p", "text": "When many Rattataki warlords including the Siniteen criminal Hal'Sted had gathered an army in the southern hemisphere to challenge Osika Kirske, a powerful Vollick warlord had them killed so they could never be a threat to him. Only one child, who was looked after by Hal'Sted, named Asajj Ventress, escaped."}, {"tag": "p", "text": "Rattataki had no major contact with the Republic until a Jedi Knight, Ky Narec, crash-landed. The Jedi soon found the young Dathomirian Ventress, who had been living among the Rattataki, discovering her incredible potential to the Force. Together, they united armies and brought peace to the planet, until Kirske and some other warlords of the planet united to slay them, leading to the death of Narec, and causing Ventress to capture or kill their foes in a rage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rattataki is a playable species for players who choose the Bounty Hunter, Imperial Agent and Sith Inquisitor classes in Star Wars: The Old Republic.\nAsajj Ventress was formerly Rattataki preceding a retcon in The Clone Wars that altered her birthplace to Dathomir and her species Dathomirian. Leland Chee speculates that she may have shaved her head to better blend in on her adopted homeworld."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}