{"url": "Ratts_Tyerell/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Aleena", "Category:Males", "Category:Podracers"], "nodes": [{"tag": "h1", "text": "Ratts Tyerell"}, {"tag": "p", "text": "Ratts Tyerell was a male Aleena Podracer who participated in the Boonta Eve Classic on Tatooine in 32 BBY. Born on the planet Aleen Minor, Tyerell had incredible reflexes, which made him an adept Podracer. For several years, he built up his reputation and became well-liked by the other regular racers. He was furious at the way fellow racer Sebulba found his success through cheating and vowed to kill the Dug racer. However, Tyerell perished in the Boonta Eve Classic—his engines were too large for the tight confines of the Laguna Caves, causing him to crash. His son went on to found the Ratts Tyerell Foundation, which attempted to outlaw the sport of Podracing."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Life as a podracer"}, {"tag": "p", "text": "Ratts Tyerell was a male Aleena born on his species' homeworld of Aleen Minor sometime during the waning days of the Galactic Republic. Tyerell grew up in a harsh environment, causing him to push his reflexes to the limit—as a youth, he was frequently chased by the vicious creatures of his homeworld. As a result of this difficult life, Aleena had extremely quick reflexes as a species, which led many of them to success on the Podracing circuits. Tyerell, too, showed a natural aptitude for Podracing, and before long, he became a regular racer on the worlds where the sport was held."}, {"tag": "p", "text": "Tyerell eventually acquired a large podracer from the Important Merchant to make up for his lack of height. Named after the scatalpen, a deadly predator native to Tyerell's homeworld, the Titan 1250 Scatalpen was very fast, though its acceleration and maneuverability were not as advanced. Still, it served the Aleena racer well, and for several years, he slowly built up his reputation, becoming the track favorite at Howler Gorge and earning the respect and friendship of his fellow racers. Tyerell was a gentleman on the track, though off of it he was thought by many to be very boastful and even a bully. Some time during his career, he found a mate, and together they had several children, including Deland and Djulla Tyerell."}, {"tag": "p", "text": "Tyerell was also fond of a game called Ratts Race and often played it with spacers. The Aleena was also against any form of cheating at races, and was sickened at how Sebulba, one of the most successful podracers of the period, had achieved his success. Tyerell sought to kill Sebulba, although he was not the only racer who wanted to be rid of the Dug. Still, he never conspired with the others, preferring to keep his \"gentleman\" reputation intact. Instead, he had an outlaw tech specialist fit the Scatalpen with illegal weaponry, hoping to ambush Sebulba during 32 BBY's Boonta Eve Classic on Tatooine, and to win the race for himself."}, {"tag": "h3", "text": "Boonta Eve Classic"}, {"tag": "p", "text": "The Boonta Eve Classic was one of the most prestigious annual podraces in the galaxy; it attracted huge crowds at the Mos Espa Grand Arena on Tatooine. The race was always the subject of much gambling and cheating, and nearly all of the other racers were involved in plots with each other, hoping to snatch first place. Tyerell had plans to ridding himself of Sebulba, but he worked toward this goal alone. He lined up in his podracer in the first row of the starting grid, alongside fellow racers Aldar Beedo, Mawhonic, and his target, Sebulba. The race also saw the inclusion of Anakin Skywalker, a young slave who had entered the Boonta Eve Classic despite mass ridicule directed at him by the other players."}, {"tag": "p", "text": "Tyerell's wife had recently given birth to another child, named Doby Tyerell, but attended the race anyway along with her three other younglings. Tyerell did manage to complete one lap, though he had not yet been presented with an opportunity to take out Sebulba, who was far ahead. The Aleena's race, however, was cut short on his second lap, in the Laguna Caves—a tight cavern full of massive stalactites. Worried that young Anakin Skywalker would overtake him, Tyerell lost concentration as he passed through the cave; meanwhile, his accelerator jammed and he was unable to gain clearance past the rocky stalactites. Tyerell's vehicle collided with a large rock and he died in the explosion that ensued. Even if he had survived the explosion, he had no chance of expecting help from anyone, as the Laguna Caves were rumored to contain a Krayt dragon."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Tyerell's family was devastated after his death, though it marked only the beginning of troubles to follow. Ratts Tyerell's own brother sold his daughter, Djulla, as a slave to Sebulba. His son, Deland—under the nickname \"Pabs\"—intended to race Sebulba for his sister's freedom on the planet Euceron. However, Sebulba was not the one racing; rather, it was the Dug's son Hekula. Meanwhile, Sebulba sabotaged the young Aleena, ruining his chances of winning. Anakin Skywalker, who had won the Boonta Eve Classic wherein Tyerell perished, had since become a Jedi, and was on the planet to act as a peacekeeper. Unable to resist the temptation of podracing, he raced against Hekula. Skywalker raced in Deland's place and beat Hekula, winning Djulla's freedom."}, {"tag": "p", "text": "Ratts Tyerell's death ultimately had a large effect on the sport of podracing. Moved by his father's death, Deland Tyerell eventually established the Ratts Tyerell Foundation, which was an organization devoted to making Podracing a safer sport in order to preserve the lives of those pilots who had wives and children. They campaigned for the sport to be outlawed all over the galaxy and were successful on many worlds, though several famous podracers spoke out against it, claiming it was an effort by the Republic to crack down on non-Human activities. The Republic denied this, and Sate Pestage, advisor to the Supreme Chancellor, made a statement declaring that it was nonsense."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ratts Tyerell was of small stature compared to Humans, standing just under eighty centimeters tall—although he was not small for an Aleena. Tyerell had blue skin, with patches of yellow on his jaw and underarms, and a huge mouth which could open extremely wide."}, {"tag": "p", "text": "Most beings thought that Tyerell was overconfident and felt he was a bully, though he was one of the most well respected podracers of his time. Anakin Skywalker, who raced against the Aleena in the Boonta Eva Classic of 32 BBY, thought very highly of Ratts Tyerell, describing him as one of the fastest podracers who competed at Mos Espa that day. Tyerell preferred to race with honor, and loathed those who resorted to cheating in order to gain standing. However, Tyerell felt it was justified to commit crimes on the track himself if they were for the good—he decided to attempt to take out Sebulba himself in order to rid the sport of the cheating Dug."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The early evolution of Ratts Tyerell can be traced via labels and dates on concept art. In his earliest published incarnation, dated July 16 1996, he was labeled simply as \"Pod Racer - Long Head.\" By September 17 of that year, he was known as \"Amphibian,\" although his art still had no proper name. Sketches dated May 27, 1997 finally bore the name \"Ratts Tyerell.\""}, {"tag": "p", "text": "Content from the Attack of the Clones Scrapbook was going to establish him as having no relation to Senator Bogg Tyrell. However, the content was cut, and is this not confirmed canon."}, {"tag": "p", "text": "Tyerell's voice in Star Wars Episode I: Racer was provided by Terence McGovern."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}