{"url": "Ration_bar", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Rations"], "nodes": [{"tag": "h1", "text": "Ration bar"}, {"tag": "p", "text": "Ration bars were a type of food ration known by various names, including nutrient bars, protein bars, and supply bars; they were also known as sticks instead of bars. They were eaten in multiple eras of galactic history."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ration bars, a type of food ration, came in multiple forms, textures, and flavors with the common purpose of feeding beings quickly. They could be a bar or stick that was chewy or easily crumbled, and their various flavors could be disgusting, not very tasty, or very pleasing."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to and during the Clone Wars (22 BBY–19 BBY), ration bars were a meal replacement for civilians and a military field ration for clone troopers in the Grand Army of the Republic. Sabé, a former handmaiden and queen's decoy for Queen Padmé Amidala, ate a ration bar that \"wasn't very tasty\" when she was too hungry and jittery to wait for \"real food\" after doubling as Senator Amidala at Mon Mothma's gala. Amidala and Senator Rush Clovis brought ration bars and medical supplies for the relief effort on Bromlarch when their aqueduct system failed, causing widespread drought and famine. On Maridun, young Togruta and Jedi Padawan Ahsoka Tano ate a ration bar while discussing the situation in the Lurmen village with Captain Rex, Commander Bly, Jedi Master Aayla Secura, and Tano's master, Jedi Knight Anakin Skywalker. While serving in the Battle of Ryloth, Waxer and Boil met an orphaned Twi'lek girl named Numa as they scouted the city of Nabat. They gave her a ration bar to eat, and she quickly bonded with them. On Cato Neimoidia as Amidala investigated the Separatist leanings of her old friend Clovis, Skywalker declined a ration bar that R2-D2 offered him, saying that he was not hungry and he was awaiting Amidala's signal to join the investigation."}, {"tag": "p", "text": "Near the end of the war, Amidala brought meal bars with her on a mission to Batuu, and she had to restrict herself to one per day to stretch her supply. When Anakin Skywalker was questioning the imprisoned Silman on Oba Diah, Silman asked if Skywalker had any food. Skywalker removed a cylindrical supply bar from his belt and gave it to Silman, then the much-addled Silman said he wanted it to serve to his \"babies.\""}, {"tag": "p", "text": "In 5 BBY at the Academy for Young Imperials  on Lothal, the Empire provided cadets with ration bars as a meal option in the academy mess hall. Young human male Zare Leonis suggested these to Jai Kell when their meal was interrupted by a summons for an assessment in the Well."}, {"tag": "p", "text": "During the Coyerti campaign in 3 BBY, Hazram Namir, a male human, served with a male Besalisk named Gadren and a female human called Roach. Roach and Gadren had sorted various ration packs according to their labeled flavors and by their actual flavors learned through experience. They gave Namir a nutrient bar to eat that, according to him, tasted like \"chemically infused mucilage.\""}, {"tag": "p", "text": "In 3 ABY, Luke Skywalker temporarily separated from the Rebel Alliance after the Battle of Hoth to search for Jedi Master Yoda on Dagobah. Skywalker brought boxes of rations with him, including dehydrated bars. As he settled down to eat, Yoda approached him, rummaged through Skywalker's rations, and sampled them as he tested Luke's frustration and impatience. Yoda spat out a bite and questioned how eating such food could promote Skywalker's growth."}, {"tag": "p", "text": "While on Endor in 4 ABY, Leia Organa befriended the young Ewok Wicket Wystri Warrick by offering him one of her rations to eat. After the Battle of Endor, Organa sent General Han Solo and his Wookiee friend Chewbacca to get boxes of ration sticks from General Hera Syndulla so the Ewoks would not cook and eat the captive Imperial stormtroopers. While Solo and Syndulla negotiated, Chewbacca helped himself to a ration stick, then they delivered the crates to the Ewoks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ration bars first appeared in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back, when Luke Skywalker met Yoda on Dagobah. They also appeared in several episodes of Star Wars: The Clone Wars. In the Legends continuity, the name used for ration bars varied. They were reintroduced to the new canon and given their frequent canon name in Servants of the Empire series, written by Jason Fry, but their name has continued to vary."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}