{"url": "Ration_pack", "categories": ["Category:Canon articles", "Category:Food and beverage stubs", "Category:Incomplete lists", "Category:Rations"], "nodes": [{"tag": "h1", "text": "Ration pack"}, {"tag": "p", "text": "Ration packs contained food or nutrients to consume when other sources were scarce. They were known by many names, including rations boxes, food packets, food rations, field rations, survival rations, or simply rations."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ration packs contained food or nutrients to consume when other sources were scarce, or there was little time available to prepare food or eat it. Some of the items that could be included in ration packs were ration bars, protein cubes, ration cubes, or nutrient paste. Other rations were identifiable foods such as joppa stew and nuna jerky."}, {"tag": "p", "text": "The Galactic Empire regarded its field rations as nontransferrable Imperial property; transferring any to a civilian was a violation of Code E-9-73A. One type of ration pack used by the Galactic Empire, Rebel Alliance, and New Republic contained dehydrated substances that quickly expanded and became edible when activated with water. On Jakku, the junk boss Unkar Plutt referred to the packet combination of dehydrated veg-meat and polystarch as \"meat and bread,\" though it was doubtful that the rations tasted like either. In her survival guide, the scavenger named Rey observed that Imperial rations were less perishable than those of the New Republic, but the latter tended to taste better."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While in hiding from the Great Jedi Purge in 18 BBY, Ahsoka Tano briefly settled on a farming moon in the Outer Rim called Raada. She initially kept a low profile by trading her repair services for food rations, but she observed the Empire's growing power. The Empire exploited Raada to grow plants that would be processed into nutritional supplements for Imperial personnel working in low gravity environments. These plants destroyed the farmland that had once fed Raada's population. Ahsoka advised her friends to stockpile ration packs and other supplies in a safe place, and she assisted in those efforts. The Empire's destruction of the soil, work requirements, and food restrictions pushed Raada's citizens into an uprising."}, {"tag": "p", "text": "In 4 BBY during the Galactic Civil War, the Empire doubled work quotas and cut food rations on the planet Ibaar, creating a famine. Led by Imperial Security Bureau Agent Kallus, an Imperial fleet blockaded the planet to prevent aid from reaching the starving population. After failed attempts, Captain Hera Syndulla succeeded in breaking the blockade with the Blade Wing prototype B-wing starfighter, and cleared the way for the Spectres to airdrop food supplies from the Ghost."}, {"tag": "p", "text": "In 3 ABY, Luke Skywalker temporarily separated from the Rebel Alliance after the Battle of Hoth to search for the Jedi Master Yoda on Dagobah. Skywalker brought boxes of rations with him, and as he settled down to eat, Yoda approached him. Yoda rummaged through Skywalker's rations and sampled them as he tested Luke's frustration and impatience."}, {"tag": "p", "text": "Following the Battle of Jakku in 5 ABY, the planet's surface was littered with a graveyard of wrecked starships from both the Galactic Empire and the New Republic. The scattered supplies from both sides of the conflict included ration packs which were divided into portions by Unkar Plutt, who used them to control the local food supply. At Plutt's Concession Stand in Niima Outpost, portions were traded for spare parts salvaged by scavengers, such as Rey."}, {"tag": "p", "text": "In 34 ABY, Rey consumed veg-meat and polystarch portion bread for dinner before she met BB-8, a droid that she rescued in the desert. When BB-8 accompanied her to the trading post, Plutt offered to give Rey sixty portions in exchange for the droid. Though initially tempted by Plutt's offer, Rey declined it and took only what she was owed for the salvage that she brought to the outpost."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although not named at the time, rations first appeared in the 1980 film Star Wars: Episode V The Empire Strikes Back as a box containing foods that Luke Skywalker began to eat before Yoda helped himself to a taste. The 2015 canon junior novelization The Empire Strikes Back: So You Want to Be a Jedi? identified Luke's supplies as a rations box. The paperback novel Star Wars: The Empire Strikes Back, a 2017 update of the Star Wars Legends junior novelization, similarly referred to this as a box of food rations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}