{"url": "Ratamesh", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Farstey sector astronomical objects", "Category:Terrestrial astronomical objects"], "nodes": [{"tag": "h1", "text": "Ratamesh"}, {"tag": "p", "text": "Ratamesh was a terrestrial astronomical object located in the Ratamesh system, a part of the Farstey sector in the Trans-Hydian portion of the Expansion Region. It was the site of the Thisspias alcazar, a structure which shared its name with the Farstey sector planet Thisspias."}, {"tag": "p", "text": "In 186 BBY, the reigning Blood Monarch of Thisspias, the sister of the Thisspiasian Jedi Oppo Rancisis, was present at the Thisspias alcazar on Ratamesh. That year, agitators stormed the alcazar and killed the Blood Monarch. As a result, the throne of Thisspias was inherited by Rancisis, although he abdicated in favor of continuing his Jedi training."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ratamesh was introduced in the reference book The New Essential Guide to Characters, written by Daniel Wallace and published on April 23, 2002. The 2009 reference book The Essential Atlas placed the Ratamesh system, and therefore Ratamesh itself, in grid square O-8."}, {"tag": "p", "text": "In The New Essential Guide to Characters, the preposition \"in\" is used in conjunction with the proper name \"Ratamesh\" when providing context for the Thisspias alcazar, suggesting that they were both locations on Thisspias. In the Power of the Jedi Sourcebook, a Wizards of the Coast roleplaying game sourcebook published in August 2002 for use with the Star Wars Roleplaying Game, most of the wording regarding Ratamesh from The New Essential Guide to Characters is kept, except the preposition \"on\" is used, suggesting instead that it was an astronomical object separate from Thisspias. This article assumes the latter source is correct."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}