{"url": "Rawk_V99_blaster", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Blaster weaponry"], "nodes": [{"tag": "h1", "text": "Rawk V99 blaster"}, {"tag": "p", "text": "The Rawk V99 blaster was a type of blaster created by the mechanic \"Bantha\" Rawk, whose reputation caused the weapon to be considered of worth. In 138 ABY, during the Second Galactic Civil War, Rawk's nephew Cade Skywalker was in possession of fifty cases of Rawk V99 blasters. When he traveled to the planet Utapau to assassinate the Sith scientist Vul Isen—who was in turn trying to kill Galactic Alliance Remnant Admiral Gar Stazi—Skywalker's crew met with Stazi and offered to sell him the blasters. While Skywalker hunted Isen, his crew negotiated prices with Stazi and simultaneously kept an eye out for potential assassins targeting the Admiral."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Rawk V99 blaster was a type of blaster weapon. It was designed by \"Bantha\" Rawk, a mechanic who ran a business creating and modifying weapons for those in need of reliable armament. Rawk's favorable reputation preceded the weapon when it was for sale, and its price was negotiable when being traded on the black market."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Cade Skywalker, a bounty hunter and the nephew of Rawk, possessed fifty cases of Rawk V99 blasters aboard his starship, the Mynock, during the Second Imperial Civil War in 138 ABY. In that year, he took the Mynock to the planet Utapau in order to assassinate the Sith scientist Vul Isen, who intended to poison the world's waters in retaliation for Utapau's harboring of Galactic Alliance Remnant Admiral Gar Stazi, an enemy of the Sith. When the Mynock made planetfall and was welcomed by Alliance representatives, the ship's co-pilot Jariah Syn, mechanic Deliah Blue, and astromech droid R2-D2 informed Alliance Lieutenant Ona Antilles that they were interested in selling or trading their Rawk V99 blasters to Stazi. Although Antilles wished to speak to Skywalker himself, the crew's distraction allowed Skywalker and the Jedi Master Wolf Sazen to slip away and hunt for Isen."}, {"tag": "p", "text": "A holographic symbol of Rawk's logo displayed by R2-D2 convinced Antilles of the weapons' legitimacy and worth, and she spoke with the three crewmembers until Skywalker contacted Syn and informed him that Isen had sent an assassin after Stazi. At that point, Syn demanded that the Mynock's crew be able to negotiate the blasters' prices with the Admiral himself. Antilles acquiesced, and, in Stazi's company, Syn surveyed the Admiral's entourage for would-be-traitors while Blue and R2-D2 bought Syn time by dragging out the bargaining. After Syn caught and killed the assassin and Skywalker elsewhere slew Isen, Blue and Stazi continued to haggle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rawk V99 blaster is mentioned in the forty-ninth issue of the comic series Star Wars: Legacy, in which negotiations over its black market price occur. The negotiations continue into the following issue. Both issues were written by John Ostrander, penciled by Jan Duursema, and released in 2010."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}