{"url": "Raxus_Secundus", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Raxus Secundus locations", "Category:Separatist holdouts planets", "Category:Terrestrial planets", "Category:Tion Hegemony planets"], "nodes": [{"tag": "h1", "text": "Raxus Secundus"}, {"tag": "p", "text": "Raxus Secundus, also known simply as Raxus, was a lush world in the Outer Rim Territories' Tion Hegemony that served as the capital planet of the Confederacy of Independent Systems during the Clone Wars. Renowned for its beauty, Raxus had a temperate climate and was covered with oceans and landmasses. Since the Separatist Senate was headquartered within its capital city of Raxulon, Raxus became home to a number of Confederate senators, including Mina Bonteri of Onderon. Other major Raxian cities included Tamwith Bay, which was located a considerable distance from Raxulon."}, {"tag": "p", "text": "Raxus was a contested world throughout the Clone Wars, and its strategic importance led the Confederacy navy to blockade it to oversee security for incoming travelers. Nevertheless, Republic Senator Padmé Amidala and Jedi Padawan Ahsoka Tano, seeking to meet with Bonteri, were able to smuggle themselves onto Raxus aboard a transport from Mandalore. Count Dooku, the leader of the Confederacy, visited Raxus for various events, and it was during one such award ceremony that Jedi Master Quinlan Vos and bounty hunter Asajj Ventress launched a failed attempt to assassinate him."}, {"tag": "p", "text": "After the war, Raxus found itself in the crosshairs of the Republic's successor, the Galactic Empire, which committed the Antar Atrocity to pressure Raxus and other worlds into surrendering all former Separatists to Imperial custody. Raxus Senator Avi Singh, who refused to voice support of the Imperial occupation, was arrested and later extracted by the Bad Batch."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Raxus was situated in the Raxus system, a star system in the Outer Rim sector of space that was known as the Tion Hegemony. A verdant terrestrial world that orbited a sun, Raxus supported a temperate climate and an atmosphere that was breathable to a number of humanoid species. Its climate was comfortable despite a challenging ecosystem and dangerous predators. Its surface was covered by vast oceans and landmasses, which themselves were enveloped by forests, plains, and hills."}, {"tag": "p", "text": "Raxus's lushness led it to become known for its beauty. By the time of the Clone Wars, some areas on the world were heavily developed, such as the urban sprawl of its capital city, Raxulon, while regions that were farther from the city center remained more rural."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Capital of the Confederacy"}, {"tag": "p", "text": "Two years prior to the outbreak of the Clone Wars, Raxus and its system attained galactic prominence when Count Dooku, a former Jedi Master who had mostly receded from the galactic spotlight, returned to the public eye by commandeering a HoloNet station in the system. Delivering a fiery rhetoric, he condemned the rampant corruption within the Galactic Republic and established a separatist state known as the Confederacy of Independent Systems, effectively sparking a Separatist Crisis that led a host of worlds, including Raxus, to flock to his new government."}, {"tag": "p", "text": "At the start of the Clone Wars, the Confederacy vacated its first capital, Geonosis, and selected Raxus as its capital world. Raxus's capital city, Raxulon, thus became the headquarters of the Separatist Senate, a civilian legislature comprised of delegates from the Confederacy's member worlds. A number of Confederate senators, including Mina Bonteri of Onderon, had spoken for their planets in the Republic Senate and took up residence on Raxus to attend Senate sessions in Raxulon's Separatist Senate Building. Though Dooku mostly remained off-world to direct the Confederacy's war effort, he presided over Senate sessions via hologram and returned to Raxus for important events."}, {"tag": "p", "text": "Due to its strategic importance, a sizable armada of warships from the Confederacy navy blockaded Raxus for most of the war, restricting incoming access based on a system of clearance codes. At one point, the blockade included a Providence-class Dreadnought, a Recusant-class Commerce Guild destroyer, three Munificent-class star frigates, and a trio of Droid Control Ships."}, {"tag": "h3", "text": "Republic–Confederate peace talks"}, {"tag": "p", "text": "At least a year into the war, Republic Senator Padmé Amidala journeyed to Raxus with Jedi Padawan Ahsoka Tano to meet with Bonteri, who had mentored Amidala in the realm of politics, in the hopes of bringing about a peaceful end to the conflict. Circumventing the Republic Senate's law against communication with the Separatists, Amidala and Tano reached Raxus aboard a transport from Mandalore. Once they had arrived at a spaceport in Raxulon, Bonteri helped them evade the spaceport's B1-series battle droid security and brought them to her palatial estate, located away from the city center. After agreeing with Amidala on the necessity of restoring diplomatic channels between the Republic and the Confederacy, Bonteri invited Amidala and Tano to a following Senate session in Raxulon, where Bonteri convinced her fellow delegates to open negotiations with the Republic's Supreme Chancellor, Sheev Palpatine. Their objective completed, Amidala and Tano set off to return to the Republic capital of Coruscant, and Bonteri and her son, Lux, saw them off from the Raxulon spaceport. However, Dooku thwarted Bonteri's peace initiative by having General Grievous execute a bombing on Coruscant, ensuring that the Republic Senate rejected the offer for negotiations, and the Sith Lord thereafter had Bonteri murdered."}, {"tag": "p", "text": "Toward the end of the conflict's third year, the Confederacy selected Dooku as the recipient of the Raxian Humanitarian Award and subsequently organized a high-class gala on Raxus in his honor. By that time, the Jedi High Council had targeted Dooku for assassination and had assigned the task to Jedi Master Quinlan Vos, who—on the Council's orders—enlisted the aid of Dooku's jilted apprentice–turned–bounty hunter, Asajj Ventress, for his mission. Upon learning of the award ceremony from the informant Sumdin, Ventress voyaged to Raxus with Vos aboard her starship, the Banshee, to fulfill their objective. After bypassing the Confederacy's orbital blockade and purchasing proper attire in the Raxian city of Tamwith Bay, Ventress and Vos proceeded to Raxulon and, using passes that Sumdin had provided, infiltrated the plaza square that was hosting the gathering. They waited until after Dooku had given his acceptance speech for the award to engage the count in a vicious lightsaber duel. Yet, thanks in part to support from General Grievous, Dooku defeated his assailants, capturing Vos and forcing Ventress to flee from Raxus."}, {"tag": "h3", "text": "Imperial target"}, {"tag": "p", "text": "After over three years of open hostilities, the Clone Wars came to an end. The successive deaths of Dooku and Grievous, coupled with the execution of the Separatist Council and the deactivation of the Separatist Droid Army, cemented the Confederacy's defeat. The Republic, meanwhile, was reshaped into the first Galactic Empire under the newly christened Emperor Palpatine."}, {"tag": "p", "text": "Raxus, which still housed a host of ex-Separatists, thus became a target of the fledgling Empire, as did other former Confederate worlds like Kooriva and Murkhana. Such was the case that a year into the Empire's reign, Moff Wilhuff Tarkin was dispatched to make an example of Antar 4, a moon that had been allied to the Confederacy for the duration of the Clone Wars. Adhering to his orders, Tarkin made no effort to differentiate Antar 4's Separatists from Imperial-loyal intelligence agents and resistance fighters who were awaiting exfiltration. His forces subjugated the moon, subjecting its entire populace to swaths of arrests and massacres. The Antar Atrocity, as the media termed the event, served to compel Raxus and other worlds to surrender all former Separatists to Imperial custody, or else suffer a similar demise to that of Antar 4."}, {"tag": "p", "text": "Over the next four years, the Empire acquired possession of the discarded materiel on Raxus, along with similar caches that had been found on an array of other contested worlds, including Utapau. Imperial Intelligence consequently compiled an inventory of all the items obtained from the stockpiles. By 3 BBY, Raxus had fallen into a major debt to the Empire; with no other way to pay the amount it owed, Raxus became one of many planets to surrender its remaining autonomy to the Imperial state, firmly placing it under the Empire's control."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "As the capital world of the Confederacy, Raxus hosted a range of species, among them, including humans, Gossams,  Siniteen, Rodians, Gotals, Twi'leks, and Pantorans. The planet was also home to an array of Separatist senators, including Mina Bonteri of Onderon, who moved there with her family in order to represent Onderon in the Separatist Senate. Numerous travelers of various backgrounds visited Raxus, though they had to provide the appropriate clearance code in order for the Confederate orbital blockade to grant them access to the world. Security patrols of battle droids required further identification from visitors once they arrived at one of the spaceports on the surface."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Raxulon"}, {"tag": "p", "text": "Regarded for its beauty, Raxulon served as the capital city of Raxus. Located on one of the world's landmasses, Raxulon was built around a city center whose tall buildings dwarfed the surrounding urban sprawl. One of the central structures was the Separatist Senate Building, which was situated at the edge of a circular courtyard amidst the spires of neighboring establishments. A network of streets branched out from the city center, and some of them terminated at the outskirts of the city, which remained less developed with their hills, plains, and forests. The Bonteri family estate was situated away from the city center amidst the surrounding hills."}, {"tag": "p", "text": "Local air traffic within Raxulon was busy but not overly congested, with numerous airspeeders, shuttles, and transports traveling cross-city on a daily basis. As far as spaceports, Raxulon boasted a main port in addition to an array of local landing platforms that were not used as frequently, though the local docks were serviced by droids that supplied fuel, cleaning, and other amenities to incoming starships. Asajj Ventress and Quinlan Vos used one such landing pad when they landed in Raxulon aboard the Banshee. The spaceport where Padmé Amidala and Ahsoka Tano arrived aboard a Gozanti-class cruiser was protected by security squads of B1 battle droids that requested arriving travelers to provide proper identification."}, {"tag": "h3", "text": "Tamwith Bay"}, {"tag": "p", "text": "One of Raxus's major cities, Tamwith Bay was located a fair distance away from Raxulon and had less security than the capital. Among the establishments within Tamwith Bay was a clothing store that featured upscale attire. Ventress and Vos visited the store to acquire suitable outfits for the expensive Raxian Humanitarian Award ceremony in Raxulon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Raxus was created for the Star Wars: The Clone Wars television series and debuted in the third season episode \"Heroes on Both Sides,\" which aired on November 19, 2010. The world drew its name from Raxus Prime, a junk world that was featured in various Star Wars Legends projects such as the LucasArts video games The Clone Wars (2002) and The Force Unleashed (2008). The episode's guide stated that the relationship between Raxus and Raxus Prime had yet to be defined, though they were undeniably intended to be different worlds based on their distinct compositions."}, {"tag": "p", "text": "In the new Star Wars canon, the name \"Raxus Secundus\" was given in the eleventh issue of the Star Wars Helmet Collection magazine, published in 2016. Within the Legends continuity, Jason Fry's 2014 The Clone Wars: Episode Guide originated the name \"Raxus Secundus\" to further distinguish the world from Raxus Prime."}, {"tag": "p", "text": "In July 2015, Raxus was featured in author Christie Golden's canon novel Dark Disciple, which was adapted from an eight-episode story arc that was developed for the Star Wars: The Clone Wars television series. The episodes were not completed on account of the series' cancellation in March 2013, though the story arc's first four episodes reached the animatic stage of production. Prior to the novel's release, StarWars.com published concept art for a Raxus landing platform that had been designed for the original episodes. The novel identified the planet's capital city as Raxulon, which had appeared in \"Heroes on Both Sides\" but went unnamed."}, {"tag": "p", "text": "An image depicting Raxus Prime was used to depict Raxus in Star Wars: Galactic Atlas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}