{"url": "Rawmat_shortage_of_1%E2%80%932_ABY", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Economic crises", "Category:Events of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Rawmat shortage of 1–2 ABY"}, {"tag": "p", "text": "The rawmat shortage of 1–2 ABY was a galaxy-wide scarcity of raw materials (or \"rawmats\") vital in capital ship construction, which was particularly acute in the Core Worlds and Mid Rim. The material hit hardest was doonium, the white-gray metal used for hull plating that gave many capital ships their characteristic coloration, but other materials, such as hybrid plexisteel, also became scarce. The shortage was a result of increased demand from the Imperial government, Rebel attacks on production centers, and a pre-existing downward trend in Mid Rim production capability."}, {"tag": "p", "text": "The shortage lasted for nearly a year, and led to a recession in the Core Worlds. This recession resulted in political ramifications for worlds in the Core, such as on Esseles, where the Forad Party lost its grip on the Esselian Hall for the first time in a decade. The shortage also lead to smuggling, including a major operation discovered by Imperial Customs on Brentaal. Furthermore, the shortage resulted in creative use of alternate materials for warship construction, most notably the armoring of one hundred Victory-class Star Destroyers with red havod-alloy plates."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "The raw materials shortage had its origins in several areas. The Mid Rim of the galaxy was a region that was more impoverished than locations further coreward, lacking much in the way of natural resources or dense populations. For decades prior to the Battle of Yavin, the Mid Rim had seen a gradual slide in its raw materials productivity."}, {"tag": "p", "text": "Meanwhile, as the Galactic Civil War heated up, the Galactic Empire greatly expanded its military. The Empire facilitated this by eliminating legal roadblocks to the build-up, employing slave labor, and strip-mining entire worlds for resources to use in its militarization. By 1 ABY, Imperial orders for raw materials had begun to significantly impinge on orders from the private sector."}, {"tag": "p", "text": "Finally, following the destruction of the first Death Star, the Alliance to Restore the Republic's propaganda network found purchase in locations it never had before; even the most remote settlement had soon learned of the Empire's defeat. This greatly accelerated the Alliance's efforts to foment armed resistance, with entire worlds openly defying the Empire. The Rebellion now had the wherewithal to conduct numerous waves of quick, surgically-precise hit-and-fade attacks against Imperial forces. Among the Rebels' targets were key raw materials production sites."}, {"tag": "h3", "text": "The \"rawmat\" shortage"}, {"tag": "p", "text": "In 1 ABY, these factors came to a head in a critical shortage of raw materials, a shortage especially pronounced in the Core Worlds and Mid Rim. The metal doonium, a white-gray metal used to plate the hulls of capital ships, such as Star Destroyers, became particularly scarce. Other strategic materials, however, such as hybrid plexisteel were also in short supply."}, {"tag": "h4", "text": "Cynabar's scoop"}, {"tag": "p", "text": "One of the first news outlets to pick up on the shortage of raw materials—colloquially known as rawmat—was Cynabar's InfoNet. On 36:6:26 GrS, their article \"Mid-Rim Experiencing RawMat Shortage\" reported that industry experts in their circle of informants believed that these raw materials were becoming scarce, and that, in particular, raw materials purchasers were acquiring every shipment of doonium possible. Cynabar's experts cited the increase in Imperial demand, the crippling of production facilities by Rebel partisans, and the long-term downward trend in Mid Rim production for the scarcity. Cynabar's InfoNet learned that, while a majority of Imperial rawmat transports were normal charters bound for well-known shipyards such as Kuat and Tallaan, a significant number were military vessels under the aegis of the Imperial Energy Systems subministry. These ships were traveling to undisclosed locations, which the article speculated might be located in the Core. The report concluded with an advisory to free-traders with access to scarce raw materials to stockpile them, as the NewsNet anticipated them selling for double the price within the following fiscal quarter."}, {"tag": "p", "text": "Less than a month after the publication of \"Mid-Rim Experiencing RawMat Shortage,\" the Empire began a heated search for the creators of Cynabar's InfoNet on Nar Shaddaa."}, {"tag": "h4", "text": "Core Worlds recession and political ramifications"}, {"tag": "p", "text": "The shortage of raw materials led to skyrocketing prices for manufactured goods within the Core Worlds and Mid Rim. Four months after news of the shortage first broke, it was having a significant effect on the economy of the Core Worlds, leading them into a recession. The stumbling economy led to political repercussions on planets such as Esseles. Esseles had long had a political sphere dominated by its President, former Clone Wars hero Cambira Ralle, and his Forad Party. However, as the planetary economy faltered with the rest of the Core, the Esselian New Order Party's leader, Jamson Freller, capitalized on the fact. He attacked Ralle's policy of allowing non-Humans to be employed in strategic manufacturing jobs on the world. This attack made substantial inroads against the Forad Party's coalition government with the Cardean Party, as well as against Forad itself. In the Esselian Hall election held during the New Year Fete Week of 2 ABY, Forad lost its holding of the majority of the Esselian Hall for the first time in two decades, with Freller's ENO party making substantial gains, allowing him to call for a new Presidential election. Within a month, terrorist attacks by the anti-Imperial group known as the Faceless at Grande Hyet and Tralee had further stirred up the political situation on Esseles, leading to a strike by the Guild of Offworld Skilled Laborers and an exodus of aliens from the world."}, {"tag": "h4", "text": "Smuggling"}, {"tag": "p", "text": "By the second month of the year, the Outer Rim Territories itself was experiencing a shortage of raw materials great enough that, when a rawmat smuggling operation on Brentaal was uncovered by Imperial Customs, the lead investigating officer's first suspicion was that the materials were headed for secondary sources in that region. Customs raided an uninhabited warehouse in the Votrad sector of Brentaal's starport, locating thousands of tons of missing raw materials. Back-tracing the registry and lot numbers on the goods led investigators to misdirected shipments from mining and corporate transport vessels, which the traffickers rerouted into the warehouse by slicing into corporate and Customs computer systems."}, {"tag": "h4", "text": "Red ships"}, {"tag": "p", "text": "Meanwhile, the shortage had impacted military production, as well. At Kuat Drive Yards in the Kuat system, one hundred venerable Victory-class Star Destroyers, which had entered the yards in 0 BBY and had been due to be completed at the end of 1 ABY, sat unfinished. The doonium hull plates which had been allocated for these ships were redirected to more modern Star Destroyers in other parts of the shipyard, and the Victory-class ships idled for nearly five months awaiting new plating, despite already having fully refurbished engines, weapons, shields, and hangars. Rather than allow these ships to remain unusable in dock, Imperial Admiral Kendel ordered havod metal alloy plates for these ships in the fourth month of 2 ABY. Havod, a reddish alloy that met all military specifications, was normally too difficult to process for such applications, but Kendel deemed it necessary in order to clear the docks for other projects."}, {"tag": "p", "text": "The decision to plate Victory-class Star Destroyers with havod alloy plating was poorly received by both crews and the public. Admiral Kendel's office was flooded by transfer requests from individuals who had otherwise been eager to serve aboard these refurbished ships, and the Historical Battleship Preservation Association indicated its distaste for the move through member Harod Crimmler, who stated \"It would be a shame to see the classical appearance of the Victory-class destroyer marred by red hull plating.\""}, {"tag": "h4", "text": "Conclusion"}, {"tag": "p", "text": "Ultimately, the shortage of raw materials diminished, as the high prices for finished goods led investors and mining concerns to rush open new mines to meet the demand. Admiral Kendel's spokeswoman indicated that Kuat Drive Yards would be receiving regular doonium shipments from newly-opened sources in the Outer Rim in the third fiscal quarter of 2 ABY, forestalling the need for further havod refining, and Rally's Daily Investor estimated 9,000 new system-wide mining facilities would enter full production during that time."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The recession in the Core Worlds caused by the shortage soon abated, and within a year, some economic indicators were reaching record highs. On 38:4:21 GrS, the Brentaal League of Guilds declared a Landmark Holiday, celebrating the fact that more stocks and credits were exchanged during the prior five-day period than at any time in history. Industry throughout the Core Worlds was boosted by the extensive trading, with such corporations as HavaKing, Santhe/Sienar Technologies, MerenData, the Imperial Mining Corporation, and the Tagge Company all posting record profits and dividend increases."}, {"tag": "p", "text": "Despite the poor reception red-hulled Victory-class vessels received when announced, their havod plating was military grade and up to the tasks the Imperial Navy had for them. A decade after Kendel issued his unorthodox order, seventy-three Victory-class Star Destroyers with red-alloy hulls were still in use in the Crimson Command of High Admiral Treuten Teradoc, a breakaway Imperial warlord. The flotilla was under the command of Rear Admiral Gilad Pellaeon, who would later go on to become the leader of the Imperial Remnant."}, {"tag": "p", "text": "The opening of thousands of new mines in isolated parts of the Outer Rim provided independent tramp freighter captains with opportunities to service the miners and support staffs located there. With the sudden explosion of new mines, most corporations had not established company stores, meaning independent traders could sell directly to their employees. Items in high demand in these new work facilities included entertainment holos; small, unarmed battle droids; pets not on the ImpDoc Export Unrestricted list; and intoxicating substances of all varieties."}, {"tag": "h2", "text": "Notable participants"}, {"tag": "h3", "text": "Imperial organizations"}, {"tag": "h4", "text": "Imperial Customs"}, {"tag": "p", "text": "Imperial Customs was an agency of the Empire that enforced Imperial laws and regulations regarding trade, smuggling, and the illegal use of starships. Its duties overlapped significantly with the civilian traffic monitoring duties of the Imperial Navy. Imperial Customs became involved in attempts to thwart raw materials smuggling. On 37:2:22 GrS, Customs agents on Brentaal raided a warehouse complex in the Votrad sector, finding thousands of tons of missing raw materials. They back-traced the registry and lot numbers on the goods, which proved they were shipments from mining and corporate transport vessels that the smugglers had rerouted to the warehouse by slicing into corporate and Customs computer systems."}, {"tag": "h4", "text": "Imperial Energy Systems subministry"}, {"tag": "p", "text": "Imperial Energy Systems was a subministry of the Ministry of Energy. Founded in 1 ABY, it allegedly was tasked with creating large-scale portable power generators for disaster relief applications. It was headed by Moff Tiaan Jerjerrod, and was actually a cover for the second Death Star construction project. Shortly after the subministry's formation, Cynabar's InfoNet learned that many military ships assigned to it were involved in shipping raw materials to undisclosed locations."}, {"tag": "h4", "text": "Imperial Military"}, {"tag": "p", "text": "The Imperial Military was the collective armed forces of the Galactic Empire, consisting of the Imperial Navy and Imperial Army and augmented by the Stormtrooper Corps. The size of the military was immense, and it was supported by a powerful industrial complex that used both nationalized assets and contractors from the private sector. The Empire facilitated the growth of the military by eliminating legal obstructions, using slaves, and strip-mining entire worlds. The military's rapid growth led to heavy government demand for raw materials, which significantly impacted the available supply of them in the private sector."}, {"tag": "h3", "text": "Corporations and organizations"}, {"tag": "h4", "text": "Alliance to Restore the Republic"}, {"tag": "p", "text": "The Alliance to Restore the Republic (also known as the Rebel Alliance or Rebellion) was an alliance of resistance forces formed in direct opposition to the Empire. It dealt a massive blow to the Empire by destroying the Death Star at the Battle of Yavin. The Rebels' propaganda network used this victory to accelerate armed resistance movements throughout the galaxy, giving them the capability to conduct waves of quick, surgically-precise hit-and-fade attacks against Imperial forces. The Alliance's targets included key raw materials production sites, the destruction of which contributed to the shortage."}, {"tag": "h4", "text": "Cynabar's InfoNet"}, {"tag": "p", "text": "Cynabar's Infonet was an illegal news broadcast produced by a mysterious smuggler or group known only as \"Cynabar.\" The aim of the service was to make smugglers and traders aware of business opportunities and the activities of the Galactic Empire. Access to it was very exclusive and costly, and was only made available by invitation. Cynabar's InfoNet was one of the first news outlets to report on the raw materials shortage, with an article entitled \"Mid-Rim Experiencing RawMat Shortage.\" Among other details, the article reported that a significant number of Imperial rawmat transports were military vessels assigned to the Imperial Energy Systems subministry, and were bound for undisclosed locations. The report concluded with an advisory to free-traders to stockpile any raw materials they might have access to, as they were likely to sell for twice the price in the following fiscal quarter. Less than a month after this article was released, the Empire began a heated search for the creators of Cynabar's InfoNet on Nar Shaddaa. Even though the creators of the InfoNet were not located there, the increased attention drove them underground for months."}, {"tag": "h4", "text": "Kuat Drive Yards"}, {"tag": "p", "text": "Kuat Drive Yards was the largest military shipbuilding corporation in the galaxy at the time of the Galactic Civil War. It was based on Kuat. It mainly sold its products to the Empire, and it built the iconic Imperial-class Star Destroyers, Executor-class Star Dreadnoughts, and All Terrain Armored Transports. The yards also refurbished and refitted Imperial ships of non-Kuati manufacture. Kuat continued to receive raw materials transports from the Empire, even as private sector supplies dried up; however, eventually even their military production began to suffer as a result of the shortage, forcing them to resort to nonstandard materials to complete lower-priority projects."}, {"tag": "h3", "text": "Individuals"}, {"tag": "h4", "text": "Jamson Freller"}, {"tag": "p", "text": "Jamson Freller was a Human male from Esseles, and leader of the Esselian New Order Party. He opposed Esselian Hall President Cambira Ralle. Freller capitalized on Esseles's flagging economy during the Core Worlds recession, targeting Ralle's policy of letting aliens be employed in certain strategic jobs; his attacks made substantial inroads against the Forad Party's coalition, allowing it to make major inroads in the Esselian Hall Election of 2 ABY. With these gains, Freller called for a new Presidential election. When terrorist attacks by the anti-Imperial group known as the Faceless further stirred up the Esselian political scene, Freller made a statement outwardly supporting Ralle while casting doubt on Ralle's motivations."}, {"tag": "h4", "text": "Admiral Kendel"}, {"tag": "p", "text": "Admiral Kendel was an officer stationed at Kuat Drive Yards. Faced with one hundred Victory-class Star Destroyers left unfinished due to the shortage of doonium for hull plating, Kendel issued the unusual order to process havod metal alloy into plating for these ships. Kendel's decision was widely criticized, both by outside commentators and by crewers scheduled to serve on the refurbished ships."}, {"tag": "h4", "text": "President Cambira Ralle"}, {"tag": "p", "text": "Cambira Ralle was President of Esseles and leader of the Forad party. A former Clone Wars hero revered for leading Esseles through that trying time, he and his party had long dominated the world's political sphere. By the time of the raw materials shortage, however, his age and failing health had weakened his position. As Esseles's economy faltered with the rest of the Core, his political foe, Jamson Freller, attacked his policy of allowing non-Humans in strategic manufacturing jobs, an attack which made substantial inroads against the Forad Party's coalition government. In the Esselian Hall Election held soon thereafter, Forad lost its holding of the majority for the first time in twenty years, giving Freller the political capital to call for a new Presidential election. Less than a month later, terrorist attacks by the Faceless required Ralle to jockey with governor Griff Takel for the right to send troops into the affected areas, to urge calm and reassure businesses frightened by the attack, and to have talks with the striking Guild of Offworld Skilled Laborers."}, {"tag": "h4", "text": "Captain Dalea Trovin"}, {"tag": "p", "text": "Dalea Trovin was an Imperial Customs officer stationed in the city of Votrad, on Brentaal. She coordinated an investigation into raw materials smuggling that uncovered a warehouse filled with thousands of tons of missing raw materials shipments. Trovin suspected that the materials were headed for secondary sources in the Outer Rim. By back-tracing the registry and lot numbers on the goods, her investigators were led to misdirected shipments from mining and corporate transport vessels, which the traffickers had rerouted into the warehouse by slicing into corporate and Customs computer systems."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raw materials shortage was a running thread through the \"Galaxywide NewsNets\" feature of several issues of the Star Wars Adventure Journal. It was first mentioned in issue number 7's Galaxywide NewsNets, in an article entitled \"Mid-Rim Experiencing RawMat Shortage\" attributed to Cynabar's Infonet. Two subsequent NewsNet posts in the same issue, \"Cynabar's Infonet Shutting Down\" by Cynabar's Infonet and \"Empire Shows Flag at Nar Shaddaa\" by Galaxy News Service, discussed the NewsNet's hiatus; their proximity to the prior post, which included hints of covert Imperial activity, suggest that the shutdown was a related event."}, {"tag": "p", "text": "The raw materials shortage was next discussed in the following issue, in an article attributed to Deena Mipps of Darpa SectorNet, \"Rawmat Recession Threatens Ralle's Coalition.\" It established the raw materials shortage as a cause for a recession in the Core Worlds and the political ramifications for the planet Esseles. The article \"New Order Captures Parliament Majority\" followed up on this political event, as did \"DynaCorp Refinery Blasted by Rebel Terrorist,\" \"Ralle Urges Calm in Aftermath,\" and \"Alien Workers Reach Accord with the Hall\" in Star Wars Adventure Journal 9. That issue also contained a Brentaal Trade News article, \"Customs Uncovers Rawmat Smuggling,\" which showed that the shortage was resulting in smuggling operations. This article indicated the Outer Rim was experiencing the shortage, whereas previous and later sources refer to the Core Worlds and Mid Rim being hit hardest."}, {"tag": "p", "text": "The \"Galaxywide NewsNets\" in Star Wars Adventure Journal 10 contained two articles on the shortage. The first, an Imperial Defense Daily report entitled \"Rawmat Shortages Lead to Red Ships - Commanders Outraged,\" humorously looked at the effect the shortage was having on Imperial shipbuilders and the military. While not explicitly stated as such, the article also appears to be an attempt to establish the origins of the red-hulled Victory-class Crimson Command seen in Kevin J. Anderson's 1995 novel Darksaber. The second article, \"New Mines Opening Means Big Business for Spacers\" by Independent Traders' Infonet, served as a coda for the rawmat shortage, establishing that numerous new mines were being opened to meet the demand for raw materials."}, {"tag": "p", "text": "The reluctance of Imperial Navy personnel to serve on 'pink' Victory Star Destroyers is possibly a reference to the 1959 comedy film Operation Petticoat, in which a submarine is painted pink because insufficient white primer paint is available and sailors are reluctant and embarrassed to serve on it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}