{"url": "Razor", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Cleanup", "Category:Pages needing citation", "Category:Advanced Recon Force troopers", "Category:Members of the 91st Mobile Reconnaissance Corps"], "nodes": [{"tag": "h1", "text": "Razor"}, {"tag": "p", "text": "\"Razor\" was the nickname of an Advanced Recon Force trooper who served in the Grand Army of the Republic during the Clone Wars. He participated in the Battle of Ryloth with General Mace Windu. Razor was one of the two troopers who were led to Cham Syndulla's base."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Razor was present during the Battle of Ryloth where he and other members of Lightning Squadron helped clear a path for the AT-TEs in their AT-RT walkers. Along with Stak, he later accompanied General Windu to find Cham Syndulla. The three hid behind a destroyed MTT while a squad of droids passed by. The squad was almost alerted to their presence when Stak stepped on a rock, however the droids were destroyed by Cham Syndulla's Freedom Fighters and Mace Windu and the clones were led to their base."}, {"tag": "p", "text": "After Cham had pledged to help the Republic free Ryloth they looked for a way to get across the plasma bridge and into the capital. Windu, Razor, and Stak sneaked into a MTT that was carrying treasure to Lessu. The droids became aware of their presence when they scanned the transport and decided to shut the bridge off. Mace used the Force to get both clones to safety and used a STAP to get across himself. Once across, Mace Windu held the droids off while Razor and Stak shot all droids in the control room and reactivated the bridge just in time for the other forces to get across."}, {"tag": "p", "text": "While in the control room, Razor and Stak were ambushed by commando droids who tried to melee the two clones. While Razor was being held up and choked by one commando droid, Stak was being pushed to the ground by another, but managed to get a shot off at Razor's attacker, and after the commando attacking Stak knocked his helmet off, Razor returned the favor and saved Stak. After the battle, he celebrated the Republic victory with the rest of Mace's forces."}, {"tag": "p", "text": "He was later stationed on Umbara within the Republic Outpost during the battle against its Separatist inhabitants."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A continuity error can be found in the shot in which Razor throws back his BX-series droid commando attacker; the markings on his helmet are on the wrong side."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}