{"url": "Razor_Assault_Ship", "categories": ["Category:Canon articles", "Category:Starship classes"], "nodes": [{"tag": "h1", "text": "Razor Assault Ship"}, {"tag": "p", "text": "The Razor Assault Ship was a class of assault ship with a long horizontal body. At least one such vessel was part of the citizens' fleet that assisted the Resistance in their fight against the forces of the reborn Darth Sidious at the planet Exegol. Together, the Resistance and citizen forces successfully defeated the Sith Eternal's fleet of Star Destroyers."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A model of assault ship, the Razor Assault Ship had a horizontally-oriented design. Its thin and angular body widened at one end, where two large wings branched out. The assault ship was equipped with a hyperdrive and possessed five engines, four of which were situated at the ship's wider end, with the remaining engine positioned at the other."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 35 ABY, at least one Razor Assault Ship was present in the citizens' fleet, a fleet of unaffiliated starships assembled by General Lando Calrissian to assist the Resistance. The fleet traveled to the planet Exegol to aid the Resistance forces in the Battle of Exegol against the Final Order, a Star Destroyer fleet of the Sith Eternal commanded by the resurrected Darth Sidious. Shortly after the arrival of the citizens' fleet, a Razor Assault Ship flew past an exploding Star Destroyer alongside several starfighters."}, {"tag": "p", "text": "During the battle, Sidious disabled the Resistance and citizen fleets with Force lightning, but numerous vessels, including a Razor Assault Ship, were able to recover when he was distracted by an attack from the Jedi Rey. The arrival of the citizens' fleet ultimately helped the Resistance to win the battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Razor Assault Ship appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker. The ship was first identified in the video \"Every Ship in the Star Wars Sequel Trilogy,\" posted on the Star Wars Kids YouTube channel on July 31, 2020."}, {"tag": "p", "text": "The design of the Razor Assault Ship is based on unused concept art created by James Clyne for the Buckshot, a carrier ship that was intended to be used by Enfys Nest and the Cloud-Riders in the 2018 film Solo: A Star Wars Story. In The Art of Solo: A Star Wars Story, Clyne noted that the particular design that became the Razor Assault Ship gained some traction and speculated on its usage as a background Easter egg in the film during the scenes in the yacht of Dryden Vos at Fort Ypso."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}