{"url": "RebelForce_Radio", "categories": ["Category:Real-world articles", "Category:Cleanup", "Category:Podcasts"], "nodes": [{"tag": "h1", "text": "RebelForce Radio"}, {"tag": "p", "text": "RebelForce Radio is a weekly Star Wars radio show/podcast that debuted on January 12, 2013. The show is hosted by long time Star Wars podcasters Jason Swank and Jimmy \"Mac\" McInerney, who following a six year run as the original hosts and producers of The ForceCast for TheForce.net, decided to create their own podcasting venture. RebelForce Radio is a personality-driven show featuring Star Wars news, commentary, interviews, and comedy. The show has also been featured and advertised by many outlets including StarWars.com, Jedi News, The Daily Dot, and Star Wars Insider. In Star Wars Insider 149, it was announced that RebelForce Radio hosts Jason Swank and Jimmy Mac would be Stage Hosts at Celebration Anaheim."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The ForceCast with Jason Swank & Jimmy Mac"}, {"tag": "p", "text": "Before the launch of RebelForce Radio, Jason Swank and Jimmy Mac acted as the hosts for The ForceCast, a show that was distributed by TheForce.net. Jason Swank and Pete Nadal were the original hosts of the ForceCast. After a few months of doing the show, as Jason and Pete got more comfortable with their new roles, the ForceCast hosts started getting emails from Jimmy Mac, a Chicago-based audio engineer whom Jason described as a \"cocky radio guy\". \"At first I thought he was just busting our chops,\" Jason said. \"Turns out the guy just really wanted to help.\" \"I liked what I was hearing and I thought Jason and Pete had fabulous chemistry,\" Jimmy said."}, {"tag": "p", "text": "On Wednesday, September 3, 2008, Pete announced that he would be leaving the show. Pete taped his last show with Jason on Wednesday, September 24, 2008. On one of the longest shows to date, he thanked the fans, his fellow crew members, and everyone at TheForce.Net and Rebelscum for their support. Following the departure of Pete Nadal, Jimmy Mac stepped up to take the role of the co-host. He became a fan favorite for his impressions of saga luminaries such as Irvin Kershner and Harrison Ford. He also made the news in the sci-fi community when he ranted against film critic Roger Ebert following Ebert's scathing review of Fanboys. Jimmy was also known for his Investigative Reports on such topics as \"Who is BJ Hughes?\""}, {"tag": "p", "text": "On August 11, 2010, Jason and Jimmy kicked off five-day \"No Fan Left Behind\" coverage of Celebration V in Orlando, FL. Jason and Jimmy recorded three shows in front of a live audience at their booth on the show floor. During the first live show, on August 12th, Jason and Jimmy received their first honor by being inducted into the 501st Legion as Friends of the Legion. Jason and Jimmy were also recognized at Celebration V by The Clone Wars Supervising Director Dave Filoni as having contributed immeasurably to Star Wars fandom. On August 14th, during the third and final live show, Filoni stopped by to present the two hosts with plaques commemorating their induction into his 104th Wolf Pack, which recognizes their significant commitment to the Star Wars community. Filoni mentioned that there are only fifteen such plaques in existence."}, {"tag": "p", "text": "After nearly 5 years hosting The ForceCast, on January 13, 2013, it was announced that Jason and Jimmy would be leaving the TheForce.Net and Rebelscum.com as well as their work on The ForceCast in order to start their own podcast, RebelForce Radio. The network's programs went on hiatus at that point while TFN Content Manager Dustin Roberts began overseeing preparations for the next phase of the operation."}, {"tag": "h3", "text": "RebelForce Radio"}, {"tag": "p", "text": "RebelForce Radio was announced via an initial press release.  Following the initial launch with a produced promo, The first RebelForce Radio episode was released on January 19th, 2013 with special guest, Supervising Director of Star Wars: The Clone Wars Dave Filoni. The show immediately jumped to #1 overall in the iTunes TV/Film podcast rankings where it stayed for several weeks. To promote the premiere, show host and Executive Producer Jimmy \"Mac\" McInerney appeared on several podcasts focused on Star Wars, pop culture and more. Many Star Wars websites promoted the release of the first episode as the show continued to integrate itself within the fan community."}, {"tag": "p", "text": "Following its launch in January 2013, RebelForce Radio, Jason & Jimmy settled into their familiar weekly release schedule with new shows coming out every Friday. In Fall 2013, the show expanded to include additional programming for all tastes among Star Wars fans. These shows include Star Wars Influences focusing on the behind-the-scenes information about the films; Star Wars Oxygen, analysis of the Star Wars soundtrack music; Fangirls Going Rogue, discussion about and for Star Wars fangirls; RADIO 1138, a show for British fans, and the Star Wars Collectors Cast. Also in Fall 2013, the show was added to the Disney-focused Sorcerer's Radio( where a version of the weekly show can be heard ever Saturday night at 7pm Eastern."}, {"tag": "p", "text": "On June 20th, 2014, Jedi News announced that RebelForce Radio had been downloaded over 1-million times. This is the second time that the duo of Jason Swank & Jimmy Mac have hit the 1-million download mark, as they had previously gotten to it while a part of The ForceCast."}, {"tag": "p", "text": "Show hosts Swank and Mac hosted the \"Behind-The-Scenes\" stage at Star Wars Celebration 2015."}, {"tag": "h3", "text": "Hosts"}, {"tag": "p", "text": "Jimmy \"Mac\" McInerney is a Chicago radio professional and lifelong Star Wars enthusiast and collector. Following runs at the radio stations WLUP AM/FM, WCKG FM, NINE FM, 95.9 FM in Chicago, and KLSX in LA, Jimmy is currently focusing on freelance work for production. Jimmy's first experience covering Star Wars news for Chicago radio was in 1997 with the release of the Star Wars Special Editions. He continued to report on Star Wars news for Chicago radio culminating with the 2005 Star Wars Radio Special for CBS Radio's 105.9 WCKG FM. This special, done in conjunction with the release of Star Wars: Episode III Revenge of the Sith, featured interviews with actors from all six of the Star Wars films, mostly recorded at Star Wars Celebrations II and III in Indianapolis. Jimmy joined the staff of The ForceCast in December 2006 as show producer and MicroCast host, occasionally joining original show hosts Jason Swank and Pete Nadel on the Weekly ForceCast program. He hosted the long-running show A Galaxy of Music which focused on music, comedy and parodies influenced by Star Wars along with convention coverage and interview specials. In September 2008, Jimmy became full-time co-host following the departure of Pete Nadel. Jimmy and Jason continued to host The ForceCast until the pair decide to leave TFN in January 2013 to start RebelForce Radio. Jimmy lives in the Chicago area with his wife, WGN Radio talk show host Wendy Snyder and their two boys, Michael and Dylan."}, {"tag": "p", "text": "A proud resident of the state of Ohio, Jason Swank is a marketing executive currently with The Cleveland Square Theater where he works with theatrical events and plays from Broadway and beyond. Jason also has professional radio experience and is the former Marketing & Public Affairs Director for the Akron Symphony Orchestra, where he once produced a well-received Star Wars Orchestral concert. In September 2006, Jason along with friend and fellow Star Wars fan Pete Nadel, named and created The ForceCast for TheForce.net. Chosen from a large pool of auditions, Jason & Pete conceived the show and were pioneers in the field of Star Wars podcasting. Jason continued on with The ForceCast following Nadel's departure and Jimmy Mac's addition in September 2008. Jason moderated the popular Clone Wars Roundtable for the network, leading discussion with a wide variety of guest panelists analyzing every episode of Star Wars: The Clone Wars. Jason has traveled with the show to podcast live from many conventions, including Star Wars Celebrations IV, V, and VI. Jimmy and Jason continued to host The ForceCast until the pair decided to leave TheForce.net in January 2013 to start RebelForce Radio. A collector of Star Wars memorabilia and tech aficionado, Jason lives in Canton, Ohio with his wife Debra and their two children Bailey and Parker."}, {"tag": "h2", "text": "Other Programs"}, {"tag": "p", "text": "In addition to its flagship show, RebelForce Radio contains a variety of other programming."}, {"tag": "h2", "text": "Accolades"}, {"tag": "h3", "text": "Awards"}, {"tag": "p", "text": "2008"}, {"tag": "p", "text": "2009"}, {"tag": "p", "text": "2010"}, {"tag": "p", "text": "2012"}, {"tag": "p", "text": "2013"}, {"tag": "p", "text": "2014"}, {"tag": "p", "text": "†:While a part of The Forcecast"}, {"tag": "h3", "text": "Press"}, {"tag": "h2", "text": "List of celebrity guests"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}