{"url": "Rebel_Alliance_Intelligence_Service", "categories": ["Category:Canon articles", "Category:Rebel Alliance stubs", "Category:Incomplete lists", "Category:Alliance High Command personnel", "Category:Alliance to Restore the Republic intelligence organizations"], "nodes": [{"tag": "h1", "text": "Rebel Alliance Intelligence Service"}, {"tag": "p", "text": "The Rebel Alliance Intelligence Service, also known as Alliance Intelligence, Rebel Intelligence, or Rebel Alliance Intelligence, was a branch of the Alliance to Restore the Republic responsible for obtaining and analyzing military, diplomatic and economic information about the Galactic Empire and reporting such information to the relevant branches of the Alliance. By the Battle of Scarif, General Airen Cracken was the Chief of Intelligence, and he still held the position at the time of the Battle of Endor. In a journal entry kept within the Rebel Files, chief of state Mon Mothma stated that she didn't particularly like working with Intelligence, adding that agents like Davits Draven had a chilly moral pragmatism that they could use to justify any crime."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "Rebel Intelligence was formed between 19 BBY and 18 BBY, during the early days of the rebellion against the Galactic Empire. Former Jedi Padawan Ahsoka Tano took over command of the Intelligence network after she was recruited into the rebellion by Senator Bail Organa. Their strategy was to identify and observe emerging resistance cells and determine whether they were competent in disrupting Imperial operations and remaining hidden. Organa regarded it as cruel but necessary, as the Empire could easily destroy amateur groups and compromise the entire organization Organa and Senator Mon Mothma were attempting to create."}, {"tag": "h3", "text": "Obtaining the \"Farkiller\""}, {"tag": "p", "text": "Sometime after the Battle of Yavin, Alliance Intelligence received word that archaeologist Chelli Lona Aphra knew of the \"Farkiller\" weapon and sent Strike Team Misericorde to retrieve her. Chief of Intelligence Airen Cracken believed that killing Galactic Emperor Palpatine was the only way to end the Galactic Civil War."}, {"tag": "h3", "text": "Operation Ringbreaker"}, {"tag": "p", "text": "Sometime following the Battle of Hoth, Alliance Intelligence vetted Operation Ringbreaker."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Following the Battle of Endor, the Rebel Alliance was reorganized into the New Republic and Alliance Intelligence was transitioned into New Republic Intelligence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}