{"url": "Rebel_Escape", "categories": ["Category:Real-world articles", "Category:Star Wars Adventure Journal", "Category:West End Games adventures"], "nodes": [{"tag": "h1", "text": "Rebel Escape"}, {"tag": "p", "text": "Rebel Escape is an instant adventure for West End Games' Star Wars Role Playing Game. It was written by Tony Russo as part of the A Taste of Adventure article in Star Wars Adventure Journal 7. It is designed as an accessible adventure for novice players, and features appearances by Boba Fett and Zardra."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The adventure is initiated in a cantina on an unidentified planet, as Boba Fett suddenly enters and offs a patron. Upon confrontation by an angry cantina proprietor, Fett announces that he is looking for a Human female, and that he will reward anyone who can point him to her, and then leaves. The player characters notice a weeping human female hiding in the shadows in the cantina, who disappears. The player characters decide to track her down and exit the cantina to look for her in the streets. Here, they confront a gang of hoodlums who, also out for the bounty on her head, have fond her and encircled her. When all his gang members are defeated, the gang leader pulls a blaster on the player characters, but is incapacitated by another bounty hunter - namely, Zardra. Taking advantage of the situation, the player characters and the human female run off and hide in an alley. Here they learn that the woman is a courier for the Rebel Alliance. Fett soon discovers them and offers them a hefty sum of credits. Deciding to help Mari, the player characters sneak off and take Mari to their own spaceship. After defeating an alien bounty hunter waiting for them in the docking bay, the characters and Mari escape the planet, just as Fett and Zardra enter the docking bay."}, {"tag": "p", "text": "It should be mentioned that, when Fett discovers the characters and Mari in the alley, the characters have the option of handing her over to Fett (who will then actually open fire on them) or trying to double cross Fett by taking the money and rescuing Mari anyway. However, the article advises novice players to simply slip off into the dark and rescue Mari that way."}, {"tag": "h2", "text": "Appearances"}]}