{"url": "Rebel_Transports_Expansion_Pack", "categories": ["Category:Real-world articles", "Category:Star Wars: Armada Wave III"], "nodes": [{"tag": "h1", "text": "Rebel Transports Expansion Pack"}, {"tag": "p", "text": "The Rebel Transports Expansion Pack is a supplement to the tactical naval warfare game, Star Wars: Armada, published by Fantasy Flight Games, and part of the third wave. The expansion features two detailed miniatures of the GR-75 medium transports. It was announced on March 16, 2016 alongside the Imperial Assault Carriers Expansion Pack and released August 11, 2016."}, {"tag": "h2", "text": "Publisher's Summary"}, {"tag": "p", "text": "The Rebel Transports Expansion Pack introduces a flotilla of GR-75 medium transports to your games of Star Wars™: Armada. In addition to its flotilla, which you can field as either a pair of GR-75 Combat Retrofits or GR-75 Medium Transports, the Rebel Transports Expansion Pack introduces eight upgrades, four of which feature the utilitarian Fleet Support icon. Relay commands to your larger ships with a Comms Net, or trail behind your largest ships with Repair Crews to keep them in the fight a bit longer. Clever use of the support your fleet gains from its Rebel transports can easily make the difference between victory or defeat."}, {"tag": "p", "text": "The Rebel Transports Expansion Pack contains two GR-75 medium transport miniatures, two ship cards, eight upgrades, one rules reference card, and all necessary components."}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "The Rebel Transports Expansion Pack contains two miniatures, plus a maneuver dials and action tokens, as well as ship and upgrade cards."}, {"tag": "h3", "text": "Ship components"}, {"tag": "h3", "text": "Cards"}, {"tag": "h4", "text": "Ship cards"}, {"tag": "h4", "text": "Upgrade cards"}, {"tag": "p", "text": "Commander:"}, {"tag": "p", "text": "Fleet Support:"}, {"tag": "p", "text": "Officer:"}, {"tag": "p", "text": "Title:"}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}