{"url": "Rebel_Dawn", "categories": ["Category:Real-world articles", "Category:Star Wars: The Han Solo Trilogy"], "nodes": [{"tag": "h1", "text": "Rebel Dawn"}, {"tag": "p", "text": "Rebel Dawn is the third book in The Han Solo Trilogy by A. C. Crispin, and the final chapter in the Rise of the Empire era."}, {"tag": "p", "text": "The three volumes of The Han Solo Adventures cover a period of almost three years during interludes in this novel."}, {"tag": "h2", "text": "Editions"}, {"tag": "h3", "text": "American"}, {"tag": "h3", "text": "Foreign"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Millennium Falcon is \"the fastest hunk of junk in the galaxy.\" So when Han Solo wins it in a game of sabacc, he and Chewbacca become kings of the smugglers—uncatchable, unstoppable. But with the Empire clamping down, Han knows his luck can't last. Still, when an old flame of Han's, who is now the leader of an insurgent Rebel group, offers him a shot at an incredible fortune, Han can't resist. The plan seems a sure thing. The resistance will be light, the take enormous. Han and his friends will divide it equally with the Rebels. Too bad for Han that the planet of Ylesia is far from a pushover, that the Rebels have an agenda of their own, and that smuggler friends can often turn into enemies…faster than lightspeed."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Han Solo wins the Millennium Falcon from Lando Calrissian in an intense sabacc tournament on Bespin. He begins upgrading the freighter into a highly-specialized smuggling vessel, and also makes a brief stop with Chewbacca on the Wookiee home planet of Kashyyyk, where Chewbacca marries Mallatobuck. Solo and Chewbacca then embarked on a series of adventures."}, {"tag": "p", "text": "After returning to Nar Shaddaa, Solo is reunited with his old flame Bria Tharen, now an agent of the Rebel Alliance. He is reluctant to aid his former love, who is planning an all-out attack against the slaving colonies on Ylesia. Promised appropriate compensation, Solo, Calrissian, and Chewbacca take on the mission. In the aftermath of the battle, Tharen's troopers turn their blasters on Calrissian and the rest of Solo's friends, confiscating all their valuables in the name of the Rebel Alliance. Angered, Han threatens to kill Tharen if he ever sees her again. Defaced and branded a traitor back on Nar Shaddaa, Lando refuses to believe Solo was not involved in the swindle, before proceeding to sock his former friend in the jaw."}, {"tag": "p", "text": "Desperate for money, Solo and Chewbacca take on a spice smuggling run from Jabba (who had inherited his aunt's criminal empire) through the Kessel Run. However, the duo are met mid-Run by an Imperial patrol, and forced to abandon their cargo in deep space, before The Falcon is searched and escorted to a nearby world. When they return in search for their cargo, however, the pair discover it has disappeared. The smuggler tries to explain to his employer what happened, but Jabba — in a drug-induced haze — turns his back on Solo, demanding compensation for the lost spice."}, {"tag": "p", "text": "Meanwhile, Bria leads a rebel raid on Toprawa in which rebel spies transmit the plans for the Death Star I to Leia Organa aboard the Tantive IV. Tharen and her squadron are all killed in the raid, but the plans are successfully transmitted. This is the \"First Victory\" of the Rebels."}, {"tag": "p", "text": "On Tatooine, Han Solo tries unsuccessfully to arrange a personal meeting with Jabba, and becomes increasingly harassed by bounty hunters working for the crime lord. While he searches for a card game in which he might be able to win the money needed to pay off Jabba, he briefly encounters Dash Rendar."}, {"tag": "p", "text": "Solo is then interrupted by news of his former lover's death, delivered by Boba Fett, who also informs Solo that Greedo is searching for him, and may try to kill him. The following day he records a message to Tharen's father, passing on the grim news."}, {"tag": "p", "text": "The smuggler then proceeded to Chalmun's Cantina in Mos Eisley, where Chewbacca meets Former Jedi Master Obi-Wan Kenobi, to discuss chartering the Falcon for passage to Alderaan. Solo sits down to meet with Kenobi and young Luke Skywalker, leading to the events of Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}]}