{"url": "Rebel_Fanfare", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Real world music stubs", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "Rebel Fanfare"}, {"tag": "p", "text": "Rebel Fanfare is a musical motif that represents the Rebel Alliance and the Millennium Falcon. It is used extensively in Episode IV and less frequently in all other episodes. The theme is usually played by a brass section. It appears in the closing credits of every movie. It also appears in the theme of Star Wars: The Clone Wars. It is an integral part of the main theme of the Star Wars Rebels TV series."}, {"tag": "p", "text": "Although used less frequently outside of the original trilogy, the theme has several notable appearances in other films of the Star Wars saga: it plays at the reveal of the Millennium Falcon on Jakku in The Force Awakens, many times in The Last Jedi and in The Rise of Skywalker."}, {"tag": "p", "text": "The theme appears several times in Rogue One: A Star Wars Story, notably over an establishing shot of the Rebel Alliance Headquarters; as the Alliance Fleet emerges from hyperspace at Scarif; when Blue Squadron attacks the AT-ACTs; and in reference to \"Imperial Attack\" from Episode IV, played during the final scene aboard Tantive IV. The theme also appears in Solo: A Star Wars Story, most notably a bombastic rendition that occurs as the Millennium Falcon escapes from the gravity well in the Maw."}, {"tag": "h2", "text": "Use"}, {"tag": "p", "text": "The Rebel Fanfare appears in the end credits of all films of the Star Wars saga. The soundtrack of Star Wars: Episode IV A New Hope makes extensively use of the rebel leitmotif. The motif is first played in the track Main Title/Rebel Blockade Runner to introduce Tantive IV, the rebel blockade runner fleeing Darth Vader's Star Destroyer. The motif is later played in Imperial Attack, The Hologram/Binary Sunset, The Death Star/The Stormtroopers, Wookiee Prisoner/Detention Block Ambush, Ben Kenobi's Death/TIE Fighter Attack, and The Throne Room/End Title."}, {"tag": "p", "text": "In Star Wars: Episode V The Empire Strikes Back, the motif is played in The Battle of Hoth Medley in addition to the end titles. For Star Wars: Episode VI Return of The Jedi, the fanfare is played in The Pit of Carkoon/Sail Barge Assault as well as The Battle of Endor III Medley in addition to the end titles."}, {"tag": "p", "text": "In Star Wars: Episode III Revenge of The Sith, the Rebel Fanfare is played when the last of the buzz droids are dispatched by R2-D2 during the Battle of Coruscant. The music used is from the unreleased track \"Get 'em R2!\""}, {"tag": "p", "text": "The end titles of every episode of the Star Wars: The Clone Wars TV series include the fanfare. In addition, the episode \"Wookiee Hunt\" uses the fanfare as a leitmotif outside if the titles."}, {"tag": "p", "text": "The Rebel Fanfare is featured alongside a rendition of the trap motif in the main theme of the Star Wars Rebels television series. While the rendition of the trap motif is used as a leitmotif for the Spectres rebel cell in the show, the Rebel Fanfare is used in accompaniment to most of the intro and outro screens of the Rebels logo."}, {"tag": "p", "text": "In the sequel trilogy, in addition to its customary inclusion in the end credits, the motif is used in the tracks Follow Me and The Falcon for Star Wars: Episode VII The Force Awakens, Main Title and Escape, The Battle of Crait, and Peace and Purpose in Star Wars: Episode VIII The Last Jedi, and The Falcon Flight and Rescue in Star Wars: Episode IX The Rise of Skywalker."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "p", "text": "Star Wars Episode I: The Phantom Menace soundtrack"}]}