{"url": "Rebel_Friend", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Non-canon Legends articles", "Category:Alliance Fleet personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Rebel Friend"}, {"tag": "p", "text": "Rebel Friend was a Human male Rebel trooper who fought aboard the CR90 corvette Tantive IV during the battle between the Rebel Alliance and the Galactic Empire above the planet Tatooine in 0 BBY. Captain Raymus Antilles and the droids C-3PO and R2-D2 were aided by Rebel Friend in the fight against Imperial stormtroopers who had boarded the Tantive IV. Rebel Friend and his compatriots battled both the stormtroopers and several Imperial officers in order to allow C-3PO and R2-D2 to escape the besieged corvette in an escape pod."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Stationed on the Tantive IV"}, {"tag": "p", "text": "In 0 BBY, during the Battle of Tatooine, the Human male Rebel Friend was stationed aboard the CR90 corvette Tantive IV, a starship of the Rebel fleet being attacked by the Imperial I-class Star Destroyer Devastator of the Galactic Empire. While above the Outer Rim planet of Tatooine, the Devastator captured the Tantive IV in a tractor beam, and Imperial stormtroopers boarded the corvette."}, {"tag": "p", "text": "Rebel Friend was fighting two of the invading stormtroopers when Rebel Captain Raymus Antilles and two droids, C-3PO and R2-D2, arrived on the scene. Although the two parties were separated by a large gap in the floor, Antilles was able to use a crane to kill the two stormtroopers. Rebel Friend then pulled a lever that lowered a row of platforms across the chasm, allowing Antilles and the droids to join him."}, {"tag": "h3", "text": "Fighting the stormtroopers"}, {"tag": "p", "text": "As the group moved forward, they quickly encountered a quartet of stormtroopers who had arrested a pair of Rebel troopers and were escorting them away. Rebel Friend and Antilles were able to kill the Imperial troopers and free the Rebels, only to find several more stormtroopers as well as Imperial officers along their path."}, {"tag": "p", "text": "Rebel Friend, Antilles, R2-D2, C-3PO, and the Rebel troopers continued down the hallway and disposed of all foes blocking their path. At the end of the hall, R2-D2 and C-3PO entered an escape pod and jettisoned down to Tatooine, leaving Antilles and Rebel Friend behind. Shortly after, Captain Antilles was killed by the Dark Lord of the Sith Darth Vader, who was leading the Imperial troops."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rebel Friend had light skin and black eyes. He was devoted to the Rebel cause and was prepared to fight to the death for it. He was also willing to shoot any Imperial who tried to impede upon his objectives."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Rebel Friend wore a red shirt with a black vest, gray pants, and a black-and-white helmet with a chin strap. He carried a blaster as well as an ascension gun used to grapple to hard-to-reach places."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rebel Friend first appeared in the non-canon 2006 Traveller's Tales video game LEGO Star Wars II: The Original Trilogy in the level \"Secret Plans.\" He was a playable character in the game's \"Story\" mode, unlike the majority of the other Rebel troopers in the level, who were non-playable characters."}, {"tag": "p", "text": "If two players play through the level in \"Story\" mode, both players have the ability to fight once Rebel Friend is added to the group, rather than one of the players being forced to play as a non-combatant droid once Princess Leia leaves the level. After unlocking Rebel Friend in the \"Story\" mode of the games, the player has the option to play as him in any level in the \"Free Play\" or \"Challenge\" mode of the games."}, {"tag": "p", "text": "Rebel Friend is not present in the \"Secret Plans\" level of the Nintendo DS versions of either LEGO Star Wars II or the 2007 video game LEGO Star Wars: The Complete Saga. Nonetheless, he can still be purchased as a Free Play character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}