{"url": "Rebel_Starfighters_Owners%27_Workshop_Manual", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Canon Haynes Manuals"], "nodes": [{"tag": "h1", "text": "Rebel Starfighters Owners' Workshop Manual"}, {"tag": "p", "text": "The Rebel Starfighters Owners' Workshop Manual is a canon reference book in the style of Haynes Manuals. The book features various starfighter models of the Rebel Alliance and the Resistance. It was written by Ryder Windham, with illustrations by Chris Reiff and Chris Trevas. Haynes Publishing released the first edition for the United Kingdom on November 7, 2019, while Insight Editions published an edition for the United States on November 12, 2019."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "After the Clone Wars, the Galactic Empire spared no expense to build a massive fleet of warships to enforce Imperial rule, intimidate defenseless worlds, and destroy all opposition. However, the Imperial Navy underestimated Rebel Alliance fighter pilots, who flew X-wing, Y-wing, A-wing, U-wing and B-wing starfighters, and whatever else they could obtain to fight their Imperial enemies. Decades later, Resistance pilots would fly next-generation versions of Rebel starfighters against the First Order."}, {"tag": "p", "text": "The Rebel Starfighters Owners' Workshop Manual presents a thorough history of the starfighters that served the Rebel Alliance and the Resistance. The history includes design origins, production, and modifications for each Rebel starfighter, and is fully illustrated with numerous photographs, schematics, exploded diagrams, and computer-generated artwork by Star Wars vehicle experts Chris Reiff and Chris Trevas. Text is by Ryder Windham, author and co-author of more than 70 Star Wars books. This Haynes Manual is the most thorough technical guide to Rebel starfighters available, and is fully authorized and approved by Lucasfilm."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}