{"url": "Rebel_Safe_House", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Articles that are known by a nickname", "Category:Articles with gameplay alternatives", "Category:Alliance to Restore the Republic military bases", "Category:Rori locations"], "nodes": [{"tag": "h1", "text": "Rebel Safe House"}, {"tag": "p", "text": "A Rebel Safe House located on Naboo's moon of Rori was used by the Rebel Alliance during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 1 ABY,\nImperial and Rebel agents on Rori were involved in the hunt for Cal Handro, a smuggler who had vanished after crash-landing on Rori while transporting a new kind of spice for the Rebel Alliance. Officer M'Kae was leading the investigation for the Empire. In the meantime, Rebel Officer Wolff Kalos had a similar mission for the Alliance."}, {"tag": "p", "text": "A group of spacers recruited by Rebel Officer Veega Madish finally found Cal Handro at an estate owned by the wealthy gambler Tierce Martano. At this point, Handro was now considered as a traitor by the Alliance for having smuggled slaves. After the adventurers rescued Martano who was attacked by Black Sun henchmen, the gambler accepted to give the location of Handro to to the spacers who contacted Wolff Kalos. The latter immediately sent agents to pick Cal Handro and transferred him to the safe house. However, the Empire also got the information and Officer M'Kae promptly dispatched a group of mercenary to attack the building. Although the spacers arrived rapidly to help the Rebel forces, the pilot used the diversion to escape with a group of Imperial agents."}, {"tag": "p", "text": "Cal Handro was eventually killed in his starship during a space battle between Imperial and Rebel forces in the Naboo system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rebel Safe House was a location in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Rebel Safe House was added to the game with the fourth chapter of the \"Secrets of the Syren\" quest line, released with the \"Publish 21\", on August 4, 2005. The \"Secrets of the Syren\" story arc was removed from the game with the \"Chapter 1\", published on June 8, 2006, due to the major changes planed for Rori with the introduction of the Battle of Restuss."}, {"tag": "p", "text": "In the fourth quest of the \"Secrets of the Syren\" arc, the player had to choose to work with either Rebel Officer Wolff Kalos or Imperial Officer M'Kae. This article assumes that the player was affiliated the Rebel Alliance. If the player chose the Empire, he/she would have to fight in an Imperial Safe House instead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}