{"url": "Rebel_Rising", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Articles that need plot summary", "Category:Canon young-adult novels"], "nodes": [{"tag": "h1", "text": "Rebel Rising"}, {"tag": "p", "text": "Rebel Rising is a young-adult novel written by Beth Revis and published by Disney–Lucasfilm Press. It covers thirteen years of Jyn Erso's life, between the opening and the main events of Rogue One: A Star Wars Story, when she was a rebel fighter alongside Saw Gerrera and survived on her own afterwards. The novel was released on May 2, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "When Jyn Erso is eight years old, her mother is murdered and her father taken from her to serve the Empire. But despite the loss of her parents, she is not completely alone. Saw Gerrera, a man willing to go to any extremes necessary to resist Imperial tyranny, takes her in as his own daughter and gives her not only a home but all the abilities and resources she needs to become a rebel."}, {"tag": "p", "text": "Jyn dedicates herself to the cause—and the man. But fighting alongside Saw and his people brings with it danger and the question of just how far Jyn is willing to go as one of Saw's soldiers. When she faces an unthinkable betrayal that shatters her world, Jyn will have to pull the pieces of herself back together and figure out what she truly believes in…and whom she can really trust."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "As a young 8-year old child, Jyn's mother was killed by the Empire on Lah'mu, and Orson Krennic coerced her father Galen Erso into joining the Empire. Saw Gerrera came to take Jyn to his base on Wrea when she was 8 years old and raise her. He taught her how to fight and shoot. She listened in to his meetings with other groups of people opposed to the Empire."}, {"tag": "p", "text": "When Jyn was 14, Saw had become more of a hardliner leaning towards terrorism against the Empire. As Jyn spent more and more time with Saw's partisan group, she was allowed on her first mission. When she was 15, Saw took Jyn on a mission to Inusagi. While she was only involved in distributing forged clearance codes and passes, she witnessed Saw and his group slaughtering a ballroom of Imperials, Inusagians and other civilian guests. Saw used any means to fight the Empire, but Jyn disapproved of his methods."}, {"tag": "p", "text": "Saw was determined to protect Jyn's identity no matter what. He killed potential traitors within their own ranks. Regardless, he did not foresee Reece Tallent's betrayal on a recon mission to Tamsye Prime. Reece colluded with an Imperial officer to get Saw and Jyn arrested. Saw was able to fight back and got them out. With Jyn's identity as Galen Erso's daughter compromised, Saw left her Jyn behind to protect her. Jyn was able to flee and ended up on Skuhl, where Akshaya Ponta took her in. Jyn got close to Akshaya's son, Hadder, over the year she spent on Skuhl. When the Empire arrived on Skuhl, they soon came looking for Jyn. Akshaya and Hadder were killed trying to escape the Empire. Jyn made it to Five Points, a difficult-to-reach space station. She had few credits and was forced to stay on the station and forge casino chips for a corrupt Imperial officer."}, {"tag": "p", "text": "The Imperial officer and the local crime boss arranged for Jyn to help them smuggle slaves off of the Five Points space station. Jyn tricked the crew onboard the slaver's ship, freed the slaves, and fled the system. Now 18 years old, Jyn bounced around the galaxy's Outer and Mid Rim worlds, taking on different jobs until she was 21. A job brought her back to the Five Points system, where she helped forge codes for a rebel group. An Imperial admiral had her arrested and forced her to infiltrate and spy on a rebel group in exchange for a promise of amnesty. After the admiral captured the crew, Jyn was arrested despite the promised amnesty, and she was put into a labor camp on Wobani."}, {"tag": "p", "text": "Jyn lost most of her hope in the Imperial Detention Center & Labor Camp LEG-817 on Wobani, witnessing multiple of her cellmates die from depression or rebellion. After 6 months Jyn was freed from a transporter bringing her to do field work. She was brought in front of Mon Mothma and Bail Organa and asked to find her father to unravel the secrets about the project he was working on, which she agreed to."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}