{"url": "Rebellion_0", "categories": ["Category:Real-world articles", "Category:Star Wars: Rebellion (comics)"], "nodes": [{"tag": "h1", "text": "Rebellion 0"}, {"tag": "p", "text": "Rebellion 0: Crossroads was the introductory issue of the Star Wars: Rebellion comic series. It was part of a Star Wars: Knights of the Old Republic/Rebellion flip-book."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "With the destruction of its Death Star battle station, the Galactic Empire has been shaken to the core by the ever-growing Rebel Alliance. Its iron-fisted order challenged, the Empire quickly finds an increasing number of systems slipping through its fingers."}, {"tag": "p", "text": "In one of those systems, the remote desert planet of Jabiim held promise for Luke Skywalker and the Rebellion. But a well-intentioned diplomatic mission turned tragic when the Rebels' presence alerted Darth Vader and led to the complete subjugation of Jabiim's immense slave population."}, {"tag": "p", "text": "Seeking to rescue one of their own left behind on Jabiim—an Alliance mathematician called Jorin Sol—the rebels mounted a daring and covert mission against an Imperial stronghold on Kalist VI. An operation that brought Luke Skywalker into direct and heartbreaking conflict with his childhood friend \"Tank,\" now known to the Empire as Lieutenant Janek Sunber..."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "This story opens with Jabiimi loyalist Tal Hesz delivering Rebel agent Jorin Sol into the hands of Lord Darth Vader. The issue then recaps the recent history of the planet Jabiim, including the betrayal of the planet by young Republic Commander Anakin Skywalker, the harboring of rebels by planetary insurgents, and the subsequent orbital bombardment and enslavement of its people. Hesz spends weeks searching for his people, and finally arrives on Kalist VI just in time to see his people freed by Rebel agents led by Luke Skywalker. Shortly after the attack, Hesz is taken into Imperial custody, and Jorin Sol returns to the Rebels after his torture at the hands of Darth Vader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}]}