{"url": "Rebel_flight_suit", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles needing additional sources", "Category:Alliance to Restore the Republic", "Category:Uniforms"], "nodes": [{"tag": "h1", "text": "Rebel flight suit"}, {"tag": "p", "text": "Rebel flight suits, also called pilot fatigues, were garments worn by Rebel pilots while flying starfighters."}, {"tag": "p", "text": "They came in several colors, including orange, green, and beige. The flight suits had a winter vest such as the ones worn on Hoth. They wore a flak vest with a life support box on top. They also wore a helmet which included an orange visor with a computer projection for targeting; the helmet was often decorated with squadron markings and the pilot's personal designs.[source?]"}, {"tag": "p", "text": "Gear in the flight suit included thermal gloves, a flak vest, controls for the suit's systems, flares, stow pockets, an emergency transmitter, insulated boots, a comlink, and protective eye lenses. It also contained data cylinders and safe passage documents.[source?]"}, {"tag": "p", "text": "The flight suit included digital technology which could be customized to a particular starfighter; this increased interface efficiency between a craft and a pilot newly assigned to it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rebel flight suits (base layers) were made by Jay Brand Racewear - who are now known as Jays Racewear.\nThe X-wing suit's telltale orange color was chosen to be reminiscent of the \"international orange\" U.S. Navy flight suits used from 1957 to 1969. The flight helmet was based on an experimental helmet the military didn't use. Among the items added to this base were pistol flares around the knee reminiscent of those worn by the Luftwaffe, and webbing that originally belonged to parachute rigs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}