{"url": "Rebel_pilot/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic organizations"], "nodes": [{"tag": "h1", "text": "Rebel pilot"}, {"tag": "p", "text": "Rebel pilots flew starfighters, light freighters, and atmospheric repulsorlift vehicles for the Alliance Starfighter Corps of the Alliance to Restore the Republic during the Galactic Civil War. Like the rest of the Alliance Military (and unlike the Imperial Navy), they came from a wide variety of species, planets, and backgrounds. Some were defectors trained at one of the Imperial Academies, while others were former scouts, smugglers, pirates, or independent traders, or bush pilots from the Outer Rim."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The pilots of the Rebel Alliance were the individuals who flew the craft used by the Rebellion against the Galactic Empire. They were part of the struggle since the beginning, when the Corellian Treaty was signed in 2 BBY, giving the dignitary Mon Mothma the role of Chief of State. After Operation Domino failed, pilots and their starfighters became the primary fighting force of the nascent Rebellion. The Alliance Starfighter Corps fell under the command of then-commander Jan Dodonna, who led his forces to victory in several battles, although the Corps retained control of pilots on special assignment with the Alliance Fleet. Most pilots were part of the Rebel Alliance's individual Sector Forces. The Alliance Fleet under the command of Admiral Gial Ackbar was originally given priority until the Fleet took heavy losses at the Battle of Tingel Deepspace Besh, leaving the starfighter pilots as the primary fighting force."}, {"tag": "p", "text": "Rebel pilots also joined with ground assaults to support other military forces and provide fire support using CR-1 blaster cannons. During space battles, pilots boarded enemy starships to conduct sabotage operations alongside marines."}, {"tag": "p", "text": "Rebel pilots had a reputation for bravery, since they were almost always outnumbered when they went into battle. They also had a reputation for skill and success, after such Rebel victories as the Battle of Yavin and the Battle of Endor.[source?]"}, {"tag": "p", "text": "With the victory at the Battle of Endor, the Rebel Alliance became the Alliance of Free Planets, and pilots continued to serve in battles against the Empire and during the Nagai–Tof War.[source?] With the establishment of the New Republic in 4 ABY, the pilots were folded into the Combined Defense Forces of the New Republic."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Training"}, {"tag": "p", "text": "Training fell under the auspices of the Starfighter Command. Veteran pilots flew with rookies to hone their skills. Pilots were also trained using simulators on-board Rebel starships such as the Independence. Pilots sometimes created impromptu training runs through factories such as Salvage Yard. Admiral Ackbar commented that after going through those unsanctioned runs, pilots came out better-skilled. Although not as well trained as Imperial pilots, Rebel pilots were dedicated and resolved, which helped them survive. They were also able to develop nerves of steel and sharp eyes, allowing them to spot enemy contacts at long ranges. To them, fast speeds and the thrill of the chase are alluring, but the best master those elements."}, {"tag": "h3", "text": "Equipment"}, {"tag": "p", "text": "Rebel pilots wore orange, gray, green or red flight suits. They wore a flak vest with a life support box on top. They each also wore a flight helmet which included a visor with a special computer projection for targeting. The helmets were usually decorated with the Alliance Starbird, though some pilots customized them to include symbols of personal significance or emblems of specific squadrons. Their craft's life support systems negated the need for a self-contained helmet such as those used by the Empire's TIE pilots. For ground assaults, pilots carried CR-1 blaster cannons with a backup sidearm, F-187 fusioncutters to provide repairs, and bacta and ammunition dispensers to support infantry units. For space-based sabotage operations, pilots carried sidearms and TB-47 time bombs."}, {"tag": "h2", "text": "Vehicles"}, {"tag": "h3", "text": "Starfighters"}, {"tag": "h3", "text": "Airspeeders"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The helmets worn by Alliance X-wing pilots were made from modified plastic copies of real US Navy APH-6B flight helmets."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}