{"url": "Rebel_combat_speeder", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic repulsorcraft", "Category:Landspeeders", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "Rebel combat speeder"}, {"tag": "p", "text": "The Rebel combat speeder was originally a failed armored speeder made by the SoroSuub Corporation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Several models of combat speeder were used by resource-strapped Rebel sector forces, with one being reminiscent of the earlier V-19 design in both general shape and weapons placement, but had an enclosed crew space, military-grade armor, and powerful rocket launchers in addition to its laser cannons.."}, {"tag": "p", "text": "Two other models would also be used by the Rebellion in the same role; the lighter model was armed with a single centerline laser cannon with the engines extending from the rear on struts as opposed to being flush with the hull, while the heavier model featured three tail engines, thicker armor, and more powerful cannons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The design was won by the Rebel Alliance during a late-night game of sabacc, where a SoroSuub designer was forced to hand over the plans after gambling away everything else of value. The Rebellion's officers found a use for the speeder in raids and against enemy vehicles. The speeder was also effective against infantry. They were used by the New Republic as late as the Liberation of Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rebel combat speeder would be replaced by the AAC-1 speeder tank in Star Wars: Battlefront II, although that vehicle shared the exact same backstory as this one. If taken at face value, that would either mean that one designer lost two designs during a gambling spree, or that two different SoroSuub designs were lost due to multiple reckless employees. Additionally, the image of the vehicle from the Star Wars: Battlefront official website differs from the in-game model."}, {"tag": "p", "text": "This was also the Rebel's Strike Mech and Heavy Strike Mech unit in Star Wars: Galactic Battlegrounds, though the models seen in that game differ in appearance from the one in Battlefront."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}