{"url": "Rebel_outpost_(Taul)", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic military bases"], "nodes": [{"tag": "h1", "text": "Rebel outpost  (Taul)"}, {"tag": "p", "text": "An outpost was established on the planet Taul by the Alliance to Restore the Republic to train soldiers for severe battle conditions. It was captured by Imperial forces in 3 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A small outpost established by the Alliance to Restore the Republic was located on the planet Taul in the Gunthar system of the Kriz sector of the Outer Rim Territories The outpost was located on top of a cliff, which had only one land approach and three sides that had shear drops. The base consisted of a command center, and a generator supplied power to two ground based anti-orbital ion cannons. A defense grid of mines and traps surround the base. Twelve starships were stationed at the base for evacuation purposes."}, {"tag": "h2", "text": "Occupants"}, {"tag": "p", "text": "The outpost was fully crewed by a command staff, and had a large number of Alliance troops on station either assigned to the base or in training. Commander Krendan, a Wookiee, was assigned to the outpost, as was the gambler Maidtha Fait and the quixotic Jedi Warl Thimbus."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Alliance to Restore the Republic established the outpost on Taul to train their soldiers for severe battle conditions. Once the base was constructed, it was found that the ever-present fine mist in the atmosphere was acidic in nature. While not harmful to organics, it caused mechanical problems for technological devices. The problem actually served to assist in the outpost's training function; due to the mist, the troops training on Taul were taught to be less dependent on droids and weapons were required to be disassembled and cleaned daily."}, {"tag": "p", "text": "In 3 ABY, the Galactic Empire deployed a large number of probe droids in an attempt to discover the Rebel command base. One probe droid visited Taul, and the Empire lost contact with the droid, prompting them to send the Victory-class Star Destroyer Dominator to investigate. Upon arrival, the Dominator began invading the planet. Due to the swampy conditions on the planet, the Imperials deployed attack droids, battle skiffs, Zero-G assault stormtroopers, and dozens of troops. The Alliance defenders were smaller in number, but were better equipped and had the advantage of knowing the terrain."}, {"tag": "p", "text": "The battle raged for most of the day as the outpost was evacuated. Eventually, the base fell to the Imperial force, but not before several transports had fled the system with the Dominator in pursuit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}