{"url": "Rebellion_Era_Campaign_Guide", "categories": ["Category:Real-world articles", "Category:Wizards of the Coast sourcebooks"], "nodes": [{"tag": "h1", "text": "Rebellion Era Campaign Guide"}, {"tag": "p", "text": "The Rebellion Era Campaign Guide is a Wizards of the Coast supplement of the Star Wars Roleplaying Game Saga Edition, released in July 2009."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Rebellion Era Campaign Guide brings the Star Wars Saga Edition rules to the time when tyranny and oppression mark the reign of the Galactic Empire, threatening to extinguish the last flames of freedom. In this dark time emerges an alliance of rebellious heroes intent on overthrowing the Emperor and restoring the glory of the Old Republic."}, {"tag": "p", "text": "This book covers the classic Star Wars films: A New Hope, The Empire Strikes Back, and Return of the Jedi. It also includes material from the Expanded Universe, as featured in novels and comic books. For players, it provides new characters options for Rebel and fringe heroes. For Gamemasters, it offers adventure hooks, campaign seeds, and ready-to-use villains, creatures, droids, and vehicles."}, {"tag": "h2", "text": "Back Cover Summary"}, {"tag": "p", "text": "\"This is our most desperate hour.\""}, {"tag": "p", "text": "It is a dark time for the galaxy. The Empire is in complete control and the last of the Jedi are nothing but a faint memory. Yet as the Emperor tightens his grip on the galaxy, the Rebel Alliance grows stronger, drawing more systems to its cause. The conflict between the Rebels and the Empire is at the center of the Rebellion era, and now your heroes have the chance to make their mark on the Galactic Civil War like never before."}, {"tag": "p", "text": "THE REBELLION ERA CAMPAIGN GUIDE PRESENTS A VARIETY OF OPTIONS FOR BOTH PLAYERS AND GAMEMASTERS, INCLUDING:"}, {"tag": "p", "text": "*New talents, feats and prestige classes for heroes in the Rebellion era."}, {"tag": "p", "text": "*An all-new backgrounds system."}, {"tag": "p", "text": "*A detailed description of the Rebel Alliance."}, {"tag": "p", "text": "*New threats and enemies for use in Rebellion era adventures."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}