{"url": "Recapture_of_Vader%27s_starship", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Events during the Imperial Era", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Recapture of Vader's starship"}, {"tag": "p", "text": "During the early stages of the Galactic Empire's reign, the Sith apprentice Darth Vader recaptured his new starship on a desert world in the galaxy's Mid Rim after it was stolen by a group of slavers and held at their base."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the celebration of the eradication of the Jedi Order, Dark Lord of the Sith Darth Sidious transported his Sith apprentice, Darth Vader, to a desert world in the Mid Rim in a Theta-class T-2c shuttle. When they landed, Vader asked why they had come to the world, and Sidious replied that he had high hopes for what Vader and himself could accomplish with the Galactic Empire and informed Vader that he first needed a lightsaber, calling back to their conversation at the celebration event."}, {"tag": "p", "text": "Sidious gave Vader the quest of finding a living Jedi so Vader had someone to take a kyber crystal from, and noted that it would be a daunting task given how they had eliminated the Jedi Order. Still, Sidious proclaimed that he had great faith in Vader's resourcefulness and capability. As Vader disembarked, Sidious stated that he had left a ship for Vader's use, but it appeared that it had been stolen by a band of outlaws, and stated that the galaxy cried out for order. Vader left and sought to recapture his starship."}, {"tag": "h2", "text": "Recapturing the starship"}, {"tag": "p", "text": "After switching his lenses from standard vision, Vader trekked through the desert and discovered a slaver base. While two slavers were conversating on their luck in finding the starship, and how wealthy they were going to be, Vader killed a slaver by Force pushing a slab of the perimeter wall onto them. When the others turned to Vader, he exclaimed that the vessel was his and proceeded to kill the slavers as they fired upon him. He managed to kill several by launching small pieces of metal at them, which pierce through their bodies, although Vader was subsequently shot. As a Pau'an celebrating his shot, Vader used Force push to propel them down a nearby cliff. Vader then used the bodies of two dead slavers as cover while the others continued to fire at him, and then launched one of the bodies at a slaver, killing him. The remaining slaver ceased, and exclaimed on why Vader was there and what he wanted. Vader proceeded to kill him by using Force choke, while stating that he only wanted that."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After Vader reclaimed his starship, he made his way to Brighthome, a Jedi outpost in the Mid Rim that was occupied by a force of clone stormtroopers to begin his quest. After a pilot contacted Vader and stated that he was in a restricted area, Vader ignored the warnings and continued, despite being informed by his droid that he had the authorization codes for the space station. After Vader destroyed the four ARC-170 starfighters surrounding the station, Vader boarded and killed the troopers inside, except for two who were able to escape. Vader then accessed the station's databank in search of a possible living Jedi, one who had taken the Barash Vow."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The recapture of Vader's starship was first depicted in the canon 2017 comic, Darth Vader: Dark Lord of the Sith 1, written by Charles Soule and penciled by Giuseppe Camuncoli."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}