{"url": "Rebirth", "categories": ["Category:Legends articles", "Category:Imperial Department of Military Research products", "Category:Starships of the Empire Reborn", "Category:Starships of the Galactic Empire", "Category:Worldcraft"], "nodes": [{"tag": "h1", "text": "Rebirth"}, {"tag": "p", "text": "The Rebirth was the personal worldcraft of Imperial Procurator of Justice Hethrir. Emperor Palpatine presented it to him as a reward for the cleansing of Firrerre."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the Battle of Endor in 4 ABY, Hethrir constructed a compound where he established a so-called \"school\" for Force-sensitive children he had kidnapped or captured. Those with potential were ensconced on Rebirth for indoctrination."}, {"tag": "p", "text": "Hethrir, with an ability to dampen others' Force abilities, would often prevent Non-Humans from demonstrating any Force-ability, consigning them to be sold as slaves. This was done in line with the Humanocentric policies of the Galactic Empire. Those Humans with Force-potential moved up the ranks of the Helpers, Proctors and Empire Youth."}, {"tag": "p", "text": "Many of Hethrir's trainees were taken to the temple of the Waru on Crseih Station to be \"purified.\" Waru was posing there as a healer, but occasionally killed beings brought for healing, sucking in their strength. Many of the Empire Youth that survived the purification were sent out to infiltrate the New Republic, working covertly to undermine it."}, {"tag": "p", "text": "In 14 ABY, Hethrir arranged for his Proctors to kidnap the New Republic Chief of State Leia Organa Solo's three children Jaina, Jacen and Anakin while she was on an official state visit on Munto Codru in the Outer Rim. Temporarily blocking Leia's ability to sense her children, and using a pressure bomb to incapacitate the children's minders—the Wookiee Chewbacca and a local page—Anakin, Jacen, and Jaina Solo as well as the Munto Codru chamberlain's wyrwulf were captured and whisked away by skiff. They were shipped off planet to Hethrir's worldcraft, while Leia was still being advised to wait for a ransom request."}, {"tag": "p", "text": "On his worldcraft, Hethrir told the children their parents were dead and that he would look after them from now on as their hold-father. The children were suspicious, however, and proved remarkably resistant to the \"programming\" at the school. Hethrir assigned his own son, Tigris, to look after Anakin, and put the twins in with the rest of the imprisoned children, including a Chironian girl, Lusa. The kidnapped children caused much trouble at the station, using the Force to harass the young Proctors."}, {"tag": "p", "text": "Though held in separate cells, the Solo twins managed to escape their cells, taking a number of the other children with them. With the aid of a female sand dragon that Jacen communicated with, they escaped the entire compound and hid from the Proctors and Helpers in a swamp. Just as all this was happening, Leia along with Hethrir's former mate Rillao and Chewbacca arrived on their transport Alderaan and rescued the children while detaining the ill-prepared Proctors with the help of the sand dragon."}, {"tag": "p", "text": "However, they were too late to rescue Anakin though, for Hethrir had already departed for Crseih Station with a phalanx of Proctors, intending to relaunch the Empire Reborn and sacrifice Anakin in the temple of the Waru. Following close on his heels, the two mothers left the children in the care of Chewbacca, R2-D2 and the worldcraft's Veubg cook Grake."}, {"tag": "p", "text": "R2-D2 also programmed Hethrir's worldcraft to make a jump into the Codru system where it was captured by the New Republic and local Munto Codru forces. The worldcraft was then sent to a classified safe system where a team of New Republic scientists (including Bevel Lemelisk) was sent to examine the captured worldcraft of Hethrir in detail, researching to learn more about techniques for engineering and energy management. Some of this research led to technological advances behind the New Class starships of the New Republic Space Navy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}