{"url": "Rebuild_the_Death_Star", "categories": ["Category:Canon articles", "Category:Imperial propaganda", "Category:Paintings and posters"], "nodes": [{"tag": "h1", "text": "Rebuild the Death Star"}, {"tag": "p", "text": "Rebuild the Death Star was a propaganda poster illustrated by an unknown artist. The poster is framed from within a hangar of an Imperial vessel in space, with a squad of stormtroopers, E-11 blaster rifles in hand, in the foreground of the poster on the left side. On the poster's right side and slightly further in the background is an MSE-6 series repair droid rolling along the hangar's floor, as well as a human male Imperial officer and several TIE fighter pilots standing behind him. Outside of the hangar are two TIE/ln space superiority starfighters and the partially-complete DS-2 Death Star II Mobile Battle Station, in orbit over a blue celestial body. At the top of the poster written in High Galactic are the words \"REBUILD THE DEATH STAR,\" and at the bottom of the poster, also in High Galactic, is \"THE EMPIRE NEEDS YOU.\""}, {"tag": "p", "text": "Rebuild the Death Star was, apparently, unauthorized, and a copy of the poster was found by Bothan spies aboard an Imperial materials transport headed to the second Death Star, after the battle station's destruction at the hands of the Rebel Alliance during the Battle of Endor. Rather than be seen as a display of the Imperial Military's power and technological prowess, the first Death Star instead came to be viewed as a symbol of Imperial failures and missteps, making messaging about the second station such as Rebuild the Death Star quite rare. It was speculated that this poster was an attempt to stir up some patriotism concerning a project plagued with controversy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rebuild the Death Star was illustrated by Cliff Chiang and appeared in Star Wars Propaganda: A History of Persuasive Art in the Galaxy, written by Pablo Hidalgo and released on October 25, 2016. The illustration was originally created for 2010 Topps Star Wars Galaxy Series 5, a 2010 series of Legends trading cards by Topps."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}