{"url": "Rebellion_on_Umbara", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Wookieepedia Good article nominations", "Category:Battles in the Ghost Nebula", "Category:Conflicts involving the Galactic Empire", "Category:Rebellions and uprisings"], "nodes": [{"tag": "h1", "text": "Rebellion on Umbara"}, {"tag": "p", "text": "At some point between 19 BBY and 18 BBY, a rebellion against the Galactic Empire occurred on the Expansion Region planet Umbara during the early months of the Imperial Era. The Imperial Military was deployed to put down the resistance as part of a wider anti-insurgent campaign, with Lieutenant Commander Orson Callan Krennic framing it as a pacification operation."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Clone Wars, a galactic conflict fought between the Confederacy of Independent Systems and the Galactic Republic, the Expansion Region planet of Umbara left the Republic after the assassination of Senator Mee Deechi, resulting in the world becoming a major Confederate stronghold. Thus, the 501st Legion and 7th Sky Corps of the Grand Army of the Republic were deployed to invade and take back Umbara in 20 BBY. Despite heavy resistance, the Republic overwhelmed the Umbaran Militia's impressive defense. The battle was a devastating defeat for the Umbaran government, with even their capital falling to the Republic Army."}, {"tag": "h2", "text": "The rebellion"}, {"tag": "p", "text": "In 19 BBY, concurrent to the end of the Clone Wars, the Republic was transitioned into the Galactic Empire by Supreme Chancellor Sheev Palpatine. At some point between 19 BBY and 18 BBY, a resistance movement emerged on Umbara, seeking to continue the fight against the Empire despite the defeat of the Confederacy."}, {"tag": "p", "text": "During the months following the proclamation of Empire, the newly-formed Imperial Military was deployed to combat various pockets of resistance left over from the Clone Wars. One of the ensuing battlefronts was Umbara, with the rebel movement putting up a heavy resistance. When speaking to researchers Lyra Erso and Galen Walton Erso, Lieutenant Commander Orson Callan Krennic claimed the Empire had simply launched a series of pacification exercises to quell the rebellions on Umbara and elsewhere, stating the Imperial response would bring about peace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Eventually, Umbara became part of the Empire, further surrendering its remaining autonomy due to the massive debt it owed to the Imperial regime. Imperial Ensign Eli N. Vanto believed it would be unlikely for the Umbarans to risk another devastating defeat, as had occurred during the Clone Wars, by resisting. Even when the Umbara system was the site of fighting against the Empire, the battle was instigated by human insurgent leader Nevil Cygni instead of the Umbarans; the rebel wanted to ensure the Empire would take over Umbara's mining industry, knowing it would be easier to bribe Imperial inspectors than Umbaran ones."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rebellion on Umbara was mentioned in the 2016 novel Catalyst: A Rogue One Novel by James Luceno."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}