{"url": "Rebuilding_the_Resistance", "categories": ["Category:Real-world articles", "Category:Star Wars Resistance episodes"], "nodes": [{"tag": "h1", "text": "Rebuilding the Resistance"}, {"tag": "p", "text": "\"Rebuilding the Resistance\" is the seventeenth episode of the second season of Star Wars Resistance, also serving as its penultimate episode. It premiered on television January 19, 2020 on Disney Channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Venisa Doza's fighter squadron and the Aces launch a dangerous mission to escort Resistance recruits to safety."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "A family reunion"}, {"tag": "p", "text": "The episode opens with four Resistance X-wing starfighters from Venisa Doza's Jade Squadron exiting hyperspace and flying to the Colossus. Kazuda Xiono, Neeku Vozo and Jarek Yeager watch as the X-wings land in Yeager's hangar. Xiono asks what are they doing here. Yeager says that he doesn't know but thinks that it means trouble."}, {"tag": "p", "text": "The first pilot to climb out of her ship is Venisa Doza, the mother of Torra Doza and wife of Captain Imanuel Doza. She asks Yeager if he doesn't mind them parking here. Yeager says he can make some room for Venisa. As Bucket rolls out, Xiono asks if that is Venisa Doza. Torra Doza runs up to her mom and hugs her. Captain Imanuel Doza arrives and says that he is glad that Venisa arrived safely. Venisa teases him on whether he had any doubt and Captain Doza smiles."}, {"tag": "p", "text": "Yeager quips that Venisa's X-wing has seen better days. Yeager introduces Kazuda Xiono as their newest Ace pilot. Xiono responds that Torra has told him a lot of good things about her. Xiono remarks that he likes Venisa's ship because it has character. Just then, part of the starfighter falls down, narrowly missing her astromech droid Torch. Torch has a merry reunion with Bucket."}, {"tag": "p", "text": "Torra remarks that Torch seems happy to be home while Venisa says he is not the only one before kissing her daughter. She tells Torra that she and her fellow pilots are not here for a social visit. Captain Doza explains that they are helping Venisa's squadron for the Resistance."}, {"tag": "p", "text": "Later, Kaz and CB-23 inspect the carbon scarring on Jade Squadron's X-wings, remarking that the ships must have been in some crazy battles. A human man named Hugh Sion jokingly tells him not to drool on his ship. Kaz is delighted to see that his former New Republic squadron mate Hugh is now a pilot for the Resistance. Hugh is accompanied by the Duros agent Norath Kev. When Hugh asks about Kaz's encounter with Major Elrik Vonreg, Xiono mentions that he took care of him."}, {"tag": "h3", "text": "A call for help"}, {"tag": "p", "text": "Norath says that Poe Dameron has a different account but Kaz asks the pilots what brings them here. Norath says that the situation is quite dire. They have been searching the galaxy for anyone willing to fight against the First Order but says that some systems would rather surrender than to go to war. He explains that Commander Doza needs help. When Kaz asks where is the rest of the squadron, Hugh tells him that they are what is left of Venisa's squadron."}, {"tag": "p", "text": "Meanwhile, Captain Doza meets with Commander Doza, who has briefed her husband about a Resistance mission to evacuate recruits from Dantooine, which is now under First Order control. Venisa confirms this is the case and says that since the First Order has cracked their coordinates, she would like to bring them to the Colossus temporarily until they can find a new location. Captain Doza allows the recruits to stay temporarily."}, {"tag": "p", "text": "Venisa is surprised that her husband is not arguing with her. Captain Doza explains that they tried running and hiding and that clearly did not work. He agrees to spare three Aces for the mission but says that he needs the rest for Defense. Just then, they hear a thud on the turbolift. Kaz and Torra enter Doza's office and volunteer for the mission. Venisa is pleased that they have two volunteers."}, {"tag": "p", "text": "Doza is concerned about their daughter's wellbeing. Torra is stubborn and insists she is ready for the mission. Venisa reassures her husband that their daughter is among the best. She has one more spot to fill and says that she knows the pilot."}, {"tag": "h3", "text": "Mission briefing and departure"}, {"tag": "p", "text": "Later, a cheerful Hype Fazon meets up with Venisa and her pilots. Venisa asks if he is up to the challenge and Hype boasts about his \"superior\" flying skills, rankling both Hugh and Norath. When Hugh asks what is with this guy, Xiono asks how much time do we have."}, {"tag": "p", "text": "Venisa gets Torch to display a hologram of the planet Dantooine. She explains that the First Order has imposed a blockade on the planet, cutting off all long range communications. Three shuttles carrying a handful of Resistance recruits are trying to escape. She explains that their mission is to escort the shuttles safely back to the Colossus without the First Order catching on. Venisa hopes to avoid any engagements but says there are no guarantees."}, {"tag": "p", "text": "She reminds them that the recruits are like them. Some have lost everything while others want to protect the ones they love. She says that to protect these recruits is to protect their future. Venisa ends by saying that they are the spark and that they are in this together. She says that she is honored to fly with them and wishes them good luck."}, {"tag": "p", "text": "As Torch leads the team down the corridor, Yeager remarks that Venisa has not lost her touch for giving rousing speeches. Venisa tells Yeager that she saw Tamara Ryvora. When Yeager asks how is she, Venisa says that Tam was doing fine. When Yeager presses her for more information, Venisa tells him that Tam is conflicted but that she needs to sort things out on her own. She tells him to give Tam time."}, {"tag": "p", "text": "In the hangar, Torra apologizes to Torch that Bucket cannot come with them because the latter is needed here. Commander Doza orders Jade Squadron to move out. Torra tells her mother than she went through the pre-flight checks with Torch and that Venisa is good to go. Venisa advises Torra to stay on her wing. Torra dons her helmet and the Resistance strike team climb into their fighters and disembark. After they have left, Yeager reassures Doza that Venisa and Torra will be find together because the mother and daughter are unstoppable. Captain Doza agrees but says it still doesn't make it any easier."}, {"tag": "h3", "text": "Eliminating the TIE patrol"}, {"tag": "p", "text": "Jade Squadron including the Fireball, Blue Ace and Green Ace exit hyperspace in the Dantooine system. Venisa tells Torch to keep an eye out for unwanted company. Torra asks her wingmates if they spot anything on their scanners. Kaz says nothing yet but Hype is preoccupied with gossiping with Hugh, having learnt that Kaz was almost expelled from the academy. Hugh admits that Kaz was expelled a couple of times but Kaz interjects that they were just misunderstandings. Hype offers to buy Kaz a drink at Aunt Z's Tavern but Kaz responds that he and Norath are trying to concentrate. Norath doesn't mind because he regards this as the best entertainment he has had in weeks."}, {"tag": "p", "text": "Venisa reminds them to focus on the mission as they approach Dantooine. Norath reports multiple contacts at 104. Norra thinks it is a scouting squadron of TIE fighters and tells Torch to jam their comms when they come in range. As the TIEs converge on Jade Squadron, Venisa orders them to break into pairs new and tells Torra to accompany her."}, {"tag": "p", "text": "At Venisa's prompting, Torra does the Doza Dive and they lead the TIEs on a chase. Torra shoots down the TIE pursuing her mother and Venisa returns the favor by shooting down the TIE pursuing her daughter's ship Blue Ace. Venisa compliments her daughter, who says that she learned from the best."}, {"tag": "p", "text": "Meanwhile, Norath and Hugh take out two TIE fighters. When Venisa checks on Kaz and Hype, Kaz replies that they only have a couple of TIEs left. Kaz pursues one TIE fighter in the Fireball. The enemy TIE pilot manages to call for back up before Kaz shoots him down. Hype is being pursued by the remaining TIE but can't shake him off."}, {"tag": "p", "text": "Kaz tells him to keep the enemy fight on his \"six\" and vows to shake it off. When Hype asks what is the hold up, Kaz tells him to bank down on his count. Hype complies and Kaz takes out the last remaining TIE. Hype cheers over the coming and says that a pilot needs a wingmate watching their back. Venisa thanks Jade Squadron for their work and contacts the Resistance shuttles, which depart a spaceport."}, {"tag": "h3", "text": "Hunting the Resistance"}, {"tag": "p", "text": "Meanwhile, aboard Commander Pyre's Star Destroyer, First Order Security Bureau Agent Tierny informs Commander Pyre and Lieutenant Galek that they have received reports of Resistance activity on Dantooine and that shuttles carrying Resistance recruits are trying to leave the planet. Second Squadron Commander Tamara Ryvora is also present. Pyre says that they have lost contact with the patrolling TIE squadron and orders Lieutenant Galek to set a course for Dantooine. He adds that her squad is being activated. Pyre wants the convoy to be found and their ships destroyed."}, {"tag": "p", "text": "When Ryvora asks if those transport shuttles are unarmed, Galek asks if that is a problem. Ryvora says no and the lieutenant tells DT-533 to keep her ears open and her mouth shut. Galek dons her TIE fighter pilot helmet as the Star Destroyers enters into lightspeed."}, {"tag": "h3", "text": "A difficult place"}, {"tag": "p", "text": "Ryvora is later summoned to a meeting with Agent Tierny inside her office. Tierny asks Tamara if everything is alright and notices that she is agitated. Ryvora denies this is the case and claims that things are great because she is in command of her squadron. Tierny shows Tamara's comlink and asks if she recognizes it. Tamara recognizes it as her comlink from the Colossus."}, {"tag": "p", "text": "Tierny says that she initially doubted Ryovra's loyalty until she turned the comlink over to her. She says that Tamara was wise not to be deceived by Xiono's \"lies\" and says \"that those who betray us.\" Ryvora finishes the line by saying \"become our enemy.\""}, {"tag": "p", "text": "Tierny says that she wasn't born into the First Order but spent her early years under the New Republic scraping by to survive. She opens a drawer and puts back the comlink. Tierny says that she knew that she was meant for more and says that she brought Ryvora here because she saw the same potential in her. Tierny says that Ryvora has surpassed all her expectations. Tamara thanks the First Order Security Bureau agent. Tierny warns Ryvora to keep surpassing them and not to let her down. Over the intercom, Galek tells all squadrons to prepare for launch. Tierny dismisses Ryvora."}, {"tag": "h3", "text": "Rendezvous with the shuttles"}, {"tag": "p", "text": "Jade Squadron flies to meet the Resistance transports in the upper atmosphere of Dantooine. Venisa compliments her daughter Torra for holding herself well against those TIE fighters, saying that she has come a long way since her first lesson. Torch reminds them that Torra ejected him. Venisa responds that Torra was a kid and did that by mistake. Torra admits that she did that on purpose because Torch kept being a backseat pilot."}, {"tag": "p", "text": "Kaz spots the three Resistance shuttles up ahead. Venisa contacts the shuttle captain, who confirms that she sees Jade Leader. Venisa tells them to stay close and informs Jade Squadron that they are ready for convoy formation. She tells Torch to transmit the coordinates because they are getting out of here. As Jade Squadron enters into convoy formation, the shuttle captain confirms that they have received the coordinates and are ready to go. Before they can return to the Colossus, Torch sights approaching First Order forces. Venisa delays that order and warns that they have company."}, {"tag": "h3", "text": "The thick of battle"}, {"tag": "p", "text": "Pyre's Star Destroyer arrives and disgorges several TIE fighters. Kaz reports that there are too many TIEs for them to do a jump. Venisa responds that they will thin them out. She orders Kaz and Hugh to come with her and tasks Torra, Norath and Hype with protecting the shuttles. Torra and the others fly into formation over the shuttles."}, {"tag": "p", "text": "Venisa tells Kaz and Hugh that they are the only line of defense and to keep the TIEs herded. She and Torch will hit them head on while Kaz and Hugh are tasked with flanking the TIEs. Kaz and Hugh receive her orders."}, {"tag": "p", "text": "Venisa flies her X-wing toward three TIE fighters and takes them out with missiles. Kaz is impressed but narrowly collided with Tam's fighter. Tam is surprised to see her former friend flying the Fireball. Meanwhile, Jace Rucklin receives orders from Lieutenant Galek to destroy the shuttles. Rucklin remarks contemptuously that the Aces are colluding with the Resistance and says that his day got a whole lot better."}, {"tag": "p", "text": "Tam struggles with having to shoot down Kaz and the Fireball, remarking that he shouldn't be here. She aims her targeting computer at the Fireball but Hugh spots her and shoots at the back of her fighter, causing it to spin out of control. Kaz thanks Hugh for watching his back."}, {"tag": "h3", "text": "Losses on both sides"}, {"tag": "p", "text": "As they ascend higher, Venisa tells Jade Squadron that as soon as they escort the shuttles to escape altitude, they jump into hyperspace. As Venisa shoots down another TIE, Tam struggles to pilot her stricken ship. Hype shoots down another TIE but Shuttle two is hit in the rear, damaging the hyperdrive. Torra takes out the pursuing fighter and asks the shuttle's captain his situation. The captain reports that his ship's hyperdrive has been hit and that they have to jump without his ship."}, {"tag": "p", "text": "Torra says that they are not leaving him behind. She tells him to do his best to get it back online while they buy him time. Jade Squadron takes out half of Ryvora's TIE squadron. Ryvora contacts Lieutenant Galek and suggests that they withdraw but her commander insists on finishing this mission."}, {"tag": "p", "text": "As the dogfight continues, Xiono is pursued by Lieutenant Galek, who attempts to finish him off. However, her TIE is ambushed and destroyed by Venisa's X-wing. Xiono thanks Venisa for saving him."}, {"tag": "p", "text": "Meanwhile, Rucklin informs Tamara over the intercom that Lieutenant Galek is down and tells her that she is in charge. Rucklin asks what they should do. Rucklin spots an opening in the shuttle convoy and says he is going for it. Tam tries to tell him not to. Tam manages to restart her TIE and returns to the dogfight."}, {"tag": "p", "text": "Torra asks the shuttle pilot for an update and he says that they are almost finished. Kaz tells Torra that they need cover on Shuttle three because they have one TIE inbound. Rucklin pursues the stricken Shuttle two. Torra dispatches Norath but he is unable to stop Rucklin from shooting down the stricken shuttle's left engine, causing it to plummet to Dantooine's surface. Kaz screams in despair while Rucklin shouts with triumph."}, {"tag": "p", "text": "Venisa orders the remaining shuttles and fighters to jump into hyperspace. The convoy escapes but a devastated Kaz stays behind on the Fireball. Kaz is distraught by the loss of innocent lives. Regaining his composure, he jumps into hyperspace. Meanwhile, Tamara orders the surviving fighters to return to base."}, {"tag": "h3", "text": "A hollow victory"}, {"tag": "p", "text": "Aboard the Star Destroyer, Agent Tierny meets with Tamara, whom she addresses as DT-533. Even though the mission was a failure, she reassures Tam that one of the Resistance shuttles was successfully destroyed under her command. Tam is upset. Tierny understands but says that Lieutenant Galek died in service to the First Order and was a fine squadron commander. She says that her failure has created opportunities for others. With one less Resistance cell to worry about, she tells Tamara that she is now promoted to Squadron Leader."}, {"tag": "p", "text": "Tamara thanks Tierny, who departs. Rucklin however is jealous and believes that he deserves to be Squadron Leader because he destroyed the Resistance shuttle. Tam says that she did not ask for this but Rucklin grumbles that she got it anyway. He grumbles that it is funny that it always works out for her."}, {"tag": "h3", "text": "Overcoming grief and despair"}, {"tag": "p", "text": "Back at the Colossus, the Resistance shuttles land in the hangar. A distraught Kaz tells Torra and Hype that the Resistance was counting on them. Kaz and Torra think they have failed and blame themselves for not stopping the TIE. Hype laments that he was too cocky and says that he should have been watching the shuttle."}, {"tag": "p", "text": "Venisa address the group with Yeager and Captain Doza present. She tells them that no matter how hard they may try to save everyone, there is always going to be loss in war. She reassures them that they only truly fail when they lose hope. Yeager adds that those recruits made it out because of them and that counts as a victory. Xiono remarks that it still doesn't make it easier knowing what the First Order is capable of. He wonders if Tam was in one of those TIEs."}, {"tag": "p", "text": "Venisa says that they cannot assume that and says that they can only hope that she and anyone else in that position recognizes what the First Order truly is. Captain Doza says that giving up on people is the easy way out and that they are better than that. Torra agrees that the adults are right and suggests they turn their attention to giving their guests a proper Colossus welcome."}, {"tag": "h3", "text": "Joining the Resistance"}, {"tag": "p", "text": "Captain Doza thanks Venisa for her skill with words. Venisa replies that they are more effective on some than others. She adds that the First Order may outnumber them but that they are resilient. Venisa accepts that the mission was a \"big ask\" but thanks him for his help. She promises to have the recruits off the Colossus within a few days."}, {"tag": "p", "text": "Doza however decides to allow them and Jade Squadron to stay. When Venisa asks what about the people of the Colossus having a say in the matter, Doza replies that he cannot force people to join them but this is his ship. He promises to commit the Colossus' resources to the Resistance, saying that he is done running from this fight. Venisa is pleased and says that it is good to have him back. She and Doza go to welcome the new Resistance recruits."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}