{"url": "Reborn_Master", "categories": ["Category:Legends articles", "Category:Empire Reborn members", "Category:Sith cults"], "nodes": [{"tag": "h1", "text": "Reborn Master"}, {"tag": "p", "text": "The Reborn Masters were originally members of Desann's Reborn force, but after its downfall the survivors went on to serve Tavion Axmis. They were amongst the highest ranking members of both the original Reborn group and Tavion's Disciples of Ragnos organization. Clad in heavy purple body armor they wielded long lightsabers similar to that used by their former master Desann. While most of the masters used single lightsabers, several had been noted employing dual sabers and saberstaffs."}, {"tag": "p", "text": "Reborn Masters were extremely skilled dark side Force-users and excellent lightsaber duelists, able to overcome an average Jedi. They could also use light side Force powers such as Force heal, Force protection and Force absorb. To complete their abilities, Reborn Masters also utilized Dun Möch in combat to weaken their opponents' resolve."}, {"tag": "p", "text": "Unlike the standard cultists, masters rarely participated in cult missions unless they were of the highest importance. Two masters were dispatched to Taspir III to ensure that the Jedi would not rescue Rosh Penin, whom the cult were holding captive after Penin's attempt to flee them. Jaden Korr engaged and defeated both masters after encountering them as he searched for Rosh. Two more masters were also present during the Battle of Korriban. They stalled the Jedi in the Valley of the Dark Lords until they were engaged and defeated by Korr. Apart from these notable ventures, the Reborn Masters remained a very quiet and secretive part of the cult."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Jedi Knight: Jedi Academy game, during the Battle of Korriban, the player comes across a staff-wielding Reborn Master who is able to best three Jedi Knights with ease. This, however, is a scripted event and not representative for this fighter's actual in-game skills: As soon as the player activates a certain trigger, the three Jedi's hitpoints drop from 200 to 1, thereby allowing their opponent to finish them off with a single, insignificant hit, whereas the Reborn Master remains in \"Undying-mode\" until attacked by Jaden himself."}, {"tag": "h2", "text": "Appearances"}]}