{"url": "Recusant-class_light_destroyer/Legends", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Alliance to Restore the Republic starship classes", "Category:Commerce Guild", "Category:Confederacy of Independent Systems starship classes", "Category:CSA starship classes", "Category:Destroyer classes", "Category:Mon Calamari starship classes", "Category:Recusant-class light destroyers"], "nodes": [{"tag": "h1", "text": "Recusant-class light destroyer"}, {"tag": "p", "text": "The Recusant-class light destroyer, also known as the Recusant-class support destroyer, commonly referred to as the Commerce Guild destroyer, and additionally known as the Separatist destroyer, were a class of starship used by the CIS Navy during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "The Recusant-class, like the vast majority of the Confederacy's warships, was largely controlled by automated droid brain technology. This proved to be a flaw, however, for the droid brain had a lower reaction time, which caused it to run into other ships often. However, little crew space was required. This gave the Commerce Guild destroyer a sinister, skeletal appearance."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "The Recusant-class destroyer was a light CIS warship armed with oversized guns, similar to the Munificent-class star frigate, and carried a heavy turbolaser cannon on its prow."}, {"tag": "p", "text": "Additional weapons consisted of four heavy turbolasers, six heavy turbolaser turrets, five turbolaser cannons, thirty dual laser cannons, twelve dual light laser cannons, and sixty point-defense cannons."}, {"tag": "p", "text": "Should the main shields be destroyed during battle, the interior hull can be vulnerable to severe damage."}, {"tag": "h3", "text": "Propulsion systems"}, {"tag": "p", "text": "The vessel had three isolated thrusters positioned at the stern, remotely connected to the ship's main reactor, which was located inside the main superstructure. While this provided substantial thrust and speed for the ship, the engine segments were susceptible to being severed from sustained fire due to the somewhat thin structure of that area of the ship."}, {"tag": "h3", "text": "Complement"}, {"tag": "p", "text": "The stock Recusant was not equipped with hangars for ground based forces, but carried about 40,000 battle droids for boarding actions. The Recusant-class could also carry droid starfighters for fleet engagements in hollow spaces inside the ship.\nA 2,544 meter-long variant model was shown to have both a built-in hangar on the side of each vessel, as well as a docking clamp to carry one C-9979 landing craft."}, {"tag": "h3", "text": "Bridge tower"}, {"tag": "p", "text": "The Recusant-class's forward command center protruded from the forward part of the superstructure, in a manner similar to the Providence-class carrier/destroyer."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Separatist use"}, {"tag": "p", "text": "The Recusant-class was based on technical schematics stolen from the Mon Calamari by Quarren Separatists. It was mass-produced by zealous workers led by Techno Union Foremen, using materials from many Commerce Guild worlds. The Commerce Guild destroyer was manufactured by Hoersch-Kessel Drive, Inc. and Free Dac Volunteers Engineering Corps."}, {"tag": "p", "text": "This class was fielded from early on in the Clone Wars. They were donated to the Separatist cause by hundreds of star sectors eager to defend their independence. During the war, large numbers of this vessel were built, destroyed in battle, and replaced. Recusants were often used to carry out raids on Republic commercial shipping, though prey in large number sometimes proved deadly."}, {"tag": "p", "text": "Commerce Guild destroyers were most effective when deployed in large numbers, like most Confederate military units. Four to six Commerce Guild destroyers could easily defeat a Republic Venator-class or Victory-class Star Destroyer. However, a thousand Recusants were needed to successfully engage a Kuat Drive Yards Mandator II-class Star Dreadnaught. During the height of the Clone Wars, it was unusual to see the class deployed in groups of less than four ships. A major flaw of the class was its stubbornness in battle. A Recusant would continue to attack a chosen target until it was destroyed or disabled, and ignore other enemy units during this process."}, {"tag": "p", "text": "The Recusant-class destroyers were employed by General Grievous in battles near the Arda system, at Saleucami, and at Kamino. Recusants were used extensively in the Battle of Coruscant, where they engaged similarly large numbers of Venators. One Recusant was seen colliding with a friendly Munificent. They also formed the defense line that protected the CIS flagship Invisible Hand."}, {"tag": "h3", "text": "Later use"}, {"tag": "p", "text": "A derelict Recusant vessel was used by a group of Jedi to allow them to escape from Kashyyyk, during the Imperial subjugation of Kashyyyk a few weeks after the end of the Clone Wars."}, {"tag": "p", "text": "Following the formal end of the Wars, the Recusant-class went on to serve various fleets throughout the galaxy. A half dozen Recusants were employed by the Corporate Sector Authority. At least one vessel was used by the Rebel Alliance in 0 ABY. It was heavily modified to accommodate a larger, organic crew."}, {"tag": "p", "text": "One Recusant was used to make up a secret Jedi retreat in 137 ABY."}, {"tag": "h2", "text": "Known ships"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}