{"url": "Red_Company", "categories": ["Category:Canon articles", "Category:Grand Army of the Republic companies"], "nodes": [{"tag": "h1", "text": "Red Company"}, {"tag": "p", "text": "Red Company was a company of clone scout troopers in the 41st Scout Battalion of the 41st Elite Corps. Shortly prior to the Battle of Kashyyyk, a clone trooper serving as a unit commander ordered that all Red units regroup at a certain point while preparing the beach defenses. Red Company then defended the beachfront during the battle."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Red Company was a scout infantry company in the 41st Scout Battalion of the 41st Elite Corps. As a company within the Grand Army of the Republic, the unit had a standard composition of 144 troopers divided into four platoons and sub-units. Red Company was made up of clone scout troopers in green forest camouflage and utilized DC-15A blaster rifles. Red Company was led by a unit commander, who served under Jedi Generals Luminara Unduli and Yoda."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems following the Battle of Coruscant in 19 BBY, the Jedi High Council decided to dispatch an attack group to the planet Kashyyyk to reinforce the Wookiee Army against a Separatist attack. The 41st Elite Corps assembled at a staging area on Coruscant as equipment and vehicles were loaded onto a Venator-class Star Destroyer, and Yoda arrived to command the Republic force."}, {"tag": "p", "text": "The 41st Elite Corps, including its  subordinate 41st Scout Battalion and its companies, arrived on Kashyyyk and entrenched themselves in Kachirho, the capital beach city of Kashyyyk, reinforcing the Kachirho Wookiee Militia. During the preparation for the upcoming battle, the 41st Scout Battalion divided itself throughout the area, with Red Company being stationed on the beachhead, while another company stationed itself on the large Wroshyr trees. While Red Company was preparing itself, its unit commander shouted orders to the company to move to a certain position due to the chaotic scene, while other members spoke with General Unduli. Eventually, the Battle of Kashyyyk began and the company heroically defended the beachhead against Separatist forces. Once the Separatist attack intensified, members of Red Company took cover while the company on the trees opened fire from above."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Red Company first appeared, albeit unnamed, in the theatrical 2005 Skywalker saga film Star Wars: Episode III Revenge of the Sith. It was identified in the 60th edition of Star Wars Helmet Collection by De Agostini."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}