{"url": "Record_Time", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:New Republic starships", "Category:Smuggler starships", "Category:Transports"], "nodes": [{"tag": "h1", "text": "Record Time"}, {"tag": "p", "text": "The Record Time was an armed troop transport that served with distinction in the New Republic Defense Force during the fall of Coruscant and later the Battle of Borleias during the Yuuzhan Vong War. The ship ferried the initial waves of New Republic ground troops and YVH 1 battle droids to the surface of the planet Borleias in the initial stages of the battle as part of a New Republic effort to retake the planet from the Yuuzhan Vong, but sustained heavy damage in the process."}, {"tag": "p", "text": "Following that engagement, the vessel was later used by entrepreneur Lando Calrissian to insert a team of Wraith Squadron infiltrators and Jedi onto the surface of occupied Coruscant. While performing the mission, the ship was attacked by multiple coralskippers and a Yuuzhan Vong frigate analog. The Record Time ultimately fulfilled its mission, but succumbed to the plasma cannon fire, disintegrating over Coruscant as its crew escaped."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Record Time was a troop transport that was nearly twice as long as the GR-75 medium transports once favored by the Rebel Alliance, at 170 meters long, and was composed of two bulbous main segments. The larger segment held the bridge and personnel bays or cargo bays, while the engines were located in the smaller segment. Its bridge had both a transparisteel viewport and a series of holocams that created a panoramic view of the area around the ship to provide information to the crew. The personnel bays could be equipped with troop couches to secure personnel against the turbulence of fast descent and hard landing and featured a large exit ramp. A narrow access corridor connected the bridge and cargo bays to the engine drives section. Like many ships of its size, it was equipped with escape pods for the crew in case of emergency, deflector shields, and a hyperdrive. The vessel was also armed with a number of turbolasers for defense."}, {"tag": "p", "text": "Despite its size, the ship was capable of being flown with a small amount of crew—on one occasion being crewed by only one person with the aid of a droid firing the weapons from the main bridge. To some, the vessel appeared to be fragile, but its original captain claimed it was the fastest, toughest vessel of its class. However, by the time of its military service, the vessel was considered reliable but antiquated."}, {"tag": "p", "text": "While the damage sustained in its first military mission was repaired, the ship was never fully repaired, instead receiving several modifications by Borleias ground crew in preparation for its mission to the galactic capital planet Coruscant. These alterations included irregular patchwork on its skin and reinforcing bars added to its slender midsection. A hatch cover near the top of the bridge remained in a damaged state, popping off unexpectedly prior to its last voyage. The internal bay also had a bulkhead added to separate a B-wing starfighter escape craft from the section containing the Coruscant-bound infiltrators."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history and military career"}, {"tag": "p", "text": "The Record Time was originally a privately owned freighter. The original captain and owner of the ship was a Human female named Ninora Birt, who, in the vessel's late middle age, donated it to the New Republic Defense Force for the war effort against the invading Yuuzhan Vong, with Birt serving as the ship's captain during the fall of Coruscant in the year 27 ABY. In the confusion following the New Republic retreat, the vessel ended up under New Republic General Wedge Antilles's command. Antilles took his forces to the planet Borleias, which had been used as a staging area by the Yuuzhan Vong to attack Coruscant, in an effort to retake the planet. The Record Time was loaded with assault troops, engineers, and YVH 1 droids commanded by entrepreneur and war hero Lando Calrissian. Escorted to the surface by Twin Suns Squadron, the Record Time, under fire, disgorged its load of troops and battle droids at the site of the former New Republic base, taken over and replaced by a Yuuzhan Vong facility. While grounded, the Record Time coordinated communications between the Star Destroyer Mon Mothma and the ground troops. Although a Yuuzhan Vong rakamat walker attempted to destroy the ship, Calrissian used explosives to destroy the warbeast. While the troops were successful in taking the base, the Record Time was rendered unspaceworthy from the damage it had sustained. While the ship was stationed on the surface of Borleias undergoing repairs, its master, Captain Birt, was assigned to finding a location for medical facilities for the wounded on the planet by General Antilles."}, {"tag": "p", "text": "As the New Republic forces formed a base on Borleias, they also repaired the Record Time. After command of Twin Suns Squadron was transferred to Jedi Jaina Solo, the vessel was used to ferry target practice canisters into orbit for Solo, her friend Jagged Fel, and fellow Jedi Kyp Durron to practice Force-based firing coordination tactics."}, {"tag": "h3", "text": "Mission to Coruscant"}, {"tag": "p", "text": "Twelve days later, the Record Time, with only minimal repairs performed by the garrison, was assigned to a new mission led by Calrissian. The repairs were so stop-gap that the flight control center gave Calrissian one in one hundred odds of the ship blowing up before attaining planetary orbit. The vessel had been modified to hold a flight-ready B-wing starfighter in its docking bay with a temporary bulkhead welded into place to separate it from the rest of the bay. This cordoned-off area of the cargo bay was filled with the organic detritus of coralskipper remains used to disguise insertion pods containing Wraith Squadron personnel, Jedi Master Luke Skywalker, his wife Mara Jade Skywalker, and Jedi Tahiri Veila for their ride onto Coruscant. The cargo would be released either by a command from the bridge or a comlink signal from Luke Skywalker, which would activate an inertial compensator to propel the pods out of the ship. The craft took off from Borleias shortly before the Yuuzhan Vong launched a major assault on the garrison, with a crew of only Calrissian and YVH 1-1A, a YVH droid weapons officer, as Calrissian did not want to endanger any other sentients on what he believed was at best risky, and at worst, a suicide mission."}, {"tag": "p", "text": "Calrissian brought the ship out of hyperspace close to the former capital planet, allowing the insertion team to be launched earlier, but the maneuver resulted in the Record Time being unable to escape before a Yuuzhan Vong frigate analog and several coralskippers intercepted the ship, pummeling it with Yaret-Kor fire. As it reached the insertion point, small explosive charges attached to the ship's forward hull were detonated, opening the bay to vacuum and creating the appearance of internal explosions to Yuuzhan Vong pursuers. As the charges exploded, the vessel's bay opened, sending its Human cargo plunging into Coruscant from orbit."}, {"tag": "p", "text": "Yuuzhan Vong warships continued to attack the Record Time, breaching its shields, though the ship's guns, manned by a YVH droid, accounted for at least seven coralskippers. With artificial gravity failing and the hull breached and failing, Calrissian and his droid weapons officer escaped into the cargo bay. Climbing into the B-wing, they set an exit vector from Coruscant back to Borleias as the remains of the Record Time, charred and blasted by the Yuuzhan Vong, descended towards Coruscant."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The original captain and owner of the ship was Ninora Birt, a former freelance smuggler who later donated the vessel to the New Republic Defense Force for the war effort, with Birt serving as the ship's captain during the fall of Coruscant. Birt later took her transport to Borleias with Wedge Antilles' command after Coruscant fell, where it suffered heavy damage while inserting a landing force of ground troops and YVH droids. During the flight, the ship had a Rodian communications officer. With the Record Time practically unspaceworthy, Birt relinquished command of her vessel while it was being repaired and was assigned to manage the injured New Republic personnel on Borleias. She later joined Blackmoon Squadron."}, {"tag": "p", "text": "The aging businessman, former general, and entrepreneur Lando Calrissian was the commander of the Record Time for its last mission, a return to Coruscant. He volunteered to fly the spacecraft because the flight was risky and because he did not want to place any others in danger besides himself. His sole other crewmember for the trip was a YVH droid, which taught itself to taunt him during the flight and destroyed multiple coralskippers over Coruscant. Calrissian half-expected to perish on the trip to Coruscant, but he successfully was able to insert the Jedi and Wraith Squadron strike force onto Coruscant while he and his droid companion escaped in a B-wing fighter built into the Record Time for its final voyage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Record Time was created by Aaron Allston for the 2002 novel The New Jedi Order: Enemy Lines I: Rebel Dream and although the ship was destroyed in that work, it was later mentioned in the novels The New Jedi Order: Enemy Lines II: Rebel Stand and The New Jedi Order: The Unifying Force. The ship also had an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}