{"url": "Reconnaissance_of_mercenary_base", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battle stubs", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Reconnaissance of mercenary base"}, {"tag": "p", "text": "After a mercenary group interrupted a meeting between Alliance forces and the Bothan Spynet, the Alliance wished to locate the aggressors responsible for the attack. Using intelligence gained from a mercenary captured in the battle, the Alliance launched an unofficial investigation to locate the mercenary base. Alliance leadership contacted the civilian Aeron Azzameen and her brother Ace, a decorated starfighter pilot within the Alliance Fleet, to conduct the reconnaissance. The Azzameens agreed and left in their ship, the YT-2000 light freighter Otana, to investigate the captured mercenary's lead: the Neutron Star-class bulk cruiser Redhawk, moored at the shipping space station Cargo Station."}, {"tag": "p", "text": "The Otana arrived and Aeron began slicing the starship's navigation computer. Finding a set of coordinates, the Azzameen left the system and entered hyperspace toward the Redhawk's saved coordinates. However, the coordinates had been falsified, and the Otana exited hyperspace in an Imperial weapons testing facility in the Carida system during a live-fire test. The family maintenance droid MK-09 scrambled to calculate an escape route as Ace maneuvered the freighter out of the path of incoming turbolaser fire. Eventually, a set of return coordinates was found, and the Azzameens returned to Cargo Station. There, they found that the Redhawk had left, but determined the bulk cruiser's destination by slicing into the station's records. With these new coordinates, the Otana once again entered hyperspace, this time en route to the Redhawk's destination."}, {"tag": "p", "text": "Upon arrival, the Azzameens were shocked to find that the Redhawk had led them to their home, Azzameen Station. The station, which had been renamed Falcon's Nest, had been previously captured by the Galactic Empire after a series of altercations between the family and their Imperial-aligned rivals Viraxo Industries before being turned over to the mercenary group that currently occupied it. Though Ace wished to engage the mercenaries, the others aboard the Otana convinced the pilot to instead return to the Alliance Mon Calamari Star Cruiser Liberty, where a proper attack could be planned. Shortly after returning with this information, the Alliance, along with the Azzameen family, launched an attack against Falcon's Nest which saw the defeat of the mercenary group as well as the return of the station to the Azzameens."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}