{"url": "Recovery_of_Transport_714", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Invasion of Naboo"], "nodes": [{"tag": "h1", "text": "Recovery of Transport 714"}, {"tag": "p", "text": "In 32 BBY, the Galactic Senate, the governing body of the Galactic Republic, passed legislation calling for the taxation of trade routes to outlying star systems. A trade dispute soon developed between the megacorperation, the Trade Federation and the Republic, resulting in the blockade of Naboo, and the Invasion of Naboo shortly thereafter. While the Trade Federation attempted to occupy Naboo's capital city, Theed, several crew members from the Crescent; Rorworr, a Wookiee scout; Jedi Padawan Sia-Lan Wezz; Dané, a young girl who was secretly training to become a handmaiden; Galak, a volunteer in the Royal Naboo Security Forces; Arani Korden, Theed-born daughter of a House Korden noble; and Deel Surool, a Twi'lek whose wealthy parents set up a trading emporium on Naboo; escaped the city by flying a speeder along the city's central river, the Solleu. The refugees were pursued by STAPs, however, evasive maneuvers on by the speeder's pilot caused a STAP to crash into a Trade Federation Multi-Troop Transport. The cooling fins of the MTT, Transport 714, were disabled, and the craft sank steaming into the River."}, {"tag": "p", "text": "Naboo's Queen Padmé Amidala, who had left the planet in an attempt to persuade the Galactic Senate to intervene and end the Trade Federation's invasion, returned to Naboo. The crew from the Crescent had joined the Naboo Resistance, and were invited to a planning session with the Queen. They were greeted by the Queen and her handmaidens; Captain Quarsh Panaka, head of the Royal Naboo Security Forces; Boss Nass, leader of the Gungans; Jar Jar Binks, a Gungan; two Jedi, Qui-Gon Jinn and Obi-Wan Kenobi; their Force-sensitive ward from Tatooine, Anakin Skywalker; and various Gungan and Underground generals."}, {"tag": "p", "text": "During the planning session, Amidala announced her plan to enter Theed via a secret passage. The leaders decided that using a Trade Federation Troop Transport would be the ideal way to approach the passage undetected, but realized that acquiring one would be difficult. At this point, Rorworr's team spoke up, volunteering information on the MTT that sank into the Solleu during their initial escape from Theed. With this information, the leaders formalized the main attack plan."}, {"tag": "p", "text": "Boss Nass volunteered his Gungan engineers, the Gungengineeren, to repair and salvage the submerged transport; however, his Gungan scouts were unable to locate the MTT. Queen Amidala tasked Rorworr's team with escorting the Gungengineeren to the site because the crew from the Crescent knew the exact location of the transport. The unit was also assigned to guard the Gungengineeren during the operation, since the Queen wanted to reassure the Gungans that the Naboo were committed to mutual cooperation. Rorworr and two others piloted three unfamiliar tribubble bongos, docking with a hydrostatic bubble to rendezvous with Koh Pa Wupps and his team of Gungengineers. Loading the engineers and their tools into the submersibles, Wupps directed the group around Lake Paonga, up the lower Solleu River, and through an underwater passage at the base of the Virdugo Plunge that lead to the upper Solleu, dodging a group of opee sea killers along the way."}, {"tag": "p", "text": "When the group located the downed MTT, the Gungengineeren began work on transporting it upriver for repair while Rorworr's team patrolled the area in the bongos. A young colo claw fish, orphaned and starving, made many attempts to crack the hull of the MTT, breaking several of its teeth on the MTT's armor, and marring the craft considerably. When the colo interrupted efforts to salvage the craft, the Crew from the Crescent attacked the young predator to draw it's attention away from the divers and lead it on a long chase that lead to the Colo's death. Eventually, the MTT was recovered by Gungan divers, repaired by the Naboo Resistance, and was retrofitted to accommodate human troops."}, {"tag": "p", "text": "During the Second Battle of Theed, the craft was used by the Naboo Resistance to conceal the Naboo forces and transport them undetected to the entrance of a secret passage in the cliff wall below Theed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Transport 714 is a recurring element in the roleplaying adventure, Peril on Naboo. This article based on the guided overview of the adventure, although the adventure allows for alternate paths. If the heroes don't escape Theed in a speeder along the Solleu River, or simply fail to mention the craft, an NPC will volunteer information about the MTT during the planning session with Amidala. The chase with the colo claw fish can end in three ways: the fish is either rammed continuously until dead by the bongos, lead back through the secret passage and into the school of Opee sea killers, or trapped in the current near the Virdugo Plunge and eventually taken over the edge of the falls."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}