{"url": "Reconnaissance_Troop_Transporter", "categories": ["Category:Legends articles", "Category:Galactic Empire vehicles", "Category:Repulsorcraft"], "nodes": [{"tag": "h1", "text": "Reconnaissance Troop Transporter"}, {"tag": "p", "text": "The Reconnaissance Troop Transporter (RTT), or Imperial Troop Transporter and Imperial Troop Transport, was an Imperial repulsorlift troop carrier."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The RTT was an armored repulsorlift vehicle built with three open-air traveling racks on each side and usually mounted a twin light fire-linked blaster cannon on top. The traveling racks could spring open for rapid deployment of the troops carried, but also left the troopers exposed while traveling."}, {"tag": "p", "text": "In addition to the six troopers carried on the outside, the Troop Transporter had room for several individuals on the inside. At the back of the Transporter was a Droid Prisoner Compartment used to detain and tame renegade droids. The vehicles were also equipped with Prisoner Immobilization Units to subdue prisoners."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 0 ABY, the Empire used the Troop Transporter under the command of Imperial Security Bureau agent Mar Barezz to attempt to capture Rebel Alliance recruits, although they escaped capture."}, {"tag": "p", "text": "In addition to patrol work, the RTT also saw action with elite units participating in search-and-destroy missions. Such was the case during the search for the stolen Death Star plans, where search parties on Tatooine used at least one such vehicle to travel across the desert. These troops detained and questioned a band of Jawas suspected of having captured the droids carrying the plans, before killing them and destroying their sandcrawler with the Transporter's cannon."}, {"tag": "p", "text": "Several Transporters were later used by Orman Tagge on the same planet, during a test of his brother's latest invention, the Omega Frost."}, {"tag": "p", "text": "Sienar's Transporters also participated in the Imperial Civil War around 10 ABY, when they shuttled troops around the battlefields on Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Reconnaissance Troop Transporter originated as a 1979 Kenner toy called the Imperial Troop Transporter, the first Star Wars toy to not actually appear in the film. It also came with a story booklet that explained that it was present off-screen in Star Wars: Episode IV A New Hope (then known as simply Star Wars), listing it as being responsible for the destruction of the sandcrawler that had carried R2-D2 and C-3PO."}, {"tag": "p", "text": "The original release of the Imperial Troop Transporter included six sound clips taken from A New Hope, four sound effects and two voice recordings: \"R2-D2, where are you?\" and \"There's one! Set for stun!\" The toy was later re-released heavily modified as the Imperial Cruiser, where most of its electronics were removed and some of its decals were altered. The space that had held the electronics was turned into a cargo hold."}, {"tag": "p", "text": "A 2009 Topps Star Wars Galaxy Series 4 trading card featured art by Matt Busch portraying an \"imaginary scenario\" of stormtroopers traveling in a Troop Transporter having captured Princess Leia. The princess is shown wearing a Prisoner Immobilization Unit over her head. The design of the vehicle matches the toy design exactly."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}