{"url": "Recruitment_Agent", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic intelligence organizations"], "nodes": [{"tag": "h1", "text": "Recruitment Agent"}, {"tag": "p", "text": "Recruitment Agents were members of the Rebel Alliance whose mission was to find people opposed to the Galactic Empire, and convince them to sign on with the Rebellion. This was a risky position, as any recruit they approached could potentially be an Imperial agent. Even the best agent would inevitably approach the wrong person after a few years in the field."}, {"tag": "p", "text": "The Rebel Alliance recruited personnel from many sources. Recruits for the many Sector Forces tended to be recruited by friends or relatives already in the SecForce's underground networks. Since these recruits were brought in by someone who knew them well, they were much less likely to be Imperial agents. Other Rebel personnel were recruited in large numbers from planets with governments which openly or covertly supported the Alliance, such as Mon Calamari or the various Rebel safe worlds. Many Alderaanians who escaped the destruction of Alderaan also joined the Rebellion. However, these sources were not enough, especially in the early days of the Galactic Civil War. Thus, recruitment agents were needed to bolster the Alliance's ranks."}, {"tag": "p", "text": "Rebel recruitment agents found recruits in many schools, universities, and even the Imperial Naval Academy. They also recruited disgruntled Imperial Survey Corps personnel, young men and women dodging the Imperial draft, and even members of the galaxy's criminal underground."}, {"tag": "p", "text": "On many planets, a 10,000 credit reward was offered for any recruitment agent turned over to the Imperial authorities. Simply being captured or killed was not the worst thing that could happen to a recruitment agent who made a mistake, however. The Empire had been known to feed double agents to known recruiters, with disastrous consequences for numerous Rebel outposts. However, the Alliance was able to spot many of these double agents during training. Besides, dissatisfaction with the Empire was widespread, and the Alliance continued to gain legitimacy as the Rebellion went on. The Battle of Yavin is credited with a 23 percent increase in Rebel recruitment."}, {"tag": "h2", "text": "Prominent recruitment agents"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}