{"url": "Reconstructive_surgery", "categories": ["Category:Canon articles", "Category:Stub", "Category:Incomplete lists", "Category:Medical procedures"], "nodes": [{"tag": "h1", "text": "Reconstructive surgery"}, {"tag": "p", "text": "Reconstructive surgery was a medical procedure to repair injuries or alter a being's anatomy. Practitioners of the surgery included Doctor Cornelius Evazan, Laparo, and Thromba. Darth Vader was a notable recipient of extensive reconstructive surgery following his duel with Obi-Wan Kenobi on Mustafar."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Reconstructive surgery was a medical procedure that repaired injuries or altered a being's anatomy for various purposes, such as disguising an identity or assuming another being's."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Doctor Cornelius Evazan formerly performed surgical procedures at Dr. Evazan Cosmetic Surgery, a clinic located in the settlement Pons Ora on Abafar, but the location went out of business sometime during the Clone Wars. Evazan became notorious for practicing \"creative surgery\" and leaving his unwitting patients scarred."}, {"tag": "p", "text": "A facial transformation program was used in 20 BBY to quickly and painfully achieve the temporary alteration of Obi-Wan Kenobi's features into those of Rako Hardeen."}, {"tag": "p", "text": "In 19 BBY, Darth Vader lost three limbs and suffered severe burns in his duel with Obi-Wan Kenobi on Mustafar. Darth Sidious transported his new apprentice to Coruscant for extensive reconstruction by medical droids."}, {"tag": "p", "text": "By the year 10 BBY, Evazan was employed by Dryden Vos, the public face of the Crimson Dawn syndicate. as a personal physician, but he continued his surgical experimentation by disguising the identities of underworld clients or enhancing their physical abilities. Evazan also created the Decraniated, subservient semi-organic cyberslaves who had the upper half of their craniums removed.  he used a similar procedure on Caysin Bog, leaving him alive but headless."}, {"tag": "p", "text": "The Frigosian cryptosurgeons Laparo and Thromba performed extensive surgery to disguise Ryn Biggleston's identity, including facial reconstruction, bone restructuring, altered fingerprints, eye and hair replacement, and skin bleaching to remove tattoos. Afterwards, Biggleston recovered in a bacta tube for three days."}, {"tag": "p", "text": "Kyrsta Agate required the procedure due to facial injuries sustained when Gallius Rax masterminded an attack on Liberation Day to disrupt the peace talks taking place on Chandrila."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}