{"url": "Red_Nebula_species", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Red Nebula species", "Category:Unidentified sentient species", "Category:Wild Space species"], "nodes": [{"tag": "h1", "text": "Red Nebula species"}, {"tag": "p", "text": "A sentient species inhabited a planet in the Red Nebula, an area of space that was separate from the main body of the galaxy. They were humanoid beings who resembled Humans with pink or pale skin and large, pointed ears. Members of the species were deeply religious, and followed a faith centered on a pair of gems known as the Great Life Jewels. According to the species' legends, the jewels came to their world during an awesome cataclysm that created the Red Nebula and forced it to drift away from the galaxy, taking their homeworld with it. The gems, the legend claimed, shielded a valley on their planet from the destruction wrought by the nebula on other celestial bodies within it. However, rather than unifying the species' culture, the belief split them into rival factions. One side, represented by an order of crimson-robed priests, considered the Great Life Gems a boon to civilization and thus venerated the stones. Their rivals, however, believed that the gems had thwarted fate, and kept the species alive when it should have been destroyed. The nihilist group was eventually cast off the planet and forced to roam the galaxy as exiles."}, {"tag": "p", "text": "In 0 ABY, the outcast faction, under the leadership of Klysk, kidnapped scoundrels from the galactic fringe to mount a raid on the temple where the gems were kept. Klysk hoped to steal the jewels and destroy them, thus hastening what his faction believed to be the species' true destiny: extinction. One of their abductees was the Human smuggler Han Solo, who managed to pilfer the jewels from the temple and then con Klysk into taking a sackful of rocks into the system's sun instead of the jewels. Three years later, Domina Tagge led a mission to the world to steal the gems in a bid to spread a plague to the Alliance to Restore the Republic and the Galactic Empire. She razed the species' main city and removed the gems."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The members of the sentient Red Nebula species looked similar to Humans in most respects. They had humanoid bodies, five-fingered hands, and faces that featured two small eyes, a nose, and a mouth. They differed from Humans in that their craniums were bald, and they had large, pointed ears. Some members of the species had pale-colored flesh, while others had pink skin. At least one member of the species had sharp nails on his fingers."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The pointy-eared humanoids were native to a planet located within the Red Nebula, an astrological feature far from the main body of the galaxy located in a field of comets, meteors, and other navigational hazards. Their planet was routinely barraged by debris, but one valley was spared the impacts due to the provenance of a pair of vermillion gems known as the Great Life Jewels or the Twin Gems. Because it was the only safe area on their homeworld, the species lived in a city in the valley and guarded the gems in a domed temple. This structure was monumental in scale, built with huge columns with carvings along their plinths and with an arched entrance. The Life Jewels were kept high atop a pair of pillars."}, {"tag": "p", "text": "Although their technology was underdeveloped compared to that of much of the galaxy, the species did have access to some advanced items. For instance, they knew how to use tracking devices, which they could monitor from fineband scope viewscreens. They also maintained a small fleet of starships that were capable of leaving the Red Nebula. The species' home planet appeared on no star-charts, and it was a long distance from the next star system by hyperspace. Nevertheless, the species did receive the occasional visitor. From such contacts, at least some members of the species learned to speak Basic."}, {"tag": "p", "text": "The members of the Red Nebula species were highly religious. However, they were divided into two rival religious factions. One group, represented by an order of priests distinguished by their crimson robes, believed that the Life Jewels were holy artifacts that protected their society from destruction and allowed them to live in harmony with the Red Nebula. The other faction, led by a member of the species known as Klysk around the time of the Battle of Yavin, held that the Life Jewels were abominations that only forestalled the destiny of the species: to be destroyed by the Red Nebula. Both groups agreed that the gems were alive and had come from another universe during the awesome cataclysm that had created the Red Nebula; if the gems were ever separated, the belief went, they would become angry and harm those around them. The members of the latter group wished to destroy the Twin Gems to allow the species to meet its predestined fate. They were considered fanatics and unbelievers and forbidden to live on the species' homeworld by the priestly group."}, {"tag": "p", "text": "The faction led by the priests tended to the jewels and defended the temple from thieves with laser cannons. Their protection also prevented the Twin Gems from being separated, a situation that would cause both gems to inflict a plague known as the crimson forever. Although the clerics carried no personal weapons in the event an intruder made it into the temple, they were aided in their sentry duty by a giant, hairy creature who served as the temple guardian and attacked intruders. The priests also had access to a series of underground shelters throughout the valley."}, {"tag": "p", "text": "The doomsday faction traveled through the galaxy in a starship called the Nova Prince. In contrast to the priests' proclaimed non-violence, the doomsday faction had no compunction about using force as a means to an end. At least one member of the group wore a green tunic with a belt around the waist over basic leggings. The members of the doomsday faction were able to speak Basic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although they evolved on the single habitable planet located in the Red Nebula, the species' legends told of a time long before when their star system was part of the main body of the galaxy. They believed that a tumultuous cataclysm had created the Red Nebula, simultaneously casting it into the depths of space and taking their sun and planet with it. A religion developed among the species that claimed that only the blessing of the Great Life Jewels protected them from the same destruction as the other astral bodies located in the nebula."}, {"tag": "p", "text": "Despite their isolation, the species' world received occasional visits from offworlders, and it came to be considered part of Wild Space. At least some members of the species learned to speak Basic from those encounters, and the visitors' frequent attempts to steal the Great Life Jewels prompted the species to set up defenses to protect their treasures. The species also achieved some elements of high technology, such as spaceflight. They constructed a small fleet of vessels and considered fleeing their world to settle elsewhere, but in the end, they had too few ships to carry all members of the species."}, {"tag": "p", "text": "Over time, a fissure developed among the members of the species. Some individuals maintained that the red gems were sacred and had to be venerated and protected if the species was to continue to live in the Red Nebula. Others, however, believed that the jewels were diabolical and only prevented the species from meeting the fate meted out to them by destiny: to die in the Red Nebula. The former faction gained the upper hand, and the nihilists were banished from the world in a small ship."}, {"tag": "h3", "text": "Theft of the Great Life Gems"}, {"tag": "p", "text": "The exiles lived in the greater galaxy for years. They eventually obtained a bulk freighter called the Nova Prince and then set into motion a plan to bring about the annihilation of their species. In 0 ABY, under the leadership of Klysk, they kidnapped several pirates and smugglers, with at least one raid on the planet Terminus. The Nova Prince then headed for the Red Nebula, where Klysk informed the prisoners that they had been kidnapped so that they could plunder the temple and steal the Great Life Jewels."}, {"tag": "p", "text": "However, navigating the debris of the Red Nebula proved difficult for the exiles, so they enlisted the aid of one of their captives, a Corellian smuggler named Han Solo. He succeeded, and the exiles returned home at last. They marched the captives to the valley, where their city with the temple was located. Klysk ordered them to attack the temple and allowed them to keep any plunder they grabbed as long as the gems were brought to him."}, {"tag": "p", "text": "The priests defended the temple with laser cannons and took out several of the marauders. Nevertheless, Han Solo and his Wookiee companion, Chewbacca, made it to the temple, followed shortly by a scoundrel named Zud and two of his companions. The temple priests warned them to turn back, but Zud refused. The giant temple guardian rampaged into the chamber and dispatched Zud and his helpers only to become infatuated with Chewbacca. Solo took advantage of the disturbance to steal the gems."}, {"tag": "p", "text": "Meanwhile, Klysk awaited the outcome of the raid at the Nova Prince. When Solo appeared with a sack in his hand, Klysk intimidated the Human into handing it over. Outgunned, the smuggler acquiesced. Klysk collected the remaining scoundrels and members of his faction—leaving Solo and Chewbacca behind to punish the Corellian for trying to negotiate with him. Klysk then sped away in the Prince on a suicide course for the system's sun, to destroy the gems and finally bring about his species' fated destruction."}, {"tag": "p", "text": "The temple priests were convinced that they were doomed; as they and Solo watched Klysk's ship from an underground viewscreen, the Nova Prince burnt up in the fires of the sun. Solo then revealed that he had bluffed Klysk by giving him a sack of rocks; the real gems were hidden in the forest. With the smuggler's help, the priests recovered the sacred objects and placed them back on the pillars on which they belonged. In gratitude, the priests gave Solo and Chewbacca a ship with which to return to the main body of the galaxy."}, {"tag": "h3", "text": "Death from above"}, {"tag": "p", "text": "Despite this brush with annihilation, the species had only a brief reprieve: in 3 ABY, the Human noble Domina Tagge led a warship full of bounty hunters to the species' planet to steal the Twin Gems. Tagge had heard that the gems were powerful, and she hoped to turn their power against both the Galactic Emperor's apprentice, Darth Vader, and the Rebel Alliance hero, Luke Skywalker, both of whom she blamed for the death of her brother, Orman Tagge. The inhabitants of the valley city stood little chance against the ship's bombardment, and the settlement was completely wiped out, the gems stolen, and the temple priest captured."}, {"tag": "p", "text": "Tagge had the priest interrogated, and he eventually revealed the secrets of the gems to her: they had the power to infect the crimson forever plague. However, she had been followed by an Imperial-class Star Destroyer sent by Darth Vader. As stormtroopers from the Star Destroyer boarded Tagge's vessel to retrieve the gems for themselves, the bounty hunters provoked a firefight, allowing the Imperial forces to only get one of the gems. During the fracas, the temple priest released the other gem from its casing. When the container holding Tagge's stolen gem burst open per a booby-trap set by Tagge, it was released on the Imperial vessel. Both gems were thus free to inflict the plague for which they were feared: the crimson forever."}, {"tag": "h2", "text": "The Red Nebula species in the galaxy"}, {"tag": "p", "text": "The members of this species maintained a small group of ships for trips into the main galaxy. The exiled faction that sought to destroy the Great Life Gems roamed the galaxy for years, eventually gaining possession of the Nova Prince."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Red Nebula species made their debut in Star Wars 50, an issue of the Marvel Star Wars comic book series that was first published in August 1981. The issue was written by Archie Goodwin and illustrated by Al Williamson and Walt Simonson. The species is also referenced in The Complete Star Wars Encyclopedia. Goodwin and Williamson later created Kraaken, a character whose appearance was identical to the inhabitants of the Red Nebula, for the comic strip story arc Traitor's Gambit, published by the Los Angeles Times Syndicate from January to March 1982. Traitor's Gambit does not name the character's species."}, {"tag": "p", "text": "However, identifying Kraaken as a member of the species from the Red Nebula is difficult; indeed, Star Wars continuity consultant Leland Chee has stated on the StarWars.com Message Boards that his theory is that all pointy-eared characters that have no explicit species identification are likely Sephi, a species introduced on the Jedi: Yoda comic book in 2004. Chee went further, stating his hypothesis that \"all pointy-eared species are either Sephi or closely related to Sephi.\" However, The Complete Star Wars Encyclopedia states that the inhabitants of the Red Nebula evolved on their homeworld, complicating any simple identification of Kraaken as either a member of that species or a Sephi."}, {"tag": "p", "text": "The Essential Atlas, published in 2009, indicates that despite the loss of the Twin Gems and Domina Tagge's leveling of the main city of the Red Nebula's only habitable world, the system had some sentient denizens—albeit fewer than one million—in 25 ABY. However, the Atlas does not specify whether these were members of the pointy-eared species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}