{"url": "Red_Squadron_(Rebel_Alliance)/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:Red Squadron personnel"], "nodes": [{"tag": "h1", "text": "Red Squadron  (Rebel Alliance)"}, {"tag": "p", "text": "Red Squadron, also known as Red Flight, Red Squad, Red Group, or Red Wing, was an Alliance Starfighter Corps starfighter squadron active during the Galactic Civil War. Their unit specialties included starfighter dogfighting, convoy raids, convoy escort missions, planetary strafing and bombing runs, and capital ship harassments. Although Red Squadron primarily flew X-wings on their missions, they relied on the Koensayr BTL-A4 Y-wing starfighters for missions relating to heavy bombardment. The squadron most famously fought at the Battle of Yavin and Battle of Endor. By the time of the Battle of Yavin, Alliance High Command had made Red Squadron a floating unit that could be reassigned at will, largely because of a growing list of successes in anti-Imperial missions—enough that the Empire listed them, and especially the key personnel, Commander Arhul Narra and Lieutenant Wedge Antilles, as active threats in their official field manual, the Imperial Handbook: A Commander's Guide."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Aboard Independence"}, {"tag": "p", "text": "The Rebel Alliance’s Red Squadron was stationed aboard the Mon Calamari Star Cruiser Independence early in the Galactic Civil War, flying T-65 X-wing starfighters, BTL Y-wing starfighters, and R-22 Spearhead starfighters during the Battle of Turkana, Operation Strike Fear, and the buildup to the Battle of Yavin. Pilots who flew with the squadron included Lieutenant Hamo Blastwell, Keyan Farlander, Samuel Raider and Puck Naeco. Along with Blue and Gold Squadrons, the unit's personnel were transferred to Yavin Base and reassigned to different squadrons for the Death Star assault, while the squadron’s ranks were bolstered by a group of experienced pilots including Red Squadron veteran Lieutenant Wedge Antilles."}, {"tag": "h3", "text": "Yavin Base"}, {"tag": "p", "text": "While Independence transfers Keyan Farlander and Puck Naeco remained with the squadron, Red Leader Garven Dreis cobbled together a new roster of pilots: Theron Nett from Dreis' old command the Dantooine Squadron, Tierfon Yellow Aces Wedge Antilles, Wes Janson, and Nozzo Naytaan, Imperial mutineers Biggs Darklighter and Derek \"Hobbie\" Klivian of the mock unit Ecliptic Evaders, third and fourth flight leaders Wenton Chan and Elyhek Rue from the Griffon Flight Wing, Twi'lek political scientist Cesi \"Doc\" Eirriss, and Alliance veteran Jal Te Gniev."}, {"tag": "p", "text": "However, the new Red Squadron, also called \"Red Flight\", saw its first casualties before the mission for which it was formed. Following a scouting mission from the Rebel base on Tierfon, Janson contracted Hesken Fever, and was replaced by his friend and fellow Yellow Ace Lieutenant Jek Tono Porkins, flying as Red Six. In the days prior to the Battle of Yavin, Porkins joined Red Two Wedge Antilles, Red Three Biggs Darklighter, and Red Four Doc Eirriss for a mission to acquire astromech droids from the smuggler captain Nera Dantels on the planet Commenor. Following a game of sabacc and an altercation with a group of extortionate locals, the Red Squadron X-wing pilots made contact with Captain Dantels, and were escorting her freighter the Starduster offworld—with its cargo of R2- and R5-series astromech droids—when they were set upon by twelve TIE/LN starfighters from an Imperial base on Commenor's moon, Folor. In the ensuing dogfight, the Rebels quickly destroyed several TIE fighters, the wreckage of one of which struck Doc Eirriss' X-wing, disabling her deflector shield generator and hyperdrive. Before Eirriss could be transferred to the Starduster, TIE reinforcements arrived, forcing Red Squadron to leave without Doc, who drove her ship into the enemy fighters to buy time for the squadron to escape into hyperspace. Returning to Yavin 4 to deliver the droids, the pilots swore to destroy the Death Star in Eirriss' memory before being introduced to new squadron member Luke Skywalker. A childhood friend of Biggs Darklighter's from Tatooine, Skywalker served as Red Five and the leader of Red Squadron's second flight, taking the place of Hobbie Klivian, who had been sidelined by the loss of his leg and resulting infection in a strike at an Incom Corporation facility. Doc's replacement as Red Four was John D. Branon, a young Tierfon Yellow Ace recommended by Jek Porkins for his bravery. Jal Te Gniev, confined to sickbay with the measles, had his position filled by Bren Quersey, a Dantooine Squadron pilot trained by Wedge Antilles who flew as Red Eight."}, {"tag": "h3", "text": "Battle of Yavin"}, {"tag": "p", "text": "Upon his arrival at Yavin Base in the smuggler Han Solo's freighter the Millennium Falcon, Luke Skywalker brought with him the Death Star plans carried within the astromech droid R2-D2, from which the Alliance hoped to discover a weakness which would allow them to destroy the immense space station. As the data was analyzed, the Death Star was detected in the Yavin system. With their base temporarily shielded by the planet Yavin, three Red Squadron X-wings were joined by a pair of Blue Squadron R-22 Spearheads in a preliminary attack on the Death Star's defenses, hoping to destroy its communications satellite, disrupting Imperial operations and preventing them from calling for reinforcements. Although two of the X-wings were shot down, the third, flown by now-Captain Keyan Farlander, ignored the enemy fighters and successfully destroyed the comm sat, while his wingmen were later rescued."}, {"tag": "p", "text": "Analysis of the plans revealed a vulnerability in the Death Star's defense, and in a meeting led by General Jan Dodonna, Red Squadron's pilots were briefed on the coming mission: the Rebel fighters would maneuver through a trench on the station's surface before reaching a two-meter-wide thermal exhaust port. A precise proton torpedo hit down the ray shielded exhaust port shaft would trigger a chain reaction in the Death Star's reactor system, destroying the space station. While Wedge Antilles decried the shot as impossible, Skywalker was more optimistic, likening it to his hunting of womp rats in a T-16 skyhopper on Tatooine. To prepare for the trench run, Captain Farlander and his flight leader set out to clear the Death Star's surface defenses by taking out several turbolaser batteries marked by a nav buoy and destroying four hangar ports, limiting the Death Star's ability to launch TIE fighters. Upon his return to Yavin Base, Farlander was transferred to Gold Squadron, a Y-wing unit tasked with the initial run on the Death Star exhaust port."}, {"tag": "p", "text": "With the Death Star minutes away from firing range of Yavin 4, the final assault on the superlaser-equipped battlestation began. As Red Squadron's twelve X-wings made their approach, Red Leader Garven Dreis observed that Red Two Wedge Antilles was out of position and ordered him to return. Correcting the offending error in his ranger by switching to manual control, Antilles closed formation. Standing by for combat, Dreis had the pilots under his command report in, lock their S-foils into attack position, and set their deflector shields to double front. Passing through the space station's magnetic field, Antilles was struck by its immense size, remarking on it aloud before being reprimanded by Dreis. Giving the order to accelerate to attack speed, he led his pilots across the Death Star's axis, drawing fire from the station's guns away from Gold Squadron as the Y-wings prepared for the battle's first trench run."}, {"tag": "p", "text": "Diving towards the Death Star while strafing its surface, Red Five Luke Skywalker passed through an explosion on his path, receiving only superficial damage to his starfighter. Red Three Biggs Darklighter, with Red Six Jek Porkins as cover, targeted a deflection tower, and while Darklighter successfully destroyed the tower, Porkins' X-wing was struck by its debris. Due to the resulting failures in his flight control systems, Porkins was an easy target for the Death Star's gunners. Darklighter warned his squadron mate first to eject, and then to pull up, but despite his assurances, Porkins' fighter was struck by turbolaser fire and he was killed in its explosion. With Antilles and Darklighter on his wing, Skywalker destroyed a further ten deflection towers."}, {"tag": "p", "text": "As the small size of the Rebel snubfighters allowed them to evade the Death Star's turbolasers, the Sith Darth Vader scrambled part of the station's complement of TIE fighters to engage the Rebels ship-to-ship, while Vader pursued Gold Squadron in his TIE Advanced x1. Picking up new signals that indicated the arrival of the Imperial fighters, Yavin Base warned the squadron leaders of the threat. While initially unable to detect the fighters on their scopes, Red Squadron's pilots caught sight of the incoming TIEs, one of which was quickly shot down by Red Four John D. Branon—though Branon was himself hit and killed shortly after. Another TIE pilot targeted Biggs Darklighter's X-wing, but was eliminated by Luke Skywalker. Despite Garven Dreis' order to tighten formation in response to heavy fire and interference, Skywalker broke off for an attack run on a lateral stabilizer protruding from the Death Star's surface. Destroying the stabilizer, Skywalker continued on to another, but was forced to abandon his second target due to the pursuing DS-61-4, who struck the Rebel pilot's X-wing with laser fire. Unable to outmaneuver his opponent, Skywalker was rescued by Wedge Antilles' precise gunnery, destroying his persistent foe. Although the Rebels saw some success against the TIE Fighters—Antilles was credited with a half dozen kills during the assault, while Red Eight Bren Quersey scored a hit on Vader's wingman \"Mauler\" Mithel—the Imperial craft overwhelmed them with sheer numbers."}, {"tag": "p", "text": "In the meridian trench, Gold Squadron's run at the Death Star exhaust port had been cut short by the arrival of Darth Vader and his wingmen. With the Y-wing squadron all but wiped out, Gold Five Davish \"Pops\" Krail commed his old friend Garven Dreis, passing responsibility for the trench run onto the X-wing squadron before succumbing to Imperial laser fire. Gathering his composure, Dreis ordered his six surviving pilots to rendezvous at mark six point one and report in. Pursuing Luke Skywalker on his way to the rendezvous point, an Imperial pilot was surprised and shot down by Biggs Darklighter. Advised by General Dodonna to split his Red Squadron in two, keeping half his group out of range as he began a second trench run, Dreis ordered Skywalker to take Darklighter and Antilles and hold position until he gave the signal to start their run. With his long-time wingman Red Ten Theron Nett and Red Twelve Puck Naeco behind him, Dreis entered the trench. Struggling to make out the exhaust port or the Imperial fighters, Nett had Skywalker scan for the enemy ships, with the young Rebel catching sight of Vader and his wingmen coming in at point three five just as Dreis came in range of the target. While his wingmen fell to Vader and DS-61-3 \"Backstabber\",  Red Leader activated his targeting computer and fired a pair of proton torpedoes at the exhaust port. Initial Rebel celebration at the hit ended abruptly as Dreis realized the shot had merely impacted on the surface. Rising from the trench with Vader on his tail, the squadron leader declined Skywalker's offer of cover, instead ordering the three remaining craft to prepare for a third run as he lost his upper starboard engine to his pursuer's lasers, plummeting to his death on the Death Star's surface."}, {"tag": "p", "text": "Luke Skywalker ordered his wingmen to close formation and enter the trench at full throttle, assuaging Biggs Darklighter's concern that their speed was too high to safely pull out by comparing the meridian trench to Beggar's Canyon on Tatooine, where Darklighter had skimmed the canyon walls by millimeters as he rose from a womp rat hunt. Dodging turbolaser fire, the three Rebel craft dove into the trench with Darklighter and Antilles falling behind Skywalker to provide him cover. Wedge Antilles, skeptical of the targeting computer's ability to hit the exhaust port and concerned by a defensive tower and the far end of the trench, was instructed to focus on the Imperial fighters by Skywalker, who had his onboard astromech R2-D2 attempt to repair a malfunctioning stabilizer. As Darth Vader and his wingmen approached at point three, TIE pilot \"Backstabber\" scored a hit on Antilles' X-wing, destroying his micro-maneuvering controls and forcing him to pull out of the trench run. Letting Antilles go, Vader accelerated in pursuit of Skywalker, firing on and killing Darklighter in the process, leaving Red Squadron's newest member without cover as he prepared his targeting computer for the final assault on the exhaust port. With the voice of his fallen Jedi mentor Obi-Wan Kenobi advising him to use the Force, Skywalker shut off his computer to the distress of the Yavin Base command below. Insisting that he was alright, the force-sensitive pilot continued on towards his target, even as Vader's lasers struck R2-D2, disabling his faithful droid. With the Death Star closing to firing range and preparing to destroy Yavin 4, Vader's TIE Advanced caught up with Skywalker's X-wing only to be ambushed by the returning Millennium Falcon. Experiencing a change of heart on his decision to flee rather than fight for the Rebellion, Han Solo shot down \"Backstabber\" and caused \"Mauler\" Mithel to careen into Vader's TIE, killing Mithel and sending Vader spinning off into space. Finally clear, Luke Skywalker launched his proton torpedoes, which, guided by the Force, struck the exhaust port perfectly, destroying the Death Star and saving Yavin 4. Regrouping with the Falcon, Antilles, and Keyan Farlander, the lone survivor of Gold Squadron, Skywalker returned to Yavin Base for a ceremony honoring the Rebel victory. However, the victory came at a steep price for Red Squadron: while the squadron gained the distinction of being the unit that brought down the Death Star, it was nearly wiped out in the battle, with Luke Skywalker and Wedge Antilles as its only survivors."}, {"tag": "h3", "text": "Rogues and Renegades"}, {"tag": "p", "text": "Following its decimation at the Battle of Yavin, Red Squadron was single-handedly rebuilt by Commander Arhul Narra,, a key member of the squadron prior to the destruction of the Death Star, and reconstituted as a pair of flights. In addition to Red Squadron as a whole, Narra led Renegade Flight, while he tapped Luke Skywalker to lead Rogue Flight with fellow survivor of Yavin Wedge Antilles as his second-in-command."}, {"tag": "p", "text": "The latter group, while operating under the name Red Squadron,[source?] carried out various operations, including aiding an Imperial officer in his defection into the Rebel Alliance and rescuing Rebel-sympathizing scientists on Ralltiir after Imperial forces blockaded the planet. As the Rogues became more autonomous, they became a group with no standing orders, ready any time or place for urgent missions that would arise. Renegade Flight was eventually destroyed before the Battle of Hoth, while escorting a convoy carrying supplies for the Echo Base."}, {"tag": "h3", "text": "Mission to Kamino"}, {"tag": "p", "text": "Some time after the Battle of Yavin, Commander Narra briefed Red Squadron pilots Skywalker, Antilles, and Zev Senesca for a reconnaissance mission to Kamino, investigating a now-abandoned Imperial research facility on the planet, said to have been developing a superweapon. Down several squadron members, Narra temporarily recruited the smugglers Han Solo and Chewbacca into Red Squadron."}, {"tag": "p", "text": "Given charge of the mission by Commander Narra, Red Leader Luke Skywalker led the squadron's five X-wings through hyperspace to Kamino's orbit, finding fluctuating gravitational readings, but no sign of the Empire. Overruling Red Two Han Solo and investigating the readings before landing, Skywalker was ambushed by four mercenary ships, hired by renegade Imperial assassin X-7 to kill him. Narrowly avoiding laserfire from a Firespray-class starship flown by Lune Oddo Divinian, Skywalker ordered his pilots to engage, unfolding their S-foils into attack position. Firing at a Preybird-class starfighter, Solo's missile was intercepted by his target's antiballistic countermeasure, creating an explosion that seared the Rebel smuggler's X-wing and left him vulnerable to the Preybird's attack. With the enemy craft distracted by his Wookiee partner Chewbacca, flying as Red Five, Solo recovered in time to shake the Preybird and target a pair of freighters tailing a trapped Luke Skywalker. Hurtling close enough to one of the freighters to make out the pilot's snout, Solo forced it out of formation before re-engaging with the Preybird. With the mercenary starfighter on his tail, Solo pulled to starboard, overcompensating due to his experience with the Millennium Falcon's temperamental thrusters, and landing in the firing path of the Firespray, suffering only mild damage to his X-wing's aft engine thanks to the intervention of Luke Skywalker. With Red Squadron facing a lack of success despite outnumbering the enemy, Skywalker devised a new strategy: he, Solo, and Chewbacca would head for Kamino's surface while Wedge Antilles and Zev Senesca maintained their orbit, hoping to split the mercenary force in half. Instead, all four craft pursued Skywalker's ship, strafing him with laserfire. Attempting to reverse course, Skywalker found himself—along with Solo, Chewbacca, and the mercenaries—caught in a tractor field, an old Imperial security measure and the source of the gravitational fluctuations. Drawn into the planet's atmosphere, Skywalker ejected from his fighter, parachuting down to the city below. Unable to detect their squadron mates' life signs due to an atmospheric electrical storm, Antilles and Senesca returned to Yavin 4 to report the mission's failure."}, {"tag": "p", "text": "Reunited with his allies, Skywalker rescued Han Solo from a group of native aiwhas, and was engaged in a standoff with the grounded mercenaries when the opposing groups were attacked by a large tentacled creature, the genetically-manipulated product of the superweapon project and the cause of its abandonment. Cooperating to fend off the creature, the Rebels formed a truce with Lune Divinian, the lone surviving mercenary, and set off to disable the tractor field and locate transportation off Kamino, interrupted by the return of the \"superweapon\", swallowing Skywalker and Divinian whole. While the two killed the creature and attempted to escape its submerged lair in its air-tight stomach, Solo, Chewbacca, and R2-D2 discovered a number of spaceworthy ships—an ARC-170 starfighter and a pair of I-7 Howlrunners—as well as Kaminoan scientist Elo Panil, one of the creatures' designers still overseeing his creations. Devising a plan to follow the creature back to its lair—and to Luke—via tracking device, Solo and the Wookiee mounted feral aiwhas and dove into the sea, rescuing Skywalker and Divinian just as they were set upon by a pack of \"superweapon\" creatures. Returning to the city, the group was fired upon by a group of amphibious Imperial assault tanks summoned by Panil, which they lured onto the sea, where the tanks were surrounded and overwhelmed by \"superweapon\" creatures. Now pursued by TIE fighters, Divinian and the Rebels fled to the research station's docking bay, meeting R2-D2 and escaping in their starfighters just as the station was destroyed."}, {"tag": "p", "text": "With his Howlrunner's radar and communications disrupted by an electrical storm, Luke Skywalker struggled to engage the Imperial fighters while avoiding a collision. Following the path of a TIE's laserbolts through the cloud cover, Skywalker shot down the enemy ship. As another craft approached, Skywalker hesitated before firing, and realised that it was Divinian's Howlrunner. Surprised that the mercenary hadn't fired on him, Skywalker followed him out of the clouds, while the two worked in tandem to pick off three more TIE fighters. Pursued by a pair of TIEs and with its hyperdrive disabled, Han Solo and Chewbacca's ARC-170 dove into the streets of Research City, where a wild shot by the lead TIE struck the side of a building, taking out the Imperial's wingmate in a shower of duracrete. Drawing the remaining Imperial toward another duracrete building at high speed, Solo broke into a ninety-degree climb up its side, while the TIE veered around it, clearing the building but colliding with the levee behind it at the edge of the city, tearing a hole in the seawall and flooding the streets. With all planetary opposition defeated, the three starfighters left Kamino's atmosphere, but were met by four more TIE fighters in low orbit. Inverting his Howlrunner to get behind a pursuing TIE, Skywalker shot down his opponent, while the smugglers' ARC-170, engaged from behind by two TIE fighters, reversed direction with a hairpin swivel putting them face-to-face with the nearest TIE. Destroying the enemy ship, Solo guided the ARC away from its explosion only to see an Imperial Star Destroyer drawing into range. With Skywalker focused on avoiding the Star Destroyer's turbolaser fire, a surviving TIE entered his blind spot. Despite his contract to kill the Rebel, Divinian launched a concussion missile at the Imperial fighter, saving Skywalker's life while leading his own Howlrunner into the Star Destroyer's line of fire and disabling it. Lead by the Millennium Falcon flown by Princess Leia Organa, which destroyed the last TIE fighter, a strike team of eight X-wings, three Y-wings, and a blockade runner launched an assault on the Star Destroyer. Following a direct laser hit with a pair of proton torpedoes, the Falcon destroyed the ship's shield generator dome, while the X-wings fired on the now unshielded hull, and Skywalker and Solo targeted the Star Destroyer's gravity well projectors in the hope of taking down its main reactor. As the Imperial ship fled into hyperspace, Skywalker, Solo, Chewbacca, and R2-D2 boarded the Millennium Falcon with Divinian as their prisoner, and returned to Yavin 4."}, {"tag": "h3", "text": "Evacuation of Yavin"}, {"tag": "p", "text": "Six months after the Battle of Yavin, Red Squadron escorted Chipr, a pair of Lambda-class T-4a shuttles owned by the Alliance, and Goat, a pair of Delta-class DX-9 stormtrooper transports, to carry troops and workers away from Yavin 4."}, {"tag": "h3", "text": "Aboard the Defiance"}, {"tag": "p", "text": "In the months following the Battle of Hoth, Rebel pilot Ace Azzameen flew with a Red Squadron based on the Mon Calamari cruiser Defiance."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "For the Battle of Endor, Wedge Antilles changed the name of Rogue Squadron to Red Squadron, with himself as Red Leader, to honor the heroes of Yavin."}, {"tag": "p", "text": "After the Battle of Endor, the group returned to the Rogue Squadron name, although the Rogues once again adopted \"Red\" call signs during a strike at Tandankin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the novelization of A New Hope, Luke Skywalker and Wedge Antilles flew for Blue Squadron. Their squadron was changed to Red Squadron when it was realized that blue markings on the ships would be replaced by moving starfield during bluescreen shots. Consequently, the name of the fighter group the novelization called Red Squadron was changed to Gold Squadron for the film."}, {"tag": "p", "text": "The comic adaptation indicated that Red Squadron (\"Blue Group\") contained only six pilots, but subsequent literature changed the number to twelve. The comic adaptation also established that Luke was the youngest member of the squadron at the Battle of Yavin. The comic differs from the film in showing one of Red Leader's wingmen during the trench run piloting a Y-wing."}, {"tag": "p", "text": "Red Squadron was also a recurring starfighter squadron in Star Wars: X-Wing Alliance. However, as all Alliance starfighter squadrons in the game are merely named by colors, this designation may have been an in-mission callsign system, rather than actual squadron names. This explanation is in line with most military procedures of assigning short callsigns for operational use."}, {"tag": "p", "text": "Actor John Chapman claims that his character, \"Gil Viray,\" was Red Twelve,  but the claim was unverified until it was revealed that the character Puck Naeco flew under the callsign at Yavin."}, {"tag": "p", "text": "The 1998 novel X-Wing: Wraith Squadron identifies Gayla Riemann as a Rogue Squadron veteran, and The Truce at Bakura Sourcebook claims that she flew an X-wing during the Battle of Endor. No source has revealed whether she flew with Red Squadron in the battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}