{"url": "Red_Squadron_(Rebel_Alliance)", "categories": ["Category:Canon articles", "Category:Articles with conflicting sources", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:New Republic starfighter squadrons", "Category:Red Squadron personnel"], "nodes": [{"tag": "h1", "text": "Red Squadron  (Rebel Alliance)"}, {"tag": "p", "text": "Red Squadron, also referred to as Red Group, was a starfighter squadron of X-wing starfighters that served as part of the Rebel Alliance's starfighter corps during the Galactic Civil War. The squadron participated in campaigns such as the Battle of Scarif, the Battle of Yavin and the Battle of Endor. Following the victory of the rebellion and the reformation of the Republic, Red Squadron was assimilated into the New Republic Defense Fleet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Red Squadron was a starfighter squadron that served under the Massassi Group and the Rebel Alliance Starfighter Corps as part of the Rebel Alliance during the Galactic Civil War, and then later the New Republic."}, {"tag": "p", "text": "As with most Rebel starfighter squadrons, Red Squadron typically consisted of twelve ships. On occasion, however, the Squadron could be expanded to include as many as fifteen. Over the years, the Squadron had various commanders, that included Commander Garven Dreis, Commander Arhul Narra,, Commander Wedge Antilles, and Commander Luke Skywalker"}, {"tag": "p", "text": "The squadron consisted of a mix of starfighters, and occassionaly airspeeders. This included the Aggressive ReConnaissance-170 starfighter, flown by Garven Dreis at least on one occassion, BTL-A4 Y-wing assault starfighter/bombers, RZ-1 A-wing interceptors, and V-4X-D ski speeders. The squadron's preferred starfighter however, was the T-65B X-wing starfighter, as it could take on TIEs and Star Destroyers and everything in between. It was also favoured by one of the squadron's early commanders, Garven Dreis, who wouldn't fly anything else. Colonel Bandwin Cor speculated that the X-wing may have handled like a bush hopper, commonly used by pilots from Virujansi. The Squadron's starfighters were painted with red stripes or markings."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Skirmish with Darth Vader"}, {"tag": "p", "text": "Sometime between 2 BBY and 4 ABY, during a battle involving Darth Vader, Micha (Red Four) sacrificed herself by flying her X-wing starfighter directly into the Sith Lord. Micha's actions were heroic in the eyes of the Rebel troopers who witnessed it, and they believed it was a blow to the Empire, for eliminating Emperor Palpatine's chief enforcer. However, Vader emerged from the X-wing wreckage, igniting his lightsaber."}, {"tag": "h3", "text": "Operation Buckler"}, {"tag": "p", "text": "Red Squadron took part in Operation Buckler, in which their objective was to acquire decommissioned Y-wing starfighters from the orbital scrapyard at Ord Biniir. Garven Dreis' strategy involved employing subterfuge to avoid raising enemy suspicions concerning rebel mobilisation in the Void of Chopani. It wasn't uncommon to find X-wings in pirate hands in some Rim sectors. So, the aim was to pose as pirates, emulating their appearance and flight tactics. Several of the Squadron's X-wings were temporarily painted with pirate markings. Two designs were proposed, dubbed \"Exterior Variant /1\" and \"Exterior Variant /2\". The operation eventually resulted in success."}, {"tag": "h3", "text": "Routine patrols around Yavin"}, {"tag": "p", "text": "At some point prior to the Battle of Scarif, Red Squadron carried out routine patrols while the Alliance were based at the Great Temple on Yavin. Pairs of pilots in X-wings were scheduled on shift cycles prepared by Colonel Bandwin Cor, their mission to route from Yavin to a number of Gordian Trace Relays, perform a flyby of surrounding space, then after verifying visual and sensor all clear, perform close uplink of passive relay recordings. Shift Cycle 1 consisted of Commander Garven Dreis (Red Leader) and Major Ralo Surrel (Red Eleven). Shift Cycle 2 consisted of Cadet Harb Binli (Red Seven) and Cadet Pedrin Gaul (Red Five), accompanied by Lieutenant Nozzo Naytaan (Red Nine). Shift Cycle 3 consisted of Lieutenant Attico Wred (Green Four) and Lieutenant Wion Dillems (Green Twelve)."}, {"tag": "h3", "text": "Battle of Scarif"}, {"tag": "p", "text": "Red Squadron, under the command of Red Leader, Commander Garven Dreis, participated in the Battle of Scarif along with Blue Squadron, Green Squadron, and Gold Squadron. Their X-wings assisted the rest of the Alliance fleet in engaging Imperial ships above the planet, combating countless TIE fighters, attacking the Shield Gate and the two Imperial I-class Star Destroyers protecting it. During the battle, Pedrin Gaul (Red Five) was killed by TIEs when he strayed too far from the group. Later, another pilot was also killed by TIEs."}, {"tag": "h3", "text": "Battle of Yavin"}, {"tag": "p", "text": "Following the successful retrieval of the Death Star plans and heavy losses to the Rebel Alliance at Scarif, Red Squadron, along with Gold Squadron, participated in the Battle of Yavin under the command of Red Leader, Commander Garven Dreis. X-wings from Red Squadron made the second and third trench run on the Death Star's thermal exhaust port, following an unsuccessful attempt by a trio of Gold Squadron's Y-wings."}, {"tag": "p", "text": "Dreis, led the second trench run with wingmen Theron Nett (Red Ten) and Puck Naeco (Red Twelve), but were all destroyed by Darth Vader in his TIE Advanced x1. The third trench run was led by Luke Skywalker (Red Five) with wingmen Wedge Antilles (Red Two) and Biggs Darklighter (Red Three), but Darklighter was killed by Vader and Antilles suffered damage to his X-wing, leaving Skywalker exposed. At the last minute, the Millennium Falcon piloted by Han Solo and Chewbacca, destroyed two of the TIE fighters and damaged Vader's TIE, allowing Skywalker to score the critical hit which destroyed the Death Star and saved the Alliance forces on Yavin 4 from ultimate destruction."}, {"tag": "h3", "text": "Chasing after a Princess"}, {"tag": "p", "text": "Following the destruction of the Death Star, the Rebel Alliance decided to evacuate their base on Yavin 4. Princess Leia Organa, along with a fellow Alderaanian rebel pilot named Evaan Verlaine and R2-D2, decided to defy the orders of General Dodonna and set out on a mission to find and protect surviving Alderaanians from the Empire. Organa sent Dodonna a message via holo, to inform him of her decision to leave on this mission, however it was too late for him to stop her, as she had already left in his personal T-1 shuttle, piloted by Verlaine."}, {"tag": "p", "text": "Before they could make the jump to hyperspace, Wedge Antilles (Red Two) and Luke Skywalker (Red Five), the only two members of Red Squadron to return from the battle of Yavin, intercepted the shuttle and ordered them to turn back, to which Organa refused. The two X-wings moved in front of the shuttle in a herding maneurve that Verlaine had heard Skywalker and Antilles brainstorm previously, designed to drag their heels ahead and prevent their ship from jumping to hyperspace without plowing into them."}, {"tag": "p", "text": "Unable to evade the faster X-wings, Verlaine had an idea, she collided their shuttle with one of the X-wings, knocking a component off their ship, claiming it to be a piece of their hyperdrive over the comm. Another X-wing pilot made visual contact with the shuttle, and saw what looked like an alluvial damper malfunction, and told Red Five that the shuttle was looking wobbly and to give it a wide berth. Organa wasn't impressed with Verlaine's actions and claimed she had sabotaged the mission because she disagreed with it. As soon as the X-wings fell back, the shuttle jumped to hyperspace and slipped away. Verlaine had fooled everyone into thinking the hyperdrive had failed, when in fact the lost component was really a useless decoy that her and R2-D2 had worked on, and couldn't tell Organa while Skywalker and Antilles were listening in."}, {"tag": "h3", "text": "Patrol sweeps around Yavin"}, {"tag": "p", "text": "During the evacuation of Yavin, Lieutenant Wedge Antilles (Red Two) was sent on a mission in a Patrol X-wing (Snoop 2), equipped with a Fabritech high-gain recon sensor package, to scan the Yavin perimeter. After clearing orbit, Antilles made a full perimeter circuit, scanning for signs of Imperial incursion or passive observation devices. Sweep One, consisted of the far side of Yavin's sensor shadow, and received added attention in light of the previous day's unconfirmed sightings of an Imperial scout ship in the vicinity, however the sweep came up negative for foreign objects or signals. Sweep Two, concentrated on the near spinward arc, but also returned negative for foreign objects or signals. Sweep Three, concentrated on the far spinward arc, where a long-range threat popped up matching the profile of an Imperial probe droid. By the time Antilles reached the halfway point where the sensors could assemble a more accurate model, it showed a metal-rich asteroid three meters in diameter. Mirrored facets had bounced Snoop 2's own pings back, which tricked the sensors into a false alarm. Not long after, Alliance Intelligence had mulitple confirmed reports of an imminent Imperial threat."}, {"tag": "h3", "text": "Post-Battle of Yavin"}, {"tag": "p", "text": "Soon after, Luke Skywalker became an officer in the Alliance and was given the rank of Lieutenant and was regularly assigned numerous independent missions."}, {"tag": "p", "text": "Veteran pilot Commander Arhul Narra was tasked by Alliance High Command to lead Red Squadron. Upon his taking command, Narra asked Luke Skywalker and Wedge Antilles to continue to fly with Red Squadron. Narra made it abundantly clear that neither of them would get special treatment for surviving an encounter with the Death Star, even if they were the ones to destroy it. The grizzled commander was always on Skywalker's back, demanding more of him than anyone else, including Antilles."}, {"tag": "h3", "text": "Skirmish in the Kiax Nebula"}, {"tag": "p", "text": "Shortly after the Battle of Yavin, Red Squadron, led by Commander Arhul Narra (Red Leader), were tasked to accompany the Rebel Alliance transport Nema, carrying essential medical supplies. The Imperial Navy would stop at nothing to bring down such a valuable resource, so the Alliance Council had plotted a course through the Kiax Nebula, where most spacefarer's avoided, in a gamble to avoid Imperial detection. The Nebula's thick cloud consisted of swirling, space dust, which wreaked havoc on sensor readings, and Han Solo had told Mon Mothma that flying through the cloud was a bad idea."}, {"tag": "p", "text": "Pirates serving the Tech Masters attacked the Alliance forces using modified TIEs, which killed Duros pilot Jamman (Red Three), a newcomer to the squadron. Lieutenant Luke Skywalker (Red Five) was able to destroy three of the TIEs. The pirates used surprise hit-and-fade tactics by hitting the X-wings and then disappearing into the Nebula's thick cloud. Skywalker insisted on chasing after the pirates into the cloud, so Red Squadron followed him, leaving the Nema unprotected. While X-wings were distracted, the pirates managed to hijack the Nema and take it to Trionak. It was later found out that this was the third transport to go missing, so Skywalker and Leia Organa took the Millennium Falcon to Trionak to investigate. They were able to recover the Nema and bring it back to Home One."}, {"tag": "h3", "text": "Mission to Giju"}, {"tag": "p", "text": "A few months after the Battle of Yavin, the Alliance sent three members of Red Squadron, led by Commander Narra, on a mission to protect a transport carrying underground rebel leaders being evacuated from the planet Giju before Imperial agents arrived. Narra (Red Leader) led the transport away from the planet, while Wedge Antilles (Red Three) and Luke Skywalker (Red Five) were in the rear, keeping the TIEs busy. Initially, they encountered a patrol of TIE fighters, which they were able to eliminate, but then it seemed to them like the Empire sent every fighter it had in the system to engage the rebel raiders."}, {"tag": "p", "text": "While weaving through the convoy of other bulk freighters leaving the planet, the two X-wings used a \"scoot and shoot\" maneuvre, with Skywalker in the lead, and Antilles directly behind on his tail. Inbound enemies could only target Skywalker, while Antilles scooted up and down, emerging from cover to fire at the attackers. This enabled them to destroy three TIE fighters, however, four more TIE fighters were hidden amongst the freighter convoy, waiting in ambush. Skywalker was distracted at the time, however the TIEs were eventually destroyed. Once the transport was clear, Narra ordered his pilots to activate scatter protocols, where each pilot followed a randomly chosen zigzag path through hyperspace, making several jumps to foil anyone that might track them back to the fleet above Devaron."}, {"tag": "h3", "text": "Battle of Vrogas Vas"}, {"tag": "p", "text": "In 0 ABY, Darth Vader, while pursuing his son Luke in the aftermath of the Battle of Yavin, tracked him to the planet Vrogas Vas, where the Rebel Alliance had established a refueling base. He immediately encountered three squadrons of X-wings, including Red Squadron. Vader completely destroyed the other two squadrons before Luke Skywalker (Red Five) purposely rammed into him with his X-wing. Father and son both fell to the planet's surface, beginning the Battle of Vrogas Vas."}, {"tag": "p", "text": "In a report to General Jan Dodonna, Commander Narra described the event as one of the worst cullings of starfighter pilots he'd ever seen, with the loss of Blue, Gray and Yellow Squadrons, as well as abandoning their starfighter outpost following the arrival of the Imperial fleet. Darth Vader escaped capture, however all Alliance command staff members escaped and all sensitive information stored at the outpst was recovered or intentially destroyed. The Alliance were able to capture Dr. Chelli Lona Aphra, a high-value prisoner, who was remanded to a max security penitentiary at Sunspot."}, {"tag": "h3", "text": "Hijacking the Harbinger"}, {"tag": "p", "text": "Sometime between 0 ABY and 1 ABY, the Empire learned that Tureen VII was sympathetic to the Rebel cause, and set up a blockade around the planet. Three previous attempts to break through the blockade had failed, as the Imperials had established bases on the planet's twin moons, and its orbit was swarming with TIE fighters. It was too risky to use the Alliance fleet, so Luke Skywalker suggested stealing an Imperial Star Destroyer instead."}, {"tag": "p", "text": "A hijack crew aboard the Millennium Falcon, composed of Han Solo, Leia Organa, Chewbacca, Sana Starros and C-3PO, led the hijacking of the Imperial I-class Star Destroyer Harbinger, with support from Red Squadron's X-wings, engaging TIE fighters. The Millennium Falcon conducted bombing runs on the Harbinger, which led to a small breach in Sector 19-A. This opened up a path to the Star Destroyer's main engine reactor. Wedge Antilles (Red Three), made another bombing run with the intent of striking the reactor and overloading it, however his torpedoes missed their mark. This was followed by the deaths of Red Seven and Red Nine. Skywalker (Red Five) then flew into the breach and scored several hits with his laser cannons, putting the reactor in overload."}, {"tag": "p", "text": "With the reactor minutes from complete overload, and not enough time for emergency engineers to shut it down, the Harbinger's admiral ordered the crew to abandon ship. Red Squadron, including Antilles (Red Three) and Red Six, intercepted shuttles leaving the Harbinger, while the Falcon and Skywalker (Red Five) landed in the hangar. The hijackers jettisoned the reactor and as it exploded, the departing shuttles reported to Imperial Command that the Harbinger had been lost. The admiral contemplated suicide when he realized that Darth Vader would hold him personally responsible."}, {"tag": "p", "text": "After a week of limping on the backup reactor, an Alliance admiral was supposed to rendezvous with the Harbinger, however he was killed, after being strapped to the nose of his shuttle, as a warning from Task Force 99, who were sent by Darth Vader to recapture the Star Destroyer."}, {"tag": "h3", "text": "Breaking the blockade of Tureen VII"}, {"tag": "p", "text": "With the Harbinger and its skeleton crew under attack from Task Force 99, Leia Organa pushed on with her mission to Tureen VII and ordered full speed ahead. Although in bad shape, it managed to push through the Imperial blockade, initially giving the impression to the Imperial forces that Coruscant had sent reinforcements. As the Harbinger approached at high speed, it collided with two Imperial Star Destroyers in orbit, knocking out its own front shield and one of its engines. With the Harbinger's cannons offline, X-wings from Red Squadron (Red Team) and Blue Squadron (Blue Group) launched out of the hangar. While Blue Group kept the TIEs busy, the rest attacked the moon bases, which were heavily defended by TIE fighters, led by Darth Vader in his TIE Advanced x1, who inflicted heavy losses on the Alliance forces."}, {"tag": "p", "text": "Organa ordered Red Team to provide more room so the supplies could reach the surface but Vader wasn't making it easy. Skywalker jumped back into his X-wing to assist the squadron, and was able to eliminate the moon bases. He wanted to go after Vader, however he was urged to stay on mission as there were wounded to evacuate. The battle left the Harbinger as a burning wreck and the crew had to abandon ship."}, {"tag": "h3", "text": "Mission to Crait"}, {"tag": "p", "text": "Sometime between 0 ABY and 1 ABY, before the Rebel Alliance found their base on Hoth, Captain Luke Skywalker and Red Squadron escorted Leia Organa's survey team, which included Han Solo and Chewbacca, to the planet Crait. The mission was to survey an abandoned mining facility to determine its suitability as a new secret base for the Alliance, following their evacuation from Yavin and continued threat of Imperial attacks on the Alliance fleet."}, {"tag": "p", "text": "Organa had trusted Trusk Berinato, who was an old friend of her father and had previously recommended the location in the past. However, he double crossed the Rebels and they were attacked by Task Force 99. Red Squadron, including Wedge Antilles, showed up in V-4X-D ski speeders and helped Organa's team escape. The planet was ultimately unsuitable as a new base."}, {"tag": "h3", "text": "Remembering the fallen"}, {"tag": "p", "text": "Prior to the mutiny on Mon Cala, Luke Skywalker and fellow rebels Han Solo, Wedge Antilles, Zev Senesca, Derek Klivian, and Chewbacca raised a toast at Mess Hall IV in the Mako-Ta Space Docks to honor the deceased members of Red Squadron, including Dreis, Branon, Porkins, Rue, Dinnes, Naytaan, Nett, Surrel, Naeco and Darklighter."}, {"tag": "h3", "text": "Imperial ambush"}, {"tag": "p", "text": "Around 3 ABY, while the Skywalker and Antilles were at Echo Base on Hoth, Narra and many other members of the squadron were killed in an Imperial ambush."}, {"tag": "h3", "text": "Rebuilding the squadron after Hoth"}, {"tag": "p", "text": "Following the evacuation of Hoth in 3 ABY, the Rebel Alliance had scattered its forces across the galaxy, and the Seventh Division had regrouped at a predetermined rendezvous point. With Luke Skywalker absent, Alliance High Command had to consider the possibility that he may not return. The Contessa summoned Lieutenant Commander Wedge Antilles to discuss the situation, explaining the current lack of leadership and squadron, subsequently promoted him to commander, to replace Skywalker. She told Antilles to rebuild his squadron back to full strength. Antilles and Lieutenant Wes Janson, his newly appointed executive officer, had to recruit from the limited pool of pilots available in the Division, and given the circumstances, there weren't many top offerings, but managed to scrape together enough qualified pilots to build a full the squadron of twelve."}, {"tag": "p", "text": "Top on their list, was Bela Elar and Will Scotian, who they had previously flown with, and were already experienced and capable pilots. They were assigned their own flights within the squadron. Antilles told Janson it was too soon to use the Rogue Group name due to the loss of friends still fresh in their minds from Hoth, and instead resurrected the Red Squadron name. The newcomers were put through two days of intensive sim training, in which Antilles expressed his doubts to The Contessa, however she was less concerned and asked Antilles if he, Red Leader, was ready for a mission and without thinking he said yes, which to his surprise, he meant it."}, {"tag": "h3", "text": "Attack on an asteroid mining station"}, {"tag": "p", "text": "The newly rebuilt Red Squadron, led by Commander Wedge Antilles, carried out an intial scouting mission, which revealed a old asteroid mining station nearby being used as a base for bandits along with multiple ships in the area. The very presence of the pirates threatened the safety of their rendezvous point. They dropped sensor buoys to monitor comings and goings. On reviewing the intelligence with Mon Mothma, Antilles speculated that the pirates' origin was probably the Vosch Cluster, as they had blazed a hyperspace lane to the trade worlds around Caldra Prime and Caldra Tertius, with the Alliance rendezvous point right in the middle. Antilles told Mon Mothma that his squadron could destroy the pirates, however as they weren't an experienced squadron, lots could go wrong as they weren't ready. So Mon Mothma agreed to give the squadron one more day to gather sensor data and allow an attack plan to be tested in the simulator. Failing the destruction of the pirate nest, then the fleet would jump."}, {"tag": "p", "text": "A day later, Antilles led the squadron in an attack on the pirate base. The squadron used a pincer maneuvre on the pirate base, using two flights of three X-wings that converged from opposite directions with the objective of total destruction. The squadron was split into four flights: Antilles' and Wes Janson's flights hit the targets on the landing field, while Scotian's and Elar's flights ran interference for Antilles' and Janson's flights respectively. Sila Kott and Tomer Darpen formed Antilles's wingmates, Keyser Salm and Barlon Hightower were Janson's, Ix Ixstra and Cinda Tarheel were Will Scotian's, and finally Grizz Frix and Penn Zowlie were Bela Elar's. The pirates launched Z-95 Headhunters, a Nighthawk fighter and an interceptor, resulting in a dogfight with the squadron's X-wing cover. Janson's torpedos took out the hangar, however Elar spotted a modified freighter, the pirate mothership, that tried to escape. Antilles, however, managed to destroy it before it was able to make the jump to hyperspace. Of the twelve pilots that participated, only nine returned from the mission to Home One, after the deaths of Barlon Hightower, Ix Ixstra and Penn Zowlie."}, {"tag": "h3", "text": "Battle at Elessia"}, {"tag": "p", "text": "The Empire's Commander Ellian Zahra intercepted a transmission that revealed the Alliances Fourth and Seventh Divisions were planning to rendezvous at Elessia, so Zahra initiated an attack that saw her split her forces to strike simultaneously. Zahra's primary strike force led an attack on the Alliance's Seventh Division, while her secondary strike force attempted to attack Leia Organa's Fourth Division, however the Fourth had already left their rendezvous point before the strike force arrived. The Imperial forces overwhelmed the Seventh Division's capital ships. TIE interceptors created a blockade of Home One's hangar bay, that prevented Alliance starfighters from launching, including Red Squadron."}, {"tag": "p", "text": "Shortly into the battle, the Fourth Division's ships emerged from hyperspace and immediately deployed their starfighters, led by Commander Luke Skywalker, who assumed the callsign Red Leader. Skywalker was accompanied by other starfighters, that included Green Squadron's Shara Bey (Green Three), along with Lando Calrissian and Chewbacca in the Millennium Falcon. Skywalker called for all Fourth Division fighters to form up on him, on an attack run on Home One's blockade, to push the TIEs back, while those starfighters who were trapped in the hangar bays prepared to launch, including Wedge Antilles (Red Two). As soon as Skywalker cleared the TIEs, all the Alliance starfighters aboard Home One launched to repay the favor. Skywalker then left the space battle to board the frigate where Leia Organa was under attack from an Imperial boarding party, led personally by Zahra."}, {"tag": "h3", "text": "Pre-Endor"}, {"tag": "p", "text": "At some point prior to the Battle of Endor, Wedge Antilles asked Luke Skywalker to rejoin Red Squadron, however he declined. Skywalker even discussed not going back to flying with the squadron with Leia Organa, saying that the squadron belonged to Antilles and that it wouldn't be right to swoop in and take it away from him."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "In 4 ABY, Red Squadron participated in the Battle of Endor led by Commander Wedge Antilles. The squadron was composed of a mix of starfighters, including A-wings, X-wings and Y-wings. When the Alliance fleet dropped out of hyperspace and started their assault on the second Death Star, no one could get any readings on the state of the battle station's shields. General Lando Calrissian (Gold Leader), realised the shield was still up and ordered all craft to pull up, as Han Solo's strike team hadn't yet disabled the shield. As the fleet turned away from the Death Star, a huge Imperial fleet, composed of many Star Destroyers, emerged from behind the sanctuary moon of Endor, blocking their escape, Admiral Gial Ackbar realised it was trap. The Alliance ships were swarmed by Imperial TIEs, taking out many of the rebel starfighters."}, {"tag": "p", "text": "Antilles and his fighters helped prevent TIE/IN interceptors from destroying the medical frigate Redemption, however Sila Kott (Red Three) was killed by TIEs in the process. It wasn't long before the Death Star opened fire with its superlaser on the MC80 Star Cruisers, completely destroying ships such as the Liberty. This was a surprise to the Rebels as their intelligence had suggested the superlaser wasn't supposed to be operational. Calrissian suggested the fleet move in closer to the Imperial capital ships to reduce the effectiveness of the Death Star's superlaser. Grizz Frix (Red Five) was killed when his X-wing was struck after the deflector shield generator dome from a Star Destroyer exploded."}, {"tag": "p", "text": "After Han Solo's strike team finally destroyed the shield generator on Endor and disabled the shield, Red and Gold Squadron commenced their attack run into the bowels of the Death Star, with Antilles at the front. They were closely persued by TIE Interceptors and TIE fighters, who took out one of their X-wings, piloted by Keir Santage. Calrissian ordered the starfighters to split up and head back to the surface to see if any of the TIEs would follow. When Antilles and Calrissian finally reached the main reactor core, after weaving their way through the ever narrower tunnels, Antilles fired the first shot with a pair of proton torpedoes at the power regulator on the reactor's north tower. This was followed up by a shot from Gold Leader into the main reactor, leading to its destruction. Both Antilles and Calrissian raced their way to the surface, followed by an expanding fireball that consumed one of the persuing TIE interceptors. Once clear, the Death Star exploded with a huge shockwave, forcing the retreat of Imperial forces and the end of the battle. Antilles celebrated on the forest moon below with the tribes of Ewoks and his Rebel friends."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the novelization of A New Hope, Luke Skywalker and Wedge Antilles flew for Blue Squadron. Their squadron was changed to Red Squadron when it was realized that blue markings on the ships would be replaced by moving starfield during blue screen shots. Consequently, the name of the fighter group the novelization called Red Squadron was changed to Gold Squadron for the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}