{"url": "Red_Squadron_(Galactic_Republic)/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Pages needing citation", "Category:Galactic Republic starfighter squadrons", "Category:Jedi Order starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Red Squadron  (Galactic Republic)"}, {"tag": "p", "text": "Red Squadron was a Galactic Republic starfighter squadron."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Before the Clone Wars"}, {"tag": "p", "text": "The earliest recorded predecessor to Red Squadron, and the first recorded iteration of a starfighter squadron with the \"Red\" designation—called Red Wing—was equipped with Aurek-class tactical strikefighters and fought with Admiral Forn Dodonna's fleet at the Battle of Rakata Prime, the climactic battle of the Jedi Civil War. During the confrontation, the wing reinforced the breach in the Sith battle lines formed by Green Wing, further paving the way for Dodonna's capital ships to assault the Star Forge."}, {"tag": "p", "text": "Just prior to the Clone Wars, Red Squadron was a Jedi squadron that flew A-6 Interceptors. Red Squadron saw action during the Stark Hyperspace War, where it accompanied fellow Jedi from Blue Squadron into battle against the Stark Commercial Combine at the Fifth Battle of Qotile. Both squadrons were led by the ace pilot, Jedi Master Saesee Tiin."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "At the beginning of the Clone Wars, Red Squadron was piloted exclusively by Jedi flying Delta-7 Aethersprite-class light interceptors, a new experimental craft that was built specifically for Jedi. It was commanded by Jedi General Tsui Choi, with his support, Aayla Secura. They led their squad against incoming droid starfighters at the Battle of Kamino, and took full command over the air battle when Blue Leader, General Kenobi, was shot down over the ocean."}, {"tag": "p", "text": "Red Squadron was equipped with Delta-7 Aethersprites and were flown by Jedi as the spearhead of the defense of the Galactic Senate against the Subjugator. Red Four was shot down by a Belbullab-22 fighter."}, {"tag": "p", "text": "As clones began to fill the ranks of the Grand Army of the Republic, the Z-95 Headhunter starfighters (developed just prior to the outbreak of the war) were assigned to Red Squadron's clone pilots."}, {"tag": "p", "text": "In the second year of the conflict, Red Squadron was under the command of Jedi Master Plo Koon. The Kel Dorian Master once led his fighters into battle against pirate ships attacking a diplomatic cruiser carrying Senator Bail Organa. At this point, Red Squadron was a mix of Delta-7s flown by Jedi and V-19 Torrent starfighters flown by clone pilots."}, {"tag": "p", "text": "Later, during the Clone Wars, Red Squadron fought in the Battle of Muunilinst, under the command of Anakin Skywalker. During the battle, Skywalker ordered Red Squadron to fire its arsenal of missiles across the bow of Cruiser 8, whereupon he led a wing of Nantex starfighters into the line of fire. At first Red Leader questioned the order telling him that there were no targets, until Anakin gave the order again. The campaign was ultimately successful for the Republic forces."}, {"tag": "p", "text": "Along with the complement of V-19 Torrents, Red Squadron also was at some point outfitted with BTL-B Y-wing starfighters. The ships were made available to the Republic forces after they were field tested by Shadow Squadron near the Kaliida Nebula against the Malevolence. Red Squadron was outfitted with a flight of them bearing red markings, thereby augmenting the V-19s that they fielded."}, {"tag": "p", "text": "After the development of the ARC-170 starfighter, Red Squadron was among the units in the Republic fleet to receive ARC-170s for combat. Red Squadron piloting these new ships preferred their craft to be balanced more in favor of shields than firepower when compared to their comrades in Blue Squadron, making them valuable for penetration runs."}, {"tag": "p", "text": "During the Battle of Malastare, a Red Squadron Y-wing bomber that was equipped with a prototype weapon known as an electro-proton bomb. Piloted by squadron leader Goji and clone gunner Rod, it flew in formation with Y-wings against the Separatist Droid Army. Goji successfully released the bomb on target which created a massive electromagnetic pulse, deactivating or destroying all the droid forces gathered on Malastare."}, {"tag": "p", "text": "General Kenobi, ultimately took command of Red Squadron during the last year of the war. As part of the Open Circle Fleet, Red Squadron consisted of Eta-2 interceptors, ARC-170 starfighters and V-wing starfighters.[source?]"}, {"tag": "h3", "text": "The Destruction of Red Squadron"}, {"tag": "p", "text": "During the recapture of Tythe, Anakin Skywalker and Obi-Wan Kenobi led Red Squadron through the Separatist fleet on a mission to capture Count Dooku alive. Initially managing to destroy a Techno Union battle cruiser on the way, the squadron, nonetheless, was destroyed by defending hailfire droids, STAPs, and battle droids once they reached the lower atmosphere of Tythe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}