{"url": "Red_Sith_Purge", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Battles of Kesh", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Red Sith Purge"}, {"tag": "p", "text": "In 4985 BBY, Yaru Korsin, leader of the Lost Tribe of Sith on Kesh, launched a full-fledged purge of the forty-five pureblood Sith on the planet. Ravilan Wroth, the leader of the members of the Sith species in the Lost Tribe, had embarked on a plot to poison the water supply of the city of Tetsubal, in order to convince the Lost Tribe leaders to focus on finding a way off-planet—by then, the Sith had been stranded on the remote world for fifteen years. However, his ploy was discovered by Yaru Korsin's wife Seelah, who framed him for similar deadly incidents in other neighboring towns. Convinced that Wroth and the purebloods needed to be eliminated, Korsin enacted a purge that lasted through a single night, and though the purebloods fought back with everything they had, they lost more and more of their ranks throughout. Eventually, Wroth was taken prisoner as the last remaining purebloods fought back against Yaru Korsin and his lieutenants in a last stand high in the Takara Mountains. While the last holdouts were killed, Wroth was executed by Seelah Korsin's son Jariad, and the bodies of the dead were put on public display in the city of Tahv. With the purge, all of the non-Human members of the Lost Tribe of Sith—save for the Houk Gloyd, a personal friend of Yaru Korsin—had been wiped from the face of Kesh."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 5000 BBY, a Sith starship known as the Omen was knocked off course during a hyperspace jump and crash-landed on the remote planet Kesh. After a chaotic first few nights in the mountains where the Omen came to rest, the Sith found their way to a relatively primitive civilization of Keshiri natives. Posing as the Keshiri gods, the Sith quickly took their place as rulers of Kesh. The Omen's crew had contained a sizable number of pureblood Sith, of whom only fifty-seven remained when the Sith made it out of the mountains. By 4985 BBY, twelve had died due to general misfortune, and no pureblood Sith children had survived more than a day. Meanwhile, the Human population of the Lost Tribe of Sith flourished. The most prominent member of the purebloods on Kesh was Ravilan Wroth, who often represented his compatriots in front of Lost Tribe leader Yaru Korsin."}, {"tag": "p", "text": "However, Wroth had his own gripe with the Lost Tribe, as he wanted Korsin to withdraw his people from Keshiri affairs and focus on finding a way off Kesh. To that end, Wroth came up with a plan—on a research trip to the Ragnos Lakes region, Wroth decided to poison the water supply of the city of Tetsubal in order to create the appearance of a deadly virus ravaging the planet. Wroth successfully carried out his plan, using the compound cyanogen silicate to kill all 18,000 Keshiri residents of Tetsubal. However, his plan was discovered by Yaru Korsin's wife Seelah, who, already holding a prejudice against the purebloods, decided to frame Wroth for further crimes. Korsin performed the same deadly deed on seven other towns near Tetsubal, killing hundreds of thousands of Keshiri. Seelah was able to present her husband with the information that Wroth and his retinue had visited all those towns in recent days, as well as evidence that he had access to cyanogen silicate. Convinced of Wroth's complicity in the deaths, Korsin proclaimed that it was time for the non-Human members of the Lost Tribe to be eliminated."}, {"tag": "h2", "text": "The purge"}, {"tag": "p", "text": "In a single night, all of the \"Fifty-seven,\" as the non-Human Sith of Kesh were known—except for the Houk Gloyd, a close friend of Yaru Korsin—were killed. The Fifty-seven did not go quietly, fighting the Lost Tribe assassins throughout the darkness in the mountains, though they could not withstand the attack for long. A young sentry was trapped and killed, never abandoning his post until the bitter end. Another prominent member of the Fifty-seven, the cyborg translator Hestus, was personally brought down by Seelah Korsin herself. The dead were beheaded and put on display in a plaza in the city of Tahv, even while the remnants of the Fifty-seven still held out against Yaru Korsin and his chief lieutenants. The final living members of the Fifty-seven were driven to a last stand high in the Takara Mountains, close to the Omen's original crash site. No quarter was given, and Yaru Korsin threw any who surrendered over the side of a cliff. Meanwhile, the wounded Ravilan Wroth was brought to the plaza where those already killed were displayed. Confronted by Seelah Korsin, Wroth admitted his complicity in the deaths at Tetsubal, but not in any of the other cities. Revealing her deception, Seelah took credit for those deaths, as well as the deaths of all the infant pureblood Sith who had been born on Kesh since the Omen's crash, saying that Wroth and his people would have done the same to Seelah and her kind eventually. With that, Jariad Korsin, Seelah's son, emerged from the darkness and killed Wroth, completing the purge."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With that, all of the non-Human crewmembers of the Omen, save Gloyd— who himself would perish along with Yaru Korsin in a lightsaber duel ten years later—were killed. Little did the Lost Tribe know that their purge was secretly supported by a Keshiri resistance movement dedicated to overthrowing Sith rule on Kesh. Tilden Kaah, a secret operative of the resistance movement and the personal attendant to Seelah Korsin, brought the news to resistance leader Adari Vaal immediately after the purge's completion. Although the Lost Tribe suffered a population loss due to the purge, it was more than made up for by a rapid increase in births over the next decade. In the years following the bloodshed of the purge, Yaru Korsin looked on the purge as an unfortunate but ultimately necessary event, as a homogenous Lost Tribe was easier to rule. Little knowledge of the Fifty-seven or the purge survived for very long, as Seelah Korsin took steps to erase them from history. Still, Keshiri tales spoke of \"deformed\" crewmembers of the Omen and their elimination. In fact, by 3000 BBY, there was an active political faction on Kesh known as Force 57 that was comprised of physically imperfect members of the Lost Tribe, who revered Ravilan Wroth and the original Fifty-seven."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The purge of the Fifty-seven first appeared in John Jackson Miller's 2010 eBook, Lost Tribe of the Sith: Paragon. The event was also mentioned in two subsequent sequels, Savior and Pantheon, along with the 2012 reference book The Essential Reader's Companion. In his production notes for Paragon, Miller revealed that he used the purge as a \"story springboard\" to move the Lost Tribe from its more diverse form seen in the Sith of the Tales of the Jedi comic book series to the homogenous kind found in the later Fate of the Jedi novels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}