{"url": "Redemption_scenario", "categories": ["Category:Legends articles", "Category:Combat tactics"], "nodes": [{"tag": "h1", "text": "Redemption scenario"}, {"tag": "p", "text": "The Redemption scenario was a training scenario used for New Republic pilot trainees, particularly Rogue Squadron hopefuls; its difficulty led many who flew in it to nickname it the Requiem scenario."}, {"tag": "h2", "text": "Historical scenario"}, {"tag": "p", "text": "The Redemption scenario was based on an incident in Rebel history which took place shortly after the Battle of Brigia. Several shuttles, along with the CR90 corvette Korolev were transferring wounded personnel to the EF76 Nebulon-B escort frigate Redemption. The Imperial Nebulon-B frigate Warspite dropped out of hyperspace and launched TIE Series fighters. It then jumped to hyperspace again, emerging on the other side of the transfer and launching more fighters. The defending Rebel X-wings had moved to intercept the first wave and were out of position for the second wave. Historically, the pilots of Red Squadron, particularly Keyan Farlander, were able to evade the TIE/LN starfighters long enough to destroy both waves of TIE/sa bombers and all Rebel ships escaped successfully."}, {"tag": "p", "text": "Key to their success was Farlander's decision to use his proton torpedoes to destroy the first wave of TIE Bombers quickly, along with ignoring the threat of the TIE Fighters, which were attacking the X-wings themselves, until all TIE Bombers had been destroyed."}, {"tag": "h2", "text": "Simulation"}, {"tag": "p", "text": "The difficulty of preventing the multiple TIE Bomber groups from launching proton torpedoes at the Korolev made the mission an ideal choice for a training simulation. In the simulation, pilot trainees could fly as either the Rebel defenders or the Imperial aggressors. The sides typically consisted of four Rebel pilots and as many as a dozen Imperial pilots, making any Rebel pilot to accomplish their goal and still survive a truly skilled flyer."}, {"tag": "p", "text": "In the simulator, the Rebel pilots were instructed to defend the frigate from the TIEs. If they were not careful, the Warspite could move further in system and join in the attack, however they were free to experiment with their strategy. Meanwhile those piloting the Imperial fighters were restricted to the original strategy and much of their initial run sequence was preprogrammed."}, {"tag": "h2", "text": "Strategy"}, {"tag": "p", "text": "The textbook strategy was to send a single X-wing to confront the first wave of TIEs, while the other three remained as close support for the transfer. This would result in the Warspite launching subsequent waves from a large distance rather than putting itself at unnecessary risk. If all fighters moved off to confront the first wave before Warspite entered hyperspace, as had happened originally, the Warspite would return much closer to the Korolev making subsequent waves much harder to reach before they could launch torpedoes. Only when the Warspite was in hyperspace would it be safe for all X-wings to move out to engage."}, {"tag": "p", "text": "The weakness of this strategy was that it forced a single X-wing to deal with five fighters at once, two TIE Fighters and three TIE Bombers. That same X-wing would then have to turn right round to confront the next wave from a different direction. However, most other strategies proved disastrous."}, {"tag": "p", "text": "Farlander's technique became a favorite for the single pilot, using proton torpedoes to target the bombers, and then mixing it up with the starfighters. This technique recognized that only the bombers could hurt the two vulnerable capital ships with their torpedoes. Corran Horn was known to be one survivor of the scenario, by using a variation on this technique in which he initially engaged with lasers and used torpedoes to destroy any bombers that made it past him before they could get into launch range. Among the bomber pilots \"killed\" was Horn's rival Bror Jace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This event is mentioned in the book X-Wing: Rogue Squadron, however it is based on an actual mission level from the game Star Wars: X-Wing. The strategies recommended in the book are, in fact, actual strategies used in the level."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}