{"url": "Redeemer", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Ships of the Open Circle Fleet", "Category:Venator-class Star Destroyers"], "nodes": [{"tag": "h1", "text": "Redeemer"}, {"tag": "p", "text": "The Redeemer was a Venator-class Star Destroyer of the Galactic Republic naval forces' Open Circle Fleet during the Clone Wars. In 21 BBY, the Redeemer served in a fleet with two other Venators—Resolute and Defender—that was commanded by Jedi General Anakin Skywalker and his Padawan, Jedi Commander Ahsoka Tano. The fleet was dispatched to the planet Ryloth in an attempt to break a Separatist blockade under the command of Neimoidian Captain Mar Tuuk."}, {"tag": "p", "text": "Upon the arrival of Skywalker's fleet in the Ryloth system, Tuuk lured the Republic forces into a trap; while their squadron of starfighters commanded by Tano was distracted, the Neimoidian summoned Separatist reinforcements to the system. The reinforcements caught Skywalker's fleet off guard, forcing it to retreat, with the Redeemer taking heavy fire and breaking apart in space before it could jump into hyperspace."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Venator-class Star Destroyer, the Redeemer had two bridges and a dorsal hangar bay. The Star Destroyer was also equipped with a hyperdrive and eight engine units, and was armed with eight DBY-827 heavy turbolaser turrets (four port, four starboard) and two medium dual turbolaser cannons (one port, one starboard). Either side of the Redeemer's hull featured the emblem of the Open Circle Fleet."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Strike on the blockade"}, {"tag": "p", "text": "In 22 BBY, during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, the planet Ryloth was invaded by the droid armies of the Confederacy, resulting in the establishment of a blockade in the planet's orbit. In response to the invasion, in 21 BBY, the Redeemer was dispatched by the Republic Navy as part of a fleet including two other Venator-class Star Destroyers—the Resolute and the Defender—under the command of Jedi General Anakin Skywalker and his Padawan, Jedi Commander Ahsoka Tano, to break through the blockade, which would allow a Republic invasion fleet to land on the planet."}, {"tag": "p", "text": "Arriving in the Ryloth system, the Redeemer exited hyperspace alongside the two other Venators, where they proceeded to engage the Separatist blockade. Remaining behind for support fire, the three Star Destroyers deployed the V-19 Torrent starfighter Blue Squadron, led by Tano, against Neimoidian Captain Mar Tuuk's Lucrehulk-class Battleship and its two accompanying Munificent-class star frigates. The squadron managed to cut a path through a swarm of enemy vulture droid starfighters directly to the Separatist command ship, but as the V-19s approached the Lucrehulk, Tuuk summoned four additional Munificents from hyperspace to reinforce his fleet. This caught the Republic off guard and resulted in extensive damage to the Redeemer and the two other Star Destroyers."}, {"tag": "h3", "text": "Redeemer's demise"}, {"tag": "p", "text": "With Skywalker's fleet outnumbered and taking heavy damage, Republic Admiral Wullf Yularen ordered a full withdrawal from the system, calling Tano and her squadron back to the Resolute to provide starfighter cover. However, believing that she could still break through the blockade, the young Jedi disobeyed her superior's order. Due to Tano's disobedience, the Redeemer and the fleet continued to suffer heavy damage from Vulture droid suicide attacks. After losing most of Blue Squadron to enemy fighters, Tano returned to the fleet, allowing for the Defender and the Resolute to make their retreat to hyperspace. However, before it could jump, the Redeemer's hull tore apart in space due to the extensive damage it had suffered, destroying the vessel."}, {"tag": "p", "text": "Despite the loss of the Redeemer, Skywalker and his dwindling forces later broke through the blockade in a second assault. The blockade's destruction allowed an invasion fleet led by Generals Obi-Wan Kenobi and Mace Windu to land on the surface, eventually resulting in the liberation of Ryloth from the Separatist Alliance with help from the native freedom fighters led by General Cham Syndulla."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Redeemer made its first appearance, although only in the episode's opening newsreel, in \"Jedi Crash,\" the thirteenth episode of the first season of the Star Wars: The Clone Wars television series, which aired on January 16, 2009. It later made its full appearance and was identified as the Redeemer in the first season's nineteenth episode, \"Storm Over Ryloth,\" which aired on February 27 of that same year."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}