{"url": "Redcrested_cougar", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Carnivorous creatures", "Category:Creatures of the Dalonbian sector", "Category:Felines", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Redcrested cougar"}, {"tag": "p", "text": "Redcrested cougars were large, non-sentient, carnivorous felines native to the Outer Rim planet Belkadan. Armed with large claws, fangs, and a bone-tipped tail, the cougars dwelt in Belkadan's jungles and occasionally attacked sentient beings. Redcrested cougars could not breathe Belkadan's atmosphere after it was changed to noxious fumes by dweebits released by the Yuuzhan Vong."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Redcrested cougars were four-meter-long felines that averaged 140 kilograms in mass and possessed a red crest. The agile cougar's paws sported huge claws, and its fangs measured ten centimeters. The tail of a redcrested cougar ended in a lump of bone, which allowed the tail to be swung like a club."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "A non-sentient carnivore, redcrested cougars dwelt in jungles and could travel through the trees. Night hunters, the felines sometimes attacked sentient beings, and when exposed to a strange scent, the cougars worked to identify it. Redcrested cougars occasionally roared or growled."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Redcrested cougars were native to the Outer Rim planet Belkadan, where they lived by 22 ABY. Around that time, the Extragalactic Society created the listening post ExGal-4 on Belkadan, and soon after its creation, a redcrested cougar breached the facility's walls by jumping over them from atop a tree and managed to seriously wound two ExGal-4 members before it was killed by researcher Danni Quee."}, {"tag": "p", "text": "In 25 ABY, to prepare for an extra-galactic Yuuzhan Vong invasion of the galaxy, Yuuzhan Vong warrior Yomin Carr, disguised as a researcher at ExGal-4, released insect-like dweebits on Belkadan. These dweebits mutated plant life on the planet and converted the atmosphere into a haze that was unbreathable and lethal for both the ExGal-4 researchers and the redcrested cougars of the jungles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Redcrested cougars appeared in 1999's The New Jedi Order: Vector Prime, the first novel of The New Jedi Order series, by R. A. Salvatore."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}