{"url": "Rediscovery_of_Lira_San", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles in Wild Space", "Category:Missions of the Ghost", "Category:Events of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Rediscovery of Lira San"}, {"tag": "p", "text": "In 3 BBY, a group of Lasat who survived the destruction of Lasan rediscovered Lira San, the ancient Lasat homeworld. They were aided by the rebel crew of the Ghost, including Garazeb Orrelios, former captain of the Lasan High Honor Guard and one of the few other survivors of their homeworld's fall."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the early years of the Galactic Empire, Imperial forces attacked the planet Lasan, the homeworld of the Lasat species. Imperial Military forces utilized deadly weapons including the T-7 ion disruptor rifles which killed many Lasat and devastated much of the planet. Many of the surviving Lasat were forced to flee offworld. One Lasat refugee Garazeb Orrelios, a former Captain in the Lasan High Honor Guard, joined a rebel cell known as the Spectres. For a long time, Zeb believed that he was the only remaining Lasat in the galaxy."}, {"tag": "p", "text": "In 3 BBY, two other Lasat refugees, the former Honor Guard Gron and Chava the Wise, decided to find the legendary Lasat refuge of Lira San, which lay in Wild Space. On they way, they smuggled themselves in a shipping container to Nixus Hub 218. The Weequay pirate Hondo Ohnaka leaked the information to both the rebel Ezra Bridger and the Empire, hoping to make a quick profit. Ezra and the other Spectres traveled to Nixus and managed to rescue Gron and Chava from the Empire. They then managed to evade Imperial stormtroopers and flee the spaceport. However, Hondo was captured by the Empire and forced to work for the Imperial Security Bureau Agent Kallus, a perennial foe of the Spectres."}, {"tag": "h2", "text": "Voyage to Lira San"}, {"tag": "h3", "text": "A leap of faith"}, {"tag": "p", "text": "Chava believed that Lira San could only be found after an ancient prophecy was fulfilled. According to this Lasat legend, a \"Child of Lasan\" had to first save the Fool and the Warrior from themselves. In order to prepare for the voyage, Chava and Gron began a ritual that involved chanting incessantly in the Lasat language, Despite being reunited with his fellow Lasat, Zeb had little faith in their quest to find Lira San, which he regarded as a myth. In private, Zeb confided that his despondency stemmed from his failure as a Captain to protect the royal family and his homeworld. Ezra reassured his friend that he was not to blame for the Fall of Lasan and convinced Zeb to redeem himself by taking part in Gron and Chava's ceremony to find Lira San."}, {"tag": "p", "text": "Zeb agreed to participate and reluctantly accepted his role as the prophesied \"child.\" Activating his bo-rifle in the ancient Lasat way, Zeb's rifle was able to interact with Chava's staff. The astromech droid Chopper then projected a holographic map of the Galaxy. Zeb's rifle created a surge of energy that pointed to a system in Wild Space. To test the prophecy, captain Hera Syndulla plotted a course for Lira San using the coordinates from Chopper's star map. As the rebels approached their destination, Hera was forced to pull their starship Ghost out of hyperspace due to an imploded star cluster blocking their path. Chava recognized this black hole as the maze prophesied in the legend."}, {"tag": "h3", "text": "Imperial entanglements"}, {"tag": "p", "text": "The Spectres' problems were further compounded by the arrival of an Arquitens-class command cruiser commanded by Agent Kallus and Admiral Kassius Konstantine. Kallus had been able to track them down due to a tracker that Hondo had planted in the transmitter he had lent Ezra. Kallus give the rebels one minute to surrender before destroying their vessel. Chava recognized Kallus as playing the role of the \"warrior\" and pointed out that everyone fulfilled the three different roles at different stages."}, {"tag": "p", "text": "Taking another leap of faith, Zeb activated his bo-rifle and used it to guide the Ghost through the perilous maze. With his ultimatum having expired, Kallus dispatched two TIE fighters after the Ghost. However, they were destroyed by the gravitational pull of the star cluster. Kallus then ordered his warship to open fire on the rebel ship but the laser blasts merely bounced off the ship's hull. With the light cruiser sustaining damage, Kallus ordered a retreat and left the rebels to meet what he presumed was their demise. As the rebels approached the star cluster, they were knocked out by a bright blast of light. The Ghost's hyperdrive then mysteriously made a jump to Lira San's location."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Upon awakening, the Spectres and their Lasat passengers found that they had made it through the star cluster. They also spotted Lira San in the distance. While Zeb, Gron, and Chava traveled to Lira San on the auxiliary ship Phantom, the other rebels waited on the Ghost for their return. Shortly later, Zeb arrived back and informed his fellow rebels that Lira San was home to millions of Lasat already and was in fact the original Lasat homeworld. While most of the rebels greeted this news with joy, Chopper grumbled due to his difficult relationship with Zeb. Using the course plotted through the imploded star cluster, Hera took the Ghost back to the known Galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rediscovery of Lira San formed the basis for the plot of the Star Wars Rebels episode \"Legends of the Lasat\", which premiered on Disney XD on February 3, 2016. The episode explored Zeb's origins and the Lasat species in further detail."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}