{"url": "B1-0516", "categories": ["Category:Canon articles", "Category:B1 battle droids", "Category:Galactic Republic droids", "Category:Galactic Republic military personnel", "Category:Masculine programming", "Category:Separatist defectors", "Category:Separatist droids", "Category:Separatist military members"], "nodes": [{"tag": "h1", "text": "B1-0516"}, {"tag": "p", "text": "B1-0516, nicknamed Bats, was a B1-series battle droid in the droid army of the Confederacy of Independent Systems. During the Clone Wars, B1-0516 fought in a battle against the Galactic Republic on Horain, where his processor was short-circuited by a stray blaster bolt. The damage caused B1-0516 to fight with the Republic army, and assisted General Obi-Wan Kenobi and Captain Rex, who gave the battle droid the nickname \"Bats\" for easier pronunciation."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At some point during the Clone Wars, B1-0516 served in a unit of the Separatist Droid Army on the planet Horain in the Crantori system. While in the midst of a battle with the Galactic Republic, B1-0516 encountered Jedi Master Obi-Wan Kenobi and Clone Captain Rex alongside a unit of droids. The Separatists engaged the pair, in the midst of which B1-0516's processor was damaged by Kenobi's deflection of a blaster bolt. As the droid came to terms with itself, it began to question why so many battle droids were attacking them. Stating that the skirmish seemed unfair, as there were so many droids in contrast to the two of them. This logic convinced the droid to aid the pair in fighting off the advancing Separatist forces."}, {"tag": "p", "text": "Saluting his new superiors, B1-0516 offered his service to the Republic, gaining the nickname \"Bats.\" As a new wave of Separatist reinforcements began to advance on their position, Bats gained the attention of the droid commander, appearing from behind a downed All Terrain Attack Pod with Kenobi and Rex. Claiming that the two were his prisoners, the commander complimented Bats on his efforts, stating that the pair must be taken to Count Dooku immediately. Showcasing his new affliction, Bats quickly turned on the Separatists, wielding a pair of E-5 blaster rifles and destroying several droids while his superiors escaped. Despite putting up a sizable resistance, Bats was overwhelmed and captured, being taken to a nearby Separatist garrison for analysis."}, {"tag": "p", "text": "There, the commanding tactical droid suggested that Bats' original programming be restored with a memory wipe, stating that there were still several clone troopers on Horain that required blasting. Resisting this attempt, Bats fought off the nearby guards utilizing the detached arm of another battle droid. The tactical droid attempted to reason with Bats, ordering him to submit to reprocessing immediately. Continuing to resist, Bats prepared to fight off his oppressors until an unregistered Armored Assault Tank breached the garrison. Believing the infiltration the result of another malfunctioning battle droid, the tactical droid ordered tank to be taken down, only for Kenobi to emerge from the tank, quickly dispatching a OOM command droid and rescuing Bats, who had taken to opportunity to assault the T-1 with the dispatched arm. Entering the hijacked tank, Bats and his companions quickly left the garrison and returned to the Republic Evacuation Point. Reuniting with Anakin Skywalker and his forces, Kenobi and Rex introduced Skywalker to Bats and stated that they could find an undercover battle droid useful for future missions. Bats then proceeded to board a Republic gunship with his companions, pleading to receive his own lightsaber from Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}