{"url": "B1-Series_battle_droid", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:B1 battle droid models", "Category:B1 battle droids", "Category:Imperial droids", "Category:Masculine programming", "Category:Trade Federation battle droid models"], "nodes": [{"tag": "h1", "text": "B1-Series battle droid"}, {"tag": "p", "text": "B1-Series battle droids, also referred to as B1 battle droids or standard battle droids, were battle droids that made up the backbone of the Trade Federation Droid Army and the Separatist Droid Army. Often called \"Clankers\" by Galactic Republic clone troopers, they were the basis for the more advanced OOM-series battle droid."}, {"tag": "p", "text": "B1s were perhaps the most numerous—and expendable—soldiers in galactic history, and unlike most organic soldiers, they were capable of action in hostile environments such as underwater or in space. They were designed, for the most part, to defeat their enemies through sheer numbers, not through their ability to think (they were very vulnerable to tricks) and utilize combat skills (unlike clone troopers)."}, {"tag": "p", "text": "The B1 battle droid was frequently used as a soldier for the Trade Federation. As a result, B1s were present in nearly every battle involving the Trade Federation."}, {"tag": "p", "text": "Early battles involving the droids required a central computer for the droids to \"think\" from, but this was mostly removed post–Battle of Naboo after an attack destroyed the mainframe stationed there, resulting in all the droids on the planet being deactivated."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "B1 battle droids stood 1.93 meters tall and were humanoid in form. Their long, elongated heads atop tall, slender necks were designed in imitation of their builders at Baktoid's Geonosian foundries. Superstitious Neimoidians were known to spread the rumor that B1 battle droids' heads were designed to imitate the shape of a Neimoidian's withered skull after death, and many species found the B1's appearance disturbing."}, {"tag": "p", "text": "Some B1 units, designated the OOM-series, were given expanded programming and color-coded according to function, such as commander or security. Some were painted with different colors to blend into a certain environment, such as the reddish-colored B1 droids manufactured on Geonosis. B1s were usually slaved to a central control mainframe located on a remote starship or another well-defended facility. However, this could lead to massive failure if the central control mainframe was destroyed, such as during the Battle of Naboo, in which Anakin Skywalker destroyed the Droid Control Ship. The monumental defeat at Naboo spurred interest in independent battle droids, and this technique gained ground following the battle and during the Clone Wars."}, {"tag": "p", "text": "The electromagnets that kept their limbs attached could malfunction. During the Clone Wars, Galactic Republic clone troopers learned to aim at the hips, torsos, and arm joints of the B1s to quickly destroy them. But a head shot was the only decisive way to disable a droid. They didn't need arms, legs or even bodies to pass intel to central command."}, {"tag": "p", "text": "B1s were designed for cheap mass-production. As a result, they were very flimsy and vulnerable, but were capable of swarming an enemy with their hugely superior numbers. Other models, like the droideka, B2 super battle droid, grapple droid, and B1-A air battle droid, were more expensive and as a result less widely used but better soldiers."}, {"tag": "p", "text": "Battle droids used E-5 blaster rifles, SE-14 blaster pistols, and thermal detonators in combat. They spoke in a high-pitched monotone. The voice varied between units around the time of the Battle of Naboo, and at some point during the Clone Wars their voices were uniformly changed to a more high-pitched version."}, {"tag": "h3", "text": "Performance"}, {"tag": "p", "text": "B1 droids employed unsophisticated tactics in battle. Massed parade ranks or simple swarms were used, and they didn't often display a concept of cover. During the Clone Wars, however, there was the inevitable development of wartime, and B1 programming began to show some improvement. Nevertheless, their in-battle reactions were often slow, and such initiative as was shown was slight. General Grievous, the commander of the droid army, hated battle droids for their weakness in comparison to the Republic's clone troopers."}, {"tag": "p", "text": "Although they appeared to be weak, B1s were able to take down an enemy in hand-to-hand combat as seen in the Battle of Grassy Plains where battle droids were able to take Gungan soldiers one-on-one."}, {"tag": "p", "text": "Although the earlier generations were entirely dependent on Central Control Computers, post-Naboo models were retrofitted with cognitive models that allowed independent thought, and featured a greater degree of independence and personality. However, labored with more and more specialized roles that pushed the limits of their programming, many older droids developed personality quirks and a tendency to excessively comment on their situations in an attempt to handle the data overflow that had strained their inadequate logic modules."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "B1s were used by a variety of governments and armed forces. Even smugglers were known to use them, but in smaller amounts compared to the galactic armies of the commerce guilds."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "B1 battle droids were used extensively during the Invasion of Naboo by Viceroy Nute Gunray. Although the droids were statistically flimsy, with overwhelming numbers they were able to subdue the Naboo and maintain surface control of the planet. The Trade Federation invasion force which held Naboo until the Battle of Naboo was mostly composed of B1s, droidekas and other mechanized vehicles such as AATs, MTTs, STAPs, and PACs."}, {"tag": "p", "text": "Upon their arrival to the Trade Federation blockade of the planet, Jedi Knights Obi-Wan Kenobi and Qui-Gon Jinn highlighted weaknesses of the droids. These technical shortcomings, including a slow reaction time, weapon inaccuracy, and straight-forward tactics, stemmed from the nature of the Trade Federation quantity-over-quality production of B1s."}, {"tag": "p", "text": "The \"primitive\" Gungan Grand Army and the bulk of the Trade Federation invasion force ultimately fought openly in the Battle of Grassy Plains. Although the uneven nature of the terrain and innovative tactics of the Gungans initially posed a problem, the overwhelming supply of B1s and other machines on the battlefield proved to be the trump card."}, {"tag": "p", "text": "The turning point and saving grace of the Battle of Naboo proved to be the destruction of the Droid Control Ship by Anakin Skywalker. After the Central Control Computer of the droid army was destroyed, all mechanized units on the Grassy Plains reset and became inanimate, harmless constructions."}, {"tag": "h3", "text": "Post-Naboo"}, {"tag": "p", "text": "Upon the closure of the Naboo crisis, the Galactic Republic passed legislation that prohibited the Trade Federation's use of droid armies and the development of military hardware. The Trade Federation, however, relocated its military research and production centers to extra-Republican territories, like Geonosis."}, {"tag": "p", "text": "During this time, the Trade Federation began to recuperate from Republic ordinance and the incredible financial loss from the Naboo fiasco. Existing models of battle droids were improved and new generations of soldiers were developed, such as the Super Battle Droid."}, {"tag": "p", "text": "The B1s, however, were retooled and refitted. Learning from the destruction of the Droid Control Ship above Naboo, the Trade Federation upgraded B1s with on-board independent intelligence centers that could operate without a master signal. The spherical centers of the Droid Control Ships were also redesigned to operate on land, which proved to be easier to defend. These newly retrofitted droids were able to be programmed with new tasks, and B1s became warship crewers, pilots, gunners, and emergency responders. However, these tasks pushed the B1s to the limits of their capabilities, and they proved to be rather poor in specialized roles. The entry of the Trade Federation into the Confederacy of Independent Systems did not improve unit quality, as the Neimoidians refused to spend more money on improving their droids and the Techno Union reserved its more powerful cognitive modules for newer, ever-more deadly war droids."}, {"tag": "p", "text": "These problems would be compounded as the Clone Wars went on. Maintenance became exceedingly problematic: diagnostics and memory defragmentation routines tended to erase retrofitted speciality programming, so they were frequently skipped. Cognitive modules gradually suffered data corruption and system errors, leading to shutdowns or behavioral anomalies. To the annoyance of Separatist commanders, B1s became \"chatty,\" offering running commentaries on their situations as their modules struggled to process data overflows."}, {"tag": "p", "text": "Following the invasion of Naboo, the Ultragungans kept a large amount of B1 battle droids as spoils of war."}, {"tag": "h3", "text": "Battle of Geonosis"}, {"tag": "p", "text": "In 22 BBY, Jedi Knight Obi-Wan Kenobi, whilst tracking Jango Fett to Geonosis, discovered the droid foundry there and contacted the Jedi Council before being convicted for espionage. His apprentice Anakin Skywalker and Padmé Amidala tracked him but were also captured. All three were sentenced to be executed. However, when the three escaped their chains and the arena beasts, and a team of two hundred Jedi arrived, B1s, alongside new B2 super battle droids, entered the arena to stop the Jedi. Many droids were destroyed, but the rest overwhelmed the Jedi through sheer numbers and herded the surviving twenty into the center of the arena. However, clone troopers arrived and rescued the Jedi, and a huge battle ignited outside."}, {"tag": "p", "text": "B1s fought clone troopers and Jedi alongside other Separatist droids. However, the clones proved superior, and the battle was won for the Republic. However, many droids escaped the planet aboard Trade Federation core ships, Techno Union Hardcell-class transports, and other ships. The Clone Wars had just begun."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "After the Trade Federation joined the Confederacy of Independent Systems, they became a majority of the Separatist Droid Army. B1s would be the Confederacy's most common soldiers, with alleged quintillions churned out on countless CIS factory worlds. However, their uselessness frustrated Confederate commanders, such as General Grievous. The battle droids earned the nickname by clone troopers of \"clankers.\""}, {"tag": "p", "text": "B1 battle droids would often serve on board starships and battleships. They would man turrets, work computer consoles, drive warships, and serve as security aboard the vessel."}, {"tag": "p", "text": "They participated in many battles including, but not limited to, the First Battle of Geonosis, Battle of Muunilinst, Battle of Cato Neimoidia, Battle of Coruscant, and Battle of Kashyyyk.' Despite their notable combat ineffectiveness, B1 Battle Droids did successfully eradicate the Nightsisters clan on Dathomir. Training models were even used on Kamino for the practice tests of Clone cadets."}, {"tag": "p", "text": "During the Clone Wars, ARC Prudii Skirata spoke to and managed to \"convince\" an important Separatist metallurgist to give him vital clues on the metallurgic structure of droids. By adding 5% extra carvanium to the droids via the main factory computer at Olanet, these droids crumbled when hit with any weapon. The sabotage acts were so successful that the kill ratio for clone troopers was raised from 20 droids per clone to 50 droids per clone during the first year of the Clone Wars."}, {"tag": "p", "text": "The Separatists eventually plotted to replace the B1 with an updated battle droid model, the designs of which were stored on a datachip in an factory. During a Republic raid, a single B1 droid ensured the plans were recovered to Dooku, but the B1 disobeyed his masters by destroying the chip after learning of its purpose, ensuring his B1 brethren would not be reduced to spare parts. Following the execution of the Separatist Council by Darth Sidious's new apprentice, Darth Vader, most, if not all, of the B1s were de-activated. However, some would be re-activated to serve in the various Confederate Remnants, such as the one controlled by Geonosian Gizor Dellso."}, {"tag": "h3", "text": "Post–Clone Wars"}, {"tag": "p", "text": "Soon after Order 66, surviving Jedi Olee Starstone and Roan Shryne fled to Jaguada, a former Separatist base. Attempting to contact Jedi on Coruscant, they accidentally activated the droid guards. Vader discovered their position, and sent troops from the planet to destroy them. The Jedi used the activated droids to serve as a rear-guard against the troopers."}, {"tag": "p", "text": "During the rise of the Empire, some B1s were reactivated and reprogrammed for use as security droids. In addition, some were used by Darth Vader to have Falco Sang undergo various intense trials. He initially had the droids armed with stun blasters, although Sang saw through the ruse and ceased either evading the attacks or even shooting back, and also attempted escape twice. Upon learning this, Vader ordered the staff to replace the stinger blasters with live blasters, also giving strict orders to have them wound him rather than kill him."}, {"tag": "p", "text": "At some point before 12 BBY, Gizor Dellso reactivated a droid army on Mustafar. Shortly after this, the 501st Legion quickly destroyed the army and Dellso in the Battle of Mustafar."}, {"tag": "p", "text": "During the Galactic Civil War, B1s left over from the Clone Wars were discovered on Geonosis by Rebel pilot Wedge Antilles after crash landing in his X-wing. Several stormtroopers that had landed on the planet in escape pods managed to destroy many droids by using E-web blasters, but they ultimately fell to the battle droids' overwhelming blaster fire."}, {"tag": "p", "text": "Other B1s that weren't deactivated were used in the Death Watch bunker, known crash sites on Tatooine, Separatist holdouts, Stone Wall Labs and Borvo's Vault on Naboo, and even on Kashyyyk. Osaji Uhares repaired some and used them as his bodyguards on Centares."}, {"tag": "p", "text": "Some of these droids were used by Black Sun pirates in the Death Watch bunker. The Jawa warlord Wittin used one on a Single Trooper Aerial Platform to compete in Jabba Desilijic Tiure's demolition games."}, {"tag": "p", "text": "The IG-97 droid bore a close resemblance to the original B1 battle droid, although being developed by Holowan Mechanicals after plans by Phlut Design Systems who had been working for the InterGalactic Banking Clan."}, {"tag": "h3", "text": "Impact on galactic society"}, {"tag": "p", "text": "Toy versions of the B1 battle droid were manufactured. Jango Fett's cloned son Boba Fett had some during his youth on Kamino."}, {"tag": "p", "text": "The Confederacy's extensive use of B1s contributed to the general distrust of droids in galactic society during the Imperial Period."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "B1 battle droids first appeared in 1999 with the release of Star Wars: Episode I The Phantom Menace. Star Wars Episode I: The Visual Dictionary provides a key to color coding in relation to their rank and function, and a table to decipher their numerical digits."}, {"tag": "p", "text": "The earliest designs of the battle droid were clearly inspired by the stormtroopers of the original trilogy, suggesting the evolution of large-scale combat in the Star Wars galaxy. The finished droid's proportions are reminiscent of African sculpture. Early design had towering droids twice the height of humans, but subsequent iterations brought their height down to human size."}, {"tag": "p", "text": "The \"B1\" designation originated with the Star Wars Roleplaying Game, to differentiate the battle droid from other models introduced in Star Wars: Episode II Attack of the Clones, and the name was retroactively applied to its earlier appearances. Prior to this, the Roleplaying Game had once identified it as the \"Nemoidian Series.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}