{"url": "Reekeene%27s_Roughnecks", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic military units"], "nodes": [{"tag": "h1", "text": "Reekeene's Roughnecks"}, {"tag": "p", "text": "Reekeene's Roughnecks was a Rebel unit that performed guerrilla attacks against the Galactic Empire in Fakir sector and Thuris sector. Led and named by General Lens Reekeene, the Roughnecks became one of the best resistance teams of the Rebel Alliance."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Roughnecks was a unit of the Alliance to Restore the Republic, specifically of a division known as The Irregulars, formed by similar guerrilla units through the galaxy. The Roughnecks were known to be one of the more effective members of the Irregulars. They were considered an elite team of the Alliance Special Forces."}, {"tag": "p", "text": "Reekeene's Roughnecks performed hit-and-run attacks against Imperial assents in the Fakir sector. The goal of the Roughnecks was to attract Imperial military forces to Fakir, reducing thus the resources that the Empire could assign to fight against the Rebel command."}, {"tag": "p", "text": "As of 0 ABY and 1 ABY, Reekeene's Roughnecks were formed by sixty active sentients, including fighters, pilot and support staff such as physicians or engineers, but not counting undercover spies or secret sympathizers. The Roughnecks were divided in \"squads\" of four to ten soldiers, one medical droid or officer, and one transport including pilot, co-pilot and ship, with the transport commonly being shared by different squads. Each squad was identified with a color, with the members wearing armpatches of that shade to identify their affiliation (except for support personnel and commanding officers, who wore white armpatches or none). Examples of squads included Blue squad, Green squad and Red squad."}, {"tag": "p", "text": "The main headquarters of the Roughnecks was the heavily modified Tsukkian water hauler Home, which was also one of their few ships. The Roughnecks also had six outdated X-wing starfighters, two ore haulers, a modified light freighter, and one modified pleasure yacht, Long Shot, which was the headquarters of the Green squad."}, {"tag": "p", "text": "General Lens Reekeene, founder and leader of the Roughnecks, was particular of hit-and-run attacks, retiring at the first sign of Imperial answer, to reduce the possibility of reprisals. As such, she kept an almost paranoid, while justified, policy of secrecy. The Home was constantly in the move with only Reekeene and her husband and main advisor Mikka knowing the route. Pick-ups were requested by sending a message to one communication satellite, which would then re-send it to five other satellites before the Home could receive it."}, {"tag": "p", "text": "General Reekeene herself briefed any squad for any mission, sometimes through a hologram and sometimes assisted by one of her advisors, Santhou Lazith'chika. Although the squad could reject a mission, this was unusual. Once briefed, the squad was ordered to not talk to anybody except the Reekeenes or Lazith'chika, to avoid any leak."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Reekeene's Roughnecks were found at some point after 12 BBY and before 1 BBY. Both Lens and Mikka Reekeene had been framed by the Empire with false accusations, but they eventually got free and joined the Rebel Alliance, with Lens, a former mercenary officer, particularly anxious to get revenge; Mikka, an engineer, had less aggressive goals. Along with their alien friend Santhou Lazith'chika, the Reekeenes created the Roughnecks."}, {"tag": "p", "text": "Their main headquarters, Home, had been the property of an Imperial admiral until the Rebels stole it. The Home was then assigned to the Roughnecks at some point before 1 BBY."}, {"tag": "p", "text": "Circa 0 BBY, the Roughnecks started their activities in Fakir sector. Lens Reekeene specialized in attacking Imperial offices. The Roughnecks overwhelmed the local moff, who requested a fleet as reinforcements — exactly what the Roughnecks wanted him to do."}, {"tag": "p", "text": "Soon after the battle of Yavin, the Green squad of the Roughnecks traveled to Abonshee. The Alliance wanted to deal with the native Anointed People. This mission was so successful that the Anointed People joined the Alliance. At the same time, Reekeene had also assigned at least one special agent, Tay Vanis to perform several recruitment missions, with the goal of increasing the files of the Roughnecks."}, {"tag": "p", "text": "Around this point, the Alliance bough a CEC HT-2200 medium freighter and, christening it Reekeene's Retribution, assigned the ship to the Roughnecks. As the Roughnecks wanted a more military-oriented ship, they replaced the ship's cargo bays with more useful rooms such as a medical suite, weapons lockers, and a tactical briefing room complete with a holotank and a direct communications link with Special Forces Command. They also added more sublight drives, retractile short-range missile racks and a rear-mounted hatch so that commandos could leave the ship while still under the cover of the ship's weapons."}, {"tag": "p", "text": "General Reekeene then organized \"Operation Retribution\", a military action in which she would distribute the scarce resources of the Roughnecks to attack several Imperial targets at the same time in a strong guerrilla event that would cause, if correctly done, a great damage in little time with the less possible risk for her forces. Her intelligence told her that the Empire had just built a repair and refueling outpost on planet Mycroft, Repair Station M13, with several TIE/LN starfighters protecting it. As a part of Retribution, she ordered some of the Roughnecks to attack a station in a nearby system attracting the fighters, and another team, at the same time, would try to sabotage or damage M13."}, {"tag": "p", "text": "Once Retribution was over, Reekeene sent a team to the planet Iyuta onboard the Long Shot. The Empire had a communication center there and Reekeene want a listening device on it. Reekeene had a contact on Iyuta, but the Empire had already found, eliminated and replaced this person, as a part of a plot to follow the Rebel agents to their headquarters. Fortunately, the Empire was outwitted."}, {"tag": "p", "text": "Soon after this event, General Reekeene was captured by a Imperial scout while she was en route to a meeting of Alliance sectorial commanding officers. The scout took Reekeene to an abandoned garrison on Flankers, where the local sun was going to go nova, and asked for a rescue. The Long Shot discovered Reekeene's plight and hurried to rescue General Reekeene. As the scout and the defenses identified the Long Shot as a Rebel ship, conflict was unavoidable."}, {"tag": "p", "text": "At a later point, Reekeene's Rougnecks modified the Long Shot to increase the ship's sublight speed."}, {"tag": "h3", "text": "Roughnecks in Thuris sector"}, {"tag": "p", "text": "Later, the Roughnecks waged a campaign in Thuris sector against its Imperial commander, Moff Sakai. The Roughnecks used the ship Reekeene's Retribution in 1,200 armed attack against Sakai's forces, and at that point they were believed to have destroyed at least 872,000,000 tons of Imperial gear, including one orbital starship yard."}, {"tag": "p", "text": "Eventually, Sakai discovered the identities of the Roughnecks attacking him. He contacted a special forces team of the Imperial Navy, Venom Guard, and ordered to assassinate each and any member of the Roughnecks."}, {"tag": "p", "text": "The Roughnecks then took part in a combined naval strike force to attack an Imperial force in Thuris sector. Once the raid was complete, one of the Roughneck ships, Reekeene's Retribution, detected intruders onboard. The crew of the Retribution contacted the other ships, saying they were dealing with the stowaways. However, when the rest of the Rebel fleet left the system, the Retribution did not follow. Eventually, the Roughnecks considered both the ship and her crew missing in action."}, {"tag": "h2", "text": "Notable members"}, {"tag": "p", "text": "The already mentioned General Lens Reekeene, chief engineer Mikka Reekeene and mysterious Santhou Lazith'chika were the commanding officers of the Roughnecks. Sometimes, they were joined by Lieutenant Am Serro."}, {"tag": "p", "text": "The Red squadron of starfighters was lead by handsome pilot Bakki Sourthol."}, {"tag": "p", "text": "Another notable member was Hark'r, a formerly independent trader who accidentally discovered the Roughneck's base. Lens Reekeene decided to keep Hark'r on board, using his skill to manage supplies and stopping him from leaving, as he could reveal important information to the Empire."}, {"tag": "p", "text": "The Green squad operated from the yacht Long Shot, whose captain was Ixsthmus. Other crewmembers of the Shot included co-pilot Siene Symm and the droids R2-V0 and 4-1B."}, {"tag": "p", "text": "Special rebel agent Tay Vanis was also a member of the Roughnecks, answering directly to Lens Reekeene. Vanis recruited Raleigh \"Kestrel\" Dawn, Smileredon-Verdont \"Smiley\", Sammie Staable and Raal Yorta to increase the number of the Roughnecks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Roughnecks were first mentioned in \"The Long Shot Campaign\", a chapter of the role-playing book Star Wars Campaign Pack written by Paul Murphy and published by West End Games in 1988. \"The Long Shot Campaign\" was later re-published in 1994, along with another Campaign, in Classic Campaigns."}, {"tag": "p", "text": "The moff of Fakir sector that felt harassed by the Roughnecks as described in \"The Long Shot Campaign\" has not been identified; but other sources mention moff Lorin as the person in charge of Fakir at least at some point of the Rebellion era. The unidentified moff could also be Governor General Lord Dixton, but the probable outcome of the adventure Tests of the Godking would mean that Dixton was captured by the Roughnecks in what appeared to be their first encounter."}, {"tag": "p", "text": "In The Star Wars Rules Companion page 23, Reekeene's Roughnecks are incorrectly called \"Rekeene's Roughnecks\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}