{"url": "Reef_Fortress", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Hapes locations"], "nodes": [{"tag": "h1", "text": "Reef Fortress"}, {"tag": "p", "text": "Reef Fortress was the isolated stronghold of the Hapan Royal Family, on a small island in an ocean on the planet Hapes. In 23 ABY, Jedi trainees Tenel Ka, Lowbacca, Jacen Solo, and Jaina Solo stayed at the fortress. While they were there, Ambassador Yfra tried to kill them by sending their wavespeeder into a patch of dangerous carnivorous seaweed. After escaping from the seaweed, the young Jedi saved the Hapan matriarch, Ta'a Chume, from Bartokk assassins sent by the ambassador, thereby foiling Yfra's plot to overthrow the Hapan monarchy. Reef Fortress was also the location of an honor duel between Prince Isolder and Archon Beed Thane in 25 ABY. This duel decided the role of the Hapes Consortium in the war against the extra-galactic Yuuzhan Vong."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Reef Fortress was the private shoreside retreat of the Royal Family of Hapes. Located on a small, isolated island in an ocean on the planet Hapes that was accessible only by boat and surrounded by reefs, the thick-walled fortress served as a stronghold in times of emergency and was built to be impregnable. The fortress had high walls with turrets on the corners and was protected by a deflector shield. There was a generator station near the fortress that provided the fort with power and included backup generators and a deflector shield generator. It had a stone cave grotto where boats were anchored and was near a small swimming cove. By 23 ABY, the fortress contained a tower room that was the bedchamber of the matriarch, Ta'a Chume. There were no secret passages leading into this room because it was feared that assassins could use them to gain entrance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As a young girl, Tenel Ka, the Hapan princess, spent much time with her parents relaxing at Reef Fortress, which she thought of as a summer home. Later, in 23 ABY, Tenel Ka returned to the fortress with Lowbacca, Jacen Solo, and Jaina Solo, her fellow Jedi trainees from Jedi Master Luke Skywalker's Jedi Praxeum, because a bomb had gone off in the Hapan matriarch's royal residence, Fountain Palace, where they had been staying. Yfra, the personal ambassador of the matriarch Ta'a Chume, and some Hapan Honor Guards went with the youths to watch over them. During their stay there, the youths spent much of their time swimming in a small cove. However, Ta'a Chume, Tenel Ka's grandmother, would not let Tenel Ka shun all her responsibilities as the princess of Hapes and had her negotiate with a Mairan ambassador. Later, Yfra suggested that Jacen, Jaina, Lowbacca, and Tenel Ka should take one of the wavespeeders out on the ocean for a while. Unbeknownst to them, Yfra had programmed the wavespeeder to take them into an area of dangerous carnivorous seaweed, hoping to kill them as part of her plot to overthrow the Hapan Royal Family. The youths were able to escape from the seaweed using their lightsabers and knives, and Jaina and Lowbacca manually drove the wavespeeder back to the island."}, {"tag": "p", "text": "Later, Ta'a Chume arrived at the fortress in her own royal wavespeeder. That night, Bartokk assassins sent by Yfra invaded Reef Fortress, destroying the shield generator and cutting off all power to the fortress. The assassins targeted Ta'a Chume and trapped her in her bedchamber. Together, Jacen, Jaina, Lowbacca, and Tenel Ka rescued the matriarch and escaped out the window of her bedchamber. Then, seeing that there was no safe place nearby, they fled the island on a small wavespeeder, with the assassins following in their assault boat. After navigating the Dragon's Teeth, a cluster of sharp rocks jutting out of the ocean, Jaina and Lowbacca purposefully piloted the wavespeeder into some carnivorous seaweed, which killed the assassins who were following them. Ta'a Chume then drove the wavespeeder to Fountain Palace, arriving in time to stop Yfra from promoting herself as the monarch."}, {"tag": "p", "text": "In 25 ABY, Prince Isolder and Archon Beed Thane participated in an honor duel at Reef Fortress. The duel was initiated by Isolder slapping Thane across the face for insulting both New Republic Ambassador Leia Organa Solo and Tenel Ka, who was Isolder's daughter. Isolder won the duel during a sudden death round that the referee had called. As a result of the duel, the Hapes Consortium decided to enter the war against the extra-galactic Yuuzhan Vong invaders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Reef Fortress first appeared in the 1996 Young Jedi Knights: Lightsabers, by Kevin J. Anderson and Rebecca Moesta. It was later mentioned under the entry for \"Hapes Consortium\" in the Star Wars Encyclopedia, published in 1998, and also appeared in James Luceno's 2000 Jedi Eclipse. Reef Fortress was given its own entry in The Complete Star Wars Encyclopedia in 2008. However, this entry contains an error, stating that Leia Organa Solo was at Reef Fortress in 23 ABY with her children, when, according to Lightsabers, she was on the world of Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}