{"url": "Reek", "categories": ["Category:Canon articles", "Category:Creature stubs", "Category:Pages needing citation", "Category:Creatures of Saleucami", "Category:Creatures of Ylesia", "Category:Domesticated creatures", "Category:Grassland and plains creatures", "Category:Herbivorous creatures", "Category:Mammals", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Reek"}, {"tag": "p", "text": "Reeks were large, muscular quadrupeds native to the planet Ylesia and the Codian Moon. They were powerful and territorial mammals with a single central horn atop their head and a cheek horn on either side. They lived on grass plains and turf and had powerful hind limbs for charging."}, {"tag": "p", "text": "Though naturally herbivores, a starved reek could become a ravenous meat-eater and change its skin color to a deep red, while on other worlds they could be brown, gray, or sometimes yellow. Those bred in the Petranaki Arena were purposely fed meat in order to increase their overall aggression, and were equipped with nose rings to be used by handlers. Their sprawling posture and immense weight made them relatively slow-moving. They sported two large cheek horns that could be used for head-locking in combat with another reek as a show of dominance."}, {"tag": "p", "text": "Reeks from the Codian Moon lived in small herds. The creatures existed on Saleucami as well, where one was ridden by General Grievous, leader of the Separatist Droid Army during the battle of Saleucami."}, {"tag": "p", "text": "A reek was used in the attempted execution of Anakin Skywalker in the Petranaki arena just prior to the Clone Wars. Anakin, however, tamed the creature with the Force and broke his chains before directing it against a nexu attacking Padmé Amidala, killing the smaller predator with a ramming attack. The reek then separated from the Jedi when a battle erupted in the arena, destroying droids with impunity and losing one of its cheek horns to Mace Windu before attacking Jango Fett. Though Fett avoided being trampled by the creature and killed it with a single expertly aimed shot to the eye, it damaged his jetpack and led to his own death moments later by Windu's blade."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Reeks first appeared in Star Wars: Episode II Attack of the Clones."}, {"tag": "p", "text": "They are very similar to real-life rhinoceroses and they share much of their biology: they are herbivores but aggressive if provoked, they are massive animals with heavy skin and horns used as weapons, their main tactic is charging adversaries, they have poor eyesight but a strong sense of smell and they live in herds. They are also approximately the same size as white rhinoceroses, although rhinoceroses are much heavier.[source?]"}, {"tag": "p", "text": "There is a discrepancy regarding the creature's height. Both the Encyclopedia and Databank entries agree that these creatures stood at about 2.24 meters tall. However, the later Star Wars Journeys: Beginnings claims that they stood at 4.04 meters in height. As 4.04 meters is the listed length of reeks in the Star Wars Legends continuity, however, Beginnings may have mistakenly listed the creature's length as its height."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}