{"url": "Reekeene%27s_Retribution", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:HT-2200 medium freighters"], "nodes": [{"tag": "h1", "text": "Reekeene's Retribution"}, {"tag": "p", "text": "Reekeene's Retribution was the name of a CEC HT-2200 medium freighter used by the Reekeene's Roughnecks, an elite military unit of the Alliance to Restore the Republic, during their campaign against the forces of Imperial Moff Sakai. Although the Retribution succeeded in many attacks against the Empire, it was eventually lost after being infiltrated by the enemy during a raid in the Thuris sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Alliance to Restore the Republic bought this CEC HT-2200 medium freighter c. 0 ABY, customized it and assigned it to its elite special forces unit, Reekeene's Roughnecks."}, {"tag": "p", "text": "The Roughnecks then used the Retribution during a campaign against Moff Sakai, the Imperial leader of the Thuris sector. The ship survived no less than 1,200 armed attacks against Sakai's forces, and might have seen a part in the destruction of an Imperial orbital shipyard. During this time, the Retribution gained infamy among Imperial officers in the Thuris sector and, to a lesser extent, Imperial officers in general. The Empire had orders to execute the crew of the Retribution at any available chance, but they were unaware of the crew's identities."}, {"tag": "p", "text": "Eventually, Sakai discovered the names of most of the Roughnecks attacking him. Sakai contacted the special forces of the Imperial Navy and assigned a special unit, codenamed Venom Guard, to track and execute the Roughnecks."}, {"tag": "p", "text": "The Roughnecks, including the Retribution, then took part in a compound assault against an Imperial fort in Thuris sector. Once the raid was complete, the crew of the Retribution discovered that they had stowaways in the form of an enemy force. They contacted the rest of their fleet and explained that they were dealing with the problem."}, {"tag": "p", "text": "However, while the rest of the Rebel fleet left the system, the Retribution never followed. Eventually, the Alliance declared the Retribution to be lost, probably drifting, and its crew believed to be dead. Certain members of the Alliance were worried as the Retribution hosted hidden data files with secret information about Rebel military operations."}, {"tag": "h2", "text": "Modifications"}, {"tag": "p", "text": "The Alliance modified the freighter to use it as a combat ship in military service: The cargo bays were replaced with a medical suite, weapons lockers and a tactical briefing room complete with holotanks and direct communication link to Special Forces Command. Sublight drives were added to increase the ship's lift/mass ratio. Two retractable missile racks were deployed on articulated wings and loaded with 250 short-range, atmospheric FireStorm ship-to-surface missiles each. Lastly, a rear-mounted hatch was deployed to allow commandos to leave the ship while still under the cover of its weapons."}, {"tag": "h2", "text": "Sources"}]}