{"url": "B1_grapple_droid", "categories": ["Category:Canon articles", "Category:Wookieepedia Comprehensive articles", "Category:B1 battle droid models"], "nodes": [{"tag": "h1", "text": "B1 grapple droid"}, {"tag": "p", "text": "The B1 grapple droid was a type of B1-series battle droid used by the Separatist Droid Army during the Clone Wars, a galactic conflict between the Confederacy of Independent Systems and the Galactic Republic. Like its B2 counterpart, the B1 grapple droid was armed with grapple claws for hand-to-hand combat."}, {"tag": "p", "text": "B1 grapple droids were fourth-class droids crafted in the likeness of their Geonosian designers. The droid troopers stood at a height of 1.93 meters and possessed white-and-green plating, black photoreceptors, comlink booster packs, and a simple vocabulator. They were manufactured by Baktoid Armor Workshop and Baktoid Combat Automata."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the new Star Wars canon, B1 grapple droids appeared in the mobile game Star Wars: Galactic Defense, which was released in 2014 and retired in 2016. In the Star Wars Legends continuity, B1 grapple droids first appeared in the 2000 video game Star Wars: Episode I Jedi Power Battles. While Star Wars: Galactic Defense only referred to B1 grapple droids as \"Melee troops,\" and the plating colors of the droids resembled those of the plasma battle droids from Star Wars: Episode I Jedi Power Battles, the units were identified as B1 grapple droids in the Star Wars: Galactic Defense launch trailer, although the trailer mislabeled a graphic of an Imperial Heavy Trooper as such."}, {"tag": "p", "text": "In Star Wars: Galactic Defense, B1 grapple droids were a type of melee unit that appeared in the \"Dark Side\" missions. Players could deploy them to defend against waves of enemy units, such as clone troopers and Jedi. The droids would be deployed in groups of three, and they could be upgraded into B2 grapple droids."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}