{"url": "Reflections:_A_Collector%27s_Bounty", "categories": ["Category:Real-world articles", "Category:Star Wars Customizable Card Game"], "nodes": [{"tag": "h1", "text": "Reflections: A Collector's Bounty"}, {"tag": "p", "text": "Reflection: A Collector's Bounty (also referred to as the Reflections I set) was a \"remake\" set released by Decipher in 1999 as part of its Star Wars Customizable Card Game (CCG). The set contained only cards found in previous expansion sets, and added nothing to the overall game's mechanics, material, lore, etc. The set did, however, introduce 114 new special foil cards to collectors, and one of these was included in every booster pack."}, {"tag": "p", "text": "This set contains a total of 114 Foil cards, which are two Ultra Rare, 25 Super Rare, and 87 Very Rare. Reflections was the first non-unlimited set that Decipher released that contained no new cards. Decipher produced the set as a means to help eliminate a large surplus of cards in their warehouses in Virginia. This set was followed by two other Reflections sets, Reflections II: Expanding the Galaxy and Reflections III."}, {"tag": "h2", "text": "Announcement"}, {"tag": "p", "text": "Decipher's pre-release announcement for Reflections:"}, {"tag": "p", "text": "18 card packs: 17 random cards + 1 more than rare foil version of a Star Wars CCG rare anticipated release December 1999"}, {"tag": "p", "text": "Each Reflections pack is an 18-card pack containing 17 totally random cards (some black and some white border, from Premiere through Special Edition, potentially of all rarity types) + one foil version of one of 114 of the hottest rare cards from Star Wars CCG. Incredible value, \"Hall of Fame\" Star Wars CCG rares in foil versions and at least one guaranteed rare (but probably more because\nof the totally random distribution within each pack) makes this innovative product a must have.'"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External Links"}, {"tag": "p", "text": "'"}]}