{"url": "Regenald_Hanniper_Snopps_III", "categories": ["Category:Legends articles", "Category:Corulag residents", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Regenald Hanniper Snopps III"}, {"tag": "p", "text": "Regenald Hanniper Snopps III was a Human male from the planet Corulag. He was the youngest son of Zafiel Snopps, the planetary Imperial governor and former senator for the planet. Despite his family's connections, Snopps failed to gain entry to the Imperial Academy, and lived the life of an arrogant noble, constantly seeking to prove his superiority at the expense of others. A naturally gifted sportsman and gambler, Snopps was not afraid to threaten rivals with Imperial intervention. However, while he liked to boast of his connections—which was accurate—they thought him a fool and rarely entertained him. During the Galactic Civil War, Snopps spent time on the resort world of Spira, where he encountered a group of Rebel agents posing as tourists, and had several run-ins with them although he never learnt their true identities."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Regenald Hanniper Snopps III was a Human male from the planet Corulag, in the Bormea sector of the Core Worlds. The youngest son of Imperial Governor Zafiel Snopps—the former senator for Corulag—he failed to gain admission to the Imperial Academy despite his father's connections. To compensate, Snopps traveled the galaxy seeking to prove himself and ferreting out new sources of amusement. During the Galactic Civil War, he traveled to the planet Spira, arriving at the Ataria Island spaceport and staying at the Aspre Plunge hotel and casino. During his stay, he spent time in the casino, winning gambling victories and being surrounded by a group of fawning hangers-on who were attempting to curry favor with the young noble. One night, he encountered a group of tourists—who were secretly Rebel agents—and took an instant dislike to the group. The feeling was mutual on behalf of the Rebel agents."}, {"tag": "p", "text": "During his stay on the planet, Snopps was aboard a party barge near the Shinkai Abyss surrounded by loud friends. They tossed concussion grenades into the water in an attempt to kill a camray eel, which was a futile exercise as camray eels lived deep underwater. During the 345th annual Spira Regatta Open, Snopps took his personal vessel out to the wreck, a crashed alien starship of unknown origin submerged in Spira's oceans. He intended to dive to it, regardless of the restrictions in place due to the Spira Regatta Open taking place. There, he met the same group of Rebel agents he had encountered in the Aspre Plunge and demanded that they leave the area to allow him to view the wreck. After a tense stand-off, the agents left."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Snopps was a tall man, and considered to be handsome although he was always sneering. He had long blond hair that he wore in a ponytail, and a pencil-thin mustache, and was constantly toying with both. Snopps was an arrogant individual, and insisted on being the center of attention wherever he went with his domineering and petty attitude. He had a loud, penetrating laugh and braying voice that helped him achieve that goal, albeit it for the wrong reasons. Publicly, Snopps held the belief that he was the most important person in the universe. However, privately, he was full of self-doubt and paranoia. Any slight to his person was challenged by anything from a screaming fit to a challenge of a duel or contest. He was fond of threatening people with retaliation from the Empire, but his threats were hollow. Although he knew the right people, they all thought he was a fool and ignored him."}, {"tag": "p", "text": "Despite his inability to enter the Imperial Academy, Snopps had a talent for sports and gambling. He favored cloaks and tunics of turquoise and pink of the finest cut, and was rarely seen without a glass of wine. He was trained to use a blaster, and carried a sporting model. He was a skilled shockball player, and could engage in unarmed combat. He was knowledgeable about business, and planetary systems and cultures. He could fly space transports, pilot ground and repulsor vehicles, and ride domesticated beasts. He had a eye for valuable objects, was trained in first aid, and could swim. He usually carried a wooden cane and comlink pager."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}