{"url": "Reginald_Danfillo", "categories": ["Category:Canon articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Space explorers"], "nodes": [{"tag": "h1", "text": "Reginald Danfillo"}, {"tag": "p", "text": "Reginald Danfillo was a senior terrain trekker, silver leaf, fullbloom cluster, of the League of XenoExplorers. During the Typhojem Excavation on Pashvi, Danfillo recovered a piece of tapestry dating to the Neo-Middle Secundus, Quesoth pottery shards and a book that would become known as the Smuggler's Guide. Danfillo was disappointed that the book was contemporary and it ended up being sold to the Besalisk Dexter Jettster."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Reginald Danfillo was a member of the League of XenoExplorers who during the reign of the Galactic Empire held the rank of senior terrain trekker, silver leaf, fullbloom cluster. Danfillo took part in the Typhojem Excavation on Pashvi during which the trekker recovered a piece of tapestry dating to the Neo-Middle Secundus and Quesoth pottery shards. At the site of the excavation, Danfillo also discovered the corpse of the alien smuggler Tryphon Leo, who had been attempting to locate a cache of treasure hidden by the pirate Queen Maz Kanata in the Shrove of the Left Handed God Typhojem."}, {"tag": "p", "text": "Leo had been crushed by a massive stone block falling from the ceiling approximately seventy meters along the Grand Causeway in front of a Typhojem Thrall. Beside the smuggler's remains, Danfillo recovered the book that would become known as the Smuggler's Guide, but was disappointed to discover that it was a contemporary object. Danfillo then wrote a report summarising the recovery of the book including an image of the recovery site. The trekker commented that the book could probably be sold to a spacer and left the report inside the book. The book then ended up in a box of reading material elsewhere on Pashvi, where it was discovered by the Besalisk Dexter Jettster, who purchased it for fifty credits."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Reginald Danfillo was extremely disappointed to discover that the Smuggler's Guide was a contemporary object and commented that it seemed like the kind of thing \"spacer trash\" might purchase. In the report the trekker wrote on the book's recovery Tryphon Leo as was misidentified as human based on analysis of his forearm and hand, despite the fact that the smuggler's skin was bright blue."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Reginald Danfillo was first mentioned in Star Wars: Smuggler's Guide, a reference book written by Daniel Wallace and released in 2018."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}