{"url": "Reginald_Barkbone", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Cyborgs", "Category:Males", "Category:Pirates", "Category:Poss'Nomin"], "nodes": [{"tag": "h1", "text": "Reginald Barkbone"}, {"tag": "p", "text": "Reginald Barkbone, Scourge of the Seven Sectors, was a swashbuckling pirate pursued by the Empire during the Galactic Civil War. A Poss'Nomin male, he was the figure of much myth, infamous for many audacious heists and daring escapades in his flagship, the Robber Baron. Barkbone was noted for his flamboyance: he sported a lightfoil and spoke Lok Pirate's Cant and also kept a Kowakian monkey-lizard atop his shoulder to repeat his every word."}, {"tag": "p", "text": "Barkbone's most famous exploits included a raid on the palaces of Hapes, a fracas with Imperial Guards on Axion, and a successful voyage through the Fire Rings of Fornax—at the cost of his leg, eye, and sanity, respectively. The Loronar navy attempted to apprehend Barkbone, vainly pursuing the Poss'Nomin bandit for a month. After the Battle of Yavin, the Imperial Navy made Barkbone's apprehension a priority, tasking Grand Admiral Rufaan Tigellinus with his capture. Tigellinus chased the relentless freebooter around the galaxy to no avail, but was determined to neutralize the threat Barkbone posed."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Scourge of the Seven Sectors"}, {"tag": "p", "text": "Reginald Barkbone, a male member of the three-eyed Poss'Nomin species, lived as a pirate during the Imperial Period. A being surrounded by myth and supposition, he had become infamous by the early years of the Galactic Empire, earning the moniker, \"Scourge of the Seven Sectors.\" Rufaan Tigellinus of the Imperial Navy was unaware as to what \"Seven Sectors\" Barkbone's appellation referred. At various points in his career, Barkbone was active in the Outer Rim Territories, the Mid Rim, the Expansion Region, the Inner Rim, and the Colonies, striking at an array of targets. His flagship, the Robber Baron, was a stolen Star Galleon-class frigate, though he also had a number of Incom Corporation corsairs at his disposal. He was known as a sly, savage operator, mentioned in the same breath as Gir Kybo Ren-Cha, the Thalassian slavers, and the Black Hole Gang, all among the most notorious marauders operating in the Outer Rim. On many occasions, Barkbone had run-ins with the Imperial Navy and he frequently vexed the Imperial officer Rovan Tresario, which later led Tresario to found House Tresario, a chapter of the Bounty Hunters' Guild that specialized at hunting pirates. However, all efforts by the chapter to capture Barkbone proved unsuccessful."}, {"tag": "p", "text": "Barkbone was infamous for a slew of implausible, heroic feats. His most famous accomplishment was a successful journey through the Fire Rings of Fornax, an exceedingly difficult task and one which saw Barkbone lose his sanity. Rufaan Tigellinus claimed to have witnessed the voyage. The Poss'Nomin freebooter lost one of his legs while plundering palaces on Hapes, but he replaced the severed limb with a cybernetic peg and returned to his piratical vocation. On another occasion, the Robber Baron was pursued for a month by the Loronar navy, but Barkbone was not apprehended. The pirate claimed it was his least enjoyable interlude in space, because the sole COO-series cook droid in the galley was programmed to produce only vegetarian food."}, {"tag": "h3", "text": "Imperial pursuit"}, {"tag": "p", "text": "Barkbone clashed with members of the Imperial Guard on Axion in the Expansion Region at some point. After pillaging the planet, he attached a limpet mine to a GNK power droid while running from pursuing Imperial Guards. The shell of a Gonk droid was extremely durable, but when cracked the internal generator exploded with force. Barkbone's mine achieved this, and he was able to shoot his way to freedom in the blast and resulting pandemonium. He escaped, but the endeavor cost Barkbone one of his eyes and half his face."}, {"tag": "p", "text": "The Imperial Navy stepped up its pursuit of Barkbone shortly after the Battle of Yavin, and Grand Admiral Rufaan Tigellinus was tasked with his apprehension. In his Star Destroyer, Avatar, Tigellinus claimed to have doggedly chased the Robber Baron from the Colonies to the Outer Rim Territories. Around this time, Barkbone carried out a heist in the Tapani sector; a lightfoil was among his loot. Though Tigellinus's attempts to stop Barkbone's pilfering were fruitless, several of the Poss'Nomin's crew members were captured, and under interrogation they helped corroborate the Empire's records on Barkbone, separating fact from fiction. Tigellinus wrote a succinct report for Maximillian Seerdon of the Imperial Security Bureau after a prolonged and futile pursuit. This report was in turn given to Grand Vizier Sate Pestage, placing Barkbone alongside other such pests to the Empire as smuggler Dash Rendar and outlaw tech Klaus Vandangante. Tigellinus was a rabid Humanocentric and thus had personal motivation for the capture of Barkbone, a non-Human. His report was disdainful of the Poss'Nomin's character and mental state, but Tigellinus recognized the threat Barkbone posed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Reginald Barkbone was a member of the physically imposing, three-eyed Poss'Nomin species. He was noted for his flamboyance and his peculiar speech pattern, using a dialect of Galactic Basic Standard described by Grand Admiral Tigellinus as \"silly.\" Barkbone was also fluent in Lok Pirate's Cant, a private underworld parlance used by the pirates of Lok. He owned a pet Kowakian monkey-lizard, which was invariably perched on the pirate's shoulder, repeating every word he said. Barkbone took a fancy to the lightfoil, a weapon favored among the Tapani nobility, and began sporting a stolen lightfoil after a foray into Tapani territories. Tigellinus noted that his colleague, Grand Admiral Octavian Grant, was infuriated that a brigand like the \"Scourge of the Seven Sectors\" was flaunting a symbol of Grant's own aristocracy. Barkbone had a taste for meat, and was infuriated to be stuck with a vegetarian COO droid while on the run."}, {"tag": "p", "text": "Barkbone was dedicated to his buccaneering lifestyle and continued his career even after a number of serious injuries. By the time of Tigellinus's chase for the Poss'Nomin, he had damaged his face and lost a leg. Barkbone subsequently procured a prosthetic replacement for his leg, making him a cyborg. As attested by Tigellinus, Barkbone became insane in the course of his journey through the Fire Rings of Fornax."}, {"tag": "p", "text": "Throughout his career, Barkbone proved to be an elusive target, avoiding capture on numerous occasions. The Loronar navy pursued the Poss'Nomin for an entire month to no end, and Tigellinus reportedly chased Barkbone from one end of the galaxy to another without success. He was resourceful when attempting to escape from a tight situation. With Imperial Guards closing in on him, Barkbone attached explosives to a Gonk droid to impede his hunters. According to Tigellinus, Barkbone was a bloodthirsty pirate, more vicious than even the notorious Thalassians, but he was also able to use trickery to beguile his adversaries. Throughout his life, Barkbone displayed a penchant for bold and audacious stunts, willingly navigating dangerous hazards."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Reginald Barkbone was created by Daniel Wallace for The New Essential Guide to Droids in 2006. Barkbone was presented with a \"classic campy pirate feel,\" and was inserted because Wallace was partial to such pirates. While working on Underworld Appendix: Swoops, Spice, and Wretched Rogues, the online supplement to Star Wars Insider 89, Abel G. Peña realized no pirates had been included in the article; and having been amused by Barkbone's brief appearance in The New Essential Guide to Droids, Peña decided to include him in the article. Wallace endorsed the expansion of Barkbone's backstory, with the caveat that he retained his character as an archetypal pirate. Underworld Appendix, co-written by Peña and Ryan Kaufman, was published several months after The New Essential Guide to Droids. Barkbone subsequently received an entry in the 2008 compendium The Complete Star Wars Encyclopedia and in 2013 he was mentioned in the reference book The Bounty Hunter Code: From the Files of Boba Fett."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}