{"url": "Refugee_Relief_Movement/Legends", "categories": ["Category:Legends articles", "Category:Charities and relief organizations"], "nodes": [{"tag": "h1", "text": "Refugee Relief Movement"}, {"tag": "p", "text": "The Refugee Relief Movement (RRM) was a nonprofit organization originally formed to aid the billions of lower-class inhabitants of Coruscant. It later grew to a disaster aid, relief fund, and resettlement agency operating on planets throughout the Galactic Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Immediately prior to the Invasion of Naboo, Ruwee Naberrie served as the President of the Refugee Relief Movement. His wife Jobal also worked at the RRM's galactic capital headquarters, which consisted of stark offices tucked under a recessed upper level of the Tannik Spaceport—itself a semicircular docking pad located at the edge of the Manarai district and surrounded by towering monads. The spaceport was a haven for crew members that had been drugged or abducted, itinerant workers, and the undocumented migrants of many species looking for steerage passage to distant worlds."}, {"tag": "p", "text": "During the Separatist Crisis, the RRM (and its newly-formed subgroup, the Refugee Resettlement Coalition) oversaw the temporary settlement of those displaced by the closure of worlds joining the Confederacy of Independent Systems. The ten worlds of the Coalition were Naboo, Monastery, Kalarba, Cerea, Sneeve, Bimmisaari, Durkteel, Ord Tessebok, Garos IV, and Ord Varee. Former chancellor Finis Valorum presided over the opening of Alderaan to refugee settlement."}, {"tag": "h3", "text": "Palpatine's proposal for an RRM volunteer"}, {"tag": "p", "text": "When she was a girl, Padmé Amidala, the Naberries' daughter, wished to work for the RRM and became one of its young volunteers, helping to evacuate, before its destruction by a supernova, Shadda-Bi-Boran."}, {"tag": "p", "text": "Indeed, it was in 33 BBY that Senator Palpatine of Naboo visited the RRM headquarters to speak with the Naberries about their daughter Padmé, who had accompanied her parents from Naboo on their visit to Coruscant. As the adults conversed, the attractive, dark-haired young volunteer, along with her 'lovesick' friend Ian Lago (son of Kun Lago, King Veruna's Prime Councilor), directed the loading of antigrav-palleted foodstuffs into the bay of a waiting freighter. Palpatine, who arrived at the port in a sky-cab that he'd hailed from the Senate Plaza, had just come from his wedge-shaped offices behind the Senate Building's Rotunda, where he'd met that afternoon with the revered Jedi Master Dooku who had privately announced to him his intentions to leave the Jedi Order (Dooku, brooding in the aftermath of the Jedi debacle that was the Battle of Baltizaar, in which his former Padawan had been abducted by the Bando Gora cult, could no longer abide the poor decisions of the Order's 'archaic' High Council with regard to the indolent, 'wretched state of the Republic'—which he felt needed to be 'torn down and built up again from the ground up,' an action that possibly required a civil war, he'd told him); their meeting together was also the occasion that an authentically surprised Palpatine first heard of the ancient Jedi prophecy of a redeemer, or 'chosen one,' who would bring balance to the Force and restore order: Dooku had expressed to the Senator his belief that the Jedi could fulfill the prophecy on their own if they were but willing to \"unleash the full powers of the Force.\""}, {"tag": "p", "text": "Palpatine announced to the Naberries that his purpose in coming to the docks was urgent: for if Naboo stood a chance of combating King Veruna's riches-inspired alignment with the Trade Federation's stance that the galaxy's free-trade zones be taxed, he would have to be challenged and beaten in the coming election by \"the right candidate.\" The Naberries, of course, knew immediately that Palpatine was suggesting that that candidate be their 13-year-old daughter, the Princess of Theed, who, in Palpatine's eyes, was eminently qualified. As one who had enjoyed more popular support in Theed than any governor had enjoyed in generations, Padmé had become a member of the Legislative Youth Program at age 8, a full Apprentice Legislator at 11, and had gone on to engage in significant refugee work. Naboo, after all, had historically elected younger Queens than Padmé, and hers could be a reign that would last 50 years. The Naboo constitution, Palpatine pressed, had a provision that would allow the monarchy to become hereditary for a worthy dynasty: \"And what more worthy family is there than the Naberries?\" The Senator reinforced his counsel by reminding them that the citizens of Naboo were exasperated with monarchs like Tapalo and Veruna, and that \"Padmé would allow Naboo to reinvent itself.\" She, moreover, would not have to take a stand on the issue of free trade zone taxation, but rather campaign only against corruption and secret deals, and the embarrassing position in which Veruna had placed Naboo. Increasingly, he told the Naberries, though he'd helped put their monarch on the throne, Palpatine had found himself in recent years opposite Veruna on practically every issue, including the library the King built and the credits he lavished on creating a space force for Naboo during his 12-year reign. The Senator assured them that Veruna could be defeated and that he would lend them not only his, but also the Supreme Chancellor's unqualified support to ensure that Padmé was successful in her campaign. \"Faced with Padmé as competition,\" Palpatine concluded, \"perhaps Veruna will see the light and abdicate.\"  In the end, the Naberries, delighted to learn that Chancellor Valorum knew of their daughter, were in accord with Palpatine's proposition and would present it to Padmé."}, {"tag": "p", "text": "Years later, having been elected and served for nearly a decade as the Queen of Naboo, Padmé (now Senator Amidala) and her Jedi protector, Anakin Skywalker, covertly journeyed from Coruscant to Naboo on an RRM vessel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}