{"url": "Reimos_Taligg", "categories": ["Category:Legends articles", "Category:Desilijic servants", "Category:Humans", "Category:Males", "Category:Slicers"], "nodes": [{"tag": "h1", "text": "Reimos Taligg"}, {"tag": "p", "text": "Reimos Taligg was a Human male slicer who lived on Tatooine during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the Battle of Yavin, Reimos Taligg was unwillingly employed by Jabba the Hutt in Mos Eisley, working with Vourk ver'Zremp and Dunir Signos. Circa 1 ABY, Reimos Taligg tasked a spacer with planting a surveillance virus that he created in the computer of the White Thranta Shipping Company offices, which he believed was a front company for illegal activities of Jabba the Hutt. Through the virus he learned that the company was using unusual amounts of bacta, but couldn't find the password for the medical computer to find out why. Fortunately, he did find a password for a security terminal, which the spacer used to find the medical computer's password. The spacer gained access to the medical computer and uploaded the data, which proved Reimos' suspicisions correct, to him. Reimos then tasked the spacer with questioning Durr Roddack, the manager of the company, about these activities. Durr would not cooperate and the spacer was forced to kill him, only to find the Durr was not in charge of the experiments and planned to abandon the company. Using information found on Durr's datapad, Reimos sent the spacer to Durr's personal computer, where he discovered the it was Durr's superior, Brok Ziam, who was really behind the experiments. After accessing Brok's computer, the spacer was contacted by Bib Fortuna who informed him that even Jabba disapproved of Ziam's experiments and ordered Brok killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Reimos Taligg appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Reimos Taligg was added to the game as part of the \"Legacy Quest\" with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}