{"url": "Reki", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Humans", "Category:Males", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Reki"}, {"tag": "p", "text": "Reki was a Human male who lived on the planet of Ord Mantell during the Cold War. He was known to have considerable knowledge about the Mantellian Separatist Movement, although was not affiliated with them, and helped the smuggler Voidhound to track down Skavak who worked with the Separatists."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Reki was a Human male who, during the Cold War, lived on the Republic held planet of Ord Mantell in the Bright Jewel system of the Mid Rim. Reki lived on Mannett Point where he would steal quality goods from warehouses in the area. However a civil war broke out on Ord Mantell between the corrupt Ord Mantell Central Authority, backed by the Galactic Republic, and a rebel Mantellian Separatist Movement. During the war Separatist forces took over Mannet point and Reki fled from his home, sealing it so Separatists could not enter. He retreated to [a safehouse he owned in Talloran village, another settlement close by, but the Separatists soon also managed to capture Talloran as well. Reki became trapped within his safehouse during the Separatist occupation and took in several other villagers including two women whose husbands had been killed in the Separatist assault."}, {"tag": "p", "text": "During the time he was trapped in Talloran, Reki was visited by the smuggler known as Voidhound. Ace had been sent by Viidu, head of a local freight company, Rendia Freight, who was an old acquaintance of Reki's. The smuggler had been sent to obtain information on the Separatists, whom Viidu believed Reki knew much about, as Skavak, one of Rendia Freight's employees, had stolen a shipment of blaster rifles and joined up with the Separatists. Ace needed to know where they could find out Skavak's location and in return had a survival pack for the trapped man. Reki explained that there was a database of all Separatist personnel kept in a warehouse near his old home in Mannett point. Before the war he had stolen goods from there and so kept a schematic of the building, however it was still sealed in his home on Mannett point. Reki explained that to get to the warehouse Ace would have to get into his home on Mannett point."}, {"tag": "p", "text": "Reki had sealed the house by over loading the door meaning that the town's power would first have to be shut off by destroying the three power relays for the door to open. Once inside the smuggler would have to find the schematics which were concealed with in a Treatise on bird watching that Reki owned and found particularly boring. To access the schematics every mention of the Mantellian flutterplume within the treatise had to be replaced with the number three, once this was done the schematics would be revealed. Finally the smuggler could use the secret back exit to Reki's home to take him to the warehouse. He warned the smuggler that the database would require special equipment to hack into but that Viidu would know more about that. Ace thanked Reki and gave him the supply pack. He later successfully followed Reki's orders and managed to reach the Separatist database and obtain information on Skavak."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Reki took great precaution in protecting himself and his belongings, hiding the schematics of the warehouse and sealing his own home to prevent Separatists getting in as well as having a safe house set up away from his own home in case of danger. He helped fellow villagers in Talloran when the settlement was attacked and offered to share the supplies that Ace brought him with them. He was however a thief as shown by the fact he used to rob Mannett point warehouses."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Reki is a non-player character from the massively multi-player online role playing game Star Wars: The Old Republic released by BioWare in 2011. He is a character involved in the smuggler classes storyline quest appearing in one mission. It is not possible for players of any other faction to interact with or see Reki unless they are in a party with a smuggler completing the mission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}