{"url": "Reinforced_Insulated_Sheath_armor", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Heavy armor"], "nodes": [{"tag": "h1", "text": "Reinforced Insulated Sheath armor"}, {"tag": "p", "text": "The Reinforced Insulated Sheath armor, or R.I.S. armor for short, was a form of heavy, yet flexible battle armor that saw use during the Galactic Civil War. It could be customized in a variety of colors. Mol Ni'mai, a male Bothan master armorsmith living in the mountains of the planet Dantooine, was the inventor of the armor. R.I.S. armor could only be crafted by the most proficient armorsmiths. In addition to its more basic resource requirements, the armor also required the bones and hides of various creatures within the galaxy. The armor had eight separate pieces which included two biceps, two bracers, a chest plate, a set of leggings, a helmet, and a pair of boots. During the Galactic Civil War, sometime after the Battle of Yavin, Ni'mai taught a spacer and fellow armorsmith how to make the armor. Following this, R.I.S. armor saw use by several disparate organizations throughout the galaxy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Reinforced Insulated Sheath was a heavy, yet flexible battle armor. It provided equal protection to all areas of the body and could be customized in a wide variety of colors, from blue to black to red. Its protection could be augmented with a personal energy shield. The armor's construction was particularly difficult, requiring not only the skills of a experienced armorsmith, but many rare materials from across the galaxy, in addition to its more mundane material requirements of various minerals and synthetic materials. The mundane materials were fiberplast, copper, gemstone, aluminium, intrusive and extrusive ores, and synthetic cloth. The rare materials were the hide of a gurk king and the scales of a giant dune kimogila from Lok, and the bones of a woolamander harrower from Yavin 4. The armor's appearance layer required the feathers of a peko-peko albatross from Naboo."}, {"tag": "p", "text": "The armor consisted of eight separate parts that included two bracers, two biceps, a helmet, a chest plate, a set of leggings, and a pair of boots. The helmet included a wide-brimmed top and a visor over the eye holes to protect from sun glare. The bracers and biceps had bladed pieces of armor attached. The boots had two spikes protruding from the sides. The leggings were skirt-like, with several pieces of protective armor attached."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Reinforced Insulated Sheath armor, or R.I.S. armor, was the invention of the male Bothan master armorsmith Mol Ni'mai. Sometime after the Battle of Yavin, at the height of the Galactic Civil War, Ni'mai was visited by a spacer at his hut in the mountains of the planet Dantooine. The spacer was an armorsmith as well and wished to learn from Ni'mai. Ni'mai demanded 50,000 credits from the spacer before he would agree to lessons, which the spacer readily paid. Credits in hand, Ni'mai began to instruct the spacer in the construction of R.I.S. armor, explaining the construction of its armor segment and its appearance layer. Once he was satisfied that his student had learned the basics, he tasked the spacer with constructing a pair of R.I.S. boots. The spacer was successful, and Ni'mai rewarded his student with the schematics for the remainder of the armor pieces. The armor became rather prevalent in the galaxy thereafter."}, {"tag": "p", "text": "Individuals to utilize R.I.S. armor included Russ Grimblade and other members of the Hidden Daggers pirate organization, who were known to wear pieces of the armor. Borantok, a member of the Blackscale slaving group on the planet Kashyyyk, also used pieces of the armor, as did several Chiss poachers within the Etyyy region of Kashyyyk. A group of bandits known as the Razor Runners on the planet Mustafar employed the armor heavily amongst its members."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Reinforced Insulated Sheath armor is a type of heavy armor in the 2003 MMORPG video game Star Wars Galaxies: An Empire Divided. The armor, along with its designer and the quest to learn how to craft it, were added to the game in November 2003. The player must be a master armorsmith to craft the armor."}, {"tag": "p", "text": "R.I.S. armor is of the \"Battle\" type within the game, meaning it provides equal protection from energy and kinetic damage sources. Prior to the addition of Mandalorian armor to the game, the R.I.S. armor was the most difficult to construct, as it required many rare items from creatures both difficult to find and to defeat. Prior to 2005 and the release of the New Game Enhancements for Star Wars Galaxies, the peko-peko feathers gave a health bonus when used to construct the armor. Additionally, the acklay within the Geonosian Bio-Lab on Yavin 4 could drop a schematic for an Interwoven R.I.S. Armor Segment. However, with the release of the NGE, this item no longer drops, and if a character has already learned the schematic, crafting it produces a normal R.I.S. armor segment. Like the majority of armor in the game, R.I.S. armor can be acquired for free while playing on the game's test center."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}