{"url": "Relin_Druur", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Fallen Jedi", "Category:Humans", "Category:Jedi Masters of the Jedi Order", "Category:Jedi Purge survivors", "Category:Males"], "nodes": [{"tag": "h1", "text": "Relin Druur"}, {"tag": "p", "text": "Relin Druur was a male Human Jedi Master active around 5000 BBY. After his first Padawan, the Kaleesh Saes Rrogon, turned to the dark side, Druur and his second apprentice, Drev Hassin, began tracking Rrogon. They discovered that Rrogon had become a Lord in the Sith Empire and tracked him to the Phaegon system, where he was mining the dark side ore Lignan. The Jedi ambushed Rrogon with the purpose of disabling his ship, the Harbinger, to prevent the ore from being delivered to the Sith fleet. Druur fought with Rrogon aboard the Harbinger, losing his left arm in the duel before charges that he had placed on the hyperdrive exploded, damaging the hyperdrive and incapacitating the Sith Lord. Druur fled to an escape pod, but Hassin, in the Jedi's Infiltrator starfighter, saw that the Harbinger was still preparing to jump into hyperspace and sacrificed himself, flying the Infiltrator into the Harbinger's bridge in hopes of preventing it from escaping the system. Druur attempted to flee in the escape pod, but the Harbinger continued its jump sequence, pulling Druur's pod along with it as it failed to fully enter its hyperlane and traveled through time to 41.5 ABY."}, {"tag": "p", "text": "Druur, finding himself in a foreign system, flew his escape pod to a freighter of a make he had never seen. He entered the ship, Junker, where he met Jedi Knight Jaden Korr and the ship's pilot, Khedryn Faal. Korr revealed to Druur that the Sith Empire had been defeated millennia ago and concluded that he must have traveled through time during the Harbinger's misjump. After they evaded two squadrons of starfighters deployed by Rrogon to destroy Junker, Korr continued his own task with the assistance of Faal, while Druur and Marr Idi-Shael, Faal's first mate, embarked on a mission to destroy the Lignan aboard the Harbinger. After Idi-Shael helped Druur to fight off a wave of Massassi warriors, Druur convinced him to flee the ship. Druur then fully embraced the dark side and found the Lignan in the Harbinger's cargo hold, where he was confronted by Rrogon. The two engaged in a duel of Force powers, and Rrogon soon gained the upper hand. Druur, however, used his despair at his failures in life to draw on the power of the Lignan, defeating Rrogon and killing him with the Sith Lord's own lightsaber. Druur then continued to consume as much of the Lignan's power as he could and unleashed it upon the Harbinger, engulfing the ship in flames and destroying it even as he died."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Hunting Rrogon"}, {"tag": "p", "text": "Relin Druur was a male Human Force-sensitive who lived during the time preceding the Great Hyperspace War. Trained as a Jedi in the Jedi Order, Druur learned some Force techniques from the Jedi Imar Deez, and eventually attained the rank of Jedi Master. At some point prior to the war, he took on the Kaleesh Saes Rrogon as his Padawan, although Rrogon eventually turned to the dark side of the Force. Druur later took on a second Padawan, the Askajian Drev Hassin. Around 5000 BBY, the Sith Empire, which Rrogon had since joined as a Sith Lord, was discovered to be in the process of preparing to invade the galaxy. Druur believed that the planet Kirrek would be attacked, as well as the capital world Coruscant. In the meantime, however, he and Hassin began to track down Rrogon."}, {"tag": "p", "text": "The two Jedi, flying an Infiltrator starfighter, eventually found the Sith Lord at Primus Goluud, where they also found the Sith fleet preparing to strike the Galactic Republic. There, the Jedi saw Rrogon's dreadnaught, the Harbinger, alongside another ship, the Omen, leaving the present armada. After Druur reported his findings to Kirrek and the Jedi Order on Coruscant, he received an order to follow Rrogon in the hopes of discovering the Sith Lord's purpose. They tracked Rrogon as the Harbinger and Omen traveled to several remote systems. At each stop, the dreadnaughts released recon droids for scanning, before quickly moving to another system."}, {"tag": "p", "text": "As the Jedi still had no clue as to what Rrogon's goal was, several agents managed to place a homing beacon on the Harbinger. Following the beacon, Druur and Hassin jumped through hyperspace from the Remmon Nebula to the Phaegon system. As they prepared to exit hyperspace, Druur quickly masked their presences in the Force so that Rrogon would not be able to sense them. Upon entering the system, the two Jedi were instantly affected by a strong wave of dark side energy. They quickly recovered and flew the Infiltrator into the system's asteroid belt, from where they saw the Harbinger and the Omen over the largest moon of Phaegon III. The Sith ships were mining for Lignan—an ore that was immensely powerful in the dark side of the Force—and Druur and Hassin found that, in this act, the Sith had completely destroyed the outer crust of the moon, eliminating all of its life."}, {"tag": "h3", "text": "Skirmish over Phaegon III"}, {"tag": "p", "text": "The two Jedi realized that the Lignan ore was the source of the powerful dark side energy that they had felt upon their arrival, and that it must have been what Rrogon had been searching for. Druur also believed that the Sith were gathering the ore for use during the upcoming Battle of Kirrek. Deciding that they could not allow the Sith to deliver the ore to the main fleet, Druur and Hassin resolved to ambush Rrogon's forces. Using the Infiltrator's scrambler and baffler to keep them temporarily hidden from the Sith ships' sensors, Hassin flew Druur over one of the Sith cargo transports that was carrying Lignan ore from the surface of the moon to the Harbinger. Druur donned a flexsuit and leaped from the Infiltrator to the transport."}, {"tag": "p", "text": "As the transport carried Druur toward the Harbinger, the Infiltrator was spotted, and the Sith deployed ten Blade-class starfighters to assail the fighter. Meanwhile, Druur arrived in one of the landing bays and quickly made his way to the hyperdrive chamber, hiding himself from the perceptions of the ship's Massassi crew as he passed them. However, he failed to do so in time to escape the notice of one Massassi, Drophan, who then attacked the Jedi Master. Druur was forced to kill him, and the Massassi's body was soon discovered, alerting Rrogon to the presence of a Jedi on board. Rrogon decided to capture the Jedi and present him to Dark Lord of the Sith Naga Sadow as a gift, and Druur soon felt Rrogon's presence reaching out for him to hunt him down."}, {"tag": "p", "text": "As Druur made his way to the ship's hyperdrive, Hassin reported via comlink that the dreadnaughts were preparing to jump into hyperspace. After fighting off a group of Massassi warriors, Druur augmented his speed with the Force and soon arrived outside the hyperdrive chamber, where he fought off eight Massassi warriors standing guard nearby. He then used an overrider to open the hyperdrive chamber and quickly incapacitated two Human engineers. As the ship prepared to jump into hyperspace, deadly radiation filled the room, giving Druur severe radiation poisoning; the Jedi Master realized that he would need treatment for it once he had completed his mission. He quickly attached three mag-grenades on timers to the hyperdrive and ordered his apprentice to flee into hyperspace. Hassin, however, declined his order, refusing to leave without Druur despite the Jedi Master's protests. Before Druur could flee the chamber, Rrogon arrived."}, {"tag": "h4", "text": "Confrontation with Rrogon"}, {"tag": "p", "text": "The Sith Lord confronted Druur, and both briefly attempted to convince the other to join him on their respective sides of the Force. Rrogon then attacked the Jedi Master, and the two began to duel. Druur easily beat back Rrogon's first assault, but the Sith Lord blasted him with Force lightning, which Druur failed to dodge. The Jedi Master recovered from the lightning, and the two squared off once more, but Druur became distracted as Hassin suddenly reported through his comlink that his Infiltrator had been hit. Rrogon took advantage of this distraction, rushing forward and getting past Druur's slow parry to cut off the Jedi Master's left arm."}, {"tag": "p", "text": "Rrogon moved in for the kill, but the mag-grenades that Druur had set on the hyperdrive finally exploded, cracking Druur's ribs and sending Rrogon flying across the chamber into the wall, knocking him unconscious. Druur contemplated killing Rrogon, but decided against it and fled the chamber for the ship's escape pods. Despite the destructive effects of the grenades' explosion, the Harbinger continued its jump sequence; Druur insisted that he had destroyed the drive, but Hassin replied in turn that his scanners still read an active hyperdrive aboard the ship. As Hassin's Infiltrator suffered more damage, Druur entered an escape pod and attempted to launch from the Harbinger. Hassin, however, knew that the Harbinger would still jump and, knowing that they could not risk allowing the ship to meet up with the Sith fleet at Kirrek, crashed the Infiltrator into the Harbinger's bridge, sacrificing himself to stop the ship from entering hyperspace."}, {"tag": "h3", "text": "Travel through time"}, {"tag": "p", "text": "Through the escape pod's viewport, Druur witnessed the death of his Padawan, causing him great anger and despair. He then watched as the heavily damaged Harbinger drifted toward the Omen as a result of the impact, but realized with shock that neither ship was aborting its jump sequence. Druur attempted to move his escape pod away from the Harbinger, but was unable to get far enough away before the ship jumped and pulled the escape pod with it as it entered hyperspace. Druur instantly realized that the jump had gone wrong; the hyperspace tunnel was unstable, and he occasionally saw flashes of black space through the streaks of hyperspace. Druur attempted to pull the pod out of hyperspace with the assistance of the Force, but failed to do so."}, {"tag": "p", "text": "Most of the Harbinger was destroyed by the jump, but Rrogon, who had since regained consciousness, managed to hold it together with the Force—coupled with the assistance of the Lignan—and he finally managed to pull the dreadnaught out of its misjump and back into realspace. Druur and the pod were also pulled out of hyperspace, and the Jedi Master found himself in a system he did not recognize, containing a blue gas giant with an icy moon. Unbeknownst to Druur, he and the Harbinger had actually traveled through time thousands of years to 41.5 ABY."}, {"tag": "p", "text": "Druur spotted a disk-like freighter the likes of which he had never seen before and launched his escape pod for it. The Jedi Master latched the pod onto the freighter and used his overrider to enter it, before preparing mag-grenades to blow open the inner airlock doors. The ship's occupants—Jedi Knight Jaden Korr, who was following a Force vision that had led him to the system; the ship's captain, the salvager Khedryn Faal; and Faal's first mate, the Cerean Marr Idi-Shael—realized that someone was trying to board the ship, and Korr and Faal rushed to meet the intruder. They arrived just as Druur blasted open the ship's inner air lock doors, and Korr engaged Druur in a brief duel."}, {"tag": "h3", "text": "Aboard Junker"}, {"tag": "p", "text": "Both Korr and Druur soon realized that the other was a Jedi, and broke off the duel. Druur insisted that he needed to commandeer the freighter—Junker—in order to get back aboard the Harbinger and prevent it from delivering its cargo to Kirrek. However, Korr revealed that the Battle of Kirrek had been fought thousands of years previously, and that Sadow had been dead for millennia. Korr went on to suggest that Druur's misjump had taken him through time as well as space, to which Druur replied that the Jedi was mad. Korr, however, added that lightsaber technology had evolved since Druur's time—Druur's lightsaber was connected to a power pack which he wore, as opposed to Korr's newer lightsaber, which contained a power cell in the hilt. Druur still attempted to deny what Korr was saying, but Korr insisted that, as a Jedi, he would not lie to Druur, and went on to reveal the galaxy's recent history—including the First and Second Galactic Civil Wars."}, {"tag": "p", "text": "Meanwhile, aboard the Harbinger, Rrogon saw Druur's escape pod attached to Junker and ordered two squadrons of Blade starfighters to attack the freighter. Upon seeing the approaching fighters, Faal wanted to flee to hyperspace, but Korr and Druur both refused; each wanted to stay in-system in hopes of achieving their respective missions. Korr quickly piloted the freighter into the gas giant's rings while Druur took up position at the controls of the freighter's tractor beam. During the ensuing chase, Druur used the tractor beam to briefly ensnare chunks of rock before letting them go, flinging them into the path of the pursuing Blade starfighters and destroying several of the fighters. In a plan formulated by Faal, Korr suddenly steered the freighter down and out of the rings, getting out of their pursuers' line of sight for a moment as Idi-Shael vented the ship's cargo. Korr then flew the freighter back up into the rings as the cargo—coupled with two mag-grenades supplied by Druur—hit a rock and exploded, causing the pursuers to believe the ship had been destroyed."}, {"tag": "p", "text": "Having shaken their pursuers, Korr parked Junker on one of the larger asteroids in the rings. Faal offered Druur treatment for his many injuries, but Druur refused, believing that pausing for treatment would mean shirking from his duties. Faal, however, decided that he did not want to continue catering to the two Jedi, as the situation had become too dangerous for his liking. Korr then revealed that Idi-Shael was slightly Force-sensitive, and asserted—with the support of Druur—that it was the Force that had brought them all together there for a purpose. Druur then insisted that he needed to get to the Harbinger quickly, reiterating the danger that the Lignan presented to the galaxy, although he refused Korr's help when the Jedi Knight offered it, stating that Korr's presence would be too powerful for him to mask from Rrogon. Instead, Idi-Shael proposed that he go with Druur, and the Jedi Master accepted."}, {"tag": "p", "text": "Druur, Korr, Idi-Shael, and Faal formulated a plan in which Faal would pilot Korr to the gas giant's moon in the shuttle Flotsam to continue the Jedi Knight's mission, while Idi-Shael would pilot Druur in Junker to the Harbinger, so that the Jedi Master could destroy the Lignan. Korr then confronted Druur about his anger and expressed concern for Idi-Shael, insisting that the Cerean was Druur's responsibility during the upcoming mission and requesting that Druur give his word that he would return Idi-Shael safely. Druur promised that he would do so and confronted Korr in turn about his doubt, before wishing the Jedi Knight luck on his own mission."}, {"tag": "h3", "text": "Final mission"}, {"tag": "p", "text": "As Korr and Faal left in the Flotsam, Druur's body began to fail him. The radiation poisoning he had obtained during his previous mission aboard the Harbinger had caused his body much internal damage, and regardless of the outcome of his upcoming mission, Druur knew that he would die. As Idi-Shael began piloting Junker out of the planetary rings and toward the Harbinger, however, they found that the dreadnaught had moved into orbit around the moon. Druur realized that the distance between Junker and the Harbinger was too great for the freighter to cover without the Harbinger noticing them and scrambling its fighters. Idi-Shael then suggested jumping right under the Harbinger, and although Druur was hesitant to risk it at first, he agreed to the plan, seeing no alternative."}, {"tag": "p", "text": "In under an hour, Idi-Shael mentally completed the required calculations to complete the jump; they made it successfully, coming out of hyperspace right under the Sith dreadnaught. The power of the Lignan seeped into Druur, and though he resisted it at first, he finally allowed it to fuel his anger, believing that Hassin's death warranted such fury. Idi-Shael powered down Junker, shifting power to the freighter's power crystal and firing it at the Harbinger's shields, boring a hole in them. Druur realized that Idi-Shael was having trouble repelling the effects of the Lignan and taught him a technique to resist it. Junker then drifted through the hole in the dreadnaught's shields created by the power crystal, and as they entered the Sith ship's landing bay, Idi-Shael powered up Junker once more."}, {"tag": "p", "text": "Druur ordered Idi-Shael to land Junker in a freight corridor just off of the landing bay. Several Massassi warriors moved into position to defend the craft against the intruders, and Druur disembarked from the freighter's cargo bay, quickly taking the offensive and attacking the Massassi crew. He defeated several of the assembled warriors, but a blaster bolt skimmed off of the stump of his arm that had been severed during his duel with Rrogon. Druur then found that he was no longer able to use his powers to heal himself or replenish his energy—only to attack. He realized that this meant he had fallen to the dark side, but no longer cared, as long as Rrogon was defeated and Hassin avenged."}, {"tag": "p", "text": "Druur ordered Idi-Shael to leave, but the Cerean instead decided to stay and help the Jedi Master, taking Faal's swoop bike from Junker's cargo bay and flying it straight toward the Massassi warriors. The Massassi fired on the bike, damaging it, but the distraction allowed Druur to decapitate two more warriors as Idi-Shael rolled off of the swoop, which careened into the corridor wall and exploded. As Druur killed the rest of the Massassi, he realized that he was enjoying the fight, smiling and laughing as he slaughtered the warriors. Idi-Shael again urged Druur to allow him to stay and help, but Druur quickly grew angry and refused the Cerean's assistance, claiming that this was something he had to do alone. The Jedi Master finally managed to convince Idi-Shael to go, and also urged him to give one final message to Korr—that nothing was certain, that there was only the search for certainty, and that things became precarious only when one thought that the hunt for certainty had ended. As the Cerean returned to Junker and fled the Sith dreadnaught, Druur fully embraced the dark side."}, {"tag": "h4", "text": "Second duel with Rrogon"}, {"tag": "p", "text": "Druur used the feel of the Lignan in the Force to guide him to the cargo hold, killing everyone he passed along the way. As he made his way through the ship, he found that he wanted Rrogon to find him, so that he could confront the Sith Lord again. Rrogon sensed that Druur was on his way to the cargo bay, and decided to confront his former Master alone. Upon arriving in the cargo bay, Druur found the containers which held the Lignan ore and decided to wait there for Rrogon to arrive so that he could kill the Sith in revenge for Hassin's death. As he waited, Druur was plagued by his failures, intensifying his anger and hate. He felt Rrogon's presence as the Sith Lord entered the cargo bay and urged Rrogon to show himself. The Sith Lord instead merely advised Druur to join him in the dark side, almost managing to convince him until the Sith added that if Druur did not join him, then Hassin would have died in vain."}, {"tag": "p", "text": "Pushed into a rage, Druur located Rrogon's presence in the Force and began telekinetically smashing some of the nearby containers of Lignan together, yelling at Rrogon to show himself. The Kaleesh finally obliged, drawing on the Lignan ore to enhance his strength and attacking Druur with Force lightning. The fallen Jedi drew the lightning into his lightsaber blade before flinging it back at Rrogon, but the Sith Lord simply absorbed the energy. However, as Rrogon drew on the Lignan to augment his power, the ore erupted into flames, burning out as it was used."}, {"tag": "p", "text": "Druur decided that—as he was no longer a Jedi—he would not use a Jedi weapon, and threw aside his lightsaber. He and Rrogon then jumped at each other over the Lignan and collided in mid-air, engaging in hand-to-hand combat. Druur finally telekinetically pushed Rrogon into a container of Lignan and attempted to drop another container on top of the Sith Lord, but Rrogon caught the container and threw it back at Druur, who managed to dodge it. Rrogon strode toward Druur, challenging his former Master's newfound anger; he claimed that his own rage was older and stronger and that Druur thus had no chance of matching it."}, {"tag": "p", "text": "Rrogon hit Druur with a telekinetic blast that sent the fallen Jedi through one of the containers of ore, cracking several of his ribs. The Sith Lord then began choking him through the Force; he struggled against Rrogon's power but was unable to counter it. Druur collapsed to the ground, and Rrogon called his lightsaber to his hand and prepared to kill him. Realizing that he had failed yet again, Druur was overwhelmed with despair; however, he then used the despair to draw on the power of the Lignan. Rrogon quickly realized what Druur was doing and began to draw on the ore himself, but Druur suddenly grasped the Sith Lord in a Force Choke of his own, easily overwhelming Rrogon's attempts to counter it."}, {"tag": "h4", "text": "Death"}, {"tag": "p", "text": "Druur continued to draw on the power of the Lignan as he choked his former apprentice. Rrogon stumbled forward with his lightsaber, but Druur quickly called the Sith Lord's weapon to his hand. Rising to his knees as Rrogon collapsed to his own, Druur stabbed Rrogon in the chest with the Sith Lord's own blade, killing him. So filled with the dark side of the Force that he felt as though he had transcended past being Human, Druur accepted that he had been consumed by it. He welcomed the fact and decided then that he would not allow himself to fail his final mission."}, {"tag": "p", "text": "Druur continued to draw in the power of the Lignan, causing the ore to erupt into flames even as the power of the dark side grew inside of him. Knowing that he would die no matter what, Druur consumed as much of the Lignan's power as he could—causing energy to spiral about him as his flesh became translucent. Druur then grabbed Rrogon's hand and was so overcome with emotion that a large mass of Force lightning exploded out from his body into the cargo bay, and he continued to draw in the Lignan as the lines of dark side energy spread throughout the ship. Druur finally unleashed the immense power he had consumed into the dreadnaught, engulfing the Harbinger in flames and destroying it as he died."}, {"tag": "p", "text": "Shortly after Druur's death, Idi-Shael was reunited with Korr and Faal, who had successfully completed their own mission. Idi-Shael revealed to Korr that Druur had begun to teach him some Force techniques, and Korr agreed that he would continue to teach Idi-Shael about the Force. Idi-Shael also relayed Druur's final message to Korr as the Jedi Master had requested; the Cerean went on to say that he disagreed with Druur's outlook, and that it may have been one of the reasons that Druur fell to the dark side."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Relin Druur was a solemn man who rarely showed any emotion. As a Jedi Master, he advocated calmness in his apprentices, believing that extremities of emotions led to the dark side and that evil stemmed from unrestrained ambition. Often pensive, he rarely laughed or smiled, especially after the fall of his first Padawan, Saes Rrogon, to the dark side of the Force. Druur's second apprentice, Drev Hassin, was lighthearted and was often able to get Druur to smile, although the Jedi Master still usually remained grave and serious in his mannerisms. Druur was also occasionally worried by Hassin's humor, as he believed the Askajian to have too casual an outlook on grave subjects; Hassin once replied to this concern that the Askajians believed there to be joy found in everything, although Druur countererd that pain could be found in everything, too."}, {"tag": "p", "text": "Despite his solemnity, Druur deeply appreciated the natural beauty of the galaxy, such as the red-orange clouds of the Remmon Nebula. Druur also had a strong sense of duty, refusing medical treatment aboard the Junker because he believed that accepting the delay of treatment before finishing his mission would mean shirking from his duties. He believed in completing his duty no matter how much pain it cost him, and grew angry when Faal suggested that he was a fool for not pausing for treatment. Druur was also disgusted by how careless the Massassi were with their lives. When one wounded Massassi asked for the Jedi Master to grant him death rather than leave him to live as a cripple, Druur at first refused, telling the warrior that everyone had to live with themselves. However, when the Massassi began to crawl for a blaster to continue the fight, Druur had no qualms with killing the warrior."}, {"tag": "p", "text": "Relin Druur also cared deeply for his Padawans; Rrogon's betrayal and Hassin's death both caused him great sorrow and filled him with self-doubt. He encouraged this doubt throughout his life, believing that such uncertainty kept him sharp. Still, after Hassin's sacrifice, Druur became consumed by a desire for revenge. He accepted this, believing that not wanting vengeance would be a disgrace to the memory of Hassin. During his final mission to the Harbinger, Druur found that he enjoyed killing the Massassi, and also found that he could no longer use his powers to heal or replenish himself. He realized that this meant he had fallen to the dark side, but no longer cared, as long as Hassin's death was avenged, Rrogon was killed, and the Lignan was destroyed."}, {"tag": "p", "text": "Shortly before Druur embarked on his final mission, Korr sensed the Jedi Master's anger and confronted him about the dangers of the dark side, while Druur in turn confronted Korr about his doubt. Druur ascertained that Korr had recently done something that had destroyed his image of himself in his mind, and Korr admitted that this was true. Druur went on to express his belief that Jedi always expected too much of themselves, and that it was impossible to fulfill such expectations. By this time, Druur's faith in the Force had diminished; and he told Korr that he had no wisdom to give him and simply wished the Jedi Knight luck in his upcoming mission."}, {"tag": "p", "text": "After Rrogon's fall to the dark side, Druur began to be consumed by doubt—he believed Rrogon's fall to be his own failure as opposed to the Kaleesh's. Throughout his life, Druur fed his doubt by blaming many failures on himself—by the time of his second duel with Rrogon, Druur believed that he had failed not only Rrogon, but also Hassin, the Jedi Order, and even Idi-Shael, for opening the Cerean up to the Force so that his first experience in intentional application of the Force was the feel of the Lignan. During his duel with Rrogon, Druur found that he considered his whole life to be just one long line of failures. It was during this final mission that Druur finally came to realize that his doubts were what had caused his descent to the dark side, leading him to believe that his fall had been inevitable."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Force-sensitive Relin Druur trained with the Jedi Order, eventually rising to the rank of Jedi Master. He was proficient in telekinesis techniques and used them frequently during his missions; he also was able to use the Force to effectively augment his running speed. Druur wielded a green-bladed lightsaber and was an accomplished duelist, although he lost his left arm in a duel with Rrogon when Hassin distracted him by announcing his Infiltrator had been hit. He was able to single-handedly take on and defeat several Massassi warriors at once."}, {"tag": "p", "text": "Druur could cloak his appearance from the perception of other beings, as well as mask his Force presence from other nearby Force-sensitives. He was also able to simultaneously mask his own presence and the presence of another Force-sensitive, although only if that being was not particularly powerful in the Force—Druur refused to allow Korr to join him on his final mission, claiming that the Jedi Knight's presence was too powerful for him to mask; on the other hand, Druur was able to hide both his and Idi-Shael's presences from Rrogon. Druur also utilized taunts and verbal affronts during his duels with Rrogon."}, {"tag": "p", "text": "After falling to the dark side of the Force, Druur found that his offensive powers were stronger, although he could no longer use the Force to heal or replenish himself. He was able to utilize very powerful forms of telekinesis with ease and was also able to draw on the Lignan ore to enhance his powers. During his second duel with Rrogon, Druur managed to catch the Sith Lord's Lignan-enhanced Force lightning on his lightsaber blade and throw it back at the Sith Lord, although it had no affect on Rrogon. With the help of the Lignan, he was also able to overpower Rrogon's Force Choke with one of his own, from which the Sith Lord was unable to escape. Druur also found that his powers in the dark side of the Force were less enhanced by rage or fury than they were by despair. Even after killing Rrogon with the Sith Lord's own lightsaber, Druur continued drawing on the power of the ore as he died, finally unleashing it upon the Harbinger and destroying the ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jedi Master Relin Druur first appeared in Paul S. Kemp's debut Star Wars novel, Crosscurrent, released January 26, 2010. Crosscurrent specified only that Imar Deez taught Druur how to shield himself from the effects of the dark side of the Force; therefore, whether or not Druur was officially apprenticed to Deez is ambiguous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}