{"url": "Relkass", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Saijo sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Relkass"}, {"tag": "p", "text": "Relkass was an Outer Rim Territories planet that featured an equatorial region of grasslands. The grasslands were home to the cactus known as the Relkass sentinel plant, which contained a powerful narcotic compound in its juice."}, {"tag": "p", "text": "During Relkass' dry season, the sentinel plants were fed upon by the draagax, a species of nocturnal pack creatures. The narcotic compound induced a state of frenzy in the draagax, causing them to attack other creatures on sight. The resulting losses suffered by the local ranchers led to a regular posting of bounties on draagax pelts. Commander Lajar Weqill once joined a hunting party on Relkass that fell prey to a draagax attack, an experience that proved deeply disturbing to Weqill."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Relkass was a planet that had at least one moon. It was located in the Relkass system, a part of the Outer Rim Territories' Saijo sector."}, {"tag": "p", "text": "A world with a pronounced dry season each year, Relkass featured equatorial grasslands that were home to small rodents. The grasslands' flora included the Relkass sentinel plant, a species of cactus blooming in the planet's dry season; and razorgrass, which could also be found on the Mid Rim world Togoria and the Core Worlds planet Corellia."}, {"tag": "p", "text": "Relkass' grasslands were neighbored by foothills dotted with numerous caves, in which lived a species of nocturnal, omnivorous pack creatures known as draagax. The draagax normally fed on the grasslands' plants and rodents. However, when they ingested the juice of the Relkass sentinel plant—which contained a powerful narcotic compound—the draagax entered a state of berserker-like frenzy that drove them to attack warm-blooded creatures, including humanoids, on sight."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point, the Human commander Lajar Weqill visited Relkass and ended up without enough currency to leave the planet. The local hunter Jameson convinced Weqill to join his party, which included Grendles and Zonder, for a hunt on draagax."}, {"tag": "p", "text": "The group set out from the Jameson ranch after darkness had fallen and was attacked by a pack of draagax not more than 500 meters from the ranch. The creatures surrounded the hunting party, and the latter launched into a frenzied shooting spree to ward them off, a situation that continued until the breaking of dawn. The bounty on the slain draagax was enough for Weqill to travel off Relkass; however, the commander was left deeply disturbed by the experience of the hunt and recorded it in an entry of a personal diary."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The inhabitants of Relkass included ranchers, who suffered losses due to draagax attacks. The situation led the local officials to offer a bounty of 200 credits per draagax pelt every dry season. The Jameson ranch was located on Relkass, and the hunter Jameson was a native resident of the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Relkass was first mentioned in the 1994 sourcebook Creatures of the Galaxy, published by West End Games for Star Wars: The Roleplaying Game. The book also featured an in-universe appearance of the planet within the short companion narrative \"A Moonlight Stroll In The Country...\" The 2009 reference book The Essential Atlas placed the Relkass system, and therefore the planet Relkass, in grid square K-20."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}