{"url": "Relics_of_the_Old_Republic", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Relics of the Old Republic"}, {"tag": "p", "text": "\"Relics of the Old Republic\" is the fourth episode of the Star Wars Rebels animated television series' second season. It is the nineteenth episode of the series overall."}, {"tag": "p", "text": "After premiering at New York Comic Con on October 8, 2015, the episode aired on October 21, 2015 on Disney XD."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "While Kanan continues to struggle with trust issues, the other rebels begin to form friendships with the old clones. And when Agent Kallus arrives, all must join together to battle the Imperials."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Due to Wolffe's actions, the Galactic Empire has tracked the Spectres to the planet Seelos. Admiral Kassius Konstantine and the Imperial Security Bureau Agent Kallus come to the Seelos system to capture or eliminate the rebels once and for all. At the clones' old All Terrain Tactical Enforcer, Sabine Wren is working on fixing the damage to the Phantom when Kanan Jarrus contacts her to ask how its going. He then contacts Hera Syndulla, in orbit on the Ghost fixing the ship's hyperdrive. She tells him there's no sign of the Empire, just before the Imperial Star Destroyer Relentless drops out of hyperspace, prompting Hera to exasperatedly comment about her tempting of fate. Hurriedly, she shuts down all of the starship's systems, including her astromech droid Chopper, who protests, to avoid being detected by the Empire."}, {"tag": "p", "text": "Before parting company, Rex gives Ezra Bridger a datachip containing a list of former Republic bases in the Outer Rim Territories and Mandalore, as well as some old Separatist bases. Ezra tells Rex that the clones should join the rebellion but Rex politely declines, saying that he has seen too many battles. However he, Gregor and Wolffe offer to stay behind in order to delay the Empire so that the Spectres can escape aboard the Phantom and rejoin the Ghost in space. Contacting the clones, Agent Kallus demands that they hand over the rebels. Wolffe denies that there are any Jedi or rebels around, claiming that his old cybernetic eye must have been malfunctioning. Kallus reveals that he has images from the probe droid revealing the presence of rebels, at which point Rex enters the conversation and tells the ISB agent that if he wants a fight, he should have brought a better class of soldier than Imperial stormtroopers. Kallus smugly responds that they are loyal and he has a great many of them, and Rex retorts that he's going to need all of them before ending the transmission."}, {"tag": "p", "text": "A sandstorm stirs up near the modified AT-TE that prevents the rebels from departing. Agent Kallus deploys three AT-AT walkers to destroy the clones and rebels. Rex has the idea of fleeing into the sandstorm, with Kanan and Ezra Bridger using their Force powers to guide the walker. The Imperials will be blinded, but the rebels won't. Kanan, despite his mistrust of the clones, agrees to go along with the plan. He guides the AT-TE into a position where they are surrounded by Kallus' three AT-ATs, telling Rex that this is their best opportunity to destroy one of them. Ezra and Sabine are sent up to the AT-TE's main gun in order to make the shot, with Rex loaning the Padawan his helmet as protection from the storm. With guidance from Kanan, Ezra makes the shot, hitting one of the AT-ATs in the neck and destroying it, allowing the clones' walker to flee the remaining two."}, {"tag": "p", "text": "Back in space, Admiral Konstantine receives a transmission from Darth Vader, ordering him to rendezvous with his shuttle in space. Konstantine protests that this will compromise Kallus' ground mission, but the orders are clear, and the Relentless departs the system. Hera, working with Chopper, who she had reactivated at low power, witnesses this. She's not sure what the Star Destroyer's departure means, but orders Chopper to continue working on repairs."}, {"tag": "p", "text": "After exiting the sandstorm, the Spectres prepare to depart on the Phantom to rejoin the Ghost in space. Despite Ezra's willingness to stay and fight, Rex commands Ezra to leave, as the clones prepare to hold off Kallus and his two remaining AT-AT walkers. As the rebels depart on the Phantom, Kallus' AT-AT walker manage to subdue the clones' walker. Before Kallus can destroy the clones, Ezra convinces Kanan and the other rebels to turn back and help the clones, pointing out that the old soldiers are willing to fight to the death."}, {"tag": "p", "text": "Despite his misgivings about the clones, Kanan agrees with Ezra and flies the Phantom back into the fray. While Sabine pilots the shuttle, Kanan, Ezra and Garazeb Orrelios commandeer one of the AT-ATs and turn its weapons on Kallus' AT-AT walker. With his AT-TE no longer trapped under the AT-AT walker's legs, Rex is able to destroy Kallus' walker with a critical hit. Kallus and his remaining men flee the battle on a speeder, while the clones salute Ezra and Kanan. Rex agrees to join the rebels, and returns with them to Phoenix Cell."}, {"tag": "p", "text": "Meanwhile in space, Admiral Konstantine greets the shuttle that landed in his Star Destroyer's hangar. Instead of Vader, however, the Admiral is surprised to see the Fifth Brother, a Force-sensitive Inquisitor. When Konstantine tells him that his diversion may have compromised Kallus' mission, the Fifth Brother expresses indifference and claims that he will succeed where Kallus and Konstantine had failed."}, {"tag": "p", "text": "Returning to the Phoenix rebel fleet, the Spectres and Rex reunite with Ahsoka Tano. When Rex comments that Ahsoka has grown old, the former Jedi Padawan responds that \"It had to happen sometime, Rex\" as they embrace. The Spectres, Ahsoka and Rex walk off together."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In Rebels Recon #2.06: Inside \"Wings of the Master,\" Lucasfilm Story Group spokesperson Pablo Hidalgo confirmed that Gregor and Wollfe stayed behind on Seelos and made the remaining AT-AT walker their new home."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}