{"url": "Relentless", "categories": ["Category:Canon articles", "Category:Imperial I-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Relentless"}, {"tag": "p", "text": "The Relentless was an Imperial I-class Star Destroyer commanded by Admiral Kassius Konstantine. On the day of the Galactic Empire's fifteenth anniversary, it was requisitioned by the Grand Inquisitor, the Emperor's Jedi hunter, to give chase to a group of rebellious individuals who tried to smuggle Tseebo off of the planet Lothal."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pursuit of the Ghost"}, {"tag": "p", "text": "The Relentless was an Imperial I-class Star Destroyer under the command of Admiral Kassius Konstantine. On the day of the Galactic Empire's fifteenth anniversary, it was requisitioned by the Grand Inquisitor, the Emperor's Jedi hunter, to give chase to a group of rebellious individuals who tried to smuggle Tseebo off of the planet Lothal. The Inquisitor had placed a XX-23 S-thread tracker on the rebels' ship, the Ghost, and started pursuing them in hyperspace. When the rebels found the tracker, they discovered it had actually attached to the ship's shuttle, the Phantom. So two of the rebels, the Jedi Kanan Jarrus and Ezra Bridger, detached the shuttle and landed on Fort Anaxes. The Grand Inquisitor, onboard the Relentless, followed the signal, enabling the Ghost's escape while the Inquisitor and his troops faced the rebels on the asteroid, being defeated."}, {"tag": "h3", "text": "Deceit of Calrissian"}, {"tag": "p", "text": "Later the rebels, working with the smuggler Lando Calrissian, tried to sneak past the Imperial blockade of Lothal after acquiring a puffer pig from the crime lord Azmorigan. The Ghost had a signature modulator to disguise itself when dealing with Imperial ships. Some problems with the pig, however, led to the modulator being disabled, so the Relentless was able to identify the ship. Konstantine deployed TIE fighters and tried to take down the Ghost with turbolasers, but the light freighter took cover in Lothal's clouds, shooting the TIEs down and preventing the Relentless from continuing the pursuit."}, {"tag": "h3", "text": "Siege of Lothal"}, {"tag": "p", "text": "The Relentless was one of the Star Destroyers chosen by the Empire to besiege Lothal. The rebels, after leaving Capital City, asked Calrissian to help them smuggle themselves offworld, and he offered them some equipment to leave the planet without being detected by Imperial forces. They launched some modified masking transponders in Lothal's sky, which replicated the signal of their stolen Sentinel-class landing craft. Konstantine deployed TIE fighter squadrons to follow the signals, but by the time he understood the rebels' trick, they had already departed Lothal's atmosphere. However, Konstantine and his crew were mollified when it was revealed that Darth Vader had already placed a tracker on the shuttle."}, {"tag": "p", "text": "The Sith Lord reached the rebels, who had rendezvoused with their allies in Phoenix Cell, and attacked their ships with his TIE Advanced x1. The Relentless and other Star Destroyers joined Vader when the battle was already lost for the rebels in an attempt to prevent their enemies from escaping. While Vader had succeeded in destroying the rebel command ship Phoenix Home, most of the Phoenix fleet, with the exception of the Ghost, had already managed to flee into hyperspace. The Relentless and another Star Destroyer attempted to trap the Ghost. However, the freighter's captain, Hera Syndulla, managed to jump into hyperspace before the Relentless and the other Star Destroyer could activate their tractor beams, and they captured Vader's TIE Advanced instead, to Konstantine's horror."}, {"tag": "h3", "text": "Hunting the rebellion"}, {"tag": "p", "text": "Following the attack on the Phoenix fleet, the Relentless took part in a hunt for the fleeing rebels throughout the Outer Rim Territories. At a later point, Admiral Konstantine and Agent Kallus received a transmission from the former Clone Commander Wolffe that the crew of the Ghost were on Seelos. While the Relentless stayed in space to provide backup, Kallus led a ground assault force of three AT-AT walkers against the crew of the Ghost and the clone troopers Rex, Gregor, and Wolffe, who manned an antiquated AT-TE walker. The Relentless was unable to provide air support to Kallus' forces during the battle because the ship had received orders to pick up an Inquisitor known as the Fifth Brother in deep space."}, {"tag": "p", "text": "Later, the Relentless detected a power surge from an abandoned Old Republic Haven-class medical station in deep space. The surge had been caused by several crew members of the Ghost crew, who were salvaging medical supplies from the abandoned station. When Admiral Konstantine offered to provide reinforcements, the Fifth Brother insisted on going alone. During the ensuing skirmish, he another Inquisitor known as the Seventh Sister nearly succeeded in capturing several rebels including Chopper, Ezra Bridger and Sabine Wren. However, the rebels were able to escape due to the quick thinking of Garazeb Orrelios."}, {"tag": "p", "text": "After the Seventh Sister and the Fifth Brother discovered that the Phoenix rebels were hiding on the planet Garel, the Relentless was part of the Imperial fleet that attacked Garel. During the battle, the Relentless and its fellow Star Destroyers bombarded the escaping rebel ships and unleashed several TIE fighters. Under the command of Admiral Konstantine, the Relentless also managed to snag the rebel command ship Liberator with its tractor beam projector. However, Hera managed to use the Ghost to knock out the Relentless' tractor beam projector, allowing the Liberator to flee into space."}, {"tag": "p", "text": "The Relentless later led an attack on the Phoenix rebel fleet, which was low on fuel. When the ship's scanners picked up the rebel ship known as the Ghost, Konstantine recognized it as the vessel that had raided the Imperial fuel depot at Horizon Base. Realizing that the rebels were low on fuel, he ordered the Relentless and its TIE fighter escorts to prevent the Ghost from landing. Despite their best efforts, the Ghost managed to land due to the timely intervention of Ketsu Onyo's starship, the Shadow Caster. After receiving intelligence from the astromech droid Chopper and the inventory droid AP-5, the rebel fleet fled to Atollon, a safe system with no Imperial presence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}