{"url": "Relentless_(Pellaeon-class)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Flagships", "Category:Pellaeon-class Star Destroyers", "Category:Starships of Darth Krayt's Galactic Empire"], "nodes": [{"tag": "h1", "text": "Relentless (Pellaeon-class)"}, {"tag": "p", "text": "The Relentless was a Pellaeon-class Star Destroyer which served as the flagship of Darth Krayt's Outer Rim Third Fleet seven years after the Dark Lord of the Sith deposed Galactic Emperor Roan Fel at the end of the Empire's war with the Galactic Alliance. Under the command of Kel Dor Admiral Sha Dun, the fleet had been tasked with capturing Admiral Gar Stazi—the commander of the Galactic Alliance Core Fleet—as well as destroying the unified fragments of the Alliance military."}, {"tag": "p", "text": "Despite many minor victories, Dun failed to stop Stazi's attacks, and was executed for his failure on the command deck of the Relentless by Darth Azard, the Sith Lord who oversaw the Third Fleet. Dun was replaced with the Humanocentric Admiral Dru Valan, and under his command, the Relentless saw further action against the Alliance forces above the planet Dac. The battle above Dac resulted in another loss to Stazi, and the Alliance forces captured the Advanced Star Destroyer Imperious, which was under construction at the planet's shipyards. Though the Relentless survived the battle, the Third Fleet was devastated. Disgraced, Valan gave command of the Relentless to the vessel's captain, Hoge, and retired to his quarters to contemplate suicide."}, {"tag": "p", "text": "Following Darth Wyyrlok's order for the execution of the Final Protocol, a plan that saw the oceans of the Mon Calamari homeworld Dac poisoned and all of the inhabitants executed within one week, the Relentless and the Outer Rim Third Fleet, now under the command of Admiral Krion Grail, were sent to prevent the success of the Alliance's rescue effort on the planet. With the mission overseen by Moff Geist and Darth Stryfe, the Third Fleet engaged Admiral Stazi's forces until the arrival of a fleet loyal to Emperor-in-exile Roan Fel arrived to aid the Alliance fleet, when Stryfe was forced to withdraw his forces."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Relentless was a Pellaeon-class Star Destroyer, a class of ship that was originally manufactured by Kuat Drive Yards for the Fel Empire. The design of the ship drew upon the distinctive wedge-shape of earlier Star Destroyers, and featured a heavily-slanted forward hull. Offensively, the Relentless was armed with turbolasers and sported a complement of Predator-class fighters. The Star Destroyer was also equipped with shields, a hyperdrive system, and sensor equipment."}, {"tag": "p", "text": "Like previous Star Destroyers, the Relentless's bridge featured a command walkway that ran up the center of the command deck with crew pits on either side. The Star Destroyer's convex array of tetragonal viewports allowed the vessel's commander a view of the battlefield."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Hunting Stazi"}, {"tag": "p", "text": "In 137 ABY, seven years after Dark Lord of the Sith Darth Krayt deposed Galactic Emperor Roan Fel and established his Sith regime at the end of the Empire's war with the Galactic Alliance, the Pellaeon-class Star Destroyer Relentless was the flagship of Krayt's Outer Rim Third Fleet. Overseen by Quarren Sith Lord Darth Azard, the Imperial Outer Rim Third Fleet had been charged with capturing the fugitive commander of the Galactic Alliance Core Fleet, Admiral Gar Stazi, as well as destroying the unified fragments of the Alliance military that had been dubbed the Galactic Alliance Remnant. Emperor Krayt had placed Kel Dor Admiral Sha Dun in charge of the mission, and under his command, the Relentless and the Third Fleet won a number of small victories over Stazi and the Alliance Core Fleet."}, {"tag": "p", "text": "Despite the many minor victories, however, Dun failed to stop Stazi's attacks. On the command deck of the Relentless, which was then stationed in the Calamari sector, Lord Azard executed Admiral Dun for his failure and replaced him with the Humanocentric Admiral Dru Valan, who had already faced Stazi during the Battle of Caamas, the last major battle of the Sith–Imperial War. Azard told Valan not to underestimate Stazi as Sha Dun had, and warned the admiral not to fail him. As his first act in command of the fleet, Valan had the Relentless's captain, Hoge, replace all alien personnel of the fleet with Human personnel."}, {"tag": "p", "text": "Admiral Valan plotted to set up a trap for Stazi by baiting him with the possibility of capturing the Advanced Star Destroyer Imperious, which was under construction in the shipyards of the planet Dac. Aboard the Relentless, the Toydarian information broker Niffla informed Valan that she had seen Monia Gahan—a member of Rogue Squadron and the niece of former Galactic Alliance Triumvir Gial Gahan—at the shipyards, indicating that Stazi had taken the bait. Several days later, Stazi's fleet jumped into the system to take the Imperious, and Valan sprung his trap. Arriving in the Calamari system with the Relentless and the Third Fleet, Valan believed he had Stazi's fleet trapped between his fleet and the shipyards. Stazi had prepared for Valan's trap, however, by setting his own trap with the aid of the Mon Calamari."}, {"tag": "p", "text": "Valan and Hoge oversaw the battle from the bridge of the Relentless, and watched as Stazi's fleet attacked, leading Valan to order the shipyards automated defense systems to come online and fire on the Alliance ships. Control of the shipyard's defense systems had been taken over by the Alliance, however, and sustained fire from both it and the Alliance fleet brought the Relentless's shield strength to as low as twenty percent. After Stazi moved his fleet behind the shipyards, Valan had the Relentless and the other vessels in the fleet release their Predator-class starfighters. Believing one dock to be expendable, Valan proceeded to order his fleet to fire through the shipyard dock which hid Stazi's flagship, the Scythe-class battle cruiser Indomitable, as the rest of the Alliance fleet made their escape."}, {"tag": "p", "text": "The Alliance captured the Imperious and destroyed a third of the shipyards. The Relentless survived the battle intact; however, Valan's fleet was devastated and Stazi once again escaped. Disgraced, Valan gave command of the Relentless to Captain Hoge and retired to his quarters to contemplate suicide, rather than face Darth Azard."}, {"tag": "h3", "text": "Evacuation of Dac"}, {"tag": "p", "text": "After Darth Wyyrlok ordered the execution of the Final Protocol, a plan that saw the oceans of the Mon Calamari homeworld Dac poisoned and all of the inhabitants executed within one week, the Relentless, along with the rest of the Outer Rim Third Fleet, was being overseen by Darth Stryfe. Knowing Admiral Stazi would return to save the inhabitants of Dac, the Outer Rim Third Fleet, now under the command of Admiral Krion Grail and Moff Geist, was dispatched to ensure the failure of the rescue effort."}, {"tag": "p", "text": "Ten hours into the Alliance rescue operation, the Third Fleet entered the system and engaged Stazi's forces. Although the Sith fleet outnumbered the Alliance forces, Stazi used ion bombs loaded aboard drone ships to take out much of the Third Fleet. When the Relentless and the other Imperial vessels destroyed the drones, they released an ion charge that damaged the ships' sensors, allowing the Alliance to attack while the Sith fleet was temporarily crippled. The Relentless barely escaped destruction, and Stryfe ordered Grail to target the first wave of refugee ships as they attempted to leave the system."}, {"tag": "p", "text": "While the Sith attacked Stazi's flagship, which protected the refugee ships, a fleet loyal to former Emperor Roan Fel's Empire-in-exile—come to aid in the evacuation of Dac—entered the system and engaged Stryfe's forces. Knowing that the Relentless could not continue the attack without being destroyed, Geist convinced Stryfe to withdraw their remaining ships. Now uninhibited by the Sith fleet, the Alliance and Imperial forces were able to evacuate twenty percent of the planet's population."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "As the flagship of the Outer Rim Third Fleet, the Relentless was under the overall command of the Kel Dor Admiral Sha Dun during the mission to eliminate Alliance admiral Gar Stazi. After Dun was killed by Darth Azard for his failure to stop Stazi, the Relentless and the Third Fleet came under the overall command of the speciesist Human Admiral Dru Valan. The vessel itself was commanded directly by Captain Hoge, who served under both Dun and Valan. After the battle with Stazi's fleet at Dac, Valan gave command of the Relentless's bridge to Captain Hoge. Later, during the evacuation of Dac, the Relentless continued to serve as the flagship of the Third Fleet and was under the overall command of Admiral Krion Grail."}, {"tag": "p", "text": "Under Dun's command, both the Relentless and the other vessels of the Third Fleet were crewed by members of different species. However, as his first act in command Valan ordered Captain Hoge to replace all alien personnel of the fleet with Human personnel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Relentless made its first appearance in the twentieth issue of the Star Wars: Legacy series, Indomitable, Part 1, published in February 2008. The vessel also appeared in part two of the Indomitable story arc, released in March 2008. Both issues were written by John Ostrander and penciled by Omar Francia. The Relentless later returned in Legacy 47, published in April 2010, this time penciled by Jan Duursema."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}