{"url": "B3_ultra_battle_droid", "categories": ["Category:Legends articles", "Category:B-series battle droid models"], "nodes": [{"tag": "h1", "text": "B3 ultra battle droid"}, {"tag": "p", "text": "The B3 ultra battle droid was a powerful prototype battle droid designed by the Confederacy of Independent Systems and deployed approximately five months after the Battle of Geonosis."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The B3 ultra battle droid was based on the B2 super battle droid model, though it was far larger and bulkier than the B2, and boasted more substantial armor. The B3 had two large primary arms: the right arm, containing a tight-spray flamethrower; and the left arm housing a wide-spray plasma cannon.\nTwo smaller secondary arms, located underneath the primary limbs, featured deadly rapid-fire forearm blaster cannons, similar to the B2 battle droid."}, {"tag": "p", "text": "Built into the droid's left shoulder was a missile launcher containing brilliant missiles, capable of highly sofisticated target acquisition and tracking. The design also featured a Density projector, a device capable of increasing the droid's weight twenty-fold. This enabled it to lock itself in place and made it nearly impossible to topple over, counteracting the droid's high center of gravity, although doing so would make it an easier target for Republic heavy weapons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The B3 ultra battle droid was by far the deadliest single battle droid manufactured by the Trade Federation. Thankfully for the Grand Army of the Republic, the droids suffered from technical problems and were never mass produced."}, {"tag": "p", "text": "Wat Tambor had held a challenge for two teams, Metalorn and Foundry. Foundry had developed a droid known as the Avatar-7. This was the droid which received General Grievous' blessing. It was dubbed the B3 and was commissioned as a frontline battle droid. Baktoid Combat Automata never visualized having them sent into combat in large numbers like B1-Series battle droids, owing to the B3's high cost per unit. B3 units were used by the Trade Federation for frontal assaults against well-defended targets. They were often used in place of droidekas, being far cheaper than the destroyer droids."}, {"tag": "p", "text": "Jedi Masters Mace Windu and Saesee Tiin faced the Avatar-7 prototype at the Battle of Iktotch. Though their individual skills were not enough to overcome the behemoth, the Jedi worked together to defeat it, eventually destroying it by crushing it under the remains of a Hailfire droid. B3s were also used during the Outer Rim Sieges, where they served as sparse heavy units under individual Separatist commanders. However, exorbitant manufacturing costs and persistent malfunctions with the droid's density projectors prevented widespread use."}, {"tag": "p", "text": "After the Clone Wars, hundreds of units were used at the Imperial Academy's urban-warfare training zone on the planet of Carida."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}