{"url": "Remembrance_Day", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic holidays"], "nodes": [{"tag": "h1", "text": "Remembrance Day"}, {"tag": "p", "text": "Remembrance Day was a holiday celebrated by the members of the Rebel Alliance in the tradition of the Old Republic's Republic Day. It was held at the same time as the Imperial Empire Day."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 1 ABY, during the height of the Galactic Civil War, Princess Leia used the holiday to celebrate all those who had died in the name of the Rebel Alliance. On this day, she arrived just on the outskirts of Coronet on Corellia on the Millennium Falcon to a crowd of Rebel soldiers and sympathizers. A fountain with a statue of Jedi Master Yoda had been installed for this event, to honor the Jedi who had served valiantly in the Clone Wars."}, {"tag": "p", "text": "Guarded by members of the Rebel Alliance Honor Guard, the princess thanked the crowd for their continued support and asked them to celebrate those lost in the war, and even called out a few of the soldiers present by name. After visiting for a short time, she boarded the Falcon with Han and Chewie to leave the planet. As she departed, Rebel starships flew by as fireworks exploded overhead."}, {"tag": "p", "text": "During the Remembrance Day festivities, Captain Derlin tasked loyal Rebels to graffiti tag Imperial propaganda posters around the city, and put up posters which proclaimed, \"Remember Alderaan.\" Major Carlist Rieekan tasked Rebel traders to gather supplies from crashed Rebel shuttles, and gave entertainers the option to entertain Rebel soldiers in the Coronet cantina. Wedge Antilles also participated in the Remembrance Day festivities, tasking a Rebel operative to rescue six Rebel pilots from a prison facility in an Imperial Fortress."}, {"tag": "p", "text": "Due to Coronet's sympathetic nature to the Rebellion, the Empire did little to stop the Remembrance Day festivities from taking place. However, there were reports of Imperial soldiers gunning down those who vandalized Imperial posters."}, {"tag": "p", "text": "During festivities, various souvenirs were also sold and handed out, including paintings and posters (Darth Vader, Princess Leia, etc.); models (decoration devices and space station models), decorative sashes; an automated target dummy (based on either the Rebels or the Empire) and tools (Novaless Soni-Optics Goggles Mark V). Although some were exclusive to either Empire Day or Remembrance Day, most of them were available on both holidays. In addition, an event organizer often stood near the Statue of Yoda at the atrium of Coronet City, where he sold various pro-Rebel rations such as Favorites of the Force and Death Star Destruction to those loyal to the Rebel Alliance. However, due to the Alliance's war against the Empire, the organizer will specifically turn away any Imperial-aligned soldiers who try to receive any of the rations."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Remembrance Day was a recurring event in the MMORPG Star Wars Galaxies. There was three in-game celebrations, each in the June of 2008, '09, and '10. All players that visited the celebrations received a special The Empire Strikes Back movie poster and could buy Favorites of the Force and Death Star Destruction, food that temporarily enhanced the players' stats."}, {"tag": "p", "text": "Once every hour, the Millennium Falcon landed and Princess Leia called out one of the Rebel-aligned player characters present at the celebration. This player received a special badge and the title \"Hero of Remembrance Day.\""}, {"tag": "p", "text": "This changed slightly in the 2009 celebration. Leia would land every 15 minutes and call out three players, this time receiving the title \"Champion of Remembrance Day.\" Players would also receive a Return of the Jedi movie poster to commemorate the six year anniversary of Star Wars Galaxies. In addition, the 2009 celebration included additional quests for players. The 2010 representation of Remembrance Day remained widely unchanged, except it offered players new badges, a few extra rewards, and a new title, \"Chosen of Remembrance Day.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}