{"url": "Ren_Auglu", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi Commanders", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ren Auglu"}, {"tag": "p", "text": "Ren Auglu was a male Human Jedi Padawan who served the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Human born to a family on Naboo, Ren Auglu was handed over to the Jedi Order following his father's death during the Invasion of Naboo in 32 BBY. Taken to the Jedi Temple on Coruscant, Auglu began his Jedi training in an Initiate clan for the next several years. Before reaching the age fourteen, Initiate Auglu was selected by Jedi Master Ulseh to continue his training in the field as a Padawan."}, {"tag": "p", "text": "When the Clone Wars broke out across the galaxy between the Republic and the Confederacy of Independent Systems, Padawan Auglu was made a Commander in the Grand Army of the Republic and assigned to several missions. In 22 BBY Auglu followed Master Ulseh to the planet Argul where they would fight side by side in the battle against the Confederacy's Droid Army. During the battle, the pair would oversee the evacuation of the injured Argullians. After an Acclamator-class assault ship was shot down over the planet, Master Ulseh rushed to assist the crash victims. While Auglu survived the battle, Master Ulseh died from a droid attack on the ship's wreckage."}, {"tag": "p", "text": "Alone on the planet with several other Padawans, Auglu continued to lead troops against the forces of Commander Drogen Hosh unsuccessfully. As Hosh prepared for a final assault he sent Auglu and the other Padawans an offer in which he would accept their surrender. Before Hosh received a decision however, Grand Master Yoda arrived on the planet with reinforcements and defeated Hosh. Victorious, Auglu and the other Padawans returned to the Jedi Temple."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Auglu made his only appearance in Only the Force, a scenario for the Star Wars Roleplaying Game. In that, the player playing as Auglu can choose Auglu's sex. However, he is described as male in the biographies of the other playable characters, so that can be assumed to be his canonical sex."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}