{"url": "Rena_Owen", "categories": ["Category:Real-world articles", "Category:Stay On Target", "Category:Star Wars Episode II: Attack of the Clones voice actors", "Category:Star Wars: Episode II Attack of the Clones actors", "Category:Star Wars: Episode III Revenge of the Sith actors", "Category:Star Wars: Republic Commando voice actors", "Category:Star Wars: The Bad Batch voice actors"], "nodes": [{"tag": "h1", "text": "Rena Owen"}, {"tag": "p", "text": "Rena Owen (born July 22, 1962) portrayed Nee Alavar in Star Wars: Episode III Revenge of the Sith. She also was the voice of Taun We in Star Wars: Episode II Attack of the Clones and the video game Star Wars: Republic Commando."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Owen comes from a family of nine children. She was born to a Māori/Welsh father and a European mother."}, {"tag": "p", "text": "In 1994, Owen appeared in Lee Tamahori's film Once Were Warriors as the wife of the character played by Temuera Morrison (Jango Fett and clone troopers). Her role in Once Were Warriors earned Owen several awards, such as the award for Best Actress at the Montreal World Film Festival, the Festival Award at the San Diego International Film Festival and the Spirit Award at the Cannes Film Festival. Owen and Morrison played together again in the film's sequel, What Becomes of the Broken Hearted?"}, {"tag": "p", "text": "Owen shared screen time with Bai Ling (Bana Breemu) in the 2008 film A Beautiful Life. In 2009, she played alongside Keisha Castle-Hughes (Queen Apailana) in the TV movie Piece of My Heart. Castle-Hughes played the young version of Owen's character."}, {"tag": "p", "text": "In 2011, she appeared in the film Snitch along with Edward Asner (voice of Vrook Lamar in Star Wars: Knights of the Old Republic and its sequel). One of Owen's castmates in the TV series Medivac was Graeme Blundell (Ruwee Naberrie)."}, {"tag": "h2", "text": "Filmography"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}