{"url": "Rendezvous_at_Bespin", "categories": ["Category:Real-world articles", "Category:Star Wars Galaxy of Adventures episodes"], "nodes": [{"tag": "h1", "text": "Rendezvous at Bespin"}, {"tag": "p", "text": "\"Rendezvous at Bespin\" is the forty-ninth episode of Star Wars Galaxy of Adventures. It premiered on the Star Wars Kids YouTube channel on June 11, 2020. It was later compiled into an omnibus YouTube video called \"The Empire Strikes Back 40th Anniversary\", that was released on June 19, 2020."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the run from the Galactic Empire, Han Solo, Leia Organa, Chewbacca, and C-3PO seek refuge with Han's old friend Lando Calrissian on Cloud City. After landing the Millennium Falcon, they receive a frosty reception from Calrissian, who is still bitter about the loss of the Falcon. However, Lando becomes friendly and hugs Han, asking him what he is doing on Bespin. Han tells Lando that he is here for repairs and asks if he can help."}, {"tag": "p", "text": "Later, Lando leads Han, Leia, and Chewbacca into a dining room, claiming that he has made a deal that will keep the Empire out of Cloud City forever. Inside the dining room, they are confronted by Darth Vader and Boba Fett. Han shoots at Lord Vader but the Sith Lord uses the Force to deflect his blasts and seize his blaster. Vader tells the rebels that they will be honored to join them. As Lando apologizes for selling out his friend, the doors close."}, {"tag": "p", "text": "In the carbon-freeze chamber, Solo is lowered into the machine in the presence of the Imperials, his rebel comrades, and Lando. Leia tells Han that she loves him before he is frozen in carbonite. As the frozen Han is lifted, Chewbacca lets out a deep wail."}, {"tag": "p", "text": "Later, Chewie, C-3PO and Leia are escorted by stormtroopers through Cloud City's corridors. Experiencing a change of heart, Lando contacts Lobot and several Bespin Wing Guards who disarm the Imperials. Leia is still angry and distrustful of Lando, asking him what he is doing. Lando replies that he is getting them out of here and releases Chewbacca's restraints. Leia refuses to trust him and Chewbacca chokes Lando, who mouths that he was trying to save Han."}, {"tag": "p", "text": "Later, Boba Fett watches as a Bespin Wing Guard places Han's frozen body aboard his ship Slave I. Lando, Leia, and Chewbacca arrive with C-3PO but are unable to stop Fett from escaping with Han. Later, the rebels escape aboard the Millennium Falcon following a gun battle with Imperial forces. Leia, Chewbacca, and Lando power up the Falcon and fly away from Cloud City."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}