{"url": "Rendezvous_on_Barkhesh", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Battles in the Outer Rim", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Rendezvous on Barkhesh"}, {"tag": "p", "text": "The Rendezvous on Barkhesh was a battle fought on the planet Barkhesh between Alliance to Restore the Republic forces under the command of General Carlist Rieekan—allied with native Barkhesh Resistance forces—and the Galactic Empire in 0.5 ABY. Following the evacuation of Yavin Base after the Battle of Yavin, the Alliance needed to recoup the large number of supplies either left behind on Yavin 4 or destroyed by Imperial forces during the evacuation."}, {"tag": "p", "text": "The Barkhesh Resistance offered supplies to the Alliance, and an Alliance Lambda-class T-4a shuttle was assigned to rendezvous with a Barkhesh supply convoy and pick them up. Because of Imperial forces in the region, Commander Luke Skywalker and Rogue Squadron were assigned to escort duty. The Rogues protected the vital convoy as it moved from a supply base to the landing zone, engaging TIE bombers, All Terrain Scout Transports, and static turbolaser defenses. Rogue Squadron eliminated the enemy presence, and the cargo transfer proceeded unhindered."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 0.5 ABY, following the evacuation of Yavin Base in the wake of the Battle of Yavin, the Alliance to Restore the Republic found itself short on critical supplies. To this end, the Barkhesh Resistance, based on the planet Barkhesh in the Seitia sector of the Outer Rim Territories, offered to transfer several transports worth of supplies to the Alliance, which they did on a semi-yearly basis. General Carlist Rieekan oversaw the operation, which would require the transports to traverse a series of canyons between their supply base and the predetermined landing zone. Aware that local Imperial forces would attempt to stop the operation, Rieekan assigned Rogue Squadron, led by Commander Luke Skywalker, to fly escort for the convoy."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Commander Skywalker, leading a five-fighter formation of T-65 X-wing starfighters, arrived at the designated coordinates on Barkhesh to hook up with the Resistance's convoy and immediately encountered Viper probe droids near the supply base. Rogue Squadron made short work of a group of four of them, then engaged a second group of four shortly after flying over the supply base and rendezvousing with the convoy proper. With the immediate area clear of threats, the supply convoy—consisting of five large armed transports and three small combat vehicles—began to move out toward the landing zone."}, {"tag": "p", "text": "The local Imperial forces had placed six All Terrain Scout Transports in the canyons between the supply base and the landing zone, in addition to static turbolaser defenses mounted on both the ridges and on the canyon floor. Six TIE bombers were also deployed to destroy the convoy. Rogue Squadron was forced to deal with each threat to ensure the safety of the convoy, employing both lasers and proton torpedoes. Successfully eliminating the immediate threat, Skywalker and the Rogues also engaged a small Imperial base not far from the landing zone. Although defended by two AT-STs, a turbolaser mounted on a tall turret, and six stormtroopers, the base was destroyed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With enemy forces in the region cleared, an Alliance Lambda-class T-4a shuttle, using Imperial identification so as not to attract suspicion, landed on the planet and effected the cargo transfer with the convoy from the Barkhesh Resistance. The cargo provided by the Barkhesh rebels would assist the Alliance in replenishing the supplies lost during the evacuation of Yavin Base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rendezvous on Barkhesh was a minor skirmish featured in the second level—also entitled Rendezvous on Barkhesh—of Star Wars: Rogue Squadron, a video game for both the Nintendo 64 and the PC, released in 1998. The player takes on the role of Luke Skywalker during the mission. To get a gold medal on the level—the highest ranking a player can achieve in a mission—one must ensure that all friendly units are kept safe, and that at least thirty enemies are destroyed. To achieve this, the player must destroy the Imperial units located at the small base away from the battle zone. The mission can be completed without destroying all Imperial forces, and with friendly casualties, although the mission score will suffer as a result."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}