{"url": "Replacements", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:The Bad Batch episodes"], "nodes": [{"tag": "h1", "text": "Replacements"}, {"tag": "p", "text": "\"Replacements\" is the third episode of the animated web-TV series Star Wars: The Bad Batch. The episode was released on May 14, 2021."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Batch get stuck on a desolate moon."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Chow time"}, {"tag": "p", "text": "The Havoc Marauder streaks through hyperspace. On board, Omega reads a datapad while lying against Gonky. Hunter enters the hold, and remarks that it doesn't look comfortable for either of them, but Omega assures him they are fine, and Hunter says \"Chow time\" and hands her a ration bar. Wrecker slides down a ladder, exclaims \"About time\", and devours his bar instantly. He asks for another, but Hunter says rations are low. Omega offers Wrecker her bar, and as he reaches for it, Hunter reproaches him, saying she doesn't even have somewhere to sleep. Wrecker understands, and tells Omega to keep it, which she happily does."}, {"tag": "p", "text": "The lights flicker for a moment, and Hunter yells to Echo that he thought he had fixed them. Echo tells him to add it to the list, explaining to Tech that the ship got hit hard when they left Saleucami, and that systems have been glitching since then. Echo points out to Tech that repairs would be quicker with his help, but Tech insists his priority is to build a scanner to test the functionality of their inhibitor chips and determine why they failed. As Tech says no critical systems were compromised, the ship shudders and drops out of hyperspace above a moon. Echo reports that the power capacitor has blown, and they need to land immediately."}, {"tag": "h3", "text": "Crash landing"}, {"tag": "p", "text": "Wrecker straps Omega into a seat, telling her to prepare for her first crash landing. With an alert blaring, the ship enters the atmosphere of the nearby moon and slides to a rough landing on the crater-strewn landscape. Echo reports that the storm is disrupting their comms, and is getting worse. Tech determines that one of the ship's capacitors was damaged in the skirmish on Saleucami, and will need to be replaced before they can take off. The inventory shows they have one spare, and Omega pulls down a case asking if this is it. The team looks at the case sadly, and Hunter tells her that is Crosshair's weapons kit. Wrecker sighs, and admits he misses Crosshair, but is reminded by Echo that Crosshair shot him. Tech suggests that Crosshair's betrayal could be due to his inhibitor chip, but Hunter tells them the debate won't fix the ship."}, {"tag": "h3", "text": "Special forces"}, {"tag": "p", "text": "On Kamino, CT-9904 undergoes a medical scan, and AZI-3 informs him his vitals are at optimum levels. Governor Tarkin and Nala Se watch through an observation window. Nala Se notes that Crosshair is responding well to the procedure, and Tarkin replies he hopes it stays that way. Vice Admiral Rampart enters the room, and Tarkin congratulates him on his chain code initiative on Saleucami. Tarkin asks about the progress of Project War-Mantle, and Rampart confirms the new recruits are ready to begin training under their new commander."}, {"tag": "p", "text": "En route to the landing bay, Rampart tells Tarkin his vision of a large enlisted army for the Empire. Nala Se assures them that Kamino can provide enough clones for such a force, but Rampart insists that a combination of recruits trained by clones is the optimum strategy, one that Tarkin seems to support. In the landing bay, Rampart introduces Tarkin to the Empire's first Elite Squad."}, {"tag": "h3", "text": "Enter the dragon"}, {"tag": "p", "text": "Echo and Tech leave the ship to replace the capacitor. As Tech gets to work, Echo investigates a snarling sound, and finds deep scratches gouged into the hull. Back on board, Echo reports his findings to the others, and Tech confirms that other systems are failing. Outside, a creature crawls across the hull and pulls out the capacitor, plunging the cabin into darkness. Omega sees the creature as it runs across the viewport, holding the capacitor. Tech identifies the creature as an Ordo Moon Dragon, a species which feeds on pure energy, which would have stolen the part to feed on the massive charge it holds."}, {"tag": "p", "text": "Hunter orders Tech and Echo to get the other systems online, while he retrieves the capacitor. He also tells Wrecker, who was injured in the crash, to stay behind. Omega offers to go with Hunter, but he refuses, saying it could be dangerous. She asks if she is part of the squad and he relents, telling her to stay close as they don breath masks and disembark."}, {"tag": "h3", "text": "The new recruits"}, {"tag": "p", "text": "The four Elite Squad Troopers undergo medical checks. One trooper, designated ES-01, bats away the medical droid, saying he didn't join the military to be poked and tested. Another trooper, ES-04, asks what they are fighting for now the war is over, and ES-01 replies that food and a roof over his head is more than the Republic ever did for him."}, {"tag": "p", "text": "Tarkin, Rampart and Prime Minister Lama Su watch the squad over a hologram. Lama Su says that enlisted recruits can never match the effectiveness of the clones, but Rampart disagrees, replying that skills can be taught, and that the loyalty of those who willingly enlist is where the value lies. Tarkin calls for a tangible test of Rampart's claims of ability and loyalty—he orders the Elite Squad to be deployed to Onderon, to locate and wipe out Saw Gerrera's camp and to succeed where Clone Force 99 failed. Lama Su leaves the room, a look of deep concern on his face."}, {"tag": "h3", "text": "Tracking the dragon"}, {"tag": "p", "text": "Hunter and Omega make their way across the moon's surface. Hunter kneels down and examines some dust, and Omega asks what he is doing. Hunter replies he is tracking, and Omega asks if she can learn to track like him. Hunter tells her his ability is an enhanced skill, and that Wrecker and Tech each have a skill too. Omega adds \"And Crosshair.\" Hunter scowls, and Omega tells him they shouldn't be angry with him as he can't help it. Hunter says and says he is angry with himself, for leaving one of his team behind, and Omega says they will find a way to get him back."}, {"tag": "h3", "text": "A test of loyalty"}, {"tag": "p", "text": "The Elite Squad under the command of CT-9904 proceeds to Onderon in their Nu-class Shuttle. Onboard, much to Crosshair's annoyance, ES-01 questions his leadership and the efficiency of the clones, insinuating that the Empire's scouting of human recruits meant that Crosshair may soon be replaced. Once onsite, Gerrera's team are quickly overwhelmed by the elite squad troopers. As the shuttle takes off, the pilot is shot by a sniper and the shuttle drops to the ground."}, {"tag": "p", "text": "The squad approaches the survivors, and Crosshair asks the remaining soldier where Gerrera is. She begins to say she would never tell him, but Crosshair kills her mid-sentence. He then approaches the cowering refugees, asking if they have any information they would like to share. One of the refugees says they don't know anything, and they were just promised passage off-world. Crosshair raises his weapon, saying they are of no use to the Empire. ES-01 intervenes, saying that Gerrera's fighters are dead and they should bring the civilians in. Crosshair says they weren't the orders they were given, and ES-01 replies that those orders were wrong and the squad won't obey them as they are soldiers, not an execution squad. ES-01 refuses Crosshair's last offer to comply with the orders and tells the rest of the team to ignore the clone, and take the prisoners in for questioning. Crosshair asks if ES-01 knows why they put him in charge—because he is willing to do what needs to be done. He executes ES-01 for insubordination with a single shot to the chest, saying \"Good soldiers follow orders\", and orders the rest of the squad to execute the civilians."}, {"tag": "h3", "text": "Dragon's den"}, {"tag": "p", "text": "Hunter and Omega locate the capacitor, and as Hunter goes to retrieve it, the Ordo dragon knocks him over and runs away with the part again. Hunter turns, gasping for breath as his breath mask has been knocked off. Omega finds the mask and puts it back on, but Hunter is already unconscious. She tries to call for help, but the storm is disrupting the signal. Omega watches as the dragon climbs into a burrow. Taking a deep breath, she grabs Hunter's blaster pistol and flashlight, and slides down the burrow into a tunnel."}, {"tag": "p", "text": "Making her way through the tunnel, Omega finds the dragon's nest and the capacitor. Remarking on her luck, she retrieves the part and turns to find the dragon behind her. The creature roars, and a terrified Omega holds up Hunter's blaster."}, {"tag": "p", "text": "On the surface, Hunter revives and looks around for Omega, calling her name. In the burrow, Omega hears Hunter's calls. As she turns off the flashlight, the dragon calms down and stops roaring. Omega realizes it wants the energy from the flashlight and throws it to the other side of the cave. The creature eagerly jumps after it, biting and absorbing its charge. Omega grabs the capacitor and crawls out of the cave. Climbing out of the burrow, Omega hands Hunter the part, saying she tracked the dragon and completed the mission without even having to use his blaster."}, {"tag": "h3", "text": "The project"}, {"tag": "p", "text": "The Elite Squad arrives back on Kamino, with Tarkin noting it is one soldier down. Crosshair reports that Gerrera has moved on, but the rest of his camp was dealt with. Tarkin is impressed that Crosshair had carried out the mission when his clone brethren had not. He tells Rampart that the clone program is an expensive relic of the past, but that it will continue to have its place until the time is right. Rampart agrees, and Tarkin leaves the project in his hands, promoting him to admiral."}, {"tag": "p", "text": "Elsewhere in the city, Lama Su and Nala Se discuss Rampart's conscription program. Lama Su worries that conscription will make the clone program obsolete, and they must ensure that it stays essential. Nala Se warns that the genetic material from Jango Fett continues to degrade, and Lama Su replies that they must move to the next phase — the development of a superior clone which will secure Kamino's relationship with the Empire. Nala Se says they will need a new genetic source, and that the clones they need will not return willingly. Lama Su replies they are Kaminoan property, and they only need one."}, {"tag": "p", "text": "Crosshair and his squad return to their barracks, formerly the quarters of Clone Force 99. Crosshair looks at Wrecker's tally marks on the wall, then sits on his bunk, deep in thought."}, {"tag": "h3", "text": "A nice surprise"}, {"tag": "p", "text": "With their ship repaired, the Bad Batch take off from the moon. Wrecker tells Omega to close her eyes and follow him. He reveals that he has refurbished the ship's gunport into a room for Omega, and even given her his beloved tooka doll, Lula. Omega is very grateful, telling them she has never had her own room before, and Hunter tells her she is part of the squad."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}