{"url": "Republic_Commando:_Hard_Contact", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Republic Commando novels"], "nodes": [{"tag": "h1", "text": "Republic Commando: Hard Contact"}, {"tag": "p", "text": "Republic Commando: Hard Contact is a 293-page tie-in novel to the video game Star Wars: Republic Commando and the first novel in the Republic Commando series. The book, written by Karen Traviss and published by Del Rey on October 26, 2004, is set in 22 BBY during the Rise of the Empire era. It tells the story of a squad of clone commandos on a mission to destroy a Separatist bioweapons lab on the world of Qiilura. The commandos (Niner, Fi, Atin, and Darman) are aided by the Gurlanins Jinart and Valaqil, along with an inexperienced Padawan named Etain Tur-Mukan."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "h3", "text": "Publisher's summary"}, {"tag": "p", "text": "As the Clone Wars rage, victory or defeat lies in the hands of elite squads that take on the toughest assignments in the galaxy—stone-cold soldiers who go where no one else would, to do what no one else could…."}, {"tag": "p", "text": "On a mission to sabotage a nanovirus research facility on a Separatist-held planet, four clone troopers operate under the very noses of their enemies. The commandos are outnumbered and outgunned, deep behind enemy lines with no backup—and working with strangers instead of trusted teammates. Matters don't improve when Darman, the squad's demolitions expert, gets cut off from the others during planetfall. Even Darman's apparent good luck in meeting a Jedi Padawan vanishes once she admits to her woeful inexperience."}, {"tag": "p", "text": "For the isolated clone commandos and stranded Jedi, a long, dangerous journey lies ahead, through hostile territory brimming with Trandoshan slavers, Separatists, and suspicious natives. A single misstep could mean discovery … and death. It's a virtual suicide mission for anyone—anyone except Republic Commandos."}, {"tag": "h3", "text": "Plot summary"}, {"tag": "p", "text": "Four clone commandos; Niner, Darman, Fi and Atin; are united for the first time to form Omega Squad after the rest of their old squads were killed early in the Clone Wars. Meanwhile on Qiilura, Jedi Padawan Etain Tur-Mukan hides from the local warlord Ghez Hokan's militia after her master Kast Fulier was killed."}, {"tag": "p", "text": "Omega learns their mission is to destroy a clone-killing nanovirus being developed by the Separatists on Qiilura and abduct the project's head scientist, Ovolot Qail Uthan. Darman is injured and separated from the squad on insertion after attempting to salvage extra equipment from the crashing vehicle, and slowly moves toward the rendezvous point, killing several of Hokan's men on the way. Re-grouping is hindered as the ruling Neimoidians control all the planet's communications, leaving Omega only a 10-meter comm-range. Concerned by the Republic infiltration, Dr. Uthan commissions Hokan as a Separatist officer and reinforces the area with 100 battle droids and extra officers including the very adept Lieutenant Hurati."}, {"tag": "p", "text": "With the assistance of two Gurlanins named Jinart and Valaqil, Darman meets up with Etain and the two move on to a safehouse. After being sold out by the locals, they move on to rendezvous with the rest of Omega. Darman teaches Etain much about combat and leadership and the two begin to develop a bond. The rest of Omega Squad steal a large quantity of charges from a nearby gem mine and Niner commandeers an excavation droid to transport the charges to the ground station supporting the Neimoidians' communications and destroy it. While taking the explosives Omega also captures a Weequay named Guta-Nay who used to work for Hokan and they learn much about the facility. Free to communicate, Omega Squad, Etain and Jinart meet and prepare their attack on the facility."}, {"tag": "p", "text": "Jinart places a detonator in the cellar of Lik Ankkit's mansion where most of the droids are garrisoned, leaving the nanovirus facility with little defense. The squad moves to the facility, where Niner, Fi and Etain set up an E-Web heavy repeating blaster for covering fire. Jinart helps Darman and Atin infiltrate the heavily armored facility through the surrounding gdan burrows. The two commandos blow their way into the facility initiating a lockdown and trapping Hokan and his officers, place implosion devices to destroy the virus and capture Uthan, leaving through the burrows. Hurati manages to override the lockdown and he escapes with Hokan. As Darman, Atin and Etain head towards the LAAT/i for extraction, Hurati shoots Atin with a Verpine shatter gun seriously wounding him and Uthan, but Darman kills Hurati by shooting him in the head. Niner and Fi meet Hokan, and Niner lures him by pretending to be injured. Etain sees Hokan and kills him while searching for the two commandos by decapitating him with her lightsaber; and with that, she collects her dead master's lightsaber from Hokan's headless corpse, who happened to have the lightsaber. Unfortunately, Etain realized that she is getting attached to the Omega squad, because she never wanted to hear their screams again. Omega Squad are extracted, and Etain decides to stay on Qiilura with Master Arligan Zey, primarily to prevent the attachment she is developing toward Darman."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "There are several inconsistencies between Hard Contact and later novels. Dha Werda Verda is mistranslated as \"the warrior's shadow\". ACP array guns are incorrectly referred to as \"APC array guns/blasters\". Also, Darman is said to pull out his sidearm, but Jinart notes that it is a DC-17. Since all later novels state that the commandos' sidearms are DC-15s, it is assumed this is an error, and either Darman had a DC-15, or the term \"sidearm\" was misused.[source?]"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "Foreign"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}