{"url": "BARC_speeder/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic repulsorcraft", "Category:Aratech Repulsor Company products", "Category:Galactic Empire vehicles", "Category:Galactic Republic repulsorcraft", "Category:Speeder bikes"], "nodes": [{"tag": "h1", "text": "BARC speeder"}, {"tag": "p", "text": "The Biker Advanced Recon Commando (BARC) speeder was a powerful speeder bike model used by the Grand Army of the Republic as a reconnaissance craft during the Clone Wars. It was manufactured by Aratech Repulsor Company. A civilian variant, Police BARC speeder also saw extensive use on Coruscant."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Younger than the 74-Z speeder bike employed at the Second Battle of Dorin, it was actually more closely designed after the Ripper manufactured by Aratech's competitor, Mobquet."}, {"tag": "p", "text": "Originally designed for exclusive use by the Advanced Recon Commandos, the vehicle proved so effective that it came to be used by the rest of the army. These speeders were painted in the red-and-white colors of the Galactic Republic."}, {"tag": "p", "text": "They were powered by repulsors and a turbine engine mounted on the frontal prong. The speeder was controlled via twin steering vanes atop the bike, and pedals fitted below. Two blaster cannons protruded from the bottom of the forward prong, while two more were fixed on either side of the vehicle's rear."}, {"tag": "p", "text": "The speeders were capable of flying at high altitudes and were sometimes used as escorts for LAAT/i gunships carrying important passengers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around the second year of the Clone Wars, a variant of the BARC speeder was used by Coruscant police droids. The only apparent differences from its military counterpart was that it had a dark blue/gray paint job and had flashing red and blue lights near the aft thrusters and stern thruster. Jedi Master Tera Sinube and Jedi Padawan Ahsoka Tano rode a police droid's BARC speeder to a train station to catch Ione Marcy and Cassie Cryar, following the signal of a homing beacon placed on Marcy's back by Sinube. Another time when police droids rode these was when it appeared that Satine Kryze had murdered Davu Golec, and these were used to follow a civilian airspeeder, which the clone shock troopers thought she was escaping in."}, {"tag": "p", "text": "Jedi Master Shaak Ti once flew a BARC speeder during the initial stages of the Battle of Coruscant, using it to transport her and Stass Allie to the Supreme Chancellor's residence to see Palpatine to safety. In the aftermath of the Siege of Saleucami, Commander Neyo and his wingman, astride BARC speeders, executed Order 66 by firing the bike's blaster cannons on Jedi Knight Stass Allie's speeder, killing her."}, {"tag": "p", "text": "During a mission to capture Shu Mai, Presidente of the Commerce Guild on Felucia, Aayla Secura and Clone Commander Bly were assisted in the assault on the Presidente's headquarters by a squad of 327th Star Corps troopers riding BARC speeders. Aided by ARC-170 starfighters, these elite biker troops defeated Vulture droids during the battle."}, {"tag": "p", "text": "Troops under the command of Jedi Generals Yoda, Luminara Unduli, and Quinlan Vos later rode their speeders into combat on Kashyyyk, moving alongside Infantry Support Platforms and HAVw A6 Juggernauts."}, {"tag": "p", "text": "Following the war, BARC speeders continued to be used by the early Galactic Empire, although they were seemingly phased out afterward, and replaced with the older 74-Zs for military use."}, {"tag": "p", "text": "On Kashyyyk, many speeders were left behind, following the formation of the Empire, and were used during the Galactic Civil War by native Wookiees and visiting pilots. Some others, also obtained from Kashyyyk, came into the hands of some spacers for personal use. During the Galactic Civil War, BARC speeders were also utilized by various groups, although they often required a deed as proof of ownership. Several of these BARC speeders were also given custom paint jobs. Besides civilian use, the BARC speeders also had two variants, one for Galactic Empire personnel use, and another for Rebel Alliance personnel usage. Regardless of the faction, both require their members to be Colonel-class before purchasing one."}, {"tag": "h2", "text": "Variants"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The BARC design was developed using the precedent of the Imperial speeder bikes in Star Wars: Episode VI Return of the Jedi. Though they are showcased on Saleucami, they can also be seen on Coruscant and were designed for use in the forests of Kashyyyk. Initially, Stass Allie was to be riding a BARC speeder, but to provide a greater link to the original trilogy, a more recognizable 74-Z speeder bike was used instead."}, {"tag": "p", "text": "Five BARC speeders have been released by LEGO, one in 2005, two in 2011, one in 2013, and one in early 2014. The first one was featured in the Clone Turbo Tank. The second and variant comes in two other sets (Clone Trooper Battle Pack and Battle for Geonosis). The fourth variant is featured in a set with a Confederate speeder, with the sidecar attached. And the fifth variant is featured with the set Battle on Saleucami, which has a new spring-loaded firing mechanism."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}