{"url": "Republic_Commando:_True_Colors", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Republic Commando novels"], "nodes": [{"tag": "h1", "text": "Republic Commando: True Colors"}, {"tag": "p", "text": "Republic Commando: True Colors is the third novel in the Republic Commando series written by Karen Traviss and set nearly two years after the First Battle of Geonosis. It was released on October 30, 2007. It includes the short story Odds and an excerpt of Michael Reaves and Steve Perry's novel Death Star."}, {"tag": "p", "text": "Cover art by Greg Knight is based on one of his concept drawings for the video game Star Wars: Republic Commando."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "As the savage Clone Wars rage unchecked, the Republic's deadliest warriors face the grim truth that the Separatists aren't their only enemy—or even their worst."}, {"tag": "p", "text": "In the Grand Army's desperate fight to crush the Separatists, the secret special ops missions of its elite clone warriors have never been more critical…or more dangerous. A growing menace threatens Republic victory, and the members of Omega Squad make a shocking discovery that shakes their loyalty."}, {"tag": "p", "text": "As the lines continue to blur between friend and enemy, citizens—from civilians and sergeants to Jedi and generals—find themselves up against a new foe: the doubt in their own hearts and minds. The truth is a fragile, shifting illusion—and only the approaching inferno will reveal both sides in their true colors."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Delta Squad and Sergeant Walon Vau, now a civilian, begin this story on the harshly cold and barren planet of Mygeeto. Vau has come to \"liberate\" some funds from the bank vaults under the glaciers of Mygeeto, taking over 55 million in credits and other valuables from his family vault. However, their exit does not go as smoothly as planned, leaving Vau trapped and alone under several tons of ice, slowly freezing to death, while Delta Squad is forced to leave without him."}, {"tag": "p", "text": "Meanwhile, Omega Squad, including Darman, is shipped out to Gaftikar, a Separatist held planet, to assist the Null ARC A'den in training the local rebels, a lizard-humanoid species in overthrowing the human-Separatist government. Skirata haggles with a Rodian over a submersible-flight capable craft, one with which he hopes to find Ko Sai, the lead rogue Kaminoan geneticist. Ko Sai, it is revealed, had defected from the Republic to the Separatists, eventually double crossing them as well, \"Doing a runner with the creds\" as put by Skirata. Delta brings news to him of Vau's fate, MIA and most likely dead, under several tons of ice and snow. Skirata, along with the Null ARC Ordo, travels to Mygeeto and begins his long search for Vau. In a deep snow drift, they find Mird, Vau's loyal strill, hopelessly clawing its way down to where it had last seen its master. Skirata takes the submersible craft (named Aay'han, which means a time where Mandos remember the dead while being with living loved ones) and plows it deep into the glacier. After hours of scraping and blasting away at the ice with lasers, they finally find Vau's body, frozen, but still alive, and manage to thaw him without incident. Skirata, angered but at the same time rejoicing that Vau still lives, is shocked when Vau produces the priceless treasures he had stolen from his family's vaults, and gives it all to Skirata for the \"Clone Retirement Fund.\""}, {"tag": "p", "text": "While this is happening, Darman and Atin infiltrate a city on Gaftikar disguised as civilians. While there, they are shocked to find Sull, an ARC trooper that had been Missing In Action on the planet for weeks, assumed to be dead. He is alive and well, and had become a citizen, leaving the army behind him. The duo catch him off guard, and haul him back to base unwillingly, as he struggles to escape. Back at base, they learn from Sull's interrogation that the ARC had discovered the truth behind Supreme Chancellor Palpatine's plan - or at least the vague gist of it. Sull, unwilling to be a pawn any longer in a war with no conceivable end, had decided to go AWOL and live out the rest of his short life peacefully. Sull agrees to leave Gaftikar after providing A'den and Omega with information about the Gaftikari capital city and the location of Sull's discarded armor, which Darman retrieves. After Sull departs the planet, Darman returns to Sull's home to look for any evidence that the ARC had been there, when two Clone Covert Ops Troopers rush in, believing him to be Sull. Darman manages to kill them both, but is shocked and wonders why clones would be sent to kill clones."}, {"tag": "p", "text": "During the assault on the capital city of Gaftikar, Fi suffers a traumatic head injury and is virtually brain-dead. He is shipped to a medical facility on Coruscant but they are unable to revive him from his coma. Besany Wennen discovers that any clone trooper who requires too much effort or supplies to be saved is simply allowed to die. Only troops who can be made fit to fight again receive medical care. Since Fi is too far gone to be saved, he is scheduled to be terminated, but Besany Wennen and Captain Jaller Obrim of Coruscant Security Force kidnap him from the medcenter just in time. They take him to Obrim's home, where Bardan Jusik uses the Force to heal the tissue in Fi's brain and he lives. Even so, the healing is not complete, and Fi is nowhere near his old self."}, {"tag": "p", "text": "On Qiilura, Etain Tur-Mukan is tasked with \"evacuating,\" by force if necessary, the human farmers who acted as a resistance movement against the Separatists. The Republic promised the planet to the native Gurlanins, who want all humans gone forever. However, the farmers do not go quietly. Etain begins to hemorrhage after one of the fights and fears she is miscarrying her baby. Skirata sends Ordo with a medical droid to take care of her. After her recovery, Ordo takes her with him to Dorumaa, where Skirata, Mereel, and Vau have been successful in capturing Ko Sai. Skirata takes the whole group to Mandalore and imprisons Ko Sai in his home. He wants to find out how to stop the accelerated aging in the clone troopers so that his \"boys\" can have a normal lifespan. However, Mereel and Vau are unable to get any information out of her until Etain offers Ko Sai a sample of her tissue and some tissue from the umbilical cord when her son is born. Eager to play around with a Jedi genome, Ko Sai accepts and gives Etain some of the data needed to reverse the rapid aging. However, Ko Sai grows more and more dejected as time passes since she is no longer known as the best geneticist in the galaxy. This loss of her reputation leads her to eventually hang herself from a beam in Skirata's house, using Etain's umbilical cord after her son, Venku, is born."}, {"tag": "p", "text": "Etain's son, Venku, is born on Mandalore (Venku is derived from the Mando'a word for future). Skirata subtly asks Darman what he would name a boy if he had one, and Darman says he likes \"Kad.\" Skirata and Jusik decide to nickname the boy Kad'ika and agree to let him stay at Besany Wennen's apartment while Etain is in the field. Etain is torn apart that Darman is still unaware that he is the baby's father."}, {"tag": "p", "text": "Delta Squad present General Zey with Ko Sai's head, pretending they found it on Dorumaa to fool General Zey and the Chancellor as to her real fate and the information discovered through her."}, {"tag": "p", "text": "The book ends with a friendly limmie game between Niner, Atin, Corr, Ordo, Mereel, Skirata, and Vau."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}