{"url": "Republic_(MC80A_Home_One_Type_Heavy_Star_Cruiser)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Ship stubs", "Category:Alliance to Restore the Republic starships", "Category:Flagships", "Category:MC80 Home One type Star Cruisers"], "nodes": [{"tag": "h1", "text": "Republic (MC80A Home One Type Heavy Star Cruiser)"}, {"tag": "p", "text": "The Republic was an MC80A Home One Type Heavy Star Cruiser used by the Alliance to Restore the Republic during the Galactic Civil War following the mutiny on Mon Cala by General Jan Dodonna. After the conversion of Mon Calamari Star Cruisers was complete, the Republic served as the flagship of the Alliance Fleet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Republic was an MC80A Home One Type Heavy Star Cruiser manufactured by Mon Calamari Shipyards. Like other Star Cruisers of the MC80A variant, the Republic was equipped with ten sublight engines, giving it speeds of 975 kilometers per hour. It was armed with thirty-six ion cannons, twenty-nine turbolaser batteries, and six tractor beam projectors. It was also equipped with a class one hyperdrive and a deflector shield generator. Like other MC80a cruisers, the Republic had a length of 1,300 meters, was crewed by over 5,000 personnel, and had a complement of ten starfighter squadrons, which included T-65B X-wing starfighters, which could launch from its hangar bays. The hangar bays also had windows and various monitor screens."}, {"tag": "p", "text": "The bridge of the Republic had multiple stations and screens, as well as a large window for observing the environment. Similar to other Mon Calamari Star Cruisers that were converted at the Mako-Ta Space Docks following the mutiny on Mon Cala, the Republic was refitted with Shu-Torun systems which could all be disabled with encyrpted codes, preventing critical systems from functioning. Such systems included the hangar doors, hyperdrive, communications, armament, and engines."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Republic was equipped for combat operations and served as the flagship of General Jan Dodonna, as well as the flagship of the Alliance Fleet."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Flagship of the Alliance"}, {"tag": "p", "text": "After the mutiny on Mon Cala and the completion of its combat conversion, the Republic and other vessels of the Alliance Fleet were to disperse from each other so that they could attack crucial targets, and not a direct confrontation. The Republic was designated to General Jan Dodonna and his flagship, as well as the flagship of the Alliance Fleet. The Republic was present at the Mako-Ta Space Docks during a ceremony celebrating the new Alliance Fleet and to witness the dispersal of the rebel naval forces. During the ceremony, Dodonna was in one of the hangar bays where he spoke to Luke Skywalker and Wedge Antilles, after hearing Skywalker's excitement. Dodonna reminded Skywalker and Antilles that the rebel fleet would not be able to directly confront the Empire, but they now had the resources to engage crucial targets. After Skywalker relayed his understanding and that he was just excited, Dodonna comforted him by saying that he was not alone in that sentiment. Dodonna was soon called to the bridge of the starship, and informed an individual to update Leia Organa on Mako-Ta that the Republic would be ready when the rest of the fleet was."}, {"tag": "p", "text": "After the subgroups checked in with Organa that they were ready, Dodonna gave the order to launch into hyperspace. An error, however, prevented the launch of the Republic along with the rest of the Alliance Fleet. The fault resulted in the failure of all launches, downed communications, inoperative engines, and the ships being unable to launch their starfighters. At the same time, Death Squadron, under the command of Darth Vader, arrived and fired on the nearest cruiser, General Vanden Willard's cruiser."}, {"tag": "h3", "text": "Attack on Mako-Ta"}, {"tag": "h4", "text": "Initial onslaught"}, {"tag": "p", "text": "After Willard's cruiser was destroyed, Death Squadron began engaging other vessels that were gathered near the Mako-Ta Space Docks, including the Republic. Although many systems were down, the starship's shield generator was still active. As nearby cruisers were attacked and destroyed, Meorti and Dodonna attempted various ways to unseal the hangar doors, but all failed. Eventually, Han Solo, Chewbacca, and C-3PO arrived onboard the Millennium Falcon and were engaged by Imperial forces, which Skywalker and Antilles witnessed from a hangar bay window. After destroying several pursuing TIE fighters, the Millennium Falcon attempted to land on the Republic, but was damaged by Vader in his TIE Advanced x1 and forced to abort."}, {"tag": "p", "text": "During the dogfight between the Millennium Falcon and Vader, Solo attempted another landing, although Vader fired missiles and Solo was forced to go near the Republic's hull, which successfully destroyed the missiles as they impacted the hull of the cruiser. After Commander Lajaie's cruiser was destroyed and exploded into a fireball, Solo piloted the Falcon through the explosion and debris in an effort to lose Vader, which was not entirely successful as Vader followed but had become more distant. Chewbacca then loaded C-3PO into an escape pod and launched him towards the Republic. The escape pod crashed unto the hull of the cruiser, and C-3PO was able to find an airlock near the hangar, where he was pulled in by Skywalker and R2-D2. There, C-3PO told them that the hangar doors will open when flown nearby with rebel signals, as the fail-safe was operational despite the system breakdown."}, {"tag": "p", "text": "With the new intelligence, Skywalker ordered all other pilots to board their X-wing starfighters and fly at the hangar doors. Although General Dodonna initially commanded Skywalker to stand down and that they needed to run tests, Skywalker relayed that he would be the test. Dodonna gave a final stand down order, but Skywalker continued and was successful, as the hangar doors opened right before he flew through them. Upon witnessing this, Meorti told the other pilots to launch immediately. With the others launching, Skywalker reminisced about Jyn Erso and Rogue One, and decided to name the assortment of pilots Rogue Squadron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Republic first appeared in Star Wars 50 but was first identified in Star Wars 55. In one panel in Star Wars 54, the Republic is depicted as a different model of starship, which was inconsistent with the panels directly before and after the erroneous one."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}