{"url": "BALK1", "categories": ["Category:Canon articles", "Category:Droids of the Galactic Empire", "Category:New Republic droids", "Category:Viper probe droids"], "nodes": [{"tag": "h1", "text": "BALK1"}, {"tag": "p", "text": "BALK1 was the designation of an Imperial Viper probe droid that was captured by the New Republic and repurposed for their use. After the New Republic became suspicious of Imperial activity on the planet Akiva, the probe droid was sent to gather data. It discovered that two Republic A-wings previously sent to the system had been destroyed and that communications were blacked out on the planet itself, but could not confirm Imperial presence. This was not enough to prompt a full attack on the system by the New Republic, but a message sent by the captive pilot Wedge Antilles later confirmed the presence of the Empire, who were then chased from the system by a New Republic fleet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Viper probe droid designated BALK1 was created by the droid manufacturing company Arakyd Industries and initially served the Galactic Empire, before being stolen by the New Republic and subverted for their own use. Several months after the Battle of Endor, the New Republic received intel from an Imperial informant known to them only as the Operator which claimed that a number of high ranking Imperials were meeting at a secret summit on the planet Akiva. Not immediately trusting the intel, Fleet Admiral Gial Ackbar sent two A-Wing starfighters to Akiva, as the planet was already on a list of locations that the Republic planned to search for the pilot Wedge Antilles, who had gone missing while scouting in the area."}, {"tag": "p", "text": "When the two fighters did not report back or return from Akiva, Ackbar ordered that BALK1 be sent to investigate what had become of them. The droid was transported in the Carrack-class light cruiser Oculus to the remains of the comet Kinro, where it was launched from the ship by Ensign Deltura and science officer Niriian. Upon leaving the ship, BALK1 immediately began transmitting atmospheric data back to the Oculus whilst heading toward Akiva, which was visible from the Oculus. After six hours of traveling the probe droid reached its destination and began scanning the Akiva system. It found no Imperial ships in the system, but was able to identify molecular remnants that confirmed confirm that the two A-wings had been destroyed there. Upon learning this Ackbar ordered Deltura to have the droid ping Akiva's comm relay, but BALK1 was unable to make contact with any relay due to an Imperial communications blackout on the planet below. The news worried Ackbar, but was not enough to prompt immediate action at Akiva. Antilles, who was alive and being held prisoner on Akiva, later managed to send a message to the New Republic confirming the Imperial presence on Akiva. A New Republic fleet traveled to the system and successfully defeated the Imperials there, forcing the surviving Imperials to flee the system."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "As a Viper probe droid, BALK1 possessed five spider-like limbs attached to a body with a dome like head and a set of retrothrusters which it could use to maneuver itself in space. When the droid was moving within space it retracted them into its body and only extended them when stabilised. A set of antenna located in the droids head could also be extended while it was stable, and were designed to take measurements. The droid was capable of scanning a star system to a molecular level and identifying molecular components with enough detail to establish the make of a destroyed vessel they originated from. Dentura and Niriian controlled the droid remotely from a Carrack-class cruiser located in the same star system, and received data and encrypted communications from the droid which sounded like a strange song when played aloud."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BALK1 first appeared in the novel Aftermath, which was written by Chuck Wendig and released in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}