{"url": "Republic_82", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Republic"], "nodes": [{"tag": "h1", "text": "Republic 82"}, {"tag": "p", "text": "Republic 82 is the eighty-second, penultimate issue of the Star Wars Legends comic book series Star Wars: Republic. It was written by John Ostrander, illustrated by Jan Duursema, and first published on January 11, 2006 by Dark Horse Comics. The issue features the story \"Hidden Enemy Part Two,\" in which Quinlan Vos faces the Great Jedi Purge during the Battle of Kashyyyk."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A battle rages on the Wookiee homeworld of Kashyyyk. Victory is in sight for the clone armies of the Republic, led by Jedi Masters Yoda, Luminara Unduli, and Quinlan Vos, but none of them are aware that victory will lead to a betrayal that will change the galaxy forever. There is one chance to survive, and one course remaining to any who survive …"}, {"tag": "p", "text": "The fate of the Jedi Order is sealed, but a single Jedi may find a path to the future … or to the grave."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Republic 82 was first published by Dark Horse Comics on January 11, 2006. In February 2008, the issue was reprinted for Hasbro's Star Wars Comic Pack 41, which included action figures of Quinlan Vos and Commander Faie."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "According to editor Randy Stradley, Republic 82 was originally planned to depict Quinlan Vos's death during the Great Jedi Purge, adapting the character's scripted death in Star Wars: Episode III Revenge of the Sith. However, when that scene was cut from the film, it was decided that Vos would only be wounded in the comic."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}