{"url": "Republic-class_Star_Destroyer", "categories": ["Category:Legends articles", "Category:New Class starship classes", "Category:New Republic starship classes", "Category:Rendili Vehicle Corporation products", "Category:Star Destroyer classes"], "nodes": [{"tag": "h1", "text": "Republic-class Star Destroyer"}, {"tag": "p", "text": "The Republic-class Star Destroyer was Walex Blissex's follow-up design to his Victory-class Star Destroyer."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Republic-class Star Destroyer was manufactured by Rendili StarDrive for the New Republic. It was advertised as a Rendili design owing to its architect, the former Rendili designer Walex Blissex. However, this was more of a political move designed to draw Rendili away from the Galactic Empire, and the ship's bulbous, organic-like shape spoke of significant influence from the Mon Calamari Shipyards. The Republic-class was smaller than the Imperial-class Star Destroyer, designed by Blissex's daughter Lira, but was a much more efficient design."}, {"tag": "p", "text": "Although the Republic-class was only half the cost of an Imperial-class and required one-fifth the crew size, it boasted 20 percent more firepower than an Imperial I-class vessel. However, it was still outmatched by the Imperial II-class Star Destroyer and the various Super Star Destroyers."}, {"tag": "p", "text": "Armament consisted of 40 heavy turbolaser batteries, 40 heavy turbolaser cannons, 20 ion cannons, and 10 tractor beam projectors. The Republic-class was also equipped with a Class 2 hyperdrive, the same as was found on the Imperial-class."}, {"tag": "p", "text": "The Republic-class was only 1,250 meters long, significantly smaller than the 1,600-meter-long Imperial-class. Because the smaller ship retained a similar level of weaponry, it had to sacrifice cargo space and endurance. The Republic-class held enough consumables to operate without resupply for 2 years, compared to 2 years for the Imperial I-class and 6 years for the Imperial II-class."}, {"tag": "p", "text": "Only a single regiment of 3,200 ground troops could be carried aboard, as well as a single full New Republic wing. Republic-class ships usually carried long-range starfighters, rather than short-range fighters such as Defender and K-wing starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Republic-class was one of the early warship models developed for the New Republic's standardization programs. Hampered by a resurgence in fighting due to the Thrawn campaign in 9 ABY and the return of Emperor Palpatine the following year, production on the Republic-class and other vessels was eventually restarted at a smaller level and the new ships were dispersed throughout the fleet."}, {"tag": "p", "text": "The Republic-class Star Destroyer was not incorporated into the New Class Modernization Program, which chose instead to develop its largest ships from Republic Engineering Corporation's Nebula-class Star Destroyer hull-design.\nDespite this, by the time of the Black Fleet Crisis, the New Republic had managed to build a considerable number of Republics."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first official image of the Republic-class Star Destroyer is found in Cracken's Threat Dossier. The ship has many round features, a striking deviation from standard Star Destroyer designs. A subsequent depiction in Invasion: Revelations 3 confirmed this design."}, {"tag": "p", "text": "In Part 12 of Jason Fry's endnotes for The Essential Guide to Warfare, Paul R. Urquhart considered mentioning in the book that the Republic-class Star Destroyer and the MC80B Star Cruiser were intended to be the same ship under different names, but it was ultimately cut from the final version."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}