{"url": "Reprisal_(Imperial_II-class)", "categories": ["Category:Legends articles", "Category:Imperial II-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Reprisal (Imperial II-class)"}, {"tag": "p", "text": "The Reprisal was an Imperial II-class Star Destroyer that served in the Imperial Navy during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around half a year after the Battle of Yavin, the ship was under the command of Captain Kendal Ozzel, as the center of the Imperial Navy presence in Shelsha sector, supported by a number of Dreadnaught Cruisers and smaller capital ships."}, {"tag": "p", "text": "Under Ozzel's command, the Reprisal took part in a punitive mission against Teardrop, and was subsequently assigned a tactical unit of the Imperial Security Bureau under Colonel Vak Somoril, to further prosecute the war against Rebel factions in the sector. Following incidents that attracted the attention of both Darth Vader and Mara Jade, it appears that Captain Ozzel was transferred to the Executor in Vader's fleet, although the Reprisal also appears to have come under Vader's authority at about this time."}, {"tag": "p", "text": "About eight months after the Battle of Yavin, the ship was under the command of Commander Demmings and Captain Sankaran, nominally assigned to a sector in the Outer Rim Territories, but under Darth Vader's direct authority during his attempts to locate the Rebel fleet and his son, Luke Skywalker. It may have been the command ship of the local Sector Group."}, {"tag": "p", "text": "The Reprisal was at Tiss'sharl for a meeting where Vader introduced Demmings to the leaders of the Tiss'sharl League as their new liaison, when reports arrived that placed Skywalker on Jabiim. The Reprisal quickly left Tiss'sharl, and led a fleet to complete the brutal pacification of the rebellious planet. The Star Destroyer subsequently remained at Jabiim to supervise final stages of this operation, in the course of which a supply shuttle was stolen by Tal Hesz."}, {"tag": "p", "text": "Still serving as Vader's command ship, the Reprisal next conducted strikes against Rebel targets, including a scout team and a CR90 corvette, with the aim of capturing prisoners who might reveal the Rebels' location—but instead, turbolaser fire from the Star Destroyer destroyed the targets completely, leading Vader to question the ship's reputation and almost to execute Demmings."}, {"tag": "p", "text": "However, after a third strike, against a surface target in the Ejolus system, Vader revealed that gunnery officer Lieutenant Garil Dox was a Rebel agent and a native of Alderaan, hoping to undermine Demmings' reputation for loyalty and competence by botching these missions."}, {"tag": "p", "text": "Vader revealed to Dox that the Ejolus colony had in fact been a settlement of pacifists from his homeworld. As the traitor was dragged away to the labor camps, Vader coldly remarked that his willingness to destroy innocent civilians in the hope of achieving his military goals suggested that he had possessed the potential to be a fine Imperial officer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}