{"url": "Reptilian_flier", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Carnivorous creatures", "Category:Creatures of Dathomir", "Category:Domesticated creatures", "Category:Reptavians", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Reptilian flier"}, {"tag": "p", "text": "Reptilian fliers (or flyers), also known as saurian fliers, and saurians, were a large species of carnivorous, winged reptavians native to the Outer Rim world of Dathomir. Beast masters were able to domesticate saurians as personal companions or mountable beasts of burden. They could also be killed and harvested for their leathery hides, bones and meat. Deadly and ferocious, a number of saurians attacked Quinlan Vos when, during 31 BBY, he embarked on a mission to Dathomir. Vos, after being freed from his ejector seat, used his lightsaber to defeat the aggressive beasts. During the time following the Battle of Yavin in 0 BBY, a Dathomirian witch named Rubina offered at least one spacer a decorative model of a reptilian flier as a gift."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The carnivorous species of reptavians known as reptilian fliers, but also as saurian fliers or saurians, were a type of large bird native to Dathomir, an obscure world in the Outer Rim Territories. Flocks of these dangerous creatures filled the skies, and roamed the forests and plains of the remote world. The reptilian, lizardlike vertebrates had leathery hides, the color of which typically included subdued palettes of grey, red or blue in the wild. However, when domesticated, their hides could come in a variety of different hues, including shades of orange and green. Distinguishing features of the bipedal creature included large, batlike wings, long tails, and horned heads featuring sharp teeth, and beady red eyes. Reptilian fliers attacked both aerial and ground targets with deadly speed and incredible ferocity. The four grasping claws on their feet allowed the winged creatures to grab their prey and tear them to pieces with their powerful jaws. Tougher victims were borne aloft by the creatures and dropped to their death, only to be subsequently consumed by the violent beasts, who left behind only a few larger bones and a spattering of remains. When vocalizing, they would emit a screech or cawing noise."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Reptilian fliers could be killed and harvested for their resources, including their leathery hide, bones and meat. A number of them attacked Quinlan Vos in 31 BBY when he first arrived on Dathomir in an ejector seat. The beasts tore him free of the seat's restraints, allowing him access to his lightsaber, which he used to defeat them. Reptilian fliers could also be domesticated by beast masters as personal companions or as a form of transport unto themselves as mountable beasts of burden."}, {"tag": "p", "text": "By the time following the Battle of Yavin in 0 BBY, a Dathomirian witch by the name of Rubina offered at least one spacer a decorative model of a reptilian flier for their success in eliminating mutant rancors and members of the rival Spider Clan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "These reptavian creatures first appeared in the 2000 Star Wars: Republic comic, Star Wars 23, however they were not specifically named. The species was first identified as reptilian fliers (or flyers), and included as creatures in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. In addition to the typical reptilian flier, the game included others types of named fliers, such as ancient reptilian fliers, enraged reptilian fliers, mature reptilian fliers, and young reptilian fliers, all of which could be found on Dathomir. While the game did not explicitly refer to the creatures as reptavians, it did refer to them as \"reptilian,\" and their resources (such as their bones and meat) were referred to as \"avian.\" Therefore, their distinction as reptavians can be inferred."}, {"tag": "p", "text": "The creature is also listed as a reptilian flier in several reference guides for Star Wars Galaxies, including the Star Wars Galaxies: An Empire Divided: Prima's Official Strategy Guide (2003), the Star Wars Galaxies: An Empire Divided Quick Reference Guide (2003), the Star Wars Galaxies: Jump to Lightspeed: Prima Official Game Guide (2004), the Star Wars Galaxies: The Total Experience: Prima Official Game Guide (2005), and the Star Wars Galaxies: The Complete Guide: Prima Official Game Guide (2005). However, The Official Star Wars Fact File 139 (2004) was the first to identify the creature with the slightly different name of saurian flier. The magazine also collated additional information on the overall behavior and characteristics of the creature."}, {"tag": "p", "text": "With the release of Star Wars Galaxies, reptilian fliers could be domesticated as pets by players who pursued the creature handler profession. Following the release of Publish 25's New Game Enhancements on November 15, 2005, creature handlers were removed. However, with the release of Chapter 6: Masters of the Wild on May 22, 2007, beast masters were added as an expertise path, allowing players to incubate domesticated creatures. With the release of Game Update 17 on June 24, 2010, reptilian fliers could be successfully trained as mounts. When the Witches of Dathomir theme park was revamped as part of Game Update 18.2 on November 4, 2010, and Game Update 19 on December 14, 2010, a non-player character named Rubina would offer players a Reptilian Flyer Model as a reward option for completing quests requiring the elimination of mutant rancors or members of the Spider Clan. The game's directory tree files include a description of the reptilian flier that is not definitively known to have appeared on the live servers. The description likens the flier to a \"big flying lizard\" which would swoop down from the mountains of Dathomir to carry off small children and other \"tasty snacks\" from the forest below."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}