{"url": "Republic_Commando:_Triple_Zero", "categories": ["Category:Real-world articles", "Category:Republic Commando novels"], "nodes": [{"tag": "h1", "text": "Republic Commando: Triple Zero"}, {"tag": "p", "text": "Republic Commando: Triple Zero is the second novel in the Republic Commando series written by Karen Traviss and set one year after the First Battle of Geonosis. It tells the story of Omega Squad, Delta Squad, a unit of Null ARC troopers, and their Jedi Generals Etain Tur-Mukan and Bardan Jusik as they pursue a Separatist terror group along the skylanes and underworld of Coruscant, known to clone troopers as Triple Zero for its galactic chart coordinates."}, {"tag": "p", "text": "The book contains a short glossary defining Star Wars, Mando'a, and military terms. The Del Rey printing also contains the short story Omega Squad: Targets, originally published in Star Wars Insider #81, and a preview of Legacy of the Force: Betrayal. The UK and Australian release printed under the Orbit imprint includes the Mando'a glossary, however does not include Omega Squad: Targets or the preview of Betrayal."}, {"tag": "h2", "text": "Editions"}, {"tag": "h3", "text": "American"}, {"tag": "h3", "text": "UK and Australia"}, {"tag": "h3", "text": "Foreign"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Following the eruption of the bloody Clone Wars at the battle of Geonosis, both sides remain deadlocked in a stalemate that can be broken only by elite warrior teams like Omega Squad, clone commandos with terrifying combat skills and a lethal arsenal…."}, {"tag": "p", "text": "For Omega Squad, deployed deep behind enemy lines, it's the same old special ops grind: sabotage, espionage, ambush, and assassination. But when Omega Squad is rushed to Coruscant, the war's most dangerous new hotspot, the commandos discover they're not the only ones penetrating the heart of the enemy."}, {"tag": "p", "text": "A surge in Separatist attacks has been traced to a network of Sep terror cells in the Republic's capital, masterminded by a mole in Command Headquarters. To identify and destroy a Separatist spy and terror network in a city full of civilians will require special talents and skills. Not even the leadership of Jedi generals, along with the assistance of Delta squad and a certain notorious ARC trooper, can even the odds against the Republic Commandos. And while success may not bring victory in the Clone Wars, failure means certain defeat."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel starts with a flashback eight years before the Battle of Geonosis when Mandalorian soldier Kal Skirata goes to the rainy planet of Kamino to observe the developing army for the Republic. He finds out that they are cloning his friend, Jango Fett, and that the clones have had their age factor doubled. If the clones have lived a year they will have aged two, and when they have lived two years they will have aged four, and so forth. Skirata is disgusted with the Kaminoans' practice of \"reconditioning\"—often a term used for terminating—clone children who didn't pass quality control standards. Six \"prototype\" ARC Trooper children, designated Null-class, were labeled defective and scheduled for reconditioning because they would not follow any orders given them. However, before the unruly clones can be executed, Skirata intervenes and takes it upon himself to raise and train them personally, keeping them separate from the other clones."}, {"tag": "p", "text": "The plot jumps forward to five days after the Battle of Geonosis. Skirata is on Coruscant and has just heard about the conflict and of Jango Fett's death at the hand of Jedi Master Mace Windu."}, {"tag": "p", "text": "The storyline then skips ahead a year later, where the Galactic Republic learns that Separatist terrorists have infiltrated Coruscant and are spying on the Republic. Skirata is hired by the Republic to track them down and enlists Omega Squad—Darman, Niner, and Fi, all personally trained and formally adopted by Skirata, and Atin who was trained by Walon Vau—for the mission. Assisting the team is Republic information broker Besany Wennen, Jedi Master Arligan Zey, and Jedi Knights Bardan Jusik and Etain Tur-Mukan—the Jedi who worked with Omega Squad during the mission to Qiilura. Skirata's Wookiee companion Enacca also joins the group, as does Null ARC trooper Ordo and clone trooper Corr. However, the situation is made more complicated when Vau and Delta Squad—Boss, Sev, Scorch, and Fixer—also join the team. Skirata and Vau have a rivalry due to their different philosophies in training clone soldiers. Skirata trained Omega Squad as a role model father-figure, while Vau trained Delta Squad through abusive discipline. Atin has a hard history with Vau since he was beaten so many times under his tutelage. During the course of the story, Etain and Darman's relationship grows stronger, and Etain becomes pregnant with Darman's child but does not tell him."}, {"tag": "p", "text": "During the mission to track the terrorists down, Jinart and Valaqil join in to remind Omega Squad and Etain that they still owe the Gurlanins a debt after they helped the clones and Jedi back on Qiilura. Etain and Omega Squad promise that they will eventually repay that obligation, but ask the Gurlanins to assist in the mission, to which they agree."}, {"tag": "p", "text": "The spies in the Republic are ultimately found, and the information they captured is destroyed and the terrorists are killed. Unfortunately, the rivalry between Omega and Delta Squads remain; Atin and Vau engage in a brutal fistfight that is quickly broken up by Bardan Jusik. Later, after the celebration of the squads' victory over their mission, Etain reveals to Skirata that she is pregnant with Darman's child. Skirata is angered by this because he believes Etain used Darman. Nevertheless, the two agree to keep this a secret from everyone else—aside from Jinart and Valaqil—and that the child will be a Mandalorian like his father and not a Jedi like his mother. Skirata promises Etain that she will be able to go to Qiilura and spend some time with Darman. Ordo figures out Etain is pregnant but decides to keep it a secret."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "In 2005 and 2006, Karen Traviss revealed on the StarWars.com Message Boards that she had used the 10-month calendar while writing Triple Zero and the other novels in the Republic Commando series."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}