{"url": "Republic_Military", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Galactic Republic military units", "Category:Republic Military"], "nodes": [{"tag": "h1", "text": "Republic Military"}, {"tag": "p", "text": "The Republic Military was the military of the Galactic Republic during the Clone Wars, consisting of the Grand Army of the Republic and the Republic Navy. The Supreme Chancellor was the Commander-in-Chief of the Republic Military; the Jedi High Council and the Republic High Command were principle organs by which military policy was carried out. Republic Intelligence served as the Republic Military's intelligence-gathering and covert operations branch."}, {"tag": "p", "text": "At the time of the Republic Military's inception, the Galactic Republic presided over an era of peace that lasted for a millennium. During the Republic's final years, however, the galaxy was on the verge of civil war as a result of the Separatist Crisis. After discovering that the Confederacy of Independent Systems—a confederation of star systems in rebellion—formed a droid-based military, the Republic acquired an army of clone troopers to serve as the backbone of its own military. Bred from the genetic template of the human bounty hunter Jango Fett, clone troopers fulfilled various functions in every branch of the Republic Military, from infantry soldiers, navigation officers and starfighter pilots, to the elite ARC troopers and clone commandos. Next to the chancellor, the highest-ranking officers in the Republic Military were the Knights of the Jedi Order, who were commissioned as Jedi Generals and served by a cadre of Clone Commanders and non-clone Republic officers."}, {"tag": "p", "text": "For three years Republic and Separatist forces fought across the galaxy, from the First Battle of Geonosis in 22 BBY to the Outer Rim Sieges in 19 BBY. During the final days of the Clone Wars, the Jedi were betrayed by their troops due to a Sith conspiracy to liquidate the Order and take over the Republic. Supreme Chancellor Sheev Palpatine, who was in fact the Sith Lord Darth Sidious, commanded the clones to initiate Order 66—a secret protocol that compelled the clones to summarily execute their Jedi generals as enemies of the state. With the Jedi removed as an obstacle, Palpatine supplanted the old democracy of the Republic with the fascist New Order, proclaiming himself Emperor of the First Galactic Empire. The Republic Military was consequently transformed into the Imperial Military."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Administration"}, {"tag": "p", "text": "In light of the Jedi Order's insufficient numbers compared to the far more numerous military of the Confederacy of Independent Systems, the Jedi accepted the responsibility of leadership in the Galactic Republic's new military. The title of Jedi General was bestowed on the Knights and Masters of the Order; Padawans were granted the lesser rank of Jedi Commander. Assisting the Jedi in their new role as military leaders was a cadre of clones specially trained for command. Their ranks ranged from the low positions of sergeant and lieutenant to the higher commissions of captain and commander. Regardless of their place in the Republic Military echelon, clones were outranked by both the Jedi and non-clone commissioned officers. In addition to receiving support from clone navigation officers, high-ranking Jedi were assigned a Republic Navy officer who served in a subordinate capacity as part of a wartime bargain struck early on between the Jedi High Council and Supreme Chancellor Sheev Palpatine."}, {"tag": "p", "text": "The Republic Center for Military Operations was located on Coruscant, capital of the Republic. The Strategic Advisory Cell was created to oversee various operations during the war. Its membership included Vice Chair Mas Amedda, Doctor Gubacher, Lieutenant Commander Orson Callan Krennic, the director of the Commission for the Protection of the Republic, and representatives of pro-Republic corporations like Rendili StarDrive, Corellian Engineering Corporation, and Kuat Drive Yards. The Republic also maintained an Outer Rim Command Center to oversee operations in that area of the galaxy."}, {"tag": "h3", "text": "Army"}, {"tag": "p", "text": "When the original Republic army had existed, the Thisspiasian warriors volunteered to join the force to bolster the military. The Grand Army of the Republic comprised the ground forces of the Galactic Republic from its inception and throughout the Clone Wars. Entire legions of clone troopers were grown and trained on the planet Kamino to serve as infantry units in addition to other roles in the Republic Military. Initially consisting of 200,000 units prior to the start of the conflict, the Grand Army's ranks swelled with an additional million units at the beginning of the war. During the early period of the war, Phase I clone trooper armor served as the standard battle armor for the average clone, whereas clone trooper pilots, clone ordnance specialists, and other variant units wore a specialized version to suit their function. As the war progressed, Phase II clone trooper armor was gradually introduced into the Grand Army and eventually replaced Phase I as the standard armor for clones."}, {"tag": "h3", "text": "Navy"}, {"tag": "p", "text": "The Galactic Republic Navy was the naval warfare branch of the Republic Military. It therefore possessed an array of military warships—in particular, the Venator-class Star Destroyers and Acclamator-class transgalactic military assault ships. Making its debut at the First Battle of Geonosis, the Acclamator-class assault ship was used as a troop transport ferrying thousands of clone troopers across the galaxy. The Venator-class Star Destroyer was not only used as a transport vessel for the Republic army; its primary function was ship-to-ship combat. In addition, the Venator was developed to act as a carrier for various starfighters and Low Altitude Assault Transport gunships. The Venator-class also came to be closely associated with the Republic Military's Jedi leaders and thereby gained the alternative name of \"Jedi cruiser.\""}, {"tag": "p", "text": "The Low Altitude Assault Transport/infantry gunship served an important role in the military, as it worked as a troop carrier and an escort for other forces. The gunship could also serve as an elevated gun platform and could successfully destroy enemy vehicles with its missiles."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The origins of the Republic Military dated back to the age of the Old Republic. These forces were headquartered on Coruscant, and ultimately disbanded following the Jedi-Sith War. The Old Republic evolved into the modern Galactic Republic, a government that maintained a military around the time of its formation. For much of its history, however, the Republic did not require a standing military. Local star systems and sectors became responsible for their own security; the Galactic Senate granted the Jedi Order a mandate to uphold the peace of the Republic across the greater galaxy; and the Republic Era lasted for a millennium, resulting in the rise of peace and democracy under the Republic's rule."}, {"tag": "p", "text": "During the High Republic Era, the Republic utilized the Republic Defense Coalition to protect its interests as it expanded into the Outer Rim Territories. The Judicial Forces served at the Senate's discretion, however these forces were effectively supplanted by the Jedi Order as the government's preferred peacekeepers. The Jedi, known as the guardians of peace and justice in the Galactic Republic, favored non-violent methods such as diplomacy when resolving disputes, keeping the more aggressive options as a last resort."}, {"tag": "h3", "text": "Restoration"}, {"tag": "p", "text": "The centuries of peace that marked the Republic's reign ended as a result of the Separatist Crisis. Disillusioned by the politics of the Senate, thousands of star systems sought to form a new government, the Confederacy of Independent Systems, by seceding from the Republic. Loyalist senators deliberated on the Military Creation Act, debating whether to establish a standing military or to continue negotiations with the Separatists. Ultimately, the Republic Military was established upon discovering the existence of the Separatist Droid Army; battle droids were secretly built on Geonosis to coerce the Republic into recognizing Separatist independence. Therefore, the Senate rallied behind Supreme Chancellor Sheev Palpatine, who activated the Republic Military with the emergency powers bestowed to him by the beleaguered legislature."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The Clone Wars marked the last three years of the Republic's existence, in which the Republic Military fought against its counterpart, the Confederacy military, across the known galaxy. At the time of its introduction, the Republic Military was composed of the Galactic Republic Navy and the Grand Army of the Republic. The Kamino-grown clone troopers were bred from a human template, that of the bounty hunter Jango Fett, to serve as the backbone of the Republic Military. These purpose-built soldiers existed for combat, and would fight against the Confederacy's battle droids from the first battle on Geonosis to the last engagements of the war. The Senate oversaw the military through its Military Oversight Committee."}, {"tag": "p", "text": "The Clone Wars was named after the clone troopers who became symbolic of the first large-scale conflict since the formation of the Republic. At the time of their deployment from the Kaminoan homeworld, the clones displayed a level of military might unseen in the history of the galaxy. Throughout the war, clones and Jedi fought alongside each other and, in some cases, developed strong bonds while fighting against the galaxy-wide Separatist rebellion. Though the Jedi disdained aggression, they accepted their newfound role in the Republic Military as part of their commitment to serving the Republic."}, {"tag": "p", "text": "Throughout the Clone Wars, the Republic and Separatist forces engaged in numerous battles across the galaxy. Many clone troopers sacrificed their lives out of loyalty to the Republic, as well as their Jedi Generals and the Supreme Chancellor. After three years of constant fighting, the Confederacy was on the verge of defeat as the Jedi-led Republic forces escalated the Outer Rim Sieges. Unknown to both the Jedi and the clones, every clone trooper had been engineered with an organic chip that rendered them incapable of disobeying Order 66, a secret protocol that called for the immediate execution of all Jedi. In the waning days of the war, Chancellor Palpatine—now known to the Jedi as Darth Sidious, the Dark Lord of the Sith—issued Order 66 to the entire clone army, compelling the clones to slaughter their longtime allies without hesitation. In the end, the Republic Military was instrumental in the downfall of both the Jedi Order and the Galactic Republic, consequently resulting in the restoration of Sith dominance through the rise of the Galactic Empire."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "At the start of Sidious' reign as Galactic Emperor, the Galactic Empire inherited the armed forces of the Old Republic and reorganized it into the Imperial Military. The clone troopers, who had once served as the defenders of the Republic, came to represent the first generation of the Imperial stormtrooper—elite enforcers of the Emperor's regime. However, a group of Republic fighters refused to serve the Empire. Their leader, the Onderonian soldier Saw Gerrera, was convinced that Palpatine had purged the Jedi Order in order to take control of the galaxy with the clone army's support."}, {"tag": "p", "text": "Wilhuff Tarkin, Nils Tenant, and other ambitious officers who made their careers in war gained even more opportunities for advancement in the Empire. While assessing the strengths of the Imperial Army, Tarkin concluded that the clone trooper program was too expensive to maintain. He therefore supported Vice Admiral Rampart's efforts to replace clones with enlisted soldiers through Project War-Mantle. Although the Clone Wars officially concluded with the Confederacy's defeat, numerous Separatist holdouts persevered in their resistance to the New Order, particularly in the Western Reaches of the galaxy. Their continued existence was used to justify the Empire's massive militarization effort, enabling the Imperial Military to grow larger and more advanced than its Republic precursor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Republic Military first appeared in the 2002 theatrical film, Star Wars: Episode II Attack of the Clones. It was seen again in the 2005 film, Star Wars: Episode III Revenge of the Sith, and subsequently appeared throughout the 2008 animated series Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}