{"url": "Republic_Executive_Building", "categories": ["Category:Legends articles", "Category:Coruscant government buildings", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Republic Executive Building locations"], "nodes": [{"tag": "h1", "text": "Republic Executive Building"}, {"tag": "p", "text": "The Republic Executive Building—also known as the Senate Office Building, Executive Annex Dome and Senate Annex—was a large, domed administration building that also functioned as a spaceport in Galactic City's Senate District on Coruscant. Sponsored by the Financial Appropriations Committee and constructed several years before the Clone Wars, the Executive Building was the official residence and principle workplace of Supreme Chancellor Palpatine, the leader of the Galactic Senate of the Republic. Under the Galactic Empire, Palpatine resided in the Executive Building for a time as Emperor of the Galaxy before relocating to the much larger Imperial Palace."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Conception"}, {"tag": "p", "text": "In the midst of the Crisis on Naboo in 32 BBY, then-Senator Palpatine was disappointed in the Supreme Chancellor's office, believing that the head of state of the Galactic Republic required a workplace that better reflected his position as leader of the Senate. The view of Coruscant's cityscape from the Senate Building appealed to Palpatine, who had secretly plotted to replace Finis Valorum as chancellor, but the office itself was too small for his liking. Convinced that no amount of remodeling would satisfy his expectations, Palpatine envisioned the construction of a new building—an executive office building that would serve as the nerve center for his future regime."}, {"tag": "p", "text": "Secretly, Palpatine's true identity was Darth Sidious, a Sith Lord affiliated with the Sith Order, an ancient cult of dark side Force-wielders committed to the downfall of the Jedi Order. Soon after Palpatine's election to the highest office in the state, the Financial Appropriations Committee proposed to finance the construction of a new building that would serve as the executive branch's principle workplace, to which the Chancellor approved. Hence, the Republic Executive Building was created in the Senate District, adjacent to the Senate Building, and also served as a docking facility with several tiered hangar levels. In addition to its executive role, the new structure was an annex to the Senate's delegation offices, and also included private rooms and an office designed according to Palpatine's specifications. For more than a decade, Chancellor Palpatine resided in the Executive Building, all the while plotting to bring about the re-ascendancy of the Sith as rulers of the galaxy."}, {"tag": "h3", "text": "The last years of the Old Republic"}, {"tag": "p", "text": "At the height of the Separatist Crisis in 22 BBY, Supreme Chancellor Palpatine held several meetings with the Jedi High Council and Loyalist Committee in his office at the Executive Building, discussing options aimed at the preservation of the Galactic Republic. Around the same time, the Jedi Knight Obi-Wan Kenobi sent a report to the Chancellor's office, in which he revealed his discovery of a secret droid army, built by the Separatists in preparation for a civil war. At the behest of Vice Chair Mas Amedda, Palpatine secured emergency powers with the Senate's majority support, and then activated a clone army in response to the Separatist Rebellion. As the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, the Chancellor spent much of his time in the Executive Building, where he coordinated many strategies with the Jedi whom he appointed as generals in the Grand Army of the Republic."}, {"tag": "p", "text": "Early in the conflict, the bounty hunter Cad Bane led a team of mercenaries and assassins on a mission to rescue Ziro Desilijic Tiure, the incarcerated uncle of a Tatooine crime lord known as Jabba the Hutt. In order to achieve their objective, the bounty hunters infiltrated the Senate Building and took several senators hostage, killing numerous Senate Commandos in the process. They also disabled the power grid in the Republic Executive Building, causing the structure to initiate an automatic lock-down. Chancellor Palpatine, trapped in his office and unable to communicate with the outside world, was contacted by Bane and coerced into releasing Ziro in exchange for the senators' lives. A clone squad of Coruscant Guard shock troopers were deployed to the building for the Chancellor's protection, but the hunters ultimately escaped from Coruscant with Ziro."}, {"tag": "p", "text": "As the Clone Wars progressed, a Zillo Beast—believed to be the last of a species long since considered extinct—was captured and transferred from Malastare to Coruscant on the orders of Chancellor Palpatine. Fascinated by the beast's armor-like skin that was impervious to lightsabers, Palpatine had it deposited in the Republic Science and Technical Center for further analysis. The creature escaped, however, and proceeded on a rampage through the city. Dozens of buildings path were damaged and many civilians were killed as the zillo beast tracked Palpatine to his office in the Republic Executive Building. The Chancellor attempted to escape in his H-2 executive shuttle, but the zillo beast caught the starship in its grip. A squadron of LAAT gunships, led by several members of the Jedi Council, arrived on the scene and promptly killed the beast with gas bombs containing Malastarian fuel that was toxic to the creature."}, {"tag": "p", "text": "Shortly after the Battle of Coruscant in 19 BBY, the Jedi generals Obi-Wan Kenobi and Anakin Skywalker escorted Chancellor Palpatine to the Executive Building's docking area where they met with Jedi Master Mace Windu and a retinue of Loyalist politicians. Meanwhile, on the lower levels, a clandestine organization of senators known as the Republic Group met with the smuggler Tobb Jadak in order to use his ship, the Stellar Envoy for a covert mission. Utilizing an encrypted device aboard the ship, the senators safely departed the Executive Building before a group of Coruscant Guard clone shock troopers could detain them."}, {"tag": "p", "text": "In the days following of the Battle of Coruscant, Palpatine met with Skywalker in his office at the Executive Building and appointed the Jedi Knight as his personal representative on the Jedi High Council. The Council allowed the appointment to stand, but only for the purpose of using Skywalker to spy on the activities of the Chancellor, whose motives they had come to distrust. The Executive Building was also the site where the Delegation of 2000 made its existence known to the Chancellor. Composed of a group of senators who disagreed with the numerous amendments to the Constitution, the Delegation confronted Palpatine in his office with a petition of two thousand like-minded delegates that advocated for a peaceful conclusion to the war. The Chancellor assured them of his support for a restoration of democracy, although the vagueness of his intentions and dismissive attitude toward their questions left the Delegation of 2000 more concerned for the future of the Republic."}, {"tag": "h4", "text": "Showdown in the Executive Building"}, {"tag": "p", "text": "With the death of General Grievous at the Battle of Utapau, Master Windu and three of his fellow members on the Jedi Council—Agen Kolar, Kit Fisto and Saesee Tiin—left the Jedi Temple and headed to the Executive Building. Moments before their departure, Skywalker told Windu about his discovery of Palpatine's secret identity as Darth Sidious, the Dark Lord of the Sith who engineered the Separatist Crisis and the Clone Wars. When the Jedi confronted the Chancellor in his private office, Sidious swiftly struck down three of the Masters and engaged Windu in a lightsaber duel, resulting in a showdown between the Jedi and Sith in the Republic Executive Building."}, {"tag": "p", "text": "Mace Windu's death at the hands of Darth Sidious not only affected the fate of the Galactic Republic and the Jedi Order, but also caused Anakin Skywalker's fall to the dark side of the Force. Driven by the premonition of his secret wife's death in childbirth and convinced that Sidious had the power to restore life, Skywalker attacked Windu in defense of the Chancellor, making him complicit in the Jedi Master's demise. Though remorseful for his actions, Skywalker relented to Sidious's offer and joined the Sith as the Dark Lord's new apprentice. As the newly-christened Darth Vader led the 501st Legion on a mission to purge the Jedi Temple of all inhabitants, Sidious remained in the Executive Building where he issued Order 66 to the clone soldiers dispersed throughout the galaxy, causing them to betray and murder their Jedi officers without question or debate."}, {"tag": "p", "text": "Without the Jedi Order, Palpatine's opponents in the Senate were powerless to prevent his complete takeover of the state. In a speech that condemned the \"Jedi Rebellion\" and the inefficiencies of the Old Republic, Palpatine proclaimed the formation of the first Galactic Empire, ruled by himself as emperor."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "In the months following the rise of the New Order, Emperor Palpatine no longer occupied the Executive Building. His official residence had been moved to the heavily-renovated Imperial Palace, formerly known as the Presidential Palace in the Old Republic. Despite the relocation, the Emperor still utilized his former office on occasion, mainly to meet with members of the Imperial Senate and other guests. The building also contained secret chambers for the purpose of interrogation via torture—an experience that Padawan Dama Montalvo endured at the hands of Darth Vader, who sought information on the whereabouts of Obi-Wan Kenobi."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Erected within the Legislative Borough of the Senate District, the Republic Executive Building was built over the old foundations of the Coruscant Spaceport, a docking facility that existed during the Cold War. A massive dome, situated at the center of several broad thoroughfares, was the largest of several annexes in close vicinity to the Senate Building. Designed to complement the Great Rotunda, the Executive Building alleviated the cramped office conditions in the Senate Building caused by the increased number of seats doled out to new member worlds. Aside from its status as a political administration facility, the Executive Building contained several levels of hangar bays and landing pads for the official transports of government officials."}, {"tag": "p", "text": "The Supreme Chancellor's offices were located in the higher levels of the building, from which Palpatine conducted meetings with the Loyalist Committee, delegation leaders and members of the Jedi High Council. Along the exterior of the building, enhanced security measures ensured the safety of the Chancellor from potential terrorist attacks and assassination attempts. In addition to the Chancellor's Suite, several prominent senators also had their own offices within the building, including Padmé Amidala of Naboo, Bail Organa of Alderaan, and Mee Deechi of Umbara."}, {"tag": "p", "text": "The highest tier of the Executive Building's multi-level landing dock was reserved for senators and delegation leaders with offices in the building. Executive shuttles, speeders and gunships were contained in the docking area in order to accommodate guests, ranging from ambassadors to planetary rulers and members of the Jedi Order. Attendant droids, load lifters and pilot automatons were assigned to assist Republic officials on each level; larger vessels, such as diplomatic cruisers, star skiffs and light stock freighters could dock in the wider landing bays on the lower tiers. The main docking level deposited visitors into the cavernous, open-air atrium that led deep into the Executive Building's labyrinthine interior."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}