{"url": "Republic_Executive_Directive_9302-84121", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Republic laws and acts"], "nodes": [{"tag": "h1", "text": "Republic Executive Directive 9302-84121"}, {"tag": "p", "text": "Republic Executive Directive 9302-84121 was an executive order issued by the Office of the Supreme Chancellor of the Galactic Republic on 13:5:23 GrS (22 BBY). The directive authorized government seizure of the HoloNet channel that carried HoloNet News, allowing the Republic to re-purpose it as a military communications channel. It was issued in response to the Clone Wars between the Republic and the Confederacy of Independent Systems, which had erupted days prior with the Battle of Geonosis."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Republic Executive Directive 9302-84121 was a decree of the Office of the Supreme Chancellor of the Galactic Republic. The directive claimed the HoloNet channel that regularly featured HoloNet News for exclusive usage by the newly-formed Republic Military. The nationalization of the channel was intended to expire when the state of emergency instigated by the Clone Wars was brought to an end."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 22 BBY, the Separatist Crisis, which had plagued the Galactic Republic for two years, reached a fever pitch and erupted into the galaxy-wide Clone Wars. The conflict inspired the Office of the Supreme Chancellor, at the time occupied by Palpatine of Naboo, to issue a state of emergency. During this time, the Chancellor's office issued Republic Executive Directive 9302-84121 in order to appropriate control of the HoloNet channel that carried HoloNet News and reserve it for usage by the Republic's Armed Forces."}, {"tag": "p", "text": "From that point onward, citizens who attempted to access the channel were met with a bulletin from the Republic Emergency Broadcasting System, which described the directive and instructed viewers to change their transceivers to a government-approved channel. Though HoloNet News was briefly shut down as a result of this order, it returned later in the Clone Wars, albeit in a more limited format. Dubbed \"Republic HoloNet News\" during the conflict, the program made sporadic updates that focused on news from the frontlines of the war and aired pro-Republic programs such as A Galaxy Divided, while eschewing the more trivial \"Sports\" and \"Life\" features that had been present in its previous incarnation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Republic Executive Directive 9302-84121 was created as a way to bring an end to HoloNet News, an online feature created in 2002 to generate hype before the release of Star Wars: Episode II Attack of the Clones. Coinciding with the release of the film, website updates ceased and content on the main page was replaced with a message detailing the suspension of HoloNet News with the issuing of Republic Executive Directive 9302-84121."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}