{"url": "Republic_Outland_Regions_Security_Force", "categories": ["Category:Legends articles", "Category:Galactic Republic military units", "Category:Planetary Security Forces"], "nodes": [{"tag": "h1", "text": "Republic Outland Regions Security Force"}, {"tag": "p", "text": "The Republic Outland Regions Security Force, abbreviated ORSF and sometimes referred arrogantly as the Republic Navy by its members, was a Planetary Security Force operating out of Eriadu in the Outer Rim Territories in the last decades of the Galactic Republic. The military force was established to reign in the lawless regions in the Outer Rim and was formed by Governor-General Ranulph Tarkin of the Seswenna sector from the Seswenna Defense Forces and the Planetary Security Forces of neighboring sectors."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "The Ruusan Reformations disbanded the Republic's centralized armed forces and set limits on the strength of the Planetary Security Forces. By the last century of the Republic Classic era, this had led to much of the Outer Rim being effectively abandoned to lawlessness and instability. The crumbling of order concentrated power in the region's most populous and prosperous systems, of which Eriadu in the Seswenna sector was the most powerful. Dominated by the Quintad, five powerful families which included the Tarkins, Eriadu became and industrial powerhouse and the headquarters of Quintad Orbital Manufacturing (QOM), a major military shipbuilding corporation."}, {"tag": "p", "text": "By 57 BBY, QOM was led by Ranulph Tarkin, a fifty-year-old veteran of the Seswenna Defense Forces who had led a successful campaign against the Delmaasi pirates in 66 BBY before his business career. Tarkin was alarmed by the breakdown of order across the Outer Rim, and turned over control of QOM to his cousin to return to his military career. At Tarkin's urging, Seswenna's senator, Ulm Brashere, convinced the Supreme Chancellor to appoint him Governor-General of the sector, responsible for its defense forces."}, {"tag": "p", "text": "Given his wish, the now-General Tarkin began to strengthen Seswenna's military capabilities by building new warships in QOM's own facilities, but this soon fell afoul of the Ruusan Reformations' restrictions on capital ship strength and size and earned Tarkin the unwelcome attention of Judicial Forces inspectors. Frustrated, Tarkin turned to other shipbuilding companies with which QOM had forged ties, striking lend-lease deals that placed dozens of foreign-made corvettes, frigates and cruisers under Eriadu's control. Such \"demonstration fleets\" were common in the Core Worlds, but Tarkin's ambitions in the Rim alarmed the Judicials, and his next actions did nothing to allay their fears: Tarkin struck mutual-defense pacts with neighboring sectors, trading economic assistance for agreements to combine military forces in times of need, share navigational data among their Planetary Security Forces, and treat their sectors as a single theater of operations known as the Greater Seswenna. Tarkin then looked further afield, seeking agreements with other sectors to exchange navigational data and allow safe passage by mutual consent. At a stroke, Tarkin had turned a disorganized collection of Planetary Security Forces into a regional military power, which he proclaimed the Republic Outland Regions Security Force."}, {"tag": "h3", "text": "Controversy"}, {"tag": "p", "text": "The ORSF's rapid expansion bred fears of empire-building on Coruscant. Outraged by accusations of disloyalty, Tarkin stood down as Governor-General in place of his cousin Garvedon and was elected Seswenna's senator in 54 BBY. As the Seswenna sector's representative to Coruscant, Tarkin became an articulate proponent of enhancing the Republic's military capabilities, using the Outland Regions Security Force as a model. His feud with the Judicial Department continued, though the ORSF had many sympathizers within the Judicial Forces, and all the while Tarkin swore that he would turn over control of the ORSF to the Republic government, provided the force was part of a restored, centralized Republic Military."}, {"tag": "p", "text": "Tarkin became the leader of the Militarist faction of the Galactic Senate, but the suspicions of his detractors deepened. Senators such as Finis Valorum noted the all-Human composition of the ORSF, which struck many as speciesist, and also accused Tarkin of effectively buying the acquiescence of Eriadu's impoverished neighbors, seeing sinister designs in the fact that the ORSF referred to its expanded theater of operations as the Greater Seswenna. In reaction, Tarkin and personnel of the ORSF came to refer to their fleet and ground forces as the \"Republic Navy\" and the \"Republic Army\", seeing it as a template for a restored force."}, {"tag": "h3", "text": "The test of battle"}, {"tag": "p", "text": "The Outland Regions Security Force was put to the test during the Stark Hyperspace War of 44 BBY. The pirate Iaco Stark had been raiding Trade Federation convoys, intensifying a bacta shortage. Tarkin urged the Judicials to hunt down and destroy Stark, threatening that if they would not, the ORSF would. However, the Senate heeded Finis Valorum's advice instead, calling a peace conference. Tarkin wrung the location of the peace conference, Troiken, out of Nute Gunray of the Trade Federation. To send the ORSF to a planet on the other side of the galaxy to Eriadu would be a major violation of defense fleet mobility regulations, but Tarkin banked that a major victory over Stark's pirates would make him a hero and override legal concerns."}, {"tag": "p", "text": "Sympathetic Judicials lent the ORSF several battalions of special forces assault troops to provide a ground assault force. When the peace conference began, Gunray signaled the ORSF from his mechno-chair, and Tarkin was too eager to analyse the navigational data. Suspecting treachery, however, Iaco Stark had piggybacked Gunray's transmission with a navcomputer virus known as a Tionese program. By the time the ORSF mustered, every navigation computer was infected with the virus. Only one-third of the force reached Troiken; another third emerged from hyperspace off-course, while the last third emerged from hyperspace in places that would destroy them, such as within planets or near black holes and stars."}, {"tag": "p", "text": "In the ensuing First Battle of Qotile, the fleet was trounced. The survivors went to ground on the surface of Troiken, rescuing Valorum, Gunray, and their Jedi escorts and digging in at Mount Avos. There, the Judicials' Special Tactics troopers fought several battles before the siege was lifted with the Stark Commercial Combine's defeat by the Trade Defense Force in the Fifth Battle of Qotile. Ranulph Tarkin was killed in the fighting, but thereby became a martyr to the Militarist cause."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Outland Regions Security Force endured after its founder's death. Following the Battle of Naboo the ORSF was reinforced with impounded Trade Federation vessels, including cargo haulers, heavy munitions cruisers, C-9979 landing craft, B1-Series battle droids, and Vulture droids."}, {"tag": "p", "text": "In 29 BBY, Wilhuff Tarkin, Ranulph's nephew and formerly lieutenant governor of Eriadu, held the rank of Commander within the Outland Regions Security Force. That year, the Security Force launched an unsuccessful attack on Zonama Sekot in an effort to claim a Sekotan starship."}, {"tag": "p", "text": "A legacy of the ORSF's expansion under Ranulph Tarkin was revealed a generation later during the Separatist Crisis. In 26 BBY it responded half-heartedly to a raid by Nocto pirates at Ochotl in the neighboring Airam sector. Ochotl was an agriworld that was affiliated with the Corporate Alliance to better compete with the Eriadu-dominated agricultural firms in the Pangarees, and the ORSF's inaction convinced many that it was just a tool of Eriadu's interests. The entire Airam sector thereafter seceded from the Republic and joined the burgeoning Confederacy of Independent Systems. Likewise, Eriadu's militarism and Tarkin's ambition had pushed its rival Sullust and the Rimward sectors of the Rimma Trade Route towards the CIS."}, {"tag": "p", "text": "During the Clone Wars, Eriadu became a besieged Republic salient within Separatist space. The Outland Regions Security Force fought alongside clone troopers as part of the Republic's Eighteenth Army under the command of Wilhuff Tarkin, now one of the first Moffs, and his younger brother Gideon. The Greater Seswenna became the official name of the Eighteenth Army's theater of operations, and the ORSF was deployed in engagements along both the Hydian Way and the Rimma Trade Route in the final actions of the Outer Rim Sieges."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Styling himself a General, Ranulph Tarkin bombastically referred to his fleet as the Republic Navy and his ground troops as the Republic Army; although both had been eliminated by the Ruusan Reformation, his Militarist faction sought to reestablish them."}, {"tag": "p", "text": "Tarkin's detractors noted that the ORSF was composed almost entirely of Humans, which struck many as speciesist. Tarkin insisted that this reflected a concern for unit morale and a desire to standardize systems and procedures. Either by result or intent, most of Tarkin's soldiers agreed with his Humanocentric ideals."}, {"tag": "p", "text": "The ORSF's elite soldiers during the Stark Hyperspace War were the Special Tactics troopers."}, {"tag": "h2", "text": "Personnel"}, {"tag": "p", "text": "Tarkin's soldiers, officers, and vehicles and vessels were culled from the regional defense forces of planets sympathetic to his cause, among them Rendili, Commenor, Eriadu, Barkhesh, and Carida. Soldiers in the force included Antidar Williams and Jace Dallin, the latter of whom served as Ranulph Tarkin's aide and bodyguard."}, {"tag": "p", "text": "Maarisa Zsinj, the mother of future Imperial Grand Moff and Warlord Zsinj, served as an admiral in the Outland Regions Security Force and her skills earned her the nickname of \"Ace of the Spacelanes.\""}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Tarkin's ships were apparently Judicial Forces surplus, and consisted of Corellian Star Shuttles, Consular-class space cruisers, and variants of Consulars built with wider hulls (presumably for carrying ground forces). The fleet's flagship, Invincible, was another modified Consular. The fleet's starfighter force was filled by A-6 Interceptors. This force mix reflected traditional military thinking that quick and maneuverable weapons platforms could outfight larger warships."}, {"tag": "p", "text": "Tarkin's ground forces' primary weapon was the A280 blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Outland Regions Security Force was created by Greg Bear and first featured in the novel Rogue Planet. The 2012 guide book The Essential Guide to Warfare later retconned a Republic-affiliated paramilitary force that appeared in the 2001 comic arc Star Wars: Republic: The Stark Hyperspace War as being the Outland Regions Security Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}