{"url": "BB-8_and_the_Jungle_Adventure_-_Chapter_3", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:Star Wars Roll Out episodes"], "nodes": [{"tag": "h1", "text": "BB-8 and the Jungle Adventure - Chapter 3"}, {"tag": "p", "text": "\"BB-8 and the Jungle Adventure - Chapter 3\" is the third episode of the animated shorts series Star Wars Roll Out. It was first released August 23, 2019 on Youtube."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Old friends and new allies team up to help BB-8 escape!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In the opening credits, BB-8 and a Star Wars ball lead the way followed by Rey, Maz Kanata, Finn, Captain Phasma, two stormtroopers, Ben Solo, Han Solo, Chewbacca, and three porgs."}, {"tag": "p", "text": "Stuck in a web of a spider-like creature alongside a shape-shifter, BB-8 has cecently met, the two are only rescued by another member of the changeling's species. Their celebration is shrort-lived however, when the arachnid comes back to find them free of its trap. The three attempt to run, only to get pushed into a corner. Fortunately, BB-8 comes up with a brilliant idea to use his welding torch to scare the spider off. It works, and using their morphing abilities, BB-8's new friends also adopt the same tactic."}, {"tag": "p", "text": "Now that the tables have turned, the shape-shifters turn into more BB units and after BB-8's example, they tie all of the predator's eight spindly legs."}, {"tag": "p", "text": "The procession of droids set to find BB-8 in D'Qar dense jungle, where they had previously lost him, now finds that there are three of their round friend, demobilizing the spider. They join in the fun, tugging on the creature's legs, until it catapults it high up in the sky. There the creature lands in the nest of long-necked birds, which peck at its feeble body."}, {"tag": "p", "text": "When it comes to BB-8's rescuers meeting his new changeling friends, they turn out to be a little too scary for the droids, which run home screaming in terror."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}