{"url": "Republic_officer", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Galactic Republic military officers"], "nodes": [{"tag": "h1", "text": "Republic officer"}, {"tag": "p", "text": "Republic officers were military officers in military uniforms who served the Galactic Republic's armed forces during the Clone Wars. Throughout the war, they commanded the warships of the Republic Navy and assisted the members of the Jedi Order with their new role as leaders of the Grand Army of the Republic. In the aftermath of the conflict, some officers such as Wilhuff Tarkin, Orson Krennic and Wullf Yularen went on to serve the Republic's successor state, the Galactic Empire."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "During the Clone Wars, a group of veterans served as officers of the Republic Navy, the naval branch of the newly-established armed forces of the Galactic Republic. As a result of a wartime agreement between Supreme Chancellor Sheev Palpatine and the Jedi Order, Republic officers were assigned to work with the Jedi Generals of the Grand Army of the Republic. They were, in turn assisted by clone navigation officers, in the crewing of Star Destroyers and other Republic vessels. Clones could also serve as Republic officers, either as regular clone trooper officers, also known as a Clone Officer, or clone navigation officers. They were issued blue uniforms whereas non-clone officers wore olive-drab suits."}, {"tag": "p", "text": "At times, the rigid military discipline of the officers conflicted with the Jedi's approach to war. These by-the-book officers included admirals Barton Coburn, Kilian, and Wullf Yularen—all of whom adhered to the principles of discipline and obedience to the rules of the military. In Yularen's case, the rigid officer deplored General Anakin Skywalker's willingness to interpret or disregard orders. However, he also admired Skywalker's bravery and combat prowess. The Republic Navy's officers all shared an excellent strategic and tactical sense, and they were as capable of organizing a star system's defense fleet as they were outmaneuvering a dangerous warship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The position of Republic officer was created as a result of the Clone Wars, the galaxy-wide civil war between the Galactic Republic and Confederacy of Independent Systems. Because they had to outsmart pirates prior to the conflict, the Republic officers could work amid dangerous obstacles, which would slag navigators who were less experienced, and knew hyperspace routes. Throughout the war, non-clone commissioned officers served at the side of their Jedi counterparts, commanding clone troopers and warships such as the Venator-class Star Destroyer against the military forces of the Confederacy. However, in the aftermath of the Clone Wars and the subsequent rise of the Galactic Empire, the position of Republic officer was supplanted by the Imperial officer—a class of high-ranking officials who occupied various positions of authority in the Imperial Military."}, {"tag": "p", "text": "Several former Republic officers went on to pursue new careers in Emperor Palpatine's New Order. Wilhuff Tarkin, a former captain who received a promotion to admiral prior to the end of the Clone Wars, received the political title of Grand Moff from the Emperor himself. Yularen became a colonel in the Imperial Security Bureau after resigning his admiral's commission. Orson Callan Krennic later became Director of Imperial Military Department of Advanced Weapons Research, the successor of the Republic Special Weapons Group."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}