{"url": "BB-9E", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:BB-series astromech droids", "Category:First Order individuals", "Category:Individual droids"], "nodes": [{"tag": "h1", "text": "BB-9E"}, {"tag": "p", "text": "BB-9E was a black-plated BB-series astromech droid in the service of the First Order. A top-of-the-line astromech droid, during the New Republic Era BB-9E served aboard Supreme Leader Snoke's flagship, the Supremacy, keeping machinery operational and upholding security procedures."}, {"tag": "p", "text": "During the First Order/Resistance War, BB-9E discovered that the Supremacy had been infiltrated by Resistance operatives. As a result of the droid's actions, Captain Phasma's stormtroopers arrested Finn and Rose Tico before they could disable the Supremacy's hyperspace tracker."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The droid BB-9E was the property of the First Order military, one of many units that were relied on to keep machinery operational and uphold procedures aboard the First Order Navy's warships. During the New Republic Era, a war broke out between the Resistance and the First Order, as the latter set out to conquer the galaxy in the wake of the New Republic's destruction. By then, BB-9E was assigned to the Mega-class Star Dreadnought Supremacy—the flagship of Supreme Leader Snoke—where it performed its usual duties by keeping machinery, procedures, and potential intruders in check."}, {"tag": "p", "text": "Following the assault on D'Qar, a flotilla of Resistance starships was tracked through hyperspace and attacked by a fleet of First Order Resurgent-class Star Destroyers, led by the Supreme Leader's command ship. While the attack was in progress, BB-9E located three intruders—Resistance technician Rose Tico, the renegade stormtrooper FN-2187 \"Finn,\" and the freelance slicer \"DJ\"—who infiltrated the Supremacy. BB-9E exposed the would-be saboteurs before they could disable the flagship's advanced active tracker system, resulting in their capture by Captain Phasma and her troopers. The resistance droid BB-8, escaped the First Order's notice, however."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "BB-9E was a top-of-the-line astromech droid, belonging to the BB-series astromech droid model. The droid was vigilant, utilizing a sharp photoreceptor—in every spectrum—against infiltrators, saboteurs and other threats to Supreme Leader Snoke's flagship. Due to the First Order's view on droids, BB-9E was treated simply as a machine, resulting in a cold personality even for a droid that belonged to the normally friendly BB-unit model. Though subjected to regular memory wipes in order to remain subservient and docile, BB-9E had developed a malevolent personality. It was especially malicious when reporting transgressions."}, {"tag": "p", "text": "A dark, gleaming BB astromech unit, BB-9E had black-plating and a red, multi-spectrum photoreceptor with telescoping lens. Standing at 0.6 meters in height, BB-9E featured a distinctive square dome for a head and grilled openings to permit ventilation as well as enhanced sensor transparency."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Boasting the latest technology in the First Order, BB-9E was armed with a shock prod and possessed an array of tools for various purposes, including technical support and combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BB-9E was first revealed when several LEGO sets' packaging for Star Wars: Episode VIII The Last Jedi toy line leaked on May 26, 2017. The droid was officially introduced in a preview for the Force Friday II products, released on August 31, 2017. BB-9E also acted as one of the three droids of the \"App-Enabled Droids\" app AR game by Sphero alongside R2-D2 and BB-8, with BB-9E in particular giving a tour of the Supremacy. The droid made his first appearance in the non-canon Star Wars Blips episode \"Hey You,\" where he had a run in with BB-8."}, {"tag": "p", "text": "BB-9E was nicknamed \"BB-H8,\" as in \"hate,\" on the set of The Last Jedi."}, {"tag": "p", "text": "During the early development of The Last Jedi, BB-9E went almost three different designs made by Luke Fisher before the final one which was featured in the finished version of the film. Interestingly, every design mostly affected the droid's head. Additionally, its original name was going to be BB-Hate in order, according to droid and creature effects supervisor Neal Scanlan, to demonize BB-8."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}