{"url": "Republic_military_enhancement_bill/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Galactic Republic laws and acts"], "nodes": [{"tag": "h1", "text": "Republic military enhancement bill"}, {"tag": "p", "text": "During the pan-galactic Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, the Senate of the Republic was presented with a bill by Senator Halle Burtoni that called for an increase in military production. The bill was drafted in 21 BBY, when, after almost a year of open warfare, the Grand Army of the Republic was facing serious issues of troop depletion and the Separatist Droid Army was steadily gaining ground. Around that time, the Senate began to debate the necessity of troop surges that could supplement the already-deployed armed forces and the Jedi Generals in the field. Although the advocates for military enhancement gained considerable traction early in the discussion, uncertainty over the Republic's fiscal integrity generated concern among many senators who felt that the price of troop production would be prohibitively costly. In response, Senator Gume Saam of Tibrin introduced a bill that called for the deregulation of the banking industry so that the Republic might secure lines of credit to fund future troop surges. After a devastating Confederate terror attack on the Republic capital of Coruscant, the deregulation measure was passed and a budding peace initiative was shot down."}, {"tag": "p", "text": "These two developments allowed for Burtoni to introduce her legislation, which specifically called for the creation and training of five million new clone troopers from her constituent world of Kamino. To fund the army expansion, the bill took advantage of Senator Saam's successful legislation by opening a new loan through the InterGalactic Banking Clan—the galaxy's premier financial institution. Although Burtoni's proposal was widely supported by her colleagues, several senators, including Bail Prestor Organa of Alderaan and Padmé Amidala of Naboo, opposed it on grounds both fiscal and pacifistic. Their opposition became even more impassioned when they learned that the InterGalactic Banking Clan's loan would carry with it a twenty-five percent interest rate, repayment of which would easily bankrupt the Republic and cease all public service spending."}, {"tag": "p", "text": "Organa and Amidala lobbied their fellow representatives for support, but found little. To ensure their failure, the Sith Lord Darth Tyranus hired bounty hunters Robonino and Chata Hyoki to threaten and batter Republic senators who might vote against Burtoni's measure. Although the tactic was widely successful, many in the Senate respected the opinion of Senator Organa, and so the Alderaanian planned to make a final address to the congress before the final vote commenced. However, on the day of the vote, Organa was severely injured in an assassination attempt, forcing Amidala to make the speech in his place. The Naboo senator's plea was well-received, as it focused heavily on the tangible cost the bill would have on families within the Republic. Despite this, the bill was approved, prompting Amidala and her coalition to quickly draft a piece of counter-legislation that would nullify Burtoni's success."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The military enhancement bill was a piece of legislation introduced to the Senate of the Galactic Republic with the primary purpose of expanding the Republic Military—specifically, the Grand Army of the Republic. Written by the Kaminoan senatorial delegation, the legislation acted as both a major appropriations bill and an approval for a troop surge. It provided for the military expansion with the inclusion of two major provisions: first, an order for five million new clone troopers to be grown and trained by the cloners of the planet Kamino. In order to pay for the drastic troop increase, the bill included a secondary provision: a request for a massive loan from the InterGalactic Banking Clan. The loan would be used to compensate the Kaminoan government for the clones and would be paid off by the Republic with an interest rate of twenty-five percent, as arbitrated by the Banking Clan. Acquisition of the loan would drastically increase the size of the Republic's military spending budget, thereby drawing funds away from other Republic programs, like water maintenance, power management, public education, and healthcare."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Peace fails"}, {"tag": "p", "text": "The military enhancement bill came after the onset of the Clone Wars in 22 BBY, when the galaxy became engulfed in armed conflict between the massive clone armies of the Galactic Republic and the droid forces of the separatist Confederacy of Independent Systems. The war, which affected the entire galaxy but was largely fought in the Outer Rim Territories far from the Core Worlds, took a heavy toll on the Republic in terms of both lives and finances, and polarized politics on the capital world of Coruscant. Animosity between the two belligerent states repeatedly reached fevered levels, with leaders of both the Republic and the Confederacy calling for the war to continue until their enemy was annihilated. These calls usually gained traction in the Galactic Senate of the Republic and the Confederacy's Separatist Parliament, resulting in a continued escalation of violence and bloodshed."}, {"tag": "p", "text": "In this charged atmosphere, war profiteers and titans of military industries had a prolific influence in the governmental dealings of the Republic and Confederacy. In secret meetings, representatives of the Trade Federation and InterGalactic Banking Clan maneuvered legislation and initiatives onto congressional agendas to ensure that their respective employers would continue to profit from the conflict with as little hinderance as possible. In 21 BBY, one such bill made its way to the Republic's senate floor. Proposed by Ishi Tib Senator Gume Saam, the bill overhauled the Republic's financial system, ostensibly to allow the government to better fund future expansions of the military. This line of argument attracted the Senate's many pro-war delegates, but the true purpose of the bill lied in its deregulatory provisions; the legislation removed many of the restrictions on banking institutions, allowing for conglomerates like the InterGalactic Banking clan to conduct business with little to no government oversight."}, {"tag": "p", "text": "The prospect of complete autonomy for commercial interests and the escalation of violence and debt greatly concerned Naboo's Senator Padmé Amidala, who had dedicated her career to finding a peaceful end to the war. During the debates over Saam's bill, Amidala violated Senate standards by fleeing Coruscant and secretly meeting with Mina Bonteri on the Separatist capital of Raxus. Bonteri, who had represented Onderon in the Senate until she seceded with her world, was one of the few Confederate politicians who were eager to bring the war to a diplomatic conclusion. Together with Amidala, she drafted a peace initiative and brought it before the Separatist Parliament. Although she faced heavy opposition and was working against the will of Confederate Head of State Count Dooku, Bonteri was able to convince her colleagues to adopt the measure and sue for peace."}, {"tag": "p", "text": "Dooku, who operated as both the Confederate leader and as the Sith Lord Darth Tyranus, worked alongside his Master, Darth Sidious, and his top general, Grievous, to orchestrate an attack on Coruscant that would derail the peace proposal and force the financial reform bill through to approval. Carried out by disguised demolition droids, the attack devastated the Coruscant power grid, causing rolling blackouts and explosions across the Senate District. The blast was deemed an act of Separatist terrorism, stoking resentment and distrust in the Senate. As a result, the financial reform bill was quickly approved by the legislature and ratified by Supreme Chancellor Palpatine—the alter ego of the Sith Master, Darth Sidious."}, {"tag": "p", "text": "The morning after the bombing, the Senate convened once again to issue a formal reaction to the bombing and the Confederate peace offering. In light of the attack, many delegates wanted to reject the initiative outright and ridiculed Senator Amidala for her support of the proposal. The loudest proponent of continued warfare was Senator Halle Burtoni of Kamino, who quickly introduced the military enhancement bill. Drafted by her staff, the bill authorized a massive expansion of the Grand Army of the Republic by drawing funds from an InterGalactic Banking Clan loan, which was now possible due to the passage of the financial reform bill. Although Amidala and her colleague, Senator Bail Prestor Organa of Alderaan, were quick to object, public sentiment had turned against their calls for peace. When the Naboo politician tried once more to convince the Senate of the legitimacy of the Confederate peace accord, she was openly accused of treason by Umbara's Senator Mee Deechi and the Human Senator Dantum Roohd. The argument became moot when Chancellor Palpatine received a message from Count Dooku, in which he accused the Republic of orchestrating the assassination of Senator Bonteri. Dooku withdrew the peace offering, allowing the Senate war hawks to write off the Confederate olive branch and begin anew their push for escalation."}, {"tag": "h3", "text": "Fighting and funding"}, {"tag": "p", "text": "Immediately after Burtoni introduced her bill, Amidala and Organa quickly formed a coalition with Senator Onaconda Farr of Rodia to oppose the measure. Although it would be a severe uphill battle, Organa, a well-respected senior member of congress, agreed to led the effort to defeat the bill and recruit other legislators to the cause; meanwhile, Amidala and Farr researched the logistics and costs of the military expansion. The two of them arranged a meeting with Banking Clan representative Mak Plain to discuss the terms of the loan proposed in Burtoni's bill. During their conversation in Plain's office, the Muun banker revealed to Amidala and Farr that the loan would carry with it an interest rate of twenty-five percent—a drastic increase from the Republic's previously arranged rate of ten percent. Although Farr asserted that the rate hike was tantamount to theft, Plain assured him that the increase was entirely legal and reasonable given the recent passage of the deregulatory measures in Senator Saam's financial reform bill. Amidala returned to Organa with this information and the two decided that their best chance for success in the upcoming debate was for the Alderaanian to address the full senate with an impassioned plea."}, {"tag": "h2", "text": "Controversy"}, {"tag": "h3", "text": "The drums of war"}, {"tag": "p", "text": "The Muun went on to reveal that the Confederacy had also recently applied for a loan to finance an additional three million battle droids, which would give the Separatist Droid Army enough firepower to easily defeat the Republic and overrun Coruscant."}, {"tag": "h3", "text": "Intimidation and violence"}, {"tag": "p", "text": "In this heavily charged atmosphere, the few politicians who were interested in pursuing peaceful solutions to the war were often vilified and publicly lambasted for their views."}, {"tag": "p", "text": "The bill's opponents initially needed to sway the minds of only a handfull of senators, but just as with the financial reform bill, the Sith Lords Darth Sidious and Darth Tyranus sought to ensure the passage of the military enhancement bill in order to ensure the continuation of the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}