{"url": "Republic_credit_ingot", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Currency"], "nodes": [{"tag": "h1", "text": "Republic credit ingot"}, {"tag": "p", "text": "Republic credit ingots were a form of Galactic Republic currency, similar to the standard credit chip."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "The credit ingot appeared as small, flat, rectangular bars of gold and silver-colored metal. Each ingot was between two and three inches in length; the silver ones being a bit longer than the gold ones. The ingots had symbols stamped onto its surface, including the symbol of the Galactic Credit Standard ()."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, this form of currency was valuable in several parts of Galactic Republic and the galaxy at large. Jedi Knight Anakin Skywalker used some to get onto a ship owned by the Trandoshan, Gha Nachkt, while searching for his lost astromech droid, R2-D2."}, {"tag": "p", "text": "Skywalker's Padawan, Ahsoka Tano, later threw a handful of these ingots onto the floor of a bar in Coruscant's underground as a distraction in order to escape a violent brawl while in search of information regarding bounty hunter, Aurra Sing and young Boba Fett."}, {"tag": "p", "text": "The ingots were also exchanged on the planet Mandalore. They were used as a bribe given to a Mandalorian customs official by Moogan smugglers during the black market conspiracy that plagued the New Mandalorian capital city of Sundari."}, {"tag": "p", "text": "On Coruscant, C-3PO and R2-D2 had 40 credits in credit ingots in their possession while on a errand to purchase jogan fruit for a dinner party hosted by Senator Padmé Amidala for Senator Aang of Roona, a influential member of Senate Military Oversight Committee."}, {"tag": "p", "text": "Jabba the Hutt paid notorious bounty hunter Cad Bane a briefcase full of ingots for floor plans to the Senate Building. Once Cad Bane had freed Ziro the Hutt from prison on Coruscant, Ziro was brought to Nal Hutta where Jabba planned to have him killed. After betraying and killing Ziro Desilijic Tiure and recovering the holo-diary containing all the Hutt Grand Council's dirty dealings, Jabba the Hutt paid the Pa'lowick Sy Snootles in a handful of credit ingots."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}