{"url": "Repulsorlift/Legends", "categories": ["Category:Legends articles", "Category:Air vehicle engines", "Category:Capital ship engines", "Category:Engine types", "Category:Freighter and transport engines", "Category:General starship components", "Category:Ground vehicle engines", "Category:Repulsorlift engines", "Category:Repulsorlift technology", "Category:Starfighter engines"], "nodes": [{"tag": "h1", "text": "Repulsorlift"}, {"tag": "p", "text": "The repulsorlift or repulsorlift engine, often referred to simply as a repulsor, was an anti-gravity technology capable of levitating an object. It was created from subnuclear \"knots\" of space-time made by enormous unmanned power refineries encompassing black holes. Repulsorlifts were widely used, and were included on virtually every type of vehicle."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Repulsorlifts only worked within a gravity well, as the technology required mass to push against. For a typical habitable planet such as Alderaan, \"antigrav range\" was approximately six planetary diameters, or around seventy-five thousand kilometers. Repulsorlifts used minimal power and were reliable enough to be utilized continuously."}, {"tag": "p", "text": "Repulsorlifts could be assembled in arrays, clusters, or vanes studded with micro-coils of gravitic \"knots\". These units were then mounted on a vehicle or spacecraft, usually on the underside. The many repulsorlifts needed for a large ship were typically powered by a dedicated \"antigrav generator.\""}, {"tag": "p", "text": "Vehicles that commonly employed repulsors include speeder bikes, swoops, landspeeders, airspeeders and starships capable of operating in Gravity Wells. Power chairs, repulsorsleds and skimboards also used this technology."}, {"tag": "p", "text": "Larger vessels were only able to make planetfall with the aid of massive ventral repulsorlift suspension units. In fact, the landing legs of a Lucrehulk-class Core Ship could not support the ship's immense weight without the aid of repulsorlifts."}, {"tag": "p", "text": "Repulsor units built for vehicles could also be used in droids, as demonstrated by MD-0C6, who used the repulsor engine of a speederboat on himself to increase his own mobility."}, {"tag": "p", "text": "Repulsorlift vehicles are unable to drive through shields, requiring infantry, walkers or tracked or wheeled vehicles to proceed through shields to disable them before repulsorlift vehicles can proceed. This was notably seen in Battle of Naboo, where Trade Federation had to send its droids through Gungan shields to destroy the generators carried by the Fambaas before their AATs and MTTs can proceed. Capital ships, which are completely dependent on repulsorlifts when flying in atmosphere, cannot enter atmosphere if Planetary shields are active."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The five planets of the Corellian system possessed massive repulsors on their surface. They were so powerful that they could destroy capital ships in nearby space, and even stop the devastating firepower of Centerpoint Station, which created gravitational shifts great enough to destroy stars."}, {"tag": "p", "text": "The Verpine of the Roche asteroids utilized repulsorlifts in asteroid shepherding."}, {"tag": "p", "text": "Jaina Solo and Lowbacca along with scientists discovered that a miniature repulsor could mimic the gravitic signature of a Yuuzhan Vong ship they captured, the Trickster, enabling the New Republic to trick the Yuuzhan Vong into attacking their own ships, creating decoys, and confusing them in battle. This would turn the tide of the Yuuzhan Vong War."}, {"tag": "h2", "text": "Notable repulsorcraft manufacturers"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}