{"url": "Repulsorlift", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Technology stubs", "Category:Repulsorlift technology"], "nodes": [{"tag": "h1", "text": "Repulsorlift"}, {"tag": "p", "text": "Repulsorlift was a technology that allowed a craft to hover or even fly over a planet's surface by pushing against its gravity, producing thrust.  Repulsorlift engines or \"antigravs\" created fields of negative gravity called 'repulsor fields' which pushed against a planet's natural gravitational field."}, {"tag": "p", "text": "Vehicles that utilized the repulsorlift technology as their primary method of propulsion, including speeder bikes, were known as repulsorcrafts. Bakur Repulsor Corporation was one such manufacturer of the engines , while Aratech Repulsor Company was a manufacturer of craft that utilized this technology.  Vehicles that used repulsorlift technology included the Gian heavy patrol speeder, the Single Trooper Aerial Platform (STAP), the Flash speeder, the AAT Battle Tank, and the patrol transports."}, {"tag": "p", "text": "On starships, repulsorlift engines were a secondary form of propulsion, used for atmospheric flight and docking procedures. On many ships like the YT-1300 light freighter there was a dedicated fusion generator to power the repulsorlifts, though smaller ships like the X-wing starfighter drew energy from the sublight engines to power their repulsorlifts."}, {"tag": "p", "text": "Repulsorlift technology could be used in everyday items such as chairs, and speaking platforms.  It was also possible to weaponize repulsor technology to create shockwaves capable of repelling enemies in a similar manner to a Force push, notably being implemented in Mandalorian vambraces and clone commando Katarn-class Commando Armor, as well as by the Haxion Brood's bounty hunters.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}