{"url": "Repulsor_ray", "categories": ["Category:Legends articles", "Category:Gravitational superweapons"], "nodes": [{"tag": "h1", "text": "Repulsor ray"}, {"tag": "p", "text": "A repulsor ray, also referred to as a collector-repulsor array, was a superweapon under development by the Galactic Empire during the Galactic Civil War. It would focus the G-waves of hundreds of repulsor motors  to distort planetary crusts, with cataclysmic results."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The repulsor ray consisted of a large concave surface resembling an extremely large scanning bowl for a sub-space communications relay, and hundreds of low-yield repulsor projectors. The bowl acted as a collector for the G-wave emissions of the projectors, generating a field that could distort planetary crustal pressures, producing devastating earthquakes and volcanic eruptions. While lacking the planet-obliterating capabilities of a Death Star, it was much less expensive, and still capable of destroying entire civilizations. Further, the entire collector-repulsor array of the repulsor ray could be transported in a small ship, and deployed into orbit of the target world within minutes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Alliance HQ became aware of a fully operational Imperial base located on an asteroid far from the nearest areas of conflict between the Alliance and the Empire, and dispatched a ship with a group of Rebels to investigate. On approach, the Rebels detected an efflux of G-waves comparable to a singularity, but no other anomalies; they found this to be odd, but convenient, as the gravitational noise would mask the signatures of the Verpine-built grav-bikes they were carrying, allowing (hypothetically) for a swift and uneventful insertion and exfiltration."}, {"tag": "p", "text": "The Rebels parked their ship in orbit, descended to the asteroid base, and investigated. They found a facility manufacturing a large volume of low-yield repulsor motors, another facility building what seemed to be an unusually large sub-space communications relay scanning bowl, residential and recreational accommodations for the factory workers, and a high-security underground laboratory deep within the asteroid."}, {"tag": "p", "text": "After infiltrating the laboratory, the Rebels discovered the purpose of the products being manufactured in the rest of the base was to create a new, civilization-ending repulsor ray. They availed themselves of the chance to destroy the delicate control systems of the weapon, and then, in the confusion, escaped the laboratory in a running gunfight. From there, they were presented with the opportunity to either return to their ship on their grav-bikes, or damage the base further by appropriating and using an Imperial warship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The repulsor ray is the focus of \"Ain't Science Grand?,\" the seventh adventure seed presented in the first edition of Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}