{"url": "Rescue_mission_on_Yavin_4", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Yavin blockade", "Category:Battles of Yavin"], "nodes": [{"tag": "h1", "text": "Rescue mission on Yavin 4"}, {"tag": "p", "text": "The rescue on Yavin 4 was one of the Battles of Yavin 4 immediately after the beginning of the Yavin blockade."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 0 ABY, after the destruction of the first Galactic Empire's Death Star by the forces of the Alliance to Restore the Republic, a number of escape pods and shuttles that had escaped from the Death Star's destruction, crashed on Yavin 4. The survivors, including Colonel Maximilian Veers were scattered around the planet, cut off from reinforcements by Alliance forces."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Imperial Commander Brenn Tantor was sent to rescue the colonel. He landed his troops in the jungle and deployed his forces to flank the Rebels."}, {"tag": "p", "text": "The Rebel troopers regained their ground and engaged the stormtroopers in firefights throughout the jungle. After fighting through the Rebel forces, Tantor rescued Colonel Veers and then extracted his forces, leaving a destroyed Rebel outpost in his wake."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Rebellion continued to occupy its posts on Yavin 4, though it would lose much of the base in the subsequent battles. Tantor would move onto other battlefronts, and Veers would spearhead the production of the All Terrain Armored Transport."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This rescue appears in the mission The Trap at Yavin IV in the video game Star Wars: Force Commander features Veers just prior to his promotion to General and establishes his presence on the Death Star during the Battle of Yavin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}