{"url": "Rescue_of_Marg_Krim%27s_family", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of Mustafar", "Category:Events during the Clone Wars"], "nodes": [{"tag": "h1", "text": "Rescue of Marg Krim's family"}, {"tag": "p", "text": "During the Clone Wars, Asajj Ventress and Quinlan Vos rescued the family of Marg Krim, the new head of the Pyke Syndicate, from Black Sun captivity on Mustafar. The Black Sun's leader Master Ziton Moj had kidnapped Krim's family after Krim had rejected an offer to combine the Pyke Syndicate with the Black Sun. Unable to rely on his own men, Krim hired two bounty hunters—the Nightsister and Dooku's former Sith apprentice Asajj Ventress and the undercover Jedi Master Quinlan Vos—to rescue his family. Ventress and Vos traveled to Mustafar where they managed to rescue Krim's wife Tezzka Krim and their two children Laalee and Vram after accosting Ziton and his men. They managed to reunite Krim with his family but the Black Sun retaliated by attacking the Pyke Syndicate's stronghold on Oba Diah."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Clone Wars, the Pyke Syndicate was a crime syndicate based on the Pyke homeworld of Oba Diah that specialized in the distribution of various types of illegal spice. Eventually, the Pyke Syndicate came into conflict with the Black Sun, a larger and more well-established crime syndicate. When Marg Krim, the new head of the Pyke Syndicate, rejected an offer from the Black Sun's leader Ziton Moj to merge their two crime syndicates, Moj arranged for the kidnapping of Krim's wife Tezzka and their two children Laalee and Vram. Unable to rely on his own men to rescue his family, Krim hired the services of two bounty hunters: Asajj Ventress and her partner Quinlan Vos."}, {"tag": "p", "text": "Asajj Ventress was a Force-sensitive Dathomiri woman who had once been Count Dooku's Sith apprentice and a Nightsister before embarking on a career as a bounty hunter. Quinlan Vos was a Jedi Master who had agreed to take part in an undercover mission to assassinate Dooku in an attempt to bring a speedy end to the Clone Wars. Posing as a bounty hunter, Vos had partnered up with Ventress in order to gain her trust. However, he did his best to keep his true identity and Force powers a secret. After doing several jobs together, Ventress was contacted by Krim's associates while visiting Coruscant's Level 1313."}, {"tag": "p", "text": "Together, Ventress and Vos traveled to Krim's palace on where the crime lord pleaded with the bounty hunters to rescue his family. He also stressed that he wanted to teach both Black Sun and his own men that Marg Krim was still a powerful member of the Pyke Family. Krim expressed his fears that several of his underlings wanted his family to die because that meant that they did not have to join the Black Sun. The Black Sun was imprisoning Krim's family at Ziton's fortress on the volcanic world of Mustafar."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Upon landing on Mustafar, Ventress and Vos parked their starship, the Banshee on a landing platform at the edge of a mining town, which overlooked a molten river. After renting two lava fleas from a Mustafarian, the two made their way to a bar called The Last Resort. While frequenting the bar, Ventress and Vos spotted a group of Falleen Black Sun guards, who stood out from the miners who made up the bar's main clientele. Working together, Ventress flirted with one of the Falleen guards and lured him into the restroom."}, {"tag": "p", "text": "There, Ventress and Vos overpowered him and forced him to reveal the location of the Pyke hostages. After Ventress twisted his arm, the Falleen man revealed that they were in the main holding cell of the \"house\" in the Black Sun Fortress. This cell was located on the upper level and left-hand side of the building. He also revealed that the doors were rigged with defense and that the facility was guarded by twelve guards all the time. Having served his usefulness, Vos knocked him unconscious and dumped him in the last toilet stall."}, {"tag": "h3", "text": "Rescuing Laalee and Vram"}, {"tag": "p", "text": "Together, Ventress and Vos made their way to the Black Sun fortress, which towered over the mining facility and housing below. The \"house\" mentioned by the Falleen guard was perched atop a massive tower that served as the main centerpiece of the fortress. The two bounty hunters made their way to the outskirts of the fortress where they took up position on a storage building. While the fortress seemed impregnable, Vos managed to spot an unguarded overhanging balcony in the \"house\"."}, {"tag": "p", "text": "To reach the balcony, Vos fired a liquid cable launcher while Ventress fired up her own plasma cable. After scaling the tower, the two bounty hunters landed on the balcony which was adjacent to the main cell. Inside, they encountered Vram and Laalee, who were delighted to meet their rescuers. However, their mother Tezzka was not found in the room. Shortly later, the Black Sun guards raised the alarm and several Falleen guards began racing to the room. Cornered, Vos and Ventress decided to escape through the same way that they had come up."}, {"tag": "p", "text": "Using the Force, Vos signaled for their lava flea steeds to meet them at the storage building. After securing the two children on their backs, Ventress and Vos made their way down by using their Force powers to leap over several building structures. Ventress and Laalee managed to land safely on their lava flea. However, a blaster bolt hit Vos, causing Vram to jerk and miscalculate his jump. Vos managed to used his Force powers to land on a rock and then used the Force to levitate the boy before he could fall into a lava flow. Having safely rescued Vram and Laalee, the two hunters made their way back to the Banshee on their lava fleas."}, {"tag": "p", "text": "Back at the Banshee, Ventress tended to Vos' burnt injuries with a medpac. While Vos brushed it off as a minor wound, Ventress insisted on sterilizing the wound and applying bacta-treated bandages. To complete their mission, the two bounty hunters now had to find Laalee and Vram's mother Tezzka. After Laalee handed Vos a small locket containing a miniature hologram of her mother, Vos was able to use his psychometric powers to deduced that Zito was keeping Tezzka within his palace in the fortress. Vos shared this information with Ventress, who questioned how he had obtained this information."}, {"tag": "h3", "text": "Rescuing Tezzka"}, {"tag": "p", "text": "After securing Laalee and Vram to containment chairs, the two bounty hunters embarked fifteen minutes later on their mission to rescue Tezzka Krim. While Ventress kept Moj and his entourage busy, Vos would go to find the children's mother in Ziton's fortress. Their rescue mission was timely because Ziton had just learned about the children's rescue and had issued orders to his henchman Kurg Utal to execute Tezzka. Before Utal could carry out his orders, his head guard brought in Ventress, who claimed to be an envoy from the Pyke Syndicate sent to negotiate the hostages' release."}, {"tag": "p", "text": "When Ziton inquired about her offer, Ventress demanded that she get to see the children and Tezzka first in order to ascertain whether they were alive. Ziton offered to show his wife but claimed that the children had to \"wait\" first. Ziton instructed Utal to bring Tezzka but whispered that he planned to behead her in front of the envoy to send a warning to Krim. He also hinted that the envoy would be next. After Utal had left to fetch Tezzka, Ziton confronted Ventress and recognized her as one of the intruders who had taken the children. Ventress rebuffed his claims and insisted on getting back to business."}, {"tag": "p", "text": "Before they could continue, Tezzka entered the room with Vos beside her. Ziton attempted to reach for his weapon but the \"stranger\" shot it out of his hand. Ventress then killed one of Ziton's Falleen guards and snapped the arm of another. Ziton's guards fired on Vos but all of their blaster bolts missed the intruder. Ziton, who was well-versed in martial arts, then fought with Vos but he was unable to match the prowess of the Force-user. After Ventress knocked Ziton to the ground, she used the Force to Force choke the Black Sun crime lord before warning him not to threaten Krim's family again. Vos, Ventress, and Tezzka then took the opportunity to flee aboard Ventress' starship which had been parked within the fortress' grounds. Ziton and his henchmen attempted to shoot down the Banshee but were unsuccessful."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Having completed their mission to rescue Krim's wife and children, Ventress and Vos traveled back to Oba Diah where they reunited the crime lord with his family. During the journey, Vos befriended the children who begged him to stay with them on Oba Diah, a request which he declined. As a reward for bringing his family home safely, Krim paid them double the amount he had initially offered. The two bounty hunters shared the reward among themselves."}, {"tag": "p", "text": "While departing Oba Diah on the Banshee, Ventress and Vos caught sight of a Black Sun fleet of starfighters and Interceptor-class frigates emerging from hyperspace. The two hunters quickly realized that Black Sun had come to settle scores with the Krims. Unable to aid the Krims, Vos and Ventress fled into hyperspace. Vos' guilt at his inability to protect Krim's wife and children led him to reveal his Jedi identity and true mission to Ventress. Asajj agreed to assist Vos in his mission due to her hatred for Dooku but insisted that he would only be able to overcome Dooku by training in the ways of the dark side of the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}