{"url": "Rescue_of_Attichitcuk", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Alaris Prime colonial war"], "nodes": [{"tag": "h1", "text": "Rescue of Attichitcuk"}, {"tag": "p", "text": "Between 39 BBY and 36 BBY, the Wookiee colonists of the moon Alaris Prime rescued their chieftain, Attichitcuk, from the droid forces of the Trade Federation. At the time, the Wookiees were in competition with the Trade Federation for possession of Alaris Prime, and Attichitcuk had been injured and left for dead in an encounter with enemy Battle Droid Beta Versions."}, {"tag": "p", "text": "Guided by Jedi Master Qui-Gon Jinn, Attichitcuk's son, Chewbacca, led a party of bowcaster troopers from a base to save his father, destroying battle droids commanded by DRN-38 along the way. After locating and reviving Attichitcuk, the party returned to the base and destroyed yet more droids, including three droidekas. Chewbacca then became leader of the colonists while his father recovered."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Preparations for war"}, {"tag": "p", "text": "Between 39 BBY and 36 BBY, having been granted the colonial rights to the moon Alaris Prime by the Senate of the Galactic Republic, the Wookiee Chieftain Attichitcuk led a colonization force consisting of other members of his species to settle their new home. After arriving on Alaris Prime, a group of Wookiee bowcaster troopers led by Attichitcuk's son, Chewbacca, encountered and destroyed a group of Battle Droid Beta Versions from the Trade Federation, which illegally sought to take control of the moon."}, {"tag": "p", "text": "To prepare for further conflict with the Trade Federation Droid Army, Attichitcuk undertook a scouting mission along with two other Wookiees to uncover the extent of their enemy's activities. Meanwhile, Master Qui-Gon Jinn, a representative of the Jedi Order who served as a guide to the colonists, had Chewbacca work on training bowcaster troopers at a base."}, {"tag": "h3", "text": "A chieftain in need"}, {"tag": "p", "text": "Having found several battle droids in the area, all under the command of DRN-38, Attichitcuk headed for the base, but he was stopped in his path by another group of droids, who demanded his surrender. When the chieftain refused, the droids killed his companions, wounding Attichitcuk and leaving him for dead."}, {"tag": "p", "text": "Through use of the Force, Jinn sensed that Attichitcuk survived his injuries. Jinn encouraged Chewbacca to stay calm, and he advised the Wookiees to train more warriors and to construct a medical droid. Once ten bowcaster troopers were suitably prepared, Jinn instructed Chewbacca, who wielded his own bowcaster, to assemble his troops and the medical droid at a set of markers at the edge of the base, launching the rescue mission from there. Meanwhile, more troopers were being trained at the base in order to keep it defended."}, {"tag": "h2", "text": "The rescue"}, {"tag": "p", "text": "While Jinn instructed the eleven Wookiees to stay close and anticipate danger, the party moved northwest, coming to the ford of a river, where three E-5 blaster rifle-wielding Battle Droid Beta Versions were stationed. The Wookiees destroyed the droids but sustained injuries in the fight. On Jinn's advice, the party stopped to heal with the help of the medical droid before venturing onward."}, {"tag": "p", "text": "The Wookiees defeated four more droids on the other side of the river and eventually found Attichitcuk lying wounded on the ground. The Wookiee medical droid healed the chieftain to the point that he could make the trip to safety with Chewbacca's party. In the meantime, a fresh squad of at least two bowcaster troopers departed from the base, following the direction of the first party and intending to reinforce that group."}, {"tag": "p", "text": "As Chewbacca's party headed back to the base, a group of six Battle Droid Beta Versions engaged them on the southern side of the river, but the arrival of the Wookiee reinforcements resulted in a swift destruction of the droids. After the Wookiees returned to the base, Jinn recommended that Attichitcuk enter the base's command center for protection, sensing that another attack was coming. Three droidekas, a stronger type of battle droid, were sent by DRN-38 to attack the base, but that attack was also repelled by Chewbacca and the Wookiees."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Safely recovering from his injuries, Attichitcuk stepped down as the leader of the colonists, with Chewbacca taking his place. With Jinn's help, the Wookiees orchestrated two attacks: one on a Trade Federation outpost and another on a listening array. Attichitcuk had fully recovered by the time of the climactic Battle for Alaris Prime, in which the Trade Federation was driven off the moon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rescue of Attichitcuk appears in the 2001 video game Star Wars: Galactic Battlegrounds, developed by Ensemble Studios and released by LucasArts. It features as the fourth level of the Wookiee tutorial campaign, entitled \"Researching Technology,\" where the player is tasked with saving Attichitcuk in order to complete the level. The player has control over how many troopers to send into the battle and will lose immediately if either Chewbacca or Attichitcuk are killed."}, {"tag": "p", "text": "The appearance of the droidekas in the level is a scripted event, only occurring after Attichitcuk has been garrisoned. A minor discrepancy exists between the accompanying Prima Games strategy guide and the game itself, with the strategy guide stating that five battle droids are present on the other side of the river when the player first crosses it, while only four are present in the game. This article treats the game as the correct version of events."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}