{"url": "Rescue_at_Mon_Calamari", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Dac", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Rescue at Mon Calamari"}, {"tag": "p", "text": "The Rescue at Mon Calamari was a Rebel Alliance mission to free Mon Calamari slaves being transported to an Imperial Star Destroyer. Alliance Intelligence learned of a secret rendezvous between a convoy of freighters and container carrying tugs transporting Mon Calamari slaves and materiél to the Star Destroyer Warrior at the planet Mon Calamari."}, {"tag": "p", "text": "The Rebel X-wings of Red Squadron were sent to destroy the convoy's TIE/LN starfighter escorts and identify the freighters' cargo. Gold Squadron's Y-wings would disable the vessels carrying the slaves, after which the freighters Citadel 1 and Citadel 2 would dock with them. The whole operation was planned to be completed before the Warrior arrived."}, {"tag": "p", "text": "After the ships arrived at Mon Calamari, fighter pilot Halley Kadorto used his sensors to identify which freighter and container carried the slaves. Red Squadron caught the defending TIE starfighters out of position and they initially proved easy to keep away from the freighters. The mission was going according to plan until the Warrior arrived earlier than expected. Hoping to thwart the rescue, the ship's commander sent TIE Fighters to destroy the freighters with the slaves still inside. The X-wings were now outnumbered almost three to one and the TIEs were too numerous to contain."}, {"tag": "p", "text": "Kadorto approached Warrior to engage the incoming TIEs. Though he called for assistance, his wingmates were all engaged and he was forced to work alone. Kadorto held off the attack by destroying wave-after-wave of TIEs until the rescue was finally completed and reinforcements arrived."}, {"tag": "p", "text": "The mission was successful and Kadorto received the Kalidor Crescent for his heroism. The incident was ported into a simulated exercise for Rebel pilots and made Kadorto famous. The rescue went a long way to persuading the Mon Calamari to join the Rebel Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: X-Wing, where this mission is recreated in the historical simulator, the TIE bombers attacking the slave freighters do no damage to them because they are friendly targets. For the mission to have worked properly, the slave vessels should have been set to neutral faction."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}