{"url": "Rescue_of_Admiral_Ackbar", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles in the Bakura sector", "Category:Missions of the Cold War"], "nodes": [{"tag": "h1", "text": "Rescue of Admiral Ackbar"}, {"tag": "p", "text": "Thirty years after the Battle of Endor, the Resistance staged the rescue of Admiral Ackbar during the Cold War. The Resistance sent pilot Commander Poe Dameron along with the droids C-3PO and BB-8 to rescue Admiral Gial Ackbar from the First Order Resurgent-class Star Destroyer Subjugator where Ackbar was being held hostage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to rescue Admiral Ackbar was first made canon in the 2016 comic Star Wars Special: C-3PO 1."}, {"tag": "h3", "text": "Non-canon storylines"}, {"tag": "p", "text": "The mission to rescue Admiral Ackbar made its first appearance in the 2016 LEGO Star Wars: The Resistance Rises episode Poe to the Rescue where it depicted that Admiral Ackbar was being held captive by Captain Phasma onboard the Resurgent-class Star Destroyer Subjugator in the Bakura sector."}, {"tag": "p", "text": "Using a stolen AAL-1971/9.1 Troop Transport, Poe Dameron, C-3PO and BB-8 snuck onboard the Subjugator and was able rescue Admiral Ackbar. While escaping the Subjugator they were pursued by several TIE fighters."}, {"tag": "p", "text": "They later went into an asteroid field where they ducked behind an asteroid where Dameron had hidden his T-70 X-wing starfighter Black One and Ackbar's Delta-7B Aethersprite-class light interceptor Daisy Mae. They used the Atmospheric Assault Lander as a decoy and using their fighters were able to destroy the TIE fighters that had followed them. They later headed back to the Resistance base on D'Qar."}, {"tag": "p", "text": "The mission is available to play as a downloadable content in the 2016 Video game LEGO Star Wars: The Force Awakens also entitled Poe to the Rescue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}