{"url": "Rescue_of_Garm_Bel_Iblis", "categories": ["Category:Legends articles", "Category:Battles of the Great Jedi Purge"], "nodes": [{"tag": "h1", "text": "Rescue of Garm Bel Iblis"}, {"tag": "p", "text": "The Rescue of Garm Bel Iblis was a mission undertaken by Galen Marek and involved finding Garm Bel Iblis, in order to found the Rebel Alliance."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In order to gather a powerful ally to the Rebellion, Galen Marek traveled to Cloud City, where he heard that Senator Garm Bel Iblis was located. With his assistance, along with Bail Organa's, there would be enough people to help in the creation of a resistance against the Galactic Empire's rule."}, {"tag": "p", "text": "To this end, Marek took the Rogue Shadow to Bespin in order to find the senator, who was openly vocal of his opposition of Emperor Palpatine's rule."}, {"tag": "h2", "text": "The search"}, {"tag": "p", "text": "Upon reaching Cloud City, which was still under construction at the time, Marek encountered the administrator of the floating platform, Lobot. He informed the cyborg that master Rahm Kota had sent him to meet with the senator. However, Lobot informed him that the senator was unavailable being occupied with negotiations with a criminal gang led by Chop'aa Notimo, whose mercenaries were assaulting the city."}, {"tag": "p", "text": "After learning this, Marek updated Kota of the development and plunged deep into the city to find Bel Iblis. On his journey, he came into conflict with Chop'aa's gang members, which included a number of Mandalorian bounty hunters. He found one of Notimo's transport flyers at a platform deploying more men into the city, but these were swiftly dispatched by Marek and the gunship transport itself was destroyed in the fight."}, {"tag": "p", "text": "Once this was done, Lobot arrived and informed Galen that the senator was willing to see him now, and was told to meet him at the concourse. However, once Marek arrived at the location, he was ambushed by more Mandalorian warriors wearing jetpacks. After dispatching them, Lobot found him and informed him that the senator was being held captive by Chop'aa's bounty hunters."}, {"tag": "h2", "text": "Saving Bel Iblis"}, {"tag": "p", "text": "Upon updating Kota of the new discovery, Marek went in search of the Senator's captor, the bounty hunter Kleef. Galen traveled through Cloud City to find Kleef and encountered the Gungan repairing his H-TFU droids. Starkiller asked the bounty hunter about his latest acquisition, to which Kleef chuckled and agreed that he captured the senator, but that he was now with Chop'aa, at which point, the Force user ignited his lightsaber. Kleef's twin droids approached immediately after, surrounding Marek. Kleef stated that he was always prepared and that Marek was going to die. However, after disarming the Gungan, he used a Force grip to send Kleef flying through a window. Held in the air above the city, Kleef was dropped toward the ground, bouncing off of passing vehicles as he fell. Marek then commented sarcastically \"Weren't prepared for that, were you?\"."}, {"tag": "p", "text": "With the bounty hunter down, Marek informed the others to prepare the Rogue Shadow in case he needed a quick exit as he was going to free the senator from Chop'aa. With this completed, he made his way to another tower fighting more of Notimo's gang before entering into a tunnel that led into a large chamber, where he found Chop'aa with Senator Bel Iblis. He called out to Marek saying that he was hoping he would come, and informed Garm that the talks had failed. Calling a number of his fellow Mandalorian warriors, he declared the negotiations over before sending his men against Marek."}, {"tag": "p", "text": "After killing the two Mandalorian bodyguards equipped with jetpacks, Starkiller was ready to fight Notimo himself. However, the Mandalorian used his helmet comm to summon his Basilisk war droid. Mounting the war machine, Chop'aa fought Marek and after a long battle the droid was defeated when Galen used the Force to rip in half, then send it crashing into the ground. From the flames, Notimo's helmet rolled out and he came charging at Starkiller ready to kill him. After another lengthy battle, Galen killed Chop'aa, inflicting numerous fatal wounds with his lightsaber."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With Chop'aa dead, Starkiller came before Bel Iblis and told him that he was safe at which point Lobot along with Cloud City security came rushing in to aid the senator who thanked him. Galen attempted to inform Garm that Rahm Kota sent him, but Bel Iblis was already aware of this and knew of his plans for a rebellion. When Starkiller asked the senator if he was with them, Garm replied that he had spoken out against the Emperor too many times, which resulted in Palpatine issuing death warrants against him and his family. He then said that he was of course going to join Marek and told him to meet him with Bail Organa in order to discuss their next move. Garm told Starkiller to inform Kota that he would contact him soon."}, {"tag": "h2", "text": "Appearances"}]}