{"url": "Rescue_of_Bastila_Shan", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Missions of the Jedi Civil War"], "nodes": [{"tag": "h1", "text": "Rescue of Bastila Shan"}, {"tag": "p", "text": "Bastila Shan was rescued as part of a compulsory mission during the Jedi Civil War that was thrust upon Revan and Carth Onasi due to the attack on the Republic cruiser Endar Spire. Shan was a Jedi in command of the Endar Spire with Onasi, a former pilot, acting as an advisor. Revan—at the time of the attack was unaware of his history as former Dark Lord of the Sith—was also stationed on the vessel as a common soldier. During the attack, Shan's lifepod vanished somewhere on the surface of Taris. After crashing in the Tarisian Upper City themselves—and knowing the importance of Shan to the Republic war effort—Revan and Onasi sought to find her. Eventually, the pair traveled into the Lower City, where they met the young Twi'lek Mission Vao, and her partner, the Wookiee Zaalbar. Through this encounter, Revan and Onasi were directed to the Hidden Bek Base and spoke with the leader of the Hidden Beks swoop gang, Gadon Thek. Thek informed the pair that Shan had been captured by the Black Vulkars, a rival swoop gang led by Brejik, and was being held as prisoner. He added that the Human gang leader, once Thek's protegé, planned to offer Shan as the prize for the Tarisian Season Opener, the first major swoop race of the season."}, {"tag": "p", "text": "Gadon Thek offered Revan the chance to race in the Season Opener—thereby winning Shan's freedom—if he retrieved a prototype accelerator that the Vulkars had stolen. Accepting the deal, Revan and Onasi proceeded into the Undercity to enter the Black Vulkar Base. Thek suggested that Vao be of service due to her advanced knowledge of the Undercity sewers. She agreed to assist Revan if Zaalbar, who had been recently captured, could be rescued from Gamorrean slavers. Revan agreed to the barter, and the trio proceeded into the sewers. After freeing Zaalbar, Vao helped Revan get into the Black Vulkar base, where the party found the prototype accelerator, but a firefight ensued to acquire it. Successful, the party returned the engine to Gadon Thek and Revan was allowed to compete in the Season Opener. After Revan won the race, Brejik called foul and claimed that the prize would not be given over to the winner. Brejik and his comrades then initiated a brawl, but were defeated by Revan and Shan."}, {"tag": "p", "text": "Due to his newly acquired fame, Revan was approached by Canderous Ordo about fleeing Taris. If Revan could steal the blockade codes from the Sith Military Base, then Ordo would provide a ship to leave the planet. Revan agreed, but needed assistance in breaching the security system of the base. Ordo told Revan to acquire T3-M4 from Janice Nall at his request and, with the droid's help, Revan broke into the base and stole the launch codes after a duel with the Force-sensitive Sith Governor. With the codes in hand, Revan and Ordo proceeded to the estate of crime lord Davik Kang to steal his flagship, the Ebon Hawk. Revan and his team commandeered the ship and, having successfully rescued Bastila Shan, fled the planet surface as the Destruction of Taris commenced."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In an attempt to gain the upper hand in the war against the Republic, Darth Malak, Dark Lord of the Sith and head of the Sith Empire, launched a pursuit of the Jedi Bastila Shan. Malak feared Shan's power of battle meditation, which had been used to help the Republic successfully fight back against the Sith. Eventually, the Dark Lord of the Sith tracked the young Jedi aboard the Republic Navy's Hammerhead-class cruiser Endar Spire, which she commanded. An attack was launched against the vessel over the planet Taris in an attempt to capture the Jedi, but Shan managed to escape the Endar Spire. The lifepods that were jettisoned from the ship, one of which contained Shan, crashed onto the surface of Taris—many falling deep into the Tarisian Undercity. During her pod's respective crash, Shan was incapacitated and lost her lightsaber. As a result, she was apprehended by the Black Vulkars, a swoop gang of the Lower City."}, {"tag": "p", "text": "During the waning moments of the attack on the Endar Spire, an amnesiac Revan—believing himself to be a simple Republic soldier—was contacted by Carth Onasi via communicator. Onasi, a former Republic pilot who was acting as an advisor aboard the Endar Spire, guided Revan to the ship's lifepods. After they met up, Onasi and Revan boarded an escape pod together and crashed onto the surface, landing in the Upper City with Revan taking injury. Onasi, however, was not badly wounded and pulled Revan from the pod before a Sith inspection team came to retrieve it. While fleeing, Onasi stumbled upon an abandoned apartment and secured it for safe refuge."}, {"tag": "h2", "text": "Mission"}, {"tag": "h3", "text": "Gathering information"}, {"tag": "p", "text": "While Revan remained unconscious, Onasi began to inspect the surroundings and gather some information. He learned that most of the pods had crashed into the Undercity, and speculated that since they had survived, a Jedi such as Bastila Shan could have survived as well. Onasi then surmised that it was imperative they find her in order to continue helping the Republic war effort. Concurrently, Revan—unknowing of his true past identity as the Sith Lord—experienced visions through the Force about the attack, led by Shan, aboard Revan's former flagship. Onasi remarked that Revan had been thrashing about as he slept for a couple of days."}, {"tag": "p", "text": "Agreeing that their situation—being separated from Bastila Shan and marooned on Taris—demanded immediate action, Revan and Onasi set forth from their apartment and began to search for her. Immediately upon exiting their apartment into the main concourse of the complex, the pair encountered a Sith inspection team who were in an argument with Ixgil and another Duros who co-owned the property. Revan's and Onasi's presence, coupled with Ixgil's remarks, caused a scuffle to ensue. During the fight, Ixgil was killed by blaster fire. Revan and Onasi then preceded to defend the other Duros landlord, killing the inspection team. The leaser was grateful and said that he would hide the bodies before other Sith teams arrived. After the encounter with the Sith patrol, Onasi remarked that it would be best to remain discreet and not draw any unnecessary attention to their presence since they were Republic personnel."}, {"tag": "p", "text": "Continuing in their search for more information, Revan and Onasi checked the local cantina and other locations in the Upper City. Eventually, the pair found an elevator to the Lower City, which was guarded. The elevator guard informed them that only Sith were allowed to use the elevator and access the lower levels. Realizing the need for a disguise, Revan and Onasi continued their search through the Upper City."}, {"tag": "p", "text": "In the North Apartments of the Upper City, the pair stumbled upon a Sith interrogation of an Aqualish black market dealer. A Sith guard tried to usher Revan and Onasi along, but the pair stopped and tried to defend the unarmed dealer. The other Sith interrogators where none too pleased by this development, and another fight ensued. After Revan and Onasi defended the Aqualish by defeating the Sith investigators, it came to light that the dealer had been in the process of acquiring Sith armor on behalf of the Hidden Beks, a Lower City swoop gang, so that the Beks could move between levels about without being stopped. The Aqualish was unable to provide Revan with armor, but encouraged him to steal from the bodies of the deceased inspectors. As the dealer fled the scene to go incognito, the pair took the armor off of one of the bodies. With Sith armor as a disguise, Revan and Onasi were granted access to the Lower City via the guarded elevator."}, {"tag": "h3", "text": "Rescuing Bastila Shan"}, {"tag": "h4", "text": "Alliance in the Lower City"}, {"tag": "p", "text": "The disguise worked as Revan and Onasi had planned: the elevator guard was convinced that Revan was a Sith soldier sent to patrol the Lower City. After taking the elevator down to the Lower City, the pair was ambushed by members of the Black Vulkar gang. After dispensing with the attackers, they made their way into Javyar's Cantina, a haven for a variety of individuals, including bounty hunters, pazaak players, gang members, entertainers, and other citizens. Among the regular patrons that Revan and Onasi encountered was Mission Vao, a Rutian Twi'lek and native of Taris, and her partner, the Wookiee Zaalbar. The bubbly Twi'lek viewed herself as Revan's and Onasi's \"welcome party\" to Taris, and proceeded to answer all of their questions. As the conversation wound to a close, Vao decided it was time to leave. As Zaalbar had not finished eating, Vao suggested they see what food they could get at the Hidden Bek Base and departed. Revan and Onasi later followed suit and headed over to the base as well."}, {"tag": "p", "text": "Inside the Hidden Bek Base, Revan and Onasi approached Gadon Thek, the swoop gang leader. After being abruptly introduced to the jumpy Twi'lek Zaerdra, Thek's bodyguard, Thek was willing to strike a deal to help the pair in their pursuit of Bastila Shan. Thek revealed that she had been captured by the Black Vulkars and had been placed as the prize in the annual season-opening swoop race by their leader, Brejik. In order to rescue Shan, Thek surmised, Revan would have to win the swoop race and claim his prize. Thek offered Revan the chance to run in the race on behalf of, and sponsored by, the Hidden Beks, if he could retrieve a prototype accelerator that had been stolen by Vulkar gang members. Access to the Black Vulkar Base was restricted and the only way in was through the Undercity sewers. Thek suggested that Mission Vao lead Revan through the sewers, stating that she knew every inch of them better than anyone else. Vao and Zaalbar, however, had just recently left to do more exploring in the Undercity. Thek suggested that Revan and Onasi catch up with them there. Access to the Undercity was restricted to all individuals unless they had the proper security papers. Unlike the guard in the Upper City, a simple disguise was not sufficient to gain them access. In an exchange, Thek gave Revan the proper security papers that had been swiped from a Sith patrol in exchange for the Sith armor that he used initially. With the proper security papers in hand, Revan and Onasi proceeded to the elevator that led to the Undercity."}, {"tag": "h4", "text": "Rakghouls and Gamorreans"}, {"tag": "p", "text": "Upon exiting the elevator to the Undercity, Revan and Onasi were approached by two men, who demanded that they pay a five-credit toll for using the elevator. An Outcast woman named Shaleena, however, came rushing to the elevator to scatter the panhandlers. Shaleena informed the exploring pair of Gendar, the Outcasts' leader, and suggested speaking with him. The Outcasts, according to Gendar, were the descendants of those who were exiled from the Upper City for crimes against the people. They were plagued by the rakghouls and other marauders such as swoop gang members from the Lower City who came through to scavenge remains. They were kept safe from the rakghouls by a large gate on the northeast side of their village. Revan then asked Gendar if he knew of Mission Vao. He replied affirmatively, but only that she usually went into the sewers to explore. He then pointed the pair into the direction of the sewer entrances."}, {"tag": "p", "text": "Upon leaving the Outcast village through the main gate, Revan and Onasi were immediately attacked by rakghouls. They had to fend off numerous attacks as they approached the sewers. While working their way through the rakghoul-laden region, Mission Vao appeared, running toward the pair and pleading for help. Zaalbar had been captured by Gamorrean slavers, but Vao had escaped. Revan and the young Twi'lek came to an agreement that Vao would help the pair get into the Black Vulkar Base if Revan would help rescue Zaalbar. With this agreement, the trio entered into the Lower City sewers."}, {"tag": "p", "text": "Immediately upon entering into the sewers, Revan, Onasi, and Vao encountered a few Gamorrean raiders. The Gamorreans had patrols and warriors stationed throughout the sewers and as the trio searched for Zaalbar, they continued to face more and more of the slavers. Eventually, Zaalbar was found and, after the trio defeated the Gamorrean chieftain, freed. In an act of gratitude, Zaalbar pledged a life debt to Revan, one of the highest honors in the Wookiee culture. With Zaalbar promising to be at Revan's side, his Twi'lek companion also pledged her support to Revan, as well as agreeing to uphold her promise to help get him into the Black Vulkar Base. In order to lead him there, however, Vao had to open a force field that was blocking passage into the depths of the sewers."}, {"tag": "h4", "text": "Incursion into the Black Vulkar Base"}, {"tag": "p", "text": "As Revan's party was led by Mission Vao into the depths of the sewers, the team continuously encountered more rakghouls and Gamorrean slavers. Eventually they were able to fight their way to the entrance of the Black Vulkar base, which was blocked by a rancor that had taken lair in the sewers. Vao remarked that she had been able to sneak by it before using stealth techniques. Revan and his party, using the input and advice from their team and surroundings, slew the rancor and opened the entrance to the swoop gang's base. Inside the immediate entrance area were two Nikto guards, whom Revan defeated before entering the base."}, {"tag": "p", "text": "Inside the Black Vulkar base, Revan and his party began to scope out the location of the prototype accelerator. The party attempted to access the garage, but it was guarded by gun turrets. Needing to find the controls, the party proceeded to further search the base. Throughout the base, however, there were numerous patrol droids and other gang members who attacked Revan on sight. He eventually accessed the main control terminal and disabled the turrets. With the way clear, the party entered the garage still looking for the accelerator."}, {"tag": "p", "text": "The search for the prototype accelerator came to a climax inside the garage. The engine was heavily guarded by Vulkar enforcer Kandon Ark and three of his bodyguards. Ark initially taunted Revan and Mission Vao, urging them to kill Gadon Thek and join the Black Vulkars. As further incentive to scheme against Thek, Ark promised that Revan could compete in the Season Opener and be awarded 500 credits. Revan refused, and a skirmish ensued; Revan and his party eventually defeated Ark and his bodyguards, taking the prototype accelerator upon leaving. With the engine in hand, they returned to the Hidden Bek Base and returned the loot to Thek."}, {"tag": "h4", "text": "Swoop bikes, blasters, and vibroblades"}, {"tag": "p", "text": "Gadon Thek kept his word to Revan. Upon the return of the prototype accelerator, Thek sponsored Revan in the race. Thek noted that the engine was only a prototype and not entirely stable. On the one hand, if the engine malfunctioned, the swoop would explode and kill the racer. On the other hand, the engine promised to increase the speed of the vessel during the race. With Revan as a participant, the gang leader decided to protect his regular racers from possible injury and have Revan race with the prototype in his swoop bike. After a night of rest, Revan was taken to the track to register. Upon meeting with the registrar and his mechanic, Revan began learning how to run a swoop. He picked up the skill quickly, however, and had a successful first run. His time was not the fastest, having been surpassed by the heralded Black Vulkar Redros, and he had to compete again. Revan would turn in the best time by race's end, defeating Redros and Anglu, a Hidden Bek Twi'lek racer."}, {"tag": "p", "text": "The prize for winning the race was for the winner to take Bastila Shan as his or her personal slave. Brejik, however, protested and refused to turn the unconscious Jedi over to Revan. In fact, Brejik was still unaware that Shan was a Jedi. Releasing herself from a neural suppressing restraint supposedly keeping her incapacitated at that instant, Shan attempted to free herself from the cage in which she was being held. Realizing Shan as a Jedi, a fight ensued, with all nearby members of the Black Vulkars battling Revan and the now alert Shan. The gang members attacked the pair with blasters, vibroblades, and bare hands. The two fought through the onslaught, and defeated all those who stood against them. Included in the death-toll were Redros and Brejik."}, {"tag": "p", "text": "The first primary objective—finding Bastila Shan and retrieving her from the swoop gang—had seemingly been accomplished. Shan, however, was spiteful of Revan and refused to acknowledge that he had come to rescue her. She scolded him, saying that the entire endeavor was a poor attempt at a rescue. When Revan mentioned that Carth Onasi was still alive, however, she apologized for her initial response, believing she may have misjudged him if Onasi was confident in Revan's abilities, and immediately shifted her attention to meeting with Onasi in order to leave the planet. The two proceeded back to the Upper City apartment, where they met with Onasi and began to discuss how to escape the Sith blockade around Taris."}, {"tag": "h3", "text": "Escape"}, {"tag": "h4", "text": "Unlikely alliance"}, {"tag": "p", "text": "Revan, Onasi, and Shan needed a viable plan for escaping Taris. Having come only to the consensus to keep searching, the party left the apartment looking for a way off the planet. Upon leaving the apartment, Revan was approached by a Twi'lek messenger sent by Mandalorian mercenary Canderous Ordo. Ordo requested that Revan meet him in Javyar's Cantina, for he had an offer that Revan \"couldn't refuse.\" Revan traveled to the Lower City cantina and met with the mercenary. Impressed with Revan's victory in the Season Opener and the ensuing skirmish, the Mandalorian thought the soldier was a perfect fit for his own goal of fleeing Taris. Ordo said that he could provide a ship to leave the planet if Revan could provide the blockade codes from the Sith Military Base. Due to the blockade of Taris, any vessel without the proper clearance codes would not be allowed to leave the Tarisian system. According to the mercenary, once the codes were brought to him, Revan and his team would be able to use the flagship of crime lord Davik Kang, the Ebon Hawk, as a means of escaping the planet. Further explaining the plan, Ordo mentioned that the Sith Base had a special security system that would require an astromech droid to unlock and open. The Mandalorian told Revan to speak to Janice Nall, a Twi'lek droid builder in the Upper City, and to say that Canderous Ordo had sent him. By mentioning Ordo's name, the mercenary assumed that Revan would be able to easily acquire the pre-ordered droid from Nall. This droid had originally been ordered by Kang and was available for pickup. Seeing no other alternative, Revan agreed to the scheme and departed the cantina."}, {"tag": "p", "text": "Revan proceeded to Janice Nall's droid shop and spoke with her about the astromech droid Ordo mentioned. Telling Nall that Ordo sent him, she agreed to sell the droid to him for 2000 credits. Revan purchased T3-M4 from Nall and proceeded to the military base."}, {"tag": "h4", "text": "Raid on the Military Base"}, {"tag": "p", "text": "T3-M4, the newly purchased astromech droid, used his skills against security systems and opened the main door to the military base. Revan and his team proceeded down the elevator to the main reception area. There, they were abruptly challenged by the receptionist at the front desk. She did not want to fight Revan and agreed to not hit the security alarm if she could freely escape. Revan permitted her and continued deeper into the base. Throughout the base, sentry droids prowled the corridors and Sith soldiers filled the rooms. In one of the scuffles, Revan acquired a Sith ID passcard. A challenging obstacle, however, was stationed in the elevator entranceway. There, a security droid with a formidable shield was stationed. This droid had been recently repaired and was working at full capacity. Earlier that day, the transformer in the elevator was fixed by a technician, causing the glitches within the droid's shield to be eliminated. Nevertheless, Revan and his companions neutralized the repaired shield and destroyed the droid."}, {"tag": "p", "text": "After defeating the droid, Revan used the passcard found in one of the rooms to open the elevator shaft. Stepping out of the elevator, the team stumbled upon the room of the Tarisian Sith Governor. The meditating governor was interrupted by Revan's entrance, but he was further shocked to find that Revan was Force-sensitive. Thinking this would be his chance to earn his lightsaber from his superiors, the dark side adept attacked Revan. Throughout the brawl, the governor used the dark side of the Force to gain an edge over the intruder. Revan overcame his combatant, however. Having defeated the governor, Revan grabbed the launch codes from within the governor's quarters and fled the base."}, {"tag": "h4", "text": "Encounter with the Exchange"}, {"tag": "p", "text": "Revan and his team fled the Sith base and traveled to Javyar's Cantina to meet up with Canderous Ordo, per the prearranged plan. Even before their arrival, word had already reached Ordo that the Sith base had been broken into and raided. Knowing this, he chided Revan upon his arrival, saying that he knew the codes were in Revan's possession. Ordo proposed that he bring Revan to the estate of the Exchange crime lord Davik Kang as a potential recruit. He reasoned that Kang would have Revan stay on the estate grounds while background checks were conducted. During this period of waiting, Ordo suggested to Revan that the team advance toward the Ebon Hawk and flee the planet. Bastila Shan was none-too-thrilled with the plan, for she did not trust Ordo. Acknowledging this, the mercenary responded that he did not like the idea of teaming with them either. Agreeing that no other alternative seemed viable, the uneasy alliance left the cantina and proceeded to Kang's estate."}, {"tag": "p", "text": "Inside Kang's estate, Davik Kang and bounty hunter Calo Nord met Ordo and Revan. At first, Kang and Nord were surprised that Ordo had someone with him. Ordo suggested that Revan would be a worthy recruit for the Exchange due to his exploits thus far; most notably, winning the Tarisian Season Opener. At Ordo's recommendation, Kang agreed to look into the prospect of bringing Revan into the fold of the Exchange. The crimelord then took Revan and his companions on a tour of the estate, showing them most prominently the Ebon Hawk and what Kang referred to as its impregnable security systems. Lastly, they arrived upon a room that was set aside to be Revan's quarters while Kang performed background checks. Kang's instructions to Revan were to not venture beyond the guest area or disturb the other guests. If he or his companions did, the guards would attack and attempt to subdue him. The slave quarters, however, were available if Revan sought food or other amenities."}, {"tag": "p", "text": "Once Kang departed, Canderous Ordo stated that Revan should begin looking for a way to disable the Ebon Hawk's security system and capture the ship. Advancing deep into the estate, he came upon guards and security droids who were stationed throughout. Alerted to his presence, the guards attacked Revan as Kang had stated they would. Revan defeated the guards, however, and used a computer to disable the security systems of the hangar. Nevertheless, Revan still needed the launch codes to the Ebon Hawk. In one of the rooms, two K-X12 probe droids tortured an imprisoned man. Revan destroyed the droids and freed the man, named Hudrow, who had been Davik Kang's pilot for the Ebon Hawk. As gratitude for saving him, Hudrow provided Revan with the launch codes for the ship and fled the base."}, {"tag": "p", "text": "With the launch codes in his datapad, Revan and Ordo proceeded to the hangar. At that moment, explosions were heard and the estate began to crumble. The Sith fleet had begun the process of bombarding the planet from orbit. While inside the hangar, Kang and Nord spotted the pair trying to flee. In the ensuing shootout, Revan and Ordo killed Kang, and part of the hangar collapsed onto Nord. Believing that both men had been defeated, Revan boarded the Ebon Hawk and took off. While the bombardment continued, he picked up his companions in the Upper City and fled the planet's surface."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Once Revan and his team left the surface, they became entangled in the destruction of Taris. Sith fighters attacked the ship as it tried to flee the blockade. After Revan shot a number of the fighters down, Carth Onasi piloted the ship away from Taris. The Ebon Hawk jumped to hyperspace and traveled to the Jedi Enclave on Dantooine. While there, Revan would begin retraining as a Jedi Padawan, and ultimately searched for the Star Forge superweapon the Sith had been using to aid their war effort; he was at this time still unaware of his prior identity as Darth Revan."}, {"tag": "p", "text": "Back on Taris, the planet was bombed extensively, Onasi later remarking that not a building taller than two stories was left standing. Nord managed to survive the devastation, however, and would later team up with Darth Malak in an attempt to kill Revan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Creation and purpose"}, {"tag": "p", "text": "The Rescue of Bastila Shan was a player-controlled mission on Taris that appeared in Star Wars: Knights of the Old Republic. The rescue is a plot-device that formally introduces the characters of Bastila Shan, T3-M4, Mission Vao, and Zaalbar. Additionally, the rescue further acquaints the player with Carth Onasi and his background. Other characters introduced through cut-scenes include Darth Malak and Admiral Saul Karath of the Leviathan. Another purpose of the events on Taris is to further acquaint the player with aspects of the game and to begin offering hints toward Revan's identity. Shan, however, must be rescued for the plot to continue."}, {"tag": "h3", "text": "Gameplay options"}, {"tag": "p", "text": "Personnel used at any given moment in gameplay is fluid, although some party members are required for certain actions. Mission Vao, for example, is required to travel into the Undercity sewers with the player in order to open the force field. T3-M4 is required as a party member to break into the Sith Base and Canderous Ordo must stay as a party member to get into Davik Kang's estate. During each of these missions, the third party member is selectable by the player. While Revan is considered the principal character in gameplay, whomever the player is controlling can dispatch enemies in combat."}, {"tag": "p", "text": "In gameplay, numerous side-quests can be completed concurrent to the main objective of rescuing Shan. These side-quests, such as fighting in the Taris dueling ring or completing some of the Hutt Zax's bounties, can provide a means of more credits. Others, such as assisting Tarisian locals or providing a cure for the Rakghoul plague to Zelka Forn, can sway the character's alignment either light-sided or dark-sided. Similarly, other actions, such as responses to characters, can change an alignment as well. For example, killing Hudrow in Davik Kang's estate after initially saving him gives the player dark side points."}, {"tag": "p", "text": "The mission objective of obtaining the Sith armor can be achieved through an alternative means. While in the cantina, Revan can choose to converse with Sarna—or Yun Genda if the player is female. While conversing with her, she will reject his empathetic comments as being terse. If Revan chooses to continue the conversation, he can flirt with Sarna and be invited to a party in the North Apartments. If he attends, the party-goers pass out due to debauchery with Tarisian ale and their Sith armor is available for confiscation. Other than the ability to converse with Yun Genda instead of Sarna, no other objective is altered if the player chooses to play as a female, rather than the canonical male character."}, {"tag": "p", "text": "Before proceeding to the Undercity sewers, the player has an option to speak to the Outcast Rukil, who asks if Revan was the one chosen to lead the Outcasts to the Promised Land. After explaining the Outcast legend, Rukil then asks Revan to look for his apprentice's journal while he searches the sewers. Completion of this optional side-quest causes the remaining Outcasts to begin their journey to the Promised Land and is part of the light-sided angle of the game."}, {"tag": "p", "text": "The orbital bombardment of Taris is experienced regardless of the player's actions while rescuing Shan. Interpolated scenes are periodically shown during the rescue and escape missions indicating that Darth Malak was preparing to destroy the planet while Shan was being rescued."}, {"tag": "h3", "text": "Tarisian Season Opener"}, {"tag": "p", "text": "In the Tarisian Season Opener, the player has a limited number of heats that can be run. It is possible to complete the challenge in two heats. After the third heat, however, the Hidden Beks's mechanic will inform the player that the temperature of the swoop engine was of concern and that a simple cooling system was added to enable at least one more run. After the fourth heat, the mechanic reroutes the cooling system's power to the accelerator hoping to give the swoop an extra boost. He tells the player that this modification is liable to cause the swoop to eventually explode. If the player does not complete the race within thirty-eight seconds during the fifth heat, the swoop explodes, killing Revan and prematurely ending the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}