{"url": "Rescue_mission_to_Vandos", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles in the Nuiri sector", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Rescue mission to Vandos"}, {"tag": "p", "text": "The rescue mission to Vandos took place in 20 BBY during the Clone Wars. In an attempt to lure several Jedi into a trap on the planet Vandos, Confederate General Grievous kidnapped Anx Ambassador Quiyyen and confined him within a dug-out cave. After learning about the kidnapping, as well as a Confederate invasion fleet arriving in the Vandos system, the Jedi Council sent a rescue team led by Jedi Master T'chooka D'oon to Vandos. During the mission, D'oon was accompanied by his Padawan, Flynn Kybo; Jedi Master Jmmaar; and a group of clone troopers. As they entered the cave, Kybo learned that they had fallen into a trap as they were confronted by Grievous and his super battle droid force. After Kybo rescued the ambassador, D'oon's team prepared to retreat to their landed gunship outside the cave. To give his team more time to board the transport, D'oon attempted to distract Grievous, though the cyborg general quickly slew the Jedi Master. The fallen Jedi Master's team, however, managed to escape Vandos with Quiyyen."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 20 BBY, Confederate General Grievous, a known Jedi hunter during the Clone Wars, established a plan to lure several Jedi into a dug-out cave on the planet Vandos. In order to attract their attention, Grievous kidnapped Republic Ambassador Quiyyen and imprisoned him in the cave. While the Jedi Order was unaware of Grievous' trap, they learned about the kidnapping, as well as information about a Confederate invasion fleet arriving in the Vandos system. In order to rescue the Anx ambassador, the Jedi dispatched Jedi Masters T'chooka D'oon and Jmmaar; D'oon's Padawan, Flynn Kybo; and a group of clone troopers from the Grand Army of the Republic."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Believing that there was indeed an approaching invasion fleet from the Confederate Navy, D'oon's team needed to land on Vandos and rescue Ambassador Quiyyen before it arrived. Once the team landed their LAAT/i gunship near the cave, they left the vessel and—to their surprise—faced a group of super battle droids. Kybo realized that they had fallen into a trap and that Quiyyen was only the bait. Grievous, who was leading the droids, told his battle droid soldiers to not let the Jedi escape alive. During the onslaught, Grievous killed Jmmaar and many clone troopers."}, {"tag": "p", "text": "Kybo, however, found Quiyyen and brought him safely toward the Jedi group. With the Anx ambassador under their guard, the team raced toward their gunship. As they proceeded to board their transport, the super battle droids continued to fire their wrist blasters at the Jedi team. Seeing that his comrades needed more time to board the gunship, D'oon turned his attention to the approaching Grievous and engaged the cyborg general in a lightsaber duel. Kybo watched as Grievous made short work of D'oon with his lightsaber, an event that would stay fresh in Kybo's mind. With the group aboard the gunship, they departed Vandos and headed for the Republic capital planet Coruscant."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the mission, Kybo was present in the Jedi Temple and entered a meeting with the Jedi High Council. Because of the death of his master, as well as many other Jedi, Kybo wanted to seek revenge against Grievous. Instead of military action to target Grievous, Kybo asked Jedi Masters Yoda and Mace Windu if he could organize a small group of Jedi and target the cyborg general, an act that both Windu and Yoda frowned upon. Behind their backs, Kybo disobeyed their advice and sought out Jedi who were interested. That action would later drive Kybo to his death, as he engaged Grievous in a lightsaber duel on the moon Belsus, where he was killed when an explosion caught him by surprise."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rescue mission to Vandos first appeared in the 2005 comic General Grievous 1, which was written by Chuck Dixon and published by Dark Horse Comics."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}