{"url": "Rescue_Mission_to_Dibrook", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Albarrio sector", "Category:Battles of the Yuuzhan Vong War"], "nodes": [{"tag": "h1", "text": "Rescue Mission to Dibrook"}, {"tag": "p", "text": "The Rescue Mission to Dibrook took place shortly after the Battle of Dibrook. Its goal was to free refugees captured by the Yuuzhan Vong during the battle."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Battle of Dibrook the Yuuzhan Vong captured about thirty refugees housed aboard the Dibrook Space Station, taking them to their Shaper research facility on the surface of Dibrook. When Kaye Galfridian, commander of the Heart of Artorias, learned of the kidnapping, she planned on rescuing them. The station's commander, Bylsma, aided her with soldiers and Enviro-suits to survive the hostile environment of Dibrook. They then set off in the Heart of Artorias to the planet. Due to the efforts of a yammosk trying to regain control of the former Yuuzhan Vong slaveship, the Heart had to land far from the Yuuzhan Vong base."}, {"tag": "h2", "text": "The Mission"}, {"tag": "p", "text": "After the army, consisting of both New Republic troopers and the former prisoners from the Heart of Artorias, had disembarked the Heart of Artorias and were on the planet's surface, a New Republic captain, Ogden, tried to take over control of the mission from Kaye Galdfridian and turn it from a rescue mission into an attack on the Yuuzhan Vong base. He was soon overpowered by Arbeloa, Kaye's second-in-command, and the mission continued as planned."}, {"tag": "p", "text": "When the army got near the base, they were attacked by a small group of thralls, people implanted with surge-coral to do the yammosk's bidding. Most of the attacking thralls were killed, but Kaye managed to subdue a Twi'lek thrall and had her escorted back to the Heart."}, {"tag": "p", "text": "After the thrall attack, the army sent out an advanced group of 50 soldiers, from both the Heart of Artorias and the New Republic, to scout ahead and gather intelligence on the Shaper research facility. Meanwhile, at the Yuuzhan Vong Base, Commander Tsalok recommended that Master Shaper Nagme withdraw to Rychel, while he would hold off the advance group."}, {"tag": "p", "text": "Near the base, the two groups encountered each other, but despite their minority in soldiers, the Yuuzhan Vong quickly defeated the advance guard. The Yuuzhan Vong had captured a New Republic captain, and as a warning to the upcoming army Commander Tsalok tore off the captain's enviro-suit and ripped him in half. The Yuuzhan Vong then returned to their base, where Tsalok told Nagme to release her army of thralls."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}