{"url": "Resh_9376/Legends", "categories": ["Category:Legends articles", "Category:Comets", "Category:Point Nadir locations", "Category:Spaceports"], "nodes": [{"tag": "h1", "text": "Resh 9376"}, {"tag": "p", "text": "Resh 9376 was a comet in the Outer Rim Territories that was host to a secret shadowport called Point Nadir."}, {"tag": "h2", "text": "Geographic features"}, {"tag": "p", "text": "Resh 9376 followed an elliptical route traveling many light-years and though it passed close to several inhabited star systems, it never actually crossed into any of them. The oblong comet was composed of ice, several basic ores, gypsum and granite, and it measured 30 kilometers long and 10 wide."}, {"tag": "p", "text": "The comet had a 24 hour day and due to its extensive route through the Outer Rim, had an orbital year of 7,241 local years. It was home to native arachnid creatures known as Nadir spiders."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Resh 9376 was first discovered more than 25,000 years before the Battle of Yavin and primarily ignored as an astrogation hazard until many millennia later, an automated Corellian exploration vessel, called the Saving Grace, surveyed the comet, taking ore samples and holomapping the surface topography. The entire scan of the comet took a mere 22 minutes, after which the Saving Grace sent a burst-transmission report back to astronomers on Corellia, who after a brief analysis, filed the report leaving it forgotten by the galaxy at large."}, {"tag": "h3", "text": "Under Solovan Fische"}, {"tag": "p", "text": "Two hundred years after the Saving Grace's survey, a Corellian pirate named Salovan Fische discovered the location of Resh 9376 and set out with his crew to locate the mysterious comet. After completely exploring the comet, Fische decided it was the perfect location to set up a base of operations, far from any authority or individual who consciously know of its existence."}, {"tag": "p", "text": "Over the next decade, Fische and his band of pirates made use of the rock as sparsely-furnished home base. Over time, they gang developed the base, storing booty in holds of captured ships and creating sealed chambers from some of the smaller interior caverns. As their wealth increased, they spared no expense making the base a more comfortable place to live. Fische became obsessed with making Resh 9376 a place he could call his own, obtaining mining droids and other equipment to hollow out more of the comet's interior."}, {"tag": "p", "text": "Following a run of misfortune and failed pirating ventures, Fische's crew mutinied and marooned him on the comet that had become his obsession. They had become tired of constantly-under-construction living conditions and recent run of bad luck. Fische died a hermit and alone on the comet that had become his life. Fische's crew in turn sold the information of the abandoned base to the Anjiliac clan of the Hutts."}, {"tag": "h3", "text": "Shadowport"}, {"tag": "p", "text": "The Hutts showed little interest in assuming control over the comet until over 100 years later. When they finally took interest in Resh 9376, they took the rudimentary complex created by Fische and using their extensive wealth and resources, established Point Nadir."}, {"tag": "p", "text": "Point Nadir, an Outer Rim base of operations for several criminal organizations, including Epsis and Sable Dawn, was cloaked in secrecy and those who knew of its location either paid for the information from the Anjiliac kajidic, the de facto rulers of the shadowport, or were invited by one of the two other governing criminal organizations. It was protected by a small fleet of starfighters, including modified Z-95 Headhunters, CloakShape fighters, and R-41 Starchasers."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}