{"url": "Rescue_of_Tamara_Ryvora", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Missions of the First Order–Resistance war"], "nodes": [{"tag": "h1", "text": "Rescue of Tamara Ryvora"}, {"tag": "p", "text": "Following the Suppression of the Aeos system, Jarek Yeager, Kazuda Xiono, and CB-23 undertook a mission to rescue Tamara Ryvora, who had become disillusioned with the First Order. Yeager and Xiono arranged to rendezvous with Ryvora on the planet Castilon, who traveled their under the guise of leading a training mission. However, the mission was complicated when First Order Security Bureau Agent Tierny discovered Ryvora's defection and dispatched their Resurgent-class Star Destroyer after them. Despite being captured by the First Order and exposing the Colossus to First Order pursuers, the team managed to sabotage the Star Destroyer's shield generator and escape the warship before it was destroyed during a skirmish in the Barabesh system."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Tamara Ryvora was an aspiring racer who left her homeworld of Kuat to pursue a racing career at the Colossus refueling platform on the planet Castilon. However, her plans did not work out and Ryvora fell on hard times. Destitute, she was forced to sell her racer but found lodging and work with Jarek Yeager, a former New Republic starfighter pilot who owned a repair station at the Colossus. Tam worked as a mechanic and hoped to earn enough money to buy the old racer known as the Fireball."}, {"tag": "p", "text": "Ryvora's working relationship with Yeager was complicated by the arrival of undercover Resistance spy Kazuda Xiono, who was on a mission to spy on First Order activity on the Colossus. Ryvora grew frustrated with Kaz's unexplained offworld trips and Yeager's perceived leniency towards Kaz. After the First Order raided Yeager's repair station following Kaz's intrusion into First Order space, Ryvora thought it was a misunderstanding and surrendered herself to the authorities."}, {"tag": "p", "text": "The First Order Security Bureau Agent managed to turn Ryvora against Kaz and Yeager by revealing that the former was a Resistance spy and claiming that the latter had taken advantage of her by withholding information from her. Tam's anger and resentment towards Kaz and Yeager led her to join the First Order during the Attack on Castilon, which saw the Team Colossus liberate the Colossus from First Order rule and escape into hyperspace."}, {"tag": "p", "text": "Ryvora became a First Order TIE Fighter Pilot cadet during the First Order's hunt for the Colossus, training alongside former Colossus residents Jace Rucklin and Lin Gaava. Over time, Ryvora came to question her commitment to the First Order due to her encounter with Resistance pilot Venisa Doza. Ryvora also secretly helped former friends Xiono and Neeku Vozo steal a Trans-binary deflector for the Colossus. Despite rising to the rank of Lieutenant, Ryvora's disillusionment with the First Order peaked after the First Order destroyed an Aeosian village during the Suppression of the Aeos system. Deciding to defect, Ryvora retrieved her comlink from Tierny's office. With the help of  the mouse droid 5-L, she transmitted a coded transmission to Xiono with arrangements to rendezvous on Castilon."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Helping a friend"}, {"tag": "p", "text": "Kaz, Neeku, and Yeager received Tamara's coded transmission. While Yeager thought it could be a trap, Kaz did not want to abandon Tam. Yeager agreed to accompany Kaz and the two sought Captain Imanuel Doza's permission. Though Doza was skeptical, Kaz believed that Tam had a genuine change of heart. Kaz was supported by Yeager and Doza's own wife Commander Venisa Doza, who said they would rescue their daughter if she was in the same position. Doza relented and allowed Kaz, Yeager, and CB-23 to borrow a former First Order Atmospheric Assault Lander to travel to a foregone racing ring near the former site of the Colossus."}, {"tag": "p", "text": "Meanwhile, Tam took her squadron of three TIE/sf space superiority fighters, which were capable of hyperspace travel to Castilon on a training mission. She was accompanied by Rucklin, who was committed to the First Order. Upon arriving, Rucklin recognized the Lander as a stolen First Order shuttle. Despite Tam's orders not to engage, Rucklin managed to convince the other pilots to open fire on the Lander. Tam was forced to knock him out and used her TIE fighter to shoot them down."}, {"tag": "p", "text": "Tam had a reunion with Yeager and Kaz on the racing ring. Though Yeager was still angry that Tam had left them to join the First Order, Kaz managed to defuse the situation by telling them they could resolve their differences later. At Tam's insistence, Kaz and Yeager agreed to also evacuate the unconscious Rucklin. Before they could leave, Commander Pyre and Agent Tiery's Star Destroyer arrived an opened fire on the racing ring and sea."}, {"tag": "h3", "text": "Behind enemy lines"}, {"tag": "p", "text": "Though the Atmospheric Assault Lander managed to escape into space, it was trapped by the Star Destroyer's tractor beam projector. Before the ship's capture, Yeager deleted the shuttle's flight logs and set the ship to self-destruct. While Tam and a still loyal Rucklin surrendered to Commander Pyre, Agent Tierny, and several stormtroopers, Kaz, Yeager, and CB-23 sneaked out of the ship through the maintenance hatches. While Tam confirmed that she had abandoned the First Order, Rucklin tried to prove his loyalty by revealing that the Colossus was in the Barabesh system. Pyre was unmoved and ordered that the two cadets be executed by First Order stormtrooper executioners for treason."}, {"tag": "p", "text": "After the shuttle exploded, Kaz, Yeager, and CB-23 took the opportunity to flee the hangar and infiltrate the ship. Despite Pyre, Tierny, and the stormtrooper's efforts, they managed to breach the Star Destroyer's corridors. Tierny issued a code red while Pyre ordered the Star Destroyer to set a course for the Barabesh system, seeking to destroy the Colossus once and for all."}, {"tag": "p", "text": "Later, Kaz and Yeager ambushed the stormtrooper party escorting Tam and Rucklin for execution. Kaz rejoined her friends but Rucklin was confident that the First Order would destroy the Colossus. After knocking him unconscious, Tam confirmed that the First Order had discovered the location of the Colossus due to Rucklin's treachery. The three decided that they had to warn the Colossus that the Star Destroyer was coming after them. Tam came up with an idea of infiltrating the engineering deck and rerouting a subspace frequency to send a transmission to the Colossus. Kaz contacted CB-23 and informed her about their plans."}, {"tag": "h3", "text": "Contacting the Colossus"}, {"tag": "p", "text": "With the help of CB-23, Kaz, Tam, and Yeager managed to take a turbolift in G27 into the engineering deck. After taking out two First Order security droids and rendezvousing with CB-23, the trio made their way down to the depths of the engine core in order to send their subspace frequency. Near the bottom of the engine, the group encountered a pair of stormtroopers, whom Yeager shot. However, one of the stormtroopers managed to report the intruders to Commander Pyre, who led reinforcements to intercept the intruders."}, {"tag": "p", "text": "Kaz and Tam contacted the Colossus using the subspace frequency, warning them that the First Order was coming for them and telling them to flee. The Colossus residents were initially distressed by Kaz and Tam's message but several residents including Aunt Z, Synara San, and Bolza Grool urged them to fight back. Though they managed to warn the Colossus, their frequency allowed the First Order to home in on their location. Tam and her rescuers fled down a maintenance hatch which led to a hangar. They attempted to escape aboard an Atmospheric Assault Lander but were captured by Commander Pyre and his stormtroopers. However, CB-23 managed to slip away."}, {"tag": "h3", "text": "Showdown in the Barabesh system"}, {"tag": "p", "text": "Tam, Kaz, and Yeager were brought onto the command bridge. Agent Tierny confronted Tam about her betrayal, saying that she had made her a pilot and given her purpose. Tam responded that Yeager gave her a family. When Pyre mocked Kaz that his efforts amounted to nothing, Kaz responded that he had warned the Colossus and that the station would be gone. Shortly later, the Star Destroyed exited hyperspace in the Barabesh system. Kaz was horrified to discover that the Colossus had not left."}, {"tag": "p", "text": "Pyre deployed several TIE squadrons against the space station but the Colossus residents were ready. Commander Venisa Doza led Jade Squadron and Ace Squadron against the Star Destroyer. They tried to take out its thrusters but these were protected by the Star Destroyer's deflector shield. CB-23 managed to lower the deflector shield, allowing the starfighters to bombard the Star Destroyer's engines."}, {"tag": "p", "text": "Kaz, Tam, and Yeager took advantage of the ensuing chaos to break free of their captors. Tam convinced the to disable the ship's controls and dashboards. The trio then fled down a turbolift with CB-23. They reached a troop hangar where Commander Pyre was supervising the departure of stormtroopers on assault landers to attack the Colossus. At Tam's suggestion, CB-23 to lower them onto a crane so that they could reach a nearby transport. However, a blast from a ruptured engine caused the grappling cable to break loose. Tam, Kaz, and Yeager fell but CB-23 caught them."}, {"tag": "p", "text": "Kaz and Tam landed on several canisters, attracting the attention of Pyre and his men. A gun battle ensued and Yeager shot a crane carrying munitions on top of Pyre's men, killing several stormtroopers. Tam and her friends led Commander Pyre on a chase through the burning hangar. Kaz was pinned down by a large box. Pyre attempted to execute him with his BL-155 Laser ax but CB-23 used her grappling cable to grab his ax. Pyre managed to damage the droid with his weapon but Kaz broke free and struck Pyre down with another laser ax."}, {"tag": "p", "text": "After alerting Torra Doza that they would be escaping aboard a stolen First Order transport, Kaz along with Tam, CB-23, and Yeager escaped the doomed ship. Meanwhile, the Colossus residents defeated the First Order boarding parties. Deeming Commander Pyre and Agent Tierny a lost cause, Supreme Leader Kylo Ren refused to send reinforcements and Force choked Agent Tierny. The Star Destroyer was destroyed by the combined firepower of Jade Squadron, Ace Squadron, and the Colossus, killing the entire crew (including Pyre, Rucklin and presumably Lin Gaava.)"}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the rescue, Tamara Ryvora returned home to the Colossus with Yeager, Kaz, and CB-23. She was greeted by several Colossus residents including Neeku, Aunt Z, the Doza family, Ace Squadron, and Jade Squadron. Tam also reconciled with her friends Kaz, Yeager, and Neeku while having drinks at Aunt Z's Tavern."}, {"tag": "p", "text": "At least three members of Team Colossus took part in the Battle of Exegol, flying the Fireball, Jarek Yeager's racer, and Blue Ace as part of the 14,000 strong allied armada that took on the Sith Eternal forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rescue of Tamara Ryvora first appeared in \"The Escape,\" the final episode of Star Wars Resistance Season Two, which premiered on January 26, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}