{"url": "Research", "categories": ["Category:Legends articles", "Category:Imperial research facilities", "Category:XQ Platforms"], "nodes": [{"tag": "h1", "text": "Research"}, {"tag": "p", "text": "Research was an XQ6 Platform located in the Parmel system, and under Imperial dominion during the Galactic Civil War. It was there that Grand Admiral Demetrius Zaarin conducted, among other types, TIE starfighter research. TIE Defender prototypes began their journey to the Emperor from Platform Research during the Arms Race prior to Admiral Zaarin's treason as part of the Zaarin insurrection against the Galactic Empire around 3 ABY. It was defended by the frigate Thunderer."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Rebel Alliance forces assaulted Platform Research in attempt to thwart TIE Defender production, but to no avail. The station was attacked by Rebel forces again, during Zaarin's production of a Beam weapon system to be retrofitted onto Imperial fighters. During the raid Rebel B-wings were revealed to be using Mag Pulse warheads and one was captured. The technology was then traced back to Galactic Electronics, which was seized in response to developing illegal weapons and selling them to the Alliance."}, {"tag": "p", "text": "Zaarin later decided to destroy this platform in order to slow the starfighter production of the Imperial Loyalists, so the Emperor sent ace fighter pilot Maarek Stele and the Imperial-class Star Destroyer Adarga to defend Research. After several attacks, Zaarin forced the Adarga to flee and the platform had to be abandoned. Stele assisted in the evacuation of high-ranking personnel and TIE Defenders from the station, and after several pirate attacks, managed to get the fighters to Vice Admiral Thrawn."}, {"tag": "p", "text": "Zaarin succeeded in destroying Research shortly after it was abandoned, but failed to wipe out all of the TIE Defender data needed for the craft's production."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}