{"url": "BG-RT%27s_Tavern_and_Spirits", "categories": ["Category:Canon articles", "Category:Cantinas", "Category:Level 1313 locations", "Category:Structures"], "nodes": [{"tag": "h1", "text": "BG-RT's Tavern and Spirits"}, {"tag": "p", "text": "BG-RT's Tavern and Spirits, also known simply as BG-RT's, was a cantina located within Level 1313 on the Core Worlds planet Coruscant. At some point prior to the Battle of Hoth in 3 ABY, a shootout took place in the building between the cyborg Beilert Valance and several bounty hunters who had arrived to kill him."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "BG-RT's Tavern and Spirits was located on the Core Worlds planet Coruscant within Level 1313, which consisted of at least two floors. A droid was stationed at the entrance, inspecting the firearms of guests who entered the cantina, while another droid served as the cantina's bartender."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point prior to the Battle of Hoth in 3 ABY, the cyborg bounty hunter Beilert Valance visited the cantina to drink. The bounty hunter Xonr later entered the cantina and found Valance drunk at a table. Xonr approached the cyborg and sat in front of him. After downing Valance's drink, Xonr threatened to kill him for breaking the Bounty Hunter Code."}, {"tag": "p", "text": "As Xonr aimed a blaster at the cyborg from underneath the table, other bounty hunters around the cantina began preparing their weapons. A shootout ensued when Valance killed Xonr using his palm blaster. Valance, who in reality had allowed the hunters to follow him to the cantina, survived the encounter and eliminated all of them. Following the shootout, he paid the bartender droid for his next round and raised his glass, with the cantina patrons raising theirs in response. He then left the cantina and made his way to Docking Bay 21, where his starship, the Broken Wing, was parked."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BG-RT's Tavern and Spirits appeared in the first issue of the Marvel comic-book miniseries Star Wars: Target Vader. It was written by Robbie Thompson, illustrated by Marc Laming and Cris Bolson, and released by Marvel Comics on July 3, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}