{"url": "Resolve_(New_Republic_Star_Destroyer)", "categories": ["Category:Legends articles", "Category:Nebula-class Star Destroyers", "Category:New Republic Fifth Fleet elements", "Category:New Republic starships"], "nodes": [{"tag": "h1", "text": "Resolve (New Republic Star Destroyer)"}, {"tag": "p", "text": "The Resolve was a capital ship of the New Republic Fifth Fleet, variously described as a Star Destroyer, or as a star cruiser."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Assigned to the New Republic Fifth Battle Group under Commander Syub Snunb, the Resolve was specially equipped with reinforced, multi-layered deflector shields which could call on the full power from the ship's engines. While this allowed Resolve to absorb large amounts of opposing firepower, it left the ship unable to simultaneously transfer power to the hyperdrive or other systems."}, {"tag": "p", "text": "During Operation Hammerblow, the Resolve was used to absorb the fire of a hypervelocity gun on Bessimir's alpha moon, drawing the weapon's fire while K-wing bombers of the 24th Bombardment Squadron attacked the emplacement. The firepower of the hypervelocity gun proved almost too much for the ship to handle, prompting Commander Snunb to turn the ship onto an escape heading, but the intensity of the bombardment prevented the crew from dropping the shields and escaping to hyperspace, and the gun subsequently brought down the ship's outermost deflector layer, known as the \"D shield\", destroying the associated shield generator in the process, before the K-wings completed their mission and took out the emplacement."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the novel Before the Storm, the Resolve is described as a \"New Republic Star Destroyer\", a term which at first sight suggests that the ship is a Nebula-class Star Destroyer, but the ship is subsequently referred to as a \"big cruiser\", and the author's online FAQ indicates that he intended the ship to be a Majestic-class heavy cruiser."}, {"tag": "p", "text": "In The Complete Star Wars Encyclopedia, the entry for Resolve repeats the \"New Republic Star Destroyer\" designation without offering a specific class designation, but the entry for Syub Snub refers to the ship as a \"star cruiser\", a term used in the sequel Shield of Lies for the Majestic-class cruiser Indomitable."}, {"tag": "p", "text": "As depicted in Before the Storm, the need to divert all engine power to the shields inhibits the Resolve from simultaneously using the hyperdrive, and the lack of any references to the ship's own turbolasers suggests that the strengthened deflector system also prevents the use of heavy weapons. The novel does not indicate directly whether or not the Resolve carries starfighters, but at Bessimir the ship is depicted as working closely with the BTL-S8 K-wing assault starfighters of 24th Bombardment Squadron, raising the possibility that this unit was originally deployed on board."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}