{"url": "BG-81", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic droids", "Category:Lothal astromech droids"], "nodes": [{"tag": "h1", "text": "BG-81"}, {"tag": "p", "text": "BG-81 was an astromech droid who served the Mon Calamari engineer Quarrie in the years prior to the Battle of Yavin and during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Project Shantipole"}, {"tag": "p", "text": "BG-81 lived on the planet Shantipole, where it assisted the Mon Calamari starship engineer Quarrie with the construction of his Prototype B6, which later became the basis for the Rebel Alliance's B-Wing. BG-81 was present when the Spectres Hera Syndulla, Sabine Wren, and Garazeb Orrelios arrived on Shantipole to test the new starfighter."}, {"tag": "p", "text": "The astromech droid was present when Hera flew Prototype B-6 for a test flight above the canyons of Shantipole. During the test flight, Quarrie had BG-81 upgrade the rebels' shuttle, the Phantom, with a hyperdrive and astromech socket. Later, the droid and Quarrie were aboard the Phantom when Hera used the prototype starfighter to break through the Galactic Empire's blockade of Ibaar. Following the skirmish, BG-81 left the rebel fleet with Quarrie in order to oversee the production of more B-Wings for the rebel cause."}, {"tag": "h3", "text": "Joining the Rebellion"}, {"tag": "p", "text": "BG-81 and Quarrie eventually joined the Rebel Alliance aboard the flagship Home One. While Quarrie and the Freemakers spent time building, the B1-series battle droid R0-GR told stories of the past to BG-81, during which the latter droid spent much of that time in sleep mode."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "BG-81 was a Lothal astromech droid who served the Mon Calamari starship engineer Quarrie. It aided Quarrie with the construction of the experimental Prototype B6 starfighter. BG-81 was present both during the starship's test flight and the first field operation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BG-81 first premiered in the Star Wars Rebels Season Two episode \"Wings of the Master,\" which premiered on Disney XD on November 11, 2015. He makes cameo appearances in several  LEGO Star Wars: The Freemaker Adventures Season Two episodes. In the series, BG-81 still serves Quarrie, who now works for the Rebel Alliance aboard their flagship Home One. Later, BG-81 plays back images of various starships but none match Rowan Freemaker's Force vision of the Arrowhead. BG-81 also assists Kordi Freemaker's mission to steal an Imperial list of worlds with kyber crystals from an Imperial base during Rowan's Quest to build the Arrowhead. Later, BG-81 awoke Quarrie so that Rowan could show him his \"Ugly\" starship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}