{"url": "Resistance_base_(Ajan_Kloss)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Ajan Kloss locations", "Category:Military bases", "Category:Resistance locations"], "nodes": [{"tag": "h1", "text": "Resistance base  (Ajan Kloss)"}, {"tag": "p", "text": "The Resistance established a base on the jungle moon Ajan Kloss after their former base on D'Qar was eliminated by the First Order. It contained two parts: A small landing zone for the Resistance's starfighters; and a natural cave used as a hangar for the Tantive IV. Both these sections were located in the Klosslands. Eventually, after the battle of Exegol, the citizens' fleet traveled back to the base."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Starfighter landing zone"}, {"tag": "p", "text": "This section of the base was used as a landing zone for the Resistance's starfighters. The Resistance attached sensor scattering nets to the tops of trees. These nets would prevent the starfighters from being detected if the First Order ever scanned Ajan Kloss. Under these protective nets, the Resistance could land and repair their nine A-wings, six B-Wing Fighters, seven X-wings, seven Y-wings, and the troop transport Fortitude onto the surface of Ajan Kloss."}, {"tag": "h3", "text": "Multi-purpose cave"}, {"tag": "p", "text": "A natural limestone cave close to the starfighter landing zone was used as a hangar for the Tantive IV, and the command center for the Resistance. Because the base was still in its early stages of construction, General Leia Organa's command ship, the Tantive IV, also served as a generator, barracks, and a primary meeting spot. Rey Skywalker maintained a small section of the cave, where she studied the ancient Jedi texts she had recovered from the temple on Ahch-To, repaired her lightsaber and studied the kyber crystal within it. The command center was on the left side of the cave, with the Tantive IV in the middle, and Rey's Jedi section on the far right side. There was also a small room that served as Organa's bedroom, while everyone else who wasn't on duty slept in the Tantive IV. The Resistance also constructed a laser-cut trail, which led from the cave to the starfighter landing zone."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to the start of the Galactic Civil War, the jungle moon of Ajan Kloss was charted but hidden from the Imperial Senate. Ajan Kloss, along with Yavin 4 and Dantooine were hidden from the eyes of the Imperial government due to being a potential Rebel base. After the Battle of Endor, Ajan Kloss did house a small Rebel Alliance outpost. It was also where Luke Skywalker and Leia Organa trained. After the First Order destroyed the former Resistance base on D'Qar, and forced what was left of the Resistance from their Crait outpost, General Organa decided to establish a base on Ajan Kloss, in memory of her Jedi training days."}, {"tag": "p", "text": "Around 35 ABY, the Resistance base hadn't been fully constructed, so the Tantive IV provided the power necessary to operate the base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}