{"url": "Resol%27nare", "categories": ["Category:Legends articles", "Category:Doctrines", "Category:Mandalorian culture"], "nodes": [{"tag": "h1", "text": "Resol'nare"}, {"tag": "p", "text": "The Resol'nare, or Six Actions when translated from Mando'a into Galactic Basic Standard, were the central tenets of Mandalorian life. They consisted of wearing armor, speaking the language, defending oneself and family, raising your children as Mandalorians, contributing to the clan's welfare, and when called upon by the Mand'alor, rallying to their cause."}, {"tag": "p", "text": "Tradition dictated that anyone who wished to be considered Mandalorian were to abide by these guidelines and live these actions daily. Mandalorians whom did not follow the Resol'nare were considered to be dar'manda—someone who was ignorant of their Mandalorian heritage and bereft of their Mandalorian soul. The status of dar'manda was widely feared within Mandalorian society due to the belief it meant they were soulless and had no place in the Manda, the Mandalorian afterlife. Before and during the Mandalorian Wars, any and all non-Mandalorians were considered dar'manda and soulless from birth, until they joined the Mandalorians and lived by the Resol'nare. Groups of captured individuals would often be forcibly inducted into Mandalorian culture, and made to swear by the Resol'nare with or without their consent under the threat of death. Such zealotry faded over time as the Mandalorians became a less religious and more secular society."}, {"tag": "p", "text": "Young Mandalorian children were taught a rhyme to help them learn the tenets of the Resol'nare, and their parents would explain the cultural significance of each tenet as they grew."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Resol'nare were developed by author Karen Traviss and first appeared in the Star Wars Insider article The Mandalorians: People and Culture."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}