{"url": "Retheus_Galthe", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Galactic Republic individuals", "Category:Humans", "Category:Males", "Category:Planetary leaders"], "nodes": [{"tag": "h1", "text": "Retheus Galthe"}, {"tag": "p", "text": "Retheus Galthe was a Human male who served as the President of Balmorra during the Cold War between the Galactic Republic and the resurgent Sith Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 3642 BBY, Galthe was captured by the Sith Lord Darth Lachris and was tortured to insanity before being placed in carbonite, in order for the citizens of Balmorra to lose hope and allow the Empire to take total control of the planet. The Barsen'thor, a Jedi Master sent to liaise with the secessionist Rift Alliance - which included the Balmorran government-in-exile, under former trade secretary Tai Cordan - went into the Balmorran Arms Factory with the aid of the revolutionary known as Zenith to rescue Galthe and end Lachris' rule. With her dying breath, however, Lachris declared their efforts futile, as they soon learned upon releasing Galthe from the carbon-freeze and finding his mind broken."}, {"tag": "p", "text": "The Barsen'thor attempted to use a shielding technique originally learned to combat Lord Vivicar's dark plague, but it proved ineffective. Confronted with the truth of their President's condition, the Balmorra citizens committee declared Galthe incapacitated, and the powers of his office were transferred to Cordan in accordance with Balmorran law. In a mailed message sent by Cordan it states that Galthe was doing better, being able to ask for food and dress himself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The failed attempt to shield Galthe and the decision to show his broken condition to the citizens committee is the light side option. The dark side option, which can be invoked before or after the attempt to use the shielding technique, involves allowing Zenith to use an experimental implant to forcefully clear up Galthe's mind and allow him to transfer his office to Tai Cordan personally; the drawback is that the technology was potentially fatal. Shortly afterwards, Cordan's office will send a mailed message to the Consular with an official announcement of Galthe's death, along with personal remarks indicating that he had died in his sleep, possibly due to Lachris' torture."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}