{"url": "BK-86", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Dok-Ondar's belongings", "Category:Dok-Ondar's Den of Antiquities employees", "Category:IG-series assassin droids"], "nodes": [{"tag": "h1", "text": "BK-86"}, {"tag": "p", "text": "BK-86 was a IG-series assassin droid that worked as primary security droid for the Ithorian antiques dealer Dok-Ondar at his Den of Antiquities in Black Spire Outpost on the planet Batuu. At some point following the Battle of Crait, it was destroyed by a member of the Finto Gang during an attempt to double cross Dok-Ondar by the gang's leader, Kase Finto. Dok-Ondar kept BK-86's remains in his store while looking for a replacement."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "BK-86 was a IG-series assassin droid manufactured by Holowan Laboratories that belonged to the Ithorian antiques dealer Dok-Ondar, owner of Dok-Ondar's Den of Antiquities in Black Spire Outpost on the planet Batuu."}, {"tag": "p", "text": "At some point after the Battle of Crait during the war between the First Order and the Resistance, BK-86 was present in the store when Kendoh Voss and her mercenary crew executed the heist of the hilt of the ancient Sith artifact known as the Sword of Khashyun at Dok-Ondar's shop. The droid protected his master when the First Order's 709th Legion interfered, leading to a skirmish."}, {"tag": "p", "text": "Some time later BK-86 was present alongside Dok-Ondar for an appointment with Kase Finto, leader of the Finto Gang, and his four brothers. During the appointment, Finto showed Dok-Ondar a case of real gems that he meant to trade; however, after showing the Ithorian the gems, Finto used a secret button on the case to swap them out with artificial replias, while the real gems were slipped into his pocket. BK-86 spotted this deception and drew its blaster on Finto, causing Dok-Ondar to try and defuse the situation and persuade Finto into trading the real gemstones and then leaving with his brothers. One of Finto's brothers then lost his nerve and drew his blaster to shoot BK-86 in the shoulder. Dok-Ondar drew his own blaster to try and save the droid, but was not quick enough as the assassin droid's body was blown apart by one of the brothers' weapons, also knocking out one of its photoreceptors. Finto then shot at the Ithorian and missed, before Dok-Ondar killed the gang leader. The remaining Finto Gang members then fled. Dok-Ondar then placed BK-86's broken body upon the upper shelves of his store and left it there while looking for a replacement."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "BK-86 was a loyal and deadly worker for Dok-Ondar. It had gray plating and wore a bandolier."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BK-86 was created as a prop in Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}