{"url": "Retreat_from_Gallofree", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Airam sector", "Category:Battles of Spreading the Rebellion campaign", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Retreat from Gallofree"}, {"tag": "p", "text": "The Fourth Battle of Mobetta was a space battle surrounding the Rebel-aided Airam retreat from X7 factory Gallofree under fire from an Imperial strike force."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Not long after the successful Ambush in the Derilyn system, the Rebel Alliance received a distress call from the Airam factory Gallofree, where the Strike-class cruiser Peregrine had been refitted."}, {"tag": "p", "text": "The gutted ex-Imperial interdictor Compellor, left behind by the Rebels as planned, detonated in full view of the Imperial strike team as the elements of Admiral Senn's Task Force Vengeance approached the factory. The Imperial battle group then moved in to retaliate against the factory personnel."}, {"tag": "p", "text": "Rogue and Green Squadrons, along with three Gallofree medium transports of Rescue Group, jumped into the Mobetta system to evacuate the Airam from the factory before it was destroyed. What greeted them was a significant Imperial force, consisting of the Imperial I-class Star Destroyers Juggernaut and Titan, as well as three Corellian corvettes, all moving in alongside their substantial fighter screens to destroy the factory."}, {"tag": "p", "text": "Green Squadron quickly destroyed the spearheading corvettes with a warhead volley while Rogue Squadron dispatched the incoming bombers. However, the nimble Imperial fighters quickly closed to range with the Rogue X-wings, and the Rogues got caught up in heavy dogfights with the elite Imperial Avenger Squadron and several flight groups of TIE/IN interceptor craft."}, {"tag": "p", "text": "Despite an overwhelming assault by the marauding fleet, both the Rogues and Greens managed to hold off the Imperial TIE starfighters long enough for the transports to complete their mission. After the last transport made the jump to hyperspace, all Rebel fighters followed suit, leaving two slightly damaged Star Destroyers and the abandoned space factory behind."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "While technically a loss for both the Airam and Rebels (despite the heavy fighter losses on the Imperial side), this battle heavily improved relations between Airam clan leader Tamaron and the Alliance. Tamaron agreed to deliver a large payload of warheads to the Alliance's sector fleet, which led to the Mission to Kuras Drift."}, {"tag": "h2", "text": "Appearances"}]}