{"url": "Return_of_the_Ewok", "categories": ["Category:Real-world articles", "Category:Documentaries", "Category:Miscellaneous films", "Category:Parodies"], "nodes": [{"tag": "h1", "text": "Return of the Ewok"}, {"tag": "p", "text": "Return of the Ewok is a 24-minute mockumentary starring Warwick Davis, the actor who played the Ewok Wicket W. Warrick in Star Wars: Episode VI Return of the Jedi and the Ewok spin-off films. It was created by Davis and David Tomblin, Return of the Jedi's first assistant director. Tomblin directed. Lucasfilm Ltd. planned to use the movie as a promotional film for Return of the Jedi, but post-production on the film was never completed."}, {"tag": "p", "text": "The film is set in both the \"real world\" and the fictional locations of the Star Wars universe. Real-world locations include an airport, Elstree Studios and the actors' dressing rooms, while the fictional locations include Dagobah, the Death Star II, Jabba's Palace, and the forest Moon of Endor. Throughout the film, these two realities are intermixed to produce an alternate reality."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Return of the Ewok focuses on the fictional account of Davis's decision to become an actor and act as Wicket in Return of the Jedi. It also follows his transformation into Wicket. The film was shot on Tomblin's own 16mm camera and created during production of Return of the Jedi. As Warwick and as Wicket, he visits and interacts with many of the cast and crew of the movie and then characters of the movie. As Warwick, he goes to Elstree Studios where he interacts with the cast, both in and out of character. At one point, he even interacts with Luke Skywalker as he jumps out of a movie screen. As Wicket, he goes to Dagobah to see Yoda, and the Death Star he sees Darth Vader, and is chased by Boba Fett."}, {"tag": "h2", "text": "Production"}, {"tag": "p", "text": "Return of the Ewok was conceived by David Tomblin and funded by George Lucas. According to Warwick Davis, \"[Tomblin] kept thinking of it in the night, he used to jump up and write little bits. Eventually, he ended up with this whole story, and we made this little film.\" Tomblin told Starlog magazine: \"At lunch times, I would rush around and try and shoot pieces for it.\""}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "The original 16 mm print of Return of the Ewok is said to be lost; for years, Warwick Davis's VHS dub was the only known copy. In 1999, he loaned this copy to Lucasfilm so that they could make their own copy. The 2004 DVD release of the original trilogy included a bonus disc that contained an easter egg of bloopers, which included a high-quality clip from Return of the Ewok of Wicket being chased by Boba Fett on the Death Star. In April 2005, a four minute edit of the film was made available on the official Star Wars website for members of the Hyperspace fan club. (That year, the film was entered in the Lucasfilm-sponsored Official Star Wars Fan Film Awards, for which it won the Pioneer Award.) High quality clips from the film were used in \"Warwick & Son', a featurette included with the 2020 home video release of Star Wars: Episode IX The Rise of Skywalker."}, {"tag": "p", "text": "Davis first publicly screened the film at the first Star Wars Celebration in 1999. This was followed by screenings at both Celebration II in 2002, and Celebration III in 2005. His first UK screening of the film was at the National Space Centre in Leicester for the Star Wars day convention on November 12, 2005."}, {"tag": "p", "text": "In 2011, Davis co-created and starred in the HBO/BBC TV series Life's Too Short, which also uses a mockumentary style to follow the actor as an adult."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}