{"url": "BL-OX", "categories": ["Category:Canon articles", "Category:Droid stubs", "Category:Droids"], "nodes": [{"tag": "h1", "text": "BL-OX"}, {"tag": "p", "text": "BL-OX was a droid who lived on the junk planet of Zoh. On Zoh, BL-OX and other droids was led by Jek-14. Shorty after the Freemakers visited Zoh seeking Jek-14's help, a ungrateful droid named N-3RO led a droid uprising against Jek-14 and the Freemakers. N-3RO succeeded to convince his fellow droids, including BL-OX that humans can not be trusted. They failed and N-3RO was still on Zoh and had been fitted for a restraining bolt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bl-OX first appeared in LEGO Star Wars: The Freemaker Adventures but was later canonized by Star Wars: Droidography."}, {"tag": "h3", "text": "Non-canon Biography"}, {"tag": "p", "text": "BL-OX was a droid who ended up on the junkyard world of Zoh during the Galactic Civil War. He was part of a community of castoff droids that included N-3RO and Fixer. This community was led by the former Sith clone Jek-14, who had switched sides and aided the Jedi. BL-OX and his fellow droids respected Jek-14, who treated them well and used the Force to create giant hexagonal artworks from junk; earning the moniker \"Maker of Zoh.\""}, {"tag": "p", "text": "Following the Battle of Hoth, a family of scavengers known as the Freemakers traveled to Zoh on their ship StarScavenger to seek out the Maker of Zoh. Their youngest Rowan Freemaker had embarked on a quest to collect the pieces of the Kyber Saber. He was racing against the Sith agent Naare and her Hutt ally Graballa, who had taken six out of the seven pieces. After the Freemakers landed, BL-OX and his fellow droids greeted the offworlds. The Freemakers sent their B1-series battle droid Roger to convince the locals of their peaceful intentions."}, {"tag": "p", "text": "However, the droids, at the instigation of N-3RO, identified the Freemakers as a threat when Roger revealed that his owners had removed his transmission pack. Th|e droids attacked the Freemakers but were restrained by Jek-14, who convinced the droids that the Freemakers posed no threat. He set the mouse droid Fixer to repair BL-OX and the other droids. Jek also allowed the older Freemakers Zander and Kordi to collect salvage and agreed to teach Rowan in the ways of the Force."}, {"tag": "p", "text": "While BL-OX and the other droids accepted Jek's counsel, N-3RO despised the offworlders. He managed to convince BL-OX that the Freemakers were corrupting Jek and would cause him to leave them for scrap a second time. At N-3RO's bidding, BL-OX spread word among the other droids. After N-3RO distracted the Freemakers' droid Roger with an oil bath, BL-OX followed N-3RO's orders to proceed with the next stage of the plan. He led Kordi and Zander to a place where they could purportedly find better scrap. However, this turned out to be trap and the two were taken captive by N-3RO and his followers."}, {"tag": "p", "text": "BL-OX was present when N-3RO attempted to crush Kordi and Zander with a crane. Before they could intervene, Jek arrived with Rowan. When Jek remonstrated with N-3RO, the droid claimed that the Freemakers had corrupted his mind. Following a struggle, the droids overpowered and took Jek and Rowan prisoner as well. Deeming the Maker irredeemable, N-3RO ordered his droids to crush the humans with a heavy metal object. Before they could intervene, Roger arrived and spoke up for his human masters. He then reattached his transmission pack, which alerted Naare and Graballa to Zoh."}, {"tag": "p", "text": "Naare and Graballa proceeded to bomb Zoh with their ship Rancor's Fist. While Jek fought with Naare, the Freemakers fled in their ship StarScavenger. After the offworlders had departed, BL-OX found N-3RO, who had been knocked out by laser blast, and fitted a restraining bolt on him. When N-3RO protested, BL-OX replied that they should not have listened to him and condemned him for betraying the Maker. While BL-OX lamented that they would never find another being like him, Jek survived the duel and used his mechanical arm to dig his way out."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "BL-OX was a naive and loyal droid who was loyal to Jek-14, the Maker of Zoh. He was also close with his fellow droid N-3RO, who was manipulative and hostile towards offworlders. BL-OX initially believed Jek-14's arguments that the Freemakers constituted a threat to the Maker of Zoh. Despite his compliance with Jek's orders, BL-OX subsequently realized that N-3RO was wrong after Roger spoke up for his masters and Jek risked his life to help the Freemakers escape Naare. Making amends, BL-OX fastened a restraining bolt onto N-3RO as punishment for his betrayal of the Maker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BL-OX was voiced by Fred Tatasciore in the LEGO Star Wars: The Freemaker Adventures episode \"The Maker of Zoh\", which premiered on Disney XD on August 8, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}