{"url": "BLX-5", "categories": ["Category:Legends articles", "Category:Labor droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "BLX-5"}, {"tag": "p", "text": "BLX-5, more commonly known by the alias \"Bollux,\" was a BLX labor droid that served for a time as a member of famed Corellian smuggler Han Solo's crew aboard the Millennium Falcon. Originally a common work droid at the Fondor Shipyards, BLX-5 developed its own complex personality after a workplace mishap caused it to go an excessively long period without a memory wipe. After endearing itself to its owners with its friendly demeanor, BLX-5 was freed and went on to travel the galaxy for decades, working various jobs while attempting to stave off the threat of impending obsolescence by volunteering for every upgrade it could. The droid ended up in the possession of outlaw tech Klaus \"Doc\" Vandangante by the era of the Galactic Civil War, who gave it the moniker \"Bollux\" and fitted its chest cavity with a computer probe called Blue Max, which became its constant companion."}, {"tag": "p", "text": "In 2 BBY, Bollux and Blue Max joined Solo's crew when Doc's daughter Jessa Vandangante sent the Corellian on a mission to track down her missing father somewhere in the Corporate Sector. After rescuing Doc and many other captives from a secret Corporate Sector Authority prison called Stars' End, the two droids signed onto the Falcon's crew full-time. Over the coming months, Bollux and Blue Max joined Solo and his Wookiee partner Chewbacca on a number of adventures, including exposing a slaving ring on Ammuud and tracking down the lost treasure of the fabled Queen of Ranroon on Dellalt. After this last mission they parted ways with Solo, staying on Dellalt to aid in the archaeological study of the artifacts from the ancient treasure ship."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early years"}, {"tag": "p", "text": "Manufactured at the great Fondor Fondor Shipyards around 100 BBY, the droid that would become known as \"Bollux\" was originally constructed as a common Serv-O-Droid, Inc. BLX labor droid, programmed with limited intelligence and assigned to the simple, repetitive task of sweeping sections of the shipyards for mynocks and other vermin. Although the droid designated BLX-5 was intended for frequent memory wipes that would prevent it from developing a complex personality, a series of chance events led to it realizing self-determination. On one of its regular assignments, BLX-5 came across a cluster of mynocks too large for it to handle, and was forced to take shelter from the creatures. As its instructions never specified a return time, BLX-5 remained at its post for several weeks, studying the mynocks' behavior. In the meantime, the droid's managers chalked up BLX-5's disappearance as the routine loss of a labor droid, a relatively commonplace occurrence. By the time BLX-5 returned, its work designation had already been reassigned to another droid, and it was nearly a year until supervisors realized the error."}, {"tag": "p", "text": "BLX-5 went that entire period without a memory wipe, and during that period started to develop its own distinct, friendly personality that endeared it to the staff of the shipyards. The droid was subsequently repurposed into a shift overseer, receiving structural modifications and system upgrades in order to contribute more effectively. However, the inexorable march of progress continued, and BLX-5 was soon rendered obsolete by a newer model and left without a job. A free droid—one of few in the galaxy at the time— BLX-5 soon found a role constructing survival domes and camps for a scouting outfit, which allowed it to travel the galaxy and continue to add new modifications in an effort to prevent against being made obsolete again. Nevertheless, that happened continually over the coming decades: BLX-5 earned and lost positions building fortifications for the Republic military on a construction gang working on weather-control systems, as a \"general roustabout\" for a touring show called Gan Jan Rue's Traveling Menagerie, and as a technical overseer on a Trigdale Foundries mining colony. BLX-5 lived a nomadic life for decades, traveling across the galaxy under a variety of aliases, including \"Zollux,\" before ending up in the hands of a group of smugglers who won the droid in a dice game."}, {"tag": "p", "text": "It wasn't long before BLX-5 found a more permanent home. The smugglers eventually made a stop at an asteroid base run by renowned outlaw tech Klaus \"Doc\" Vandangante, where they traded BLX-5 to Vandangante in exchange for an enhanced hyperdrive motivator. BLX-5 quickly became a part of the family, sometimes serving as a test subject for Doc's mechanically-minded daughter Jessa, who gave it the nickname \"Bollux\" after having a difficult time modifying the droid's chassis. Bollux continued to receive upgrades over the coming years, and soon volunteered to have its torso retrofitted in order to carry a new companion: a small computer interface unit named Blue Max, which fit within a hollowed-out chamber in Bollux's torso. Bollux and Blue Max swiftly became inseparable, operating almost like a single unit over the coming years."}, {"tag": "h3", "text": "Meeting Han Solo"}, {"tag": "p", "text": "Bollux's life radically changed again in 2 BBY, when the droid met a brash Corellian smuggler named Han Solo. Amidst a rash of mysterious disappearances in and around the Corporate Sector, Doc Vandangante too went missing, leaving his daughter Jessa in charge of the asteroid base. Not long after, Solo and his Wookiee first mate Chewbacca arrived, seeking a waiver to operate their ship, the Millennium Falcon, in the Corporate Sector. Desperate to find her father, Jessa cut a deal with Solo to find the missing man in exchange for a waiver and repairs to the Falcon. Jessa insisted that Bollux and Blue Max accompany Solo on the trip—she had made a contact with a group on Orron III also investigating the disappearances, and Blue Max's presence was necessary in order to download a large amount of relevant computer data. Although Solo was no lover of droids and didn't want them along, he reluctantly agreed, and the group took ship to Orron III."}, {"tag": "p", "text": "On Orron III, Bollux's new company met up with a man named Rekkon, an academic leading a clandestine group of citizens searching for their missing friends and family. Rekkon and his compatriots—a Trianii mother and cub named Atuarre and Pakka, along with a man named Torm Dadeferron—had spent months slowly infiltrating a Corporate Sector Authority datacenter they believed had information on the location of the Corporate Sector's vanished, and Blue Max's advanced processing power was vital to retrieving this data. Blue Max downloaded the data as the group finished making their introductions, only to find that the Authority's Security Police had discovered their presence and sent troops to investigate. Bollux's unassuming exterior proved to be a major boon, as the droid served as a distraction to the pursuing Espos as the organic members of the team made a break for the exit, then tripped a radiation alarm that deterred chase before rejoining the rest of the group. Bollux and its compatriots fled on a stolen skimmer ahead of dogged Espo pursuit—although most of the team escaped unharmed after the skimmer was shot down and crashed in a field, the Authority captured Chewbacca alive."}, {"tag": "p", "text": "Desperately hoping to save his friend, Solo led the rest of the conspirators to the Millennium Falcon, setting off in pursuit while Blue Max compiled the data from the Authority installation. However, they were not long off Orron III when Rekkon turned up dead, the victim of a blaster bolt to the back while examining the data plaque. After a brief process of elimination it became evident that Dadeferron was the murderer, having served as an Authority mole from the beginning. Solo spaced Dadeferron out of the Falcon's airlock—although Dadeferron's treachery had also destroyed the data plaque from Orron III, the Falcon's crew found that Rekkon, in his dying moments, had written a message indicating that their destination was a facility called Stars' End on the planet Mytus VII. Stars' End was a highly secure prison run by a ruthless Authority Viceprex known as Mirkovig Hirken, requiring an ingenious approach to get inside. The crew of the Falcon tackled this problem by posing as a circus troupe called \"Madam Atuarre's Roving Performers\"—Bollux received a fresh coat of paint and was presented as a \"robotic raconteur,\" entertaining crowds with his storytelling and wit. At Stars' End, which was expecting the imminent arrival of a group of entertainers, their disguise passed muster. However, Bollux's purpose was lost in translation. Hirken, an enthusiast of gladiator droids, was expecting a droid that would challenge his prized top-of-the-line Mark X Executioner droid in single combat. Quickly covering for the lie, Solo instead billed the unassuming Bollux as \"Annihilator,\" a custom-built combat droid that he hoped would never have to have its fighting capabilities tested."}, {"tag": "p", "text": "Atuarre and Pakka put on an acrobatics performance while Solo and Blue Max poked around the facility looking for the missing people's location, but Hirken quickly became bored at their stalling and called for the heavyweight fight between his Executioner and the \"Annihilator.\" Hirken had already grown to suspect that Bollux was in fact no true gladiator droid, and all observers expected the weathered old droid to be swiftly destroyed. Ignoring almost certain death, Bollux marched into the arena and faced down the Executioner, sustaining heavy damage from the war droid's flame gun. But as the Executioner moved in for the kill, Bollux received an assist from the onlooking Blue Max, which had analyzed the droid and figured out a weakness—the probe directed Bollux to grab onto the underside of the droid's treads, and start tearing at its circuitry through the only weak spot in its armor. The tactic caused the Executioner to careen wildly around the arena and eventually explode, stunning the crowd and provoking Hirken into a fury."}, {"tag": "p", "text": "From there, absolute chaos erupted. Solo engaged in a firefight with Hirken's bodyguard, a hulking Tiss'shar named Uul-Rha-Shan, which ended with a catastrophic power plant explosion that blasted the entire prison off the surface of Mytus VII. With only minutes until the prison slammed back into the planet, Solo's crew hurriedly rushed through Stars' End in order to free the prisoners and escape before the facility was destroyed. Although Bollux was severely damaged by its encounter with the Mark X Executioner, it remained ambulatory after linking with Blue Max, which repaired some of its systems. Eventually, however, Bollux began to struggle badly in the chaos of the evacuation, forcing Solo to attempt to drag him to the Falcon. On the way back, they were attacked by Hirken's bodyguard Uul-Rha-Shan. The Tiss'shar gunfighter got off the first shot, but missed Solo and instead took off part of Bollux's head, allowing the Corellian to return fire and kill him. Although Bollux's body was essentially destroyed, the link with Blue Max essentially saved its life—the probe was able to preserve its essential information and basic matrices. After the rescue was completed and the group made it off Stars' End, the Vandangantes gave Bollux a new body and granted it and Blue Max their freedom, and the two droids chose to sign on as part of Solo's crew."}, {"tag": "h3", "text": "Hunting the slavers"}, {"tag": "p", "text": "After joining the crew of the Millennium Falcon, Bollux and Blue Max accompanied Han Solo on a number of smuggling trips across the galaxy, helping out as general labor and aiding the Corellian in any way he needed. Several months after the adventure to Stars' End, the droids found themselves on the desert planet of Kamar, where Solo had set up a lucrative side-business showing a holo called Varn, World of Water to the primitive Kamarian Badlanders, who were astonished by the images of a planet covered in water. The crew of the Falcon were forced to flee after a disastrous attempt to play a different holo resulted in a massive riot, and from there they made their way to Lur, where they had received word that they could find lucrative work. Upon arriving on Lur, they found that the job was actually transporting a shipment of Lurrian slaves, something Solo would not abide. The slavers' ringleader, a man named Zlarb, attempted to force Solo at blaster-point to haul the Lurrian captives, going so far to affix Bollux with a restraining bolt to remove the droid as a factor. However, the slaver didn't account for Blue Max, who remained active inside Bollux's chest cavity, functioning on its own separate power supply. The tiny probe linked itself into Bollux's motor circuitry and managed to puppeteer the much larger droid to activate the Falcon's fire-control systems, causing a distraction that allowed Solo and Chewbacca to turn the tables and take out the slavers."}, {"tag": "p", "text": "Furious at the deception and wanting the 10,000 credits he had been promised for the run, Solo led the crew of the Millennium Falcon on a mission across the Corporate Sector to expose Zlarb's slaving ring and get his money. Their search took them to the planet Bonadan, where Bollux kept watch at the Millennium Falcon as Solo and Chewbacca disembarked to investigate, at one point foiling an attempt by a pair of Corporate Sector Authority agents to break into the Falcon. Bollux kept track of the agents' path away from the Falcon and passed the information onto Solo, who gave chase after directing the droid to find Chewbacca and meet with him at a spaceport cantina. Solo returned with one of the agents in tow: a woman named Fiolla, who had also been investigating the slaving ring, and had been tracking the Falcon not knowing their exact link. With evidence tying the slavers to corrupt elements within the Authority Security Police and information pointing towards the planet Ammuud, the Falcon's crew split company. Solo and Fiolla left to rendezvous with Fiolla's partner, while Chewbacca and the droids proceeded to Ammuud in the Falcon. They were joined by a Tynnan skip tracer named Spray, who was attempting to repossess the Millennium Falcon over an unpaid debt."}, {"tag": "p", "text": "As usual, things didn't go as planned. A catastrophic failure of the ship's archaic fluidic circuitry en route caused a hole in the ship's hull that Bollux had to plug with its own body. Chewbacca managed to patch the breach before all aboard perished, but the Falcon was forced into a rough landing in a mountain range far outside Ammuud's main spaceport. On their final approach, Spray shoved Bollux into an escape pod closer to civilization, ordering the droid to find Solo once he arrived on Ammuud. Spray's timing and aim were poor, and Bollux still landed far from civilization, forcing the old droid to walk a great distance to the spaceport. Upon arrival, Bollux used its unassuming exterior to its advantage: it simply entered through the port's labor-automata check point and posed as a regular working droid, doing various odd jobs around the facility and learning all it could about the area while waiting for Solo to arrive. When Solo and Fiolla finally reached Ammuud on a lifeboat, Bollux shocked the two Humans by appearing suddenly on their craft and filling them in on every detail he had learned on the political events on Ammuud—including the fact that the man they needed to meet, the young Mor Ewwen Glayyd, had agreed to fight a death duel with an offworld gunslinger."}, {"tag": "p", "text": "Solo and Fiolla left Bollux behind with the lifeboat, tasking the droid with repairing the damaged craft and getting it prepared for their departure. Once their business with Glayyd was done—the family, which had done business with the slavers in the past, turned over all their information they had on the criminals after Solo forced the gunman, Gallandro, to stand down—they returned to Bollux and the lifeboat, using the craft to pick up Chewbacca and Spray. Their activity drew the attention of the remaining slavers, but the timely arrival of a Security Police Star Destroyer dealt with them easily. Afterward, it was revealed that \"Spray\" was actually Odumin, an Authority Territorial Administrator working undercover to investigate the slaving ring—briefly holding Odumin for ransom, Solo was able to work out a deal where he came out ahead, and the crew of the Millennium Falcon flew off winners."}, {"tag": "h3", "text": "The treasure of legend"}, {"tag": "p", "text": "The kerfuffle with the slavers ended the crew of the Millennium Falcon's time in the Corporate Sector—the 10,000 credits were soon to follow, as they squandered every bit of it while traveling through the Outer Rim. However, along with the spending spree came new upgrades for Bollux and Blue Max, and the old labor droid obtained a new receiver at its request. For a time, they worked as starship mechanics for Grigmin's Traveling Airshow in the backwater Tion Hegemony, but after falling out with the show's pilot, they ended up making deliveries on the university world of Rudrig. There, they ran into an old friend from Solo's Naval Academy days, Alexsandr \"Trooper\" Badure, who brought them in on a new scheme: tracking down the fabled Queen of Ranroon, the lost treasure ship of the ancient galactic dictator Xim the Despot. Badure and his friend Hasti Troujow had obtained evidence linking the ship to the planet Dellalt, and convinced Solo and Chewbacca, along with a Ruurian scholar of pre-Republic history and languages named S. V. Skynx, to aid their hunt in exchange for a full share of the loot. Bollux attracted a large amount of attention from the natives of the isolated world, who were unused to seeing droids—fascinated by Xim's advanced war droid technology, the labor droid spent much of its time on Dellalt doing as much research as it could on the ancient automata."}, {"tag": "p", "text": "Things went sideways soon after their arrival on Dellalt. First, Troujow was unable to access the log-recorder that her late sister had stashed in in Xim's treasure vaults, then a local criminal named J'uoch and her gang—also interested in the Queen of Ranroon's treasure—stormed the spaceport and stole the Millennium Falcon. That forced their company into a weeks-long march through the mountains on foot, with Bollux serving an important role as a porter due to the lack of a ground vehicle. The trip was especially grueling for Bollux and Blue Max, who were not built for elements that deeply strained their waterproofing systems, and the group had to survive several perilous situations, including navigating a fraught intra-clan rivalry within the aquatic Swimming People of Dellalt. Eventually, Bollux and Blue Max detected a series of weak radio signals that led them to what appeared to be an abandoned landing field deep within the mountains—however, upon closer inspection they found the ships to be fakes, and were overtaken and imprisoned by a group known as the Survivors, primitive, inbred descendants of Xim's honor guard. Bollux and Blue Max were taken and examined separately by the hermit clan, and using a snippet of their pre-Republic dialect stored on one of Skynx's language tapes as a translation aid, managed to work out that Solo and the other organic captives would soon be sacrificed, as the Survivors believed that ritual bloodshed would boost the power of the distress signal the droids had previously detected in the mountains. As the Survivors held droids in some esteem, they bowed to Bollux and Blue Max's request to be reunited with their friends, as they plotted a way out of their predicament."}, {"tag": "p", "text": "Bollux and Blue Max played a crucial part in the escape when the time came, as the small computer probe distracted the awed crowd with a holographic display while the other captives slipped away and grabbed their weapons—Solo, Chewbacca and Badure in turn provided heavy cover as Bollux and Blue Max regrouped with them to flee by sliding down a mountain on a large gong. The group crashed into a large snowbank, but emerged no worse for wear. Reasoning that the presence of the Survivors meant that they had to be close to the location of the treasure, they pressed on, ultimately following a signal picked up by Bollux and Blue Max to the foothills below J'uoch's mining camp. There, they discovered a stunning sight: one thousand fully operational battle droids from Xim's ancient and storied Guardian Corps, the same \"thousand guardians\" that were said to have accompanied the Queen of Ranroon on its final voyage. They arrived in time to see a man Troujow recognized as the assistant steward of Xim's treasure vaults command the droids to attack J'uoch's camp, forcing the team into a desperate push through the ensuing firefight in order to board the Millennium Falcon in time. Having spent much of its time in transit to Dellalt studying the ancient droids, Blue Max had an idea of how to stop the rampaging horde, although it would have required the destruction of the entire corps—wanting a different alternative, Bollux attempted to communicate with the war droids and reason with them, to no avail."}, {"tag": "p", "text": "Instead, the two droids proceeded with Blue Max's plan, using signals learned from Skynx's ancient tapes to order all of the war droids onto an old, rickety bridge at once, causing the bridge to collapse and send them all crashing to their doom into a deep crevasse. Their scheme allowed the Millennium Falcon to get home free, and after the group interrogated the captive assistant steward, they learned that Xim's fabled hoard was within the treasure vaults all along. The crew worked their way through the labyrinthian tunnels and found the hidden treasure, only to discover to their dismay that the Queen of Ranroon actually held war materiel, not gold or jewels—objects like kiirium ingots that, while commonplace in the present day, were tremendously valuable in Xim's time. Nevertheless, it was still a major archaeological discovery, one that Skynx expected would take years to fully sort through. The Ruurian professor offered Bollux and Blue Max jobs aiding him in sifting through the site, and the droids accepted on the spot, thus parting company with Han Solo and the Millennium Falcon. Although Bollux and Solo parted on rather abrupt terms, Solo later found that he missed the droid's company, and Bollux and Blue Max continued to send Solo holocards for several years after their departure."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A 1.5 meter-tall droid with masculine programming, Bollux didn't look like much: over 100 years old by the era of the Galactic Civil War, the droid was beaten-up, stocky, uneven and moved in a stiff, slow manner, and spoke in a leisurely drawl. That slow speech pattern became Bollux's trademark, and he preferred it that way: he found that it gave him more time to think, and made organics perceive him as more easygoing. While Bollux only ever developed a real personality of its own due to a clerical error, but what emerged was a highly personable droid that wanted, more than anything else, to be useful. For Bollux, that drive came out of a fear of its own mortality, as it viewed obsolescence for a droid as akin to death for an organic. However, Bollux found staying useful to be a challenge it faced throughout its existence—the droid was repeatedly rendered obsolete in various positions by newer models, leading it to constantly volunteer for new modifications in a relentless quest for self-improvement. To Bollux, durability, versatility and the ability to do useful work were the most essential means to its survival. And over the years, Bollux always found a place due to its friendly personality and dry wit, which endeared the weathered old droid to many organics."}, {"tag": "p", "text": "After years traveling the galaxy and operating in many different roles, Bollux's journey took it to Doc Vandangante's, where it found a new contentedness and his ever-present companion, Blue Max. Bollux and Blue Max became an unbreakable team, and Bollux developed what could only be described as parental feelings towards the smaller unit. With Blue Max inside of it, Bollux's unassuming exterior often proved to be to its advantage, as it allowed the droid to inconspicuously slip the high-powered computer into highly-secure locations. Bollux even managed to endear itself to Han Solo, who initially scorned the droid as a broken-down misfit before becoming impressed by its ingenuity and spirit. Bollux and Bllue Max took a shine to Solo as well, and wanting to see the galaxy, they saw work about the Millennium Falcon as the surest path to the adventure they craved. Owing to its many years of experience traveling the galaxy, Bollux was a remarkably inventive droid—it had learned how to manipulate its own computations in order to circumvent its programming in life-or-death scenarios. Although prohibited from carrying weapons, harming or deceiving organics, those directives rarely constrained Bollux when the need arose. That knowledge, plus its own creativity, helped Bollux repeatedly find ways to survive in situations that seemed impossible."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The droid \"Bollux\" first appeared in Han Solo at Stars' End, a novel written by Brian Daley and released in 1979, and appeared as a major supporting character throughout The Han Solo Adventures book trilogy. In the original UK release of the trilogy, Bollux was renamed \"Zollux,\" as the original name is homophonous with a colloquial term for the word \"testicles\" in British English, despite having an alternate spelling. In The New Essential Guide to Droids, Zollux was established to be an alias Bollux sometimes used in his travels. Other inconsistencies arose in between different tellings of the Han Solo Adventures stories—in the 1980 comic strip version of Han Solo at Stars' End Bollux is drawn by Alfredo Alcala as a boxy, copper-colored robot, rather than the lanky droid consistently depicted in other sources. Although solely referred to as \"Bollux\" throughout the original novels, the 1993 West End Games roleplaying guide Han Solo and the Corporate Sector Sourcebook, which greatly elaborated on the droid's backstory, was the first to provide Bollux's original designation as \"BLX-5.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}