{"url": "BL-series_Battle_Legionnaire", "categories": ["Category:Legends articles", "Category:Baktoid Combat Automata products", "Category:Mandalorian culture", "Category:Separatist battle droid models"], "nodes": [{"tag": "h1", "text": "BL-series Battle Legionnaire"}, {"tag": "p", "text": "The BL-series Battle Legionnaires were a series of battle droids produced by the Confederacy of Independent Systems for the Mandalorian Protectors during the Clone Wars. Though they were manufactured in a limited, one thousand-unit run only, Battle Legionnaire droids were powerful and lethal in combat. Visually similar in design to Cybot Galactica's 3PO-series and TC-series, their deceptively strong metallic bodies were armed with AAP-II blaster boxes and decorated in the same green livery that was commonly seen on the armor of the Mandalorian Protectors."}, {"tag": "p", "text": "Designed in part by the Mandalorian soldier Fenn Shysa, the Battle Legionnaire droids were bequeathed to the Mandalorian Protectors by the Confederacy following Mandalore's alliance with the Separatist government. The war droids bolstered the Protector's numbers, and acted as front-line troops during battle, assaulting the enemy's forward ranks while the Protectors jetpacked in and struck behind the opponent's lines. The Mandalorian Protectors equipped their Legionnaire droids with ancient battle harnesses, and the droids saw some of the heaviest fighting during the Protectors' campaigns at Kamino and New Bornalex, only to be nearly wiped out at Norval II with the rest of the Protectors. Some survived, however, and during the early years of the Galactic Empire's reign, one Legionnaire droid was owned by the renowned bounty hunter Boba Fett."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A fourth-degree droid, the BL-series Battle Legionnaire was designed as a powerful combat droid. Each Battle Legionnaire was 1.7 meters in height, and similar in overall physical appearance to the 3PO-series of protocol droids manufactured by Cybot Galactica, though the Legionnaire droid was produced by the droid foundries of Baktoid Combat Automata."}, {"tag": "p", "text": "The Battle Legionnaire droids were primarily adorned with a drab green color scheme—matching the color of the Mandalorian armor common among the Mandalorian soldiers with which the Legionnaires fought—though portions of their plating were blue, and marked with gold-colored trim. Their two photoreceptors were typically lit with a gold color, as well. BL-series droids had military-grade balance gyros, and their many joints had been calibrated to allow for maximum torque. As a result, Battle Legionnaire droids could lift thousands of kilograms above their heads, and run at speeds approaching thirty kilometers per hour for more than a day without the need for a recharge. The droids were equipped with signal jammers, and carried an internal first-aid kit within their armored bodies for treating their organic comrades."}, {"tag": "p", "text": "Battle Legionnaire's were capable of wielding hand-held blasters in combat, though they were most often outfitted with deadly Briletto AAP-11 blaster boxes that were strapped to their chests. A number of specialized BL-series droids were armed with ancient Mandalorian battle harnesses, large weapon platforms mounted on twin tank treads and equipped with laser cannons, a heavy blaster cannon, a giant claw arm, and a sonic-pulverizing trip hammer."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the arrival of the former ARC trooper known as Spar on the planet Mandalore, the cultural homeworld of the Mandalorian people, Spar set out to create an army of Mandalorian supercommandos. Drawing from local police forces and former members of the Death Watch splinter group, Spar assembled an army of two-hundred and twelve soldiers known as the Mandalorian Protectors. Spar ascended to the role of Mand'alor, the traditional ruler of the Mandalorian clans, and aligned his world and people with the Confederacy of Independent Systems in a conflict against the Galactic Republic known as the Clone Wars."}, {"tag": "p", "text": "Remembering the role the Mandallian Giants played in Mandalorian forces during the New Sith Wars, Spar commissioned a battalion of droids from their new Separatist allies, awarded with a run of one-thousand BL-series Battle Legionnaire droids, bolstering the Protectors' meager numbers. Designed in part by the Mandalorian Protector Fenn Shysa, who was inspired by a run-in he had with the assassin droid C-3PX, the BL-series was manufactured in the Separatist droid foundries of the Techno Union-owned company, Baktoid Combat Automata. Though the Mandalorians were traditionally ambivalent toward the use of droids, preferring the benefits of their own hard work, the Battle Legionnaire droids were afforded a level of respect similar to the Basilisk war droids used by the ancient Mandalorian Crusaders. During the Mandalorian Protectors' engagements, the Battle Legionnaires saw some of the heaviest fighting; Spar would often use the BL-series droids as heavy front-line units, attacking the enemies forward ranks while the Protectors themselves would jetpack in behind their opponents' defenses and strike with the element of surprise. Several Battle Legionnaire droids were also equipped with Mandalorian battle harnesses, using the deadly weapons platforms to deal out more devastating damage. Because of their effectiveness, the Mandalorian Protectors and their Battle Legionnaire droids became highly sought-after Separatist units, with a reputation for taking down a target in a day that the Confederacy's droid army couldn't in a month."}, {"tag": "p", "text": "The BL-series droids took part in the Mandalorian Protectors' strike against the planet Kamino and the Republic cloning facilities located there, as part of a series of blitzkrieg assaults in retaliation for the death of a prominent Confederacy leader. Prior to the assault on New Bornalex, the Protectors toasted their Battle Legionnaire droids, and though the battle was a victory for the Protectors, their army of BL-series droids suffered significant casualties. On Norval II, during an attempt to capture the Republic senator Padmé Amidala, the Mandalorian Protectors were led into a trap and ambushed by the Republic's clone army. The vast majority of the Mandalorian Protectors were killed in the ensuing conflict, and all but a few Battle Legionnaire droids shared their fate."}, {"tag": "p", "text": "One of the few Legionnaire droids to survive, BL-17, was acquired by the bounty hunter Boba Fett, and was put to work as the culturally estranged Mandalorian's aide during the early days of the Galactic Empire's reign. However, BL-17 came to an end on the planet Boonta in 15 BBY, following a skirmish with the droids C-3PO and Proto One. In the years after the Battle of Endor, rumors floated about of a belligerent 88-series droid that possessed the head from a BL-series droid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The BL-series Battle Legionnaire droid was first introduced in the Star Wars Insider article, The History of the Mandalorians, written by Abel G. Peña and published in the magazine's eightieth issue in March of 2005. The article retconned the appearance of the Star Wars Droids character BL-17 as a member of the Battle Legionnaire line, and detailed the history of the droids, including their connection to the Mandalorians. The Battle Legionnaire droids received further mentions in Daniel Wallace's The New Essential Guide to Droids and the Galaxy at War sourcebook, in addition to The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}