{"url": "Retwin", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Death Squadron personnel", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males", "Category:Ralltiiri"], "nodes": [{"tag": "h1", "text": "Retwin"}, {"tag": "p", "text": "Chief Retwin was a Human male from the planet Ralltiir. A former Imperial sympathizer who worked for his homeworld's defense forces, Retwin joined the Empire after the Imperial subjugation of Ralltiir shortly before the Battle of Yavin. Retwin later served aboard the Super Star Destroyer Executor, the personal flagship of the Dark Lord Darth Vader, during the Imperial subjugation of Bespin's Cloud City in 3 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Imperial sympathizer"}, {"tag": "p", "text": "The Human male Retwin was a native of the prosperous Core World Ralltiir. By the time of the Galactic Empire, Retwin, an Imperial sympathizer, worked for his homeworld's defense forces. Three weeks prior to the Battle of Yavin, Emperor Palpatine ordered a brutal subjugation of Ralltiir to silence local pro-Rebel sentiment. Retwin joined the Empire following Ralltiir's subjugation."}, {"tag": "h3", "text": "Service aboard the Executor"}, {"tag": "p", "text": "Retwin later served as a chief aboard the Super Star Destroyer Executor, flagship of the Imperial Navy and the personal command ship of the Dark Lord of the Sith Darth Vader. In 3 ABY, during the Imperial subjugation of Bespin's Cloud City, Retwin was present aboard the Executor's bridge as Vader pursued the fleeing Rebel fugitives Luke Skywalker, Princess Leia Organa, and Lando Calrissian in their starship, the Millennium Falcon."}, {"tag": "p", "text": "Retwin witnessed the Rebels' eventual escape into hyperspace as they eluded capture at Vader's hands. Those aboard the bridge expected Vader to angrily execute Admiral Firmus Piett, the Executor's commanding officer, for allowing the Rebels to escape, as the Dark Lord had done previously with other officers, but Vader simply stalked off the bridge in defeat, too distracted to kill his admiral. Standing by in silence with eyes down and working on a datapad, Retwin only turned to gaze momentarily as Vader passed by his position at the rear of the bridge."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Retwin was a highly skilled saboteur who sympathized with the Galactic Empire while working for Ralltiir's defense forces. He had dark hair and light skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Chief Retwin wore a black Navy crewman uniform during his service aboard the Executor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Retwin appeared in the 1980 film Star Wars: Episode V The Empire Strikes Back. He is the final Imperial character focused on-camera in the film as he pauses from his work to peer at the passing Darth Vader following the Rebels' escape from Bespin."}, {"tag": "p", "text": "The Retwin character was first named and given a brief backstory on the \"Chief Retwin\" card from the November 1997 Cloud City Limited expansion set of the Decipher, Inc. Star Wars Customizable Card Game. According to a Star Wars CCG fan site, Retwin was named as an anagram of former Decipher employee Jason Winter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}