{"url": "Revan%27s_mask", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Articles with conjectural titles", "Category:Combat headgear", "Category:Jedi artifacts", "Category:Mandalorian armor", "Category:Sith artifacts"], "nodes": [{"tag": "h1", "text": "Revan's mask"}, {"tag": "p", "text": "During the early skirmishes of the Mandalorian Wars, this mask belonged to a Mandalorian female. In 3973 BBY, the mask remained on the shores of the Outer Rim planet Cathar after the woman's death during the Mandalorians' attack on the world. Ten years later, the mask was pivotal in the Jedi Knight Revan's efforts to find evidence of the Cathar species' genocide; Revan claimed the woman's mask as his own, vowing not to remove it until the Mandalorian Neo-Crusaders were defeated permanently. One year after Revan and his faction of Jedi successfully defended the Galactic Republic and vanquished the Mandalorians, Revan declared himself the new Dark Lord of the Sith and ignited the Jedi Civil War. Darth Revan wore the mask up until his capture by the Jedi Order."}, {"tag": "h2", "text": "Usage"}, {"tag": "p", "text": "This mask was originally worn as a part of a Mandalorian female's armor, and had a red and gray color. Ten years after her death during the Mandalorians' genocide of the Cathar people on their homeworld in 3973 BBY, the mask was claimed by the Jedi Knight Revan and was immediately donned by the Jedi. Revan continued to wear the mask as he led the Galactic Republic to victory against the Mandalorian Neo-Crusaders. After becoming a Sith Lord under the tutelage of a Sith Emperor and eventually declaring himself the new Dark Lord of the Sith, Darth Revan wore the mask as part of his personal armor, up until his capture by the Jedi Order and Republic forces in 3957 BBY. Revan wore the mask once more on Dromund Kaas when he confronted the Sith Emperor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the early battles of the Mandalorian Wars, this mask was worn by a Mandalorian female who was present during the Mandalorian Neo-Crusaders' devastation of the Outer Rim world Cathar. After driving the Cathar people into the sea, the woman tried to convince Cassus Fett—who led the attack against the planet—not to kill the Cathar, believing that they had been sufficiently defeated. However, Fett refused and ordered his Mandalorians to exterminate the Cathar; the woman died trying to defend the Cathar as they were slaughtered, and her mask washed up on the shores of the planet."}, {"tag": "p", "text": "Ten years later, the Jedi Knight Revan, his friend and fellow Jedi Knight Malak, and their faction of Jedi were on Cathar searching for evidence of the Mandalorians' slaughter of the Cathar people. Vrook Lamar, a member of the Jedi High Council, and a team of Council loyalists arrived on planet and confronted the Revanchists, ordering them to abandon their efforts. During the discussion, Revan noticed the mask which had belonged to the Mandalorian woman and picked it up. When light shone on the mask, all of the Jedi present experienced a vision through the Force of the battle that had taken place a decade prior. After the vision's completion, Revan recognized that the Mandalorian female tried to defend the Cathar and perished as a result of the Mandalorians' desire to massacre defenseless civilians. In honor of her sacrifice, Revan donned her mask, vowing not to remove it until he and his followers brought the Mandalorians to justice."}, {"tag": "p", "text": "Revan continued to wear the mask throughout the conflict, which concluded with the near extermination of the Mandalorians in the war's final battle at Malachor V in 3960 BBY. The two Jedi Knights then fell to the dark side of the Force under the guidance of the Sith Emperor; although Revan eventually declared himself Dark Lord of the Sith, with Malak becoming his Sith apprentice, and thus establishing their own Sith Empire. Revan continued to wear the mask during the Jedi Civil War until Malak betrayed and left his Master for dead in 3957 BBY. When Revan's comatose body was recovered by the Jedi strike team sent to capture him, the Jedi Council repaired the Sith Lord's damaged mind and saved his life, but also reprogrammed him with an artificial persona, one who was loyal to the Galactic Republic and the Jedi Order."}, {"tag": "p", "text": "Unbeknownst to even the Jedi Council, Bastila Shan, the leader of the Jedi strike team that captured Darth Revan, recovered the mask and hid it for many years. She feared that the mask would not only cause Revan to regain all of his lost memories, but would also restore his original persona, as well as the dark side within him. After Revan disappeared, the Jedi Exile Meetra Surik set out to find him. Before she left, Shan gave the mask to her with instructions to give it to Revan. Surik eventually found Revan on the Sith world Dromund Kaas. After the mask was given to Revan by Surik, all of his memories came back to him."}, {"tag": "p", "text": "After Revan's defeat at the hands of the Sith Emperor, the mask remained the property of the Sith for centuries. During the Cold War era, it was in possession of the rogue Sith Lord Grathan until it was stolen by the Revanites, a Sith cult dedicated to emulating the life and teachings of Darth Revan. After Revan was freed from his prison he reacquired the mask and wore it once more, until he was confronted by a Sith strike team at The Foundry. The mask was damaged during his defeat, with a deep vertical scratch scarring the left part of the mask and crossing the eye slit. His body controlled by the dark half of his spirit, Revan wore the mask with his tattered robes until being confronted by Republic and Imperial champions on Yavin 4. After he was defeated and the two halves of his spirit were reunited, Revan's physical body faded away, leaving his mask, lightsaber, and tattered robes behind."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Revan's mask first appeared in the 2003 Xbox and PC video game Star Wars: Knights of the Old Republic, developed by BioWare. The backstory of how Revan acquired the mask was explained in the standalone comic Masks, which was the forty-second issue of the Star Wars: Knights of the Old Republic comic series, written by John Jackson Miller. The mask was featured in a preview for BioWare's upcoming PC game Star Wars: The Old Republic that was released on the game's official website. In the video, the player-controlled character fights to shut down an ancient complex that was constructed by Darth Revan during his tenure as a Sith Lord. Near the end of the video, the scene cuts to what appears to be a tomb and Revan's mask lying in front of it. While both Star Wars: Knights of the Old Republic and Masks portray the helmet as having been colored red and gray, various artwork depicts the mask as having been only red."}, {"tag": "p", "text": "Revan's mask was featured on Hasbro's action figure of Darth Revan in the third quarter of 2007. The mask was also featured on Revan's miniature figure in The Force Unleashed set of Star Wars Miniatures, released on November 16, 2007. In 2009, the mask was a part of Mighty Muggs' figure of Darth Revan. A minature bust of Darth Revan, which features the mask, was released in January 2011 by Gentle Giant Studios."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}