{"url": "Rexa_Go", "categories": ["Category:Canon articles", "Category:Cyborgs", "Category:Females", "Category:Humans", "Category:Mercenaries"], "nodes": [{"tag": "h1", "text": "Rexa Go"}, {"tag": "p", "text": "Rexa Go was a human female mercenary equipped with a AJ^3 cyborg construct who served the crime lord 0-0-0 after he took over control of the Son-tuul Pride. She accompanied doctor Chelli Aphra to attack an Imperial settlement on Someilk, which they incinerated. After, Aphra complained to Go about the destruction of the settlement and Go informed their master, 0-0-0. Go then led Aphra to meet her new team of mercenaries to take to Skako Minor. After leaving one mercenary behind, Aphra took Go and the others to the planet to investigate the workshop of Wat Tambor. Their guide, Hallio Bas led them into an Imperial trap but Aphra used an explosive Tooka to save them. They then entered the workshop and were ambushed by more Imperial forces led by Magna Tolvan. This awoke a Chthonic worm god which wiped out the Imperials before being killed by falling rubble. After, Go found Aphra and Tolvan together. Wanting Tolvan to escape, Aphra shot Go and took her cyborg construct."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Raid on Someilk"}, {"tag": "p", "text": "Sometime after the Battle of Yavin, Rexa Go was part of the Son-tuul Pride crime syndicate, which had recently been taken over by the assassin droid 0-0-0. 0-0-0 also recruited Chelli Aphra, an old ally who he threatened to kill if she refused to work for him. He sent the two to Someilk with a number of armed criminals to attack a settlement for the clone wars era data stored there. After they landed, Go brought out her Z-6 rotary blaster cannon and mowed down the defending stormtroopers. One Imperial, Magna Tolvan, shot at Aphra from cover but Go fired at her, pinning her down."}, {"tag": "p", "text": "Go followed the other criminals into the base while Aphra dealt with finding a get-away transport. They retrieved the data they needed and returned to their landing point, where Aphra was waiting with an LAAT/le patrol gunship. After taking off, Aphra was surprised that Go had let the settlement's personnel live. Go then detonated their original landing pod, incinerating the settlement. Aphra complained about this and, when they returned to Son-tuul, she had Go lodge a complaint to 0-0-0 about this."}, {"tag": "h3", "text": "Traps on Skako Minor"}, {"tag": "p", "text": "A short while later, Go led Aphra towards the Son-tuul Spaceport, with 0-0-0's hologram, on Go's head, informing her of their new mission, which was to search for his memories in the workshop of Wat Tambor. For the mission, a number of mercenaries had been hired to help the pair. Go led Aphra into their ship to meet them. After seeing her new allies, Aphra was informed by Go that she needed to choose one of them to be left behind. This requirement was catalyzed by the sudden presence of Imperial troops closing in on the ship. Go suggested Aphra's mysterious crate or her Tooka, but Aphra instead left the mercenary Violet Ghost behind to fight the stormtroopers."}, {"tag": "p", "text": "Aphra flew the mercenaries to Skako Minor, the planet where Tambor's workshop was based. Their Skakoan guide, Hallio Bas led them through the forests while praising Tambor and the Techno Union. Go reminded the mercenaries that their \"paymaster\" had first dibs on the ruins. However, as they approached the entrance of the workshop, the mercenaries found themselves surrounded by stormtroopers. Bas revealed himself to have turned them in to the Empire and demanded his side of the deal from them, which the Imperial commander refused. Aphra, though, gave her Tooka to Bas and stepped back, reciting the codephrase \"Codeword: Snugglebum Oogiewoogie\". This made the Tooka explode, wiping out the Imperials. Go asked Aphra if the Tooka was customized, which Aphra confirmed."}, {"tag": "p", "text": "Aphra decided to open her crate, which the other mercenaries assumed carried booze. Go took the lid off, revealing sixty shrink-frozen Tooka's. When she asked if they were all explosive, Aphra replied with the affirmative. A surviving stormtrooper then ran past the mercenaries. Go ordered Tam Posla and Caysin Bog to stop him, but they refused, claiming the trooper had broken no law. The mercenary Glahst Ombra then attacked the stormtrooper at the tree line and began feasting on them."}, {"tag": "h3", "text": "Death in the hands of allies"}, {"tag": "p", "text": "The mercenaries entered the workshop and began investigating the devices around. Aphra looked through the database for 0-0-0's memories. However, an Imperial Delta-class T-3c shuttle then smashed through the ceiling and deployed a squad of stormtroopers led by Magna Tolvan, who had survived her last encounter with Go on Someilk. They opened fire on the mercenaries, who immediately took cover. Suddenly, a large beast, the Chthonic worm god, awoke from being landed on by the shuttle and attacked the stormtroopers. Aphra threw her Tooka at the worm god and detonated it with the codephrase. The beast then chased her and Tolvan into a small crawl space."}, {"tag": "p", "text": "With the worm god distracted, Go fired at it and ordered the mercenaries to assist. Ombra ignored her and decided to desert the group while Posla claimed the beast had broken no law. Sister Six then pointed out that Bog was now dead and Posla mobilized his cybernetic weapons to assist Go. Bog, though, woke up again and Posla resumed to staying behind cover. The droideka Dek-Nil then shot the tip of a stalactite, causing fluids to land on a stormtrooper. That stormtrooper misfired his missile launcher, severing an entire stalactite, and rubble came down on the worm god, killing it. Aphra congratulated the team and prompted them to keep looting. When she disappeared behind the rubble, Go followed her and found her with Tolvan. She attempted to kill the Imperial, but Aphra shot her."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Aphra took Go's cyborg construct with her, using it to contact 0-0-0. During the infiltration of Hivebase-1 she used it to activate a contingency order in Bog, as well as control the rebel ship Lucrehulk Prime through a bug she had planted in it's control core. 0-0-0 eventually found out about Go's death, but Aphra changed the subject before he could deal with her."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rexa Go was a human female with light skin and green eyes. The few hair she had was black and she had a pink dot on each cheek. Go gave no expression in her conversations and always stated the type of statement before saying it. As well as this, Go always enforced 0-0-0's orders on Aphra and the mercenaries, reminding them of some of these multiple times."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Rexa Go wore a pink shirt and green jacket as well as fandango pink jeans and black boots. On her head was a AJ^3 cyborg construct, which she used frequently to present holograms above her head. She also possessed a Z-6 rotary blaster cannon for combat purposes and carried a large cylinder like container on her back."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rexa Go first appeared in the canon comic Doctor Aphra 14, written by Simon Spurrier and penciled by Emilio Laiso."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}