{"url": "Rex%27s_BTL-B_Y-wing_fighter-bomber", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Ship stubs", "Category:Galactic Republic starships", "Category:Unidentified starfighters", "Category:Y-wing starfighters"], "nodes": [{"tag": "h1", "text": "Rex's BTL-B Y-wing fighter-bomber"}, {"tag": "p", "text": "A BTL-B Y-wing fighter-bomber was utilized by the Galactic Republic toward the end of the Clone Wars. The BTL-B Y-wing starfighter/bomber was aboard the Venator-class Star Destroyer Tribunal when the Star Destroyer was used to transport the former Sith Lord Maul after his capture during the Siege of Mandalore. After the execution of Order 66, which turned the clone troopers aboard the Tribunal against the former Jedi Padawan Ahsoka Tano, she managed to remove the inhibitor chip of Clone Commander Rex. The two attempted to escape the Star Destroyer, which fell out of hyperspace over a moon after Maul destroyed its hyperdrive. Searching for a functional vessel, Tano spotted the Y-wing and used the Force to push him over to the starfighter as the clones fired upon them. As the Tribunal broke apart as it fell toward the moon, the Y-wing dropped from the hangar and spun out of control before Tano could reach it. With Rex piloting the starfighter, Tano managed to maneuever through the falling debris and jump aboard the Y-wing before the Tribunal hit the ground. Rex landed the Y-wing at the crash site, where the two salvaged the astromech droid R7-A7 and buried the clones that had died in the crash."}, {"tag": "p", "text": "After the Republic was reformed into the Galactic Empire, Rex continued to utilize the Y-wing as he sought to fight back against the new regime. When he met the former clone commandos of the Bad Batch on the junk planet Bracca so that they could use the medical facilities of a wrecked Star Destroyer to remove the Batch's inhibitor chips, Rex landed the Y-wing inside the remains of another vessel. When the Bad Batch arrived, they landed their transport, the Havoc Marauder, beside the Y-wing, disembarking to follow Rex to their destination."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}