{"url": "Reversal_of_Fortune", "categories": ["Category:Real-world articles", "Category:Webstrips"], "nodes": [{"tag": "h1", "text": "Reversal of Fortune"}, {"tag": "p", "text": "Reversal of Fortune was a series of daily webstrips published on Hyperspace October 2004 through June 2005, written by Paul Ens and illustrated by Thomas Hodges."}, {"tag": "p", "text": "The story takes place in the last days of the Clone Wars. As of Celebration IV, a print version of Reversal of Fortune was being considered."}, {"tag": "h2", "text": "Plot"}, {"tag": "h3", "text": "Strips 1-24"}, {"tag": "p", "text": "Commerce Guild President Shu Mai arrives on Felucia, where she meets with the Administress of the Commerce Guild. Shu Mai says that the Separatist Council will be under the personal care of General Grievous for the remainder of the Clone Wars, and that Grievous will soon conquer an Outer Rim world to host the Council."}, {"tag": "p", "text": "Meanwhile, as Shu Mai and the Administress travel in their landspeeder to Mai's fortress, Jedi Knights Zonder and Barriss Offee hide on the side of the road, and once they spot Shu Mai, Barriss begins to contact the Republic. Zonder warns her that the forces there will detect any signals sent, but she does it regardless, claiming the importance of Shu Mai's presence being known to Jedi Council. As she begins to send out the signal, a group of B1-Series battle droids approach and destroy the Jedi's transmitter, but they themselves are soon destroyed by Zonder. The two Jedi head to the Executive Landing Platform, where the nearest transmission facility is, dodging droidekas along the way. They are soon caught up in a group of battle droids however, and are arrested."}, {"tag": "p", "text": "Less than an hour later, Shu Mai speaks with a hologram of General Grievous, who tells her to come to Belderone, the Separatist Council's new home. Mai informs the General of the two Jedi, but he assures her that no one in the Republic knows of their plans on Belderone. He signs off, and Shu Mai immediately contacts Nute Gunray, Viceroy of the Trade Federation. She asks if he could take her in a convoy to Belderone to ensure her safety. He pretends to know what she's talking about, and says he can't waste any time getting there. Shu Mai anxiously heads to her personal shuttle to fly to Belderone by herself."}, {"tag": "h3", "text": "Strips 25-34"}, {"tag": "p", "text": "On Coruscant three days later, the Jedi are meeting with Supreme Chancellor Palpatine. They stress to him that the war is at a stalemate and that they must go after the Separatist leadership if they are to make any progress. Believing Count Dooku to be on Tythe, the Jedi and Palpatine agree to send Generals Obi-Wan Kenobi and Anakin Skywalker to hunt him down while they assign other Jedi generals throughout the galaxy to apprehend the rest of the Separatist leadership."}, {"tag": "h3", "text": "Strips 35-39"}, {"tag": "p", "text": "On the planet Utapau, General Grievous meets with Pau'an leader Tion Medon, ordering him to prepare for the arrival of the Separatist leaders as well as large supplies of \"equipment\"."}, {"tag": "h3", "text": "Strips 40-54"}, {"tag": "p", "text": "The Republic cruiser Intrepid is en route to Felucia. Aboard, General Aayla Secura and Commander Bly discuss their upcoming mission as they spar. In the midst of the match, they come across Padawan Ekria, a slicer recently assigned to their unit. Ekria informs Aayla and Bly that she has located Barriss Offee. As Bly brainstorms their mission plan, Aayla receives a message from Yoda on her subspace receiver beacon informing them of the attack on Coruscant. Aayla orders Bly to change their course for Coruscant, but he and Ekria convince her that they are too far out of range to be of any help and that capturing Shu Mai may prove more useful."}, {"tag": "h3", "text": "Strips 55-59"}, {"tag": "p", "text": "On Coruscant, Jedi Masters Shaak Ti and Stass Allie are searching for Chancellor Palpatine. They come across Senators Organa, Mon Mothma, and Amidala who are being stopped from leaving the Senate Building. Allie lends them her speeder to allow them to reach a nearby shelter."}, {"tag": "h3", "text": "Strips 60-74"}, {"tag": "p", "text": "On Felucia, Aayla, Ekria, and Bly break into the Separtist facility holding Barriss and Zonder. Fighting through a small number of droid guards, they free their comrades. On their way out, however, they discover a legion of Separatists waiting for them outside of the facility. Bly and Zonder conclude that they must go up and the group moves to the roof. There, Bly is able to knock out the base's deflector shield, allowing for the rest of the clone troops to assault the base and extract them. They make their way to Shu Mai's compound at Kway Teow."}, {"tag": "h3", "text": "Strips 75-84"}, {"tag": "p", "text": "Meanwhile on Coruscant, Master Allie takes a gunship to Palpatine's bunker. They are soon followed by a speeder bike piloted by Padawan Drake Lo'gaan. Drake comes across two IG-100 MagnaGuards and briefly engages them. They are quickly dispatched, however, by the arrival of Allie and her clone commandos. Entering the bunker with Allie and her clones, Drake encounters Mace Windu, and, moments later, a bound Shaak Ti and the body of Roron Corobb, Drake's Master, slain by General Grievous during the cyborg's escape with the Chancellor. Lo'gaan cradles his former Master's body in his arms."}, {"tag": "h3", "text": "Strips 85-109"}, {"tag": "p", "text": "Back on Felucia, the Jedi and clones have reached Shu Mai's compound. After clearing the perimeter guards, they approach on speeder bikes and are soon under fire of droid starfighters. Before the fighters can attack, however, they are engaged by clone-piloted ARC-170 starfighters. As the speeders pass the nearby river, the Jedi leap off of the bikes and ride the river down a waterfall, eventually swimming into Shu Mai's compound. They discover that their mission has been in vain as Shu Mai had left days before. Ekria brings the HoloNet back up and they discover that the battle on Coruscant has ended. Suddenly, Aayla receives a message from Bly. Upon entering the compound, the clone troopers encountered a toxic compound that is incapacitating them. Seconds later, Ekria discovers that the compound is about to self-destruct. The Jedi flee the building as it explodes."}, {"tag": "h3", "text": "Strips 110-119"}, {"tag": "p", "text": "On Utapau, Shu Mai voices her doubts about the future of the Separtist movement alongside the gripes of the other leaders. Grievous arrives and announces that they will be traveling to Mustafar for their own safety."}, {"tag": "h3", "text": "Strips 120-124"}, {"tag": "p", "text": "Meanwhile, Aayla transmits a report of her progress to Master Windu. She tells him of a biological agent that was released upon the destruction of Shu Mai's compound, a deadly agent that could contaminate Felucia's water within days, killing the world's populace. She is interrupted by a transmission from Commander Cody..."}, {"tag": "h3", "text": "Strips 125-134"}, {"tag": "p", "text": "In the Jedi Temple, Drake meets the hero of the Republic, Anakin Skywalker. He requests that Anakin take him to face Grievous, hoping to get the chance to avenge his master's death. When Anakin informs him that Master Kenobi has already departed on that very mission, Drake expresses his disbelief that anyone other than Anakin would be sent for such a task. Anakin meets with Allie and informs her of her next mission to Saleucami. He also thanks her for lending her speeder to Amidala earlier and sends Drake on the next transport to Felucia."}, {"tag": "h3", "text": "Strips 135-169"}, {"tag": "p", "text": "On Felucia, Aayla decides that a ground attack on the remaining Separatist strongholds would be most effective. They separate into several groups, each assigned separate targets, with Aayla and Bly in one group, Barriss leading another, and Drake, Ekria, and Zonder leading the last. The Padawans are the first to reach and infiltrate a station. From there, Ekria discovers a priority transmission going to Bly. She also manages to tap into the helmet cams of the clones. The Padawans can only watch in horror as Aayla is gunned down by her own troops. They discover that the transmission consisted of something called \"Order 66\". They also receive a message from Palpatine with news of the end of the war and orders for all Jedi to return to the temple. On the clone camera, the Padawans see the clones combat ready and closing in on an all too familiar door..."}, {"tag": "p", "text": "End"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}