{"url": "Revolution_(political_movement)", "categories": ["Category:Legends articles", "Category:Political factions"], "nodes": [{"tag": "h1", "text": "Revolution  (political movement)"}, {"tag": "p", "text": "Revolution is a type of political movement, generally used in reference to people trying to fight against the current government, with the intent of either creating a new government to their liking, or otherwise causing anarchy. People who participate in revolutions are generally called revolutionaries. In some cases, those who adhere to revolution also engage in terrorism as well as using violence to get rid of the reigning government. In some cases, the revolutionaries still call themselves such even after taking over the government and/or creating the government in question."}, {"tag": "p", "text": "The anarchist group Revolutionary Edge Brigade was considered a revolutionary group, and often engaged in bank robberies and various forms of terrorism during the Old Republic."}, {"tag": "p", "text": "During the lead up to the Naboo Crisis in 33 BBY, the Revolutionary Purist Council took over Ootoola by murdering their monarch due to the latter not being considered \"pure enough.\""}, {"tag": "p", "text": "The Rebel Alliance, as well as their fight against the Galactic Empire, was referred to as revolutionaries as well as a revolution, respectively, by either the Empire itself or neutral parties such as then-smuggler Han Solo shortly after rescuing the Rebel leader, Alderaanian princess Leia Organa. They also inspired similar revolutionary movements, a notable example being the Drogheda Revolutionaries post-Battle of Endor. After taking over the Imperial Palace, they also proceeded to loot and massacre several of the servants inside."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Revolutions played a large role in the creation of the Star Wars trilogy, especially with the Rebel Alliance, with the story treatment notes for Star Wars (then-titled The Star Wars) made by series creator George Lucas in 1973 stating, among others, \"Theme: Aquilae is a small independent country like North Vietnam threatened by a neighbor or provincial rebellion, instigated by gangsters aided by empire. Fight to get rightful planet back. Half of system has been lost to gangsters . . . The Empire is like America ten years from now, after gangsters assassinated the Emperor and were elevated to power in a rigged election . . . We are at a turning point: fascism or revolution\". Lucas as well as former associate of American Zoetrope Walter Murch have repeatedly implied since the 1973 story treatment that the former's primary inspiration for the Rebel Alliance had been the South Vietnamese communist revolutionary group Viet Cong during the Vietnam War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}