{"url": "Revwien/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conflicting sources", "Category:Botanical sentient species", "Category:Outer Rim Territories species", "Category:Revwien"], "nodes": [{"tag": "h1", "text": "Revwien"}, {"tag": "p", "text": "The Revwiens were a sentient, plant-like species. Their bodies were cylindrical and mounted atop several strong, prehensile leaves, which were used both for locomotion and manipulation of objects. A cluster of tiny budstalks connected a round, clear seedcase to the top of the body. Revwiens came in a variety of colors, including blue, green, orange, purple, red, and yellow. Their striated leaves ranged from dark green to purplish-black."}, {"tag": "p", "text": "The Revwiens were indigenous to Revyia, a planet on the northern edge of the Outer Rim Territories. Their homeworld was covered in jungle and plains, and the Revwiens came to revere the jungle belt as sacred. They developed a philosophy known as the Tyia, which emphasized spiritual unity between individuals. Adherents of the Tyia developed the ability to manipulate the Force. Revwien society was organized into small autonomous, semi-nomadic groups. Their technological innovation centered around plants, which they used for myriad purposes."}, {"tag": "p", "text": "Revyia received only light traffic due to its isolation and attracted little trade. Following the execution of many Jedi by the Galactic Empire during Order 66 at the end of the Clone Wars, many Revwien Tyia left their homeworld to aid any fugitive Jedi they could track down. The Tyia was one of the few Force-sensitive organizations that openly operated during this time, although most Revwiens avoided conflict with the Empire. From then onward, Revwiens made their way to such diverse locations as Fornax Station, Harix, and Tatooine. During the Galactic Civil War, the Revwien Wuwuhuul joined the Alliance to Restore the Republic and participated in a mission to the planet Goratak III."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Revwiens were a species of plant-like sentients. The central trunk of a Revwien body was cylindrical, with a slight bulge at the lower end. The stalk was lightly ribbed and separated into five vertical portions; its color was either red, orange, yellow, green, blue, or purple. Stored within the chamber of the central trunk were all the vital organs. Underneath the stalk grew a dense mass of thin, flexible, short appendages."}, {"tag": "p", "text": "Arrayed at the base of the trunk were between six and eleven leaves. These strong fronds were adapted for seizing, grasping, and manipulating items. They also had an ambulatory function; normally four or more were in use for movement and other support. These leaves could hoist the central trunk off the ground to a height between one-third to two-thirds of the height of the central stem itself. This resulted in an average height for Revwiens of between one to two meters. The base leaves came in colors that ranged from red and dark green to purplish-black and had striations that ran down their length. The leaves terminated in two strands that gave the appearance of fingers. Some Revwiens also had smaller leaves that sprouted from the top of the central trunk, although these leaves were shorter and remained one strand through to their termination."}, {"tag": "p", "text": "An ovoid, clear, seedcase was attached to the top of the trunk by a cluster of tiny budstalks that doubled as visual organs. Further sensory data was obtained through the species' leaves, which sensed fine vibrations and allowed for an analog to hearing. The leaves also provided Revwiens with the senses of touch and smell. The Revwiens gained sustenance from carbon dioxide and soil nutrients—typically dissolved in water—via a chlorophyll analog. The conversion of these materials into usable forms was powered by sunlight."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "Culture and temperament"}, {"tag": "p", "text": "Revwiens were peaceful beings who valued honor. They were often unfalteringly honest, even when faced with situations in which bending the truth would produce tangible benefits. Revwiens tried to negotiate their way out of conflicts and took an extremely long-term view of issues, as reflected in the popular Revwien idiom that \"In time, things will work out as intended.\" Many Revwiens also exhibited fatalistic tendencies, believing that all things happened for a reason. When no alternative to battle could be found, Revwiens fought with honor, refraining from taking unfair advantage of their enemies."}, {"tag": "p", "text": "Very little perturbed Revwiens, who showed a remarkable ability to remain calm in stressful situations. However, they did became nervous around overly aggressive or violent individuals, and they found death an unsettling concept. Some Revwiens were also ill at ease in the company of other sentient beings who casually cut down plants for use in construction and for materials."}, {"tag": "p", "text": "Only very infrequently did Revwiens wear clothing; however, they did use other accessories for decorative or practical purposes. For instance, some Revwiens wore ribbons and amulets around their central trunk. A number of Revwiens wore amulets that were representative of the Tyia philosophy. These talismans had a triangular centerpiece to which were attached green or opalescent beads, as well as green discs. Those Revwiens who lived offworld for long periods took to wearing belts for the purposes of carrying weapons, credits, and other assorted items."}, {"tag": "h3", "text": "Social organization"}, {"tag": "p", "text": "Revwien society was generally organized into small, self-governing communities that lived in groves in the wilds of their homeworld, Revyia. These communities were semi-nomadic, with annual migrations to lakes and rivers. Individuals largely lived in irenic coexistence. This peace was disturbed on occasion by herds of herbivorous creatures that preyed on Revwiens. In order to ward off these threats, some communities domesticated carnivorous animals, such as the large, wolf-like urpine."}, {"tag": "p", "text": "There were two main exceptions to the unorganized Revwien social system. Firstly, Revwien universities were the sole formal institutions on Revyia. Tuition was conducted in meadows and open woods and produced excellence in learning. Revwiens characteristically spent their lives learning and sharing knowledge with others. Secondly, following the establishment of a small Imperial base on Revyia, the Revwiens set up a formal starport and customs station. Known as Revyia Station, this was the only settlement on the planet worthy of being called a city. An offworld institution linked with the Revwiens was the Revwien Comedy Academy Playhouse, located in the prominent Uscru Entertainment District of the galactic capital, Coruscant, in 22 BBY."}, {"tag": "h3", "text": "Technology"}, {"tag": "p", "text": "Revwien technological innovation centered around cultivating and utilizing plant life. Revwiens made use of plants as adhesives, as well as for healing salves and generating light. Other plants were used to forecast the weather; users interpreted color changes for predictive purposes. Revwiens also utilized plants in place of more conventional weapons. For instance, the Vognallian seed pods were thrown in a similar fashion to fragmentation grenades. The seed pods exploded when hurled, and propelled sharp seeds in all directions. Revwiens had a child-like curiosity about offworld technology, and they happily used it alongside their own indigenous innovations, even if they did not understand how the former functioned; however, problems often arose with automated pruning droids, such as the 5T Tree Feeder. Despite some familiarity with starships, Revwiens found it strange to see them in their own skies."}, {"tag": "h3", "text": "Tyia philosophy"}, {"tag": "p", "text": "During much of the galaxy's history, Force-sensitive Revwiens withdrew to the jungles to study the Tyia philosophy—\"tyia\" was the Revwien word for \"breathe.\" The central tenet of the Tyia philosophy concerned a spiritual unity between individuals. It taught that individuals should seek personal harmony with their \"Tyia,\" which would allow numerous \"Tyia\" to form a \"Thuwisten,\" namely, a bond-circle formed through the joining of spirits. The Thuwisten would then be complete in utter harmony. Due to this central precept, followers of the Tyia philosophy were called Thuwistens. The Tyia philosophy also emphasized peace and respect for all life."}, {"tag": "p", "text": "Thuwisten on Revyia spread their beliefs to all who were receptive; however, despite its long history, the religion only became widely known in the galaxy around the time of the Galactic Empire. This evangelization was triggered by the killing of Jedi after the declaration of Order 66 during the Clone Wars; following these deaths, many Thuwisten were sent into the galaxy to seek out and aid any remaining Jedi. The Tyia was one of a small number of Force traditions that was openly practiced under the Empire; its practitioners largely avoided conflict with Imperial forces."}, {"tag": "p", "text": "By 17 ABY, Luke Skywalker, a Jedi Master and leader of the New Jedi Order, was aware of the Tyia philosophy, which he considered to be a manifestation of the Force, analogous to Allyan magic from Dathomir or the Fallanassi adepts. Thuwisten manifested many skills similar to those of Jedi, such as healing skills, telekinesis, and telepathy.}} Thuwisten typically did not use lightsabers, although there were some exceptions."}, {"tag": "p", "text": "Some Revwien Thuwisten fell to the dark side, which caused them to take on a shriveled appearance. Such individuals were not given names; they lost the right to any such appellation. Any Tyia practitioners who fell to the dark side, whether Revwien or of another species, sought to break out of the cycle of Tyia and inflict this state on as many other individuals as possible."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Revwiens evolved on Revyia, a world that was located on the northern fringes of the Outer Rim Territories, and which was considered the halfway point between the Pits of Plooma and the Galactic Rim. The planet had a temperate climate, with an equatorial jungle belt and long, rolling plains. The ancient histories of the Revwiens told of a dominant civilization on the planet, with developed cities and powerful artifacts; however, the authenticity of these legends was disputed by later archaeologists who could not unearth any evidence to support such a situation. As Revwien society developed, it formed very few formal institutions; open air universities were an exception. Rather than researching technology, the Revwiens cultivated botanical solutions to meet their needs; plants were used for lighting, adhesives, weather prediction, and even munitions. The Revwiens eventually became aware of a manifestation of the Force they called the Tyia. Force-sensitive Revwiens spent time in the holy jungle belt to study the Tyia and develop their abilities."}, {"tag": "p", "text": "Despite its navigational isolation, Revyia became part of the Veragi sector, and the Revwiens received occasional visits from a handful of independently-owned light freighters. This traffic produced only light commerce, as the Revwiens had little technology to trade; however, Revwien lettuce and coleslaw were available as far away as Coruscant, where they were regular ingredients on the menu of Dexter Jettster's diner."}, {"tag": "p", "text": "In 19 BBY, the Tyia masters on Revyia were heavily disturbed by the deaths of so many Jedi Knights during the execution of Order 66 by the Galactic Empire at the end of the Clone Wars, which they could sense through the Force. It prompted them to call a meeting within a temple grown from the largest trees on their world. They then charged their most capable students with seeking out any remaining Jedi and aiding them in whatever way possible. One such Revwien Tyia adept was consulted by a Human Jedi."}, {"tag": "p", "text": "Sometime between 14 and 1 BBY, the Revwiens' home star system was the site of an Ithorian Time of Meeting, an event in which Ithorian Herdships from all across the galaxy gathered to undertake herd business and conduct trade. The event attracted smugglers such as Han Solo and Grambo the Worrt. Smugglers also established a base deep in the jungles of Revyia. Their presence attracted the attention of the Empire, which eliminated the smugglers and subsequently established a small, permanent presence on Revyia. The Revwiens cooperated with the new Imperial presence and established Revyia Station just outside the Imperial base. They also purchased several run-down freighters. However, despite these additions, Revyia remained a quiet, undeveloped world."}, {"tag": "h2", "text": "Revwiens in the galaxy"}, {"tag": "p", "text": "Most Revwiens in the galaxy were curious wanderers, content to work for passage on starships, as they required little to survive. These travelers generally lacked advanced skills, but they were reliable workers in the tasks they were given. Travel offworld opened new vistas of learning for Revwiens, whose curiosity drove them to learn about even the most routine and simple aspects of galactic life. Revwiens enjoyed having friends; anyone who spoke to them soon became a candidate to follow. While their trust made them ripe to be taken advantage of, their lack of possessions prevented the species from suffering major losses in such encounters."}, {"tag": "p", "text": "Sometime prior to 22 BBY, a Revwien trader lived in the town of Mos Nytram on Tatooine. The trader auctioned to local resident Owen Lars a Zephyr-G swoop that was later used by Jedi Knight Anakin Skywalker to track down and slaughter the Tusken Raiders who had captured his mother."}, {"tag": "p", "text": "The Revwien Wuwuhuul lived during the Galactic Civil War. As a Thuwisten, Wuwuhuul was competent in several Force powers and wielded a lightsaber. Wuwuhuul traveled with the ex-pirate and Rebel Alliance sympathizer Grindol Maal. When Maal volunteered to lead a group of Rebel operatives in a mission to capture an I2-CG droid that contained vital intelligence that had crashed on Goratak III, Wuwuhuul accompanied the ex-pirate. Together with the Red Smoke, Safari One, and Buzz Boys squads, Wuwuhuul and Maal clashed with Imperial forces under the command of Mandalorian bounty hunter Feskitt Bobb."}, {"tag": "p", "text": "Sometime between 2 BBY and 0 BBY, a Revwien was present on Fornax Station and observed the Five Fire Rings of Fornax, a spectacular natural phenomenon. In 0 BBY, a green- and yellow-colored Revwien was outside Chalmun's Spaceport Cantina on Tatooine when the exiled Jedi Master Obi-Wan Kenobi took Luke Skywalker there to search for a pilot to take them offworld. Later, in 1 ABY, a purple Revwien was present at a space-freighter's hangout. A brawl underway in the hangout was interrupted when local schoolboy Berd Lin burst in and recruited many of the patrons in an effort to rescue his mother from Imperial forces who had arrested her. Another Revwien Thuwisten once encountered and levitated an Ewok, a species native to the moon of Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Revwien species was designed by Ron Cobb as one of a series of sketches for denizens of the Mos Eisley cantina scene in Star Wars: Episode IV A New Hope. Cobb's designs were intended for additional U.S. shooting of the cantina scene; however, ultimately, the Revwien sketch proved too complex to turn into a costume, so the species was not included in the film. Cobb's concept art was then published in several reference books, firstly in The Art of Star Wars Episode IV: A New Hope in 1979, and later in the Star Wars Technical Journal (1993) and Star Wars: Chronicles (1997). These sources included Cobb's design notes for the species, which read, \"Tropical Rain Forest / (Ambulatory Plant) / Traps and absorbs insect-like creatures. Great sense of humor—best joke-tellers in the galaxy.\" Another species named Parwan was later created based on the same piece of concept art."}, {"tag": "p", "text": "The first canonical appearance of the Revwien species occurred in 1987 with the publication of the comic book Droids 6, although the species was not named in the comic. The name \"Revwien\" was first applied to the species in 1991 with the inclusion of a member of the species in Star Wars Miniatures Battles, published by West End Games. The book presented the Revwien as an \"Alien Student of the Force,\" a role that was later reprised in a number of other West End Games products. West End Games also created a miniature Revwien, which it included in its \"Rebel Characters\" and \"Aliens of the Galaxy 1\" miniature sets."}, {"tag": "p", "text": "In 1995, a Revwien appeared in the background of Classic Star Wars: The Early Adventures 7, which republished Bring Me the Children, originally a newspaper comic strip by Russ Manning that had been published by the Los Angeles Times Syndicate in 1980. The Revwien in the scene was not actually present in the original newspaper strip but was added to the panel to make it better fit a comic book rather than newspaper format. Later in 1995, the culture and history of the Revwien species was significantly expanded with the release of Galaxy Guide 12 Aliens — Enemies and Allies. Their entry was written by Harry Heckel, and they were illustrated by Mike Vilardi."}, {"tag": "p", "text": "The cover of Star Wars Manga: A New Hope 2 (1998) depicted a Revwien in the Mos Eisley cantina, a scene that reflected the origins of Cobb's sketch; however, the image was not replicated inside the actual comic. Following references in The Essential Guide to Droids (1999), Star Wars: Attack of the Clones Incredible Cross-Sections (2002), and the non-canon comic book \"The Emperor's Court\" (2002), Dorling Kindersley's Inside the Worlds of Star Wars: Attack of the Clones (2003) introduced the Revwien Comedy Academy Playhouse. This appears to be a reference to Cobb's original design notes, which described the species as the best joke-tellers in the galaxy."}, {"tag": "p", "text": "Wizards of the Coast included the Revwiens in its roleplaying game, with an extensive entry in the Jedi Academy Training Manual (2009), and an illustration by Adam Gillespie. However, its coverage of the Revwiens differed with previously established West End Games material by stating that, \"For much of the galaxy's history, Revwien Force-users studied the Tyia and developed a kind of religion out it, spreading the word of their beliefs to any who would believe it.\" The earlier West End Games material had stated that, \"Nearly 30 years ago, one of the independent freighters brought to Revyia a missionary who belonged to the faith known simply as Tyia.\" Where the accounts are in conflict, this article has favored that of Wizards of the Coast, as it is the most recently published source material."}, {"tag": "p", "text": "In The Essential Atlas (2009), authors Jason Fry and Daniel Wallace placed the Revwien homeworld and retconned a passage from the novel Children of the Jedi (1995) to refer to Revyia. Revyia was placed very close to—and possibly within—the borders of the Gree Enclave, which is home to the Gree, an ancient species that predated the Galactic Republic and which was renowned for its unique and powerful technology. When asked if the Gree Enclave was intended to be the source of the Revwien myths of a dominant civilization on their homeworld, Fry responded that the placement was probably luck, but that a \"Gree/Revyia connection sounds very plausible, though.\""}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "A cleaned-up version of Cobb's original sketch is included in Monsters and Aliens from George Lucas (1993), a non-canon publication that combines creature designs and photographs from various George Lucas projects with original text by Bob Carrau. This book accompanies the Cobb image with a small monologue presented as if the Revwien is drowning its sorrows while having drink after breaking up with its partner."}, {"tag": "p", "text": "A Revwien also appeared in the background of The Emperor's Court, published in Star Wars Tales 14, an Infinities comic story. In The Emperor's Court, Han Solo is on trial for killing the Rodian Greedo, with different versions of evidence presented based on competing versions of the Mos Eisley cantina scene as depicted in the original and Special Edition releases of Star Wars Episode IV: A New Hope. This comic appears to be a parody of the television show The People's Court."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h3", "text": "Non-canon sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}