{"url": "Rey%27s_speeder", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Speeder bikes"], "nodes": [{"tag": "h1", "text": "Rey's speeder"}, {"tag": "p", "text": "Rey's speeder was made entirely from scratch by Rey while she was living on her homeworld of Jakku. It was created using scavenged parts from the starship graveyard on Jakku, Niima Outpost, or from parts acquired from Teedo traders. Rey built a vehicle combining the characteristics of a speeder and a swoop, making the most out of scavenged military hardware and civilian machinery. The speeder was extremely fast and could carry a heavy load, making it ideal for long-range scavenging trips."}, {"tag": "h2", "text": "Design"}, {"tag": "h3", "text": "Powertrain"}, {"tag": "p", "text": "Rey's speeder was powered by powerful twin-turbojet engines reclaimed from an old cargo hauler. Rey chose to mount the engine in a stacked configuration instead of side-by-side and bolted them to powered amplifier intakes from an Imperial gunship. She then customized them with racing swoop afterburners and an array of repulsorlifts taken from crashed X-wing starfighters. When lightly loaded, the speeder's overpowered engines and repulsorlifts gave it a similar flight ceiling to a dedicated airspeeder."}, {"tag": "h3", "text": "Protection"}, {"tag": "p", "text": "Rey's speeder was equipped with a rider interface that wouldn't allow it to be powered on without a valid fingerprint. The wiring allowed Rey to electrify the speeder's chassis, shocking any would-be thieves or scavengers while she was away. In addition, the speeder was ungainly and hard to operate unless the user was familiar with how it handled."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rey's speeder first appeared in the 2015 film Star Wars: Episode VII The Force Awakens."}, {"tag": "p", "text": "The speeder appeared in a promotional video for the film created exclusively for Facebook."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}