{"url": "Rey%27s_Theme", "categories": ["Category:Real-world articles", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "Rey's Theme"}, {"tag": "p", "text": "\"Rey's Theme\" is a musical leitmotif written by John Williams for the 2015 film Star Wars: Episode VII The Force Awakens and its respective score to represent Rey, a focal character in the film."}, {"tag": "h2", "text": "Conception and development"}, {"tag": "p", "text": "\"Rey's Theme\" is the musical leitmotif that represents Rey, the central character of Star Wars: Episode VII The Force Awakens. It was composed and conducted for the film by John Williams. When Williams saw the film and began composing the music, he felt empathy towards Rey, as she is first introduced alone and without her family. He wanted the theme to illustrate that empathy that he felt towards her. Williams composed the theme with a musical grammar that was intended more as an adventure theme rather than a hero's theme, one that promises more adventure and resolution to come."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "Led by strings and woodwinds, \"Rey's Theme\" is a mysterious five-segment piece with a core leitmotif of quickly alternating notes played by various instruments such as solo flute. The theme's first part is comprised of ten notes which are repeated, transitioning into a second part consisting of seven notes. The third part of the piece is the 12 note main motif of \"Rey's Theme,\" and parts four and five conclude the piece, returning to the seven and ten note melodies."}, {"tag": "p", "text": "The primary melody in Rey's theme is written in the Dorian mode. It follows the period melodic structure. It is eight measures long and contains two four-measure phrases, called the antecedent and consequent phases in period structure. The consequent phrases opens with a varied restatement of the basic idea, while the consequent phrases contrasting idea is entirely new. John Williams never resolves the consequent phrases contrasting idea, either it is interrupted by a different melodic phrase or he repeats it with slight variation as if it is its own melody; some melodic transcriptions label it as such, however, it is most clearly the conclusion of the melody, drawn out and never resolving for tension. This structure gives it an extremely clear shape, with a range of an octave and a minor sixth. The melody features a number of leaps, which gives it a more powerful sound. Instrumentation wise this melody first appears on the horn, before being taken by the violins. Counter melodies based on the previously heard pentatonic patten are preformed on the flute."}, {"tag": "h2", "text": "Use"}, {"tag": "h3", "text": "In the movies"}, {"tag": "p", "text": "In Star Wars: Episode VII The Force Awakens, \"Rey's Theme\" is first introduced as Rey exits a crashed Star Destroyer and speeds across the deserts of Jakku. It continues into a number of other pieces from the film, including \"The Scavenger,\" when Rey is first introduced; \"Farewell and The Trip,\" as Rey arrives on Ahch-To to find Luke Skywalker; and \"The Jedi Steps and Finale,\" in the end credits. The theme later appeared in the teaser trailer for the film Star Wars: Episode VIII The Last Jedi and appears prevalently in certain scenes involving the character on Ahch-To within the film itself. The theme returns again in Star Wars: Episode IX The Rise of Skywalker in several scenes involving Rey."}, {"tag": "h3", "text": "In other media and merchandise"}, {"tag": "p", "text": "Outside of the film, \"Rey's Theme\" appears in the video game LEGO Star Wars: The Force Awakens, and it also appears in the video game Star Wars Battlefront II. Additionally, an upbeat version of the theme is used as introductory music for The Star Wars Show. The theme is used on Rey episodes of the micro-series Star Wars: Forces of Destiny."}, {"tag": "p", "text": "A rendition of the theme is played in the light side menu screens of Star Wars: Starfighter Missions. A rendition of the \"The Force Theme\" in the game also incorporates \"Rey's Theme.\" A rendition of \"Rey's Theme\" in the light side menu screens of LEGO Star Wars Battles also enjoys the accompaniment of \"The Force Theme.\""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}