{"url": "Rey_Strikes_Back", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: The Resistance Rises"], "nodes": [{"tag": "h1", "text": "Rey Strikes Back"}, {"tag": "p", "text": "Rey Strikes Back was the fourth episode of the LEGO Star Wars: The Resistance Rises series."}, {"tag": "h2", "text": "Opening Crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While salvaging an abandoned Imperial Star Destroyer from the Battle of Jakku, Rey finds a \"Corellian well-38 series trans-juicing flux generator\", which she decides to sell to the junk dealer Unkar Plutt. However, Unkar cheats Rey by only giving her two bolts out of the original three that he offered her. Annoyed at Unkar's unfair dealings, Rey swipes his potted plant, which is named \"Kevin\". When Plutt complains, she taunts him for naming a plant. After storming out, Rey loudly admits that she will find a junk dealer who will treat her fairly. Unkar Plutt vows to crush Rey but is soon overwhelmed by the dust stirred up by her departing speeder; which she affectionately names \"Bumper.\" Outside, Bobbajo walks past carrying a heavy burden."}, {"tag": "p", "text": "Once Rey has left, Plutt soothes his plant Kevin and vows to make the \"bad girl\" pay. He then sends two of his henchmen to steal Rey's speeder in order to disrupt her scavenging business. While Rey is trying to remove a pole from a Star Destroyer, Unkar's thugs try to steal her speeder but it seems to have a mind of its own and flies away. Rey catches the two thugs struggling to control her speeder. When one of the thugs jokes about Rey naming her speeder, she throws a brick at him. The gangsters and Rey begin hurling bricks at one another while \"Bumper\" flies away. Following a struggle, the two thugs managed to gain control of Rey's speeder."}, {"tag": "p", "text": "Using the parts salvaged from the Star Destroyer, Rey hastily cobbles another speeder bike and pursues the thieves. The two thugs struggle to control \"Bumper\" as they flee back to Unkar Plutt's store in Niima Outpost. Rey pursues the thugs on a race through the tents of Niima Outpost. While riding through the settlement, one of the thugs witnesses the Millennium Falcon, which he dismisses as a \"piece of garbage\", and a Quadrijet transfer spacetug behind it (correction : Actualy it's the Ghost that is behind it). Shortly later, Bala-Tik, Tasu Leech and several other gangsters arrive from Takodana to settle scores with Han Solo, believing him to be on Jakku. However, they are quickly knocked to the ground by the two passing speeders."}, {"tag": "p", "text": "Rey soon arrives with her cobbled-up speeder at Unkar Plutt's shop and tells him that she has delivered spareparts for him before ramming her speeder into his shop. She then tells Plutt that this is a proper payment's for a day's work. Rey then knocks Plutt's thugs off her speeder before telling the chastised Plutt that it was a \"pleasure\" doing business with him. Plutt vows revenge while Rey rides on Bumper into the desert ahead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}