{"url": "Rey%27s_lightsaber", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Rey's lightsaber"}, {"tag": "p", "text": "Rey's lightsaber was a yellow-bladed lightsaber that was constructed as a personal weapon by the Jedi Rey during the First Order/Resistance War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Rey's lightsaber was built of salvaged materials from her quarterstaff and a cloth handgrip. Like the quarterstaff it originated from, Rey's lightsaber hilt was blocky and heavy due to its exterior armor that made it resistant to impact and wear and tear. The weapon had a kyber crystal at its heart, and emitted a yellow-colored plasma blade when ignited. The emitter matrix on Rey's weapon featured a rotating gear-like mechanism, which caused the emitter of the lightsaber to open up and allow the plasma blade through."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the First Order/Resistance War, Rey began to construct her own lightsaber in her quarters at the base on Ajan Kloss. She was considering a hinged design with an emitter at either end, but decided against it after facing a dark vision of herself in the wreckage of the second Death Star. In the lead-up to the Battle of Exegol, the hand-made droid D-O rustled through Rey's workbench, almost disturbing the lightsaber, before being chastised by Rey's friend and fellow Resistance member, Finn."}, {"tag": "p", "text": "After the Battle of Exegol, Rey traveled to the planet Tatooine. There, Rey unveiled her finished, single-bladed weapon after burying the two lightsabers of her mentors, Luke Skywalker and Leia Organa, at the ruins of the Lars homestead—the former place of residence of the Skywalker family. Shortly thereafter, she was approached by an old woman who queried her identity. With the blessing of Luke and Leia's spirits, the Jedi declared herself \"Rey Skywalker.\" The lightsaber which she had created would honor the Skywalker legacy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rey's lightsaber first appeared in the 2019 film, Star Wars: Episode IX The Rise of Skywalker, the final installment of the Star Wars sequel trilogy."}, {"tag": "p", "text": "Right before the ignition of the blade in the movie, very brief flashes of green and blue can be seen in the blade emitter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}