{"url": "Rey_and_the_Secret_Treasure_-_Chapter_3", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:Star Wars Roll Out episodes"], "nodes": [{"tag": "h1", "text": "Rey and the Secret Treasure - Chapter 3"}, {"tag": "p", "text": "\"Rey and the Secret Treasure – Chapter 3\" is the tenth episode of the animated shorts series Star Wars Roll Out. It was first released October 11, 2019 on YouTube."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Rey must think fast to save herself and her treasure from the giant vacuum-like weapon."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In the opening credits, BB-8 and a Star Wars ball lead the way followed by Rey, Maz Kanata, Finn, Captain Phasma, two stormtroopers, Ben Solo, Han Solo, Chewbacca, and three porgs."}, {"tag": "p", "text": "The episode opens with Rey struggling against Teedo and his gang's giant vacuum machine, which sucks up debris. Rey jumps over a TIE fighter cockpit and kicks it into the path of their vacuum machine, which becomes stuck. Rey takes the opportunity to flee with her plant and bags of jewels. The Teedos manage to expel the TIE fighter cockpit and continue the pursuit. Rey reaches a dead end and the Teedos laugh in glee as they close in on her. Their machine sucks up more debris, exposing them to sunlight. Rey soon finds herself on the edge of an Imperial Star Destroyer's rear framework."}, {"tag": "p", "text": "Believing he has trapped Rey, Teedo giggles as he closes in on her. However, Rey uses the platform as a leverage to jump over the vacuum machine to higher ground. She then swings over a rope and purposely drops her jewels over the edge. Teedo and his gang move their vacuum machine forward and capture the jewels, only to fall over the edge. Rey watches the dazed Teedos with her plant while swinging on the rope. Rey soon finds a nursery full of similar plants. She laughs in joy and finds a rope which exposes a compartment full of jewels. Rey climbs out of the pit with her jewels. She laughs as the sun sets over her and her speeder."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}