{"url": "Rey%27s_father", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Human clones", "Category:Palpatine family", "Category:Unidentified fathers"], "nodes": [{"tag": "h1", "text": "Rey's father"}, {"tag": "p", "text": "Rey's father was the cloned son, a bioengineered strandcast, of Darth Sidious—the human male Sith Lord who ruled the galaxy as Galactic Emperor. The man who became Rey's father, whose name was lost in time, was created by the Sith Eternal on Exegol, a distant world where Sidious' cultists experimented with his genetic template in order to create a stable host for his essence. This man was the byproduct from years of genetic research, created from cloned tissue and donated blood cells of the Sith Lord, and was called the Emperor's son. However, Rey's father lacked his progenitor's connection to the Force and was deemed a failed experiment. Nevertheless, Sidious permitted the strandcast to live as a means for continuing the Palpatine bloodline."}, {"tag": "p", "text": "He escaped into hiding along with his child, who was born in 15 ABY and her mother. They eventually settled on Jakku where they struggled to survive in the desert as junk traders during the New Republic Era. Unlike the clone, Rey inherited Sidious' power and was, therefore, able to serve as a host for her grandfather's spirit. Determined to claim his granddaughter, Sidious ordered one of his followers, Ochi, to find and bring her to Exegol. Rey's father and mother chose to leave her on Jakku, selling her to Unkar Plutt in order to hide her from Sidious. Their plan succeeded, although Ochi captured and killed them after they refused to reveal their daughter's location."}, {"tag": "p", "text": "Rey had all but forgotten her past while growing up as a scavenger on Jakku. During her training as a Jedi apprentice, however, she gradually remembered her parents and the sacrifices they made to keep her safe. Their memory reinforced her commitment to the Jedi Order and the light side of the Force when Sidious attempted to turn her to the dark side during the Battle of Exegol."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Pre-Birth"}, {"tag": "p", "text": "The Sith Lord Darth Sidious—publicly known as Galactic Emperor Sheev Palpatine—was killed in the Battle of Endor in 4 ABY. However, he revived himself by transferring his essence to a new host—a clone of his original body—hidden away in the galaxy's Unknown Regions, on the Sith planet Exegol. This body was incapable of sustaining his spirit and consequently suffered from rapid decay due to Sidious' connection to the dark side of the Force. His followers, the cult known as the Sith Eternal, labored to create a new vessel for their master while he fought to survive in his temporary form."}, {"tag": "h3", "text": "Son of the Emperor"}, {"tag": "p", "text": "The biological father of Rey was an offshoot from the genetic research of Darth Sidious. Following Sidious' rebirth, the Sith cultists conducted various experiments using his DNA, splicing genes and bolstering together tissue, hoping to create a cradle for his spirit, but only ended up creating a litany of artificial abominations. However, a single genetic strand-cast, a clone offshoot, not quite identical in appearance to the Dark Lord of the Sith, survived. Thriving, the clone boy was healthy and was regarded to be the Emperor's son. The young man's name, as well as the reason he survived, by neglect or purpose, were lost to history."}, {"tag": "p", "text": "Being created from his father's cloned tissue, the young man possessed the Emperor's blood, but did not inherit his Force-sensitivity, leading the Sith Lord to be disgusted with someone who did not share the Force powers he relished. Sidious considered the strandcast unexceptional and could not bear to look upon what he deemed an example of \"disappointing ordinariness.\" However, his son's health still afforded the Emperor the means to continue his bloodline. As a result, the strandcast was permitted to be kept alive in the hope of achieving more favorable results through natural means."}, {"tag": "h3", "text": "Father of Rey"}, {"tag": "p", "text": "Eventually, the clone escaped from Exegol, to live a life apart from darkness. While Sidious had not anticipated his son's relationship with the woman who gave birth to his daughter in 15 ABY, he nonetheless saw it as an opportunity because his granddaughter, unlike his clone, inherited his connection to the Force. Rey was therefore deemed the perfect vessel for her grandfather's essence. He eventually settled with his family on Jakku, a backwater world where Rey's parents struggled to survive as junk traders."}, {"tag": "p", "text": "Despite his efforts to stay hidden from his father's agents, one of them—the Sith relic hunter Ochi—eventually tracked the clone and his family to Jakku. The threat of discovery compelled Rey's parents to sell her to Unkar Plutt. As reluctant as they were to leave Rey behind, they did so to protect her from Sidious."}, {"tag": "h3", "text": "Capture and death"}, {"tag": "p", "text": "Rey's father and mother were captured by Ochi, who took them as prisoners aboard his personal starship, the Bestoon Legacy. They were interrogated by the alien follower of Sidious, who demanded to know the whereabouts of his master's granddaughter, but neither of them would cooperate. The clone remained silent while Rey's mother lied to Ochi, claiming that Rey was nowhere on Jakku. Ochi knew that they had tried to deceive him, an action he considered intolerable."}, {"tag": "p", "text": "Failing to coerce information from either captive, Ochi was bidden by Sidious to execute both of Rey's parents. The clone was the first to die as Ochi stabbed him in the stomach with his dagger. Rey's mother, who watched the father of her child die in front of her, was then stabbed to death, also on Sidious' order. Their bodies were subsequently disposed of; buried beneath the sands of the Jakku desert in 21 ABY."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The name of Rey's father was forgotten; both the strandcast and Rey's mother became little more than fragments of memory to the daughter that they sold on Jakku. There was no record that Sidious' cloned son inherited his father's power in the Force, leading historians to surmise that the strandcast was a source of much disappointment to the Sith Lord who created him."}, {"tag": "p", "text": "Rey remained on Jakku for years, learning to support herself as a scavenger while unaware of her dormant Force powers or her relation to Emperor Palpatine. During this time in her life, she had all but forgotten the parents who left her when she was a child, having subconsciously suppressed the memories of her childhood. Despite this, she was hopeful that her father and mother would eventually return to her, giving her a reason to stay on her homeworld instead of exploring the wider galaxy. Yet a lifetime of isolation also left Rey struggling with feelings of solitude and abandonment, an experience which contributed to the emotional bond she would form with Ren during the First Order/Resistance War."}, {"tag": "p", "text": "Ren, having seen who Rey's parents were and how they lived through the Force-bond that he shared with their daughter, urged Rey to admit the truth about her parents. When Rey confessed that her father and mother were no one significant, Ren elaborated, revealing that they were junk traders who bartered their daughter away in exchange for money. Ren had learned the identities of Rey's parents through a Force vision, and told Rey that her father was an insignificant junk trader who sought money to feed his alcoholism. Though she later believed that Ren had only divulged this information as a means to turn her to the dark side, Rey sensed that he had not tried to deceive her, yet was still reluctant to admit that she was born to parents of no background."}, {"tag": "p", "text": "Although Ren had not lied to Rey about her parents, he later realized that the vision he saw of them was incomplete. He eventually learned the full truth from Sidious while confronting the Dark Lord of the Sith on Exegol. Sidious revealed that Rey's father was his son, making Rey his biological granddaughter. The revelation of the scavenger's origins reignited Ren's desire to rule the galaxy with Rey at his side. In addition, he discovered that together they formed a rare and powerful dyad in the Force, which only further convinced him of their shared destiny."}, {"tag": "p", "text": "Rey, who began training as a Jedi apprentice, was astonished to discover her biological connection to the fallen Emperor. As a Jedi, she struggled to control her anger, but the knowledge that Sidious gave the order to kill her parents fueled her desire for revenge. Yet her devotion to the Jedi Order and the light side of the Force helped to restrain her from giving into the impulse to kill in anger. It was also the memory of her father and mother that prevented Rey from turning to the dark side; whereas Sidious believed this made her as weak as her parents, she considered them to be strong for protecting her. During the Battle of Exegol, their daughter vanquished the reborn Emperor with the aid of the spirits of past Jedi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rey's father was genetically a human male, but as an offshoot of Darth Sidious' genetic experiments, he was also a strandcast artificially constructed from cloned samples of Sidious as well as donated cells. The son of the Emperor had red hair, blue eyes, and light skin. However, his physical appearance was not identical to that of his genetic donor, a byproduct of the modifications to his genome. He was young when he became a father, and had a scruffy red beard by the time he lived on Jakku."}, {"tag": "p", "text": "Though he was cloned from the Sith Lord who masterminded the fall of the Galactic Republic and ruled the Galactic Empire through fear, the strandcast sought to live as an ordinary man with his family; desiring a life apart from darkness and away from his father. Having inherited neither his progenitor's power nor his character, he was regarded by Sidious as a powerless and useless disappointment. Despite the harsh conditions of Jakku, he took on the difficult life of surviving in a desert environment in order to keep Rey hidden from her grandfather. Like the mother of his child, he was saddened by their decision as parents to sell their daughter. Before leaving Rey with Unkar Plutt, Rey's father promised that she would be safe on Jakku."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rey's father was first mentioned, albeit indirectly, in the 2015 film Star Wars: Episode VII The Force Awakens, the first installment of the Star Wars sequel trilogy. He first appeared in a flashback sequence of the 2019 film Star Wars: Episode IX The Rise of Skywalker, where he was portrayed by Billy Howle."}, {"tag": "p", "text": "In Star Wars Legends, Emperor Palpatine also had experimented with cloning himself, to which he intended to transfer his spirit. In another work, he also had a son named Triclops, who first appeared in the 1993 book Mission from Mount Yoda, the fourth installment of the young readers Jedi Prince series written by Paul and Hollace Davids. Similarly to Rey's father, Triclops also conceived a child with a woman, and that child became an apprentice of Luke Skywalker as well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}