{"url": "Rhad_Tarn", "categories": ["Category:Legends articles", "Category:Dark Acolytes", "Category:Fallen Jedi", "Category:Humans", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Rhad Tarn"}, {"tag": "p", "text": "Rhad Tarn was a male Human Jedi Knight who served the Jedi Order and the Galactic Republic during the final decades of the Republic Classic era. When the galaxy erupted in war during the last years of the Republic, Tarn believed the Confederacy of Independent Systems was right to wish the Republic's demise and left the Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After being discovered to be Force-sensitive, Rhad Tarn was taken to the Coruscant Jedi Temple for training in the ways of the Force. Passing through the Temple's academy, Tarn was taken as a Padawan by a Jedi Master. Traveling on journey missions along the Outer Rim Territories, Tarn came face-to-face with the harsh realities of slave labor and illegal prisons. Crafting for himself a blue-bladed lightsaber, Tarn went on to pass his Trials of Knighthood and ascend to the rank of Jedi Knight."}, {"tag": "p", "text": "Not long after becoming a Knight, the Separatist Crisis which had plagued the Republic for years exploded into all out war, pitting the Jedi and the Republic against the Confederacy of Independent Systems. When the Jedi High Council recalled all Jedi to Coruscant to take up arms against the Confederacy by joining the Grand Army of the Republic, Tarn invoked the Right of Denial. Avoiding Coruscant, Tarn headed for the Outer Rim, citing his belief that the Republic was too corrupt to save and that the Jedi owed their loyalty to The Force, not any government or military. Gathering a following of other dissident Jedi, Tarn became a known face of dissension in the ranks of the Order, causing members of the High Council to fear a schism to be on the horizon. In order to prevent the fracturing of the Order, Master of the Order Mace Windu called for a meeting with Tarn and fellow leaders to have an open discussion about their different stances."}, {"tag": "p", "text": "Contacted three months after the start of the war by fellow dissident Master Sora Bulq, Tarn agreed to meet with Windu and others on the Weequay's family's old estate on a moon circling Bulq's homeworld of Sriluur, known as Ruul. Along with Jedi K'Kruhk, Sian Jeisel, and Mira, Tarn arrived on Ruul and prepared for the forum that Windu had called for. When Windu arrived, Tarn was the most outspoken amongst the group, making no hesitation to share his feelings that the Jedi should join the Confederacy. Advocating rebellion against the Republic for turning a blind eye to the suffering on the Outer Rim, Tarn worried his compatriots with his radical thinking. The other dissidents attempted to calm Tarn during the informal discussion, stating that they agreed that the Republic was corrupt, but none of them were willing to side with the Confederacy."}, {"tag": "p", "text": "As the stay on Ruul progressed, Tarn became more and more distrustful of Master Windu's intentions, feeling that Windu was prepared to betray them at a moments notice in order to keep the Order together. In fact, Tarn was correct in his suspicion that the meeting was not all it appeared to be, but failed to recognize the source of the discordance. In reality, the quiet and contemplative Sora Bulq had fallen to the dark side and sided with Count Dooku, becoming one of his minions. The meeting was essentially a trap to lure Mace Windu within the reach of Dark Jedi Asajj Ventress' blades. Ventress, arriving on Ruul with only Bulq knowing, attacked the Jedi, killing Mira and appearing as if she was in league with Master Windu. While K'Kruhk attempted to avoid jumping to conclusions about the events and Ventress' relationship to Master Windu, Tarn's distrust boiled over and he became filled with rage."}, {"tag": "p", "text": "Racing off to find the assassin, Tarn was treading dangerously close to the dark side. During the ensuing lightsaber battle with Ventress, the Dark Jedi taunted and toyed with the young Jedi, only making him angrier. Ventress took advantage of this and encouraged Tarn to call on his rage, managing to turn the Jedi to the Dark Side of the Force. When asked to join Ventress, Tarn extinguished his lightsaber and accepted. By the time K'Kruhk and Jeisel showed up to take on Ventress, the two Jedi found themselves facing a Dark Jedi as well as an enraged Tarn. Disarmed and pinned to a rock, Jeisel pleaded with Tarn not to give in to the dark side. But Tarn was already too consumed with rage to hear her. As he made his killing swipe, Jeisel acquired her lightsaber and quickly cut Tarn across the torso, killing him."}, {"tag": "p", "text": "Rhad Tarn represented the Jedi's worst fears about what the war had the potential to do to the Jedi Order. Because he had fallen so easily, they wondered how many more would. Word quickly reached the Temple of Tarn's death, while the other dissident Jedi reached out to his followers and attempted to bring them back into the Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}