{"url": "Rey%27s_NN-14_blaster_pistol", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Blaster pistols", "Category:Personal weapons"], "nodes": [{"tag": "h1", "text": "Rey's NN-14 blaster pistol"}, {"tag": "p", "text": "Rey's NN-14 blaster pistol, also referred to as Rey's blaster, was an NN-14 blaster pistol formerly owned by Han Solo, who gave it to the scavenger Rey. Manufactured by LPA, it had a safety switch that prevented the blaster from firing."}, {"tag": "p", "text": "The pistol was used by Rey for the first time when the First Order invaded Takodana. Although she succeeded in killing several stormtroopers, the weapon was ineffective against the dark warrior Kylo Ren, whose combat skills allowed him to deflect Rey's blaster shots with his crossguard lightsaber."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Rey's blaster was a compact but deadly NN-14 blaster pistol. Developed by the weapons manufacturer LPA, its design incorporated a safety switch that could lock the pistol's firing mechanism. Other typical features included a compact grip, an enlarged power core, armored body shell, and a flash suppressing/stabilizing muzzle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Upon arriving on the planet Takodana, Han Solo, believing that Rey needed a way to defend herself and was responsible enough, gave her an NN-14 blaster pistol and noted that she needed training in order to properly use it. Though initially reluctant in firing it, the blaster pistol proved handy when Rey used it to dispatch stormtroopers during the attack on Maz Kanata's castle and also fired off a few shots at Kylo Ren, though all of them were deflected by the dark warrior's crossguard lightsaber."}, {"tag": "p", "text": "In addition to the Skywalker lightsaber, the NN-14 blaster pistol was among Rey's possessions when she journeyed to the distant world of Ahch-To to find Jedi Master Luke Skywalker. During her time on the planet, the Force-bond between Rey and Ren allowed the two adversaries to commune with each other across the stars. The sight of her nemesis startled Rey, who instinctively reached for the pistol and fired it at Ren. However, her actions only damaged the hut she resided in, to the chagrin of the Caretakers, who were charged with preserving the island's ancient Jedi ruins. When Skywalker inquired about the damage she caused, Rey lied to him, claiming that the weapon went off while she was cleaning it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}