{"url": "Rey_and_Finn_vs._Kylo_Ren", "categories": ["Category:Real-world articles", "Category:Star Wars Galaxy of Adventures episodes"], "nodes": [{"tag": "h1", "text": "Rey and Finn vs. Kylo Ren"}, {"tag": "p", "text": "\"Rey and Finn vs. Kylo Ren\" is the forty-second episode of Star Wars Galaxy of Adventures. It premiered on the Star Wars Kids YouTube channel on March 27, 2020."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The video opens with Kylo Ren striding out into the snowy wastes of Starkiller Base to face Rey and Finn. He draws his crossblade lightsaber. Rey draws her blaster but Kylo Ren uses the Force to hurl her against a tree. Finn shouts as Rey lands in the snow. As Finn draws the Skywalker lightsaber in self defense, the narrator explains that in a \"galaxy of adventures\", a friend is worth fighting for."}, {"tag": "p", "text": "In a flashback scene, Rey asks Finn if he is with the Resistance. When Finn says yes, she reaches out her hand to him. The video then shifts to Finn and Rey fleeing First Order stormtroopers at Niima Outpost on Jakku. Rey is annoyed that Finn wants to hold her hand and protests that she knows how to run."}, {"tag": "p", "text": "The video then flashes to Finn and Rey leading two TIE/fo space superiority fighters on a chase in the Millennium Falcon. Finn says they need a pilot but Rey counters that they have got one. While Rey flies the Falcon, Finn shoots down the two pursuing TIEs with the Falcon's rear cannon. Later, the two compliment each other before introducing themselves."}, {"tag": "p", "text": "Back in the present, Finn engages Kylo Ren in a lightsaber duel but is easily bested by the seasoned dark sider, who slashes his back with his lightsaber. Kylo Ren reaches out for the Skywalker lightsaber with the Force but Rey uses the Force to summon it to her. Ren charges at her and the two cross blades."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}