{"url": "Reymet_Autem", "categories": ["Category:Legends articles", "Category:Coruscanti", "Category:Humans", "Category:Information brokers", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Reymet Autem"}, {"tag": "p", "text": "Reymet Autem, a Human male, was the son of Sagoro Autem. Reckless by nature, he loved to participate in daredevil swoop-bike racing through Coruscant's garbage pits. Like his father, Reymet enrolled at the Guards' Academy due to his family's connection to the Senate Guard, but he did not like it."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Reymet Autem attended the Leadership School on Andara, where he met Jedi undercover \"transfer students\" Anakin Skywalker and Ferus Olin in 25 BBY. A computer, tech, and security systems genius who loved to play practical jokes, Reymet assisted them with the investigation of the son of Senator Berm Tarturi, Gillam Tarturi, who was allegedly kidnapped, but who had set up his own father for his staged murder, to avenge himself of him."}, {"tag": "p", "text": "In 26 BBY, Reymet was hired at the Staff College on the planet Andara, where he met Padawans Anakin Skywalker and Ferus Olin who were there to conduct research. Reymet became an expert when he manipulated the technical institutes' systems, which were being tested by Ferus."}, {"tag": "p", "text": "In the Guards' Academy, Reymet was a loner and had no friends, which he disclosed to Anakin Skywalker. After the disappearance of Ferus Olin, Reymet guided Jedi Masters Obi-Wan Kenobi and Siri Tachi to the Academy's ancient tunnels, from which they rescued Ferus."}, {"tag": "p", "text": "In 23 BBY, Reymet (having been suspended from the Academy) unknowingly helped his uncle Venco attempt to carry out his assassination attempt on Simon Greyshade. Already planning to go off-world with his girlfriend, Riao Siao, Reymet fled, helped by his father, who distracted the other Senate Guards long enough for Reymet to flee arrest."}, {"tag": "p", "text": "Reymet was soon followed by his mother Sula and sister Lissa, who had decided to leave Sagoro. In the years that followed, Reymet became a smuggler and information broker, one of his aliases being Evan Hessler."}, {"tag": "p", "text": "In 22 BBY, he was arrested for stealing a speeder belonging to Senator Simon Greyshade, after it was \"borrowed\" by Anakin Skywalker."}, {"tag": "p", "text": "However, after the war and the creation of the Galactic Empire, Reymet made an effort to find his father. Sagoro's name had appeared on a list of potential seditionists, and Darth Vader personally saw to capturing Autem. Under the guise of bounty hunter Evan Hessler, Reymet succeeded in \"capturing\" his father, having thwarted Tartuta and Severian. Upon revealing his true identity, Reymet and his father fled Coruscant to meet the rest of their awaiting family."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Reymet's appearance changes in his two comic appearances; in the first, he has black hair and brown eyes, and in the second, brown hair and green eyes. In Jedi Quest: The School of Fear he had sandy hair and gray eyes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}