{"url": "Rezi_Soresh", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Rezi Soresh"}, {"tag": "p", "text": "Commander Rezi Soresh was a Human male officer in the Galactic Empire and the man who created X-1, X-2, X-3, X-4, X-5, X-6, and X-7 in an attempt to create the perfect assassin. Of the seven, X-7 was the only one to survive his training. Soresh was hired by the Emperor to kill the pilot who had destroyed the Death Star. When he failed, he fled Darth Vader's wrath and settled in the Outer Rim Territories. During his attempt to turn young Skywalker into his own assassin and gain his revenge, Soresh was gunned down by Han Solo."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Assassin program"}, {"tag": "p", "text": "Soresh, a Human male Commander of the Galactic Empire took seven men and forced them into a brutal reconditioning program designed to turn them into mindless servants. Using a system of drugs which he perfected, he usurped their personalities. They were then pitted against each other until only one remained. X-7 had become the perfect assassin and was utterly tied to his master, Soresh, and went on to perform flawlessly in every task.."}, {"tag": "h3", "text": "Vendetta"}, {"tag": "p", "text": "By 0 ABY, Soresh was suffering from the perceived insult of having been placed in a lower position for a man of his abilities. Upon meeting Darth Vader, Rezi planned on destroying him and rising in the Emperor's eyes. Through dubious intelligence sources, he discovered that the Rebel Luke Skywalker was actually Vader's son. Soresh wanted to kill him and discredit Vader, who was also searching for the young Rebel. Soresh sent X-7 after Skywalker with the exhortation not to fail him."}, {"tag": "p", "text": "During the course of the hunt, Soresh would often contact X-7 and ask for a status update. X-7 failed several times to kill Skywalker despite gaining his trust under the alias of Tobin Elad."}, {"tag": "p", "text": "Soresh eventually grew angry with X-7, and recalled him for additional reconditioning. But his efforts only added to the strained mental state of X-7, who had begun to question the actions of his master."}, {"tag": "p", "text": "When the Rebels set up a trap for X-7 on Belazura, he fell for it. They used Lune Oddo Divinian, a mercenary hired by X-7, to masquerade as X-7's brother and reveal his real name: Trever Flume. Eventually, X-7 had to face a final choice between his potential past and serving his master. X-7 stunned Divinian and joined the Imperial assault against Rebel infiltrators. The battle ended with Soresh's finest assassin dead."}, {"tag": "h3", "text": "Endgame"}, {"tag": "p", "text": "Lord Vader had discovered Soresh's attempts to usurp power and ordered his capture. An Imperial Lieutenant confronted Soresh and told him Vader was coming to deal with the arrogant commander personally. Panicked, Soresh initiated his backup escape plans while the Lieutenant waited outside. By the time Vader arrived, Soresh had completed his escape. When he discovered Soresh had fled, Vader executed the Lieutenant for his failure."}, {"tag": "p", "text": "Soresh spent the next twenty-seven days fleeing Vader in backward systems in his CloakShape fighter. Stumbling upon the Sixela system, Soresh landed and set about using his remaining influence to achieve his revenge against Luke Skywalker."}, {"tag": "p", "text": "When the Heroes of Yavin were participating in a Mission to Nyemari, a Glymphid approached Skywalker to deliver a message. It was a hologram of Soresh asking for Skywalker to meet him in the Sixela system, and threatening to kill a colony vessel full of over 100 passengers if he didn't comply. As a measure of his power, Soresh used some sort of delayed poison and killed the messenger in front of Skywalker."}, {"tag": "p", "text": "Skywalker knew he needed to turn himself in, but his friends would not let him go alone. Just before the deadline was going to expire, they landed on Soresh's moon in the Millennium Falcon. Han Solo stepped out and greeted a man identifying himself as Soresh. Then, two T-65 X-wing starfighters swept over the planet and attacked the compound, knocking out the laser turrets. Solo then shot the impostor. After the Rebels landed, a series of mines started exploding amongst the hostages. The Rebels waded into the mob to attempt to rescue them, and were captured."}, {"tag": "p", "text": "Solo and Leia Organa were placed in a jail cell guarded by individuals with no emotions, more examples of Soresh's handiwork. Meanwhile, Soresh had taken Skywalker for himself and planned on turning him into a perfect, Force-sensitive assassin. Over a two-week period, Soresh broke down Skywalker's defenses. Skywalker came close to capitulating, but he knew his friends were counting on him, and he faked his emotions and responses."}, {"tag": "p", "text": "When Solo and Organa next saw Skywalker, he appeared to be a mindless servant of Soresh. When Skywalker was ordered to execute his comrades, he was given a blaster, and aimed it at his friends. Suddenly, there came a piercing screech, and his shot went wild. The droid duo, R2-D2 and C-3PO had been left behind during the original raid and they staged a diversion. Solo, Organa, and Chewbacca took cover behind rocks. A guard was about to execute Solo when Skywalker shot him, revealed his deception while Solo tried to convince him to escape. Skywalker would not leave without discovering Soresh's plan. He asked a favor from Solo: shoot him in the shoulder to make it appear he was still Soresh's servant. When Skywalker woke up, he faked his emotions of failing his master. Soresh forgave him, but still punished him for his failure. The other Rebels had escaped and were later met by the mercenary Div and Organa's longtime guardian, Ferus Olin. The two were on an unsanctioned reconnaissance mission."}, {"tag": "p", "text": "Soresh had planted evidence to the Rebellion that Emperor Palpatine and the Imperial High Command were going to meet in the Sixela system in with only a small guard. General Jan Dodonna committed the Alliance Fleet to attacking the contingent. Soresh also contacted Vader to draw him into his trap. Soresh wanted to take his revenge at once. Through his contacts, he acquired his trump card: resonance torpedoes, which he would use to destroy the fleets."}, {"tag": "p", "text": "When the Alliance Fleet reverted from hyperspace, they quickly discovered it was a trap, as a large Imperial fleet arrived. Soresh offered Skywalker his lightsaber back if he launched the torpedoes. Instead, Skywalker turned on him. Soresh launched the torpedoes at the sun, and then fled. Skywalker's companions arrived but were unable to stop the launch. Meanwhile, Darth Vader had landed and was looking for Soresh. Skywalker used a mind trick to subdue the rest of Soresh's guards, allowing them to escape, and then Solo and Skywalker joined the battle in space."}, {"tag": "p", "text": "The torpedoes hit the sun and started a chain reaction, which would end in 40 minutes. The two fleets fled, and Skywalker returned to the moon to rescue the remaining hostages, and Olin sacrificed himself to engage Vader. He was soon struck down by Vader and was finally at rest."}, {"tag": "p", "text": "Their work finished, the Rebels boarded the Falcon. They were stopped by Soresh, who attempted to shoot Skywalker, but Solo shot down the man, ending his plans. The Rebels fled the system before the sun exploded and wiped out all trace of Soresh's work."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Soresh was an ambitious man, and yet, to many others he appeared only to be a lackey. He was angry that he was put in a minor position and plotted to gain favor with the Emperor. He would tolerate no failure from his those under him and would go so far as to let them kill each other. Soresh was smart enough to plan for all contingencies and had a backup plan in case of failure. Even during his exile, he was able to rebuild his power base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rezi Soresh is one of the primary antagonists in the Star Wars: Rebel Force series by Alex Wheeler. Those books represent his only appearance in Star Wars canon, although the series was included in the 2012 reference book The Essential Reader's Companion, which offers plot summaries for all Star Wars literary works."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}