{"url": "Rhen_Var/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Ice planets", "Category:Infinite Empire planets", "Category:New Republic planets", "Category:Rhen Var locations", "Category:Tobali system planets", "Category:Xim's empire", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Rhen Var"}, {"tag": "p", "text": "Rhen Var was a planet situated near the Tion Cluster in the Outer Rim Territories and one of the former Thanium Worlds. It was the first planet in the Tobali system. Throughout the history of the Galactic Republic, Rhen Var was covered in ice, rendering it almost uninhabitable. Remains of an ancient civilization and old Jedi artifacts were found beneath the ice on the planet, remnants of a former population."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Rhen Var was once a fertile paradise filled with vegetation and wildlife. Thousands of years before the Clone Wars, an atmospheric cataclysm turned it into an icy hibernal surface. Since then, it had been a frigid world of frozen tundra and snow swept mountains."}, {"tag": "p", "text": "The planet, located in the Outer Rim's Thanium system, orbited the star Tor, had a day of 18 standard hours and the year was 563 standard days. The planet was at galactic coordinates R-6."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Great Sith War in 3986 BBY, former Jedi Ulic Qel-Droma sought refuge on Rhen Var, and there trained Vima Sunrider. He ultimately found peace in the snowy wastes, and was redeemed and then was later murdered by Hoggon. During his stay he found a cave where the rare Solari crystal grew, of which was located near where he taught Sunrider."}, {"tag": "p", "text": "Later, Jedi Grand Master Satele Shan and a large Republic army battled Darth Mekhis and a force of Sith during the last months of the Great Galactic War."}, {"tag": "p", "text": "Prior to the Clone Wars, the Republic set up a small supply base and listening post on Rhen Var. At the start of the Clone Wars in 22 BBY, the Confederacy of Independent Systems seized Rhen Var with an army so large that the Republic base had to evacuate the planet. Obi-Wan Kenobi informed the Jedi High Council about the seizure of the planet. The Separatists' motives in taking the world were unclear until Kenobi and Anakin Skywalker discovered Count Dooku uncovering the Force Harvester on Raxus Prime. The answers to its power would be located in the tomb of Ulic Qel-Droma on Rhen Var. After the liberation of Alaris Prime, the Republic retook Rhen Var in the Battle of Rhen Var. During the battle, Anakin learned from Qel-Droma's Force ghost how to defeat the Force Harvester which would power the Dark Reaper located on the ancient Sith world of Thule."}, {"tag": "p", "text": "Later, around the time of the Battle of Yavin, Rebel Alliance troops attacked and secured an Imperial listening post. The Galactic Empire soon struck back and eliminated the Rebels. They soon abandoned the listening post and the last presence of civilized life was removed from Rhen Var.[source?]"}, {"tag": "p", "text": "The Yuuzhan Vong captured the world during their invasion of the Outer Rim."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "When Ralph McQuarrie created conceptual art for the Ice Planet which became Hoth, he included illustrations of ruins emerging from the snow. While this did not become a part of the film, the concepts of the ruins of a lost civilization choked in snow and ice may have influenced the development of Rhen Var. Images reflecting this were reprinted in The Illustrated Star Wars Universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}