{"url": "Rhen_Var_Citadel", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Alliance to Restore the Republic locations", "Category:Confederacy of Independent Systems locations", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Rhen Var locations"], "nodes": [{"tag": "h1", "text": "Rhen Var Citadel"}, {"tag": "p", "text": "The Rhen Var Citadel was an ancient structure on the planet Rhen Var. It included a large courtyard at the base of a four-story tower, an ancient crypt, and a domed observatory. A keep was in the center of the Citadel, and the watch was south of the keep. There were statues in front of the watch and in the keep, which were made in honor of Ross Mysliwiec, an ancient Jedi Master. The Citadel would be the site of several battles."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "During the Battle of Rhen Var, forces of both the Galactic Republic and Confederacy of Independent Systems entered the citadel to fight when the CIS attempted to use the site as a staging ground for coordinating the landing of reinforcements far away at the site of the Jedi Monument, where Anakin Skywalker was fighting to gain access to the temple in order to find the tomb of Ulic Qel-Droma. The droids occupying the Citadel were quickly put down by a detachment of clone troopers, the battle leaving the citadel in ruins."}, {"tag": "h3", "text": "The Galactic Civil War"}, {"tag": "p", "text": "During the Galactic Civil War the Citadel was used by the Galactic Empire, which had set up a monitoring station to observe Rebel Alliance fleet movements. When the Rebels discovered the Imperial station, they launched an attack to capture it. They took the Citadel but were quickly defeated when Imperial forces launched a counterattack a few days later to defend their territory."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rhen Var Citadel appears in a map in the 2004 video game Star Wars: Battlefront. During the Historical Campaign, the battle on the map appears as an Imperial mission, although the game's story is secondary continuity, according to Leland Chee, the keeper of Lucasfilm Ltd.'s Holocron continuity database. The map is also available in the game's sequel via an Xbox Live patch. However, prior to the xbox update, this map would have been available on the PSP version. It can be found in the UMD disc of the game and be edited back into it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}