{"url": "Rib-cat", "categories": ["Category:Canon articles", "Category:Domesticated creatures", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Rib-cats", "Category:Urban creatures"], "nodes": [{"tag": "h1", "text": "Rib-cat"}, {"tag": "p", "text": "Rib-cats were a species of non-sentient cats found on the moon of Nar Shaddaa."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Thin with long, pointed ears and sharp teeth, the rib-cat species possessed six legs. Their fur came in various shades of brown and tan and their eyes could be gold, black or brown. Some rib-cats were domesticated and kept as pets and could even form a pack-bond with their owner. The cats were predatorial creatures and were known to hunt and eat rats and fish. Domesticated rib-cats also ate rib-cat food, vitablox and the broth from purlah soup and would cry when hungry."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The con man Loonoo kept several rib-cats, including Ashes, Grish, Mixie, Molly and Smokey. A large population of wild rib-cats lived in Nar Shaddaa's Corellian Sector and to keep the teeming rib-cats away, many shopkeepers on the moon laid out paw spikes outside their shops. Loonoo did not leave out paw spikes and attributed the tendency of wild rib-cats to come to his home to this. Nonetheless, they still ran wild in the district to the extent that the smuggler Sana Starros commented that she had lost count how many rib-cats had come aboard her ship. Loonoo and Starros recorded these experiences with the cats in Maz Kanata's Smuggler's Guide when it came into their possession. Later the book came into the possession of Skrrll, who recorded a story of a how they found a wild rib-cat outside Bammy Decree's Spacebarn. When the rib-cat grew attached to them, Skrrll decided to keep her and named her Warm Face."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rib-cats first appeared in Star Wars: Smuggler's Guide, a 2018 replica journal book by Daniel Wallace."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}