{"url": "Rift_Alliance", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Core Worlds organizations", "Category:Hutt Space organizations", "Category:Outer Rim Territories organizations", "Category:Political factions"], "nodes": [{"tag": "h1", "text": "Rift Alliance"}, {"tag": "p", "text": "The Rift Alliance was a Republic subfaction of powerful worlds united by their shared protests at Republic \"incompetence\" and their threat to secede. Losing any one of these planets would have been a catastrophe for the Republic; losing all of them would have caused the Republic's collapse. However, despite being originally hostile, the Alliance was united by a powerful Jedi master to stand against Empire and provided their rich resources to Jedi's cause."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Rift Alliance member Alauni represented Saleucami, the Republic's most powerful trade hub in the Outer Rim, while Aeten II—Diab Duin's world—produced vital ores and crystals for Republic fleet construction. As tensions with the Sith Empire rose, supplies of the healing fluid kolto from Manaan—Shuuru's world—became indispensable. The planet Erigorm, represented by Augin Blaesus, recorded and administrated the Republic's finances for centuries; its secession would have destroyed the Republic's financial markets."}, {"tag": "p", "text": "Not all members of the Rift Alliance were hostile toward the Republic, however. Tai Cordan, a member of Balmorra's exiled government, claimed to be seeking powerful allies to help his home. Senator Tobas Grell and his daughter Nadia, representing the newly-joined planet Sarkhai, joined out of curiosity."}, {"tag": "p", "text": "The Rift Alliance pooled its economic and military resources together for their mutual protection. A research facility was established on the planet Quesh that was jointly run by the Rift Alliance worlds, though staffed primarily by Selkath. Additionally, troops from the member worlds formed a coalition force to combat the White Maw pirates based on the ice planet Hoth, which harassed trade routes important to the Rift Alliance world."}, {"tag": "p", "text": "Supreme Chancellor Dorian Janarus knew how devastating the loss of these systems would be and recruited the Jedi Master known as the Barsen'thor to keep them with the Republic. The Barsen'thor would ultimately rally the Rift Alliance into a formidable army to battle the Children of the Emperor, culminating in a showdown against the First Son at the climax of the Battle of Corellia. After Janarus' assassination, his successor, Supreme Chancellor Leontyne Saresh, authorized substantial reparations to the Rift Alliance both in response to their original protests, as well as in gratitude for their efforts to preserve the Republic."}, {"tag": "p", "text": "It is interesting to note that while the Rift Alliance was nominally a separatist movement, at least half of the members of the Alliance were not secessionists. Balmorra and Manaan were neutral worlds, and thus were not members of the Republic to begin with, while Sarkhai had no apparent intention to secede, as its representatives joined only out of curiosity."}, {"tag": "p", "text": "It is also curious that Manaan, despite its longstanding neutrality, would send troops and military aid to Hoth, although scientific support for offworlders was not without precedent, as Selkath scientists had secretly supported the Republic at the Hrakert Rift station, while the Order of Shasa was protecting the research facility operated by the Order of Revan on Manaan during this same period."}, {"tag": "p", "text": "Several years after the Barsen'thor's stint with the Rift Alliance, Jedi Master Kutri O'a foresaw that in one possible future scenario, an organization called the New Rift Alliance would be formed, and its members would heavily rely on the Barsen'thor's teachings, preserved in his holocron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}