{"url": "Riders_of_the_Maelstrom_(WEG)", "categories": ["Category:Real-world articles", "Category:West End Games adventure supplements"], "nodes": [{"tag": "h1", "text": "Riders of the Maelstrom (WEG)"}, {"tag": "p", "text": "Riders of the Maelstrom is a roleplaying game book written by Ray Winninger, published by West End Games in July 1989. It was reprinted in Classic Adventures: Volume Three."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Front cover"}, {"tag": "p", "text": "Aboard a luxury liner, Rebel heroes are caught between the power of two Imperial Moffs and a savage fleet of pirates, and the fate of an Alliance safe world hangs in the balance."}, {"tag": "h3", "text": "Back cover"}, {"tag": "p", "text": "Danger lurks aboard the Kuari Princess as Rebel heroes try to uncover the purpose behind a top-secret Imperial rendezvous while fighting notorious pirates—the Riders of the Maelstrom."}, {"tag": "p", "text": "A mission to rendezvous with a top Rebel spy on Aris goes wrong. The Rebels are chased by better than a full company of stormtroopers, strafed by Imperial sky swoopers, and risk death to escape along hundred-meter high tree limbs. When they manage to smuggle themselves onto the luxury liner Kuari Princess the Rebels know they can finally rest easy. The Rebels are wrong."}, {"tag": "p", "text": "Which Imperial officials are having a secret meeting aboard the Kuari Princess, and why? Can the Rebels stop the Imperial plot? Can the Rebels prevent the Riders' awful plan of destruction? Outmanned, outgunned and out of time, the Rebels must forge a victory from only their courage and resourcefulness."}, {"tag": "h2", "text": "Contents"}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "The red-headed pilot in the cover illustration was later given the name Celia \"Crimson\" Durasha, whose adventures were chronicled by Charlene Newcomb in \"A Certain Point of View,\" a tale appearing in Star Wars Adventure Journal 8, and its sequel from Newcomb and Rich Handley, \"Crimson Bounty,\" published in Adventure Journal 14."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}]}