{"url": "Rieekan_(SIS)", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Republic Strategic Information Service personnel", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Rieekan  (SIS)"}, {"tag": "p", "text": "Rieekan was a Human male Bureau Chief who served the Republic Strategic Information Service and was in charge of SIS operations on Nar Shaddaa during the Cold War. When Imperial forces took over the Power Guard Project and kidnapped SIS Agent Galen, Rieekan enlisted the help of a Jedi Knight to secure the project and rescue Agent Galen. However, Imperial forces raided the SIS headquarters and killed Rieekan along with several other SIS agents."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male human, Rieekan joined the Republic Strategic Information Service (SIS) sometime before the Cold War with the Sith Empire. By the year 3643 BBY, Rieekan had become the Bureau Chief of the Nar Shaddaa SIS branch. His unit kept a headquarters hidden on the Promenade, accessed by a secret turbolift behind Gudnem's Gadget Emporium."}, {"tag": "p", "text": "In 3643 BBY, the apprentice of Darth Angral, Lord Sadic, seized control of the Republic's Power Guard Project on the planet. Agent Galen of the SIS had arrived a few days earlier to secure the project, but he disappeared after contacting Rieekan. A Jedi Knight would arrive not long after, searching for both the project and Galen."}, {"tag": "p", "text": "Despite the fact that only half of his agents responded to the omega alert sent out by his subordinate Special Agent Korol Tander, Rieekan was adamant on not abandoning their base under the shop. He sent the Jedi Knight to the Nikto Sector in search of Galen, who had gone missing while looking for a contact that had been kidnapped by Angral's forces. He instructed the Knight to find Galen's reports that the agent had dead-dropped at specific points around the area, but warned him that the Sector was under the control of the Nikto gang the Kintan Kings."}, {"tag": "p", "text": "After the Knight found Galen's reports, Rieekan decoded them and told the Jedi about their contents. Galen's trail had ended at the Power Guard recruitment center, and the Jedi found the facility under the control of Imperial forces. The Knight defeated the Imperial shocktroopers who had seized the center, and freed Vell Narroc and the other recruiters. Using Narroc's information, the Jedi and Rieekan discovered that the Power Guard lab was located in the Red Light Sector. Rieekan instructed the Knight to destroy the sector's power grid so that they could discover the exact location."}, {"tag": "p", "text": "The Knight followed the trail to the main Power Guard Cybernetics Lab, where he found Imperial Commander Graul communicating with Lord Sadic via holocomm. The Knight defeated Graul and his Mark I Power Guards, and then rushed back to the SIS base—but it was too late. Sadic's Mark II Power Guards had already attacked the base, killing Rieekan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rieekan appears in Star Wars: The Old Republic as part of the main story quests for the Jedi Knight story arc on Nar Shaddaa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}