{"url": "Rights_of_Sentience", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic", "Category:Galactic Alliance laws and acts", "Category:Galactic Republic laws and acts", "Category:Imperial laws and acts", "Category:New Republic laws and acts"], "nodes": [{"tag": "h1", "text": "Rights of Sentience"}, {"tag": "p", "text": "The Rights of Sentience was one of the best-known clauses of the Galactic Constitution. It spoke out against speciesism and set out the rights that all members of the Galactic Republic were entitled to, including these:"}, {"tag": "p", "text": "When the Constitution was written in 25,053 BBY, the Rights of Sentience was one of its most radical sections. However, throughout its history, the Republic was hard-pressed to enforce the Rights, especially in its outlying regions. In the New Order, it was replaced with Human High Culture. The Rights were still practiced by the Rebel Alliance in defiance of the Empire and was reinstated when the New Republic Common Charter was drafted. Senate Resolution 54.325 most likely helped enforce the law. After Admiral Daala weakened Human High Culture, it can be presumed that the Rights found a place in the Imperial Charter."}, {"tag": "p", "text": "It is not known how the Galactic Republic determined which species were sentient. Such proved a problem for the droid rights movement, as droid sentience was questionable at best."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rights of Sentience is similar to the real-world Magna Carta, or the English Bill of Rights. Considering that the Galactic Constitution was in large part inspired by the United States Constitution, it can be assumed that the Rights of Sentience is the in-universe equivalent of the United States Bill of Rights. The laws enshrined within the Rights bear resemblance to the real world Emancipation Proclamation, Reconstruction Amendments (13th, 14th and 15th) and Civil Rights Act of 1964."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}