{"url": "Riileb_(species)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Hutt Space species", "Category:Insectoid sentient species", "Category:Riileb culture", "Category:Riileb"], "nodes": [{"tag": "h1", "text": "Riileb  (species)"}, {"tag": "p", "text": "The Riilebs were a sentient species of humanoid insectoids that were indigenous to the planet of Riileb. Members of the species were relatively tall, with gray, knobbly skin and two antennae, which were capable of detecting changes in the biorhythms of other organisms. Using their antennae, the species could detect the mood of those around them, which made them good at setting others at ease and so resulted in others perceiving the Riilebs as a likable people. They also possessed four nostrils on a nose that was much flatter than a Human's; two nostrils were for inhaling and two were for exhaling."}, {"tag": "p", "text": "The Riileb homeworld was within Hutt Space; however, after its discovery by Nimbanese scouts working for the Hutts, the Riilebs refused to bow down to the Hutts and serve them. Following several attempted invasions of Riileb by the Hutts, the slug-like species relented and the Riilebs retained their independence, making them one of the few species in Hutt Space to do so. Riileb society was controlled by the individual in possession of a piece of jewelry known as the ClanRing, which traditionally belonged to the eldest member of the motherclan, descendants of a mythical first Riileb, who was believed to have created the ring. The Riileb Tere Metallo was an agent of the Rebellion and the New Republic."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Riilebs were a sentient species of tall, lithe, insectoid humanoids, who stood taller on average than Humans and just shorter than Wookiees at between 2.00 and 2.75 meters in height. Members of the species shared a number of characteristics with Humans, including two arms each ending in a hand with four fingers and a thumb, and two legs, as well as having two sexes: male and female. Riileb possessed a mouth, which contained teeth, and they had a nose and a pair of eyes on the head. Hair grew from the pate, although nowhere else on the body. Unlike Humans, Riilebs possessed a pair of stamen-like antennae atop the skull, which were remnants of their insectoid ancestry, and capable of detecting changes in other beings' biorhythms. Such detection was capable of reading the pulse rate and blood pressure of Humans. The Riileb nose was flatter than a Human's and had four nostrils, two of which were for inhalation and the remaining two for exhalation. The species had ear flaps as opposed to ears, and fingers that were generally more slender than those of a Human. Riilebs' skin was knobbly and gray in color, while their eyes could be pink and their hair silver. They possessed a digestive system able to tolerate ale and tea."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "As a people, Riilebs were generally calm and collected, although they usually were determined to succeed in any task they undertook. They were tolerant of the cultures of other species, partially due to the Riileb ability to determine the moods of other using their antennae, including how stressed or nervous an individual was. Some Riilebs used this talent to their advantage in games such as sabacc, although no such games were played on their homeworld. The Riileb ability to sense others' moods also made the species skilled at setting other beings at ease; thus, many saw them as a personable people. Riilebs spoke a language also known as Riileb, but they were capable of speaking Galactic Basic Standard, as well as one of the native languages of the Wookiee species. While speaking Basic, some Riileb reverted back to their native language if shocked or angry, although sometimes for only as little as a single word of their native tongue. Some members of the insectoid species frowned when serious, gave a shrill screech when pleased and gulped down a lump in their throat if worried. The concept of marriage was a part of Riileb culture, and females who were not married traditionally did not grow a full head of hair; instead, they were allowed to have at least a single braid, which some individuals grew up to a meter in length and sometimes entwined with a silky, black tie. Male Riilebs, meanwhile, always had a full head of hair. Riilebs wore clothing similar to many other sentient beings in the galaxy, including boots, pants and shirts."}, {"tag": "p", "text": "Riileb society maintained many aspects of its insectoid heritage. Their cities were built on the same islands that their ancestors inhabited, consisting of complex and twisted alleys and passages similar to the labyrinthine mounds the ancients once built. The society was controlled by the individual who held an item known the ClanRing, a piece of jewelry believed to have been crafted by the first Riileb, a mythical figure among the species. The ring could rightfully be held only by the eldest member of a group named the motherclan, who were believed to be direct descendants of the first Riileb. The eldest member of the group received the ring once they reached the age of 30 local Riileb years, which was the equivalent of 21 standard years of age. Political intrigue, deceit, and infighting were common among the motherclan, however, and those further down the line of inheritance often arranged for the heir of the ring to be removed, with at least one individual being sold into slavery."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Riilebs evolved from a species of social insects on the swampy planet that shared the name Riileb, within the Riileb system. Their ancestors possessed antennae and lived on the few small islands of dry land found on their hot and humid homeworld, where they built complex, maze-like mounds. At some point after the Riileb developed a feudal level of technology, their star system came to be considered as within the region of the galaxy known as Hutt Space, where it was located as early as 4000 BBY. The species had its first contact from off-worlders when a group of Nimbanese scouts, serving the regionally dominant Hutt species, arrived on Riileb. The Nimabanese attempted to persuade the Riilebs to agree to voluntary servitude to the Hutts, but the insectoids rejected the idea. Following the refusal, several attempts were made by the Hutts to take control of Riileb by force and enslave its people, but the Hutt forces, which were controlled by a Hutt named Velrugha, were successfully repelled by the natives each time. The Hutts gave up and began searching for less-resistant worlds to conquer, leaving the Riilebs as one of the few independent species in Hutt Space, along with the Sakiyan species of Sakiya. Following the discovery of the Riilebs by the rest of the galaxy, they gained access to the standard levels of technology available throughout known space, which they implemented on their homeworld. Due to its independence, Riileb became known as a haven within Hutt Space for those wishing to avoid the Hutts. Nonetheless, the planet saw little interstellar traffic, bar those looking to trade in heklu—amphibious animals native to the planet—which were eaten and considered a delicacy within the Core Worlds."}, {"tag": "h2", "text": "Riilebs in the galaxy"}, {"tag": "p", "text": "Riilebs were not a common sight in the galaxy, although not unknown. Many left their homeworld to become traders or to use their mood detection abilities to excel at careers in bar-tending, psychiatry or as physicians."}, {"tag": "p", "text": "Tere Metallo was a female Riileb who was born to the motherclan and stood to inherit leadership at the age of 30. At the age of 25, however, she was sold into slavery by a jealous sister. Metallo was rescued from slavery by a Corellian smuggler named Bek Nataal, who taught her a large amount about smuggling and piloting before he was killed during an unexpected inspection by officials of the Galactic Empire. The Riileb was captured by the Imperials and imprisoned and tortured before escaping to Corellia, where she took up work repairing starships. When she earned enough credits, she bought her own ship, a Suwantek Systems TL-1800 freighter that she named Star Quest. For several years, she made legitimate runs in the Mid Rim. During this time, she took on a Human co-pilot named Matt Turhaya."}, {"tag": "p", "text": "During a stop on the planet of Kabaira, the pair aided members of a cell of the Alliance to Restore the Republic, as one member was an old acquaintance of Metallo. The pair then began running supplies for the Rebel Alliance, although Turhaya was killed while doing so. Metallo eventually accepted a commission in Alliance Intelligence after the Battle of Yavin and used her work as a free trader to slip onto Imperial-controlled worlds and provide intelligence from them. After the transition of the Rebel Alliance into the New Republic, Metallo continued working for the organization; in 9 ABY, she took up a mission to destroy a secret Imperial research facility on the planet of Sarahwiee. She and her crew took a job from Imperials on the planet of Garos IV to ship supplies to the facility, planning to destroy the base with explosives. During their flight to Sarahwiee, Metallo discovered that a member of the resistance against the Imperials on Garos IV had stowed away on their ship in hope of rescuing a friend who was being held on Sarahwiee. The Riileb agreed to transport the Human, Alexandra Winger, to the planet and on the surface helped save her friend, a Human scientist named Carl Barzon. Once at the facility, the group planted explosives and escaped after a short firefight with Imperial stormtroopers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Riilebs first appeared in the short story \"Rendezvous with Destiny,\" authored by Charlene Newcomb and published in the sixth issue of the Star Wars Adventure Journal in 1995. Newcomb created the species via the character Tere Metallo, who appeared in the prequel short story named \"Passages,\" published in 1996 as part of the seventh issue of the Adventure Journal. In 1997, the Riileb species was fleshed out by Brian Smithson in the article \"Alien Encounters,\" found in the thirteenth issue of the Adventure Journal. The article was partially reprinted in March 1998 in the role-playing sourcebook also named Alien Encounters, a collection compiled by Paul Sudlow that included information from all of the Alien Encounters articles. Both instances presented Riileb stats that favored perception and mechanics."}, {"tag": "p", "text": "The Riilebs received an entry in the Star Wars Encyclopedia written by Stephen J. Sansweet in June of the same year. The Riilebs would not be mentioned again until 2008 when they received an entry in the The Complete Star Wars Encyclopedia written again by Sansweet, this time with aid from Pablo Hidalgo. The species were also mentioned in the 2009 reference book The Essential Atlas by Jason Fry and Daniel Wallace and the 2012 reference book The Essential Reader's Companion by Hidalgo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}