{"url": "Rigosso", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Belugans", "Category:Majors", "Category:Males"], "nodes": [{"tag": "h1", "text": "Rigosso"}, {"tag": "p", "text": "Major Rigosso was a Belugan male military officer in the service of Lord Otua Blank on the planet Quarzite. During the year 20 BBY, the Belugans kidnapped the Kage female Pluma Sodi with orders to bring her back to Blank for the dictator's personal pleasure. However, as the threat of Sodi's rescue by Kage Warriors loomed over the mission, Rigosso hired a team of six bounty hunters to protect and safely deliver Sodi to Blank's stronghold."}, {"tag": "p", "text": "After Rigosso greeted the bounty hunters at the planetary turbolift, which escorted Quarzite visitors below the planet's high-pressure surface, the Belugan major briefed the hunters on the mission and warned them of the dangers. Once underground, the delivery squad traveled by subtram but were attacked by Kage Warriors en route. Following a prolonged fight between the two groups, Rigosso was killed by the Kage leader, and Sodi was eventually rescued."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Dealing with the Kage"}, {"tag": "p", "text": "A Belugan male from the planet Quarzite, Rigosso served the Belugan dictator Lord Otua Blank as a military officer with the rank of major during the intragalactic Clone Wars. In the year 20 BBY, a conflict waged between Quarzite's two native species, the Belugans and the human-like Kage. The elite Kage Warriors were known to raid Belugan subtrams, and Rigosso's elite troops proved to be ineffectual against them. At some point, the Belugans kidnapped the Kage female Pluma Sodi, whom Blank planned to make his bride."}, {"tag": "p", "text": "However, with Blank's men outmatched by the Kage Warriors who would likely attack Sodi's escort, the Belugans turned to outside help. For a fee of 600,000 credits, Rigosso hired a team of six bounty hunters led by the up-and-coming hunter Boba Fett to come to Quarzite; the bounty hunters were initially unaware, however, that their assignment would be to protect Sodi from Kage rescue attempts."}, {"tag": "h3", "text": "Safe cargo"}, {"tag": "p", "text": "Due to Quarzite's highly pressurized atmosphere, Rigosso met the team of bounty hunters—Fett, Bossk, Latts Razzi, C-21 Highsinger, Dengar, and Asajj Ventress—at a space station built outside of the planet's atmosphere. The station contained a massive turbolift that descended below Quarzite's pressurized surface, where the Belugans and Kage lived. Rigosso introduced himself to the bounty hunters and briefed the group on the mission objectives, the Kage, Lord Blank, and Quarzite's peculiar atmosphere. Rigosso and Fett discussed the mission further while riding the turbolift together, and the Belugan eventually revealed that they would be traveling to Blank's stronghold via subtram."}, {"tag": "p", "text": "For the escort, Sodi was stored in a container. Rigosso stressed that under no circumstances was Sodi's box to be opened, lest the hunters learn of their cargo. Sodi was moved into a passenger car with Rigosso while the hunters spread out across the tram alongside two other Belugan guards. As the Belugans feared, the subtram fell under attack from Kage Warriors riding milodons almost immediately after departure. The acrobatic warriors boarded the train en masse and, despite heavy losses, reduced the defenders to just Rigosso, Fett, and Ventress."}, {"tag": "p", "text": "With the bounty hunters occupied, Rigosso placed himself between Sodi and the Kage leader, Sodi's brother Krismo, as a final line of defense. The standoff was brief, and Rigosso was impaled by one of Krismo's electro swords. Sodi and Krismo were later allowed to escape by Ventress for a sum of money after the bounty hunter had a change of heart over the mission objectives, thus rendering the Belugan mission a failure."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Major Rigosso was a staunch loyalist to Otua Blank and followed his master's orders. Rigosso's voice often carried a positive tone while speaking of Blank, whom he often referred to as \"my lord.\" Although accommodating to the bounty hunters, he did not appreciate the hunters nosing about the cargo and threatened them with punishment if they failed to ensure its safe delivery. Rigosso's concern for Pluma Sodi's safety lay only in the interest of Blank receiving a healthy bride. Despite his cordial introduction, the hunter Ventress felt a sense of urgency in Rigosso's welcome and that he was in a hurry."}, {"tag": "p", "text": "Rigosso was also a capable combatant and dispatched multiple Kage Warriors with a blaster pistol during the subtram brawl. He outlasted the Kage until only Krismo Sodi remained. However, when the two confronted each other, Rigosso laughed in Krismo's face over the idea of the Kage rescuing his sister—and the Belugan was killed for his troubles."}, {"tag": "p", "text": "Rigosso had a thin, somewhat gaunt appearance, with orange-and-gray-colored skin. He had white eyes with black, star-shaped irises."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Major Rigosso wore a brown-colored military uniform complete with a form-fitting bodysuit, a two-piece breastplate, boots, shoulder pads, and gauntlets with clawed gloves. Each of Rigosso's gauntlets had a pistol holster, one of which held Rigosso's silver blaster pistol when the Belugan did not have it drawn. Parts of Rigosso's uniform had white, ribbed patches, and his left breastplate displayed a black-and-yellow Belugan emblem. Although similar to the uniform worn by the Belugan soldiers, Rigosso's lacked certain bits of armor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Major Rigosso appeared in \"Bounty,\" the twentieth episode from the fourth season of the animated television series Star Wars: The Clone Wars, which aired on March 2, 2012. Rigosso was voiced by Tom Kane in the episode. Conceptual artwork of the character was rendered by Darren Marshall."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}