{"url": "Rimma_Trade_Route/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Colonies hyperlanes", "Category:Core Worlds hyperlanes", "Category:Expansion Region hyperlanes", "Category:Inner Rim hyperlanes", "Category:Mid Rim hyperlanes", "Category:Outer Rim Territories hyperlanes", "Category:Rimma Trade Route", "Category:Super-hyperroutes"], "nodes": [{"tag": "h1", "text": "Rimma Trade Route"}, {"tag": "p", "text": "The Rimma Trade Route was one of the major routes that crossed the galaxy. It started at Abregado-rae in the Core Worlds, and went all the way to the Kathol sector in the far reaches of the Outer Rim Territories. It was estimated that traveling the full length of the route would take at least six weeks with a Class 2 hyperdrive.[source?]"}, {"tag": "p", "text": "An important branch of the Rimma, the Shapani Bypass, grew increasingly important in later years, and some considered it part of the Rimma for all practical purposes."}, {"tag": "p", "text": "Another branch, which was a continuation of the Rimma, was the Trition Trade Route. The Trition began at Karideph and continued on into the Kathol sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Herglic Trade Empire joined the Galactic Republic in 13,000 BBY, the Hidakai Pool begun to develop. From there, Herglics and Givin theorists knit together the Rimma; Sullustan merchants who came to Tapani sector and having innate navigational talents, found ready jobs as scouts, pilots and hyperspace mappers and established the Route 5500 BBY."}, {"tag": "p", "text": "The Rimma Trade Route was seized by the Sith Empire as part of their initial infiltration of Republic space in 3681 BBY. Consequently, it was economically strangled by imperial sanctions."}, {"tag": "p", "text": "Its dominant worlds (Denon and Eriadu) were ruled by Humans."}, {"tag": "p", "text": "Commerce along the Route enriched SoroSuub Corporation, the Tapani sector and colonization of the south."}, {"tag": "p", "text": "In the years before the Invasion of Naboo, the Trade Federation had a de-facto monopoly on the Rimma Trade Route. Subsequently, the planets on the route were the main recruitment grounds for the Nebula Front."}, {"tag": "h2", "text": "Notable planets"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}