{"url": "Rikummee", "categories": ["Category:Legends articles", "Category:Kashyyyk residents", "Category:Males", "Category:Royalty", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Rikummee"}, {"tag": "p", "text": "Rikummee was a brash and trouble-prone Wookiee male who lived during the waning years of the Galactic Republic. He was the son of the Wookiee royal King Grakchawwaa, and so lived as a prince on his species' homeworld of Kashyyyk. During the Clone Wars between the Republic and the separatist Confederacy of Independent Systems in 21 BBY, both governments were vying for the favor of Rikummee's father and the Wookiee people. The Confederates quickly became impatient with the indecisive Grakchawwaa, and so dispatched a number of hostile battle droids to the forests outside of the Royal City. While on a hunt with his protector Ghraggka in the Western Forest, Rikummee was shot and killed by one of these droids. Upon learning of his son's murder, King Grakchawwaa declared war against the Confederacy and joined the Republic's fight against the invaders."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Rikummee was a young male Wookiee alive during the final decades of the Galactic Republic's reign. He was born to his father Grakchawwaa, a mighty hunter and an elder Wookiee member of the Royal Families that ruled their species' homeworld of Kashyyyk. Grakchawwaa was the recognized king of Kashyyyk, and as such, Rikummee lived as prince on the planet. Despite his noble standing, the young Wookiee was rambunctious and adventurous, and thus required a protector during his journeys away from the Royal City; because his father was preoccupied with matters of state, he named the warrior Ghraggka as his son's guardian. Rikummee and Ghraggka participated in several hunts together in Kashyyyk's forests, but the younger Wookiee repeatedly found himself in situations of trouble from which Ghraggka had to rescue him."}, {"tag": "p", "text": "In 22 BBY, the galaxy exploded into conflict between the long-standing Republic and the separatist Confederacy of Independent Systems. Around eighteen months after the struggle of the Clone Wars began, Rikummee's father and the Royal Families of Kashyyyk were approached by representatives from the Trade Federation—one of the Confederacy's major corporate backers. Federation Viceroy Nute Gunray traveled to the Kashyyyk system and planted a Confederate battleship in orbit of the young Wookiee's home planet, hoping to intimidate and entice King Grakchawwaa into an alliance with the Separatists. The king's conflicting loyalties and desires for neutrality made him slow to respond, causing the Neimoidian and his superiors quickly became impatient. To expedite Royal's deliberations, the Federation dispatched hostile battle droids to the planet's surface."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although King Grakchawwaa undeniably dominated the council which decided on what course of action Kashyyyk should take in the Clone Wars, the same story, Deep Forest, makes clear that there were multiple Kashyyyk Royal Families. It is thus unclear exactly what sort of status the royal titles of the King and his son denote."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}