{"url": "Rim_faction", "categories": ["Category:Legends articles", "Category:Galactic Senate organizations", "Category:Political factions"], "nodes": [{"tag": "h1", "text": "Rim faction"}, {"tag": "p", "text": "The Rim faction, led by Orn Free Taa, was one of the two major factions of senators and representatives in the Galactic Senate during the last years of the Galactic Republic. Other members included Mot-Not Rab, Tikkes, and Onaconda Farr."}, {"tag": "h2", "text": "Formation and beliefs"}, {"tag": "p", "text": "Most of the Rim faction's members were non-Human, and astrographically, most came from the Mid Rim, Outer Rim, and the various special interest groups—such as the Techno Union, Commerce Guild, Corporate Alliance, and Trade Federation."}, {"tag": "p", "text": "They were a politically conservative party and so advocated reducing the power and influence of the Republic government. As such, they commonly stood for the maximization of planetary sovereignty, placing them in direct opposition to the Core faction, who favored greater centralization of power. Fiscally, the Rim Faction advocated for economic liberalism, thus supporting free trade, low taxes, minimal restrictions on enterprise, and the deregulation of markets."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Rim faction were strong opponents of Chancellor Finis Valorum, and were quick to seize upon his weakness in the aftermath of the Eriadu Trade Summit disaster of 33 BBY. In the hope of restricting his ability to pass legislation unfavorable to them, Taa directed the Rim faction to elect Mas Amedda, one of their own, into the powerful position of Vice Chair."}, {"tag": "p", "text": "The next year, it was the strong support of the Rim faction for Amidala's vote of no confidence that enabled the toppling of Valorum and the ensuing election for Chancellor. Once more on the nomination of Taa, Palpatine, despite being independent of any Senate political grouping, was the Rim faction's nominee for Chancellor. It is possible that because of his neutrality, a rogue section of the Rim faction backed Ainlee Teem for Chancellor. However, Palpatine won."}, {"tag": "p", "text": "Taa's hope that Palpatine could be controlled, or at least counted on to not be a nuisance, were eventually realized as false when he ensured the Core faction's attachment to him. During the Separatist Crisis and Clone Wars, a large number of the Rim faction's membership became Separatists and either left or were expelled from the Senate. Other senators, such as Taa, Aks Moe, and Onaconda Farr, supported the Military Creation Act vigorously. Despite the continued loyalty of Taa and Amedda, this combined with Palpatine's courting of the Core faction resulted in great weakening of the Rim faction."}, {"tag": "h2", "text": "Members"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}