{"url": "Ringoot", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Individuals of unspecified species", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ringoot"}, {"tag": "p", "text": "Ringoot was a male individual who served the Jedi Order as a Padawan during the time of the Clone Wars. Circa 21 BBY, a friend of Ringoot was assigned to travel to the planet Dorin and become the apprentice of Jedi Master Plo Koon. Jealous, Ringoot set out to follow his friend to Dorin, but he was captured en route by the Dark Jedi Asajj Ventress and taken to a Separatist training facility on the planet Pzandias. A short time afterward, Ringoot's friend was also captured by the Separatists, and the individual was forced to choose to fight either Ringoot or Ventress."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ringoot was a male individual who became a member of the Jedi Order during the waning years of the Galactic Republic. He was a friend of another Jedi student, and, by the time of the Clone Wars, they had both become Jedi Padawans. Circa 21 BBY, Ringoot and his friend were carrying out weapons practice inside the Jedi Temple on the planet Coruscant when they were approached by an MV-2 messenger unit, which summoned Ringoot's friend to speak with Jedi Grand Master Yoda. The individual met with Yoda, who assigned the Padawan to travel to the planet Dorin, to train under Jedi Master Plo Koon. Ringoot waited in his friend's quarters inside the Temple, and when the Padawan returned, the individual explained to Ringoot the mission to Dorin. Believing that he could help, Ringoot requested that the Padawan ask Yoda for permission for him to accompany his friend to Dorin."}, {"tag": "p", "text": "Ringoot's friend refused to ask Yoda if Ringoot could go on the mission, and the individual set out for Dorin alone. Jealous, Ringoot set out to follow the Padawan to Dorin, but he was apprehended en route by the Dark Acolyte Asajj Ventress and taken to a Separatist training facility on the world Pzandias. A short time afterward, Ringoot's friend was also captured while investigating the Pzandias facility with the Advanced Recon Commando Alpha 58. On the orders of Confederate Head of State Count Dooku, a battle droid escorted Ringoot to a room in the facility where his friend was being held by Dooku and Ventress, and Ringoot told his friend about how he had been captured. Dooku wanted to demonstrate to the recruits being trained in the facility how fallible Jedi were, so he told Ringoot's friend to fight Ringoot, stating that if the Padawan refused, the individual would have to fight Ventress instead."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ringoot disliked Count Dooku, and he wanted to participate in the Jedi Order's efforts to defeat the Sith Lord. Yoda believed that Ringoot would be placed in danger if he went on the mission to Dorin, but despite that, Ringoot was envious of his friend for being given the assignment, because he believed that he was missing out. During the time they spent at the Jedi Temple, Ringoot and his friend liked to rig transistor bugs and race against each other to see who could be the first to hack into the accounts of their fellow students."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ringoot was created by Sue Behrent and appeared in The Clone Wars: Decide Your Destiny: Dooku's Secret Army, a book in the Star Wars: The Clone Wars: Decide Your Destiny series. During the course of the novel, the actions of Ringoot's Padawan friend are determined by choices made by the reader. When Ringoot requests that the Padawan ask Yoda if Ringoot can go on the mission to Dorin, the reader can choose whether or not the Padawan accepts the request, and, if they refuse, Ringoot pleads for his friend to reconsider. If the reader does choose for the Padawan to ask Yoda, the Jedi Master states that Ringoot would be put at risk if he went on the mission, and if the Padawan still insists that Ringoot be allowed to go, Yoda concludes that the Padawan is not ready for the mission, and lets neither the Padawan or Ringoot go on the mission."}, {"tag": "p", "text": "Later in the novel, it is possible for the Padawan to encounter Ringoot inside the Separatist training facility on Pzandias, and the reader is given the choice of having the Padawan fight either Ringoot or Asajj Ventress. If the Padawan chooses to fight Ventress, then Ringoot begs his friend to fight him instead, and he watches as Ventress kills his friend. If the reader chooses for the Padawan to fight Ringoot, instead of Ventress, then Dooku orders the two Jedi to be taken to the facility's sparring room. There, Dooku orders that they be given lightsabers, and the Padawan requests that Dooku allow Ringoot and Alpha 58 to live if Ringoot wins the duel. The Padawan then prepares to allow Ringoot to be the victor in their duel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}