{"url": "Rinnrivin_Di%27s_cartel", "categories": ["Category:Canon articles", "Category:Criminal syndicates and cartels", "Category:First Order organizations"], "nodes": [{"tag": "h1", "text": "Rinnrivin Di's cartel"}, {"tag": "p", "text": "Rinnrivin Di's cartel was a Nikto cartel created and led by the Kajain'sa'Nikto Rinnrivin Di in the decades after the Galactic Civil War. The cartel rose to power in the absence of Jabba the Hutt, and the organization was an instrumental part in the Centrists' conspiracy to bring about the rise of the First Order. Rinnrivin Di's cartel based its operations on the planet Bastatha, and, in addition to receiving financial support from the Centrists, it targeted the commercial shipping lanes around Ryloth as a source of revenue. Twenty-four years after the Battle of Endor, Emissary Yendor of Ryloth pleaded help from the Galactic Senate, so senators Leia Organa and Ransolm Casterfo agreed to investigate the cartel's actions. Organa soon uncovered the conspiracy when she tracked Di to Sibensko, where the cartel leader was killed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Rinnrivin Di's cartel was involved in several activities including smuggling spice, gambling, and piracy. They had a mutual relationship with a pro-Imperial militia called the Amaxine warriors, who acted as their financiers and partners. Amaxine warriors served as their pilots and took part in raids on legitimate commercial traffic. Rinnrivin's cartel also extorted protection money from merchants. Revenue from the cartel's gambling and smuggling operations was channeled to Centrist sources and shadowy corporations in the Outer Rim Territories, who funnelled the money to the First Order's fleet. Rinnrivin's cartel had bases on both Bastatha and Sibensko."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "An insidious alliance"}, {"tag": "p", "text": "The Kajain'sa'Nikto known as Rinnrivin Di started of as a lowly spice dealer who worked for the Hutts during the Age of the Empire. Due to the entrenched xenophobia that dominated the Galactic Empire, Rinnrivin turned to crime in order to build a career. About seven years before the Napkin Bombing, Rinnrivin Di became the leader of one of the galaxy's largest criminal enterprises after receiving billions of credits from the Amaxine warriors, a pro-Imperial militia group that acted as proxies for the First Order, a remnant of the \"Old Empire\" that had retreated to the Unknown Regions."}, {"tag": "p", "text": "Rinnrivin Di's cartel had a mutual relationship with the Amaxine warriors, who acted as both their financiers and partners. Rinnrivin's cartel was involved in various criminal activities including smuggling, spice trafficking, gambling, and the raiding of legitimate commercial traffic in the Gaulus sector; which contained the planet Ryloth. The Amaxine warriors served as pilots for Rinnrivin's cartel through their bases on the planets Daxam IV and Sibensko. The revenue earned through the smuggling and gambling interests of Rinnrivin's cartel were channeled back to the First Order through the auspices of the Amaxine warriors. The First Order used these funds to rebuild the old Imperial fleet."}, {"tag": "h3", "text": "Discovery"}, {"tag": "p", "text": "In 28 ABY, Rinnrivin Di's cartel had exacted a heavy toll on the Twi'lek homeworld of Ryloth's offworld trade. Taking advantage of the indecisiveness and inaction of the New Republic's Galactic Senate, Rinnrivin's cartel raided legitimate commercial shipping in the Gaulus sector, weakening Ryloth's economy. Many Twi'lek pilots were raided by Rinnrivin's Amaxine partners while other merchants were forced to pay protection money. Rinnrivin Di's cartel operated from the Outer Rim world of Bastatha, a barren desert world that had become a popular casino destination."}, {"tag": "p", "text": "On behalf of the Galactic Senate, the Populist Senator Leia Organa and her Centrist colleague Ransolm Casterfo visited Bastatha to investigate the planet's casino operations. There, Rinnrivin kidnapped Leia and brought her to his secret underground headquarters where he attempted to bribe her into decriminalizing the spice trade. Shortly later Leia was rescued by Casterfo and the Bastatha authorities took control of Rinnrivn's base. However, Rinnrivin and most of his henchmen managed to flee offworld. Despite his escape, Leia and Casterfo discovered that Bastatha's gambling revenue was being siphoned off to shadow corporations in the Outer Rim."}, {"tag": "p", "text": "Later, Leia's starfighter pilots Joph Seastriker and Greer Sonnel learned about the Amaxine warriors' existence during a trip to Pamarthe. They learned that the Amaxines had sources who told them about passing cargo ships. The Amaxine warriors were led by Arliz Hadrassian, a former TIE fighter pilot who admired the \"Old Empire.\" In an attempt to sow chaos in the New Republic, Hadrassian bombed the Galactic Senate's conference building on Hosnian Prime. However, this only redoubled the resolve of Leia and Ransolm to investigate Rinnrivin Di's cartel and their Amaxine partners."}, {"tag": "p", "text": "While Ransolm traveled to Daxam IV to investigate the Amaxine presence there, Leia and her staff including C-3PO and Korr Sella visited the Ryloth archives. There, they found information concerning Rinnrivin's humble origins as a lowly spice dealer and his sudden rise to being the leader of one of the galaxy's largest criminal syndicates. Leia and her team suspected that Rinnrivin was linked to the Centrists. After consulting Casterfo, Joph and C-3PO managed to tap into one of Rinnrivin's satellites above Ryloth and discovered that the crime lord was hiding on the Expansion Region world of Sibensko. While monitoring Rinnrivin's transmissions, Leia and her team discovered that Rinnrivin was visiting the planet Harloff Minor, which lay near Coruscant."}, {"tag": "p", "text": "Leia then arranged a secret meeting with Rinnrivin Di on Harloff Minor. The two met at a private restaurant on one of Harloff's equatorial cities. During the meeting, Rinnrivin took care to denounce the \"Napkin Bombing\" as a terrorist act while Leia reassured him that she had not been expecting Ransolm to rescue her. Rinnrivin sought to ingratiate himself with the New Republic senator and referred to her as \"Huttslayer\", an honorific title she had gained for single-handedly killing Jabba Desilijic Tiure. Leia also took the opportunity to return the holocube of her killing Jabba on the grounds that she did not need to be reminded about the past. Unknown to Rinnrivin, she had fitted the device with a tracking device. During the meeting, Rinnrivin also hinted that he had \"powerful friends.\""}, {"tag": "h3", "text": "Decline"}, {"tag": "p", "text": "Later, Leia and her team traveled to Sibensko to investigate the Amaxine base there. While downloading banking records from the underwater city's cantina, Leia and her companions were cornered by Rinnrivin and his henchmen. Rinnrivin had by then realized that Leia had fitted a tracking device to his holocube. When Rinnrivin remarked that he had hoped they could be friends, Leia retorted that she would not be his \"tool.\" Since Rinnrivin was working with the Amaxines, he attempted to prevent the Senator and her companions from leaving Sibensko alive. However, Leia fired at the bolt holding up a large water tunnel. Rinnrivin and his henchmen were crushed to death by the falling tunnel."}, {"tag": "p", "text": "Leia and her team managed to escape the Sibensko base with the help of her husband Han Solo. However, the Amaxine base and the underwater city was destroyed when an Amaxine B-wing collided with the base's weapon depot; triggering a massive explosion. Despite the destruction, C-3PO managed to download invaluable data showing that the Amaxine warriors including Arliz Hadrassian had funnelled billions of credits in start-up capital to Rinnrivin seven years prior; enabling him to become a major power. However, C-3PO was unable to access extra layers of data which showed that the First Order had been sponsoring both the Amaxine Warriors and Rinnrivin's cartel ."}, {"tag": "p", "text": "Following Leia's Mission to Sibensko, many in the New Republic Senate and media believed that the Amaxines had been the primary instigator and financier behind Rinnrivin's cartel. Despite the death of Rinnrivin, he contributed to the rise of the First Order by generating revenue for their military fleet through his smuggling and gambling operations. With the defeat of Rinnrivin's cartel and the Amaxine Warriors, many in the Galactic Senate believed that there were no more serious threats to the Republic's security. However, Leia disagreed and formed the Resistance to protect the New Republic from various threats including the First Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}