{"url": "Ringo_Vinda/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Confederacy of Independent Systems planets", "Category:Eucer sector planets", "Category:Ringo Vinda locations"], "nodes": [{"tag": "h1", "text": "Ringo Vinda"}, {"tag": "p", "text": "Ringo Vinda was a planet located in the Ringo Vinda system, within the Eucer sector of the galaxy's Mid Rim. An important industrial production center, it was encircled by a massive space station that served as a distribution point for all incoming and outgoing resources."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 20 BBY, the third year of the Clone Wars, Ringo Vinda space station was controlled by Admiral Trench of the Confederacy of Independent Systems. During the Battle of Ringo Vinda, clone trooper CT-5385 executed Jedi Master Tiplar when Protocol 66 was accidentally triggered in his inhibitor chip, forcing the Galactic Republic to withdraw and leave the world under Separatist control. Officially, CT-5385's mental instability was said to be caused rare Ringo Vindan parasite that caused his inhibitor to decay, and a vaccine was prepared to inoculate the other clones and prevent similar incidents in the future, hiding the true nature of Order 66."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ringo Vinda first appeared in \"The Unknown,\" the first episode of the animated series Star Wars: The Clone Wars' sixth season, which originally aired in Germany on February 15, 2014. While unidentified in the episode itself, it was named in the opening newsreel. The planet's design was derived from early concept art of Cato Neimoidia developed by Ryan Church during the concept design phase of Star Wars: Episode III Revenge of the Sith. The Essential Atlas Online Companion placed the Ringo Vinda system, and therefore Ringo Vinda itself, in grid square R-7."}, {"tag": "p", "text": "The design that inspired Ringo Vinda was previously repurposed in AT-AT Villa and Executor Executes, in-universe paintings by Ryan Church featured in Celestia Galactica Photografica, which was collected in Star Wars: Visionaries."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}