{"url": "BX-series_droid_commando/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:B-series battle droid models", "Category:BX-series droid commandos"], "nodes": [{"tag": "h1", "text": "BX-series droid commando"}, {"tag": "p", "text": "The BX-series droid commando, more commonly known as the commando droid, was an elite battle droid model made for stealth assignments."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "These battle droids appeared similar to the B1-Series battle droid series; notable changes include two white photoreceptors, in addition to the long head being shortened to half its original size. Their voices were notably different compared to the B1 series, sounding more akin to the deep voices of B2 super battle droids. Unit leaders, which were ranked as captains, were fitted with white marks on their brows and chestplates. The captain would also have a vibrosword."}, {"tag": "p", "text": "They had the same operating abilities as B1 battle droids, with the addition of infiltration software. This, along with their humanoid shape, allowed them to fit into a clone trooper's armor. In addition to this, the droids were capable of modulating their voices to match that of others, though they could not accurately copy their mannerisms or vocabulary, nor respond properly to unexpected situations outside of combat."}, {"tag": "p", "text": "The droid commandos were built to be substantially faster and stronger than a regular battle droid, and also possessed heavier armor that was capable of withstanding multiple shots from most blasters. However, sustained barrages or a single headshot could overwhelm them, but like super battle droids and IG-100 MagnaGuards, at least one unit confronting Eeth Koth was sliced in half, but remained operational long enough for Koth to render it inoperable with a stab to the head. The only real drawback of these droids was that they were far more expensive to produce than the regular infantry. This made the droids a fairly rare sight on the battlefield and thus made them to be used exclusively on special and or critical missions only. Apparently, the head was weaker than the rest of its body, as Senator Amidala was able to easily kill one by shooting it in the head with an ELG-3A royal blaster pistol, which was hardly bigger than a hold-out blaster."}, {"tag": "p", "text": "The equipment of the droid commandos included E-5 blaster rifles, a stun baton to knock out enemies, and a fusioncutter, used to cut down doors and other obstacles in their path. In addition to this, the leader of a droid commando unit often carried a vibrosword for close-combat purposes. They were also known to use grenades against enemy emplacements. Also, two commandos on Saleucami formed a sniper team, one acting as the shooter with a sniper rifle and the other using electrobinoculars, performing as the spotter."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "BX-series droid commandos were designed to accomplish tasks that an overwhelming force of droids could not. Captain Rex and Commander Cody both defeated droid commandos in combat on the Rishi moon, and the clone deserter, Cut Lawquane, managed to defeat a force of 20 Commando droids with only minimal assistance from Captain Rex on Saleucami, although the droids they fought were heavily damaged. They were capable of hand-to-hand combat, had greater accuracy with their E-5 carbines, and even sniper capability. However, due to their prohibitive cost, they could not be mass-produced in such a manner as to replace the Confederacy's other battle droids so they were used for special operations, boarding parties, and raids."}, {"tag": "h3", "text": "Battle of the Rishi Moon"}, {"tag": "p", "text": "Around 22 BBY, Confederate General Grievous, the Supreme Commander of the Droid Armies, planned to invade the Wild Space planet of Kamino, where the Republic clone troopers were grown. In order to invade the planet unnoticed, Grievous sent several Droch-class boarding ships containing BX-series droid commandos to the moon of Rishi, where a Republic listening post, the Rishi Station was located. The clones stationed on the listening post identified the boarding ships as a meteor shower, and did not alert a nearby Republic fleet. The droids caught the deck officer, CT-327, by surprise, stunning and killing him. They then infiltrated the listening post, but were met by two clones, Droidbait and Nub, who had been sent by Sergeant CT-19-7409 to find out why CT-327 did not reply. Upon hearing fire, the remaining clones rushed to help, but were outnumbered by the commando droids. CT-19-7409 was also killed by the commandos in the ensuing firefight. However, four clone troopers were able to escape the station through a ventilation shaft. The droids then secured the post and jammed the all-clear signal."}, {"tag": "p", "text": "The droid commandos, however, were not aware that a routine inspection of the station conducted by Commander CC-2224 and Captain CT-7567 was on its way. Upon arriving in the Nu-class attack shuttle Obex, the two clone officers were greeted by a commando droid dressed in a clone armor. The droid tried to convince the clone troopers to leave the listening post; however, CT-7567 saw a droid attack flare fired from the survivors. Realizing the trick, he shot the disguised droid through the head. The commando droids then launched an ambush, and after throwing grenades toward the clones and destroying shuttle, the droids believed that the two had died in the explosion. In fact, CC-2224 and CT-7567 had survived with the help of their harpoon cables. Meeting the survivors of the first droid assault below the station, the officers introduced themselves and a plot to retake the station was developed. CT-7567 used a droid commando head to cheat the droids within the station to open the door. The clones then stormed the station, eventually regaining control of the control center after killing the commandos, including the droid captain. Despite reinforcements sent by General Grievous, the clone troopers blew up the station, cutting off the all-clear signal, thus alerting the Republic fleet of the planned Confederate invasion."}, {"tag": "h3", "text": "Ambush on Kynachi"}, {"tag": "p", "text": "Jedi Nuru Kungurama and his squad, called Breakout Squad, fought three of these units on a mission on the planet Kynachi."}, {"tag": "h3", "text": "Battle of Ryloth"}, {"tag": "p", "text": "During the Battle of Ryloth, at least two droid commandos were present in the capital city of Lessu. The two attacked the ARF troopers Razor and Stak, shortly after the two troopers activated the plasma bridge and allowed Republic forces to enter the city. Even using fellow battle droids as projectiles, they eschewed the use of blasters and engaged the two troopers in hand-to-hand combat, but were soon defeated."}, {"tag": "h3", "text": "Senate Hostage Crisis"}, {"tag": "p", "text": "Later on, two of these units were used by bounty hunter Cad Bane during his capture of the Senate Building. After killing a contingent of Senate Commandos that guarded the landing area, the two BX-series droids stripped two bodies of their armor and disguised themselves as the commandos. They later escaped with Bane, Ziro and the other Bounty hunters."}, {"tag": "p", "text": "They were also deployed during the Battle of Tirahnn."}, {"tag": "h3", "text": "Battle of Saleucami"}, {"tag": "p", "text": "A squad of such commando droids accompanied General Grievous when he boarded Jedi Master Eeth Koth's Venator-class Star Destroyer. The droids defeated the Jedi's clone trooper guards but were destroyed by Koth. Later, during a rescue attempt conducted by the Jedi to rescue Master Koth, Jedi General Obi-Wan Kenobi's light cruiser was boarded and its crew was assaulted by BX-series droids. Anakin Skywalker and Adi Gallia found a squad of commando droids, commanded by TV-94, guarding Koth when they boarded Grievous's flagship. Skywalker and Gallia destroyed all of the droids and rescued Koth."}, {"tag": "p", "text": "Later during the Battle of Saleucami, Grievous's forces were forced to crash land onto the planet Saleucami where a pair of commando droids serving as a sniper unit were operational. The droid spotter observed the arrival of Clone Captain Rex whereupon the sniper took a shot that wounded the target. However, the sniper pair was tracked down and killed by Rex's comrades. While Rex recuperated at Cut Lawquane's farm, another squad of heavily damaged BX-series droids were in an escape pod that crashed into the fields of the farm, and were accidentally reactivated by Cut's adopted children Shaeeah and Jek. The droids attacked the farm and despite their heavy damage were able to pin down and nearly overwhelm its defenders. After a hard fought battle and close call they were destroyed by Lawquane and Rex."}, {"tag": "h3", "text": "Citadel Escape"}, {"tag": "p", "text": "In the Confederacy prison the Citadel, Warden Osi Sobeck had a team of these commandos painted with a special yellow color scheme. One of these droids was seen torturing Jedi Master Even Piell for information on the Nexus Route with an electrostaff, while an interrogation droid questioned Piell. Many of them carried hand-held energy shields. One of them was responsible for the apparent death of ARC Trooper Echo. A droid commando captain was also forced to destroy one of his own droids after the Citadel warden Osi Sobeck ordered him to do so for displeasing him."}, {"tag": "h3", "text": "Reinforcements on Felucia"}, {"tag": "p", "text": "A reinforcement battalion was sent to strengthen the position on a Separatist outpost to prevent Republic victory deep in Confederate territory of Felucia. Commando droids were present in this group, and shortly after the deployment of the reinforcments, the outpost commanded by TZ-33 came under fire by Republic AT-TEs. TZ-33 then ordered all units to form up for a counterattack, thereby lowering the outpost gate; this order proved to be the outpost's downfall as the Republic clones of Wolfpack—led by Anakin Skywalker, Plo Koon, Ahsoka Tano, Rex, and Wolffe—then attacked the droid outpost, destroying all the droids, including the commando droids. Although the Separatists did not win, Tano was captured by a Trandoshan sport hunter by the name of Lo-Taren."}, {"tag": "h3", "text": "Skirmish on Naboo"}, {"tag": "p", "text": "Just before the Skirmish on Naboo, commando droids were deployed by Minister Rish Loo on Naboo after Anakin Skywalker, Padmé Amidala and Boss Lyonie confronted him after discovering that Rish Loo was a traitor. In the fight that followed, all of the commando droids were destroyed by the Jedi and Amidala, while Loo stabbed Lyonie and fled the underwater city where the fight took place."}, {"tag": "h3", "text": "Battle of Kiros"}, {"tag": "p", "text": "Several droid commandos were present during the Separatist occupation of the planet Kiros. When the Galactic Republic came to liberate Kiros, a group of droid commandos on speeders ambushed a clone party led by Jedi Master Obi-Wan Kenobi, Anakin Skywalker and Padawan Ahsoka Tano. While the clones took some casualties, all the commandos were ultimately destroyed. Two units were also guarding the Separatist commander in-charge of the occupation, Darts D'Nar. However, they were also destroyed when Kenobi arrived."}, {"tag": "h3", "text": "Battle of Dathomir"}, {"tag": "p", "text": "Around 21 BBY, Count Dooku ordered General Grievous to eliminate Asajj Ventress, together with the Nightsisters of Dathomir. Grievous began his invasion of Dathomir, where he deployed several BX-series battle droids, together with B1 and B2 super battle droids, AATs, one Defoliator tank and other forces. One of the BX-series droids used a rocket launcher to destroy the wall of the cave, in which Talzin and Old Daka tried to kill Dooku via Nightsister magic. Grievous managed to eliminate Old Daka and a Nightsister, while Talzin disappeared. The BX-series droid emptied the cauldron, and Dooku survived."}, {"tag": "h3", "text": "Battle of Onderon"}, {"tag": "p", "text": "A number of BX-series droid commandos were present on the planet Onderon where they served under the super tactical droid Kalani, who was dispatched to defeat a local rebellion brought against the Confederacy. These droid commandos were among the forces battling the Onderonian rebels, where they were ultimately defeated due to the armaments and training the rebels had received from the Republic. When the Royal Onderon Militia abandoned King Sanjay Rash to fight for the rebels, BX-series droid commandos replaced them as his bodyguards until the Separatists withdrew from the planet and Rash was executed by Kalani."}, {"tag": "h3", "text": "Ringo Vinda"}, {"tag": "p", "text": "BX-series droid commandos (at least some with markings designating the rank of captain) served at the Battle of Ringo Vinda fighting the 501st Legion, taking several casualties during the fighting. Later in the battle, defective clone trooper Tup was abducted aboard a shuttle. Several droid commandos guarded Tup until Anakin Skywalker, CT-5555, and CT-7567 infiltrated Kraken's Maxillipede shuttle and destroyed the entire contingent."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}