{"url": "Rings_of_Coruscant", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Coruscant system", "Category:Planetary rings"], "nodes": [{"tag": "h1", "text": "Rings of Coruscant"}, {"tag": "p", "text": "The Rings of Coruscant referred to an artificially-created planetary ring that encircled the planet Coruscant. The Yuuzhan Vong formed the ring, which they called the Bridge or the rainbow bridge, in 27 ABY after capturing Coruscant and renaming it Yuuzhan'tar. The invaders destroyed the planet's largest moon via gravity-manipulating dovin basals and used the resulting debris to fashion a ring that orbited Yuuzhan'tar. The resulting planetary ring appeared rainbow-like from the planet surface. However, two years later, in 29 ABY, the Bridge was heavily damaged when the sentient hyperspace-capable planet Zonama Sekot arrived in Yuuzhan'tar's orbit, sundering the Bridge in the process. Even so, it remained in place around the planet a century later, by which time it was known as the Rings of Coruscant and was a popular tourist attraction."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Rings of Coruscant—also known as the Bridge or the rainbow bridge—was the title of an artificially-created planetary ring that orbited the planet Coruscant, renamed by the Yuuzhan Vong as Yuuzhan'tar. Angled seventeen degrees away from the ecliptic of Coruscant, the ring consisted of dust, gravel, and lumps of hardened magma. Viewed from the surface of the world, the Rings of Coruscant took up almost a third of the sky and appeared as a vibrant rainbow of colors to those who look upon it; the light from the ring outclassed the reflected light from most moons at night. Coruscant's sun illuminated the Rings of Coruscant during the day, making them appear jeweled-like. After the ring was hit by the sentient planet Zonama Sekot, much of the it was scattered, though it remained as a planetary ring around Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 25 ABY, the extra-galactic Yuuzhan Vong species invaded the galaxy, engaging governments like the New Republic in the Yuuzhan Vong War. The invaders captured the New Republic's capital planet of Coruscant in 27 ABY. Wanting to produce a replica of the destroyed Yuuzhan Vong homeworld, Yuuzhan'tar, the Vong began the process by obliterating Coruscant's largest moon with the help of gravity-manipulating dovin basals linked via the telepathic capabilities of yammosk creatures. The Bridge was created out of the resulting debris as it was organized into a planetary ring by the dovin basals to mimic the ring that once orbited Yuuzhan'tar. With Coruscant terraformed into an image of Yuuzhan'tar, the captured planet was renamed after the Yuuzhan Vong's homeworld."}, {"tag": "p", "text": "For the Yuuzhan Vong, who had taken the new Yuuzhan'tar as their home, the Bridge became symbolic of the communications between them and their high god, Yun-Yuuzhan. However, in 29 ABY, as the Galactic Alliance—the New Republic's successor state—and its allies mustered their forces to recapture Yuuzhan'tar, the sentient planet Zonama Sekot, capable of hyperspace travel, made a hyperspace jump that landed it in Yuuzhan'tar's orbit, sundering much of the Bridge in the process. After the breaking of the ring, with the Galactic Alliance assaulting Yuuzhan'tar, Supreme Overlord Shimrra Jamaane claimed to have heard a prophecy that foretold of the destruction of the Bridge before an eventual Yuuzhan Vong triumph and used this revelation to help spur on his forces in an attack on Zonama Sekot. Nevertheless, the Galactic Alliance defeated the Yuuzhan Vong, reclaimed Yuuzhan'tar, and renamed it Coruscant."}, {"tag": "p", "text": "Though the Bridge's integrity was compromised by the Zonama Sekot incident, the planetary ring was still in place around Coruscant a century later, at the time of Emperor Roan Fel's reign. By then, it had become known as the Rings of Coruscant and was a popular tourist destination on the surface despite the presence of wild nexu creatures roaming near the planetary ruins."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rings of Coruscant first appeared, originally named the Bridge, in Matthew Stover's Traitor, a 2002 novel released as part of The New Jedi Order series. The planetary ring later appeared and was given the secondary name \"rainbow bridge\" in two successive volumes of The New Jedi Order series, The Final Prophecy and The Unifying Force, written by Greg Keyes and James Luceno, respectively, and released in 2003. In 2006, the Bridge was identified as the Rings of Coruscant in Star Wars: Legacy 0, the pre-release supplement of the Star Wars: Legacy comic series, before appearing in some of the series' issues. The 2003 reference book Coruscant and the Core Worlds mistakenly states that all four of Coruscant's moons were destroyed to create the bridge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}