{"url": "Riot_Squadron", "categories": ["Category:Canon articles", "Category:Military stubs", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:New Republic starfighter squadrons", "Category:Riot Squadron personnel"], "nodes": [{"tag": "h1", "text": "Riot Squadron"}, {"tag": "p", "text": "Riot Squadron was a Rebel Alliance and later New Republic starfighter squadron that was active during the Galactic Civil War. After the Battle of Endor, Riot Squadron served with Hound Squadron before they were destroyed by the 204th Imperial Fighter Wing."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Riot Squadron was a starfighter squadron that was part of the Rebel Alliance Starfighter Corps and later the New Republic Starfighter Corps. The squadron was composed entirely of RZ-1 A-wing interceptors and were headquartered on the EF76 Nebulon-B escort frigate Hellion's Dare. The squadron was commanded by various squadron leaders, that included a male named Creel and later a Duros female named Rununja."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early campaigns"}, {"tag": "p", "text": "Sometime by the year 0 BBY, Riot Squadron fought at the planet Mygeeto, in which the 61st Mobile Infantry was also present, where the squadron earned its name. During the Galactic Civil War, the squadron fought pirates at Thumbsnapper's Bridge. The pirates almost achieved a victory that even the Galactic Empire had not aspired to."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "In 4 ABY, Riot Squadron, with a full complement of pilots, fought at the Battle of Endor, where they provided fighter support for the Alliance Fleet during their large-scale assault on the Galactic Empire's second Death Star, which was still under construction above the forest moon of Endor. It resulted in a key victory for the Alliance, with the destruction of the unfinished battle station and the deaths of Emperor Palpatine and Darth Vader. While the Rebels lost thousands in the battle, Riot Squadron lost three of their own in it. The squadron was allowed to land on the forest moon and participate in the celebrations."}, {"tag": "h3", "text": "Battle at Sarapin"}, {"tag": "p", "text": "Sometime before the attack on the EF76 Nebulon-B escort frigate Hellion's Dare, Riot Squadron participated in a fleet battle at Sarapin. Sonogari and Wyl Lark were present, but grounded during the battle."}, {"tag": "h3", "text": "An early loss to the squadron"}, {"tag": "p", "text": "Sometime before the attack on the Hellion's Dare, Riot Squadron lost two of their members, Aries and Nex. Later, Wyl Lark thought about their deaths."}, {"tag": "h3", "text": "Skirmish at Jiruus"}, {"tag": "p", "text": "In the weeks following the Battle of Endor, Riot Squadron traveled to the planet Jiruus. where the squadron took place in the partying on the planet to celebrate the Empire's overthrow. Shortly after arriving, the Hellion's Dare received a transmission from one of their scouts, and, shortly after, Imperial TIE fighters attacked the Hellion's Dare while in orbit above the planet Jiruus. Both Riot and Hound Squadrons scrambled to defend the frigate before escaping to hyperspace. In the aftermath of the battle, the squadron continued a funeral tradition that they had learned from a rebel cell they had worked with, reciting eulogies by candlelight in the darkness in the blackout they caused with an ion detonation."}, {"tag": "h3", "text": "Attack on the Hellion's Dare"}, {"tag": "p", "text": "Shortly after the skirmish at Jiruus, the 204th Imperial Fighter Wing of the Galactic Empire launched a relentless wave of attacks on the Hellion's Dare in the Oridol Cluster, eventually leading to the frigate's destruction and loss of many of the squadron's pilots. The three surviving members of the Hound Squadron were temporarily consolidated into Riot Squadron during the latter stages, resulting in a mix of four A-wings and three B-wings. Wyl Lark and Chass na Chadic were the only survivors who managed to escape with vital intelligence data for the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Riot Squadron first appeared in the 2019 novel Alphabet Squadron, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}