{"url": "Riot_stormtrooper", "categories": ["Category:Legends articles", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Riot stormtrooper"}, {"tag": "p", "text": "Riot Stormtroopers, colloquially known as Riot troopers, were highly-trained soldiers that specialized in containing and defusing insurrectionist scenarios due to the spread of the influence of the Rebel Alliance to even within loyalist populations in the Galactic Empire. As military enforcers of the Empire, the riot troopers were typically stationed on subjugated worlds throughout the galaxy, such as Kamino and Cato Neimoidia, although they were most common on megalopolis worlds throughout the Core and Colonies due to them being disobedient worlds, that according to the Empire, required \"parental discipline.\" They were trained for close-combat, and thus were armed with electrostaffs, made from lightsaber-resistant cortosis. As a consequence, they lacked any type of range weapon. In addition to their weapons, the riot troopers wore protective suits that slightly resembled the armor of the Imperial stormtroopers."}, {"tag": "p", "text": "The riot troopers' special status was emphasised by the fact that they received training at an Imperial Royal Guard Academy on Yinchorr, the same facility where Emperor Palpatine's Royal Guardsmen were trained. Every riot trooper was required to swear the Oath of Obedience upon graduation as a symbol of their unquestioning loyalty to the Emperor and his Empire—an oath that could only be severed through death. In combat, they were often accompanied by a squad of stormtroopers; the troopers provided aid from a distance with their range weapons while the riot troopers closed in on the enemy with their electrostaffs. Because they were trained specifically for confronting and putting down large-scale civilian insurrections, they lacked any fear of being overwhelmed by crowds. However, when faced with direct weaponised conflict, riot troopers were forced to call in standard stormtroopers."}, {"tag": "p", "text": "In 1 BBY, roughly a year into the Galactic Civil War, several riot troopers were killed, along with many other Imperial troopers, in the Timira City Cloning Facility of Kamino. Six months after the formation of the Alliance to Restore the Republic, the Sith Lord Darth Vader commissioned a clandestine project to recreate his fallen apprentice, the late Galen Marek, through an experimental type of Kaminoan cloning technology. However, the procedure was initially imperfect and resulted in numerous abject failures, including an emotionally unstable clone who escaped from Kamino. During his break out, many riot troopers attempted to neutralize the rogue clone's progress, but were ultimately killed for their efforts. Although they were able to defend themselves against the clone's dual lightsabers, they were completely helpless against his genetically-inherited Force powers. For all of their weapons and training, they were no match against the clone's command of the Force."}, {"tag": "p", "text": "The rogue clone of the original Starkiller later again fought against more Imperial riot troopers on Cato Neimoidia, shortly after his escape from Kamino. He intended to rescue General Rahm Kota, a member of the Rebel Alliance and Marek's Jedi mentor, from the Tarko-se Arena. The entire Imperial garrison in Tarko-se, including many riot troopers, attempted to kill the clone before he could reach the city; many of them were killed, and the clone ultimately succeeded in his mission."}, {"tag": "p", "text": "During the Assault on Kamino, many riot troopers were part of the planet's Imperial military defense force. The riot troopers on Timira City, however, were defeated easily by the renegade clone, who was forced to return to his homeworld in order to rescue Captain Juno Eclipse. The combination of Rebel ground assault forces and the clone of Galen Marek were too much for the riot troopers to contain. Hence, they failed in their duty to prevent the fall of Timira City and the capture of Darth Vader."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Riot stormtrooper was created for the video game Star Wars: The Force Unleashed II in 2010, but wasn't identified under that name until the release of Star Wars: Imperial Handbook: A Commander's Guide in 2014. The troopers were voiced by Fred Tatasciore."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}