{"url": "Rise_of_the_Old_Masters", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Rise of the Old Masters"}, {"tag": "p", "text": "\"Rise of the Old Masters\" is the fifth episode of the first season of the animated television series Star Wars Rebels. It is the fifth episode of the series overall."}, {"tag": "p", "text": "The episode was screened at New York Comic Con on October 11, 2014, released on WatchDisneyXD.com on October 20, and made its television debut on Disney XD on October 27. The episode was written by Henry Gilroy and directed by Steward Lee."}, {"tag": "p", "text": "The episode features Ezra Bridger continuing his Jedi training with Kanan Jarrus, who worries he is not a good teacher for Bridger. The rebels learn that Jedi Master Luminara Unduli survived the destruction of the Jedi Order and attempt to rescue her from the Spire on Stygeon Prime. However, they soon discover that it is a trap set by the Grand Inquisitor, and that Unduli died with the Jedi Order. The rebels escape, and Jarrus learns that he can be a good teacher for Bridger despite his previous doubts."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Kanan continues to train Ezra in the ways of the Force, but both become frustrated with each other and their new roles. Meanwhile, an underground transmission reveals that a Jedi Master, long thought dead, is alive and in Imperial custody."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Ezra's Jedi training"}, {"tag": "p", "text": "High above the surface of Lothal, Ezra Bridger and Kanan Jarrus stand on the top of the Ghost, while Garazeb Orrelios and the droid Chopper watch as Jarrus trains Bridger in the ways of the Force. As part of his training to develop his physical strength and coordination, Bridger is standing on his hands atop of the dorsal laser cannon turret, while Jarrus instructs him to remain focused as the boy struggles to pull off a one-hand stand. The Padawan tells his master that he will try, but Jarrus tells him, \"Do, or do not. There is no try.\" Bridger does not understand: how can he accomplish anything if he doesn't try it? Jarrus admits that he does not fully comprehend it either, but relates that it was something that he often heard from Grand Master Yoda. Just when Bridger pulls off the handstand, Orrelios shifts the turret under Bridger and he falls off. Bridger complains about the Lasat's presence, but Jarrus explains that there will always be annoyances and distractions in life and he will need to focus through them."}, {"tag": "p", "text": "Jarrus decides to move on to some basic lightsaber training, handing his weapon to his apprentice. Bridger wonders when he can get his own weapon, though Jarrus flatly states that owning a laser sword doesn't make one a Jedi. After nearly stabbing Jarrus in the neck from accidentally igniting the weapon, Jarrus shows Bridger that the blade can be adjusted to his height. On Jarrus' instructions, Chopper begins throwing small empty containers from a crate at Bridger, who has closed his eyes and attempts to hit the objects with the lightsaber. He remains unfocused, however, and is not able to strike the objects with his blade, Jarrus wincing as the containers smack into Bridger instead. Seeking further amusement, Orrelios finally dumps multiple containers into Chopper's spinning arms at once, pelting Bridger; forced backward, he slips on one of the fallen projectiles, falling backward and off the ship, plunging towards the surface below. Jarrus is able to use the Force to catch the boy mid-fall and telekinetically pulls him back towards the Ghost, while Hera Syndulla lowers the ship and Orrelios extends the entry ramp to grab hold of him. Once onboard, Jarrus confronts Bridger, telling him he is unfocused and full of self-doubt. Bridger asks who's fault that happens to be: Jarrus sighs and states that it's difficult to teach, leaving Bridger disappointed."}, {"tag": "h3", "text": "Mission to Stygeon Prime"}, {"tag": "p", "text": "Before he can say anything else to Jarrus, Bridger sees the crew assemble in the ship's common area, where a HoloNet News transmission is reporting on Bridger and Orrelios' attack on an Imperial Troop Transport—but spinning it to say that the two attacked innocent workers, whereas they had rescued prisoners from Imperial captivity. The transmission is soon hacked and replaced by a message from Gall Trayvis, a former member of the Imperial Senate who spoke out against the Galactic Empire. Trayvis states that Luminara Unduli, a Jedi Master from the time of the Clone Wars, is alive and being imprisoned in the Stygeon system. When the transmission ends, Bridger asks if Jarrus knew Unduli. Jarrus did meet her once, and describes her as brave, compassionate and disciplined, but then states that she would also be an excellent teacher for Bridger. He had always heard rumors Unduli survived the Clone Wars, but never anywhere specific. Not wanting to pass up an opportunity to rescue a Jedi, the crew embarks on a mission to the Stygeon system. Bridger is left downcast, believing that Jarrus is done with him and is going to \"pawn [him] off to some stranger.\""}, {"tag": "p", "text": "While en route, Sabine Wren displays a holographic layout of the Spire, a prison on Stygeon Prime—and the only Imperial detainment facility in the Stygeon system. She explains that the prison is impregnable, to which Jarrus says that they have never been stopped by impregnable defenses before, but Wren says they have never faced anything like the defenses of the Spire. Despite the odds, the rebels continue on their way to Stygeon Prime. Once they arrive, they leave the Ghost behind in Chopper's hands, while the rest of the crew flies towards the prison on the Phantom, the ship's attack shuttle. Jarrus leaps out of the shuttle and takes on the stormtroopers guarding the entrance. Although Bridger is supposed to wait and depart with Orrelios, he instead jumps down after Jarrus, stumbling into the door and alerting more stormtroopers to their presence. The rest of the crew, sans Syndulla who remains with the shuttle, arrives and they defeat the stormtroopers, allowing Bridger to use a lockpick to open the door. While the rebels enter the prison, Syndulla attaches the ship to the side of the prison, powered down and using a jammer to avoid Imperial detection."}, {"tag": "p", "text": "The rebels enter the prison, where Jarrus is able to sense Unduli's presence through the Force, though her presence is clouded. Wren learns from a nearby computer that Unduli is being held in an isolation cell in the lower levels, which contradicts the layout that they had for the Spire. While they enter a turbolift to go to the lower levels, the outdated schematics force Jarrus to begin thinking of a backup plan, prompting Wren and Orrelios to guard the elevator. Meanwhile, the Phantom sensors detect something approaching the shuttle, which Syndulla believes is a TIE fighter. Instead, a group of Tibidee appear, attracted to the jamming signal that they believe is a mating call. Syndulla detaches the shuttle from the side of the prison and flies away, with the creatures following close behind her."}, {"tag": "h3", "text": "The Inquisitor's Trap"}, {"tag": "p", "text": "Once on the lower levels of the prison, Jarrus attacks the stormtroopers guarding the turbolift and knocks them out, while ordering Wren and Orrelios to guard the lift. Jarrus encounters two more stormtroopers and knocks them out as well. His intensity in fighting the stormtroopers does not escape Bridger's notice, and Jarrus tells him that there is more at stake than the boy realizes. The two of them reach the cell, where Jarrus uses a mind trick to manipulate the stormtroopers there into leaving. They enter the cell and see Unduli sitting down, but she stands up and her image fades into the wall, revealing a sarcophagus containing her remains."}, {"tag": "p", "text": "They are then confronted by the Grand Inquisitor, his lightsaber ignited, who had set a trap for them. According to the Inquisitor, Unduli died along with the Galactic Republic, but her bones continued to be used to lure Jedi survivors to their deaths. Jarrus attacks the Inquisitor and the two engage in a lightsaber duel, but Jarrus is no match for the Jedi hunter. The Inquisitor recognizes Jarrus's fighting style as Form III and correctly deduces that he was trained by Jedi Master Depa Billaba, who favored Form III in close-quarter combat. The duel continues in the cell until Bridger sets off a small detonator, blowing open the door and giving himself and Jarrus a chance to flee—with the Inquisitor following close behind."}, {"tag": "p", "text": "In the turbolift, Wren attempts to contact Jarrus with no success. She realizes that the Empire is jamming their signal, that the mission was a trap, and that they will need a new escape route given that the Empire will expect them to escape the same way they entered. Back in the detention area, Jarrus and the Inquisitor continue their duel, while the Inquisitor attempts to convince Bridger to embrace the dark side of the Force. Bridger has never heard of the dark side, however, and attempts to attack the Inquisitor with his energy slingshot, but the Jedi hunter uses the Force to throw him down the cell block."}, {"tag": "h3", "text": "Escaping the Spire"}, {"tag": "p", "text": "Wren and Orrelios, meanwhile, prepare a new escape path for the rebels. They place a detonator in a turbolift and send it up to the higher levels, where the stormtroopers waiting there are caught in the blast. With the turbolift destroyed, and Wren having disabled other two lifts, the Imperials have their quickest path to the lower levels cut off. As the duel between the Inquisitor and Jarrus continues, the Inquisitor goads Jarrus to surrender for the boy's sake, but the Jedi refuses and is thrown down the hall with the Force. Once more the Inquisitor tries to convince Bridger to join him. When the Padawan refuses he attempts to kill Bridger, but the alarmed Jarrus stops the strike with the Force and then slams the Imperial to the ceiling, giving the two Jedi a chance to escape. As they begin to run, the Inquisitor engages the full capabilities of his double-bladed lightsaber, with the blades spinning on their hilt as he followed after the rebels."}, {"tag": "p", "text": "Jarrus and Bridger meet back up with Wren and Orrelios, and all four continue to outrun the Inquisitor, who orders a full security lockdown over his communicator and follows close behind as the doors between him and the rebels begin to close. He is cut off by a final closed door, which he begins to slice through. The rebels reach a hangar, where Orrelios blasts the controls for the entrance hall door to close it and create another obstacle between them and the Inquisitor, but are unable to open the hangar door. Jarrus instructs Bridger to picture the door's locking mechanism in his mind, and as the Inquisitor begins cutting through the hall door, together they use the Force to unlock the hanger door and then lift it from the floor. On the other side are numerous stormtroopers and parked TIE fighters, so the rebels use one last detonator to eliminate some of the soldiers. They find reinforcements when Syndulla arrives in the Phantom, along with the many creatures that followed her and begin to attack the stormtroopers. The rebels make it to the Phantom as the Inquisitor arrives, and he throws his lightsaber towards them in one final attempt to stop their escape—but Jarrus deflects it, allowing the rebels fly away aboard the Phantom. Once onboard, Jarrus tells Syndulla that Unduli is dead and that he is not taking the news well—as he wanted her to train Bridger."}, {"tag": "p", "text": "The Ghost returns to Lothal and sets down on the planet. Once the ship lands, Bridger sits outside on the boarding ramp, where Jarrus finds him. Bridger tells Jarrus that he does not have to train him anymore, as Bridger knows that Jarrus wanted Unduli to teach him. Jarrus, however, never wanted to give up Bridger as his apprentice, but rather wanted to ensure the boy had the best teacher. Bridger makes it clear that he wants Jarrus to teach him, and Jarrus agrees. Jarrus now understands what Yoda's counsel meant and states that he's going to stop trying—for if he tries, he does not believe he can really succeed and is not actually training his student. Either of them may fail, but there is no try, and Bridger says that he understands. With a newfound resolve to be better in their training, Bridger takes Jarrus' lightsaber while his master throws stones towards him, which Bridger successfully deflects with the blade. Their training continues, without distraction or doubt."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The episode was adapted into a young readers book, The Inquisitor's Trap by Meredith Rusu. The book was released on December 9, 2014."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}