{"url": "Riptide_(novel)", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "Riptide (novel)"}, {"tag": "p", "text": "Riptide is a paperback novel by Paul S. Kemp. It is the sequel to Crosscurrent, also by Kemp, and was released on October 25, 2011."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "When a ship full of Sith warriors arrived in Galactic Alliance space, the fight to destroy it accidentally uncovered a deadly menace: a long-hidden group of clones, secretly created as insidious weapons capable of wielding the Force and heedless of the differences between light side and dark side. Now the clones have escaped -- and evidence suggests they are flawed by genetic disease and violent madness."}, {"tag": "p", "text": "Jedi Knight Jaden Korr pursues the clones, hoping to heal them but prepared to destroy them. What he doesn't know is that Sith agents are hot on his heels, determined not only to recover the clones for their Master but to capture Jaden for their own dark-side purposes. In a life-or-death battle, Jaden will confront a shocking reality that will rock him to his core and bring him face-to-face with the question of what makes a man... and a Jedi."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel begins when Jaden Korr wakes up aboard an unknown station, wondering where his friends, Khedryn Faal and Marr Idi-Shael, are. He soon realizes that he will confront something truly monstrous."}, {"tag": "p", "text": "The novel shifts about two days earlier aboard the Junker, just after the events of Crosscurrent. Jaden and Khedryn discuss what will happen to Marr, since Jaden is considering having him join the Jedi Order as an apprentice. Another topic they bring up is the ship full of Jedi-Sith clones that had escaped the unknown frozen moon where Alpha and Kell Douro died."}, {"tag": "p", "text": "Aboard the Predator, the Jedi-Sith clones that escaped are undergoing a collective illness that had been accelerated after they flew through the fiery remains of the Harbinger from the previous novel (this was thanks to the Force-enhancing Lignan contained in the Harbinger). The only exception from this illness is Soldier, who was the last clone produced by the dead scientists on the frozen moon, and the most faithless of the clones' belief that they will be saved by Mother. According to the clones' prophet, Seer, Mother is an entity who will bring all of them salvation from the illness—and they are traveling to her. Meanwhile, Mother, who really exists, lies in wait for the Jedi-Sith clones to arrive at her home."}, {"tag": "p", "text": "On the One Sith world of Korriban, Darth Wyyrlok holds a private meeting with Nyss Nenn, secretly watched by his sister Syll Nenn, two mysterious Umbaran siblings who, while not necessarily Force-sensitive, somehow suppress Force-users through their own power. Wyyrlok shows Nyss Nenn the record inadvertently taken by Kell Douro through his optic nerves, which had been secretly installed thanks to the One Sith. The footage shows Jaden Korr's fight with Alpha, and Wyyrlok and Nyss noticed that during the fight, Jaden had utilized green Force lightning on his fingers summoned by fear or anger, a sign that he's falling to the dark side. They agree that it is too early for Korr to turn to the dark side, and after that, Syal Nenn reveals her presence. The siblings agree to do what they can in order to stall Jaden from falling too early and Darth Wyyrlok gives them two mindspears, pieces of ancient Rakatan biotechnology for mind transfer. He also tells them to take the Iteration, a clone of Jaden, with them."}, {"tag": "p", "text": "After Jaden tells Grand Master Luke Skywalker the events that had occurred in the unidentified system, Skywalker agrees to send help for him to track down the Jedi-Sith clones, but it won't come for quite a while, leaving Jaden to take care of the situation with Khedryn and Marr. Skywalker also allows Jaden to teach Marr to become a Jedi. Later, Jaden and Khedryn bring up Marr's training and how it will affect his position aboard the Junker, but the Cerean is steadfast that he will remain even as a Jedi. Then his training with Jaden begins even as they manage to track the Jedi-Sith clones down at Fhost."}, {"tag": "p", "text": "On Fhost, most of the clones, such as Maker, Scar, and Two-Blade, as well as two of their children Blessing and Gift, have already died from the illness, leaving Soldier, Seer, Hunter, Runner, Grace to leave the Predator and continue their journey. The clones travel to Farpoint so they can hijack a medical shuttle for the medication that has allowed the surviving clones to live through the illness so far. However, when they arrive at the medical station, much trouble has been caused by them, alerting the city's local authorities just as Jaden and his party, as well as the Nenns, arrive to confront them."}, {"tag": "p", "text": "Jaden confronts the clones, surprised to find that Seer is a clone of the late Lumiya, Runner is a clone of Jaden's own Master Kyle Katarn, and Soldier is a clone of himself. Jaden fights Soldier and Runner, but he is defeated, allowing the clones to make it to the hospital's roof, where, despite Khedryn trying to stop them, they hijack the shuttle and take it off-world. They take Khedryn with them so that he can tell them how Jaden tracked them down (he can't tell them immediately because he was knocked unconscious by Runner). Meanwhile, Nyss had already stowed aboard the shuttle before the clones took it."}, {"tag": "p", "text": "In the aftermath of the chaos in Farpoint, Jaden and Marr, after they collect Jaden's R6 astromech droid, manage to track down the shuttle because of a beacon that Jaden placed on it before his fight against the clones. As they follow the stolen shuttle into space, Syll follows the shuttle because of her brother's own signal there."}, {"tag": "p", "text": "After the clones drop the shuttle out of hyperspace in a random system to interrogate an awakened Khedryn as to how Jaden found them on Fhost. Khedryn admits that it was simple happenstance in their search for the clones, so Seer orders Runner to eject Khedryn out into the vacuum of space. Nyss takes this time to cut out the shuttle's lights and he attacks Runner in a fight that he wins by ending the clone's life. He cuffs Khedryn up, hoping to use him as leverage on Jaden, and then he kills Hunter. He fights Soldier, who turns out to be the clone of Jaden who the One Sith also want, and despite Soldier being partially immune to Nyss's Force-repressing ability, the Umbaran defeats the clone in time for Jaden and Marr to arrive, and in time for Syll to arrive. Nyss blackmails the Jedi over communications into trading himself in exchange for Khedryn, which Jaden has no choice but to agree to as he suits himself up in a hardsuit and rockets over to the medical shuttle. However, Khedryn, who had been cut free by Grace earlier, reluctantly, and briefly, allies with Soldier, cutting him free of the bonds that Nyss had tied him up in, and this commences another fight between Soldier and Nyss as Khedryn flees to one of the shuttle's escape pods. Nyss, not wanting to kill Soldier as per Darth Wyyrlok's orders, also flees, allowing the surviving clones to retake control of the medical shuttle. However, as Syll reels him onto their ship, he orders her to blast Khedryn's escape pod even as Jaden rockets toward it. The attempt to kill Khedryn fails when Jaden uses his lightsaber, and his power in the Force, to deflect the laser blasts back at the ship, killing Syll. Marr saves Jaden, who had two leaks in his hardsuit thanks to Syll, and Khedryn in time, while Nyss, in his grief over his sister's death, vows to kill everyone associated with Jaden and Soldier after he captures them for the One Sith."}, {"tag": "p", "text": "The medical shuttle travels into an irradiated system where they find Mother, an entity imprisoned in a space station likely constructed by the ancient Rakatan Infinite Empire. The Junker and Nyss track the shuttle there as the clones meet Mother. The entity, however, turns out to be a false promise when she takes hold of Seer's body and uses her as a vessel to go free in the galaxy. Meanwhile, Jaden and Marr confront Nyss again, and after the Umbaran knocks Marr unconscious, Jaden manages to kill Nyss by strangling the life out of him. However, because of the fight against the Umbaran, Jaden falls unconscious, allowing the Iteration to use a mindspear to transfer Jaden's mind out of his body, effectively killing him and storing his memories and personality in the device. Marr fights the Iteration and defeats him, but holds off on killing him to use the mindspear to transfer all that was Jaden into the Iteration. Jaden is reborn in his own clone body, unknowing of it, and staggers to the direction of Mother, just as he did at the beginning of the novel. Marr, who hid Jaden's previous body so that he wouldn't discover what had happened to him, is taken captive by Soldier, but in the incoming threat of Mother, they all decide to become allies, especially when Jaden sees that Soldier, who had never personally caused any of the trouble back on Fhost, just wants to save Grace from the illness plaguing her. Jaden, Marr, and Soldier fight Mother, but after she proves to be too strong for all of them to take on, they decide to flee with Grace as Jaden instructs Khedryn, who meets them from elsewhere aboard the station, to load the docked medical shuttle's power core to blow, destroying much of the space station. However, Soldier decides to take himself and Grace over to the medical shuttle to take what medication he can to help Grace while Jaden, Marr, and Khedryn make it the rest of the way to Junker. Unfortunately, it is unable to break them out of the station's hold even as it suffers from numerous explosions following the destruction of the medical shuttle, which causes the station to fall to the planet that it orbits. Despite the power of Mother, Junker manages to break free and shoot out into space while the station with Mother crashes in a fiery explosion, killing the entity."}, {"tag": "p", "text": "As Junker proceeds to return to Fhost, Jaden notices that a scar that he had all his life is gone, and begins to have suspicions even as Marr begins acting odd around him, in light of the fact that he knows that Jaden is not in his real body."}, {"tag": "p", "text": "The novel ends with Soldier and Grace, who managed to collect the medication off of the destroyed medical shuttle in time and escape in Nyss' ship, flying out into the Unknown Regions to start a new life together."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}