{"url": "Ristt", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alliance admirals and generals", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ristt"}, {"tag": "p", "text": "General Ristt was a Human male who served the Rebel Alliance as the ranking officer at an asteroid field base at some point between 0 BBY and 1 ABY. When the Rebel-allied smugglers Han Solo and Chewbacca returned late to the base from a mission to retrieve the mystical Talisman artifact, Ristt aided a communications officer in establishing video contact with their freighter, and subsequently watched in horror as the ship narrowly avoided colliding with the base before speeding away. Fellow rebel Luke Skywalker went on to retrieve Solo and Chewbacca from the moon Panna Prime, and Ristt later appeared in a cartoon created about the day's events."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ristt was a Human male who served as a general in the Rebel Alliance during the Galactic Civil War. At some point between 0 BBY and 1 ABY, he was the ranking officer at an Alliance base located in an asteroid field. Under the General's supervision, the Rebel-allied smugglers Han Solo and Chewbacca left the asteroid base on a mission to acquire the Talisman, a mystical artifact rumored to be sought by the Galactic Empire."}, {"tag": "p", "text": "When the smugglers took longer than expected to return, Ristt waited near the base's communications station for a transmission, standing alongside fellow rebels Leia Organa and Luke Skywalker, as well as their droids C-3PO and R2-D2. One officer eventually reported the receipt of a weak signal, which materialized into video when Ristt suggested accessing it on a lower channel. The rebels stood puzzled as they watched Solo hang upside-down in the cockpit of his freighter, the Millennium Falcon; they attempted to establish radio contact with Chewbacca, but their efforts were to no avail."}, {"tag": "p", "text": "Ristt realized that the Millennium Falcon was on a collision course with the base, but on Organa's insistence that they trust Chewbacca, the communications officer held off firing while the group braced themselves for impact. The Millennium Falcon ultimately passed by the base and continued on its way, which prompted Skywalker and the droids to pursue it in a Y-wing fighter. After tracking the freighter to the moon Panna Prime, they discovered that Solo had contracted a sleeping virus from the Talisman and had been hung upside-down by Chewbacca in order to keep blood flowing to his head. The earlier near-collision had been an attempt by Chewbacca to warn them of the Talisman's drowsy effects. A cartoon that chronicled the rebels' adventure on Panna Prime and included an appearance by Ristt was later created, and it was watched by Chewbacca's son Lumpawarrump in 1 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Risst was a somewhat portly fellow with a double chin. Although the crest and backside of his cranium were bald, bushy red sideburns connected to a thick mustache of the same color. The General additionally sported large red eyebrows; his skin was light; and his pupils were black. Ristt was the first to realize that the Millennium Falcon was heading straight toward the rebel base, and although he described the situation as \"madness,\" he deferred to Leia Organa's insistence that they trust Chewbacca and not fire on the freighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ristt's first appearance in Star Wars canon came in The Story of the Faithful Wookiee, a cartoon that aired on television in 1978 as part of The Star Wars Holiday Special and was later included as an Easter egg on the 2011 Star Wars: The Complete Saga Blu-ray release. The character was played by an uncredited voice actor. Referred to only as \"General\" in the cartoon, Ristt is named in the Holiday Special's script. The name was later confirmed in I Have a Bad Feeling About This!, a 2008 article published in Star Wars Insider 106."}, {"tag": "p", "text": "In the script's fourth draft, Ristt speaks several lines that failed to make the final cut of the cartoon. While waiting for Solo to return with the Talisman, he expresses a desire to relocate the asteroid base before being discovered by an Imperial cruiser, and voices a mistrust of Solo for being a mercenary. Upon establishing video contact with the Millennium Falcon, Ristt asserts that Chewbacca has killed Solo and further means to kill the denizens of the rebel base. He explicitly orders the communications officer to fire upon the freighter before being dissuaded by Organa. Later, while Skywalker is searching for the Millennium Falcon, Organa learns that he is in the Panna system but is told by Ristt that the system contains too many planets and moons, therefore negating the possibility of launching additional rescue craft. The line regarding Chewbacca's perceived murderous intent was originally included in the cartoon but was re-dubbed prior to broadcast."}, {"tag": "p", "text": "Alex Newborn, author of I Have a Bad Feeling About This!, has speculated that Ristt's appearance is a stylized take on a rebel character with similar facial hair from the Yavin 4 base scenes in the 1977 film Star Wars: Episode IV A New Hope. With a bald head and a thick white sideburns–mustache combo, Commander Bob Hudsol fits the description; the two characters have additionally been conflated on the fan site Starwarsholidayspecial.com and by Dr. Curtis Saxton in his Star Wars Technical Commentaries."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}