{"url": "Rishi/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Galactic Republic planets", "Category:Rishi locations", "Category:Rishi system planets", "Category:Swamp planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Rishi"}, {"tag": "p", "text": "Rishi was a tropical planet in the Rishi system which was located in the Outer Rim Territories. The planet was the homeworld of the avian Rishii."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Rishi was a planet located in the Abrion sector of the Outer Rim Territories, along the Manda Merchant Route. It was also the endpoint of the only well-traveled hyperlane into the Rishi Maze, the Zareca String."}, {"tag": "p", "text": "Rishi was the homeworld of the Rishii, a winged species, who lived in nests on the mountains of Rishi."}, {"tag": "p", "text": "In addition to the lush tropical terrain, Rishi's surface featured mountains, valleys, and swamps. Human and alien colonists lived in the deep valleys, while the Rishii lived in the high mountains."}, {"tag": "p", "text": "The planet was known for its rich fossil fuel resources, especially exonium."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Old Republic era"}, {"tag": "p", "text": "Rishi was discovered more than a century before the Galactic War by a group of pirates, the Nova Blades, when their starship crash-landed on the planet after a failed attempt to explore the Rishi Maze. Unable to leave Rishi, the Nova Blades settled on the planet and eventually learned to refine its fossil fuels. However, the Nova Blades later chose to stay on the planet and made Rishi a paradise for many criminals in the galaxy.\nDuring the Galactic War between the Galactic Republic and the Sith Empire, Rishi was the theater of the Battle of Rishi."}, {"tag": "p", "text": "Shortly after the Battle of Rishi, the deceased Jedi Master Orgus Din gave his Padawan a last lesson in form of a Force ghost, having encouraged the Padawan to help the people of Rishi and be reminded through good deeds what it truly means to be a Jedi. To fullfill his Master's last wish, the Padawan and Archiban Frodrick Kimble cured homeless people of the Corellian Tanamen Fever for free. Having cleared rubble and repaired the monsoon baffles aswell, Orgus Din revealed to his Padawan that the upcoming year will have a better wet season on Rishi."}, {"tag": "p", "text": "10 Years after the Battle of Rishi - according to a Force vision experienced and shared by Orgus Din - the people of Rishi chased away the pirates except for those that have settled down completely. And a century later, Rishi might have become a thriving planet with its locals living in harmony with life and nature."}, {"tag": "h3", "text": "Modern history"}, {"tag": "p", "text": "In 60 BBY, some 50,000 H'kig fundamentalist followers left the Core world of Galand and founded a religious colony on Rishi. However the group quickly dissolved in religious schism, with a minority who left the planet and settled another colony on J't'p'tan. Many smugglers later used Rishi as a base because of the colonists' tolerance."}, {"tag": "p", "text": "During the Clone Wars, the Confederacy of Independent Systems attempted to plunder Rishi's rich exonium mines. This invasion was repulsed by Kit Fisto, his clones, and the native Rishii. During the Clone Wars, there was a small Republic listening post on the Rishi moon. Because of its close proximity to Kamino, Rishi was considered a last defense of the clone-producing planet. This base was used to warn the Republic fleet of any CIS ships entering the area. The base was attacked by the Confederate General Grievous and his forces during the war. The station was destroyed by CT-782 when he sacrificed himself to alert the Republic Navy, forcing the Separatist fleet to retreat."}, {"tag": "p", "text": "During the Galactic Civil War, the smuggler Talon Karrde and his lieutenant Mara Jade had a base here, which became his main base of operations after his base at Myrkr was compromised during the Thrawn campaign. The base was quickly abandoned after the bounty hunter Gunner Groth discovered the presence of Karrde's smugglers on Rishi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Rishi in the Farfin sector (a misspelling of the true Farrfin sector) of the Core Worlds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}