{"url": "Rneekii", "categories": ["Category:Legends articles", "Category:Pirate organizations", "Category:Rneekii starships"], "nodes": [{"tag": "h1", "text": "Rneekii"}, {"tag": "p", "text": "The Rneekii were a group of pirates from the Outer Rim Territories. Their capital ships consisted of the MC40a light cruiser Sumpntodo and the Strike-class medium cruisers Ayenzii and Intombe. Their forces were equipped with R-41 Starchaser fighters and Delta-class DX-9 transports."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, the Rneekii attempted to capture the Assassin-class corvette Hashim group for its cargo of TIE Defender prototypes, using an ion cannon minefield. Thanks to Tan Maarek Stele and assault gunboat reinforcements, that attempt failed. During that same engagement, before the Imperials could launch Stele's craft from the hangar, the pirates seized an Imperial TIE Defender scientist from the Lambda-class shuttle G'nabgib to hold him for ransom. Later, while the Imperials attempted to transfer the Defender prototypes from the disabled corvettes to cargo ferries, Sumpntodo showed up to try to disrupt the party, but it was unsuccessful."}, {"tag": "p", "text": "At Kiilimaar, the Rneekii planned to sell the scientist to the highest bidder, which not surprisingly was the Empire. The exchange terms permitted the Imperials to send a unarmed shuttle and an assault gunboat escort, while the pirates had a half-dozen R-41 Starchasers accompanying the transport bringing the scientist. Stationed near the rendezvous point was Intombe, whose hangar held more R-41s in reserve. However, it turned out to be a double-cross set by Admiral Thrawn, which was executed by Maarek Stele piloting the gunboat. The Empire tricked the Rneekii by handing over the ransom, retrieving the scientist, and then sending their code to attack the pirates, \"full speed to Kiilimaar.\""}, {"tag": "p", "text": "Alone for the opening part of the battle, Stele played an instrumental role in disabling the transport tasked with delivering the ransom to Intombe. Taking full advantage of his Gunboat's advanced concussion missiles and the tractor beam weapon, the R-41s proved no match, each being quickly snared and blown apart by a single warhead. As the Strike cruiser launched R-41s to take out the Lambda shuttle, Stele fended off their numerous sorties to ensure the safe escape of the scientist."}, {"tag": "p", "text": "Upon sending the code, the Imperials sprang the trap with the Interdictor Cruiser Red Claw, accompanied by two assault transports. The now-outnumbered Rneekii could not escape and were virtually wiped out, as their R-41s were shot down by Stele and the Red Claw's TIE interceptors, while the Intombe was destroyed by heavy rockets from the assault transports and TIE bombers. Only a handful of Rneekii pirates—those with the Imperial ransom—survived, and they were captured by the Empire."}, {"tag": "p", "text": "The fate of the Rneekii's other capital ship, Sumpntodo, is unknown."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}