{"url": "Riyan_Kiner", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Scouts", "Category:Terrorists"], "nodes": [{"tag": "h1", "text": "Riyan Kiner"}, {"tag": "p", "text": "Riyan Kiner was a male Human adventurer turned terrorist who lived during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Riyan Kiner was once an accomplished adventurer, albeit mentally unstable. He spent his life searching for fabled artifacts such as the Force crystal of Naga Sadow or the Journals of Ood Bnar. After searching crates for years, Kiner fostered an intense hatred of crates and finally gave up his career. He retired on Corellia and lived in a small hovel outside Tyrena."}, {"tag": "p", "text": "Circa 1 ABY, Riyan Kiner was still utterly insane about crates and attacked the Joben Crate Company, a Corellian crate-manufacturing company owned by Talan Joben. Furthermore, he planted bombs at hotels across the galaxy, and threatened even more carnage if the production of crates should continue. A spacer investigating the attack of the crate company for Corellia Times reporter Vani Korr found a datapad with Riyan Kiner's threatening message. The adventurer located all the bombs and disarmed them just in time. The spacer also found evidence that led to the culprit of these terrorist attempts. The spacer tracked the retired explorer to his hovel, and Riyan Kiner was eventually killed in the confrontation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Riyan Kiner was a non-player character (NPC) in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Riyan Kiner was added to the game with the update \"Chapter 10: The Search for the Meatlump King,\" released on June 19, 2008."}, {"tag": "p", "text": "This NPC was known in the game as Riyan Kiner or Kiyan Riner, depending of the Combat Level (CL) of the player. If the player performed the quest \"The Meatlumps Hideout, Part 1\" during the leveling of his/her character (at CL 65), the NPC would be named Riyan Kiner. If the player performed the quest after the end of the game (at CL 90), the NPC would be named Kiyan Riner. Multiple story elements indicated that the quest was intended to be achieved at CL 65."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}