{"url": "Rivoche_Tarkin", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance Intelligence members", "Category:Eriaduans", "Category:Females", "Category:Humans", "Category:New Republic Intelligence personnel", "Category:Tarkin family"], "nodes": [{"tag": "h1", "text": "Rivoche Tarkin"}, {"tag": "p", "text": "Rivoche Tarkin was the daughter of Brigadier Gideon Tarkin and the niece of Grand Moff Wilhuff Tarkin. After her father's death, she lived with her uncle, during which time she came to question the Tarkin family's adherence to the Galactic Empire. She passed privileged information regarding an Imperial attack to Biggs Darklighter, a young Imperial cadet who had become a member of the Rebellion. This information saved a number of Duros insurgents, and led to her becoming a deep-cover agent for Alliance Intelligence. She was quite successful in this role, as her connections, wealth, and status led her to be in demand for important social events and to be courted by a number of high-ranking Imperials."}, {"tag": "p", "text": "The Empire uncovered evidence of her duplicity, prompting Rebel General Airen Cracken to send two operatives, Cryle Cavv and Quillin Arkell, to extract her just prior to her sham wedding to the son of an Imperial Moff. The extraction was successful, despite the efforts of Sollaine, the head of the Imperial Security Bureau, who was personally responsible for capturing her alive. Tarkin became a reporter for New Republic Intelligence. She was present aboard the Star Destroyer Liberator when it crash-landed on Coruscant, where she reported on the devastation the Imperial Civil War had caused on the former center of galactic government. She eventually married historian Voren Na'al, with whom she had several children."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early years"}, {"tag": "p", "text": "Rivoche Tarkin was the daughter of Brigadier Gideon Tarkin, a New Order loyalist and accomplished military officer. She spent much of her early life on Coruscant, living a life of privilege until her father was killed in the Erhynradd Mutiny in 5 BBY. Upon his death, she was offered a home in the estate of her uncle, Grand Moff Wilhuff Tarkin, on Eriadu. Resenting the fact that she had lost her father, she threw a series of spoiled tantrums until her uncle \"relocated\" a friendly servant girl and her family to a prison asteroid, sending Rivoche a message that was all too clear about her behavior. It also taught her that the world around her was cruel and dangerous, and this was her first impetus to question her beliefs."}, {"tag": "p", "text": "She was soon sent to an exclusive preparatory academy on the planet Clær, where she continued to attend the social events that were expected of a young woman of her status; however, despite maintaining a facade of model propriety to onlookers, her faith in the policies of her uncle and the New Order that he supported wavered more and more. Her questioning only increased when she began meeting others at these functions who secretly despised the Galactic Empire, including Biggs Darklighter, a young Imperial Academy cadet."}, {"tag": "p", "text": "At some point, the Grand Vizier gave her a customized poison detector, a common fixture among the scheming nobles of the Imperial court. It was a customized zZip Personality Series ChaumScanner 5 disguised as a sapphire brooch in an ornamental setting, and was designed to subtly warn the wearer when an integrated sensor detected chemical or biological toxins. The sapphire contained a holo of the Tarkin family crest deep within it, and this stone became Tarkin's favorite jewel."}, {"tag": "h3", "text": "Deep-cover agent"}, {"tag": "p", "text": "At her debutante cotillion, a cadet of CompForce, the Commission for the Preservation of the New Order's military arm, offhandedly mentioned an upcoming strike against Duros insurgents within the Duros Allied Army. Knowing that Darklighter had ties to people who might have been affiliated with the Rebel Alliance, she passed the information to him, and to her surprise, the insurgents were extracted and the CompForce assault failed, thanks to her information. Ecstatic about her success, she began actively spying for the Rebellion, and Darklighter put her in contact with other Alliance personnel, including Voren Na'al, a young reporter-turned-historian serving under Arhul Hextrophon in the Historian Corp. To facilitate her spying, she had her poison-detecting brooch modified to hold a tiny, undetectable holorecorder, which she could activate with a simple touch while flirting with prospective marks."}, {"tag": "p", "text": "Tarkin soon proved herself to be one of Alliance Intelligence's most successful undercover spies, providing information that led to the evacuation of an Alliance base on New Cylimba, saving it from an Imperial massacre. Her wealth, connections, and fashion sense put her in constant demand at important social events. She was courted by more than a dozen high-ranking Imperials at a time. Only Na'al, General Airen Cracken, and a handful of Alliance Intelligence agents were aware of her new loyalties, for fear that if knowledge of her identity as the niece of a hated and feared Imperial became more widespread it would lead to problematic repercussions within the Rebellion."}, {"tag": "p", "text": "There were those in the Empire who believed that Tarkin had a responsibility to wed and raise the next generation of Tarkins eager to serve the New Order. Following the death of her uncle aboard the Death Star in 0 BBY, the pressures on her increased. She eventually agreed to marry Vastin Caglio, eldest son of Moff Jamson Caglio of Bormea sector. The younger Caglio saw her as the ideal trophy bride to further his political career, while Rivoche Tarkin, who regarded the man as a spoiled brat, saw him as an opportunity to end the scrutiny those pressuring her to wed placed upon her."}, {"tag": "h3", "text": "Extraction"}, {"tag": "p", "text": "In 0 ABY, just prior to Rivoche Tarkin's engagement party to Caglio on Corulag, the Empire uncovered evidence, in the form of highly-encrypted datafiles, of a deep-cover operative working within the Empire. Emperor Palpatine considered locating this operative to be of paramount importance, but his apprentice and primary enforcer, Darth Vader, was unable to attend to it personally, as he had just been given the Super Star Destroyer Executor and the responsibility of locating the new Rebel base. Instead, Vader recommended Sollaine, the new head of the Imperial Security Bureau and a rival of his, for the unenviable task of capturing the operative alive. Alliance Intelligence also became aware that evidence had fallen into the hands of the Empire, so General Cracken assigned former-SpecOp Cryle Cavv and Velabri Lancer Quillin Arkell to extract Tarkin."}, {"tag": "p", "text": "Cavv and Arkell arrived at Corulag to discover over one hundred thousand Imperial starships, all present for the engagement party. Cavv and Arkell, who were flying under forged datawork identifying their ship, the G Cat, as belonging to an Imperial noble, were given an automated invitation to the party. The invitation allowed them to get to Tarkin relatively unhindered, but Sollaine and a squad of Storm commandos arrived before they were able to leave. Cavv hastily foisted a package of thermite explosive on the Imperials, managing to kill the commandos, severely wound Sollaine, and give Tarkin and her rescuers a chance to escape. When they realized that returning to their ship was out of the question, they proceeded to the Royal Galaxy Hotel, the tallest building in Curamelle, so that Cavv's droid could fly their ship to them."}, {"tag": "p", "text": "However, Sollaine had hired over fifty bounty hunters from Coreguard Security Services and set up an ambush on the roof of the hotel, having guessed it as their destination. Tarkin and her rescuers learned of the ambush after Cavv's droid, R2-RC, tapped into the rooftop surveillance imagers. They holed up in a hotel room while waiting for the arrival of Cavv's backup, a bounty hunter and master of disguise named Finn Varatha. Varatha provided Tarkin with a blaster pistol, and together, the group of four turned the tables on the ambushers, defeating them despite overwhelming odds and clearing the way for R2-RC to pick them up."}, {"tag": "p", "text": "Tarkin and the rescue team fled the planet. A full squadron of TIE fighters pursued them into the maze of ships, exchanging fire with the G Cat. Sollaine returned to his Star Destroyer, the Devastator, and attempted to capture the ship, but it managed to escape to hyperspace when Darth Vader unexpectedly arrived in-system aboard the Executor."}, {"tag": "h3", "text": "New Republic reporter"}, {"tag": "p", "text": "General Cracken provided Tarkin safe harbor at a facility under his command. Following the Battle of Endor, she became a reporter working for New Republic Intelligence, all the while becoming closer to New Republic historian Voren Na'al."}, {"tag": "p", "text": "She was a survivor of the Empire's capture of Coruscant in 10 ABY. Shortly thereafter, she accompanied the generals Wedge Antilles and Lando Calrissian on a series of surprise assaults aboard the Star Destroyer Liberator, and was with them when that ship was shot down over Coruscant. The Liberator would have been destroyed if not for Luke Skywalker, who used his abilities with the Force, as well as the ship's deflector shields and anti-grav breaking system to set it down near the Imperial Palace. The ship's distress beacon failed on impact, and the survivors were left waiting for days for rescuers to find them. While on the planet, Tarkin witnessed the behavior of the scavengers that had descended on the world, prompting her to write a report on them. Accompanied by Demolinn and Greybird, two escorts assigned by General Antilles, she searched for survivors of the ongoing Imperial Civil War. Tarkin noted that the devastation and the greed of the Imperial mutineers was much worse than had been generally recognized, a fact she relayed in a letter to Na'al."}, {"tag": "p", "text": "On the fifth day after the Liberator's crash landing, a group of Imperials found the ship and crew and attacked, fighting and nearly overwhelming the survivors. Before they could succeed, Han Solo, Leia Organa Solo, and Chewbacca arrived aboard the Millennium Falcon, and the group defeated the Imperials pinning down the Liberator crew, as well as a group of aggressive scavengers that followed. When a Force storm appeared out of hyperspace, Skywalker insisted it was meant for him and that the others must leave; the Liberator survivors were forced to rush aboard the Falcon and abandon the Jedi Master to it. Solo took the survivors to Pinnacle Base in the Cyax system."}, {"tag": "p", "text": "After Na'al interviewed Han Solo regarding his exploits in the Corporate Sector, he allowed Tarkin to review his material. She suggested providing it to the same Adarlon-based holotape producers that had been attempting to turn Arhul Hextrophon's study on Xim-era holo-iconography into a musical, noting that Solo's tales were ideal for realizing the studio's goal of increasing the accessibility of their \"inspirational\" holotapes."}, {"tag": "p", "text": "Eventually, Voren Na'al and Rivoche Tarkin married. They had several children together, including a son, Gideon Na'al, whom they named after Tarkin's father. Gideon went on to follow in his father's footsteps as an author. Tarkin was displeased to learn that her husband was leaving on a special mission on behalf of Mon Mothma to Exocron in 19 ABY, but allowed him to go on the condition that someone went with him. Voren Na'al accepted her condition and asked one of his graduate students, Pollo Tipn, to accompany him on the journey."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rivoche Tarkin was a pampered, privileged youth, prone to tantrums when she did not get her way. While living with her uncle, however, she became aware of the cruelty and danger present in the galaxy, and also started to question the pro-Imperial beliefs of her family, eventually coming to hate the Empire and its policies. While she loathed the ideology the Tarkins had subscribed to, she remained loyal to her family, refusing to endanger any of them or to tolerate slights against the family name. Her protectiveness of family extended to her husband, whom she insisted take someone with him on a potentially dangerous fact-finding mission to the Kathol sector. Like her uncle, she could be distant and sharp-tongued, although she also possessed his calculating mind."}, {"tag": "p", "text": "Tarkin's fashion sense, wealth, and connections made her an ideal deep-cover agent, a dangerous job at which she was quite successful. She was also knowledgeable of more practical skills, including marksmanship and blaster maintenance. She was willing to do distasteful things, including marrying a man she loathed, to continue in her deep-cover role."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rivoche Tarkin was created by Michael Allen Horne. She was first mentioned in the Dark Empire Sourcebook, published by West End Games for Star Wars: The Roleplaying Game in 1993, and was given a full write-up by Horne in Cracken's Rebel Operatives in 1994. She was mentioned in several other West End products, usually in relation to her communications with Voren Na'al, though she also played a major role in the short story \"Small Favors.\" Since West End Games ceased production of Star Wars materials, she has gone largely unmentioned, being referenced only in The New Essential Guide to Characters, Geonosis and the Outer Rim Worlds, and Galaxy of Intrigue."}, {"tag": "p", "text": "Star Wars Adventure Journal 12 includes an adventure idea in which player characters replace Cavv and Arkell in rescuing Tarkin from Corulag. The idea mostly echoes the plot of \"Small Favors,\" though for independent characters without pre-existing ties to the Rebellion, it suggests General Cracken—in the guise of a \"mysterious party\"—hires the characters to kidnap Tarkin."}, {"tag": "p", "text": "The image of Rivoche Tarkin used in Cracken's Rebel Operatives, drawn by Mike Vilardi, has been reused twice. It appears in \"Small Favors\" to again represent her. Later, it was colorized and had background elements removed to illustrate the character template of an \"Arrogant Noble\" player character in Star Wars: The Roleplaying Game, Second Edition, Revised and Expanded. Although Rivoche Tarkin's hair is described as brown, the colorized version of the image shows it as white."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}