{"url": "Roan_Fel%27s_double", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Personnel of the Fel Empire", "Category:Political decoys", "Category:Unidentified humans", "Category:Unidentified Imperial personnel", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Roan Fel's double"}, {"tag": "p", "text": "A Human male served as the double of Roan Fel, Galactic Emperor of the Fel Empire, in 130 ABY. He was with Fel on the galactic capital of Coruscant in that year several days after the Empire defeated the Galactic Alliance in the Sith–Imperial War and won control of the galaxy. When Fel learned that his Sith allies were planning to kill him and usurp his throne, he arranged for his double to appear at a meeting of the Council of Moffs in order to trick the Sith and allow Fel to flee into exile. Four Imperial Knights flanked the double at the meeting, which was interrupted by the Sith Lord Darth Krayt. Krayt demanded the life of the Emperor and struck down all four Imperial Knights before killing the double and seizing the throne."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male served the Fel Empire in 130 ABY as a security double of Galactic Emperor Roan Fel. His appearance was nearly identical to that of the Emperor. In that year, the Empire defeated the Galactic Alliance in the Sith–Imperial War and gained control of the galaxy. Fel moved his headquarters from the planet Bastion to the galactic capital of Coruscant, and his double was with him on the capital world several days later. The Emperor learned that his Sith allies planned to betray him and usurp his throne, and he accordingly arranged for his double to appear at a scheduled meeting of the Council of Moffs later in the day. He hoped the ruse would allow him to escape the planet, and his cousin, the Imperial Knight Mohrgan Fel, volunteered to lead three other Knights and stand by the double's side at the meeting in an effort to promote the deception."}, {"tag": "p", "text": "The double dressed in the Emperor's robes and sat on his throne in the New Imperial Palace. He was flanked by his four Imperial Knight bodyguards as the six Imperial Moffs of the council appeared before him. After Grand Moff Morlish Veed proclaimed that the galaxy now belonged to the Empire, Darth Krayt, the Dark Lord of the Sith, arrived with three of his fellow Sith Lords. The double thanked them for their assistance in the war and asked Krayt what reward he desired—the Dark Lord named the Emperor's life. Mohrgan called on his Imperial Knights to defend their \"Emperor,\" but Krayt drew two lightsabers and quickly slew them all despite their attempts at a defense. He then struck down Fel's double, demanded the allegiance of the Moffs, and declared himself the Emperor of a new Empire."}, {"tag": "p", "text": "As the Emperor was himself a fully-trained Imperial Knight, the double's failure to defend himself tipped Krayt off that he was an impostor. However, the Dark Lord's epiphany came too late; the double's sacrifice allowed Fel to flee into exile. The Emperor was able to secure forces loyal to him and form a new Empire, and he launched guerrilla strikes on Krayt's Imperial fleets for seven years. In 137 ABY, Fel retook Bastion and became a serious threat to Krayt's galactic rule."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The double of Roan Fel served the Emperor as a nearly identical lookalike for security reasons. He attended a meeting of the Council of Moffs in the Emperor's stead after it was discovered that Darth Krayt would attempt to kill Fel, and he was unable to defend himself from Krayt's attack."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The double of Roan Fel was created by John Ostrander and Jan Duursema for the comic series Star Wars: Legacy. He first appeared and subsequently died in the series' first issue, released in June 2006. Fel himself had been pictured and given a brief biography in the preview issue Star Wars: Legacy 0, released earlier in the month. Dark Horse Comics' solicitation for the first issue stated that \"An Emperor is betrayed,\" and the comic did not clearly indicate that the man killed by Krayt was not in fact Fel until its penultimate page."}, {"tag": "p", "text": "The events surrounding the double's death were retold from different perspectives in Legacy's eighth issue (2007), which also showed Roan and Mohrgan Fel devising the deception beforehand. Since then, the double has been mentioned in Roan Fel's entry in 2008's The Complete Star Wars Encyclopedia and in 2009's Legacy Era Campaign Guide. Despite the double's failure to defend himself from Darth Krayt, Randy Stradley, Dark Horse's Vice President of Publishing, has speculated that the character could possibly be an Imperial Knight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}