{"url": "Roan_Novachez", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Articles with unencyclopedic tone", "Category:Non-canon Legends articles", "Category:Humans", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Novachez family", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Roan Novachez"}, {"tag": "p", "text": "Roan Novachez, sometimes known as \"Ro,\" was a male Human Jedi Knight born and raised on Tatooine. Rejected from Pilot Academy, his entire life changed when he learned he was strong in the Force and received an invitation to attend the Coruscant Jedi Academy, a Jedi academy at the Jedi Temple on Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Life"}, {"tag": "p", "text": "Roan lived on Tatooine with his mother, father, younger brother Oliver \"Ollie\" Novachez and older brother Davin \"Dav\" Novachez. Roan's father was a graduate of Pilot Academy and Davin followed in his footsteps. Roan had every expectation of doing so as well and therefore felt himself \"doomed\" when he received a rejection letter from Galactic Republic Senator Blagotine, with Tatooine Agriculture Academy as a recommended alternate school. Roan despaired of this fate, both because it would not involve flying in space and because every plant he touched seemed to turn to dust."}, {"tag": "p", "text": "Things changed dramatically for Roan when, the next day, he received a letter from Principal Mar of the Coruscant Jedi Academy, a Jedi academy based on Coruscant, inviting him to attend. The letter was accompanied with a note from Grand Master Yoda stating that the Force was strong in Roan and it would be good to teach him. The letter came as a complete surprise, as it was highly unusual for anyone Roan's age to begin training as a Jedi. Still, Roan was tentatively excited as he knew, amongst other things, that Jedi get to use some sort of \"laser sword.\""}, {"tag": "h3", "text": "First Year"}, {"tag": "p", "text": "Upon his arrival at Jedi Academy, Roan felt uncomfortable with his surroundings until he met Pasha, Gaiana, Egon, Tegan, and Bill. Roan still felt he did not fit in, placed amongst students who had been using the Force and were capable of feats such as levitating suitcases to the tops of their bunks using only the Force. He also had to deal with obstacles such as bullying students and arriving late to class due to having his watch set to Tatooine time. Despite this, Roan soon became even closer with Bill, Pasha, and Egon; began drawing Ewok Pilot comics for the school newspaper; and achieved good marks in most of his courses, except for Basic Lifting which he struggled with the whole semester. He also developed a crush on a female student, Gaiana.He goes to the Wookie Planet Heading into spring break, Roan didn't feel any closer to becoming a Jedi."}, {"tag": "p", "text": "Following spring break, Roan and his fellow students began attending a number of new courses, including Master Yoda's lecture on the Principles of the Force, as well as a study of Early Mandalorian Poetry with Librarian Lackbar and Advanced Lightsaber Dueling with Mr. Garfield. He joined a Lightsaber Fencing Tournament but continued to struggle greatly with lifting objects via the Force. At the tournament, Roan caused a spectacle when he accidentally turned off Cyrus's lightsaber during his duel with Pasha. Many believed this to be cheating, though Roan had done it accidentally using the Force. Roan immediately felt small among the crowd. Roan's final days of the school year were tainted with a widespread reputation of his being a cheater, and he approached his final exam in lifting objects with the Force convinced that he was headed for \"Plant School.\" Convinced of failure, he decided he could relax and stop trying so hard, inadvertently achieving something that Yoda had stressed throughout his school term. Amazing both himself and his fellow students, he levitated several boulders high in the air, earning top marks on his exam. He achieved strong marks in his other classes as well, including Physical Education, and was voted Most Creative in the Padawan Observer End-of-the-Year Awards. He made up with Pasha and admitted to Master Yoda that he would return the next year. Before leaving, he received a delightful surprise in finding that his class schedule for the next term included Starfighter Flight Training."}, {"tag": "p", "text": "Returning home, Roan's dad suggested to him that he might apply for a transfer to Pilot Academy, but Roan told him he'd like to stay at Jedi Academy. He received a letter from Gaiana and his brother Dav asked to see his lightsaber. After a year at Jedi Academy, Roan's opinion was \"Who needs Pilot School? I'm going to be a Jedi!\""}, {"tag": "h3", "text": "Second Year"}, {"tag": "p", "text": "During the summer in his second year, Gaiana mailed him a colo claw fish tooth from Naboo, which she had visited recently. In his second year, Roan helped Gaiana with the class pet program she organized. During his time, he helped her take care of a Voorpak. Eventually, Roan and Gaiana would end up on unfriendly terms, starting when Roan unintentionally hit her with a dodgeball and seemingly tried to avoid her during the school's Satine Hawkins Dance. During the break, he accidentally ripped one of Pasha's dad's books while not making up for it causing Pasha to get upset. He became farther from them when he thought Pasha was dating his girlfriend, Gaiana."}, {"tag": "p", "text": "Later, Roan was assigned to build a droid project with the bullies Cyrus and Cronah, and began cozying up to them. Jo-Ahn and Greer were also involved in the project. He then started a massive food fight, causing them both to end up at the principal's office. He then had to go on a field trip and soon realized Pasha was just helping Gaiana's dad due to his sickness. Cyrus and Cronah then betrayed him after he allowed Pasha to defeat him in the Lightsaber Fencing Tournament and apologizing to him. Later, he went to find Voorpee, who had been kidnapped and tortured by Cyrus and Cronah, only to be discovered by Gaiana, who thought Roan had kidnapped the voorpak. He told Master Yoda what happened. He then took an assessment where he had to fly his (virtual) starfighter to point B. Cronah and Cyrus were on his team and ditched him intentionally. He also helped Gaiana and Shi-Fara navigate their ships after they were critically damaged. He then crashed into an asteroid."}, {"tag": "p", "text": "Later, he made up with Gaiana, regaining all his friends, and heading back home on his space bus returning to Tatooine for the summer. When he found out who his next year master will be... Mr. Garfield."}, {"tag": "h3", "text": "Third Year"}, {"tag": "p", "text": "In his third year, Roan began the training with Mr. Garfield. He still shared several classes with Pasha and Gaiana. Generally, Roan and Mr. Garfield were on neutral terms as Roan trained to become a pilot. He also went on a double date with Gaiana, Pasha, and Shi-Fara with Cyrus and the new kid Lily which he became suspicious with. Throughout the year, Cronah and Ronald Rinzler pranked him many times, like messing up his backpack to putting voorpak food in the ice cream but somehow, Roan did not know that Ronald was involved. In the final exam for the semester, Roan worked with Gaiana, Shi-Fara,  and Pasha, and they finished in twenty minutes."}, {"tag": "p", "text": "Later, Roan navigated the Labyrinth that was the final test. During this, he learned that Ronald and Cronah had been pranking him all year. He engaged Cronah in combat and won. At this point Cronah revealed why he had been a jerk to Roan, and that he felt fearful and insecure, and not malicious. This caused Roan to understand him more, and provide encouragement instead of snark in response. He then finished the maze sixth place, to find out Ronald had come first! But Cronah snitched him out for bringing a map and going through an employee only door. Ronald then got suspended until further notice, though Ronald seemed pleased in this. Ronald left early due go to an orientation at his \"dream school\" The Galactic Senate Academy which he gets through thanks to his cheating. Bill doesn't think he's serious when he tells them to vote for him when he's older. Later, the Jedi Academy had a graduation party in which Roan complimented Gammy on a cake that he made. After the party, Roan and Gaiana met up and Gaiana said she got her braces off. After some playful banter, she raced up and kissed him on the lips. This surprised Roan, who said he didn't want to tell Dav about it or it would be a long time before he let that go. Before leaving for home, Roan said goodbye to a few of his friends. Gaiana met up with him and they kissed each other. Roan then said goodbye to his mentors."}, {"tag": "p", "text": "He came back home learning Ollie was enrolled in Jedi Academy Kindergarten due to him lifting multiple pebbles into the air. Roan then said hi to Dav, who figured out that Roan and Gaiana kissed each other on the lips, and when Roan asks Dav how he figured it out, Dav said a brother always knows."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Roan was discovered relatively late in life to have a powerful ability to draw upon the Force. Identified as a Force-sensitive by Grand Master Yoda and Principal Mar, he was invited to attend Jedi Academy on Coruscant, where he quickly learned to draw upon the power of the Force. Though Roan had trouble learning to trust the Force at first, he proved eventually to be a powerful adept at telekinesis. He also learned skills in lightsaber combat and how to draw upon the Force to see visions of the present and future. In addition to Force skills, Roan proved an able student when it came to the school's more general curriculum in areas such as physics and home economics. Roan was also a talented artist, having begun drawing at an early age. He published a series of comics known as Ewok Pilot and Jawa Pilot that proved extremely popular with his fellow students at the academy. He was also considered a fantastic pilot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "First appearing in the junior novel Jedi Academy, Roan Novachez serves as the series' protagonist. Jedi Academy series author Jeffrey Brown states that Roan is the character from his books he identifies with the most and that many of the events and situations involving Roan are based on ones from his own middle- and high-school years."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}