{"url": "Roblio_Dart%C3%A9", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi Generals", "Category:Jedi Purge victims", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Roblio Darté"}, {"tag": "p", "text": "Roblio Darté was a male Human Jedi Master and Jedi General who fought in the Clone Wars. He was noted for his skilled use of the crossguard lightsaber. Though he survived Order 66, he was killed during the Conclave on Kessel by Darth Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A Force-sensitive Human male, Roblio Darté was trained in the ways of the Force by the Jedi Order, ascending to the rank of Jedi Knight after completing his Trials of Knighthood. Proficient with a lightsaber, Darté crafted for himself a rarely seen crossguard variant with two blue blades. After further service to the Galactic Republic, Darté was promoted to Jedi Master by the Jedi High Council."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "In 22 BBY, when the Separatist Crisis between the Republic and the Confederacy of Independent Systems erupted into the Clone Wars, Darté took up the rank of General in the Grand Army of the Republic, leading clone troopers against the Separatist Droid Army. Throughout the war between the Republic and the Separatist forces, he was sent to the swampy battlefields of Parcellus Minor. Due to the unstable surface of the planet, the Republic was unable to land any of their heavy equipment, and Darté and his troops found themselves fighting without transport or artillery. Worse yet, Republic Intelligence vastly underestimated the number of Separatist forces on the planet, and Darté found his forces outnumbered ten to one. Completing the disaster, a CIS fleet arrived behind the small Republic fleet, trapping both the orbital support ships and the army planetside."}, {"tag": "p", "text": "Despite being wildly outnumbered, Darté and his clones held off the droid army for some time, while suffering heavy casualties in the process. Finally, the Separatist commander tired of the fight and ordered an orbital bombardment of the planet. As the Separatist turbolasers bombarded the world, decimating Republic troops and Separatist droids alike, the tzeotine created by the native flora ignited, setting the entire planet aflame. Darté ordered his forces into a full retreat; attempting to save as many clones as possible, he was forced to leave large numbers of wounded troopers behind. Darté himself was wounded numerous times, and lost his left eye. In the end, over 90% of the clone troopers involved in the battle were killed, and it was later described by some as being close to a second Battle of Jabiim."}, {"tag": "p", "text": "Two days after the evacuation, Darté reported back to Coruscant to report the disaster to the High Council. Within the High Council Chamber, the bandaged and scarred Darté knelt before the twelve Masters as he recounted the events. During his report, Senators Bail Organa, Mon Mothma, and Ask Aak entered to listen, as the truth of the report had was largely downplayed by the media and the Galactic Senate. Senator Aak stormed out of the chamber, blaming the Jedi for the destruction of another world."}, {"tag": "h3", "text": "The Great Jedi Purge"}, {"tag": "p", "text": "In 19 BBY, Supreme Chancellor Palpatine of the Republic—secretly the Dark Lord of the Sith—issued Contingency Order 66 to the Grand Army, commanding them to execute their Jedi Generals. Somehow, Darté survived the slaughter and went to ground, avoiding detection by the newly formed Galactic Empire. In the months following the downfall of the Order and the Republic, Darté was contacted by fellow Master Shadday Potkin, who wished to conduct a conclave with other survivors. Assembling in an abandoned mine on Kessel, Darté and his compatriots discussed the future of the Order and the next course of action they should pursue. Their opinions covered a wide range; while Masters Bultar Swan and Tsui Choi argued against outright attacks against the Sith or the Empire, Koffi Arana offered the possibility that any action, even succumbing to the dark side of the Force, was worth the risk if they could take down the Sith. Darté and Ma'kis'shaalas landed in the middle of the argument, and Darté believed that justice needed to be served and the Republic revived."}, {"tag": "p", "text": "Master Potkin revealed that their arguments were a moot point, as she had assumed that they would discuss their options without acting, and thusly, she had chosen their course for them—the conclave was in fact a trap she had set to lure Sidious' Sith apprentice Darth Vader to his death. She had known that Vader was searching for Obi-Wan Kenobi, and so she leaked false information that he would be attending the conclave. Her goal was to weaken the Emperor and the New Order while simultaneously letting the galaxy know that the Jedi still lived. As Choi reeled in shock over her decision, Potkin sensed Vader's arrival in the Force and urged the others to ready themselves."}, {"tag": "p", "text": "As the Sith Lord entered the chamber, demanding Kenobi, Darté and most of the Jedi attacked. Sia-Lan Wezz rushed ahead of the others and was stabbed through the chest by Vader. Darté, Arana, and Ma'kis circled Vader, but the Dark Lord pushed Arana across the chamber and sliced through Ma'kis's chest, killing him. Farr managed to wound Vader with a strike to the back, but Vader leaped away, followed by Potkin. Potkin had brought a cortosis blade to the battle, thinking it would give her the edge she needed to defeat Vader. She succeeded in deactivating his lightsaber, but Vader simply tossed the weapon aside and lifted Potkin with the Force and snapped her neck, then took her blade for himself. Darté, Farr, and Arana all attacked Vader again, but just as quickly had their lightsabers deactivated as well. Choi wisely jumped in and saved the others by severing Vader's hand while Swan slashed him along the leg, staggering him."}, {"tag": "p", "text": "Vader surrendered to the Jedi, but Arana believed it was a lie and demanded Vader's death. When Swan attempted to stop him, he took her lightsaber and gave in to his anger, killing her with her own blade. He launched himself at Vader, and Vader saw his chance, flinging his own severed hand, still clutching the cortosis blade, into Arana's chest. Darté stood with the other two surviving Jedi, Choi and Farr, assaulting Vader by levitating rocks and equipment and throwing them at him. Vader was unable to overcome their combined power, and succumbed to the attack, falling to his knees."}, {"tag": "p", "text": "Choi decided that Arana may have been right, and approached Vader, preparing to kill him after all. At that moment, stormtroopers rushed onto the walkways above, and began to fire on the Jedi. Darté was able to lift a large piece of metal with the Force, blocking their blaster bolts. While Choi likewise blocked the attack with his lightsaber, Farr was not as quick, and was shot through the head and chest. Darté urged Choi to flee while he could, but Choi thought the opposite, and launched himself at the stormtroopers and told Darté to run instead. Vader caught Choi with the Force before he could attack the stormtroopers, who in turn killed the Aleena. Darté screamed Choi's name as he too was cut down, shot multiple times in the chest, killing him."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The stormtroopers had arrived by orders of Emperor Palpatine, who knew of Vader's personal ambitions to hunt down Kenobi. Though Vader was ashamed that he had disobeyed his master's orders, Palpatine told him that battle was going to be used for Imperial propaganda. The lies the New Order would spread would strike fear into their enemies while driving any other surviving Jedi further into hiding."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Roblio Darté is the creation of John Ostrander. While the character's first appearance was in Republic 61 and his name appeared in the comic's script, it was not until Star Wars: Purge that the name was made canonical. Ostrander speculated that Darté was born in 50 BBY."}, {"tag": "p", "text": "Darté is the first character to be seen with a forked lightsaber; a smaller blade angles off the main blade at the hilt. This unique weapon is visible in Republic 61: Dead Ends and Star Wars: Purge. The smaller blade appears in Purge, but in several panels is colored as if it were part of the hilt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}