{"url": "Robin_Pronovost", "categories": ["Category:Real-world articles", "Category:Star Wars artists"], "nodes": [{"tag": "h1", "text": "Robin Pronovost"}, {"tag": "p", "text": "Robin Pronovost is a Star Wars artist who designed the Amaran species and both illustrated and co-wrote Castaways of Endor. They also created art tutorials and artwork for two magazine series titled Star Wars Kids and the Star Wars Kids section of StarWars.com. Topps released multiple trading card sets with Artist Sketch Cards featuring Pronovost's artwork."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "As an artist for Star Wars publications, Robin Pronovost illustrated online features, magazine articles, and trading cards. Their artwork was featured as Artist Sketch Cards in multiple sets released by Topps, such as the 2007 Topps Star Wars 30th Anniversary trading card set."}, {"tag": "p", "text": "While working on The Essential Guide to Episode I, author Daniel Wallace requested that Pronovost design the Amaran species. The book was eventually cancelled, but Pronovost shared their unofficial designs and backstory on their blog for use in roleplaying games, and their work inspired the depiction of Amarans in The Wildlife of Star Wars: A Field Guide, written by Terryl Whitlatch. Wallace co-wrote Castaways of Endor with Pronovost, who also provided illustrations. According to Wallace, the pair intended it for Star Wars Insider, unsuccessfully pitched it for Star Wars Gamer prior to the magazine's cancellation, then StarWars.com purchased it for Hyperspace and released it in 2008."}, {"tag": "p", "text": "Pronovost's other official Star Wars art includes cartoons and game illustrations for two versions of Star Wars Kids magazine, both The Fan Club, Inc.'s version and the second Scholastic Inc. version, with some pieces reprinted in the other. They produced the art tutorial \"How to Draw Admiral Ackbar\" for Star Wars Insider 92 and several other drawing tutorials for the Star Wars Kids section of StarWars.com."}, {"tag": "h2", "text": "Published works"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}