{"url": "Robot_ramship", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Battle droid models", "Category:Confederacy of Independent Systems starship classes", "Category:Starship classes"], "nodes": [{"tag": "h1", "text": "Robot ramship"}, {"tag": "p", "text": "The robot ramship was a form of automated starship used for ramming by a variety of mercenaries and pirates including the Sacorrian Triad and their Corellian allies during the Corellian Crisis."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A typical robot ramship was an automated, gestalt starship assembled by outlaw techs, usually in the Outer Rim Territories. These shady individuals took the shell of a junked warship, often of Corellian Engineering Corporation design, and packed the hollow interior with solid durasteel. This packing was focused towards the front of the vessel, creating a toughened bow capable of smashing through shields and thick hulls, which usually featured a bulbous nose. This afforded the ramship incredible mass, which translated to incredible kinetic energy which was used to impact against an enemy vessel in a multimegaton explosion. Some were also fitted with additional charges set to ignite on or shortly after impact, ensuring total annihilation of a target. However, the solid interior also made the ramship difficult to maneuver. Ramships were designed to be solid metal bullets used specifically for suicide runs."}, {"tag": "p", "text": "The vessel's exterior was modified to give the false ramship the appearance of a typical ship of the line. The hull was customized with dozens of painted-on portholes, observation ports, and underpowered laser cannons and turbolasers, while structural support rods helped keep the vessel intact. The hull was thick enough to absorb even sustained blaster volleys. In order to achieve ramming speed, these vessels were fitted with high-acceleration quad engines fed by engine-blast boost lines, which provided the ramships with high boost. These engine arrays were designed to provide enough thrust to drive the weapon towards its target, and could only operate on full power for a few moments."}, {"tag": "p", "text": "Because of the suicidal nature of a ramship's missions, these vessels were not crewed by organics; rather, the ship's computer core was fitted with a droid brain. This unstable droid pilot had the intelligence to put up a convincing fight against enemy vessels, and was crazed enough to destroy itself by ramming its target at the first opportunity. Ramships were also installed with an extensive database of military tactics, and, unlike the droid brains utilized in drone barges, lacked any self-preservation safeties. A guidance computer and an extendible sensor suite assisted the droid pilots in their suicide missions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ramships were ancient weapons that saw use since the earliest days of space warfare, and became infamous as a deceptive and dishonorable innovation in the history of combat. Typically designed and outfitted from stolen starships by criminal techs in the most notorious regions of the Outer Rim Territories, these ships were not officially manufactured or advertised. They saw extensive use by outlaw armadas, and became feared by commanders and experienced veterans. Even ramships which were successfully disintegrated still produced a debris field that could cause catastrophic damage to a target vessel. Most commanders learned to make immediate evasive maneuvers when faced with a ramship."}, {"tag": "p", "text": "During the Clone Wars, Wat Tambor utilized a robot ramship in the Battle of Xagobah, targeting a Republic Acclamator-class assault ship with the intent of destroying it. The tactic was anticipated by Boba Fett and Ulu Ulix, who flew a swoop towards the drone ship. Ulix was shot down, though rescued by Fett, and Glynn-Beti assured the youngsters that the ramship would be taken care of. Soon enough, Anakin Skywalker led a Hailfire-class droid tank to fire at the ramship while attempting to shoot down his interceptor. The Hailfire's plasma bursts hit the ramship, releasing the stored kinetic energy within and destroying the vessel in an energy surge that also scrambled the circuits of Tambor's battle droids."}, {"tag": "p", "text": "During the Battle of Centerpoint Station in 18 ABY, which concluded the Corellian Crisis, the Sacorrian Triad deployed shoals of these deadly starships against the New Republic-allied Bakuran Defense Fleet. Four refitted frigates modified into ramships targeted the flagship—the Namana-class Light Cruiser Intruder—by first firing upon it to create confusion for the Bakurans. By the time Admiral Hortel Ossilege realized the laser fire was merely a diversion from the true threat, it was too late for the unfortunate Bakuran crewers. Soon, three of these vessels had rammed the Intruder, though the fourth failed. As the crew of the Intruder rushed into escape pods, Ossilege and the Bakuran representative Gaeriel Captison succeeded in self-destructing the ship. The wrecked Intruder flew into the heart of the Sacorrian fleet and exploded, taking out much of the enemy force and clearing the way for New Republic reinforcements."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}