{"url": "Roche_asteroid_field", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Galactic Republic planets", "Category:Perlemian Trade Route", "Category:Roche asteroid field"], "nodes": [{"tag": "h1", "text": "Roche asteroid field"}, {"tag": "p", "text": "The Roche asteroid field, sometimes known simply as Roche, was a series of asteroids colonized by the Verpine, including Nickel One (the capital), Slayn, Korpil, Roche G42, and Shantipole."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Some believed that the Roche asteroids were the remains of the Verpine homeworld, possibly destroyed by civil war. The Verpine simply claimed that they did not know where their homeworld was located.The Verpine were lead by a technocratic government. This government led  all the Verpine worlds as a cohesive whole, though there were disparate Hive-minded governments of each planet or system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Roche asteroids joined the Galactic Republic early in its history, sometime between 25,000 BBY and 22,000 BBY."}, {"tag": "p", "text": "In 3996 BBY, a Verpine pirate named Raxsus Nuli tried to conquer a planet, but was arrested by the Jedi. When the Wookiees joined the galactic community, they traded with the Verpine for manufacturing processes."}, {"tag": "p", "text": "The asteroids were the headquarters of Roche Industries and Slayn & Korpil. They were the only place where larmalstone was available. Roche also exported Verpine shatter guns prior to the Jedi Civil War."}, {"tag": "p", "text": "The asteroids didn't secede during the Clone Wars."}, {"tag": "p", "text": "After the Battle of Yavin, the asteroids were the site of the Shantipole Project, in which Slayn & Korpil worked with Ackbar to develop the B-wing starfighter. When the Galactic Empire became aware of this, Governor Bane Nothos blockaded the system. However, the Rebels broke the blockade with the B-wing prototypes and blew up Research Station Shantipole, resulting in Nothos's demotion to Commander."}, {"tag": "p", "text": "The Verpine later joined the New Republic. In 4 ABY, a conflict broke out between the Verpine and the Barabels; the Barabels sold dead Verpine to the Kubaz as food. This dispute was eventually settled by Leia Organa Solo."}, {"tag": "p", "text": "In 35 ABY, during the Swarm War, the Killiks tried to take over the Roche asteroids and other insectoid-inhabited worlds of the Galactic Alliance. The Jedi repulsed the invaders and saved the Verpine hive queen."}, {"tag": "p", "text": "In the years leading to the Second Galactic Civil War, Roche was involved in a significant commercial dispute with the planet Murkhana. The Verpine accused Murkhana of counterfeiting Verpine technology. To solve the problem, Roche agreed to a trade agreement in 40 ABY with the powerful Mandalorians for protection services in exchange for technological enhancements. When the war erupted between the Galactic Alliance and the Confederation, Roche remained neutral. However, the system was invaded by the Imperial Remnant shortly after, but the Mandalorians honored their agreement and came to the Verpine's aid."}, {"tag": "p", "text": "To prevent future attacks on their colonies, the Verpine created the IX-6 heavy combat droids to supplement their defenses. Sometime after the establishment of Darth Krayt's Galactic Empire in 130 ABY, a fleet of Star Destroyers blasted several heavily populated Verpine asteroids to dust for the species' unwillingness to stop the production of the IX-6 model."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}