{"url": "Rock_wart/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Cleanup", "Category:Creature stubs", "Category:Crustaceans", "Category:Scavenger creatures", "Category:Species of undefined sentience", "Category:Venomous and poisonous creatures"], "nodes": [{"tag": "h1", "text": "Rock wart"}, {"tag": "p", "text": "Rock warts were orange/brown insect-like crustaceans found on many planets. Their bite delivered a neurotoxin to their victim, which was then used as an incubator for up to twenty eggs."}, {"tag": "p", "text": "They were fast-moving scavengers and pests that lived in rocky, secluded habitats, particularly on Tatooine, as well as Tocoya and Kirdo III. Rock warts were usually solitary creatures, and often hid in shadows and attacked when surprised. They were nearly one meter long."}, {"tag": "p", "text": "Among the nasty surprises to greet a weary moisture farmer returning to his hovel after a hot day's work could be a spiny rock wart that had crawled into the welcome shade of the home. Though not ordinarily aggressive towards larger animals, rock warts had a deadly neurotoxin that could kill a man as easily as the small invertebrate and lizard prey upon which the creatures usually fed. The lethal venom, administered by a bite to subdue fleeing prey, might just as readily be used by a surprised rock wart in its own defense, having been sat on or stepped upon in the dark. Misunderstanding or not, the unfortunate recipient of a wart wound was seldom alive long enough to care about the reason he was bitten."}, {"tag": "p", "text": "In 32 BBY, as he led the Ghostling children to freedom through Mos Espa's subterranean sand drains, young Anakin Skywalker was attacked by a rock wart, but the fledgling hero escaped its venom by administering to it healthy jaw-clamping bites of his own."}, {"tag": "h2", "text": "Unidentified variation"}, {"tag": "p", "text": "Top zoologist Lyrre T'enna was unable to identify the species of a roadside creature that resembled the rock wart."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rock wart in Return of the Jedi may possibly be seen clinging to a wall or light fixture, through the arch of the third alcove Leia passes on her way to free Han from the carbonite slab, at frame 18:05 of the Special Edition DVD."}, {"tag": "p", "text": "A behind-the-scenes photo of Jabba's entourage makes it seem likely that a rock wart was present on the set of Jabba's palace."}, {"tag": "p", "text": "In the video game Super Return of the Jedi, they appear green instead of brown."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}