{"url": "Rodian_Clan_Wars", "categories": ["Category:Legends articles", "Category:Battles of Rodia", "Category:Civil wars", "Category:Conflicts of the Mid Rim", "Category:Conflicts of the Outer Rim Territories"], "nodes": [{"tag": "h1", "text": "Rodian Clan Wars"}, {"tag": "p", "text": "The Rodian Clan Wars were a series of violent inter-tribal conflicts that took place primarily on the planet Rodia over the course of several decades."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Rodians by their nature were a warlike species, best suited for hunting. Their society developed around a culture of war games wherein members of opposing tribes would be required to hunt down their adversaries under specified, prearranged conditions. Over the years however, these war games bred racial disharmony between the varying clans and the contests took a darker and more personal turn."}, {"tag": "p", "text": "Around seventeen years before the Battle of Yavin, Navik the Red, a powerful chieftain of the Chattza Clan, waged war against the more tempered members of the Tetsu Clan. Many Tetsu had turned from their violent ways and embraced the ideals of pacifism. As such, they became easy prey for the aggressive members of the Chattza clan. During the internecine struggle, Navik murdered his arch-rival, the bounty hunter known as Greedo the Elder. Greedo's wife, Neela, along with her brothers, Nok and Teeku, and her son Greedo fled Rodia in three large transport ships. They colonized a small jungle planet allowing Navik the Red to become the Grand Protector and warlord chieftain of Rodia."}, {"tag": "p", "text": "The Rodian clan wars subsided for some time while Navik consolidated his power on Rodia. Four years before the Battle of Yavin, Navik the Red discovered where the Tetsu refugees had been hiding for so many years. Accompanied by an entourage of warlords and bounty hunters, they raided the Rodian villages on the jungle planet and slaughtered many of the remaining Tetsus. The aging Tree-Bott herder, Nok, tried to get the three colony starships into the air in the hopes of fleeing the planet. Navik's forces destroyed one of them, but two survived and Nok, Neela, Teeku, Greedo and his brother Pqweeduk were able to safely survive the massacre."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although many Tetsu Rodians survived the wars, their numbers were small and they took to populating communal refugee camps on worlds such as Nar Shaddaa and Tatooine. Navik continued to hunt down and destroy as many Tetsu as he could possibly find."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}