{"url": "Rodian_splice", "categories": ["Category:Canon articles", "Category:Cocktails", "Category:The Official Black Spire Outpost Cookbook recipes"], "nodes": [{"tag": "h1", "text": "Rodian splice"}, {"tag": "p", "text": "A Rodian splice was an alcoholic beverage created with several toxic substances that had to be mixed in precise proportions to prevent the drink from being lethal when consumed by most species. Han Solo, a smuggler and human male, enjoyed the cocktail and ordered it on multiple occasions. Artiodac chef Strono Tuggs, however, was afraid to prepare it or consume it."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Rodian splices were alcoholic beverages created with multiple toxic ingredients. If the cocktail was not prepared with perfect proportions of the already-poisonous ingredients, it would become lethal for most species to consume. The drink was highly intoxicating and had a strong flavor that many beings enjoyed despite the risk of death."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The drink was enjoyed by the human smuggler Han Solo, but he often could not find a cantina that served a satisfactory one. Between 1 ABY and 3 ABY, he ordered a Rodian splice at a bar on Barnahof that served the beverage, but he was forced to abandon it without consuming it due to the arrival of a stormtrooper patrol. The Galactic Empire was searching for Solo, Leia Organa, and Luke Skywalker after the three Rebels had gone into hiding following the Battle of Mako-Ta. When the trio found refuge at Thane Markona's estate on the isolationist moon Hubin, the thane's butler droid MK-1 served them drinks while they sat in the estate grounds awaiting an audience with Markona. The droid mixed a large container of Rodian splice at Solo's request, but made substitutions for some of the poisonous ingredients due to the risk of producing a beverage that was not safe for human consumption. Solo was content to relax and enjoy the drink, but Skywalker had grown impatient and declined Solo's suggestions that Skywalker enjoy the cocktail."}, {"tag": "p", "text": "After the Battle of Takodana in 34 ABY, Artiodac chef Strono Tuggs published his cookbook which included a recipe for the cocktail and multiple warnings about its dangers. In his description of the beverage, Tuggs characterized it as the type that would be ordered by smugglers who were desperate and had something they wished to prove. He admitted to his fear about preparing or consuming the potent and potentially fatal cocktail."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rodian splices were introduced in the 2015 comic book series Star Wars by Marvel Comics and first appeared in issue 56, which was written by Kieron Gillen with art by Andrea Broccardo and was published on November 7, 2018. The beverage was colored green in the subsequent issue 57."}, {"tag": "p", "text": "The 2019 cookbook Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook, which was written by Chelsea Monroe-Cassel and Marc Sumerak, includes a recipe for the cocktail. Equal amounts of Coffee liqueur, Irish cream liqueur, and either bourbon or whiskey are poured into a glass in that order to create a layered drink."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}