{"url": "Rogue-class_Porax-38_starfighter", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Confederacy of Independent Systems starfighter classes", "Category:Rogue-class starfighters"], "nodes": [{"tag": "h1", "text": "Rogue-class Porax-38 starfighter"}, {"tag": "p", "text": "The Rogue-class Porax-38 starfighter, also known simply as the Rogue-class starfighter, Porax-38 starfighter, or P-38 fighter, was a model of starfighter manufactured by Baktoid Armor Workshop and Buuper Torsckil Abbey Devices and used by the Confederacy of Independent Systems during the Clone Wars. Often flown by specially programmed IG-100 MagnaGuards, it came to informally be known as the MagnaGuard Fighter. The bounty hunter Cad Bane owned a modified Rogue-class starfighter known as the Xanadu Blood."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "12.7 meters in length, the Rogue-class starfighter had a bulbous cockpit and heavy laser cannons on both wings."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Manufactured by Baktoid Armor Workshop, Rogue-class starfighters were used by the Confederacy of Independent Systems during the Clone Wars. They were often flown by specially programmed IG-100 MagnaGuard, though they were also piloted by Separatist leaders and hirelings."}, {"tag": "p", "text": "During Count Dooku's plot to secure access to Hutt Space during the Clone Wars, he had two of his MagnaGuards fly Rogue-class starfighters. Though the fighters were destroyed, they were successful in shooting down Jedi General Skywalker's ship, the Twilight."}, {"tag": "p", "text": "Cad Bane was then given one by his Sith Lord client, Darth Sidious, equipped with a cloaking device. Bane then used his Rogue-class starfighter to kidnap two Force-sensitive children from Rodia and Glee Anselm, eventually taking them to Mustafar. Bane and his ship were then captured by Skywalker and his apprentice on Naboo. Onboard the Resolute, Skywalker and Tano searched his ship, eventually discovering that he also went to Mustafar."}, {"tag": "p", "text": "At some point, Bane was able to reclaim his fighter, using it during his work for the Hutts. Bane and his droid, Todo 360, then used it to track Ziro to his father's grave on Teth."}, {"tag": "p", "text": "Rogue-class starfighters were used on Utapau near the end of the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rogue-class Porax-38 starfighter was originally created for the 2005 film Star Wars: Episode III Revenge of the Sith."}, {"tag": "p", "text": "It was a late addition to the film and, though a digital model was created for the starfighter, it was never completed to the level originally planned."}, {"tag": "p", "text": "The P-38 fighter was inspired by the real-world Lockheed P-38 Lightning, a World War II fighter aircraft. It shares a number of characteristics with the P-38 Lightning, including a pair of twin tails and similar engine scoops."}, {"tag": "p", "text": "A gunship baring a strong resemblance to the Rogue-class appeared in \"Chapter 6: The Prisoner,\" an episode from the 2019 Disney+ television series, The Mandalorian. Concept art showcased in the episode's credits depicted the ship as appearing closer to a stock Rogue-class than in the final episode."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}