{"url": "Rogue_CorSec_Base", "categories": ["Category:Legends articles", "Category:Corellia locations", "Category:Military bases"], "nodes": [{"tag": "h1", "text": "Rogue CorSec Base"}, {"tag": "p", "text": "The Rogue CorSec Base, also referred to as a Rogue CorSec encampment, or as Rogue Island, was a base located on an island on the Core world of Corellia during the time of the Galactic Civil War. Sometime prior to the Battle of Yavin in 0 BBY, disgraced ex-CorSec officers claimed the deserted island with the old CorSec base as their headquarters for thuggery, extortion and wanton violence. The Rogues also used the base's defense capacities to fight their former associates at CorSec, who were constantly hunting them."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime following the Battle of Yavin, people campaigning across Corellia to support the Twi'lek politician Karin Featherlight discovered the cave. Featherlight later uploaded the coordinates of the Rogue CorSec base to a spacers datapad. A loyal CorSec agent, angered by the Rogue CorSec betrayal, also tasked a spacer with locating the base and enacting vengeance against the traitors."}, {"tag": "p", "text": "Circa 1 ABY, a spacer working for CorSec Lieutenant Mack Jasper infiltrated the base to find proof that the Rogue CorSec were behind a plot to overthrow Diktat Daclif Gallamby. The spacer then killed Hiram Bish and Mtara Vinram, the Rogue CorSec commanders who were responsible for the plot."}, {"tag": "p", "text": "The same year, Jabba the Hutt's henchman Bruce McBrain dispatched a spacer to the Rogue CorSec Base in order to retrieve the destruction code sequences of a CorSec Corellian Corvette."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rogue CorSec Base was a location in the 2003 massively multiplayer online role-playing game Star Wars Galaxies: An Empire Divided, prior to the game's closure on December 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}