{"url": "Rogue_CorSec", "categories": ["Category:Legends articles", "Category:Corellian organizations", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Rogue CorSec"}, {"tag": "p", "text": "The Rogue CorSecs, also known as RogueSecs, were a criminal splinter group of the Corellian Security Forces on the Core world of Corellia during the time of the Galactic Civil War."}, {"tag": "p", "text": "During this time, the Rogue CorSecs were considered an ally of the Hidden Daggers, a pirate organization active in the Corellian system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime prior to the Battle of Yavin in 0 BBY, these disgraced ex-CorSec officers claimed the deserted island with the old CorSec base as their headquarters for thuggery, extortion and wanton violence. The Rogues also used the base's defense capacities to fight their former associates at CorSec, who were constantly hunting them."}, {"tag": "p", "text": "Sometime following 0 BBY, Twi'lek politician Karin Featherlight uploaded the coordinates of the Rogue CorSec base to a spacers datapad. A loyal CorSec agent, angered by their betrayal, also tasked a spacer with locating the base and enacting vengeance against the traitors."}, {"tag": "p", "text": "Circa 1 ABY, the Rogue CorSec commanders Hiram Bish and Mtara Vinram elaborated a plot to discredit the Diktat, Daclif Gallamby, and his government. As part of the plot, they created evidences that the Diktat himself was smuggling spice. To do so, the Rogue CorSec first recruited a gang of thugs known as the Ragtags to smuggle illegal spice in the Coronet Capitol building. Then, the Rogue CorSec managed to plant a remote relay device directly on the Diktat's personal data terminal. With this device, they were able to send files from a remote location and make them appear as originating from the terminal to which the device was attached. The Rogue CorSec thus planted orders, apparently from the Diktat himself, instructing the Ragtags to smuggle spice into the Capitol."}, {"tag": "p", "text": "The plan was foiled because the Ragtags made a mistake and also smuggled in the Capitol a shipment of starship components stolen from the businessman Ral Mundi. A spacer was recruited by CorSec Lieutenant Mack Jasper to investigate the missing shipment. The spacer discovered that the shipment was stolen by the Ragtags and transported into the Capitol, along with the smuggled spice. Further evidence were found when an informant contacted Brantlee Spondoon, the aide to the Diktat, to discuss a plot targeting the Diktat. Even if the Rogue CorSec managed to assassinate the informant in a Coronet warehouse, the spacer discovered the Rogue CorSec implication. The spacer also learned from another informant named Jonset that the Rogues were working with the Ragtags. Lieutenant Jasper then ordered to search the Diktat's office and the spacer found the remote relay device. A gadget specialist easily identified the device and helped Lieutenant Jasper to find the origin of the transmission. The spacer tracked the signal to the Rogue CorSec Base and infiltrated the base. The spacer downloaded proof of the Diktat's innocence and finally killed the Rogue CorSec commanders responsible for the plot."}, {"tag": "p", "text": "The same year, a group of Rogue CorSec miscreants led by Xyrias Undea was present in Doaba Guerfel. They harassed Gwhirrye Baric, a small-time thug, until they were stopped by a CorSec agent working for Captain Vitala Baize."}, {"tag": "p", "text": "Later, two Rogue CorSec officers, Erinn Bonette and Echdo Bervekk, worked with another criminal, the Meatlump lieutenant Kaiya Merel. Merel dispatched a new Meatlump recruit to help them hijack a shuttle. However, the Meatlump recruit was in fact a spacer working for the Corellia Times reporter Vani Korr who was investigating the Meatlumps. The spacer met the two Rogue CorSec officers and killed them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rogue CorSecs were a faction in the 2003 massively multiplayer online role-playing game Star Wars Galaxies: An Empire Divided, prior to the game's closure on December 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}