{"url": "Rogue_Doctrine", "categories": ["Category:Legends articles", "Category:Airspeeder tactics", "Category:Alliance to Restore the Republic"], "nodes": [{"tag": "h1", "text": "Rogue Doctrine"}, {"tag": "p", "text": "Rogue Doctrine was the plan of attack designed by Luke Skywalker and Rebel Alliance tactician Beryl Chiffonage, with help from Risiev Credal, for use by the T-47 airspeeders stationed at Echo Base on the planet Hoth."}, {"tag": "h2", "text": "The plan"}, {"tag": "p", "text": "Skywalker and Chiffonage knew they would be facing Imperial walkers in the coming battle after the location Echo Base was discovered by the Empire. To that end, they developed three tactics to face the invading force of AT-AT walkers while attempting to buy time for the base's transports to escape."}, {"tag": "h3", "text": "Attack Pattern Delta"}, {"tag": "p", "text": "This tactic involved a group of snowspeeders attacking an AT-AT in a single-file formation in order to give the enemy gunners a single target. After reaching optimal firing range, the lead speeder would fire before breaking off. With the AT-AT only able to track one target at a time, the remaining speeders would have a clear shot at the walker before parting in different directions."}, {"tag": "h3", "text": "Bantha Decoy"}, {"tag": "p", "text": "The second tactic was a variant of a trick used by Skywalker to target banthas in his T-16 skyhopper on Tatooine. Two speeders would approach a walker from behind while flanking it. The lead speeder would cut across the walker's line of sight to draw its fire, while simultaneously veering across the second speeder's flight vector. This would expose the vulnerable neck of the AT-AT to the second speeder, creating a perfect opportunity to attack."}, {"tag": "h3", "text": "Harpoons and tow cables"}, {"tag": "p", "text": "While an AT-AT was a vicious monster of destruction, it was still a mere machine. Using the harpoons and tow cables of the T-47 to entangle the walker's legs, the giant could effectively be tripped, bringing its own weight crashing down upon itself. This third plan of attack worked most effectively during the Battle of Hoth. Several AT-ATs were brought down using this method."}, {"tag": "h2", "text": "Sources"}]}