{"url": "Rogue_Planet", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "Rogue Planet"}, {"tag": "p", "text": "Rogue Planet is a Legends novel written by Greg Bear. It is set in 29 BBY, and it follows Anakin Skywalker and Obi-Wan Kenobi on a mission to Zonama Sekot. The novel was first published on May 2, 2000 by Del Rey."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "MASTER AND APPRENTICE."}, {"tag": "p", "text": "You've seen the movie The Phantom Menace. You've read the #1 New York Times bestselling book based on George Lucas's masterpiece. Now, before the eagerly awaited release of Episode II, comes a stunning new Star Wars novel from one of science fiction's greatest talents, a writer universally acclaimed for his keen grasp of cutting-edge science and the brilliance of his page-turning plots: multiple Hugo and Nebula Award-winning author Greg Bear. The result is pure adrenaline, an unforgettable journey stretching from the farthest reaches of known space to the battlefield of a young boy's heart, where a secret struggle is being waged that will decide the fate of billions."}, {"tag": "p", "text": "That boy is twelve-year-old Anakin Skywalker. The Force is strong in Anakin…so strong that the Jedi Council, despite misgivings, entrusted the young Jedi Knight Obi-Wan Kenobi with the mission of training him to become a Jedi Knight. Obi-Wan, like his slain Master, Qui-Gon, believes Anakin may be the chosen one, the Jedi destined to bring balance to the Force. But first Obi-Wan must help his undisciplined, idealistic apprentice, who still bears the scars of slavery, find his own balance."}, {"tag": "p", "text": "Dispatched to the mysterious planet of Zonama Sekot, source of the fastest ships in the galaxy, Obi-Wan and Anakin are swept up in a swirl of deadly intrigue and betrayal. For there are others who covet the power such superfast ships could bring. Raith Sienar, a brilliant but unscrupulous weapons and ship designer, has the brains to decipher the Zonama Sekot ship design. Commander Wilhuff Tarkin has at his disposal the forces of the mighty Trade Federation with which to extract the secret. Together, they make a formidable foe, one a small and undeveloped planet can hardly hope to stand against."}, {"tag": "p", "text": "But as Tarkin's fleet strikes with all its brutal power, Obi-Wan and Anakin sense a disturbance in the Force unlike any they have encountered before. It seems there are more secrets on Zonama Sekot than meet the eye."}, {"tag": "p", "text": "The search for those secrets will threaten the bond between Obi-Wan and Anakin…and bring the troubled young apprentice face-to-face with his deepest fears—and his darkest destiny."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Twelve year old Anakin Skywalker is planning on participating in an illegal race in the garbage tunnels under Coruscant. Before the race starts, another contestant, a Blood Carver named Ke Daiv, tries to assassinate Anakin. Obi-Wan Kenobi rescues his young Padawan just in time and together they make their way out of the garbage pit. Afterwards, they return to the Jedi Temple to appear before the Council. Mace Windu, one of the four Jedi Masters present in the Council, heads up the inquisition. In the middle of the meeting Thracia Cho Leem comes in and helps Anakin convince the Council and Obi-Wan that what he needs is a mission. The mission Obi-Wan and Anakin are assigned to sends them to a very strange and mysterious planet in the Gardaji Rift by the name of Zonama Sekot. They are sent there to find Thracia's former apprentice, Vergere, whose last mission was on this planet, and also to purchase a Sekotan spacecraft. The ship that they take to Zonama Sekot, the Star Sea Flower, is the same ship Vergere had ridden about three years earlier when she began her mission. On both occasions, it was piloted by a male Priapulin, Charza Kwinn who had helped the Jedi for over a century."}, {"tag": "p", "text": "Meanwhile, Raith Sienar and Commander Wilhuff Tarkin of the Republic Outland Regions Security Force have been making plans. Tarkin helps Sienar become commander of the Admiral Korvin which carries three landing craft, one hundred Trade Federation troops, and over three thousand droids. Sienar is to use this ship, along with three smaller vessels, to conquer Zonama Sekot. Tarkin, after sending Sienar on his way, headed to Coruscant to support their effort politically."}, {"tag": "p", "text": "Before the Admiral Korvin arrived at Zonama Sekot, the Star Sea Flower comes out of hyperspace near its destination. Obi-Wan and Anakin get to view the beautiful dancing red and purple pinwheel made by the red giant and the white dwarf that dominated the skies of Zonama Sekot. The northern hemisphere of the planet is covered with unusual tree like foliage called boras, while the southern hemisphere is covered by a silvery cloud layer. The Star Sea Flower lands, as directed by the Orbital Control of Zonama Sekot, in the far north of the planet and the two Jedi disembark in a flurry of snow. Obi-Wan than orders Charza Kwinn to keep the Star Sea Flower nearby in case they need it for anything. Anakin and Obi-Wan are transported to a lush part of the planet located in the Middle Distance. They are greeted by Gann, a Ferroan, who explain to them a little about Zonama Sekot and the people that inhabit it and lead them to their quarters where they are to stay the night."}, {"tag": "p", "text": "The next morning Obi-Wan and Anakin meet Sheekla Farrs who inform them that they would meet their seed-partners today. She also tells them that the seed-partners come out of a Potentium. Anakin does not know anything about the belief of a Potentium, but Obi-Wan knows a little bit about it and wants to figure out why it is believed here. While they are talking, they travel to Far Distance in a gondola hanging underneath a large airship. When they arrive, they go through a ceremony at the end of which they enter a door in a massive stone which leads to a great, open spherical chamber. There they see thousands of living spike-covered balls above them around the edges of the chamber. The spikeballs (seed-partners) soon start falling down and Anakin (who was listening to the spikeballs through the Force) warns Obi-Wan \"This is going to be bad! But whatever you do, don't be afraid!\""}, {"tag": "p", "text": "When the great stone doors open Sheekla Farrs calls to Obi-Wan and Anakin. Obi-Wan gets up first with three spikeballs clinging to him. Anakin, however, is under a great mound of shed spikes and shells and Obi-Wan and Gann must help him up and carry him out. In all, Anakin has twelve seed-partners clinging to him; more than anyone had ever had, Farrs informs them. Soon Farrs and Gann remove the seed-partners that are clinging to Obi-Wan and Anakin and place each one each in a Lamina box. Farrs explains that three of the seed-partners, one of Obi-Wan's and two of Anakin's, had chosen a client before, but that the client did not stay long enough to grow a ship. Obi-Wan and Anakin are left alone to eat, but after only ten minutes Gann comes back in and informed them that before they can design and forge their ship they have to meet with the Magister who, he says, they would go to at his convenience."}, {"tag": "p", "text": "While the Admiral Korvin is still in hyperspace, Sienar orders a Baktoid E-5 battle droid to his room and replace its verbobrain with one of his own design so that it is now carrying his own programs. He does this in case Tarkin had ordered Ke Daiv to assassinate him. Once this is completed, he calls Ke Daiv to his quarters to find out a little more about him and to give him the order to take a smaller ship and get closer to Zonama Sekot to observe it. Then Sienar heads to the navigation deck of the Admiral Korvin and orders Captain Kett to load some programs of Sienar's own making into the ship manufactory and in all the Battle droids."}, {"tag": "p", "text": "Obi-Wan and Anakin are transported to the Magister in a Sekotan air transport. On the way they pass over a huge brown scar on the landscape that resembled a battle scar. When they arrive at the Magister's Palace they are greeted by a girl named Wind who says she is the Magister's daughter. The Magister seems to know his two clients are Jedi, but he tells them they can continue making their ship and then he leaves them. Both Anakin and Obi-Wan feels that something is not right but neither of them can quite figure it out."}, {"tag": "p", "text": "That night the two Jedi don't get much sleep because of their seed-partners who they must sleep with. They put up with it, however, and the next morning they are each given a red and black client robe and access to the library. Soon they are transported to Shappa Farrs's designing shop where they set about drafting and designing their ship. Later, after they have finished the designing process, they are transported again this time on their way to forge their ship. On the way Anakin meets a girl who looks like the Magister's daughter they had seen but was much more real. She says her name is Jabitha Hal and that she is indeed the Magister's daughter but that she had not seen the young Padawan before. She explains that her father often put holograms of her in different places so that's how Anakin must have seen her. Then she continues to tell him about the different kinds of boras and how they work in the wild. Eventually the gondola lands and they disembark, ready to begin the next leg of their journey."}, {"tag": "p", "text": "Ke Daiv, back from his scouting expedition, makes his report to Raith Sienar. He says they had made their way in pretty close to the planet and back out without being scanned and then he proceeds to tell Sienar all he had observed. When Ke Daiv is finished, Sienar tells him of his plan to get a Sekotan spacecraft and sends him down in an indiscreet starship to carry out the plan. Soon Sienar receives the message from Ke Daiv that he has landed his ship on the northern plateau and that he is awaiting transport to Middle Distance. After this news, Sienar is sure positive he is going to overtake Zonama Sekot very soon."}, {"tag": "p", "text": "Obi-Wan and Anakin find that they do have farther to go before they forge their ship. Together with Jabitha and Gann they descend steep steps to a cavern with a low ceiling. After twenty minutes of walking, they reach an underground river and board a boat on which they travel downstream for several hours. Finally, they dock and disembark and after a long climb they reach the head of the factory valley. There Gann and Jabitha left them. Soon their forgers arrived riding Carapods. The leader of the forgers, Vagno, take their seed-partners and put them on the back of a carapod and then they head to the forging pits."}, {"tag": "p", "text": "Again, Sienar receives a message from Ke Daiv but this time it is not good news. Ke Daiv had been rejected because the seed-partners had taken a dislike to him. Sienar decides to give Ke Daiv one more day. Tarkin had also sent a message communicating his impatience, so Sienar also decides he might have to resort to force soon. Sienar sends Tarkin a false message in reply that he is sure would have Tarkin running in as fast as he can, but he will take a few days to get to Zonama Sekot."}, {"tag": "p", "text": "Anakin and Obi-Wan watch as Vagno and his crew toss the seed-partners into a deep pit and dump boras foliage and branches on them. Then the forgers pour red pellets on top of that and after a rather mysterious ceremony, orange bolts of lightning tumble down into the pit and soon after the seeds pop. Finally, they are ready to gather the seeds out of the pit."}, {"tag": "p", "text": "Obi-Wan and Anakin are again transported; this time on the backs of carapods to the shapers. The chief of the shapers, Vidge, place pieces of a special fruit on each of the white seed-disks that the seed-partners had made when they exploded. When this is done Vidge tells Obi-Wan and Anakin to each sit in one of the frames that would make their ship as they travel to the Jentari. When they reach the Jentari the seed-disks are slapped around the frames and began to grow, mold, and join until the ship is almost finished and just need a few minor things."}, {"tag": "p", "text": "Raith Sienar's E-5 battle droid that he had loaded his programs into is vibrating and having trouble even standing up. Sienar cannot find out what is wrong with the droid but Captain Kett says that five other battle droids had unexpectedly departed, and he had to lock down the other droids so that they could not do anything similar. Sienar orders a sweep of the entire system with active sensors and then he sets about trying to figure out why the droids had malfunctioned."}, {"tag": "p", "text": "By the time the new Sekotan starship makes it to the end of the factory valley it is early morning. Workers helped Anakin and Obi-Wan out of their new ship. One of the workers, Fitch, informs them that in the next couple of hours the workers will add a few things to the ship to bring it up to Republic standards and then they will work on learning the ship. But before the ship is finished Shappa, Sheekla, Gann, and Jabitha arrive with news that there are four fighters coming in. Before they can even decide what to do about it, starfighters arrive and start shooting at them. Obi-Wan is disabled while trying to protect his Padawan and separated from him. Anakin is confronted by the Blood Carver who threw him in the ship and climbed in after him. Jabitha had hid in the ship and is discovered by the Blood Carver who tosses her in the back seat. The Blood Carver orders Anakin to fly under the threat of killing Jabitha."}, {"tag": "p", "text": "Raith Sienar watches Tarkin arrive with two converted midsized Hoersch-Kessel Drive, Inc. cargo haulers and ten Corellian Engineering light cruisers. Sienar had figured out that Tarkin had hidden a code in the battle droids so that when he activates it the droids will do what he wants. Captain Kett informs Sienar that Tarkin's orders are to put Sienar under arrest and that Tarkin now controls the Admiral Korvin. Sienar heads back to his quarters to await Tarkin there but on the way he is confronted by Republic troops who made a path for Tarkin to reach Sienar. Tarkin takes Sienar to his own ship to talk with him."}, {"tag": "p", "text": "Obi-Wan is badly hurt, but not too badly for a Jedi Knight. Shappa tells him that Sheekla was injured and that Gann was in shock, so Shappa would help the Jedi however he could. Obi-Wan asks for a spacecraft to follow Anakin. Shappa says he wills fly Obi-Wan in his own ship. While they are chasing Anakin, Obi-Wan tells Shappa why they are here and in return Shappa tells Obi-Wan all he knows about Vergere. Obi-Wan then establishes a com-link channel with the Star Sea Flower so he can ask Charza Kwinn for help."}, {"tag": "p", "text": "Tarkin tells Sienar he has already given orders to invade the planet. While this is happening they both watch the race between three ships, two they do not recognize and a YZ-1150. They also observe as many spacecraft rise from the Sekotan jungles. Tarkin then orders Captain Mignay of the Rim Merchant Einem to release the first rank of starfighters."}, {"tag": "p", "text": "Anakin flies his new ship with ease. It would have been a joyful moment if Obi-Wan was with him. As easy as it is to fly, he has a hard time concentrating because a misting ghost kept floating around the cabin of the ship. Then the wraith takes on form, but Anakin takes his hands off the controls of the ship and it disappears. While his hands are up there, he tries a bit of Jedi persuasion and is doing pretty good when Ke Daiv notices the ships that are following them and tenses up. He orders Anakin to go faster to the Magister's mountain. When Anakin puts his hands back on the controls the image appears again, this time crystalline, and Anakin now recognizes her as Vergere. She had left a message in the seed-partners and they are now delivering it to Anakin. At the end of it, Anakin realizes he must defeat Ke Daiv and anyone else who tried to stop him; the life of the Jedi is at stake."}, {"tag": "p", "text": "Shappa recognizes the sky-mines above them as Republic vessels and thinks maybe Obi-Wan does not know something after all. But Obi-Wan is just as troubled about why they would be here. Shappa mentions the Potentium and Obi-Wan starts asking a few questions to try to finally get some answers. Shappa is reluctant to answer but eventually complies. Obi-Wan finds out that the original Magister had been given Jedi training and that his name had been Leor Hal. He also finds out that the people of Zonama Sekot had begun building weapons under the leadership of the second Magister. Obi-Wan now realizes that the Magister is dead and that what they had seen was just a holo-image, but Shappa will not accept this."}, {"tag": "p", "text": "Anakin brings his ship in a low arc around the mountain, but he does not see the Magister's palace. Anakin circles again and again, higher this time. The third time both he and Ke Daiv sees sky-miners above them. Anakin tells Ke Daiv that they will have to land somewhere to avoid them. Jabitha, desperate in her need to find her father, points out the ruins of a huge complex of buildings buried under a massive landslide. Anakin put down on a little portion of the old landing field next to the ruins."}, {"tag": "p", "text": "Shappa is forced to put down his ship about one-hundred kilometers form the Magister's mountain because of the sky-mines. Obi-Wan is becoming increasingly troubled; he sees though the Force that Anakin's future is mixed in a big knot with so many other futures in the next few hours. Everything depends on his Padawan."}, {"tag": "p", "text": "Jabitha, having a hard time breathing because of the altitude, enters a small door in the rubble. Ke Daiv motions for Anakin to go in after her, but he refuses. He is trying to control the banked anger that threatens to spill over and fill him. His eyes turn pitch-black and he cries out to anyone who will listen “Stop it, please! I can't hold it back any longer!”"}, {"tag": "p", "text": "Tarkin is surprised; Zonama Sekot had many more ships than he had thought. Tarkin was sure all the Sekotan ships would soon be destroyed anyway, but he is troubled by another thing. Rectangular bulges in the jungle that they had noticed earlier had begun to rise out of the ground. As he is observing this, he also sees a beautiful Sekotan ship, different from any of the others. He orders all sky mines away from the mountain and instead to go against the YT-1150. He is determined to capture the abandoned ship on the mountain."}, {"tag": "p", "text": "Shappa and Obi-Wan, still pinned down, watch through the ships sensors as the sky-mines abandon the Magister's mountain and go after the Star Sea Flower. They decide that they will attempt a rescue of Anakin and Jabitha."}, {"tag": "p", "text": "Jabitha watches as Ke Daiv emerges from the shadow in which he and Anakin had fought. She looks at him and shrieks. His eyes are white and he is bleeding profusely. She calls Anakin and the young sand-haired boy also emerges from the shadow. When Ke Daiv sees the Padawan he falls to his knees. Anakin hopes that Ke Daiv is not dying; he does not want to kill him this way. Jabitha leaves to find her father, but Anakin stays with the Blood Carver as he slowly dies. Then the boy who had killed him rises, turns around, and screams."}, {"tag": "p", "text": "Anakin knows he needs to get Jabitha to safety before he can wrestle with what had just happened. He enters the small door that Jabitha had entered a little while before. He makes his way down the dark corridor inside until he ends up in the chamber where he and Obi-Wan had first met the Magister. While he is going there the ceiling shudders and rocks starts falling. Jabitha is on her knees beside one of the piles of rubble in the circular chamber under the pile of rubble the Magister is buried. Again, Anakin sees a vision of Vergere appear, but then she turns into the Magister. Anakin puts Jabitha asleep using the Force and then asks the image who he is. It replies \"A friend of Vergere. I think my name, to some, is Sekot.\""}, {"tag": "p", "text": "Anakin and Sekot talk for a while and Anakin learns more about Zonama Sekot. When the roof of the chamber starts falling in Sekot shores up the hallways as Anakin carries Jabitha out. As they exit the last door Jabitha wakes up and sees a sky-mine delivery ship land beside them. A bulky soldier pulls Anakin away from Jabitha though he tries to stay with her. An officer tells Anakin that his name is Tarkin and they enter the ship just as Jabitha cries out. Anakin is brought to the bay where his ship had been hoisted and leaves there with some guards."}, {"tag": "p", "text": "Shappa maneuvers his ship well and soon they are at the mountain. Shappa lands and Obi-Wan jumps out, drops a kicking and screaming Jabitha in through the hatch and tells Shappa to leave him there. Shappa hesitates but leaves him and Obi-Wan prepares to fight the incoming starfighters. Before the fight starts Obi-Wan investigates the Blood Carver's body; something about it troubles him but he has no time to contemplate it. The starfighters had just started firing, one of them hitting Ke Daiv, when out of nowhere the Star Sea Flower comes in and destroys the two starfighters before they can even think of retaliating. Then Charza Kwinn directs his old YT-1150 to land beside Obi-Wan and soon the Jedi is in the cabin with Charza. \"They have your Padawan,\" The Priapulin informs him, \"Sit down and buckle up.\""}, {"tag": "p", "text": "Tarkin is beside himself with pride, but his enthusiasm is banked when he sees that Zonama Sekot is still not subdued. He decides to interview the boy before they dock with the Rim Merchant Einem When he goes in and tries to talk with Anakin the young boy refuses to help him. When Tarkin touches Anakin's shoulder his hand is burnt. Suddenly alarms ring out around the ship. The bay doors break through and when the air pressure drops Tarkin and Sienar leaves without a thought of the boy. Through the smoke and hot metal Anakin sees a hooded figure reflecting laser fire from the guards with a brilliant green lightsaber. Anakin cries out with joy but there is no time and he sets to work getting their ship ready to leave. They have three minutes before a delay bomb that Charza Kwinn had put on the bay doors went off. In those minutes they had to load their ship up with fuel."}, {"tag": "p", "text": "Obi-Wan jumps in their Sekotan ship seconds before the explosion that propelled their ship out of the doors. The ship makes it out with only a couple scrapes which quickly heal themselves. The path through space to Zonama Sekot's atmosphere is dangerous and filled with mines but Anakin makes it to the upper layers of the atmosphere and on the way he tells his Master about everything that had happened since they had been separated, especially about Sekot and Vergere's message."}, {"tag": "p", "text": "Tarkin, who had escaped in an escape pod with Sienar, is purple with rage. He orders the captain of the Einem to destroy the cargo ship, all that remains on the planet, and Obi-Wan and Anakin. Soon the two Jedi find themselves surrounded by sky mines and starfighters and they decide they would have to go lower into the factory valley. Then the ship, which was connected to Sekot, tells them that if they don't want to go with the people of Zonama Sekot then they better find some way to get into a solar orbit, and fast. Obi-Wan tells Anakin to do his best at getting them into free space and Anakin, expecting to die at any moment, drives them straight through the boiling atmosphere full of debris and flaming fuel."}, {"tag": "p", "text": "They break through the atmosphere's outer edges but starfighters are still pursuing them until Charza Kwinn pushes up from behind them and lure most of the fighters away. Then the Einem hits them with a concentrated bolt of turbolaser fire. It catches their ship broadside and Anakin feels the ship's scream of pain. While Anakin is still lost in the pain the ship felt, Obi-Wan sees huge engines flare to life on Zonama Sekot; pushing the planet out of its orbit. All the ships around her are having a hard time compensating and are running into each other. \"She's leaving!\" Obi-Wan cries and indeed the planet of Zonama Sekot disappears into hyperspace with only a faint, far-reaching tendril of farewell lingering behind."}, {"tag": "p", "text": "Anakin and the ship work together to take themselves into hyperspace; the ship teaching him how to navigate the dimensions of space and he is giving all the skills he possessed in return."}, {"tag": "p", "text": "The ship is giving all it had but it would not be able to get them to their destination; Its injures were too great. While Anakin is sleeping, Obi-Wan finds a closer station, on the planet of Seline, that Jedi sometimes use. He set its coordinates as their new destination and the ship's display affirms that they could make it there. Obi-Wan also sends out a message to the Jedi Temple asking Mace Windu or Tharacia Cho Leem to meet them at the outpost to council Anakin."}, {"tag": "p", "text": "When Anakin wakes up, he tells Obi-Wan he is going to give their ship a name; the Jabitha. Then Anakin asks, \"Our ship is dying, isn't she?\" \"Yes\" Obi-Wan replies. Anakin's face goes blank and Obi-Wan thinks, \"The boy loses everything he loves, and yet still he is strong.\""}, {"tag": "p", "text": "The Jabitha, in a hangar on Seline, is rapidly losing its color as Anakin sits before it and watches. Thracia and Obi-Wan entered; Thracia approaches Anakin and starts her counseling and healing while Obi-Wan waits outside. \"Self-knowledge is the most difficult of our many journeys.”\" Thracia tells the apprentice before they start. He simply replies, \"I know.\""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Rogue Planet introduced several recurring Legends characters and locations, such as Raith Sienar, Vergere, and Zonama Sekot. Parts of the novel were adapted into the young readers book Anakin: Apprentice, which was written by Marc Cerasini and published in 2002."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}