{"url": "Rogue_Squadron", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:New Republic starfighter squadrons", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Rogue Squadron"}, {"tag": "p", "text": "Rogue Squadron, also referred to as Rogue Group, was a Rebel Alliance starfighter squadron founded by Luke Skywalker during the Galactic Civil War. They were named for Rogue One, the team of Rebels led by Jyn Erso who sacrificed themselves to steal the Death Star plans during the Battle of Scarif. The squadron was officially formed during the Galactic Empire's attack on the Mako-Ta Space Docks and fought in a number of engagements, including the Battle of Hoth."}, {"tag": "p", "text": "The squadron flew craft such as the T-47 airspeeders, T-65B X-wing starfighters, and occasionally BTL-A4 Y-wing assault starfighter/bombers when heavy ordnance was required."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early formation"}, {"tag": "p", "text": "When the Galactic Empire brought its Death Star superweapon to bear on the Rebel Alliance's base on the moon Yavin 4, the Rebel pilots of Red Squadron attacked the space station. Only two of the squadron's pilots—Luke Skywalker and Wedge Antilles—survived the Battle of Yavin, with Skywalker's proton torpedoes destroying the Death Star and winning the day."}, {"tag": "h3", "text": "Mako-Ta Space Docks"}, {"tag": "p", "text": "In 1 ABY, the Empire launched an attack on the Mako-Ta Space Docks. During the battle, Skywalker and Antilles impromptuly formed Rogue Squadron. In naming the squadron, Skywalker drew inspiration from Jyn Erso and her Rogue One team, who sacrificed themselves to steal the Death Star plans during the Battle of Scarif shortly before the Battle of Yavin. It was the sacrifice of Rogue One that allowed Skywalker and Antilles to fight in and ultimately survive the attack on the Death Star."}, {"tag": "p", "text": "To honor the actions of Erso and her squad, Skywalker decided the specific phrase \"Rogue One\" should be forever retired. While he served as Rogue Leader, the next pilot would be known by the callsign of Rogue Two instead of one."}, {"tag": "h3", "text": "After Mako-Ta Space Docks"}, {"tag": "p", "text": "To honor his actions in the battle and replenish the Alliance leadership with commanding officers, Mon Mothma promoted Skywalker to commander. Over time, Antilles became a respected veteran of the Alliance's Rogue Squadron. Another distinguished pilot in the squadron was Derek \"Hobbie\" Klivian."}, {"tag": "h3", "text": "Hoth"}, {"tag": "p", "text": "The Rebels later established Echo Base on the icy world of Hoth, and a number of Rebel pilots flew snowspeeders in Rogue Squadron, also known as Rogue Group. In 3 ABY, a month after Echo Base was established, Skywalker and Captain Han Solo went missing in the planet's vast snowbanks, however the T-47s weren't ready for Hoth's freezing conditions and temperature was dropping fast as light faded into night. It wasn't until first light that Rebel technicians had finally a figured out the coolant problem and gotten the speeders running. Within an hour, a dozen speeders were in the air, with Rogue Squadron splitting into groups of four to cover the search grid with maximum efficiency. Zev Senesca (Rogue Two) found them both alive. Echo Base was soon after discovered by an Imperial probe droid, and the Rogues were tasked with delaying an Imperial ground assault while Alliance transport ships fled the system."}, {"tag": "p", "text": "Skywalker flew as Rogue Leader in the Battle of Hoth against Imperial AT-AT walkers, with Dak Ralter serving as his rear gunner and Klivian flying as their wingman. Other Rogues in the battle included Senesca, as well as Antilles and Wes Janson as a pilot-gunner pair. When the AT-ATs' armor proved too strong for blasters, Skywalker suggested tripping the walkers' legs using harpoons and tow cables. A direct hit on his speeder killed Ralter, however, leaving the task of tripping the first AT-AT to Antilles and Janson. They succeeded, but Skywalker's vehicle was shot down and crushed by a walker's massive foot."}, {"tag": "p", "text": "Having escaped the wreckage, Skywalker continued the fight by using a grappling hook to ascend to one of the walkers' underbellies. Cutting it open with his lightsaber, he tossed a grenade inside, which exploded and took the AT-AT down. Klivian, meanwhile, rammed his craft into the lead walker, but only after that walker fulfilled its objective of destroying the base's shield generator. Imperial snowtroopers were thus able to enter the base. The delaying tactic proved a success, as a number of Alliance transports were able to escape the system."}, {"tag": "h3", "text": "Post-Hoth"}, {"tag": "p", "text": "Following the evacuation of Hoth, with Skywalker absent, as he had not reached the predetermined rendezvous point, Antilles was promoted to the rank of commander by The Contessa and given command of what was left of the squadron. Rather than continue with the Rogue Group name, Antilles decided to reform Red Squadron, with Janson as his newly appointed executive officer, and whoever they could recruit from the pilots at the rendezvous point."}, {"tag": "p", "text": "Later, Antilles continued to lead Rogue Squadron after Skywalker decided to take a leave of absence to focus on personal matters."}, {"tag": "h3", "text": "Post-Endor"}, {"tag": "p", "text": "Rogue Squadron served the New Republic after the Battle of Endor, with Antilles still as a member under the rank of captain. General Hera Syndulla kept Rogue Squadron busy, handling classified missions."}, {"tag": "h3", "text": "Battle above Yavin Prime"}, {"tag": "p", "text": "After the communications were re-established in the Bormea sector, Syndulla gave Antilles a temporary assignment to Project Starhawk, to steal an Imperial II-class Star Destroyer, a mission Antilles would normally have Rogue Squadron for. Instead, Antilles flew alongside Vanguard Squadron to steal the Imperial Star Destroyer Victorum that was in orbit over Yavin causing trouble for Talus Group."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rogue Group first appeared in the 1980 film Star Wars: Episode V The Empire Strikes Back as a snowspeeder squadron flying in the Battle of Hoth. They became a fabled unit known as Rogue Squadron within Star Wars Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "LEGO Star Wars: Droid Tales – \"Flight of the Falcon\""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}