{"url": "Rogue_Squadron/Legends", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Articles with conflicting sources", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:Galactic Alliance starfighter squadrons", "Category:New Republic starfighter squadrons", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Rogue Squadron"}, {"tag": "p", "text": "Rogue Squadron was a legendary starfighter squadron that flew for over 130 years. Originally a part of the Rebel Alliance, it later served the Alliance of Free Planets, New Republic, Galactic Federation of Free Alliances, and Galactic Alliance Remnant. Its roster routinely included some of the galaxy's best pilots, and its successes in battle gave the squadron an almost mythical presence that reassured galactic citizens someone was in space protecting them. The Rogues were important symbols to the different governments they served and a key part of public morale. Led by a pilot with the call sign Rogue Leader, the squadron flew various types of fighter craft throughout their history, usually a version of an X-wing starfighter, and they were assisted by astromech droids in the fighters' droid sockets."}, {"tag": "p", "text": "The Rogues were originally a smaller flight group known as Rogue Flight, formed by the Alliance's Commander Arhul Narra in 0 ABY from the remnants of Red Squadron following the Battle of Yavin. Luke Skywalker and Wedge Antilles led a core group of pilots on various missions, and the flight's members were a part of the Rogue Group that flew against the Galactic Empire in 3 ABY's Battle of Hoth. Antilles expanded the Rogues into a full twelve-person squadron after Hoth was evacuated, and they fought in the Battle of Endor one year later as Red Squadron, where Antilles helped destroy the Empire's Death Star II battlestation. As the group went on to serve the New Republic, it was disbanded for a year due to the amount of new recruits who were dying too soon after signing up."}, {"tag": "p", "text": "Rebuilt with a heavily-trained group of elite pilots in 6 ABY, Rogue Squadron played a key role in capturing the galactic capital world of Coruscant from the Empire, but its twelve members soon afterward resigned their commissions in order to pursue a private guerrilla war against the warlord Ysanne Isard. The operation was retroactively sanctioned by the New Republic, and the Rogues went on to fight for their government in such conflicts as the reborn Emperor Palpatine's assault on Calamari, the Orinda campaign, and a battle at Yaga Minor that brought the long Galactic Civil War to an end. When the extra-galactic Yuuzhan Vong invaded the galaxy in 25 ABY, Rogue Squadron were among the first defenders on the front lines."}, {"tag": "p", "text": "Although they suffered devastating losses against the unknown enemy, Rogue Squadron persevered and helped fight the tide of the invasion for four years under the command of Gavin Darklighter. They were among the few New Republic forces who took a stand at Borleias, and they flew in the decisive Battle of Yuuzhan'tar that finally defeated the invaders. Now a part of the Galactic Alliance, the Rogues took on the insectoid Killiks during the Swarm War and a unit called Rakehell Squadron in the Second Galactic Civil War. Loyalties had been blurred during the conflict, and Rakehell Leader Wedge Antilles shot down and killed Rogue Leader Lensi. Nearly 100 years later, Rogue Squadron were a part of the Galactic Alliance Remnant, and they fought the forces of Darth Krayt's Galactic Empire in such engagements as the Battle of Mon Calamari and a climactic strike at Krayt's Coruscant stronghold."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Rogue Squadron was a twelve-person starfighter squadron that, throughout its history, served the Rebel Alliance, Alliance of Free Planets, New Republic, Galactic Federation of Free Alliances, and Galactic Alliance Remnant. It was composed of the Alliance's top pilots, and later, the best pilots in the New Republic Defense Force. The Rogues were the symbol of the New Republic's starfighter superiority and its most effective tool against enemy aggression; their successes gave them an almost mythical presence in battle and could sometimes prompt an enemy to surrender without any shots being fired. As long as Rogue Squadron endured, the citizens of the New Republic had hope that there was someone in space protecting them. Still later, the Rogues became a symbol of the bravery and fighting spirit of the Galactic Alliance, and in 137 ABY, they were the most elite of all squadrons in the Galactic Alliance Remnant."}, {"tag": "p", "text": "Rogue Squadron was originally a flight group known as Rogue Flight, and was, along with Renegade Flight, formed from the remnants of the Rebel Alliance's Red Squadron following the Battle of Yavin in 0 BBY. The pilots of Rogue Flight, together with the pilots of Blue and Green Squadrons, flew as the ad hoc Rogue Group in the Battle of Hoth in 3 ABY, after which the Rogues became a full squadron, designed by Skywalker to operate without a set mission profile in order to take on any assignment that came their way. Throughout their history, the Rogues were led by a pilot designated Rogue Leader; some Rogue Leaders broke the squadron up into smaller flight groups of four starfighters a piece."}, {"tag": "p", "text": "For many years, the Rogues flew X-wing fighters, with astromech droids assisting them from the fighters' droid sockets, although missions occasionally called for them to pilot other craft such as Y-wings, A-wings, or T-47 airspeeders. The Rebel Alliance and the New Republic initially used the T-65 X-wing starfighter and later the upgraded T-65B model, with special red stripes for Rogue Squadron painted on, but in 11 ABY the squadron was reconfigured into a multi-fighter unit that included A-wings, E-wings, and B-wings. The Rogues were back in X-wings within the year, however. By 25 ABY, Rogue Squadron was flying in the new T-65 A3 X-wing, and in 40 ABY, the XJ7 model. Nearly 100 years later, the Rogues flew CF9 Crossfire starfighters."}, {"tag": "p", "text": "In the New Republic's early years, Rogue Squadron was so key to citizens' morale that when its members resigned their posts to wage the independent, guerrilla Bacta War against the warlord Ysanne Isard, the New Republic put together an ersatz Rogue Squadron to be visible while Antilles's Rogues were away. Two unique Rogue Squadrons existed simultaneously with each other, but after Isard's defeat, the New Republic retroactively deemed the Bacta War an officially sanctioned operation, and Rogue Squadron was once more whole."}, {"tag": "p", "text": "Rogue Squadron's crest featured a blue Alliance Starbird surrounded by a twelve-pointed red star, with an X-wing fighter at each of the star's points. It was designed by Rogue pilot Gavin Darklighter in 6.5 ABY. The Rogues began to use it before it was officially sanctioned by New Republic Starfighter Command, sporting it as a patch on their flight suits and having it painted on their X-wings."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rebel aces"}, {"tag": "h4", "text": "Origins"}, {"tag": "p", "text": "In the year 0 BBY, the Rebel Alliance cobbled together an ad hoc starfighter squadron composed of rebel pilots from such groups as the Ecliptic Evaders, the Dantooine Squadron, the Tierfon Yellow Aces, and the Griffon Flight Wing. The new group was known as Red Squadron, and its task was to destroy the Galactic Empire's massive Death Star battlestation, which was approaching the Alliance's base on the moon of Yavin 4. In T-65 X-wing starfighters, Garven Dreis flew as Red Leader, Wedge Antilles as Red Two, Biggs Darklighter as Red Three, John D. Branon as Red Four, Luke Skywalker as Red Five, Jek Tono Porkins as Red Six, Elyhek Rue as Red Seven, Bren Quersey as Red Eight, Nozzo Naytaan as Red Nine, Theron Nett as Red Ten, Wenton Chan as Red Eleven, and Puck Naeco as Red Twelve. Of the entire squadron, only Skywalker and Antilles survived the Battle of Yavin, with the former firing two proton torpedoes into the Death Star's thermal exhaust port and destroying the entire station."}, {"tag": "p", "text": "The Galactic Civil War continued, and Red Squadron was reconstituted as two different flight groups: Renegade Flight, led by Commander Arhul Narra, and Rogue Flight, led by Rogue Leader, Luke Skywalker. Wedge Antilles was his second-in-command. The latter flight group developed when Antilles was permanently assigned to Alliance High Command following the Rebels' Evacuation of Yavin. He was part of a core team of pilots that began to form under Skywalker, that flew, trained, and developed tactics together. Narra placed Skywalker in charge of the nascent Rogue Flight, which began to take form under Narra's wise tutelage. Its members included Wes Janson, a capable pilot and gunner who struck up a fast friendship with Antilles, and Derek \"Hobbie\" Klivian, who bonded with Skywalker over the loss of their mutual friend Biggs Darklighter.Skywalker and Antilles were surrounded by some of the best pilots in the galaxy."}, {"tag": "h4", "text": "Early missions"}, {"tag": "p", "text": "Although Rogue Flight was initially dismissed by Alliance Starfighter Command, they proved their effectiveness as a team that lived together and flew together during several skirmishes of the Alliance's evacuation of Thila. The planet was the site of the relocated Rebel headquarters, and when the Empire attacked, Antilles took a T-47 airspeeder into battle without realizing that the Wookiee Chewbacca was dangling from his fuselage. Flying close to the planet's surface, Antilles became aware of his stowaway and maneuvered close enough to a TIE fighter to allow the Wookiee to drop in on the Imperial pilot. The move allowed Chewbacca to successfully capture an enemy fighter, but Antilles was frightened enough of his surprise passenger's ire to make himself scarce upon returning to base."}, {"tag": "p", "text": "Six months after Yavin, Rogue Flight was composed of Skywalker, Antilles, Janson, Klivian, Dak Ralter, and Zev Senesca. On the planet Tatooine, Skywalker, Antilles, and one other Rogue took their X-wings for a stroll through Beggar's Canyon and came across Imperial probe droids firing on nearby moisture farms. After making short work of the machines, the Rogues hastened to the Mos Eisley spaceport to defend it from attacking TIE bombers. Their next mission took them to Barkhesh, where local resistance forces were set to donate supplies that were vital to the Rebel cause. After being briefed by the Alliance's General Rieekan, the Rogues escorted the dirtside supply convoy to a landing zone for a rendezvous with a Rebel shuttle, but the way there was beset by Imperial forces including AT-ST walkers, TIE bombers, and turbolaser batteries. Despite the opposition, the Rogues ensured that the handoff was a success."}, {"tag": "p", "text": "When the Rebel transport Nonnah crashed on the world of Chorax, Rieekan sent Rogue Flight to find the Alliance soldiers and their stolen Imperial equipment before the Empire could. Piloting A-wings above Chorax's surface, the Rogues were forced to deal with TIE interceptors until the target was located. When the crashed ship was found half-submerged in a lake, Rogue Flight fought off TIE bombers, as well as XR-85 tank droids, an AT-ST, and AT-PT walkers that were disgorged from an Imperial Sentinel-class landing craft. A Rebel shuttle was able to rescue the Nonnah's crew, and the Rogues defended it from one more interceptor squadron before leaving the planet. General Rieekan later received word that Crix Madine, an Imperial officer with information on the Empire's ground operations, wanted to defect to the Rebellion, and he traveled to Corellia to meet with him. Skywalker and two other Rogues patrolled the planet's Coronet City in T-47 airspeeders while Rieekan met with city officials inside the Coronet Capitol Tower."}, {"tag": "p", "text": "TIE bombers began pounding the tower, but the Rogues fought them off before receiving a message from Madine: the Technology Center where he was hiding was also under attack. Luckily for the Rogues, the Alliance's Han Solo, a native Corellian, and his First Mate Chewbacca soon arrived in their starship, the Millennium Falcon, to aid them. Further resistance came from Imperial amphibions, AT-STs, and one AT-AT, but Skywalker tripped the latter with his speeder's harpoon and tow cable while Rebel defense batteries helped hold off the rest. When Rebel shuttles rescued both Rieekan and Madine, the Alliance forces departed Corellia. The Rogues then began to work on a number of missions under the direction of Madine, including the liberation of Gerrard V from the oppression of Moff Kohl Seerdon. On that mission, they disabled the TIE interceptor of Lieutenant Kasan Moor, commander of the 128th TIE Interceptor Squadron. Moor took the opportunity to defect to the Alliance, and her inside knowledge proved vital as she flew with the Rogues in the Battle of the Jade Moon, a raid on Balmorra, and an assault on Kile II. Antilles was shot down during the Kile II assault, but the Rogues quickly rescued him and other Alliance POWs from Kessel."}, {"tag": "p", "text": "The pilots of Rogue Flight then put an end to Moff Seerdon's schemes on a number of worlds, flying in a battle above Taloraan, a mission to Fest, and a Blockade on Chandrila—while Seerdon invaded Chandrila, the Rogues escorted an armed hovertrain loaded with supplies to the besieged city of Nayli and several evacuation shuttles full of civilians away from it. They also took out Seerdon's TIE bombers and interceptors, thus saving the city. After raiding one of Seerdon's bases on Sullust, the Rogues had a final showdown with the Moff at Thyferra, which saw Seerdon finally perish. Other Rogue missions included escorting a convoy of transports through the Ison Corridor Rogue Flight also headed to Dantooine to rescue the Imperial pilot Tycho Celchu, a double agent whose spying for the Rebels had been discovered. Celchu eventually became a Rogue, and the pilots were later dispatched to the defense of Ralltiir to help cover the escape of scientists working for the Alliance. Since the evacuation of Yavin, the Rogues' Lieutenant Sarkli had caused tension among he and his fellow pilots, believing he was not getting the credit he deserved. At Ralltiir, Sarkli decided he had enough and joined the Empire."}, {"tag": "p", "text": "The Rebel Alliance temporarily returned to Yavin IV, and when a shipment of metal from the planet Vactooine failed to arrive, Skywalker felt that something was amiss. Alongside Solo, Chewbacca, Leia Organa, and the droids C-3PO, R2-D2, and Q-7N, he took the Millennium Falcon to Vactooine to investigate, with Antilles and three other Rogues escorting the group in their X-wings. Upon their reversion to realspace, they were attacked by a lone Imperial Lambda-class shuttle, which launched a concussion missile that detonated and produced a shockwave. Power was knocked out of all of the Rebel ships save for one, which engaged in further battle with the Lambda and was forced to crash-land onto Vactooine's surface. There, its pilot learned of a droid army led by the criminal Olag Greck that had commandeered the Imperial Star Destroyer Decimator. Teaming up with Boonda the Hutt, the former owner of the droids, the Rebel infiltrated a local mining colony and convinced Greck's army to turn against him. The Decimator was then gifted to the Alliance by Boonda and the mining colony's workers."}, {"tag": "p", "text": "In search of a new Rebel base, General Jan Dodonna dispatched Rogue Flight to Kwenn Space Station to search for tips on seldom-used hyperlanes. The Rogues made the trip without Skywalker, who was still on assignment aboard the Falcon, and on arrival they were dismayed to learn that a number of the station's outbound trade routes through the Outer Rim had been altered by the Empire. Splitting up from their fellow pilots, Antilles, Janson, and Celchu disguised themselves as traders and observed an Action VI transport get seized by stormtroopers; Antilles contacted Leia Organa via message droid to request backup before proceeding to investigate. After taking care of a stormtrooper problem, the three left the hangar and headed to a shopping complex, but the sight of more troopers prompted the trio to dissolve. Two of the Rogues fled while one stayed behind to distract the Imperials, and after a short tussle, he escaped by swimming through an aquarium."}, {"tag": "p", "text": "Making his way to the detention cells, he got past a K4 security droid and an interrogation droid in order to rescue the crew of the freighter, the Stellar Manx. Captain Kar Lamoran and her crew helped the Rogue defeat two suddenly-arriving stormtroopers before he sent them to Rogue Flight's docking bay, but Lamoran was determined to reclaim her ship and met up with the Rogue back at the hangar, which he had reached through the system's air vents. She helped him dispose of more stormtroopers, and when the freighter suddenly took off, the Rogue followed it in an emergency vehicle and boarded it. On the ship, he overheard Imperial soldiers mention that the Empire's Darth Vader had ordered them to take it to the planet Bonadan, but he was able to neutralize them all and take control of the freighter. The Rogue's final challenge was a suspicious ASP-7 labor droid that had been left aboard the freighter, which he overcame before safely bringing the ship back aboard the space station and rendezvousing with the arriving Millennium Falcon, which had received Antilles's message. Worried by Vader's plans, Solo, Organa, and Skywalker decided to dress as Imperials and take the freighter to Bonadan themselves."}, {"tag": "p", "text": "When Governor Bidor Ferrouz of the Candoras sector, a region of space near the Unknown Regions, offered to provide a base for the Alliance in exchange for protection from the alien warlord Nuso Esva, two Rebel teams were organized to go investigate. While Skywalker joined an expedition to the sector's capital, Poln Major, Rogue Flight went to Poln Minor under the command of Colonel Airen Cracken. After touching down, Antilles and two other Rogues were called on to pilot their X-wings through the world's underground tunnels to intercept Organa and Solo, who were being pursued by enemy landspeeders. Although the speeders eluded the Rogues, the trio escorted their charges back to Cracken's base camp, and Organa deduced where they could locate a cavern full of Nuso Esva's warships—Esva had in fact kidnapped Governor Ferrouz's family and forced him to make contact with the Alliance, and the group realized they had to take out the warlord's ships in order to have any hope of escape. A plan was thus made for Rogue Flight to attack the warships in T-47 airspeeders, which were small and maneuverable enough to make it through the constricting tunnels that led to their targets."}, {"tag": "p", "text": "The Rogues flew with an Alliance armada in battle with Nuso Esva's navy, and for a mission to set up a listening post on Lubang Minor, three Rogues—Skywalker, Antilles, and Senesca—flew under Commander Narra as Red Squadron. There, they rescued Able, an aged clone trooper left abandoned on the planet during the Clone Wars. Antilles and Klivian later escorted a diplomatic party of Rebels to Jabiim after the Jabiimi Loyalists requested Alliance aid in their fight against Imperial control of their planet. The two Rogues' X-wings remained in orbit, but they were soon ordered out of the system by the Loyalists, who were furious with one of the diplomats: Luke Skywalker."}, {"tag": "p", "text": "TIE fighters aligned with the Imperial Jabiimi Nationalists suddenly arrived, but the Rogues elected not to attack them in an effort to maintain diplomacy. When the TIEs were followed by an Imperial fleet, Antilles and Klivian decided to rescue their comrades, diplomacy be damned. After outrunning the fleet of slave ships, they made it to the surface of Jabiim in time to save the Rebels Leia Organa and Nera Dantels from a group of TIEs. Although Organa did not want to abandon the Jabiimi Loyalists, Antilles insisted that they flee from the encroaching Imperial fleet. Before departing, they rescued Skywalker and Loyalist leader Nolan Gillmunn from the Nationalists, with Antilles's and Klivian's X-wings blasting their way into an Imperial Army garrison. On their way out of atmosphere, the two Rogues held off TIE fighters, allowing themselves and Dantels's Starduster to jump to lightspeed."}, {"tag": "h4", "text": "Fire and ice"}, {"tag": "p", "text": "In 3 ABY, the Alliance had set up the secret Echo Base on the icy world of Hoth. While escorting a convoy of supplies and reinforcements to Hoth from Derra IV, Renegade Flight was attacked and destroyed along with the entire convoy, and when word reached Echo Base, General Rieekan promoted Skywalker to Commander as a replacement for the fallen Narra. With the Renegades gone, Skywalker and Antilles decided to expand Rogue Flight into a full-fledged squadron that would serve Rebel High Command. The two pored over lists of pilots until a wampa attack forced Skywalker and Captain Han Solo to spend a night out in the cold; Rogue Flight took to snowspeeders the next morning to search for them in the fields of snow. The missing Rebels were found by Rogue Two, Zev Senesca."}, {"tag": "p", "text": "Shortly after the rescue, base sensors detected a nearby metallic presence, and Rieekan dispatched Rogues Ten and Eleven to Echo Station 3-8 to investigate. Their progress was tracked by the presence, in fact an Imperial probe droid, but the droid was destroyed by Captain Solo and Chewbacca, who were investigating on foot. Certain that the Empire had discovered the base, Rieekan ordered a full evacuation. Preparations were made for an Imperial ground assault, as the Rebels' shield generator protected them from an orbital bombardment, and an ad hoc snowspeeder unit was created out of Rogue Flight, Blue Squadron, and Green Squadron; the twenty-three person strong \"Rogue Group\" was made up of twelve pilots and eleven gunners. Dak Ralter served as Rogue Leader Skywalker's gunner, while Kit Valent joined Senesca in Rogue Two. Antilles and Janson flew as Rogue Three, Klivian and Kesin Ommis as Rogue Four, Celchu and Tarn Mison as Rogue Five, Samoc Farr and Vigrat Pomoner as Rogue Six, Nala Hetsime and Cinda Tarheel as Rogue Seven, Vekozev Kabir and Stax Mullawny as Rogue Eight, Stevan Makintay and Barlon Hightower as Rogue Nine, Tarrin Datch and Hosh Hune as Rogue Ten, Tenk Lenso and Jek Pugilio as Rogue Eleven, and the mercenary Dash Rendar flying solo as Rogue Twelve. Delivering foodstuff to Echo Base when its shield went up, Rendar found himself piloting a snowspeeder while waiting for the chance to leave the planet."}, {"tag": "p", "text": "The Rogues flew into the Battle of Hoth against the AT-AT walkers of the Empire's Blizzard Force, tasked with delaying the ground assault while a groundside ion cannon aided Rebel transports in escaping the system. When the snowspeeders' laser cannons proved ineffective against the walkers' armor, Skywalker suggested tripping the AT-ATs' legs with harpoons and tow cables, the final tactic of his experimental Rogue Doctrine. An enemy laser blast killed Ralter, his gunner, but Antilles and Janson were able to take down Blizzard 2. Another hit on his speeder forced Skywalker into a crash landing, and command of Rogue Group was given over to Antilles by both Skywalker and by Rieekan. Other Rogues were not as lucky as their leader—Senesca, Valent, Pomoner, Kabir, Mullawny, Hune, Lenso, and Pugilio were all killed when their speeders were shot down. Farr and Datch survived being shot down, however, and Klivian and Ommis survived taking out the lead walker of the Empire's General Veers with a suicide run. Antilles and Janson abandoned their snowspeeder after taking a hit and losing their starboard stabilizer."}, {"tag": "p", "text": "Following his crash, Skywalker ascended a magnetic grapple and cut into the AT-AT Blizzard 4 with his lightsaber. A lobbed concussion grenade knocked the walker down, and another walker was destroyed by Rendar in Rogue Twelve. Blizzard Force was ultimately successful in their mission to destroy the shield generator, and the surviving Rogues took to the skies in starfighters to protect fleeing Rebel transports. When Antilles found a Star Destroyer blocking the escape lane of a transport being piloted by Datch, he took his X-wing in close behind Klivian and Janson's Y-wing. He then pulled away in a Tallon split, confusing the warship's targeting batteries and giving himself enough time to destroy one of its sensor globes. Datch's ship made it to hyperspace—thirteen of thirty Rebel transports escaped in all, with the other seventeen destroyed or captured by the Empire. Antilles was promoted to commander to fill the gap left by the loss of Renegade Flight, and he assumed command of the Rogues while Skywalker traveled to the planet Dagobah to train as a Jedi under the mysterious Master Yoda."}, {"tag": "h4", "text": "A complete squadron"}, {"tag": "p", "text": "The loss of so many Rogues at Hoth was felt heavily by the survivors, and a plaque to the fallen Rogues and Renegades was hung on the command deck of the Rebel frigate Chancellor. Antilles expanded the Rogues into a full squadron: Rogue Squadron. Although they were an escort squadron for the main Alliance Fleet, Skywalker designed them to be a unit without a set mission profile, able to take on any mission that came their way. Stationed aboard the MC80 Star Cruiser Home One, the Rogues acted as a rapid response team that could transfer to hot spots as needed. The squadron was composed of the Alliance's twelve best pilots who had survived its fiercest battles against the Empire, and its pilots were famed for their ability to fly nearly anything. Antilles led the Rogues, but Skywalker sometimes still served with them, taking the call sign of Rogue Leader while Antilles flew as Rogue One. Other squadron members included Rogue Two Will Scotian, whom Antilles recruited due to his fine combat record at Oracle Base; Rogue Five Dix Rivan, who acted as the Rogues' rear guard; and Wes Janson as Rogue Six. Barlon Hightower also formally joined Rogue Squadron at some point following the evacuation."}, {"tag": "p", "text": "After Hoth, the Alliance Fleet rendezvoused outside the rim of the inhabited galaxy. Skywalker was a latecomer following his Jedi training and a duel with Darth Vader on Bespin's Cloud City, and several hours after his arrival an Imperial strike cruiser appeared. Rogue Squadron moved to intercept in an effort to keep the cruiser from escaping and revealing the Rebel fleet's location. They destroyed several TIE fighters, with only Rogue Three taking damage to his engines, and the cruiser diverted power to its rear shields while attempting a getaway. Rivan swooped in and fired on the cruiser's front side, however, blowing it to pieces. Rebel jamming had prevented the enemy vessel from transmitting its coordinates, and the fleet's location remained safe, but the Alliance altered course as a precaution anyway and remained on the move over the next few months."}, {"tag": "p", "text": "Antilles led the Rogues in dangerous missions to rescue prisoners from an Imperial installation at the Maw. Karie Neth was one of the prisoners, and she joined Rogue Squadron as a replacement for a Bothan pilot who had been lost during a secret mission. Keir Santage was another rescued prisoner who joined the Rogues; Kin Kian and Gemmer Sojan were also members of the squadron around that time. The Rogues next rescued prisoners from a prison orbiting Bakura, but several scientist prisoners were taken by the Empire from Bakura to Geonosis, where the squadron encountered former Rogue Sarkli. Antilles shot down the defector's gunship, but Sarkli survived the crash and swore revenge. The squadron then joined a task force under Rebel General Crix Madine and were sent to Destrillion to destroy an Imperial tibanna gas facility, but no such facility was found. After taking out Tie Hunters, the task force passed by neighboring Dubrillion while preparing to leave the system, and the Empire sprung their trap with a superlaser facility that sat on Dubrillion's surface. In the ensuing battle, Antilles commandeered an Imperial AT-ST and personally took out the superlaser facility. Later on, the Rogues led a Fondor shipyard assault and destroyed a prototype Super Star Destroyer."}, {"tag": "p", "text": "At some point in the first half of 3 ABY, young Rebel Shira Brie was drafted into Rogue Squadron and flew with Skywalker on a mission to Cloud City. Former Baron Administrator of the city and fellow Rebel Lando Calrissian had been sent there from the Alliance's Haven Base on the world of Arbra, and when he failed to report in, Skywalker and Brie decided to investigate. When they landed in an empty city, Skywalker's astromech droid R2-D2 sliced into the central computer and learned that the population had been evacuated after a number of bombs had been planted. A firefight with arriving Imperial stormtroopers quickly ensued, but the arrival of Calrissian, his aide Lobot, and a group of Ugnaughts brought the confrontation to a standstill. Lobot was prepared to detonate the planted bombs until Imperial Captain Hugo Treece shot him, so Skywalker used the Force to blow the bomb's primers and trick the Imperials into fleeing from Cloud City. Not long afterward, intelligence reported the Empire was building a secret armada that was transporting to Coruscant a Teezl, a strange creature capable of naturally amplifying hyperspace communications. After Rebel pilots acquired four stolen TIE fighters and obtained the armada's coordinates, four members of Rogue Squadron—Skywalker, Brie, Hanc Thorben, and Alph—made their way to the armada."}, {"tag": "p", "text": "The Rogues' TIEs were modified to fire just six standard-strength laser bursts before releasing powerful shots that would cut through even the strongest shields, and also included signal transceivers so the Rogues could recognize one another. Dubbed Flying Bantha Squadron, they gained entrance to the armada with stolen Imperial codes and each attacked a Star Destroyer. Imperial pilots were unable to tell friend from foe and destroyed several of their own before managing to take out Alph's fighter and kill the Rogue. Imperial Admiral Mils Giel responded by using the teezl to interfere with local comm frequencies, thus nullifying the Rogues' signal transceivers, and Skywalker instead relied on the wisdom of the Force to judge which TIEs were friendly. Thorben retreated from the battle when one of his fighter's solar arrays was hit, after which Skywalker used his last regular shot to destroy an unfriendly TIE. The squadron leader's ultra burst then took out the teezl and much of Admiral Giel's flagship, but his return to Haven Base was not welcomed with open arms. In a briefing room he was shocked to discover, via a holographic recording from a camera on Thorben's TIE, that the final TIE he had destroyed had been Shira Brie's. Facing severe backlash for killing a fellow Rogue, and with his faith in the Force severely shaken, Skywalker resigned his officer's commission and left Arbra. He soon discovered that the Force was indeed his ally: Brie had been an Imperial spy, tasked with alienating Skywalker from the Alliance and delivering him into the hands of Darth Vader."}, {"tag": "h4", "text": "The road to Endor"}, {"tag": "p", "text": "At some point in the year after Hoth, Rogue Squadron participated in Operation: Quick Strike, a series of deep-space engagements intended to harass Imperial military-industrial operations. They also teamed with Gold Squadron to defend the evacuation of the Rebel hospital Hormuuz in the Gelgelar system, which marked the Rebellion's beachhead in the Elrood sector. The hospital was under attack by Admiral Wooyou Senn's Task Force Vengeance. After the battle, while the wounded were being transferred to the Redemption, the Rogues and Golds flew Headhunters to cover the Rebel fleet's escape from the Star Destroyer Nemesis. After being forced to retreat from the sector, the Rogues went on to participate in the Rebel campaign to expand Alliance activities into the Airam sector, piloting various starfighters and serving in a number of disparate mission profiles, including fighter interception and anti-capital ship striking. The first was another defense, this time of a Rebel convoy in the Halbara system, and the Rogues next worked with Green Squadron and several capital ships to steal supplies from the captured Hormuuz."}, {"tag": "p", "text": "Flying A-wings to the Almaran system to gauge the strength of Task Force Vengeance, the Rogues identified the Super Star Destroyer Vengeance as Senn's flagship. They then supported the Alliance's MC80 Star Cruiser Liberty in the Goff system, where a Rebel trap destroyed two of the Task Force's Star Destroyers. The campaign against Admiral Senn also saw Rogue Squadron hold off an Imperial counterattack in the Battle of Swellen while the Alliance captured the Immobilizer 418 cruiser Compellor, guard the Compellor as it arrived at Mobetta and then hold off a second Imperial assault, ambush an Imperial fleet that had been sent to reinforce Task Force Vengeance, and defend the X7 factory Gallofree from the Empire at Mobetta. Although the Rogues covered the retreat of the Airam rebels, the Compellor was lost. Rogue Squadron's next engagement was beating back an Imperial attack while the grateful Airam rebels were supplying the Alliance with warheads. They then captured the Airam leader Ilay, who was attempting to negotiate with Senn, and later destroyed Imperial supply freighters at Dega. A weakened Senn took his task force to the Nocto system to attack the Alliance, but the Rebels destroyed both the Vengeance and the Rage, finally killing and defeating Senn."}, {"tag": "p", "text": "Captain Solo, meanwhile, had been frozen in carbonite and taken by the bounty hunter Boba Fett just before Skywalker's confrontation with Vader at Cloud City. Six months into 3 ABY, Fett's location was pinpointed on the moon Gall by a group of Solo's close friends: Skywalker, Organa, Calrissian, Chewbacca, R2-D2 and C-3PO. Given Solo's importance to the Alliance, his friends planned a rescue operation, and asked Antilles and the Rogues to participate. The squadron accordingly set up a temporary base on Kile, a moon of Zhar, and did some flybys of the Imperial Enclave on Gall, which was also a moon of Zhar. Solo's group of friends soon rendezvoused with them at the base, as did Dash Rendar, who had been hired by Calrissian to lead them to Fett. After Antilles briefed the new arrivals, Skywalker devised a plan: He and the Rogues would distract the Imperial ships while Rendar led Calrissian to where Fett's Slave I was docked at the enclave."}, {"tag": "p", "text": "Skywalker flew into the Battle of Gall as Rogue Leader with Antilles as Rogue One. The young Jedi switched off his targeting sensor and allowed the Force to guide him, and the result was a large amount of TIE fighter scrap metal. Scotian was forced to retreat from the battle after taking a nasty hit to his fighter, and Rivan was killed by enemy lasers, but the Rogues managed to keep a massive Star Destroyer from targeting them by drifting the engagement back and forth through space. When another Destroyer came in from the moon's nightside, the Rogues made a final pass at the first warship before breaking away from the fight, hoping that they had bought the others enough time. Before he could jump to lightspeed, however, Skywalker found himself targeted by the guns of Janson's X-wing—the Rogue's Artoo unit had taken control of his starfighter. Skywalker only survived the surprise due to a warning from the Force, and after maneuvering a pursuing TIE fighter into Janson's line of fire, he was able to take out Janson's engines and laser cannons."}, {"tag": "p", "text": "Janson's craft was towed back to base, where his droid was fitted with a restraining bolt. R2-D2 plugged into the rogue robot and discovered some grim news: it had been programmed by someone to target Skywalker. That someone was Rogue Squadron's crew chief, Viera Cheran, who had been paid 10,000 credits to assassinate Skywalker. She quickly destroyed the Artoo unit, and Antilles shot her in the chest when she turned her blaster on him and Skywalker. Meanwhile, Organa and the others returned to base empty-handed, as Fett had gotten away. The Rogues were next assigned to cover a meeting over the planet Kothlis between the medical frigate Redemption and the CR90 corvette Razor, but the Rogues arrived with the Redemption to find the Razor under attack. When Antilles disabled the Imperial-class Star Destroyer Motivator, it crashed to Kothlis's surface, necessitating a commando mission to retrieve the data that had been stolen from the Razor. The data was quite alarming to the Alliance: The Empire was constructing a second Death Star."}, {"tag": "p", "text": "While with the Alliance Fleet, the Rogues received word from Dash Rendar that Skywalker, Organa, Calrissian, and Chewbacca were on the surface of Coruscant and would need assistance. Antilles brought his squadron to the outermost fringes of the Coruscant system to await for a signal from Rendar, and when he received it, he took the Rogues into the middle of a space battle to lend aid to the harrowed Millennium Falcon and to Rendar's Outrider. Their opponents were fighters belonging to the criminal syndicate Black Sun, who outnumbered them badly. However, Darth Vader arrived in the Super Star Destroyer Executor to destroy his foe—Black Sun's Prince Xizor—and the destruction of Xizor's Skyhook opened an escape corridor for the Rebels, who quickly fled the system. Plans were put into place for a Rebel assault on the second Death Star, and the Rogues helped cover the retrieval of the stolen Imperial Lambda-class shuttle Tydirium from the Zhar system to the Alliance's Liberty. The Rogues also raided Imperial-held Cloud City for valuable tibanna gas."}, {"tag": "h4", "text": "Endor and aftermath"}, {"tag": "p", "text": "In 4 ABY, the Alliance Fleet gathered near the planet Sullust and prepared to strike at the Empire's unfinished Death Star II battlestation, which sat in orbit of the moon of Endor. Rogue Squadron was directly attached to Admiral Ackbar's Home One, the flagship of the entire fleet, but Antilles temporarily renamed the Rogues \"Red Squadron\" in honor of the original Red Squadron from the Battle of Yavin. Many top X-wing pilots had recently transferred to the new A-wing fighters, and the Battle of Endor saw the Rogues divided among a number of ad hoc squadrons, with Rogue veterans such as Gemmer Sojan and Tycho Celchu flying A-wings in Green Squadron and both Karie Neth and Kin Kian serving as gunners in Gray Squadron. Antilles was allowed the opportunity to equip the Rogues with newer A-wings and B-wings, but he personally elected to stay in his X-wing. Red Squadron also included a Human male in a Y-wing as Red Two, Sila Kott in an A-wing as Red Three, Derek Klivian as Red Four, Grizz Frix as Red Five, Keir Santage as Red Seven, Randi, Wes Janson, Kirst, and Wister."}, {"tag": "p", "text": "Before the battle, Antilles gathered Red Squadron into a briefing room and told them the plan of attack: Rebel starfighters would enter the Death Star's superstructure and fire on its reactor core. A strike team on the moon's surface would disable the shield generator that protected the Death Star before the Alliance Fleet arrived in the Endor system, but upon their arrival, the fleet found that the shield was still up. What they thought was going to be a surprise attack was countered by a massive force of Imperial starfighters, and although several Alliance squadrons were devastated by the onslaught, Red Squadron remained mostly intact and racked up a large number of kills. Kott was killed by a TIE pilot, however."}, {"tag": "p", "text": "The Death Star joined in the battle, firing its superlaser at Rebel capital ships, forcing the Alliance Fleet to attack Imperial Star Destroyers at point-blank range so as to avoid the battlestation's destructive power. Grizz Frix perished during the daring attacks. When the strike team finally destroyed the shield generator, Antilles, Santage, and several other pilots entered the unfinished Death Star. Santage was killed, but Antilles and Gold Leader Lando Calrissian knocked out the reactor core, which started a chain reaction that destroyed the entire station. The day was won, and Galactic Emperor Palpatine was one of the Imperial casualties. The Imperial Navy fought on for nearly four more hours before finally retreating."}, {"tag": "p", "text": "The victory was costly for the Alliance, including a starfighter casualty rate of more than twenty percent, itself almost matched by shipboard casualties. Nearly three quarters of all surviving vessels required extensive repairs, and Ackbar ordered immediate repair and salvage operations. A quickly-put-back-together Rogue Squadron aided with cleanup operations, and they were sent to help reestablish a sensor perimeter after the Rebels' sensor net was destroyed by the intruding Imperial system patrol craft Daggerblade. One day after the Death Star's destruction, Antilles intercepted an Imperial message drone while flying patrol duty and accidentally set off its self-destruct cycle. He was rescued by Luke Skywalker, who flew under the Rogue Leader call sign and was able to disarm the explosives. The drone's message, intended for Imperial reception, revealed that an alien invasion force was attacking the planet Bakura, and the Alliance immediately dispatched assistance to the besieged world. The Rebel task force included Rogue Squadron."}, {"tag": "p", "text": "The Rogues and the entire Alliance Task force engaged the strange Ssi-ruuk aliens upon their arrival at Bakura, with Antilles flying once again as Rogue Leader. At one point, all of Rogue Squadron were surrounded by enemy fighters, and were only able to escape when Skywalker—commanding from the carrier Flurry—used the Force to convince one Ssi-ruuvi pilot to ram into a squadron mate. After the Alliance's Red Squadron destroyed an enemy cruiser, the Ssi-ruuvi Fleet retreated into hyperspace. The Alliance ships then joined an Imperial orbital defense web while a team of Rebel diplomats went planetside."}, {"tag": "p", "text": "The combined forces of the Rebels and Imperials were able to repel the next attack launched by the Ssi-ruuvi Imperium, but the Alliance's success was quickly followed by an Imperial double cross. The Rogues protected Skywalker, who had commandeered the Shree-class battle cruiser Shriwirr from the Ssi-ruuk, from the Empire's forces while Skywalker convinced Imperial Commander Pter Thanas to surrender. The Rogues racked up a large number of kills against both Imperial and Si-ruuvi foes during the incident. Back at Endor, Antilles and two other Rogues—Kirst and Wister—came upon several TIE fighters that remained in the Endor system while flying a cleanup operation. The resulting chase led them to the remains of the Super Star Destroyer Executor, downed during the Battle of Endor, which took out Wister's fighter with its still-operational turbolasers. Antilles and Kirst were able to finish off the massive ship by using proton torpedoes to cause an avalanche."}, {"tag": "p", "text": "Seven days after the Battle of Endor, several of the Rogues were performing salvage duty and other cleanup at the Alliance's Endor Station. Other Rebel squadrons were out in the galaxy, assessing the political situations in major sectors, and Skywalker—once again acting as Rogue Leader— gathered several members of his squadron together for a mission to Corellia. One week later, he had arrived in the planet's capital, Coronet City, along with Antilles, Celchu, Janson, and Blue Leader Ten Numb. Although two sweeps of the entire Corellian system had failed to detect any Imperial presence, the group was quickly targeted by Imperial snipers while in a Coronet cantina. Biker scouts and AT-STs soon followed, but the Rogues were able to send their attackers into retreat. They learned from a captured officer that Coronet had been struck in order to send a message: the Empire still lived."}, {"tag": "p", "text": "Ten Numb was captured while pursuing the fleeing Imperials, and when the Rogues followed his homing beacon into space in their snubfighters, they were intercepted by TIE fighters. In fact suicide drones, the TIEs all detonated, and the Rogues narrowly avoided the deadly explosions. Numb's signal was lost during combat with three remaining TIE drones, but R2-D2 was able to extrapolate his destination from his last signal. The Rogues followed Numb's captors to neighboring Tralus, where they learned that the Imperial General Weir had set up base in the underground Selonian Tunnels. Locating it with the aid of Selonian scouts, they held off Weir's stormtroopers largely thanks to Skywalker's lightsaber."}, {"tag": "p", "text": "Antilles and Celchu commandeered TIEs to chase a fleeing Weir, taking out enemy pursuit and ultimately downing their target. Although Numb had been tortured to death, Weir was placed in Rebel custody and the Rogues returned to the Alliance fleet. Several days later, Skywalker gave permanent command of the Rogues to Antilles so that he could focus on rebuilding the Jedi Order, and the new Rogue Leader was surprised to find that a large number of pilots had volunteered to fly with Rogue Squadron. By this point in time, the Rebel Alliance had transitioned into the Alliance of Free Planets, an interim government that was intended to be a stepping stone en route to establishing a New Republic."}, {"tag": "p", "text": "A temporary Rogue Squadron was called into action for the Alliance of Free Planets when their Endor base was attacked by the Nagai expeditionary force. Antilles led the Rogues as they flew alongside Calrissian in his modified Mu-2 long range shuttle Cobra, Chewbacca and Nien Nunb in the Millennium Falcon, and a Mandalorian Resurrector Squadron of Cabur-class starfighters commanded by the Mandalorian Protector Fenn Shysa. Led by Shira Brie, now known as the the Sith Lady Lumiya, the Nagai pilots seemed to anticipate the allied fleet's every move and quickly overwhelmed them, dealing massive losses to Shysa's squadron. Admiral Ackbar soon informed his space forces that a traitor in the Alliance's midst had transmitted all of their flight plans to the enemy, and that their only chance was to formulate a new strategy on the fly. Calrissian quickly told Antilles to start winging it and to order all ships to lock directly into both of their computers. As the allied forces began to follow the two's suddenly erratic flight paths, their unpredictable movements masked each other and allowed them to easily pick off their opponents, and Lumiya fled the system."}, {"tag": "h3", "text": "New Republic heroes"}, {"tag": "h4", "text": "Fighting for the New Republic"}, {"tag": "p", "text": "A few weeks after the Death Star's destruction, Rogue Squadron struck at Tandankin, a planet recently seized by the Empire's Grand Moff Nivers. Flying as Red Leader, Antilles had his squadron target an AT-AT, but a lone stormtrooper with a big gun was able to disable the craft of Red Seven. The downed pilot discovered a landing strip filled with dozens of TIE fighters, which Antilles neutralized by shooting down a nearby tower. Nivers was captured, and it took Skywalker regaling the world's citizens with tales of Antilles's heroics through the years to placate their anger over the destruction of what turned out to be an important monument. The mission was Skywalker's last with Rogue Squadron, as he afterward made his resignation official. The New Republic was officially declared one month after the Emperor's death, and Antilles engineered a demotion for himself from commander down to captain, in order to remain Rogue Leader in the face of New Republic pressure to move up to fleet command. Celchu became the squadron's second in command, and Skywalker continued to command naval units for a government that was unwilling to give up his military skills, later being promoted to general."}, {"tag": "p", "text": "With its new roster, the Rogues undertook their first mission with a lean team of six: Antilles, Janson, Klivian, Celchu, Plourr Ilo and Dllr Nep. Around one month after the Death Star's destruction, the Rogues were on Cilpar to pick up supplies from the Cilpari Resistance and escort a food convoy to Mrlsst. Their contact, codenamed Targeter, failed to show up for two weeks, and they found themselves dogfighting Imperial TIE fighters. Although they won the day, Janson's X-wing crashed into the jungle, and he was retrieved by Celchu. The other four Rogues were soon captured by Elscol Loro and the distrustful Cilpari Resistance, but the two groups eventually united against Moff Boren Tascl, a common enemy. Janson and Celchu meanwhile rendezvoused with Targeter, whose real name was Winter, and who was unsure of the extent of the Moff's resources. Owing to Janson's broken leg, she sent Celchu to infiltrate the local Imperial base."}, {"tag": "p", "text": "Celchu presented himself as a TIE pilot to the Empire's Major Grode and flew a TIE fighter in a search and destroy mission against the Rogues, where he covertly contacted his Artoo unit and instructed it to alert Antilles of his squadron's approach. By chance, Winter was in his X-wing's cockpit when it suddenly took off, but she was able to override the droid just in time to shoot down what enemy craft Loro and the Rogues had missed, including Celchu's TIE. He managed to eject in time and and return to the Imperial base, and in the next skirmish, he flew a new TIE but blasted his Imperial squadron mates, helping his fellow Rogues clean up Tascl's forces while Loro stormed the Moff's palace. Loro became the squadron's newest member, and she flew with them to Mrlsst two months after Endor to protect the food convoy. Above the planet, the Rogues were ambushed by an Interdictor-class Star Destroyer and its TIEs, but proton torpedoes fired by Loro and Antilles took out the Destroyer and allowed the convoy to land."}, {"tag": "p", "text": "On Mrlsst's surface, the Rogues met the young student Koyi Komad and ran into Antilles's old friend Mirax Terrik, as well as his old enemy, Imperial officer Loka Hask. They also came across the Ante-Endor Association, a group claiming the Battle of Endor had never happened, and when Celchu confronted them he ended up brawling in the street. Representing the New Republic, Antilles found himself bidding against Hask for a Phantom Ship Project developed by the Mrlsst Academy. Accusations against the Rogues of stealing the project's datacards led to Antilles being arrested, however, and only a warning from Koyi Komad saved the rest of the squadron from the same fate. Terrik and Nep tracked down Professor Rorax Falken, who revealed that the Phantom Ship Project had been made up in order to milk the Empire for credits, while the other Rogues stormed Hask's base to rescue Antilles, with Janson's charge being made from a hospital bed. When Hask's Interdictor, the Dominator, appeared in space, Terrik and Nep boarded her yacht, the Pulsar Skate, and informed Antilles that they had found a gravitic polarization beam in Falken's Lab. Antilles authorized the use of it, and Hask and his ship were vanquished. The weapon was then submitted to the New Republic."}, {"tag": "p", "text": "Five months after battling on Endor, the New Republic and the Nagai found themselves uneasy allies against the marauding Tof Kingdom. A joint assault on the Tof stronghold of Saijo with the aim of capturing the Tof Prince Sereno saw both Rogue Squadron and Gold Squadron deployed, and Calrissian, piloting the Millennium Falcon alongside Chewbacca, told Antilles to destroy as many Tof starfighters as possible until the enemy agreed to surrender. The flagship Merriweather did just that after half of its fighter escort had been taken out, and on the planet's surface Skywalker was able to acquire the target after his ally Bey subdued Lumiya. The Nagai–Tof War was brought to an end, and one month later the Rogues were sent on a mission to Tatooine, where a New Republic Intelligence agent was on-world investigating Imperial arms dealing. Admiral Ackbar dispatched Rogue Squadron to aid her in case a strike force was required. While Janson, Nep, Ilo, and Klivian mixed with the locals in Mos Eisley to learn more about the ongoing gang wars that had resulted from the death of local crime lord Jabba the Hutt, Antilles met up with Biggs Darklighter's father Huff alongside Celchu and Loro."}, {"tag": "p", "text": "The dirtside Intelligence agent turned out to be Winter, who helped Antilles secure valuable intelligence from Darklighter about an Imperial weapons cache and the location of the lost prototype strike cruiser Eidolon. Working with Winter was New Republic commando Kapp Dendo, who allied with the Rogues despite an initial misunderstanding that led to a brawl, and the entire group found themsleves mixed up with the Twi'lek gangster Firith Olan. Antilles's group pursued Olan to Ryloth, and although he escaped back to Tatooine with the Empire's Captain Marl Semtin, the Rogues gained new allies in a disgruntled group of Imperial Special Intelligence troopers that Semtin had betrayed. On Tatooine, the events culminated with a battle that saw Semtin's forces defeated by the Rogues in the air while the Special Intelligence troopers stormed Eidolon Base. Following the battle, Loro parted ways with the squadron after she disobeyed one of Antilles's orders, and she went on to form a new partnership with former Special Intelligence trooper Sixtus Quin. Dendo personally rescued a downed Ilo during the battle, while Winter was relieved to learn that Celchu had survived what had seemed like a suicide run in his X-wing, surprising the pilot with a kiss."}, {"tag": "p", "text": "Rogue Squadron's ranks grew from the mere six they had been boasting when Ackbar's aide, Firstpilot Rekush, recommended that Antilles interview Feylis Ardele from the Commenor Militia. Other new recruits were the Mon Calamari Ibtisam and the Quarren Nrin Vakil, whose acrimony toward each other over a longstanding species rivalry was kept in check by Antilles's orders, and a Bith pilot named Herian I'ngre. Seven months after Endor, Antilles was using Ardele's experience flying TIE fighters during her training at Commenor and was pitting her against the rest of the Rogues in daily simulations. During one such exercise, he also had I'ngre rig the simulator seats with electical charges in a bid to produce more realism. Just after the simulation, Antilles and Celchu were shocked to receive a visit from Grand Duke Gror Pernon of Eiattu 6 and to learn that Plourr Ilo was Isplourrdacartha Estillo, the lost princess of his homeworld. Rogue Squadron's next mission was to escort her home, an arrangement Ilo only accepted when she was told that her long-lost brother was still alive."}, {"tag": "p", "text": "All was not as it seemed on Eiattu, as the Rogues learned when they came across Imperial stormtroopers in the planet's jungles. Ilo was able to uncover the truth behind her brother's return: the man was an impostor in league with Imperial Moff Leonia Tavira. After the Rogues defended the capital city's citadel from a TIE fighter attack, Ilo confronted and exposed the charlatan, but the pilots were unable to stop Tavira from fleeing the planet with credits taken from the royal treasury. Ilo elected to remain with her people to help strengthen her weakened homeworld, but Antilles gifted her X-wing to her along with a promise that she always had a place in the squadron. The mission also saw the beginning of an evolution in Vakil and Ibitsam's relationship with a show of gratitude from the Mon Calamari to the Quarren when he rescued her from Imperial imprisonment. Straight from Eiattu, Rogue Squadron departed on a mission to locate a missing spaceliner full of Bothan tourists."}, {"tag": "p", "text": "Short one member without Ilo, the nine remaining Rogues launched to the Malrev system eight months after the second Death Star's destruction. The spaceliner Starfaring was quickly located on Malrev IV, but only after Antilles's fighter was shot down by TIE fighters. A tense meeting at the passengers' campsite led to the Bothans brawling with Vakil, Klivian, and Janson, but an attack from the planet's native Irrukiine united the two groups in defense. Antilles, meanwhile, was rescued by a Devaronian sorcerer who could control the Irrukiine with his mind. The sorcerer used Sith magic to repair the Rogue Leader's nearly lifeless body, but he was unable to convince Antilles to surrender to its seductive influence. Back at the Bothan camp, however, the other Rogues found their emotions in various states of havoc. Dllr Nep was the most susceptible, and after Antilles escaped the sorcerer's temple, Nep willingly entered it."}, {"tag": "p", "text": "Believing that he was hearing beautiful music, Nep could only break free from the influence of Cartariun, the sorcerer, via telepathic help from Herian I'ngre, who was recovering from injuries in a bacta tank. By drawing on the temple's dark side energy, Nep overpowered Cartariun and his Irrukiine goons, which broke the sorcerer's control over a large force of Irrukiine TIE pilots who were haranguing the rest of the Rogues. The struggle was ended by the arrival of the Bothan Girov Dza'tey, who shot Nep and killed Cartariun, wanting the temple's dark powers for himself. The squadron then undertook an aerial assault on the temple while the Bothans attacked on the ground, and with Dza'tey focused on controlling his Irrukiine drones, Nep used his mental link with I'ngre to guide her X-wing into the temple. The sudden arrival of Plourr Ilo helped distract Dza'tey further, and I'ngre was able to destroy the nexus of dark power, although both she and Nep gave their lives in the process. Ilo remained with the Rogues and was flying with them one month later when they gathered reconnaissance at Brentaal IV."}, {"tag": "p", "text": "Rogue Squadron were involved in another battle eight months after Endor when they helped Solo, Chewbacca, and Calrissian liberate Kashyyyk from Grand Admiral Peccati Syn and Moff Hindane Darc. At Brentaal the following month, Nrin Vakil flew a Recon-X starfighter while his fellow Rogues protected him from TIE fighters. After his data sweep, the squadron returned to Rebel Base Delta-Nine, where Antilles and Celchu welcomed four new members of the squadron: Dar Keyis, Standro Jcir, Avan Beruss, and Xarcce Huwla. Citing the high odds of dying in the near-impossible tasks the Rogues were assigned, Huwla requested a transfer, but agreed to fly with the squadron until her request could be processed. Two weeks of training then commenced for their next mission: joining Colonel Horton Salm's Aggressor Wing in a task force and capturing Brentaal IV."}, {"tag": "p", "text": "After the naval force took Brentaal IV's moon base, Rogue Squadron learned that they had tussled with elements of the Empire's notorious 181st Imperial Fighter Wing. Numerous squadron members worried about a potential skirmish with the 181st's leader, Baron Soontir Fel, but they were cheered to discover that Koyi Komad was their new chief mechanic. When they attacked Brentaal's capital of Vuultin, Aggressor Wing simultaneously struck at the spaceport city of Oradin, and it was the latter group that found themselves in Fel's sights. Imperial Admiral Lon Isoto ordered the Baron back to Vuultin, however, and the Rogues withdrew to the Independence. Oradin was theirs, and Vuultin was taken in a later assault, with Janson and Ibtisam—earlier shot down but rescued by Kapp Dendo's Commando Team One—assisting from the ground. Fel engaged Antilles in a dogfight over Brentaal IV, and the Rogue Leader was only able to best him with help from a disabling shot by Colonel Salm's ion cannon. Dar Keyis and Standro Jcir were two of the battle's casualties."}, {"tag": "h4", "text": "Striking from the shadows"}, {"tag": "p", "text": "During Fel's debriefing, the Baron revealed that he was married to Antilles's estranged sister, famous actress Wynssa Starflare. Fel also shared his life story, including details of the 181st's role in destroying Renegade Flight at Derra IV, and he revealed that he had grown disillusioned with the Empire. He agreed to defect on the condition that the New Republic help find and protect his wife, who had gone into hiding. Antilles dispatched Ilo, Klivian, and Janson to Corellia to find her, and Fel was welcomed into Rogue Squadron, despite the strong objections of Vakil. Although the trio did not locate Starflare, they did help Fel's family rescue a kidnapped child, Fyric, with the aid of Corellian Security Force officers Iella Wessiri and Corran Horn. Soontir Fel took to an X-wing quickly and saw action with his new squadron against a group of pirates in TYE-wing uglies, and he and Celchu were next assigned to escort Leia Organa Solo to Eiattu 6. As Fel had once been a symbol of the Empire's power, the New Republic hoped his new allegiance would signify their decline. The group's transport to Eiattu was Han Solo's Millennium Falcon."}, {"tag": "p", "text": "Ilo, Fel, and Solo learned that Eiattu's Count Laabann had sold information to Leonia Tavira—information that led to Celchu and Winter's capture. Meanwhile, on Axxila, Antilles and Organa secretly met with Sate Pestage, current ruler of the Empire, who wished to defect from the power-hungry Imperials who were trying to force him out. With help from Solo in the Falcon and an escaped Celchu and Winter in a Y-wing, the Rogues chased Tavira's pirates off of Axxila, and Fel was able to order Imperial Admiral Delak Krennel's Star Destroyer away with a bogus AT3 Directive. The order succeeded after the directive was confirmed by Pestage, who was now working as a secret New Republic ally, but his duplicity did not go unnoticed by the Empire. The ambitious Director of Imperial Intelligence Ysanne Isard began to plot against him."}, {"tag": "p", "text": "When an Imperial warrant was issued for Pestage's arrest twelve months after the Battle of Endor, the New Republic Provisional Council moved to rescue him, with Rogue Squadron recruited for the task. The full squadron was recalled from some leisure time that saw Ibtisam and Nrin Vakil growing closer, and Ardele and Beruss pursuing a relationship. Alongside Aggressor Wing and Commando Team One, the Rogues struck at Ciutric IV and made contact with Pestage on the ground, but Ibtisam was killed during a skirmish with TIE fighters. Her death deeply affected Vakil, who had hoped to use his friendship with his former foe to heal the rift between their two peoples. As the New Republic forces and Mirax Terrik's Pulsar Skate cut an escape route through Delak Krennel's Reckoning and the Interdictor Binder, Pestage slipped away from them to join Krennel as a warlord of the new Ciutric Hegemony, only to have his neck snapped by his would-be ally. The Rogues held a funeral for Ibtisam, and a grief-stricken Vakil took a leave of absence from them before eventually transferring to a training squadron. Isard, meanwhile, saw to it that each member of the Imperial Ruling Council met with their deaths, and she ascended to the leadership of the Empire."}, {"tag": "p", "text": "The year 5 ABY also saw the New Republic face off against Lord Shadowspawn, a marauder who had been raiding Republic territory for two months and costing thousands of civilian lives. Antilles hatched a plan to load special flechette torpedoes with tracking devices that would lodge themselves in the hulls of Shadowspawn's TIE Defenders, and Rogue Squadron subsequently ambushed the warlord's forces on the Corellian Run in upgraded T-65B X-wings. After bursting out of a replica of the luxury liner Corellian Queen, the Rogues engaged the marauders, and Klivian and Janson quickly shredded four Defenders each despite the loss of one of Klivian's wings and his mechanical left hand. Ardele and Beruss were both forced to eject, and Klivian's crippled starfighter received manual pickup from Janson, but the Rogues suffered no casualties and the retreating marauders were traced to their base in the Taspan system. General Calrissian of New Republic Special Operations informed Antilles that General Skywalker's Rapid Response Task Force would take over the operation at that point, but Rogue Squadron's part in the operation soon turned out to be far from over."}, {"tag": "p", "text": "While Leia Organa negotiated with a Mandalorian mercenary commander inside an asteroid in an obscure Inner Rim system, the Rogues were on-station with Calrissian, who was bringing the Mandalorian Protector and former mercenary Fenn Shysa in as an intermediary. Organa felt a premonition during the negotiations that her brother, Skywalker, was in danger, prompting Han Solo and Chewbacca to dash off in the Millennium Falcon to help him. A desperate Organa let the Force lead her around the asteroid's docking bay until she found Celchu, whom she told she needed an emergency ride. Antilles overheard and was reluctant to disobey Calrissian's orders until she revealed that Skywalker was in danger, at which point he quickly rounded up the rest of the squadron. When they arrived at the planet Mindor, with Organa inside Celchu's B-wing, they found the Millennium Falcon helping the Republic task force take out Shadowspawn's gravity well projectors. If the projectors sent enough asteroids crashing into the sun, the resulting stellar flares would sterilize the entire system."}, {"tag": "p", "text": "Organa was transferred to the Falcon, and together with Solo, the Rogues carved their way through Shadowspawn's TIE interceptors and gravity stations toward the planet's surface, microjumping through lightspeed from asteroid cluster to asteroid cluster and being yanked from hyperspace each time by the gravity wells. Solo advised them to fly using their repulsorlifts in order to make use of the Solo Slide, a tactic that moved the asteroids by firing repulsors at them. Rogue Squadron proved adept at the new tactic, impressing Solo with their finesse, and the Falcon was able to make it through the gravity wells and land on the planet to look for the missing General Skywalker. Antilles and his pilots remained in the air to clear an escape route out of the system but quickly found themselves swarmed by TIEs. A downside of their tactic was that the stellar flares would now begin in less than twelve hours, down from the previous estimate of two days that had depended on a fully intact gravity well network."}, {"tag": "p", "text": "Working with Captain Tirossk of the Rapid Response Task Force, the Rogues and various other fighter squadrons protected Slash-E interdiction cruisers from an overwhelming enemy fighter screen, and their low spirits were only lifted by the arrival of General Calrissian in the Remember Alderaan. With him were the Mandalorian mercenaries, recently hired by him, and when Antilles and Celchu docked aboard his cruiser he became more interested in the tactical situation than in punishing them. Antilles estimated it would be at least eighteen hours before the gravity well situation allowed an escape window to open. The fleet took cover above Mindor's nightside, but the Rogues and two other squadrons distracted the enemy forces by covering decoy escape pods before joining the fleet's attack on Shadowspawn's dirtside volcano base. During the melee, a commandeered Millennium Falcon downed Klivian's craft, and two other Rogue pilots were also taken out, but Calrissian ordered the squadron to focus its fire on the base's gravity gun."}, {"tag": "p", "text": "Rogue Squadron dogfought their foes over the base while its interior was stormed by Shysa and the Mandalorians, but the volcano suddenly rose into the sky. A solid mass of radiation-proof stone, it could launch into space and protect its occupants from the stellar flares. Disaster was only averted when Skywalker broadcast a call for Shadowspawn's forces to power down their gravity stations and surrender unconditionally—believing that he was the heir to Palpatine and their new Emperor, the Imperials complied. However, Shadowspawn used a fail-safe to reactivate the stations and possess his soldiers' minds, driving his TIE pilots into suicide runs against the Republic fleet. Believing they would not survive, the Rogues and their allies yet threw themselves into a desperate defense, but Skywalker was ultimately able to defeat Shadowspawn and free his soldiers from their mindless rage. The act of mercy killed them all, and a disgusted Skywalker went on to resign his commission from the New Republic military. Although the Republic forces escaped, the planet Mindor was destroyed by the sun's stellar flares."}, {"tag": "p", "text": "Nearly seven months after joining the New Republic, Soontir Fel was safely reunited with his wife, and he soon afterward helped Rogue Squadron win a key battle against Ysanne Isard's forces. An enraged Isard set into motion a plan to capture him—a plan spearheaded by Grand Admiral Thrawn. Based in the Unknown Regions, Thrawn was fighting a war with dire threats and would-be warlords against whom he believed there was no guarantee of victory, even if the Empire and New Republic were to combine their forces. With his people, the Chiss, especially vulnerable to those threats, he set up his Household Phalanx on the planet Nirauan to protect them. He needed skilled warriors, and when Fel was captured by Isard around 5.5 ABY and sent to Thrawn's base on Nirauan, the former Baron heard the Grand Admiral out and agreed to join his fight against the Unknown Regions threats, which were dangers to the entire galaxy."}, {"tag": "p", "text": "Fel's wife and their children were also captured by Isard and handed over to Thrawn, and the family relocated to Nirauan. Imperial forces were covertly working under Thrawn alongside the rogue Chiss of his Household Phalanx, and the wider organization was called the Empire of the Hand. When Fel disappeared, the New Republic assumed that he had been executed by Isard, to whom the Rogues lost another member around the same time—in 5.5 ABY, Tycho Celchu infiltrated the Imperial capital world of Coruscant in a TIE fighter on a New Republic espionage mission, but was uncovered and captured by Isard. He managed to escape after a few months in the hellish Lusankya prison, but many in the New Republic suspected that he was a brainwashed sleeper agent."}, {"tag": "h4", "text": "Reorganization"}, {"tag": "p", "text": "About a year and a half after Endor, Admiral Ackbar approached Antilles with plans from the New Republic Provisional Council for re-forming Rogue Squadron—they directed Antilles to rebuild the legendary unit from the ground up, revitalizing it with the galaxy's best pilots. Having seen too many new members die soon after joining the Rogues, Antilles saw the wisdom in the decision; although all of the squadron's veterans wanted to see it continue unbroken, they also wanted its pilots to get the necessary training for survival. Rogue Squadron was temporarily disbanded, and Antilles was taken off active duty. The Rogues became an important symbol of New Republic propaganda, and Antilles was sent on a nearly year-long publicity tour, visiting new member worlds to deliver speeches, kiss babies, and pose for holograms. The squadron's exploits were played up in an effort to depict the new government as heroes, rather than the bandits they had been cast as by the Empire."}, {"tag": "p", "text": "Klivian and Janson were assigned to train new squadrons, and Antilles was recalled to active duty in 6.5 ABY to help interview and test hundreds of pilots for the empty Rogue positions. The New Republic needed an elite group of pilots who could perform the impossible jobs for which Rogue Squadron was known, and who could live up to its legend. After some last-minute negotiations with Ackbar and with General Horton Salm over some political appointments to the squadron, Antilles had his twelve, and preparations for the New Republic's push toward Coruscant could begin. The New Republic believed it was important that their allies, including the Bothans and the planet Thyferra, have representatives in the celebrated squadron, but Antilles was able to secure Celchu as his executive officer, provided that his friend—still under heavy suspicion by many—only fly a Z-95 Headhunter with low-powered lasers during training missions and remain under house arrest when not flying. The protocol droid Emtrey served as Antilles's administrative assistant, and the Verpine Zraii as the squadron's technician."}, {"tag": "p", "text": "At the New Republic's Folor Base, Antilles gathered his new roster together for the first time: former CorSec agent Corran Horn, former lawyer Nawara Ven, Gand pilot Ooryl Qrygg, Thyferrans Bror Jace and Erisi Dlarit, Kessel native Lujayne Forge, Bespin native Rhysati Ynr, Rodian Andoorni Hui, Shistavenan Riv Shiel, Bothan Peshk Vri'syk, and Gavin Darklighter, cousin to former Red Squadron pilot Biggs Darklighter. They had been chosen for both their elite flying abilities and for other skills, as Ackbar wanted them to operate as more than just a fighter squadron—he envisioned them operating independently if necessary, performing operations that usually required far more than twelve operatives. Antilles wanted pilots who could also serve as commandos, and he had prioritized ground-based skills when faced with applicants of equal piloting skill. He reminded his new team that statistically, most fighter pilots died within their first five missions, and he told them of his plans to intensely train them over the following month."}, {"tag": "p", "text": "The new squadron was put through a training exercise in a gunnery and bombing range on Folor known as the Trench, which saw the hotshot Corran Horn learn a humbling lesson about teamwork when Antilles fed his targeting data to his fellows, improving the squadron's result at the expense of his individual score. Another mission saw them stage a training attack on General Salm's Y-wings, scoring an eight to one simulated kill ratio and infuriating the general. Antilles felt that six months of advanced training was necessary, but the New Republic worried over potential moves against Coruscant by Imperial warlords, and the Rogues were officially activated by Admiral Ackbar. Moved coreward to Talasea, they were assigned to escort ships that were going even deeper toward the galactic capital; as the New Republic began its own push to Coruscant, safe worlds and supply depots were being set up along their route."}, {"tag": "p", "text": "The Provisional Council insisted that Rogue Squadron's mission be publicized in order to send a message to Imperial citizens waiting to be liberated, and Ackbar was cognizant of the risk that such publicity posed to the pilots. As such, he committed to keeping each of their destinations secret, even from them. Navigational data would only be fed to them immediately prior to each hyperspace jump, and they would also be kept in the dark about their mission's true purpose, told instead that they were embarking on an extended training exercise. Leading Vri'syk as Rogue Two, Ven as Rogue Three, and Jace as Rogue Four, Antilles commanded One Flight as Rogue Leader; Two Flight was headed by Ynr as Rogue Seven and also included Darklighter as Rogue Five, Shiel as Rogue Six, and Dlarit as Rogue Eight; while Corran Horn was promoted to lieutenant and given Three Flight. As Rogue Nine, he commanded Qrygg, Forge, and Hui—Rogues Ten, Eleven, and Twelve, respectively."}, {"tag": "p", "text": "En route to Talasea in the Morobe system on their first official mission, the Rogues were pulled from hyperspace in the Chorax system by the Imperial Interdictor cruiser Black Asp. The cruiser's real target was the Pulsar Skate, which was in-system at the time, and Antilles ordered his squadron to engage the cruiser's complement of TIE interceptors. Several were taken out, and a combined proton torpedo volley from the Rogues prompted the interdictor to flee, but Horn's X-wing took damage from the Black Asp's ion cannon and was only saved from two vengeful interceptors when Celchu, flying the unarmed shuttle Forbidden as Rogue Null, fed Horn targeting data that allowed him to destroy both foes. Toed to Talasea by the Pulsar Skate, Horn was greeted coldly by Mirax Terrik, whose father Booster Terrik had once been locked up by Horn's father, Hal Horn."}, {"tag": "p", "text": "Just after the new squadron next saw action, Forge was killed in her sleep by stormtroopers who raided the Rogues' Talasea base, as were support staff members Carter and Pirgi. The pilots were again thrust into the line of fire in the disastrous First Battle of Borleias, a major defeat for the New Republic that claimed the lives of Andoorni Hui and Peshk Vri'syk, as well as New Republic General Laryn Kre'fey. Thanks to intelligence gathered by Corran Horn and Lieutenant Judder Page of the Katarn Commandos, Borleias was taken in a second, heated assault, and the New Republic was in position to move toward the core and capture Coruscant. When forces loyal to the Imperial Warlord Zsinj were sent to Borleias to investigate, the Rogues chased them off and later seized two of Zsinj's freighters at Mrisst. Although Bror Jace was feared dead during a trip home to Thyferra when X-wing debris was discovered, Captain Aril Nunb and Lieutenant Pash Cracken were added to the Rogues' roster, and the squadron was selected to infiltrate the Imperial capital world and bring down its planetary shields."}, {"tag": "p", "text": "Borsk Fey'lya of the Provisional Council proposed an addendum to their plans: Release members of Black Sun from the prison world of Kessel and reunite them with their criminal allies in the Coruscant underworld, thus giving the Rogues unlikely but effective allies in their fight against the Empire. Tagging along with the freed prisoners was Inyri Forge, the rebellious younger sister of Lujayne. After Kessel, the Rogues went into Coruscant in small cells of two or three, with Ven, Shiel and Darklighter riding in aboard Mirax Terrik's Pulsar Skate. Antilles and Cracken rendezvoused with Iella Wessiri, now working for New Republic Intelligence, while Horn and Dlarit met up with an agent named Rima who was later revealed to be Winter. The Rogues gained an ally in Asyr Sei'lar, a Bothan from the Alien Combine group, but Aril Nunb was captured by General Evir Derricote when the Combine was raided by Imperials. Horn began to distrust Celchu after he thought he saw him meeting with Imperial Intelligence agent Kirtan Loor, but when he rendezvoused with Antilles, he was told that Zsinj's forces had attacked Rogue Squadron's base on Noquivzor and that Celchu had been killed. The attack prompted the Provisional Council to accelerate their invasion plans, and the motley crew of Rogues, NRI agents, alien rights activists, and criminals got to work."}, {"tag": "p", "text": "Antilles had in fact secretly brought his Executive Officer in beforehand as backup, and although Celchu denied having met with Kirtan Loor, Horn's suspicion remained strong. When Darklighter suggested creating a lightning storm to bring down the planetary shields, the group hatched a plan to use a construction droid to gain access to an orbital mirror control center, which they could use to vaporize a water reservoir and create a powerful enough storm. Antilles, Terrik, Wessiri, and Emtrey manned the construction droid while Winter, Darklighter, Qrygg and Celchu headed to the control center, and Horn, Dlarit, Ynr, Cracken, Forge and Sei'lar flew cover in Z-95 Headhunters that Celchu had procured. Despite resistance from TIEs, the gamble worked, and most of Coruscant's power stations were knocked out by the lightning. A final, stubborn station was destroyed by a concussion missile and a crashing TIE interceptor that was brought down by Horn, and the planetary shields dropped. A New Republic fleet arrived to liberate the planet, but dirtside, Horn's headhunter lost throttle control and crashed."}, {"tag": "p", "text": "The galactic capital was conquered with minimal resistance, with Antilles suspecting that Ysanne Isard had traded the world for her safe escape from it. Although Aril Nunb was found alive, the Rogue Leader was stung by the loss of Horn, especially when General Airen Cracken informed him that Celchu had been arrested for the man's murder. Among other suspicions held by New Republic Intelligence, Celchu had known the command codes for Horn's headhunter. In reality, however, Horn had been captured by Isard and brought to Lusankya. Asyr Sei'lar and Inyri Forge were both added to Rogue squadron—Antilles would have been happy to recruit them after the aid they had lent to the mission, but he was resentful of the reality that they were political appointees. The same was true of Portha, a Trandoshan who was attached to the Rogues as a security detail. Horn's apparent death was used by the New Republic to rally more troops and raise overall morale, while Celchu, also blamed for the death of Bror Jace, was brought on trial and defended by Nawara Ven in 7 ABY."}, {"tag": "h4", "text": "The Bacta War"}, {"tag": "p", "text": "Holding the galactic capital immediately proved troublesome for the New Republic, as the deadly Krytos virus began to ravage all non-human species who were on the world. Intended to weaken and divide the new government, it had been developed under Kirtan Loor, who had also remained on Coruscant to lead a Palpatine Counter-Insurgency Front under orders from Isard. She, meanwhile, stayed focused on breaking Corran Horn, putting him in the highest security area on Lusankya. On Coruscant, Antilles told the Provisional Council that he was ready to resign his commission over Celchu's treatment, but Senator Organa convinced him to stay on and help battle the Krytos threat—Warlord Zsinj had recently seized a convoy of bacta traveling from Thyferra to Coruscant, and the medicinal substance was desperately needed in the fight against the virus. Although the entire squadron had rallied around Celchu's innocence, they agreed to raid the Yag-prime space station where the bacta had been taken. Launching alongside Warden, Champion, and Guardian Squadrons from General Salm's Defender Wing, the Rogues captured their target with ease."}, {"tag": "p", "text": "Several members of the squadron reluctantly testified in the trial of their comrade, but the proceedings were placed on hold when the Provisional Council learned that the Rylothean spice ryll kor could be used to combat the effects of the virus. Nawara Ven was deemed to be a necessary diplomat to negotiate with his fellow Twi'leks, and so all of Rogue Squadron were sent to Ryloth as brokering agents. After being ferried to the planet aboard the transport Courage of Sullust and the Pulsar Skate, the Rogues were immediately treated to hospitality at Kala'uun Starport in the form of music and dancing, but the festivities were interrupted by the Twi'lek warrior Tal'dira. Although furious at the starport master for leaving him out of the negotiations, he voiced respect for the warrior tendencies of their guests and took the initiative of offering them the spice they desired. Rogue Squadron later launched from Coruscant to the Alderaan system to meet with Thyferra's Xucphra Corporation and obtain some bacta, but Zsinj's Iron Fist beat them to the rendezvous and destroyed the Xucphra transports."}, {"tag": "p", "text": "Iron Fist left before the Rogues' arrival, but it left the strike cruiser Termagant to be disabled by the Rogues. Several squadron members went on to provide commentary for a government report on the battle, which was made to counter Zsinj's own propaganda—the Warlord claimed his actions had been to save Coruscant's citizens from tainted bacta. As Ackbar and Antilles began preparing a task force to strike back at Zsinj, various members of Rogue Squadron found themselves entangled in others' schemes, with Borsk Fey'lya attempting to bring Asyr Sei'lar into his fold and Kirtan Loor arranging a clandestine meeting with Nawara Ven. Hoping to free himself from Isard, Loor told Ven he could prove that Celchu had never met with him if he would be guaranteed immunity from any New Republic prosecution."}, {"tag": "p", "text": "Despite his betrayal of Isard, Loor went through with a planned terrorist attack on a bacta storage facility by the Palpatine Counter-Insurgency Front in order to assuage Isard's fears about him. The New Republic had nearly been brought to its knees by the virus and the concurrent bacta shortage, and public confidence in the government had been further eroded by Zsinj's destruction of the bacta convoy and by Tycho Celchu's trial. Although the latter had been intended to restore faith in the government, the prosecution's case had been weakened by Ven's spirited defense of his colleague and by all of the Rogues' public disgust with it. A chance to save face, and lives, was dealt to the government by wild card Fliry Vorru, a criminal who was playing various sides against each other, when he sold Loor out and tipped Fey'lya off about the planned strike. Rogue Squadron immediately mobilized to fly cover for a commando force, and they made short work of the terrorists' airspeeders and AT-ST walkers in the air above Imperial City."}, {"tag": "p", "text": "The easy victory proved illusory, however, when TIE fighters and interceptors suddenly appeared to engage the Rogues, and a Super Star Destroyer blasted out of Coruscant's cityscape. The Lusankya, home of its namesake prison, had been hiding beneath the surface for years, and Isard was fleeing the planet after Corran Horn had escaped from her clutches. Although Horn burst into his own murder trial to declare Celchu innocent, an actual spy in Rogue Squadron's ranks was discovered when Erisi Dlarit boarded Isard's ship, claiming to be caught in a tractor beam. Her ruse was revealed when her R5 unit reported contradictory data to Antilles, and she and the Lusankya escaped. In the following days, Rogue Squadron flew various pursuit and cover missions against suddenly abandoned and emboldened Palpatine Counter-Insurgency Front cells before finally learning of and destroying their safehouses. A ceremony was held to welcome back Horn and to publicly exonerate Celchu, but the joy was tempered by the revelation that Airen Cracken had known of Celchu's innocence all along, allowing the trial to go forth in order to lull the real spy into a false sense of security."}, {"tag": "p", "text": "The ceremony also celebrated rylca, a newly-developed cure for the Krytos virus synthesized from bacta and ryll kor. Luke Skywalker was a surprise attendee, revealing to the Rogues that Horn was Force-sensitive, but Horn turned down his offer to train as a Jedi in order to pursue Isard. When Councilor Fey'lya stated that no action would be taken against her, as she had established a new base of power on Thyferra and the New Republic could not interfere in a planet's internal politics, eleven of the twelve Rogues immediately resigned their commissions. With only minimal resources, they managed to lure the Star Destroyer Avarice to the New Republic, and they heavily damaged Lusankya, making her surrender. Ysanne Isard was presumed dead, shot down by the Rogues as she tried to escape. Thyferra was liberated, and Rogue Squadron gained a pilot in Tal'dira. However, Nawara Ven became the Squadron's XO, never to fly an X-Wing again, for he had lost his leg and wasn't able to fly well enough with a prosthetic."}, {"tag": "p", "text": "Rogue Squadron's resignations were never documented by the New Republic—Leia Organa of the Provisional Council later explained to Antilles that they had been \"creatively misfiled\"—and while they were away, the government brought Klivian and Janson back from training duty to cobble together a temporary Rogue Squadron that could be visible for morale purposes. Their promised reward was a permanent return to the Rogues' ranks upon Antilles's homecoming. Rogue veterans like Will Scotian, Gayla Riemann, Carithlee, and several more were recruited for the auxiliary squadron, and its roster was rounded out by two pilots each from Gauntlet Squadron and Corsair Squadron. When Antilles's Rogues returned to Coruscant in 7.5 ABY, Klivian's squadron flew up to meet them and informed them that New Republic High Command was broadcasting their arrival over the holonet. Taking on the \"Red Squadron\" designation out of respect, Klivian's group engaged the Rogues in a friendly contest of aerial maneuvers as they all descended to Imperial Plaza."}, {"tag": "p", "text": "Antilles was whisked to a platform in front of an adoring crowd, where Organa spoke about his recent accomplishments, alerting the Rogue Leader to the fact that the Bacta War had been retroactively sanctioned as an official New Republic operation. A night of raucous celebration followed, with Rogues old and new partying together. It was Aril Nunb's last night with the squadron, as she planned to retain command of the cruiser Valiant that she had captained during the Bacta War. Antilles met with Admiral Ackbar the next morning to outline what he had planned for his immediate future: a new X-wing squadron with a full range of intrusion and subversion skills, that would operate as commandos first and pilots second, to serve in the New Republic's hunt for Warlord Zsinj. He would act as the commander for both the new squadron and the Rogues, but he would personally lead the new group with Janson as his second-in-command. Celchu would take over as Rogue Leader, with Klivian as his second and Nawara Ven as his Executive Officer. Ackbar agreed, on the condition that if Antilles's plan failed, he would accept a promotion to general and join Ackbar's advisory staff. Wraith Squadron was thus born."}, {"tag": "p", "text": "The ersatz Rogue Squadron was disbanded, its pilots and fighter craft returned to their original units. The X-wings of Antilles's Rogues were owned by Celchu, but Antilles had him loan them to the New Republic as part of the deal with Ackbar. They were sent to Home One for repairs and new paint jobs, where Antilles spoke with Celchu and laid out the Rogues' next mission: they would openly join the hunt for Zsinj while the Wraiths would do so more covertly. Some time into the campaign, General Edor Crespin put together a task force of Rogue Squadron, Home One, two frigates, and a number of A-wings, and he sent them to Talasea to await Zsinj's Admiral Trigit. Wraith Squadron, however, were able to take out Trigit's two ships before the task force had a chance to join them. Trigit himself had avoided the battle after realizing it was a trap, and after the Rogues and the Wraiths caught up with each other on Talasea's surface, Wraith Squadron's Face Loran covertly learned that Zsinj and Trigit planned to deal a blow to the New Republic by destroying Rogue Squadron."}, {"tag": "p", "text": "Later in the Zsinj campaign, the Rogues were attached to the Mon Remonda, as were the Wraiths, Nova Squadron, and Polearm Squadron. Commanded by General Han Solo, the MC80B Star Cruiser was the flagship of the entire Zsinj-hunting fleet. Antilles relinquished day-to-day command of Wraith Squadron to Brevet-Captain Loran and transferred back to Rogue Squadron, and flying under him were Celchu as Rogue Two, Pedna Scotian as Rogue Three, Klivian as Rogue Four, Tal'dira as Rogue Five, Darklighter as Rogue Six, Ran Kether as Rogue Seven, Koobis Nu as Rogue Eight, Horn as Rogue Nine, Qrygg as Rogue Ten, Sei'lar as Rogue Eleven, and Inyri Forge as Rogue Twelve. Toward the end of the campaign, Janson and fellow Wraith Myn Donos both transferred to the Rogues."}, {"tag": "h4", "text": "The last Grand Admiral"}, {"tag": "p", "text": "By the year 9 ABY, Imperial territory had been reduced to a quarter of its former size, most of it in outlying sectors along the Rim, but when the brilliant Grand Admiral Thrawn returned from the Unknown Regions and reorganized the Imperial fleet, he began to execute strategic raids along the Empire's border with the New Republic. After a hit-and-fade on the Bpfassh system, Han Solo and the Millennium Falcon were sent to reassure the people of Bpfassh that their government was stil able to protect them, and Rogue Squadron were assigned to escort Solo and his twenty-ship convoy. At that time, the Rogues were attached to Ackbar's office in the New Republic Provisonal Council and answered directly to the Admiral. Antilles was on-world with Han and Leia Organa Solo when Thrawn's Noghri commandos attacked, and only Organa Solo's Force powers saved them from boarding a decoy Falcon. After Solo cut through the enemy ship's coolant lines and released korfaise gas into the air, Rogue Squadron swooped in to protect them. The group's next assignment was escort duty to Sluis Van, with their X-wings remaining aboard the frigate Larkhess as its undermanned crew hauled cargo from Coruscant. Outside of the Sluis Van Shipyards, Antilles noticed a suspiciously empty freighter lurking nearby and ordered the Rogues to their fighters, but as soon as they were spaceborne the freighter blew up."}, {"tag": "p", "text": "Out from the explosion poured a wave of TIE fighters, concurrent with the arrival of an Imperial fleet. Rogue Squadron's only backup was the Millennium Falcon, coincidentally also at Sluis Van, with both Skywalker and Calrissian among Solo's passengers. After he and Rogue Five took out some TIEs, Antilles was fired upon by a friendly Mon Calamari Star Cruiser that had a strange cone-shaped ship nestled against it, and he spotted another such ship being escorted through the battle by four TIE fighters. The Falcon helped him polish those four off, and Solo revealed that the strange cones were mole miners, recently stolen from Calrissian's mining operation on Nkllon. The Imperial were using the miners to burrow into New Republic ships' hulls and commandeer them; without sufficient backup, Solo made it a priority to destroy whichever ones hadn't yet attached themselves to anything. After Antilles and Rogue Five took care of one miner's TIE escort, a space trooper popped out of the cone and impeded the Falcon, leaving it to Antilles to take out the miner as well."}, {"tag": "p", "text": "The battle came to an end when Calrissian used his command codes to activate every mole miner, which then cut through the lengths of their captured ships and left them all disabled. Denied their prizes, the Empire's Star Destroyers withdrew, but the New Republic military forces at the shipyards remained on full alert in the battle's aftermath. A new recruit of Antilles's around this time was Kenn Nitram, who flew as Rogue Three. Rogue Squadron were later back on Coruscant when Skywalker asked Antilles to gather them up and meet him at a spaceport; their X-wings were loaded into a transport for a five-day journey to the location of the lost Katana fleet, which had been found by the smuggler and information broker Talon Karrde. Joining them on the unsanctioned mission were a team of technicians, whom Karrde, Skywalker, and others hoped could get to the fleet before the ambitious New Republic senator Borsk Fey'lya did. At their destination, Rogue Squadron flew escort for the transport as it approached one of the Katana Fleet's dreadnaughts and unloaded a boarding team."}, {"tag": "p", "text": "Fey'lya arrived on the scene in short order aboard the escort frigate Quenfis and ordered the arrest of Skywalker's entire party. Antilles argued with Fey'lya over his comm, insisting that his orders had come from Councilor Organa Solo, until Fey'lya's underling Captain Virgilio ordered him to surrender. Antilles was ready to refuse, even as the Quenfis's own X-wing squadrons bore down on the Rogues, but the arrival of the Imperial Star Destroyer Judicator rendered the discussion moot. The Rogues immediately moved to cover the dreadnaught that Skywalker and Solo had entered, and the boarding team's technicians were able to bring the ancient ship's weapons online and into the battle, but Fey'lya ordered his own squadrons to retreat. Only after Organa Solo and Karrde, who were aboard the Quenfis, tricked Fey'lya into announcing that he considered military forces to be mere tools in his own political ascendency, did his forces abandon him and rally to Rogue Squadron's cause."}, {"tag": "p", "text": "The three New Republic squadrons were able to overwhelm the Judicator's drop ships, TIE fighters, and TIE interceptors, but a single drop ship made it through to cause trouble for Skywalker's team. As the Rogues did battle with more TIEs, both sides received reinforcements: several ships loyal to Karrde and several more loyal to former senator Garm Bel Iblis for the New Republic, and the Star Destroyer Peremptory for the Empire. The Judicator fled after Solo used the dreadnaught's slave rig to send one of the Katana fleet's other ships crashing into the Peremptory and destroying it—the victory was tainted, however, by the discovery that Grand Admiral Thrawn had already seized all but fifteen of the legendary fleet's dreadnaughts and was crewing them with clones."}, {"tag": "p", "text": "One month into the ensuing war, Rogue Squadron were accompanying the Millennium Falcon on a diplomatic mission to Filve in a bid to reassure the anxious Filvian government, when Thrawn's forces suddenly attacked. Although they took out a wave of TIEs, the New Republic forces opted to flee from overwhelming enemy force and a stubbornly closed planetary shield. After drawing out their escape in a bid to give the Filvians more time to organize a defense, they were only able to jump to lightspeed with the help of a Cracken Twist, which broadcasted false jump coordinates to any eavesdropping Imperials. The Imperial Dark Jedi Joruus C'baoth, obsessed with capturing Organa Solo and her unborn twins, subsequently broke off the attack and chased the false coordinates to a dead end. A later battle, fought at Qat Chrystac under General Bel Iblis's command, was a massive fleet engagement between the Empire and the New Republic. Antilles was annoyed when Bel Iblis forbade Rogue Squadron from aiding the outmatched star cruiser Orthavan, but the general in fact needed them in position to draw a group of TIE fighters into the path of a surprise A-wing slash. The technique was small consolation, however; after an Imperial interdiction field went down, the New Republic forces were forced to retreat from a superior foe."}, {"tag": "p", "text": "Back on Coruscant, Antilles and two of his pilots helped covertly escort a ship full of Noghri warriors to a landing pad at the behest of Skywalker, Solo, and Organa Solo—the aliens had recently switched sides and sworn fealty to Organa Solo. Meanwhile, the war against Thrawn's confederation continued to go poorly, as Antilles learned from Pash Cracken while catching up at a briefing led by Ackbar. He also learned that the New Republic would strike at the Imperial-held Bilbringi Shipyards to steal a crystal gravfield trap, which was needed to clear out cloaked asteroids that Thrawn had deposited over Coruscant. In order to plant false intelligence and deceive Thrawn into defending another crystal gravfield trap, this one at Tangrene, Antilles spent some time on a planet close to Tangrene with Janson and Klivian. While making themselves visible, they encountered Aves, a lieutenant of Talon Karrde. Believing that Karrde would sell any information to the Empire, the Rogues hinted that Tangrene was their next destination."}, {"tag": "p", "text": "Grand Admiral Thrawn anticipated the deception, however, and the New Republic task force was pulled out of hyperspace in the Bilbringi system by Imperial interdictors, well back from their target. Rogue Squadron dueled with TIE interceptors as their new goal became to simply stay alive. By this point in Thrawn's campaign, the Rogue Roster was made up of Antilles, Celchu, Flight officer Lyyr Zatoq, Klivian, Janson, Darklighter, Myn Donos, Khe-Jeen Slee, Horn, Qrygg, Sei'lar, and Inyri Forge, and the entire squadron set to work destroying their foes. Opposing their task force were around two dozen Imperial Star Destroyers, eight interdictors, thirty of the Katana fleet's dreadnaughts, numerous Strike- and Carrack-class light cruisers, and a starfighter complement that boasted the 181st Imperial Fighter Wing; flying alongside the Rogues were eleven Mon Calamari Star Cruisers, two Assault Frigates, the Star Destroyer Freedom, various escort ships, and squadrons of A-, B-, X- and Y-wings."}, {"tag": "p", "text": "As Thrawn gloated from the bridge of his flagship, the Chimaera, Admiral Ackbar struggled to hold his star cruisers in combat formation, but Antilles and Celchu realized that a massive Imperial armada arrayed against them meant that the shipyards were not being defended. A sudden comm call from Aves surprised the Rogue Leader, as he learned that Karrde's Smugglers' Alliance was also there to steal the crystal gravfield trap. Aves asked if there were a particular combat area Antilles wanted him to shoot up while he escaped from the melee with the prize, and Antilles suggested he knock out the nearby Golan II defense platforms, which would allow a New Republic incursion into the shipyards. As Aves's people got to work, the Rogues began to fire sustained salvos of proton torpedoes at the Golan, which overwhelmed its shields and allowed two Assault Frigates to swoop in for the kill."}, {"tag": "p", "text": "As Rebel fighters poured into the shipyards, a suddenly less-confident Thrawn was forced to re-deploy some of his forces, but his end came suddenly from the knife of his Noghri bodyguard Rukh, who was avenging Thrawn's betrayal of his people. Word of his death spread to the panicking Imperials, and the Chimaera's Captain Pellaeon ordered a retreat. Unable to comprehend what they were witnessing, Rogue Squadron were ordered back to Home One. There, Ackbar informed Antilles of what had happened before insisting he finally accept a promotion to general, as the other Rogues had been following his lead and refusing overdue promotions of their own. Additionally, with a general at their head, Rogue Squadron could use their experience in the Bacta War and play a leading role in The New Republic's plan to liberate the Ciutric Hegemony from Imperial Warlord Delak Krennel."}, {"tag": "h4", "text": "Empire's end"}, {"tag": "p", "text": "The New Republic took one of the Ciutric Hegemony's outlying planets, Liinade III and then prepared to attack Ciutric itself, the capital planet of the Hegemony, while simultaneously looking for clues that would lead to the remaining Lusankya prisoners. One of them, Urlor Sette, unexpectedly turned up at a party for the squadron, but when Corran Horn recognized him and said his name, an implanted device killed Sette. The Squadron went on a mission to Commenor, finding some of the prisoners and learning that Isard might be alive."}, {"tag": "p", "text": "During the attack on one of Krennel's outlying planets, Horn was shot down. He found a secret facility that showed evidence of a Pulsar Station, not unlike the Death Star, and the Rogues moved to attack it at a moon orbiting a gas giant, only to be ambushed. They were saved by two squadrons of TIE/D Defenders, Stranger and Interloper Squadrons, under the command of Colonel Broak Vessery, and taken to a secret base, having suffered the death of 2 pilots and the critical injury and presumed death of 2 more. Surprisingly, they met Ysanne Isard, who was responsible for their rescue. She revealed that the Isard they had thought they had killed was a clone, and she had survived to make herself a threat, and that all Isard wanted was her demise."}, {"tag": "p", "text": "The squadron was trained to use TIE Defenders and then attacked Ciutric. The New Republic attacked at the same time, killing Krennel in the ensuing space battle. The real Isard tried to recapture Lusankya at Bilbringi, but was shot and killed in the attempt by Iella Wessiri. The real Isard had already betrayed Rogue Squadron by not supporting them in their attempt to kill the clone Isard and rescue the rest of the Lusankya prisoners at Ciutric. Rogue Squadron was successful however, and the clone of Isard was killed."}, {"tag": "p", "text": "While the New Republic was still celebrating their victory over Thrawn, the Imperial Military mounted a massive attack on Coruscant in 10 ABY. Rogue Squadron covered the New Republic's retreat from the embattled world, with Antilles helping coordinate the evacuation. Due to devastating losses in New Republic Army Command, Ackbar promoted him to general and transferred him to the army as a figure around whom the troops could rally, but the two reached a compromise: Antilles would be his Fighter Command Liaison and would retain command of the Rogues, able to fly any missions that did not interfere with his new duties. He was also given command of a fighter wing, which he renamed Rogue Wing. Grown out of Rogue Squadron, it was composed of seventy-two starfighters over twelve squadrons. Meanwhile, an Imperial Civil War erupted within the leaderless Empire, and the New Republic took advantage of the confusion by sending their own captured Star Destroyers into war zones to stir up further chaos. The X-wings of Rogue Wing were aboard those Destroyers, and most were safely on the Emancipator when Antilles and the Liberator went down over Coruscant."}, {"tag": "p", "text": "After escaping the still-raging battle in Coruscant's Imperial City, Antilles and Lando Calrissian were sent to the Battle of Calamari, where Antilles coordinated the planet's air defense alongside General Bel Iblis. Calamari was being ravaged by World Devastator superweapons under the command of Luke Skywalker, who had been turned to the dark side and was serving as the Empire's Supreme Commander under a reborn Emperor Palpatine. Rogue Squadron was deployed into the battle, with Antilles piloting a V-wing airspeeder and Kasan Moor once again flying for the Rogues. The battle was finally won when R2-D2 beamed the Emperor's master control signal—given to him by Skywalker, whose dark turn had partially been a deep undercover ruse—into the World Devastators' control computers, which caused the massive machines to turn on and destroy each other. Although Palpatine managed to unite the feuding Imperial factions into a Dark Empire, his final death halted his destructive campaign and saw the Imperial fleet again splinter into warlordism. With the Empire in ruins, the New Republic was able to retake Coruscant, with Antilles commanding Rogue Squadron during the siege."}, {"tag": "p", "text": "With secure control of the galaxy once more, the New Republic began to reassess its military forces in the wake of the new and advanced weaponry the Dark Empire had used against them. Although Rogue Squadron was a nearly mythical name by this point, Antilles's superiors wanted it changed, and they ordered him to reconfigure it into a versatile unit composed of several different kinds of fighters, which they felt would allow for more flexibility in battle. Antilles's protests were overruled, and his distaste for bureaucracy prompted him to command the Rogues from afar, stationed on the bridge of the Lusankya. Over one hundred fighters from a broad range of ships in Lusankya's hangars were available for Rogue Squadron alone, the new version of which saw its first round of action in the Battle of Phaeda in 11 ABY. The Rogues arrived at the planet to defend its New Republic outpost from the Steadfast, a Star Destroyer of Lord Carnor Jax's Crimson Empire, in a squadron composed of E-wings, B-wings, and A-wings. A diversionary force, Rogue Squadron kept the Steadfast's TIEs occupied until Lusankya emerged from hyperspace, and the Imperials were soon defeated. The Steadfast was captured and Phaeda was liberated, and not long afterward, central Imperial leadership collapsed, and the Galactic Empire ceased to exist."}, {"tag": "h4", "text": "Pirates and remnants"}, {"tag": "p", "text": "Later in 11 ABY, the Rogues were again a squadron exclusively composed of X-wings. They were assigned to hunt for the Invids, an elusive pirate group led by ex-Imperial Moff Leonia Tavira, who eluded every attempt by the New Republic to capture her. The Rogues found themselves with about a week of down time in between raids. On one raid, they intercepted a group of Invid ugly starfighters in the K'vath system and easily disposed of them, capturing the modified bulk cruiser Booty Full. The New Republic capital ships waiting just outside of the system were disappointed, however, that Tavira's Star Destroyer Invidious was not present. Squadron members flying under Rogue Leader Celchu included Corran Horn as Rogue Nine, Darklighter, Klivian, Janson, Qrygg, Reme Pollar, Vurrulf, and Ghufran, but Horn left the squadron shortly afterward in order to train as a Jedi in Master Luke Skywalker's New Jedi Order. He ended up going undercover with the Invids during a hunt for his missing wife, Mirax, and when the New Republic tracked the Invidious to Xa Fel and attacked, the Rogues were unaware that they were flying against Horn. Commanding Rock Squadron, Horn dodged away from Darklighter but was forced to disable Qrygg's ship with an ion blast; he then narrowly avoided Celchu's proton torpedoes before escaping."}, {"tag": "p", "text": "Horn was eventually able to rescue his wife from the Force-sensitive Jensaarai, who had been helping Tavira anticipate the New Republic's strikes, and the threat of the Invidious was effectively neutralized. The Rogues removed the Invid-affiliated Khuiumin Survivors from their base on Courkrus and brought them to Susevfi, where Celchu arranged for them to become the planet's new defense force. In 12 ABY, while Luke Skywalker was investigating the Valley of the Jedi on the planet Ruusan, he called on Rogue Squadron to help chase the forces of the the Dark Jedi Desann away from the site. Skywalker and his Jedi trainee Kyle Katarn later infiltrated Desann's Doomgiver flagship, and Katarn sent a warning to the Rogues about the Dark Jedi's planned attack on the Jedi Praxeum on Yavin 4. Above the jungle moon, the Rogues assaulted the carrier after Katarn sabotaged its shields, but Desann was still able to land on the surface with his ground forces. He was killed by Katarn in lightsaber combat, however, and Rogue Squadron destroyed the Doomgiver when Celchu took out its bridge."}, {"tag": "p", "text": "Although the Empire was dead, Imperial Admiral Daala united the holdings of twelve Warlords sequestered in the Deep Core in 12 ABY, and Admiral Pellaeon then took her United Warlord Fleets to the galaxy's northern quadrant and absorbed various surviving Imperial Rim factions into a new government: the Imperial Remnant. He quickly demonstrated the might of his new Empire with the Orinda campaign, taking the Super Star Destroyer Reaper and the 181st Imperial Fighter Wing to Orinda and capturing it. He also took six systems coreward of Orinda along the Entralla Route, and the New Republic responded by sending in Rogue Squadron and the Lusankya, commanded by General Antilles. As the two dreadnaughts stalked each other through the Mid Rim, the Rogues clashed with the 181st in a series of strikes and parries, with the first engagements occuring in the Darkon and Traval-Pacor systems. The Lusankya and the Rogues won both battles against their counterparts, securing the systems, but the 181st fought the Rogues to a stalemate at Orocco afterward."}, {"tag": "p", "text": "After the 181st bested the Lusankya at Tyan, the New Republic military sent Admiral Areta Bell and the fleet carrier Endurance to support their forces, and Pellaeon gradually fell back, losing to the combined New Republic forces at Obredaan. Although Antilles was merely hoping to destroy what he thought was the Empire's last Super Star Destroyer, Bell was under pressure to prove that starfighters, and especially her E-wings, were superior to dreadnaughts. Orinda played host to a final showdown, where Rogue Squadron and the rest of the New Republic forces engaged the Reaper and the 181st, and where Pellaeon sprang a trap. Six interdictor cruisers and the dreadnaught Dominion, commanded by Admiral Teren Rogriss, emerged from hyperspace and destroyed the Endurance, along with the E-wing squadrons in its hold. As the Lusankya's shields became a sheet of flame, Antilles prepared to abandon ship, but when the Rogues punched a hole in the interdictor screen he was able to flee with them. The Remnant's southern borders were secured, but the New Republic fortified surrounding systems."}, {"tag": "p", "text": "A situation on the newly discovered planet of Adumar called for Antilles to return to the cockpit with Celchu, Janson and Klivian in 13 ABY. The diplomatic envoys succeeded in bringing the neutral world to the New Republic, with the four pilots using Rogue Squadron markings on their X-wings while flying as \"Red Flight\" with the call signs Red One through Red Four. In the process, they found themselves facing off against new 181st leader Turr Phennir and three of his pilots."}, {"tag": "p", "text": "By the year 18 ABY, Antilles was once again commanding Rogue Squadron, and in 19 ABY the Rogues were assigned permanently to General Bel Iblis. Although the Imperial Remnant was on its last legs, the Rogues still had no love for the Empire, and the fact that the New Republic's bureaucracy contained ex-Imperials was a particular sore spot for them. When Bel Iblis was sent to a starfighter base on Morishim, Antilles, Celchu, and Janson ran into Lando Calrissian in a crowded marketplace on the surface, and the four learned some shocking news: a group of Bothans were responsible for the long-ago destruction of Caamas. They launched into space when an Imperial corvette and Star Destroyer arrived in the system, but to their surprise, the Destroyer tractored the corvette and jammed its communications. The Rogues were helpless to save the smaller vessel, but from his yacht, the Lady Luck, Calrissian led them in diluting the jamming enough to receive a fragmented message from the corvette before the Destroyer jumped to lightspeed."}, {"tag": "p", "text": "Precisely which Bothan clan had been complicit in Caamas's destruction was unknown, but many New Republic member worlds began calling for retribution against the Bothans as a species, kicking off the Caamas Document Crisis. Ancient planetary rivalries began to resurface, and riots sprang up throughout New Republic space, including one on Bothawui that was instigated by Imperial agents. The agents were loyal to Moff Disra, who had formed a Sinister Triumvirate within the Imperial Remnant and was conspiring against Pellaeon—the triumvirate was secretly goading the New Republic toward collapsing from within, while their Supreme Commander meanwhile intended to sue for peace. The corvette at Morishim, intercepted by Disra's forces, had been one of Pellaeon's overtures. During the crisis, Rogue Squadron were near Sif'kric when the native Sif'krie sent a distress call regarding their belligerent Frezhlik neighbors. Anticipating a large Frezhlik invasion fleet during the brief hyperspace journey, Bel Iblis's small task force was surprised to be greeted by an aged and ramshackle armada."}, {"tag": "p", "text": "Although the Frezhlik insisted their presence above the planet was peaceful, the Rogues realized they were using intimidation to blockade the planet and prevent the Sif'krie from exporting a harvest of pommwomm plants, which would soon spoil and rob the planet of twenty percent of its gross annual product. Further attempts at diplomacy by Bel Iblis led to the Frezhlik Speaker revealing that his people sought punishment for the Bothan government, while the Frezhlik did not. Frustrated that New Republic regulations prevented him from interfering in intra-system politics, Bel Iblis turned to Corran Horn, whose father-in-law Booster Terrik had business interests in the sector. When Horn ID'd a Sif'krie freighter as one of Terrik's, Bel Iblis allowed Rogue Squadron to investigate it under the pretense of a suspicion of smuggling. The Rogues barrelled straight through the Frezhlik formation on a direct route to their target, and the spooked Speaker ordered his battle wagons to open fire. Bel Iblis coldly ordered his ships to overpower their attackers, and the task force next launched for Mengjini, where a HoloNet relay had been taken down by dissidents."}, {"tag": "p", "text": "As the crisis escalated, the government of Di'tai'ni requested Bel Iblis's help in settling a labor dispute on their world, which the Rogues realized was suspiciously close to the Both system. The general ordered them to sleep in their X-wings so as to always be ready to fly at a moment's notice, and sure enough, one week after their engagement at Sif'kric, they were woken up by a panic call from Bothawui. Arriving ahead of the rest of their task force, Rogue Squadron found an armada from the Leresen system arrayed against them, anchored by six capital ships. As two Leresai had been killed at the riot on Bothawui, they were demanding twenty Bothan lives in return, in accordance with Leresen law. Horn's Jedi senses warned him of danger if the Rogues' X-wings locked their S-foils in attack position, and the reason why soon became clear: Two Leresen techs on Di'tai'ni had sabotaged their weapons systems. The squadron could only watch helplessly as the Leresai destroyed a small space station in orbit of the planet."}, {"tag": "p", "text": "The brewing schism in the New Republic saw warships from numerous member worlds arrive at Bothawui for a standoff—half of them were calling for Bothan punishment, while the other half felt as the Di'tai'ni did and had sprung to the Bothans' defense. Further complicating matters was the apparent return of Grand Admiral Thrawn, who offered to sit down with Bothan clan leaders and discern who was responsible for Caamas, an offer that led to even more infighting within the New Republic Senate. Under Bel Iblis's command, the Rogues flew in the Battle of Yaga Minor that, with aid from Talon Karrde and the mysterious Aing-Tii monks, exposed Disra and his impostor Thrawn. Concurrently, the identity of the guilty Bothans was brought to light when Skywalker, Mara Jade, and R2-D2 stole a copy of the Caamas Document from Soontir Fel on Nirauan. Pellaeon and New Republic Chief of State Ponc Gavrisom swiftly signed a treaty that formally ended the Galactic Civil War."}, {"tag": "p", "text": "Not long afterward, news of Skywalker and Jade's impending wedding reached Rogue Squadron Headquarters on Coruscant, and several squadron members joined the groom-to-be for his bachelor party at the planet's Red Rancor cantina. They survived a bar-room brawl, but on the day of the ceremony they learned of a sabotage plan by a group of disgruntled ex-Imperials. Antilles quickly rounded up a team that included Celchu, Janson, Klivian, and Darklighter, and they were able to take out the attackers and their hired swoop gangs. Imperial ringleader Derran Takkar slipped through their defenses and confronted the couple on the altar, however, but Skywalker was able to talk him out of downloading a computer virus into the New Republic's systems. The wedding continued as planned, and Skywalker and Jade became husband and wife."}, {"tag": "h4", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "Following the New Republic's peace accords with the Imperial Remnant, a number of Rogue veterans retired from the military, including Antilles, Celchu, Horn, Klivian, and Janson. Celchu retired shortly after Antilles did, and he handed command of Rogue Squadron over to Gavin Darklighter, a decision that he and Antilles had both made. Antilles's faith in Darklighter helped him during his early days as Rogue Leader, and he chose veteran pilots Inyri Forge and Alinn Varth as his flight leaders. Peacetime saw many young pilots shift their careers toward interstellar goods transport and its promises of lucrative pay, but Darklighter still faced the difficult task of weeding out many young recruits. By 25 ABY, members of his squadron included Kral Nevil, Ligg Panat, Tik, and Dinger, and they flew the T-65A3 version of the X-wing starfighter, which had been tested against pirates during peacetime."}, {"tag": "p", "text": "When Leia Organa Solo appeared before the New Republic Senate with warnings of an invading alien force in the Outer Rim, her pleas fell on deaf ears, but a simulation was made of the invaders from data she had brought with her. Darklighter lasted a mere twenty-five seconds against an enemy coralskipper fighter craft, while his commanding Admiral Traest Kre'fey failed in fifteen, as the craft was equipped with invisible vortices that could swallow laser blasts and take down enemy shields. Kre'fey decided to independently investigate the Rim, disguising his actions by having Rogue Squadron simulate pirate attacks. He thus would not be openly defying Chief of State Borsk Fey'lya, and he could give the Rogues complete freedom of movement. They traveled to the Rim aboard the Bothan Assault Cruiser Ralroost."}, {"tag": "p", "text": "The extra-galactic Yuuzhan Vong proved to be formidable foes, and Tik and Dinger were both killed during Rogue Squadron's first encounter with coralskippers. The engagement was won when the Rogues deployed countermeasures against the dovin basal gravity wells: they expanded their inertial compensators to protect their shields, and fired successive cycles of short, low-powered shots that hit the coralskippers too quickly to all be caught by the dovin basals. Tik and Dinger were respectively replaced by Anni Capstan and Jaina Solo, the teenage daughter of Leia Organa Solo. After evacuating Dubrillion, Rogue Squadron headed to Dantooine,where Organa Solo hoped to resettle refugees. Ready for an attack, the Rogues planned their defense alongside two squadrons of uglies, and Solo suggested detonating proton torpedoes just shy of enemy dovin basals in order to do some damage without the missiles being completely sucked in. Darklighter told the pilots that protecting the refugees was their top priority, even if it meant slaughtering Yuuzhan Vong warriors with their ships' lasers."}, {"tag": "p", "text": "In the Battle of Dantooine, half of the squadron's roster was wiped out, with only Darklighter, Nevil, Forge, Varth, Capstan and Solo surviving. Yuuzhan Vong ground forces did massive damage as well, and half of the refugees perished, the other half being evacuated to Agamar. Back on Coruscant, Darklighter and Kre'fey found Chief of State Fey'lya and his Advisory Council still unwilling to accept the significance of the new threat, and their response was to threaten a mass resignation of the entire New Republic military. Only with help from Leia Organa Solo and Senator Elegos A'Kla were they able to secure Fey'lya's provisional support, and the Yuuzhan Vong War had officially begun. A dejected Darklighter was cheered by the sudden arrival of Antilles and Celchu, who were ready to aid him in the conflict, and the two Rogue veterans began working with Jaina Solo and her Force senses to help choose new pilots for the squadron. After the rebuilt Rogues helped insert several of Master Luke Skywalker's Jedi onto Garqi, the Ralroost next launched for Sernpidal."}, {"tag": "p", "text": "The planet had been destroyed when the Yuuzhan Vong had crashed a moon into it, with Chewbacca among the casualties, and Kre'fey suspected a nefarious reason why. Rogue Squadron's reconaissance provided an answer: Yuuzhan Vong biotechnology was using chunks of destroyed world to build an organic shipyard. Back at Garqi, the Rogues helped extract the Jedi strike team, and their proton torpedoes proved effective against coralskippers when two were fired in succession with the first programmed to detonate prematurely—when the coralskippers dedicated their dovin basals to propulsion rather than defense, thus escaping the first explosion, the second torpedo could sneak past their defenses. The New Republic forces were yet outnumbered, but the arrival of Gilad Pellaeon in the Chimaera tipped the battle in their favor, as Organa Solo had recently visited Bastion to request the Imperial Remnant's assistance in the war. With Pellaeon was Force Spike, a squadron of Chiss clawcraft from Thrawn's Household Phalanx that cut through the coralskippers with ease. Their leader was Jagged Fel, son of Baron Soontir Fel."}, {"tag": "p", "text": "Kre'fey and Pellaeon knew that the enemy would attack Ithor, as their biotechnology was vulnerable to the pollen from bafforr trees that grew on both Ithor and Garqi. Fel's squadron proved formidable foes for the Rogues in simulations, and the young man did not show himself until a reception aboard the Ithorian Herdship Tafanda Bay, where he introduced himself to Jaina Solo. Unimpressed with his frankness were Borsk Fey'lya and the members of his Advisory Council, who had come to Ithor but were still suspected by the military of looking out for their own political interests. When the battle came, four Rogues were killed, including Capstan, but the remaining squadron members were able to destroy several enemy landing craft, including ones headed for the Tafanda Bay. A one-week truce was called when Corran Horn, now a Jedi, proposed a duel with Yuuzhan Vong Commander Shedao Shai, with Shai agreeing to leave Ithor alone if he lost. Heaps of Ithorians were evacuated during the respite."}, {"tag": "p", "text": "Although Shai was killed by Horn, his successor Deign Lian reneged on the agreement and sent a bioweapon onto the planet inside twelve yorik coral pods. The joint New Republic–Imperial Remnant fleet responded by destroying Lian's flagship, the Legacy of Torment, but Ithor and its massive biodiversity were completely lost. In the wake of the disaster, Pellaeon was recalled to Bastion, Horn and the Jedi were villified by the media, and the New Republic military became subjected to senatorial oversight. Jaina Solo was deeply hurt by the death of Capstan, her wingmate, but Fel decided to keep two of his squadrons with the New Republic to liaise with Rogue Squadron. Jaina Solo received temporary leave from the squadron four months after joining, and she visited her brothers at the Jedi Praxeum on Yavin 4, but she was back in action at the beginning of 26 ABY when the Yuuzhan Vong struck at Kalarba."}, {"tag": "p", "text": "After conquering such New Republic worlds as Gyndine, Bimmiel, and Tynna, the Yuuzhan Vong used a dovin basal to pull Kalarba's orbiting Hosk Station into a collision course with the planet. The stations's turbolasers and defense force were vanquished, and the Bothan Assault Cruiser Champion led Rogue Squadron, Chiss clawcraft, and two squadrons of E-wings in fighting off the attackers as Kalarbans fled their doomed world en masse. Already a veteran of dozens of battles with the Rogues, Jaina Solo flew in a flight group under Major Varth and helped destroy enemy coralskippers, but when Champion lost its shields, its destruction caught Solo's X-wing and forced her to eject. Bacta helped her heal from magnetic field exposure, and when Major Harthis from Darklighter's office located her family, she joined them on Duro to complete her recovery. Meanwhile, the Yuuzhan Vong continued on from Kalarba and took both Druckenwell and Falleen."}, {"tag": "p", "text": "Solo took a leave of absence from the squadron while her eyes healed, which kept her out of a cockpit for months. Darklighter was reluctant to recall her to duty following her recovery, however, owing to her status as a Jedi—the Yuuzhan Vong Warmaster Tsavong Lah had, after the Fall of Duro, publicly promised that he would invade no more planets if all Jedi were turned over to him. Solo had additionally been involved in an unsanctioned evacuation of the Jedi Academy on Yavin 4, and to her disgust, Darklighter asked her to extend her leave of absence indefinitely in late 26 ABY. That same day, Rogue Squadron were on Coruscant, and they mobilized to protect Luke and Mara Jade Skywalker as the two Jedi Masters fled from a New Republic arrest warrant in their starship, the Jade Shadow. Although Darklighter was angered by Fey'lya's actions against the Skywalkers, Luke managed to talk him out of risking his career, and the Jade Shadow ultimately made their getaway without the Rogues' assistance. Solo was nearby in her own X-wing to escort her aunt and uncle, and Darklighter took the opportunity to contact her and apologize, and to let her know that he still considered her a part of the squadron."}, {"tag": "p", "text": "When Solo tracked down the rogue Jedi Kyp Durron at her uncle's behest, he revealed to her that the Yuuzhan Vong were growing a gravitic superweapon within the remains of Sernpidal. With himself on bad terms with the New Republic military, he asked for her help in getting the news to them, and when she reached out to Darklighter a meeting was arranged with General Antilles on Chandrila. Antilles knew that a strike on the weapon would never receive Senate approval, but Solo and Darklighter's convictions were enough to convince him to use his influence to organize a volunteer fleet. Admiral Kre'fey and the Ralroost joined in the venture, and the fleet entered the Sernpidal system with the aid of an old interdictor he had been restoring. Rigged to explode when its shields reached twelve percent, the derelict ship took care of a number of the Yuuzhan Vong's defenses, and the Second Battle of Sernpidal began. Solo flew once again with Rogue Squadron, serving under Alinn Varth in Three Flight alongside a Duros named Lensi and a Twi'lek Rogue Ten."}, {"tag": "p", "text": "The war saw the adoption of several new technologies, including the shadow bomb and XJ3 model X-Wing fighters. The Rogues joined a small group of New Republic forces who took a stand at Borleias, and in 29 ABY they flew in the Battle of Yuuzhan'tar that ended the war and forced the enemy to surrender. Following the conclusion of the war, Colonel Darklighter accepted a Fleet command and handed Rogue Squadron over to a new Rogue Leader."}, {"tag": "h3", "text": "Galactic Alliance vets"}, {"tag": "h4", "text": "Further deployments"}, {"tag": "p", "text": "In 36 ABY, the Galactic Alliance found itself caught in the midst of the Swarm War between the Chiss Ascendancy and the the Colony. Gilad Pellaeon, Supreme Commander of the Galactic Alliance Defense Force, hoped to decimate the Colony's swarms of insectoid Killiks at the Unknown Regions world of Tenupe, but Jedi Master Luke Skywalker proposed a different plan: He would neutralize the Colony's Force‐sensitive Joiner leaders, Lomi Plo and Raynar Thul. Although the Chiss Expansionary Defense Force would consequently face the Killiks without Alliance assistance and would take heavy casualties, Skywalker knew that the hive minded Colony would collapse without its leadership and bring a quick end to the war. The mere destruction of their fleet would simply prolong the conflict and prompt the Chiss to commit speciecide with their parasite bomb weapon."}, {"tag": "p", "text": "Rogue and Wraith Squadrons were assigned to support Skywalker as he made his way to the Admiral Ackbar, a captured Star Destroyer where Thul and Plo were stationed. As they escorted the Jedi Master's shuttle through the Battle of Tenupe, Alliance turbolasers brought down the target's shields and took out Killik dartships. Proton torpedoes from the Alliance fighters destroyed more dartships, and the Rogues personally took care of the enemy starfighters that were launched from the Admiral Ackbar's hangar bays. A tractor beam from an Alliance Star Destroyer removed the remaining dartships, and Skywalker was able to board the target and achieve his objective. With the Killik threat removed, the Chiss Ascendancy agreed to not continue pursuing the war."}, {"tag": "p", "text": "In the year 40 ABY, the Five Worlds government of the Corellian system came into conflict with the Galactic Alliance, and Chief of State Cal Omas imposed a blockade of Corellia. Rogue Squadron were stationed with the blockade, and Jaina Solo, who had been prompted by the crisis to reenlist as an active starfighter pilot, served as a colonel and as Rogue Leader. In XJ7 X-wing starfighters, the squadron flew patrol duty in the Corellian Exclusion Zone behind Colonel Jacen Solo of the Galactic Alliance Guard, who had been given temporary command of the battle group. Due to tensions between the Solo twins, they were unable to maintain a Force meld with each other and with fellow Jedi Zekk. Tensions between the three further escalated when Jacen ordered Zekk to turn back a water tanker that was attempting to supply some Corellian shipyards, an order to which both Zekk and Jaina objected on moral grounds."}, {"tag": "p", "text": "For three hours, the Rogues intimidated transports and supply vessels into turning around, albeit without firing any shots. When ships of the Corellian defense fleet finally arrived, Jacen destroyed a Corellian attack fighter after it launched a missile at him, effectively firing the first shot of the Second Galactic Civil War. When the blockade reached its sixth day, capital ships from several worlds sympathetic to Corellia's cause arrived to lend aid to the bedevilled planet. To avoid a major confrontation, Jaina and Zekk were the only two Rogues to accompany Jacen in that day's harrying sortie, which saw a spirited Atzerri freighter nearly collide with both Solo twins. Jaina disabled both of its laser cannons but was nevertheless ordered to destroy it by her brother; as the vessel was civilian, no longer a threat, and had already begun to flee, Jaina refused the order. Her brother consequently took out the ship and immediately suspended Jaina from duty. When Jacen attempted to court-martial her, Zekk resigned his commission in Rogue Squadron, and he and Jaina instead dedicated their war effort to the Jedi Order."}, {"tag": "p", "text": "By 41 ABY, Jacen Solo had become a co-Chief of State of the Galactic Alliance, and in that year he led a strike at the Corellians' Centerpoint Station. Rogue Squadron launched from his flagship, the Anakin Solo, and soon encountered Rakehell Squadron, a group of Rogue alumni and other veteran pilots that was flying for the Alliance-opposed Jedi Coalition. Aerial combat commenced between the two squadrons. As former Rogue Leader Wedge Antilles and his daughter Syal, both flying for Rakehell, engaged in a dogfight with their enemies, Syal took out a Rogue and her father killed Lensi, the Rogue Leader. The Rakehells were not without losses of their own: the Jedi Knight Twool, Rakehell Six, was killed, and two more of their fighters were heavily damaged. The Confederation, another party in the war, soon joined the fray when a Commenori task force reverted from hyperspace to support the Corellians, and the Rogues broke away from the Rakehells to engage the new threat. The battle came to an end when Centerpoint was destroyed, owing to sabotage from a Jedi strike team that had been escorted aboard the station by the Rakehells."}, {"tag": "h4", "text": "A new rebellion"}, {"tag": "p", "text": "Rogue Squadron was still an active squadron in 137 ABY as the most elite of all of the squadrons in the Galactic Alliance Remnant. Although the Galactic Alliance had since fallen, Admiral Gar Stazi was leading its Remnant in a campaign of hit-and-run battles against Darth Krayt's Galactic Empire, that formed a large theater of the ongoing Second Imperial Civil War. The Rogues were stationed aboard the Indomitable, a Scythe-class battle cruiser that served as the flagship of the Galactic Alliance Core Fleet, and were flying CF9 Crossfire starfighters. The Weequay Jhoram Bey was Rogue Leader, and the squadron members included the Klatooinian Ronto, the young and brash Human Anj Dahl, the hot-headed Dug Andurgo, and the Mon Calamari Monia Gahan, niece of former Galactic Alliance Triumvirate member Gial Gahan. In 137 ABY, the former Mandalorian Hondo Karr joined the squadron, and he quickly got into a knife fight with Andurgo aboard the Indomitable. After Commander Bey broke it up, Dahl and Gahan reported to Admiral Stazi that Gahan's uncle would help them capture the Imperious-class Star Destroyer Imperious from Krayt's Empire."}, {"tag": "p", "text": "During the Battle of Mon Calamari, two members of Rogue Squadron fought not from their cockpits, as Monia Gahan sliced into the Mon Calamari Shipyards' guns using codes provided by her uncle, and Karr led a task force that took control of the Imperious's bridge. Admiral Dru Valan of Krayt's Outer Rim Third Fleet let the captured ship escape so that he could focus on Stazi, but the Alliance Remnant fleet evaded him by moving to the far side of the planet-ringing shipyards. The Rogues took on incoming waves of Predator-class starfighters, flying interference and destroying several fighters, but Ronto was shot down and barely managed to get to an escape pod. From the Pellaeon-class Star Destroyer Relentless, Valan obsessively closed in on Stazi while letting the rest of the Remnant ships escape, and Bey returned to the Indomitable to rescue an injured Stazi from his crippled flagship. When Captain Jaius Yorub refused to let Stazi, who had become a symbol of hope, pilot his ship on a suicide run, a punch to the admiral from Bey let Yorub take his commanding officer's place."}, {"tag": "p", "text": "Bey and Stazi, escorted by Dahl and Andurgo, jumped to hyperspace and made it safely back to the Alliance rendezvous point, while Yorub and the Indomitable took out one third of the enemy shipyards. Bey was promoted to captain and took Yorub's former position at Stazi's side, and Dahl became the new Rogue Leader. Three days later, Darth Krayt enacted retribution on the Mon Calamari by declaring a genocide of the entire species, and Monia Gahan—trapped in Dac's New Coral City—witnessed the execution of her uncle and scores more of her kin via hologram. Only the intervention of Imperial Knights Treis Sinde and Sigel Dare prevented Gahan herself from being subdued by stormtroopers, as the two had sabotaged the Imperious before its capture and needed her help to warn Admiral Stazi. Gahan convinced them to also rescue Ronto and several other captive Alliance pilots, and Ronto piloted a shuttle free of the besieged world while Treis Sinde stayed behind to fend off the Sith Lord Darth Azard. Back aboard the Imperious, the seeds of an alliance between the Galactic Alliance Remnant and the Imperial Knights' Empire-in-exile were planted, and Stazi defiantly renamed his new ship the Alliance."}, {"tag": "p", "text": "The alliance was tested in the Battle of Ralltiir, a joint operation between the Alliance Remnant and the Empire-in-exile, where each government fielded an armada in an attack on Darth Krayt's Third Fleet. Stazi's ships arrived first, and the Rogues were tasked with taking out an ion cannon on Ralltiir's Moon Twelve before it could set up a force field. Gahan and Andurgo quickly achieved their objective before moving on to target TIE predators. When Admiral Edouard Fenel showed up with the Bastion Second Fleet to aid Stazi, Krayt's Admiral Kelsan surrendered to overwhelming enemy strength, but his subordinate Captain Vaclen Tor of the frigate Steadfast refused the order, vowing to deny so many captured ships to their foes. Buoyed by Tor's resolve, Kelsan ordered all ships of the Third Fleet to self-destruct, and an enraged Fenel instructed his forces to fire on the enemy escape pods. Stazi quickly placed his own ships, including Rogue Squadron, in between the rival Imperial fleets in a bid to prevent a massacre."}, {"tag": "p", "text": "The Steadfast's escape pods and self-destruct mechanism had been damaged, however, and the Rogues flew cover for the frigate as Fenel launched his own TIE predators to destroy it. Unwilling to be treated as less than an equal in his alliance with Fenel's government, Stazi had his fleet lay down suppressing fire to ward off Fenel's starfighters, and a breakdown of the alliance was only averted when Stazi was able to contact exiled Emperor Roan Fel and remind him of their equality. Later, while the Galactic Alliance Core Fleet was stationed in the Arkanis sector, Captain Bey told the Rogue pilots of their next mission in a briefing room aboard the Alliance: They were to rescue a group of Mon Calamari refugees from Napdu, a moon of Da Soocha. While the rest of the squadron waited a quick hyperspace jump away, Anj Dahl and Hondo Karr landed on Napdu to meet with their contact: the Hutt Azzim Anjiliac Atirue."}, {"tag": "p", "text": "Azzim arranged for his guards to stun the two Rogues at their landing site in order to fool potential Imperial spies, but he treated them cordially inside his Maya Armus spa as details were finalized. When the Mandalorian bounty hunter Tes Vevec—Hondo Karr's ex-wife—suddenly dropped in and attacked Karr, he fended her off as Dahl contacted Rogue Squadron to execute the plan: protect a decoy YZ 3000 tanker from waiting bounty hunters while another tanker, in fact packed with refugees, made it to lightspeed safely. Dahl went back for her teammate, but Karr decided to leave the Rogues and team up with Vevec to pursue the Mandalorian traitor Yaga Auchs. One member short, the squadron continued serving Stazi, and during a quick reconnaissance flight over enemy-occupied Dac, they were horrified to discover millions of corpses floating on the surface of the water world—Krayt's Empire had expedited their planetary genocide by releasing viral spores into the oceans."}, {"tag": "p", "text": "An enraged Andurgo launched his Crossfire at some nearby TIE predators, and after the Rogues quickly took out their foes, Dahl overlooked his actions due to the gravity of the situation. Their Admiral's response was to quickly organize a massive Evacuation of Dac, during which the Rogues helped fend off Imperial forces who were targeting the volunteers of the ad hoc emergency evac fleet. The Imperials retreated when Roan Fel's General Oron Jaeger showed up with a fleet of his own, and evacuation continued unimpeded until time ran out. Only twenty percent of the planet's population was saved."}, {"tag": "p", "text": "The Galactic Alliance Remnant united with the Empire-in-Exile and the New Jedi Order in an Alliance against Darth Krayt, who began an aggressive military push against his foes. Admiral Stazi brought the Alliance and the Rogues to Falleen to stop Imperial forces from bombing the planet, which was facing retribution for being unresponsive to Sith–Imperial overtures. Also at Falleen was the Mynock, the ship of the famed Sith hunter Cade Skywalker; while Rogue Squadron faced off against TIE predators, Skywalker and Jedi Master Wolf Sazen boarded the Imperial battle cruiser Darklight and planted explosives, which won the day for the Alliance. Back aboard Stazi's flagship, Anj Dahl became acquainted with the Mynock's pilot, Jariah Syn, while Skywalker spoke with Stazi. Rogue Squadron and the Alliance fleet later came to the Jedi's aid in the evacuation of their Hidden Temple, arriving with one of Fel's fleets to trap an attacking Imperial armada."}, {"tag": "p", "text": "Having orchestrated the battle so that the entire Alliance would be in one place, Darth Krayt seized the moment and unleashed his secret Sith troopers into the fray, who broke through the Alliance screen with their Dragon ships and Annihilator-class starfighters. While they indiscriminately blasted friend and foe alike on their way to the surface of Taivas, Rogue Squadron were already planetside, saving the Mynock from the elite Imperial Skull Squadron. Syn and the Mynock were thus able to rescue Skywalker from the temple after it launched its evac ships into the sky—he had remained behind to protect Jedi Master T'ra Saa from the attacking Sith troopers, which allowed her to channel the planet's energy into a beam of light that blasted into space and created an escape corridor for the overwhelmed Alliance fleet. Escaping with them were Skull Squadron and a number of other Sith–Imperial forces who followed Moff Rulf Yage in defecting from Krayt's Empire."}, {"tag": "p", "text": "After regrouping at Bastion, the Alliance quickly launched for Coruscant, where a strike team of Jedi and Imperial Knights disabled the fortress world's orbital defenses. The move allowed the combined Alliance fleets to attack, and the Rogues and Skulls flew into battle together against the Sith Troopers and their Annihilators. Andurgo and Ronto both fell to enemy fire, but when Skywalker killed Krayt on the planet's surface, the Sith Troopers began to go mad. Krayt's surviving Sith acolytes fled the system, and a new Galactic Federation Triumvirate was formed by the victorious Alliance."}, {"tag": "h2", "text": "Rogue Leaders"}, {"tag": "h3", "text": "Luke Skywalker"}, {"tag": "p", "text": "Luke Skywalker was one of two Red Squadron pilots to survive the Battle of Yavin in the year 0 BBY, an engagement in which he personally fired the proton torpedoes that destroyed the Empire's Death Star battlestation. New to the Rebel Alliance, the Force-sensitive Skywalker initially honed his talents as a pilot rather than his skills as a Jedi, and he was placed in charge of the burgeoning Rogue Flight by the Alliance's Commander Arhul Narra, leading them in various missions and racking up a number of victories. Skywalker commanded the ad hoc Rogue Group in 3 ABY's Battle of Hoth, after which Wedge Antilles ascended to the Rogue Leader position. Skywalker flew often with the new Rogue Squadron over the following year, however, taking the position of Rogue Leader with Antilles flying as Rogue One. In 4 ABY, Skywalker permanently retired from the Rogues, deciding to finally concentrate on rebuilding the Jedi Order. Nevertheless, he was promoted to the rank of general in the young New Republic, a commission which he did not resign until one year after Endor."}, {"tag": "h3", "text": "Wedge Antilles"}, {"tag": "p", "text": "A veteran of the cockpit, Wedge Antilles was often acclaimed as the best starfighter pilot in the galaxy. He developed tactics which were used as textbook examples for new Rebel pilots, and his X-wing piloting was used in simulators throughout the galaxy. His name was revered even among Imperial squadrons, and it went on to become synonymous with Rogue Squadron itself. A Red Squadron survivor of Yavin and a member of Rogue Flight right from its inception, Antilles was initially Skywalker's second-in-command in the nascent flight group. The two decided to expand Rogue Flight into a full squadron while stationed on Hoth, and Antilles participated in Rogue Group's defense of the Alliance's Echo Base, downing an AT-AT walker along with his gunner, Wes Janson. Finding himself the new Rogue Leader following that battle, Antilles led Rogue Squadron as a unit operating with no set mission profile. Placed in permanent command of the squadron a year later, just after leading it into the Battle of Endor, he commanded the Rogues until their temporary dissolution in 5 ABY and resumed his post when the unit was rebuilt one year afterward."}, {"tag": "p", "text": "That post was resigned by Antilles when the New Republic refused to wage war against the warlord Ysanne Isard, and he commanded his own, unofficial Rogue Squadron to defeat her in the Bacta War. That conflict was retroactively deemed an official New Republic operation, but Antilles promoted Tycho Celchu to Rogue Leader and instead focused on building the new Wraith Squadron. He later returned to Rogue Squadron as Rogue Leader, but an eventual promotion to general took him out of active pilot duty, although he would still sometimes oversee Rogue Squadron from the bridge of a capital ship. He was back in the cockpit as Rogue Leader in 19 ABY, but following peace accords between the New Republic and the Imperial Remnant in that year, he retired from the military. Decades later, Antilles flew against the Rogues as a member of Rakehell Squadron, which was supporting the Galactic Alliance–opposed Jedi Coalition in the Second Galactic Civil War. To his deep regret, he shot down and killed Lensi, the current Rogue Leader."}, {"tag": "h3", "text": "Derek \"Hobbie\" Klivian"}, {"tag": "p", "text": "Derek Klivian, also known as Hobbie, enlisted in the Imperial Academy as a young man but quickly defected to the Rebel Alliance, becoming one of its most talented pilots. Although he missed being a part of Red Squadron at Yavin due to injury, Klivian was one of the earliest Rogues and flew with them at Hoth and Endor. When Rogue Squadron was recommissioned by the New Republic in 6 ABY, Klivian was assigned elsewhere to train new starfighter squadrons, but the New Republic brought him in to lead an ersatz Rogue Squadron one year later. He and Wes Janson cobbled together the temporary squadron in order to keep up New Republic citizens' morale following Antilles's resignation. After this brief run as Rogue Leader, Klivian continued flying with the squadron until his retirement, which came in the wake of the peace between the New Republic and Imperial Remnant. During his years as a Rogue, Klivian was known for his cautious pessimism and beloved for his vast experience in an X-wing fighter. He was also a survivor of many crashes and a frequenter of healing bacta tanks."}, {"tag": "h3", "text": "Tycho Celchu"}, {"tag": "p", "text": "A superior pilot, the Alderaanian Tycho Celchu served in the Imperial Academy until the Empire destroyed his homeworld. Defecting to the Alliance, Celchu soon joined the ranks of the Rogues and flew with them at the Battle of Hoth. Although he piloted an A-wing in the Alliance's Green Squadron at Endor, Celchu was soon back with the Rogues, but a brief period of Imperial imprisonment led some in the New Republic to suspect him of being a brainwashed sleeper agent. Antilles had to settle for installing Celchu as his Executive Officer in the recommissioned Rogue Squadron until the man's innocence could be proven. After the Bacta War, Celchu became temporary Rogue Leader while Antilles was building Wraith Squadron, and he took the position permanently following Antilles's promotion to general. Major Rogue operations under his command included the hunt for the Invid Pirates and the Orinda campaign. Although Antilles was Rogue Leader during the Caamas Document Crisis of 19 ABY, it was Celchu who handed over command of the squadron to Gavin Darklighter before his retirement, which came shortly after Antilles's own."}, {"tag": "h3", "text": "Gavin Darklighter"}, {"tag": "p", "text": "After learning how to fly from behind the yoke of a T-16 skyhopper on his homeworld of Tatooine, Gavin Darklighter joined Rogue Squadron at the age of sixteen, making the cut in part due to his martyred cousin, Biggs. Support from his fellow Rogues enabled the young pilot to realize his full potential, and he proved his skills many times over, becoming a master of the strafing run. After years in the squadron and many battles fought, Darklighter became the new Rogue Leader when Antilles and Celchu both retired, but his command of the Rogues was tested by the threat of the extra-galactic Yuuzhan Vong. Serious squadron losses were suffered against the mysterious enemy coralskippers until Darklighter devised a countermeasure involving his X-wing's inertial compensators, and he went on to lead a rebuilt Rogue Squadron in numerous battles against the Yuuzhan Vong, including the evacuation of Coruscant and the later recapture of it. After the war, he became a commodore in the Galactic Alliance Defense Fleet."}, {"tag": "h3", "text": "Corran Horn"}, {"tag": "p", "text": "The Force-sensitive ace pilot Corran Horn joined a restructured Rogue Squadron after the New Republic took notice of his flying skills and invited him to apply. He remained with the squadron for years, flying in some of the most important and dangerous missions in which any starfighters had ever been engaged. He also spent time honing his skills with the Force, and when he finally retired from the military, he became a full-time Jedi in Skywalker's order. Despite this, Horn briefly took command of Rogue Squadron during the Yuuzhan Vong War, serving as Rogue Leader during battles at Obroa-skai and at Ebaq 9."}, {"tag": "h3", "text": "Jaina Solo"}, {"tag": "p", "text": "Jaina Solo was a Jedi student and the niece of Luke Skywalker, skilled both with the Force and behind the controls of a starfighter. She was accepted into Rogue Squadron by Gavin Darklighter early in the Yuuzhan Vong Invasion, and she flew in such engagements as the Battle of Dantooine. Darklighter quickly developed a great respect for her talents, but she was asked to take an indefinite leave of absence from the squadron when the Yuuzhan Vong began calling for the extermination of the Jedi. Solo soon took over Twin Suns Squadron from her uncle and commanded it for much of the remainder of the war. When the Corellian government began to rebel against the Galactic Alliance over a decade later, Solo volunteered for active flight duty and was put in command of Rogue Squadron. Her tenure as Rogue Leader was cut short, however, when her morality prompted her to refuse an order from her brother, who was in charge of the Rogues' battle group, and he suspended her from duty."}, {"tag": "h3", "text": "Lensi"}, {"tag": "p", "text": "Lensi, a Duros, had claimed a spot in Rogue Squadron a year and a half into the Yuuzhan Vong War. He flew in the Second Battle of Sernpidal, in which the Rogues were told by the rogue Jedi Kyp Durron that they were attacking a gravitic superweapon, but were in fact tricked into helping destroy an enemy worldship that was being grown for non-military purposes. The sting of Durron's lie remained with Lensi, and when he was involved in a feint attack on Yuuzhan Vong–held Duro more than two years later, he was kept in the dark about the battle's true nature and resigned his commission, feeling betrayed. Lensi later rejoined the squadron and eventually came to command it, but the Rogue Leader was shot down and killed by Wedge Antilles during the Second Galactic Civil War."}, {"tag": "h3", "text": "Jhoram Bey"}, {"tag": "p", "text": "In the year 137 ABY, the Weequay Jhoram Bey led Rogue Squadron during their assignment to the Galactic Alliance Core Fleet. He was dedicated to the fleet, and although the irregulars under his command were lacking in discipline, his strong presence and personality kept them in order and ensured that they were always combat-ready. When the flagship of the Galactic Alliance Remnant's leader, Gar Stazi, took major damage during a battle at Dac, Bey docked his fighter aboard the warship and rushed to its bridge. Stazi was planning to sacrifice his own life, but Bey punched his superior in the face in order to keep him alive and a symbol of hope to the embattled Alliance. As a reprisal, Stazi promoted Bey to be his new second-in-command."}, {"tag": "h3", "text": "Anj Dahl"}, {"tag": "p", "text": "A talented pilot and an enthusiastic troublemaker, Anj Dahl joined the Rogues several years after 130 ABY's Battle of Caamas. Feeling that everything could end at any moment, she embraced all that was fun in life. Dahl saw combat with Darth Krayt's Galactic Empire at Dac and at Raaltiir, replacing Jhoram Bey as Rogue Leader between the two battles. She was unhappy with the promotion, feeling that Bey had been a more capable commander, but fellow Rogue Hondo Karr believed that her only problem was treating her squadron mates as friends. Dahl stayed on as Rogue Leader through the war's end, leading the squadron against Krayt's forces in major engagements at Taivas and Coruscant."}, {"tag": "h2", "text": "Pilots"}, {"tag": "h3", "text": "Rebellion era"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Early New Republic"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Reformation"}, {"tag": "h3", "text": "Later years"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Second Imperial Civil War"}, {"tag": "h3", "text": "Support personnel"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Genesis"}, {"tag": "p", "text": "Rogue Squadron's origins date back to the 1980 film Star Wars: Episode V The Empire Strikes Back, which features Luke Skywalker commanding a team of snowspeeder pilots at the Battle of Hoth that he calls \"Rogue Group.\" The movie's novelization also designates them Rogue Group, but its radio drama identifies the pilots as \"Rogue Flight,\" a moniker that would be echoed in 1984's A Guide to the Star Wars Universe. Galaxy Guide 3: The Empire Strikes Back, published in 1989, uses the name Rogue Group, and it describes them as both \"the brainchild of Luke Skywalker\" and \"a squadron of starfighter pilots who, in times of need, were pressed into service as snowspeeder pilots.\" Galaxy Guide 5: Return of the Jedi, released one year later, also calls them Rogue Group, and it states that Antilles took command of their remnants after Hoth and \"formed them into the Rebel fleet's elite starfighter squadron.\""}, {"tag": "p", "text": "It was author Timothy Zahn who coined the name \"Rogue Squadron\" in his 1991 novel Heir to the Empire, establishing the Rogues as an elite fighting force of the New Republic active five years after the events of Star Wars: Episode VI Return of the Jedi. According to Zahn, his first mention of Rogue Squadron was half a throwaway line and half convenience, as he wanted a unit that could be moved around wherever he needed it and thought that Wedge Antilles would be a good commander for such a unit."}, {"tag": "p", "text": "The second edition of Galaxy Guide 3, published in 1996, updated its information to state that \"Rogue Group\" was born just after Star Wars: Episode IV A New Hope's Battle of Yavin, and that Antilles remodeled it and renamed it \"Rogue Squadron\" after the Battle of Hoth. The Essential Guide to Warfare later set down a definitive timeline of the squadron's nomenclature: the unit formed after the Battle of Yavin was a small flight group called Rogue Flight, and when Hoth's Echo Base was attacked, Rogue Group was an ad hoc snowspeeder unit created from the pilots of Rogue Flight, Green Squadron, and Blue Squadron. The Rogues then became a full twelve-person squadron, Rogue Squadron, after Hoth's evacuation. This retcon only came in 2012, however, and most sources released before Warfare refer to the pre-Hoth Rogues as either Rogue Group or Rogue Squadron, instead of Rogue Flight. Additionally, the comics X-Wing Rogue Squadron ½ and Empire 12, set just before the Battle of Yavin, erroneously identify the Alliance's Red Squadron pilots as Rogue Squadron."}, {"tag": "p", "text": "A different origin story for the Rogues is given in Brian Wood's 2013–2014 Star Wars comic series . The series' tenth issue sees Skywalker and Antilles flying in the Rebel Alliance's black ops Stealth Squadron, which Antilles suggests renaming Rogue Squadron. Two issues later, he formally requests that Stealth Squadron be dissolved so that he may form Rogue Squadron, a proper Alliance squadron that fights out in the open. His request is approved. This runs contrary to the Rogue Squadron origin story given in the second edition of Galaxy Guide 3: The Empire Strikes Back and reiterated in such sources as The Complete Star Wars Encyclopedia and The Essential Guide to Warfare. The two conflicting stories have never been reconciled."}, {"tag": "p", "text": "Several issues of Marvel Comics' 1977–1986 Star Wars series feature Rebel pilots flying X-wings in the time period between Hoth and Endor, and some of those pilots and their missions were later retconned into being a part of Rogue Squadron. At Endor, Return of the Jedi has Antilles flying as Red Leader rather than Rogue Leader, which prompted 1990's Galaxy Guide 5 to reveal that he renamed the Rogues before the battle as a tribute to the Red Squadron pilots who had fought bravely at Yavin. It was later confirmed that the name change was only temporary, with the 1993 novel The Truce at Bakura seeing them flying as Rogue Squadron again just one day after Endor."}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "Rogue Squadron has been the focus of a multitude of Star Wars Legends works. Author Michael A. Stackpole was contracted by Bantam Spectra in the mid-1990s when they were considering buying a publishing license for the PC game Star Wars: X-Wing, and they ultimately purchased it and hired him to write four X-Wing novels. Lucasfilm Ltd.'s Sue Rostoni and author Kevin J. Anderson both urged him to use Wedge Antilles, a fan-favorite hero from the original trilogy, as a main character, and Rostoni suggested that the first volume be about the Red Squadron pilots of A New Hope. Stackpole decided that Rogue Squadron would be the ideal main focus, however, and he contacted Timothy Zahn to ask for details about the group in the New Republic era. He logged a large number of hours playing the X-Wing and TIE Fighter games in preparation for writing, and he also consulted real-life pilots, read pilots' biographies, and watched television documentaries on fighter squadrons, which were being prominently featured on television around the fiftieth anniversary of D-Day."}, {"tag": "p", "text": "Stackpole has referred to the X-Wing books as \"Star Wars meets Top Gun,\" which was in fact a theme suggested by Bantam editor Tom Dupree. The novels proved to be massive hits, pleasing fans and reaching The New York Times Best Seller list, and six additional volumes of the X-Wing series were later written, by Stackpole and by Aaron Allston. After being hired to write the novels, Stackpole was asked by Lucasfilm's Lucy Autrey Wilson in July 1994 if he had ever worked in comics before. Not long afterward, Dark Horse Comics conceived of an X-Wing comic, and Lucasfilm told them to speak to Stackpole. Wilson helped him get hired to script the ongoing X-Wing Rogue Squadron comic, which proved to be a long-running and much-loved series that, although canceled due to comparatively low sales, consistently remained one of Dark Horse's most requested titles for years. A number of the Rogues from the series were later immortalized as Hasbro Inc. 3¾ inch action figures."}, {"tag": "p", "text": "The squadron has featured in other Star Wars Legends  works as well, such as the Shadows of the Empire multimedia project, The New Jedi Order novel series, and the Star Wars: Legacy comics. They were also the focus of the six-part Rogue Squadron cycle of Fantasy Flight Games' Star Wars: The Card Game. A sourcebook about the squadron by Eric S. Trautmann was reportedly canceled following the closure of West End Games, and author Andy Mangels once penned a Rogue Squadron comic called Boba Fett and X-Wing: The Mandalorian Candidate that was never published. The Reenlistment of Baron Fel, a story by Stackpole and Zahn about Soontir Fel leaving the Rogues and returning to Imperial service, was written as both a comic series and a four-part prose story, but neither version was ever sold."}, {"tag": "p", "text": "Three Rogue Squadron video games were developed by Factor 5 and published by LucasArts. Star Wars: Rogue Squadron was released for the Nintendo 64 and PC CD-ROM in 1998, and Star Wars: Rogue Squadron II: Rogue Leader and Star Wars: Rogue Squadron III: Rebel Strike were respectively released in 2001 and 2003 for the Nintendo GameCube. Rogue Leader was met with myriad critical acclaim and is still regarded as one of the best GameCube titles of all time. Factor 5 also developed a compilation of the three games, entitled Star Wars: Rogue Squadron: Rogue Leaders, for the Xbox, but the project was canceled by Lucasarts. Further attempts to bring it to the Nintendo Wii were halted when Factor 5 went out of business. Another unfinished game, Star Wars: Rogue Squadron: X-Wing vs. Tie Fighter, was also canceled and eventually became the 2007 PlayStation 3 game Lair."}, {"tag": "h3", "text": "Impact"}, {"tag": "p", "text": "A 2002 Star Wars Insider article written by Jason Fry asserted that \"In the Expanded Universe of comics, books, and videogames, no military unit is more famous than Rogue Squadron.\" It also highlighted the Rogues' status as loyal, working-class heroes who follow orders and perform impossible missions, setting them apart from the Force-using movie heroes who often decide the fate of the galaxy. Fans of Stackpole's X-Wing novels and comics agreed, telling the author that it was \"very good to see someone else saving the universe.\" That analysis was echoed by Peet Janes, who edited the X-Wing: Rogue Squadron comics and called the Rogues \"some of the galaxy's greatest heroes, the 'working stiffs' of the Star Wars universe.\" On writing the 2005 comic miniseries X-Wing: Rogue Leader, author Haden Blackman described Rogue Squadron as \"a microcosm of the Rebel Alliance as a whole, composed of different people from different backgrounds all working together.\""}, {"tag": "p", "text": "Writer Darren Franich of Entertainment Weekly opined that Stackpole's best contribution to the Rogues' saga \"was to portray Rogue Squadron as the everymen-and-women of the Star Wars galaxy. They didn't fight zero-sum battles against Death Stars; they fought renegade Imperials and war lords, they fought on land and over sea, in space and beyond.\" To Ryan Britt of Tor.com, the adventures of working-class pilots were both \"something to see\" and \"endlessly interesting,\" and he suggested that the X-Wing comics were less like Top Gun in space and more akin to a mixture of The A-Team and Ghostbusters. While praising Stackpole's books, Andrew Liptak of The Verge expressed a belief that it was their popularity which proved Star Wars could exist without its figurehead characters."}, {"tag": "p", "text": "The name \"Rogue Squadron\" has been borrowed outside of Star Wars media, with a drone and counter-drone development team bearing the name launched in 2017 as part of the Defense Innovation Unit of the United States Department of Defense. In 2020, the unit transitioned to the DoD's Defense Digital Service, which had previously been involved in other projects with Star Wars-inspired names, including a JEDI program, a Tatooine center, and a Jyn initiative. The name \"Rogue Leader\" was also used by LucasArts for Rogue Leaders: The Story of LucasArts, a 2008 book that chronicles the company's history."}, {"tag": "p", "text": "The Rogues' adventures in Legends received significant attention in online media in 2015 when the title of the first Star Wars Anthology film was revealed to be called Rogue One: A Star Wars Story, which led to widespread speculation that the 2016 movie would center on Rogue Squadron. It ultimately did not, but in December 2020, StarWars.com announced Star Wars: Rogue Squadron, a 2023 movie to be directed by Patty Jenkins. It will tell an original story in Star Wars canon with, according to Jenkins, \"great influence from the games and the books.\" Shortly after the announcement, Jenkins retweeted Michael A. Stackpole on Twitter to thank him for his inspiring work, and in June 2021 she told the Associated Press that it was important to honor the history of his novels and the video games, while still bringing the squadron into a new age and telling a new story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}