{"url": "Rogue_Shadow", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Jedi starships", "Category:Sienar Fleet Systems products", "Category:Starships of the Galactic Empire", "Category:Starships of the Order of the Sith Lords", "Category:Stealth ships", "Category:Transports"], "nodes": [{"tag": "h1", "text": "Rogue Shadow"}, {"tag": "p", "text": "The Rogue Shadow was a unique starship that served as the personal transport of Starkiller, the secret apprentice of the Sith Lord Darth Vader. In addition to its main occupants, the apprentice and his training droid PROXY, the vessel was piloted by eight Imperial officers in turn, including Captain Juno Eclipse, the leader of Vader's Black Eight Squadron. Built primarily for stealth and infiltration purposes, the Rogue Shadow incorporated state-of-the-art cloaking technology and a highly advanced hyperdrive engine in its design, thus allowing the apprentice to travel anywhere throughout the galaxy without risking detection."}, {"tag": "p", "text": "After Starkiller's death, the Rogue Shadow was retained by Eclipse, who switched her allegiance from the Galactic Empire to the newly-formed Rebel Alliance. The starship later became the property of Jedi Master Rahm Kota, a general in the Alliance Military, until a renegade clone of the original Starkiller encountered Kota on Cato Neimoidia. Kota gave the Rogue Shadow to the clone, shortly before a major battle commenced on the planet Kamino. Following the Alliance victory on the Kaminoan homeworld, the Rebels imprisoned Darth Vader inside the Rogue Shadow and prepared to transport him to the Alliance's hidden base on Dantooine."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Built by Sienar Fleet Systems, the Rogue Shadow's design was based on the Scimitar, Darth Maul's Sith Infiltrator. It also shared certain design elements with other Imperial craft, such as the Eta-2 interceptor and the starfighters of the TIE series. Designed and built in secret, all of the personnel and droids involved in the Rogue Shadow's construction were killed, thus ensuring their silence, while the causes of their deaths were described as \"industrial accidents\" and street crimes."}, {"tag": "p", "text": "The Rogue Shadow boasted an advanced hyperdrive, cutting-edge sensory arrays, a fully functional medical bay, crew quarters, a workshop and a meditation chamber that could double as a training room. It also had the fastest sublight drives in the Imperial Navy. In addition to these high tech features, the Rogue Shadow was outfitted with an experimental cloaking device that enabled the vessel to hide from even the most powerful scanners for short periods of time. Its cloaking technology was powered by a rare stygium crystal, a form of lightsaber crystal from the Dreighton Nebula that could warp perceptions around it."}, {"tag": "p", "text": "During General Rahm Kota's tenure as the owner of the Rogue Shadow, the starship was heavily modified to better suit its role as a Rebel transport. The shielding was strengthened, thus giving the starship a heavier feel when under thrust; other changes included expanded compartments in order to house Kota's squad. Despite the fact that the extensive modifications left several critical components crushed together, a renegade clone of Galen Marek noted that the Rogue Shadow could still function through hyperspace without overloading its systems."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Secret Apprentice"}, {"tag": "p", "text": "The Rogue Shadow was first owned by Darth Vader's secret apprentice, Galen Marek, the young Sith assassin who operated under the call sign \"Starkiller\". Designed specifically for covert missions, the Dark Lord provided the vessel to his apprentice, thus allowing Starkiller to travel to wherever his assignments required. The Rogue Shadow, like its owner, was built in secret as Vader was adamant that no one, least of all his own master, Emperor Palpatine, could be allowed to discover the existence of his disciple. When not dispatched on missions, both the ship and the apprentice remained hidden within a secret level on Vader's incomplete flagship, the Executor."}, {"tag": "p", "text": "Though Starkiller was a skilled pilot, he focused more on his training and meditation in accordance with his master's wishes. As such, Darth Vader personally selected the Rogue Shadow's pilot, who was sworn to secrecy under pain of death. By 3 BBY, however, a total of seven pilots had flown the Rogue Shadow for Starkiller. Some died during the apprentice's missions, such as one shot by a Corellian gunrunner; others were killed by Vader for failing to meet the Sith Lord's expectations. On one occasion, Vader executed an Imperial Sergeant for tardiness."}, {"tag": "p", "text": "After killing his apprentice's last pilot in 3 BBY, Vader appointed Captain Juno Eclipse as the vessel's eighth pilot, having been impressed by the young officer's record. A skilled TIE pilot who led the Dark Lord's Black Eight Squadron to victory on the planet Callos, Eclipse welcomed the opportunity to fly a unique starship such as the Rogue Shadow, but was also initially disturbed by its main occupants, Starkiller and his training droid PROXY, and their assassination missions. Although the Starkiller feared his master too much to ask, he suspected that Vader wanted to test him by partnering the apprentice with a woman."}, {"tag": "p", "text": "Eclipse's reassignment to the Rogue Shadow coincided with the apprentice's first assignment that involved a Jedi target: Master Rahm Kota, one of the few remaining survivors of the fallen Jedi Order and a former general who served in the Clone Wars. After defeating Kota at Nar Shaddaa, the apprentice took the Rogue Shadow to other locations throughout the galaxy, such as Raxus Prime and Felucia, where he hunted and killed Kazdan Paratus and Shaak Ti, the other Jedi survivors of Order 66. The apprentice also used the Rogue Shadow to infiltrate Coruscant, the capital world of the Galactic Empire, more than once in order to participate in the Jedi Trials at his master's behest."}, {"tag": "p", "text": "In 2 BBY, Vader ordered his apprentice to form a rebellion against the Empire by uniting various dissidents and rebel groups against Palpatine's rule, proclaiming that their distraction would create an opportunity to assassinate the Emperor. The apprentice retained the Rogue Shadow, as well as PROXY and Juno Eclipse, throughout the duration of his new assignment and flew to worlds such as Ziost, Kashyyyk, and Bespin where he recruited an intoxicated and highly depressed Rahm Kota—who feigned ignorance about Starkiller's true identity as the assassin who blinded him during their last encounter—on Cloud City. The Rogue Shadow also revisited Nar Shaddaa, Felucia, and Raxus Prime as the apprentice's plot attracted more followers who opposed the Emperor's New Order."}, {"tag": "p", "text": "After gaining key allies in the Imperial Senate, the apprentice traveled to Corellia in the Rogue Shadow and attended the secret conference where senators Bail Organa, Garm Bel Iblis, and Mon Mothma convened to formally announce the formation of the Alliance to Restore the Republic. During the meeting, however, the Imperial Navy ambushed and surrounded the insurgents while Darth Vader's stormtroopers arrested the Rebel leaders. Betrayed and left for dead by his former master, the apprentice renounced the Sith and the dark side of the Force, and embraced his Jedi heritage as Galen Marek by opting to rescue his allies."}, {"tag": "p", "text": "The apprentice flew the Rogue Shadow for the last time when he and Eclipse journeyed to the secret location of the incomplete Death Star where the Rebels were held captive by the Emperor and Darth Vader. Marek stormed the Death Star, killed scores of Imperial soldiers and although he defeated his former master in battle, the apprentice ultimately lost his life at the hands of Emperor Palpatine. His sacrifice, however, aided in the Rebel leaders escape aboard the Rogue Shadow."}, {"tag": "p", "text": "In the aftermath of Galen Marek's death, Eclipse, Kota, and the former senators took the Rogue Shadow to Kashyyyk, the apprentice's homeworld where they convened in his family's old hut to conclude the formal recognition of the birth of the Rebel Alliance. Eclipse joined the ranks of the new organization as the commanding officer of the Alliance's first flagship, the Salvation, and as a result, gave the Rogue Shadow to Rahm Kota. Under the General's ownership, the apprentice's starship was used as a transport for Kota's squad during several unauthorized missions in the early stage of the Galactic Civil War."}, {"tag": "h3", "text": "Refit and reassignment"}, {"tag": "p", "text": "In 1 BBY, approximately six months after the death of Galen Marek, General Kota and his squad took the Rogue Shadow to Cato Neimoidia where they intended to assassinate the planet's Imperial governor, Baron Merillion Tarko, despite the Alliance High Command's refusal to sanction the mission. The General followed the Salvation, intending to use the Alliance flagship's training exercise as a distraction for Imperial forces while he and his troops carried out their objective. The plan ultimately failed, however, and the Salvation was forced to retreat in the face of overwhelming enemy numbers; Kota himself was apprehended and brought to Tarko-se where the Baron forced him to fight for his life in the city's gladiatorial arena. In the midst of the debacle, the Rogue Shadow flew to a hidden location via the ship's autopilot system."}, {"tag": "p", "text": "Shortly after Kota's capture, Starkiller—one of many failed clones created by Darth Vader to replace his fallen apprentice—escaped from Kamino and journeyed to Cato Neimoidia where he rescued the General in order to ascertain the whereabouts of Juno Eclipse. Upon returning with the Rogue Shadow, however, the clone was distraught to find that Eclipse was not in the ship's cockpit. Although Kota did not know where Eclipse was, he suggested that they take the Rogue Shadow to the Athega system, the last confirmed rendezvous point for the Alliance Fleet. Along the way, Starkiller was displeased by his discovery of the heavy modifications made to his progenitor's ship. Upon arriving in the Athega system, the clone found no trace of Eclipse's frigate or the fleet she served with. Instead, the Rogue Shadow landed in the middle of an Imperial fleet. Pursued by dozens of TIE/LN starfighters, the Rogue Shadow escaped into hyperspace. Afterward, Kota confronted the clone about his priorities and insisted that Starkiller should commit himself to the Alliance's cause against the Empire. When the clone made it clear that the Rebellion was irrelevant to him, an enraged Kota demanded to be dropped off at the nearest spaceport so that he could regroup with his squad at Commenor. Meanwhile, the clone retained possession of the Rogue Shadow at the General's insistence."}, {"tag": "p", "text": "Parting ways with Rahm Kota, the clone used the Rogue Shadow to follow Juno Eclipse's trail and arrived at the Mon Calamari homeworld of Dac. However, he was disappointed to learn that she was not there. He then traveled to the remote world of Dagobah, believing that the Force was directing him there for a reason. During his brief visit to Dagobah, the clone experienced a premonition in which he saw the Salvation under attack. Fearing for Eclipse's life, Starkiller picked up Kota and his squad on Malastare before heading to the Itani Nebula. By the time they arrived, an Imperial squadron ambushed the Rebels while a group of experimental Terror troopers boarded the Salvation under the leadership of Boba Fett, a bounty hunter hired by Darth Vader to bring Eclipse to Kamino. After docking the Rogue Shadow inside Eclipse's ship, Starkiller pursued the mercenary, killing all in his path, but ultimately failed to prevent Fett from leaving the Alliance flagship with Eclipse as his prisoner."}, {"tag": "p", "text": "At Starkiller's insistence, General Kota ordered the fleet to Kamino, hoping to catch the Empire by surprise. Instead, they found the planet heavily guarded by a group of Imperial Star Destroyers. During the fighting in space, Kota and the surviving crew members evacuated the badly damaged flagship and escaped in the Rogue Shadow while Starkiller guided the Salvation on a collision course with Timira City, the cloning facility where he was grown. Kota and his soldiers invaded the facility and engaged its Imperial garrison while the clone embarked alone on his personal mission to save Juno Eclipse."}, {"tag": "p", "text": "In the aftermath of the Battle of Kamino, the Rebel Alliance emerged victorious. During the battle, Darth Vader himself was defeated in combat by the clone, who reluctantly agreed to spare his creator's life so that the Rebel Alliance could put him on trial for war crimes. The Rebels then decided to use the Rogue Shadow as the means for transporting Vader to their hidden base on Dantooine. Upon leaving the Kamino system, both Starkiller and Eclipse were oblivious to the fact that they were being tracked by Boba Fett."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rogue Shadow first appears in the 2008 multimedia project Star Wars: The Force Unleashed. It also appeared in the sequel project, Star Wars: The Force Unleashed II, released in 2010."}, {"tag": "p", "text": "In the original video game, the Rogue Shadow's boarding ramp is on the stern in the Xbox version. In the PlayStation 2, PlayStation Portable, and Wii versions, the boarding ramp is located in the front of the starship."}, {"tag": "h3", "text": "TFU alternate ending"}, {"tag": "p", "text": "In the alternate ending of Star Wars: The Force Unleashed, Galen Marek re-embraces the dark side of the Force by killing his former master in cold blood. Before he can truly become Darth Sidious's new apprentice, the Emperor orders him to sever his allegiance to the Jedi Order by murdering Rahm Kota. However, the apprentice chooses to betray Sidious instead, an act that the Dark Lord anticipated. When Marek fails in his assassination attempt, Juno Eclipse brings the Rogue Shadow close to the Emperor's observation dome on the Death Star in order to rescue Marek. Sidious uses the Force to seize the starship, and then crashes it right on top of the apprentice."}, {"tag": "p", "text": "After nearly being crushed to death by his own vessel, the apprentice awakens and finds his body encased in a suit of armor, similar to the one worn by the late Darth Vader. Though disappointed at the prospect of being served by yet another Human cyborg, Darth Sidious grudgingly turns Galen Marek into Lord Starkiller, to which he declares that the apprentice will serve as his personal Sith assassin until he can find a new disciple."}, {"tag": "h3", "text": "TFU II alternate ending"}, {"tag": "p", "text": "Star Wars: The Force Unleashed II also features an alternate ending in which the player character follows the path to the dark side of the Force. Starkiller, a deranged clone of the late Galen Marek, holds a lightsaber at the throat of a defeated Darth Vader during the Battle of Kamino. Ignoring Kota's pleas to take Vader alive as a prisoner of the Rebel Alliance, the clone raises his weapon to strike down his creator in cold blood. Before he can deliver the killing blow, however, Starkiller is impaled through the chest from behind by a red lightsaber. A dark hooded figure reveals himself as Starkiller falls to the ground in agony. After swiftly dispatching Kota, PROXY and several Rebel troopers, the warrior takes his place at Vader's side and reveals himself to be the Dark Apprentice, the only successful clone of the original Starkiller."}, {"tag": "p", "text": "The renegade clone succumbs to his fatal wound and dies. Darth Vader tasks the new Apprentice with the mission of hunting down and executing the last of the Rebels throughout the galaxy. In order to fulfill the task, Vader tells the dark clone to take the Rogue Shadow as his personal transport. The Apprentice complies and takes one final look at the body of Juno Eclipse before departing from Kamino in his progenitor's starship."}, {"tag": "p", "text": "The Rogue Shadow is still in the Dark Apprentice's possession by 4 ABY. As he approaches the Sanctuary Moon of Endor, Darth Vader instructs the clone to stop the Rebels from destroying the shield generator bunker, thereby preventing the Alliance Fleet from causing any harm to the new Death Star. The Dark Apprentice lands the Rogue Shadow not far from the bunker's location and proceeds to carry out his Master's orders to the letter. He ultimately kills his way through various Rebel troopers, Ewoks, and even Imperial stormtroopers as well. By the end of his mission, his victims include the smuggler Han Solo, the Wookiee Chewbacca, and the Jedi Leia Organa. The Galactic Empire prevails at the Battle of Endor and Emperor Palpatine proclaims the end of the Rebellion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}