{"url": "Rohlan_Dyre", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Mandalorian Crusaders", "Category:Officers"], "nodes": [{"tag": "h1", "text": "Rohlan Dyre"}, {"tag": "p", "text": "Rohlan Dyre was a Human male Mandalorian Crusader and a former commander who fought in the early skirmishes of the Mandalorian Wars. He deserted the wars multiple times in an attempt to find answers pertaining to the war itself. After the battle of the planet Vanquo in 3964 BBY, Dyre deserted the Mandalorians once more and joined forces with the Jedi Padawan Zayne Carrick, the Snivvian con artist Marn Hierogryph, and The Last Resort's crew to rescue the female Arkanian Offshoot Jarael from an abandoned Republic research station called Flashpoint Station. The station was being used as a base by the Mandalorian scientist Demagol while he experimented with captured Jedi Knights."}, {"tag": "p", "text": "After Dyre, Carrick and his crew rescued Jarael and the Revanchist Jedi from the Mandalorians, Dyre was incapacitated by Demagol, who Dyre had disabled earlier. The scientist assumed Dyre's identity and traveled with Carrick's crew. Dyre, encased in Demagol's armor, was taken to the galactic capital Coruscant by the Jedi Knight Alek and his fellow Jedi to stand trial. En route to Coruscant, Dyre fell into a drug-induced coma. Eventually, Dyre regained consciousness and was put on trial for Demagol's crimes against the Republic. During the trial, Alek, now going by the name Malak, testified against the man whom he believed to be Demagol. After a riot began to break out, Dyre was rescued by Zayne Carrick and Marn Hierogryph when they realized that the Mandalorian who they had been traveling with was not Rohlan Dyre. The two asked Dyre for his aid in stopping Demagol, who was now accompanying Jarael after she left Carrick and his crew. He agreed to do so, and accompanied them to Osadia to confront Demagol. After the confrontation ended in Demagol's death, Rohlan helped Zayne find Jarael's parents before disappearing once again."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Questioner"}, {"tag": "p", "text": "An aged Mandalorian Crusader veteran, Rohlan began to question the tactics of the Mandalorians and the motives behind the war. When Rohlan confronted his superiors with his concerns, he did not receive a satisfactory answer, so the next time he was called up, he did not answer. Dyre was found, and, as a punishment for his desertion, he was placed at the front lines of the war. Rohlan continued to refuse to fight and he was caught and placed at the front lines five times. His last mission was as Commander of the Shocktrooper forces during the Battle of Vanquo. After his troops captured Jarael, believing her to be a Jedi, he personally hijacked The Last Resort in an attempt at escape."}, {"tag": "p", "text": "However, an enraged Camper stunned Rohlan, making it easy for Zayne Carrick to incapacitate him, sealing him in a cargo container. When Rohlan overheard his captors mention that they were headed into Mandalorian space, he offered his help as a guide and so explained his situation and where they were going: Flashpoint Station, where Jarael and a number of real Jedi were being held."}, {"tag": "h3", "text": "The Flashpoint trick"}, {"tag": "p", "text": "Rohlan brought Zayne to Flashpoint Station as a prisoner. When they arrived, Demagol, a mad Mandalorian scientist bent on discovering what made the Jedi able to use the Force, was just about to conduct experiments on Jarael. Rohlan, however, demanded that Zayne be the next \"experiment.\" Demagol complied, and Rohlan was able to overpower the scientist. Demagol was locked inside a storage closet, and Zayne took his armor. Rohlan and Zayne left the facility and Zayne, with the aid of the Force, secretly placed charges on key structural points. When Marn Hierogryph disguised as a Republic Admiral of the \"Glomkettle\", arrived, Carrick set off the charges, forcing the Mandalorians to evacuate. Rohlan ordered the Mandalorians to tell Mandalore that he perished with the facility in an attempt to \"rescue\" Demagol. Rohlan then went back into the facility to retrieve Demagol. However, the Mandalorian scientist had regained consciousness and managed to drug and switch armors with Rohlan."}, {"tag": "p", "text": "After the Mandalorians had left, Demagol, now masquerading as Rohlan, pretended to take his leave with the freed Jedi, but sneaked off the vessel at the last second and stowed aboard The Last Resort as it left the station, desiring to stay close to Jarael. After the Mandalorians had escaped (due to their belief that the Republic was attacking), Rohlan, who was now believed to be Demagol, was taken back to Coruscant by the formerly captured Jedi. However, en route to Coruscant, he fell into a drug-induced coma and could not be awakened for trial."}, {"tag": "h3", "text": "A stolen identity"}, {"tag": "p", "text": "On Coruscant, \"Demagol\" was looked over by a nurse when he finally awakened. Rohlan began muttering about the search for the Jedi at Flashpoint. Surprised, the nurse called the guards to report this news to the Ministry of Defense immediately."}, {"tag": "p", "text": "Alek Squinquargesimus, now known to the galaxy as Malak, brought \"Demagol\" to the Ministry of Defense for trial. He wanted to ensure that the sadistic scientist was brought to justice, unaware that the man he was persecuting had helped rescue him at Flashpoint."}, {"tag": "p", "text": "At trial, Malak started voicing \"Demagol's\" atrocities towards the crowd. Rohlan shouted that he stop calling him by that name and broke his cuffs. Malak used the Force to fling Rohlan across the chamber as he declared that they would defeat the Mandalorians. Rohlan retorted that Malak could not beat his people in a fair fight, demanding to know if the prosecuting Jedi did save the Republic, then who would save it from Malak himself. An angry mob ganged up, forcing security guards to rush Rohlan out of the building. After getting him onto a speeder, the guards revealed themselves as Zayne and Gryph. The pair had realized the identity-switch and needed Rohlan's help in rescuing Jarael from Demagol."}, {"tag": "h3", "text": "Taking the fight to Demagol"}, {"tag": "p", "text": "Hiding in a garage owned by Zayne, Rohlan explained to both Zayne and Gryph what he learned about Demagol. He also expressed disgust when Zayne told him about how Demagol had sold his own daughter, Chantique, into slavery and swore to make the mad scientist a smear on the ground. Zayne then presented Rohlan with a replica of his armor, which had been marketed after Demagol won swoop-dueling in his place, as it would give him more maneuverability. Afterward, Zayne introduced everyone to Rogue Moon Project Command, a group Zayne formed to help out the common people, where they hoped to find out where Demagol had taken Jarael. At that moment, Gryph's servant Slyssk remembered a tag that he had found cleaning. Zayne and Gryph identified it as a tag from one of the Sith Artifacts. They realized that Demagol had removed the double-bladed lightsaber of Exar Kun from its nullification resin and brought it with him—and Jarael. Zayne realized that the lightsaber could corrupt the Force-sensitive Jarael and determined to find Osadia, the planet of Demagol's school/laboratory and of Jarael's birth. Unfortunately, Rohlan insisted that even he couldn't find out the location of Osadia. Zayne realized that Dace Golliard, a member of The Crucible, knew where it was. He told Rohlan to call Cassus Fett before it was too late."}, {"tag": "p", "text": "Rohlan contacted Cassus for assistance in Zayne's plan. Cassus agreed, on the condition that Rohlan maintained a low profile (the Mandalorians were using tales of Rohlan's \"death\" as recruitment propaganda). The Mandalorian fleet lured Admiral Saul Karath to an asteroid field close to the Ithor system before swiftly vacating the field. Once the could properly capture Golliard and gain Osadia's coordinates."}, {"tag": "p", "text": "Once Zayne and company arrived on Osadia, Rohlan flew Zayne on his sub-par jetpack to the New Generation Academy, where Zayne crashed a brawl between Jarael and Chantique, and stopped the former from killing the latter. Rohlan personally dealt Demagol a thorough beating, declaring that he was \"no true Mandalorian\" and had no right to armor, \"let alone mine\". However, Demagol was able to Force Push Rohlan through a column, surprising both. Rohlan eventually regained consciousness and went out into the grounds to see Demagol on his knees, shocked that Chantique had buried and killed his students (in that order, this being Chantique). Rohlan corroborated Zayne's argument that Jarael was not Force-sensitive by pointing out that Demagol used the Force to throw him away and had been unwittingly using it throughout his travels with Zayne. Chantique interrupted the argument by leaping at her father with a vibroknife. Demagol used the Force to pull the lightsabers of Zayne and Exar Kun to him (with which to cut down his daughter, this being Demagol), gambling on a supposed \"50-50 chance\" of getting the right one (Zayne's) and not getting impaled. As both Chantique and Demagol lay dying after being impaled on Exar Kun's double-bladed lightsaber, Zayne pointed out that around him, there was no such thing as a \"50-50 chance.\" Rohlan returned with Zayne and Jarael to Coruscant, where the former arranged for the latter to be reunited with her parents (assisted by Rohlan). As Jarael embraced her parents, Rohlan vanished into thin air, presumably to return to his mission of discovering the true reason behind the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to John Jackson Miller, the name Rohlan \"is partially inspired by the similarly sounding name of another warrior, the paladin of Charlemagne.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}