{"url": "Rogue_Inquisitor_chase", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Battles of Coruscant", "Category:Events during the Early rebellion against the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Rogue Inquisitor chase"}, {"tag": "p", "text": "Years into the reign of the Galactic Empire, a chase involving two rogue Inquisitors and Darth Vader occurred on Coruscant."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "While on hunt for former Jedi Master Eeth Koth, a red-skinned Inquisitor let Eeth Koth's daughter escape with her mother, Mira. The other Inquisitorius questioned why she did this but she told them that she hadn't and used the Force to steal the baby from her mother's arms. She and the other Inquisitors returned to the Inquisitorius Headquarters with the baby."}, {"tag": "p", "text": "She and Unidentified Twi'lek Inquisitor, who she was acquainted with, toasted to a successful mission. While they were talking they were interrupted by Darth Vader who ignited his lightsaber. Vader attempted to kill the duo after he discovered an attachment between them, stating that they should have learned their lesson about attachments from the death of Eeth Koth. But Vader's strike was intercepted by the Twi'lek Inquisitor's lightsaber. The Inquisitor told his other Inquisitor to run while he held off Vader. Darth Vader offered to let him stay but he refused and ran off."}, {"tag": "h2", "text": "The chase"}, {"tag": "p", "text": "The two rogue Inquisitors ran out of the headquarters and the Twi'lek confessed his love for his fellow Inquisitor. They both decided to kill Darth Vader so they will be free and they jumped onto an incoming speeder."}, {"tag": "p", "text": "Elsewhere, Darth Vader and two Imperial shock troopers where in a speeder also patrolling for the rogue Inquisitors. As they were patrolling, their speeder was hit by the lightsabers of the Inquisitors causing the speeder to explode. Vader jumped off the speeder and onto another one but that one was also destroyed. Down below in a park a Gran senator was having a drink when the speeder came down and killed her. Back on the speeder, the two rogue Inquisitors used the Force to throw another speeder in Vader's direction but Vader stopped it and threw it back at them. Vader started to leap from speeder to speeder as the Inquisitors continued to throw more objects in his direction. A statue fell over and hit Vader, causing him to fall on the balcony of a nearby building."}, {"tag": "p", "text": "The Inquisitors jumped down and were very surprised to see that they had beaten Darth Vader. They both ignited their lightsabers but before they could strike Vader down, he stopped their blades with the Force. Vader started to redirect the lightsabers back at the Inquisitors. When they realized what was happening, they said their last goodbyes to each other and their lightsabers stabbed them, killing them both."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "At the Imperial Palace, Darth Vader reported the incident to his master, Emperor Palpatine. He was angry at Vader for causing destruction in the city and the death of an important senator but was pleased that he eliminated the traitors. Palpatine had a gift for Vader, the Naboo Royal Starship of Padmé Amidala. Vader accepted the gift but refused to do Palpatine's next task, to his master's surprise. Darth Vader asked for a planet of his own. Palpatine agreed and offered many planets that he thought would fit Vader but Vader instead wanted the lava world of Mustafar."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}