{"url": "Rokarn_Vth%27naar", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Gladiators", "Category:Males", "Category:Slaves", "Category:Sludir"], "nodes": [{"tag": "h1", "text": "Rokarn Vth'naar"}, {"tag": "p", "text": "Rokarn Vth'naar was a male Sludir, husband to Qesya Vth'naar and slave of Moff Kentor Sarne. He was slain in gladiatorial combat by his brother-in-law, Quyik Vth'naar."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Rokarn Vth'naar, mate of Qesya Vth'naar, was at some stage in his life enslaved by Moff Kentor Sarne of the Kathol sector. Kept on Kal'Shebbol, he was forced to fight in Sarne's gladiator pits. The Moff was interested by the concept of pitting two Sludir against one another, and so had Rokarn fight Qesya's brother, Quyik. Due to the fact that Qesya was already pregnant with his child, Rokarn knew that his bloodline would continue. On the other hand, Quyik had not yet impregnated anyone, and so Rokarn decided to throw the fight, so that his brother-in-law might one day have an heir."}, {"tag": "p", "text": "The pair fought, and as Rokarn had hoped, he was killed by Quyik. The victor felt guilty in the aftermath of the fight, but was in turn slain by Qesya in a subsequent gladiator match, without having fathered a child. Qesya would in time be freed, and kept her fetus in suspended animation for over a year. She eventually gave birth to Rokarn's child on Yvara."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rokarn Vth'naar's primary concern at the end of his life was the perpetuation of his bloodline. Due to the fact that he had impregnated his mate, he valued Quyik's life more than his own, since his brother-in-law did not yet have an heir."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rokarn Vth'naar was given his first and only mention in The Kathol Rift, which was written by Sterling Hershey, Pablo Hidalgo, Joshua A. Miller, Timothy S. O'Brien, and Eric S. Trautmann."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}