{"url": "Rokur_Gepta", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Croke", "Category:Force-sensitives", "Category:Heads of government and state", "Category:Impersonators", "Category:Males", "Category:Sorcerers of Tund"], "nodes": [{"tag": "h1", "text": "Rokur Gepta"}, {"tag": "p", "text": "Rokur Gepta was a Force-sensitive Croke and the last Sorcerer of Tund. Born millennia before the Battle of Yavin, Gepta joined the Sorcerers in 5 BBY. After learning all that they had to offer, he killed them all, using a bioweapon to ravage the planet Tund. A short time after the destruction of Tund, he came in contact with Emperor Palpatine, who named him Scrivinir of the Centrality in return for a number of the order's secrets. The Centrality was a mostly overlooked state in the Outer Rim Territories, and as such, Gepta was free to operate as he wished. However, he sought more power, desiring to rule the entire galaxy, and so allied himself with Governor Duttes Mer of the Rafa system in hopes of finding the fabled artifact known as the Mindharp, which Gepta believed would allow him to control the minds of others."}, {"tag": "p", "text": "In 4 BBY, Gepta and Mer roped the gambler Lando Calrissian into locating the Mindharp for them. However, thanks to Mer, who had learned of the Mindharp's true power and attempted to claim the device for his own use, Gepta was unable to recover it. He blamed Calrissian for this and hounded him, attempting to kill him by having his men place a bomb on the gambler's ship, although this assassination attempt failed. Determined to pay back the gambler for the humiliation he felt Calrissian had caused him, Gepta killed Bohhuah Mutdah, the richest man in the galaxy, and disguised himself as Mutdah. He arranged for Calrissian to deliver a shipment of the drug lesai to Mutdah's home on Oseon 5792; when the gambler arrived, he revealed his true form. Pledging to make him suffer, Gepta tortured his arch-enemy, although Calrissian was able to escape after less than an hour."}, {"tag": "p", "text": "Gepta's hatred for Calrissian grew from this failure to capture the gambler, and he entered into a partnership with Admiral Klyn Shanga, head of the Renatasian Confederation, in hopes of catching Calrissian. Learning that Calrissian was in the ThonBoka nebula, trapped by an Imperial Navy blockade, Gepta traveled there. He soon arranged for a final confrontation with Calrissian by threatening to unleash the same bioweapon that he had used on Tund on the ThonBoka's inhabitants, a species known as the Oswaft. Clad in enviro-suits, Gepta and Calrissian did battle in space. There, Calrissian was able to shoot Gepta, ending the life of the vindictive Croke."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rise to power"}, {"tag": "p", "text": "Rokur Gepta was a Force-sensitive male Croke, a species that hailed from the planet Crakull. He was born on Crakull at least 20,000 years prior to the Battle of Yavin, and became skilled in creating illusions and deceiving others, something for which his species held a reputation. Thanks to his illusion-casting skills and forceful personality, he gained a reputation as someone who was not to be trifled with, with very few beings daring to stand up to him. He spent several decades prior to 5 BBY researching the Sharu, a highly advanced species native to the Rafa system that was believed to be extinct. In 5 BBY, Gepta, a Force Adept, joined the Sorcerers of Tund, a reclusive group of Force-users who practiced arcane forms of Sith magic. He learned all of the Sorcerers' secrets, including how to create an electromagnetic torpedo, a device containing a bioweapon capable of wiping out any life with which it came in contact. Once Gepta had learned all that the Sorcerers had to offer, he killed them all, using the electromagnetic torpedo's weapon to destroy Tund and turn the planet into a wasteland. In the following years, he occasionally returned to Tund to meditate."}, {"tag": "p", "text": "After destroying the Sorcerers, Gepta came in contact with Emperor Palpatine, ruler of the Galactic Empire. Palpatine was also a Sith Lord, and had an interest in learning from the Sorcerers of Tund. In return for some of the order's secrets, Palpatine promised Gepta power. Gepta was given a decommissioned Republic vessel known as the Wennis to command, and was named Scrivinir, or leader, of the Centrality, a largely ignored state in the Outer Rim Territories that contained the planet Tund. Thanks to Palpatine, Gepta, acting as the Central Administrator, had the authority to override the orders of Centrality government officials, as well as the power to call in Imperial Navy ships when necessary, and command them in operations in the Centrality. He quickly made many enemies in the region, although the officials who hated him lived in fear of him as well."}, {"tag": "h3", "text": "Search for the Mindharp"}, {"tag": "p", "text": "Gepta spent time searching for the Mindharp of Sharu, a legendary artifact that was the subject of a great deal of mystery. He had learned of the Mindharp thanks to his decades of research, and scoured various ruins in the Rafa system in hopes of finding the object, which he believed would give him control over all beings in the system. However, after trying and failing to locate the legendary artifact, Gepta decided to force someone else to find it for him. At some point, he entered into a partnership with Duttes Mer, governor of the Rafa system. Though Gepta told Mer that the device would provide him control over the Toka, Mer did not believe his explanation. Unbeknownst to the Croke, he hired private investigators who had previously worked for Gepta. Thanks to these investigators, the Governor learned of the Mindharp's true power, although he did not reveal this to his co-conspirator."}, {"tag": "p", "text": "According to legend, a wandering stranger was needed to discover the artifact; unless Gepta and Mer could find such a being, the Toka, descendants of the Sharu and keepers of the ancient legends, would not give their assistance in locating the Mindharp. Thus, the duo hired Ottdefa Osuno Whett, an anthropologist, to investigate the system and then go to the asteroid Oseon 2795. There, he was to wait for a suitable individual, whom he would then convince to go to Rafa IV, where Mer's office was. In 4 BBY, they had their stroke of luck when Whett met the gambler Lando Calrissian. After losing to Calrissian in sabacc and running out of money, he offered the gambler his droid, Vuffi Raa, which Whett said he had left in storage on Rafa IV. However, this was all part of Gepta and Mer's plan—they had programmed Vuffi Raa to help the chosen individual find the Mindharp, and then betray that being."}, {"tag": "p", "text": "Calrissian accepted Mer's offer, and soon made his way to the Rafa system to collect his prize. After picking up the droid and checking in at a hotel for the night, he was woken by a group of policemen, who took him and Raa to Mer. The Governor played several friendly of games of sabacc with Calrissian before he broached the matter of the Mindharp. However, Gepta grew tired of waiting and stormed into the office, much to Mer's dismay. The Croke explained to Calrissian what he sought, and also told him that the Mindharp was nothing more than an instrument of music. Calrissian, Gepta stated, would find the Mindharp for him and Mer, and would then be allowed to depart from the system. He would also be given a cargo of valuable life-crystals. To ensure that Calrissian did not simply flee as soon as he left the meeting, Gepta had the gambler's ship rendered incapable of leaving the system."}, {"tag": "p", "text": "The sorcerer also revealed the most important piece of information: Calrissian would be given a key made by the Sharu that Gepta believed would help him unlock the Mindharp. Gepta explained that the key had been taken from a museum on a world outside the Rafa system. Though Calrissian assumed that there was likely a much longer story involving betrayal and adventure beyond what Gepta had told him about how he acquired the key, the sorcerer did not elaborate on how he gained possession of the object. After handing over the key to Calrissian, the sorcerer sent the gambler and Vuffi Raa away to begin their search for the Mindharp."}, {"tag": "p", "text": "The Human and his droid spent the next four months searching for the Mindharp, with the help of the Toka High Singer Mohs. Traveling to the Great Pyramid on Rafa V, Calrissian was able to enter with the key. Inside, he discovered the Mindharp, and took it with him. When he departed the pyramid, he found himself on Rafa IV. It was at this point that Calrissian was betrayed by Vuffi Raa, who alerted a local policeman to arrest Calrissian. The gambler was taken to the Governor, who took the Mindharp and sent him off to a nearby prison. Mer then contacted Gepta, who was in orbit in the Wennis."}, {"tag": "p", "text": "Mer revealed the Mindharp and mocked the sorcerer, claiming that he was aware of its true power, and now that he had it, he would use it to gain control over the entire system. Frantic, Gepta boarded a small fighter craft carried by the Wennis and headed for Rafa IV, taking the vessel well beyond the recommended safety parameters. However, Mer had already begun to use the Mindharp in hopes of mastering its power before Gepta could and ruling the system without the sorcerer. When Gepta landed on Rafa IV, he found that the planet was suffering from groundquakes. He quickly headed for Mer's office, where he was met by the sight of the Governor staring enthralled at the Mindharp before melting away."}, {"tag": "p", "text": "Gepta realized that Mer had been unable to master the Mindharp and would soon be killed by the artifact's power. With the buildings shaking and threatening to collapse, the Croke fled. Leaving the Mindharp behind, he boarded his starship and headed back to the Wennis. However, before he left the planet's atmosphere, his ship encountered the Millennium Falcon, Calrissian's freighter. The two exchanged laser fire, and Gepta's ship was saved only because it was knocked out of the way by debris. The Millennium Falcon then escaped by jumping to hyperspace, much to Gepta's chagrin. The sorcerer felt that Calrissian had humiliated him, and swore that he would have revenge on him soon."}, {"tag": "h3", "text": "Vengeance"}, {"tag": "p", "text": "Gepta carefully kept an eye on Calrissian and arranged so that wherever the gambler went, he would fail to make a profit. By warning the authorities that the Millennium Falcon was a smuggler's ship, he forced Calrissian to pay large bribes at the various spaceports at which he touched down. He was able to manipulate the prices of items Calrissian intended to sell, such as wintenberry jelly, preventing the gambler from making money. The Croke also had his men plant a bomb on the Millennium Falcon when it stopped at Dilonexa XXIII, although it detonated early and failed to kill Calrissian. This unsuccessful assassination attempt only increased Gepta's desire to make the gambler suffer. Following this, the Wennis set course for the Oseon system, where Calrissian was headed. Gepta made his way to the asteroid Oseon 5792, the home of Bohhuah Mutdah, the wealthiest being in the galaxy. As part of his intricate plan to capture Calrissian, the Croke killed Mutdah and then took his form, being careful to prevent anyone from learning of the deception."}, {"tag": "p", "text": "Gepta threatened Lob Doluff, Administrator Senior of the Oseon system, warning him that he would kill his family unless Doluff cooperated in the sorcerer's plans. Gepta arranged for Doluff to arrest Calrissian on Oseon 6845 for possessing a weapon. On Gepta's orders, Doluff then offered the gambler an out—if Calrissian would participate in a drug bust by delivering a shipment of the drug lesai to Oseon 5792 while also taking the security officers Waywa Fybot and Bassi Vobah with him to arrest Mutdah in the middle of the delivery, he would be freed. Calrissian agreed, and the Millennium Falcon, with Fybot and Vobah aboard, flew to Oseon 5792."}, {"tag": "p", "text": "When the Millennium Falcon touched down on Oseon 5792, Calrissian disembarked and was led by several bodyguards to where Gepta, in the guise of Mutdah, waited. After delivering the package of lesai and receiving a payment of twenty million credits, Calrissian turned to leave; however, at this moment, Vobah and Fybot broke into the room, with Vobah declaring that Gepta—whom she believed to be Mutdah—was under arrest. Fybot then revealed his true allegiance by killing Vobah. Gepta praised the officer for executing his orders before suddenly shooting and killing him, much to Calrissian's surprise. Gepta then trained his gun on Calrissian and ordered him to take a pair of handcuffs from a nearby drawer and put them on. When the gambler questioned why he had not simply killed him outright, the trillionaire revealed his true form—that of Rokur Gepta. He would now, the sorcerer proclaimed, torture Calrissian to death."}, {"tag": "p", "text": "Gepta knocked Calrissian unconscious, took him outside, and strapped him down in preparation for what he planned to be a torture session that would last for weeks until the gambler died. Utilizing the technique of torture by chagrin, as well as a special machine, Gepta was able to make Calrissian relive his worst memories, and even alter the memories to make them worse. Though Gepta would have to suffer through all of these memories and feel the pain that Calrissian felt, the sorcerer was willing to do so to make his enemy know pain and misery. Gepta even taunted Calrissian with the twenty million credits that the gambler had possessed for mere minutes. He took great pleasure in causing the Human anguish. However, Gepta was interrupted after torturing Calrissian for less than an hour when Oseon 5792 came under attack by a group of Renatasians who mistakenly believed Vuffi Raa to be responsible for the destruction of their civilization and had followed the Millennium Falcon to the asteroid."}, {"tag": "p", "text": "Flying in starfighters, the Renatasians managed to damage the asteroid's habitable dome containing Mutdah's mansion, exposing it to vacuum. Gepta was distracted by the explosion that resulted from the breaching of the dome, allowing Calrissian to stab him in the eye with a piece of tinklewood that he wore as a splint. The gambler was then able to slip out of the restraints holding him down, and flee back to his ship, with Gepta in pain and unable to catch up to him. On board the Millennium Falcon, the gambler absconded, while Gepta headed to his personal one-man craft that he had stored on the asteroid. The Croke was greatly angered by his failure, and vowed once again that he would see the death of Lando Calrissian."}, {"tag": "h3", "text": "Journey to the ThonBoka"}, {"tag": "p", "text": "Several months later, Gepta received word of an offer of allegiance from Admiral Klyn Shanga, leader of the Renatasian Confederation. The Renatasians hoped to gain Gepta's aid in their search for Vuffi Raa, the individual they believed to be the destroyer of the Renatasia system. Believing that an allegiance would be mutually beneficial, Gepta arranged to meet the Renatasians on Tund. Shanga and his men then met with the sorcerer in a darkened cave, where they discussed the prospect of becoming accomplices. When Shanga questioned why Gepta was so interested in Calrissian, the sorcerer replied simply that the gambler had offended him with his boldness, also subtly warning Shanga to beware of overstepping his bounds. Shanga then revealed to Gepta that Calrissian could be found in the ThonBoka nebula, which was currently the subject of an Imperial blockade. The two sides agreed to ally in hopes of capturing their targets."}, {"tag": "p", "text": "Following their meeting, Gepta hurried to the ThonBoka. When he arrived, he was greeted by the news that the Millennium Falcon had apparently been destroyed by an Imperial vessel when trying to run the blockade of the nebula. Gepta was furious at this news, and had the officer who brought him the report killed. However, he did not give up his search for the gambler, believing that he could have survived the explosion. Thus, the Wennis remained in the system. Gepta was soon able to discern that the Millennium Falcon had not been destroyed as it appeared. He also learned that the ThonBoka was inhabited by a species known as the Oswaft, very large, manta-like sentients who lived in the vacuum of space. The Imperial Navy believed that the Oswaft potentially posed a threat, and thus, had surrounded the nebula in hopes of starving the species to death. Calrissian had coincidentally befriended one of the Oswaft, and sought to save them from destruction, leading to him escaping through the blockade. Gepta enlisted the help of Osuno Whett, planning to learn more about the species and then manipulate them into handing over Calrissian—or, if they refused, destroy them. Whett was able to spy on the creatures and concluded that they were a highly advanced race."}, {"tag": "p", "text": "After Gepta had Bern Nuladeg, a member of the Renatasian fighter squad, imprisoned in the Wennis's brig for attempting to steal a fighter to try and attack the Millennium Falcon himself, Shanga confronted the sorcerer, as he felt the imprisonment was unjust. After a heated argument which left Gepta steaming at Shanga, whom he saw as insubordinate, Gepta agreed to free Nuladeg for the upcoming battle. When the Human left, Gepta reflected on the fact that Shanga was the only person, aside from Calrissian, to stand up to him in millennia. Soon after this, Gepta decided it was time to finally attack the Oswaft and have his revenge on Calrissian."}, {"tag": "h3", "text": "Battle of ThonBoka"}, {"tag": "p", "text": "In the middle of the ensuing battle, Gepta ordered the Imperial ships to stand down, and sent out a proclamation to the Millennium Falcon. Gepta congratulated Calrissian on the fight that he and the Oswaft were putting up, but stated that the sorcerer would defeat him, if only because he was willing to sacrifice all the men he commanded to ensure Calrissian's death. He then released a small particle of energy from his electromagnetic torpedo, sending the green energy toward a group of Oswaft and instantly vaporizing them. Gepta informed Calrissian that he would annihilate all life in the nebula with this substance. However, he gave the gambler an alternative—a duel to the death in the vacuum of space. If Gepta won, he would release a large quantity of the bioweapon, killing all the Oswaft, but if Calrissian killed Gepta, then the Imperial fleet would retreat."}, {"tag": "p", "text": "Calrissian accepted the Croke's offer, and put on an enviro-suit, enabling him to enter vacuum. Per Gepta's suggestion, he would have the aid of Vuffi Raa, as the gambler had no magic powers like Gepta. Before exiting through his vessel's airlock, Gepta ordered one of his officers to destroy all life in the ThonBoka regardless of the outcome of the battle. To ensure that the man followed his orders, he had a fighter sent to his homeworld, promising to kill the Captain's family if his orders were not followed. He also instructed his men to prevent interference from anyone, causing the Wennis to destroy one of the Renatasian fighters that attempted to attack Vuffi Raa and Calrissian."}, {"tag": "p", "text": "Having issued his orders, Gepta stepped out into space, where he was met by the gambler and his droid. Gepta fired several blasts of energy at Calrissian, although the Human was able to evade them. In turn, Calrissian released several shots from his stingbeam, and though they hit the sorcerer square in the back, the blast went right through him, much to the Human's shock. Gepta continued attacking Calrissian with blasts of energy, but he also had to contend with Vuffi Raa, who was able to separate his tentacles from his body and remotely command them. The droid used this ability to great effect, succeeding in distracting the sorcerer."}, {"tag": "p", "text": "Meanwhile, Osuno Whett—the individual responsible for the destruction of the Renatasia system—tried to attack Calrissian, Vuffi Raa, and Gepta in his pinnace. Upon hearing Whett's voice, Klynn Shanga realized that Whett, not Raa, was the \"Butcher of Renatasia,\" and ordered his men to attack the pinnace. Evading beams fired from the Wennis, the Rentasians pursued Whett, causing him to crash into the Wennis. With the cruiser's shields down, the Wennis was destroyed, as was Whett in his ship. Gepta was taken aback by the destruction of his ship, and was struck in the ankle by a shot from Calrissian's blaster."}, {"tag": "p", "text": "Calrissian hurried over to Gepta's spacesuit, finding that the apparently Humanoid body had disappeared. In the leg, however, he found a small creature resembling a black slug—Gepta's true form. Calrissian took the Croke in his hands and squeezed, crushing his enemy and ending the life of the last Sorcerer of Tund. When the Imperial Navy moved to attack, they were suddenly assaulted by the Silentium, a sentient species of droids kilometers in size that had just come out of hyperspace. The droids were responsible for creating Vuffi Raa, and had come to reclaim him, arriving at the ThonBoka just in time. They destroyed the cruiser Recalcitrant and warned the Imperials that any other ship that attempted to fire would be destroyed. The Navy retreated and the Oswaft were saved, while Calrissian was now free from Gepta and his burning desire for revenge."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In 22 ABY, Calrissian published his memoir, How to Succeed in Everything, which mentioned Gepta. A section concerning the Sorcerer was included in Jedi vs. Sith: The Essential Guide to the Force, a work by Jedi Master Tionne Solusar."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rokur Gepta was arrogant and power-hungry. He had tremendous confidence in his own abilities, and desired to expand his influence and authority. He was not satisfied with having control over the Centrality, and sought fabled artifacts like the Mindharp of Sharu in hopes of eventually seizing control of the entire galaxy, although this plan did not come to fruition. He considered himself empty and devoid of warmth and life, and took no comfort in wealth or companionship; only authority and inflicting pain on others brought him pleasure. Gepta saw others only as tools that he could he use to help himself in his rise to power. He savored deceptions, and considered himself a master of disguise."}, {"tag": "p", "text": "Gepta was cruel and enjoyed others' suffering. At times, he killed his subordinates for their failures, and sometimes fed their remains to his pets, carnivores that he kept caged on the Wennis. In one instance, Gepta even allowed a subordinate who had merely brought him bad news to believe he was escaping without punishment, only for one of his bodyguards to then take the man away and execute him. Klyn Shanga noted that Gepta would not hesitate to kill even a highly competent assistant who had failed him once. Gepta believed that after seeing one of their own tortured or killed for his failure, the crew of the Wennis would perform better in hopes of avoiding a similar fate. The Croke was an intimidating figure, and many who met him quickly grew fearful of him. Fellow Centrality politicians, such as Duttes Mer, were afraid of Gepta, even as they hated him."}, {"tag": "p", "text": "During the Battle of ThonBoka, Gepta ordered the Imperial Navy vessels not to contradict his orders of staying in their established position—even if a ship remaining where it was meant that it would be destroyed. He also had the commanding officers and the second-in-commands of the Upright, the Intractable, and the Vainglorious executed for questioning his orders during the battle. In addition, the Croke was willing to wipe out an entire race that stood between him and his prey, with no qualms about their destruction."}, {"tag": "p", "text": "Gepta developed an obsession with Lando Calrissian, seeking to torture him, as the gambler had humiliated him. The Croke was willing to follow Calrissian, and use his influence to subtly prevent his arch-enemy from making a profit. He also was content to torture Calrissian even though he would share the pain felt by the gambler; as long as the Human was suffering, Gepta was satisfied. After capturing Calrissian, only to have him escape, Gepta's hatred for the gambler grew. Upon hearing the news that an Imperial Navy cruiser had apparently destroyed the Millennium Falcon, the sorcerer was filled with rage, for though he wanted Calrissian to die, he would not be content unless it was by his hand. It was this obsession with Calrissian that led to Gepta's undoing."}, {"tag": "p", "text": "Though he allied himself with Klyn Shanga, Gepta quickly tired of him, finding the Renatasian insubordinate and overly bold. Shanga disagreed with Gepta's orders to his face on multiple occasions, much to the anger and shock of the sorcerer—no one had spoken to him in such a way in millennia, he noted at one point. At several points, the Croke came very close to killing Shanga outright. However, the sorcerer prided himself on his patience, and resolved to wait until he had killed Calrissian and Shanga's usefulness had expired. After he had dealt with Calrissian, Gepta planned to kill Shanga."}, {"tag": "p", "text": "Despite his hatred of Shanga, Gepta also found himself mystified by the Renatasian. He had come to the conclusion that despite being unafraid to die, Shanga enjoyed life—a trait not normally held by those who claimed to be unafraid of death, Gepta believed. The sorcerer—who was not used to being confused and was thus angered—decided to ponder the matter further after finishing with Calrissian. He also noted that if all Renatasians were as bold and courageous as Klyn Shanga, the system could pose a threat to his plans, and the inhabitants would perhaps have to be eliminated."}, {"tag": "p", "text": "Gepta frequently spent time in a special shielded room near the Wennis's drives, where his electromagnetic torpedo was kept. The sorcerer took pleasure in imagining unleashing the weapon on civilizations, and was fond of simply standing in the room and staring at the glowing device. Though he disliked light, he found the green glow pleasing. At varying points in his life, Gepta also returned to Tund, where he would spend hours meditating in the dark caverns of the ruined world. He held an affection for his pets, vicious carnivores, as well. He disliked political maneuvering, and had the crew of the Wennis wear uniforms devoid of any rank insignias to perpetuate political myths. Although the crew disliked this, they rarely complained about it due to their fear of Gepta."}, {"tag": "p", "text": "During his time pretending to be Bohhuah Mutdah, Rokur Gepta sank into a deep depression, as the actual Mutdah had been a very melancholy individual. Gepta sought to emulate the real Mutdah, and thus became greatly depressed, almost losing his hold on reality and forgetting his true identity. Only his hatred of Calrissian allowed him to keep his mind and revert back to his original form."}, {"tag": "h3", "text": "Appearance"}, {"tag": "p", "text": "Gepta appeared to various beings in different forms, from a giant to a dwarf. By 4 BBY, his preferred form was of a humanoid cloaked in gray Tundan robes who wore a turban around his head, with only his eyes remaining uncovered. This illusion form was slightly taller than Lando Calrissian. Calrissian noted that the sorcerer's eyes were filled with incredible hunger, and felt as though he was an insect that Gepta intended to crush when the sorcerer focused on him. The gambler found Gepta's eyes intimidating, and had to force himself to look at them. In actuality, Gepta was a Croke, a black, slug-like, illusion-casting sentient the size of a Human hand."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Gepta was highly skilled in creating illusions, and could even manipulate the minds of others, as when he utilized torture by chagrin on Lando Calrissian. He was able to create an electromagnetic torpedo, and used the weapon in this container to destroy the planet Tund. He was Force-sensitive, and was able to telepathically torture others, as he did on various occasions, such as to Lando Calrissian and an officer aboard the Wennis. He used a special machine to help enhance the pain Calrissian felt during his torture session. Gepta learned a great deal from the Sorcerers of Tund, although at the time of his death his skills were incomplete. When stabbed in the eye by Lando Calrissian's tinklewood splint, Gepta was able to shed the pain by briefly reverting to his real form."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Rokur Gepta was created by L. Neil Smith for Lando Calrissian and the Mindharp of Sharu, the first book of The Lando Calrissian Adventures. Smith initially conceived of the character as a Dark Lord of the Sith similar to Darth Vader, but Lucasfilm axed this concept, claiming that the Sith were off limits for his novel. As a result, Smith invented the Sorcerers of Tund as a replacement, making Gepta a member of their order."}, {"tag": "p", "text": "The Essential Guide to Characters mistakenly spells his name as \"Rakus Gepta.\" Although The Lando Calrissian Adventures describe Gepta as wearing only gray robes, his New Essential Guide illustration (seen at the top of this article) depicts him wearing gray with red trim."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}