{"url": "Rolf_Treidum", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males", "Category:Personnel of Moff Sarne's forces"], "nodes": [{"tag": "h1", "text": "Rolf Treidum"}, {"tag": "p", "text": "Rolf Treidum was a Human male who served in the Imperial Navy during the Galactic Civil War. During his service while stationed in the Deep Core, Treidum encountered a young officer named Kentor Sarne and became one of his staunchest supporters. As a result, when Sarne was appointed as Moff of the Kathol sector, Treidum transferred to the Kathol Sector Imperial Fleet and commanded the CR90 corvette Lialic II. Following the death of Emperor Palpatine during the Battle of Endor—a battle that also claimed the life of Treidum's only son—Treidum served Moff Sarne as he withdrew the Kathol sector from the Galactic Empire and set himself up as a warlord. In 8 ABY, following the New Republic's liberation of the planet Kal'Shebbol, Treidum and the Lialic II retreated with Sarne into the deep regions of the Kathol sector."}, {"tag": "p", "text": "However, when Sarne learned that the New Republic had dispatched the CR90 corvette FarStar to track him down, he ordered Treidum and the Lialic II to return to the Kathol Outback and delay the vessel as much as possible. Although Sarne wished the FarStar to locate him and call in a New Republic strike force, he wanted it to be on his own timetable, and at a place of his choosing. He planned to destroy the New Republic regional forces in one fell swoop, allowing him to reclaim the sector unopposed. As such, Treidum was ordered to only stall the vessel, and not destroy it. Renaming the Lialic II as the Lance of Endor, Treidum posed as a New Republic officer to stir up resentment for the New Republic and the FarStar by portraying the government as a totalitarian regime that wished to bring all planets under its dominion. Treidum fooled several governments with this ruse, including the Kathol Republic and the leaders of the planet Danoor. While Treidum did succeed in delaying the FarStar during its trip through the Kathol Outback, he was unable to enjoy his victory as he was killed during the Battle of Danoor, when the Lialic II was rammed by an Aing-Tii Sanhedrim ship."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Imperial service"}, {"tag": "p", "text": "The Human male Rolf Treidum served with the Imperial Navy forces stationed in the Deep Core during the Galactic Civil War, and met an officer named Kentor Sarne during this period. Treidum was quick to ally himself with the ambitious young man, a move that would tie his future career to Sarne's. At some point, Treidum fathered a son, who would follow in his father's footsteps and join the Imperial Military."}, {"tag": "p", "text": "Kentor Sarne was appointed as Moff of the Kathol sector around 2 BBY, and Treidum was transferred to the Kathol Sector Imperial Fleet sometime after. Serving under Sarne, he commanded the Corellian Engineering Corporation CR90 corvette Lialic II, one of several such corvettes operating with Sarne's forces. In 4 ABY, the Alliance to Restore the Republic engaged Imperial forces over the forest moon of Endor. During the battle, which saw the deaths of Emperor Palpatine and Darth Vader, and the destruction of the second Death Star, Treidum's only son was killed."}, {"tag": "p", "text": "Treidum continued to serve with Sarne as the Moff quietly withdrew the Kathol sector from the Empire, setting himself up as a warlord by taking advantage of the confusion in the Imperial command structure following the death of the Emperor. In 8 ABY, the New Republic launched an assault on Sarne's capital of Kal'Shebbol. During the fighting, Sarne was able to escape into the Kathol sector with the majority of his forces, including Treidum and the Lialic II."}, {"tag": "h3", "text": "A new mission"}, {"tag": "p", "text": "Moff Sarne learned that the New Republic had sent a single ship after him, assigned to track him down and attempt to neutralize any threat he posed to the security of the region. Unfortunately for the New Republic, the ship they had tasked with the mission, the FarStar, had originally been part of Sarne's forces. Formerly known as the Renegade, the ship had been in the middle of an extensive series of modifications. One such modification allowed Sarne to track the vessel's location at all times."}, {"tag": "p", "text": "Although Sarne intended for the FarStar to follow him, and thus bring about a larger confrontation with New Republic forces at a place of his choosing, the Moff needed to ensure that the corvette kept to a timetable of his design. Sarne's plan was to completely crush the New Republic forces assigned to the Kathol sector, which in turn would allow him to regain control of his former holdings and reoccupy his capital, Kal'Shebbol, unopposed. He could not allow the FarStar to discover his location too early, nor dissuade them enough to force them to abandon their mission through lack of success. As a result, Sarne ordered Treidum to detach the Lialic II from his forces, and return to the Kathol Outback. There, Treidum's orders were clear—delay the FarStar by any means necessary, deny the New Republic any potential allies by stirring up resentment against them, but under no circumstances was the corvette to be destroyed or crippled so that it could not complete its mission. If the FarStar was destroyed by means beyond Treidum's control, Sarne expected a full report proving the captain's innocence in the matter."}, {"tag": "h3", "text": "Opposing the FarStar"}, {"tag": "p", "text": "Treidum devised a plan to accomplish both tasks at once. He renamed the Lialic II as the Lance of Endor, realizing the irony in associating the vessel's alias with the place where his son perished. Posing as an emissary of the New Republic, he approached several Outback planets. After welcoming them into the New Republic, he then made impossible demands of the local population. When they did not—or could not—comply, he attacked them with the Lialic II's weapons. Treidum's plan worked, turning several neutral planets against the New Republic."}, {"tag": "p", "text": "Sarne ordered Treidum to delay the FarStar in the Kathol Republic, a small pocket empire centered in the Episol system. Treidum's reconnaissance of the union indicated that the Kathol Republic's navy was enough to threaten the FarStar. Arriving in the Episol system, Treidum demanded the annexation of all Kathol Republic worlds, a fifty percent tax on products and resources, the forced sterilization of all colonists, and the replacement of all elected officials with appointed New Republic representatives. After reporting his plan and his actions to Sarne, the Moff lured the FarStar to the system by intentionally broadcasting his response on a wide-beam transmission that he was sure that the New Republic ship would intercept."}, {"tag": "p", "text": "When the Kathol Republic refused to meet his demands, Treidum attacked two of the Republic's Marauder-class corvettes, destroying one, and damaging a second, the Bravado III. While preparing to engage another target, the FarStar arrived. Treidum withdrew the Lialic II from the system, leaving the FarStar to deal with the rest of the Kathol Republic Navy. The New Republic corvette surrendered rather than provoke a confrontation, and the vessel was impounded by the Kathol Republic, and her crew taken for trial on the moon of Dayark, the capital of the Republic. Despite being confused over why the Kathol Republic considered the New Republic vessel to be a threat, Captain Kaiya Adrimetrum, commander of the FarStar, managed to convince the Kathol Republic Senatorial Council of their innocence, and exposed a plot to overthrow the elected leadership of the Kathol Republic by one of their own senators. Grateful to the crew of the FarStar, the ship was allowed on its way armed with the information that another corvette was posing as a New Republic vessel, and with the Kathol Republic as a new ally."}, {"tag": "p", "text": "A short time after the Lialic II's mission to Episol, Captain Treidum, acting on the orders of Moff Sarne, ordered a Gamma-class assault shuttle to a specific set of co-ordinates to rendezvous with the Qektoth Confederation. The Confederation was a militant order of scientists and idealists who believed in the purity of organic technology. Sarne had entered into an agreement with them to gain some of their bioweapons in exchange for ships and their crews. The Gamma-class assault shuttle was subsequently used by the Confederation as a testing ground for their biochemical agent."}, {"tag": "h3", "text": "Final gambit"}, {"tag": "p", "text": "Treidum kept to his mission, visiting the planet Danoor on the edge of the Kathol Rift, demanding the complete surrender of the colony, annual tribute equal to half the planet's gross income, and ten percent of the population to be used as slaves in the name of the New Republic. While on the planet, he secretly contacted one of the Ministers on Danoor, Waric Nane. Nane's political views were in line with those of Sarne's, and Treidum decided that he could use Nane as an ally in his mission against the FarStar. He told him of his true identity and informed him of the benefits of joining with Moff Sarne's Empire. Nane, a proponent of a totalitarian regime, agreed to consider his offer. Treidum provided the Minister with a strange trapezoid device that could be used to contact him in case of an emergency. However, Treidum requested that, if the New Republic should ever turn up at Danoor, then Nane would activate the device and let Treidum know immediately. He was then to find a way to keep them on the planet until Treidum could return."}, {"tag": "p", "text": "A week after Treidum had made his demands and left Danoor, the device was activated, alerting him that the FarStar had arrived in the system. The Lialic II, along with an Imperial-class Star Destroyer, returned to the planet. Finding the FarStar in orbit, Treidum ordered his ships to attack. Although badly outclassed, the FarStar was joined by starfighters from the Danoor Resistance in defending the planet. During the subsequent battle, the Star Destroyer utilized a new weapon, known as a devastator torpedo, which obliterated a ten kilometer area of the planet and caused the Danoor Resistance fighters to disengage from the battle. However, the arrival of the mysterious Aing-Tii swung the battle in the New Republic's favor. They had been called by a message beamed into the Kathol Rift by the FarStar on behalf of the Danoor Resistance, who were their allies. The Aing-Tii Sanhedrim ship charged straight for the Lialic II, ramming the ship and completely destroying the corvette with the loss of all hands, including Captain Treidum. With the battle down to the FarStar against the Star Destroyer, the FarStar's own fighter complement managed to strike the torpedo's launcher, causing a chain reaction explosion that destroyed the vessel. Despite losing his life, Treidum had succeeded in his mission, delaying the FarStar long enough for Moff Sarne to prepare his forces for their arrival."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Treidum was considered to be a talented and loyal Imperial officer who believed that the end result justified the means by which it was achieved. He was able to present an affable front when it was needed, but it was only to gain an advantage over his enemies. Pragmatic and practical, Treidum was able to use government factions to his advantage in his mission to harass the FarStar, such as siding with Minister Waric Nane of Danoor and offering Imperial aid to his policies in exchange for delaying the New Republic vessel as much as possible. Tactically competent, Treidum was able to successfully engage two Marauder-class corvettes in battle with the Lialic II, and was the theater commander during the Battle of Danoor despite the presence of an Imperial-class Star Destroyer, a vessel that had tactical superiority over his own corvette. In his early sixties by the time of his death in 8 ABY, he had dark hair that was only just beginning to go gray."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Treidum was trained in the use of blaster pistols, and was also skilled in melee combat, the use of grenades, and missile weapons. Able to pilot both capital ships and space transports, Treidum specialized in Corellian corvettes. He was also able to use the weapons on capital ships—with a particular focus on concussion missiles—and was knowledgeable about their shield systems. Treidum could assist in the repair of capital ships and their weapon systems, and had training in sensor systems and astrogation. He was well versed in Imperial law enforcement procedures and security systems, and displayed a understanding of alien species, languages, other cultures, bureaucracy, business, and planetary systems. Treidum could drive repulsorlift vehicles, and repair them if the need arose. He also had some skill in programming and repairing both computers and droids. Treidum also had experience in demolitions and first aid."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Treidum favored an Imperial Munitions heavy blaster pistol as his personal weapon, and also carried a comlink and datapad. He generally wore an Imperial officer's uniform, but he had a New Republic uniform to don when he needed to convince the inhabitants of the Kathol Outback that he was representing the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rolf Treidum was created for the supplement The Kathol Outback by West End Games for use with Star Wars: The Roleplaying Game. Treidum served as the major Imperial antagonist for the crew of the FarStar in several adventures, although he wasn't encountered directly until the final scenario, Galaxy's Edge, in which he met his end."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}