{"url": "Rokko", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Crime lords", "Category:Hutts of the Besadii clan", "Category:Males"], "nodes": [{"tag": "h1", "text": "Rokko"}, {"tag": "p", "text": "Rokko was a Hutt crime lord who operated on the planet of Coruscant in 19 BBY. A member of the Besadii clan, he operated mainly in the Yaam Sector, trafficking in stolen merchandise. During this time, he had dealings with the Jedi fugitive Jax Pavan, initially hiring him to track down a Cerean named Toh Revo Chryyx for him. However, in the process of attempting to apprehend the Cerean, Chryyx committed suicide, which led to Rokko refusing to pay Pavan. When Pavan used the Force to defend himself against Rokko's bodyguards, the Hutt alerted sector police to the fugitive's presence, but Pavan was able to defeat the stormtroopers who were sent to arrest him."}, {"tag": "p", "text": "Pavan later came to Rokko seeking help in locating the droid 10-4TO, which supposedly had information important to the group Whiplash, a secret resistance organization opposed to the Empire. Rokko agreed to help Pavan, believing that there would be a sizable reward for him. However, after a Sullustan named Den Dhur arrived at Rokko's home with a droid named I-5YQ, who knew Pavan, Rokko suspected Pavan's plea for help was a plot aimed at killing him. Though he had his bodyguards attack the group, he was forced to quickly order them to stand down after I-5 threatened to destroy his prize possessions, decelerated luminescent images, rare pictures of Nal Hutta. Pavan and the others were then able to flee from the Hutt."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "First encounter with Pavan"}, {"tag": "p", "text": "Rokko was born approximately 400 BBY on Nal Hutta into the Besadii clan. At some point, Rokko moved to the capital world of Coruscant, where he established a small criminal empire, based in the Yaam Sector of Galactic City. The crime lord dealt mainly in stolen merchandise, and he built up a considerable fortune and made a name for himself on Coruscant."}, {"tag": "p", "text": "In 19 BBY, Rokko hired the Jedi fugitive Jax Pavan—who was making a living as a bounty hunter—to hunt down a Cerean by the name of Toh Revo Chryyx, promising to pay Pavan 15,000 credits for Chryyx. However, the Cerean committed suicide by stopping his heart after Pavan captured him. As the bounty had specified that Chryyx be brought to him alive, Rokko reneged on his word. Pavan met with Rokko and two of his bodyguards in the Blackpit Slums section of the underlevels, where Pavan demanded he be paid, claiming it was not his fault the Cerean had killed himself. Rokko refused to pay the Human, insisting that the bounty had said Chryyx would be accepted alive only."}, {"tag": "p", "text": "When the Human again insisted that he was owed money, Rokko sent his two bodyguards—a Nikto and a Klatooinian—to attack Pavan. However, Pavan used the Force to disarm the two, though that action revealed him as a Jedi. Now aware of this fact, Rokko contacted the local Imperial sector police after the battle, hoping to collect the bounty on Pavan. Pavan defeated the stormtroopers sent to arrest him, and he suspected Rokko had sent them."}, {"tag": "h3", "text": "Request for help"}, {"tag": "p", "text": "However, a few days later, Pavan showed up at Rokko's home, hoping to speak with the Hutt. Rokko allowed his Aegis-7 battle droid to admit Pavan and his comrade Laranth Tarak, a female Twi'lek. Pavan promised to overlook the fact that Rokko had turned him in to the Empire if the Hutt would help them search for the droid 10-4TO. The protocol droid was said to contain information valuable to Whiplash, a group resisting the Empire in secret. Pavan tried to convince Rokko that the Empire would be willing to pay a large sum for it, although in reality the Jedi planned to give the droid to Whiplash."}, {"tag": "p", "text": "Although the Hutt considered turning Pavan in for the bounty on his head, he decided against it and agreed to consider helping the two. While he was mulling over the idea, a Sullustan by the name of Den Dhur arrived at Rokko's home. Dhur claimed to have a droid that was an expert at the card game sabacc. Intrigued, Rokko allowed Dhur and the droid, I-5YQ, to enter. After playing the droid, the Hutt was stunned to find that it was able to beat him. He offered to pay Dhur 500 credits for it, realizing that it would be able to win many games against unsuspecting opponents, making money for the Hutt. After bargaining, the two settled on 1,000 credits."}, {"tag": "p", "text": "Before Dhur left, Rokko asked the droid to fetch Pavan and Laranth. Unknown to the Hutt was that Dhur was not planning on selling I-5; rather, it was a ruse so that the two could find information about Jax Pavan, the son of I-5's late master. In his dying breath, Lorn Pavan had requested that I-5—whose intelligence bordered on sentience—help take care of his son should a need arise. Dhur and I-5 hoped that Rokko would be able to aid them using his intelligence sources, and so used sabacc as a front. When I-5 encountered Pavan in Rokko's house, he immediately informed the Jedi that he had been looking for him, per a request from Pavan's father."}, {"tag": "p", "text": "Stunned to hear that a droid was going to tell him about his father and how Lorn Pavan had died, Pavan marched away to Rokko's throne room. However, after the Hutt realized that the droid knew Pavan, he assumed that it was not mere coincidence—rather, he thought, it was a plot to kill him. He had his bodyguards move to attack them but was quickly forced to call them off. I-5 had activated his finger-laser and threatened to destroy Rokko's most prized possession—his collection of decelerated luminescent images, works of the Hutt artist Gorgo. These were images frozen in time, as they were made of protium gas exposed to Nal Hutta centuries ago. These were so thick it took light years to shine through, making them essentially \"windows to the past\". As Gorgo had died centuries ago, the images were extremely rare; in fact, Rokko owned the only such images in the galaxy."}, {"tag": "p", "text": "Due to his prized possessions being threatened, the Hutt immediately called off his bodyguards and allowed the group to leave. However, as soon as they had reached the turbolift, Rokko sent his Aegis-7 battle droid after them. The group was able to bring the ceiling down on the droid and escaped."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rokko the Hutt was a greedy, merciless being, with little care for others. Jax Pavan once expressed the opinion that Rokko would sell out his mother for money, no matter the amount. Rokko attempted to turn Pavan over to the Empire simply because there was a bounty, though worth little, on his head. After Pavan came to him later, having survived the Empire's attempt to arrest him, Rokko agreed to work with him, as the Human had a business deal in mind. Though Rokko considered selling out Pavan once more, he decided that the effort was not worth it. Rokko was also described by Jax Pavan as cruel and merciless."}, {"tag": "p", "text": "However, Rokko did have a softer side. He loved art, particularly the works of the Hutt artist Gorgo, and would go to great lengths, even allowing his enemies to escape, in order to protect them. Rokko greatly admired Gorgo and showed genuine sadness that his works were almost extinct."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rokko was created by author Michael Reaves and appeared in the 2008 novel Coruscant Nights I: Jedi Twilight, the first installment of the Star Wars: Coruscant Nights trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}