{"url": "Roko", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unidentified species", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Roko"}, {"tag": "p", "text": "Roko was the first mate of pirate Captain Finhead Stonebone in the years leading up to the Great Sith War. Based in the Stenness Node, Stonebone's pirate gang plagued Ithullian ore haulers traveling through the region, attacking them and siphoning the valuable mutonium ore they carried. On one occasion in 3999 BBY, Roko and his team ambushed one particular ore hauler that was under the control of Captain Gruna. Although the ship was protected by minions of local crime lord Bogga the Hutt, the ship's defenses were neutralized, and Roko and a team of pirates moved in to pillage the ship and siphon its ore. However, they were surprised by the sudden arrival of Bogga's massive dreadnought, Enforcer One, which caught the pirate ship Marauder Starjacker in its tractor beam, capturing Roko, Stonebone, and the other pirates. They were brought to Bogga's estate on the moon of Vo Dasha, where Bogga offered Stonebone and the pirates freedom if he performed a task for the crime lord. When Stonebone refused, Bogga unleashed his hssiss pet Ktriss on Roko, and the beast quickly ripped him to shreds."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Roko was a member of Captain Finhead Stonebone's pirate gang in the years prior to the Great Sith War. Roko was well-liked by Stonebone and eventually became the pirate leader's first mate. Stonebone's pirate group was based in the Stenness Node region, and one of their primary activities was siphoning ore from the Ithullian ore haulers that transported their cargo through the region to the Stenness Hyperspace Terminal. In 3999 BBY, the gang set their sights on one particular ore hauler, captained by Gruna, which was shipping valuable mutonium ore. In their ship, the Marauder Starjacker, Roko and the pirates dropped out of hyperspace and began attacking the ship. Although the ore hauler was defended by an underling of the local crime lord Bogga the Hutt, pirate gunner C'borp was able to clear the way for Roko and a boarding party to enter the ore hauler and start siphoning. The pirates were able to pierce the ship's hull, and Roko, along with a number of other pirates, descended down into the disabled ore hauler. Roko and the pirates were quite satisfied with their haul, and Roko personally took a female member of the ship's crew prisoner."}, {"tag": "p", "text": "Their jubilance was short-lived, however, as Bogga the Hutt's warship Enforcer One promptly arrived on the scene. The Enforcer One ensnared the Marauder Starjacker in a tractor beam, capturing the pirate gang. The pirate vessel was pulled into the mighty dreadnought's hangar, where Roko and his fellow crewmembers found themselves encircled by an ensemble of Weequay and Nikto enforcers, led by one of Bogga's top men, Grimorg. The pirate gang was ordered off their ship and transported to Bogga's private estate on the moon Vo Dasha. Stonebone was personally brought before Bogga, who offered him a deal: he and his pirate associates would be freed if they retrieved a lost shipment of valuable Adegan crystals from Bogga's sworn enemy, Jedi Master Thon. When Stonebone refused, a chained Roko was brought out in the estate's courtyard, and Bogga unleashed his hssiss pet Ktriss on a frightened Roko. Although Roko pleaded to Stonebone to help him, the pirate Captain was powerless to assist his first mate, instead telling him that he was the best first mate Stonebone ever had. Ktriss then swiftly ripped Roko to shreds. Roko's gruesome death convinced Stonebone to help Bogga in retrieving the crystals."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Roko was very competent at his job as Finhead Stonebone's first mate, so much so that Stonebone referred to Roko as the best first mate he ever had. Roko was good friends with the pirate captain, and he referred to Stonebone respectfully as \"cap'n.\" Roko performed his duties as a pirate with enthusiasm and aplomb, and greatly enjoyed the task of storming the ore hauler in the Stenness Node. However, Roko quickly became fearful when presented with the clear and present danger posed by the angry Ktriss and desperately pleaded to Stonebone to help him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Roko first appears in Tales of the Jedi: The Saga of Nomi Sunrider, the second story arc of the Tales of the Jedi comic book series, written by Tom Veitch and released over late 1993–early 1994. Roko makes his first appearance in the arc's second issue, in which he is killed on the comic's final pages. Accordingly, his dead body appears in the beginning of the third and final issue of The Saga of Nomi Sunrider. In these appearances, Roko is illustrated by David Roach. In 1998, Roko was given an entry in the Star Wars Encyclopedia, and in 2008 he was given an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}