{"url": "Rollos", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Gigorans", "Category:Imperial slaves", "Category:Males"], "nodes": [{"tag": "h1", "text": "Rollos"}, {"tag": "p", "text": "Rollos was a Gigoran swindler, and friend and business partner of Reina Gale. Together with Gale, he roamed Entralla hunting for shady business deals of various kinds."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sold to an Imperial slavemaster by a Sullustan slaver, Rollos befriended Reina Gale. She was the only person in the slave camp who understood the Gigorian language, Rollos not being able to speak Basic although he comprehended it. When Rollos learned that the Imperial slave master was planning to have Reina killed, he single-handedly destroyed the entire slave camp. He then stole the slavemaster's ship, in which he and Reina fled the planet, and took up the life as a swindler and gambler."}, {"tag": "p", "text": "Rollos was quite curious, having a special fascination for mechanical devices, which he would sometimes spend hours just staring at. He was especially fond of droids, which he considered cute toys, yet had problems conceiving that the people inside the stormtrooper armors were actually Humans."}, {"tag": "p", "text": "He was extremely loyal to Reina Gale, remaining at her side at all times to offer her protection."}, {"tag": "h3", "text": "Dealing with Begas Tok"}, {"tag": "p", "text": "In the years following the Battle of Endor, Reina Gale and Rollos went to Entralla in order to sell Zipthar hexa-crystals to Begas Tok. The deal was interrupted by the intervention of the Pentastar Patrol. In fact, that was Tok who denounced the smugglers to the police. He would like recover both the crystals and the credits. Tok wasn't worried by the police because he just got a permit to conduct trade in hexa-crystals. Reina Gale and Rollos were tracked in Nexus City but eventually managed to escape."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}