{"url": "Romba/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic members", "Category:Ewoks", "Category:Males"], "nodes": [{"tag": "h1", "text": "Romba"}, {"tag": "p", "text": "Romba was a male Ewok scout of Bright Tree Village on the forest moon of Endor. To defend his village from the Imperial invasion, Romba prepared traps and was one of the first Ewoks to engage the Empire's forces in battle. Romba and the other Ewoks' efforts not only saved Bright Tree Village but also helped the Rebel Alliance turn the tide of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "According to Ewok myth, the name \"Romba\" belonged to a hunter who fooled a gorax into eating its own feet. Likewise, this Ewok who bore his name was a dedicated scout. When fellow scout Wuta spotted Imperial invaders on Endor, he would look for fallen trees that could be used to make weapons to combat the offworlders. He contacted Romba, who oversaw the construction of log traps to use against Imperial walkers. But it was another kind of trap—this one for boarwolves—that captured three Rebel Alliance members and their two droids. When Romba and the other Ewoks in his hunting party approached the Rebels with their spears readied, they suddenly saw that one of them was C-3PO, and they began to worship the gilded protocol droid. Romba spoke with Rabin about the droid reverently, likely because of their experience with the droid some time ago at the failed Chirpa-Gorneesh peace summit. After the Ewoks took the droid and the Rebels back to Bright Tree Village, C-3PO and Wicket Warrick convinced the tribe to help the Alliance fight their mutual enemy, the Empire."}, {"tag": "p", "text": "The following day, Romba was among the first group of Ewoks to engage in a surprise attack against the Imperial stormtroopers. Later in the battle, he and other Ewoks strangled stormtroopers with the use of bolas. Romba then proceeded to aid in the launching of catapults against the Empire's AT-STs. When the walkers returned fire, Romba and the others fled. As he and Nanta ran, a laser blast hit and incapacitated the two. Romba quickly recovered, but when he reached for his friend to get up and continue running, Nanta didn't move. Kneeling over his body, Romba spared a moment to mourn his fallen comrade."}, {"tag": "p", "text": "As the battle raged on, the tide began to turn when the Rebel Chewbacca and two Ewoks, Widdle Warrick and Wunka, commandeered an AT-ST and used it against the Imperials. Romba—now attacking with bow and arrow—and his fellow warriors stopped and cheered on the battlefield when they witnessed the walker fighting for their side."}, {"tag": "p", "text": "After the second Death Star was destroyed and the battle ended in the Alliance's favor, the Ewoks and Rebels held a celebration at Bright Tree Village."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like the hunter whose name he bore, Romba was a dedicated Ewok scout. He was knowledgeable in the art of setting traps, overseeing the construction of log traps to fight the Imperial invaders. Romba was also capable of using many of the Ewoks' weapons—such as the bolas and the bow and arrow—being among the very first group of Ewoks to engage in a surprise attack against the Imperial stormtroopers. Romba mourned his comrade, when he was killed by a laser blast."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There are two different Ewoks with similar facial features who have been identified as Romba. The first is a brown-hooded Ewok who was made into an action figure by Kenner, one of \"the last seventeen.\" This particularly short Ewok, who has a brown hood that ties together at the neck, appears in a scene where he mourns for Nanta, who was killed. Romba was played by Debbie Lee Carrington. However, a Decipher Customizable Card Game card produced years later identified another unnamed Ewok, this one taller and with a pinkish hood, as Romba, while the original Romba was featured anonymously on another card. This misattribution was repeated in The Official Star Wars Fact File 90. But in 2007, Leland Chee corrected the situation by identifying Carrington's Ewok as Romba in time for her appearance at Celebration IV. The same year, a new action figure of Romba was produced by Hasbro, again with the proper likeness."}, {"tag": "p", "text": "The character coin packaged with Kenner's 1985 Romba action figure claims Romba is a warrior."}, {"tag": "p", "text": "Although some claim that Rabin and Romba's short dialogue exchange sounded like \"That guy's wise\" and \"More than I am short,\" Pablo Hidalgo assures that this is not the case, but rather fans \"picking up unintended patterns.\""}, {"tag": "p", "text": "The Ewok suit Debbie Carrington wore for Romba in Return of the Jedi is apparently the same suit she later wore as Weechee Warrick in Caravan of Courage: An Ewok Adventure."}, {"tag": "p", "text": "An image from The Making of Star Wars: Return of the Jedi seems to indicate that Mike Cottrell also played Romba at some point."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}