{"url": "Ronin:_A_Visions_Novel", "categories": ["Category:Real-world articles", "Category:Articles with spoilers", "Category:Future novels", "Category:Canon adult novels", "Category:Star Wars: Visions"], "nodes": [{"tag": "h1", "text": "Ronin: A Visions Novel"}, {"tag": "p", "text": "Ronin: A Visions Novel (Japanese:『浪人』) is an upcoming novel written by Emma Mieko Candon. It is inspired by the upcoming anime series Star Wars: Visions, and it will be published by Del Rey on October 12, 2021. It is to be based off of the Visions short film, The Duel. It focuses on the Jedi and Sith, but with an alternate history pulled from Japanese lore."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A mysterious former Sith wanders the galaxy in this stunning Star Wars tale. An original novel inspired by the world of The Duel from the Star Wars Visions [sic] animated anthology."}, {"tag": "p", "text": "The Jedi are the most loyal servants of the Empire."}, {"tag": "p", "text": "Two decades ago, Jedi clans clashed in service to feuding lords. Sickened by this endless cycle, a sect of Jedi rebelled, seeking to control their own destiny and claim power in service of no master. They called themselves Sith."}, {"tag": "p", "text": "The Sith rebellion failed, succumbing to infighting and betrayal, and the once rival lords unified to create an Empire… but even an Empire at peace is not free from violence."}, {"tag": "p", "text": "Far on the edge of the Outer Rim, one former Sith wanders, accompanied only by a faithful droid and the ghost of a less civilized age. He carries a lightsaber, but claims lineage to no Jedi clan, and pledges allegiance to no lord. Little is known about him, including his name, for he never speaks of his past, nor his regrets. His history is as guarded as the red blade of destruction he carries sheathed at his side."}, {"tag": "p", "text": "As the galaxy’s perpetual cycle of violence continues to interrupt his self-imposed exile, and he is forced to duel an enigmatic bandit claiming the title of Sith, it becomes clear that no amount of wandering will ever let him outpace the specters of his former life."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Ronin: A Visions Novel was first announced by Del Rey on March 22, 2021. Its cover and the short it was inspired by were revealed on July 8, 2021."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}