{"url": "Ronto/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Creatures of Tatooine", "Category:Creatures of unspecified diet", "Category:Desert creatures", "Category:Domesticated creatures", "Category:Herbivorous creatures", "Category:Herd and pack creatures", "Category:Mammals", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Ronto"}, {"tag": "p", "text": "Ronto were large, quadruped mammals that were commonly used as beasts of burden by the Jawas of Tatooine. They were known for their loyalty and strength, being able to carry hundreds of kilograms of weight. They were large enough to frighten off Tusken Raiders, though they were easily spooked by machines, such as speeder bikes. They were commonly used on Nubia and Benja-Rihn."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like the native dewbacks of Tatooine, ronto were easy to train and became quite fond of their masters, whose faces they associated with food. Rontos had superb senses of hearing and smell, although they had poor vision, which is why they were startled by sudden movements. Rontos needed large amounts of water, although their skins shed excess heat, allowing them to function well in desert conditions. They were rarely exported, though, because offworlders thought their skittishness made them unreliable in urban areas. Another reason the ronto was popular with the Jawas is that Jawas did not usually visit urban areas, so it was ideal for desert travel."}, {"tag": "p", "text": "When in heat, female rontos gave off a powerful, musky scent much like the smell of a Rodian. During mating season, Rodians on Tatooine were encouraged to stay away from male rontos, lest they inadvertently become the target of a ronto's affections."}, {"tag": "p", "text": "Rontos could hear sounds in the range of 32 kHz."}, {"tag": "h2", "text": "Related species"}, {"tag": "p", "text": "A species that appeared to be related to the ronto lived on the planet Kashyyyk. In contrast to their Tatooine cousins, they had a darker coloration, a more elongated cranium, and much smaller ears. They also appeared to be less easily spooked than their cousins and were in fact quite aggressive if they came under attack. While typically encountered in small groups, how they came to the planet is unknown."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}