{"url": "Roni_von_Wasaki", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles from unlicensed sources", "Category:Humans", "Category:Jedi Knights of the Jedi Order", "Category:Jedi Purge survivors", "Category:Males"], "nodes": [{"tag": "h1", "text": "Roni von Wasaki"}, {"tag": "p", "text": "Roni von Wasaki was a male Human Jedi Knight of the Expansionist Era who established and maintained the peace in several frontier sectors. His presence earned the ire of local crime lords, who retaliated by placing a large bounty on his head. Though Wasaki was able to fend off many would-be captors, he fell prey to the bounty hunters Leshy Drobo, Gammid, and XT-8. Wasaki was able to kill Gammid, but the other two apprehended him, encased him in carbonite, and prepared to deliver him to their client."}, {"tag": "p", "text": "However, Wasaki used the Force to enter Drobo's mind, and convinced the bounty hunter to set him free. XT-8 learned of that, and killed Drobo, but in the process destroyed the hyperdrive of their craft, the Starkiller. The thirty-day trip was elongated to 20,000 years, and Wasaki, preserved in carbonite, was slowly driven insane. Stumbled upon by a group of intrepid soldiers of the Alliance to Restore the Republic, Wasaki was freed in the Imperial Period, a desolate madman."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and Jedi Knighthood"}, {"tag": "p", "text": "The Human male Roni von Wasaki was born sometime prior to the year 20,000 BBY and was trained as a Jedi Knight during the Expansionist Era. He was dispatched to several frontier regions, where he established peace and order. Gaining the respect of the people, Wasaki's administration was widely accepted and embraced. However, his position earned him the ire of criminals and those seeking to tip the balance of justice."}, {"tag": "h3", "text": "Prisoner of Leshy Drobo"}, {"tag": "p", "text": "Displeased with Wasaki's crackdown on illicit activities in certain sectors, a crime boss put out a bounty of 100,000 credits on the itinerant Jedi, which prompted a slew of hunters to attempt to capture him. Many failed, but eventually, Leshy Drobo and his droid, XT-8, along with their partner Gammid succeeded. By letting Wasaki concentrate all his attention on affecting Drobo's mind, the immune XT-8 was able to stun the Jedi, though in the process, Gammid was felled. Confiscating Wasaki's lightsaber and shoto, Drobo froze him in carbonite and stored him in the hold of his ship, the Starkiller."}, {"tag": "p", "text": "Still attempting to resist capture in hibernation, Wasaki mentally reached out to Drobo, convincing the captain to free him and return his weapons. However, XT-8 learned of that and killed Drobo, as he had become a liability. In the process, XT-8 damaged the Starkiller's hyperdrive. The droid, unable to repair the ship, continued the trip on sublight drive, turning a thirty day jump into 20,000 years."}, {"tag": "p", "text": "Wasaki persisted in his frozen state, continually trying to reach anyone passing within close proximity of the ship. Though the carbonite preserved him, the elongated journey slowly drove him insane, leaving him with twenty millennia of lonely thoughts and dreams. His situation also left him permanently blind, leaving him with only the Force to rely on."}, {"tag": "h3", "text": "20,000 years later"}, {"tag": "p", "text": "During the Imperial era, a group of Rebel soldiers with a Force-sensitive amongst them discovered the Starkiller making its painstakingly long journey. They boarded the craft, and after encountering several dangers, including XT-8, found the frozen Wasaki. The Rebels were able to free the Jedi with a minimum of fuss, and began questioning him about his situation. Disoriented, the ancient Jedi struggled with the answers, offering little information, while probing the minds of the Rebels with the Force, due to force of habit."}, {"tag": "p", "text": "Wasaki persisted until the Rebels gave up and transferred him onto their ship. However, before long, the Jedi grew fearful, and asserted to the crew that the dark side of the Force had physically manifested itself on board the ship, and that he, Roni von Wasaki, was the embodiment of the light side. He also believed that someone was trying to penetrate his mind."}, {"tag": "p", "text": "Realizing that Wasaki was disturbed, the Rebels tried to help him, but the Jedi suddenly went rigid as if once again encased in carbonite. Impervious to pain, Wasaki began to use the Force aggressively against the Rebels with murderous intent. He then snapped back out of his immobile state and attacked the Rebels with his lightsabers. The Force-sensitive amongst the Rebels was able to subdue the Jedi and disarm him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Roni von Wasaki was considered a benevolent and fair keeper of the peace during his time in the frontier sectors, but it was these qualities that prompted criminals to target him. He preferred not to directly attack his opponents, instead relying on the Force to subdue them, a choice that eventually led to his capture. He had no qualms with entering and manipulating the minds of others, something that he did frequently."}, {"tag": "p", "text": "20,000 years of carbonite-induced hibernation slowly drove Wasaki insane. In his demented state, he was prone to violence without cause and displayed sudden bouts of fear and paranoia."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Wasaki was a practitioner of an unusual lightsaber technique, wielding both a standard sized saber and a smaller shoto. Wasaki chose that despite it being suited more to dueling rather than his typical law enforcement duties."}, {"tag": "p", "text": "He was proficient in the use of the mind trick, and he used it often. In his state of delirium, affecting minds would become second nature to him. After waking up into a completely new galaxy, he often fell into trances. He would also ignore pain and assert that it was his role to defeat the dark side once and for all. Wasaki was also particularly skilled in telekinesis and could use the Force to injure or outright kill his opponents; however, the group of Rebels were able to subdue him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Roni von Wasaki was created by Chris Hind in the 1992 gaming article \"Disturbance in the Force\", which was first published in the unlicensed magazine Challenge 66. He serves as a final antagonist for the player in the game. This is the only source in which von Wasaki appears, and as such, his canon status within the Star Wars Legends continuity is uncertain."}, {"tag": "p", "text": "\"Disturbance in the Force\" asserted that Roni von Wasaki wielded lightsabers circa 20,000 BBY, which later created a timeline conflict with the publication of the 2005 reference book The New Essential Chronology. The book did not take into account information presented in unlicensed sources such as \"Disturbance in the Force\" when detailing the history of lightsabers, and it instead established that first lightsabers were created around 15,500 BBY."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}