{"url": "Ronyards", "categories": ["Category:Legends articles", "Category:Abominors", "Category:Deities", "Category:Hydian Way", "Category:Inner Rim planets", "Category:Junk planets"], "nodes": [{"tag": "h1", "text": "Ronyards"}, {"tag": "p", "text": "Ronyards, also known as the Body of the Living God by its droid inhabitants, was a junkyard planet located in the Ronyards system of the galaxy's Inner Rim."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in the Ronyards system of the galaxy's Inner Rim, Ronyards was a junkward planet covered in twisted spires of scrap and vast corroded canyons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet had a long history of use as a droid junkyard, and by Imperial times, droid husks lay up to 5 miles deep in places. The still-functioning droids of Ronyards developed a religion around the planet, which they considered to be the Living Body of God."}, {"tag": "p", "text": "During the Clone Wars, Ronyards was designated a war refuse world. After the conflict, buzz droids were used in the planet's vast scrapyards to strip rusted hulks for usable parts."}, {"tag": "p", "text": "After investigating the inert body of the Great Heep, some researchers speculated that Ronyards was not a planet, but a giant specimen of Abominor."}, {"tag": "p", "text": "During the Galactic Civil War, concurrent to the Alliance to Restore the Republic's siege of its western flank, the Galactic Empire undertook an expedition to strip Ronyards of its valuable metal deposits. A squad of Imperial stormtroopers was deployed from an Imperial-class Star Destroyer to the planet's surface to scout for potential mining sites. However, they were greeted by Brother Fivelines, who told them that Ronyards wished them no harm and that they could leave in peace. However, the unit's flight marshal ordered the \"brain damaged\" droid destroyed. Ronyards itself killed the squad in retribution, and the Star Destroyer was lost with all hands."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}