{"url": "Ronto_Wrap", "categories": ["Category:Canon articles", "Category:Wookieepedia Good article nominations", "Category:Batuuan food", "Category:Food in Black Spire Outpost", "Category:Sandwiches", "Category:The Official Black Spire Outpost Cookbook recipes"], "nodes": [{"tag": "h1", "text": "Ronto Wrap"}, {"tag": "p", "text": "The Ronto Wrap was a sandwich made from ronto meat served in a flat piece of bread called a ronto wrapper and topped with slaw and Clutch Sauce. They were available at podracing fanatic Bakkar's Ronto Roasters in Black Spire Outpost on the planet Batuu and were cooked by the pitmaster droid 8D-J8. The mechanic Salju and Resistance spy Vi Moradi both ordered Ronto Wraps while the former gave the latter a tour of the outpost. 8D-J8 once offered a Ronto Wrap to the Clawdite Remex Io, who turned it down."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Ronto Wrap was the best-selling sandwich available at Ronto Roasters, a restaurant owned by the podracing fanatic Bakkar, in Black Spire Outpost on the Outer Rim planet Batuu. It contained two tender cuts of ronto meat that had the tough skin removed, and the meat was then cooked by the pitmaster droid 8D-J8 on a grill heated by a podracer engine. The two cuts, a link along with chopped meat underneath, were topped with slaw and Clutch Sauce, Bakkar's signature smoky and spicy sauce, and the filling was served in a flatbread called a ronto wrapper. Bakkar also included a special spice blend that was a family secret. There was also a breakfast version of the dish called the Ronto Morning Wrap and a vegetarian meat-free Ronto-less Garden Wrap. All three versions were safe for humans to consume."}, {"tag": "p", "text": "Strono Tuggs, the chef at the neighboring Tuggs' Grub mobile eatery parked in Docking Bay 7 Food and Cargo, also had a version of the Ronto Wrap. The Artiodac willingly admitted that his version was not as good as Bakkar's, but he claimed that the difference was hardly noticeable if the wrap was smothered in enough Emulsauce."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 34 ABY, during the war between the First Order and the Resistance, the local mechanic Salju took the Resistance spy Vi Moradi on a tour of Black Spire Outpost, during which they stopped at Ronto Roasters and each ordered a Ronto Wrap. After the arrival of the First Order on Batuu, 8D-J8 offered a Ronto Wrap to the Clawdite Remex Io. Despite the droid claiming they were both juicy and the best in the quadrant, the criminal was unimpressed and declined the offer."}, {"tag": "p", "text": "Sometime after the Battle of Takodana in 34 ABY,, Tuggs included his personal recipe for the Ronto Wrap in his cookbook The Official Black Spire Outpost Cookbook. During the occupation of Batuu by the First Order, the adventurer Eloc Throno mentioned the Ronto Wrap in his book Traveler's Guide to Batuu."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ronto Wrap was announced on February 27, 2019 as part of a large press release on upcoming dining offerings for the Star Wars: Galaxy's Edge theme park land. Its first appearance was in the first issue of the Marvel Comics miniseries Star Wars: Galaxy's Edge, which was written by Ethan Sacks, pencilled by Will Sliney, and published on April 24 of that year. The dish debuted in the real-world Ronto Roasters restaurant at Disneyland Park when it opened on May 31. The official menu description for the Ronto Wrap is as follows: \"Roasted Pork, Grilled Pork Sausage, Peppercorn Sauce, tangy Slaw, wrapped in Pita.\""}, {"tag": "p", "text": "The out-of-universe recipe for the dish was released in the 2019 cookbook Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook, written by Chelsea Monroe-Cassel and Marc Sumerak. The recipe calls for vegetable oil, yellow onion, ground pork, chorizo sausage with casings removed, brown sugar, tomato purée, salt, pepper, guacamole, and ronto wrappers, which the book includes a separate recipe for."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}