{"url": "Rooty", "categories": ["Category:Legends articles", "Category:Cragmoloids", "Category:Gamblers", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Rooty"}, {"tag": "p", "text": "Rooty was a Cragmoloid gambler that frequented the casinos on Nar Shaddaa. He was also a moderately successful smuggler, traveling onboard the CRX-Tug Solar Grazer. Rooty's love of drinking and gambling always kept him almost one credit away from bankruptcy, even if he once earned a fortune defeating Lando Calrissian at sabacc. However, the Cragmoloid tended to spend his money hedonistically, trying to leave behind the disgrace of having abandoned his people in their moment of need."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Rooty was a Cragmoloid male born in the Cragmoloid homeworld, Ankus. During his lifetime, Cragmoloids in Ankus were harassed by the Galactic Empire, TaggeCo and hunters, with the sentient species approaching extinction. Only a few Cragmoloids, including Rooty, managed to escape Ankus to the relative safety of other planets. Like them, Rooty sawed off his natural tusks to avoid greedy hunters."}, {"tag": "p", "text": "In 11 BBY, Rooty reached Nar Shaddaa, where he settled. Rooty, an avid client to casinos, became a successful gambler and sporadic smuggler — particularly from the point he obtained his own starship, the CRX-Tug Solar Grazer. Rooty spent most of his time on Nar Shaddaa, mingling with scoundrels such as Lando Calrissian, Han Solo and Salla Zend. He seldom piloted his ship for a short smuggling run on Hutt Space."}, {"tag": "p", "text": "In 1 BBY, Rooty played sabacc with Calrissian and several others. Confident in his hand, Calrissian raised his bet to some 20,000 credits, even if he did not have so much money at the time. Rooty defeated Calrissian with an Idiot's Array and then was aghast when Calrissian offered alternative payments. Suddenly enraged at Calrissian, Rooty threatened the Socorran with physical violence, including blaster fire. Joined by the other gamblers, Rooty chased Calrissian through the casino, eventually catching him in a cul-de-sac stair. Rooty snarled death threats to Calrissian, but he was suddenly placated by Bib Fortuna who, having need of Calrissian's services, offered to clear his debt to Rooty. The Cragmoloid accepted the money, but he still felt antipathy towards Calrissian from that point on."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like many Cragmoloids, Rooty was a huge pachydermoid with a big trunk, flap-like ears and natural tusks, although Rooty in particular had sawed off his. Quiet, strong, burly, and ill-mannered, he tended to ram brutally whenever someone angered him. He tended to lose his temper whenever faced with trickery. Rooty was ill-mannered and hid his own age. He also used to gamble and drink, looking for temporary pleasure and spending all of his money, in a vain attempt to forget the shame of turning his back to the plights of his species."}, {"tag": "p", "text": "Rooty, who spoke both Cragii and Galactic Basic Standard, was a good gambler and had some skill as a pilot and smuggler. He piloted the CRX-Tug Solar Grazer, which had been customized with a short-range hyperdrive to perform smuggling runs. However, Rooty neglected the maintenance of his ship, leading to it almost falling to pieces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rooty first appeared in the first issue of the Underworld: The Yavin Vassilika series of comics, written by Mike Kennedy and drawn by Carlos Meglia. His background was expanded in the roleplaying article Unusual Suspects, published in Star Wars Gamer 6, and adapting Rooty to be used in Wizards of the Coast's Star Wars Roleplaying Game. Rooty's name was mentioned among the list of Cragmoloid names in Ultimate Alien Anthology."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}