{"url": "Roper_Slam", "categories": ["Category:Legends articles", "Category:Con artists", "Category:Criminals", "Category:Humanoids", "Category:Individuals of unidentified species", "Category:Males", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Roper Slam"}, {"tag": "p", "text": "Roper Slam, a native of the Core world of Mamendin, was a young Humanoid male con man, and founder of the Slam gang, a notorious gang of expert thieves made particularly infamous by its heist of the Vuma treasury. He owned a Ubrikkian star yacht."}, {"tag": "p", "text": "In 24 BBY, in an attempt to apprehend Jenna Zan Arbor, Obi-Wan Kenobi took on the identity of Slam while serving undercover on the planet Romin. By awkward chance, Kenobi—while at an extravagant reception for the world's wealthy, hosted by its corrupt tyrant-ruler, \"Great Leader Teda\"—met Slam, sharing with him over idle chat a glass of the favorite Romin beverage, quint-berry juice. Kenobi described Slam as having \"a tired, handsome face.\""}, {"tag": "p", "text": "Having escaped yet again from prison—the Greylands Security Complex on Tentator—the Slams had fled for refuge to Romin, where Teda harbored galactic criminals in exchange for hefty \"contributions\" to the tyrant's \"charities.\" Because the Slams had been imprisoned at the time the mission to Romin began, the Jedi had actually confiscated Roper Slam's star yacht from the Greylands Confiscation Station. But due to a revolt of the people under the leadership of Joylin and his Citizens' Resistance, the Slams were reunited with their beloved ship. Joylin had allowed Teda to escape with Zan Arbor, who sent out a petition that both Slam gangs answered—both the impostors and the real criminals—to give her and Teda transport offworld and join them in a highly profitable heist on Coruscant that they had masterminded with Granta Omega."}, {"tag": "p", "text": "When the Jedi were caught impersonating the criminals, Zan Arbor ordered Teda's army officers to haul them off to prison while she made her preparations with the real Slams. Joylin had already fueled and made ready for departure the Slams' yacht on the morning after the people's revolt, and it was the only transport the Resistance was permitting to leave the planet. As such, the Slams were Zan Arbor and Teda's only choice of escape. The Slams were successful in navigating their ship out of Romin airspace and stealing for the planet of Falleen in the Mid Rim, there to continue their plans with Omega against the galactic capital and its Senate Building. In that attempted Bank of the Core Plaza heist and Senate murder operation (in which Supreme Chancellor Palpatine and hundreds of Senators were targeted), Roper Slam and his female cohort Valadon were captured again and returned to prison."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}