{"url": "Rosh_Penin", "categories": ["Category:Legends articles", "Category:Cyborgs", "Category:Dark Jedi", "Category:Disciples of Ragnos members", "Category:Humans", "Category:Jedi trainees of the New Jedi Order", "Category:Males", "Category:New Republic individuals", "Category:Redeemed Jedi", "Category:Sith acolytes and apprentices"], "nodes": [{"tag": "h1", "text": "Rosh Penin"}, {"tag": "p", "text": "Rosh Penin was a Human male Jedi student at the Jedi Praxeum located on Yavin 4, after the fall of the Galactic Empire, where he was trained in the ways of the Force by Jedi Master Kyle Katarn."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi apprentice"}, {"tag": "p", "text": "In 14 ABY, Penin, along with other Jedi students, was heading to the Jedi Praxeum on Yavin 4 onboard a shuttle. In the ship, he met Jaden Korr, and the two eventually developed a friendship. Their shuttle was soon attacked by the Disciples of Ragnos and forced to crash-land, though the attack later proved to be merely a diversion so that the cultists could access Luke Skywalker's personal records in the Massassi temple."}, {"tag": "p", "text": "After recovering from the shuttle crash, Penin and Korr teamed up in order to reach the temple. They fought hostile howlers in the rainforest: Penin was shooting with a blaster pistol while Korr was using his lightsaber. After witnessing stormtroopers patrolling the perimeter of the Temple, Korr went on ahead alone and quickly dispatched them, along with a Sith Cultist but was then knocked unconscious with the Scepter of Ragnos by Tavion Axmis. Penin then went for help and brought Luke Skywalker and Kyle Katarn back with him, but the Disciples of Ragnos' forces were already gone."}, {"tag": "p", "text": "Penin and Korr soon were both assigned Katarn as their Master and began Jedi training. During their very first training exercise, Rosh set a lightsaber training droid to attack Jaden in order to distract him and finish the training course first. His plan succeeded and Jaden fell behind, but, at end of the course, Katarn chastised Penin, saying the droid would have killed Korr had it been set to Luke's training regimen. Penin apologized to his fellow student, an apology which Korr accepted."}, {"tag": "h3", "text": "Fall to the Dark Side"}, {"tag": "p", "text": "Penin often felt that Katarn was holding him back, and as a result grew arrogant and impatient. Eventually, Penin was assigned to investigate Byss, where he was captured by the Disciples of Ragnos. At first, he was afraid he would be killed, but instead of killing him, they took advantage of his fear to convert him to the dark side. Penin's naiveté and lust for power made it easy for the Cult to turn him, and he became an apprentice to Axmis, leader of the Disciples of Ragnos."}, {"tag": "p", "text": "On Vjun, Penin, Axmis, and the Kothos twins led the Cult's operations in Bast Castle in order to siphon the Force energies that were stored there. Katarn and Korr arrived on Vjun, intent on stopping the cultists, but were separated. Korr later located and confronted Penin in Vader's throne room, where Penin, with the aid of the twins, dueled Korr."}, {"tag": "p", "text": "Penin and Korr were evenly matched until Korr managed to kill the twins. He soon after disarmed Penin just as Katarn arrived. Before they were able to apprehend Penin, Axmis intervened. She disabled Katarn and Korr with Force lightning, and afterward revealed that she had taken Penin as her new apprentice. Axmis ripped Korr's lightsaber from him with the Force, threw it at the ceiling and brought the weakened structure down on the Jedi with the Scepter of Ragnos. She then used the ensuing chaos to escape with Penin in tow. Katarn used the Force to prevent the ceiling from crashing down on top of them while Korr used Katarn's lightsaber to create an exit."}, {"tag": "h3", "text": "Redemption on Taspir III"}, {"tag": "p", "text": "Some time later, Penin repented and tried to turn away from the dark side while on Taspir III with Alora, Tavion's other apprentice. He sent a distress signal to the Jedi Praxeum. Katarn and Korr arrived on Taspir III and began searching for Penin."}, {"tag": "p", "text": "Korr eventually located Penin, who begged for forgiveness for attacking Korr on Vjun, and admitted that his fear was what made him fall to the dark side. As Penin did not appear to need any obvious assistance, Korr's anger at Penin revealed itself once again, and he came close to striking down his friend. Katarn communicated with Korr through the Force and pleaded with Korr to deactivate his lightsaber."}, {"tag": "p", "text": "Korr relented, though Alora, who had been watching from a distance, then attacked the pair. As one of her opening attacks, Alora severed Penin's entire left arm due to his disloyalty, after which Korr struck her down in battle. Katarn arrived soon after, which proved to be timely as Penin went into shock, and his Master rushed him back to the Praxeum for treatment."}, {"tag": "p", "text": "While there, Penin tested his new prosthetic left arm which looked identical to his original severed arm, and was greeted by Luke Skywalker, who expressed hope that Penin's experience with the dark side had taught him the patience and humility that one day would turn him into a great Jedi. Penin gratefully accepted the Jedi Master's words of encouragement."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Prior to joining the Jedi Praxeum, Rosh Penin was enthusiastic about becoming a Jedi, but grew arrogant and impatient during his training under Kyle Katarn. He came to believe that Katarn was holding him back from reaching his full potential and did not appreciate his talents."}, {"tag": "p", "text": "For a time, Penin saw his friend Jaden Korr as a rival and would try to best him during their lessons. He turned to the dark side out of fear for his life when confronted by the Disciples of Ragnos, and embraced the power of the dark side, but eventually realized his mistake and returned to the light. He was accepted back into the Academy and heeded Luke Skywalker's advice about patience and humility."}, {"tag": "p", "text": "Rosh, while primarily good natured, was flawed in how overconfident he was in his abilities and proved to be something of a coward as he was easily swayed to join with a cult for fear of being hurt."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Padawan, Penin was a capable lightsaber duelist and mastered the majority of his core abilities, including Force protection, Force absorb, Force drain and Force rage. He was also efficient at using Force lightning and Force grip, and utilized both these Force powers against Jaden Korr during their confrontation on Vjun after Penin's fall to the dark side."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Penin possessed a yellow-bladed lightsaber as a Jedi. When he turned to the dark side, he used a red-bladed lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rosh Penin was voiced by Jason Marsden in Star Wars: Jedi Knight: Jedi Academy. At the beginning of the game, Rosh wields a yellow-bladed training lightsaber; after he turned to the dark side, he was given a red-bladed lightsaber by Tavion Axmis. Examining the game's external source files, it's notable that Rosh obtains a shadowtrooper's lightsaber, rather than that of a New Reborn. This, however, does not change anything in terms of his lightsaber's appearance, as both of the mentioned sabers use the same hilt design."}, {"tag": "p", "text": "When fighting Rosh in Darth Vader's stronghold it's impossible to kill him, as the two reborn that accompany him will restore him once his health drops low enough. Despite this it's possible to cut off his hand in combat, if this is done Rosh will continue to attack as he did before as his A.I. doesn't realize that his lightsaber is no longer there."}, {"tag": "h3", "text": "Alternate ending"}, {"tag": "p", "text": "The following is from the non-canonical ending of the game.\nAfter Jaden found Rosh on Taspir III, Jaden gave into his hatred and anger, and decided to kill Rosh. Rosh begged Jaden to let go of his anger before he attacks him. Jaden ignored his request and plunged a lightsaber through his torso, mortally wounding him. Jaden then killed Alora and fled to Korriban. Kyle arrived just as Rosh was dying and told him that in turning back to the light, he became a full Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}