{"url": "Rori/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic moons", "Category:Moons of Naboo", "Category:Rori locations", "Category:Spice producing worlds", "Category:Swamp moons", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Rori"}, {"tag": "p", "text": "Rori was the second largest of three moons of the planet Naboo. Located in the Chommell sector of the Mid Rim, Rori was an overgrown, wild world dominated by oppressive gray skies, thick jungles, and thick swamps. The forests and other vegetation were said to be more twisted and knotted than Naboo's plantlife. Rori's early history was shrouded in mystery, but the moon was officially colonized during the days of the Galactic Republic under the rule of King Narmlé, following the construction of his namesake city. During later years, a second city named Restuss was constructed to act as a quarantined processing center after an outbreak of Brainworm Rot. Under Queen Kylantha's rule, following the rise of the Galactic Empire, Rori saw only limited involvement in the Galactic Civil War between the Empire and the Alliance to Restore the Republic. That all changed however, when by at least 1 ABY, the Battle of Restuss erupted, resulting in the complete devastation of one of Rori's only cities."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early colonization"}, {"tag": "p", "text": "Millennia before a group of Humans from the Core World of Grizmallt colonized Naboo around 3900 BBY, a mysterious species of aliens known as the \"Elders\" established a presence on the world. As proof of their visitations, the Elders left behind large stone colossi on both Naboo and Rori. Otherwise, Rori's early history was somewhat contested by Naboo scholars. Some claimed that a small contingent of Naboo's original Human colonists actually landed on Rori before traveling on to the more temperate parent planet. If this was true, those early settlers left no obvious signs of their stay. Others held that Rori remained unsettled until a small group of spice miners decided to relocate to the moon in search of fabled spice lodes. Some spice miners did, in fact, inhabit Rori, but they lived a primitive lifestyle and had no records of their first landing on the moon. Others heard that the Gungans were the first to build a settlement there. Whatever the truth, Rori was officially colonized about two thousand years before the Battle of Naboo around 2032 BBY, during the short-lived reign of King Narmlé. Although widely regarded as a charming and intelligent man, Narmlé was a restless explorer who spent most of his time visiting distant worlds in search of new vistas. The Naboo Royal Advisory Council soon suggested that Narmlé relinquish the throne and become an ambassador. Before leaving office as King, however, Narmlé personally planned the construction of a small settlement on Rori named Narmle. He envisioned that Rori would one day become an active agricultural hub, supplying food and medicines to other neighboring planets. Unfortunately for him, Rori attracted few settlers. Frustrated, Narmlé left Rori and vanished into the Outer Rim Territories forever, although the city he helped build still bore his name."}, {"tag": "h3", "text": "Decline of the Republic"}, {"tag": "p", "text": "In the centuries since Narmlé's disappearance, Rori's population had grown only slightly. During an outbreak of Brainworm Rot some two hundred years before the Battle of Naboo, around 232 BBY, the Advisory Council commissioned the construction of a second spaceport on Rori; this city, known as Restuss, was used for decades as a quarantined processing center for colonists traveling to Naboo. Medical research conducted in Narmle eventually helped cure the plague, and Republic officials rewarded the city for its efforts by funding the construction of a Center for Arts and Education. Although both Restuss and Narmle were built by Naboo architects, most of the colonists during that time had been drawn from other, less hospitable worlds, including Iridonia and Ryloth. The Gungans, who colonized the Naboo moon of Ohma-D'un, had also established small outposts on Rori. One particular group of Gungans relocated to Rori shortly after the peace brokered between Boss Rugor Nass and Queen Padmé Amidala as a result of the Battle of Naboo in 32 BBY. These Rorian Gungans, who eventually operated out of a town known as the Gungan Swamp Town, were violently opposed to any alliance between Humans and Gungans. Living in relative isolation, the Rorgungans had become territorial, paranoid, and increasingly violent to outsiders. In 22 BBY, the Jedi Master Mace Windu suspected that disgruntled spice miners on the moons of Naboo were responsible for the plot to assassinate Padmé Amidala."}, {"tag": "h3", "text": "Rise of the Empire"}, {"tag": "p", "text": "The Royal House of Naboo had typically viewed Rori as an extension of their domain. As a result, Rori received regular supplies from Naboo and travel between the moon and its parent planet was routine. Members of the Royal Naboo Security Forces were stationed in both Restuss and Narmle, and Rori's governor sat on the Naboo Royal Advisory Council. During the rise of the New Order, Kylantha succeeded Queen Apailana to the throne of Naboo in 18 BBY, after the latter was executed by the Galactic Empire for treason. Under their domain, the Empire viewed Rori as little more than a small Naboo outpost and expected all of the moon's inhabitants to remain loyal to Emperor Palpatine. In reality, Rori's denizens were far more independent than the \"planetary\" Naboo and it was believed that the moon harbored some members of the Alliance to Restore the Republic. Rori went largely unnoticed by most of the galaxy as the Galactic Civil War intensified between the Galactic Empire and the Rebellion. Governor Ferrox was charged with ruling the entire population of the moon, and had his home and offices in the capital of Narmle. Narmle maintained a friendly rivalry with its sister city, Restuss. As the only cities on Rori, Narmle and Restuss typically competed for funds, visitors, and settlers from Naboo. Narmle's inhabitants often exhibited a sense of superiority, stemming from the fact that Narmle natives actually built Restuss. The rivalry had become heated on occasion, although it had only rarely erupted into violence."}, {"tag": "h3", "text": "Seeds of Rebellion"}, {"tag": "p", "text": "By the time following the Battle of Yavin in 0 BBY, the Rebel Alliance had established an outpost on Rori called Zephyr Base. The Rebels liaised with the Gungans, particularly Booto Lubble, in planning operations against Imperial activity on Naboo. Besides Lubble, other Rebels operating from the base included Raxa Binn, Vordin Sildor, and Mon Calamari General Ufwol, commanding officer for the Crimson Phoenix Squadron. After being forced to evacuate their military base on Tatooine, Rebel forces relocated to Rori to establish yet another base northwest of Lake Octir. The Rebellion even contested the Empire's control of the Hyperdrive Research Facility elsewhere on Rori. Unfortunately for the Empire, the Rebels were not the only ones to oppose their rule on the moon. Ex-vigos of Alexi Garyn managed, through luck and coincidence, to avoid Darth Maul's destruction of the Black Sun crime syndicate's leadership. They remained fiercely loyal to their leader, who was drowned by Darth Maul in 33 BBY. After Alexi's death, his loyal followers had since banded together on Rori to harass Imperial troops. Known as the Garyn Raiders, the resistance organization operated out of a bunker and a small base on the swamp moon. Remnants of the Cobral family, known as the Neo-Cobral, also fled to Rori. Although they had lost much of their power and authority, rumor had it that a group of Cobral thieves had stolen some important documents from the Empire, and kept the information at their hideout. Led by the Cobral Overlord, the organization was bent on dominating the entire moon."}, {"tag": "p", "text": "In spite of this growing resistance, the Empire commanded a modest presence on the world, particularly in a large Imperial Encampment south of Narmle defended by All Terrain Scout Transports and many stormtroopers and Imperial officers. Specialized stormtrooper snipers and dark troopers were also posted to this encampment. In Narmle, an Imperial major attempted to trick members of the Rebellion to visit this base, under the pretense of peace negotiations. In fact, he had ordered the stormtroopers to shoot and kill any unauthorized visitors. Elsewhere on Rori, an Imperial officer named M'Kae staffed yet another base in a hilly region of Rori, alongside General Brant Korra. An Imperial Surface Marshal and Imperial Army troopers were also posted to at least one other small Rorian outpost. During 1 ABY, a Human xenobiologist of the Imperial Corps of Bioengineers named Dusque Mistflier, and her fellow Ithorian scientist Tendau Nandon, visited the Aerie Casino on Naboo. During their stay, they overheard a Zabrak creature handler nicknamed \"Fingers\" debate with her friend about the specifics of Rori's early history and indigenous life. Intrigued by what she overheard, Dusque implored Tendau to join her on an exploratory mission to Rori to study the world's fauna. Tendau reluctantly agreed to travel with Dusque, despite lacking the proper Imperial endorsements. During their time on Rori, the pair of xenobiologists stayed in Narmle, and took the time to explore an expansive cave inhabited by borgle bats."}, {"tag": "h3", "text": "The Battle of Restuss"}, {"tag": "p", "text": "Perhaps, or rather because of its history, or the fact that Governor Ferrox rarely visited, Restuss seemed even further removed from Naboo politics than its sister city. It was not uncommon to meet a Restuss citizen who had difficulty identifying the current Queen. Restuss seemed even less interested in galactic dealings. The populace rarely discussed the raging civil war, but when they did, it was as if the conflict was taking place in some far distant corner of the galaxy. All that would change however, when by at least 1 ABY, the Galactic Empire started using a secret research facility in the city of Restuss to develop an energy cell capable of powering a Death Star scale installation. This power supply, known as the Star Core, was devised by Emperor Palpatine and was designed to be small enough to fit in the palm of a hand. The Rebellion, eager to claim the Star Core for themselves, established a base north of Restuss in preparation for a major assault on the city. The Empire responded by evacuating the city of its civilian population, and building up a base of their own south of the city. In preparation for a large battle, both the Empire and Rebellion oversaw missions to other parts of the galaxy, eliminating ground forces, fighting for control in various star systems, and mining for resources from asteroids in the Kessel system and deep space. After much preparation, both sides finally engaged in a full scale battle in the streets and skies over Restuss. During the climactic battle, the Star Core unexpectedly detonated, resulting in mass devastation to the city. Because the Star Core was only in the development stage, it did not reach its full destructive capacity. Otherwise, the blast would have potentially been powerful enough to destroy half the moon of Rori. With Restuss in ruins, the battle continued, but neither side achieved a clear and decisive victory. After the Star Core was destroyed, both sides struggled to maintain control over the ruins so that they could salvage the remains of the Imperial research project. The battle resulted in increased hostilities between Imperial and Rebel forces in other parts of the galaxy, including Naboo, Corellia, and Talus, until at least 3 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Episode I The Phantom Menace, one moon can be seen in the skies of Naboo during at least a couple distant surface shots. However, Ohma-D'un is the only moon that appears clearly in any closeup shots, as later confirmed by its entry in the The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "Rori was first mentioned, albeit indirectly, in the 2001 paperback supplement to the Wizards of the Coast Star Wars Roleplaying Game, Secrets of Naboo. Although it is not identified as Rori, the book confirms that Naboo had three moons. In the HoloNet News Vol. 531 53 regional article titled Naboo Miners Clog Ports in Protests, the Naboo Moon Mining Union is credited with transforming \"one of Naboo's smaller moons into a very lucrative kassoti-spice mining operation.\" As The Complete Star Wars Encyclopedia identifies Ohma-Dun as Naboo's largest moon, this seemingly implies the possibility that Rori may be one of the two smaller moons involved. However, the The Complete Star Wars Encyclopedia dispels this notion by further specifying that the Mining Union transformed the smallest moon of Naboo, which would have been the third moon of Naboo, which Nexus of Power identified as the tiniest of the three moons. Nevertheless, the HoloNet News article's usage of the plural \"smaller moons\" still constitutes an indirect mention of Rori. Rori receives a similar indirect mention in Star Wars: Episode II Attack of the Clones, when the Jedi Mace Windu remarks, \"Our intelligence points to disgruntled spice miners on the moons of Naboo.\""}, {"tag": "p", "text": "Rori was one of the ten original worlds included in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Although the Star Wars Legends continuity already established that Naboo had three moons, the Star Wars Galaxies team was responsible for naming and defining Rori. Including the moon allowed the team to reuse many of Naboo's creatures in another location, although the world artists did take great pains to distinguish Rori's terrain by incorporating mud flats and bogs. In the game, Rori had the shortest rotation period of only 30 minutes. However, this was purely game mechanics. For example, the game set the rotation periods of Tatooine, Naboo and Corellia at 3 hours, despite actually being 23, 26 and 25 hours respectively."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}