{"url": "Rostek_Horn", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Corellian Security Force officers", "Category:Corellians", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Rostek Horn"}, {"tag": "p", "text": "Rostek Horn was a Human male who was the step-grandfather of Corran Horn. Although Corran grew up thinking Rostek was his biological grandfather, he found out as an adult that Rostek was a friend of his real grandfather, Nejaa Halcyon. The two became partners in 32 BBY, and last saw each other when Nejaa was called away in 22 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Clone Wars, Rostek fought in several minor battles near Corellia, alongside Jedi. Nejaa died near the end of the war. Nejaa's widow Scerra married Rostek, and he adopted her son, Valin, who later became the father of Corran. He had a long and respected tenure in the Corellian Security Force, reaching the rank of Director before retiring. He was also a renowned horticulturist who was famous for his flower hybrids."}, {"tag": "p", "text": "Rostek Horn was reportedly a Rebel and Jedi sympathizer during the Great Jedi Purge and the Galactic Civil War. He used his experience in CorSec to assist them in hiding from the Empire. He would store the locations of where he helped them hide in the genetic codes of his flowers-on one occasion he gave one of the Empire's Jedi hunters some such flowers as stock for his garden on Coruscant. Rostek also frequented the Raging Ronto, a popular cantina on Corellia. The owner of the Raging Ronto was reputedly a good friend of Rostek, and himself was an infamous Rebel sympathizer. It was rumored that when the owner of this establishment went into hiding from the Empire in 2 ABY, Rostek assisted him and his family in disappearing."}, {"tag": "p", "text": "Tosruk worked for him in 11 ABY."}, {"tag": "p", "text": "Rostek was still alive as of 25 ABY, when he kept up a correspondence with Ithorian biologists due to his occupation in horticulture. In 27 ABY, he arranged for Tahiri Veila to give a \"know-your-enemy\" briefing on the Yuuzhan Vong to CorSec personnel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}