{"url": "Rothe_Gate", "categories": ["Category:Legends articles", "Category:Cularin system asteroid belt", "Category:Rothe Gate locations"], "nodes": [{"tag": "h1", "text": "Rothe Gate"}, {"tag": "p", "text": "Rothe Gate was an asteroid in the outer rim of the Cularin system asteroid belt, and the most important weapon storage facility of the criminal Organization of the system. In 32 BBY, it was under the control of crimelord Nirama, who occasionally visited it in a surprise Central Administrative Review of mandatory assistance."}, {"tag": "p", "text": "Rothe Gate was crewed by hundreds of sentients, who commonly seemed to be very busy in alternate shifts. When sleeping, the crew used \"cubes\" of a few square meters of living space, with a bed and a security safe, plus security measures in the door. Each box had the name of its current inhabitant in the door, in Basic and then in that sentient's native language."}, {"tag": "p", "text": "In Rothe Gate, Trandoshans were considered underachievers, such as Gorssk. This was not of the liking of Nala Noos, Trandoshan manager of The Office of Personnel for Rothe Gate."}, {"tag": "p", "text": "In 32 BBY, The Cell, a faction of the Organization wanting to oust Nirama apparently under the control of his lieutenant Ari Melast prepared a scheme to weaken Nirama by falsely involving some of Nirama's most trusted employees in Rothe Gate (namely inventory supervisors Cyria Dombasle and Maarten Haal, operations manager Plu Markeela and security specialist Gal O'Wei) with The Cell. To do, The Cell created false proofs and tricked two of Nirama's agents, master of properties Jobril and protocol droid N3-A2, to hire and guide some independent agents who had worked for Nirama."}, {"tag": "p", "text": "A surprise visit by Nirama made The Cell change their plan: They would try to assassinate Nirama there and then. To create a distraction, they sent N3-A2 loaded with explosives to kill the independent agents, as all of them knew too much; however, this plan failed and the agents met with Nirama and his right-hand man, Len Markus. Members of the Cell attacked Nirama during this meeting, but Nirama survived with the help of his companions. Nirama then discovered Melast's implication, and charged Markus with finding her."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}