{"url": "Rotar_Lopani", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Rotar Lopani"}, {"tag": "p", "text": "Rotar Lopani was a male criminal active during the waning years of the Galactic Republic. In 22 BBY, the representatives of the Circarpous sector placed a bounty of 8,000 credits on his head. During that year, the Xexto bounty hunter Tosinqas found Lopani on the planet Brentaal IV and killed him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Rotar Lopani was a male individual who lived during the last years of the Galactic Republic. A thief and criminal with ties to the Bando Gora death cult, Lopani had a bounty of 8,000 credits placed on his head by the representatives of the Circarpous sector in 22 BBY. The Circarpous representatives also asked the Jedi Order for help in capturing Lopani alive. The Order reacted by dispatching Jedi Knight Reeft, who found the disguised Lopani in a crowded market on the planet Brentaal IV."}, {"tag": "p", "text": "The Jedi closely followed Lopani, but the Xexto bounty hunter Tosinqas—who had also taken up the bounty placed on the criminal—appeared on the scene and crashed down on Lopani from several stories above, killing him. Tosinqas then charged Reeft but was bisected by the Jedi's lightsaber. Reeft then brought the bodies of both Lopani and Tosinqas to the Republic's capital planet, Coruscant. The incident led to some controversy between the Republic, the Jedi Order, and the Bounty Hunters' Guild, the latter of which claimed that it would need better communication with the Jedi to determine clearer jurisdiction."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lopani was a criminal with ties to the Bando Gora, a violent and dangerous death cult. He was important enough for the representatives of the Circarpous sector to put a bounty of 8,000 credits on his head, as well as to alert the Jedi Order. While being wanted, Lopani chose to disguise himself, though the ruse would not help, as Reeft and Tosinqas were able to find him. Lopani was taken by surprise by Tosinqas and killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lopani was first mentioned in an article of HoloNet News Vol. 531 53, which was released in 2002. In 2008, he was mentioned in Reeft's entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}