{"url": "Royal_Award_Ceremony", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Ceremonies", "Category:Events during the Imperial Era"], "nodes": [{"tag": "h1", "text": "Royal Award Ceremony"}, {"tag": "p", "text": "The Royal Award Ceremony was a medal ceremony held in the Great Temple on Yavin 4 the morning after the Battle of Yavin. The ceremony honored Luke Skywalker, the Rebel pilot who fired the shot that destroyed the Death Star during the battle, as well as Han Solo and Chewbacca, who helped Skywalker during the battle. The ceremony played celebratory music, and at the cue of trumpets, Skywalker and Solo were presented with medals of Bravery by Princess Leia Organa; Chewbacca also received a medal privately after the ceremony's conclusion. Following the presentation of medals, the ceremony honored those who died when the Death Star destroyed Alderaan. At the conclusion of the ceremony, Rebel General Jan Dodonna announced that the Rebellion would be evacuating its base and finding a new one."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 0 BBY, the Alliance to Restore the Republic engaged in its first decisive battle against the Galactic Empire by stealing the plans to the Death Star, an Imperial superweapon capable of destroying entire planets. Following the theft of the plans, they were transmitted to Princess Leia Organa of Alderaan who was captured by Imperial forces under the command of Darth Vader, she was then taken aboard the Death Star where she was tortured for information about the Rebel Base. After witnessing the destruction of her homeworld, Organa was rescued by the Jedi Master Obi-Wan Kenobi, the smuggler Han Solo, a young farmboy from Tatooine named Luke Skywalker and the Wookiee Chewbacca."}, {"tag": "p", "text": "Following the rescue, they made their way to Yavin 4 where the Rebel base was located, but was secretly being tracked by the Death Star as Darth Vader had placed a homing beacon on their ship. Once arriving at the base, the Rebels planned an attack to destroy the battle station using the stolen plans that had been placed into R2-D2 shortly before Organa's capture, the battle that followed resulted in the Death Star's destruction."}, {"tag": "h3", "text": "The ceremony"}, {"tag": "p", "text": "The following morning, the ceremony was held to honor Skywalker, Solo and Chewbacca, as the beings responsible for the Death Star's destruction. They entered the throne room to the sound of trumpets and on either side of the trio were hundreds of uniformed Rebel troops gathered for the ceremony. When the three heroes had reached the end of the aisle, Organa stepped forward and placed a medal around Solo's neck, Solo responded with a wink and smile towards the princess. The princess then repeated the procedure with Skywalker. Following the awarding of the medals, Organa congratulated those assembled for their role in the destruction of the Death Star, and asked them a moment to remember those who were killed in The Disaster. Chewbacca was given his medal privately shortly after the ceremony had finished."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Because the Empire knew the location of the base, procedures went directly from the ceremony to the evacuation of the base. Organa, having recently learned from Evaan Verlaine that the Empire was hunting down the survivors of Alderaan, went on a mission with her to rescue them despite strong opposition from General Jan Dodonna."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The triumphal celebration on Yavin 4 is the final scene of Star Wars: Episode IV A New Hope, the first installment of the original trilogy, released in 1977. The scene was shot at the massive H Stage of Shepperton Studios, located in Shepperton, England. Most of the interior scenes had been filmed at Elstree Studios, just outside of London, but Elstree could not, at the time, offer a stage large enough to portray the chamber, and the shooting was relocated to Shepperton. This scene was filmed over two days, May 13 and 14 1976, right in the middle of principal photography, when the camaraderie had grown between the main actors. The extras hired to portray the assembled troops wore orange X-wing pilot costumes and olive-green US Marine suits. Aside from R2-D2's bleeping and Chewbacca's roar, the scene featured no line and was highlighted by \"The Throne Room,\" a march written by John Williams and performed by the London Symphony Orchestra."}, {"tag": "p", "text": "The filmmakers originally intended to portray the assembly of Rebels present for the ceremony using a matte painting. However, this proved too difficult, and the scene was filmed by moving the extras to different positions in the frame until the illusion of an large assembly was achieved: the extras were first filmed at the near end of the stage, then relocated to the middle, and finally to the far end of the room. According to Star Wars: Behind the Magic, the extras were anything but reverent toward Harrison Ford and Mark Hamill, who portrayed Han Solo and Luke Skywalker. Extras believed the film would be a flop, and whispered insults, openly mocking the actors while they were walking down the set. Originally, the droids R2-D2 and C-3PO, played by Kenny Baker and Anthony Daniels, were meant to march up the aisle with the rest of the characters. However, due to their costumes' limitations, Baker and Daniels could not climb stairs, so it was decided that the droids would wait on the platform with the Princess. On her performance as Leia Organa in the final scene, Carrie Fisher once declared: \"The last line in the script was that the Princess is way down the hall and she is staggeringly beautiful. I crossed off the 'ly' and 'beautiful' and felt this new wording more approached what I would bring to the character.\""}, {"tag": "p", "text": "This end ceremony segment emulates, almost shot-for-shot, a similar scene in Triumph des Willens, a 1934 Nazi propaganda film made by Leni Riefenstahl. Both segments feature a large and enthusiastic crowd gathered in a ceremony hall bounded by columns, with a low podium where the leader stands—in Triumph des Willens, Adolf Hitler was the leader in question. This similarity is unusual, as the Nazi references in Star Wars generally involve the Galactic Empire of Palpatine, whose authoritarian regime mirrors Hitler's Third Reich."}, {"tag": "p", "text": "Many of the versions of the movie script ended with a celebration. In the rough and first drafts, Princess Leia was crowned Queen, and in the third and early fourth drafts, Obi-Wan Kenobi attended the ceremony, having survived his encounter with Darth Vader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}