{"url": "Royal_Crusader", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Military units", "Category:Naboo organizations", "Category:Royal Naboo Security Force personnel"], "nodes": [{"tag": "h1", "text": "Royal Crusader"}, {"tag": "p", "text": "The Naboo Royal Crusaders were the elite members of the Royal Naboo Security Forces. In battle, they rode on large, powerful guarlara steeds and charged into the heart of enemy infantry. They employed powerful melee weapons rather than blaster rifles and were outfitted at Security Force fortresses. Crusaders were typically more equipped for attacking mechanized units, turrets, and troopers, but were vulnerable against aircraft and lightsaber-bearing soldiers. In addition to the Crusaders, the even more well-equipped Elite Royal Crusaders could deal more powerful blows to enemy forces on the battlefield and were protected by shields."}, {"tag": "p", "text": "In 32 BBY, seven Crusaders were used by the Royal Naboo Security Forces to defend the Naboo settlement of Harte Secur during the Invasion of Naboo by the galactic megacorporation known as the Trade Federation. The Crusaders were killed, however, and the Federation conquered the city."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Crusaders received their first mention in the Prima strategy guide to the 2001 LucasArts video game Star Wars: Galactic Battlegrounds. They later appeared in the game during the second Trade Federation mission. They are the Naboo civilization's special units that are produced at fortresses for a cost of 100 units of food and eighty units of nova crystals. They are stronger than many of the game's other melee units. Among enhancements made by the developers for the 2002 expansion pack, Clone Campaigns, Royal Crusaders became cheaper to produce, gained greater movement speed, and did more damage to turrets and walls."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}