{"url": "Royal_Naboo_Security_Forces", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Law enforcement", "Category:Military units", "Category:Naboo organizations", "Category:Royal Naboo Security Force officers"], "nodes": [{"tag": "h1", "text": "Royal Naboo Security Forces"}, {"tag": "p", "text": "The Royal Naboo Security Forces (RNSF), also known as the Naboo Royal Guards, the Naboo Royal Security Forces, the Royal Security Forces or the Volunteer Security Forces were the corps responsible for policing the planet of Naboo as well as protecting its monarch and people."}, {"tag": "p", "text": "The Security Forces, while mostly composed of volunteers, were trained in hand-to-hand combat and marksmanship, as well as responding to attacks such as assassination attempts against the Naboo monarch. However, the Security Forces were a policing organization, and not trained as a standing army. The Security Forces included three divisions: the Naboo Palace Guard, the Security Guard, and the Naboo Royal Space Fighter Corps."}, {"tag": "p", "text": "During the Invasion of Naboo the Security Forces, under the command of Captain Panaka, were overwhelmed by the Trade Federation's droid army. With the assistance of the Jedi they were able to evacuate Queen Padmé Amidala on her Naboo Royal Starship piloted by veteran Fighter Corps member, Ric Olié. Later, during the Battle of Naboo, the Security Forces retook their homeworld with the assistance of the Jedi and the native Gungans."}, {"tag": "p", "text": "When Amidala became a Senator, she continued to receive protection from a Security Forces detail under the command of Captain Gregar Typho. During Amidala's return to Coruscant, Typho was able to disguise her using a decoy. His concerns were well founded, as the shuttle came under attack, killing several guards, though Amidala survived."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}