{"url": "Royal_Palace_of_Alderaan", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Alderaan locations", "Category:Palaces"], "nodes": [{"tag": "h1", "text": "Royal Palace of Alderaan"}, {"tag": "p", "text": "The Royal Palace of Alderaan, also known as the Mountain Palace, was the ancestral home of the Royal Family of the planet Alderaan. Located in the capital city of Aldera, it overlooked a lake and was environed by snow-capped mountains."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The most ancient parts of the Royal Palace were built over a thousand years before Leia Organa's became Crown Princess in 3 BBY. From then on, additional chambers were added every few decades. In its last years of existence, the palace truly embodied the whole history and evolution of Alderaanian architecture, as well as the opulence of royalty."}, {"tag": "p", "text": "By 27 BBY, the palace served as the residence of Queen Breha Organa and her consort Bail Organa. That year, the Queen invited Padmé Amidala, senator of the Chommell sector and former monarch of the Naboo, to spend a week with her on Alderaan. During their visit, Amidala and her entourage were assigned several luxurious suites at the palace."}, {"tag": "p", "text": "At one point, the thieving sisters Brea and Senni Tonnika broke into the palace in an attempt to steal the royal jewels. However, they got noticed because of their orange apparel—which they had mistakenly assumed would make them look like housemaids—and were forced to hide in a dumpster for two days."}, {"tag": "p", "text": "The palace was destroyed when the Death Star, a planet-killing battle station built by the Galactic Empire, blew up Alderaan shortly before the Battle of Yavin."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Because new chambers kept being added throughout the centuries, the Royal Palace was a massive, sprawling labyrinth where modern rooms coexisted with ancient stone rooms. Although the palace did have towers and spires, none of them were designed to dominate the landscape. In keeping with the exterior, the hallways of the palace were wide and welcoming, with nothing in their design that sought to intimidate."}, {"tag": "h3", "text": "Grand entrance hall"}, {"tag": "p", "text": "The grand entrance hall had a gallery with high windows about it. Most of the interior masonry was a silvery blue, smooth and lustrous. Even at the height of summer, the hall was always slightly cool. Because of all its characteristics, Queen Breha likened it to the inside of a seashell."}, {"tag": "h3", "text": "Throne room"}, {"tag": "p", "text": "With a capacity of over two hundred people, the throne room was a large chamber featuring vast panes of stained glass. A blue-and-gold carpet traced a line directly through the room to a dais, where the golden thrones of the sovereign and their consort stood. The throne room had its own antechamber, which could notably be accessed via a shortcut through the palace's old armory. At the back of the throne room was a door that led outside, to a terrace with a magnificent view on the lake and the mountains."}, {"tag": "h3", "text": "Banquet hall"}, {"tag": "p", "text": "The banquet hall was one of the oldest rooms of all. Back when it was built, everything was lit with lamps and candles, and servants were all living organics instead of droids. The banquet room's walls featured ornately carved screens of pale stone. Although they were fashionable at the time of their construction, those screens were in fact designed for eavesdropping. The natural indentations and shadows in the stone hid minuscule openings, each of which was angled to amplify sound from the hall into small passageways between the carved screens and the inner walls."}, {"tag": "h3", "text": "Royal library"}, {"tag": "p", "text": "The royal library was a private area in which the royal family relaxed, and kept their personal treasures and memories. A vast room with a high ceiling, it featured long, narrow windows, a spherical hearth made of copper and stone at its center, and a long, low couch that curved around the east wall. The entrance to the library had tall bronze doors. The library housed datacrons from many worlds and eras, a set of shelves bearing antique paper books, as well as constellation globes of various star systems."}, {"tag": "h3", "text": "Palace gardens"}, {"tag": "p", "text": "The palace gardens had a large central courtyard featuring richly designed beds of ferns and flowers (including the night-blooming candlewick flowers), which formed intricate designs. Nestled within arrangements of ivy, there were statues of pure white marble that served as frames. There were also polished stone benches allowing the gardens' visitors to rest. One particular area of the gardens was a circular plot surrounded by a glazed wall, with a statue of Queen Amidala of Naboo at its center."}, {"tag": "h3", "text": "Bail Organa's office"}, {"tag": "p", "text": "The office of Viceroy Bail Organa was roomy, with more than enough space for a desk, chairs, and an aquarium full of brightly colored sea creatures. Like many other rooms in the palace, the office had an old-fashioned door that opened and closed by hand."}, {"tag": "h3", "text": "Monarch's stateroom"}, {"tag": "p", "text": "The chamber that Queen Breha used as her private stateroom was bordered on one side by the private library, and on the other by the vast chamber of the public stateroom. One of the oldest areas of the palace still in common use, the relatively smaller room boasted stone walls, exposed wooden rafters, and a fireplace that stretched nearly the entire length of the room and was deep enough to walk into. The stone floor was covered in thick hand-woven rugs."}, {"tag": "h3", "text": "Royal apartments"}, {"tag": "p", "text": "The corridor leading to the royal apartments had plants in it. The tall, arched doors leading to the apartments were guarded by two armored, halberd-carrying sentinels that stood on either side. The apartments themselves comprised first an antechamber lush with plants and flowers, then a greeting salon, and then a short, curved corridor that led to a private balcony whose railing was made of marble. The balcony had a view on the Juran mountains and the valley between the range and the palace."}, {"tag": "h3", "text": "Leia Organa's bedroom"}, {"tag": "p", "text": "The childhood bedroom of Leia Organa was located high in a tower. It had window with a view on the Appenza Peak, and a mantel where the young princess put her keepsake chest. The bed, carved of priceless Glee Anselm hardwoods and inlaid with thin, curling lines of pure gold and silver. Apart from that artifact of a grander age, the room was a simple one."}, {"tag": "h3", "text": "Guest suites"}, {"tag": "p", "text": "Luxurious suites were put at the disposal of the monarch's guests. Some were bigger than others, but all suites were elegantly decorated in a minimalist yet beautiful style."}, {"tag": "h3", "text": "Meeting room"}, {"tag": "p", "text": "A long, vaulted chamber at the north end of the palace was used by dignitaries engaging in serious political discussions around a long meeting table. Like the royal apartments, it had a high-arched door. The nearest balcony to that room was the one situated off the royal apartments."}, {"tag": "h3", "text": "South terrace"}, {"tag": "p", "text": "The palace's south terrace looked out over the River Wuitho, and the smaller villages on the outskirts of Aldera."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}