{"url": "Royal_Slave_Auction", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Events during the Clone Wars"], "nodes": [{"tag": "h1", "text": "Royal Slave Auction"}, {"tag": "p", "text": "The Royal Slave Auction was an event held by the Zygerrian Slave Empire that provided slaves to clientele from all throughout the galaxy. After the Jedi broke the Zygerrians' power and their slave trade, the auction was discontinued for a long period of time. During the Clone Wars, Queen Miraj Scintel of Zygerria allied herself with the Confederacy of Independent Systems to kidnap the Togruta colonists of Kiros in an attempt to bring back the auction and restore the Slave Empire. However, the auction was disrupted by an undercover Galactic Republic team on a mission to rescue the kidnapped colonists."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Royal Slave Auction was an event held for millennia prior to the outbreak of the Clone Wars. The Zygerrian Slave Empire provided slaves of various species to clients throughout the galaxy. At some point before the Separatist Crisis, the Jedi Order intervened and broke the slave trade of the Zygerrians."}, {"tag": "p", "text": "In 20 BBY, as part of a bid to rebuild Zygerria's ancient power as a slave state, Queen Miraj Scintel reinstated the auction after kidnapping Togruta colonists from the planet Kiros, with the assistance of the Confederacy of Independent Systems as part of the ongoing Clone Wars. At the same time, however, the Galactic Republic and Jedi had sent an undercover team to Zygerria to locate the missing colonists, consisting of Jedi Knight Anakin Skywalker, Jedi Master Obi-Wan Kenobi, Padawan Ahsoka Tano, Clone Captain Rex and the astromech droid R2-D2. Kenobi was captured by the Zygerrians during an attempt to rescue Kiros Governor Gupat Roshti, and subsequently displayed as a captive at the auction. Skywalker, undercover as a slaver named Lars Quell, was asked by Scintel to whip Kenobi to prove his identity, and exposed his true identity in an attempt to rescue his former master. In the ensuing fight, which disrupted the auction, Skywalker, Kenobi, Tano and Rex were all captured, and Scintel attempted to make Skywalker into her personal slave bodyguard in the aftermath."}, {"tag": "p", "text": "Skywalker eventually escaped after the arrival of Count Dooku, who had intended to order Scintel to execute the Jedi. The Sith Lord eventually fatally Force choked the queen and framed Skywalker for the crime, but he escaped with Tano and R2-D2, persuading the dying queen to reveal that the colonists, as well as Kenobi and Rex, had been sent to Kadavo. Skywalker and Tano subsequently set out to rescue Kenobi, Rex and the colonists, accompanied by backup in the form of Jedi General Plo Koon and his forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Royal Slave Auction was first mentioned in the Star Wars: The Clone Wars season 4 episode \"Kidnapped\", and first appeared in the following episode, \"Slaves of the Republic\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}