{"url": "Bad_Business", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 8"], "nodes": [{"tag": "h1", "text": "Bad Business"}, {"tag": "p", "text": "Bad Business is a comic that appears in Star Wars Tales 8. It was written by John Ostrander, art by Francis Portela."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Coming to Watto's shop to cover a debt Watto owes him, Vilmarh Grahrk picks three DUM-series pit droids. While Watto at first tries to divert him, Vilmarh thinks he is just trying to stop him from getting them. However, it turns out that the droids have faulty programming, making them mess with anything in view. Watto then sends Shmi Skywalker with the droids to Vilmarh's ship, the Inferno."}, {"tag": "p", "text": "Mean while, Princess Miaria Prrt asks Vilmarh for a lift to her home planet, Felacat. Vilmarh agrees, but is warned by Miaria that her species cannot take the stress of hyperspace for too long. After the princess leaves, Vilmarh signs the release for the pit droids and has a conversation with his droid about what he is going to do with the princess."}, {"tag": "p", "text": "While going through hyperspace, Miaria has a headache and Vilmarh notices that they haven't gotten out of hyperspace. While Vilmarh goes to check out what is wrong, Miaria begins to change."}, {"tag": "p", "text": "Going into the cockpit, Vilmarh sees the pit droids messing with the navigation computer. However, he is quickly confronted by a monster Miaria. Going into a crawl chute, he is informed by his ship's AI that the pit droids are beginning to disassemble the core processor. Shutting down the droids, Vilmarh runs from Miaria and traps her in an escape pod until they get to the planet."}, {"tag": "p", "text": "After getting to the planet, Vilmarh confronts the leader about a reward. But the leader and his guards threaten to turn into the monsters if \"stressed\"."}, {"tag": "p", "text": "However, after aboard the ship, Vilmarh smiles. When his droid asks why, Vilmarh informs the AI that he left the pit droids on the planet, with instructions to \"fix the planet to death\". And that made Vilmarh very happy..."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The events of the story were later referenced in The Complete Star Wars Encyclopedia and The Feral Queen."}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}