{"url": "Rozatta", "categories": ["Category:Legends articles", "Category:Business owners and executives", "Category:Females", "Category:Toydarians"], "nodes": [{"tag": "h1", "text": "Rozatta"}, {"tag": "p", "text": "Rozatta (known affectionately as Roz) was a female Toydarian and good friend of bounty hunter Jango Fett. She was also friends with fellow Toydarian Watto, a junk dealer situated on Tatooine. She was the owner of a space outpost called Outland Station, which played host to pit fighting games, among other underworld events."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "For years, Rozatta owned the Outland Station and would assist the bounty hunter Jango Fett in finding bounties and sometimes even tell him where they were for her own small finder's fee."}, {"tag": "p", "text": "Rozatta would call Fett back to her station to secure the bounty of the Muttani, Meeko Ghintee, for various crimes. Ghintee was on her station, cheating at the pit fighting games using a remote device to control his beast."}, {"tag": "p", "text": "However, Ghintee wasn't the only reason why Roz had called Fett back to Outland Station. A transmission had come for the infamous bounty hunter from a man named Tyranus. Tyranus made the proposition of giving Fett five million Republic credits to locate and capture Komari Vosa, the leader of the Bando Gora, dead or alive."}, {"tag": "p", "text": "Rozatta asked Fett not to take the bounty, explaining that it was too risky for him and could either \"make\" him or \"break\" him. She hoped that Fett would stop bounty hunting and just \"meet a nice girl, settle down and have a kid\". Fett ignored her warnings and Roz still gave Fett a lead to multiple bounties that might lead Fett to Vosa."}, {"tag": "p", "text": "Rozatta's hopes for Fett would spring back when he took on a partner named Zam Wesell. Commenting that she was \"such a looker\", Roz was disappointed later on when Wesell betrayed Fett to Gardulla the Hutt. She'd commented to Fett that she'd hoped they would \"get together\"."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Unknown to both Fett and Rozatta, the bounty hunter known as Montross was tracking Fett's transmissions and finding out his sources for the bounties. Montross infiltrated her station and forced Rozatta to give up all the information she had acquired about Vosa. Montross left, but not without setting thermal charges around the station. When Fett discovered that Montross had gotten to Roz, he rushed back to rescue her. However, the Toydarian was beaten and broken and told Fett where Vosa was. Then she gave Fett a recording device to lead him to Vosa and she also told him to live for something besides credits. Rozatta died there and Fett fled before Rozatta's body and station were blown up."}, {"tag": "h3", "text": "Post-mortem"}, {"tag": "p", "text": "Fett would honor Rozatta's final wishes when he had successfully beaten Vosa and Tyranus offered him the chance to be the template for the Clone Army. Fett would only agree if he could have the first clone to himself, unmodified so that he could raise it as his own son."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rozatta wears unusual hats during the course of Star Wars: Bounty Hunter. One of her many hats is actually a real-world high-heeled female shoe, that is upside down."}, {"tag": "p", "text": "In Bounty Hunter, Rozatta was played by Lucille Bliss."}, {"tag": "p", "text": "Rozatta repeats the line \"I have a bad feeling about this\" when trying to convince Jango Fett not to try to go after Komari Vosa. Fett retorts by saying 'what else is new?', perhaps as a reference to the phrase's frequent use in the Star Wars universe. She later says \"I told you I had a bad feeling\" when Jango returns to her following her beating by Montross."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}