{"url": "Rryatt_Trail", "categories": ["Category:Legends articles", "Category:Kashyyyk locations", "Category:Roadways"], "nodes": [{"tag": "h1", "text": "Rryatt Trail"}, {"tag": "p", "text": "The Rryatt Trail was a long and winding trail that eventually led its travelers to the shadowy surface of Kashyyyk. It started from Rwookrrorro and snaked all the way down to the Well of the Dead in the Shadowlands. It was home to many of the most ferocious examples of the wildlife on the Wookiee planet, including jaddyyk moss, needlebugs, rkkrrkkrl, kkekkrrg rro, moufs, katarn, rroshm, and terentateks, along with many other ferocious beasts. Wookiees and off-world adventurers alike would test their skills on the lower, more dangerous parts of the Trail, and hunting the creatures in the very depths of the Trail was part of the Wookiee Hrrtayyk ceremony, a rite of passage for young Wookiees."}, {"tag": "p", "text": "The access to the Rryatt Trail was guarded by the Rryatt Ceremonial Guard. The Trail had Wookiee guides along the paths to help adventurers find their way. Achonnko was the Master Trail Guide of the Rryatt Trail in 1 ABY. He had traversed and learned the entire Trail, and knew its many ins and outs."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Civil War (1 ABY)"}, {"tag": "p", "text": "During the Galactic Civil War in 1 ABY, the Trail was home to many events of varying importance. Along the initial level, the Common Paths, Master Trail Guide Achonnko tasked a spacer with exploring the Trail in its entirety. A Wookiee named Krepauk resided on this level in the same year. He was the Huntmaster of the Rryatt Trail and tasked those who wished to test themselves in the wilds of the Trail with feats of strength. His final test was often to slay one of the fearsome katarn beasts in the Shadowlands and return its claws. Those who succeeded were rewarded with a fearsome weapon crafted from the claws. A Human hunter and undercover member of the Wookiee slave resistance, Carl Mosik, along with his Wookiee friend, Zhailaut, were responsible for the initial hiring of the spacers who eventually killed Lord Cyssc Blackscale. Hidden from the Empire's prying eyes, a Rebel commando unit had set up a small base here."}, {"tag": "p", "text": "The second level, the High Grounds, was home to the crazed former Jedi, Urootar, whom Krepauk wished killed for the safety of the Trail, and also housed a secret camp of escaped Wookiee slaves. A small group of the Rodian hunters from the Etyyy hunting grounds, led by a male Rodian named Tressk, had also set up camp along this level, hunting the various creatures that inhabited it."}, {"tag": "p", "text": "On the third level, known as the Wroshyr Canopy, a group of poachers had begun hunting on the various wildlife. Tressk, the Rodian leader from the High Grounds, tasked a spacer with eliminating these poachers. A former group of Rodian hunters from the group on the High Grounds level were also spotted on this level, having become lost and driven mad by something unknown. Treesk hired a spacer to to kill these \"embarrassments\"."}, {"tag": "p", "text": "The fourth level, the Webweaver Path, held a camp of feral Wookiees, who recklessly attacked all who came near their camp. Krepauk, during a spacer's test of strength, tasked them with delivering the feral Wookiees to their \"final rest\". A Blackscale Clan slaver camp was also present here. A female Wookiee named Kymayrr living in Kachirho sent a spacer to this camp to rescue her son, Rroot."}, {"tag": "p", "text": "The final level, the Shadowlands, were inhabited by a group of Gotal hunters who had taken up residence within the Shadowlands, easily adapting to life in the dark, dank underworld. A large presence of B1-Series battle droids, B2 super battle droids and droidekas was also known, having been abandoned on the planet after the conclusion of the Battle of Kashyyyk during the Clone Wars. A Wookiee by the name of Lobarorr hid in the Shadowlands, living in shame after he had murdered his friend out of jealously over his father's weapon. Huntermaster of the Trail, Krepauk, sent a spacer during a test of strength, instructing them to kill both a minstyngar named Scratch and a katarn within the Shadowlands."}, {"tag": "h3", "text": "Black Fleet Crisis (16 ABY)"}, {"tag": "p", "text": "During the Black Fleet Crisis crisis in 16 ABY, Chewbacca assisted his son Lumpawarrump in his right of passage on the final level of the Trail, the Shadowlands, hoping to kill a katarn. However, before they were able to locate one, Chewbacca received notice that Han Solo had been captured by the Yevetha and had to halt the hunt. Lumpawarrump accompanied his father, and through his effort in helping to free Solo, Chewbacca declared that his son had symbolically faced the katarn, and declared him an adult, changing his name to Lumpawaroo."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "The Rryatt Trail was broken up into five separate levels, each with trail guides to aid travelers traversing the grand Trail. The second, third, and fourth levels had two guides, one on each end of the level, to assist travelers in either going back up a level, or going down a level. The fifth level had only one guide, who only assisted travelers in going back up, as it was the end of the Trail. The first level, known as the Common Paths, had one guide at its end, but also had a Master Trail Guide near the beginning, who could guide travelers to any level of the Trail."}, {"tag": "h3", "text": "The Common Paths"}, {"tag": "p", "text": "The Common Paths were the first level of the Trail, and they were relatively the safest area. The paths on this level were set along the tops of a series of hills set above the canopy of the Wroshyr trees of Kashyyyk. This level of the Trail was home to a variety of walluga and bolotaur. Most travelers were encouraged to stay on the Common Paths. At the beginning of this level was a small rest area, complete with a medical bay and a 2-1B surgical droid, for those travelers unlucky enough to be hurt in their explorations along the trail. This rest area was also where the Master Trail Guide, Achonnko, assisted travelers down to the other levels of the Trail. Achonnko would only assist travelers down to levels they had already been to, however."}, {"tag": "h3", "text": "High Grounds"}, {"tag": "p", "text": "The High Grounds were the second level of the Trail, and was dominated by thick foliage. Like the Common Paths, the paths on this level were set along various hills, although it snaked deep enough into the forest that you could just see the tops of the trees, along with many of its final paths being supported on the very peak of the trees. This level was known to house a variety of moufs and bolotaur."}, {"tag": "h3", "text": "Wroshyr Canopy"}, {"tag": "p", "text": "The third level was the Wroshyr Canopy, which was, as its name implies, the canopy of the Wroshyr trees. This entire section consisted of the intertwined branches of several of the immense trees. It was home to a variety of minstyngar, sathog, jyykle vulture, and fern bicker."}, {"tag": "h3", "text": "Webweaver Path"}, {"tag": "p", "text": "The fourth level was the Webweaver Path, so named because it was infested with wyyyschokk, more commonly known as the webweaver. The level consisted of a long trail of interconnected branches of the wroshyr trees, which were further connected by a series of low lying hills. At the time of the Galactic Civil War, a group of feral Wookiees had set up a primitive camp on a high-rising rock formation that could be reached via the giant branches of the wroshyr trees. Another group that had built a camp in this region was the Trandoshan Blackscale Clan"}, {"tag": "h3", "text": "The Shadowlands"}, {"tag": "p", "text": "The Shadowlands (sometimes referred to as the Shadow Forest) were the fifth and final level of the Trail. The Shadowlands were the surface, or ground level of Kashyyyk, completely removed from direct sunlight by the massive wroshyr trees that hung overhead. This level was home to some of the most vicious beasts of Kashyyyk, including jaddyyk moss, needlebugs, minstyngar, kkekkrrg rro, rroshm, katarn, and terentatek. Many rites of passage for young Wookiee adults took place here, as well as tests of skill for off-worlders, as it was the most inhospitable area on Kashyyyk."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rryatt Trail is an explorable area with the aforementioned five separate levels in Star Wars Galaxies: An Empire Divided. The Trail, along with the rest of the planet Kashyyyk, were added to the game with the expansion pack Rage of the Wookiees, which was released May 5th, 2005. Within the game, it is host to a vast array of enemies and quests for the player to complete, many offering unique rewards never before seen within the game, such as an unarmed weapon made out of the claws of a katarn, or a Kashyyyk bantha creature mount. Like several areas in the expansion, it is split up into six separate instanced areas, while a limited number of players may access and play together in each instance. Due to Star Wars Galaxies open-ended nature, there is no strict timeline of the events that took place on the Trail in 1 ABY."}, {"tag": "p", "text": "The final level of the Rryatt Trail, the Shadowlands, also appeared in the video game Star Wars: Knights of the Old Republic, but since the Shadowlands covers nearly the entirety of Kashyyyk's surface, it is unknown if it is the same portion seen at the end of the Rryatt Trail."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}