{"url": "Rufaan_Tigellinus", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with cut elements", "Category:Grand Admirals of the Galactic Empire", "Category:Grand Moffs of the Galactic Empire", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Rufaan Tigellinus"}, {"tag": "p", "text": "Rufaan Tigellinus was a Grand Admiral and later a Grand Moff of the Galactic Empire until his death in 5 ABY. Known for his political savvy and charisma, Tigellinus was widely followed in the media and was considered to be a key player in Imperial Court politics. Already a respected fleet admiral, he was made a Grand Admiral in 2 BBY and, from the helm of his Star Destroyer, Avatar, spent much time rooting out pirates in the Outer Rim Territories. During the Galactic Civil War, Tigellinus stepped up in the Imperial Court in a bid for further power, allying himself with the likes of Moff Vilim Disra and Imperial Advisor Alec Pradeux, and becoming a member of the ancient, exclusive Order of the Canted Circle. When Thrawn, an alien admiral in the Imperial Navy, tried his hand at Imperial Court politics, the Humanocentric Grand Admiral Tigellinus befriended and later betrayed him, until Thrawn was unwelcome in the Empire."}, {"tag": "p", "text": "Soon thereafter, Tigellinus brought his political clout to bear in order to have himself appointed as Grand Moff of the Imperial Center Oversector with the help of Vilim Disra, who became something of a mentor to Tigellinus. After Emperor Palpatine perished at the Battle of Endor in 4 ABY, Tigellinus became involved with the Central Committee of Grand Moffs. The Committee's leader, Bertroff Hissa, a near-Human with whom Tigellinus had frequently butted heads, presented Tigellinus with a demeaning offer—a place on the Committee but not the leadership many had expected he would be awarded—hoping that he would refuse and give Hissa an excuse to execute him. Tigellinus prepared to accept the offer, but his close friend Disra advised against this; Tigellinus refused the appointment, and the Committee executed him for perceived disloyalty, while Disra laid claims to his assets and seat on the Committee."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Grand Admiral"}, {"tag": "p", "text": "A Human male, Rufaan Tigellinus was a charismatic member of the Imperial Court, well known among the media, and a respected strategist who served as a fleet admiral in the Imperial Navy for many years. In 2 BBY, during New Year Fete Week, Emperor Palpatine created the rank of Grand Admiral, appointing Tigellinus and eleven others to his \"Circle of Twelve.\" Tigellinus' reputation was such that his appointment met with little argument from those in the Galactic Empire. The Grand Admiral used his new power to further his position within the Imperial Court, gaining a large following."}, {"tag": "p", "text": "Tigellinus commanded the Star Destroyer Avatar during the years preceding the Battle of Yavin. Around this time, he attempted to apprehend the Poss'Nomin pirate Reginald Barkbone, who had been plundering many star systems from the Outer Rim Territories to the Colonies. Tigellinus and Avatar chased Barkbone through many sectors, though the pirate's Star Galleon, Robber Baron, was able to escape each time. In his ship's log, Tigellinus vowed to kill Barkbone; the log was later sent to Grand Vizier Sate Pestage as part of an Imperial Security Bureau report compiled by Commander Maximillian Seerdon. Around that same time, an alien named Thrawn joined the Imperial Navy, earning the rank of captain. Tigellinus, a firm believer in Humanocentrism, despised Thrawn, and began looking for ways to get rid of him."}, {"tag": "p", "text": "Several months after the disastrous Battle of Yavin, Tigellinus started to become a major player in Imperial Court politics on Coruscant. He established an alliance with Alec Pradeux, an Imperial Advisor who was thought to be close to Palpatine, and forged a sizable faction in a short span of time. In late 1 ABY, Tigellinus attempted to win support for his protégé, Gerald Weizel, to become the governor of the planet Chandrila. On 36:9:4, the media reported that Weizel had won the backing of Moff Jamson Caglio; this was an important event in Tigellinus' rise, as Caglio had been a firm supporter of Tigellinus' rival faction, that of Grand Moff Traeda, and winning his support was seen as a large step toward the center of power. Around the same time, Tigellinus attempted to recruit Moff Vilim Disra, a man with many ties to Traeda but who had recently fallen out of favor with Palpatine, into his faction. The media kept a close watch on the situation, and journalist Alendar Jarvis of the New Order Progressive published a report on Tigellinus' progress."}, {"tag": "p", "text": "Tigellinus, along with Traeda and Moff Jaan, officiated the festivities of that year's New Year Fete Week in Palpatine's absence, since the Emperor was away on Imperial business in the Deep Core. Shortly thereafter, Thrawn, now an admiral, entered Imperial politics. Tigellinus still harbored a deep hatred for non-Humans and resented Thrawn's encroaching on his territory; he befriended the alien admiral, with the intention of later betraying him."}, {"tag": "p", "text": "Around six months later, Tigellinus was inducted into the Order of the Canted Circle, an elite, ancient, and highly exclusive social organization. The Order rarely took on more than eleven members at any one time, but Tigellinus was the thirteenth member added since 5 BBY, so his invitation was a surprise to the media. It was a testament to Tigellinus' rising stature that he was selected to join ahead of swaths of prospective members, each revered leaders of the Imperial government, most of whom had been waiting for an invitation for several years. Tigellinus wore the traditional black velvet robe of the Order during his public induction ceremony at the Skydome Botanical Gardens; later that evening, a private ceremony was held in an undisclosed location, and Tigellinus became a fully-fledged member of what was considered one of the most prestigious social clubs in the galaxy."}, {"tag": "p", "text": "Tigellinus' joining the Order was somewhat overshadowed by the induction of Admiral Thrawn, who had returned to Coruscant after an extended trip to the Outer Rim, several months later. Rumors abounded that Palpatine had personally requested that Thrawn be invited, but his invitation was still considered remarkable; he was the fourteenth member and he was a non-Human. Tigellinus was outraged and attempted to use his influence to halt Thrawn's joining, to no avail. Though he did the best he could to conceal his actions in an attempt to maintain his charade with Thrawn, the media assumed it had been Tigellinus leading the opposition."}, {"tag": "h3", "text": "Grand Moff"}, {"tag": "p", "text": "Around the same time, Tigellinus' bid for further power was given a tremendous boost when Lord Darth Vader, one of his chief rivals on Coruscant, left the capital to lead Death Squadron in the Outer Rim, for what was expected by the media to be a considerable amount of time. Tigellinus met with Vader just days later as part of his Grand Admiral duties, during the unveiling of the Star Dreadnought Executor, the first of its kind, near Kuat. Tigellinus, Vader, Thrawn, and several others flanked the Emperor during the unveiling ceremony."}, {"tag": "p", "text": "Tigellinus and Thrawn were among several high profile absentees from the Shaldania Parade at the start of Coruscant's New Year Fete Week on 38:F1:1. Though their absence was officially attributed to them being on assignments elsewhere in the Empire, Galaxy News Service reported that both admirals' factions in the Imperial Court were maneuvering for more powerful positions. Tigellinus soon enacted his plan to ensure that Thrawn was out of favor in the Emperor's Court; he betrayed the alien admiral, who ultimately became not only unwelcome on Coruscant, but within the entire Empire. Thrawn was exiled to the Unknown Regions, and Tigellinus was believed to have achieved a great victory. In actual fact, Thrawn's falling out of favor was orchestrated by the Emperor for his own clandestine means. Tigellinus also took a dislike to the vicious tendencies of Delak Krennel, the violent–but–effective captain of the Star Destroyer Reckoning, and in order to both rid himself of Krennel and to vex Thrawn, Tigellinus had Krennel expelled to the Unknown Regions to serve under the Chiss."}, {"tag": "p", "text": "Soon thereafter, Tigellinus decided that he was best suited to governing regions rather than protecting them, and used his considerable political influences to bring about an appointment to Grand Moff. He had many allies, though he was also at odds with many of his fellow Grand Moffs, including Bertroff Hissa, a near-Human Moff. Tigellinus was something of a rival with Vilim Disra, whom he had once courted, but Disra's assistance to the Grand Admiral-cum-Grand Moff was immeasurable; with Disra's aid, Tigellinus took control of the Imperial Center Oversector, considered to be among the most important sectors in the galaxy."}, {"tag": "p", "text": "In 3 ABY, on 38:5:11, the Emperor assigned Tigellinus to head an investigation into the affairs of one Jerrod Maclain, the governor of Brentaal, who had been accused of corruption and \"behavior unsuitable for an Imperial diplomat.\" Tigellinus' appointment was to the great surprise of Imperial Court observers, who considered him too important and influential to be relegated to such rudimentary investigative duties, though Alec Pradeux, his longtime ally, informed the media that Palpatine's choosing such a prominent individual merely highlighted the gravity of the situation. Tigellinus addressed the media about the impending investigation, informing them of his suspicions that those who had sold Maclain out were embroiled in a plot to steal his power. He also told the media that Maclain was a loyal servant of the Empire, and that Tigellinus would carry out as thorough an inquest as he could muster."}, {"tag": "p", "text": "After the Emperor and Darth Vader perished at the Battle of Endor in 4 ABY, the Empire descended into chaos, and many sought to claim the Emperor's former power. Tigellinus continued to defend his territories while waiting to see who came to power as Palpatine's successor. Eventually, Director of Imperial Intelligence Ysanne Isard emerged as the new leader of the Empire, though many others lusted for power and opposed her. A group of Moffs, led by Grand Moffs Bertroff Hissa, Dunhausen, Thistleborn and Muzzer, formed the Central Committee of Grand Moffs, which openly opposed Isard and claimed the throne for their ally, Trioculus. Because of his previous power and influence, Tigellinus was seen by many as a natural leader of the Committee, though Hissa, Tigellinus' enemy from his early days as a Grand Moff, presented him with a demeaning offer: he could become a member of the Committee, but nothing more. Hissa engineered events so that, should Tigellinus refuse, he would be executed. On the advice of his trusted colleague Disra, Tigellinus declined the offer, and Hissa and his allies killed him. Disra's machinations allowed him to absorb Tigellinus' assets and take his place on the Committee."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rufaan Tigellinus was a highly driven, highly motivated man, with abundant charisma and political savvy who was known for his tactical abilities. His ambition saw him rise extremely high in Imperial politics, becoming one of the Emperor's most trusted minions; however, others, such as Darth Vader, thought little of the Grand Admirals. Tigellinus was adept at making allies who would benefit his rise to power, and he demonstrated this numerous times during his career—Alec Pradeux and Vilim Disra, both political powerhouses, were two friends who greatly helped Tigellinus establish himself in the Imperial Court. He used unscrupulous means to achieve his goals, befriending Thrawn with the intention of betraying him, merely because the admiral was not Human. Despite this, Tigellinus was easily manipulated by Disra; his trust in his friend allowed Disra to orchestrate his downfall. He was also very persistent, chasing the pirate Reginald Barkbone through many systems and refusing to give up, and he told the media he would conduct a proper and thorough investigation into the events surrounding Governor Maclain."}, {"tag": "p", "text": "Tigellinus was very Humanocentric and he despised non-Humans and near-Humans. When he learned of Thrawn, then a captain in the Imperial Navy, he vowed to deal with the Chiss and ensure that his Imperial career was short-lived. Later, he betrayed Thrawn, and his animosity toward the alien was not a closely guarded secret. Tigellinus also clashed with a near-Human, Bertroff Hissa, many times while serving as a Grand Moff. The open disgust Tigellinus showed towards Hissa was not forgotten by the Sephi Grand Moff, who later engineered Tigellinus' demise."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rufaan Tigellinus was created by Paul Sudlow for Galaxywide NewsNets, which was a recurring series of articles that appeared in the Star Wars Adventure Journal; he first appeared in issue eight, published in November 1995, and made frequent appearances until issue fourteen, some of which were written by Peter M. Schweighofer. Tigellinus was the third named Grand Admiral, a rank first appearing in Timothy Zahn's Thrawn Trilogy; the other two were Thrawn, first appearing in Heir to the Empire, and Josef Grunger from The Glove of Darth Vader."}, {"tag": "p", "text": "Tigellinus went unreferenced for many years; he was not mentioned in Daniel Wallace and Kevin J. Anderson's The Essential Chronology, released in 2000, which dealt with the ultimate fate of many of the Grand Admirals. Wallace made mention to the character in 2002's The New Essential Guide to Characters, and later, he and Abel G. Peña expanded Tigellinus' history and backstory in the character's bio in Who's Who: Imperial Grand Admirals, published in Star Wars Insider 66. Who's Who: Imperial Grand Admirals was originally slated to appear under the title of Dirty Dozen: The Imperial Grand Admirals in an edition of Star Wars Gamer Magazine, but the magazine was canceled and the article was moved to Star Wars Insider, and much of the original content was cut. Some of this cut content, such as Tigellinus' Star Destroyer, Avatar, has since been mentioned by other sources and made canon; the remainder of it is summarized in the next section below. In addition to cut content regarding his life, the original draft also included roleplaying game statistics, including Tigellinus' equipment: a blaster pistol, a comlink, his code cylinder, a pendant of the Order of the Canted Circle, and an Imperial-class Star Destroyer, named Avatar. Daniel Wallace later posted the equipment list for each of the Grand Admirals on his StarWars.com blog. Tigellinus has since been mentioned in The New Essential Chronology, Underworld Appendix: Swoops, Spice, and Wretched Rogues and Barely Tolerable: Alien Henchmen of the Empire."}, {"tag": "p", "text": "In Galaxywide NewsNets from Star Wars Adventure Journal 14, Tigellinus is inexplicably referred to as a \"Grand Moff,\" despite all previous NewsNets articles giving him the title of \"Grand Admiral\"—a demotion. Peña and Wallace established that Tigellinus decided to become a Grand Moff around the time of Star Wars: Episode V The Empire Strikes Back; however, there has been some confusion among fans as to whether Tigellinus retained his rank or if a new Grand Admiral was appointed, as Palpatine wished for there to be twelve Grand Admirals at any one time. Peña stated on the StarWars.com message boards that, in his view, it was possible for Tigellinus to hold both positions, at least informally, because of his political influence. In 2008, Tigellinus received an entry in The Complete Star Wars Encyclopedia by Stephen J. Sansweet, Pablo Hidalgo, Daniel Wallace and others."}, {"tag": "h3", "text": "Cut content"}, {"tag": "p", "text": "Tigellinus emerged on the Imperial Court politics scene at a rapid pace, building up a large following; he drew people into his influence rapidly, and those who opposed him quickly found their careers in tatters. Disra, Tigellinus' mentor, advised him to \"know your enemies as intimately as friends,\" so when Thrawn, who Tigellinus considered an alien freak, became involved in Imperial politics, Tigellinus did just that; he helped Thrawn gain admission to the Order of the Canted Circle, wherein he consistently undermined the alien's influence and turned the Order against him. Thrawn was possessed of considerable intellect, which few were able to match; Tigellinus managed to do that and more, orchestrating—he believed—Thrawn's banishment. Tigellinus gave Thrawn credit, claiming he played the game well, but was very confident in his own intellect."}, {"tag": "p", "text": "Tigellinus thought little of his fellow Grand Admirals; he saw some as wholly incompetent, others as talented military strategists possessing no tact or guile off the bridge, and was quick to locate the character flaws of many of his peers. Tigellinus relished a challenge, and after Thrawn's exile he saw none in the ranks of the Grand Admirals. When he looked at the Grand Moffs, however, he saw many worthy adversaries—Ardus Kaine, Kentor Sarne and Nivers—so he became a Grand Moff himself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}