{"url": "Rulan_Prolik", "categories": ["Category:Legends articles", "Category:GenoHaradan Overseers", "Category:Impersonators", "Category:Individuals of unidentified species", "Category:Males", "Category:Shape-shifting individuals"], "nodes": [{"tag": "h1", "text": "Rulan Prolik"}, {"tag": "p", "text": "Rulan Prolik was a shapeshifter and an Overseer of the GenoHaradan in 3956 BBY, during the Jedi Civil War."}, {"tag": "p", "text": "The identities of the four GenoHaradan overseers were meant to remain unknown even to each other, but Overseer Hulas managed to learn that Rulan was among the number. Hulas consequently attempted to enlist Revan to assassinate him, claiming that Rulan was responsible for several prominent assassinations in the Outer Rim Territories and would likely move to the Core Worlds, wreaking havoc in the Galactic Senate itself. Prolik was later killed by a group of Jedi Knights."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Overseers of the GenoHaradan were mysterious by nature, but Rulan's shapeshifting capabilities placed him in a separate league. Few knew his identity as an overseer; fewer knew his species, or even whether his power derived from natural ability or alien technology. His skill in assuming a target's identity was uncanny—to the extent of knowing exact phrases the target would say. Rulan could assassinate someone, assume that victim's identity, and convincingly maintain the identity for long durations of time. Stranger still, when he was killed, there was a blinding flash of light that left only a twisted, shrunken humanoid corpse."}, {"tag": "p", "text": "Rulan's shapeshifting was no mere illusion; he would actually take on the physical characteristics of whomever or whatever he changed into. There was some level of restriction to this power, however: while he could use claws and other natural weapons of creatures he mimicked and even simple swords, he could not conjure up energy weapons his target might have used (such as a lightsaber), and, even if his target was a Jedi or Sith, he could not replicate the target's connection with the Force."}, {"tag": "p", "text": "If Rulan was a changeling, he was a powerful breed, and there are some species that can be eliminated as candidates (e.g. Clawdites, who are unable to change their body masses). If Rulan's powers were derived from synthetic machinery, then it was the type of technology that would have been completely destroyed upon his death, with no trace left behind."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If the player accepts the dark side quest, Revan kills Rulan at the behest of Hulas. Rulan attempted to defend himself by first taking the form of Jolee Bindo and then a terentatek, but, seeing that he was no match for Revan, the shapeshifter took the form of a harmless tach and hid among other tachs. In doing this, Rulan underestimated Revan's resolve: the fallen Jedi had no qualms with slaughtering all the tachs in the area until Rulan was discovered. Rulan died by Revan's hand and reverted to his natural form in a burst of light."}, {"tag": "p", "text": "Also, there is data in the game files that suggests Prolik would take the form of any one of the player's companions, including the player, not only Jolee. This was left out of the final release, however."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}