{"url": "Running_the_Sisar", "categories": ["Category:Real-world articles", "Category:Secrets of the Sisar Run adventures"], "nodes": [{"tag": "h1", "text": "Running the Sisar"}, {"tag": "p", "text": "Running the Sisar is an adventure in Secrets of the Sisar Run, published by West End Games."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After three Black Sun smuggling crews had been captured near Ka'Dedus, Vigo Sprax's chief smuggler Mal Biron organizes a test to find new recruits: A \"simple\" cargo run from Sriluur to Nwarcol Point along the Sisar Run. Kalend Thora, a Black Sun smuggler will observe the race."}, {"tag": "h3", "text": "Episode One: A Meeting of Minds"}, {"tag": "p", "text": "The adventure begins in Meirm City, where the players' characters and several smugglers have been invited to Docking Bay 42. These smugglers are Kalend Thora, Nabrun Leids, Elis Helrot, Kal'Falnl C'ndros, Rycar Ryjerd and Az-Iban (actually Morturr Heth in disguise). After all are assembled, Mal Biron appears and tells that he has very important, but unspecified, cargo to be delivered to the Destination: Adventure! and has hired that many ships and crews to ensure some of it gets through. For a successful delivery, a crew will receive 5,000 credits plus a bonus of additional 5,000 if they reach the Destination: Adventure! first. Each grew also receives a coded datapad, called \"Envelope\", that contains the first set of coordinates."}, {"tag": "p", "text": "This whole competition is actually the test to find new possible recruits for the Black Sun. Kalend Thora will only participate in the race to evaluate the other smugglers."}, {"tag": "h3", "text": "Episode Two: The Test begins"}, {"tag": "p", "text": "The first set of coordinates brings the smugglers to the Novolek Beacon, where they have to evade the dangers of the pulsar to reach a comsat. Once at the comsat, the broadcast will trigger the Envelope to open up a second message. It say that the next station is Nwarcol Point, where the smugglers would receive their cargo. At this stage, Kalend Thora is in the lead."}, {"tag": "p", "text": "The Envelope reveals that the characters can dock at Docking Bay 12: 421 and that the coordinates for the Destination: Adventure! would be revealed in thirty minutes. That means that the first ship at Nwarcol Point is also the first ship to receive the new coordinates."}, {"tag": "p", "text": "After around fifteen minutes a human named Nile Audo approached the character's ship together with a labor droid hauling a two-by-three meter box. After loading the cargo into the ship and a successful departure, the characters intercept a message from Az-Iban to the surviving Disac pirates, shortly before he jumps to hyperspace. He reveals to be Morturr Heth and transmits the coordinates of the Destination: Adventure!, calling to steal the rest of the cargo as well as the luxury liner."}, {"tag": "h3", "text": "Episode Three: Crying Wolf"}, {"tag": "p", "text": "Once the characters emerge from hyperspace, they found themselves under the attack of the remnants of the Disac pirates. However and Imperial patrol, consisting of a Guardian-class light cruiser and six TIE/LN starfighters and on the Black Sun's payroll is there to deal with any trouble. Mal Biron, who awaits the smugglers on the Destination, offers them a little downtime on the house as well as the payment. Depending on the character's position and behavior during the battle, they receive the appropriate reward."}, {"tag": "p", "text": "In the lounge of the Destination, the Givin smuggler Helrot approaches the characters with an offer: If they steal and combine several of the delivered cargo pods, they could make a profit of 10,000 credits. Depending on the character's action, they either make friends or enemies with Mal Biron and the Black Sun. It is also revealed that the cargo consisted of Mag pulse warheads."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Sources"}]}