{"url": "Rule_of_One", "categories": ["Category:Legends articles", "Category:Sith culture"], "nodes": [{"tag": "h1", "text": "Rule of One"}, {"tag": "p", "text": "The Rule of One was the name of a Sith doctrine developed by Darth Krayt and followed by the One Sith. Darth Krayt's doctrine, as followed by the One Sith focused, in stark contrast to the core tenets of the old Sith, on obedience rather than conflict and survival of the strongest, with many Sith following one leader and purpose."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "When Darth Krayt founded his new Sith Order, he abolished Darth Bane's Rule of Two, a dictate which commanded that there should be only two Sith at any one time; a master and an apprentice, one to embody the power of the dark side, the other to crave it. Instead, there would be the Rule of One—that One being the Sith Order itself, under which there would be many minions, acolytes/adepts and lords with only one Dark Lord of the Sith. Darth Krayt believed he gave the Sith and their power a purpose, unlike Darth Bane who believed that power was its own purpose."}, {"tag": "p", "text": "Under the Rule of One, the followers of Krayt were taught blind obedience and absolute loyalty to the Dark Lord of the Sith, instead of the plotting and infighting of previous Sith organizations. Similarly to the Jedi Order, Sith Masters trained a single apprentice. However, after their training was completed, apprentices were required to slay their Masters as a test of their allegiance to the Dark Lord, just like in the past Sith Order acolytes were required to kill someone to whom they were attached or close to seal their transition to the dark side. Masters who deemed their apprentices ready would allow themselves to be killed, as long as it was on Krayt's orders."}, {"tag": "p", "text": "The new Sith also mirrored the Jedi in that, while they did rely on passion, hatred and aggression, they did not seek power for themselves alone, but to serve the will of the Dark Lord and impose his order on the galaxy by any means necessary. Instead of reducing the number of Sith to prevent the Order from destroying itself, Krayt altered the Sith philosophy. He claimed he gave power purpose. With the numbers as great as they were before the previous Rule's establishment, it allowed the Sith to match up in numbers with the Jedi. But the ancient image of Bane insisted that the Rule of One would be the Order's downfall and it would turn on Krayt."}, {"tag": "p", "text": "This would eventually prove true, for in Krayt's quest to sustain his life, several of his followers began to question him. In order to ensure Darth Krayt's vision of a galaxy united under the rule of the Sith, Darth Wyyrlok III assassinated the Dark Lord as his quest to heal himself had distracted Krayt from his own plans, which Wyyrlok intended to carry out in his place."}, {"tag": "p", "text": "However, contrary to Bane's prediction, Darth Krayt was not finished, and was able to revive himself with his knowledge of Dark transfer gleaned at the edge of death, making himself whole. Challenging and slaying his usurper in a duel for control of the order and his strength proven to the Sith, Krayt resumed leadership of the One Sith unchallenged. He refocused his efforts to continue the One Sith's vision of a united galaxy; this time through war and destruction, until he met his true death in the Battle of Coruscant."}, {"tag": "p", "text": "Upon Krayt's death Darth Nihl assumed control of the One Sith as the new Dark Lord and, in accordance with the Rule of One, followed him as he ordered them into the shadows once more."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}