{"url": "Ruwee_Naberrie/Legends", "categories": ["Category:Legends articles", "Category:Educators", "Category:Galactic Republic individuals", "Category:House Naberrie", "Category:Humans", "Category:Males", "Category:Naboo"], "nodes": [{"tag": "h1", "text": "Ruwee Naberrie"}, {"tag": "p", "text": "Ruwee Naberrie was a Human male from the Mid Rim planet Naboo. He was the son of Winama Naberrie, the husband of Jobal Naberrie, and the father of Sola Naberrie and Padmé Amidala. He was also the maternal grandfather of Ryoo and Pooja Naberrie, as well as twins Luke Skywalker and Leia Organa Solo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born in 77 BBY to a cloth weaver named Winama Naberrie, Ruwee inherited from his mother a great sense of compassion and empathy that he would eventually pass down to his children."}, {"tag": "p", "text": "In 51 BBY, Ruwee married a young woman named Jobal. Their respective mothers were very close friends and had secretly plotted to marry off their children. Ironically, the two women were the first to be surprised when Ruwee and Jobal actually fell in love with each other. After getting married, the young couple helped build their village in the mountains. Like her husband, Jobal was very generous and compassionate. While Ruwee donated his skills as a builder, Jobal fostered the village's community spirit. His wife eventually became pregnant—first with Sola, then four years later, with Padmé."}, {"tag": "p", "text": "Ruwee was also a volunteer worker in the Refugee Relief Movement—having joined the organization at the age of ten—where his younger daughter Padmé would later follow in his footsteps. He eventually became President of the RRM, and addressed the Galactic Senate from the box of then-Senator Palpatine about refugees of groundquakes on Sev Tok. He became close personal friends with Senator Onaconda Farr, who agreed with his cause, and was his strongest ally in the senate. In addition to his role in the RRM, Ruwee had been a frequent guest lecturer on microeconomics at Theed University before becoming a teacher."}, {"tag": "p", "text": "When his daughters were still young, Padmé received impressive scores to an aptitude test. Ruwee and Jobal therefore decided to leave their beloved mountain village and took their family to live in Naboo's capital city, Theed, where they hoped there would be more opportunities for Sola and Padmé."}, {"tag": "p", "text": "In 33 BBY, Ruwee and his wife, along with Padmé and their daughter's friend Ian Lago, were busy gathering food supplies at the RRM's Coruscant headquarters for the planet's lower-tier dwellers. Ruwee was not really enthusiastic about his daughter's relationship with Ian, as he was the son of Kun Lago, King Veruna's Prime Counselor. The Naberries also had the surprising visit of Senator Palpatine who had come to try and convince the couple to have Padmé run for the throne. Ruwee and Jobal were hesitant at first, not wanting their just-turned-thirteen-year-old daughter to go through all of this and lose."}, {"tag": "p", "text": "After being Princess of Theed for two years, Padmé was elected Queen of Naboo with a landslide victory. During the Trade Federation's invasion of Naboo, Ruwee and Jobal were arrested and sent to jail. They were deeply worried about their daughter, who was temporarily forced to leave Naboo. When Padmé stepped down eight years later and subsequently became the Senatorial representative of the Chommell sector, Ruwee stayed in touch with the new queen, Jamillia, in order to get the latest news from Coruscant."}, {"tag": "p", "text": "In 22 BBY, several assassination attempts were made on Padmé. Ruwee could not help but be afraid for his daughter's safety, but always tried to hide his feelings in order to alleviate his wife's own anxiety. In the same period, Ruwee had the occasion to meet his future son-in-law, Anakin Skywalker. Ruwee immediately noticed Skywalker's deep feelings for Padmé and, as a result, took a liking to the young Jedi."}, {"tag": "p", "text": "Three years later, Ruwee, along with his family and thousands of other mourners, attended Padmé's funeral, shortly after the Clone Wars had ended."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ruwee Naberrie was portrayed by Graeme Blundell in deleted scenes of Star Wars: Episode II Attack of the Clones, as well as in a brief scene of Star Wars: Episode III Revenge of the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}