{"url": "Ruwee_Naberrie", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:House Naberrie", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ruwee Naberrie"}, {"tag": "p", "text": "Ruwee Naberrie was a human male and a member of the Naberrie family. He was the father of Sola Naberrie and Padmé Amidala. During his lifetime, his strongest ally in the Galactic Senate was Onaconda Farr of Rodia. His daughter Padmé became elected queen and later member of the Senate of the Galactic Republic for their homeworld."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Son of a cloth weaver in the Naberrie family, Ruwee married a woman named Jobal at some point. They had two daughters, Sola and Padmé. To live with his family, Ruwee built with his own roughened hands a stone house. He held careers as an educator, builder, and relief worker."}, {"tag": "p", "text": "Sometime later Ruwee met Senator Onaconda Farr of Rodia, who became his strongest ally in the Galactic Senate."}, {"tag": "p", "text": "When Padmé turned fourteen years old, she was elected Queen of Naboo and adopted the name of \"Padmé Amidala.\" Successful and well-liked, she served two two-year terms, including during the Invasion of Naboo. Though she'd planned to retire from public life, Padmé was asked by her successor, Réillata, to represent Naboo in the Senate. That same day she informed Ruwee and Jobal of her decision."}, {"tag": "h3", "text": "Death of Padmé"}, {"tag": "p", "text": "Following the end of the Clone Wars and the execution of Order 66, Ruwee attended the funeral of Padmé with Jobal and Sola after her death on Polis Massa."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ruwee had ruddy cheeks along with blue eyes and dark hair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ruwee wore a somber black and dark red robe to his daughter's funeral, with the dark tones reflecting the family's sadness and mourning at Amidala's death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ruwee Naberrie was portrayed by Graeme Blundell in Star Wars: Episode II Attack of the Clones and Star Wars: Episode III Revenge of the Sith."}, {"tag": "p", "text": "During the filming of Attack of the Clones, Blundell traveled to Lake Como, Italy in order to shoot his scenes as Ruwee Naberrie, but all his scenes were deleted from the film's final cut. His scenes at the end of Revenge of the Sith, however, remained unchanged and made it into the finished version of the film."}, {"tag": "p", "text": "Ruwee's card from the digital card game Star Wars: Force Collection erroneously lists him as Qui-Gon Jinn's father."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}