{"url": "Ruurian/Legends", "categories": ["Category:Legends articles", "Category:Insectoid sentient species", "Category:Outer Rim Territories species", "Category:Ruurians"], "nodes": [{"tag": "h1", "text": "Ruurian"}, {"tag": "p", "text": "The Ruurians were an insectoid species native to Ruuria. They generally avoided taking risks. Their government was the Unified Ruurian Colonies. On the planet Ruuria, the Ruurians' society comprised 143 colonies, and every Ruurian belonged to a single colony for life."}, {"tag": "h2", "text": "Life stages"}, {"tag": "p", "text": "Ruurians went through three stages during their lives."}, {"tag": "h4", "text": "Stage one"}, {"tag": "p", "text": "They were born as fourteen-legged larvae with each leg having four opposable fingers. First stage Ruurians also had fine, wide antennae on their heads, and large, multifaceted eyes. The larval Ruurians were also the most intelligent, artistic and creative members of the species, and were responsible for running Ruuria."}, {"tag": "h4", "text": "Stage two"}, {"tag": "p", "text": "The second stage of Ruurian life was the pupa stage. The larvae spun cocoons around themselves, and were transformed into the third stage of the Ruurian life cycle, the beautiful Chroma-Wing Fliers."}, {"tag": "h4", "text": "Stage three"}, {"tag": "p", "text": "The third and final stage of Ruurian life was the Chroma-Wing Flier stage. Stage three Ruurians were simple-minded creatures only interested in eating, flying and mating. They also had no interest in working."}, {"tag": "h2", "text": "Ruurians in the galaxy"}, {"tag": "p", "text": "The Ruurians established a number of colonies in the galaxy that functioned as independent units. Many of these were joint efforts with other species. These were known as the Ruurian independent colonies. Three of these colonies, and the homeworld of Ruuria, pledged their support to \"Grand Admiral Thrawn\" during the Caamas Document Crisis. They signed a fully executed treaty between their systems and the Empire after \"Thrawn\" repelled a Diamala attack. It turned out this Thrawn was actually an impostor, Flim, an actor used in an attempt to revitalize the waning Imperial Remnant."}, {"tag": "p", "text": "These colonies were led by a female Ruurian, Amisus. She was the daughter of the historian Skynx—perhaps the most notable Ruurian. In 2 BBY he assisted Han Solo on an adventure to Dellalt, in search of the treasure of Xim the Despot. Together they found his flagship, the Queen of Ranroon and the remains of his war droid army."}, {"tag": "p", "text": "During the Yuuzhan Vong War, many Ruurians were displaced and traveled as refugees along the Hydian Way. A number passed through the Jubilee Wheel, while others found their way to Ruan. There, some were taught Basic as part of a re-settlement attempt, along with other species such as Dugs."}, {"tag": "p", "text": "In 28 ABY, Han Solo met a larval-stage Ruurian bounty hunter in The Thorny Toe on Onadax that he beat at sabacc. The two got into a brawl when the Ruurian accused Solo of cheating."}, {"tag": "p", "text": "An early famous Ruurian was Shimer Londalin, who won—in a holocam finish—the \"decaped-plus\" category of the Mobquet Presents: Fastest Land Beings event held on Teyr in 22 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}