{"url": "Ruusan_Reformation", "categories": ["Category:Legends articles", "Category:Galactic Republic events", "Category:Jedi", "Category:Political events"], "nodes": [{"tag": "h1", "text": "Ruusan Reformation"}, {"tag": "p", "text": "The Ruusan Reformation was an event that restructured the entire Galactic Republic following the New Sith Wars, taking power away from the Supreme Chancellor and reinvesting it in the Galactic Senate."}, {"tag": "h2", "text": "Reformation"}, {"tag": "p", "text": "The reforms were enacted by then-Chancellor Tarsus Valorum and also resulted in the Republic Measures & Standards Bureau resetting the year zero to the year of the Seventh Battle of Ruusan, which would come to be known as 1000 BBY by the Galactic Standard Calendar."}, {"tag": "p", "text": "The system of government did not seem to change too dramatically (as the Republic had been ruled by a Supreme Chancellor and the Galactic Senate as early as 15,000 BBY) but the Jedi Order underwent a significant adjustment. In symbolic measures, largely to convince the Republic that they would not become a conquering army, the Jedi abandoned their battle armor, renounced all military ranks (such as \"Jedi Lord\"), dissolved their commander-in-chief, disbanded their army, naval and starfighter forces, and placed themselves under the supervision of the Supreme Chancellor and the Judicial Department, effectively dissolving the Military. In order to lessen the chance of a Sith resurgence, the Order began training children from birth. In addition, the training of Padawans was centralized on Coruscant, to remove the danger of unsupervised students delving into forbidden Sith knowledge."}, {"tag": "p", "text": "Politically, however, the Reformations did affect representation within the Senate. In an effort to remove corruption and decentralize power away from a few powerful Coreward sectors that held the most representation, Valorum took the then-existing millions of sectors and reorganized them into only 1,024 sectors. Each of the new sectors were granted its own Senator, although a few exemptions were made for politically powerful core worlds to retain their individual representation. Other slots, such as those for species types and cultural entities were also granted. The Reformation Act was a critical piece of legislation."}, {"tag": "p", "text": "The Reformation put an end to the Republic Dark Age. It was considered to be the start of the Golden Age of the Old Republic. In some cases, such as Palpatine's Declaration of a New Order marking the transition of the Old Republic to the Galactic Empire, this event was even marked to be the \"official\" founding of the Old Republic."}, {"tag": "p", "text": "Simultaneously, Darth Bane's Sith Order also underwent its own reformation, reorganizing into the Rule of Two."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ruusan Reformation was introduced in the timeline in order to explain several differences between the Old Republic as presented in the comics, and the one which appeared in the prequel trilogy."}, {"tag": "p", "text": "In the Expanded Universe, the Republic is well established to be extant for 25,000 years, based on Obi-Wan Kenobi's line in A New Hope that the Jedi had been \"the guardians of peace and justice in the Old Republic\" \"for over a thousand generations.\" For a long time, EU sources were the only works set during the Republic era—most notably the popular Tales of the Jedi sagas. However, in Attack of the Clones, Palpatine mentioned the Republic had \"stood for a thousand years.\" This at first seemed to conflict with both the C-canon EU history and the G-canon internal continuity in the films. However, the Ruusan Reformation—in which the Republic is reorganized following the already-established defeat of the Sith a thousand years prior to the films at the Seventh Battle of Ruusan—was invented by subsequent writers to give an alternate explanation on Palpatine's line, thus bringing all these sources into relative harmony through a retcon. It also explains how Sio Bibble could claim, in Attack of the Clones, that there had not been a full-scale war since the formation of the Republic."}, {"tag": "p", "text": "The necessity of the \"Ruusan Reformation\" remains a topic of much debate, Palpatine's statement that the Republic had \"stood for a thousand years\" might have been hyperbole - in other words the equivalent of saying the Republic had \"stood forever\" and was not meant to be taken literally. Given Palpatine's nature as a politician, prone to making grandiose statements and generalizations, gives great weight to this argument. Sio Bibble's remark could also be taken the same way, he may not have considered the Expanded Universe earlier wars as \"full-scale\" or alternatively there could have political revisions to the official Republic history (such as there are in real life) that could have led to majority public opinion that there had been no earlier wars, when in fact there had been."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}