{"url": "Ruugar", "categories": ["Category:Legends articles", "Category:Captains", "Category:Humans", "Category:Males", "Category:Pirates", "Category:Ravagers members"], "nodes": [{"tag": "h1", "text": "Ruugar"}, {"tag": "p", "text": "Ruugar was a male Human Captain of the Ravagers pirate gang on Rishi during the Galactic War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born into Ravagers, he dreamed of being a captain since his young, unforgiving years. In his adulthood, he used his charm to obtain loyalty of other pirates and performed a near-bloodless mutiny against the captain O'kar A'ko. As the new captain, Ruugar claimed the longest tenure of all Ravagers captains, and the Ravagers base was named Ruugaria in his honor. Ruugar's days as the captain ended when his first mate Coratanni sliced off his arm and a leg and threw him overboard to angry Skar'klas. Ruugar survived, replaced his missing limbs with cybernetics, and spend years living on Rishi while plotting his revenge. In 3637 BBY he approached a group of individuals in Raider's Cove, promising them to make the Ravagers work for their faction if they helped him reclaim his former position, though never intending to keep his word. Ruugar provided the group with access to Ravagers base in Coratanni Town, where after defeating Sparky and Quartermaster Bulo they cleared the path to the Soaring Duros. Once onboard, Ruugar took the ship to the skies and announced to the crew that he has returned as their captain. The ship engaged Coratanni's flagship Pearl's Girl in combat and the group shuttled onborad, killing Coratanni after a prolonged fight. Ruugar then announced his true intentions and tried to dispose of the group, but was overwhelmed and killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ruugar appears in the Star Wars: The Old Republic: Shadow of Revan expansion, released on December 2, 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}