{"url": "Rwookrrorro/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Capital cities", "Category:Cities on Kashyyyk"], "nodes": [{"tag": "h1", "text": "Rwookrrorro"}, {"tag": "p", "text": "Rwookrrorro was the capital city of the planet Kashyyyk. Founded thousands of years before the Galactic Civil War, this metropolitan center of the Wookiee homeworld was a kilometer-wide platform nested high atop a tangle of huge trees. Among Rwookrrorro's most famous citizens were Zaalbar, who aided the former Sith Lord Revan in his quest to find the Star Maps, and Chewbacca, one of the Heroes of Yavin."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Jedi Civil War"}, {"tag": "p", "text": "During the Jedi Civil War the city was run by Chuundar, who was involved with Czerka slavers. During Revan's search for the Star Maps he entered a Czerka spaceport not far from the city. As he prepared to enter it he was stopped by a guard and his Wookiee companion Zaalbar was captured. Chuundar held Zaalbar captive until Revan could journey into the Shadowlands to kill a Madclaw. During his journey into the Shadowlands he met Jolee Bindo, a Jedi who helped him find the Star Map, and the madclaw, who turned out to be Freyyr."}, {"tag": "p", "text": "When Revan returned to the city, Freyyr was confronting Chuundar, as they argued, Revan convinced Zaalbar to side with Freyyr, together they teamed together to defeat Chuundar, his followers, and his Czerka allies. After the battle, Zaalbar left with Revan to continue his life debt and was rewarded with Bacca's Ceremonial Blade. The Wookiees drove the Czerka slavers out of Rwookrrorro, and the city was freed from slavers."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the time of the Jedi Civil War, Rwookrrorro was little more than a tree-top village, but over time it expanded to become Kashyyyk's most prominent settlement and spaceport."}, {"tag": "p", "text": "Rwookrrorro, as of the Galactic Civil War, comprised a kilometer-wide platform supported within a tangle of wroshyr trees. Thanks to their knowledge of technology, the Wookiees further supported this natural nest with repulsorlifts. Primitive-looking huts lined the edges of Rwookrrorro's streets, while a huge, hollowed-out branch served as a hidden hangar for offworlders looking to evade Imperial entanglements. Lift cars were used to traverse the levels of the Wookiee trees. The Rryatt Trail led from the city to the Well of the Dead."}, {"tag": "p", "text": "During the Battle of Kashyyyk following the end of the Clone Wars, Rwookrrorro was severely damaged by orbital bombardment from Star Destroyers. The tree-city was also the home of Chewbacca and his family."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chewbacca's home city first appeared in the 1978 TV movie The Star Wars Holiday Special, albeit unnamed. A shot of Han Solo's Millennium Falcon flying over the canopy of the city was included in the special. The forests of Kashyyyk featured in the movie were in fact that of the Tikal site, a ruined city of the Maya civilization. The same location had been used one year earlier to portray the landscape of the jungle moon Yavin 4 in the first Star Wars movie, Star Wars: Episode IV A New Hope. Tikal Temple III can be spotted in the background of the shot."}, {"tag": "p", "text": "When writing Heir to the Empire, author Timothy Zahn planned Rwookrrorro to be the name of the Wookiee homeworld. When he was told that it had already been named \"Kashyyyk\", he suggested that Rwookrrorro could be the indigenous Wookiee name, but this idea was rejected. Zahn re-appropriated the name for a city on Kashyyyk instead. Rwookrrorro later appeared in additional Star Wars media. Rwookrrorro was also mentioned in the 2001 comic What They Called Me."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}