{"url": "Ryle_Torsin", "categories": ["Category:Canon articles", "Category:Gold Squadron personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ryle Torsin"}, {"tag": "p", "text": "Ryle Torsin was a human male who served as a pilot in the Alliance to Restore the Republic. While in the Rebel base on the planet Dantooine, he discovered an Imperial tracking device in a delivery of equipment. This led to the base being evacuated. In 0 BBY, Torsin was stationed in the Alliance's new base in the Great Temple on the moon Yavin 4. When the Empire's Death Star superweapon entered the Yavin system to destroy the base, Torsin piloted a BTL-A4 Y-wing assault starfighter/bomber as part of Gold Squadron in the Battle of Yavin. Torsin was killed along with all but one member of his squadron, but the Alliance managed to successfully destroy the Death Star."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Ryle Torsin served as a volunteer pilot in the Alliance to Restore the Republic's Starfighter Corps of  during the Imperial Era. He spent time at the Alliance's first headquarters, which was established on the planet Dantooine. The base was intended to be temporary, but its use continued and security grew lax until Torsin eventually discovered an Imperial tracking device hidden in a delivery of equipment. The device was destroyed and the base was immediately evacuated, although unbeknown to the Rebels, the device had actually failed and the Empire remained unaware of the Dantooine base."}, {"tag": "p", "text": "The Alliance soon created a new headquarters in the Great Temple on the moon Yavin 4 where Torsin was stationed. In 0 BBY, the Empire learned of the new base's location and the Death Star superweapon was sent to the Yavin system to destroy it. The Alliance had learned of a vulnerability in the weapon's design and mounted an attack on it consisting of three starfighter squadrons. During the battle, Torsin flew one of the eight BTL-A4 Y-wing assault starfighter/bombers that made up Gold Squadron under the command of Captain Jon Vander. He climbed into the vehicle in the hangar of the Great Temple before being handed his his K-22995 light flight helmet by a member of the ground crew. The Alliance successfully destroyed the Death Star, but Torsin was killed along with six other members of the squadron, leaving only Lieutenant Evaan Verlaine as a survivor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Torsin had brown hair, blue eyes, and light skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ryle Torsin wore an orange flight suit with white harnesses and a K-22995 light flight helmet. He piloted a BTL-A4 Y-wing assault starfighter/bomber during the Battle of Yavin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ryle Torsin first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. According to fan site Aveleyman, he was portrayed by John Ketteringham. In the new Star Wars canon he was first identified in the 2015 magazine Star Wars: Build the Millennium Falcon 37. The character was previously identified in the Star Wars Legends continuity, although with the spelling \"Ryle Torsyn\", which was first used on a card in the 1998 \"Special Edition Limited\" expansion to the Star Wars Customizable Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}