{"url": "Rybet/Legends", "categories": ["Category:Legends articles", "Category:Amphibian sentient species", "Category:Hutt Space species", "Category:Oviparous species", "Category:Rybets", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Rybet"}, {"tag": "p", "text": "The Rybet were a species of sentient amphibians. Some aspects of their life cycle resembled those of insects."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Rybets are a soft-skinned, squat amphibian race with Batrachian (frog-like) morphology. The lips of the mouth had a tendency to be swollen yet flexible. The fingers of the hands and toes of the feet tend to be relatively long, with splayed digits. The hands possess webbing, and vestigial suction cups at the tips. The palms of the hand had a tendency to be clammy due to these structures. The eyes tend to be bulbous, and possess vertical slits in the pupils. The eyes possess a toughness or insensitivity to touch sufficient so that a Rybet would have no issue touching its eyes as it would its own face. The cranial area of the Rybet is hairless, like the rest of the skin covering the body, and so smooth as to appear slimy. Rybet tongues are sharp long thick and shades of purple in color."}, {"tag": "p", "text": "Rybets enjoyed eating large flying insects, spearing them with their sharp long dexterous tongues which they could launch from their mouths for this very purpose. The tongue also served as a sensory organ. The action of flicking the tongue in and out allowed the Rybet to detect odors or pheromones in the air. When nervous or fearful, Rybets instinctively flicked their tongues rapidly to gather more sensory data of their surroundings."}, {"tag": "p", "text": "Rybet females laid leathery egg sacks, which young Rybets emerged from the as larva. These larva were born blind, resembling large caterpillars with four dexterous slender arms tipped with hands capable of fine motor skills. After a season of time the larva matured, shed its skin, and metamorphosed into an adult, similar to an insect."}, {"tag": "p", "text": "Rybet females were typically larger than the males, with an average height between 1.5 and 1.9 meters for the females and 1.2 and 1.5 meters for the males."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Males, of the species, when both physically and mentally motivated, will wear a bright yellow cravat (scarf) about the neck, as a display of mating readiness. Rybets are an opportunistic species, well-suited for a nomadic lifestyle in space. Typically, they had a rather questionable grasp of morals and ethics, if any."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Rybet claimed to have evolved on Varl, and that the planet's destruction was the result of a war they waged with the Hutts. They also claimed that they would eventually defeat the Hutts and reclaim their home. The Hutts found this mildly amusing, while most scientists disputed the claim."}, {"tag": "p", "text": "Xenobiologists estimated that fewer than a billion Rybet existed in the galaxy, possibly due to the pathological hatred male Rybet had for female Rybet and vice versa. The only thing that allowed them to overcome this was their overwhelming urge to mate and reproduce, which happened only once every ten years after reaching adulthood. Moruth Doole, the Rybet administrator of Kessel after the Battle of Endor, kept a harem of Rybet females to mate exclusively with, but this appears to have been not only an aberration, but a matter of opportunism rather than mating urge (since he used his young as cheap labor before killing them while they were still young)."}, {"tag": "p", "text": "During the Clone Wars, a a Rybet male named Feno Gamoc served as the senior engineer aboard the Confederacy of Independent Systems Munificent-class star frigate Sa Nalaor. Near the end of the war, the Sa Nalaor crashed on Cholganna, stranding the crew on the forested world. Gamoc was one of the survivors who helped establish the Retreat, and by the time of the Galactic Civil War, Gamoc was one of only thirty crew-members still alive."}, {"tag": "p", "text": "The only time where a male and female Rybet lived together for any length of time were in the first years of raising their young. Females typically raised a clutch of three to eight eggs. For the first year or two, the parents would stay together, slaving their starships together and taking their parts in raising the young. This arrangement didn't last long, however—after the first one or two years, the male either left or else would find himself dead or severely maimed."}, {"tag": "p", "text": "This arrangement may sound disadvantageous to the young, but Rybet young matured quickly, ready to make their own way by age five. The mother would unceremoniously toss them off the ship at this time, leaving them to figure things out on their own, though in the case of females that killed their male mate, the mother would typically sell the dead male's ship and give the young the resulting credits as start-up money."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although the hands of Rybets are described as being webbed in both Jedi Search, and X-Wing: Wedge's Gamble, no published artwork of Rybets depict this feature of the species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}