{"url": "Rynalla", "categories": ["Category:Legends articles", "Category:Archaeologists", "Category:Females", "Category:Force-sensitives", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Rynalla"}, {"tag": "p", "text": "Professor Rynalla, sometimes known as \"Profex Rynalla\", was a female Human Dark Side Adept, archaeologist and scholar, affiliated to the University of Sanbra. While excavating the planet Leritor in search of a Sith artifact, she sparked a war between a group of Human colonists and the native Sauvax."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Human female, Rynalla was a scholar affiliated with the department of ancient history of the prestigious University of Sanbra. She was an expert in galactic history, archaeology, and the lore of several traditions of Force-users, including the Jedi Order, the Sith, in addition to bygone organizations. Secretly, Rynalla researched the Sith and traditions of the dark side to increase her own powerss of the Force."}, {"tag": "p", "text": "While researching in the University records, Rynalla discovered that a missing Sith treasure, the Bracers of Najus, had been lost in a Sith starship which had crash-landed on the planet of Leritor. The Bracers could be used to increase the power of the dark side, and she coveted the relic. She hired two dozen Klatooinian soldiers and went to Leritor in her bulk freighter, with her two PTR-3 Vedette snub fighters in tow. On arrival, Rynalla found the Sith starship half-buried in the local mountain range known as the Bleaks; she quickly organized a dig site using prefabricated buildings. Noticing two main groups in the planet, the Human settlers who farmed the inland prairies and the native Sauvax living the coast, she decided to capture strong individuals from each group and use them as slave miners to uncover the ship."}, {"tag": "p", "text": "Rynalla's forces raided one of the massive harvester machines used by the farmers, the nearby Nellist. The stronger colonists were captured and the weaker ones were murdered with the traditional Sauvax weapon, the gruush, so that other on-world Humans would blame the Sauvax, even if a more detailed analysis would have proved otherwise. Similarly, the Klatooinians also assaulted a Sauvax community, called a kuuvan, again executing the feeble and conscripting the powerful. They used blasters, so that the Sauvax in other kuuvans would suspect that the Human farmers were behind the incursion. Thus Rynalla manufactured a war among the Sauvax and the farmers, keeping them busy while she plundered her prize."}, {"tag": "p", "text": "In all, fifty Human and Sauvax prisoners were captured. They were put to work, with the amphibious Sauvax in the deepest submerged decks of the ship, and always watched by armed Klatooinians. Rynalla did not tell the captives what she was looking for, but every two days, she evicted the exhausted laborers while she looked for the Bracers and the Klatooinians looked for any attempt to create an escape tunnel. Rynalla's disposal of waste polluted a nearby river, a change that was being noticed by several local Sauvax. She was certain, however, that nobody would imagine that she'd created a slave camp. More worried about fugitives than intruders, Rynalla organized a second, smaller camp near the edge of the mountain, to stop and execute any runaways; five such individuals met their end there."}, {"tag": "p", "text": "A Sauvax kuuvan led by their tevelor, mistakenly believing that the farmers intended to exterminate their species, surrounded the combine-reaper Gevion and demanded an explanation. As the farmers believed that the Sauvax were an aggressive, murderous species, they were too wary to send an envoy; in a stalemate, the Sauvax refused to allow the Gevion collect its crop. This situation would have escalated into war, but a group of offworlders heard a distress call from the Gevion and offered to mediate. These individuals began investigating and soon found a trail to Rynalla's camp. Rynalla found the Bracers of Najus just in time to face the intruders. She was eventually defeated, however, and peace was restored to Leritor."}, {"tag": "h2", "text": "Appearances"}]}