{"url": "Ryloth_government", "categories": ["Category:Canon articles", "Category:Stub", "Category:Outer Rim Territories governments", "Category:Planetary governments"], "nodes": [{"tag": "h1", "text": "Ryloth government"}, {"tag": "p", "text": "The Ryloth government, also known as the Rylothian government, was the planetary government of Ryloth—homeworld of the near-human Twi'lek species in the galaxy's Outer Rim."}, {"tag": "p", "text": "Formed in the aftermath of the Galactic Civil War, the newly independent Ryloth chose not to join the New Republic—the galactic government at the time—but instead to be an independent and neutral world. It was led by Chancellor Drelomon during the war between the First Order and the Resistance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the end of the Galactic Civil War, the Twi'lek home planet of Ryloth became an independent government instead of joining the New Republic. During the New Republic Era, Ryloth's economy came under threat from the Nikto crime lord Rinnrivin Di's cartel. Their activities had a heavy toll on Ryloth's offworld shipping due to sporadically-enforced New Republic financial regulations, and the infrequent patrols of the shipping lanes, due to rampant political bickering. Emissary Yendor traveled to the New Republic capital on Hosnian Prime to raise the issue to the Galactic Senate."}, {"tag": "h2", "text": "Defense"}, {"tag": "p", "text": "The command organization called Lessu command, a government agency who oversaw the defense of both Ryloth planetary and wider system which was based in the Lessu, the capital city of Ryloth. They used Can-Cell class fighters."}, {"tag": "p", "text": "The unofficial Ryloth Defense Authority, or RDA, also operated to defend Ryloth, who sought to keep Ryloth from oppression and slavery with the knowledge of the Ryloth government, though also acted independently as a supplemental militia. It saw itself as the philosophical descendant of the freedom fighter Cham Syndulla's Free Ryloth Movement."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}