{"url": "Ryloth%27s_nearest_moon", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Moons of Ryloth", "Category:Rocky moons"], "nodes": [{"tag": "h1", "text": "Ryloth's nearest moon"}, {"tag": "p", "text": "The nearest moon of Ryloth was one of the planet's five moons. A desolate, rocky moon with a breathable atmosphere, shortly after the formation of the Galactic Empire members of the Free Ryloth Movement arranged a rendezvous there to pick up illegal weapons they had purchased."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ryloth's nearest moon was a desolate, rocky body with an atmosphere breathable to humans and Twi'leks. From a distance, the moon appeared as a hazy grey sphere. One of five moons orbiting Ryloth, it was located in the Ryloth system of the Outer Rim Territories' Gaulus sector, at grid coordinates R-17. Like its planet, the moon was located on the Corellian Run and Mumble's Turnaround hyperspace routes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 19 BBY, the galaxy-spanning Clone Wars came to an end with the reorganization of the ancient Galactic Republic into the Galactic Empire. Although the change was claimed to be a return to peace, prosperity, and safety for the galaxy, the truth was that it was a meticulously planned seizure of power by the new Emperor Palpatine. Some saw through the façade immediately and began to plan against the Empire. Former Twi'lek freedom fighter General Cham Syndulla, who had fought against the Separatist invasion of Ryloth during the war, was not initially among them, as he wanted peace for his homeworld and for his daughter Hera to not have to live a life of fighting. Cham's lieutenant Gobi Glie was suspicious, however, believing that his general was seeing what he wanted to see, and began organizing with other former fighters. Glie also brought Hera into his group, believing that she should be prepared to fight."}, {"tag": "p", "text": "The Empire had requested that the Twi'leks disarm and turn in their weaponry, promising that their military would protect Ryloth. Believing this left them vulnerable, Glie arranged to purchase more weapons from the information broker Cid, with a rendezvous scheduled on the nearest moon. When Glie and Serin were preparing to leave in Glie's Rainhawk-class transport, Hera initially turned down an offer to come along as she had recently been caught trespassing near the new Imperial doonium refinery. However, she changed her mind when Glie said he had been going to let her fly. When the starship took off, however, the Elite Squad Trooper Commander CT-9904, who had been spying on the landing pad, tagged it with a homing beacon."}, {"tag": "p", "text": "Hera flew the transport most of the way to the moon, but Glie had Serin take over for landing as he believed that Hera was not yet experienced enough to handle takeoffs and landings. Serin checked the ship's sensors and reported that their contact was already approaching, before they landed in a small plain on the moon. Cid had sent the Bad Batch, a squad of former clone commandos who now worked for her as mercenaries, to deliver the weapons, and their shuttle, the Havoc Marauder, flew in over the nearby hills before swinging around for a landing. The clones disembarked, bringing along the crates of blasters and thermal detonators Cid had sent."}, {"tag": "p", "text": "While Hunter talked to Glie, who wanted to inspect the weapons before handing over payment, Hera wandered over to the Marauder, curious. She asked Omega, a young clone who had joined the Batch when they defected from the Empire, about the ship, and the girl got permission from Hunter to show Hera around. Once Glie and Serin had inspected the weapons to their satisfaction, he handed over the case with the payment to Hunter, telling him to tell Cid to let him know when she had more to sell. Hunter commented that building up an arsenal would attract attention and that Glie had better know what he was getting into, and Glie replied that he had no choice. Hera and Omega disembarked the Marauder as Glie called that they had to leave, and Hera said goodbye to Omega before running back to the Rainhawk. When Hunter asked Omega if she had made a new friend, Omega said she liked Hera but thought she was a bit strange. The Twi'leks departed the moon and returned to Ryloth, but were ambushed by Imperial forces due to the homing beacon planted on their ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ryloth's nearest moon first appeared in the Star Wars: The Bad Batch episode \"Devil's Deal\". The official Databank entry for Gobi Glie's starship refers to it as \"Ryloth's moon\" as if it were the only one, even though there are other moons visible in the episode itself and other media had established Ryloth having five moons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}