{"url": "Bafforr_tree", "categories": ["Category:Legends articles", "Category:Bafforr trees", "Category:Botanical sentient species", "Category:Mid Rim species", "Category:Plants of Ithor", "Category:Trees"], "nodes": [{"tag": "h1", "text": "Bafforr tree"}, {"tag": "p", "text": "The Bafforr trees, or simply Bafforrs, were crystalline plants native to Ithor. They had blue, glassy bark (which quickly blackened upon death) and black leaves. Though unintelligent on their own, groups of Bafforrs could communicate via intertwined root systems, becoming more intelligent. Seven Bafforrs could achieve a fully sentient collective consciousness, with whole Bafforr forests being wiser than any other being known to the Ithorians. Bafforrs communicated through a form of telepathy. Imported reeks' primary diet consisted of the Bafforr tree's leaves."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The bafforr trees had crystalline trunks, with bark smoother than glass. Bafforr branches formed a sharp, interlocking web. The bafforr trees were aquamarine in color, although paler than the surrounding forests on Ithor. At nighttime, bafforr trees glowed a pale blue color; this faded to black if a tree was killed. Some bafforr trees also had black leaves. Sapling bafforr trees looked like inverted cones, and were colored a lighter blue than more mature counterparts. Bafforr trees could not survive being uprooted. Some bafforr trees had shining black bark."}, {"tag": "h2", "text": "Behaviour and intelligence"}, {"tag": "p", "text": "The bafforr trees had a form of collective sentience: individual trees possessed limited intelligence, but as the trees roots intertwined, the individual intelligences connected, forming a group mind. Consequently, the greater the number of trees forming part of the collective, the more intelligent the trees became. Bafforr forests therefore ranged from semi-sentient to fully sentient. That phenomenon was similar to the bivalvic Knowledge Bank of the water-planet Dac, the sum of numerous brains working in concert toward a common purpose. A total of seven bafforr trees were required for true sentience. Below that number, a grove became befuddled, losing its memories."}, {"tag": "p", "text": "The bafforr forests promoted an ethic called the \"Law of Life,\" according to which only non-sentient plants could be harvested, and even then only if two plants were planted for every one that was destroyed in the harvest. The bafforr forests ruled benevolently over all the rest of the forests' organisms, which included such flora as the indyup tree, donar flower and bull-fern, and such fauna as the manollium bird, shamarok flitter and the arrak snake. Bafforr forests also communicated with the Ithorians; the Cathor Hills forest became a teacher and friend to High Priest Momaw Nadon. When he touched the trunk of a grove of bafforr trees, the smooth bark hummed under his touch. The mind-touch of the bafforr grove filled the Ithorian with a pure and holy feeling, conceptualized by Nadon as if light entered every pore of his body. It was a soothing presence, evocative of great beauty, although through that presence, the Ithorian could discern dissatisfaction and other emotions. When the bafforr trees communicated, their leaves trembled, hissing words."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Evolution"}, {"tag": "p", "text": "The Ithorians, a sentient, ambulatory species that also inhabited Ithor, worshipped the bafforr forests. The advent of repulsorlift technology allowed the Ithorians to withdraw from the planet's surface, considering it sacrilegious to touch the forest. However, some Ithorians broke that religious mandate, believing that \"Mother Jungle,\" a spiritual entity thought to embody the verdant, tropical ecology of Ithor, had summoned them to live on the planet's surface. Such Ithorians became ecological priests, tending to the bafforr forests. They were considered renegades by the rest of Ithorian society, which forbid them from returning to the Ithorian Herdships."}, {"tag": "p", "text": "During the Great Sith War, Mandalorian Wars and Jedi Civil War, a massive Galactic Republic fleet was stationed over Ithor; however, Sith saboteurs caused at least two Ithorian Herdships to crash into Ithor's jungles, leading the Ithorians to withdraw slightly from the war efforts."}, {"tag": "p", "text": "In 439 BBY, Ithorian scientists spliced genes from bafforr trees with those of vesuvague trees and several other species. The resulting species, known as \"Spore,\" retained the collective sentience of the bafforr trees; however, unlike its gentile antecedents, Spore was malevolent, driven relentlessly to subsume other beings into its collective mind. That it accomplished by touching individuals with tentacle-like vines inherited from the vesuvague, a semi-sentient plant species in its own right. Through physical contact, Spore was able to possess bodies and send out tentacles from its victims to take control of even more. Spore was extremely virulent, and spread across Ithor, taking control of many beings. Some Ithorians speculated that it had the capacity to controls millions of individual beings. Ultimately, with succor from Jedi Knights, the Ithorians countered Spore's influence, although it took almost 100 years to rid Ithor of the presence of the bafforr derivative. Spore was reduced to a tiny sample, and secreted in a tomb on an asteroid. There, deprived of oxygen and a host, it became dormant. That period of upheaval came to be known as the Ithorian Spore crisis."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Years before the Battle of Yavin, the Galactic Empire was attracted by the Ithorian expertise in cloning and genetic engineering. Imperial captain Alima of the Star Destroyer Conquest laid siege to the planet. He boarded the Tafanda Bay, the largest of Ithor's Herdships, and demanded from its High Priest, Momaw Nadon, the secrets of Ithorian technology. Nadon initially refused, and so Alima ordered the partial incineration of one of the many sentient forests on Ithor. That particular forest, known as the \"Cathor Hills,\" was located on a eponymous geographical feature considered sacred by the Ithorians. Thousands of bafforr trees were killed as the large grove was partially incinerated by the Star Destroyer; the large, dark, cylindrical, felled trunks lasted for many years, appearing like tubes of burned transparisteel. When Alima next threatened to fire upon the Tafanda Bay, Nadon felt he had no choice but to relinquish the secrets of Ithorian technology to the Imperial. For that action, Nadon was exiled from his family and homeworld, eventually settling on the desert planet Tatooine in the Outer Rim Territories, where he cultivated a number of bafforr trees. Nadon's wife, fearing what else the Empire might do, also revealed to the Empire the existence of Spore in an attempt to prevent further violence. Alima's act of violence prompted many Ithorians to clandestinely support the Alliance to Restore the Republic."}, {"tag": "p", "text": "Some ten months after the Battle of Yavin, the Ithorian Fandomar Nadon found two Human children, Tash and Zak Arranda, on the surface of Ithor. She showed the Alderaanians the oldest grove of Bafforr trees on the planet, an enormous grove of densely packed trees. The grove connected telepathetically momentarily with Tash Arranda, who was Force-sensitive, when the girl reached out with her mind. Fandomar later took the Arrandas and their uncle Mammon Hoole, an anthropologist, to an asteroid mining colony in the Ithor system, in order to obtain a supply of the mineral ethromite for their uncle's starship. The miners offered to supply the mineral in exchange for Hoole's expertise in deciphering an artefact they had found within an asteroid."}, {"tag": "p", "text": "By 11 ABY, the Cathor Hills forest had started to recover, tended by a group of at least four Ithorian renegades, although numerous ruined trees still remained. New Republic General Wedge Antilles took the Omwati scientist to view the Cathor Hills, explaining the dynamic between the Ithorians and bafforr trees to the sheltered woman. The following year, in 12 ABY, one of the five-yearly Ithorian Herd Meets was held at Ithor, with dozens of Herdships floating only meters above the canopies of extensive bafforr forests. That meeting was interrupted by an attack by a crazed individual on New Republic guest of honor, Han Solo."}, {"tag": "h3", "text": "Yuuzhan Vong invasion"}, {"tag": "p", "text": "During the Yuuzhan Vong War, Jacen Solo and Corran Horn discovered that the trees could be used against the vonduun crab armor worn by the Yuuzhan Vong, as the crab was allergic to the pollen produced by the tree. This reaction would cause the vonduun crab to swell, killing the crab and any who were wearing it. Almost all of the Bafforrs were destroyed when the Yuuzhan Vong bombarded Ithor to eradicate this deadly weapon. The New Republic ensured the survival of the species, however, as they had already transferred saplings to other planets such as Borleias."}, {"tag": "p", "text": "However, the forces of the New Republic and then the Galactic Federation of Free Alliances were never able to replicate the bafforr pollen, and so it failed to deliver the military advantage that had been hoped for. It did, however, serve as the starting point for the development of Alpha Red. Following the Yuuzhan Vong War, the Ithorians started to restore Ithor with traditional techniques, eschewing vongforming techniques."}, {"tag": "h2", "text": "Bafforr trees in the galaxy"}, {"tag": "p", "text": "Two groves of bafforr trees grew on Tatooine with exiled High Priest Momaw Nadon.}} The first grove of seven, black-leaved bafforr trees grew in one of the many side domes of Nadon's Mos Eisley home. In 0 BBY, Alima was assigned to Tatooine to search for two escaped droids. Nadon arranged for a friend to sell information implicating Nadon with the Rebel Alliance to Alima's forces, hoping to retaliate against the Human for his actions over Ithor. The bafforr grove within Nadon's home refused to give its consent to Nadon's actions, threatening that it would be unable to tolerate Nadon's touch were he to arrange Alima's murder. Moments after that conversation ended, Alima entered Nadon's home and confronted the Ithorian. Dismissive of Nadon's ability to harm him, Alima shot one of the bafforr trees, splintering its trunk. He then threatened to brutally kill all the rest of Nadon's semi- and sentient plants if the High Priest did not track down the droids that Alima was seeking. With the death of that bafforr tree, the grove's intelligence reduced below true sentience. Nadon ultimately caused Alima's death by implicating him in the escape of the droids from Tatooine."}, {"tag": "p", "text": "The second grove of bafforr trees grew outside the Mos Eisley township. According to rumor, it was hidden in the mountains south of the city; such rumors delighted younglings and provided hope to the hardy citizens of Tatooine. During the time of the Galactic Civil War, a patrol of Imperial stormtroopers discovered the grove and informed their superior, Ingah Muloha. Considering the grove to be subversive of Imperial interests, Muloha looked to frame Nadon for assorted criminal charges; that development spooked Nadon into fleeing to Mos Eisley to protect the grove, and he was subsequently captured en route to the grove."}, {"tag": "p", "text": "A group of sympathetic Rebel agents rescued Nadon and delivered him to the bafforr grove. With the Imperials troops believed to be lost in a gravel storm and Nadon's criminal record wiped by Rebel spies, the bafforr grove's safety was maintained."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}