{"url": "Rys", "categories": ["Category:Canon articles", "Category:Wookieepedia Featured articles", "Category:Articles that are known by a nickname", "Category:Coruscant Guard troopers"], "nodes": [{"tag": "h1", "text": "Rys"}, {"tag": "p", "text": "\"Rys\" was the nickname of a diplomatic service clone shock trooper who served in the Grand Army of the Republic during the Clone Wars. A part of the Coruscant Guard, he accompanied Jedi Grand Master Yoda together with squadmate Jek and Lieutenant Thire on a mission to meet with the Toydarian King Katuunko on the moon Rugosa in 22 BBY. Upon arriving at Rugosa, the Republic cruiser carrying Yoda and the clones came under attack from the Separatists and was forced to flee after deploying the four to the moon's surface in an escape pod."}, {"tag": "p", "text": "Separatist agent Asajj Ventress challenged Yoda to avoid her droid forces on Rugosa, proposing that Katuunko ally with the Confederacy if the Grand Master was unable. Yoda and the clone troopers were eventually forced to confront the droids but retreated into a cave to recover after Thire was injured. Rys and his clone brethren then emerged together with the Jedi to defeat the Confederate forces and complete the journey to reach Katuunko. After saving the king from Ventress, Yoda was promised the allegiance of the Toydarian people, and Rys and his comrades were picked up by Republic forces."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Arrival on Rugosa"}, {"tag": "p", "text": "\"Rys\" was the nickname assumed by a diplomatic service clone trooper of the Grand Army of the Galactic Republic during the Clone Wars, a conflict against the Confederacy of Independent Systems and their Droid Army. Like all clone troopers, he was created on the planet Kamino as a clone of the bounty hunter Jango Fett, and trained there prior to his deployment. Rys was assigned to be a clone shock trooper in the Coruscant Guard, a division of clones stationed on the planet Coruscant, capital of the Republic."}, {"tag": "p", "text": "In the year 22 BBY, Rys was picked from the Guard along with fellow clones Jek and Lieutenant Thire to accompany Jedi Grand Master Yoda on a mission to Rugosa, a moon close to the planet Toydaria. Yoda was scheduled to meet secretly atop a Rugosan King coral on the moon with King Katuunko, leader of the Toydarian people and the Toydaria system, where the Republic hoped to build a supply base. The four were transported to the moon in a Republic cruiser; however, upon reaching Rugosa, the cruiser found its communications jammed and then came under attack from two Separatist frigates. As the cruiser was taking heavy fire, Yoda ordered that he and the clone troopers be launched to the moon's surface in an escape pod so that the ship could retreat."}, {"tag": "p", "text": "Upon reaching the moon's surface, Thire, the highest-ranking clone present, made contact via hologram with Katuunko for Yoda and discovered that Separatist agent Asajj Ventress had already reached the king with an offer of allegiance from Count Dooku, leader of the Confederacy. Upon hearing this, Rys and Jek exchanged a glance. A deal was struck between the three parties where if Yoda and the clone troopers could evade capture by Ventress's forces and reach Katuunko on the coral, Toydaria would join the Republic—otherwise, the Separatists would have their allegiance. Once the discussion was over, Rys spotted a landing craft delivering the Separatist troops they were to face, and Yoda gave orders for the clones to only carry what they needed to avoid being slowed down. He then led them on an indirect route toward the meeting place, hoping to avoid encountering the battle droids located between them and their objective."}, {"tag": "h3", "text": "Journey to meet Katuunko"}, {"tag": "p", "text": "As they traveled, Rys and his comrades were spotted by the Separatist forces, who began firing with Armored Assault Tanks. As the clone troopers were out of range, Yoda ordered them to wait, and soon the tanks were forced to stop, as they could not move through the coral growths that covered Rugosa's surface. The droids' commander, 224, then ordered his ground troops to advance on foot. The clones moved to flank the incoming droids from the south, hiding behind corals until the Separatists approached and then opening fire."}, {"tag": "p", "text": "Rys and Jek managed to destroy a squad of B1-series battle droids together before reuniting with Thire and learning that he had lost Yoda. The trio were then forced to retreat by a group of B2-series super battle droids, Thire was knocked to the ground by heavy weapons super battle droid's missile as they fled. While Rys ran back to aid the lieutenant under covering fire from Jek, Yoda arrived and defeated the droids using the Force. The respite from combat was short-lived, as three droidekas quickly replaced their fallen droid comrades in attacking Rys and his allies, forcing the four to retreat with Yoda jumping onto Rys's back so the clone could carry him as the Jedi deflected incoming fire."}, {"tag": "h3", "text": "Re-invigoration and victory"}, {"tag": "p", "text": "With Thire injured, Yoda's team settled to rest in a cave and after Rys lit a portable lamp, they took stock of their low amount of ammunition. After Rys declared the battle lost, Yoda provided reassuring words to the clones, telling Rys to pay more attention to and gain inspiration from his teammates instead of focusing on the enemy. The four then heard the sounds of Separatist tanks outside and moved to the top of the canyon the cave was located in to view the enemy. Yoda leaped down and took on the droids and tanks alone, quickly destroying all of them."}, {"tag": "p", "text": "Rys and his comrades then spotted more droidekas headed toward the Jedi, and as the droids opened fire on Yoda, Jek fired the clones' last rocket into a rocky overhang that promptly fell and crushed the droids. Victorious, the group made its way to the meeting point atop the coral and found Ventress trying to kill Katuunko on Dooku's orders, as the king had chosen to ally with the Republic. Yoda quickly saved Katuunko, forcing Ventress to escape while she distracted the Republic troops by remotely detonating Katuunko's yacht, the Thief's Eye, causing chunks of ship and coral to fall toward them. Yoda prevented the debris from reaching them by using the Force, after which Katuunko offered the service and allegiance of the Toydarian people to the Republic, marking the mission as a success for Rys and his group."}, {"tag": "p", "text": "A Venator-class Star Destroyer then arrived in the skies above Rugosa, and a Low Altitude Assault Transport/infantry was dispatched to pick up Katuunko, Yoda, and the three clone troopers and return them to Coruscant. Once onboard, Yoda experienced a Force vision during the journey home, seeing moments from the futures of the three clones. In the Jedi's vision, Rys was dead. The clone's face showed faint surprise, with his eyes open, but unseeing. Brilliant spangles and flakes of colored scrap speckled Rys's visage, having settled on his cheeks and forehead. The visions left Yoda troubled, and feeling slightly apprehensive of seeing the clones again, but he chose not to try and act on them, knowing that the Force would do as it willed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "The eager soldier"}, {"tag": "p", "text": "After being stationed far from the front lines on Coruscant, Rys was desperately eager to see action and prove himself upon arriving on Rugosa and felt unease and doubt upon Yoda's decision to head in the opposite direction to the rendezvous point and enemy, but followed obediently none the less. Upon hearing the blaster fire of the droids in the distance, he and the other clones were ready for combat, but were disappointed to discover the droids were out of range."}, {"tag": "p", "text": "Not long after sighting the enemy, the clones were relived and excited when Yoda finally ordered them to engage the approaching droid foot patrols. After being forced to flee from the droidekas, Rys was bothered by the idea of retreating, but was quick to declare the Rugosa mission lost while the clone troopers rested in the cave."}, {"tag": "h3", "text": "Interactions with a Jedi"}, {"tag": "p", "text": "During missions, Rys tended to focus on the enemy rather than his fellow soldiers, a trait Yoda picked up on during their time together. When Yoda reached out with the Force, he found Rys and the other clones' minds open and their emotions strong, reminding the Jedi of children. The trio craved Yoda's approval and wanted to please him, and the Jedi found their level of obedience somewhat disturbing. While in the cave, the clones were worried they would be unable to complete their mission, which would lead to shame as they would be proved unworthy of their commander and each other."}, {"tag": "p", "text": "Rys struggled to understand Yoda's odd phrases and wise sayings, but he believed that such difficulty was to be expected from conversations with a Jedi Master. His anxiety ebbed away after hearing Yoda's words of encouragement and was replaced with peace and purpose. Consequently, he was not discouraged when he saw the enemy's tanks and felt satisfaction after the enemy was defeated through teamwork. Rys was then dissappointed at the thought of having to return to Coruscant at the end of the mission. As a clone of Jango Fett, Rys stood 1.83 meters (6 foot) tall, with black hair, brown eyes, and tan skin. He had a black tattoo running up his neck and onto the back of his jaw on each side of his face."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Rys was competent in armed and unarmed combat, military tactics, and security."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Rys wore Phase I clone trooper armor painted with the red coloring of the Coruscant Guard. On Rugosa, he carried a backpack and a DC-15A blaster carbine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rys first appeared in \"Ambush,\" the first episode in the first season of the Star Wars: The Clone Wars television series, which aired on October 3, 2008. Like all clones in the series, he was voiced by Dee Bradley Baker. Author Jason Fry has stated that his intention was for Rys to be dead during Yoda's Force vision in \"Sharing the Same Face,\" a 2020 adaptation of \"Ambush.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}