{"url": "Ryndellia_system", "categories": ["Category:Canon articles", "Category:Wookieepedia former Comprehensive articles", "Category:Galactic Republic star systems", "Category:Outer Rim Territories star systems", "Category:Ryndellia system"], "nodes": [{"tag": "h1", "text": "Ryndellia system"}, {"tag": "p", "text": "The Ryndellia system was a star system located within the Outer Rim Territories that contained Ryndellia and the Kaliida Nebula, the nesting place of giant neebray mantas. The system was also home to the Galactic Republic's Kaliida Shoals Medical Center, where more than 60,000 wounded clone troopers were being treated by Kaminoan doctor Nala Se."}, {"tag": "p", "text": "During the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems in 22 BBY, a Republic medical passed through the system, where they were ambushed and destroyed by the Kaleesh Separatist General Grievous aboard the Subjugator-class heavy cruiser Malevolence. Afterwards, the Malevolence was ordered with destroying the Kaliida Shoals Medical Center to tip the scale of the war. However, before it could destroy the station, the Malevolence was crippled by a Republic starfighter squadron and forced the cruiser to flee the system, where it was subsequently destroyed by Jedi Knight Anakin Skywalker."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A star system located in the galaxy's Outer Rim Territories, near the Naboo system, the Ryndellia system was positioned near a multitude of star clusters, preventing large starships from charting courses longer than ten parsecs when traveling in proximity to the system. It contained Ryndellia and was the location of the Kaliida Nebula, which was the nesting place of giant neebray mantas. The Balmorra Run, a dangerous smuggler's route, ran through the nebula."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Attack on medical transports"}, {"tag": "p", "text": "In 22 BBY, during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, a Jedi-led Republic medical convoy of three Pelta-class frigates escorted by a lone Venator-class Star Destroyer traveled through the Ryndellia system. While passing through the system, the convoy came under attack by the Kaleesh Separatist General Grievous aboard the Subjugator-class heavy cruiser Malevolence, who used the heavy cruiser's mega-ion cannon to disable and destroy its targets."}, {"tag": "p", "text": "After the attack, Separatist leader Count Dooku, who had been observing Grievous's progress, provided the Kaleesh with the Malevolence's next target: the Republic's secret Outer Rim medical station located near the Kaliida Nebula, where more than 60,000 wounded clone troopers were being treated by Kaminoan doctor Nala Se and clone medical officers. However, the Republic, alerted by the convoy's destruction and in fear that the station was in danger, dispatched Shadow Squadron, an elite BTL-B Y-wing starfighter/bomber squadron led by Jedi Generals Plo Koon and Anakin Skywalker to defend the medical station from the Malevolence."}, {"tag": "h3", "text": "Battle of the Kaliida Nebula"}, {"tag": "p", "text": "In order to reach the station before Grievous, the squadron passed through a shortcut within the Kaliida Nebula located in the system. However, as they traveled through the nebula, the squadron came across a swarm of neebray manta nesting within, forcing the bombers to take evasive maneuvers, eventually making their way out of the nebula. Not long after their escape, the Malevolence, which was forced to take a longer route around the nebula, exited hyperspace and began firing upon several medical frigates fleeing the station."}, {"tag": "p", "text": "Afterwards, the heavy cruiser, which had launched several Vulture-class droid starfighters to repel the Y-wings, fired its ion cannon at the bombers at Grievous's command, despite knowing that his fighters would be caught in the blast. Despite their losses, however, Shadow Squadron continued their and advanced on the Malevolence's command bridge, attempting to maneuver through a barrage of turbolaser fire, as the cruiser targeted the medical station."}, {"tag": "p", "text": "Watching as their numbers continued to drop, Skywalker's Padawan, Ahsoka Tano, advised that they create a new plan, to which Koon suggested that instead of targeting the bridge, they should target the cannon, believing that it may overload upon fire. Taking their advice, Skywalker ordered his remaining fighters to spearhead the starboard cannon, firing several proton torpedoes, which managed to both disable the weapon and cripple the warship. Soon afterward, Jedi General Obi-Wan Kenobi and Admiral Wullf Yularen arrived in the system with a fleet of Republic Star Destroyers and began firing on the Malevolence, forcing it out of the system and into Separatist space, resulting in the eventual destruction of the warship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ryndellia system first appeared in \"Shadow of Malevolence,\" the third episode of the canon animated series Star Wars: The Clone Wars' first season, which originally aired on October 10, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}