{"url": "Baga%27s_Rival", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "Baga's Rival"}, {"tag": "p", "text": "\"Baga's Rival\" is the fifteenth episode of the second season of Ewoks. Written by Linda Woolverton and directed by Dale Schott, the episode originally aired on ABC on November 8, 1986."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Difficulty with Baga"}, {"tag": "p", "text": "The episode opens with Kneesaa, Teebo and Wicket attempting to force Kneesaa's pet bordok Baga to take a bath in the river. Latara, who sits on a platform, can't bear his stench. The three Ewoks attempt to pull Baga into the river but the bordok bits off the rope, causing the trio to fall into the river instead. Latara giggles but Baga tips the platform, causing her to catapult into the river as well."}, {"tag": "h3", "text": "Silk's charm offensive"}, {"tag": "p", "text": "While grumbling about Baga, they encounter a beautiful, white unicorn-like creature, which allows Kneesaa and the other Ewoks to stroke and pat it. Baga is jealous. When Latara observes that the creature's mane is silky, Kneesaa decides to name him Silky. Kneesaa invites Silky back to the village. When the Ewoks are away, Silky growls at Baga and uses his horn to send bright spark downriver. Silky follows the Ewoks back to Bright Tree Village."}, {"tag": "p", "text": "Meanwhile, Silky's bright spark reaches a waterfall that leads upstream to Jadru's maze. Jadru emerges from her throne and gazes at crystal ball. She is pleased that the Ewoks have accepted her Quarf as their pet since she hopes to obtain the Ewoks' Sunstar for herself."}, {"tag": "p", "text": "Back at Bright Tree Village, Silky ingratiates himself with the Ewoks . Feeling jealous, Baga attempts to curry Shodu's favour. Shodu, who is juggling both Winda and a bag of fruits, passes the fruits to Baga, who is laden with the heavy bag. Two woklings enjoy riding Silky, who takes over from carrying the heavy bag of fruits. Shodu and Kneesaa describe him as a wonder. Baga tries to get Kneesaa's attention but she tells him not to be jealous."}, {"tag": "p", "text": "Later that night, Chief Chirpa asks what is Silky doing on Kneesaa's bed. Kneesaa pleads with her father to let Silky share the bed with her for the night, claiming that Silky will catch a cold from sleeping outside. Chirpa relents and tucks his daughter in. Baga watches sadly outside before returning to his straw manger."}, {"tag": "h3", "text": "Silky unmasked"}, {"tag": "p", "text": "The following day, the Ewoks try to get Silky to cross a log. Baga tries to cross a log to demonstrate his usefulness to the Ewoks. Silky reveals she has a pair of pink wings and flies over the Ewoks. Baga loses his balance and falls into the river. Kneesaa is cross with him for walking on the log and getting into Silky's way. Silky convinces Kneesaa to let him give her a ride, which she obliges. While flying in the air, Silky turns into a green dragon-like creature and flies away with Kneesaa."}, {"tag": "p", "text": "Wicket, Latara and Teebo watch in horror as Silky kidnaps Latara and flies away with her. Baga also hears Kneesaa's plight and pursues Silky from the ground. The Ewoks join the pursuit. They meet on the opposite sides of a river linked by several rocks. Since Baga has picked up Silky's trail, the Ewoks follow him. Baga and the Ewoks soon reach a waterfall, which Baga climbs up. Wicket sets Teebo and Latara to warn Chief Chirpa what has happened while he and Baga follows Kneesaa. They warn him to be careful."}, {"tag": "h3", "text": "Jadru's plot"}, {"tag": "p", "text": "Together, Wicket and Baga climb up the waterfall cliff-face, which leads them to Jadru's lair. In Jadru's throne room, Silky, who has bound Kneesaa with his wings, brings her before his mistress Jadru. Gazing at her crystal ball, Jadru issues an ultimatum to Chief Chirpa, demanding the Sunstar in exchange for the safe return of his daughter. Chirpa is furious while Kneesaa is defiant. Jadru believes Chirpa will submit."}, {"tag": "p", "text": "Just then, Silky senses movement from behind in the tunnels. Through the crystal glass, Jadru sees Wicket and Baga heading towards them. Jadru is confident that she would defeat them. Kneesaa laments that she was a fool for abandoning Baga. Jadru sends a bolt of yellow energy into the maze. Meanwhile, Wicket encourages Baga, who follows Kneesaa's scent through the maze. Jadru communicates with them through a portal, taunting them that they will never find their way out."}, {"tag": "p", "text": "Jadru traps them behind several doors. Baga manages to pick up the scent but comes up against a gate. Jadru taunts Kneesaa that her friends will be trapped in the maze forever. However, Baga is able to use his strong sense of smell to lead the way. Jadru thanks Silky for his service, believing that the Ewok's Sunstar will be hers. However, Baga and Wicket manage to force their way through a gate."}, {"tag": "h3", "text": "Baga and Wicket to the rescue"}, {"tag": "p", "text": "Wicket demands that Jadru releases Kneesaa and charges at her. Jadru orders Silky to destroy them. After throwing off Kneesaa, he charges at Baga and Wicket. Kneesaa warns Baga and Wicket, who dodge out of harm's way. Reuniting with Baga and Wicket, Kneesaa and her rescuers flee through Jadru's maze. Jadru gives chase while riding on Silky. She hurls a bolt of fire at them. While riding on Baga, Kneesaa thanks her bordok for coming to rescue her after she was so mean to him."}, {"tag": "p", "text": "With Jadru and Silky on their trail, Wicket leads Baga and Kneesaa to hide behind a column. Wicket then leads the trio back to the throne room. Wicket and Kneesaa decide to trap Jadru in her own maze, using the levers in the throneroom to seal the various gates. Jadru is horrified that someone is controlling her maze and vows vengeance. Back in the throneroom, Kneesaa wonders how they will get out of Jadru's maze."}, {"tag": "h3", "text": "Reinforcements and reconciliation"}, {"tag": "p", "text": "Just then, Chief Chirpa and his warriors force their way into the throneroom. Chirpa is delighted that his daughter is safe, adding that Teebo and Latara told him where to find them. Just then, they hear Jadru vowing vengeance. Wicket shows Chirpa the levers, which the Ewoks destroy. Jadru and Silky are trapped within Jadru's maze. Chirpa commends Wicket, passing him a broken piece of the lever as something to add to his Belt of Honor."}, {"tag": "p", "text": "After leaving Jadru's maze, Kneesaa apologizes to Baga for neglecting him. She asks if he will ever forgive him. The bordok licks her face, prompting Kneesaa to tell him that she loves him."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}