{"url": "Ryloth", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Confederacy of Independent Systems planets", "Category:Corellian Run", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Planets with shipyards", "Category:Rocky planets", "Category:Ryloth locations", "Category:Ryloth system planets", "Category:Shadowports", "Category:Slavery worlds", "Category:Spice producing worlds", "Category:Techno Union planets"], "nodes": [{"tag": "h1", "text": "Ryloth"}, {"tag": "p", "text": "Ryloth was a planet in the Ryloth system of the Outer Rim Territories, and the homeworld of the Twi'lek species. Its terrain varied, filled with jungles, mesas, valleys, and volcanoes, and had an atmosphere breathable for Twi'leks and humans alike. A forest covered its equator, filled with dangerous predators. Given the varied and dangerous terrain, Twi'leks lived in caves underground where it was safer."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A hot and humid world, Ryloth was located far out in the Outer Rim Territories, at grid square R-17 on the Standard Galactic Grid. Situated near the Corellian Run Super-hyperroute, far beyond the planets Tatooine and Geonosis, Ryloth sat towards the boundaries of Wild Space. The second in the three-world Ryloth system and orbited by five moons, whose gravitational pull affected the planet dramatically, Ryloth was located in the Gaulus sector."}, {"tag": "p", "text": "Ryloth's geology was nothing if not diverse, possessing a multitude of mountain ranges, snow plains, lush temperate forests and deserts, including the Jixuan desert, all of which were occupied by the planet's indigenous wildlife. A portion of the planet some distance from the Jixuan desert acted as breeding grounds for the gutkurr species. Much of Ryloth's wildlife was lethally dangerous and forced the native Twi'lek species to live in enclosed cave systems or in easily defended locations."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "Ryloth was an important world due to the fact that it was the homeworld of the influential Twi'lek species. For centuries, the planet and its people were exploited by the Hutts and their criminal enterprises as the world served as a key world for the spice trade where slave labor was used to produce goods."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In the years preceding the Clone Wars, Count Dooku secretly backed coups on Ryloth as part of larger political attempts to seed discontent in the galaxy's Outer Systems during the Separatist Crisis."}, {"tag": "p", "text": "Some time after the outbreak of the Clone Wars, the Separatist Alliance led a planetary-wide invasion of Ryloth under the command of Techno Union Emir Wat Tambor, establishing a blockade in space around the planet commanded by Neimoidian Captain Mar Tuuk of the Separatist fleet. However, a Republic fleet under Admiral Dao of the Republic Navy had attempted to provide support and protection for Jedi General Ima-Gun Di and the clone troopers of the Outer Rim garrison, which had been backed by a group of Twi'lek freedom fighters led by General Cham Syndulla. Despite the attempts to defeat the Separatist fleet, the Republic Venator-class Star Destroyers' fuel, power, and ammunition began to diminish, but had held out long enough for Dao to contact the Jedi Temple on Coruscant to send relief supplies to the suffering inhabitants and dwindling clone troopers, and while speaking with the Jedi Order, the ship's deflector shields were subsequently disabled, resulting in the fleet's obliteration."}, {"tag": "p", "text": "Trapped within the walls of a mountain range, the remaining clones of the garrison made a final stand along a passageway so that the Twi'lek freedom fighters could escape with their families. However, the entire Outer Rim garrison had been destroyed, resulting in the deaths of both General Di and Clone Captain Keeli, but not before blockade runners of the Republic secretly bypassed the Separatist blockade and delivered relief supplies after a lengthy debate on Toydaria between Senator Bail Organa of Alderaan, Representative Binks of Naboo and Senator Lott Dod of the Trade Federation, who had been ordered by Count Dooku to interrupt the negotiations with the Toydarian King Katuunko."}, {"tag": "p", "text": "When the Republic returned to Ryloth, Generals Anakin Skywalker, Obi-Wan Kenobi, and Mace Windu, working with Syndulla's freedom fighters, successfully led the Republic and Twi'leks to retake the planet from the Confederacy. However, as Syndulla had feared, the Republic launched its own occupation of Ryloth to maintain its control, although there was no resistance force mounted against this new effort. Though Republic forces suffered a defeat at Ryloth at some point after the Second Battle of Geonosis, the Republic was able to remain in control, with its occupation even persisting past the end of the Clone Wars."}, {"tag": "h3", "text": "Imperial protectorate"}, {"tag": "p", "text": "After the end of the Clone Wars in 19 BBY, Ryloth officially became a protectorate of the Galactic Empire. While classed as free and independent, its title did not reflect reality. Many isolated settlements did not even know of the Empire's existence until they were raided and their populations forced into slave labor. As consequence, the former Free Ryloth Movement initially formed to fight the Separatists during the Clone Wars instigated a new rebellion against the Empire."}, {"tag": "p", "text": "By 14 BBY, the planet was overseen by Moff Delian Mors who lived on a moon orbiting the planet. That same year, Darth Sidious and Lord Vader became trapped on the planet after the destruction of the Imperial-class Star Destroyer Perilous over the planet in an attempt to assassinate the Empire's political leadership, a move designed by Cham Syndulla's reorganized Free Ryloth Movement. The attempt failed to kill the Emperor and his apprentice."}, {"tag": "p", "text": "By 3 BBY, Imperial TIE bombers based on an orbiting Quasar Fire-class cruiser carrier were used to bomb Ryloth. Cham and the Ryloth resistance wanted to destroy the carrier in order to demonstrate their strength. However, his daughter Hera Syndulla, who had become the leader of the Spectres, a rebel cell, disagreed with her father's plan and convinced him and his companions Numa and Gobi Glie to steal the ship for the Phoenix Cell; which desperately needed a carrier to house its starfighter squadron. During the mission, the two rebel cells also managed to destroy an Arquitens-class command cruiser which boosted the morale of the Ryloth resistance."}, {"tag": "p", "text": "In 2 BBY, the Chiss Imperial Grand Admiral Thrawn was dispatched by the Empire to deal with the Free Ryloth movement. By studying Twi'lek art, culture, history, and philosophy, Thrawn was able to devise successful counterinsurgency tactics that led to the capture of Tann Province. He also captured the Syndulla residence and forced Cham Syndulla to flee. After the capture of Hera and Ezra Bridger, Thrawn chose to relinquish command to Captain Slavin to observe how the rebels would act, Cham's forces and the Spectres managed to escape. Nevertheless, in order to escape, Hera had needed to destroy the family residence, showing Thrawn how far the rebels were willing to go to. The Grand Admiral had also taken posession of the Syndulla family's Kalikori."}, {"tag": "h3", "text": "Independence"}, {"tag": "p", "text": "In the year 5 ABY, the Galactic Empire abandoned their garrisons on Ryloth. After the planet regained its independence, the rebel fighter Yendor became the planet's ambassador to the New Republic, the government that had been established by the Alliance to Restore the Republic."}, {"tag": "p", "text": "Following the Galactic Concordance, Ryloth did not join the New Republic and instead opted to remained a sovereign and independent world from both the Populists and the Centrists political factions. About six years before the destruction of the Hosnian system, Ryloth's economy and independence came under threat from the Nikto crime lord Rinnrivin Di's cartel, which had become a major spice dealer and smuggling group. Rinnrivin's cartel exacted a heavy toll on Ryloth's offworld shipping due to sporadically-enforced New Republic financial regulations, infrequent patrols of the shipping lanes, and rampant bickering within the Galactic Senate. Emissary Yendor traveled to the Galactic Senate on Hosnian Prime to raise his planet's plight to the Senate."}, {"tag": "p", "text": "In response, Senators Leia Organa and Ransolm Casterfo traveled to Bastatha and Ryloth to investigate Rinnrivin's syndicate. Over the course of their investigation, the two senators discovered that a mysterious entity was channeling funds to Rinnrivin's cartel through a militia group called the Amaxine warriors as part of a conspiracy to destabilize the New Republic. While visiting the Ryloth archives, Leia and her entourage discovered that Rinnrivin was formerly a lowly spice dealer who had rapidly risen to become the leader of a powerful criminal cartel. Organa and her allies eventually defeated Di and the Amaxine warriors, but she believed there was more going on, which made her form the Resistance."}, {"tag": "h3", "text": "Age of the Resistance"}, {"tag": "p", "text": "Despite being an independent planet, after the rise of the First Order many Twi'leks feared an occupation of Ryloth would be inevitable and swore allegiance to Organa's Resistance. However, the Ryloth government itself did not support General Organa."}, {"tag": "p", "text": "In the aftermath of the Resistance's loses in the attack on the Resistance fleet and the Battle of Crait, Organa realized Ambassador Yendor of Ryloth could help the Resistance survivors. Organa and other members of her movement were aboard the Millennium Falcon, and, when they approached the planet, Lessu command contacted the freighter. However, operations were taken over by the Ryloth Defense Authority, a philosophical decent of Cham Syndulla's Free Ryloth movement that was autonomous from Lessu, although the capital allowed them to exist. Yendor, who was a member of the RDA, allowed the Falcon to arrive, and the ship landed at a base in a cave. Yendor met with Organa, and, while he understood that Chancellor Drelomon and General Ishel would not want it, and he feared the First Order would attack if they learned what was happening, Yendor intended to talk to Lessu about aiding the Resistance. He believed helping the Resistance refugees was the right thing to do."}, {"tag": "p", "text": "The Resistance was allowed to set up in the RDA base, but Yendor and Organa later learned that the First Order had arrived in Lessu. While it appeared that they had not come because of the Resistance presence. The First Order had given the Ryloth shipping guild five days to tithe before they blockaded the shipping lanes. Despite this shortened time frame for staging an operation, Organa stuck to her plan of having reinforcements arrive on-planet. After Commander Poe Dameron, the rest of Black Squadron, Inferno Squad, and the allies they had managed to gather arrived, the Resistance sent teams to Bracca and Corellia. While the missions occurred, however, someone in Lessu betrayed the Resistance, and the First Order attacked the base."}, {"tag": "p", "text": "During the assault, a member of Phantom Squadron and Yendor's daughter, Hahnee Brethen, were both killed. After Hahnee's death, Organa used her rifle and fought side by side with Jedi Padawan Rey. Organa informed Yendor about his daughter's death, and, while he told Organa he planned to die directing a cannon, she offered for him to fly the fallen Phantom Squadron pilot's X-wing starfighter. Yendor accepted her offer, and the Resistance starships evacuated Ryloth. Afterwards, the Resistance gathered at a location supplied by the Collective, and Dameron believed the events on Ryloth showed that nowhere they gathered would be safe for them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}