{"url": "S%27kytri", "categories": ["Category:Legends articles", "Category:Avian and airborne sentient species", "Category:Mammalian sentient species", "Category:Outer Rim Territories species", "Category:Oviparous species", "Category:S'kytri"], "nodes": [{"tag": "h1", "text": "S'kytri"}, {"tag": "p", "text": "The S'kytri (meaning the Windborn in their language) were a sentient species of winged humanoids indigenous to the planet of Skye, also known to the Galactic Empire as Marat V. They were normally tall, muscular and thin, which is why they were regarded as one of the most beautiful species in the galaxy. Throughout history, the S'kytri had built up a reputation of noble warrior bards."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "The S'kytri from Skye were a species of tall, sentient mammals. In many respects, they looked similar to Humans, the most common species in the galaxy: they had humanoid bodies with two arms ending with five-fingered hands, two legs with five-toed feet, and a face that featured a mouth, a nose and two forward-facing eyes. The rest of their features, however, set them clearly apart from their distant Human cousins. The most striking differences were their large, apparently membranous wings, their decidedly non-Human skintones and their towering height. While the average Human only grew to 1.70 meters, many S'kytri surpassed two meters, and those under 1.80 meters were considered short."}, {"tag": "p", "text": "As they were a flying species, the S'kytri regarded excessive body weight as both impractical and dangerous, which is why they were all thin and brawny. Additionally, their skeletons were hollow, much like a bird's, which allowed them easier flight. Because of that and despite their exotic features, they were deemed beautiful by many other species in the galaxy."}, {"tag": "p", "text": "While most mammals gave birth to live young, the S'kytri hatched from eggs. Female S'kytri were born with green skin while males were born with blue. Any egg that was perceived to have a female with blue skin or a male with green was perceived as an abomination, and was thus immediately killed. Their hair color ranged from moonlight blond to jet black, and their eyes from dark blue to light silver and every other color in between."}, {"tag": "p", "text": "They started adolescence at twelve years of age and were considered biologically mature at seventeen. Beginning at around forty years, a S'kytri entered middle age, with seniority being reached at sixty-five. A S'kytri's life expectancy was about seventy-five standard years, while those above that age were held to be venerable."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The S'kytri were grouped into clans, which were themselves divided in two groups, the Lowland and the Highland Clans. The members of each group bore distinctive markings. Those clans dwelled in cities built in the mountains and were governed by a Supreme Council. The position of Patriarch, leader of all the S'kytri, was awarded alternately to the leader of either Councils. Once given the position, a clan's leader would hold it for a 22-year-long term, after which they were required to hand the title to the other clan. In the normal course of events, the Windborn disapproved of violence, but they proved to be able and courageous warriors when necessary. A strong tendency to be arrogant was present in their mentality. Because of the many possibilities their wings offered, the S'kytri regarded species that were incapable of natural flight as inferior. That cultural trait was strongly marked in the behavior of the young adults, who also tended to be disobedient and bold."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The S'kytri evolved on Skye, a planet of the Varada sector, in the Outer Rim region of the galaxy. Their first contact with the wider galactic community dated back to as early as the Hundred-Year Darkness, a conflict that lasted from 7003 to approximately 6900 BBY. By that time, some S'kytri had become Dark Jedi under the command of Remulus Dreypa, a Jedi Admiral who had fallen to the dark side and had been exiled by his order."}, {"tag": "p", "text": "At the time of the Clone Wars, a pan-galactic conflict between the Galactic Republic and the Confederacy of Independent Systems, Skye was put under threat by a genetic terrorist, Zeta Magnus, who attempted to devastate the planet. The Jedi decided to intervene. Three Jedi warriors, Halagad Ventor, General Obi-Wan Kenobi and his apprentice Anakin Skywalker, rescued the planet from impending doom. Following those events, the S'kytri were unswervingly loyal to the Jedi."}, {"tag": "p", "text": "At the conclusion of the war in 19 BBY, the Supreme Chancellor of the Republic Palpatine revealed his true colors, turning the democratic government into an autocratic Galactic Empire and ordering the extermination of all Jedi. Because of the newly-formed Empire's nominal speciesism and because of the strong relationship they had maintained with the Jedi, the S'kytri were condemned to servitude. The female named Kharys, who had witnessed the Jedi intervention at the age of thirteen, allied herself with the Empire and placed in charge of her people by Darth Vader, the armored right-hand man of the Galactic Emperor Palpatine. Vader was none other than Anakin Skywalker, who had turned to the forces of evil, and he trained Kharys in the ways of the Force, including lightsaber combat. Under the rule of that new Majestrix Kharys, who enforced the Imperial doctrine, the Windborn endured long years of slavery."}, {"tag": "h2", "text": "S'kytri in the galaxy"}, {"tag": "p", "text": "Following the end of the Hundred-Year Darkness, a contingent of Jedi Knights that included several S'kytri crashed on the world of Kesh. Around 2974 BBY, the all-Forceful descendants of the marooned Jedi—collectively known as the Doomed—were led by Kaliska, the last known remaining member of the S'kytri species within their community."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though continuity specifies that only blue or green-skinned S'kytri are ever born, the Ultimate Alien Anthology features an image of a red-skinned female."}, {"tag": "p", "text": "In issues #3, #4 and #5 of Star Wars: Lost Tribe of the Sith—Spiral, S'kytri is misspelled as Sky'tri."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}