{"url": "S%27ybll", "categories": ["Category:Legends articles", "Category:Dark Jedi", "Category:Females", "Category:Impersonators", "Category:Mind-witches"], "nodes": [{"tag": "h1", "text": "S'ybll"}, {"tag": "p", "text": "S'ybll was a Mind-witch who lived on the planet Seidhkona for many years until being encountered by an exploratory team sent by the Galactic Empire. S'ybll leeched the life energy from the Imperial force and discovered that the draining of their energy had made her young again. Hungering for further individuals to steal life energy from, she discovered the crew of the Millennium Falcon, who had landed on her world to enact repairs. S'ybll was drawn to the young Jedi Luke Skywalker after sensing his raw Force power and was able to draw him to her domain. While there, she used Force illusions to trap Skywalker and drain him of his energy. However, Skywalker saw through her illusions and defeated her."}, {"tag": "p", "text": "Years later, S'ybll made her way to Tarnoonga, where she was able to steal life energy from another group of Imperials. She then lured Skywalker to the world and confronted him at an Imperial outpost. Instead of seeking revenge, S'ybll wanted Skywalker to work with her, bringing her Imperials that she could drain and maintain her youth. When Skywalker refused, S'ybll tried once again to drain his life energy. However, the attack failed and S'ybll was killed when Skywalker ran her through with his lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "S'ybll was a mind-witch, a long-lived humanoid species with powerful psychic abilities. S'ybll also had telekinetic abilities allowing her to move objects with her mind. At some point, S'ybll discovered large stone columns on the planets of Tarnoonga and Seidhkona which allowed her to greatly augment her telekinetic powers. Not wanting to be away from the source of her power, S'ybll made her home on Seidhkona. Over many years, the city that housed the large stone columns fell into disrepair, but S'ybll still called the ruins her home, staying within its borders. By the time of the Galactic Civil War, S'ybll was still living on the planet, greatly advanced in age. To her surprise an Imperial exploration team arrived on Seidhkona in a Lambda-class T-4a shuttle. As the Imperials explored the ruins that were S'ybll's home, she used her psychic powers to take control of their minds and drain their life energy. After eliminating the entire scouting party, S'ybll found herself to be young again. Delighted, S'ybll waited for more individuals to come to her world so that she could drain them too. As she waited, she used the Imperials' stormtrooper armor to make scarecrows which she posted around her territory."}, {"tag": "h3", "text": "Encounter with Skywalker"}, {"tag": "p", "text": "Around 3 ABY, S'ybll witnessed the Millennium Falcon landing on Seidhkona. The Rebels Luke Skywalker, Chewbacca, Han Solo, and their droids, R2-D2 and C-3PO had touched down to make repairs to their navigation computer which had been damaged. S'ybll sensed the raw Force power within Skywalker and was drawn to the ship. When Skywalker ventured away from the Millennium Falcon to scout the area, S'ybll was able to read his mind, and used her powers to conjure an image of one of the young Rebel's love interests, Tanith Shire. The illusion created by S'ybll showed Shire being attacked by a large plant beast, which Skywalker was able to destroy using his blaster pistol. S'ybll, maintaining the illusion of Shire, led Skywalker on a chase which led them to dive into a river near her domain. As the two exited the water, S'ybll dropped the illusion, but she was able to explain away the change of appearance, attributing it to the odd atmosphere on the world. Skywalker believed the explanation and followed S'ybll to her home. Skywalker was curious about the ruins and the stormtrooper scarecrows placed around the place, but S'ybll was able to dodge the questions, leading the man deeper into her home. When Skywalker spotted the damaged Imperial shuttle, S'ybll lied that the craft had come there long before she had settled there and that she had simply used the armor inside to make the scarecrows."}, {"tag": "p", "text": "As Skywalker tried to gain more information on what could have possibly eliminated the Imperials, S'ybll drew the young man close to her. Claiming that she needed protection from the dangers of the jungle, she kissed Skywalker deeply. However, he gently refused her advances, telling S'ybll that he would help her, but that he had other commitments. Upon his refusal, S'ybll stole his comlink and disappeared into the trees to conjure another illusion. Using further memories stolen from Skywalker's mind, she conjured the Night Beast that he had previously defeated on Yavin 4. Skywalker fled from the beast, and in an attempt to climb one of the ruins, the structure collapsed, incapacitating him. S'ybll used the distraction to pull another image from Skywalker's mind, that of his deceased Jedi Master, Ben Kenobi. S'ybll's Kenobi illusion, in the form of a Force ghost, convinced Skywalker to stay and seek out S'ybll. As Skywalker listened to the illusion, S'ybll was able to siphon his life energy from him, weakening the young Rebel."}, {"tag": "h3", "text": "Draining Skywalker"}, {"tag": "p", "text": "As Skywalker collapsed, injured by his fall and weak from having his life energy sucked from him, S'ybll gathered him up and brought him to her hiding place where she lay him upon a stone table to completely drain him. S'ybll was running low on energy, and her appearance began to change back to her haggard appearance with long white hair. To keep Skywalker from seeing her, she placed a cloth over his eyes. During the process, Skywalker awoke but was kept from moving by S'ybll who convinced him that she was trying to heal him. However, Skywalker's comlink, which S'ybll had kept in order to lure his companions after she had drained him, suddenly began to transmit communication. Skywalker's droids, R2-D2 and C-3PO, who were hoping to contact their missing master, called out from the comlink, and S'ybll could not keep Skywalker still any longer. As he attempted to recover the device, the young Rebel pulled the cloth from his face revealing S'ybll's withered appearance. Her scheme revealed, the Mind-witch pulled the comlink away from Skywalker's grasp, keeping him from contacting his friends."}, {"tag": "p", "text": "Skywalker attempted to fight her power, but he was too weak to resist the psychic link that she had formed within his mind. As S'ybll told the Rebel of her history, he was able to muster enough strength to throw her off him, running from the mind-witch. Shocked by his strength of will but still maintaining a strong psychic link with Skywalker, S'ybll pulled another illusion from his mind. An illusion of Skywalker's greatest fear, Darth Vader was summoned, driving him back into her clutches. However, Skywalker resisted the illusion, and the vision of Darth Vader's attacks passed harmlessly through him. Refusing to admit defeat, S'ybll decided to dispose of the young man, content to drain Skywalker's friends after she had dealt with him. Using her telekinetic powers, she collapsed nearby ruins onto her foe."}, {"tag": "p", "text": "Believing that she had crushed Skywalker, S'ybll sensed his friends nearby and called out to them, eager to drain their essences now that Skywalker had been dealt with. However, Skywalker had dodged the attack and taunted the mind-witch. Enraged, S'ybll lashed out wildly, throwing loose stones and broken ruins at the young man. The powerful telekinetic attack drained S'ybll of her energy, exhausting her. Badly weakened, the mind-witch's psychic hold on Skywalker was broken, and she collapsed among the rubble she had created. Knowing that she was extremely vulnerable in her weakened state, S'ybll had just enough strength to conjure an image of her corpse pinned beneath a rock. Convinced S'ybll was dead, Skywalker, free from S'ybll's power, departed the world with his friends."}, {"tag": "h3", "text": "Final showdown"}, {"tag": "p", "text": "After the Rebels departed her world, the mind-witch was able to recover from the battle. During her recuperation, Imperials arrived at Seidhkona looking for their lost shuttle. Instead of draining all the Imperials as she had done previously, she eliminated one of their number and took his place, disguising herself with an illusion. Unable to determine the cause of their comrades' deaths, the Imperial group left Seidhkona and returned to an Imperial outpost on the planet Tarnoonga. The base was also home to the same stone columns that she had used on Seidhkona to augment her powers, which gave her an edge over the Imperials. As she had done years ago, S'ybll began to drain the Imperials at the outpost of their life energy. The base also housed an Oskan blood eater, which S'ybll made into her pet. After replenishing herself, she made the outpost her home, hiding the dead stormtrooper's armor and bones in cargo containers. Instead of desiring revenge on Skywalker, S'ybll was impressed by his powers and resolved to get him to join her so that she could use him to bring her Imperial victims. Sometime later, S'ybll's opportunity to contact Skywalker presented itself. Two Rebel scouts, Andur Thorsim and Glaennor, came to Tarnoonga in a G9 Rigger freighter to investigate reports about the Imperial base. Using her illusions, S'ybll tricked the scouts into believing that they were being attacked by an Oskan blood eater. As the illusions drew the scouts to her, she showed them an image of a Jedi woman who defeated the blood eater with her lightsaber. The Rebel scouts reported the news of a Jedi back to Alliance Command, who then forwarded the information on to Luke Skywalker. Her plan in motion, S'ybll imprisoned the Rebel scouts and waited for Skywalker's arrival."}, {"tag": "p", "text": "Hoping to make contact with another Jedi, Skywalker headed for Tarnoonga. After landing his X-wing next to the G9 freighter, Skywalker searched the area for the Rebel scouts. Upon Skywalker's arrival, S'ybll resumed her psychic bond with the young man, pulling images from his mind to manipulate him. Using the image of Frija Torlock from Skywalker's past, she confronted Skywalker as she created further illusions of attacking blood eaters. Skywalker was shocked to see Frija and was convinced by S'ybll's story that Frija had become a Rebel scout. When Skywalker asked about the Jedi woman he had come to investigate, S'ybll told him that she had been killed by the blood eaters. Skywalker was unconvinced and began to sense the deception despite S'ybll conjuring more illusions. Although she made one last attempt to convince him by showing an image of Frija being attacked by a blood eater, Skywalker had surmised S'ybll's presence, seeing through the charade."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Although Skywalker assumed that S'ybll wanted revenge, the mind-witch instead offered her proposal for an alliance. Skywalker was disgusted by the idea, and even when S'ybll threatened to have her blood eater kill the Rebel scouts, Skywalker refused. Upon his refusal, S'ybll released her blood eater, which headed for the two scouts. Skywalker immediately jumped into the pit with his lightsaber to defend his compatriots. Using her illusions, she attempted to help her beast defeat Skywalker, but his skills were too great and he quickly killed the blood eater. Defeated, S'ybll opened up a hatch in the pit which began to flood the chamber with water, and then sealed the pit with a blast door. However, Skywalker was able to cut a hole in the trap, helping the scouts escape the rising water. Unwilling to admit defeat, S'ybll conjured more illusions, but Skywalker helped Glaennor and Thorsim see through them."}, {"tag": "p", "text": "Forced to use her telekinetic powers, S'ybll threw stones at the Rebels, but Skywalker was able to defend them. As the mind-witch increased the intensity of her attack, Skywalker noticed that the base contained the same stone columns that he had seen on Seidhkona. Realizing that the columns were helping S'ybll to increase her powers, he used his lightsaber to cut through the columns to S'ybll's horror. Out of options, S'ybll dove at Skywalker and tackled him to the floor, intending to drain his life force as quickly as she could. However, the attempt was interrupted by the roof of the base exploding in a hail of blasterfire. Skywalker's droid, R2-D2, piloting the Rebel's X-wing starfighter, had used it to open a hole into the base after determining that his master was in trouble."}, {"tag": "p", "text": "In the confusion, S'ybll lost hold of Skywalker who rolled away from her grasp. Refusing to give up, S'ybll dove at her prey in one last desperate attempt. However, Skywalker used the Force to pull his lightsaber, which had been lost in the melee, into his grasp. Igniting the weapon just as S'ybll was lunging towards him, the Rebel drove the blade straight through her chest. As Skywalker deactivated the weapon, S'ybll said her final words to the would-be Jedi and fell to the floor, dead."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Despite having killed S'ybll with his own weapon, Skywalker did not trust his own senses. He commanded R2-D2 to land the X-wing and come into the base. After the astromech droid had confirmed with his sensors that S'ybll was truly dead, Skywalker finally believed her to be truly gone. With her death, Skywalker surmised that the last of the mind-witches had perished."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a mind-witch, S'ybll was extraordinarily long-lived and had inherent psychic abilities which she could use to read thoughts and create illusions in the minds of her victims. She could use these powers to create a psychic link between herself and her victims. After forging this link, S'ybll could slowly drain the life energy from her victims. This action would replenish her own energy, allowing her to become youthful in appearance. S'ybll believed that draining the life forces of more powerful individuals, such as Luke Skywalker, could make her more powerful."}, {"tag": "p", "text": "S'ybll also had powerful telekinetic abilities. During her battle with Skywalker, she was able to topple large stone structures and throw rubble through the air at her enemy. S'ybll's telekinetic powers were augmented by the stone columns in her home, giving her greater power to manipulate the landscape. When these columns were destroyed, her powers weakened. S'ybll's telekinesis was limited, and overuse of her powers could significantly weaken her. During her attack on Seidhkona, she overexerted herself, causing her to collapse in exhaustion."}, {"tag": "h2", "text": "Personalities and traits"}, {"tag": "p", "text": "In her common form, S'ybll had a withered, wrinkled appearance. Her skin was covered in warts, and her hair was long and white. After ages spent on Seidhkona, her hair was filthy, and her yellowed teeth guarded terrible-smelling breath. She had a bony appearance with long fingernails and was very skinny. She clothed herself in an outfit of animal skins and kept this appearance over the years despite access to other materials. However, after draining individuals of their life energy, S'ybll took on a youthful appearance with smooth skin and long red hair. S'ybll enjoyed appearing youthful and wished to drain individuals to maintain this appearance. S'ybll kept the bodies of her victims after draining them of their life force. She used the skull of one of her victims as a candle, and after eliminating the Imperial force on Tarnoonga, she kept the bodies in cargo containers."}, {"tag": "p", "text": "S'ybll was a long-lived individual who had lived on the planet Seidhkona for ages before she came in contact with Imperials. She was a cruel and selfish individual and had no compunctions about draining and killing others to maintain her youth. After encountering Luke Skywalker, she hoped to ally herself to him so that he would give her further victims to drain. Upon his refusal, she was greatly angered. S'ybll had a dangerous prideful streak and enjoyed the enhanced abilities that the stone columns on Seidhkona and Tarnoonga afforded her. The mind-witch was afraid to be away from these structures which granted her enhanced power, which is why she had spent such a long time on Seidhkona and had sought out the same type of structure on Tarnoonga. Skywalker was able to use S'ybll's pride against her on both of his encounters with her, tricking her into exhausting her powers in order to destroy the defiant Rebel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "S'ybll was created by Archie Goodwin and illustrated by Al Williamson for use in the Star Wars comic strip story The Paradise Detour, published by the Los Angeles Times Syndicate. This story was later reprinted by Dark Horse Comics in Classic Star Wars 17 and 18 These reprints colored the originally black-and-white comic strip panels and reordered some of the comic panels, removing redundant parts of the storyline. S'ybll was later referenced in the article ComicScan: Star Wars...On A Daily Basis in issue 2 of Star Wars Galaxy Magazine, which noted her as an original creation by the comic strip. Two later articles in Star Wars Galaxy Collector magazine also discussed S'ybll's exploits during the comic strip. ComicScan: Coming Full Circle in issue 3 referenced the storyline that S'ybll was involved in, and ComicScan: Luke-ing for Love in all the Wrong Places in issue 7 mentioned Skywalker's short-lived attraction to S'ybll."}, {"tag": "p", "text": "Although S'ybll appeared to die at the end of The Paradise Detour, she later appeared in the book A New Hope: The Life of Luke Skywalker, which revealed that she had survived her fight with Luke Skywalker. The book, written by Ryder Windham, was dedicated to the memory of Archie Goodwin and included a written recreation of The Paradise Detour and a conclusion to S'ybll's story. The mind-witches, the species that S'ybll belonged to, were given an entry in The Complete Star Wars Encyclopedia, and she also received an entry in A Guide to the Star Wars Universe, Second Edition, Revised and Expanded. The Essential Reader's Companion gave a summary of The Life of Luke Skywalker and identified the planet that appeared in The Paradise Detour as Seidhkona, a fact that did not appear in the original comic. S'ybll was mentioned as the first appearance of witches in the Star Wars universe in Everything You Always Wanted to Know about the Nightsisters but Were Afraid to Ask, an article in Star Wars Insider 122."}, {"tag": "p", "text": "The Essential Reader's Companion states that S'ybll was a Human female belonging to the mind-witch order. However, The Complete Star Wars Encyclopedia states that \"mind-witches\" were a separate humanoid species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}