{"url": "Ryyk_blade/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Swords", "Category:Wookiee weapons"], "nodes": [{"tag": "h1", "text": "Ryyk blade"}, {"tag": "p", "text": "Ryyk blades were traditional swords constructed and used by the Wookiees of Kashyyyk."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The design of these weapons varied greatly between individuals since all ryyk blades were handcrafted. Generally, the blade was a broad, curved design and the handle was wrapped in leather. Ryyk blades were considered an extension of the wielder, much like the Wookiee relationship with their bowcasters. The average weight of a ryyk was around fifteen kilograms,[source?] but Wookiees could wield them with surprising speed and grace. Wookiees would sometimes wield two blades at the same time in a graceful and deadly two-weapon fighting style. Because of its exotic design and craftsmanship, a user required training to wield a Ryyk blade proficiently."}, {"tag": "p", "text": "For a non-Wookiee to use the ryyk without earning the right to do so was an insult to most Wookiees. A non-Wookiee would be advised to be able to understand Shyriiwook and provide a good explanation why they were using the weapon. Trandoshan slavers would carry ryyk blades from captured Wookiees just to mock them."}, {"tag": "p", "text": "A variant blade of the ryyk blade was called the ryyk kerarthorr."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The blade was first developed when the Wookiees were still technologically primitive; they were used for clearing paths through the thick forests of Kashyyyk and fending off vicious predators and other attacking animals. They were also used for hunting, and if necessary, combat."}, {"tag": "p", "text": "The Wookiee Chieftain Attichitcuk once killed a pack of twenty katarns using a single ryyk blade, though he kept his achievement secret until his son Chewbacca happened to find the katarn claws years later."}, {"tag": "p", "text": "Ryyk blades were used heavily by Trandoshan slavers during the Clone Wars and by Wookiee Berserkers during the Galactic Civil War. Aurra Sing, a bounty hunter, used the weapon. Wookiees armed with ryyk blades came to the defense of Princess Leia Organa Solo while she was pregnant on Kashyyyk to protect her from Grand Admiral Thrawn's Noghri Death Commandos."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Agents of Chaos Duology, the blades are misspelled as \"ryyyk\" blades."}, {"tag": "p", "text": "In Rebel Force: Hostage, the blade of Chewbacca  is misspelled as a \"ryk\" blade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}