{"url": "S%27Too_Vees", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alliance Military officers", "Category:Humans", "Category:Males", "Category:Mechanics"], "nodes": [{"tag": "h1", "text": "s'Too Vees"}, {"tag": "p", "text": "s'Too Vees, a Human male, was a gambler who was present in the Bespin mining complex of Cloud City during the Galactic Empire's subjugation of the city in 3 ABY. Vees evacuated Bespin and followed former Cloud City Baron Administrator Lando Calrissian to the Alliance to Restore the Republic. Vees rose to the rank of lieutenant and served the Alliance as a dock mechanic. In 4 ABY, he operated a holoprojector during the briefing before the Alliance's attack on the second Death Star. Vees intentionally turned down an opportunity to serve in the rear guard in order to work on Calrissian's starship, the Millennium Falcon."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male gambler s'Too Vees was present in Cloud City, a Tibanna gas mining colony of the gas giant Bespin, by 3 ABY. When Imperial forces under the command of the Dark Lord Darth Vader seized control of Bespin in that year, Cloud City Baron Administrator Lando Calrissian ordered the evacuation of his complex. Vees followed Calrissian from Cloud City and joined the ranks of the Alliance to Restore the Republic, where he found work as a dock mechanic, installing cannons on starfighters and eventually attaining the rank of lieutenant."}, {"tag": "p", "text": "In 4 ABY, when the Rebel Alliance learned of the location of the Empire's new second Death Star battlestation, in construction over the Forest Moon of Endor, the Alliance command devised a plan to destroy the station before its construction could be completed. In a briefing aboard the Mon Calamari Star Cruiser Home One, flagship of the Alliance Fleet, Vees operated a holoprojector illustrating the plan for the upcoming battle: a Rebel strike team would deactivate the Death Star's deflector shield on the Endor moon, and then a starfighter force would fly into the battlestation and destroy its main reactor."}, {"tag": "p", "text": "Calrissian, having been promoted to general, would lead the fighter assault. In preparations for the battle, Vees was offered an assignment in the rear guard but turned it down in order to work on Calrissian's starship, the Millennium Falcon, borrowed from Rebel General Han Solo, who was leading the Endor ground assault team."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Vees, like Calrissian, was a gambler. When Calrissian left Cloud City in order to escape the Imperial occupation, Vees followed him, joining the Rebel Alliance. Later, when Vees was offered a position in the rear guard, he turned it down in favor of working on Calrissian's vessel. Vees could operate a holoprojector. During the briefing before the Battle of Endor, Vees wore a headset while operating the holoprojector. He was light-skinned and had brown hair."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character s'Too Vees first appeared as an unnamed and uncredited extra in the 1983 film Star Wars: Episode VI Return of the Jedi, in which he is shown at the controls for the holoprojector during the Rebel briefing before the Battle of Endor. His name and additional details were provided on the \"Lieutenant s'Too Vees\" card for the July 2000 Death Star II Limited expansion set of the Star Wars Customizable Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}