{"url": "Ryst%C3%A1ll_Sant/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Females", "Category:Max Rebo Band members", "Category:Near-Human Hybrids", "Category:Slaves", "Category:Theelins"], "nodes": [{"tag": "h1", "text": "Rystáll Sant"}, {"tag": "p", "text": "Rystáll Sant was a female Theelin/Human dancer who worked for the Max Rebo Band. She was a near-Human hybrid, born to a Theelin father and a Human mother."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Rystáll never knew her biological father. Her mother, Cyl Sant, abandoned her as a baby after they moved from New Bornalex to Coruscant. There she was adopted by an Ortolan couple who worked as musicians. Rystáll became a dancer in their performances."}, {"tag": "p", "text": "In her younger days, Rystáll was a patron of the Galaxies Opera House, seen wearing only the finest attire. Following the end of the Clone Wars, Rystáll and her adoptive parents were enslaved by the Black Sun crime lord Xizor who had apparently become infatuated with the young dancer, though since he later put up the Sant family for a wager in a heated sabacc game, he seemed to care little for his slaves. Fortunately for Rystáll and her parents, a young Lando Calrissian won them in that very sabacc game.[source?] Lando despised slavery and set the trio free. The Ortolans then contacted their friend Max Rebo, who agreed to hire Rystáll as a dancer and backup singer for his band."}, {"tag": "p", "text": "Rystáll performed in Jabba's Palace on Tatooine during Luke Skywalker's attempt to rescue his friend Han Solo. Rystáll's graceful form and beautiful, exotic features, accentuated by her luxurious szona body glove, managed to attract the attention of bounty hunter Boba Fett, who engaged in conversation with the dancer prior to Leia Organa's arrival at the palace."}, {"tag": "p", "text": "Rystáll, along with Greeata Jendowanian (who had danced with her at Jabba's Palace), later joined a band known as The Palpatones. Although Greeata served as lead singer, as part of the band, Rystáll still gained fame for her musical ability. Her tenure with The Palpatones eventually brought her to Nar Shaddaa, where she met fellow Theelin Shug Ninx. While on Nar Shaddaa, Rystáll discovered that her father was among the last of the Theelin species. She then left The Palpatones in order to locate information on who her father was."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rystáll was first seen in the extended musical number in the Special Edition of Return of the Jedi, where she was played by dancer Mercedes Ngoh."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}