{"url": "S-161_%22Stinger%22_XL", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Yacht classes"], "nodes": [{"tag": "h1", "text": "S-161 \"Stinger\" XL"}, {"tag": "p", "text": "The S-161 \"Stinger\" XL was a model of luxury yacht manufactured by Latero Spaceworks. Built for wealthy executives, the Stinger was fast and elegant, unique among the utilitarian starships used by the Galactic Empire. Five years after Order 66, Greez Dritus piloted one such yacht, known as the Stinger Mantis."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Spaceframe"}, {"tag": "p", "text": "The Stinger class used a rotating wing design, similar to other spacecraft such as the T-6 Shuttle and Kom'rk-class fighter/transport. Unlike these spacecraft, Stingers had an asymmetrical wing, with a large stabilizing fin counterbalancing an engine pod. The wing was used for both atmospheric and space maneuvering. The standard position of the wing in-flight was with the engine pod rotated to be directly below the hull. To turn left, the wing was rotated counterclockwise and vice versa to turn right. In order to allow the Stingers to land on uneven or crowded areas, such as in a small spaceport, the engine pod was rotated until horizontal while the stabilizing wing continued to rotate until it reached a vertical position, creating a 90-degree angle. It was unknown if it is possible to land Stingers in small hangar bays, like those of Star Destroyers or MC 80 Star Cruisers. Another unique feature of the Stinger was the belly-mounted cockpit. To compensate for the reduced visibility by blocking the ceiling, a significant portion of the floor was replaced with transparisteel.[source?]"}, {"tag": "p", "text": "The dual laser cannons were located in the bow, above the cockpit. While this was light armament for a ship of its size, Stingers were classified as Luxury Yachts and, in all likelihood, most Stingers saw little action.[source?]"}, {"tag": "h3", "text": "Propulsion"}, {"tag": "p", "text": "Stingers used a horizontally-mounted pair of engines at the rear of the hull for primary propulsion and an outboard engine pod for secondary propulsion and maneuvering. Stingers also came equipped with a hyperdrive and navigation unit.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}