{"url": "S2R(A)_Science_Droid", "categories": ["Category:Legends articles", "Category:First-degree droid models", "Category:TelBrinTel Corporation products"], "nodes": [{"tag": "h1", "text": "S2R(A) Science Droid"}, {"tag": "p", "text": "The S2R(A) Science Droid was a civilian adaptation of the Science Research Droid created by the TelBrinTel Corporation. Like that droid, it was a vaguely humanoid unit measuring 1.9 meters in height, with two fine-control manipulator arms and legs possessing a suspension system that cushioned its steps. It was built with an advanced protocol chip for communicating with organic scientists, a molecular microscope and sophisticated olfactory analysis technology, and an \"endosystem\" designed to mount accessories on six ports located in its upper torso."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The S2R(A) was a first-degree droid measuring 1.9 meters tall and having a vaguely humanoid appearance. It possessed a highly advanced protocol chip in its droid brain, enabling it to engage in \"creative brainstorming\" sessions with living coworkers. Its optic sensors contained a high-powered, multi-spectrum molecular microscope, and it possessed olfactory sensors and an olfactory analysis package. Its two arms were designed for fine control and manipulation, and its legs were equipped with a suspension system that protected unstable chemicals and compounds from potentially dangerous jarring. The droid was equipped with an \"endosystem,\" which provided six ports for the attachment of accessories such as additional arms, small tools, or injection needles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The original S2R Science Research Droid was built to the specifications of the Galactic Empire by the TelBrinTel Corporation for use in the Imperial Military's chemical and biological weapon programs, and also for research into new armor and power-guidance systems for the Imperial Navy. The droid's performance was regarded as a marked success, leading to production of a civilian-oriented model. This model, the S2R(A), performed many of the same functions as the initial model, though hardwired protocols prevented the droids from knowingly working on weaponry or projects with military applications. These protocols could be bypassed, but secret programming installed by TelBrinTel would then kick in, causing the modified droid to modify chemical formulas so that the resultant products were inert."}, {"tag": "p", "text": "The droid was featured in Version 4.7.110 of Cynabar's Droid Datalog, which discussed both the S2R and S2R(A) models. There, droid inventor and collector Toria Tell added commentary to the droid's entry, informing readers of the surreptitious programming added by TelBrinTel to thwart those who bypass the hardwired protocols of the S2R(A). Another reader, a slicer using the pseudonym \"Ranger,\" confirmed Tell's information. Ranger had been hired by Rebels to remove such safeguards in similar droids, and noted that the TelBrinTel subroutines were quite subtle, hard to locate, and deeply ingrained in the droid's systems."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}