{"url": "S-R6", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured article nominations", "Category:Assassin droids", "Category:Collectors", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "S-R6"}, {"tag": "p", "text": "S-R6, also known as Essar, was an assassin droid active during the Galactic Civil War. For each mission, he had his central programming and circuits transferred to a different droid shell for the purposes of disguise. S-R6 developed an enthusiasm about firearms, which affected his personality traits, and came to own a private collection of guns from throughout the galaxy. He also employed a protocol droid, T-3PO, as a valet and go-between."}, {"tag": "p", "text": "At some point, an underground droid enclave on the planet Trevura hired S-R6 to assassinate Trevura's Imperial governor, Merno Blask. In response, the governor arranged for Imperial stormtroopers to field-test experimental anti-droid blaster rifles in the streets of Voma, a city on Trevura. A group of Rebel Alliance agents also present in Voma eventually fought and killed two of the stormtroopers carrying the inhibitor guns. Shortly after the firefight, the Rebels came into contact with S-R6, who was masquerading as an ASP-series labor droid at the time. When the group visited the garage the assassin droid was using as a hideout, S-R6 expressed his eager interest in the dead troopers' inhibitor guns. The garage was then attacked by another group of stormtroopers, and after S-R6, T-3PO, and the Rebels defeated the Imperials, the assassin droid escaped his hideout with the pair of the inhibitor guns."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Mission to Trevura"}, {"tag": "p", "text": "S-R6, also known as Essar, was an assassin droid active during the Galactic Civil War. He invested in a 3PO-series protocol droid, T-3PO, to act as his valet and go-between. Due to the dangers involved in his profession, S-R6 armed T-3PO with a hold-out blaster and programmed him in its use, eventually coming to think of the protocol droid as a useful ally."}, {"tag": "p", "text": "At some point between 0 BBY and 5 ABY, an underground droid enclave on the planet Trevura hired S-R6, who arrived from off-world, to kill the local Imperial governor, Merno Blask. The assassin droid subsequently established a hideout in a landspeeder garage in Trevura's capital city, Voma. When Blask learned that a droid would attempt to kill him, the governor was afraid that it would be a high-level assassin like IG-88. In response, Blask arranged for an Imperial research-and-development team to carry out a field test of the inhibit setting, a recently developed blaster mode of operation designed to disable droids, in Voma."}, {"tag": "p", "text": "As part of the test, Imperial stormtroopers were equipped with blaster rifles outfitted with the inhibitor setting. On a day before S-R6 planned to assassinate Blask, stormtroopers patrolled the city's streets, ionizing any nearby droids under the pretense of the latter having gone rogue. Meanwhile, a spy eye droid employed by S-R6 observed the Imperial activities."}, {"tag": "h3", "text": "Meeting Rebel agents"}, {"tag": "h4", "text": "A collector's interest"}, {"tag": "p", "text": "By the same time, the Rebel Alliance had dispatched a group of individuals to Trevura. The Rebel agents were to safely escort an astromech droid carrying sensitive information about Imperial weapons research off the planet. In Voma, a pair of stormtroopers attempted to disable and search the astromech droid, leading to a short firefight in which the group killed the two troopers. After the skirmish, S-R6's spy eye droid, which had witnessed the incident, flew away to report to its master."}, {"tag": "p", "text": "Shortly thereafter, the Rebel agents came into contact with S-R6, who was masquerading as an ASP-series labor droid, and visited the assassin's garage. There, the droid dropped his pretense and expressed his eager interest in the inhibitor guns. In response to the Rebels' inquiries, S-R6 very patiently revealed nearly everything regarding his assignment on Trevura but constantly kept bringing the conversation back to the inhibitor guns."}, {"tag": "h4", "text": "Garage firefight"}, {"tag": "p", "text": "Eventually, a group of stormtroopers that had been summoned by the Imperial technicians observing the testing of the inhibitor weapons attacked the garage. An intense firefight ensued, with S-R6 leading the Rebel group and T-3PO by tossing stun grenades at the Imperial soldiers, two of whom concentrated their fire at the wildly dangerous assassin droid. The droid and his allies emerged victorious, after which S-R6 quickly thanked the Rebel agents for their help and then escaped with the inhibitor guns while the Rebels expeditiously took the astromech droid off-planet aboard their starship."}, {"tag": "p", "text": "The group of Rebel agents encountered S-R6 again on several further occasions, during each of which the assassin was undercover in a new droid shell and on a mission to either eliminate a target or add a new gun to his collection. During each such meeting, S-R6 remembered the \"inhibitor incident\" on Trevura, and when the Rebels attempted to convince the droid to join the Alliance, he was willing to do so, albeit only because it would provide him with opportunities to travel and obtain new firearms."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "A cordial assassin"}, {"tag": "p", "text": "As an assassin droid, S-R6 was proficient in the use of such weapons as blaster pistols, blaster rifles, slugthrowers, vibroweapons, and assorted heavy, simple, and vehicle-mounted weaponry, as well as light, medium, and heavy armor. In combat, the droid could perform skilled shots at point blank distance. S-R6 also possessed a variety of skills less directly related to his trade, such as gun craftsmanship and piloting, was very proficient in repairing technology and using explosives, and had extensive knowledge of munitions. S-R6 was also skilled in the use of computers and was able to program the protocol droid T-3PO to use a hold-out blaster, although the latter droid was not a very good shot. The droid could also read, write, and speak Galactic Basic Standard."}, {"tag": "p", "text": "Despite his violent profession, S-R6 had a friendly—even cordial—masculine personality. Following the \"inhibitor incident\" on Trevura, he regularly recalled with fondness the Rebel agents he had encountered during that event. However, although during the fighting in his garage S-R6 attempted to avoid catching the Rebels in the blast of his stun grenades, he was eager to down his opponents and did not sacrifice a good shot for his allies' benefit. Furthermore, the droid felt determined to both kill the bigoted Governor Blask and destroy his anti-droid prejudices."}, {"tag": "h3", "text": "Collector in disguise"}, {"tag": "p", "text": "At some point, S-R6 became overly enthusiastic about guns, to the point that his behavior became affected and he began using only gun-related metaphors in his speech, with even casual conversation with him sounding threatening as a result. The droid became a connoisseur and avid collector of various firearms from around the galaxy, constantly seeking to add new or exotic weapons to his private collection. He was very interested in acquiring prototype Imperial weapons, with his interest as both a professional and collector being peaked by the inhibitor guns on Trevura. In addition to the information on the inhibitor weapons he gained from his spy droid, S-R6 was also interested in learning about the various experiences related to the firearms' use, such as the feeling one had when hit by a blast from the gun, or how a Human would hold one of the weapons."}, {"tag": "p", "text": "In order to ensure anonymity, for each mission S-R6 had his central programming and circuits transferred to a different droid shell. For the mission on Trevura, he adopted the look of a battered ASP-series labor droid. During that time, S-R6 was equipped with a heuristic processor and a vocabulator and had infrared vision and locked access capabilities. Due to his ability to see in the dark, S-R6 once forgot that organic beings frequently needed light to see. As part of his labor droid disguise, S-R6 pretended to be very stupid and only communicated in public by using the words \"affirmative\" and \"negative.\" In the privacy of his garage, however, the assassin droid communicated via surprisingly fluent speech."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the \"inhibitor incident,\" S-R6 carried two guns, one of which was a standard blaster rifle, and six stun grenades. The droid concealed all of the weapons on his body, allowing him to appear unarmed. The droid was expecting to be more heavily equipped on the day he would attempt to assassinate his target, Governor Blask. While on Trevura, S-R6 also employed the protocol droid T-3PO as well as a hovering spy eye droid similar to a M-TD miniaturized translator droid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "S-R6 was created for \"Gun Nut,\" a roleplaying mini-adventure for the Wizards of the Coast Star Wars Roleplaying Game written by Jeff Quick and published on Wizards.com on April 11, 2002. \"Gun Nut\" presents two possible scenarios of events that depend on the player-characters' actions concerning the two inhibitor guns of the stormtroopers they kill in the streets of Voma. If the characters pick up the weapons, S-R6 instructs his protocol droid go-between, T-3PO, to approach them and offer 600 credits for both weapons. If the characters agree to the deal, T-3PO leads them to S-R6's garage, where the assassin droid greets the characters and personally continues the negotiation for the weapons."}, {"tag": "p", "text": "If the characters do not pick up the inhibitor guns, they are then collected by S-R6 in the disguise of a labor droid performing cleanup on behalf of the Trevura government. The \"labor droid\" then beckons for the characters to follow to his garage, upon which they can either choose to ignore the droid and quickly make preparations to leave the planet or follow him to his hideout, where S-R6 proceeds to question the characters about their experience with the inhibitor guns. Regardless of which scenario the player-characters follow, they end up in S-R6's garage, proceeding to the remaining part of the adventure. This article assumes the adventure plays out as described."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}