{"url": "S40K_Phoenix_Hawk-class_light_pinnace", "categories": ["Category:Legends articles", "Category:Galactic Republic starfighter classes", "Category:Kuat Systems Engineering products", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "S40K Phoenix Hawk-class light pinnace"}, {"tag": "p", "text": "The S40K Phoenix Hawk-class light pinnace was a predecessor to the famous Firespray-31-class patrol craft."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Phoenix Hawk-class was designed to carry a small group of individuals across large distances of space."}, {"tag": "p", "text": "The design goals were admirable: create a personal transport craft that was affordable by all classes of society, bringing space travel to as many beings as possible. However, in order to accomplish this goal, KSE cut as many corners as possible to keep costs down so as to not limit their sales to the wealthy."}, {"tag": "p", "text": "Accommodations within the Phoenix Hawk-class were cramped at best, and there were few amenities to be had for refitting the ship. In a twist of irony, the resulting craft was so spartan that the rich elite of the galaxy showed no interest in it whatsoever."}, {"tag": "p", "text": "Compounding these problems was the ungainly appearance of the Phoenix Hawk-class pinnace, which resembled an overweight version of the Firespray-31-class. It measured 19.2 meters in length, and could accommodate up to four passengers."}, {"tag": "p", "text": "The Phoenix Hawk-class required only a single pilot to operate but allowed for a co-pilot to assist as a gunner and in operating the craft. It was decently armored and well-armed, being outfitted with a pair of heavy blaster cannon and two light ion cannon for defense. As such it was a more-than-capable starship suitable for making long-distance trips into the dangerous and distant sectors of the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Designated the S40K, the Phoenix Hawk-class pinnace was one of the first ships designed and built by Kuat Systems Engineering, during the years leading up to the Clone Wars. Sales of the Phoenix Hawk remained steady during near the end of the Galactic Republic, but declined during the period of the Galactic Empire."}, {"tag": "p", "text": "When Kuat Systems Engineering was absorbed back into Kuat Drive Yards, the series was discontinued. Once a common sight of the Old Republic, the Phoenix Hawk-class pinnace faded into obscurity during Palpatine's reign, and became virtually unknown by the time of his defeat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Living Force campaign, the Phoenix Hawk is one of only three choices of starfighters available for purchase by players; the other two being the Z-95 Headhunter and the Gun tug. Being the only starfighter available with an integral hyperdrive, it has tended to be the default starfighter of choice amongst the players in the campaign."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}