{"url": "Bahm_Gilyad", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Healers and doctors", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bahm Gilyad"}, {"tag": "p", "text": "Bahm Gilyad was a male doctor who lived during the Great Hyperspace War fought between the Galactic Republic and the Sith Empire. During the war, he formalized the rules and responsibilities of the medical profession, which included ideas for doctors to maintain themselves mentally and physically. His role in formalizing the medical profession was still known by the time of the Clone Wars, a conflict fought between the Republic and the Confederacy of Independent Systems that occurred nearly five thousand years after the Great Hyperspace War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male doctor, Bahm Gilyad was alive during the time of the Great Hyperspace War, which was fought between the Galactic Republic and the Sith Empire in the year 5000 BBY. During the conflict, Gilyad formalized the rules and responsibilities of the medical profession, which included many of his ideas on maintaining a physician's health, both physically and mentally. He documented his rules for practicing medicine in a form that survived for many centuries. In 20 BBY, while a battle raged on the planet Drongar during the Clone Wars that raged between the Republic and the Confederacy of Independent Systems, the Galactic Republic surgeon Jos Vondar thought about a quote by Gilyad when listening to his friend Zan Yant play the quetarra while stationed at Republic Mobile Surgical Unit 7."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a healer, Bahm Gilyad was influential enough to establish rules for practicing medicine that were still used nearly five thousand years later. He also thought in detail about how physicians should maintain their mental and physical health."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bahm Gilyad was first mentioned in MedStar I: Battle Surgeons, a 2004 Clone Wars novel written by Michael Reaves and Steve Perry as the first book in the MedStar duology. The novel mentions that Gilyad lived five thousand years before the events of the book during the Stark Hyperspace Conflict, but the conflict that occurred around that date was known as the Great Hyperspace War. As Bahm Gilyad's 2008 entry in The Complete Star Wars Encyclopedia mentions that he lived five thousand years before the Clone Wars, this article treats the mention of the Stark Hyperspace Conflict as an error. In addition, neither source identifies his species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}