{"url": "Bahryn", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Arkanis sector moons", "Category:Geonosis system", "Category:Ice moons"], "nodes": [{"tag": "h1", "text": "Bahryn"}, {"tag": "p", "text": "Bahryn was one of fifteen moons that orbited the Outer Rim planet Geonosis. In stark contrast to Geonosis' arid climate, Bahryn was a frigid world, reaching temperatures that only those who were adapted to the intense cold, such as the moon's native bonzami, were capable of surviving."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Three years before the Battle of Yavin, the rebel Garazeb Orrelios and ISB Agent Alexsandr Kallus crash-landed on the moon in an escape pod after a failed Imperial ambush on a construction module in orbit around Geonosis. The two opponents were engaged in single combat when Kallus followed Zeb into one of the station's escape pods, which was soon damaged when the two continued their fight onboard the pod and Garazeb kicked Kallus into the pod's controls, damaging them and causing it to crash-land into a cave on the moon. Realizing they would have to overcome their differences in order to survive on the frigid world, Garazeb gathered a power generator to heat them both up and repaired a transponder, which they found did not have a strong enough signal to penetrate the thick ice."}, {"tag": "p", "text": "After a while, the power generator ran out and Zeb replaced it with a salvaged hot meteorite that had landed there before their arrival. Soon after, the pair were attacked by a lone bonzami, which they managed to fend off through combined fire from their bo-rifles. Formulating an escape plan, Garazeb climbed up the ice pillars supporting the cave with Kallus on his back. On the way up, two bonzami emerged, however, the pair managed to narrowly escape through the hole punched in the ceiling by their pod. Upon reaching the surface, Garazeb reactivated the transponder, notifying the rest of the Spectres onboard the Ghost of their location. However, Kallus decided to stay behind and wait for the Empire and said his farewells to Garazeb before he left for the Ghost."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}