{"url": "SD-K4_assassin_droid", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Assassin droid models", "Category:Baktoid Combat Automata products", "Category:Imperial droids"], "nodes": [{"tag": "h1", "text": "SD-K4 assassin droid"}, {"tag": "p", "text": "The SD-K4 assassin droid, also known as the assassin probe, or the assassin probe droid, was a model of assassin droid manufactured by Baktoid Combat Automata. Used by the Confederacy of Independent Systems during the Clone Wars, it was also referred to as the Separatist assassin probe and Separatist assassin droid."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A fourth class droid, the SD-K4 assassin droid manufactured by Baktoid Combat Automata was designed to assassinate targets with high efficiency. Spider-like droids programmed for quiet killing, assassin probes moved quietly on eight razored legs they could use to lurk silently in for the kill. They were equipped with multiple red photoreceptors for scanning their surroundings. If cornered or destroyed, an SD-K4 could release thirty smaller SD-K4a mini-assassin droids from pores on its head to finish any job the assassin probe started."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Manufactured by the Techno Union, SD-K4 assassin droids were used by the Confederacy of Independent Systems during the Clone Wars. As the Galactic Republic's highest echelons began disappearing, it suspected the use of assassin probes. In the year 21 BBY, Tal Merrik, senator of Kalevala and a secret Death Watch sympathizer, smuggled three SD-K4s aboard the spaceliner Coronet to assassinate Satine Kryze, duchess of Mandalore. After one of the droids killed clone troopers \"Mixer\" and \"Redeye,\" their companions discovered their presence and a battle ensued in the cargo hold. The trio and their probe killers were then destroyed before they could eliminate their target, though not before causing more casualties amongst the clones and interrupting the senators' dinner."}, {"tag": "p", "text": "After the Clone Wars, the Techno Union was absorbed by the Galactic Empire, who used their assassin probes during the Galactic Civil War. The Rebel Alliance also modified some for combat and provided them to Saponza's Gang."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}