{"url": "SD-XX", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Alliance Guard personnel", "Category:Masculine programming", "Category:Security droids", "Category:Tendrando Arms products"], "nodes": [{"tag": "h1", "text": "SD-XX"}, {"tag": "p", "text": "SD-XX, or Double-Ex, was a fourth-degree SD-X-series personal security droid built by Tendrando Arms. Jacen Solo had him onboard his personal Star Destroyer in 40 ABY."}, {"tag": "p", "text": "SD-XX had thin armor and blue photoreceptors set in a black skull-like face and resembled a scaled-down version of the YVH 1 droid. He had a raspy, threatening voice."}, {"tag": "p", "text": "When Jacen began sensing Jedi presences onboard the Anakin Solo, he immediately called out SD-XX. After Luke Skywalker had confronted Jacen and mysteriously disappeared, Jacen questioned if he had really been there. When he asked SD-XX about it, SD-XX said that Luke had never been there or had a conversation with Jacen. Later, after Luke confronted Jacen about sending his son to assassinate Cal Omas and left he appeared behind Jacen and stated that he was relieved he didn't have to kill him too. To Jacen's astonishment, he managed to make Jacen confess about killing Mara Jade Skywalker after telling him he was letting secrets slip in his sleep. Another secret was his talk about necessary sacrifices and making the galaxy safe for children like his daughter, Allana. Jacen lost his temper, warned him about being converted into torpedo parts, and then sent him to return to his monitoring duties."}, {"tag": "p", "text": "He was later tasked with the torture of Ben Skywalker to extract the location of the Jedi base for Jacen, now Darth Caedus. The attempts failed, and after Ben escaped, SD-XX tracked him to the Carida Nebula, where he attacked his ship. Ben was able to Force push SD-XX out an air lock, and sent him spiraling into space, where he was left drifting."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}