{"url": "SCM-22_stenographer", "categories": ["Category:Legends articles", "Category:Droid models of unspecified degree"], "nodes": [{"tag": "h1", "text": "SCM-22 stenographer"}, {"tag": "p", "text": "The SCM-22 stenographer was a droid first produced by PowerPost in the early years of the New Republic and was made to record and playback important conversations. The SCM-22 was difficult to recognize as a droid due to its unusual design."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The droid was very popular among New Republic officers, however it was originally marketed to busy corporate executives who embarked on frequent business trips."}, {"tag": "p", "text": "The SCM-22 could fit in the palm of a sentient being's hand and was widely used because of its portability and secure encryption facilities."}, {"tag": "p", "text": "With its glossy black finish, it was hard to believe it could ever be more than an executive novelty, however the droid was more than that. The SCM-22 had a pair of short legs that had treaded wheels so that it could move independently. It also had a mini microphone receiver which could record a speaking voice from up to 15 meters away. The droid's memory could hold around 170 hours worth of conversation before it needed a memory wipe."}, {"tag": "p", "text": "It had a small cognitive module within its casing which could separate up to five different conversations and also had the ability to automatically edit out long stretches of silence and background noise."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The SCM-22 was used often by General Etahn A'baht during his tour of duty in and around the Koornacht Cluster. A'baht would often utilize the little droid's limited intelligence and high-pitched vocabulator to his advantage by speaking the word 'activate' which would cause the SCM-22 to find a suitable position to commence recording from followed by 'record' which started the procedure."}, {"tag": "p", "text": "PowerPost originally only sold the droid through authorized dealers, however when the droid became highly sought after by the New Republic the company was forced to widen its field of distribution."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}