{"url": "SD-6_Hulk_infantry_droid", "categories": ["Category:Legends articles", "Category:SD-series battle droid models", "Category:Fourth-degree droids"], "nodes": [{"tag": "h1", "text": "SD-6 Hulk infantry droid"}, {"tag": "p", "text": "The SD-6 \"Hulk\" infantry droid was a predecessor to the Balmorran Arms SD-9 and SD-10 battle droid models, deployed during the last centuries of the Old Republic and the early years of the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The SD-6 was a fourth-degree battle droid manufactured by Balmorran Arms. With a size of 3.5 meters and almost the same width, it was a veritable mountain of a defensive unit. The droid was armed with two E-Web repeating blasters on each arm as well as two Merr-Sonn ion gun rifles on rotating shoulder mounts. It was also equipped with two large arms to defend itself from any enemy that should attempt to overrun or attack it with melee weapons."}, {"tag": "p", "text": "Like its predecessors, the SD-4 and SD-5 models, the SD-6 series was equipped with data illegally acquired from the Empire's Dark Trooper Project, but lacked a heuristic processor. It had a tendency to act single-minded, without being able to think independently. The SD-6 had an integrated comlink and a blue or red photoreceptor, which allowed for telescopic vision. The battle droid also sported duranium armor, which was as thick as a starship's hull in some places and made it virtually immune to the fire of most personal weapons."}, {"tag": "p", "text": "The SD-6 functioned as a mobile, intelligent turret, protecting positions or laying down covering fire. The armament allowed the \"Hulk\" to lay down a barrage of fire, able to fend off both droid and organic infantry assaults. It was most effective against smaller vehicles and large groups of infantry. The droid's low speed, however, made it vulnerable to smaller teams of individuals and mobile infantry units, which could dodge the droid's arcs of fire. The SD-6 also worked well in tandem with regular infantry units in offensive and defensive situations, or as a battle droid commander."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Developed during the last centuries of the Galactic Republic, the \"Hulk\" saw most of its action deployed by the Old Republic as a defensive unit for vulnerable hangar facilities and landing pads. The units provided cover fire for incoming starships and prevented hostile ships from taking off. During the Clone Wars, the Republic initially withdrew the droids from active duty to avoid confusion with the droid forces of the enemy. Service and production would later restart however, with Balmorra producing SD-6's for sale to Republic ground forces alongside B1's meant for the CIS."}, {"tag": "p", "text": "During the days of the Galactic Empire, the original duties of the SD-6 were taken over by smaller and more agile droids, but the SD-6 was still used by the Imperial armed forces. As the series began to be phased out, many units were either scrapped or sold. Although illegal, some crime lords acquired these war droids to protect their personal starships or act as security forces—alone or supported by other minions. Mercenaries also acquired several SD-6 war droids. One of them was used by Trandoshan mercenaries during their attempt to take over the repulsortrain Gem of Alderaan to capture Senator Bail Prestor Organa."}, {"tag": "p", "text": "Although also used by the New Republic, the SD-6 was literally nonexistent during that era, as the SD-9 and SD-10 battle droids had been developed to take its place. The few remaining units that had not been melted down were left to their own devices and abandoned."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}