{"url": "SCr-114", "categories": ["Category:Legends articles", "Category:Assassins", "Category:Bounty hunters", "Category:Maintenance droids", "Category:Masculine programming", "Category:Mercenaries", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "SCr-114"}, {"tag": "p", "text": "SCr-114 or \"Skar\" was originally a maintenance droid aboard the pleasure cruiser Malka'an Eternal, who turned into an assassin droid."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rebirth on Edonaaris"}, {"tag": "p", "text": "When the ship entered an uncharted asteroid field, the biological crew was forced into abandoning it, leaving behind all the droids. The ship eventually crashed on the muddy planet of Edonaaris, most of the droids perishing in the crash. SCr-114 was one of the few \"survivors\". His power core was damaged and his inhibitor routine was destroyed when a power conduit shocked his outer shell. As a consequence, he lost the ability to tell right from wrong as well as all subroutines that would otherwise stop him from making decisions. Moreover, the only motivation active in his system was survival. When a ship of Human scavengers landed near the crash site, his survival instinct told him to get off the planet, and so he killed the Humans and made off with their ship, after having repaired and reprogrammed many of his fellow droids that perished in the crash."}, {"tag": "h3", "text": "Skar's talents"}, {"tag": "p", "text": "SCr-114 registered the ship as the Efficient and changed his own registration code to \"Skar\" and took up a bounty hunter, smuggler, and mercenary career, modifying himself with several hidden weapons. His appearance as a harmless maintenance droid proved to be an advantage as it allowed him to sneak in on victims and evade pursuers. Skar disliked organics, but knew better than to go on violent rampages, since they would surely somehow result in his deactivation by an organic. Therefore he only killed for bounties or in self-defense."}, {"tag": "h3", "text": "Ruthless efficiency"}, {"tag": "p", "text": "He did not carry a preferred trademark weapon, but constantly let his personal armory be modified in the repair facilities of the Efficient. Over the years, Skar grew ever more ruthless and cunning, as his droid brain allowed for quick decision making without too many ethical interferences."}, {"tag": "h2", "text": "Appearances"}]}