{"url": "SD-10_battle_droid", "categories": ["Category:Legends articles", "Category:Battle droids", "Category:SD-series battle droid models", "Category:Fourth-degree droids"], "nodes": [{"tag": "h1", "text": "SD-10 battle droid"}, {"tag": "p", "text": "The SD-10 battle droid was part of the SD-series of Balmorran Arms battle droids. Like preceding models in the series, the SD-10 was a humanoid fighting  droid significantly larger than a human. The model was designed by Umak Leth."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Stronger and more intelligent that its predecessors, particularly the SD-9-series battle droid, the SD-10 was equipped with laser-reflective armor, advanced servomotors, powerful targeting sensors, self-healing metal, and a point-of-impact shield generator. The SD-10's forearms supported a miniature concussion missile launcher/targeter, an extended-fire repeating blaster, and a plasma-burst cannon. The SD-10 also featured an advanced combat sensor package."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Created in 10 ABY during the reborn Emperor Palpatine's campaign, the SD-10 was manufactured in the vast droid foundries of Balmorra. Resentful of the Imperial presence, Governor Hinch Beltane had his engineers, technicians, and designers fit the SD-10s with fast-reaction servos, point-of-impact shield generators, and experimental self-healing metals. Their databanks also contained the tactics programmed into the SD-9s along with foolproof methods of defeating those tactics."}, {"tag": "p", "text": "Following the Emperor's second death at the Battle of Pinnacle Base, the Balmorrans rebelled. In response, the Emperor's Military Executor, Sedriss QL, moved to crush the revolt. Unwilling to resort to planetary bombardment, Sedriss landed ground forces, thus resulting in the Battle of Balmorra. During the battle, the SD-10s were deployed straight from the assembly-lines and bested the SD-9s used by the Imperials. However, they were no match for the new Imperial Shadow Droids. The Balmorrans then deployed their new X-1 Vipers, whose battle performance impressed the Executor enough for a truce to be called between the two warring factions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}