{"url": "SN-1F4_miniature_sifter_droid", "categories": ["Category:Canon articles", "Category:Sifter droid models"], "nodes": [{"tag": "h1", "text": "SN-1F4 miniature sifter droid"}, {"tag": "p", "text": "SN-1F4 miniature sifter droids, or RT sifter droids, were a model of sifter droid. One was present in Niima Outpost on the planet Jakku in the year 34 ABY, shortly before the outpost was attacked by the First Order. Their function was to filter through sand or other loose substances to locate objects such as valuable minerals or salvage."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The SN-1F4 miniature sifter droid was a model of sifter droid. They moved on two treads and consisted of a squat gray body wrapped in tubing and topped with a transparent dome."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 34 ABY, one SN-1F4 unit was present in Niima Outpost on the planet Jakku. It passed two thugs working for the junk dealer Unkar Plutt as they pointed out the scavenger Rey and the BB unit BB-8 to a pair of First Order stormtroopers. Moments later Niima Outpost came under attack from First Order TIE/fo space superiority fighters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A SN-1F4 miniature sifter droid first appeared in the film Star Wars: Episode VII The Force Awakens, which was released in December 18, 2015. The model was not named in the film itself but was identified in Star Wars: The Force Awakens: The Visual Dictionary, a reference book written by Pablo Hidalgo and released in conjunction with the film."}, {"tag": "p", "text": "An SN-1F4 droid is one of the unlockable characters in the non-canon video game LEGO Star Wars: The Force Awakens, which was released on June 28, 2016. In the game's campaign Rey and the First Order deserter Finn uncover the droid on Jakku during their escape from the First Order. They use the sifter droid to uncover parts to repair a weapons emplacement."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}