{"url": "SFS-CR27200_hypermatter_reactor", "categories": ["Category:Legends articles", "Category:Reactors and power generators", "Category:Sienar Fleet Systems products"], "nodes": [{"tag": "h1", "text": "SFS-CR27200 hypermatter reactor"}, {"tag": "p", "text": "The SFS-CR27200 hypermatter reactor was the primary power generator aboard the Galactic Empire's Death Star I battlestation. The reactor was built by Sienar Fleet Systems."}, {"tag": "p", "text": "The reactor was composed of a domed surface up top that was dotted with static discharge vanes, a spherical device at the center, and a prism-shaped base. Within the domed surface were two lines that went out to power distribution nodes, as well as the main power generator between a pair of clean/filtered power manifolds. Leading down into the reactor was the energy exchanger as well as the raw power manifolds below that. The sphere was encased with radiation insulator plating, which covered the containment field coils. Within the reactor itself was the reactor chamber. Connected to the sphere were two large cables. The largest one was the superlaser power diverters, which as indicated by the name diverted raw power to the Death Star's superlaser. The smaller of the two directed energy towards the battle station's hyperdrive, which as indicated diverted raw power to the hyperdrive. At the tip of the lower base were the fuel injectors, which were connected directly to the power diverter manifold control. The tubes led to the primary fuel exciters, which were also connected to the fuel control valves below each of the fuel injectors. All three of the fuel control valves were directly connected to the raw fuel supply lines, which were connected from stellar fuel bottles. Lastly, the base of the reactor also featured two cables. Each of the cables contained the power regulators, which led to the emergency raw power diversion solonoids, and finally to a line out to the power cells."}, {"tag": "p", "text": "The Rebels did not get any visual data on the hypermatter reactor for the first Death Star before they destroyed it, although Lando Calrissian, Nien Numb, and Wedge Antilles did get close up visuals of the Death Star II's considerably larger reactor (including its power transference assembly) late into the Battle of Endor, the imagery of which were later included in Major Arhul Hextrophon's report on the various Death Star superweapons."}, {"tag": "h2", "text": "Sources"}]}