{"url": "ST_321/Legends", "categories": ["Category:Legends articles", "Category:Ship stubs", "Category:Lambda-class T-4a shuttles", "Category:Starships of the Galactic Empire", "Category:Starships of the Order of the Sith Lords"], "nodes": [{"tag": "h1", "text": "ST 321"}, {"tag": "p", "text": "ST 321 was the comm unit designation of Darth Vader's personal Imperial Lambda-class T-4a shuttle."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "ST 321 was equipped with sensor jammers, specialized tactical displays, and other modified features, such as advanced targeting systems. The \"ST\" in the shuttle's designation stood for \"space transport.\" It is escorted by a contingent of TIE/LN starfighters, one of which included Black 11."}, {"tag": "p", "text": "Vader's shuttle featured a meditation chamber aboard similar to the one on his flagship, the Star Dreadnought Executor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One of ST 321's earliest uses was in 18 BBY, where it was returning Palpatine and Vader from Yinchorr. It was boarded by six Stormtroopers cloned from Sa Cuis's genetic template led by the treacherous Emperor's Hand Sheyvan, who intended to usurp Emperor Palpatine during his rule. Vader, alongside Lieutenant Erv Lekauf and cloned Stormtroopers derived from the latter's template, fought back, resulting in Vader killing Sheyvan in a quick duel. Lekauf, however, was severely burned from the fires aboard the vessel."}, {"tag": "p", "text": "Throughout the Imperial Period and the Galactic Civil War, Vader utilized the shuttle for instances that required him to make a personal appearance to motivate the Imperial forces. In 1 ABY, Vader—accompanied by a unit of Triumphant-class dark troopers—used this shuttle during the operations Molecular Clamp, Sieve, Green Light and Take Down to travel to the cities of Bestine, Coronet and Theed, respectively. In addition, he also used the shuttle to travel directly to Theed during Empire Day Festivities to personally present several dedicated Imperial officers with awards for acts of service and loyalty to the Empire. A year later, Vader later used the shuttle to travel to Bespin during its occupation by Imperial Forces to coerce its administrator, Lando Calrissian, who was also a former acquaintance of Han Solo, into delivering him, Leia, and Chewbacca to him. After losing Luke Skywalker during their duel, he used the shuttle to return to the Executor."}, {"tag": "p", "text": "Shortly before the Battle of Endor, the ST 321 brought Darth Vader from the Star Destroyer Avenger to the second Death Star. This was the shuttle Luke Skywalker used to escape the second Death Star along with his deceased father. He managed to get to the shuttle relatively easily as the Imperials were in the middle of an evacuation at the time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Return of the Jedi radio dramatization states that Luke escaped the second death star in Emperor Palpatine's shuttle. The novel The Rise and Fall of Darth Vader counters this by stating that the escape was made in Vader's shuttle. This is supported by Starships of the Galaxy, which states that Palpatine's shuttle was destroyed with the second Death Star."}, {"tag": "p", "text": "The shuttle later reappeared in the 1997 re-releases of The Empire Strikes Back when Vader returned to the Executor during the film's climax, largely due to their reusing the scene of Darth Vader's arrival on the Death Star II from Return of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}