{"url": "ST-series_military_strategic_analysis_and_tactics_droid", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Separatist battle droid models", "Category:Super tactical droids", "Category:Tactical droid models"], "nodes": [{"tag": "h1", "text": "ST-series military strategic analysis and tactics droid"}, {"tag": "p", "text": "The ST-series military strategic analysis and tactics droids, also known as the ST-series super tactical droids or more simply as super tactical droids, were advanced tactical droids that served as commanders of the Separatist Droid Army during the Clone Wars. They were produced to address and correct the flaws of their predecessor model, most notably an inability to quickly adapt to quick-changing enemy strategies."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "In response to the T-series tactical droid's inflexibility, the secessionist Confederacy of Independent Systems commissioned the battle droid manufacturer, Baktoid Combat Automata, to produce the ST-series super tactical droid for use in its military forces during the galaxy-spanning conflict known as the Clone Wars between itself and the dominant Galactic Republic."}, {"tag": "p", "text": "Evolved from their predecessors, the tactical droid had a much more robotic inflection to its voice, as well as a larger, more imposing and armored body. These droids were also able to better process and adapt to sudden changes and unexpected complications and have more variables in their calculations.[source?]"}, {"tag": "p", "text": "Differences aside, the super tactical droid, as with their counterpart in the Separatist Droid Army, was analytical and calculating. Created to digest a situation of battle and formulate the most effective solution with a time frame for its execution, they were dreaded by Republic soldiers and seen as very dangerous to veteran officers."}, {"tag": "h3", "text": "Performance"}, {"tag": "p", "text": "Serving as masterful commanders of the Droid Army, the super tactical droid was highly intelligent and strategic, bane to both the Jedi Order and the Republic Military."}, {"tag": "p", "text": "Though improved from the T-series, flaws in their programming were still prevalent. Such included the reluctance to see approaches and plans that differ from their own, as well as an overconfidence in the Separatists in their war.[source?] Yet where given the independence to act, super tactical droids could direct Confederacy military operations without superior overseers. Programmed with Separatist beliefs, they conquered through fear and the lack of courage and hope in their opponents, fighting for \"freedom from the tyranny of the Republic.\" Prioritizing Confederate success, the super tactical droid would not hesitate utilizing threats and torture as means of interrogation."}, {"tag": "p", "text": "Although the droids were not designed for the purpose of direct involvement in combat, they were capable of self-defense, equipped with the standard Droid Army E-5 blaster rifle. They also weren't above engaging in hand-to-hand combat, even being willing to do so against Jedi on one occasion."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In 20 BBY, Separatist leader, Count Dooku dispatched one such droid, General Kalani, to assist King Sanjay Rash's forces in dealing with the rebels of Onderon. During this time, he worked alongside the Royal Militia's commander, General Akenathen Tandin, as they attempted to capture the rebels in Iziz, which included overseeing the brutal torture of one of the rebel leaders. However, Tandin and his forces then defected and assisted the rebels in freeing Ramsis Dendup during their escape to the highlands. When the rebels were able to defeat the droid gunships, Kalani was then ordered to retreat with his forces to Agamar, despite Rash's objections. Kalani then executed Rash."}, {"tag": "p", "text": "Another super tactical droid, Aut-O was stationed aboard a Providence-class Dreadnought. However, he was destroyed by R2-D2. Another one was given command of a commandeered Venator-class Star Destroyer with the mission to destroy the Republic strategy conference on Valor station in the Carida system. However, when the buzz droids failed in stopping D-Squad, the super tactical droid and it's crew were destroyed before they were able to complete their mission."}, {"tag": "p", "text": "Another super tactical droid, Kraken, served as second-in-command to Admiral Trench. Kraken then attempted to take a captured clone trooper CT-5385 to Count Dooku. However, he was stopped by General Skywalker and two of his 501st Legion troopers. He was then destroyed by Skywalker when he refused to answer his questions. However, he was then rebuilt and commanded the Separatist forces during the invasion of Scipio alongside Dooku. Kraken continued to serve under Dooku aboard his command ship, even when his master, Lord Sidious, demanded his presence."}, {"tag": "p", "text": "A super tactical droid then accompanied General Grievous to Utapau aboard a Separatist supply ship to secure the shipment of a enormous kyber crystal. However, it was destroyed when the Jedi's top members intervened."}, {"tag": "p", "text": "Another super tactical droid served Admiral Trench during the Battle of Anaxes. He was stationed on the bridge of Trench's dreadnought, where he and the Admiral oversaw the attack on Anaxes's Assembly Complex. He was destroyed when Anakin Skywalker stormed the bridge of the ship to get the last sequence from Admiral Trench for a bomb hidden in the plant's fusion reactor."}, {"tag": "p", "text": "During the Outer Rim Sieges in the final days of the Clone Wars, a Super Tactical Droid commanded a legion of battle droids on the planet of Yerbana. He stayed hidden during the battle as to avoid being captured or destroyed by the Republic troops. When his forces began to pin down Obi-Wan Kenobi and Commander Cody and the 212th Battalion, Anakin Skywalker emerged and committed a War Crime by faking a surrender to the Separatist forces. The battle droid commander had the Tactical Droid notified of the surrender, causing him to come out of hiding. He quickly realized that the Jedi was tricking his forces, and ordered them to fire on Skywalker. However, he was quickly pulled to Skywalker using the Force, who swiftly activated his lightsaber and decapitated the droid."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "After the Clone Wars ended, the Galactic Republic transformed into the Galactic Empire and the Separatist Council was assassinated by Darth Vader, who then used the Council's equipment to send a shutdown signal to the droid army. However, Kalani, who was stationed on Agamar aboard a Separatist supply ship at the time with a battle droid garrison, assumed the shutdown command was nothing more than a Republic trick so he ignored it and did not relay to the droids under his command."}, {"tag": "p", "text": "Years later, Captain Rex, Lasat Garazeb Orrelios, Jedi Kanan Jarrus, and his Padawan Ezra Bridger arrived on Agamar, looking to find weapons and explosives for the rebellion. Kalani had his forces captured them and brought them to him so that he could play a little \"war game,\" saying that he could finally \"end\" the Clone Wars his way. Kalani held Zeb hostage while Rex, Kanan, and Ezra fought through his troops. After defeating waves of battle droids and making their way to the command center, Rex, Kanan, and Ezra ordered Kalani to surrender. Kalani refused, but Ezra convinced him that neither the Republic nor the Separatists won the war and the Republic became the Empire. When the Empire arrived on Agamar, Kalani agreed to help the rebels escape. While the droids and Zeb attacked the stormtroopers and AT-DP's, Kalani had five droids fired at Ezra and Kanan, who redirected their shots at proton bombs underneath the AT-AT's, destroying one of them in the process. The droids and the rebels made their escape in three Sheathipede-class transport shuttles, one being destroyed in the process. Kalani bid farewell to the rebels but refused to join them, believing that they had less than a 1% chance of successfully overthrowing the Empire."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "During the New Republic Era, R0-GR, a B1-series battle droid who had been part of the Separatist Army and was currently serving in the Resistance, wrote a book entitled droidography, which compiled facts about various droid models. He hoped that it would educate people on droids, and two of the droid models R0-GR covered were the T-series and super tactical droids. After listing grievances he had about the T-series, the B1 noted that the super tactical droids were introduced because of their predecessor's lack of adaptability. He mentioned that, while these upgraded commanders believed themselves to be superior, they failed to win the Clone Wars. R0-GR also wrote that he had heard that some super tactical droids did not admit defeat and ran battle scenarios for years, making him think they were \"sore losers.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}