{"url": "SV-3", "categories": ["Category:Canon articles", "Category:L-1g general purpose droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "SV-3"}, {"tag": "p", "text": "SV-3, or Ess-Vee-Three, was an L-1 tactical droid that worked with the Barbadelan Karamu. When Karamu's Cranan star-hopper crashed onto Rendel, Ess-Vee was damaged. He was found by Han Solo and Chewbacca, and grabbed Solo, warning him of the \"Emerald Witch\" before deactivating."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "SV-3 operated with Karamu, a Barbadelan pilot. At some point, he and Karamu encountered the smugglers Han Solo and Chewbacca. When Karamu was hired by Bellan, former queen of Rendel, to deliver a statue to the planet, SV-3 travelled with him in his Cranan star-hopper, unaware that they had actually been sent in an attempt to defeat Bellan's sister Zalla, who had driven her from Rendel. Their ship crashed, however, and SV-3 was damaged. Karamu, who had left to deliver the statue, was trapped in a forest of vines by Zalla. Over the next few days, both Karamu's ship and SV-3 were overrun by vines, trapping the tactical droid in the wreckage."}, {"tag": "p", "text": "Solo and Chewbacca were later also sent to the planet by Bellan, similarly told that they had to deliver a statue. When the smugglers arrived, they discovered Karamu's ship, and Solo discovered Ess-Vee, who activated, grabbing Solo and pleading that to help Karamu. SV-3 warned him of the \"Emerald Witch of Rendel\", and then deactivated due to the damage he had suffered. Leaving SV-3, Solo eventually located Karamu, and managed to cause her defeat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "SV-3 first appeared in the flashback section of Star Wars Adventures: Tales from Vader's Castle 3, a 2018 canon comic written by Cavan Scott and illustrated by Corin Howell. While he was only identified as Ess-Vee-Three in the comic, the name SV-3 was given in a portion of Scott's official script."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}