{"url": "Bail_Organa%27s_resistance_movement", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles in need of updating", "Category:Rebel cells"], "nodes": [{"tag": "h1", "text": "Bail Organa's resistance movement"}, {"tag": "p", "text": "During the early days of the Galactic Empire, Senator Bail Prestor Organa formed a resistance movement. The movement helped form some of the earliest organized resistance groups by using the power and wealth of Alderaan, which included royal and personal fortunes. Organa was able to bring about firepower and other difficult to obtain assets, and his movement actively recruited similarly-minded individuals after a thorough vetting process."}, {"tag": "p", "text": "Organa's resistance tried to be aware of reports and rumors throughout the galaxy on rebellious and insurgent activity, looking for successful independent resistance groups that might have indicated a possible ally or even a surviving Jedi. Organa's mix of available units was always changing. Some were under his personal command, while other forces were allies that were willing to lend their support through the means of action. Due to his position, Organa and his movement were able to call upon Alderaan military forces and an assortment of starships when more firepower was needed."}, {"tag": "p", "text": "Organa's resistance movement maintained a network of secret agents, known as Fulcrums, and influential politicians that were tapped for information or covert operations. Due to Alderaan's reputation for their relief efforts, Organa's resistance movement was able to dispatch personnel and starships to areas in a conflict where the Galactic Empire would normally be wary of outside attention."}, {"tag": "p", "text": "In 18 BBY, Organa discovered the activities of the former Jedi Padawan Ahsoka Tano and eventually recruited her into his movement."}, {"tag": "p", "text": "By 5 BBY, Organa's movement had joined with Senator Mon Mothma's network to form a core element of the nascent Alliance to Restore the Republic."}, {"tag": "p", "text": "In 3 BBY, Organa's adopted daughter Leia learned of his involvement in the increased rebel activity and eventually became a trusted member of his operations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}