{"url": "SSA-306", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:OOM security battle droids", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "SSA-306"}, {"tag": "p", "text": "SSA-306 was a Baktoid Combat Automata OOM security battle droid serving the Trade Federation during the Invasion of Naboo in 32 BBY. SSA-306 was one of the battle droids sent to escort Queen Padmé Amidala of the Naboo to the Camp Four prison for processing. On the way there, the droid escort was attacked by Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, who destroyed all of the droids, including SSA-306."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "SSA-306 was an OOM security battle droid manufactured by Baktoid Combat Automata for the Trade Federation's Droid Army. The battle droid had already entered service by 32 BBY, when the Federation established a blockade around the planet of Naboo as an act of protest against the taxation of trade routes introduced by the Galactic Senate. After a failed negotiation attempt with two Galactic Republic ambassadors—Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi—the Federation forces landed on the planet and captured the capital city of Theed. In the aftermath of the battle, SSA-306 was assigned to guard duty at the Theed Royal Palace."}, {"tag": "p", "text": "When Naboo Queen Padmé Amidala refused to sign a treaty with the Trade Federation, Viceroy Nute Gunray ordered his droids to take her for processing. SSA-306 was one of four droids that escorted Amidala—along with Theed Governor Sio Bibble, Captain Quarsh Panaka, several other members of the Royal Naboo Security Forces, and Amidala's handmaidens—to the Camp Four prison. However, on the way there, the droids were attacked by Jinn and Kenobi, who had spotted the convoy while looking for a way to contact the Republic and inform the Senate about the Federation's invasion. SSA-306 was destroyed by the Jedi, along with the rest of the droid escort."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "SSA-306 had bone-white and red plating. The droid used a standard E-5 blaster rifle and, like all B1 battle droids, was 1.93 meters tall. SSA-306 was known as a droid whose shift could only be ended by a blaster shot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This droid first appeared, unnamed, in George Lucas's 1999 film, Star Wars: Episode I The Phantom Menace. The droid was identified as SSA-306 in the 2001 Theed Palace Limited expansion set of the Star Wars Customizable Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}