{"url": "SX20_Airskimmer", "categories": ["Category:Legends articles", "Category:Air vehicles", "Category:CSA vehicles"], "nodes": [{"tag": "h1", "text": "SX20 Airskimmer"}, {"tag": "p", "text": "The SX20 Patrol Airskimmer was a model of repulsorlift vehicle produced by the Corporate Sector Authority. The vehicle carried only a gunner and a pilot, with the pilot seated behind the gunner. Small, fast and maneuverable, the SX20 was used for a number of tasks by the Corporate Sector's Security Police, and one was amongst the Espo forces sent to stop a brawl involving Han Solo and Jahan Cross on the planet Etti IV."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The SX20 Airskimmer was a model of small, fast, and gray repulsorlift vehicle. Their design included a long body with a grill at one end and an engine at the other, as well as a pair of wires running down each side of the vehicle. The highly maneuverable atmospheric patrol vehicle could travel normally at three-hundred and thirty Kilometers per hour up to ten kilometers off the ground, with a maximum height of fifteen kilometers, though at reduced maneuverability. The vehicles were 4.7 meters long and could carry two crew, a pilot in the back and a gunner in the front who controlled the airskimmer's laser cannon, which could be rotated to face any position except the rear of the ship. Each airskimmer cost 24,000 credits and had a carrying capacity of twenty-five kilograms."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The SX20 was created by the Corporate Sector Authority and used by the Security Police in the Corporate Sector. They were used for air traffic control and some light combat situations, although they also functioned well as an emergency reconnaissance or spy craft. In around 3 BBY, a SX20 was amongst several Security Police vehicles which arrived to break up a brawl in Mondder Spaceport on the planet Etti IV, between Jahan Cross, Han Solo, Chewbacca and a group of disgruntled cantina patrons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The SX20 was first mentioned in 1993 in Han Solo and the Corporate Sector Sourcebook, a West End Games sourcebook written by Michael Allen Horne for Star Wars: The Roleplaying Game. The vehicle then appeared briefly in Agent of the Empire – Iron Eclipse 1, a comic book released in 2011, written by John Ostrander and illustrated by Stéphane Roux."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}