{"url": "Saadoon-Kauldi%27s_anti-slaver_campaign", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Stub", "Category:Battles"], "nodes": [{"tag": "h1", "text": "Saadoon-Kauldi's anti-slaver campaign"}, {"tag": "p", "text": "Saadoon-Kauldi's anti-slaver campaign was an initiative of incipient crime lord Saadoon-Kauldi, a former slave, to release a great number of slaves from slaver ships. Many of the slaves willingly decided to follow and serve Saadoon-Kauldi, increasing his influence."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Saadoon-Kauldi, a Kadri'Ra and a former slave, became a drug dealer and an up-and-comer crime lord before 10 BBY. He was creating his own criminal empire and traveled through the galaxy along with some smugglers working for him."}, {"tag": "p", "text": "During this trip, Saadoon-Kauldi's crew boarded a galleon belonging to some slavers. The slaves there were being mistreated. Saadoon-Kauldi lost his temper and gruesomely killed the slavers, releasing the prisoners afterward. To his surprise, the slaves swore loyalty and service to Saadoon-Kauldi; he answered by promising to respect them as free beings."}, {"tag": "p", "text": "The Kadri'Ra understood that this event had enlarged his power in the criminal underworld. He then decided to temporarily divert his resources from drug traffic and dedicate them to the abduction of slaver ships, releasing a big number of slaves."}, {"tag": "p", "text": "During this campaign, Saadoon-Kauldi attacked an Imperial garbage pontoon and released hundreds of slaves. One of those, Guzald, an old, cultured Devaronian, eventually became Saadoon-Kauldi's personal translator."}, {"tag": "p", "text": "This campaign was profitable, and eventually the number of emancipated slaves loyal to Saadoon-Kauldi became his biggest asset. Once he was satisfied, Saadoon-Kauldi decided to return to his previous smuggling activities."}, {"tag": "p", "text": "As a consequence of the campaign, one slaver guild put pressure on its contacts, including Imperial officers. An official bounty was posted on Saadoon-Kauldi's head, and the Empire tried to enslave the Kadri'Ra. Although the Kadri'Ra initially paid no attention to this reprisal, he suffered several assassination attempts and grew increasingly paranoid."}, {"tag": "h2", "text": "Sources"}]}