{"url": "Sabat_(mercenary)", "categories": ["Category:Legends articles", "Category:Guards", "Category:Individuals of unidentified species", "Category:Males", "Category:Mercenaries"], "nodes": [{"tag": "h1", "text": "Sabat  (mercenary)"}, {"tag": "p", "text": "Sabat was a male mercenary who acted as the chief of security for Attuma Duum. He was killed in personal combat by the rogue Force-sensitive Shon-Ju in Attuma Duum's headquarters in the year 22 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sabat was the friend and chief of security to the mercenary Attuma Duum. In 22 BBY, he was assigned to hunt down the Jedi Knight Aayla Secura on the moon Cavamina Minor. He ambushed Secura and her Clone troopers and forced her to flee. Sabat led his mercenaries to the crashsite of Secura's Delta-7B Aethersprite-class light interceptor, and the Jedi ran away again. Pursuing her into the forest, Sabat's men were ambushed by the rogue Force-sensitive Shon-Ju and his students. Consternated, Sabat ordered his men to fire at the new arrivals, yet the students charged forth and subdued the mercenaries. Shon-Ju himself took out a security droid then turned his attention to Sabat, asking if it was a good day to die. Replying in the negative, Sabat activated his jetpack and escaped."}, {"tag": "p", "text": "Sabat returned to Attuma Duum's headquarters while Shon-Ju attended to the wounded Secura on the moon below. Sabat met with his employer. Soon, Secura and Shon-Ju stole two abandoned bombers and flew up to Duum's base hidden in the asteroid field. They snuck aboard to arrest Duum, but Shon-Ju deliberately tripped the alarm. Secura used the Force to subdue the guards, but Sabat took Shon-Ju hostage and threatened to kill him; Secura surrendered. Once imprisoned, Duum came to visit the two Force-sensitives, but soon left to attend to other matters. Sabat stayed behind to guard the prisoners, and Duum offered to patch in a feed so Sabat can watch the battle. When Sabat was distracted, Shon-Ju used his Force powers to break free. Sabat pulled a blaster on him and said he had no problems killing Shon-Ju. Shon-Ju reciprocated, tossing the mercenary into a turbine, causing an explosion which disabled the station's shields. Shon-Ju then moved to attack Duum; Secura broke free in time to save Duum. She and Shon-Ju started grappling with each other; he was about to kill the Jedi when she cut off his hands. The three fighters managed to escape before the station exploded as a result of asteroid crashes."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "By the time of the Clone Wars, he had acquired a scar across his left eye. When faced with a choice between death and running away, Sabat chose to flee. He had a tendency to enjoy violence and was not afraid to threaten a hostage. He took his role as Duum's chief of security seriously, and was seen by Duum as paranoid or just dedicated. Sabat wore a set of armor similar to that of clone troopers' and used a blaster pistol, and periodically employed a jetpack. He wore his hair long and in braids, and over his shoulders he placed a furry cape."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sabat appears in the 2010 graphic novella The Clone Wars: Deadly Hands of Shon-Ju. For his appearance, he was drawn by Brian Koschak."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}