{"url": "Bail_Prestor_Organa", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Alliance High Command personnel", "Category:Galactic Republic senators", "Category:House of Organa", "Category:Humans", "Category:Imperial Senators", "Category:Males", "Category:Viceroys"], "nodes": [{"tag": "h1", "text": "Bail Prestor Organa"}, {"tag": "p", "text": "Bail Prestor Organa was a human male Alderaanian politician, an influential voice for peace in the Galactic Senate during the last days of the Galactic Republic, and a founding member of the Alliance to Restore the Republic. Organa, the senator of Alderaan, was an outspoken member of the Senate's Loyalist Committee that pushed to maintain the ideals of the Republic during the Clone Wars. He became an architect of the early rebellion against the Galactic Empire and believed that a full-scale Galactic Civil War was inevitable if the Empire was to be toppled and replaced by a New Republic."}, {"tag": "p", "text": "During the Clone Wars, Organa often worked closely with Senators Padmé Amidala of Naboo and Mon Mothma of Chandrila in an attempt to de-escalate the war with the Confederacy of Independent Systems and bring about a peaceful, diplomatic resolution to the three year-long conflict. He was an opponent of the Republic military enhancement bill that increased the production of clone troopers for the Grand Army of the Republic, as well as the architect of the Alderaan Refugee Conference to deal with the refugees displaced by the war with the Separatist Alliance. At times he became caught in the action of the war, including when his relief effort on Christophsis fell under Separatist siege shortly before the Battle of Christophsis. He also ensured that relief supplies could be delivered to the citizens of Ryloth during the Separatist occupation of the planet."}, {"tag": "p", "text": "After the transformation of the Republic into the Empire, Organa continued to serve in the Imperial Senate but quietly began organizing a rebel movement to combat the Empire. He and his wife, Queen Breha Organa of Alderaan, secretly adopted Leia Organa, who came into their care after her mother, Senator Amidala, died and her husband, Jedi Knight Anakin Skywalker, fell to the dark side of the Force. Princess Leia followed in her father's footsteps and succeeded him in the Senate while quietly supporting the Rebel Alliance. Organa tasked her with finding Jedi Master Obi-Wan Kenobi, his old friend and ally, in exile on Tatooine and bringing him into the fight. Bail then returned home to Alderaan to inform his people that war was coming, a warning that would come too late. Shortly thereafter, Organa and the queen were killed when the Death Star, an Imperial superweapon, destroyed Alderaan. They were remembered fondly by the Rebel Alliance and the New Republic as revolutionaries who fought to restore peace and freedom in the galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and career"}, {"tag": "p", "text": "Bail Prestor Organa was a politician and a member of the royal family of Alderaan. At some point following the Invasion of Naboo, he came to represent his home planet in the Senate of the Galactic Republic, succeeding Bail Antilles, his relative by marriage. Organa was also the Viceroy of his homeworld and the husband of Breha Organa, Queen of Alderaan."}, {"tag": "p", "text": "As soon as he entered the intergalactic political arena, he established strong ties with like-minded senators, including Padmé Amidala of Naboo and Mon Mothma of Chandrila. He also became close friends with Finis Valorum, former Supreme Chancellor of the Republic. Due to his honesty and his commitment to justice, Organa gained the respect of his senatorial peers and came to be esteemed as a politician. In spite of Organa's best efforts, the galactic government grew increasingly plagued by corruption, ultimately leading malcontents to take extreme action: led by the former Jedi Count Dooku, a loose affiliation of outlying star systems formed the Confederacy of Independent Systems and declared itself seceded from the Galactic Republic. With the rise of further separatism following the rise of the Confederacy, Organa joined the Senate's Loyalist Committee, the members of which supported the Republic and its leader, Supreme Chancellor Sheev Palpatine. In the framework of the committee, Organa came to work closely with Padmé Amidala."}, {"tag": "p", "text": "In time, the Separatist Crisis escalated into the full-scale conflict known as the Clone Wars. Organa, opposed to the war but cognizant of its inevitability, became especially active in his devotion to relief missions and other humanitarian operations. In this context, he often worked with members of the Jedi Order, for whom he came to develop a deep respect."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "Christophsis"}, {"tag": "p", "text": "Shortly before the Battle of Christophsis, Organa led a relief force to the planet to aid its besieged people and beleaguered Republic troops. In this context, he and his relief effort became trapped on Christophsis' surface by General Whorm Loathsom's forces and a Separatist blockade led by the infamous Admiral Trench. When Jedi Knights Anakin Skywalker and Obi-Wan Kenobi led an assault against Trench's fleet in an attempt to break through and aid Organa, the Admiral responded with a withering attack, forcing the Jedi to retreat behind a nearby moon. Trench staged several devastating attack runs against Organa's on-planet camp at the Minister of Sustenance's compound in the eastern exurbs and draw Skywalker and Kenobi out from behind the moon, but the Harch admiral's blockade were finally broken by a IPV-2C Stealth Corvette flown by Skywalker and Admiral Wullf Yularen. Organa then thanked Skywalker for delivering the supplies and then watched as Loathsom's forces retreated."}, {"tag": "h4", "text": "Toydaria"}, {"tag": "p", "text": "Following Christophsis, Organa was then sent on trade missions. After it's success, Organa was then contacted by Jedi Masters Yoda, Mace Windu, and Obi-Wan Kenobi, who informed him of the destruction of the Republic fleet protecting Ryloth. He was then asked by them to assist Naboo Representative Jar Jar Binks in negotiating an agreement with the Toydarians to allow them use their planet to send relief supplies to Ryloth."}, {"tag": "p", "text": "However, Organa and Binks encountered resistance from Trade Federation Senator Lott Dod, who claimed that do so would violate Toydaria's neutrality. However, King Katuunko agreed to allow them to use the ships they brought to load the supplies to aid the Twi'leks as long as the Trade Federation did not learn of the mercy mission. Organa then had Binks distract Lott Dod's party at a state dinner while he loaded the supplies aboard the ships. Following that mission, Organa, Binks, and Katuunko were confronted by Dod, who claimed that Organa was responsible. However, Organa assured him that if he had any proof, he could show it to the Senate. Frustrated, Dod withdrew his argument, but warned Organa that he was playing a dangerous game."}, {"tag": "h4", "text": "Conference on Alderaan"}, {"tag": "p", "text": "Organa, alongside Senator Amidala, hosted a conference on Alderaan. However, following assassin Aurra Sing's first attempt on Amidala, Organa, and Jedi Padawan Ahsoka Tano tried to convince her to leave. After she refused, Organa continued the conference with a droid taking Amidala's place. He and Captain Typho then went to her quarters to stop Sing. They then took Sing into custody. He then attended Amidala's party for Senator Aang."}, {"tag": "h4", "text": "Hostage crisis"}, {"tag": "p", "text": "Organa then asked Amidala to join him in Senator Philo's meeting about the Enhanced Privacy Invasion Bill. Following the meeting, Organa and the other senators were then taken hostage by Cad Bane and his bounty hunters following Bane's murder of Philo. When Bane was searching the senator for communicators, Amidala told him that they must not search her because she had a lightsaber. Organa then wondered why she had one, but was more concerned about giving it back to the Jedi who own it. After Skywalker was captured by Sing, Bail and the other senators attended to him. After Bane and the other bounty hunters left, Organa and the others were saved from the explosives by Skywalker."}, {"tag": "h4", "text": "Ahsoka Tano's trial"}, {"tag": "p", "text": "Organa was present during the funeral of the six Jedi killed in the bombing of the Jedi Temple hangar. He also attended the trial of Ahsoka Tano, seated alongside Riyo Chuchi, Mon Mothma, and Kin Robb as the former Padawan was accused of masterminding the bombing. Tano was ultimately cleared of all charges when Anakin Skywalker arrived with Barriss Offee, the real culprit."}, {"tag": "h4", "text": "Final days of war"}, {"tag": "p", "text": "Following the Battle of Coruscant, Organa was among the many politicians who greeted Chancellor Palpatine after he had been successfully rescued by the Jedi Skywalker and Kenobi. Organa briefly spoke with Skywalker and expressed hope that Count Dooku's death could bring a quicker end to the war. Skywalker disagreed, saying that as long as General Grievous was alive, the war would continue."}, {"tag": "h3", "text": "Rise and reign of the Galactic Empire"}, {"tag": "h4", "text": "Rise of the Empire"}, {"tag": "p", "text": "During the attack on the Jedi Temple by the clone troopers, Bail Organa arrived and tried to demand access to the Temple. Escaping Jedi Zett Jukassa was shot down before his eyes by the clones, prompting him to flee to his ship, Tantive III, with the intent of intercepting any surviving Jedi. Organa was able to locate and successfully rescue Masters Yoda and Obi-Wan Kenobi and take them back to Coruscant to warn any surviving Jedi to remain hidden."}, {"tag": "p", "text": "After arriving on Coruscant, Organa made his way to the Senate Building, where he sat with Padmé Amidala as they witnessed Chancellor Palpatine transform the Galactic Republic into the Galactic Empire, bestowing upon himself the title of Galactic Emperor."}, {"tag": "p", "text": "Following the end of the Clone Wars and the execution of Order 66, Organa decided to adopt the newborn Leia, daughter of the late Padmé Amidala and the fallen Jedi Anakin Skywalker, in order to protect the child from harm at the hands of the Emperor. Organa and his wife, Queen Breha Organa, had always wanted a baby girl, and readily raised Leia as an Alderaanian princess. Organa, along with other dissident members of the newly-refashioned Imperial Senate (notably Mon Mothma) took steps to form the Alliance to Restore the Republic, which sought to restore democracy to the Galaxy. With time, Leia became a politician in her own right and a dedicated member of the Alliance. During the reign of the Empire, Organa remained Senator of Alderaan in the Imperial Senate, though he secretly rebelled against the Empire."}, {"tag": "p", "text": "Organa was one of the only people in the galaxy who knew the whereabouts of both Yoda and Kenobi after the Purge. Although he eventually let Mothma into his confidence about Kenobi's survival, he did not tell anyone else and even lied to his rebel allies in later years, telling them that Kenobi had been killed during the Purge."}, {"tag": "h4", "text": "The infancy of the Rebellion"}, {"tag": "p", "text": "Within the first year of the Empire, Bail Organa began clandestine operations against the Empire by helping planets in need. He would intercept secure Imperial messages and send cells of rebels to act on his behalf to help citizens being oppressed by the Empire. He had gotten his friend and loyal pilot, Captain Raymus Antilles, to join him in rebelling against the Empire, and the two of them were slowly recruiting the crew of the Tantive IV into their cause."}, {"tag": "p", "text": "One such communique described armed resistance to Imperial occupation on the moon of Raada. The message indicated that the uprising included a Jedi. Organa was surprised to learn that a survivor of Order 66 had been found, but became worried for the Jedi's safety, knowing that that Empire would want to hunt down and kill them. Later, while on Coruscant, Organa heard of additional incidents in the Outer Rim which may had also been the work of the Jedi he wished to locate. This Jedi had began running his or her own mercy missions, making sure food was delivered to those in need, stopping a Black Sun pirate, etc. Organa enlisted the help of Chardri Tage and his copilot Tamsin in order to track this elusive Jedi, although he did not tell Tage and Tamsin that the person they were looking for was, in fact, a Jedi."}, {"tag": "p", "text": "Tage and Tamsin, along with R2-D2, whom Organa had borrowed from Captain Antilles, eventually found the Jedi: Ahsoka Tano, the former Padawan of Anakin Skywalker during the Clone Wars. They had caught her in a tractor beam after her fight with an agent of the Black Sun criminal gang, but were easily dispatched while attempting to tell Tano who they were. R2 told Tano that Bail Organa was trying to contact her. Tano escaped from Tage's ship, deciding to meet Organa on her own terms. When Organa traveled on the Tantive IV to meet Tage and Tamsin, Tano snuck her way onto the ship with help from R2-D2, surprising Organa in his own quarters."}, {"tag": "p", "text": "Organa told Tano about his growing rebellion against the Empire, and asked her to join his cause. She agreed, but only if Organa helped her to find a mysterious Imperial agent who was hunting down Force-sensitive children. Organa gave Tano information about this agent, the Sixth Brother, informing her that he was on Raada and holding Tano's friend, Kaeden Larte, captive."}, {"tag": "p", "text": "After freeing Larte, Tano contacted Organa, who sent transports, the Tantive IV, and A-wing fighters to evacuate the farmers from Raada. Afterward, Tano met Organa on his ship, where she informed him that the evacuated farmers wanted to join the rebellion. During their conversation, Tano told Organa she wanted to \"take [his] recruits and find missions for them.\" She became the manager of Organa's intelligence network and took the codename \"Fulcrum.\""}, {"tag": "h4", "text": "Aiding the rebellion"}, {"tag": "p", "text": "In the fourteenth year of the Empire, Organa sent his astromech friend R2-D2, accompanied by Organa's protocol droid C-3PO, on a secret mission to gather intel about the \"Spectres.\" After the mission, the droid was returned to Organa by the rebels' leader Kanan Jarrus aboard the Tantive IV. Organa thanked Jarrus by compensating him for his efforts, before reciting a Jedi saying. Once C-3PO had left the room, Organa recorded R2's footage."}, {"tag": "p", "text": "When the Spectres launched a mission to rescue their captured leader from an Imperial fleet over Mustafar, \"Fulcrum\" discovered their plan. As TIE fighters from the fleet closed in on them from all sides, a small fleet of Rebel ships, commanded by \"Fulcrum,\" emerged from hyperspace and aided the rebels' escape. Once onboard the ship, Chopper transmitted a communication from Senator Organa, who was introduced by Hera Syndulla. He told them about the different rebel cells that he and Ahsoka had been contacting around the galaxy and that they were now coming together to unite against the Empire."}, {"tag": "p", "text": "Following the blockade of Ibaar, Organa was able to find a manufacturer to build more of Mon Calamari engineer Quarrie's B-wing starfighters in secret. After learning of the rebellion's losses at the Battle of Garel, Organa dispatched Princess Leia, then serving as his aide, along with three Sphyrna-class Hammerhead corvettes — P1, P2, and P3 — to Lothal to expand the rebel fleet, under the guise of delivering relief supplies to the people of Lothal. Leia planned for the rebels to steal them to conceal Alderaan's involvement with the rebellion."}, {"tag": "p", "text": "In 2 BBY, Senator Organa and Rebel Command dispatched Saw Gerrera and a team of his Partisans to investigate the disappearance of the Geonosian species. After losing contact with Saw's team, Senator Organa and the Phoenix Cell's Commander Jun Sato dispatched Hera's rebel cell and Captain Rex to find Saw and recover his data. During the mission, the rebels rescued Saw, befriended the Geonosian Klik-Klak, and discovered that the Empire had perpetrated genocide against the Geonosians. After rescuing Saw, Hera and Kanan reported their findings to Senator Organa. While Organa thought the evidence was insufficient to sway the Senate, he believed that revelations about the Geonosian genocide would turn more worlds against the Empire."}, {"tag": "p", "text": "Later that year, Senator Organa dispatched Phoenix Leader Hera Syndulla and her rebel crew on a mission to rendezvous with the former Senator Mon Mothma. Mothma had become a fugitive from the Empire after denouncing the Ghorman Massacre and wanted to travel to Dantooine in order to unify the various rebel cells and factions into an Alliance. Despite being pursued by Imperial forces dispatched by Grand Admiral Thrawn, the Spectres, Mothma, and Gold Squadron managed to reach Dantooine. Later, Organa along with other rebels including General Jan Dodonna were present at a meeting when his former colleague Senator Mon Mothma gave an impassioned HoloNet speech denouncing the Empire and announcing the formation of the Rebel Alliance."}, {"tag": "p", "text": "In 1 BBY, Senator Organa briefed a meeting of the Alliance leadership and the Spectres via hologram at the Great Temple. During the meeting, Organa corroborated the Partisan leader Saw Gerrera's intelligence that the Empire was using a relay station on Jalindi to track rebel supply lines. In response, the Spectres were dispatched on a mission to plant a spike on the Jalindi relay."}, {"tag": "p", "text": "Later, Senator Organa attended a briefing with Mon Mothma, General Syndulla, and other rebel leaders on Yavin 4 to discuss the stolen TIE/D Defender Elite's flight data recorder which Hera's Spectres had obtained on Lothal. When Organa asked if the Alliance fighters could match the new Imperial fighter, General Dodonna replied that Alliance fighters would be at a disadvantage. The Alliance leaders then discussed news of the recent activation of Protocol 13 on Lothal, which entailed the evacuation of all Imperial personnel on the planet. Hera then re-entered the meeting and convinced the Alliance to authorize a strike on Lothal. Since Hera already had a team on Lothal, Mothma authorized the operation."}, {"tag": "h4", "text": "Late involvement in the Rebellion"}, {"tag": "p", "text": "In 0 BBY, Organa spoke with Mothma following her meeting with Jyn Erso. He believed that the Imperial Senate would not act on whatever proof Erso's father, Dr. Galen Erso had on the weapon. Organa believed that ceding to the Emperor's will had become second nature to members of the senate. However, Mothma assured him that as long as it stood, the Alliance must try diplomacy first, but be prepared for what would come afterwards. Organa was present at a meeting of rebel forces at their headquarters on Yavin 4 to discuss the rising threat of the new Imperial superweapon: the Death Star. Organa exclaimed his support for Erso's idea to bring the fight back to the Empire."}, {"tag": "p", "text": "Following the meeting, Organa briefly spoke to Mon Mothma, informing her that he would be returning to Alderaan to prepare for the coming war that such actions suggested by Erso would bring about. Mothma asked Organa to bring Obi-Wan Kenobi out of his hiding on Tatooine. Bail himself could not go due to being needed to rouse Alderaan to action. So he would send one of his agents to find Kenobi in his place. Mothma asked if he was sending someone he could trust and Bail replied that it was someone he would trust with his life; his adopted daughter, Leia."}, {"tag": "h4", "text": "Death"}, {"tag": "p", "text": "About two decades after the end of the Clone Wars, Grand Moff Wilhuff Tarkin ordered the destruction of Alderaan by use of the Death Star, an immense space station fitted with a powerful superlaser. Shortly beforehand, Bail informed Breha of the Tantive IV's supposed destruction. The pair discussed their daughter Leia, sure that she had survived the incident. When the battle station rose in Alderaan's sky, Organa immediately realized and told his wife it was the Empire's planet killing superweapon, which horrified Breha. As she tried to tell him ways they could escape and save as many Alderaanians as they could, the Death Star fired, making Bail pull her into his arms. As the ripple of destruction reached them, the husband and wife assured each other Leia was alive. Organa then died in the explosion of his homeworld, along with his wife."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Statues in his and his wife's honor were erected in the ceremonial chamber of the Great Temple, from where the Alliance to Restore the Republic launched their successful assault on the Death Star. Several members of the Alliance came to the statue to place wreaths and pay their respects. The Alliance pilot Evaan Verlaine, who had been one of Queen Breha's pupils in her youth, paid her respect to the deceased leaders of Alderaan by observing a moment of silence in front of their statues."}, {"tag": "p", "text": "At some point between the Battle of Yavin and that of Hoth, the Clawdite shapeshifter agent Tunga Arpagion briefly impersonated Organa in his cell when Princess Leia extracted him from the Dex Acquisitions Depot on Meor Ain. However, the princess not only was not fooled, but also punched Arpagion in the face for trying to play games with her mind and using her late father's image."}, {"tag": "p", "text": "In 3 ABY, shortly after the Galactic Empire's takeover of Cloud City, Kes Dameron noted that the Empire had been hunting them down since Bail Organa's first steps to create the Rebel Alliance years ago. After Shara Bey stated that they would fight until the end, Leia determined that while her father didn't live to see the Empire's fall, they would live to see it."}, {"tag": "p", "text": "Bail Organa was a celebrated and bipartisanly revered martyr for the New Republic. Because of his leadership abilities and unifying qualities, he was a powerful figure in a philosophy of post-imperial politics. A 70-meter-high statue of him carved from Jelucani fogstone was erected in the senatorial complex in Republic City on Hosnian Prime. A hand on the statue was partially damaged during the Napkin Bombing."}, {"tag": "p", "text": "Soon after the Napkin Bombing and the statue of Organa's damage, a music box was discovered by the Senator of Arkanis, Lady Carise Sindian. The box, which was meant to be listened to only by Bail's adopted daughter Leia if she was given the governorship of Birren, contained the Alderaanian song Mirrorbright. It also contained a recording of Bail's voice speaking about Leia's true parentage. This recording was later used against Leia in a Senate hearing, forcing Leia to withdraw from her campaign for First Senator."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bail Organa was a human man who served as the planet Alderaan's Senator during the last days of the Galactic Republic and the Imperial Era. As a politician, Organa was renown for his honesty and commitment to justice. During the Clone Wars, Senator Organa forged friendships with several senators who were concerned with the increasingly autocratic rule of Chancellor Palpatine including Padmé Amidala of Naboo and Mon Mothma of Chandrila. Organa also undertook relief missions to war-torn worlds including Ryloth. Organa convinced Junior Representative Jar Jar Binks to use his talents as a clown to distract Trade Federation delegates while he facilitated the shipment of supplies to Ryloth. He also had a deep respect for the Jedi and did not believe Emperor Palpatine's claims that the Jedi had turned against the Republic. Organa was troubled by the execution of Jedi younglings during the Jedi Purge."}, {"tag": "p", "text": "Senator Organa's respect for the Jedi led him to rescue Master Yoda from Kashyyyk. His friendship with Senator Amidala led him to adopt and raise her daughter Leia as his own child. Organa doted over Leia and trained her in the arts of diplomacy and language. While Senator Organa maintained a respectable façade during the Imperial Era, he secretly opposed the Empire and helped to sponsor the earliest manifestations of resistance. Senator Organa cultivated the former Padawan Tano as the Rebellion's first intelligence operative Fulcrum. He also used his wealth and resources to shelter refugees from Raada on Alderaan."}, {"tag": "p", "text": "As the Rebellion grew in strength, Organa devoted resources to financing and arming rebel cells such as the Spectres and the Phoenix Group. He was supported in these endeavors by his adopted daughter Leia, who shared his zeal to the Rebellion and finesse for diplomacy and flattery. Organa was widely regarded as a rebel leader and hero by many in the New Republic, who commissioned a statue in his honor. Organa's love for his daughter led him to withhold the secret that she and her brother Luke Skywalker were the descendants of the reviled Darth Vader, the Emperor's executioner."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Organa wore a gray Alderaanian suit and dark blue overcoat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bail Organa was played by Jimmy Smits in Star Wars: Episode II Attack of the Clones, Star Wars: Episode III Revenge of the Sith and in the Anthology film Rogue One: A Star Wars Story."}, {"tag": "p", "text": "He is voiced by Phil LaMarr in Star Wars: The Clone Wars and Star Wars Rebels."}, {"tag": "p", "text": "In the 2016 reference book Star Wars Character Encyclopedia: Updated and Expanded, Organa's height is given as 1.91 meters, while the official Databank on StarWars.com lists it as 1.99 meters. According to Smits, Organa's garb in Rogue One: A Star Wars Story was not as stately as it was in Episodes II and III as Organa is not as high up the political food chain."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}