{"url": "Sa_Cuis", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Emperor's Hands", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sa Cuis"}, {"tag": "p", "text": "Sa Cuis was a Human male Dark Jedi and an Emperor's Hand. During the early months of his master Palpatine's Galactic Empire, Cuis commanded the Imperial Commando Special Unit, a unit tasked with hunting down Jedi and deserters. Due to Cuis's loyalty, Palpatine sent him on a mission to Vohai in 19 BBY. Cuis's goal was to attempt to kill Darth Vader, Palpatine's apprentice. Though Palpatine knew Cuis would fail, in reality he intended the mission as nothing more than a test for Vader. Like the Emperor predicted, Cuis was killed by the Sith Lord."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Serving Palpatine"}, {"tag": "p", "text": "The Human male Sa Cuis was one of the first Dark Jedi to serve as an Emperor's Hand. In addition to being a talented duelist, he was exceptionally loyal to his master, the Dark Lord of the Sith Emperor Palpatine. In the time following the formation of the Galactic Empire, Cuis was assigned to command the Imperial Commando Special Unit, a special forces unit that was attached to the 501st Legion. The unit was tasked with hunting down Jedi, Jedi sympathizers and deserters, and was composed of former clone commandos and ARC troopers who had previously been members of the Grand Army of the Republic."}, {"tag": "p", "text": "On one occasion, Cuis met with Squad 40 of the Special Unit at the landing pad of the Imperial Special Forces headquarters on the planet Coruscant, to brief them for a mission. While he was walking toward where the squad was waiting for him, Cuis used the Force to listen to their conversation. From Cuis's demeanor, Darman, one of the commandos, was able to work out that Cuis was a Force-user. Cuis sensed that Darman had realized this, and when he reached the squad he handed a datachip to the squad commander, RC-1309, nicknamed \"Niner,\" and then shook Darman's hand to allow him to get a better sense of what the commando was thinking. He then began the briefing and told the commandos that they were to travel to the planet Celen and capture the Antarian Ranger Jilam Kester, who had been sighted there. Following the meeting, Cuis planned to keep an eye on Darman; he thought that the commando might be dangerous as Darman had been able to deduce Cuis's true nature."}, {"tag": "h3", "text": "Suicide mission"}, {"tag": "p", "text": "In 19 BBY, Palpatine asked Cuis to follow Darth Vader, Palpatine's apprentice, to the Parmel sector and kill him. However, Cuis was aware that Vader would almost certainly defeat him, and so asked his master why he was being sent on such a mission. Palpatine responded curtly that he expected Cuis to die, and that this was simply a test for Vader. Demonstrating his loyalty, Cuis agreed to go nonetheless, willing to sacrifice himself for his master. On Vohai, Cuis had several assassins attack Vader while he was inspecting Arkanian Microtechnologies. Vader, with the aid of his personal assistant Erv Lekauf, killed these assassins easily. He was now aware of the Dark Jedi's presence, and was prepared for a battle."}, {"tag": "p", "text": "In the courtyard, Cuis confronted Vader. Though Cuis was skilled in the art of lightsaber combat, he was overpowered by Vader. Cuis was left defenseless and backed into a corner. Infuriated, Vader Force choked Cuis and demanded to know who had sent him. Sa Cuis refused to answer despite being close to death, and Vader realized that he had found someone thoroughly loyal to their master. However, Vader was sure he knew who had sent the Dark Jedi—Emperor Palpatine, ever a master of betrayal."}, {"tag": "p", "text": "Impressed with Cuis's loyalty, Vader allowed Cuis to live long enough for Arkanian Microtechnologies technicians to take swabs and cell samples for cloning. Once the samples were collected, Vader offered him one more chance to surrender. Cuis refused, and Vader then decapitated him. Cuis was replaced by Roly Melusar as the commander of the Special Unit and Melusar informed the commandos that Cuis had been reassigned to recruitment issues."}, {"tag": "p", "text": "Sa Cuis's clones would later be trained under Sheyvan, another Emperor's Hand. Sheyvan led the Cuis clones in a revolt against Palpatine onboard his Lambda-class shuttle one and a half years later, although Sheyvan and all of Cuis's clones were killed in the fight."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sa Cuis was extremely loyal to his Master, Palpatine. He was willing to undertake a suicide mission simply because the Emperor commanded it of him. Even when offered a chance to live, Cuis denied it, because it would mean the betrayal of his Master. Vader was surprised by this unrelenting loyalty, and wished he could find someone who would be so loyal to him. Cuis's clones carried on these same traits, remaining true to Sheyvan, who trained them. Cuis was also a skilled fighter who used two lightsabers and was strong in the Force. However, Cuis was overweight and generally appeared self-conscious and uncomfortable in his role as commander of the Imperial Commando Special Unit, which resulted in him being unpopular with the troops who served under him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sa Cuis was created for the Karen Traviss short story In His Image, where he was a supporting character and an adversary to the main character, Darth Vader. His clones later appeared in the short story A Two-Edged Sword, also written by Traviss. In 2009, he made an appearance in Traviss's novel Imperial Commando: 501st. The character of Sa Cuis was modeled visually by Matt Busch, who also illustrated the short story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}