{"url": "Sabotage_of_the_Colossus", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Missions of the First Order–Resistance war"], "nodes": [{"tag": "h1", "text": "Sabotage of the Colossus"}, {"tag": "p", "text": "During the First Order/Resistance War, the First Order sent the Nikto engineer Nenavakasa Nalor on a mission to sabotage the Colossus platform. Posing as a stranded spacer, Nena managed to gain the trust of the Colossus crew particularly the fellow Nikto Neeku Vozo. Despite her attempts to draw a wedge between the Colossus inhabitants and Warbird gang, Synara San and Kazuda Xiono discovered that Nena was a First Order spy. Though Nena escaped, Kaz and Neeku managed to undo her sabotage and escape First Order forces."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Early in the First Order/Resistance War, a spy was sent to track down and sabotage the Colossus platform, which was being hunted by the First Order, so it could be captured or destroyed. The plan was conceived by Agent Tierny of the First Order Security Bureau, one of the two commanders of the hunt, despite skepticism from Commander Pyre. Nenavakasa Nalor, a Nikto engineer and former slave who had developed an outlook that prioritized being on the \"winning\" side of any conflict, was hired for the job."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Enemy in the ranks"}, {"tag": "p", "text": "After tracking the Colossus for several days, Nena broadcast a distress signal that was picked up by the station's recently-repaired long-range scanners, claiming that her ship was badly damaged. Upon receiving the signal, Team Colossus members Neeku Vozo and Kazuda Xiono felt that a response was necessary, although Jarek Yeager was skeptical. When Xiono and the pirate Synara San docked with Nena's ship and learned she was an engineer, Xiono immediately invited her onboard the Colossus, since Vozo, the only other engineer, was swamped by the amount of repairs."}, {"tag": "p", "text": "Onboard the Colossus, Nena won over Captain Doza and Yeager by offering her services as an engineer. Since the Colossus was short on an engineers, they recruited her. Nena also gained Vozo's trust and the two developed a romantic interest while bonding over their shared passion for engineering. Under the pretext of repairing the space station, Nena also secretly installed various devices to prevent the Colossus from escaping. These included installing regulators into Service tunnel A2, disabling the ship's turbines and thrusters, and installing a case blind on the Colossus command bridge."}, {"tag": "p", "text": "Seeking to sow a wedge between Captain Doza and Captain Kragan Gorr and his Warbird gang, Nena doctored evidence claiming that the pirates were draining power from the Colossus. In truth, Nena was secretly draining the Colossus' power into her ship as a means of aiding the First Order and refueling her vessel. While Captain Doza was quick to believe Nena, Xiono sought permission to investigate the matter. Xiono's plan involved cutting off the pirates' power supply while Nena and Vozo made sure that the pirates could not steal it."}, {"tag": "h3", "text": "Exposing a saboteur"}, {"tag": "p", "text": "Putting their plan into action, Xiono and the BB-series astromech droid CB-23 tried to sneak into the pirates' quarters but were detected by Synara San. As a friend of Xiono, Synara told him that the pirates had not been stealing the Colossus' power. She told Xiono that she had installed the power couplings her. She then convinced him to help her search Nena's ship."}, {"tag": "p", "text": "While inspecting her ship, Synara found no sign of laser cannon damage, disproving her claim that she had been attacked by the First Order. Inside the ship's cockpit, Synara found that Nena had been tracking the Colossus for several days and also found that she had been contacting the First Order on her transmitter. Synara stayed with the ship to make sure that Nena could not escape while Xiono and CB-23 went to warn Neeku."}, {"tag": "p", "text": "Neeku initially did not believe Xiono and thought he was jealous of his friendship with Nena. Realizing that her cover had been blow, Nena fled through the corridors and used her datapad to power up her ship and to transmit the Colossus' coordinates to the First Order. When cornered by Neeku and Xiono, Nena admitted that she had been spying for the First Order. Nena replied that she was prepared to do anything to survive since she had been enslaved by pirates as a child. Despite efforts by CB-23 and Synara to catch her, Nena manage to elude her pursuers and escaped aboard her starship. Nena felt bad for betraying Vozo while Vozo was hurt by her deception."}, {"tag": "h3", "text": "Escaping the trap"}, {"tag": "p", "text": "While Nena escape in her ship, Commander Pyre and Agent Tierny's Star Destroyer arrived. After being paid by the First Order for her services, Nena jumped into hyperspace but was guilt-stricken at having taken advantage of Vozo. First Order TIE/fo space superiority fighters strafed the Colossus, causing significant damage to the station including taking out the Colossus marketplace's holoprojectors. The Colossus' gun emplacements managed to take out several TIE fighters."}, {"tag": "p", "text": "While under attack, Xiono and Vozo worked to undo Nena's sabotage. Xiono disabled the regulators in Service tunnel A2, restore the turbines in the engineering deck, and repaired the plasma cables. He also convinced the pirates to switch off their power temporarily so that they could muster enough power for their hyperdrive. Finally, Vozo managed to deactivate the case blind that Nena had installed on the bridge, allowing the Colossus to jump into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Displeased at the sabotage's failure, Pyre and Tierny agreed to have Nalor executed if they ran into her again. Tierny reason that an asset was only useful to the First Order as long as they were active. Due to his experiences with Nena, Neeku came to question his own trusting and open nature. However, Kaz assured him that these qualities were what made him a good person."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The sabotage of the Colossus first appeared in the Star Wars Resistance Season Two episode \"The Engineer,\" which premiered on Disney XD on November 3, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}