{"url": "Sab%C3%A9", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Amidalans", "Category:Humans", "Category:LGBTQ+ individuals", "Category:Naboo Royal Handmaidens", "Category:Pilots", "Category:Political decoys"], "nodes": [{"tag": "h1", "text": "Sabé"}, {"tag": "p", "text": "Sabé (pronounced /sɑ'beɪ/), formerly known as Tsabin, was a human female who hailed from the planet Naboo during the late era of the Galactic Republic. Serving as a handmaiden in the Royal House of Naboo, Sabé was duty-bound to protect Queen Padmé Amidala—the elected ruler of the people of Naboo—against any threat. As such, she impersonated Amidala during the Invasion of Naboo in order to keep her safe from the Trade Federation."}, {"tag": "p", "text": "Sabé continued to act as a decoy queen after the Jedi ambassadors Qui-Gon Jinn and Obi-Wan Kenobi rescued the true Amidala as well as her royal retinue. Upon returning to Naboo from Coruscant, the capital world of the Republic, Sabé was introduced as Queen Amidala to the Gungan people. Hoping to forge an alliance between Gungans and the Naboo, the real Amidala identified herself to Boss Rugor Nass—leader of the Gungans—and thereby revealed Sabé's true role as the queen's handmaiden, decoy and loyal bodyguard."}, {"tag": "p", "text": "Sabé continued to wear her disguise during the Battle of Naboo. Storming the Royal Palace in Theed, the decoy caught the attention of Viceroy Nute Gunray, who ordered his battle droids to pursue Sabé, believing her to be the real queen. As a result, Amidala and Captain Quarsh Panaka were able to secure the throne room and capture Gunray. Ultimately, the battle concluded in victory for both the Royal Naboo Security Forces and the Gungan Grand Army."}, {"tag": "p", "text": "Following Amidala's death at the end of the Clone Wars, Sabé and Captain Tonra changed their identities and started an investigation to discover how she had died."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Tsabin was born on Naboo in 46 BBY, into a family of hallikset players. As per family tradition, she was sent to study music at the Theed Conservatory, a school known for training traditional musicians, as her older brothers had studied there, although she strongly disliked it. In 32 BBY, the year she turned fourteen and was expected to take up an apprenticeship, Tsabin was approached by Captain Quarsh Panaka of the Royal Naboo Security Forces, who asked her to hold off on accepting an apprenticeship until after the upcoming election, although he provided no details. Tsabin, looking up the candidates running for queen, discovered that she had a strong resemblance to one of the candidates, Padmé Amidala, and suspected what Panaka might have in mind. After Amidala won the election, Tsabin accepted Panaka's offer to become her body double. She was introduced to Amidala and became the new Queen of Naboo's first handmaiden."}, {"tag": "p", "text": "Two weeks after Amidala's election, Panaka presented four other girls, Rabene Tonsort, Eirtama Ballory, Suyan Higin, and Sashah Adova, to her as potential handmaidens as well, and the Queen took them to her apartments in the Theed Royal Palace for a private discussion. There, Amidala shared her personal name with them, and the girls decided what roles each would have in Amidala's service. At Tonsort's suggestion, the handmaidens changed their names as Amidala had for their privacy, some prestige, and so that Amidala going undercover as one of her own handmaidens would be less noticeable; with similar names, they would be more forgettable. The last to pick her new name, Tsabin became Sabé."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "h4", "text": "Flight from Theed"}, {"tag": "p", "text": "Sabé was one of five handmaidens that served Queen Amidala during the Trade Federation's blockade and subsequent invasion of Naboo. When Federation forces captured the Theed Royal Palace, Sabé switched roles with the queen, who posed as a simple handmaiden, going by her less commonly known name, Padmé. Sabé, pretending to be the queen, rejected Viceroy Nute Gunray's efforts to have her sign a treaty that would make the invasion legal. She and the rest of the royal retinue were then escorted by battle droids to a separate holding facility."}, {"tag": "p", "text": "On the way, they were rescued by Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi. Proceeding to a nearby hangar, Jinn insisted that the queen be taken to Coruscant to plead her case to the Galactic Senate. After conferring with her handmaiden Padmé, the real queen, Sabé agreed. She subsequently left Naboo aboard the Royal Starship with the Jedi, taking Padmé, Panaka, as well as Eirtaé and Rabé, with her."}, {"tag": "p", "text": "They eventually managed to get through the Federation blockade and leave the Naboo system. Sabé—as the queen—commended R2-D2 for maintaining their ship during its escape, and ordered Padmé to clean the astromech droid. However, the Royal Starship's hyperdrive was heavily damaged. Forced to land on the desert planet Tatooine, Sabé remained on the starship while Jinn and Padmé sought a new T-14 hyperdrive generator."}, {"tag": "p", "text": "When they reached the galactic capital of Coruscant, Sabé was presented as the queen to Supreme Chancellor Valorum and Senator Sheev Palpatine, who represented Naboo in the Galactic Congress. She then switched back with the queen, and attended to Amidala before she went to speak to the Senate."}, {"tag": "h4", "text": "Negotiations with the Gungans"}, {"tag": "p", "text": "Sabé once again switched places with Amidala when they sought help from Gungan forces, and began negotiations with their leader, Boss Nass. However, Padmé quickly revealed the deception as a confidence-building measure, and the two parties finally agreed to work together in order to free their planet from the Trade Federation. Despite being exposed, Sabé remained disguised as Queen Amidala during the mission to reclaim the palace. When Padmé was captured, she played an instrumental role in deceiving Viceroy Gunray. Showing up suddenly at the door to the throne room, Sabe proclaimed the Viceroy's occupation over and blasted two of his droids before fleeing with her group. Gunray ordered his troops to follow Sabé, believing she was the real queen. This provided Padmé the opportunity to retrieve her blaster and take the Neimoidian into custody, liberating the planet."}, {"tag": "p", "text": "Sabé was later present when the queen welcomed Supreme Chancellor Palpatine and the Jedi Council to Naboo, and at the parade celebrating the freedom of Naboo and the reconciliation of its human and Gungan populations."}, {"tag": "h3", "text": "Service to the senator"}, {"tag": "p", "text": "After Amidala left the throne, Sabé was the only handmaiden to remain in her service. Among other tasks, Amidala sent Sabé back to Tatooine in an effort to free slaves. Although Amidala had specifically requested that Sabé locate Shmi Skywalker, the handmaiden could not find her. She brought the slaves she did free to a new life on the planet Karlinus."}, {"tag": "p", "text": "By 22 BBY, the handmaiden Cordé had taken on the role of Amidala's decoy."}, {"tag": "h3", "text": "Death of Padmé Amidala"}, {"tag": "p", "text": "In 19 BBY, the Clone Wars came to an end after Sheev Palpatine transitioned the Republic into the First Galactic Empire. As a result of her husband Anakin Skywalker's fall to the dark side, Amidala lost the will to live and died after giving birth to her children, Luke and Leia. The funeral took place in Theed shortly after, which was attended by Sabé and Padmé's other surviving handmaidens. Every handmaiden, including Sabé, barely spoke during the procession, as their grief was profound and difficult for outsiders to understand."}, {"tag": "p", "text": "Following Amidala's funeral, Sabé went home to be alone with her thoughts. However, she was eventually startled by a knock on the door. Although she initially believed it might be one of her many enemies, she soon realized that it was Captain Tonra of the Naboo Royal Security Forces, a dear friend of Sabé's. After letting Tonra in, Sabé finally let her emotions flow freely, conveying anger and confusion at Amidala's death and the formation of the new Empire. After her outburst, Tonra asked Sabé what she would do. Sabé thought to herself that if Tonra's question had come from her parents they would've been asking what Sabé would do without Padmé, however considering how well Tonra knew her Sabé understood that he was asking what she would do in Amidala's memory."}, {"tag": "p", "text": "After consideration, Sabé told Tonra that she was going to investigate what had happened to Amidala, starting on Coruscant. She believed she couldn't merely relax on Naboo now that so many of her friends were dead. Tonra, wanting the same thing as Sabé, asked if he could accompany her on her journey. Considering their previous compatibility in the field, Sabé agreed to Tonra's request but warned him that they would have to change their identities and make sure there was no indication they were from Naboo. The pair began immediately organizing for their trip. Tonra informed Sabé that he could get them a ship or at least a journey off-world and requested that Sabé create the false IDs while he packed her bag. In return, she told him that he should call in any untraceable favors he was owed, as they would need every bit of help they could get in their investigation."}, {"tag": "p", "text": "Sabé went to her workstation and briefly glanced over the files she had been looking over. A majority of these files were pertaining to the many years of work Amidala had put into improving the galaxy, as well as the policies she never had the chance to petition. As she looked them over, her emotions began to swell, and she sought to know more than ever why Amidala had died. Her contemplation was soon interrupted by her comm unit chiming, although Sabé decided not to answer it. Tonra answered it and insisted that Sabé talk to the caller. Sabé relented and accepted the call, which was being sent by Senator Bail Organa of Alderaan. Sabé asked Organa what he wanted."}, {"tag": "p", "text": "Shortly after Padmé's funeral, Sabé and her allies broke into Padmé's Apartment on Coruscant and stole the chamber's security recordings. Believing there could be a clue on the recordings, Sabé attempted to decrypt the footage. However, before she could do so the Empire showed its true colors, and Sabé went to fight in the rebellion. She hid the recordings on Naboo where they would be safe until Sabé could continue the investigation."}, {"tag": "h3", "text": "Encountering the Dark Lord"}, {"tag": "h4", "text": "Meeting on Vendaxa"}, {"tag": "p", "text": "During the Galactic Civil War, sometime after the Duel on Cloud City in 3 ABY, Sabé and her team were in a base on Vendaxa when the facility was breached by the local Vendaxan land squids. Her team were swiftly massacred by the creatures. The last of Sabé's soldiers, a Gungan, requested that she evacuate the base. Sabé refused, as she didn't want to leave without the crew, and as such had to watch as the Gungan soldier was also killed by the land squids. When it seemed as though Sabé would be overrun, a dark figure entered the facility with a lightsaber in hand. The man dressed in black used his lightsaber to make quick work of the land squids, clearing the immediate vicinity of the creatures. Upon seeing Sabé, the man spoke the name \"Padmé\" in disbelief."}, {"tag": "p", "text": "Sabé, who had her blaster trained on the man, demanded to know what he had just called her and who he was. A forensics droid that was accompanying the man remarked on the resemblance between Sabé and the deceased Padmé and introduced the man as Darth Vader, an agent of the Emperor. In response to the revelation that the dark figure was a servant of the Empire, Sabé immediately fired on Vader. However, the Sith Lord merely deflected the laser with the Force and telekinetically disarmed Sabé, leaving her defenseless against him. Vader inquired the identity of Sabé, who informed Vader that she was in fact Amidala back to haunt him from the grave. Angered by Sabé's response, Vader used the Force to lift and choke the rebel. However, after a short while, Vader, who was secretly the former Jedi Anakin Skywalker, released her after experiencing memories of his deceased wife Amidala."}, {"tag": "p", "text": "Sabé grasped her blaster and fled deeper into the facility, where the land squids still remained. When Vader followed, the squids attacked him, although he was still able to defeat them with relative ease. Hoping that the land squids could defeat Vader with enough numbers, Sabé opened a gate in the facility that led into the main nest. Vader soon caught up with her and used the Force to prevent her from escaping. Vader again demanded to know Sabé's true identity, assuring her that she didn't have to be afraid of him. Once again, Sabé avoided the question, simply telling Vader that she was angry not afraid. Fortunately for her, Vader came to the realization that Sabé must be one of Amidala's former Handmaidens."}, {"tag": "h4", "text": "Joining Vader"}, {"tag": "p", "text": "With this new information, the forensic droid accompanying Vader managed to identify her as Sabé. Vader queried Sabé on why she had broken into Amidala's apartment on Coruscant years ago and what she had learnt from the investigation. Sabé asked Vader what kind of game he was playing, as she was under the impression that the Emperor had killed Amidala. The droid took note of the fact that Sabé was not entirely sure if her accusation towards the Emperor was true or not, and introduced himself as ZED-6-7. As the droid began to ramble, Vader ordered him to stay silent and revealed to Sabé that someone had stolen Amidala away shortly before her death and that the person/persons responsible were considered enemies of the Empire."}, {"tag": "p", "text": "Vader asked Sabé to join his investigation into Amidala's death, as he knew that she too wanted revenge against those responsible for the Senator's premature demise. Sabé, seeing a Vendaxan land squid approach Vader from the opened gate, blasted the squid and agreed to help him. Sabé and Vader then fought side by side against the mass of land squids emanating from the main nest. After every squid was dead, Vader complimented Sabé on her fighting skills and urged her to follow him."}, {"tag": "p", "text": "As they exited the facility, Vader informed the death troopers waiting outside that they would leave the planet immediately. However, Sabé refused as she wished to bury the corpses of her deceased crew before leaving. Vader allowed it, and tasked ZED-6-7 with assisting her at Sabé's behest. After the burial was completed, Sabé solemnly remarked that they had been good soldiers who had walked with her during Amidala's funeral. She then remarked to Vader and the other Imperials that it was time to leave and boarded Vader's shuttle. On the shuttle, Sabé informed Vader that she and her allies had indeed broken into Amidala's apartment after the funeral and stolen the chamber's security recordings, although she was never able to decrypt them, and so hid them on Naboo."}, {"tag": "h4", "text": "Baiting the trap"}, {"tag": "p", "text": "Upon their arrival on Naboo, Sabé led Vader to the Naberrie lake retreat. As soon as they stepped foot inside, Captains Tonra and Typho began to shoot at Vader. Sabé quickly talked everyone down, introduced Vader to her allies, then chided them for shooting, since she had given the all-clear signal prior to entering. Typho said that they had assumed she was under duress. Sabé informed Vader that he needed Tonra and Typho if he was going to get the security recording, because she had given it to them to hide once it became clear they couldn't decrypt it. The captains led them downstairs to a room with a parked submarine, and together they set off to retrieve the recording."}, {"tag": "p", "text": "As they traversed Naboo's waters, ZED-67 and Vader questioned the men on their time serving Amidala. Tonra revealed that he and Sabé had been sent undercover to Tatooine, where they tried and failed to retrieve Anakin Skywalker's mother. Sabé described the failure as the greatest shame of her life. Soon after, the submarine was attacked by a colo claw fish, which cracked open its hull. Luckily, the group was near enough to their destination, a hydrostatic bubble, to swim the rest of the way. Once inside, Sabé pointed out a mural depicting the celebration after the Battle of Naboo and told Vader that Skywalker, included in the picture, had served Amidala from his childhood until his disappearance after her death, and that she and her comrades mourned his loss along with Amidala's."}, {"tag": "p", "text": "When Vader became impatient and demanded the security recording, Tonra handed a recording device over. Though at first it showed footage of Amidala's apartment, it quickly switched to a recording of Sabé, Tonra, Typho, and others as she declared the formation of the Amidalans and together they swore to find whoever murdered Amidala and kill them. The three Amidalans revealed that because the last time Typho saw Amidala she was headed to Mustafar, and Mustafar was Vader's base, they had come to the conclusion that he killed both Amidala and Skywalker. Vader confirmed that he had, and on Typho's signal, Tonra triggered a beast caller. In response, a massive sando aqua monster appeared and attacked the bubble."}, {"tag": "h4", "text": "Confronting Vader"}, {"tag": "p", "text": "As the aqua monster attempted to break through the bubble, Typho and Tonra began blasting Vader. Sabé noted that they already knew he could deflect direct blaster bolts; they would need to get more creative to beat him. So saying, she turned her blaster on the rock promontory Vader stood on. As it crumbled away beneath him, he fell from the hydrostatic bubble and into the beast's jaws."}, {"tag": "p", "text": "Sabé then met up with Eirtaé, Saché, Rabé, and Dormé in Theed. They were in place at Amidala's tomb in time to intercept Vader. He told them to leave if they did not want to be killed; they chose instead to attack him. They held their own briefly, but he overwhelmed them by Force-choking them, then simply threw the former handmaidens away from him, leaving only Sabé at the tomb entrance with him."}, {"tag": "h4", "text": "Amidala's final secrets"}, {"tag": "p", "text": "Sabé proceeded into the tomb with Vader. Despite her horrified protests, he approached Amidala's coffin and began to move it with the Force. When he relented, ZED-67 scanned the coffin and found a med implant which the droid traced to Polis Massa. Sabé rejoined the other former handmaidens outside the tomb and hailed the rest of the Amidalans to pass on these new coordinates. Prompted by ZED-67, one of the death troopers who had come with Vader prepared to shoot at the Amidalans. Vader put a stop to it and exhorted Sabé to bring her comrades to meet him at Polis Massa."}, {"tag": "p", "text": "The Amidalans arrived at Polis Massa Base with a fleet of ships, and once more attempted to confront Vader. Their ships proved an obstacle as Vader attempted to reach the medical facility there, but he drew their fire and gave the death troopers enough time to fire on the larger ships and bring one crashing down. Vader fought his way through and ultimately escaped the Amidalans unscathed."}, {"tag": "p", "text": "After Vader returned to the Imperial Palace on Coruscant to answer his master's summons, Darth Sidious repeatedly struck him with Force lightning while Grand Vizier Mas Amedda spoke on the emperor's behalf, condemning Vader for his failure to turn Luke Skywalker to the dark side and his failure to kill Sabé. Amedda judged these actions to be treasonous and punishable by death. As Sidious choked Vader with the Force, Vader remembered doing the same to Sabé, Padmé, and other beings."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sabé was loyal to Queen Amidala, serving as both her bodyguard and decoy in crisis situations, despite the considerable risk of injury, capture, or even death that this posed to her. As a member of Amidala's royal retinue of handmaidens, Sabé was handpicked to aid the Queen of Naboo. Like all Naboo handmaidens, she learned self-defense and was also trained to remain vigilant against all threats to her monarch. When impersonating the Queen, Sabé and Amidala, who disguised herself as a handmaiden, relied on a system of subtle signals in order to secretly communicate without undermining the deception of their switched roles."}, {"tag": "p", "text": "Sabe was loyal to a fault. She had loyalty to Padme, and she knew Padme could not return the same care."}, {"tag": "p", "text": "Like Amidala, Sabé was a human female who stood at 1.65 meters. She had brown hair, brown eyes, and light skin. She carried a standard ELG-3A blaster pistol like the queen and her fellow handmaidens and was a capable markswoman, taking off the head of a battle droid at one point with a single shot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sabé first appeared in the 1999 film Star Wars: Episode I The Phantom Menace, portrayed by English actress Keira Knightley. Sabé was originally going to be filled by a stand-in, until casting director Robin Gurland came across Knightley, who bore a striking resemblance to Natalie Portman, who portrayed Padmé Amidala in the film. Knightley's role was kept quiet by The Phantom Menace's marketing department in order to heighten the surprise of there being a decoy queen when the film was released and the queen's costumes were specifically designed to hide any height and shape differences between Portman and Knightley, so much in fact that even Portman's own mother couldn't distinguish between the two on set."}, {"tag": "p", "text": "When asked years later about the role she had played in Star Wars, Knightley was confused that her character's name was Sabé and not Padmé, as she was young during filming and has not viewed the movie since. Knightley joked in response to whether she would reprise her role that she had not been asked to return as a character whose name she had forgotten."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}