{"url": "Sabotage_(episode)", "categories": ["Category:Real-world articles", "Category:Semi-protected articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Sabotage  (episode)"}, {"tag": "p", "text": "\"Sabotage\" is the seventeenth episode of the Star Wars: The Clone Wars television series' fifth season. It aired on February 9, 2013."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"Anakin and Ahsoka investigate a deadly bombing at the Jedi Temple.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Anakin Skywalker and Ahsoka Tano are sent to a battle on Cato Neimoidia by the Jedi High Council to rescue the world from an invasion set by the Separatists. Anakin's starfighter is attacked by buzz droids, who severely damage the ship. Anakin is knocked out by a powerful shock from his damaged starfighter leaving R2-D2 in control of the ship. Ahsoka instructs R2-D2 to land the ship while she pulls Anakin out. Shortly after they are contacted by Yoda, summoning them back to the Jedi Temple to investigate a bombing. It is rumored that a Jedi may have caused the blast, so Anakin and Ahsoka, having been off-world at the time, have been selected to lead the investigation. They are aided by the droid Russo-ISC in their investigation and together he and Tano go to interview the survivors of the blast. There they find a potential suspect, Jackar Bowmani."}, {"tag": "p", "text": "Anakin finds Bowmani's wife, Letta Turmond, in a protest outside the Temple. She protests that her husband could not have had anything to do with the explosion. While analyzing the explosion, they discover the blast origin, a transport, and find that is is covered in explosive Nano-droids. They also manage to find Jackar's hand, the only part of him that survived the explosion. Nano-droids are discovered in his bloodstream, leading them to believe that he \"was the bomb.\""}, {"tag": "p", "text": "Together, Anakin and Ahsoka go to his house to search for more nano-droids, finding them in the food. Suspecting that someone fed the droids to Jackar, they are interrupted by Letta. They decide to bring her back to the temple for more questioning, suspecting that she might know more than she is telling them."}, {"tag": "p", "text": "However, Letta makes a run for it and the two Jedi follow, chasing her through the streets. Finally they corner her in an alley. Both of the Jedi now believe that she was responsible for the explosion and faced with Anakin's anger she admits to it. The Jedi bring her back to the temple. Although still unaware of her motives, they intend to question her further."}, {"tag": "p", "text": "Back at the Jedi Temple, Russo informs Anakin and Ahsoka that his investigation confirms no Jedi were involved in the explosion. Mace Windu voices his opinion that the reason behind the bombing was meant to turn public sentiment against the Jedi and the Clone Wars. Anakin and Ahsoka discuss their own fears that a Jedi might have been the perpetrator; Anakin remarks that while there will be Jedi who disappoint, the greater number of Jedi fighting for the right thing will balance it out."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The episode was named for Alfred Hitchcock's 1936 film Sabotage. All four episodes of the story arc in fact were named after various Hitchcock narratives."}, {"tag": "p", "text": "Anakin Skywalker's statement to Ahsoka Tano, \"I'm afraid one can eventually become the other,\" was in reference to past betrayals of the Jedi by political idealists, including Count Dooku and Season 4's General Pong Krell."}, {"tag": "p", "text": "Russo-ISC's characterizations and name alluded to David Caruso's role in the crime drama series CSI Miami."}, {"tag": "p", "text": "The gunship that delivers Captain Rex to Cato Neimoidia was the Lucky Lekku. The rest of the troops on the gunship are clone jetpack troopers, which makes it the first appearance of the clone jetpack trooper in canon."}, {"tag": "p", "text": "The guards seen at the temple during Anakin's interaction with Cin Drallig, named Temple Guards, were confirmed to be making more appearances throughout the arc."}, {"tag": "p", "text": "The signs among the temple protest groups included a clone trooper behind a cross out sign, and Aurebesh phrases that state \"The Jedi are Corrupt\" and \"Stop Cloning Violence.\""}, {"tag": "p", "text": "Although it was destroyed during the episode, Anakin's Eta-2 interceptor appeared for the first time in the series."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}