{"url": "Sabotage_droid", "categories": ["Category:Legends articles", "Category:Espionage droid models", "Category:Separatist battle droid models"], "nodes": [{"tag": "h1", "text": "Sabotage droid"}, {"tag": "p", "text": "Sabotage droids were repulsorlift droids equipped with electrical prods and bladed rotors. They were also equipped with stealth field generators. They saw use during the Clone Wars in the battles of Ryloth, Behpour, Juma 9, and Alzoc III."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "Sabotage droids were of an insectoid configuration. The droids were very costly to make, possibly due to the levels of high technology used in their construction."}, {"tag": "h3", "text": "Performance"}, {"tag": "p", "text": "The were mainly used to sabotage, as befitting their name."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Battle of Ryloth"}, {"tag": "p", "text": "At the Battle of Ryloth, Anakin Skywalker and Ahsoka Tano encountered these droids while scouting the ruins of the planet's cities. Later, the droids attacked 501st Legion Captain Rex on his AT-RT patrol. When Rex and Boomer were captured by bounty hunter Cad Bane, the clones fought off waves of sabotage droids. When Rex was covering Anakin, more sabotage droids made an appearance."}, {"tag": "h3", "text": "Battle of Alzoc III"}, {"tag": "p", "text": "Sabotage droids were part of Asajj Ventress's attack force to guard a superweapon located in the remains of a Munificent-class star frigate wreck on the surface of Alzoc III. They attacked the Republic forces with their lasers. The Jedi Luminara Unduli and Aayla Secura used the droids to destroy power generators so they could ascertain how the Separatist ship was destroyed. The droids then continued to attack the clones and Jedi until the battle was won in favor of the Republic forces."}, {"tag": "h3", "text": "Battle of Juma 9"}, {"tag": "p", "text": "The sabotage droids at Juma 9 were in charge of guarding Kul Teska while he was trying to use the ship's sensor array. They attacked all of the clone and Jedi forces in the station. They also attacked CP-6824 and the Jedi when the clone tried to determine Teska's reasons for attacking the facility. When Switch hacked the computer, the group was later surrounded by a squad of the droids. They were all later destroyed by Obi-Wan and Plo Koon."}, {"tag": "h3", "text": "Battle of Behpour"}, {"tag": "p", "text": "The sabotage droids at Behpour were a component of the droid forces protecting the base from the invading Jedi and clone troopers. They attacked AT-RTs during a distraction move by the Republic. Anakin Skywalker and his Padawan used the Force to \"jack\" them, and used them against Kul Teska at the Behpour facility."}, {"tag": "h2", "text": "Appearances"}]}