{"url": "Sabotage_at_Rhen_Var", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Battles of the Galactic Civil War", "Category:Battles of Rhen Var"], "nodes": [{"tag": "h1", "text": "Sabotage at Rhen Var"}, {"tag": "p", "text": "The Sabotage at Rhen Var occurred on the ice planet of Rhen Var in 0 BBY during the Galactic Civil War. The battle followed an Rebel Alliance attack that captured an Imperial listening outpost on Rhen Var. The Galactic Empire sent a force to recapture it, which succeeded, although the resulting clash led to the destruction of the outpost and the defeat of all the Rebel forces."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Galactic Empire had long operated a listening outpost out of a derelict citadel on Rhen Var, an ice-covered Outer Rim world deeply entrenched in history surrounding the Galactic Republic, the precursor government to the Empire. In 0 BBY, early in the Galactic Civil War—a conflict between the Empire and the Rebel Alliance freedom fighters—the outpost was able to monitor Rebel fleet activity. The Rebel Alliance subsequently launched an assault to prevent the outpost from tracking them. The Rebels captured the facility from the Imperial garrison stationed there and maintained control over it for a few days before the Empire launched a counterattack."}, {"tag": "h2", "text": "The sabotage"}, {"tag": "p", "text": "The Imperial attack force—consisting of snowtroopers, Imperial Army pilots, scout troopers, shock troopers, and Phase Zero dark troopers—arrived and was ordered to seize the section of the outpost called the Keep. The Imperials advanced against the Rebels, who had deployed at a tower below the station. The Rebel force was comprised of troopers, vanguard division soldiers, snipers, Wookiee smugglers, and pilots."}, {"tag": "p", "text": "Though both sides defended their positions with laser turrets, the Imperials retook the Keep."}, {"tag": "p", "text": "The Imperial counterattack overran the Alliance forces, with the strike ultimately ending in the destruction of the outpost and the loss of all Rebel forces."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "By the end of the battle, all civilized presence on the planet had been wiped out. Shortly thereafter, the Rebel Alliance faced the Empire in an assault on the moon Yavin 4, leading up to the pivotal Battle of Yavin, in which the Empire's Death Star battlestation was destroyed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sabotage at Rhen Var appears in a mission of the same name in the Galactic Civil War campaign of the 2004 video game Star Wars: Battlefront. The game delegates no specific battle plan for the player, playing from the Imperial perspective, to follow. The player is instructed to retake the Keep, which is one of the command posts, but the player can still win the level without doing so. The Imperials have 250 reinforcements available, while the Rebels have 200. When either side reaches zero, the game ends, but the Imperials must win for the campaign to continue."}, {"tag": "p", "text": "The battle features a discrepancy between the various sources. The Star Wars: Battlefront game states that the Imperial forces were defending the outpost, but this was overwritten by 2009's The Essential Atlas, which says that the Rebels captured the outpost before the Imperials retook it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}