{"url": "Saell-Terae", "categories": ["Category:Legends articles", "Category:Collectors", "Category:Males", "Category:Yarkora"], "nodes": [{"tag": "h1", "text": "Saell-Terae"}, {"tag": "p", "text": "Saell-Terae was a male Yarkora who claimed to be a dealer in antiquities. The owner of the ship Lost Reef, he spent a time mapping the Unknown Regions for unclear reasons. After a brush with Grand Admiral Thrawn, Saell-Terae was forced to abandon his ship, at least temporarily."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Saell-Terae, a self-proclaimed dealer in antiques, purched the submersible DeepWater-class light freighter Lost Reef, built by Mon Calamari shipwrights, in an auction to private owners. He apparently wanted to use the ship for the purpose of mapping areas of the Unknown Regions, although he had no short-term monetary goals in this venture."}, {"tag": "p", "text": "To do so, Saell-Terae performed several customizations on the ship, including replacing the Calamari life-support system with a different model designed for non-amphibious. He also replaced the shielding package with a better one, added new targeting computers and outfitted the ship with powerful, hidden weapons that the Galactic Empire would deem illegal."}, {"tag": "p", "text": "While on the Unknown Regions, Saell-Terae acquired a trio of gem-incrusted statues crafted by a warlord from a local, primitive species. At that point, this species was in conflict with art connoisseur Grand Admiral Thrawn of the Galactic Empire. Thrawn, who wanted to study the species' artworks to understand his enemy, offered to buy the statues from Saell-Terae, but the Yarkora refused for unknown reasons. Thrawn disliked this answer and Saell-Terae was forced to escape from Thrawn's forces, including the Admonitor."}, {"tag": "p", "text": "Eventually going into hiding, Saell-Terae deleted the navigation computer of the Lost Reef and abandoned the ship near Elrood sector in order to evade Thrawn's agents. He nonetheless left the statues on the pontoon of the ship, and forgot a hidden dataplaque with detailed astrogation charts in the airlock. The ship then appeared mysteriously alone."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Saell-Terae kept his real goals a secret, but he was known to not get any profit at all in any negotiation he made."}, {"tag": "p", "text": "Saell-Terae liked his ship. Once he was forced to abandon it, he assumed a new crew would claim it. Saell-Terae would then try to recover the Lost Reef, and was ready to kill the new owners if needed."}, {"tag": "h2", "text": "Sources"}]}