{"url": "Sacrifice_(cinematic_trailer)", "categories": ["Category:Real-world articles", "Category:Star Wars: The Old Republic cinematic trailers"], "nodes": [{"tag": "h1", "text": "Sacrifice (cinematic trailer)"}, {"tag": "p", "text": "Sacrifice is the fourth cinematic trailer released by BioWare for the video game Star Wars: The Old Republic, and serves as a reveal trailer for the Knights of the Fallen Empire expansion. Released on June 16, 2015, the video depicts the story of Arcann and Thexan, twin heirs of Valkorion, Emperor of the Eternal Empire. The video, released at E3 2015, runs at four minutes and twenty-three seconds."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "Years before the Galactic War, Emperor Valkorion of the Eternal Empire looks without any visible emotion at the cribs of his twin sons Arcann and Thexan and then walks away. Later, when the young princes have grown into teenage boys, they are playing in a field of grass, fighting imaginary foes together, with wooden sticks serving them as swords."}, {"tag": "p", "text": "Some time later, Valkorion oversees a quarterstaff sparring match between Arcann, Thexan, and several Knights of Zakuul. When Thexan notices Arcann being knocked down by one of his opponents, he rushes to help his brother, pushing one of the Knights away with the Force and defeating the rest with his quarterstaff. However, after Thexan helps Arcann back to his feet, the twins both notice their father leaving the site without saying a word. The brothers are both in a dark room later, where Thexan constructs and activates a lightsaber."}, {"tag": "p", "text": "With the forces of the Eternal Empire ready to commence attacks on both the Galactic Republic and the Sith Empire years later, Arcann and Thexan, now skilled lightsaber combatants, both kneel before Valkorion in his throne room, located in the Spire on the planet of Zakuul, and leave to lead the military offensive. Valkorion does not look at his sons during their departure, gazing instead through the throne room's viewport, at which Arcann is visibly disappointed. The twin princes proceed to personally lead the Eternal Fleet and the Knights of Zakuul on several attacks against the Republic and Sith forces on various worlds. The Eternal Empire forces defeat Republic troopers and Sith Warriors, and Thexan kills a Jedi on one such battlefield. Following the conclusion of a battle in a blizzard, the brothers communicate with their father via hologram, after which Arcann angrily knocks the holoprojector away with the Force."}, {"tag": "p", "text": "Arcann and Thexan then lead an assault on the Sith holy world of Korriban, where the Twi'lek female Sith Darth Atroxa coordinates the defending forces. Arcann suffers grievous injuries in the fight, including the loss of his left arm, and Thexan comforts him while he has a prosthetic limb attached. Shortly thereafter, Arcann uses his newly augmented strength to kill several Sith warriors and Darth Atroxa herself, after which the brothers board a shuttle and leave the planet."}, {"tag": "p", "text": "When the twin princes arrive at Valkorion's throne room and present banners and lightsabers of the defeated Republic and Sith forces as trophies to the Emperor, he once again shows no emotion and indifferently turns away from the brothers, which enrages Arcann to the point where one of his eyes starts to glow orange due to the dark side of the Force, and he charges and jumps at Valkorion with his lightsaber drawn. However, Thexan telekinetically pulls Arcann away before he can land the killing blow, and the two brothers proceed to have a short lightsaber duel before the still enraged Arcann fatally injures Thexan. Realizing what he has done, Arcann cradles his dying brother in sorrow. Meanwhile, Valkorion has approached the scene of the brothers' fight and extends his hand to Arcann, calling him \"son\" and inviting the prince to come with him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 4:23 minute cinematic trailer for the video game Star Wars: The Old Republic: Knights of the Fallen Empire, titled \"Sacrifice\", was released on June 15, 2015. The character Darth Malgus, an antagonist from the original game, was to appear in the cinematic, his body locked in carbonite while the brothers Arcann and Thexan present him before Valkorion. This scene was cut, and later revealed, along with concept arts, during San Diego Comic Con 2015 Cantina Tour, a fan-event hosted by Bioware. Darth Malgus himself never appeared in the game extension, besides a few mentions."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}