{"url": "Saesee_Tiin", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Aces", "Category:Iktotchi", "Category:Jedi Generals", "Category:Jedi High Council members", "Category:Jedi Purge victims", "Category:Males"], "nodes": [{"tag": "h1", "text": "Saesee Tiin"}, {"tag": "p", "text": "Saesee Tiin, a Force-sensitive Iktotchi male from the moon Iktotch, was a Jedi Master who served on the Jedi High Council during the last years of the Galactic Republic. A skilled lightsaber combatant and starfighter pilot, Tiin fought in the Clone Wars as a Jedi General of the Grand Army of the Republic. He was slain by Darth Sidious shortly before fellow Jedi Master Agen Kolar when a team of High Council members, organized by Mace Windu, confronted the Sith Lord, who was revealed to be the true identity of Supreme Chancellor Palpatine."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Iktotchi born on the moon Iktotch, Saesee Tiin was eventually promoted to the rank of Jedi Master[source?] and gained a seat on the Jedi High Council by 40 BBY. In that year, Tiin was present at a Council debate over the dispute between the Czerka Arms and the Pijali monarchy."}, {"tag": "h3", "text": "Blockade of Naboo"}, {"tag": "p", "text": "In 32 BBY, the planet Naboo was blockaded. Master Qui-Gon Jinn, who had been sent by Supreme Chancellor Finis Valorum to end the blockade alongside his Padawan Obi-Wan Kenobi, came before the Council after rescuing Queen Padmé Amidala and bringing her to Coruscant. He told the Council that he believed he had encountered a Sith Lord on Tatooine and that a slave he freed, Anakin Skywalker, was the Chosen One. The Council was skeptical of Jinn's claims and denied him permission to train Anakin due to him being too old. After Jinn was slain during the Battle of Naboo by Darth Maul, Tiin and the rest of the Council attended his funeral and decided to let Kenobi train Skywalker, fulfilling Jinn's dying wish."}, {"tag": "h3", "text": "Battle of Geonosis"}, {"tag": "p", "text": "Tiin was a participant in the First Battle of Geonosis, the first battle of the Clone Wars against fallen Jedi and now Sith Lord Count Dooku and the newly-formed Confederacy of Independent Systems with their armies of battle droids. Tiin, unlike many others in the battle, survived, having escaped the Petranaki Arena alongside Mace Windu and Ki-Adi-Mundi and went on to become a Jedi General in the Grand Army of the Republic."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Mission to Hissrich"}, {"tag": "p", "text": "Sometime after the war's outbreak, Tiin was present alongside the rest of the Jedi Council at a meeting in which they gave Windu a task. Republic scouts had discovered that the Confederacy had occupied the planet Hissrich in the Outer Rim Territories, which the council began to fear that the Confederacy was to utilize the planet as a staging area for assaults on neighboring star systems."}, {"tag": "p", "text": "In hopes of determining the threat level, Windu, alongside fellow Jedi Masters Kit Fisto, Dibs and Jedi Knight Rissa Mano were tasked with running a covert mission to acquire the information. Later, Tiin was once again present at another meeting, where Windu reported that he was successful in his mission."}, {"tag": "h4", "text": "A mysterious killer"}, {"tag": "p", "text": "During the Clone Wars, Tiin was present at the Jedi Temple when Delta Squad brought back the bodies of Jedi Master Halsey and his apprentice Knox who were killed in the massacre on Devaron. Adi Gallia suspected it was the work of the presumed dead Asajj Ventress, however Jedi Master Plo Koon suspected it was a newly appointed Sith Lord. Obi-Wan Kenobi, on the other hand, suspected it was the work of a monstrous animal. The mysterious killer was revealed to be the Nightbrother Savage Opress, which surprised Kenobi as Opress appeared similar to Darth Maul who he had supposedly beaten on Naboo years before."}, {"tag": "h4", "text": "Battle of Lola Sayu"}, {"tag": "p", "text": "Tiin took part in the rescue of Even Piell, Wilhuff Tarkin and his men from the Citadel prison on Lola Sayu in which they were imprisoned, due to the fact that they were carrying vital information of hyperspace coordinates that could change the scale of the war to the faction in possession of the said secret information. Piell was killed by an Anooba that pounced on him. Tiin alongside Adi Gallia, Plo Koon and Kit Fisto, rescued what remained of the team and returned with them to Coruscant."}, {"tag": "h4", "text": "Water War"}, {"tag": "p", "text": "Fisto, Anakin Skywalker, and all other Republic troops were trapped in a losing battle against their opposition's superior strength provided by the Quarren and AQ-series battle droids. Fisto and the others managed to contact the Jedi Temple with a faint signal, yet it was too weak and within moments collapsed. Windu understood the broken communication as sign of the Republic's impending defeat, however noting that it would take a considerable time to train any new SCUBA troopers, the situation was dire. On this topic, Yoda recommended that they should ask help from a suitable ally of the Republic. Master Tiin suggested they contact the Gungans who were an amphibious species with a standing army and planet located near Mon Cala."}, {"tag": "h4", "text": "Battle of Umbara"}, {"tag": "p", "text": "Anakin Skywalker, Pong Krell, Master Kenobi and Master Tiin were all present during the Battle of Umbara with Pong Krell and Master Tiin's troops supporting Kenobi's troops in the south of the planet."}, {"tag": "h4", "text": "The Council's plot"}, {"tag": "p", "text": "Tiin was present during the funeral of Obi-Wan Kenobi, which was in fact a plot created by the Council to infiltrate the ranks of bounty hunters and discover a plan created by Count Dooku to capture Chancellor Palpatine, which succeeded as Skywalker and Windu were able to prevent the Chancellor's assassination on Naboo."}, {"tag": "h4", "text": "Temple bombing"}, {"tag": "p", "text": "Tiin was present at the funeral for the victims of the bombing of the Jedi Temple, where in fact the culprit of the bombing was hiding among the present Jedi, Admirals and political figures."}, {"tag": "p", "text": "Tiin also partook in deciding the expulsion of Jedi fugitive Ahsoka Tano after the bombing where he, along with Masters Windu and Ki-Adi-Mundi, did not believe Tano was innocent of the crime. Tiin noted that Tano had been found with nano-droid explosives, the same devices used in the bombing, which he felt alone was enough for her to be convicted. In the end, however, Tano's name was cleared after Barriss Offee, the actual bomber was uncovered by Anakin Skywalker. Tano was offered a place back in the Order, but refused."}, {"tag": "h4", "text": "A voice from beyond the grave"}, {"tag": "p", "text": "Later in the war, Tiin was present when Master Yoda felt he was hearing a voice from beyond the grave, but the combined power of all of the Council members could not find anything. Yoda left Coruscant after this without the Council's express permission. On the planet Dagobah, Yoda had a vision that Tiin engaged in a lightsaber duel with Darth Sidious and was killed when Sidious stabbed him."}, {"tag": "h4", "text": "Rescuing Quinlan Vos"}, {"tag": "p", "text": "Tiin was present with Akar-Deshu and some of his council counterparts discussing Quinlan Vos's fall to the dark side."}, {"tag": "h4", "text": "Death"}, {"tag": "p", "text": "In the last days of the war, after Dooku's death, Tiin was one of four Council members sent to arrest Supreme Chancellor Palpatine, now revealed by Anakin Skywalker to be the powerful Sith Lord Darth Sidious, alongside Fisto, Agen Kolar and Windu. Sidious, however, resisted his arrest, instead pulling out his red lightsaber and engaging the group of Jedi in combat. Despite the skills of the Jedi Masters, the Sith Lord quickly cut down Kolar and Tiin before engaging Windu and Fisto in a brief duel, only Windu living to continue the fight. Windu eventually fell too however due to Sidious' aid from Skywalker who then succumbed to the Dark side of the Force and was christened as Darth Vader. This failed attempt to arrest the Chancellor led to the destruction of the Jedi Order and the rise of the Galactic Empire."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Shortly after the Battle of Fortress Vader, Vader entered a portal constructed by Darth Momin to resurrect his wife Padmé Amidala. While walking through visions, he encountered Tiin along with many Jedi he had known in his life as Anakin, with their lightsabers ignited ready to battle him. However, Vader killed all the illusions, first impaling Tiin through the chest as the words \"let the past die\" resounded in his mind."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Saesee Tiin was regarded as a legendary warrior among the Jedi High Council. He was steadfast and courageous, though he rarely spoke and generally kept to himself."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Tiin had natural telepathic powers that were superior to most other Jedi, and he was regarded as one of the Order's best starfighter pilots. He was also a renowned duelist. He was present at the opening foray on Geonosis and was among the small circle of survivors that escaped from the Petranaki arena."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Saesee Tiin was portrayed and voiced by several actors during the Star Wars prequel trilogy: Khan Bonfils in 1999's Star Wars: Episode I The Phantom Menace, Jesse Jensen (brother of Kit Fisto's actor Zachariah Jensen) in 2002's Star Wars: Episode II Attack of the Clones and Kenji Oates in 2005's Star Wars: Episode III Revenge of the Sith. He was voiced by Dee Bradley Baker in the Star Wars: The Clone Wars TV show."}, {"tag": "p", "text": "On playing Tiin in Attack of the Clones, Jesse Jensen's brother Zachariah, who was working as set carpenter, was originally suggested by Matt Sloan to play Tiin, but after director George Lucas and producer Rick McCallum met Zachariah, they gave him the role of Kit Fisto and Jesse was given the part of Tiin."}, {"tag": "p", "text": "In the Clone Wars episode \"Citadel Rescue,\" Tiin's starfighter was modeled with the same pattern as Ahsoka's starfighter."}, {"tag": "p", "text": "In the first draft of Revenge of the Sith, Tiin would have been killed alongside Ki-Adi-Mundi on Mygeeto during Order 66."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}