{"url": "Saelt-Marae/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Desilijic servants", "Category:Males", "Category:Spies", "Category:Tatooinians", "Category:Yarkora"], "nodes": [{"tag": "h1", "text": "Saelt-Marae"}, {"tag": "p", "text": "Saelt-Marae, known by many as Yak Face, was a long-lived Yarkora confidence trickster and information broker who lived for several centuries during the waning days of the Old Republic and the reign of Emperor Palpatine. Marae kept details surrounding himself secret, so little was known about his early life. He spent two hundred years courting his chosen mate, and she later bore at least one child of Marae's. Eventually he left her to continue in his life of crime, which was common among the Yarkora people."}, {"tag": "p", "text": "Marae specialized in wheedling sensitive information out of various wealthy people without their ever realizing it. He was able to learn how a trader protected his goods by simply speaking with him about almost any topic, before eventually stealing from the trader. He also served as an informant to both the Alliance to Restore the Republic and the Galactic Empire, selling his information to the highest bidder. Around 1 ABY, Marae joined the entourage of Hutt crime lord Jabba Desilijic Tiure, outwardly posing as a harmless merchant while really acting as an informant for Jabba. He ingratiated himself with the Hutt's various employees, gaining their trust and learning of any plots against Jabba. For his part, Marae was handsomely paid. When Jabba was killed at the Great Pit of Carkoon in 4 ABY, Saelt-Marae stole many of his secret financial records and disappeared."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Courtship"}, {"tag": "p", "text": "Saelt-Marae was a Yarkora, and like all members of his species, he was very secretive; thus, next to nothing was known about his background. He was born several hundred years before the Battle of Yavin, living the majority of his early life in the far reaches of the Outer Rim Territories. Like many Yarkora, Marae embarked on a life of crime, becoming a con man early in his life—he noted every little detail he had been told by those he wished to plunder, using them for bribery, intrigue, and blackmail."}, {"tag": "p", "text": "Eventually, however, Marae took a career break to carry out the traditional Yarkora method of courting a mate. As the Yarkora had a very low population, Marae was required by law to marry and father children. He and his partner spent several centuries discussing various topics as they traveled the galaxy, as was dictated by Yarkora custom. Marae recorded these conversations in both written and digital media, though much of their conversations were communicated through basic telepathy. Marae and his lover did produce offspring, though they eventually parted ways—around two hundred years after they first met."}, {"tag": "h3", "text": "Con man"}, {"tag": "p", "text": "Saelt-Marae returned to a life of crime after the Republic was replaced by the Galactic Empire. He worked for both the Empire and the Alliance to Restore the Republic, making a lucrative profit selling information to both sides during the Galactic Civil War. Marae posed as a trader who specialized in obtaining rare and religious artifacts from primitive cultures, though in truth he was a thief, informant, and con man. He held considerable talent at coaxing sensitive information out of people without his victims ever realizing exactly how much they had told him; he used this ability—which was augmented by his mild psychic talents—to learn of the security measures of establishments, which he later plundered. He specialized in stealing from art galleries, rarely getting caught. By learning a dealer's opinions on philosophy, politics, and religion, he was able to discern how the dealer safeguarded his valuables, and could bypass any security measures with considerable ease. He did slip up in one Corellian art gallery, where a local security official deduced that Marae was responsible for the theft of a large amount of expensive artwork, though the Yarkora criminal was long gone by that time."}, {"tag": "p", "text": "Marae found employment working for Jabba Desilijic Tiure—one of the most influential crime lords in the galaxy—on Tatooine several years before the Battle of Endor. He was hired to pose as a trader and mingle with the various denizens of Jabba's Palace, gaining their trust and friendship before backstabbing them; he learned of many plots against Jabba's life before they came to bear and was able to help the Hutt prevent them from happening. Marae profited greatly from this, selling much information to Jabba behind the backs of those he had learned it from. Marae also consorted with members of the B'omarr Order, the aloof group of monks who had built Jabba's desert palace."}, {"tag": "p", "text": "Marae accompanied Jabba's entourage to the Great Pit of Carkoon to witness the execution of Han Solo and his fellow Rebels in 4 ABY, getting into a brawl with another of Jabba's employees, Ree-Yees, en route. The altercation ended in a stalemate, though Marae sent C-3PO, the protocol droid translating the argument, sprawling onto the ground. Jabba's sail barge, the Khetanna, was destroyed at the skirmish between his forces and the Rebels that followed, and the Hutt and most of his cohorts were killed. Marae was believed to have died when the Khetanna was destroyed, but actually survived the explosion, leaving Tatooine with a sizable amount of Jabba's secret financial records and raiding many of the Hutt's hidden bank accounts. That was his last known activity, and after stealing much of Jabba's finances, Marae went into hiding. Eventually, his memoirs were discovered on an unknown planet in the Outer Rim where a group of Yarkora had developed a community. Marae's records provided sentientologists with much previously unknown information on the Yarkora."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Saelt-Marae was very secretive, a trait not uncommon among his species. Marae was a loner, who kept his origins and motives secret from his companions, and often kept even his name from them; many in Jabba's court suspected that \"Saelt-Marae\" was nothing more than a pseudonym, while others referred to him simply as \"Yak Face\" because of his whiskered, broad-snouted visage. Marae was highly intelligent, and was capable of learning much about a being through basic conversation. This talent was bolstered by his psychic abilities—which sentientologists suspected could have been latent Force abilities—and the experience he had gained over the centuries. Marae also used his telepathy to further the bond between himself and his wife. By using this ability they could achieve a greater understanding of what the other was saying, and communicate concepts which could not be put into words. Another trait he had in common with his species was his ability to make others uneasy around him. He put this to great use when scouting before a potential robbery and when acting as Jabba's snitch, preying on the weaknesses of others and attempting to intimidate them into providing him with information. In his information gathering, the Yarkora employed his large ears for eavesdropping. He also had highly sensitive whiskers about his large snout."}, {"tag": "p", "text": "Marae had no qualms about taking advantage of the gullibility of other beings, and cared little for laws. He had no loyalty to anyone but himself, and would betray anyone for the right price. While he attempted to hide his emotions, opinions and motivations from those around him, he did occasionally lose his temper. On the journey to Carkoon in 4 ABY, Marae engaged the Gran Ree-Yees in a vicious fight, showing his violent side. He was also known to carry a double-barreled blaster pistol on his person at all times. Marae was a sly being; it was a testament to his craftiness that none of the members of Jabba's Palace whom he spied on ever suspected his true motivations."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Saelt-Marae was created for Star Wars: Episode VI Return of the Jedi, where he appeared as a background character in Jabba's Palace. Marae only appeared on screen for a moment, and was given the name Yak-Face during Return of the Jedi's production. He was portrayed by Sean Crawford. Yak Face was supposed to have a quarrel with another of Jabba's minions, Ree-Yees, and although it was filmed, it was ultimately cut from the film's release. The fight was included in the novel, albeit with Ephant Mon taking Yak Face's place, though the official Star Wars Databank made Marae's fight with Ree-Yees official Legends. The character was not given a proper name until 1997, when the Star Wars Trilogy Sourcebook, Special Edition was released by West End Games. His name was used as an example Yarkora name in Ultimate Alien Anthology and The Force Unleashed Campaign Guide. He briefly appears aboard the Khetanna in one panel of the non-canon comic The Return of Tag & Bink: Special Edition."}, {"tag": "p", "text": "An action figure of Yak Face was released by Kenner in 1985, though it was never distributed in the United States. Because of this, and because of the overall rarity of the figure, the vintage Yak Face is a highly sought-after collector's piece, and mint figures have sold for thousands of dollars."}, {"tag": "p", "text": "There is a slight discrepancy about Marae's fate on the Khetanna: Star Wars: Behind the Magic establishes that he was killed when it exploded, while Who's Who in Jabba's Palace contradicts this, claiming that he survived. As Who's Who is a more recent source, this article assumes that he survived."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}