{"url": "Baiuntu", "categories": ["Category:Legends articles", "Category:Ansionians", "Category:Businesspeople", "Category:Males"], "nodes": [{"tag": "h1", "text": "Baiuntu"}, {"tag": "p", "text": "Baiuntu was a male Ansionian and a non-traditional Alwari tribesman who was the chief trader of a Qulun clan on the planet Ansion. In 22 BBY he had Jedi Masters Luminara Unduli and Obi-Wan Kenobi, their Padawans Anakin Skywalker and Barriss Offee, and their Ansionian guides Kyakhta and Bulgan drugged and held captive. He was later killed by a shanh pack during a skirmish in the Qulun camp."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Baiuntu was an obese male Ansonian of the Alwari tribes who acted as chief trader of a Qulun clan on Ansion. In 22 BBY, Jedi Masters Luminara Unduli and Obi-Wan Kenobi, along with their Padawans Anakin Skywalker and Barriss Offee, and several local companions encountered a Qulun patrol led by Baiuntu while they were searching for the Borokii, the ruling Alwari overclan. As the Qulun were always keen on company, Baiuntu invited the group to return to their camp to dine with them, an offer the Jedi accepted."}, {"tag": "p", "text": "After being shown around the camp, the Jedi and their companions were brought into a large portable \"trade room\" structure, where they were invited to sample various goods offered by the Qulun. After they'd done so, and had been entertained by lightwick sculptures and dance pixies, the Jedi and Baiuntu discussed politics: Baiuntu felt that the Qulun had benefited from Ansion's membership in the Galactic Republic. He later invited the group to sample various intoxicating essences, including Paluruvu, which contained a powerful sedative that rendered unconscious the Jedi and their companions—along with Baiuntu, who had willingly inhaled the essence. Baiuntu later admitted the drugging was carried out because of the bossban Soergg-issued promise of a large reward to those who could delay the group's return to Cuipernam. However, the Jedi and their companions were freed by Tooqui (by way of a lorqual stampede) prior to a skirmish in the Qulun camp."}, {"tag": "p", "text": "Baiuntu, while attempting to pursue the Jedi, was killed by a rabbidly agitated shanh pack shortly thereafter."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Unlike many Ansionians, Baiuntu chose to shave his mane. Although he was overweight, he was still able to ride a sadain, though the creature had some difficulty carrying him. Baiuntu also considered himself more sophisticated than most among the Qulun clan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Baiuntu first appeared in the 2002 novel The Approaching Storm, written by Alan Dean Foster. He would later receive an entry in The Complete Star Wars Encyclopedia, written by Stephen J. Sansweet and Pablo Hidalgo, and released on December 8, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}