{"url": "Safe_cargo_objective/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Battles of Quarzite", "Category:Missions of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Safe cargo objective"}, {"tag": "p", "text": "The safe cargo objective was an operation carried out by a group of six bounty hunters, Latts Razzi, Dengar, Asajj Ventress, C-21 Highsinger, Bossk and Boba Fett, who was leading the posse. They were hired by the Belugan Rigosso to help him deliver a certain chest safely to Otua Blank."}, {"tag": "h2", "text": "The operation"}, {"tag": "p", "text": "Because of the planet's atmospheric pressure, delivery by spaceship was impossible. The chest was loaded onto a subtram instead."}, {"tag": "p", "text": "Shortly after departing, however, the tram was attacked by Kage Warriors. In the ensuing battle, the members of Fett's group were knocked out of the tram one by one; Dengar was simply kicked over a rail, Bossk was blinded temporarily and knocked off the tram, and Highsinger and Latts were disposed of together when the Kage Warriors' leader, Krismo Sodi, dodged Latts's Grappling boa which then wrapped around Highsinger's neck. Sodi then kicks Highsinger, causing him to fall off and accidentally pulling Latts with him. After exchanging a few words with Rigosso, Krismo threw his Electro sword into the former's midsection. Only Fett and Ventress were left. In a duel with Sodi, Boba inadvertently toppled the chest over. Much to his surprise, a young woman tumbled out. Boba attempted to protect her and she slapped him in the face. Surprised and confused, he was caught off guard when Sodi lept at him and knocked him unconscious. The woman was revealed to be Pluma Sodi, Krismo's sister. Pluma was to be forcibly married to Otua Blank. Before the siblings could escape, however, Ventress arrived. In a quick duel, Ventress defeated Krismo. However, Pluma's pleas struck Ventress, as her story reminded the former Sith assassin of what happened to her. Fett and Ventress had a heated argument over Pluma, ending when Ventress Force choked Boba."}, {"tag": "p", "text": "The tram arrived at the orbital station and Otua blank was eagerly anticipating his bride-to-be. After Ventress collected her payment for delivering the chest and departed, Blank opened it and was shocked to see a bound, gagged and extremely angry Boba Fett in Pluma's place."}, {"tag": "p", "text": "Ventress, after being paid by Krismo to release Pluma into his care, met up with the other members of Fett's posse and split the payment as planned, telling them to make sure Fett got his share and adding that he would \"turn up\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}