{"url": "Safecrackers", "categories": ["Category:Legends articles", "Category:Republic Special Forces units"], "nodes": [{"tag": "h1", "text": "Safecrackers"}, {"tag": "p", "text": "The Safecrackers were an elite Republic Special Forces Division squad of troopers in the army of the Galactic Republic, who fought against the Sith Empire during the Cold War. The squad consisted of elite demolitions specialists that were trained to infiltrate fortified enemy bunkers and command posts, eliminate hostiles, and either secure the locations for the Republic or destroy them."}, {"tag": "p", "text": "The Safecrackers operated on Quesh, under the command of Lieutenant Coria, during the later Cold War. Havoc Squad, under the command of its current CO, was deployed by General Elin Garza to Quesh in order to assist and extract the squad."}, {"tag": "p", "text": "Immediately following, Havoc Squad and the Safecrackers infiltrated and sabotaged the Gauntlet superweapon from within and escaped before it was destroyed."}, {"tag": "p", "text": "After the Galactic War broke out, the Safecrackers were deployed to Corellia to assist in storming the Bastion, the center of Republic military operations, captured by General Arkos Rakton during the initial invasion. Together, with Havoc Squad and the Fifty-third Armored Platoon, the Safecrackers assisted in the siege, breaking through the Imperials lines and held off reinforcements while the Havoc CO went to deal with Rakton. After defeating the Empire's \"unbeatable\" general, the Safecrackers were assigned to escort him."}, {"tag": "p", "text": "The Safecrackers' \"Killed in Action\" rates for their missions frequently exceeded thirty percent. For this reason, the squad maintained a private memorial space at their barracks for members lost in the line of duty. After every successful mission, The Safecrackers return to the memorial in squad formation to salute and honor their fallen comrades."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}