{"url": "Saesee_Tiin%27s_Delta-7_Aethersprite-class_light_interceptor", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Delta-7 Aethersprite-class light interceptors"], "nodes": [{"tag": "h1", "text": "Saesee Tiin's Delta-7 Aethersprite-class light interceptor"}, {"tag": "p", "text": "Jedi Master Saesee Tiin piloted a Delta-7 Aethersprite-class light interceptor colored orange, black, and white with red markings in the service of the Galactic Republic during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The orange, black, and white Delta-7 that Jedi Master Saesee Tiin piloted during the Clone Wars had red markings and carried an astromech droid for astrogation and on-board repair. It was one of two Delta-7 starfighters that Master Tiin modified to increase the already impressive performance levels of the Aethersprite-class interceptors."}, {"tag": "p", "text": "Customizing in-flight removable hull panels, Tiin increased the starfighter's armament by adding four quad-pulse laser cannons to its usual complement of two dual laser cannons. Tiin also fit a small Class 3 hyperdrive of his own making, negating the need for a hyperdrive docking ring except in the case of emergencies."}, {"tag": "p", "text": "In addition to performance upgrades, Tiin also replaced the standard pilot's seat with a more comfortable one that allowed him to enter meditation much more easily during long journeys."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Well known for his exceptional starfighter piloting skills, daring space combat techniques, and keen interest in new flight technology, Saesee Tiin used his keen understanding of spaceflight and telepathic capabilities to give his Delta-7 superior advantages without needing computer-assisted navigation—even at transluminal velocity."}, {"tag": "p", "text": "Additionally, he used his innate telepathic abilities to race ahead foresee possible outcomes to events which proved formidable to opposing sentient pilots. Deeply interested in advancements in flight technology, he encouraged Anakin Skywalker to assist him in making modifications to the Delta-7. Tiin even saw to it that many of Skywalker's starfighter design changes were included in the upgraded Eta-2 Actis-class interceptors."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}