{"url": "Saesee_Tiin%27s_Delta-7B_Aethersprite-class_light_interceptor/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Delta-7B Aethersprite-class light interceptors", "Category:Jedi starfighters", "Category:Unidentified starfighters"], "nodes": [{"tag": "h1", "text": "Saesee Tiin's Delta-7B Aethersprite-class light interceptor"}, {"tag": "p", "text": "Jedi Master Saesee Tiin piloted a green Delta-7B Aethersprite-class light interceptor with white markings in the service of the Galactic Republic during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Delta-7B Aethersprite-class light interceptor used by Jedi Master Saesee Tiin during the Clone Wars was green with a center detail of a white emblem of the Jedi Order covering the entire hull of the ship. The ship was armed with dual laser cannons and carried an astromech droid for astrogation and on-board repair."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Master Saesee Tiin began to use the Delta-7B after the Jedi Order began decommissioning old Delta-7 interceptors, such as one of the pair that he customized and used formerly."}, {"tag": "p", "text": "Around 21 BBY, he piloted this starfighter during a mission to rescue a group of prisoners being held on Lola Sayu. Accompanied by Adi Gallia and Kit Fisto in their respective interceptors, as well as one of Plo Koon's gunships, Master Tiin flew his Delta-7B down to the planet's surface to help in the extraction of the prisoners. Together with Gallia and Fisto, Tiin provided cover fire for Plo Koon while he successfully extracted the prisoners on his gunship. The rescue team then returned to the Venator-class Star Destroyer which jumped to hyperspace with the accompanying Republic fleet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Saesee Tiin's Delta-7B first appeared in Citadel Rescue, an episode of the Clone Wars animated television series. As with Adi Gallia's Delta-7B and Plo Koon's Blade of Dorin, Tiin's ship shares hull graphics identical in all but color with Ahsoka Tano's Delta-7B. This suggests a reuse of graphics by the production team."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}