{"url": "Sagwa", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Guards", "Category:Kashyyyk residents", "Category:Males", "Category:Pyke Syndicate slaves", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Sagwa"}, {"tag": "p", "text": "Sagwa was a male Wookiee who was imprisoned by the Galactic Empire in the spice mines of Kessel. After years of toil, Sagwa was freed by Chewbacca and participated in a break-out, escaping alongside Tak and other slaves."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sagwa was a Wookiee from the inland tree city of Rwookrrorro on the planet Kashyyyk. During the Imperial Era he attempted to defend his fellow Wookiees from Imperial patrols, but was imprisoned and forced to work in the spice mines of Kessel as a slave. He wore an electro-charged slaving collar and had his shaggy arms bound by heavy shackles. Years of toil took their toll on his body, leaving his brown fur balding due to illness, though he continued to selflessly spare weaker slaves from the most brutal mining duties."}, {"tag": "p", "text": "Sagwa was among the slaves who participated in the uprising instigated by L3-37, and was freed by Chewbacca after the Wookiee attacked Sagwa's guards. The two Wookiees fought alongside each other, and Sagwa helped Chewbacca and Han Solo escape the mines with a stash of unrefined coaxium. Once outside, Sagwa fought off Pyke sentinels and helped Chewbacca load the coaxium into smuggling compartments aboard the Millennium Falcon. He bid farewell to Chewbacca before following Tak and other escaped prisoners."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sagwa was a selfless individual, attempting to defend his fellow Wookiees from Imperial patrols on Kashyyyk, and later sparing weaker slaves from brutal toil in the spice mines of Kessel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}