{"url": "Sairgon", "categories": ["Category:Canon articles", "Category:61st Mobile Infantry personnel", "Category:Alliance Military officers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sairgon"}, {"tag": "p", "text": "Sairgon was a male lieutenant in the Rebel Alliance's 61st Mobile Infantry, nicknamed Twilight Company, being second-in-command after Captain Micha Evon, also known as Howl. He called off a recruitment drive after the captain was shot by an Imperial spy and directed Private Hazram Namir to Howl while on the planet Vir Aphshire. After Governor Everi Chalis defected to Twilight Company in 3 ABY, Sairgon joined Howl, First Sergeant Namir, and Chief Medic Von Geiz questioned the governor in the captain's office. Sairgon remarked about Chalis not asking to defect and her residence not being the company's target, as well as questioning her career prior to being a governor."}, {"tag": "p", "text": "During the following campaign on the planet Coyerti, the lieutenant informed Namir and his squad when a convoy had changed course and begged Sergeant Maximian Ajax and his comrades to stop using grenades when the Imperial Garrison was destroyed. When Twilight Company was being pursued by Imperial forces, an emergency meeting was called and Sairgon suggested abandoning Chalis to throw off the pursuers. After the governor proposed boarding and capturing an Imperial transport, the lieutenant stated that the vessel may be damaged in the process."}, {"tag": "p", "text": "An Imperial freighter was subsequently raided, and Sairgon went through a report after with Namir and Howl. Twilight Company then rendezvoused with a rebel flotilla at the Elochar sector, where Sairgon tried to keep the troops occupied while their CR90 corvette the Thunderstrike underwent repairs. The corvette took aboard survivors from the damaged light freighter Trumpet's Call, who were in Imperial spies in reality. The spies broke loose and Sairgon contacted the rest of the flotilla before he was killed by the Imperial infiltrators."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Joining the Alliance"}, {"tag": "p", "text": "Prior to the war between the Galactic Empire and the Rebel Alliance, Sairgon held a number of professions, including being an actor, a musician, and a historian. He eventually joined the Alliance's 61st Mobile Infantry, better known as Twilight Company, and rose to the rank of lieutenant. He became the second-in-command of the company, serving under Captain Micha Evon, nicknamed Howl, who he became very close with and learned the past of. After the recruit named Brand joined Twilight Company on the terrestrial astronomical object Veron, she dug into on Sairgon's past and learned of his former talents."}, {"tag": "p", "text": "During an open recruit on the terrestrial body Demiloch, Howl was shot by an Imperial Spy pretending to be a new recruit. Sairgon stopped the open recruit early as a result and Howl was incensed of his decision when the captain woke up three days later. Following a battle on the planet Vir Aphshire 0 ABY, Private Hazram Namir was given a report by Sergeant Fektrin to pass on to Howl. Sairgon led Namir to Howl's tent where he left the two to talk."}, {"tag": "h3", "text": "The Imperial defector"}, {"tag": "p", "text": "In 3 ABY, Twilight Company attacked the planet Haidoral Prime, where the Imperial Governor Everi Chalis chose to defect to the company. Aboard the Thunderstrike, the CR90 corvette acting as Twilight Company's headquarters and troop carrier, Howl questioned Chalis with Sairgon and Chief Medic Von Geiz flanking him and Namir, now a first sergeant watching Chalis from behind. When the meeting began, Geiz checked Chalis while the lieutenant scowled at the governor. After Chalis explained that her appointment on Haidoral Prime was a punishment, she gifted Howl a bottle of alcohol and some fruit, Sairgon looking questioningly at the captain upon this."}, {"tag": "p", "text": "When Chalis claimed her Imperial career was over when Twilight Company went to the planet, the lieutenant added that her mansion, where she was found by Twilight troops, was not the company's target. The governor further specified why she thought this way and Sairgon remarked that it was too bad that she had not asked to defect as it would have saved trouble for the rebels. Chalis then offered her knowledge in the Empire's \"lifeblood,\" and the lieutenant questioned what she had been before her position as governor. After she answered Sairgon's question, she discussed the Alliance's retreat from the Mid Rim and leaned forward to whisper in Howl's ear. Sairgon looked with concern and bitterness as Namir pulled the governor back, and Howl concluded the meeting."}, {"tag": "h3", "text": "Coyerti campaign"}, {"tag": "p", "text": "Shortly after, Twilight Company begun a campaign on the jungle planet Coyerti. On the second day, the lieutenant informed Namir and his squad that a convoy that they were waiting to ambush had changed course at dawn. At another point, the Coyerti natives helped some rebel soldiers against the Imperial Garrison and Sairgon begged Sergeant Maximian Ajax and some others to stop wasting grenades."}, {"tag": "p", "text": "After the campaign, Ajax recounted his experience with Sairgon in a social space on the Thunderstrike, drawing laughter from the soldiers listening. Namir was set to have a meeting with the lieutenant after, but chose to bully his way to Howl's office to deliver a report."}, {"tag": "h3", "text": "Gathering supplies"}, {"tag": "p", "text": "Following the Coyerti Campaign, Twilight Company was attacked three times in the Metatessu sector due to a hypermatter leak in the Thunderstrike's hyperdrive. Howl called a meeting with the senior Twilight personnel, including Sairgon, and bridge crew of the Thunderstrike and its escort, the Braha'tok-class gunship Apailana's Promise. After the captain summarized the situation, the lieutenant speculated that stronger forces would pursue the company and proposed for Chalis to be abandoned in a shuttle to relieve pressure from the Empire's forces, worrying that a Star Destroyer could attack next."}, {"tag": "p", "text": "Howl, though, insisted that the governor was not being abandoned and argued that she had already retrieved the Alliance the only real victory within the recent time. He then allowed the other attendees to give ideas, and Chalis eventually proposed boarding an Imperial cargo transport to make a new troop carrier. Sairgon questioned how the company could avoid damaging the transport or keep it from self-destructing, but Namir soon suggested that Twilight Company could instead raid the vessel for supplies."}, {"tag": "p", "text": "Twilight Company raided an Imperial heavy freighter shortly thereafter. Following the raid, the Thunderstrike and Apailana's Promise scheduled to have repairs done in a flotilla. During a meeting with Howl and Namir, Sairgon remarked that the number of casualties from the raid was not bad until he looked at the individuals lost. The lieutenant then explained the plan for repairs to the first sergeant soon after and Howl revealed that he and Chalis were meeting with the Alliance High Command at their secret base, Namir and two others being their escort."}, {"tag": "h3", "text": "Slain by spies"}, {"tag": "p", "text": "With Howl, Chalis and their escort meeting with the High Command, the rest of Twilight Company made their way to the flotilla. While, repairs were made to the Thunderstrike under Commander Paonu, Siargon devised exercises and war games and dished out shore leave to other Alliance vessels to keep troops out of the way of the engineers making repairs. Ten days in, the rebel light freighter Trumpet's Call arrived to the flotilla with no working life support. The survivors were taken aboard the Thunderstrike, Twilight Company being unaware that the injured individuals were an Imperial infiltration team which had killed the real crew."}, {"tag": "p", "text": "The spies soon broke loose, and the bridge crew attempted to isolate them by sealing the blast doors aboard the Thunderstrike. As the infiltration team reached the bridge, Sairgon sent a message out to the rest of the flotilla prompting the rebel ships to retreat. He was then shot dead by the spies, and the other flotilla ships scattered, excluding the Apailana's Promise and the damaged Trumpet's Call. The Thunderstrike was retaken soon after by the Brand and the remaining bridge crew, and the corvette and the Promise fled into hyperspace."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Howl was also killed during his time at the High Command's base. Following the captain's subsequent funeral, Brand mentioned that only Sairgon had known Howl's past, Namir adding that the captain had died a legend with the lieutenant also being dead."}, {"tag": "h2", "text": "Personality and Traits"}, {"tag": "p", "text": "A human male, Sairgon took charge of Twilight Company in Howl's absence, such as when the captain was shot on Demiloch or when Howl left to visit the Alliance High Command. He never spoke of his past to the company, with the exception of Howl, who he was very close to and was the only to know the captain's past. He scowled at Everi Chalis while she was being cuffed for her first meeting with Howl. Sairgon stood stiffly behind the captain during the meeting, giving the impression of an ancient and gnarled tree to Hazram Namir. He gave remarks to Chalis, implying that Twilight Company was not going for her residence and that she would have made it easier by asking to defect."}, {"tag": "p", "text": "After Chalis whispered in Howl's ear, Sairgon gave a bitter and concerned expression. When Twilight Company was pursued through the Metatessu sector, the lieutenant proposed abandoning Chalis under fears that she was the reason the Imperial forces were attacking, being worried that a Star Destroyer could attack. After the governor later suggested capturing an Imperial transport, Sairgon argued that the vessel could be damaged in the process or be rigged to self-destruct. As Imperial spies attacked the Thunderstrike's bridge, the lieutenant chose to warn the rest of the Alliance flotilla of the infiltration to assure the rebel ships escaped"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sairgon appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}