{"url": "Sal", "categories": ["Category:Legends articles", "Category:Cularin residents", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sal"}, {"tag": "p", "text": "Sal was a male Human who lived in the Cularin system during the waning years of the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sal made a living a trader and, during his career he had dealings with the Thaereian military, the Metatheran Cartel, and the crime lords Nirama and Riboga. While he made a lot of money from legitimate business enterprises, Sal made most of his profits from his participation in darker, illegal activities, and through these illicit dealings Sal became acquainted with Zelice Sturm, a former Jedi who had became a crime boss known as the Black Queen. Sal considered Sturm to be well-suited to him and they began working together."}, {"tag": "p", "text": "Sturm was eventually redeemed and she rejoined the Jedi Order. Sal didn't know where she had gone, so he went into hiding in attempt to avoid Sturm's former criminal associates, whom he considered to people to avoid during a tense situation. Three months later, Sturm tracked down Sal and she stayed up all night with him, to tell him about her redemption. She then gave him her necklace as a token to remember her by, and told him that she probably wouldn't be able to see him again, because of her duties to the Jedi. The encounter caused Sal to change his life around; he turned over his worst contacts to the Office of Peace and Security, a local law enforcement agency, and he stopped participating in business activities that inflicted pain and suffering onto others."}, {"tag": "p", "text": "At some point afterwards, Sal went to lunch on the planet Cularin with the Rodian Renna and the Wookiee Ooorlak, and they shared a kaavo that had been prepared by the baker Val-Aruun. Soon, there was only one slice of kaavo left, so Sal proposed that they hold a trial of elocution to decide who got to eat the slice. The trio each told a story about a loved one who had passed away, and they planned to give the slice of kaavo to the person who told the best story. Sal chose to talk about his association with Zelice Sturm, who had died during an attack on the planet Almas. Afterwards, the trio could not decide who had won, and the decided to leave the slice of kaavo at the Wall of Remembrance in the Crosstown Bar."}, {"tag": "h2", "text": "Appearances"}]}