{"url": "Sakhet%27s_Noodles", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Dining establishments", "Category:Lodos district locations", "Category:Vendors and sellers"], "nodes": [{"tag": "h1", "text": "Sakhet's Noodles"}, {"tag": "p", "text": "Sakhet's Noodles was a noodle vendor on the planet Denon. It was run by the Kupohan Sakhet, a spy for the Kupohan Spynet, and was very popular with the locals. In addition to selling noodles, Sakhet used the restaurant as a base where one could inquire about her intelligence services. A number of Kupohans worked at Sakhet's Noodles, where they took orders, prepared the food, and served it to their customers."}, {"tag": "p", "text": "In 0 ABY, Sakhet's intelligence and noodle services were taken advantage of by Luke Skywalker and Nakari Kelen of the Rebel Alliance while they attempted to find the cryptologist Drusil Bephorin on Denon. In order to ask for Sakhet's help, Skywalker and Kelen were required to order Corellian buckwheat noodles with rancor sauce. On the day after the rebels received their food, Sakhet took them on a delivery run, during which Skywalker and Kelen gathered information that would help them formulate a plan to rescue Bephorin from the Galactic Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Sakhet's Noodles was a noodle vendor located in the northwest corner of a miniature plaza in the Lodos district on the Inner Rim world Denon. Its long lines were a sign of its popularity with the local clientele, which included a variety of species. A menu above the hut was hand-painted in Galactic Standard, among other alphabets. At least three Kupohans worked at the hut at one time, including Sakhet, her son, and a third. The third Kupohan took orders from customers, while Sakhet's son prepared and boxed the food, which consisted of noodles, meat, and vegetables, in greased flimsicard take-out boxes. One of the noodle types the restaurant sold was Corellian buckwheat noodles, which could be ordered with a separate item, such as nerf nuggets with onions or rancor sauce. The establishment accepted credits as currency."}, {"tag": "p", "text": "After a customer ordered, they were given a receipt with their order number on it, and they would pick up their food at a different window around the corner when it was ready. The patron would be given their food in cartons along with disposable eating sticks. While there was nowhere to sit in the plaza area, the customers could sit at a nearby pavilion that had six wooden picnic tables. These tables were well stocked with salt and pepper for the noodles, but they also had splinters, which made sitting there uncomfortable. Sakhet's Noodles owned a delivery speeder that was used to deliver catering orders, even in the morning, as the people of Denon ate at all hours of the day."}, {"tag": "p", "text": "In addition to selling noodles, Sakhet's Noodles also provided intelligence services. As a spy in the Kupohan Spynet, Sakhet knew that an individual wished to inquire about these services if they ordered the Corellian buckwheat noodles with rancor sauce. Some of the other staff members were also aware of this process, as the individual who took the orders would then write further instructions on the recipient's receipt, such as a time to return the next day."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 0 ABY, Rebel Alliance operatives Luke Skywalker and Nakari Kelen were sent by Alliance Admiral Gial Ackbar to Denon to inquire with Sakhet about her intelligence services. Ackbar and the Alliance hoped that Sakhet would be able to help them rescue their target, the cryptologist Drusil Bephorin, who wished to be liberated from the Galactic Empire in order to see her family again. The two rebels arrived at the plaza where the noodle hut was located via a droid taxi, and they took their places in what was a long line to order their food."}, {"tag": "p", "text": "Kelen had Skywalker order for her, choosing the Corellian buckwheat noodles and nerf nuggets with onions. Eventually, the two arrived at the ordering window, and Skywalker repeated Kelen's order and also placed his own, which included rancor sauce to indicate his true intentions. The third Kupohan who worked at the hut took the order and gave them their receipt. The pair received their order number along with a message to return the following morning."}, {"tag": "p", "text": "When the rebels' order was called, Skywalker went to the window around the corner, showed his receipt, and received two hot flimsicard cartons along with disposable eating sticks from Sakhet. In amusement, the Kupohan assured Skywalker that she had given him two orders of the nerf nuggets. Skywalker and Kelen then walked over to the picnic tables, where a Gran couple had just been finishing, and ate their noodles there. The next day, Skywalker and Kelen arrived at Sakhet's Noodles as requested. Sakhet told them to get in her delivery speeder, explaining that their cover for searching for Bephorin would be making deliveries for customers. While on the delivery run, Skywalker and Kelen formulated a plan for how to extract Bephorin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sakhet's Noodles appeared in the novel Heir to the Jedi, written by Kevin Hearne and released in 2015. When asked if he remembered Sakhet's Noodles on his Instagram livestream in January of 2021, he described writing about it as having been \"a lot of fun.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}