{"url": "Sai_tok/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Lightsaber combat"], "nodes": [{"tag": "h1", "text": "Sai tok"}, {"tag": "p", "text": "In lightsaber combat, a sai tok, frowned upon by the Jedi because of its Sith-like nature, was the act of cutting an opponent in half, usually separating his or her legs from the torso at the waist. Sometimes, sai tok could vertically bisect an opponent too."}, {"tag": "p", "text": "It was one of the lightsaber techniques known as The Marks of Contact."}, {"tag": "h2", "text": "Notable uses"}, {"tag": "p", "text": "Before even beginning any formal Jedi training, Nomi Sunrider took up her newly-deceased husband's lightsaber, and literally \"halved\" the space pirate Quanto, as described by his companion Gudb. Sunrider's use of sai tok was unique in that she cleaved Quanto lengthwise rather than through the waist."}, {"tag": "p", "text": "A Jedi used the strike on Myles during the Battle of Galidraan."}, {"tag": "p", "text": "The Dathomirian Zabrak Sith Lord Darth Maul performed this maneuver when defeating Mighella, Nightsister and bodyguard of Black Sun lord Alexi Garyn."}, {"tag": "p", "text": "Ahsoka Tano performed sai tok on three IG-100 MagnaGuards during her journey to Jabba's Palace. She bisected the MagnaGuard with a cloak on vertically and the others horizontally."}, {"tag": "p", "text": "Jedi Master Jai Maruk defeated an assassin droid using sai tok at Phindar Spaceport during the Mission to Vjun, cleaving his opponent cleanly in two."}, {"tag": "p", "text": "Jedi Master Quinlan Vos also killed both the dark side Master Volfe Karkko, and the Dark Jedi Kadrian Sey in this manner."}, {"tag": "p", "text": "Klatoonian Barada received a sai tok strike from Luke Skywalker in a battle over the sarlacc on Tatooine."}, {"tag": "p", "text": "During their final duel on board the Death Star, Obi-Wan Kenobi would have received a sai tok from Darth Vader had Kenobi's body not disappeared into the Force upon his death."}, {"tag": "p", "text": "Vader also used the technique to kill several members of a hyenax pack on the planet of Vaal, including the pack's leader."}, {"tag": "p", "text": "In 10 ABY, Dark Jedi Vill Goir died from a sai tok strike, severed from left shoulder to right torso, delivered by Jedi Kam Solusar during their duel on the planet Ossus."}, {"tag": "p", "text": "A year later, while confronting Dark Jedi Krdys Mordi on New Alderaan in defense of Master Luke Skywalker, Jem Ysanna killed Mordi through use of sai tok."}, {"tag": "p", "text": "During that same battle, Princess Leia Organa Solo also performed a sai tok maneuver against Executor Tedryn-Sha, slicing him from his left shoulder down to his right waist."}, {"tag": "p", "text": "During the duel in the Dathomir landing meadow, Ben Skywalker killed a Sith Saber by performing sai tok."}, {"tag": "p", "text": "An unidentified Aqualish Sith received a sai tok strike from Master Wolf Sazen in 137 ABY."}, {"tag": "p", "text": "The same year, Vul Isen was sliced in half by Cade Skywalker while trying to poison Utapau's water supply."}, {"tag": "h2", "text": "Survival cases"}, {"tag": "p", "text": "In rare instances, it was possible however for the recipient of sai tok to survive, either by use of the Force or some other means."}, {"tag": "p", "text": "One such case is that in an impressive display of lightsaber technique, Jedi Padawan Obi-Wan Kenobi used sai tok to defeat Darth Maul during the Second Battle of Theed. Maul, however, survived, his spirit kept intact by his intense feelings of hatred fueling the dark side of the Force, and escaped to Lotho Minor, replacing his severed lower body with a 6-legged cybernetic apparatus via the Force. This shabby replacement was replaced years later by Mother Talzin on Dathomir with two legs similar to that of General Grievous. Shortly after, they were replaced by Death Watch Leader Pre Vizsla."}, {"tag": "p", "text": "Another example would be the Dark Jedi Maw, who received a sai tok from Jedi Master Qu Rahn. Maw managed to survive this usually fatal attack by drawing on his anger through the dark side of the Force. His new disfigurement consequently made him a prime candidate for a completely unique form of lightsaber combat: Trispzest."}, {"tag": "p", "text": "One other classic example would be General Grievous when his cybernetic apparatus was severed by Kit Fisto. The general managed to survive and escaped the Jedi. Soon after, EV-A4-D replaced his legs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}