{"url": "Salarr", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Black Sun members", "Category:Crime lords", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Salarr"}, {"tag": "p", "text": "Salarr was a Human male criminal who held a leadership position in the Black Sun criminal syndicate during the Cold War between the reconstituted Sith Empire and the Galactic Republic. One of the gang's leaders on the Republic capital world of Coruscant, Salarr allied Black Sun with the Sith Lord Tarnis, who was undercover as a Republic scientist, and helped Tarnis carry out his own kidnapping in exchange for Imperial weapons and armor in 3643 BBY. However, Tarnis abandoned Salarr when the Coruscant Security Force and a young Jedi Knight attacked Black Sun's headquarters, and Salarr was killed in the firefight."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Salarr joined the Black Sun criminal syndicate on the planet Coruscant and, by 3643 BBY, during the Cold War between the Sith Empire, had achieved a leadership position in the organization. That year, the Sith Lord Tarnis—who was posing as the Republic scientist Doctor Eli Tarnis—approached Salarr with an offer to secure the criminal gang's services in exchange for advanced Imperial weapons and armor. Salarr agreed to the deal, and the Sith had Salarr hire the Rodian thief Vistis Garn to steal superweapon plans from a military warehouse. When Tarnis felt that his cover was in danger of exposure, he had Salarr arrange for his own \"kidnapping\" by Black Sun."}, {"tag": "p", "text": "Salarr's forces infiltrated the Senate Tower and incapacitated Tarnis's guards before escorting the scientist to the nearby Senate Plaza taxi station. Salarr's lieutenant Zeer led the group to the nearby Coruscant Spaceport, where they barricaded themselves in one of the docking bays as a distraction for the Coruscant Security Force. Meanwhile, Tarnis himself left his Black Sun allies at the taxi station—but instead of heading to Black Sun territory as planned, he headed to the territory of his other allies, the paramilitary Justicars' Brigade. When Zeer was finally captured, he gave up Tarnis's supposed location, so CSF Sergeant Nidaljo led a special tactical unit to rescue the doctor. Salarr's men easily repelled the CSF forces with their Imperial weaponry, driving off the police officers who attempted to set up a perimeter around the gang's headquarters."}, {"tag": "p", "text": "However, Salarr was enraged when a young Jedi Knight arrived to aid the CSF officers. After deactivating the base's security systems, the Knight and police officers stormed Salarr's headquarters from opposite directions. The furious criminal contacted Tarnis and demanded aid and explanation, and was angered when Tarnis abandoned Black Sun to the Jedi. The Knight and the Jedi's astromech droid, T7-O1, reached Salarr first, and, though Salarr signaled one of his men to shoot the Jedi in the back, Nidaljo's unit arrived just in time to dispatch Salarr's man before the Knight was shot. In the firefight that followed, Salarr and his other subordinates were killed by the Jedi and the police officers."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A bald man with fair skin and brown eyes, Salarr had both a large scar and a dark tattoo across the right side of his face. Salarr was a hardened criminal, but he was furious when Tarnis, his apparent ally, abandoned him to the Jedi and the CSF; he also refused to surrender, even in the face of overwhelming numbers."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Salarr wore gray-and-red armor and wielded a blaster in combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Salarr first appeared in the Jedi Knight-class mission \"The Rescue\" in Star Wars: The Old Republic, a video game released by BioWare in 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}