{"url": "Salju", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Batuu residents", "Category:Business owners and executives", "Category:Females", "Category:Humans", "Category:Mechanics"], "nodes": [{"tag": "h1", "text": "Salju"}, {"tag": "p", "text": "Salju was a human female who was the proprietor of Black Spire Station, a filling station and repair shop in Black Spire Outpost on the planet Batuu that serviced vehicles ranging from landspeeders and swoop bikes to small vessels. Cheerful, friendly, and optimistic, Salju aided anyone who needed help finding any parts they needed or requested."}, {"tag": "p", "text": "Salju became friends with the Resistance agent Vi Moradi during her mission to establish a base on Batuu, and helped the spy acclimate to local customs and culture."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A childhood friend"}, {"tag": "p", "text": "A Batuuan human female, Salju was born in 11 ABY and lived with her father, Harta, in Black Spire Outpost, the largest settlement on the Outer Rim planet Batuu. Upon returning home after one of his many work travels with a present for his daughter, as he often did, Harta gifted a young Salju with a pet therii, whom the girl named Elee. Salju took Elee to Bina, the proprietor of the local Creature Stall, and got advice on how to feed Elee and brush her tusks. The two did everything together, including sleeping in bed, though Salju had made Elee her own bed. When the two played games, such as pretending to be a pilot, Elee made big messes, and Salju had to clean up after her. Salju confided in Elee, telling the therii about her liking to garage work and her dream of owning a speeder one day. The Wookiee Lunacca, owner of The Wooden Wookiee, gave Salju and Elee a wooden carving of Elee as a gift."}, {"tag": "p", "text": "As Elee continued to grow, Salju began taking her to the distant Surabat River Valley to play. There they discovered other therii, who welcomed them like family. After Elee grew so large that she knocked over an oil drum, Salju took her friend to live with her fellow therii in the River Valley. Even into adulthood, Salju continued to visit Elee on the anniversary of their meeting."}, {"tag": "h3", "text": "The Resistance mission to Batuu"}, {"tag": "p", "text": "In 34 ABY, Resistance spy Vi Moradi and the former First Order Captain Cardinal, now known as Archex, undertook a mission to establish a Resistance base on Batuu. The pair and their droid Pook crashed in a forest near the Black Spire Outpost, and the two humans were knocked unconscious. When the pair awoke, they found that most of their belongings, as well as most of Pook's body, had been stolen. Salju appeared and offered them assistance in finding their stolen goods and surviving on Batuu."}, {"tag": "p", "text": "Salju guided Vi through the Black Spire Outpost while Archex and Pook remained by their downed starship. Salju introduced Moradi to many of the local people and customs, and the two became friends. Among those Salju introduced Moradi to were the droid vendor and repairman Mubo, the clothing merchant Arta Kleidun, and the scrapper Savi, a friend of Lor San Tekka and supporter of the Jedi Order."}, {"tag": "p", "text": "After Salju selflessly dedicated her day to helping Vi and Archex situate themselves on Batuu, Moradi quickly realized that Salju be a great asset to the Resistance. Salju told Moradi of her desires to travel the stars and see the many kinds of animal life on the galaxy's planets. Moradi extended Salju an offer to join the Resistance, telling the woman that they could use someone of her skills with people and technology as well as her altruism. Salju declined, stating that Batuu was her home."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Salju was quick to help travelers, such as Vi Moradi and Archex when they crashed on Batuu. She was considered honest by fellow residents of Black Spire Outpost such as Mubo and Arta Kleidun. Salju longed to travel among the stars, but firmly considered Batuu and the Black Spire Outpost to be her home."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Salju's name was first unveiled during the December 16, 2017 \"Galactic Nights\" session on the map side of several Star Wars: Galaxy's Edge-themed trading cards that were intended to promote the ride, more specifically the map card for Black Spire Station. The map cards contained locations for the planet Batuu, as well as a line from the Old Batuuan ballad along the border of the card in Aurebesh. In Black Spire Station's case, the phrase was \"THOSE BROKEN AND TOSSED.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}