{"url": "Salmara", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Salmara"}, {"tag": "p", "text": "Salmara was a female Human Jedi Master and a member of the Jedi Order during the last years of the Galactic Republic. She was the Master of Dray. She also became a victim of the reborn Sith Lord Darth Maul."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Salmara, a female Human Jedi Master, served the Jedi Order during the last years of the Galactic Republic, during the Clone Wars. Around 20 BBY, the Jedi Council learned that the Sith Lord Darth Maul had survived his encounter with Obi-Wan Kenobi over a decade prior, and that he had allied himself with his younger brother and fellow Sith, Savage Opress."}, {"tag": "p", "text": "After the Jedi Council learned that Ja'Boag, the head of Rim Commercial Mining, had placed a bounty on the heads of Maul and Oppress, they summoned Salamara and her Padawan, Dray, to the High Council Chamber. En route, Dray repeatedly questioned Salmara, claiming that there was no way Darth Maul could still be alive, but Salmara assured him that the hatred within Maul was certainly capable of such a thing. The Council then tasked Salmara, along with fellow Jedi Master Judd, with discovering the reasons behind Ja'Boag's bounty. Salamara wondered how someone outside of the Jedi Order could possibly know that Maul had lived—Mace Windu told her that this was precisely what they needed to find out, while at the same time treading lightly around someone as powerful as Ja'Boag. Judd asked what they were to do if they discovered the actual location of the dark side brothers, and Yoda told him that Kenobi was already tracking them, but they should assist him if they can. Windu also tasked Salmara and the others with uncovering why the native population of Moorjhone had fallen silent since Ja'boag's mining company arrived there. He urged the trio to follow the Force and act accordingly."}, {"tag": "p", "text": "Maul and Opress also traveled to Moorjhone and arrived before the Jedi, slaughtering the security forces and flinging Ja'Boag off a balcony. The Jedi arrived just in time, and Salmara caught Ja'Boag with the Force, saving his life. As Judd ignited his lightsaber, the two Zabrak brothers looked down on them from above—Opress was concerned that they had been discovered while Maul was filled with malicious delight."}, {"tag": "p", "text": "After Salmara saved Ja'Boag, the Gossam ordered his troops to attack, but Salmara urged them to wait. She then attempted to negotiate with the Sith brothers, asking them to surrender. Opress responded by telling her that they would all die, and Judd mocked Salmara for her \"good diplomacy\". The Nightbrothers attacked, slaughtering Ja'Boag's troopers. Judd threw himself in their path, clashing his lightstaff against their blades. Maul reacted quickly, bashing his lightsaber hilt against Judd's snout, causing blood to spray out. Judd surprised the two Zabraks by knocking Opress on his back and deflecting Maul's counterattack. He then mocked Maul for his lack of legs, but Opress unleashed his rage, knocking both combatants away."}, {"tag": "p", "text": "Salmara flung a large container at Opress, and though Maul warned him, he lashed out without a thought, opening the container—which was full of carbonite. Opress was instantly frozen solid, to Maul's horror. Judd again mocked Maul for his cybernetic half, but Maul grabbed Judd's right arm in his foot and snapped his bones. Maul then told Judd that he would have liked to have taken longer killing him, but was suddenly stabbed from behind by Dray. Maul slashed at Dray, severed both of Dray's hands and flung them away. Salmara and the corporate troopers gave chase, but Maul managed to escape by pulling down the tunnel upon his pursuers. Judd and Dray were taken to a medical bay, where Doctor Tresfor saw to their wounds and managed to reattach the young Padawan's hands."}, {"tag": "p", "text": "After Maul penetrated the depths of the mining facility during the slaughter of the Moorjhoni people, Salmara and her Padawan confronted him once again to prevent the Sith Lord from freeing his brother. However, Maul managed to take Salmara off guard and kill her in one swift move by using the Force to unfreeze Opress, who then fatally impaled Salmara with his lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}