{"url": "Saludi%27s", "categories": ["Category:Legends articles", "Category:Cantinas", "Category:Coruscant dining establishments", "Category:Coruscant underworld locations"], "nodes": [{"tag": "h1", "text": "Saludi's"}, {"tag": "p", "text": "Saludi's was a cantina that operated in the undercity of the planet Coruscant. A typical spacer bar, the cantina was popular with criminals, pilots and soldiers from across the galaxy. The cantina had a concealed back room used for gambling, from which a secret base used by the Believers, a Sith-worshipping cult from the Cularin system, could be reached. Around 31 BBY, a group of freelance agents ventured to the cantina while tracking the Believers and located the access point to the cultists' hideout."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Saludi's was a small cantina that operated on the planet Coruscant during the waning years of the Galactic Republic. The bar was built inside part of an old bunker situated in Coruscant's undercity, far from any natural light. The name of the cantina was derived from the term \"Saludi\", a word from a dialect of the language Huttese that translated into Basic as \"hidden\". Outside, the cantina had a glowing neon sign that displayed the message \"SALUDI's - FAVORITE OF PILOTS ACROSS THE GALAXY\" and flashed on a color cycle from red to green, to blue to violet before repeating."}, {"tag": "p", "text": "A typical spacer bar, Saludi's was abuzz with a riot of sounds and fragrances, giving it a raucous but not unpleasant atmosphere. The cantina's interior was decorated with the same vibrant color scheme as the neon sign outside and a haze of thin smoke hung in the air. This was produced by the Alderaanian meat seasoning p'chab, which could be purchased in the bar and gave Saludi's distinctive sharp smell, different to most other cantinas. Live music from a band resonated through the bar and raised stools were located throughout for patrons to sit on, intermixed by a number of hovering stools. Alcoholic beverages could be purchased on the premises."}, {"tag": "p", "text": "The cantina attracted individuals from across the breadth of the galaxy including spacers, soldiers, criminal pilots and other criminals. Its clientele included old, well-traveled spacers and young hotshot pilots, as well as military pilots from worlds such as Coruscant and Naboo, and civilian-attired pilots from the planets Alderaan and Corellia. The bar's denizens were wary of the Jedi, an order of monastic warriors allied with the Republic. Around the time of the Invasion of Naboo, the one-eyed Human Chez O'nder worked as a bartender at Saludi's and like to regale to the patrons of the bar with a tale of how he had fused his lips together by picking his teeth with a lightsaber, a weapon commonly wielded by Jedi. The Wookiee Colara worked as a bouncer at the bar and was ever diligent in her duties, always on the lookout for potential troublemakers."}, {"tag": "p", "text": "The bar had a concealed backroom used for gambling, which could accessed via the cantina's restroom if one pressed a specific tile on the far-left wall that was 11 tiles across, 38 tiles down from the ceiling. Via a trapdoor beneath a table in the room was an access point to a network of tunnels that lay beneath Saludi's. The tunnels connected the bar to a nearby hidden base operated by the Believers, a Sith-worshipping cult from the Cularin system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Saludi's opened between around 91 BBY and 81 BBY, located in part of a bunker that dated back to an earlier time of war. By around 31 BBY, the Human Chez O'nder had became a part-owner and bartender of the cantina and he hired out the hidden Saludi's backroom to a group of spice-using Twi'lek gamblers. Unknown to O'nder, the Twi'leks received a fee from the Believers every time one of the cultists passed through the room to reach the access point to their hideout. As a result of a surge in Believer activity, the gamblers earned a profit from renting the room."}, {"tag": "p", "text": "One evening, while O'nder and Colara were at work in the bar, a group of soldiers of the Mecetti House Guard, a military force from the Tapani sector, came to Saludi's to drink. Colara kept watch on the soldiers, looking for an excuse to throw them out. The playboy freighter captain Xav Verivax also ventured to the cantina and attempted to chat up some Twi'lek females. Around the same time, a group of Believers passed through the bar while returning to their secret base with a Mandalorian iron box containing a fragment of the dark side city Conkesta, which the cultists had stolen from a Coruscant landing platform."}, {"tag": "p", "text": "Minutes after the arrival of the Believers, a group of freelance agents arrived at Saludi's in pursuit of the stolen box, just as Colara ejected a drunken Gamorrean from the bar. The agents made enquires around the cantina as to where the Believers had gone and learned of the hidden back room. The freelancers then entered the concealed room, interrupting a game of sabacc being played by the Twi'lek gamblers, and made their way into the tunnels beneath Saludi's to confront the cultists."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Saludi's was created by Morrie Mullins and featured in Coruscani Dawn, a 2002 roleplaying adventure that formed part of the Living Force campaign. The adventure advises that the cantina should be depicted as having a similar atmosphere to the Mos Eisley Cantina, a bar that appeared in the 1977 film Star Wars: Episode IV A New Hope, but with a more alien ambience."}, {"tag": "p", "text": "In the adventure, the player characters roleplay as the freelance agents who come to Saludi's while tracking the Believers and their stolen Mandalorian iron box. The agents can interact with the inhabitants of the bar while searching for information on the cultists' movements and this can play out in various different ways. It is possible for the Jedi Knight Devan For'deschel to accompany the agents to the bar, in which case the cantina's denizens eye her and any Jedi player characters warily, though do not cause any trouble unless provoked. If the player wish to speak with the bartender Chez O'nder, he is initially unavailable due to being busy serving drinks but later becomes free and it is possible for him to provide the agents with details of the secret back room. The player characters can also bribe or otherwise persuade the spacers and soldiers drinking in the bar to provide them information on the concealed gambling room."}, {"tag": "p", "text": "An alternative eventuality is that the agents attempt to persuade the Wookiee bouncer Colara to provide them information, though she only speaks to them of the back room if a Wookiee among the player characters agrees to go on a date with her. It is also possible for the player characters to become involved in a confrontation with the House Mecetti soldiers relaxing in the cantina. This can erupt into a bar fight, in which case Colara intervenes to break up the brawl."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}