{"url": "Salvation_(Nebulon-B)", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Alliance to Restore the Republic starships", "Category:EF76 Nebulon-B escort frigates", "Category:Flagships"], "nodes": [{"tag": "h1", "text": "Salvation (Nebulon-B)"}, {"tag": "p", "text": "The Salvation was a Nebulon-B frigate that served under the banner of the Alliance to Restore the Republic during the Galactic Civil War, one of the first of many starships added to the growing Alliance Fleet. Originally a vessel of the Galactic Empire, the frigate's service in the Imperial Navy was ended after its capture at the Skirmish over Ylesia. During its inauguration as the Rebel flagship, former Imperial senator-turned-Rebel fugitive Mon Mothma bestowed the name Salvation upon the frigate in order to symbolize the importance of the Rebel cause and their desperate struggle against the Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Salvation was a large frigate capable of carrying various squads of Y-wings, Z-95 Headhunters and R-22 Spearheads. It had various defense mechanisms such as force fields, defensive cannons, and turbolaser guns. The vessel was also fitted with a Fusion Accelerator cannon."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Trialling the ship"}, {"tag": "p", "text": "Under the command of Juno Eclipse, a former Imperial Captain and pilot of the Rogue Shadow, the Salvation was first tested against Imperial forces at Cato Neimoidia. Although Captain Eclipse succeeded in achieving her mission objectives to test both her ship and crew in battle, the Empire's superior military and numbers forced the Salvation to withdraw, mainly due to the fact that the Alliance could not afford to lose what few ships it had at the time."}, {"tag": "h3", "text": "Battle on the Salvation"}, {"tag": "p", "text": "When Jedi General Rahm Kota and uncertain Starkiller arrived at the Alliance Fleet's hidden location in the Itani Nebula, the Salvation was attacked and boarded by Vader's experimental elite forces led by the bounty hunter Boba Fett. The ship's crew was caught completely off guard and were unable to prevent Fett and his troopers from storming the bridge and capturing Captain Eclipse. After Slave I succeeded in escaping from the ship with Fett and his prisoner, the Alliance Fleet pursued the bounty hunter to Kamino with General Kota in command of the Salvation. The ship's infrastructure was heavily damaged by a Terror Walker."}, {"tag": "h3", "text": "Battle of Kamino"}, {"tag": "p", "text": "When The Salvation and the other Rebel ships arrived at Kamino, The Salvation was assaulted by many boarding parties. Starkiller was forced to eliminate all of the Imperial troopers that had infiltrated the ship's hangar. The ship's condition continued to deteriorate, losing four decks due to the damage sustained. Its main cannon was disabled by a shot from an incoming Star Destroyer, though Starkiller retaliated by charging up the cannon with Force lightning and firing a shot that blew the Destroyer in half."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "Later during the battle, Kota ordered the remaining crew members to abandon the ship so that Starkiller could guide the Salvation directly into the planet in order to destroy its shields. The Salvation punched through the shields with ease, and despite the Imperial garrison's attempts to shoot it down before it ploughed into the city, the Salvation crashed directly into the shield generator, destroying it and much of the Timira City Cloning Facility; the major fragments of debris were destroyed by Starkiller in order to prevent any harm from coming to Juno. With Kamino's defense grid destroyed by the Salvation's sacrifice, the Rebel forces invaded Kamino and, despite the many casualties they suffered, the Alliance succeeded in winning the battle while Starkiller subdued Darth Vader himself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Wii port of The Force Unleashed II, the Salvation is depicted as an Assault Frigate Mark I . The ship's destruction is depicted differently as well: Starkiller does not fall next to the ship—instead he rides it into the planetary shield generator and releases a massive force repulse which causes the destruction of the vessel. However, not all of the ship was actually destroyed by Starkiller, as he later used what remained of its hull as a bridge between Timira City's hangar dock and the main cloning facility. Starkiller also has to stop several Incinerator war droids from toasting the communication arrays of the ship."}, {"tag": "p", "text": "The Salvation is depicted as being vastly larger than all other Nebulon-B frigates that have appeared in Star Wars works. In the game footage, the Rogue Shadow is infinitesimally smaller than the Salvation as it flies across its connecting spar, even though the Rogue Shadow, at 65 meters long, is just under one-fifth the length of the 300 meter Nebulon-B."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}