{"url": "Salvaged", "categories": ["Category:Real-world articles", "Category:Clone Wars Adventures stories"], "nodes": [{"tag": "h1", "text": "Salvaged"}, {"tag": "p", "text": "Salvaged is a story in Star Wars: Clone Wars Adventures Volume 9. It features the clone trooper pilot of a Republic starfighter aboard a salvage ship."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "HOB-147 of the Light Brigade Division is unconscious inside the drifting remains of his V-19 Torrent starfighter when a salvage ship captained by a man named Hurd Coyle rescues him. Coyle's crew consists of reprogrammed B1-Series battle droids and B2 super battle droids that he may or may not have captured from the Confederacy of Independent Systems. He orders a few of his B1 units to bring the starfighter aboard and see if they can salvage anything from it."}, {"tag": "p", "text": "When the B1s arrive in the hangar, they discover HOB-147's life support is active, and at critical. Coyle orders them to take him to the ship's sick bay, where the clone—stripped of his armor—awakes to find himself facing three B1 units. Thinking he's been captured by the Confederacy, he attacks and rips the three droids apart with his bare hands—and is zapped by an electro-dart fired by Coyle, who protests the clone's actions and chains him to the wall. As the two have a small \"chat,\" HOB-147 learns that Order 66 has been given and that the Jedi are now his enemies. He doesn't believe it—mostly because he'd been drifting in space and missed out on the order—and ponders the situation when Coyle leaves the room."}, {"tag": "p", "text": "HOB-147 then discovers Nia, a young Jedi Padawan, hiding in the air vent watching him. He yanks her out and is zapped once again by Coyle, who has returned for an unknown reason. Coyle spots Nia and drags her out of sick bay and to a cargo hold, and he throws her inside, locking the door. HOB-147, wondering about \"Kidnapping children? Order 66? What kind of Separatist plot is this?,\" decides to find out. He frees himself and sneaks out of sick bay."}, {"tag": "p", "text": "Meanwhile, on the way to the bridge, Coyle is caught by one of his non-Separatist droids and informed that the clone has escaped. A B1 battle droid on the bridge then informs him that a Republic cruiser is in range and wants to inspect their cargo holds."}, {"tag": "p", "text": "HOB-47 has sneaked up to the entrance to the cargo hold in the meantime, and discovers a B2 super battle droid standing guard under orders from Coyle. The clone trooper smashes the droid with a metal beam and enters the cargo hold, where he is assaulted by something he can't see. When he comes to, he finds himself surrounded by Jedi Padawans and is shocked."}, {"tag": "p", "text": "Coyle, meanwhile, has to deal with a team of clones led by an ARC trooper that has boarded the ship. Stating that cargo ships have been transporting Jedi to hide them in the Outer Rim territories, the ARC commands his troops to tear the ship apart, much to the dismay of Coyle. Coyle is upset even more when HOB-147, back in uniform, shows up and introduces himself. But Coyle is shocked when the clone pilot lies and tells the ARC that there are no Jedi aboard."}, {"tag": "p", "text": "HOB-147 says good-bye to Coyle, and leaves with the clone troopers, who decided that since the pilot vouched for Coyle, they don't have to inspect the ship after all. Nia, again hiding in an air vent, watches as her new friend leaves."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}]}