{"url": "Salvo", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Clone stormtrooper officers of the Galactic Empire", "Category:Clone trooper commanders"], "nodes": [{"tag": "h1", "text": "Salvo"}, {"tag": "p", "text": "Salvo was a clone trooper commander that served under Jedi General Roan Shryne as leader of the 32nd Air Combat Wing during the Battle of Murkhana. His shrapnel-pitted armor featured the rust-brown markings of an unknown division."}, {"tag": "p", "text": "As was common with clones of his stature, Salvo wore a command kama similar to those worn by the Advanced Recon Commandos. He also carried a pair of DC-17 hand blasters and had the motto \"Live to serve!\" etched into the side of his armored helmet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "When Order 66 was issued from Emperor Palpatine on Coruscant, Salvo ordered the clone commandos of Ion Squad to ambush Shryne and the three Jedi that the commando squad had accompanied on an infiltration mission. Ion's leader, a commando named Climber, refused his command, disbelieving its authenticity, and Ion Team set a counter-ambush for Salvo and his men as they lay in wait for the Jedi. Though non-lethal, Ion's disruptive ambush rendered the standard clones unable to prevent the Jedi from escaping. Salvo, furious at Climber's treasonous actions, reported him to his superiors. Nevertheless, members of his 22nd Company did manage to successfully ambush and kill several other Jedi on Murkhana who were not as fortunate as those accompanied by Ion Team."}, {"tag": "p", "text": "When Darth Vader, the Emperor's newest enforcer, and his stormtroopers arrived on Murkhana in search of the escaped Jedi, Vader had Salvo and his men round up the displaced citizens of Murkhana City and ordered them into slavery. When Salvo, still unsure of just exactly who and what Vader was, presented him with the bodies and lightsabers of the slain Jedi, Vader told him to \"dispose of them in any fashion you see fit.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}