{"url": "Bakur_Memorial_Building", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Bakura locations", "Category:Government facilities"], "nodes": [{"tag": "h1", "text": "Bakur Memorial Building"}, {"tag": "p", "text": "The Bakur Memorial Building, also known as the Bakur Complex, served as the center of government on Bakura. Located slightly southwest of the center of the capital city of Salis D'aar, the truncated, wedge-shaped building overlooked Statuary Park at the city's center. It was first the headquarters of the Bakur Mining Corporation, before becoming the location of the Bakuran Senate."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Senate Chamber"}, {"tag": "p", "text": "The Senate chamber was located in a wing of its own. The chamber was roughly rectangular, with a tiled, two-story-tall ceiling. At each corner were glass pillars, self-illuminating and open to the sky at the top. The Senate was arranged so that the Prime Minister (and Imperial governor, during the occupation) sat at the front of the room. On a lower level were a pair of tables for lower-ranking senators, and lower from those were a pair of tables for ministers and senior senators. In front of the senior tables was a space for speakers to address the Senate. Following the Battle of Bakura, the Senate moved to the Bakuran Senate Complex.[source?]"}, {"tag": "p", "text": "The Bakuran Senate Complex was a bunker-like complex in Salis D'aar, Bakura, that housed the Bakuran Senate after the Battle of Bakura to provide a safer location for the Senate than the Bakur Memorial Building. In case of emergencies, a number of the city's citizens would also be held inside the complex, which included heavy armor and weapons caches to provide for self-defense."}, {"tag": "h3", "text": "Corporate Wing"}, {"tag": "p", "text": "The \"corporate wing\" of the Building was completed approximately a century before the Invasion of Bakura, possibly as a result of the droid uprising in 97 BBY. The Corporation may have been stationed elsewhere prior to that, that may have been when the government was established, or that may have been the year in which the Corporation turned over power to the Senate."}, {"tag": "h3", "text": "First Floor"}, {"tag": "p", "text": "The first floor of the Bakur complex was a lobby and reception area. The lobby was spacious and airy, with subtle and tasteful statues and flatsculps from native artists. A contingent of security guards was posted at all entrances and exits, a holdover from the days of civil war and factional infighting among the Bakuran leadership."}, {"tag": "h3", "text": "Residential Wing"}, {"tag": "p", "text": "Guest and resident housing was located on the second and third floors of the Residential wing. Located on the far side of the Bakur complex, guests had to take the tram to get to the Imperial Offices and Senate wings. Since these apartments were reserved for senators and important dignitaries, the wing was richly decorated, with water panels, paintings and plants. A large, airy lobby housed the drop and lift shafts and connected to the wing's many corridors. Corridors were built from the familiar white stone used in most Bakuran buildings. Rooms and suites opened into both the corridors and the main lobby."}, {"tag": "p", "text": "The rooms were tailored to suit the needs and tastes of their inhabitants. Non-resident guest quarters were generally decorated with pale-yellow namana wood panelling, with large windows overlooking the Greenwell. A hexagonal lounge \"pit\" area, filled with small repulsor cushions, dominated the main room of each apartment. Each apartment possessed a three-D screen, comm module, and computer terminal. In addition, each room was decorated with a different muralscape - a computer animated landscape scene that was eerily realistic. These murals generally depicted locations on Bakura, though they could be reprogrammed for virtually any view."}, {"tag": "h3", "text": "Imperial Offices Wing"}, {"tag": "p", "text": "The upper levels of the Bakur complex were dominated by the Imperial Offices wing, which housed the offices of Governor Nereus' subordinates, as well as COMPNOR's operations center. (Apparently, a sophisticated surveillance system was in place, but it was sabotaged by COMPNOR agents before the Imperial surrender.) This area also housed a medical bay (often used by Nereus to conduct interrogations), a tram station, the Great Hall, and the Bakuran Senate Chamber."}, {"tag": "p", "text": "Governor Nereus' office was located on the ground level of the Imperial Offices wing. It was occupied by Pter Thanas following the Imperial surrender. The office housed the complex's HoloNet reception point, with the transceiver located on a small pad near Nereus' broad desk. Large windows looked out onto the Greenwell, though Nereus generally kept the windows shuttered. The office walls were decorated with the dental specimens Nereus collected from various species. A conference table with a retractable holoprojector was also in the office."}, {"tag": "h3", "text": "The Great Hall"}, {"tag": "p", "text": "Connecting the tram station arch and the Senate Chamber was the Great Hall. A traditional gathering place for politicians, business and civic leaders, many of Bakura's most important laws were crafted during meetings in this corridor. Smaller side corridors led to drop and lift shafts connecting to other levels. The Senate wing connected to the Great Hall through another side corridor and was a brief walk from the Senate Chamber. The large corridor was carpeted in thick black. A row of columns, crafted from expensive red marble and traced with gold, lined the corridor. The walls were also made of red marble, while the gold traceries continued up to criss-cross on the high, vaulted ceiling."}, {"tag": "p", "text": "One wall had a bank of storage lockers for the belongings of Senators and guests. The lockers were equipped with hand print locks for security. The entrance to the Senate Chamber was guarded at all times by at least two stormtroopers, although up to a dozen troopers could be assigned there if disruption of the Senate's proceedings was considered likely. Repulsor-equipped weapons scanners insured the security of all individuals within the Chamber. Both the tram station and Senate Chamber entrances were guarded by a pair of door wardens dressed in the violet doublets worn by the Bakuran Honor Guard. A thick wooden door closed off the entrance to the Senate Chamber."}, {"tag": "h3", "text": "The Greenwall"}, {"tag": "p", "text": "The Greenwell extended throughout every level of the complex, running from ground level to the roof. From the air, it appeared rather like a \"slice\" carved through the center of the building. The Greenwell was a large arboretum lined with tall fern trees and \"passion-bud\" vines that were native to Bakura. A large central fountain was located in a grassy clearing. Water leapt from over 100 sonic motivators in gravity-defying whirls and eddies, spraying decoratively into the air. Paths through the Greenwell were marked out in a deep green moss that was highly resistant to damage, making for an excellent natural walkway. A few small avian specimens were kept in The Greenwell, enhancing the natural beauty of the chamber with bird song."}, {"tag": "p", "text": "The main entrance to the Greenwell connected with the Statuary Park, although The Greenwell could be accessed by every level of the complex via repulsorlift drop and lift shafts that gently lowered visitors to the ground. A smaller, secondary greenwell lay towards the northern end of the building. While not as large or elaborate as the Greenwell, this second arboretum offered more privacy and was a favorite of Bakur complex workers seeking some quiet during lunch periods."}, {"tag": "h3", "text": "Rooftop"}, {"tag": "p", "text": "The rooftop was covered with huge vine-trees. A repulsor tram had a rectangular route around the building, shuttling workers and Senators around the complex's wings. The rooftop landing port could handle ships and airspeeders up to\n100 meters in length. A small parking area stored speeders for visitors and senators, while a lift went down to a small airspeeder hangar storing Bakuran government speeders."}, {"tag": "p", "text": "A large garden was located on the roof as well, though it was not as well-maintained as the Greenwell; the Imperial government did not place as high a priority on the survival of the trees and small creatures housed on the roof as it did on maintaining a functioning landing pad."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}