{"url": "San_Hill", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:InterGalactic Banking Clan members", "Category:Males", "Category:Muuns", "Category:Separatist leadership"], "nodes": [{"tag": "h1", "text": "San Hill"}, {"tag": "p", "text": "San Hill was a male Muun and Chairman of the InterGalactic Banking Clan during the Clone Wars. He pledged the support of the Banking Clan to the Confederacy of Independent Systems and served as the financial cartel's representative on the Separatist Council. Hill and the rest of the council were slaughtered by Darth Vader on Mustafar following the end of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Muun from the planet Scipio, San Hill was the Chairman of the InterGalactic Banking Clan, also known as the IGBC. On the onset of the Clone Wars, Hill attended a secret meeting on Geonosis and signed a treaty with the Confederacy of Independent Systems, pledging the Banking Clan's financial and military assets to the movement, with Hill serving as the financial cartel's representative on the Separatist Council. During the final days of the Clone Wars, Hill, along with the other Separatist leaders, moved from Utapau to Mustafar where they were all killed by Darth Vader."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like most Muuns, San Hill was more comfortable with business and closed-door politics than being on the front lines of war. Hill was highly influential, and wasn't above conspiring with others to get his way. As Chairman of the IGBC, Hill believed that no war could be fought without money."}, {"tag": "p", "text": "A male Muun, Hill stood at 1.91 meters tall, and had yellow eyes and pale skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "San Hill first appeared in the 2002 film Star Wars: Episode II Attack of the Clones, the second installment of the Star Wars prequel trilogy. Hill then appeared once more in 2005's Star Wars: Episode III Revenge of the Sith. The character's gaunt form is draped in CG wardrobe developed by concept artist Dermot Power."}, {"tag": "p", "text": "Though Hill's death was never depicted onscreen during Revenge of the Sith, the illustrated screenplay indicates that Hill was killed just before Poggle the Lesser. The 2015 canon reference book Ultimate Star Wars confirmed his death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}