{"url": "Samoc_Farr/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Chandrilans", "Category:Females", "Category:Humans", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Samoc Farr"}, {"tag": "p", "text": "Samoc Farr was a Human female regarded as one of the best pilots serving with the Alliance to Restore the Republic during the height of the Galactic Civil War. She grew up on the planet Chandrila in a family that was loyal to Chandrilan native and eventual Rebel Alliance Chief of State Mon Mothma and firmly opposed to the Galactic Empire. Samoc and her older sister, Toryn, secretly joined the Rebellion after they were reportedly killed in a staged transport crash and then taken offworld. The Farr sisters were eventually both assigned to the Rebel headquarters of Echo Base on the ice planet Hoth."}, {"tag": "p", "text": "Samoc piloted a modified T-47 airspeeder during the Battle of Hoth in 3 ABY. Farr's snowspeeder was shot down during the engagement by an Imperial All Terrain Armored Transport walker. Although badly wounded, she survived and was later evacuated from Hoth aboard the GR-75 medium transport Bright Hope along with her older sister, Toryn Farr, Echo Base's chief controller. The Farr sisters again survived when the Mist Hunter, the craft of the bounty hunters Zuckuss and 4-LOM, disabled their escape transport during its failed blockade run through the line of Imperial-class Star Destroyers orbiting the planet. After Toryn convinced the bounty hunting duo to rescue Samoc, herself, and the remaining eighty-eight Rebel passengers aboard the Bright Hope, the group was delivered to the Rebellion's underground cell on the planet Darlyn Boda, where Samoc received medical treatment, including the fabled healing powers of the Ankarres Sapphire, before finally reaching the safety of the Alliance Fleet at the Rebels' secret rendezvous point beyond the edge of the galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Joining the Rebellion and Battle of Hoth"}, {"tag": "p", "text": "The Human female Samoc Farr was born and raised on the planet Chandrila, an agricultural Core World best known as the homeworld of Mon Mothma, former Galactic Republic Senatorial representative and eventual leader of the Alliance to Restore the Republic. The Farr family was loyal to Mothma and staunchly opposed to the Galactic Empire. At some point sympathetic Chandrilan authorities helped the Farrs and several more families fake a transport crash in which some of the families' children, including Samoc and her older sister, Toryn, were reported killed. The ruse provided an opportunity for Samoc and Toryn to slip out of Chandrila and join the Rebellion. Toryn promised their mother that she would take care of Samoc, who was the youngest in the family, and the child always considered the most beautiful, the happiest, and the one with the most promise."}, {"tag": "p", "text": "Samoc became an excellent pilot with the Rebel Alliance—one of its best—and the Farr sisters served in several battles as of the year 3 ABY, by which time both were assigned to Echo Base, the secret Alliance High Command headquarters on the remote Outer Rim Territories ice planet Hoth. At Echo Base Toryn earned a position as chief communications officer within the ice facility's command center."}, {"tag": "p", "text": "The Empire discovered Echo Base's existence in early 3 ABY, setting off the critical Battle of Hoth, in which the Rebels raced to evacuate their outpost before being overrun by the invading Imperial ground forces of Blizzard Force, attached to the Dark Lord of the Sith Darth Vader's personal Star Destroyer fleet, the Imperial Death Squadron. During the battle Samoc flew with the Alliance's elite Rogue Group aboard a T-47 airspeeder, dubbed \"snowspeeders,\" tasked with helping to delay the advancing line of Imperial All Terrain Armored Transport walkers long enough to buy time for the Echo Base personnel and equipment to escape Hoth aboard a series of vulnerable GR-75 medium transports. Samoc flew under the call sign Rogue Six, joined by the hulking male Iotran Vigrat Pomoner as her speeder's rear gunner."}, {"tag": "p", "text": "Samoc's snowspeeder was shot down during the battle by an AT-AT, one of seven Rogues to be downed in the engagement. Samoc survived, albeit badly wounded, although Pomoner was killed in action. She was eventually brought back to Echo Base's main hangar during the late stages of the battle as the final remnants of Rebel personnel rushed to escape the planet before Imperial snowtroopers descended on the base. Samoc was left lying amidst an assortment of similarly wounded Rebel soldiers being treated by medical droids around the flight deck of the Bright Hope, the last remaining Rebel GR-75 medium transport yet to depart the base."}, {"tag": "p", "text": "Toryn soon arrived in the hangar after ordering the final evacuation code signal to the Rebel troops still fighting in the field, only to find the flight deck littered with wounded and dying. Hastily beginning to help load the wounded aboard the Bright Hope, Toryn eventually discovered Samoc lying among the hangar's casualties, injured but still conscious. That Samoc, considering her talents, had been shot down during the battle led Toryn to believe the fight had been truly horrific. Toryn found that Samoc had not received medical treatment in the rush to evacuate and was covered in burns—her red hair and eyelashes were gone, and her hands and face were charred. Toryn carried Samoc aboard the transport, despite the pain she knew it must have caused her younger sister, as snowtrooper blaster fire exploded around them. The Farr sisters were among the last to board the Bright Hope before it blasted away from Hoth. Although the vessel was designed to safely carry ninety passengers, the Bright Hope had been cleared of vital equipment to make room for hundreds of evacuees."}, {"tag": "h3", "text": "Survival aboard the Bright Hope"}, {"tag": "p", "text": "Aboard the final evacuation transport, Toryn strapped her wounded sister into a vacant seat near the boarding hatch and knelt beside her to keep Samoc's body stable for the transport's imminent blockade run through the line of Imperial Star Destroyers waiting in Hoth's orbit. The Bright Hope was disabled and all but destroyed by concentrated fire from both the Imperial fleet and the G-1A starfighter Mist Hunter, the personal starship of the bounty hunters Zuckuss and 4-LOM, who had entered the Hoth system in the midst of the battle to capture Rebels fleeing the planet. Although a large portion of the Bright Hope had been completely blown away, killing most aboard, the Farr sisters nevertheless survived, along with 106 others."}, {"tag": "p", "text": "When Toryn regained consciousness following the transport's ordeal, she found Samoc alive and conscious as well but shaking and moaning—with her burn wounds still untreated, Samoc had fallen into shock. After Toryn retrieved a brown bantha-wool blanket that had spilled from an overhead cupboard with which to cover her sister, Samoc grimly whispered to her that the Imperials had failed to kill them, first after Samoc had been shot down over the Hoth battlefield, then having nearly been shot by stormtroopers while boarding the transport, and finally having survived the blockade run; she could only wonder how they would finally do it. Toryn refused to think about that possibility but realized that she and her sister, for all the battles they had been through, had never been as close to death as they were at that moment. Instead, Toryn wrapped Samoc tighter in the blanket and went off to search the crippled transport for something with which to treat her burns and perhaps a way to save themselves."}, {"tag": "p", "text": "Searching through the Bright Hope's damaged interior, Toryn learned that the crippled transport nevertheless still held three accessible, yet malfunctioning, escape pods, a possible means of rescue. She also happened upon the medical droid duo of 2-1B and FX-7, who had previously served in the Echo Base medical lab. Toryn ordered the latter, who was equipped with excellent burn-treatment programs, to tend to the wounded Samoc, despite knowing that the droid would obey the command at the expense of bypassing all other Rebel wounded, no matter the extent of their own injuries. She reasoned that if there was a way to survive, she wanted Samoc to live, to honor the promise she had once made to their mother to look out for her younger sister. Still, Toryn hoped that by helping Samoc she would not directly be hurting anyone else."}, {"tag": "p", "text": "Continuing through the transport, taking stock of their situation, Toryn came upon the three escape pods, where a group of Rebels soon restored their functionality. Nevertheless, there were only eighteen available passenger spots in the three pods. A crucial decision thus faced the Bright Hope's survivors regarding who would go, and who would stay. Toryn eventually compiled a list of all survivors aboard in an effort to determine which Rebels most valuable to the Alliance's cause would be jettisoned back to Hoth aboard the escape pods to be given the best chances of survival. When Toryn broke her list of 108 survivors down to fifty-six, eliminating fifty-two whom the Bright Hope's medical droids identified as too badly wounded to attempt survival in Hoth's unforgiving environment, Samoc was among those selected to remain aboard. Toryn's leadership abilities earned her a nomination to join the escape pod party, but she refused. Besides knowing she was still needed aboard the transport, Toryn would never leave Samoc behind."}, {"tag": "h3", "text": "An unexpected rescue"}, {"tag": "p", "text": "With little left to do following the escape pods' jettisoning back to Hoth but prepare for the Bright Hope's inevitable seizure and boarding by a nearby Imperial-class Star Destroyer that had begun mop-up operations on similarly crippled Rebel transports, the ship's remaining passengers began to stockpile weapons and tend to the wounded. They were interrupted, however, when another ship was spotted approaching the Bright Hope, which one Rebel, Rory, identified as the Mist Hunter—the same craft that had disabled the Bright Hope, though those aboard were unaware of the role the Mist Hunter had played in neutralizing the transport."}, {"tag": "p", "text": "The bounty hunters Zuckuss and 4-LOM soon docked with and boarded the Bright Hope, intending to capture the twenty-six Rebels aboard identified by the Imperial Most Wanted List as having the largest bounties placed on them. Toryn was foremost on the list. Trying to masquerade as bounty hunters with Rebel connections in one of the largest Imperial bounty hunter guilds, 4-LOM attempted to persuade his twenty-six targets to come with him aboard the Mist Hunter, where he claimed they would be safely transported to the Rebels' rendezvous point at a remote location of space beyond the rim of the galaxy. In truth, he hoped to infiltrate the Alliance Fleet there and collect on the much more lucrative bounty placed on Rebel smuggler Han Solo by Darth Vader. However, none of the Bright Hope's passengers believed him. Growing desperate, 4-LOM physically ensnared Toryn, the most valuable Rebel, and dragged her aboard his ship and into a secure holding cell. When she protested that the bounty hunters were not there to rescue them, the droid insisted that their efforts were genuine, to which she pointed out that Samoc, one of the Rebellion's most talented pilots, was left off the list of those to be rescued, a blatant lapse in logic. 4-LOM did not respond."}, {"tag": "p", "text": "After the bounty hunting duo realized their guise of an allied rescue attempt had convinced no one and ended in utter failure, Toryn convinced them to take on the remaining passengers still aboard the Bright Hope, including Samoc. And, rather than making the long and hazardous journey to the rendezvous point beyond the reaches of the galaxy, Toryn had convinced their rescuers to deliver them to the Rebel underground on the nearby planet Darlyn Boda, where Samoc would be able to receive badly needed medical treatment."}, {"tag": "h3", "text": "Deliverance at Darlyn Boda"}, {"tag": "p", "text": "As the bounty hunters transported their new Rebel passengers to Darlyn Boda, Samoc lay in a cramped rear corner of the confined interior of the Mist Hunter alongside other Rebel wounded, though her face and hands had since been wrapped in bandages. Looking over her tormented sister, Toryn uneasily doubted her own abilities to lead her comrades on behalf of Samoc. Twice had she put Samoc's well-being above anyone else—first when she had sent the medical droid to see to Samoc's condition, and then when she tried to get 4-LOM to add her to his list of Rebels to be rescued. What was more, she knew she would do it again, and she knew it was not fair to anyone else. Toryn only hoped she could find someone to take over her command duties once they reached Darlyn Boda."}, {"tag": "p", "text": "Upon reaching Darlyn Boda, a steamy, crime-ridden world, 4-LOM retrieved the Ankarres Sapphire, a blue gemstone fabled for its reputed healing powers, from a small jewel shop, where he had consigned the valuable jewel years before. The two bounty hunters and their Rebel consorts spent several weeks on Darlyn Boda before preparations were made to finally depart for the Alliance Fleet and the secret rendezvous point. Toryn was joined by Samoc and four other Bright Hope survivors for the trip, while the others would remain behind in the care of Darlyn Boda's Rebel underground. Aboard the Mist Hunter, just prior to lifting off, 4-LOM handed the Ankarres Sapphire to Samoc, allowing her to touch it to her bandaged face wounds in the hope that its healing powers would aid her. Samoc remarked that the sensation the sapphire provided her felt strangely physically rejuvenating."}, {"tag": "p", "text": "Samoc and Toryn finally reached the safety of the Rebel fleet at the rendezvous point with the help of Zuckuss and 4-LOM, where they were reunited with family and friends aboard the EF76 Nebulon-B escort frigate Redemption, the fleet's primary medical frigate. They were warmly greeted and informed that they and everyone assigned to the Bright Hope had been believed dead, or worse. When the Rebel command intended to promote Toryn for her actions in rescuing the passengers aboard the Bright Hope, she attempted to explain to General Carlist Rieekan how she had put Samoc's needs ahead of anyone else's. Rieekan, however, only further commended her—of course she had saved Samoc, for her sister's piloting abilities made her an invaluable asset to the Rebel cause. Samoc, along with her bounty hunting rescuers, attended the ceremony in which Rieekan officially promoted Toryn to the rank of commander."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Samoc Farr was one of the Rebel Alliance's best pilots and an invaluable asset to the Rebellion's cause. Her skills earned her assignment to the Alliance High Command's secret Echo Base, where she flew one of the base's modified snowspeeders during the critical Battle of Hoth. However, like many Rebel pilots during the battle, she was shot down by an AT-AT despite her abilities."}, {"tag": "p", "text": "After surviving the Bright Hope's failed blockade run through the Imperial fleet orbiting Hoth, Farr had defied death at the hands of the Empire for the third time over the course of the battle. She had survived being shot down in her snowspeeder, then narrowly missed being blasted by snowtroopers in Echo Base's hangar, and finally found herself among the few fortunate enough to survive the Bright Hope's virtual destruction. Her harrowing experiences had a substantial effect on her, and she expressed to her sister, Toryn, of the Imperials' inability to kill them time and again, only wondering when she would finally die."}, {"tag": "p", "text": "The youngest in her family, Farr had always been regarded as the most beautiful, the happiest, and the one with the most promise. Her mother had made her older sister, Toryn, promise to watch out for her. After suffering serious injuries during the Hoth battle, Farr's red hair had been mostly burned away, along with her eyelashes, and she had burns on her hands and face."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character Samoc Farr was first created by author M. Shayne Bell for the short story Of Possible Futures: The Tale of Zuckuss and 4-LOM, as part of the 1996 anthology book Tales of the Bounty Hunters. Samoc's creation was meant to complement the story's main protagonist, Toryn Farr, Samoc's sister. Toryn's creation provided an identification for the previously anonymous Echo Base chief controller first seen in the film Star Wars: Episode V The Empire Strikes Back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}