{"url": "San_Hill/Legends", "categories": ["Category:Legends articles", "Category:Bankers", "Category:Business owners and executives", "Category:InterGalactic Banking Clan members", "Category:Males", "Category:Muuns", "Category:Separatist leadership"], "nodes": [{"tag": "h1", "text": "San Hill"}, {"tag": "p", "text": "San Hill was a male Muun and the Chairman of the InterGalactic Banking Clan before and during the time of the Clone Wars, who pledged the Clan's monetary and military assets to the Confederacy of Independent Systems. A typical member of his species, he was more at home in business, politics and intrigue than on the battlefield. He was one of the most influential politicians in the Confederacy; in particular he was responsible for the \"creation\" of Grievous, the Confederacy's feared Supreme Commander of the Droid Armies."}, {"tag": "p", "text": "As the leader of one of the major supporters of the Confederacy, Hill was a member of the Separatist Council during the Clone Wars, and remained in that position until his assassination at the end of the war."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A male Muun from the planet Muunilinst, San Hill was the son of Damask Holdings senior employee Larsh Hill. After his father was murdered on Coruscant during his induction into the Order of the Canted Circle, Hill was tutored by his father's former employer, Hego Damask, in preparation for Hill's ascension to the Chairmanship of the InterGalactic Banking Clan. Following the end of Chairman Tonith, Hill was appointed co-chairman of the Banking Clan, eventually becoming the sole head of the organization by 32 BBY."}, {"tag": "h3", "text": "Separatist Crisis"}, {"tag": "p", "text": "When economic turbulence erupted across the galaxy as the Separatist Crisis swept through the Galactic Senate, InterGalactic Banking Clan executives profited handsomely from numerous worlds minting their own independent currencies.\nWhen a streak of separatism struck the Galactic Senate, Hill began the search for a new \"collections agent\" for the Banking Clan who would ensure that despite the turbulent political and economic times, all debts would be paid. Taking note of the world Kalee and the crushing debt it had placed on its shoulders following a Republic embargo on the planet following the Huk War, the Muun Chairman offered to take on the debt and manage to ease the embargo in exchange for the services of Kaleesh warlord Qymaen jai Sheelal. Placing Sheelal in command of the Collections and Security Division of the Banking Clan, the Kaleesh eventually left Hill's service to continue fighting for his people on Kalee. Enraged, Hill considered an assassination but refrained in fear of the eventual vengeance of the Kaleesh. Instead he conspired with Poggle the Lesser, the Archduke of Geonosis, and the political idealist Count Dooku to arrange Sheelal's permanent servitude. They planted an ion bomb on the warlord's ship, the Martyr, causing it to crash following a fiery explosion. Pulling Sheelal from the wreckage with near-fatal injuries, San Hill funded the construction of the Kaleesh's new cyborg body which would encase his retrievable organs and replace those which could not be saved. In Hill's mind, this monstrosity known as General Grievous would now be capable of defending the IGBC should Dooku's Separatist movement get out of hand."}, {"tag": "h3", "text": "Formation of the Confederacy of Independent Systems"}, {"tag": "p", "text": "Following his work with Dooku on the project to transform Grievous, Hill was open to talks of joining the rapidly progressing Separatist movement. Having become an acquaintance of both Techno Union Foreman Wat Tambor and Commerce Guild Presidente Shu Mai over the years, Hill was in good company when Dooku approached him with offers of an alliance. On the invitation of Dooku, Hill attended a meeting on Geonosis with numerous representatives of corporate interests from across the galaxy to discuss investments in Dooku's Confederacy of Independent Systems. The guest of Archduke Poggle the Lesser, Hill and the others met in a boardroom where the Muun pledge the Banking Clans backing and agreed to supply Hailfire droid tanks to the Separatist Droid Army. Hill's Banking Clan was the second largest financial contributors to the Confederacy, behind prime supporter Viceroy Nute Gunray's Trade Federation."}, {"tag": "p", "text": "When the Grand Army of the Republic attacked Geonosis, Hill attempted to flee the planet on his personal Hardcell-class interstellar transport, which he had received from Wat Tambor. However, Hill's vessel suffered a serious engine malfunction, preventing it from taking off into hyperspace. Without any thruster power, Hill's Hardcell transport was left stranded in the E'Y-Akh Desert for several weeks. However, the Muun managed to evade Republic capture and prosecution. Hill was only able to escape Geonosis with the help of Captain Riklon Tost of the Iotran Guard, who was allowed in the Banking Clan's inner ranks despite not being a Muun."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "As the Clone Wars erupted, Hill was placed on the Confederacy's governing Council, a body which controlled the Confederacy in truth while the Confederacy's Parliament on the planet Raxus debated pointlessly. Despite his pledge of support, Hill was not prepared to commit the entire Banking Clan to the Confederacy with so many profitable investments waiting with the Republic. Retaining their position within the Republic, Hill stayed away from Coruscant while his representatives stayed in the Senate Building. In the early weeks of the Clone Wars, San Hill went to the banking world of Aargau to raise money for the Confederacy of Independent Systems. Navigating the labyrinthine interiors of Aargau's commerce centers, he struck bargains with the criminal underworld to supplement the riches of the Separatists."}, {"tag": "p", "text": "In order to secure the Ando system's continued backing, Hill and Wat Tambor appointed former Republic Senator Po Nudo as head of the Hyper-Communications Cartel, the Confederate version of the Republic's HoloNet that used secret Banking Clan codes to spread CIS propaganda. This communications system was used to link the holotransceivers used by many Separatist leaders and keep messages out of the hands of the Republic."}, {"tag": "p", "text": "During the Battle of Muunilinst, San Hill commanded the Confederacy forces from a war room atop a large command tower. Hill hid behind the protection of legions of IG lancer droids and the merciless bounty hunter Durge, but the Republic was able to infiltrate his headquarters and bring him, his Banking Clan associates and an Neimoidian aide to trial. Despite his arrest, Hill managed to regain his freedom shortly after and return to the protection of General Grievous."}, {"tag": "p", "text": "Despite his escape, Muunilinst remained out of Hill's reach after the battle and he was forced to follow the other Councilors around the galaxy in an effort to avoid capture under the protection of Supreme Commander Grievous. Joining the Council aboard the cyborg's flagship, the Invisible Hand, the leadership of the Confederacy was sent to the sinkhole world Utapau to await further instructions. Following Dooku's death over Coruscant at one of the most tumultuous battles of the war, Hill was present with the other Councilors at the meeting during which Grievous ordered them to Mustafar, a mining planet on the Outer Rim where they were promised safety. Not long after departing Utapau, Grievous was killed by Jedi Master Obi-Wan Kenobi, and the Council took full control over the Confederacy."}, {"tag": "p", "text": "As the Council arrived on Mustafar, they quickly settled into the dimly lit command center at the mountainside Klegger Corp Mining Facility. Hill and the other Confederacy leaders were pressed into work at the facility's command center, supervising strategy and battle plans from their remote sanctuary. During their stay, the Council received a communications from the mysterious Darth Sidious, the Confederacy's shadowy benefactor. Sidious promised that the war was over and that the Republic had crumbled under the Separatist's war machine. Advising the Council to remain on the planet, Sidious assured them that he would send his apprentice, Darth Vader, to watch over them. Relieved by the news of victory, Hill and the others anxiously awaited for Vader's arrival and their eventual departure from the inhospitable world. Upon Vader's landing, the Council and its aides gathered in the facility's main command center to greet Vader only to realize soon after he sealed off all of the exits to the facility that he was not there to protect them. Igniting his lightsaber, Vader savagely cut down the guards flanking the doorway before attacking the unarmed Councilors and their aides. Despite Hill's plea for mercy, Vader plunged his lightsaber through the Muun's three hearts, killing him instantly."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "His name is likely a play on \"Sam Hill\", as a part of the phrase of \"What in Sam Hill is that?\""}, {"tag": "p", "text": "San Hill was voiced by Corey Burton in the Clone Wars cartoon."}, {"tag": "p", "text": "San Hill is one of the only Councilors not to receive an onscreen death. The Revenge of the Sith novelization gives a dramatic depiction of San Hill's death; as Darth Vader enters the Separatist command center, Hill rushes to greet the new Sith Lord, saying, \"On behalf of the CIS leadership, I would like to be the first to—\" To this, Vader sadistically replies, \"Very well. You will be the first.\" When Vader throws back his hood, Hill instantly recognizes him as the former Jedi hero Anakin Skywalker, moments before he is cut down by Vader's lightsaber. The depiction of Hill's death in the Star Wars Episode III: Revenge of the Sith comic is also conflicting with the film depiction, as Hill is struck down alongside both Po Nudo and Poggle the Lesser who die onscreen."}, {"tag": "p", "text": "Star Wars: Empire at War: Forces of Corruption introduces another individual named San Hill. Curiously, although this new San Hill is a Human, he bears the same position of Chairman of the InterGalactic Banking Clan and also resides on Muunilinst. Though it seems that both San Hills were meant to be one and the same, this appearance is likely due to a mistake on the part of the game developers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}