{"url": "Samuel_Tomas_Gillespee", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Smugglers' Alliance members"], "nodes": [{"tag": "h1", "text": "Samuel Tomas Gillespee"}, {"tag": "p", "text": "Samuel Tomas Gillespee was the head of a small but respected smuggling group. He was a well-known criminal with a reputation as a con-artist and not always paying the pilots under his employ. However, he was known for treating his crew fairly, and as a result, he had a number of competent pilots and techs working for him. He was a friend of Talon Karrde, both having started their businesses at around the same time. Around 9 ABY, Gillespee had retired to the planet Ukio after almost thirty years of smuggling."}, {"tag": "p", "text": "While enjoying his retirement, Ukio was attacked by the Galactic Empire under the command of Grand Admiral Thrawn. Gillespee barely escaped the world in his freighter, Kern's Pride, and immediately set about rebuilding his smuggling operation, hoping to fight the Empire on his own terms. During this operation, Gillespee reunited with Karrde and joined his Smugglers' Alliance, organizing the first meeting on Trogan. When the meeting was attacked by the Empire, the newly formed Alliance decided to join the fight against the Empire. As a result, Gillespee's fleet of twenty ships was present at the Battle of Bilbringi, the climactic battle of the Thrawn campaign."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Samuel Gillespee began his career as a young man, working as a smuggler. His operations were run from Kern's Pride, a modified Corellian Engineering Corporation CR90 corvette. He made a name for himself by flying along the Kessel Run. However, the exploits that made him famous were mostly the result of the pilots under his employ. Gillespee was an unskilled pilot that worked better as an administrator, claiming that his lack of ability was all due to bad luck. Gillespee was notorious for abandoning the Kessel system with his partner's cut of the profits, an action that he claimed later to be a simple misunderstanding that he eventually straightened out. The start of Gillespee's criminal activities coincided with the start of information broker Talon Karrde's activities, and the two were friends of one another."}, {"tag": "p", "text": "Over the next thirty years, Gillespee used the Kern's Pride to enact several raids, smuggling runs, and other assorted missions. Although his ship began to build up a wealth of battle scars and systems malfunctions, Gillespee refused to abandon it, believing that its faults reminded him of himself. Additionally, he kept a hidden smuggling compartment next to his personal cabin aboard the ship. Gillespee was known to reconfigure the ship once a year based on the operations he was involved in at the time. Early in his career, he met Shirlee Faughn as a teenager, and enjoying her polite demeanor and friendly sense of humor, he took her into his crew. When she became familiar with the smuggling trade, Gillespee promoted her to his second-in-command, a position she held until her her mid-forties. Additionally, in his early days, Gillespee met Rappapor, a Bith pilot who became one of his closest friends. The two friends downplayed their relationship, but they were always there to bail each other out of bad situations. During the Galactic Civil War, Gillespee was known to aid the Rebellion in engagements. He refitted his ship several times in this capacity: as a troop transport to bring Rebel troops to new battlefields, as a passenger liner to move refugees, and as a medical ship to transport wounded Rebel soldiers. After nearly thirty years in the smuggling business, and into his middle age, Gillespee retired to the small agricultural world of Ukio in the Outer Rim Territories. The smuggler's business had been quite successful, and he was able to purchase a profitable piece of land on the planet. Gillespee's estate was on a large area of land, and allowed him to stay out of galactic affairs, hoping to abandon his old life and relax."}, {"tag": "h3", "text": "Out of retirement"}, {"tag": "p", "text": "In 9 ABY, a resurgent Galactic Empire under the command of Grand Admiral Thrawn began to attack the New Republic. During this campaign, Ukio came under attack. The planet fell incredibly quickly, and Gillespee was only barely able to escape his homestead and get off-planet in his freighter. In his retirement, Gillespee had been unable to part with the Kern's Pride, and he kept it nearby even in his retirement. This decision allowed him to escape Ukio, despite the quick conquest of the planet by the Empire. Thanks to help from Rappapor and Faughn, Gillespee was a few steps ahead of stormtroopers that overran his land and began to turn the area into a crop farm to feed the growing Imperial war machine. During his escape, Gillespee viewed Thrawn's clone stormtroopers manning roadblocks, and was sufficiently disturbed by the Imperial's use of clones in their war against the Republic. Now with a grudge against the Empire, Gillespee restarted his smuggling business and decided to seek out other smugglers who had a grudge against the Empire. With a force of twenty ships, headed by Kern's Pride, Gillespee made his way to the planet Chazwa, hoping to make contact with someone who could put him in touch with the smuggler, Brasck. Upon reaching the system, Gillespee met up with the Wild Karrde and came into contact with Talon Karrde. The two old friends spoke about the increased Imperial presence, and Karrde let Gillespee know that he was planning to organize a meeting of smugglers to discuss the Imperial problem. Gillespee agreed to meet with Karrde on Tragon in eight days times and agreed to spread the word of the meeting to other willing smugglers."}, {"tag": "p", "text": "However, unknown to Gillespee, Kern's Pride had been pursued by a pair of Lancer-class frigates to the Chazwa system. Upon escape from Ukio, Gillespee was now wanted by the Empire. The two Imperial ships zeroed in on his freighter, but Karrde used his ship to distract the pursuing Imperials. Gillespee thanked Karrde for his help, just as his old friend was joined by his small fleet of ships which quickly turned the tides on the Imperials. However, Gillespee had also predicted the Imperial tail, and his group of ships also appeared in the system, pinning the Imperials between the two smuggler fleets. The Imperials fled from the engagement, and Gillespee and Karrde left the system in short order."}, {"tag": "h3", "text": "Smuggler's Alliance"}, {"tag": "p", "text": "Eight days after their encounter above Chazwa, Gillespee met Karrde at the Whistler's Whirlpool Tapcafe on Trogan. The two smugglers set up in the mostly abandoned business and checked the area for possible spies. Gillespee's people found that the local Imperial garrison was quiet, leading to suspicion that a possible ambush might be planned for the meeting. However, Karrde dismissed this possibility, claiming that at least the tapcafe could be easily defended from attack. Gillespee and Karrde's invited guests arrived to the meeting skeptical of Karrde's motives. Gillespee took Karrde's side as the information broker explained that they should ally against the Empire, providing military intelligence to the New Republic. Although the present smugglers appeared to agree that the Empire was cutting into their business and making it hard to stay neutral, they argued fiercely over the dangers and implications of aiding the New Republic. Just as it seemed that the smugglers would not agree to aid the New Republic, the meeting was ambushed by an Imperial force led by Lieutenant Reynol Kosk. The smugglers were forced into a firefight, leading to the defeat of the Imperials, but the death of Gotal smuggler Lishma. The unprovoked attack caused the smugglers at the meeting to instantly side against the Empire, creating the Smuggler's Alliance, dedicated to aiding the New Republic in the coming conflict."}, {"tag": "p", "text": "Gillespee joined Karrde on the planet Hijarna, setting up a rendezvous at the Fortress of Hijarna to coordinate info drops that could be forwarded to the New Republic. The Alliance was coordinating their efforts to find the Imperial's primary cloning facility, but was having difficulty pinpointing the world. As the search continued, Gillespee let Karrde know that his fellow smugglers were losing patience with the hunt. The spying work was paying considerably less their smuggling operations, and the loss coalition of smugglers was threatening to break apart. Gillespee let Karrde know that some of their allies, specifically the smuggler, Par'tah, were getting job offers from the Empire, and they were seriously considering taking the contracts. Karrde offered to pay salaries, but Gillespee scoffed at the offer, knowing that his old friend did not have the funds to pay off all their operations. However, Karrde decided to covertly put the Smuggler's Alliance on the New Republic's payroll, having his slicer Ghent hack the Republic system, placing their members under contract to the Republic. Amused by Karrde's tactics, Gillespee agreed to continue working inside their loose alliance against the Empire but could not guarantee that the other smugglers would continue working under Karrde."}, {"tag": "h3", "text": "Loose alliance"}, {"tag": "p", "text": "As the Smuggler's Alliance continued to secretly work against the Empire, their efforts were noticed by Grand Admiral Thrawn. Niles Ferrier, an Imperial stooge who had organized the ambush on Trogan and infiltrated himself into the Smuggler's Alliance, began to work with Thrawn to pull apart the alliance from the inside. Ferrier used his Defel bodyguard to plant evidence on the Wild Karrde that implicated Karrde in organizing the ambush on Trogan which had started the Smuggler's Alliance. The smuggler, Mazzic, one of the preeminent members of the alliance had also come to the same conclusion after a run-in with Grand Admiral Thrawn. Angered by possibly being manipulated by Karrde, Mazzic brought along several enforcers to a scheduled meeting on Hijarna. Mazzic bringing soldiers to a routine meeting immediately upped tensions among the group. Gillespee attempted to calm the nerves of the group and ascertain why Mazzic was being to hostile, but he was told to be quiet as Mazzic used force to make his way onto Karrde's ship. True to Ferrier's intentions, Mazzic and another smuggler, Ellor, recovered a datapad that fingered Karrde as the man behind the Imperial ambush."}, {"tag": "p", "text": "Gillespee, suspicious of the false information, aided Karrde in drawing suspicion to the conveniently placed datapad. Mazzic, who was convinced that Karrde had betrayed the group, let the two men speak, but they were continuously interrupted by Nile Ferrier, who slowly began to say too much. Unable to keep his mouth closed, Ferrier revealed information about the ambush that only the person who had set up the attack could have possibly known. The gathered smugglers quickly turned on Ferrier, now revealed as the Imperial spy within their midst. Ferrier was able to escape the confrontation by wielding a thermal detonator, holding the group hostage until he was allowed to escape the meeting. However, as Ferrier attempted to escape in his ship, starfighters under Mazzic's command chased down the traitor and destroyed his ship, killing him."}, {"tag": "h3", "text": "Fully committed"}, {"tag": "p", "text": "Ferrier's betrayal caused the members of the alliance to recommit to opposing the Empire. Mazzic, Gillespee, and Karrde met up at a cantina to discuss their next move. Karrde's informants had put together news of a major New Republic strike Tangrene in order to capture a crystal gravfield trap array which could be used to locate cloaked asteroids being used to blockade Coruscant. Karrde brought the information to Gillespee and Mazzic and suggested their alliance plan its own raid on the Bilbringi Shipyards at the same time, seizing the crystal gravfield trap there so they could sell it to the New Republic."}, {"tag": "p", "text": "Gillespee brought his small fleet to the Bilbringi system alongside the ships of his fellow smugglers. The smugglers planned to raid the shipyards, seize the crystal gravfield trap, and then use their fleet to punch their way out of the system before the Imperials could stop them. Gillespee stayed aboard the Etherway during the operation, acting as co-pilot to Aves, Karrde's chief aide. The freighter, under the alias, Garrett's Gold infiltrated the shipyards and prepared for a coordinated attack with the other smugglers who had gained access. As the operation began, Gillespee questioned Aves about Karrde's absence from the operation. Karrde had made his way to Coruscant to coordinate with Ghent, hack into the Republic computers, and place the Smuggler's Alliance under the Republic's payroll. Aves defended Karrde's absence, briefly assuaging Gillespee's fears that Karrde may have betrayed them to the Empire."}, {"tag": "h3", "text": "Battle of Bilbringi"}, {"tag": "p", "text": "As Gillespee and the rest of the Smuggler's Alliance prepared their assault on the shipyards, they were interrupted by a massive Imperial force jumping into the system. Gillespee and the other smugglers immediately sensed betrayal, but they quickly agreed to go out in a blaze of glory. However, before they could form up to attack the much larger Imperial fleet, it became apparent that the Imperials had no knowledge of the planned smuggler raid. The information about the New Republic attack at Tangrene had been misinformation, and the Republic attack was actually planned for the Bilbringi Shipyards. The smugglers found themselves caught in the middle of a massive showdown. Unable to break off the operation, the smugglers decided to complete their mission."}, {"tag": "p", "text": "As the battle raged around them, the smugglers enacted their plan, seizing the crystal gravfield trap and formed up to punch their way out of the battle. Aves, who had contacted General Wedge Antilles immediately before their attack, organized the exit point at a weak point being defended by Golan II platforms. By coordinating with the New Republic, the smugglers ensured that incoming Republic forces would cover their exit as they attacked from the opposite side. Aves and the Etherway survived the escape from Bilbringi, indicating that Gillespee was able to survive the engagement."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a young man, Gillespee showed his daring by smuggling along the Kessel Run. However, Gillespee was an unskilled pilot, and unknown to persons outside his organization, he never touched the controls of his freighter, preferring to delegate responsibility to the skilled pilots that he surrounded himself with. Although known as not being a very competent pilot, Gillespee preferred to blame his inability on being innately unlucky. As a smuggler chief, Gillespee had a reputation as a con artist, and in his early days, had stolen the profits from a pilot who worked with him on the Kessel Run. However, despite this reputation, he was known to only con those that had already been planning to do the same to him, and he made sure that the individuals in question were eventually paid something. In his long career, Gillespee built up a reputation as a tough but fair employer, paying his subordinates as much as he felt they deserved."}, {"tag": "p", "text": "Gillespee preferred filling an administrative role in his smuggling business, and he developed a healthy level of respect from his subordinates. This was the result of treating his crew well, and he was able to attract many competent technicians and pilots to his side. Gillespee had a friendly personality and enjoyed surrounding himself with those of a similar nature. In this vein, he was the most common target of his friend Rappapor's practical jokes. By the time of the Thrawn Campaign, Gillespee was middle-aged and beginning to show his age. His subordinates noted that he always looked tired and had developed a paunch."}, {"tag": "p", "text": "Although well-known as a smuggler, Gillespee was eager to retire when he had gained the necessary funds. He saw his smuggling enterprise as simply a business and was reluctant to get involved in greater galactic politics. He had no moral objection to working for the Galactic Empire if the price was right. However, he was known to work with the Rebellion, and even used the Kern's Pride as a medical ship to evacuate wounded rebels. When his peaceful retirement was interrupted by Imperials, Gillespee's stated neutrality was challenged. He decided to oppose the Empire and sought out like-minded individuals. Although he was afraid of the might of the Empire, he still believed that the battle was still worth fighting."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Samuel Tomas Gillespee was created by Timothy Zahn for use in the final book of his Thrawn Trilogy, The Last Command. Gillespee worked as an ally to Zahn's earlier introduced character, Talon Karrde, and the two worked together through the last book to topple the Empire. Gillespee's backstory was fleshed out in the West End Games sourcebook, The Last Command Sourcebook, which was included in the later compilation, The Thrawn Trilogy Sourcebook. In West End Games sourcebook, Gillespee is described as an older man with a paunch, and his illustration shows him to be clean-shaven. However, in the comic adaptation of The Last Command, Gillespee appears as a skinny man with a black mustache and stubble."}, {"tag": "p", "text": "Following his appearance in the Thrawn Trilogy, Gillespee was referenced in several sourcebooks which served to summarize his appearance in The Last Command. New information on Gillespee was not revealed until two articles in Star Wars Gamer magazine. The Smuggler's Alliance in Star Wars Gamer 3 summarized his appearance in the Thrawn Trilogy, and Ships of the Smuggler's Alliance in Star Wars Gamer 4 described Gillespee's personal ship, Kern's Pride and revealed that he had aided the Rebellion before his retirement on Ukio. In 2004, The Official Star Wars Fact File contained a feature on Gillespee in issues 127 and 129."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}