{"url": "Sand_People_Enclave", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Tatooine locations", "Category:Tusken Raider culture"], "nodes": [{"tag": "h1", "text": "Sand People Enclave"}, {"tag": "p", "text": "This enclave of a tribe of Sand People was located within the Dune Sea of Tatooine, near the Anchorhead settlement established by Czerka Corporation some time prior to the Jedi Civil War. During the war, the Sand People living there continued their tradition of battling outsiders by attacking mining sandcrawlers, killing whomever they could but often taking prisoners, including Mission Vao's brother, Griff. When Revan came to the planet in 3956 BBY in search of Tatooine's Star Map, he was hired by Czerka to eliminate the threat posed by the natives, including destroying the Enclave if necessary. At the behest of Mission, he also agreed to rescue Griff if possible."}, {"tag": "p", "text": "However, a Duros conservationist entreated the party to attempt to communicate with them first. Taking the Duros' advice, Revan bought HK-47, which the seller, Yuka Laka, claimed could speak Ghorfa; after acquiring Sand People garb after killing an ambush party, he disguised himself as one. This allowed Revan and the assassin droid to enter the Enclave unmolested by the defensive turrets. Once inside, however, the disguise failed; due to quick thinking by Revan and through translation provided by HK-47, he convinced them to take him before the Sand People chieftain. Surprised at the interest taken by the outsider, the chieftain stated that his tribe intended to move further away from Anchorhead, however they first needed to build up supplies of water;. Revan agreed to bring the tribe a set of moisture vaporators in exchange for reducing the attacks on miners. When the Jedi unexpectedly returned with the vaporators, the chief gratefully gave him his ceremonial gaffi stick; afterward, he agreed to release Griff, as well as a trio of captive Jawas. Later, Revan brought a krayt dragon pearl to the Sand People, in order to prove his worth to the Storyteller so that he might learn their history. When the time came to move, the enclave itself was either abandoned or packed up for the journey."}, {"tag": "h2", "text": "Appearances"}]}