{"url": "Sand_Blasted", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 4"], "nodes": [{"tag": "h1", "text": "Sand Blasted"}, {"tag": "p", "text": "Sand Blasted is a short comic featured in Star Wars Tales #4. The story is perhaps most notable for briefly expanding on the dark trooper assault on Talay, as seen in Star Wars: Dark Forces. It was reprinted in Star Wars Tales Volume 1 and Star Wars Legends Epic Collection: The New Republic Vol. 1."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Darth Vader and General Rom Mohc are testing out the dark trooper project on Rebels in the Tak Base on Talay. One Rebel ship (the Grey Damsel) is in a position to escape and the Commander of Tak Base tells the ship's crew to flee and tell the rest of the Rebel Alliance about the new threat. The ship escapes the planet and is about to head into hyperspace when something blasts through the door to the bridge. Quickly realizing their weapons are useless against the attacker, Captain Bok screams for the jump to hyperspace to be aborted. It is too late, however, and the ship makes the jump into hyperspace. All hands aboard are killed."}, {"tag": "p", "text": "Upon exiting hyperspace the ship suffers engine failure and crashes into the Tatooine deserts."}, {"tag": "p", "text": "Three years later, Big Gizz, Spiker and the cowardly Onoh are camped out under the Tatooine night sky. A loud rumbling awakens Onoh and Spiker, who jumps aboard his swoop. Gizz is also awakened by the rumbling but is too disoriented and slow to get to his swoop before a convoy of sandcrawlers crushes it. Luckily a quick thinking Spiker flies in and whisks Gizz out of the way of being crushed as well. Infuriated that the Jawas driving the sandcrawlers didn't stop and that he had to sell his blaster to buy the swoop, Gizz swears that the Jawas will pay. He stops ranting when he realizes the sandcrawlers are going to drive off the cliff and into the abandoned Podracing track."}, {"tag": "p", "text": "On his swoop, Spiker is the fastest to make it down to the sandcrawlers and realizes that the \"'Crawler's still goin'\" and that it will \"overheat fast!\" As Gizz heads towards a door on the sandcrawler he notices some blasters burns on the outside of the 'crawler. Spiker suggests that the blaster burns are patterned like those of an Imperial AT-AT walker. Gizz doesn't care and rips off the door so he can grab a Jawa by the hood and threaten it. After Gizz throws the squealing creature to the ground, the Jawa tells of a \"Monster Droid\" of the \"ugly white clan of the sky. Suddenly Spiker notices a droid fall out of one of the sandcrawlers. Onoh screams in fear that it is an \"Imperial battle droid!\" but Gizz looks at it and dismisses it as an IG-97 droid which \"ain't scary.\" Gizz also refers to the fact that the Galactic Empire never made any Battle Droids (and therefore it should not have been referred to as \"Imperial\")"}, {"tag": "p", "text": "Just then an explosion blows a hole in the side of one of the sandcrawlers. The Jawa (called Klepti B'ay) screams with fear as the dark trooper, he was referring to earlier, walks out of hole. The dark trooper flies at the group scattering them and attempts to blast Gizz, Onoh and Klepti with a rocket. Luckily Spiker shoots the dark trooper in the back sending the missile off target. Spiker yells at Gizz to distract the trooper, who punches Klepti and takes his blaster. Spiker then ties up the trooper with a tow cable. While the dark trooper is incapacitated by the cable, the IG-97 droid stands up and takes a few shots at the Trooper. Gizz also takes a few shots at it, but Spiker yells \"Don't waste your time Gizz. That wreck is gonna blow sky high! Time to ride!\""}, {"tag": "p", "text": "Then the dark trooper snaps the tow cables and frees itself, but the IG-97 still firing at the trooper shoots its hand causing the trooper to drop its blaster. As Gizz chuckles in approval of the IG-97's actions, Spiker flies down and retrieves the blaster seconds before the dark trooper reaches its location. The dark trooper realizes Spiker has its blaster and grabs the back of Spiker's swoop, attempting to throw him off. Spiker manages to stay on the front of the swoop, however the blaster is too heavy for him to use against the dark trooper and the droid takes it from him. Spiker, realizing that the dark trooper is about to kill him, cuts the thrusters of the swoop. This causes the dark trooper who was previously holding it steady, to fly backwards with the swoop. Spiker jumps off the swoop and falls awkwardly to the ground. The dark trooper throws the swoop aside effortlessly and heads towards the pair, aiming its weapon. Luckily a sudden avalanche crushes the trooper. Looking at the source, it seems that Onoh and Klepti \"ain't so useless either!\""}, {"tag": "p", "text": "Unfortunately the rock fall is only a temporary solution and the dark trooper emerges once again, chasing Gizz and Spiker away from the sandcrawler's wreck, which suddenly explodes engulfing the dark trooper. Gizz and Spiker awaken after the explosion to the sounds of Klepti talking to Onoh. They are carrying Spiker's helmet and after giving it to him, Onoh explains that Klepti now thinks of the group as his tribe. As they look down at the slowly diminishing remains of the explosion, a figure begins to emerge."}, {"tag": "p", "text": "Fortunately it is the IG-97 droid and there is nothing to worry about. Big Gizz grabs the droid by the arm and begins dragging it away. Klepti suggests selling the droid as the amount he could get might be pleasantly surprising. Meanwhile a falling rock hits an old pit droid on the eye, awakening it. The droid heads immediately to another pit droid, which it awakens. They then begin to carry out their programming; picking up the pieces of the destroyed Dark Trooper to rebuild it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}