{"url": "Bakura-class_destroyer", "categories": ["Category:Legends articles", "Category:Bakura-class destroyers", "Category:Bakuran starship classes", "Category:Destroyer classes", "Category:Star Destroyer classes"], "nodes": [{"tag": "h1", "text": "Bakura-class destroyer"}, {"tag": "p", "text": "The Bakura-class destroyer formed the backbone of the Bakuran Defense Fleet that was established following the repulsion of the Ssi-ruuk at the Invasion of Bakura."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Bakura-class consisted of interdiction cruisers and were designed around the power reactor used by Imperial II-class Star Destroyers. They were also capable of escaping interdiction fields."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of 18 ABY, only three had been known to be built: Watchkeeper, Defender, and Sentinel. But there could have been more in the defense fleet, as it was later stated by Admiral Hortel Ossilege said that he could not leave the Bakuran System without defense during the Corellian Crisis, hinting there could have been a larger force of these destroyers. These three destroyers were the only known destroyers equipped with experimental hyperwave inertial momentum sustainers."}, {"tag": "p", "text": "The New Republic convinced the Bakuran Senate to deploy the three destroyers on the Republic's behalf during the Corellian Crisis, due to the fact that their interdiction fields would prove necessary against the likewise-equipped Sacorrian fleet, and the fact that the New Republic Defense Fleet was largely incapacitated due to the events of the previous year. Only Defender and Sentinel would return to Bakura following the subsequent Battle of Centerpoint Station."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although this class of starship is not called \"Star Destroyer\" by name, it is designated as such in Cracken's Threat Dossier."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}