{"url": "Sand_demon", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with gameplay alternatives", "Category:Creatures of Tatooine", "Category:Desert creatures", "Category:Insects", "Category:Predatory creatures", "Category:Semi-sentient species"], "nodes": [{"tag": "h1", "text": "Sand demon"}, {"tag": "p", "text": "The sand demon was a species of semi-sentient, six-legged insectoid that was native to the planet Tatooine. Feared by all other life on the desert world, sand demons preyed on a wide variety of creatures, including the legendary krayt dragon. Sand demons often lived for centuries, gliding beneath the surface of the desert as though the sand was an ocean and boring through rock with its razor-sharp legs. Tatooine's native Tusken Raiders believed that sand demons devoured their victims' life essences to grow stronger with each kill. Physically similar to the tentacled lyleks native to the planet Ryloth, sand demons were often tracked by members of the Jedi Order as part of the Tusken Raiders' Demon's Blood ritual, and while brave hunters occasionally sought to bring down one of the beasts, the creatures' ferocity and rarity left them shrouded in legends and myths."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Sand demons were large, six-legged insectoids that ranged in size from the average height of a Human to more than twice that amount. Native to the desert planet Tatooine, sand demons possessed red eyes that were situated on tall stalks on either side of their powerful, tooth-filled mouth. The bottom and top of each eye stalk was protected by chitin, while the eye itself was covered with a sand-resistant membrane. The creature's jaws allowed it to latch onto prey with a nearly unshakable grip. Each of the sand demon's six talon-like legs were armored in chitin that ranged in color from brown to black, matching the wide shell that protected the sand demon's upper body. The creature's underbelly was soft and relatively unprotected, and the unarmored parts of its body ranged in color from gold to a greenish-tan."}, {"tag": "p", "text": "Sand demons experienced periods of hibernation, but each sand demon underwent a process of shedding its skin and profuse bleeding before doing so. After awakening from hibernation, the sand demon's new skin was coated in a kind of glistening gel, similar to the kind that covered newborn sand demons. The sand demon was very similar to the lylek, a six-legged predator native to the desert world of Ryloth, though the two creatures differed in that the sand demon lacked the two thick tentacles possessed by the lylek. According to Tatooine's native Tusken Raiders, sand demons could live for centuries."}, {"tag": "h2", "text": "Behavior and intelligence"}, {"tag": "p", "text": "A semi-sentient species with moderate intelligence, sand demons traveled beneath the desert sands in a way that natives described as \"sand swimming,\" gliding underneath the desert's surface like it was an ocean. They were also capable of digging through rock and sand with their talons, leaving behind tunnels and caves beneath Tatooine's surface. The creatures erupted from beneath the desert to consume their prey. Sand demons occupied the highest point of Tatooine's food chain, as they were the only known predator of Tatooine's enormous krayt dragons—massive lizards that averaged thirty meters in length and ten in height."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Cold War between the Galactic Republic and the Sith Empire, sand demons were well-known among the natives of their homeworld, Tatooine, though they were largely shrouded in myths and legends. Grainy satellite images and the stories of Tatooine's nomads prevented the rest of the galaxy from dispelling sand demons as an outright myth, and almost all attempts to learn more about the creatures ended in disaster. The Tusken Raiders believed the sand demons absorbed their victims' life essence in order to strengthen themselves, and the Raiders made cave paintings of ancient sand demons that had supposedly survived for centuries through this process—sand demons that were believed to be immune to any injury. The mercenary Kord Murdok hunted sand demons for a time on Tatooine, and the Demon's Blood ritual was a tradition that had existed for generations, though by the time of the Cold War, it was no longer well-known. For the ritual, members of the Jedi Order who were seeking enlightenment tracked a sand demon out into the deserts to anoint themselves with its blood, and those Jedi who successfully returned then visited the Tusken Raiders to learn their own unique path to self-discovery."}, {"tag": "p", "text": "Several sand demons made their nest in an abandoned mining complex in the Dune Sea region in 3643 BBY, when they were drawn to seismic vibrations generated by the Republic's stolen Shock Drum superweapon. These sand demons were killed by a young Jedi Knight who was seeking to shut down the Shock Drum and also rescue Jedi Master Bela Kiwiiks, whom the Sith Lord Praven had left to die in front of the weapon."}, {"tag": "p", "text": "Around the same time, the Padawan Jaesa Willsaam underwent the Demon's Blood ritual by seeking out an ancient sand demon within a cave in the Shattered Basin region. With the help of an explorer named Sharack Breev, a Sith apprentice later retraced Willsaam's steps during the Sith's search for Willsaam, neutralizing the beast and performing the ritual. Around 3638 BBY, a sand demon was affected by a Seed of Rage, a Sith alchemical artifact planted in the northern reaches of the Dune Sea, and it underwent significant physical changes. The sand demon developed gray-black growths on its body, while the beast's eyes turned red, and its skin became covered in red energy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The sand demon was first introduced in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011. The creatures appear in the Jedi Knight-class mission \"The Sand Demon's Lair,\" in which the player must fight through several sand demons to reach the Shock Drum in the next chamber. Players can also choose to sacrifice the family of the Jawa Brrik in order to eliminate some of the sand demons, which results in dark-side alignment points. However, as a Republic character, the Jedi Knight is assumed to only choose the light-side options, so this article likewise assumes that the Knight did not sacrifice Brrik's family."}, {"tag": "p", "text": "The sand demon's appearance is virtually identical to the lylek, a predator from Ryloth, though the lylek features a number of tentacles. However, two lylek mini-pets were introduced to The Old Republic in March and April 2013, and the pets utilize a recolored sand demon model to represent a lylek, though both lack the tentacles that distinguish the lylek from the sand demon."}, {"tag": "p", "text": "Another sand demon appears in the Sith Warrior-class mission \"Demon's Blood,\" in which the player performs the Demon's Blood ritual. Depending on the choice made, the player gains either light or dark alignment points or none at all. If the player outright attacks the beast or subdues and then kills it, the player will gain dark alignment points. If the player subdues the beast and waits for it to shed, the player will gain light alignment points. If the player fails to subdue it, no alignment points are given. The game's text files reveal that the sand demon in the Sith Warrior storyline was originally planned to be a krayt dragon; the conversation file for the confrontation with the creature is labeled \"ancient_krayt_dragon.txt.\" \"Sand Demon\" is capitalized within the game, though the 2012 reference guide Star Wars: The Old Republic Encyclopedia, which gives additional information on the creatures, does not. A sand demon also appears in the game's first digital expansion, Rise of the Hutt Cartel, in which a sand demon is under the influence of a Seed of Rage on Tatooine. Sand demons can also be summoned as combat companions in the \"Done and Dusted\" Uprising in Update 5.1 of the Knights of the Eternal Throne expansion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}