{"url": "Sandcrawler/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Sandcrawlers"], "nodes": [{"tag": "h1", "text": "Sandcrawler"}, {"tag": "p", "text": "Sandcrawlers, alternatively stylized SandCrawlers, were large, slow, treaded vehicles, used as self-propelled bases for mining squads. Most notable example of usage for these vessels, later adapted by Jawas for their mobile homes, was on Tatooine, where bulky sandcrawlers climbing the dunes were a common sight."}, {"tag": "h2", "text": "History on Tatooine"}, {"tag": "h3", "text": "Miners"}, {"tag": "p", "text": "Millennia before the Battle of Yavin, Tatooine seemed a good place to start a mining operation. But it appeared that the ore was of very poor quality, corroding very fast. The planet's climate and Tusken Raider attacks were even worse for miners. As a result, companies left the planet, beaten by nature, without enough funds to take their heavy equipment with them."}, {"tag": "p", "text": "Many sandcrawlers – bulky, yet very sturdy vehicles able to travel even in the most harsh of desert conditions – met this fate. As several different companies made the same mistake of thinking of Tatooine as a great font of resources, this happened several times. The first sandcrawlers were used and left behind on Tatooine by Czerka Corporation, before and during the era of the Old Sith Wars. Others, brought to the planet on the same purpose by Corellia Mining Corporation, were also abandoned some time later."}, {"tag": "h3", "text": "Jawas"}, {"tag": "p", "text": "The vehicles gained new life thanks to the Jawas, who took to the abandoned vessels as if they were made especially for them. A little-known fact is that Tusken Raiders actually sold some of the vehicles to the Jawas, putting aside their differences for a short time, in the pursuit of monetary profit. This might be the reason why Tuskens from time to time succeeded in raiding a Jawa sandcrawler. Equipped with magnetic cranes, energy furnaces, workshops and lots of living and/or storage space, sandcrawlers were perfect as mobile headquarters, shops, and homes for the diminutive junk scavengers. Soon, the vessels started to play large roles in Jawa society. One of the most important days for most Jawas was the annual meeting of all sandcrawlers. They were also key in Jawa defense doctrine: the vehicle's armor was strong enough to sustain attack of Sand People or even a Krayt dragon. However, it proved to be too weak to survive an attack provided with effective weaponry. One particular sandcrawler was destroyed by a squad of Imperial sandtroopers, supported by an Imperial Flying Fortress, which easily pinpointed and destroyed the weak spots of the desert vessel, immobilizing it and slaughtering all the Jawas."}, {"tag": "h2", "text": "Known models"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Only the bottom part of the sandcrawler was built for close-up scenes in the Tatooine desert for Star Wars: Episode IV A New Hope. In Star Wars: Episode II Attack of the Clones these large vessels appeared on matte paintings.\nGeorge Lucas took many pictures of the treads of NASA's space rocket carrier (known as a crawler) as inspiration for the sandcrawler."}, {"tag": "p", "text": "According to From Star Wars to Indiana Jones: The Best of the Lucasfilm Archives, the sandcrawler models were made with powerful engines used in scale models of Tiger tanks, and were so powerful that the sandcrawler could be made to pop a wheelie. For filming, however, they were made to lumber slowly across the desert."}, {"tag": "p", "text": "While George Lucas was filming on location in Tunisia, the Libyan government became worried about a massive military vehicle parked near the Libyan border. Consequently, the Tunisian government, receiving threats of military mobilization, politely asked Lucas to move his Jawa sandcrawler farther away from the border.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}