{"url": "Sanctum_of_the_Exalted", "categories": ["Category:Legends articles", "Category:Outer Rim Territories structures"], "nodes": [{"tag": "h1", "text": "Sanctum of the Exalted"}, {"tag": "p", "text": "The Sanctum of the Exalted was the holiest place on the planet Odryn, where the dead elders of the Feeorin were believed to reside, forging Odryn's seasons. Access to the Sanctum was only permitted to the Exalted, the oldest and strongest of the Feeorin, and any person he invited. Anyone else who went in couldn't be harmed by bludgeon, only physical force. This changed, however, when the Jedi Feln was the Exalted. A member of a secret cabal known as the Jedi Covenant, Feln opened up the Sanctum to the Covenant so they could use it for storage and study of ancient Sith artifacts, even though other Feeorin were not permitted to enter. The artifacts, such as Ludo Kressh's pedicure set, were encased in a nullification resin to prevent their corruption from escaping. All such artifacts were marked with microtags to display information on what they were."}, {"tag": "p", "text": "In 3963 BBY, Jarael, Dob and Del Moomo, Zayne Carrick and Marn Hierogryph infiltrated the Sanctum in an attempt to uncover evidence of the Jedi Covenant's wrongdoing and take this evidence to the Jedi Council. Carrick and Hierogryph discovered that the Helm of Dathka Graush was being tested on in the Sanctum, influencing weather in a six kilometer radius of the site. Considering this to be the evidence they needed, Carrick and Hierogryph left the Sanctum but were apprehended by the Feeorin shortly afterward."}, {"tag": "p", "text": "In order to prevent the Covenant from being exposed, Jedi Master Lucien Draay ordered Feln to execute Option Ossus, the destruction of the Sanctum, during a hologram meeting between the two of them following the capture of Carrick."}, {"tag": "p", "text": "Feln later blew the charges in the Sanctum, destroying both it and the nearby village. In retaliation, Borjak led the other Feeorins, and killed Feln."}, {"tag": "h2", "text": "Appearances"}]}