{"url": "Sands_of_Jakku", "categories": ["Category:Real-world articles", "Category:Star Wars: Forces of Destiny episodes"], "nodes": [{"tag": "h1", "text": "Sands of Jakku"}, {"tag": "p", "text": "\"Sands of Jakku\" is the first episode of the first season of the animated micro-series Star Wars: Forces of Destiny. It first premiered online on Disney's YouTube channel on July 3, 2017. The episode takes place during Star Wars: Episode VII The Force Awakens after BB-8 is rescued by Rey."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Rey fends off a creature that wants to devour her new friend, BB-8."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After rescuing BB-8 from Teedo, Rey and BB-8 head towards her home, as a nightwatcher worm watches them on their journey. BB-8 notices it and points it out to Rey, who first orders BB-8 not to move, but after the worm moves towards them, she changes her mind and tells BB-8 to run. The worm jumps out of the sand in front of Rey and tries to eat her, however Rey shoves her quarterstaff into the worm's mouth, so it can't close it. As they hurtle away from it, the worm launches the staff to them, yet Rey catches it with her right hand. The nightwatcher worm then buries itself back in the sand and proceeds to crawl towards them again. BB-8 is snatched between the worm's teeth when it out of the blue leaps out only to go back underground. Rey then follows its trail, so she can throw her quarterstaff at the worm to uncover it, spitting BB-8 out in the process. Rey catches him and runs up the All Terrain Armored Transport to safety. When she takes note of the nightwatcher worm still being hungry, she sacrifices some scrap metal on the walker to feed it."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "BB-8 asks Rey how she was able to find him when the worm had captured him under the sand. She replies that she doesn't know, and she must have \"just been lucky\", foreshadowing the eventual reveal that Rey is Force-sensitive."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}