{"url": "Bakura_Imperial_Prison", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Bakura sector", "Category:Galactic Empire prisons", "Category:Galactic Empire space stations", "Category:Outer Rim Territories space stations"], "nodes": [{"tag": "h1", "text": "Bakura Imperial Prison"}, {"tag": "p", "text": "The Bakura Imperial Prison was a detention center orbiting the Outer Rim planet of Bakura. The facility seemed to have two large solar sails and rotated fairly quickly. The Rebel Alliance raided the station in 3 ABY to rescue prisoners."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Bakura Imperial prison was a heavily-armed space station with numerous turbolasers ready to strike any intruder coming in too close."}, {"tag": "p", "text": "Apart from the turbolaser defenses, endless numbers of TIE fighters patrolled the surrounding space all the time. There were also docking bays for Imperial transports who frequently arrived with new prisoners. Aside from the docking bays for Imperial Transports, there was also at least one external holding area for various TIES at the facility, including TIE/sa Bombers."}, {"tag": "p", "text": "There were some exposed girders on the top \"wheel\" of the space station, hinting that the station was still under construction by 3 ABY or otherwise was undergoing repair work."}, {"tag": "h2", "text": "Raid at Bakura"}, {"tag": "p", "text": "In 3 ABY, with the Rebel Alliance loss at the Battle of Hoth, some scientists were found on the ice-covered planet. Because of their loyalty to the Rebellion, they were arrested by the Empire and sent here."}, {"tag": "p", "text": "Some time after the event, Rebel General Crix Madine made up a plan to rescue the scientists, and Wedge Antilles along with Rogue Squadron were sent to the Bakura system. Upon arrival, Imperial transports were departing the station with the scientists. Wedge, however, stopped them from escaping with his ion guns. Rebel evacuation transports arrived and although the Imperial starfighter defenses repeatedly attacked, and an unknown Imperial vessel managed to destroy the third transport that was escaping with the prisoners, the battle ultimately became a victory for the Rebels. Because Hobbie was shot down shortly after retrieving the second batch of prisoners and Wedge Antilles' X-Wing not having room for two, the latter had to steal a TIE bomber from the prison in order to have the vehicle necessary to rescue Hobbie."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to the Rebel Strike audio commentary, the orbiting prison station was created from a rough sketch based on several sci-fi movies, and then rendered to be more similar to something from the Star Wars universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}