{"url": "Sandwind_Team_(Tatooine)", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic military units"], "nodes": [{"tag": "h1", "text": "Sandwind Team  (Tatooine)"}, {"tag": "p", "text": "Sandwind team was an undercover group in the Alliance to Restore the Republic, which was active on the planet Tatooine."}, {"tag": "p", "text": "This eleven-member team coordinated the Rebel activities in all of Arkanis sector from a farm on Motesta, Tatooine. The team was led by Sandwind leader N'tain Xalis and included agents Carlio and Swanze, plus eight more permanent members. It also used contacts and unofficial foster agents."}, {"tag": "p", "text": "Xalis would have liked a certain stillness to perform his duties, and this is why he chose Tatooine as his headquarters. He eventually discovered that Tatooine was not as quiet as he would like: The search for the Death Star plans and the hunt of Adar Tallon almost led to the discovery of the Sandwind team."}, {"tag": "p", "text": "The Sandwind eventually found a personal nemesis on the Jundland Banshee, a lonely but dangerous Tusken Raider. With no particular reason, the Banshee performed several acts of vandalism, such as the destruction of Sandwind communication sub-anchors three and twelve. The Banshee's attacks to farmers could even attract the Galactic Empire's attention, which could easily led to Sandwind being discovered. Although both Carlio and Swanze witnessed the Banshee (on Beggar's Canyon and Nomad Gulch respectively), none of them could stop him."}, {"tag": "p", "text": "For a time, leader Xalis had to go to Elus sector, and was temporarily replaced by Rebel officer Adazian Liebke, who had some problems with the Banshee. Xalis also helped hiding Rebel agent Tay Vanis from Moff Murquan. By doing so, Sandwind won two new, influential friends."}, {"tag": "p", "text": "Xalis eventually wrote a report about the Banshee for The Task Force on Alliance Security, with the support of friends Liebke and Vanis. Vanis proposed sending a Rebel combat team disguised as farmer-hired bounty hunters."}, {"tag": "h2", "text": "Sources"}]}