{"url": "Sando_aqua_monster/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Aquatic creatures", "Category:Carnivorous creatures", "Category:Creatures of Naboo", "Category:Mammals", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Sando aqua monster"}, {"tag": "p", "text": "The sando aqua monster was the largest carnivorous aquatic mammal living in the oceans of Naboo. Little was known about these giant creatures, and there were many myths and legends regarding their origins and habitats. What little was known about them terrified researchers as well as Naboo citizens and denizens across the galaxy."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The sando aqua monster had a long, sinewy body that was almost feline in appearance, with hind legs used for movement on the ocean floor and massive finned claws to propel it through the water. Lacking a layer of fat or blubber, it was poorly streamlined, and not fully adapted to swimming. Males could reach over 200 meters in length, with females being at least 150 meters in length. Being mammalian, females nursed their young for about a year. Females bore only one pup per birth. The average lifespan of a sando was thought to have been 100 standard years, although their elusiveness made any accurate study difficult. In order to maintain their large size sands had to constantly eat anything in their path. Because decent-size prey is so scarce, the Sando aqua monster is a lethargic and sluggish animal most of the time, spending 90% of the day lying dormant and motionless.[source?]"}, {"tag": "p", "text": "Their limbs were part flippers, part claws; scientists theorized that they had only recently evolved from land-based ancestors. Some believed the large, bulbous organ located toward the end of the sando's tail to be a possible remnant of life on land, though the exact function of the organ is unknown. There were even reports of sando monsters surfacing in swamp lakes and attacking falumpaset and fambaa herds, and unsubstantiated reports of them sunning themselves on sandbars. Unsurprisingly, scientists failed to observe their eating habits, or how the beasts sustained their gargantuan bulk. The sando life cycle was a mystery, as they were dangerous, although reclusive, predators. When it spots it's prey, the sando gets close to it quickly, then opens its large mouth, letting out a roar before biting down. If the prey is small, the sando will swallow it whole. If the prey is large, the sando would either bite it in half or physically tear it in half to stop it from escaping. To most natives of Naboo, sando aqua monsters were more of a myth than an actual creature, mainly because they had never been observed in the wild and reports of their washed-up carcasses were rare."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "According to Gungan mythology, enchanted Sando aqua monsters guarded the underwater city Ossorus, the residence of the guds."}, {"tag": "p", "text": "Reports of a sando's washed-up corpse were rare, though Lieutenant Quarsh Panaka of the Royal Naboo Security Forces encountered a beached sando youngster prior to the Invasion of Naboo. It had been attacked by two opee sea killers, and it had surfaced, revealing a secret facility run by a man nicknamed Veermok. The incident was covered up, and the area destroyed."}, {"tag": "p", "text": "While attempting to reach Theed during the Invasion of Naboo, Qui-Gon Jinn, Obi-Wan Kenobi, and Jar Jar Binks encountered an opee sea killer in their Bongo. The opee had used its purple prehensile tongue to capture the submersible and pulled it into its mouth. A sando then came around the corner and saw both the fish and sub. It licked its teeth with its beige tongue and opened its mouth, letting out a massive roar before it bit down on the opee, missing the sub. The sando munched on the fish as it feebly tried to escape. Having enough of its unwilling prey, the giant monster stood on its legs and tore the fish in half and devoured it, giving the Jedi time to flee deeper into the planet's core. But the sando saw its dinner escaping and pursued them to a cave. In the cave, they found themselves being pursued by a colo claw fish, but the sando appeared at the cave beginning to block it. It opened its mouth and let out a low roar, preparing to devour the sub but it went upwards. Then the sando saw the claw fish attempting to go around it but the sando turned the same direction it was going. The monster bit down on the claw fish, while the sub escaped the sando's appetite, the claw fish didn't as it was devoured whole in the monster's powerful jaws."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}