{"url": "Sanval", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Flying creatures", "Category:Reptiles", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Sanval"}, {"tag": "p", "text": "Sanvals were a species of reptile. They each had a set of four large wings, muscular shoulders, long muscled tails and long claws. Their faces featured a long forked tongue, and they smelled of soil and swamps. The reptile moved through the air as if it was water and they could make soft hooting noises, thunderous growls, and loud roars. A sanval adolescent, its mother and the mother’s sibling were held in the Lonisa City Zoo on Valo in 231 BBY. During the Nihil’s attack on the city, the zoo animals escaped and the sanvals were intercepted and commandeered through use of the Force by Ty Yorrick and Elzar Mann to help defeat the Nihil."}, {"tag": "p", "text": "However, Yorrick took her sanval and used both it and the adolescent to help Zeen Mrala find Jedi Padawans Ram Jomaram and Lula Talisola. The mother was then taken by the young Force-sensitives to Crashpoint Tower. Padawan Talisola took to riding the sanval alone as her friends jumped down to free the Tower from an infestation of Drengir. She did not know what Yorrick had told the sanval, but sensed that the reptile hungered for chaos, destruction, and explosions. She calmed her, helping the pair avoid a trap. The giant reptile then assisted in destroying numerous Nihil vessels. Elzar Mann and Ty Yorrick, meanwhile, also used their sanvals to do considerable damage to the Nihil forces. Once the crisis had passed, all three reptiles were kept together in a temporary enclosure."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sanvals were mentioned simultaneously in The High Republic: Race to Crashpoint Tower, a novel by Daniel José Older, and The High Republic: The Rising Storm, a novel by Cavan Scott, both of which were released on June 29, 2021."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}