{"url": "Sanyassa_IV", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Moddell sector planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Sanyassa IV"}, {"tag": "p", "text": "Sanyassa IV was a terrestrial planet located in the Outer Rim Territories' Moddell sector. A forested world, Sanyassa was home to the barbaric Sanyassan species, who were governed by a kleptocracy. The Sanyassans' technology was mostly on a feudal level until they discovered others with spaceflight technology, which they stole and used for themselves, attacking starships all over the Moddell sector."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Sanyassa IV was a stormy, terrestrial planet located in the Sanyassa system in the Moddell subsector, one of the subsectors making up the Inner Zuma Region within the Outer Rim Territories' Zuma sector. It lay on the hyperlane known as the Bakura Trace. Sanyassa IV had a Type I breathable atmosphere and standard gravity. Its terrain included forests, plains, and savannas, and it had 24-hour long local days and 389-day long years. Sanyassa was populated by 1 billion Sanyassans, was governed by clans, and had no major imports or exports."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The history of the native Sanyassan species went back millennia and hinted at a time when society was more advanced than what it came to be: a lawless world where those who were strong came to power. This kleptocratic government existed during the time of the Old Republic, the Rebellion, and the New Republic."}, {"tag": "p", "text": "Though the Sanyassans occasionally pursued farming and limited trade on their home planet, they were more accustomed to war with blades and blasters. The world was fought over by the Sanyassans who lived there. A group of Sanyassans known as the Marauders once became shipwrecked on the Forest Moon of Endor. The xenobiologists of the New Republic would later debate over the origin of Endor's Marauders."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Sanyassa was the homeworld of the Sanyassans, a race of leathery-skinned Humanoid warriors. Some of the Ayrou species theorized that the Sanyassans had been particularly susceptible to the Din supernova of 5000 BBY, which caused radiation that they never recovered from. The Sanyassans spoke a language of the same name, and they used technology that was mostly on a primitive, feudal level, though they did have some space technology that they stole from others."}, {"tag": "p", "text": "They enjoyed using their newfound secrets of spaceflight to prey on the peaceful Ewoks of Endor, who were quite frightened by the Marauders. Indeed, the Sanyassans used scavenged starships to attack anyone they wished in the Moddell sector, stealing new technology all the while. They were also hired out as thugs and bodyguards by those who wished to take advantage of the Sanyassans' barbarous nature."}, {"tag": "p", "text": "The Sanyassans had been causing trouble in the Outer Moddell systems for nearly as long as the neighboring Zorbians, another band of pirates native to the nearby planet Zorbia III, and they were famous for their strength, temper, and lack of deep thought. Most of the 1 billion Sanyassans on the planet longed to visit the stars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sanyassa IV was first mentioned in the article \"Endor and the Moddell Sector,\" which was authored by Craig Robert Carey, Daniel Wallace, and Jason Fry, and was published in Star Wars Gamer 9 on February 22, 2002. The 2009 reference book The Essential Atlas placed the planet in grid square H-16."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}