{"url": "Sar_Labooda/Legends", "categories": ["Category:Legends articles", "Category:Chalactans", "Category:Females", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Sar Labooda"}, {"tag": "p", "text": "Sar Labooda was a female Chalactan Jedi Knight who lived during the waning years of the Galactic Republic. She was the sister of Jedi Master and Council member Depa Billaba."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sometime after Sar Labooda's birth, her family left their homeworld, Chalacta, in order to search the stars for a new home. While traveling, the family's transport was attacked and boarded by a band of pirates. With both her parents dead, Labooda and her sister were at the mercy of the scoundrels until, by chance, the esteemed Jedi Master Mace Windu appeared and slew the attackers. Discovering the two infants to be Force-sensitive, Windu took them to the Coruscant Jedi Temple, where they were given new names and placed into a clan with other Jedi Initiates. Growing up separately from each other, both girls passed through the Temple academy after completing their Trials. Ready to become an apprentice, Labooda was selected by a Master to become an apprentice and travel the galaxy as she continued to study the ways of the Jedi. Crafting for her own use a green-bladed lightsaber and excelling in Form VI of lightsaber technique, she eventually passed her Trials of Knighthood and was made a Jedi Knight by the High Council."}, {"tag": "p", "text": "When the Separatist Crisis threatened to tear the Galactic Republic in two, Jedi Labooda decided to stand with Senator Yudrish Sedran of her homeworld in opposition to the Military Creation Act that proposed the creation of a Grand Army of the Republic to combat the threat of the Confederacy of Independent Systems. As the act went before the Galactic Senate for a vote, the Confederacy's leaders captured Jedi Obi-Wan Kenobi and Anakin Skywalker and the senator of Naboo, Padmé Amidala, on Geonosis and sentenced them to death by execution. Answering Master Windu's call to form a massive strike team to rescue the Jedi and Senator, Labooda was one of 200 Jedi to storm the Petranaki arena and engage the Separatist Droid Army. However, her Form VI technique proved insufficient, and she did not survive the ensuing battle."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like her sister, Depa Billaba, Sar Labooda was considered one of the most insightful Jedi of her time. She was very peaceful and was against war."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Labooda was a practitioner of Niman and used a green lightsaber. Like many of the Niman users fighting in the First Battle of Geonosis, she did not survive."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character who eventually took the name Sar Labooda was actually intended to be Depa Billaba, using a replacement actress when Dipika O'Neill Joti could not reprise the role. However, the \"new\" Depa looked dissimilar enough to warrant the creation of a new character. Due to this, one of the Jedi in Star Wars: Galactic Battlegrounds: Clone Campaigns present at the Battle of Geonosis is incorrectly identified as Depa Billaba. A similar incident happened with Agen Kolar and Stass Allie, originally intended to be Eeth Koth and Adi Gallia, respectively."}, {"tag": "p", "text": "The Jedi Master Coleman Trebor was also originally named Sar Labooda."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}