{"url": "Sarcev_Quest", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:AgriCorps members", "Category:Emperor's Hands", "Category:Fallen Jedi", "Category:Humans", "Category:Imperial Inner Circle members", "Category:Interim Ruling Council members", "Category:Jedi Purge survivors", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Sith acolytes and apprentices"], "nodes": [{"tag": "h1", "text": "Sarcev Quest"}, {"tag": "p", "text": "Sarcev Quest was a Human male who served as one of the Emperor's Hands, an elite cadre of Force-using agents answerable only to Galactic Emperor Palpatine. As a young man, Quest was a member of the Jedi Order, but did not continue on the path to knighthood, instead being assigned to the Agricultural Corps. It was there that he was personally discovered by then—Supreme Chancellor Palpatine. Quest began to work secretly for Palpatine on a variety of projects, becoming known as the \"Chancellor's Hand\". When the Republic transitioned into the Galactic Empire, with Palpatine as the new Emperor, Quest became a noted member of the Imperial Court, eventually becoming accepted into the Imperial Ruling Council. In this capacity, he was also able to spy on Palpatine's political enemies. However, when Palpatine died in the Battle of Endor, Quest seized his opportunity to take power. He manipulated the Ruling Council into supporting the Force-sensitive Royal Guard Carnor Jax as a new leader, gaining a great deal of political power in the process."}, {"tag": "p", "text": "When Palpatine returned in 10 ABY, resurrected through the use of a series of clone bodies, Quest returned to his service, but maintained his own loyalties. He had grown fond of the power that he had acquired before Palpatine's return and resolved to eliminate his former master. Using funds obtained from traitorous elements within the Ruling Council, Quest and Jax bribed the Emperor's personal physician to sabotage Palpatine's clones, decreasing their lifespan and accelerating the Emperor's death. With Palpatine gone, Quest and Jax quickly seized power, but their rule was short-lived. Jax was killed by the loyalist Kir Kanos as revenge for his role in Palpatine's death, and without Jax's support, Quest was thrown out of the Ruling Council and went into hiding to avoid loyalist Imperials seeking revenge. In 23 ABY, Quest was captured by bounty hunter Ailyn Vel who turned him over to another former Emperor's Hand Jeng Droga, in exchange for a 100,000 credit bounty. Droga personally executed Quest for his role in the Emperor's death."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A Force-sensitive, Sarcev Quest entered the Jedi Order but failed to continue on the path to knighthood, being assigned to the Agricultural Corps. However, Quest was discovered by Galactic Republic Supreme Chancellor Palpatine who pulled Quest away from his career as a farmer. Quest became Palpatine's loyal servant, becoming known as the \"Chancellor's Hand\". He was not often seen at Palpatine's side, spending a considerable amount of time on the Deep Core world of Byss. Working alongside another of Palpatine's servants, the Umbaran Sly Moore, Quest trained other Force-sensitives who had been recruited from the AgriCorps. Quest and Moore worked to turn these individuals to the dark side of the Force, building a force of darksiders for their master. Around this time, Chancellor Palpatine engaged the services of the Shi'ido scientists Mammon Hoole and Borborygmus Gog in secret experiments involving the spontaneous generation of life. Their first attempt was rumored to have had less than ideal results—Niobi, a female subject obtained by Sly Moore, gave birth to a three-eyed mutant. Mother and son were quickly spirited away by Quest."}, {"tag": "p", "text": "Some time later, Palpatine declared himself Emperor and transformed the Republic into the Galactic Empire. Quest was placed into the newly formed Imperial Intelligence and recruited into a special Intelligence program that was secretly watched over by Palpatine himself. This program provided individuals with Force training and groomed the members to become an Emperor's Hand, elite dark side users that reported directly to Palpatine. Quest graduated from this program and joined the ranks of that elite group. As Palpatine's servant, Quest became a prominent member of the Imperial Court, wearing expensive clothes and building a reputation as a playboy. However, Quest's court persona was a cover for his other work for Palpatine, spying on his master's political enemies. Among those that Quest kept tabs on were Senator Seti Ashgad and Moff Fliry Vorru. As a member of the Imperial Court, Quest became associated with one of Palpatine's concubines, Roganda Ismaren. He and Ismaren conceived a child together, which forced Ismaren to abandon the Imperial Court and work to become an Emperor's Hand. Quest and Ismaren's son, Irek was strong in the Force, and his mother concealed his true heritage, letting others assume that her son was Palpatine's offspring. These rumors, which hid Quest's connection to her son, allowed Ismaren to groom Irek as a possible heir to the Imperial throne. Despite impregnating one of Palpatine's mistresses, Quest's influence in the Imperial Court steadily grew to a point where he was allowed a place on the Imperial Ruling Council, the first darksider to be accepted into its ranks. In 1 ABY, Sly Moore, who also maintained a presence in the Imperial Court, disappeared from Coruscant. The experimentation in spontaneously creating life started by Hoole and Gog had been continued by Sly Moore. Her efforts resulted in her giving birth to another three-eyed mutant. Moore died in childbirth, and just as before, Quest spirited the child away."}, {"tag": "h3", "text": "Tasariq mission"}, {"tag": "p", "text": "Shortly after the Battle of Yavin, Quest was sent to the world of Tasariq. Under the Emperor's orders, he romanced Yasinda Bardak, an Imperial Intelligence agent working undercover on the planet. Bardak was a Force-sensitive woman who had dropped out of an Imperial program that was grooming her to become an Emperor's Hand, due to her belief that the Force did not exist. However, despite dropping out of the program, the Emperor had further designs for Bardak and assigned Quest to get close to her. Tasariq was home to a variety of Force-sensitive crystals which could grant a form of Force-sensitivity to those that owned them."}, {"tag": "p", "text": "The Emperor was interested in the powers of these crystals and was curious to see the effect they could have on a Force-sensitive individual who refused to acknowledge their abilities. After romancing Bardak, Quest gave his lover a pendant that secretly contained one of the Tasar crystals. Bardak began to exhibit Force powers that she could not control, and Quest checked in on her every few months to evaluate the impact of the crystal and continue the Emperor's experiment. Although Bardak attempted to be reassigned to a different planet, frightened by her strange new abilities, her requests were denied as Quest and Palpatine continued the experiment. Although Bardak truly fell in love with Quest during this experiment, Quest did not return her affections, only maintaining the relationship to examine the effects of the Tasar crystals."}, {"tag": "h3", "text": "Political machinations"}, {"tag": "p", "text": "In 4 ABY, Emperor Palpatine was killed in the Battle of Endor. The resulting power vacuum from his death saw the Imperial Ruling Council attempt to take control of the Empire. However, Quest sabotaged their efforts, aiding Grand Vizier Sate Pestage in consolidating power over the Empire. Pestage eventually decided to abandon the Empire and retreat to the Deep Core world of Byss to concentrate on dark side experimentation. He left a clone behind to maintain order, but the rapid gestation of the Pestage clone caused the copy to become insane. Unable to deal with the mad Pestage clone, Quest withdrew his support, leaving the clone to the Imperial Ruling Council and Imperial Intelligence director Ysanne Isard, resulting in the clone's death. Quest assumed that the true Pestage would contact him, but when he failed to do so, Quest allied himself to a member of the Emperor's Royal Guard, Carnor Jax. Jax was Force-sensitive with ambitions towards the Imperial throne, and Quest threw his support behind him, convincing the Imperial Ruling Council to support Jax as the new Imperial leader. Quest's partnership with Jax also involved teaching the Royal Guard new Force powers, and granting him control of a military taskforce. Quest's actions in supporting Jax gained him the favor of the Royal Guard and nominal leadership over the Council, elevating him to the height of his power."}, {"tag": "p", "text": "However, Quest and Jax's designs for the Empire were interrupted by the return of Emperor Palpatine in 10 ABY. Palpatine's spirit had survived his death at Endor, and he was able to insert his essence into a clone body. Quest immediately realigned himself with his revived master and helped Jax infiltrate himself into Palpatine's Dark Empire. With Quest's support, Jax was promoted into the Sovereign Protectors, the highest rank of the Royal Guard. However, Quest held no loyalty for Palpatine, as he was reluctant to give up the power that he and the Imperial Ruling Council had gained before his master's return. Quest and Jax designed plans to sabotage Palpatine's clone bodies and kill the Emperor. The Council gave Quest and Jax enough credits to bribe the Emperor's physician, who agreed to sabotage the clone template. Quest and Jax's machinations accelerated the death of the Emperor, paving the way for their ascendance."}, {"tag": "h3", "text": "Downfall"}, {"tag": "p", "text": "With Jax as the new leader of the Empire, Quest took full control over the Ruling Council, solidifying his power over the other members and imprisoning those who opposed him. Under Jax's protection, Quest was free to exert his power, but his reign was short lived. Emperor Jax was killed in a duel with Kir Kanos, a Royal Guard seeking revenge for Jax's involvement in Palpatine's death. Without Jax, Quest's hold over the council was broken, and the other council members imprisoned him. Following a week of torture, Quest was unceremoniously dropped on the Smugglers' Moon, Nar Shaddaa, completely stripped of his power and influence."}, {"tag": "p", "text": "Without any allies, Quest attempted to disappear. Outed as a member of the conspiracy that had helped accelerate Palpatine's death, he was wanted by loyalist Imperials, hoping to enact revenge. The New Republic also had interest in Quest, hoping to bring him in for questioning. One Imperial loyalist, a fellow Emperor's Hand, Jeng Droga, placed a bounty of 100,000 credits on Quest's head. He spent years in hiding, returning to the Core Worlds. In 23 ABY, and on the edge of senility, Quest decided to make his way to a more remote location and purchased tickets aboard a luxury liner for a trip to the Corporate Sector. However, the alias Quest used to obtain passage aboard the ship, despite being scarcely used, revealed his location to those that were searching for him. The bounty hunter Ailyn Vel, assuming the Mandalorian armor and identity of her biological father Boba Fett, reached Quest first and claimed the bounty placed by Droga. Dragged before the vengeful Emperor's Hand, Sarcev Quest was personally executed by the fanatical Droga."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Shortly following his death, Quest's executioner was killed in the Third Battle of Yavin, dwindling the ranks of those who had been the Emperor's Hands. Following his death, the Jedi Master Luke Skywalker kept information on Sarcev Quest in his information database of Force-sensitives. Quest's son Irek continued to live with his mother, who maintained that her son was Palpatine's heir, although her claims were doubted by some, such as Leia Organa Solo, and Quest's parentage of Irek was included in Skywalker's database entry on Irek. Irek and his mother survived the death of the Empire and were present on Coruscant in 27 ABY during the Yuuzhan Vong War. Irek was badly wounded in a clash with another Emperor's Hand, Cronal, while being stabbed in the head with a lightsaber. Robbed of his intellect, Irek killed his mother. and went on a rampage before being defeated by a taskforce led by Luke Skywalker."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Sarcev Quest was Force-sensitive and was recruited into the Jedi Order. However, he eventually failed out of the order and joined the Agricultural Corps. Upon being noticed by Palpatine, he was elevated to the status of Emperor's Hand, receiving training to make him a powerful dark side user. Quest was talented enough that he was put in charge of training other AgriCorps members in the Force, helping to turn them to the dark side. He owned a short lightsaber and a heavy blaster pistol and was able to use them proficiently."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sarcev Quest was a handsome and charismatic individual who used his charms to get what he wanted. While working for Palpatine, he used his natural wiles to build respect and influence in the Imperial Court. This influence would eventually allow him to infiltrate the Imperial Ruling Council, the first darksider to ever accomplish this. As Palpatine's servant, he was known as the \"Chancellor's Hand\", and was involved in secret experiments carried out by the Supreme Chancellor. Although indebted to Palpatine for rescuing him from the Agriculture Corps, Quest did not maintain his loyalty when Palpatine returned in a clone body. As a member of the Ruling Council, he took advantage of the power vacuum following Palpatine's death at Endor and resented losing this power when Palpatine returned. This caused him to take part in the plot to sabotage Palpatine's clone bodies, leading to the Emperor's final death. However, this betrayal would eventually lead to his downfall as loyalist Imperial Jeng Droga executed him to avenge Palpatine's death."}, {"tag": "p", "text": "While presiding over the Ruling Council, Quest was a ruthless leader, imprisoning those that would oppose him. His cruel behavior caused him to be immediately turned on when his ally, Carnor Jax, was killed. His control over the council immediately evaporated, and he was tortured as revenge for his behavior as head of the council. While being tortured, Quest's composed demeanor was shattered as he screamed in pain. Quest had a reputation as a womanizer in the Imperial Court, and he formed a relationship with one of Palpatine's concubines, Roganda Ismaren, fathering a child with her. During his mission to Tasariq, he was successful in seducing Yasinda Bardak, causing her to fall deeply in love with him, despite only seeing her every few months. Quest had gray hair and light skin and was able to speak and write High Galactic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sarcev Quest first appeared, albeit unnamed, in Tasariq: The Crystal Planet, a role-playing supplement in Star Wars Adventure Journal 15 by Tom Moldvay and Steve Miller. The unnamed character was only mentioned in relation to the character of Yasinda Bardak, but stated that he was a member of Imperial Intelligence and had gone through secret training to become an Emperor's Hand. An illustration by Jeff Menges of the character romancing Bardak was included in the article. This unnamed character was eventually used by Abel G. Peña in his article, The Emperor's Pawns in Star Wars Gamer 5 which detailed several different Emperor's Hands. The illustration of the character in Tasariq: The Crystal Planet was used as a reference for the illustration by Joe Corroney of Quest used in The Emperor's Pawns. The character was again used by Peña in his article, The History of the Mandalorians in Star Wars Insider 80 which detailed the character's final fate and death. More detail on Quest's character was given in two articles in the Hyperspace feature on StarWars.com, Evil Never Dies: The Sith Dynasties and Aliens in the Empire, Part 1: Hierarchy of Power. A further article by Peña on the Star Wars Blog Barely Tolerable: Alien Henchmen of the Empire also detailed Quest's early life."}, {"tag": "p", "text": "Following the expansion of his backstory in The Emperor's Pawns, Quest was mentioned in several different reference guide, including The New Essential Chronology, Jedi Academy Training Manual, and Jedi vs. Sith: The Essential Guide to the Force. The Essential Guide to the Force also pinpointed the date of Quest's death, which was not made explicit previously. In The Emperor's Pawns, it is stated that Quest betrayed the dark side councilors Nefta and Sa-Di following the final death of Palpatine. However, both characters had already been killed in Star Wars: Dark Empire II, before Palpatine's final death shown in Star Wars: Empire's End. This discrepancy has not yet been addressed."}, {"tag": "p", "text": "Sarcev Quest's name, which was taken from the IFBB pro champion and Mr. Universe Miloš Šarcev."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}