{"url": "Bakurat", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Card games"], "nodes": [{"tag": "h1", "text": "Bakurat"}, {"tag": "p", "text": "Bakurat was a deck of special cards used for divination via cartomancy. Allegedly, the art of Bakurat fortune-telling dated back to the very earliest days of the galaxy, and locked the future events it predicted in place."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "According to its practicioners, Bakurat dated back to the very earliest days of the galaxy itself. In fact, Bakurat seemed to have originated in the Byss Run, and in the days before even the rise of the Old Republic, it was already widespread in the cantinas of the Deep Core."}, {"tag": "p", "text": "Bakurat readings were popular among spacers and politicians alike, until one day a senator, unhappy with the outcome of his reading, decried it as witchery. As a consequence, Bakurat was banned, driven underground, and eventually fell into obscurity."}, {"tag": "p", "text": "In spite of the ban, however, the few remaining Bakurat readers scattered throughout the galaxy, and managed to pass on their art through the eons. By the time of the war between the First Order and the Resistance, one such teller of fortunes, a human named Mila, resided on the planet Takodana, in the castle of Maz Kanata."}, {"tag": "h2", "text": "Bakurat deck"}, {"tag": "p", "text": "Bakurat cards were shaped like irregular six-pointed stars, and bore painted images derived from colorful frescoes left behind by one of the earliest species to inhabit the Byss Run. One card bore the bent form of a man, struggling beneath the weight of a luminous star he was carrying on his shoulders. Another showed a slender woman carrying a shining sword, and sitting on a stool before an open door that appeared to look out on the depths of space. Yet another depicted  a blood moon reflected in a puddle of water."}, {"tag": "h2", "text": "Bakurat reading"}, {"tag": "p", "text": "First, three cards from the deck were dealt, laid out before the client in the shape of a galactic spiral, while the rest of the cards were taken out of sight. Before continuing any further, the reader would ask the client whether he or she truly wished to know his or her future—because allegedly, once a reading had been given, the events described would be locked in place by the universe itself, with no means or recourse to stop them. After obtaining the client's consent, the reader then turned the three cards one by one, before finally delivering an interpretation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}