{"url": "Bakuran_Senate", "categories": ["Category:Legends articles", "Category:Culture of Bakura", "Category:Legislatures", "Category:Wild Space organizations"], "nodes": [{"tag": "h1", "text": "Bakuran Senate"}, {"tag": "p", "text": "The Bakuran Senate was a democratic institution that governed Bakura and the surrounding system, located in Wild Space near the isolated edge of the Outer Rim."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The Senate consisted of forty senators, each representing a sector of the planet, as well as the prime minister (who was head of the Senate) and the various other ministers. The longest-serving senator (the 'Senior Senator') apparently was the secondary leader of the Senate, serving as the opposition leader when necessary."}, {"tag": "p", "text": "Service in the Senate was until death or resignation, and replacement senators and Prime Ministers were chosen by a vote of the Senate, as opposed to the general populace. The titular head of government was always chosen from among the descendants of Deredith Arden, the planet's founder; presumably, this \"titular head of government\" was not the Prime Minister."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Bakur Mining Corporation, shortly after Arden's death, granted the Senate its governing power. However, the corporate influences were still present: i.e., the fact that the head of government was Arden's descendant, the Senate was located in the same building as the Bakur Corporation headquarters, and many of the corporation's leading members were also senators."}, {"tag": "p", "text": "The period leading up to the Imperial occupation of Bakura (1 ABY–4 ABY) was marked by vicious partisan infighting amongst the senators, with a consensus unable to be reached even for programs as unimportant as the school calendar. This squabbling nature, combined with the fact that the Senate exercised direct control over the Bakuran military, caused the planet to fall to the Galactic Empire quicker than might otherwise be assumed."}, {"tag": "p", "text": "When the Empire annexed Bakura, many dissenting politicians were purged, and the Imperial governor assumed many of the powers of the existing government. As a result, Senate affairs ran smoother. During this time, the governor had a seat in the Senate, as its new head, although the prime and lesser ministers continued to serve, both in government and the Senate (which had been renamed the Imperial Bakuran Senate). Despite the Empire's Humanocentric policy, the two Kurtzen senators continued to serve."}, {"tag": "p", "text": "After the Invasion of Bakura and the ensuing liberation of the planet, the Bakuran Senate and its government essentially returned to the way it was before the occupation, the major difference being that, when a military was finally reinstated a decade later, the Senate no longer exercised direct control over it."}, {"tag": "h2", "text": "Senate Building"}, {"tag": "p", "text": "The Senate was located in a wing of the Bakur Memorial Building in the Bakuran capital city, Salis D'aar. The Senate chamber itself was square, with a tiled, two-story-tall ceiling. At each corner were glass pillars, self-illuminating and open to the sky at the top. The Senate was arranged so that the Prime Minister (and Imperial governor, during the occupation) sat at the front of the room; on a lower level were a pair of tables for lower-ranking senators; and lower from those were a pair of tables for ministers and senior senators. In front of the senior tables was a space for speakers to address the Senate."}, {"tag": "p", "text": "The Senate moved to the Bakuran Senate Complex following the Invasion of Bakura."}, {"tag": "p", "text": "From the era of the Clone Wars to the Yuuzhan Vong War, several members of the Captison family served in the Bakuran Senate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}