{"url": "Sarapin/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Confederacy of Independent Systems planets", "Category:Core Worlds planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Jedi planets", "Category:Volcanic planets"], "nodes": [{"tag": "h1", "text": "Sarapin"}, {"tag": "p", "text": "Sarapin was a volcanic world in the Sarapin system, between Neimoidia and the Treskov system. It had ashy soil and streams of lava flowing across its surface."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This planet became the prime energy provider for both the Galactic Republic and the Galactic Empire. Sarapin was mostly inhospitable, save for the hardy vaapad, which were known to drain the energy from prey. It also had at least two moons on which vaapad could also be found. Sarapin had ancient, mysterious Jedi ruins[source?]."}, {"tag": "p", "text": "During the Cold War, an independent space station existed in the orbit of Sarapin and stored resources on it. The space station made an emergency call and then went entirely silent."}, {"tag": "p", "text": "The Republic held large operations with the intention of harnessing the power of its many active volcanoes and lava flows. Its laser drills were an impressive sight, reaching a height of forty meters. The energy was tapped by energy collectors and moved to an Energy Collection Repository, for eventual shipment off-world. Count Dooku estimated that during the later years of the Republic, Sarapin provided 80 percent of the Core Worlds' power."}, {"tag": "p", "text": "Sarapin was protected by a near-impenetrable defensive grid, which was broken on only two occasions. The first time was during the Clone Wars, in 22 BBY, by a Confederacy of Independent Systems General, Sev'rance Tann. The Republic quickly dispatched General Echuu Shen-Jon to deal with the crisis and capture CIS officer Zian Finnis. Under Echuu's leadership, the world was recaptured."}, {"tag": "p", "text": "The second time Sarapin's defenses were breached was when Rebel forces infiltrated Sarapin before the Battle of Yavin. Grand General Malcor Brashin and Commander Brenn Tantor discovered this by analyzing Rebel data from the Ruul computer complex. They hurried to Sarapin, where Tantor led Imperial forces in their recapture of the energy collectors. After retaking them, Tantor discovered that the Rebels had seized a drilling platform, which had spiraled out of control. Tantor smashed the Rebel positions near the drill until he could get his brother Dellis, an accomplished slicer, into the drill, where he was able to shut it down before it destabilized the area and created destructive groundquakes."}, {"tag": "p", "text": "Boba Fett helped the Empire capture Kath Talor on Sarapin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Clone Campaigns expansion pack to the video game Star Wars: Galactic Battlegrounds, the pictures of Sarapin shown in the mission briefings were modified shots of Geonosis as it appeared in Star Wars: Episode II Attack of the Clones. As such, Sarapin was depicted with a rocky ring system. However, when the planet made its first appearance in Star Wars: Force Commander, it was devoid of such rocky rings."}, {"tag": "p", "text": "The game Star Wars: The Old Republic wrongly names the planet Serapin in the crew-skill description."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}