{"url": "Sarkkin", "categories": ["Category:Legends articles", "Category:Males", "Category:Space explorers", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Sarkkin"}, {"tag": "p", "text": "Sarkkin was a male Wookiee explorer active by the time the Yuuzhan Vong War broke out in 25 ABY. Partnered with Panha, Sarkkin and his companion explored the edge of the galaxy aboard their starship the Pythea, acting as the vessel's only crewmembers. When, in the first months of the year, Sarkkin received a transmission from an unknown source, he and Panha were surprised to discover a warning from an individual of a race brought almost to extinction by the invasion of a powerful species known as the Yuuzhan Vong. The two explorers discovered that they were in the path of an approaching Yuuzhan Vong fleet and together they rushed to the nearby world of Artorias in order to warn the inhabitants of the planet of the threat they faced."}, {"tag": "p", "text": "As Sarkkin and Panha raced the Pythea toward Artorias and desperately attempted to communicate with the inhabitants of the planet, the two explorers realized that to boost power to communications system and have a chance of forewarning the planet, they would have to sacrifice their chances of escaping the clutches of the Yuuzhan Vong. Just as Panha delivered the warning to Artorias, the Yuuzhan Vong boarded the Pythea and Sarkkin and his companion were forced to defend themselves. Although the two explorers defeated the entire boarding party, Sarkkin was severely wounded in the attack. Rather than face capture at the hands of the Yuuzhan Vong, Sarkkin and Panha agreed to ram an approaching Yuuzhan Vong cruiser. The Wookiee explorer died on the Pythea as it exploded against the cruiser's prow."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sarkkin was a male Wookiee who, by the opening months of 25 ABY, was exploring the edge of the galaxy with his partner, Panha. The only crewmembers of their starship, Sarkkin and Panha had a companiable relationship and trusted one another, although Sarkkin's personal hygiene was a subject of good-natured mockery between the two explorers. The Wookiee operated as the pilot of the ship, although Panha was equally capable of taking the controls."}, {"tag": "p", "text": "It was while piloting the starship during their exploration of the far reaches of the galaxy that Sarkkin detected a faint communications signal. Bringing the starship to a dead stop and checking the long range scanners to make sure there were no objects in the immediate vicinity, Sarkkin headed up a ladder to the starship's small communications center to receive the transmission. While Sarkkin attempted to boost the weak signal, Panha arrived in the bridge below and, spotting the empty pilot's chair, came looking for the Wookiee."}, {"tag": "p", "text": "Sarkkin called his companion up to the communications array, fending off her comments about his hygiene, and was able to boost the signal enough that they could watch the message together. To Sarkkin's surprise, the message was from a humanoid warrior of primitive appearance, who began recounting the customs of his native people. The unknown warrior spoke of his people's culture of warfare and martial prowess, explaining how their lives were oriented around conflict and battle. With great sadness, the warrior then went on to speak of a race known as the Yuuzhan Vong, while Sarkkin and Panha watched in silence together."}, {"tag": "p", "text": "The warrior in the message explained how despite his race's nature as warriors, the Yuuzhan Vong had wiped them out with ease, bringing them to edge of extinction. Rather than provide a warning in order that a defense could be mounted against the race, the warrior continued, the message was intended to warn others and advise that they flee the approaching threat, as attempting to combat the Yuuzhan Vong was, in his opinion, futile. As the message finished, leaving Sarkkin confused, Panha burst into action, rushing downstairs to the bridge in a panic."}, {"tag": "p", "text": "Sarkkin followed his companion down to the bridge, where Panha was rapidly operating the navigational controls. She told him to check the long range scanners; protesting that he had already done so, Sarkkin was surprised to see a vast mass out of the bridge viewport. Panha engaged the starship's engines while the two examined the object on a monitor. Sarkkin was shocked as he realized that the mass was moving on the scanners, suggesting that it was not a natural object. Panha explained that it was an armada and urgently asked Sarkkin to plot the fleet's trajectory in order to determine which inhabited planet the massive armada would reach first."}, {"tag": "p", "text": "The Wookiee explorer ran the scans and determined that the first such planet in the fleet's path was Artorias, but that the world was too far away for them to communicate a warning. Panha ignored the fact, stating that they'd have to move closer to Artorias, despite the danger Sarkkin claimed that would place them in. She revealed that her people had fought the Yuuzhan Vong before in small numbers and that they were, as the unknown warrior had recounted, an immensely dangerous enemy. Sarkkin stared at the image of the giant fleet on the monitor as the two explorers sped toward Artorias."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sarkkin was a good-humored individual who had an amicable relationship with his companion Panha. The Wookiee explorer was knowledgeable of the starship he and Panha flew and was sensible when it came to operational procedures, ensuring that the long range scanner was clear and that the starship had been brought to a halt before leaving the controls. Confused by the message and its contents, as well as by Panha's reaction, Sarkkin responded quickly and with trust to her agitated requests. When he realized that by warning Artorias he and Panha would be placed in danger, Sarkkin raised his concerns that they would be risking their lives to save the inhabitants of the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sarkkin and his fellow explorer Panha were featured in the two-part, sixteen page online preview of the Star Wars: Invasion comic series, although both characters met their deaths by the issue's end. Created by Dark Horse comics, Star Wars: Invasion proper launched in July and was set in 25 ABY during the Yuuzhan Vong War, a four year conflict that had previously been explored in Del Rey's nineteen book New Jedi Order series. The first half of the online issue was released in May 2009, and the second in June. The Wookiee Sarkkin was drawn by artist Colin Wilson and was colored by Wes Dzioba."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}