{"url": "Sarn", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Imperial Navy admirals of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sarn"}, {"tag": "p", "text": "Sarn was a Human male admiral in the Imperial Navy who commanded the Super Star Destroyer Terror around 3 ABY. The Terror was requisitioned by Grand Admiral Martio Batch to guard the development of the Galactic Empire's new cloaked starfighter, the TIE Phantom—a project Sarn hoped would help him to win Emperor Palpatine's favor. During an inspection by the Dark Lord of the Sith Darth Vader, two Rebel agents, Rookie One and Ru Murleen, infiltrated the Terror and destroyed it along with the TIE Phantom production facility on Imdaar Alpha. Vader escaped the Terror but executed Sarn for his failure before leaving."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "TIE Phantom project"}, {"tag": "p", "text": "The Human male Sarn served as an officer in the Imperial Navy during the reign of Emperor Palpatine. By 3 ABY, Sarn had reached the rank of admiral and had been given command of the Super Star Destroyer Terror. At his research station on the moon Imdaar Alpha, Grand Admiral Martio Batch was working to develop a practical cloaking device. The devices had once been common, based around stygium crystals mined from Aeten II in the Dreighton Nebula, but became rare after the mines ran dry. After a failed attempt to produce cloaking devices based on hibridium, Batch used the Empire's Tarkin superweapon to destroy Aeten II, an explosion that released thousands of stygium crystals into space. The Grand Admiral used the new supply of stygium to begin production of cloaked starfighters—modified V38 assault fighters known as TIE Phantoms. To protect his project, he had Sarn and the Terror transferred to Imdaar Alpha. Sarn saw his involvement in the project as an opportunity to win favor with the Emperor."}, {"tag": "p", "text": "Following the Imperial victory over the Alliance to Restore the Republic at the Battle of Hoth in 3 ABY, the Empire began testing the new TIE Phantoms in the region of space known as the Dreighton Triangle, using reports of unexplained events in the region ever since the Battle of Dreighton during the Clone Wars as a cover for its operations. When the Dark Lord of the Sith Darth Vader traveled to Imdaar Alpha to inspect the progress of the project, Sarn arranged a demonstration of the new fighters, dispatching Sigma Squadron to intercept a flight group of Rebel X-wings as they patrolled the Dreighton Triangle and instructing his crew to ensure that it proceed flawlessly. Observing aboard the Terror, Sarn was impressed with the performance of the fighters, which destroyed all three Rebel ships before they could respond. Vader, however, was impatient to end the testing stage and turn the TIE Phantoms loose on the Rebel Alliance."}, {"tag": "h3", "text": "Death and legacy"}, {"tag": "p", "text": "Vader remained aboard the Terror while the field tests were completed. Sarn informed him that the TIE Phantom fleet was ready for full deployment, and was ordered to take the Terror back to Imdaar Alpha. When the Rebel Alliance learned that the Terror was en route to Imdaar, it dispatched pilots Ru Murleen and Rookie One to infiltrate the Star Destroyer and steal a TIE Phantom for study. Infiltrating the supply base on the planet, the Rebel agents stole a Lambda-class supply shuttle and used it get aboard the Terror as the ship prepared to dock with the cloaked TIE Phantom factory. The intruders were soon discovered but successfully evaded capture. On Vader's orders, Sarn doubled the search patrols in an effort to locate the Rebels, but the interlopers were able to reach the hangar and board a TIE Phantom. The Rebels used their stolen fighter to attack the Terror's main reactor, causing it to overload before making their escape. Sarn's crew attempted in vain to stop the reactor from going critical while Vader ordered Sarn to undock the Terror from the TIE Phantom factory. When Sarn reported that docking controls were inoperative, the Sith Lord executed him for his failure, using the Force to telekinetically strangle the admiral."}, {"tag": "p", "text": "Vader escaped the Terror moments before its destruction. As the Star Destroyer exploded, it caused the TIE Phantom factory to become visible. The Rebels flew their stolen fighter inside and destroyed the facility, which brought an end to the TIE Phantom project. Knowing that he had failed the Emperor, Grand Admiral Batch took his fleet and fled to the Outer Rim Territories. However, his crew was still loyal to Sarn. Following the Emperor's death at the Battle of Endor in 4 ABY, Batch's crew assassinated the Grand Admiral and joined Warlord Blitzer Harrsk's splinter faction in the Deep Core."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sarn was an ambitious and conceited officer who saw his involvement in the TIE Phantom project as an opportunity to win the favor of Emperor Palpatine. He regarded the Force powers possessed by Darth Vader as mysterious. Fearful of Vader's abilities, Sarn was careful not to anger the Dark Lord. When Vader was sent to inspect the project's progress, Sarn was determined to ensure a flawless demonstration. Despite Sarn's efforts, the project was ultimately sabotaged by Rebel agents, and Vader used his powers to execute the admiral."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Admiral Sarn was created by Vincent Lee for the 1995 LucasArts video game Star Wars: Rebel Assault II: The Hidden Empire. The game's story was told through a series of live-action cutscenes, in which Sarn was portrayed by Gary Martinez. As part of the game's promotional material, a brief description of the character appeared on the LucasArts website. Rob Smith's Rogue Leaders: The Story of LucasArts includes an extract from Lee's storyboards and scripts document for Rebel Assault II, dated November 16, 1994, which shows Sarn in an early draft of the game's opening scene."}, {"tag": "p", "text": "Sarn was mentioned in Grand Admiral Batch's entry in Abel G. Peña and Daniel Wallace's Star Wars Insider 66 article, \"Who's Who: Imperial Grand Admirals.\" The article was originally due to be published in Star Wars Gamer before the magazine was cancelled and some material was cut when the article was later picked up by Star Wars Insider. The original manuscript, entitled \"Dirty Dozen: The Imperial Grand Admirals,\" established that Sarn was a former protégé of then-admiral Harrsk and that the Terror had been part of a task force requisitioned by Batch to protect the Imdaar Alpha facility. Admiral Sarn was one of the random names used by computer-controlled Imperial players in the 2001 video game Star Wars: Galactic Battlegrounds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}