{"url": "Satal_Keto/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Humans", "Category:Keto family", "Category:Krath", "Category:Males", "Category:Rulers of the Empress Teta system", "Category:Sith acolytes and apprentices", "Category:Sith alchemists", "Category:Sith sorcerers", "Category:Tetans", "Category:Torturers and interrogators", "Category:Treasure keepers"], "nodes": [{"tag": "h1", "text": "Satal Keto"}, {"tag": "p", "text": "Satal Keto was a Human male native to the planet Empress Teta, the son of Lord Keto, nephew of Lady Magda Keto, and the cousin of Aleema Keto. He and Aleema co-founded the Krath, a secret dark side society, and together they succeeded in overthrowing the Tetan Monarchy just prior to the Great Sith War. As the new co-rulers of the Empress Teta system, Satal and Aleema instigated the conflict known as the Krath Holy Crusade. Keto's progression down the path of the dark side saw him transformed into an accomplished Sith magician, though his true talents were in the creation of poisons and other alchemical Sith practices."}, {"tag": "p", "text": "Shortly after the Battle of Koros Major, Satal and Aleema accepted a rogue Jedi named Ulic Qel-Droma into their fold. Time passed, and Keto grew increasingly suspicious of Qel-Droma, fearing he had ulterior motives for joining the Krath. As Qel-Droma advanced through the Krath ranks, he became Aleema's lover, further spurring Keto's jealousy and his suspicions of Qel-Droma's true purpose. It was not until another Jedi was captured in the streets of Cinnagar that Qel-Droma's infiltration plot was exposed, and Keto decided to have Qel-Droma assassinated. The assassination attempt failed, and during the resulting confrontation, Qel-Droma struck Keto down in a fit of rage."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Coruscant endeavor"}, {"tag": "p", "text": "The son and daughter—though not siblings—of the then-rulers of the Empress Teta star system, Satal Keto and his cousin Aleema were the successors of the throne of Empress Teta, which was at that time occupied by Satal's father, Lord Keto, and Aleema's mother, Lady Magda Keto. Out of boredom, Satal, Aleema, and some of their socialite friends formed a secret society called the Krath, so named after a fairy-tale magician-god. The cousins learned much about the ancient Sith Empire, which instigated the Great Hyperspace War in 5000 BBY—so much so that they were compelled to explore the history further on their own."}, {"tag": "p", "text": "To appease their curiosity, Satal and Aleema planned and took a trip to the Galactic Museum on Coruscant, with hopes of finding anything related to the ancient Sith. As they browsed the museum, they were allowed access by the museum curator into the Hall of the Sith: a section dedicated exclusively to Sith history. The museum was currently in production of a new exhibit entitled \"Dark Lords of the Sith,\" and from what the Ketos could see, there would be much to explore. The curator finally was convinced to allow Satal and Aleema to peruse the restricted exhibit, reasoning that it was highly unlikely someone would steal any of the various dark side artifacts, and even less likely that they would be used in an attempt to dominate the galaxy. Satal proved the curator wrong, however, when at Aleema's prodding he stole an ancient Sith spellbook."}, {"tag": "p", "text": "The book was written in the ancient Sith text, a language neither he nor Aleema was able to decipher. The downhearted cousins returned to their lodgings, where they scanned the current HoloNet News reports. Aleema stopped on a report about dark side users who, with their dark powers, were terrorizing the citizens of the planet Onderon. Satal and Aleema were intrigued by the fact that there were still dark side practitioners throughout the galaxy, and decided that traveling to Onderon was their best chance of learning the secrets of their stolen book. Armed with this new knowledge, the pair ditched their quarters, and left Coruscant aboard their pleasure yacht dubbed the Krath Enchanter on a direct path for Onderon."}, {"tag": "h3", "text": "Battle on Onderon"}, {"tag": "p", "text": "When the Ketos exited hyperspace, they found that they had arrived in the midst of the Galactic Republic naval battle formation. Having been summoned by the Jedi Knights who were already entrenched there and engaged in battle with the planet's dark side-worshiping citizens, the fleet stationed itself in orbit around Onderon to prevent any unauthorized ships from coming or going. Noticing the civilian vessel, the captain of the Republic command ship Alliance I hailed the Krath Enchanter, informing its passengers that the planet was currently under siege, and advising them to steer clear of Onderon's orbit. Despite additional caution expressed by Aleema, Satal instead chose to disconnect the comlink and ignore the Republic ship captain's warning."}, {"tag": "p", "text": "Keto then piloted the Enchanter through the formation, and through the atmosphere of the planet, only to find that Republic troops were already engaging the Onderonian forces. Trying to evade the battle, the Enchanter was caught in the crossfire of a Republic rocket-jumper air-to-ground assault, and crash-landed in the center of Iziz, Onderon's great walled city. Escaping the wreckage unharmed, the Ketos began wandering the streets of Iziz, beginning immediately their search for any practitioners of Sith teachings. They eventually made contact with several dark-siders, who in turn led them to Onderon's ruler, the sorcerer King Ommin."}, {"tag": "p", "text": "Ommin himself was operating in his secret underground lair, while his dark side warriors were heavily engaged in combat with the combined forces of the Republic military and the Jedi Order. The King was in the midst of coordinating battle strategies when he was interrupted by his servant Novar, who informed him that during the battle, two visitors had arrived on Onderon claiming to be in possession of dark side treasures, and were requesting his audience. Curious that visitors would choose a tumultuous time such as this for a visit, and even more curious about the supposed treasures, Ommin allowed the two individuals to be brought before him."}, {"tag": "h4", "text": "King Ommin"}, {"tag": "p", "text": "The Ketos entered Ommin's lair, escorted by his royal guards. Satal and Aleema were surprised to find that Ommin had been expecting them. He was an elderly man who was confined to a steel contraption to support his weakened body, and he welcomed the cousins while expressing his interest in their \"Sith treasures.\" Keto unfurled his spellbook, and asked the King if he was able to translate the text. Pleased with the ancient book, Ommin was eager to own a copy for himself, and agreed to help Keto should he be allowed to take one. Apprehensive at first, Keto showed his skepticism when he challenged Ommin, asking what made him so trustworthy. The King replied that he sensed a strong propensity for learning within his young guests. In a demonstration of his ability, Ommin weaved his fingers in an intricate pattern, and channeled the conjured energy into feelings of malaise that directly affected Keto. Aleema, however, was unfazed by Ommin's magic; she instead felt as though his power was legitimate, and that the King was genuinely interested in helping them. Ommin then showed Satal and Aleema his own collection of Sith artifacts, treasures that were given to the him by the long-dead Dark Lord of the Sith Freedon Nadd. The King took one of the treasures, an amulet, and gave it to Satal, instructing him to put it on. Satal did as he was commanded, and much to his astonishment, he was able to understand the previously unintelligible script. Now thoroughly convinced, Satal allowed Ommin to take the book, which was in turn given to Novar to be transcribed. Ommin then showed the Ketos his \"greatest prize,\" the Jedi Master Arca Jeth, who was hanging on a wall and suffering heavily under the power of Sith magic. Under orders from Freedon Nadd, Ommin managed to capture Jeth by smothering him with dark side energy. His plan for the Jedi Master, as he explained to Satal and Aleema, was to destroy his body with the power of the dark side, and then restore him as a dark side spirit."}, {"tag": "p", "text": "They were interrupted, however, when seven lightsaber-wielding Jedi stormed Ommin's stronghold, catching everyone by surprise. The King's army of dark side warriors immediately assumed the offensive, but were quickly bested by the Jedi Knights. Ommin meanwhile proved himself to be a formidable adversary, as he blasted the Jedi with waves of dark side energy. The King was defeated, though, when one of the young Jedi, a Human male named Ulic Qel-Droma, slashed through his metal armature, utterly incapacitating him. In the midst of the skirmish, Satal and Aleema managed to escape further into the catacombs of Ommin's lair."}, {"tag": "h4", "text": "Escape from Iziz"}, {"tag": "p", "text": "While searching for an exit to the surface from the underground tunnels, Satal and his cousin were confronted by a dark side spirit. The spirit introduced himself as Freedon Nadd, and the Ketos were taken aback by his spectral presence. Nadd presented them with two archaic Sith swords, as well as returning their spellbook and allowing Satal to keep the talismans. The Dark Lord then explained to them that Ommin was correct; Satal and Aleema were indeed the heirs to Nadd's Sith legacy, and that Nadd himself would personally complete their training. He guided them to the surface of Onderon, telling them to leave and that wherever they went, he would find them."}, {"tag": "p", "text": "Nadd's spirit returned to Ommin's underground lair just as the Jedi were freeing Jeth, only to find Ommin on the ground, helpless and writhing about. When Ommin realized that Nadd's spirit had returned, he begged for assistance, but Nadd quickly refused him. Releasing the defeated King from his service, Nadd next addressed the Jedi, telling them that Ommin's day was over, but perhaps several of the Jedi would join the dark side in his stead. The rescued Arca Jeth faced Nadd and banished his spirit from Onderon. His remains would later be interred on the far side of Onderon's jungle moon Dxun, along with those of King Ommin and his late wife Amanoa."}, {"tag": "h3", "text": "Enter the Krath"}, {"tag": "h4", "text": "New regime"}, {"tag": "p", "text": "Satal and his cousin fled Onderon with their new collection of ancient Sith artifacts and texts aboard an evacuation vessel. They would spend the next months learning to harness the dark side from Freedon Nadd, and, through his instruction, Satal and Aleema became proficient in Sith magic. While Aleema preferred the magical aspects of her new Sith powers, Satal chose also to delve into the daunting alchemical practice of creating debilitating Sith poisons. Armed with their new knowledge, Satal and Aleema next devised a plan to overthrow their parents: Lord Keto and Lady Magda Keto, the Emperor and Empress of the Tetan star system."}, {"tag": "p", "text": "As Lord and Lady Keto were conducting a routine inspection of Empress Teta's orbital carbonite production facility, Satal and Aleema arrived unexpectedly, accompanied by the royal tutor, Korus. They stormed the Tetan carbonite smelter, at which time Satal confronted his father. Lord Keto demanded that Korus explain his reason for allowing such a breach of protocol, knowing full well that the royal children were not allowed to attend matters of state. At Satal's behest, Korus attempted to respond, only to display the Adegan eel that had recently replaced his tongue. Aleema then informed her uncle that Korus had fallen victim to Sith magic; ancient dark side power that she and Satal had discovered on Onderon. The cousins also revealed the existence of their Krath cult, and then proclaimed themselves the new rulers of the Tetan worlds. To solidify the Krath takeover, Satal forced the Tetan officials into the adjacent smelter, where he had each of them executed by dropping them into vats of carbonite, save Lord Keto. Satal instead chose to have his father slowly lowered in the molten metal, and in doing so, made a carbonite frieze of him. Lord Keto would spend the rest of his days as a hanging decoration in his own former palace, the Krath's newly acquired Iron Citadel, with his son usurping his title as the new Lord Keto."}, {"tag": "h4", "text": "War with the Republic"}, {"tag": "p", "text": "The Krath takeover had been swift and violent; however, many Tetan citizens refused to acknowledge the dominion of the Sith-inspired regime, and instead rebelled against their new rulers. Factions on the planet Kirrek were offering resistance, while the citizens of Empress [[Teta/Legend|Teta] refused to submit themselves to the Krath as well. In response, the Ketos used their Sith powers against the rebels; Aleema put down the insurrectionist groups in the capital city of Cinnagar, while Satal personally saw to the leveling of Kirrek."}, {"tag": "p", "text": "It was not long before the Galactic Republic became aware of the unrest in the Tetan system, and in an effort to assist them, a combined Jedi/Republic fleet under the command of Nomi Sunrider and Jedi advisor Ulic Qel-Droma was sent to deal with the Krath. During the battle at Empress Teta, Aleema used her powers to conjure illusions of ancient starship-devouring space grazers to fool the Republic fleet, while Satal hypnotized his Krath Chaos starfighter pilots, and employed them as suicide bombers. The Chaos fighters were also supported by illusory reinforcements, which Aleema had created to further confuse the enemy. Many Republic ships sustained heavy damage during the ensuing battle. In the heat of kamikaze attack, one Chaos fighter crashed into the bridge of the Republic command ship Reliance I, where Ulic Qel-Droma was stationed. He was grievously injured by a piece of shrapnel as the starfighter breached the hull. The Republic force soon exited Tetan space to rethink their strategy in the face of defeat."}, {"tag": "h4", "text": "Jedi ambush"}, {"tag": "p", "text": "The Krath had successfully defended their borders against the Republic, though not without sustaining losses of their own. Aleema had been rendered unconscious during the battle, the victim of a psychic assault by the Jedi Nomi Sunrider. After some time, Satal managed to revive Aleema, and quickly brought her up to speed on their current standing. While she was comatose, Satal had been busy arranging the next stage of their plan, which involved attacking the Jedi directly. Intelligence reports told him that thousands of Jedi were currently gathering en masse on the planet Deneba. Satal secretly inserted one of his Tetan warcruisers in orbit around Deneba, just as thousands of Jedi also made their descent onto the planet. The Tetan corsair carried life-pods, and within them rested Krath war droids, who at a specific time of Satal's choosing, would be deployed to the surface of Deneba, emerge from their pods, and catch the Jedi off guard. The second phase of the plan was to simultaneously engage a secret command that reprogrammed the Jedi's servant droids to attack their masters, instead of assisting them. The assault commenced unfettered, and countless Jedi met their demise during the battle. The droids were ultimately defeated, but not without severe Jedi casualties, one of which was Master Arca Jeth, who died as a war droid blasted him from behind."}, {"tag": "h4", "text": "Suspicious Jedi"}, {"tag": "p", "text": "The death of Arca Jeth ignited feelings of grief within Ulic Qel-Droma, who at one time had been Jeth's apprentice, and had also been present when he was killed. He was so overcome with guilt and revenge, that he sought to infiltrate the Krath, hoping to learn from them the dark side, and then betray them to the Jedi. To this end, Qel-Droma traveled to Empress Teta, and arrived in the capital city of Cinnagar, just as Satal and Aleema were performing public executions of local dissidents and offenders. In the midst of the display, several individuals within the crowd caused a riot, in which one of the attackers attempted to murder Aleema. Qel-Droma was also in the crowd, and upon seeing this, he raced to her aid, striking the assailant down and effectively saving Aleema. In reality, the Ketos were aware that Qel-Droma was on Empress Teta, and had allowed the riot to commence in order to bring him into contact with them. Qel-Droma introduced himself as a fallen Jedi as Aleema thanked him for the timely \"rescue.\" She then bid Satal continue with the executions, while she and her \"savior\" retired to the Iron Citadel. Satal gladly obliged."}, {"tag": "p", "text": "Satal did not believe Qel-Droma's story of being a Jedi defector; rather, he was suspicious of Qel-Droma's reasons for being in Cinnagar, believing him to actually be a Jedi spy. Despite Qel-Droma's repeated denials of this claim, Satal imprisoned him, and then interrogated and tortured him in the dungeons of the Iron Citadel. During the torture session, Satal injected Qel-Droma with a Sith poison, a toxin designed to weaken his resistance to the dark side while simultaneously amplifying his rage. Aleema admonished Satal for administering the toxin, as the poison was capable of killing those not strong enough in the Force to counter its effects. Satal, however, saw it as a test of Qel-Droma's Jedi powers, and ensured his cousin that if he survived the injection, it would guarantee his fall to the dark side. Qel-Droma had an immediate reaction to the poison, so intense that he lashed out with the Force, destroying the restraints he was being held with along with the torture droids administering his punishment. Satal was indeed pleased with the results, and left Aleema to tend to the unconscious Jedi."}, {"tag": "p", "text": "Months had passed, and during that time, Qel-Droma had become ingratiated in the Krath, and also been taken by Aleema as her lover. His colleagues on the Jedi planet of Ossus became concerned when they heard no word from the entrenched Qel-Droma. As a result, a team of Knights was dispatched, consisting of Nomi Sunrider, Tott Doneeta, and Qel-Droma's younger brother Cay, to locate Qel-Droma and report on his progress. Arriving in the starship Nebulon Ranger, Sunrider jettisoned from the ship inside of an escape pod, and entered the capital city of Cinnagar, with intentions of being captured by the Krath. Once in custody, she hoped to get close to Qel-Droma, and attempt to persuade him to return to Ossus with her."}, {"tag": "p", "text": "The initial part of Sunrider's plan was successful, for shortly after her arrival in Cinnagar, she was apprehended by agents of the Krath, and placed in the dungeon of the Iron Citadel. Simultaneously, Qel-Droma was meeting with Satal and Aleema, discussing Republic military secrets and assisting them in updating their weapons and defensive systems with the latest in galactic technology. Recognizing his superior expertise in military affairs, Aleema made Qel-Droma warlord of the Krath, placing him in command over all of Empress Teta's military forces. Satal, however, still harbored suspicions of Qel-Droma being a Jedi spy. His skepticism was strengthened when he received a report that another Jedi had been located and captured in Cinnagar."}, {"tag": "h4", "text": "Qel-Droma's revenge"}, {"tag": "p", "text": "Confronting Qel-Droma, Satal accused him of being the harbinger of a Jedi invasion. He immediately had the recent intruder brought before them, who was revealed to be Qel-Droma's former companion, Nomi Sunrider. Satal then tested the defected Jedi's purported \"loyalty\" by asking him what to do with Sunrider. Maintaining his cover, Qel-Droma ordered for her to be imprisoned for questioning. Satal refused this, fearing that Sunrider posed a potential threat, and instead advocated for her immediate execution. Qel-Droma agreed to take care of her personally in the morning, but in the meanwhile, she was to be taken to the dungeons for interrogation. Later that day, Qel-Droma used a maintenance droid to compose a secret message for Sunrider, expressing to her that his mission was not yet complete, and that he would return to Ossus when it was. He then sent the droid on a \"routine\" maintenance run to the dungeons, but it was intercepted by Satal's assistant, Norgor, who himself was suspicious of the droid's activity and brought it before his master. Satal immediately discovered the hidden message, which confirmed his original misgivings about Qel-Droma being on Empress Teta for the sole purpose of infiltrating the Krath. He destroyed the droid and then ordered Norgor to both assassinate Qel-Droma, and have the Jedi woman brought to him."}, {"tag": "p", "text": "Firing twin blaster pistols, Norgor crashed through the window of the bedroom where Qel-Droma was with Aleema, in an attempt to catch them off guard. Qel-Droma was able to quickly ignite his lightsaber in time to deflect the incoming blaster bolts. He then slew Norgor just as a startled Aleema got her own bearings. She recognized the dead assassin as one of Satal's minions, and then confessed to Qel-Droma that it was Satal who orchestrated the attack on Deneba. Upon hearing this, Qel-Droma became enraged, and left her in search of Satal."}, {"tag": "p", "text": "Meanwhile, Sunrider managed to escape the dungeons, and called both Cay Qel-Droma and Tott Doneeta for reinforcements. Fighting their way through the Krath's defenses, the two Jedi met their comrade in the courtyard of the Iron Citadel, and became engaged in a firefight with the pursuing Krath soldiers. After defeating them, the Jedi trio went in search of Qel-Droma, but were stopped short when Satal appeared in front of them on the balcony, and vowed to imprison them all. At that same moment, Qel-Droma arrived on the balcony behind Satal, and confronted him over the death of Arca Jeth. He then drew his lightsaber and issued a challenge to Satal, who withdrew his own Sith sword, and a heated battle ensued."}, {"tag": "p", "text": "The two men clashed weapons as Satal chided Qel-Droma, further inciting his rage and catalyzing the Sith poison that he injected the fallen Jedi with months before. Qel-Droma gave deeper into his anger, blaming Satal for Jeth's death as he continued to drive him back toward the balcony. Satal continued to taunt his adversary, mocking him even more with the memory of Jeth's demise. This, however, proved to be the breaking point for Ulic Qel-Droma. Unable to restrain himself any longer, Qel-Droma submitted himself fully to his rage, and struck Satal down. With his dying words, Satal revealed that Qel-Droma had been successfully drawn to the dark side, thanks to his rage-enhancing Sith poison. Upon learning of her cousin's death, Aleema took Ulic Qel-Droma as her partner, giving him full dominion over herself as well as the Krath cult."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After Satal's death, the Krath continued their campaign of galactic conquest under the leadership of Aleema and her new partner, Ulic Qel-Droma. As warlord of the Krath cult, Qel-Droma also became a Dark Lord of the Sith, simultaneously with another fallen Jedi named Exar Kun, and combined forces to form the Brotherhood of the Sith. However, this new Sith brotherhood would be short-lived. Aleema was consumed by a supernova of her own design during the Battle of Kemplex IX, having been tricked into creating the catastrophe by Qel-Droma, whom she had earlier betrayed to his former Jedi colleagues. Qel-Droma was also stripped of the Force by the Jedi Nomi Sunrider, which led to his capture, and ultimately, the defeat of the Krath."}, {"tag": "p", "text": "Satal Keto's legacy would be realized many thousands of years later in the form of his descendant, Sebban Keto. Sebban was a Tetan businessman who, like his ancestors, practiced dark side magic and used it to reestablish the Krath traditions on Empress Teta."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Satal Keto was a pompous young man, which he also accused his father of being, having grown up the son of the Emperor of Empress Teta. His ambitious nature led him on a journey to Coruscant, where he, along with Aleema, discovered ancient Sith relics. Their combined hunger for dark side knowledge led them to Onderon, solely for the purpose of unlocking the mysteries of the Sith treasure they pilfered on Coruscant. Once able to understand the Sith teachings, Keto proved to be an insatiable learner who quickly mastered the Sith teachings. The fact that Keto was able to formulate Sith poisons, a skill limited to only the most experienced of Sith alchemists, was a testament to the capacity for knowledge first recognized in him by King Ommin. With his new powers, Keto became more ruthless, executing individuals at a whim for seemingly minor offenses. As the Emperor of the Tetan worlds, Keto ruled with an iron fist, but preferred a less public role while his cousin Aleema acted as the visible face of the new government."}, {"tag": "p", "text": "As a young man, Keto was apprehensive about things with which he was not familiar. Upon meeting King Ommin, he initially refused to give the King his stolen spellbook, but he quickly relented when the elder man demonstrated his own mastery of Sith powers. However, Keto displayed a somewhat brave nature at the sight of Freedon Nadd within the catacombs under the Iziz Royal Palace, offering to shield a clinging Aleema from the specter."}, {"tag": "p", "text": "As leader of the Krath, Keto was an adequate military commander, having led his Krath forces to victory against both the insurrectionists on Kirrek, and against the combined might of the Galactic Republic and the Jedi Order. Keto often had jealousy issues, something Aleema made note of on several occasions. His envious nature was further realized with the arrival of Ulic Qel-Droma, of whom Keto was immediately suspicious, fearing the Jedi to be the harbinger of an invasion. He was also a very determined man, and saw the romantic relationship shared by his cousin and Qel-Droma as a hindrance to the progression of the Krath. His suspicions led him to the ends of poisoning, torturing, and finally attempting to have Qel-Droma murdered; this would ultimately be his undoing, as the failed assassination attempt subsequently resulted in Qel-Droma murdering Keto."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Keto's early experiences with the dark side started on Coruscant, where he and his cousin Aleema explored the Galactic Museum's exhibit on dark side antiquities. His actual Sith training began on Onderon, where he first learned how to use Sith amulets and read ancient Sith writings from King Ommin. After receiving further instruction under Freedon Nadd, Keto's proficiency with Sith magic was considerable. As a Sith sorcerer, Keto developed a working mastery with creating life-like illusions, such as those he projected against his father and aunt on the orbital carbonite smelter. Keto was also proficient with mind control, a talent he displayed during the battle for Empress Teta. Under the influence of Keto's will, his Krath Chaos fighters became kamikaze pilots, and crashed themselves into the enemy Republic ships. He also learned to create Sith poisons, a task reserved for only the most accomplished Sith alchemists. Keto was proficient with hand blasters and bladed melee weapons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Satal Keto was first conceived and written by Tom Veitch and drawn by Tony Akins for the Tales of the Jedi comic series, first appearing in the issue The Freedon Nadd Uprising: Initiates of the Sith, published in 1994. However, he was first mentioned in the Dark Empire endnotes, a series of short essays that provided back stories for several Star Wars topics, including Ulic Qel-Droma and the Krath. The endnotes' mention of the Krath laid the foundation for Keto's involvement in the upcoming Tales of the Jedi story arcs."}, {"tag": "p", "text": "For the Tales of the Jedi audio drama, Keto was voiced by Christopher Sena, the same voice actor used for the character of Andur Sunrider. Keto was voiced again for the Dark Lords of the Sith audio drama, though the name of the voice actor is currently unknown. Even though his involvement was minimal, Keto's role for the Freedon Nadd Uprising was an important one, and provided sufficient background for the character to be further explored in the Dark Lords of the Sith story, where his actions would directly influence the fall to the dark side of another character, Ulic Qel-Droma."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}