{"url": "Balamak/Legends", "categories": ["Category:Legends articles", "Category:Agriworlds", "Category:Confederacy of Independent Systems planets", "Category:Fortress worlds", "Category:Galactic Empire planets", "Category:Greater Maldrood planets", "Category:Taldot sector planets"], "nodes": [{"tag": "h1", "text": "Balamak"}, {"tag": "p", "text": "Balamak was an important agriworld located in the Mid Rim's Taldot sector, on the Great Kashyyyk Branch hyperlane. During the early stages of the Clone Wars, Balamak lay in space controlled by the Confederacy of Independent Systems. A Confederate flotilla containing the experimental CIS Jammer Prototype starship was deployed over Balamak during that conflict, disrupting communications in the Taldot sector."}, {"tag": "p", "text": "In response, a Galactic Republic task force carried out an attack on the flotilla. During the ensuing stratospheric battle, Jedi Anakin Skywalker destroyed the Jammer Prototype. Balamak later became a fortress world of the Galactic Empire, and following the Battle of Endor, the Imperial High Admiral Treuten Teradoc added it to his Greater Maldrood dominion. The Balamak system was later conquered by the extra-galactic Yuuzhan Vong during their invasion of the galaxy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Balamak was an agriworld located in the Balamak system, a part of the Kashyyyk Region's Taldot sector in the Slice portion of the Mid Rim. The hyperlane known as the Great Kashyyyk Branch connected Balamak to the Charros system as well as the Kashyyyk system in the Mytaranor sector. Balamak was one of the most bountiful agriworlds of the Mid Rim, and it was an important site of food production."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The battle over Balamak"}, {"tag": "p", "text": "Balamak was situated in space explored between 20,000 BBY and 15,000 BBY. For millennia, the world was fought over by empires that wanted to ensure a steady supply of food for their troops. During the first campaigns of the Clone Wars, fought between the Galactic Republic and Confederacy of Independent Systems from 22 BBY to 19 BBY, Balamak lay within territory controlled by the latter, with the Republic's Twelfth Sector Army being charged with engaging the Confederacy's military forces in Balamak's vicinity."}, {"tag": "p", "text": "In 21.25 BBY, nine months after the First Battle of Geonosis, a Confederacy flotilla arrived over Balamak. One of the starships of the formation was the CIS Jammer Prototype, an experimental Lucrehulk-class Droid Control Ship equipped with a modified transmission array. The array broadcast jamming signals that were capable of eliminating a vital HoloNet node and that disrupted the functioning of transmission networks in the Taldot sector for four standard days."}, {"tag": "p", "text": "In response, the Republic starfighter tactician Adar Tallon planned an attack on the Confederacy flotilla. A Republic task force, led by Jedi Obi-Wan Kenobi and Nanda-Ree Janoo, engaged the enemy forces in a stratospheric battle on the date 14:2:12. During the Republic's starfighter attack, Jedi Anakin Skywalker delivered a missile volley that destroyed the CIS Jammer Prototype. The result of the battle was later reported on from the Balamak city Dorum by the HoloNet News Core Edition, and Tallon's role in planning the attack earned him the title \"Victor of Balamak.\" However, the CIS Shadowfeed news and propaganda program also labeled the Jammer Prototype's performance at Balamak a successful test of the vessel's capabilities."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "Balamak was incorporated in the territory controlled by the Galactic Empire by 17 BBY. In order to establish the self-sufficiency of his Greater Maldrood dominion, established during the Empire's fragmentation in the wake of the Battle of Endor of 4 ABY, Imperial High Admiral Treuten Teradoc took control of Balamak, which served as an Imperial fortress world by that time."}, {"tag": "p", "text": "Around 25 ABY, the population of the Balamak system numbered between 100 and 500 million. The extra-galactic Yuuzhan Vong, as part of their invasion of the galaxy, conquered the system containing Balamak at some point between 25 ABY and 26 ABY. The system remained under the control of the invaders by 27 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Balamak was first mentioned as part of Adar Tallon's title, \"Victor of Balamak,\" on the back cover of Tatooine Manhunt, a 1988 roleplaying adventure authored by Bill Slavicsek and Daniel Greenberg for use with West End Games' Star Wars: The Roleplaying Game. It was not until \"Republic HoloNet News Core Edition 14:2:12,\" an article written by Pablo Hidalgo as an in-universe news report, was published that Balamak was identified as distinct astronomical object. The article was included in the sixty-fifth issue of the Star Wars Insider magazine on January 21, 2003. The 2009 reference book The Essential Atlas placed Balamak in grid square Q-9."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}