{"url": "Satine_Hawkins_dance", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Musical events"], "nodes": [{"tag": "h1", "text": "Satine Hawkins dance"}, {"tag": "p", "text": "A Satine Hawkins dance was a special type of organized dancing event in a school setting in which girls asked boys to the dance, considered a reversal of the normal order. In 195 BBY, the Jedi academy in the Jedi Temple on Coruscant once hosted one of these dances for its students."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The dance was announced as a student social activity by Lackbar, a Mon Calamari female served as a librarian of the Jedi Archives and who also instructed students in public speaking. Held at the beginning of the school year, approximately 195 BBY, the dance was considered unusual in that girl students were expected to ask boy students to be their dates to the dance, whereas normally the reverse was practiced."}, {"tag": "p", "text": "Roan Novachez was excited by the dance and helped his friend Bill, who was serving as dance's disc jockey, to carry equipment. Once Roan actually understood the dance, however, he found himself wishing that his crush, Gaiana, would ask him to dance and as such spent most of the dance wandering around, getting drinks and generally standing by himself. He finally located Gaiana, but at that point the dance was over before he realized it. While Bill seemed pleased with the results, Roan looked angry when Bill commented on how great the dance was."}, {"tag": "p", "text": "During the dance, Roan's friend Pasha danced with Shi-Fara, and the instructors Kitmum and Mr. Garfield shared a dance, though Mr. Garfield, a notoriously stern Zabrak, seemed reluctant to dance with the Wookiee at first."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name of the dance is an obvious wordplay on the tradition of the real-life Sadie Hawkins dance in schools in which girl students invite male students, as well as the name \"Satine,\" the first name of the duchess Satine Kryze."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}