{"url": "Sauk", "categories": ["Category:Legends articles", "Category:Engineers", "Category:Males", "Category:Mon Calamari", "Category:Refugees"], "nodes": [{"tag": "h1", "text": "Sauk"}, {"tag": "p", "text": "Sauk was a Mon Calamari male engineer and later a combatant during an insurgency initiated by the Sith Lord Darth Wredd. Born on Dac, Sauk wished to become an engineer, but his need of adventure made him leave the place and apprentice offworld. When the One Sith committed a genocide on Dac during the Second Imperial Civil War, Sauk ended up as a refugee in the Outer Rim. He found himself homeless in the Carreras system, when Ania Solo met him and helped him to get a shelter and a job as a worker in the ice mining facility of Carreras Minor."}, {"tag": "p", "text": "In 138 ABY, Sauk and his new friend Ania discovered a lightsaber inside a salvaged Imperial communications droid. The two attempted to sell the lightsaber in a city on Carreras Major, but ran afoul of local security instead. This skirmish drew attention of Darth Wredd, impersonating the Imperial Knight Yalta Val. Wredd tracked them to Ania's junkyard, seized the lightsaber and ordered the guards to kill both Ania and Sauk. However, they were saved by Ania's friend AG-37, who offered them a transport off the Carreras system."}, {"tag": "p", "text": "Their flight ended when a blockade of the Carreras system, ordered by Wredd, forced them to land on Carreras Minor. After meeeting another Imperial Knight Jao Assam and discovering Wredd's ruse, the group decided to search for Yalta Val. They traveled to the Surd Nebula, but were trapped by a Shifalan patrol ship and transported to the Carreras G51 communications array. There the group was briefly imprisoned, until governor Biala finally saw through Wredd's deception and set the group free. A short battle with Wredd followed, leaving Sauk injured and unconscious. He and the others were later saved by Ania Solo, just before the array met its end in a collision with the rogue planet Mala."}, {"tag": "p", "text": "Their freighter was then found by the Imperial Star Destroyer Animus. Out of gratitude for repairing his damaged droid body, AG-37 offered Sauk a job aboard his freighter. With Ania remaining aboard the Animus after receiving a job offer from the Imperials, Sauk and AG-37 departed into space. Their separation, however, did not last long. When Sauk and AG-37 were heading to Iego, they picked up a distress signal from Dac, broadcast by the familiar communications droid. Sauk and AG-37 arrived in time to rescue Ania and Jao, who decided to pursue Darth Wredd, from an escape pod launched to Dac's poisoned ocean. The reunited group then played an important part in the liberation of Mon Calamari Shipyards, when Jao and the Imperial Knights defeated a gang of pirates led by the Sith Lord Darth Luft. Sauk and AG-37 then decided to join Ania and Jao in their pursuit of Darth Wredd."}, {"tag": "p", "text": "In 139 ABY, Ania became wanted for the murder of an Imperial Knight. While Jao had his doubts, Sauk believed in Ania's innocence. Before Ania could explain herself, she was kidnapped by a group of bounty hunters. Hunters's ship was, however, damaged, and Sauk and his companions found Ania, stranded on a wild planet and fighting for her life with another bounty hunter, who was trying to frame Ania for the murder she did not commit. With Val's help, they were able to prove Ania's innocence, but Jao was arrested for desertion from the Imperial Knights."}, {"tag": "p", "text": "When Jao was suddenly abducted from the prison, Empress Marasiah Fel offered to recall the death penalty, if Jao would be brought back. Ania agreed and when they received the coordinates from Jao, she, Sauk, AG-37 and the group of Trandoshan stormtroopers traveled to the coordinates. To their surprise, they arrived to the planet Mala, where Jao was being held by Wredd. Right after Jao was freed, the group ended up in the sudden battle between a legion of the One Sith and Darth Wredd. They reluctantly joined Wredd, but were heavily outnumbered and their situation was becoming critical. Sauk was nearly struck down by a Sith, but incoming Triumvirate starfighter saved him, blasting the Sith. During the ensuing fighting between the One Sith and the Imperial Knights, Sauk and Ania assisted the Imperial forces by blowing up a Chadra-Fan Lander, killing several Sith. Following the defeat of Darth Wredd and the One Sith, Sauk would join Ania, Jao, AG-37, and their Imperial comm droid on their travels throughout the galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Sauk was a Mon Calamari who grew up on the planet Dac during the time of the Second Imperial Civil War. While he had trained as an engineer, he wanted some adventure offworld and apprenticed himself to an unidentified employer. While Sauk had every intention of returning once he had completed his education, the One Sith's genocide against the Mon Calamari species and the subsequent poisoning of Dac's oceans with viral spores made this dream untenable. Sauk lost contact with his family on Dac. At some point, Sauk became unemployed and ended up on the streets of Carreras Minor, a planet in the Carreras system. He was treated with disdain by the indigenous Shifala, a simian species, who disliked the influx of Mon Calamari and Quarren refugees and nicknamed them \"refugee scum\", \"flotsam\", and \"beggars.\" However, a young Human woman named Ania Solo vouched for him and secured him employment at an ice mining platform in the rings of Carreras Minor."}, {"tag": "h3", "text": "The stolen lightsaber"}, {"tag": "p", "text": "In 138 ABY, Sauk's friend Ania found a damaged Imperial communications droid at at her junkyard on Carreras Minor's moon. This droid belonged to the Imperial Knight Yalta Val, who had been ambushed and kidnapped by the rogue Sith Darth Wredd during a mission to the Carreras system to supervise the construction of the local communications array, which was part of the galactic G51 communications array system. While examining the droid, Sauk found Yalta Val's lightsaber, which the droid had retrieved following the ambush on the floating world of Mala. Viewing the lightsaber as a means to \"get rich\", Ania persuaded Sauk to take it to a pawn shop. While pessimistic of their chances of success, Sauk agreed to help Ania sell the lightsaber."}, {"tag": "p", "text": "They visited Carreras Major, the homeworld of the Shifala and the capital of the Carreras Major. The indigenous Shifala had a xenophobic attitude towards foreigners and Sauk and Ania witnessed a Shifala security officer gunning down an alien refugee. They took the lightsaber to a pawn shop but the female Shifala shopkeeper refused to accept questionable transactions until the Carreras array was complete. Since the authorities were keeping a close eye on transactions, the Shifala shopkeeper ordered them to leave. When Ania tried to make a deal with the Shifala shopkeeper, the woman threatened to report her to the authorities. The shopkeeper then used an unknown trapdoor device to expel Ania and Sauk from her business, and they were pursued by several Shifala security officers. During a confrontation with a xenophobic security officer, Ania shot the man dead for calling them \"immigrant scum.\""}, {"tag": "p", "text": "Ania and Sauk fled into their shuttle and led the Shifala authorities on a pursuit threw the sewers of Carreras Major. Unable to return fire on their pursuers who rode swoop bikes, Sauk used his lightsaber to breach several pipers, releasing a torrent of fog which caused the Shifala security officers to collide into a wall. Ania and Sauk then returned to their base on Carreras Minor's moon. Back at Ania's junkyard, Sauk began repairing the Imperial comm droid with the intention of selling it to buy Ania passage offworld. When Sauk asked whether it was a risk for Ania to drop him off at the mining platform, Ania replied that she was not going to abandon him here but vowed to get rid of the lightsaber. At that point, the assassin droid AG-37, an old friend of Ania, arrived and took Ania and Sauk by surprise. AG-37 had just landed his freighter in Ania's shipyard to buy some linear converters. AG-37 also advised Ania to get rid of her lightsaber."}, {"tag": "p", "text": "However, the Sith impostor Darth Wredd, who was masquerading as Yalta Val, caught up with them and landed in Ania's junk yard with a force of security troops. When Ania refused to \"return\" his lightsaber, the Sith impostor used the Force to retrieve and destroy SD, Ania's droid bouncer. He then ordered his men to kill Ania and Sauk. While the guards were distracted by several gesaw rats, Ania and Sauk too the opportunity to flee through the junk yard. After a lengthy pursuit, Ania and Sauk were cornered near an engine cowling on the north side. However, they were saved by the arrival of AG-37 who proceeded to machine-gun the Shifala security officers. Earlier, AG-37 had gone to the north side to pick up linear converters. They then escaped offworld on AG-37's freighter."}, {"tag": "p", "text": "While traveling offworld, Sauk managed to begin repairs on the damaged Imperial comm droid. While tinkering with the droid, he encountered a holographic recording of an Imperial Knight fighting against a Sith. Sauk and AG-37 quickly recognized that the Imperial Knight's lightsaber was the same blue-bladed one which Ania had picked up earlier. They also realized that the lightsaber's owner was not the same Knight they had encountered at Ania's junkyard. The three companions quickly deduced that the real Yalta Val had been replaced by a Sith impostor. They encountered a Shifala naval blockade. AG-37's freighter managed to evade the pursuing Shifala starfighters by flying through the ice rings of surrounding Carreras Minor. During the pursuit, Ania managed to destroy the starfighters by shoving her shuttle out of the starship's hangar bay, sending it on a collision course with the starfighters."}, {"tag": "h3", "text": "Rescuing Master Val"}, {"tag": "p", "text": "AG-37's freighter managed to land safely on Carreras Minor, a bleak desert world. Sauk managed to stabilize the Imperial communication droid's power source. Suddenly, the freighter was attacked by a giant tentacled monster which attempted to devour the ship and its crew. The freighter's crew were rescued by the Imperial Knight Jao Assam, a friend of Master Val who had traveled to the Carreras system to investigate his disappearance. Following a struggle, AG-37's freighter managed to escape by firing its exhaust engines into the monster's face. However, Ania distrusted Jao due to her bad experience with the Sith impostor. During the verbal confrontation, Sauk surfaced with a blaster rifle but Ania convinced Sauk that Jao was not a threat. Sauk was relieved since he did not know how to shoot the blaster. Sauk was also followed by the newly-repaired Imperial comm droid. After getting the comm droid to replay the holographic recording of Yalta Val fighting the Sith, Sauk and his companions quickly realized that Yalta Val had been replaced by a Sith impostor. In the end, Jao and Ania's companions agreed to search for the floating world in the hope of rescuing Master Val."}, {"tag": "p", "text": "While traveling into the Surd Nebula, they were pursued by several Carreras starfighters. They arrived at the coordinates of the floating world only to find empty space. At that point, AG-37's freighter's port thruster was hit by laser cannon, and they were trapped in the tractor beam projector of a Shifala warship. AG-37's freighter was dragged into the hangar bay of the warship and was boarded by several droids which chewed a hole through the hull of the freighter. Ania and her companions fled down the gang plank only to fall into the hands of armed Shifala guards, who arrested them. Sauk along with Ania and AG-37 were locked into detention cells of Imperial design. AG-37 was also incapacitated by a restraining bolt. Ania was determined to escape from her cells but Sauk was pessimistic of their chances of escape. In the end, Sauk and his companions were released by Governor Biala who sent Jao and his companions to deal with the Sith impostor. After observing a conversation between the false \"Yalta Val\" and Jao, Biala quickly deduced that the former was an impostor."}, {"tag": "p", "text": "Newly-freed, Sauk and companions headed to the hangar bay to confront the Sith impostor. Jao was not confident of his ability to handle Darth Wredd alone but Ania believed that the four of them would be able to defeat the impostor. While Jao advised caution and suggested tracking the Sith from their starship, Ania wanted to take out the rogue Sith immediately. Despite Sauk and Jao's objections, she fired on Darth Wredd's shuttle but he survived the explosion and attacked the four opponents with ruthless ferocity. During the fighting on the Carreras communications array, Darth Wredd cleaved AG-37 with his lightsaber. He also managed to wound Sauk, leaving him unconscious on the floor of the hangar bay. Despite Jao and Ania's best efforts, Darth Wredd managed to escape, but not before impaling Jao and sending him hurtling through the zero gravity of space."}, {"tag": "p", "text": "Ania survived the skirmish and pursued Darth Wredd to his base on the floating world of Mala. Taking control of the Carreras communications array, Darth Wredd broadcasted his manifesto to the wider galaxy, deriding the Galactic Triumvirate and presenting his captive Yalta Val. Before a live galactic audience, Wredd attempted to execute Val but was stopped by Ania, who managed to free Master Val. While the two were preoccupied, Ania flew back to the Carreras communications array in Jao's starfighter and rescued Sauk and AG-37, dragging them aboard AG-37's freighter. By this stage, the Carreras communications array was a on a collision course with Mala and had Governor Biala had ordered a general evacuation. While they were unable to prevent Darth Wredd from escaping, Ania managed to rescue Master Val. While AG-37 piloted the ship, Ania tended to the wounded Sauk, and Jao was retrieved by the Imperial comm droid who had rescued the young Knight because it had believed that he had come all this way to rescue it and Val. Following their rescue, Ania apologized to Sauk for putting them in danger. However, Sauk assured her that she had in fact saved them all."}, {"tag": "h3", "text": "A fresh start"}, {"tag": "p", "text": "Despite escaping the destruction of the Carreras array, Sauk and his companions were stranded on the wrong side of the Surd Nebula. Due to Jao's deteriorating condition, Val's comm droid had begun broadcasting a distress signal. Sauk commented that they should have headed back to Carreras rather than trying to chase Darth Wredd, who had disappeared into parts unknown. AG-37's freighter was picked up by the Pellaeon-class Star Destroyer Animus, which had received the freighter's distress signal. Empress Marasiah Fel had sent the Animus to pick up Ania after learning of her involvement in the Carreras Incident. Once aboard, Sauk and his companions were treated as guests by the Imperials. A pair of Imperial Navy engineers also repaired the damaged AG-37 and one of them praised Sauk's improvised workmanship."}, {"tag": "p", "text": "Following their rest and recuperation, Sauk secured a job aboard AG-37's freighter as an engineer. While the money was not great, he regarded working on AG-37's freighter as preferable to his old job as an ice miner. Sauk shared the news with Ania, who assured him that things would always work out in the end. AG-37 invited Ania to join them but she declined the offer, citing that the Imperials had promised to provide her with a good job and nice apartment on Coruscant, the galactic capital. After hugging Sauk, Ania told the Mon Calamari engineer to take care of the grumpy old droid. Sauk and AG-37 then departed into space. Their travels took them to an unidentified spaceport where Sauk encountered a fellow Mon Calamari refugee who informed him of a plan to rebuild and resettle Dac. He attempted to invite Sauk along but the latter declined due to his job aboard AG-37's freighter."}, {"tag": "p", "text": "Sauk and AG-37 were transporting a large beast with sharp jaws to Iego. Due to the dangerous nature of the cargo, the creature was housed in a repulsor cage. Under AG-37's orders, Sauk attached had connected the cage to the shipboard power supply. Realizing that Iego was near his homeworld of Dac, Sauk asked AG-37 whether they could visit his homeworld. However, AG-37 advised against it since Dac was a failed and lawless system. Sauk then related his earlier meeting with the Mon Cal who mentioned a resettlement program in the Calamari system. However, AG-37 was skeptical and described the Mon Calamari as an idealist. Sauk then related how he had left Dac to work as an apprentice engineer prior to the Sith-inspired Genocide and admitted that he missed his homeworld and his long-lost family. When Sauk mentioned that Mon Calamari Shipyards had been destroyed, AG-37 corrected him by informing him that the ring had only been broken but not totally destroyed."}, {"tag": "h3", "text": "Liberation on Dac"}, {"tag": "p", "text": "Meanwhile, Jao Assam and Ania embarked on a quest to hunt down Darth Wredd, after receiving a Force vision that the rogue Sith had planned to kill Empress Marasiah Fel. Their hunt took them to the lawless Calamari system where they discovered that another Sith Darth Luft and his pirate associates had started a scam to lure Mon Calamari and Quarren refugees back to Dac. There, these unfortunate Mon Calamari and Quarren were enslaved and forced to build starships for the pirates. Jao and Ania, along with two local guides the Mon Calamari Luen and the Quarren Tikin, were dumped into an escape pod, which was jettisoned into Dac's poisoned oceans. Jao's Imperial comm droid transmitted a distress signal which was picked up by AG-37's freighter. Sauk and AG-37 traveled to Dac and dived the freighter into Dac's oceans with the intent of picking up Jao and Ania's escape pod. With much difficulty, Sauk succeeded in using the freighter's gun turret to fire a harpoon which caught the escape pod."}, {"tag": "p", "text": "Sauk and AG-37 then towed the escape pod into an abandoned section of the Mon Calamari Shipyards. During their reunification, Sauk and AG-37 met Luen and Tikin. The four companions then discussed their next plans. While Jao Assam wanted to take out Darth Luft in the hope of finding Darth Wredd, Ania and AG-37 advised returning to AG-37's freighter and waiting for reinforcements to arrive. Fearing that Jao's operation would endanger his young son Tilin, Tikin abandoned the group and returned to the shipyards. In the end, Sauk along with Ania, AG-37 and Luen departed on AG-37's freighter while Jao went to confront Darth Luft. Meanwhile, AG-37's freighter was pursued by pirate starfighters but their pursuers were destroyed by a Galactic Federation Triumvirate task force which had arrived to deal with the pirates. Master Val and Admiral Gar Stazi had intercepted Jao's transmission and decided to end the plight of the Mon Calamari and Quarren slaves."}, {"tag": "p", "text": "During the Liberation of the Mon Calamari Shipyards, Stazi's forces flooded the Ring with water, overwhelming the pirates and allowing the Mon Calamari and Quarren slaves to regain the upper hand. Meanwhile, Jao Assam hunted down and killed Darth Luft. During the uprising, the pirates opened the holding cells holding the slaves' families to zero-gravity vacuum, intending to punish the slaves for rebelling. The torrent of water formed a wall of ice, which saved many Mon Calamari and Quarren from certain death. Sauk and his companions witnessed this atrocity and attempted to shut the space doors but were unable to because the controls were covered in ice. Unable to shut the exits manually, Ania sent Jao's comm droid to hot-wire the controls and shut the doors, saving many lives. Following the defeat of Luft and the pirates, the newly-liberated slaves were allowed to settle in the flooded shipyards."}, {"tag": "p", "text": "Prior to his departure from the Ring, Sauk met up with Aunt Luen, who had adopted the late Tikin's young son Tilin. Tikin had been killed by Darth Luft and his death had sparked the slave uprising. Luen attempted to encourage Sauk to stay with the refugees in their new home. While Sauk felt at home within the flooded shipyards, he was still loyal to his friends and kindly declared Luen's offer. However, he praised Luen for adopting Tilin. AG-37's freighter departed into hyperspace. While traveling, Jao received an incoming message from Darth Wredd, the Sith they had been hunting. The Sith Lord gloatingly informed Jao that he had been playing into the latter's hands by following his trail and killing Darth Luft. This brought the rogue Sith closer to completing his final plan. He even offered Jao a place in his new Sith Order, which would be based on the Rule of Two. Sauk was present during this transmission. Despite Jao's despondency, Ania assures him that he has done good by liberating slaves. If they could free slaves, she reasoned that they could also take down an \"arrogant\" Sith."}, {"tag": "h3", "text": "Ania's kidnapping"}, {"tag": "p", "text": "One year after the events of the Carreras Incident, Sauk and his companions were running short on credits. At his recommendation, AG-37 did a delivery run to Lasgo Port, a spaceport on a remote planet that was surrounded by an orbital minefield left over from the Second Imperial Civil War. After navigating through the minefield with much difficulty, AG-37's ship landed at Lasgo Port. While touring the town, Ania attempted to tame a yarthul, a large quadruped beast native to the planet, in an attempt to get some extra credits. Ania failed and lost her comlink as collateral. While walking through Lasgo Port, Jao found that Ania was wanted for the murder of an Imperial Knight named Teemen Alton. When Jao confronted Ania, she denied murdering the Knight, insisting that Ania had been the first Knight she had ever met. Suspicious, Jao questioned why she was residing in the remote Carreras system around the time of the alleged murder."}, {"tag": "p", "text": "While departing Lasgo Port's planet, AG-37's freighter had to travel through the minefield again. While passing through the minefield, their freighter's fuel injection bay was hit by some small-scale blaster fire, which was mistaken for asteroid debris. The ship crew sent their Imperial communications droid to fix the damage. While repairing the fuel bay, the communications droid discovered a damaged starship nearby with its crew alive but in distress. AG-37's freighter docked with the damaged starship and Jao, Ania, and their companions made contact with the crew. During that meeting, Ania met her former love interest Ramid, who claimed that his ship's net isolator had been damaged by a mine causing the ship's shield systems to break down. With their shields inoperative, the starship was unable to travel through space."}, {"tag": "p", "text": "Due to his engineering expertise, Sauk offered to have a go at repairing Ramid's crippled starship. While traveling back to AG-37's freighter to get repair tools, Sauk raised his suspicions about the meteor damaged sustained on their freighter. Jao agreed that the damage on their starship had been no coincidence and suggested that Ramid had deliberately opened fired on their freighter. Using subterfuge, Ramid led Ania deeper into his starship on the pretext of having something to talk about with her. However, this was all a ruse. Ramid then closed the blast doors and detached from AG-37's freighter. Once Ania was separated from her companions, Ramid and his crew took her captive."}, {"tag": "p", "text": "Ramid's starship then opened fire on AG-37 freighter, attempting to blow it up in the minefields. Jao narrowly saved their starship from destruction. However, Ramid and his crew took advantage of the explosion to make a jump into hyperspace, taking the captive Ania with them. Sauk, along with Jao and AG-37, quickly realized that Ania had been kidnapped. Following Ania's kidnapping, AG-37 attempted to track Ramid's starships' communications but received a response signal from her comlink, which they traced back to Port Lasgo. Since Ania had lost her comlink as collateral during her failed attempt to tame a yarthul, Jao was skeptical that it was actually her and speculated that she did not want to be found."}, {"tag": "h3", "text": "Defending Ania"}, {"tag": "p", "text": "When Jao Assam expressed his suspicions about the close timing between Ania losing her comlink and being kidnapped by her old friends, Sauk rose to her defense and asserted that Ania did not kill the Imperial Knight anyway. Jao suggested that Ania and her kidnappers could be anywhere in the galaxy by now. However, Sauk pointed out that Ramid's starship had made a cold jump into hyperspace and deduced that they could have gotten no further than two star systems before their fuel ran out. AG-37 then added that this situation would make their task much harder to guess their next destination. Sauk then commented that if Ania had secretly been a Sith, AG-37 would have known about it. To dispel Jao's suspicions about Ania, Sauk related how Ania had vouched for him when he had been homeless and hungry on the streets of Carreras Minor even though he was a total stranger."}, {"tag": "p", "text": "Seeking a second opinion, Jao turned to AG-37, who had known Ania for a long time. AG-37 recounted how he had first encountered Ania near the end of the Second Imperial Civil War in the Selvatas system. Ania had escaped from an Imperial prison camp on Drash-so and had pulled a gun on AG-37, who was doing business in the system at the time. However, AG-37 took pity on her and gave her a free ride to the Carreras system, where she established a junkyard. Sauk was surprised to learn that Ania had pulled a gun on AG-37, an assassin droid. AG-37 responded that Ania had never lacked courage of luck. When Jao asked AG-37 why he had taken pity on here, AG-37 explained that he had made an unspecified promise to Ania's ancestor, the smuggler Han Solo more than a century ago."}, {"tag": "p", "text": "The three companions then resumed their quest to discover Ania's whereabouts and to ascertain the truth about her past. After Sauk and AG-37 ruled out most of the galaxy, the two speculated that Ania's kidnappers were traveling to a remote planet with a few small settlements where they could refuel without and questions asked. Jao was not sure that Ania's kidnappers were bounty hunters and wondered whether they would have gone to the nearest Triumvirate official. Still questioning Ania's innocence, Jao suggested that she had deliberately disappeared due to the seriousness of her alleged crime and the hefty bounty on her head. However, Sauk refused to believe that she was guilty until they heard her side of the story. He told Jao that nothing they had seen in AG's memory had convinced him to change his mind."}, {"tag": "p", "text": "When Jao suggested that AG-37's memories put things in a different light, Sauk questioned the Knight why he was so unwound by the murder of the Imperial Knight since he had left the Order behind. In response, Jao explained that while the Force was leading him in unexpected directions, he still had not forgotten his vows. He reiterated that Teemen Alton was a Knight he had looked up to and respected and would not take his murder lightly. AG-37 explained that what the three of them had seen in his memory records were circumstantial. He added that extreme positions would often lead people to carry out extreme decisions that produced extreme outcomes. Sauk and AG-37 then proceeded to narrow down Ania and her captor's possible locations."}, {"tag": "p", "text": "When Sauk made the oft-hand comment that they needed someone who could see the future and magically locate friends, Jao commented that non-Force sensitive individuals did not full understand the limitations of the Force. AG-37 then entered the conversation by commenting that while he had no sensors that could tap into the Force, he understand something that both Jao and Sauk did not: that circumstances and sentients changed. He argued that while a vision could show someone a sliver of the future, it could never tell you what role the actors were playing. He argued that Ania's past may have informed her but did not define who she was. In the end, AG-37 reasoned that seeing into Ania's future would be unhelpful without fully understanding her past."}, {"tag": "p", "text": "Sauk then entered into a lengthy philosophical discussion with Jao about the Force. Jao explained that a Force vision was a powerful phenomenon and that ignoring it could lead to unforeseen circumstances. Jao also argued that the past did define some people and that was the key to unlocking their motives. Sauk disagreed and pointed out that he had consigned himself to the life of a lowly miner following the destruction of Dac until Ania had set him right. He recalled the sense of despair and hopelessness he had sunk into following the Sith Genocide of Dac. He was only able to return to his homeworld to confront his fears solely because Ania needed help. After Jao commended Sauk's bravery during the liberation of the Mon Calamari Shipyards, Sauk concluded that his life experiences showed that the past did not always define a person's character. Getting back to business, Sauk suggested checking out the star system that they were entering for any signs of Ania. Jao concurred and the two committed themselves to finding Ania so that she could tell her side of the story."}, {"tag": "h3", "text": "Rescuing Ania"}, {"tag": "p", "text": "Running low on fuel, Sauk and his friends headed to the next planet on the nearest jump away: a barren planet that rained glass and acid. Upon landing, they found Ramid's wrecked starship but found no trace of Ania or her estranged lover Ramid. However, Sauk found a thin trail of blood leading down the gangplank. Jao reasons that Ania and Ramid could not have traveled far on foot especially if one of them had been injured. Sauk found a storage for a speeder bike aboard the starship but found that the bike had gone missing. AG-37 deduced that Ania and Ramid had traveled a considerable distance and suggested scanning the ground from the air. Before they could embark on their hunt, the skies began raining glass and Sauk received a cut on his head. Due to the highly inhospitable weather, the three companions were forced to return to AG-37's freighter for shelter. Since Jao and Sauk's hide could not withstand the glass, AG-37 continued the rescue mission alone. His metallic body sheltered him from the sharp glass. AG-37 told them to be ready to take off as soon as the storm had cleared."}, {"tag": "p", "text": "While waiting for the \"glass storm\" to subside, Sauk and Jao received a holographic message from Master Yalta Val. Master Val had recently visited the medical records at the Triumvirate archives on Coruscant]and found that Teemen Alton's real killed had a prosthetic arm. Since Ania was completely biological and had no artificial arms, she was innocent. After the storm had subsided, Jao and Sauk received a transmission that AG-37 had spotted Ania and Ramid heading on a speeder bike to a remote settlement. Convinced of Ania's innocence and knowing her location, the two flew AG-37's freighter to the settlement. Jao arrived at the settlement just in time to save Ania from being attacked by a mysterious bounty hunter, who had already killed Ramid. This bounty hunter was Teemen Alton's true murderer and wanted to frame Ania for a crime she had never committed."}, {"tag": "p", "text": "Jao's appearance enabled Ania to escape through a window into an acid rainstorm. Fortunately, she was rescued by AG-37 who at a great risk to his droid body carried Ania to safety in a cave. The bounty hunter managed to disorientate Jao with a thermal detonator and recapture Ania. She then attempted to frame Ania for the murder of Teemen Alton by severing a left hand and implanting her own prosthetic hand. However, the bounty hunter was stopped by Jao and was killed following a lengthy confrontation. During this confrontation, Sauk remained aboard AG-37's freighter manning the cockpit. While flying above the settlement, he tried to contact AG-37, Jao, and Ania but received no response since they were preoccupied with other matters. At that moment, Sauk was contacted by an Imperial shuttle which had arrived on the barren planet to arrest Ania for her alleged crime."}, {"tag": "p", "text": "By the time that Sauk had landed his freighter at the ruined settlement, a squad of Trandoshan stormtroopers had already arrested Ania Solo. Sauk confronted Jao for allowing the Imperials to apprehend Ania but Jao replied that there was little he could do. When Sauk asked Jao why the Imperials had not arrested him for deserting the Imperial Knights, he explained that the troopers were merely grunts who had not been searching for him. Sauk then advocated following Ania and rescuing her. Jao then told Sauk that he had found evidence that would exonerate Ania: the severed hand of the bounty hunter who had been stalking her. After recovering the damaged AG-37, the three companions traveled on AG-37's freight to Coruscant, the galactic capital. Using this new evidence, Jao was able to secure Ania's exoneration and release."}, {"tag": "p", "text": "Following Ania's release, Sauk and AG-37 met her outside the courtroom. After Sauk and Ania embraced, Ania recounted how the bounty hunter's prosthetic hand matched the evidence that Master Yalta Val had found in the Triumvirate archives. During the proceedings, Val had represented her until Jao arrived with the crucial piece of evidence. The real murderer of Teemen Alton had been Ania's former prison guard who had assumed the persona of a bounty hunter. When Sauk asked Ania why she had been sent to Drash-so in the first place, she admitted murdering a particularly unsavory man. However, the jubilation surrounding Ania's release was cut short by news that Jao had just been arrested and imprisoned for deserting the Imperial Knights, a crime which carried the death penalty. By returning to Coruscant, Master Val explained that Jao had effectively given himself up to the authorities."}, {"tag": "h3", "text": "Rescuing Jao"}, {"tag": "p", "text": "The following day, Ania Solo unsuccessfully sought an audience with Empress Marasiah Fel to secure clemency for Jao Assam. Rebuffed, she returned to the hangar bay where AG-37's freighter was berthing. While conversing with Sauk and Ania, Ania was adamant that they would not leave Jao behind and was incensed by Empress Fel's refusal to see her. When Sauk tried to rationalize the Empress' actions by suggesting that she was preoccupied with other matters since she ruled a third of the galaxy, Ania revealed to Sauk and AG-37 that she was a distant relative of Empress Fel. At that moment, AG-37 received word over the nets that Jao had escaped. Before the three companions had time to absorb this news, a squad of stormtroopers arrived and took Ania away for a private audience with Empress Fel. During the meeting, AG-37 and Sauk waited aboard AG-37's freighter."}, {"tag": "p", "text": "During the Solo-Fel meeting, the Empress confided in Ania that she was certain that Jao Assam had not fallen to the dark side of the Force but was rather following his vows as he saw fit. However, the Empress was unwilling to break the law by showing favoritism to Jao, who had deserted the Order to hunt down the rogue Sith. Despite this predicament, the Empress saw a solution to Jao's legal situation. If Ania were to find Jao and bring him back, she would be willing to consider finding a loophole around the desertion charges. Empress Fel assigned Ania and her companions with a platoon of Trandoshan stormtroopers and sent them to rescue Jao. Ania agreed to lead the mission provided the Empress allowed her to use AG-37's freighter instead of the Triumvirate's ships. After Ania briefed the stormtroopers, AG-37's freighter departed into hyperspace to find Jao. They had no clue to his destination so they decided to wait for Jao to transmit a signal to them."}, {"tag": "p", "text": "Meanwhile, Jao and Wredd landed on the floating world of Mala. On Mala, Wredd tricked Jao into transmitting Mala's coordinates to Ania and her companions, intending to lure both the One Sith and Empress Fel into a trap. As planned, Jao's Imperial comm droid, which was stationed aboard AG-37's freighter, received the transmission. Ania intended to change their course as soon as the comm droid had finished feeding the coordinates to the freighter's navigation computer. AG-37 was skeptical of finding anything at their location since it was far from any star system or any current hyperspace route. However, Ania was adamant that there was something on the other side of that hyperspace jump since that was where Jao's message had originated from. Sauk was afraid that it was a trap but Ania insisted on going there since they had no other leads on Jao. In the end, AG-37 and Sauk complied with Ania's suggestion and changed the freighter's course."}, {"tag": "p", "text": "While Ania went to the passenger compartment to brief the Trandoshan stormtroopers about their change of plans, Sauk and Ania manned the cockpit. By the time Ania had finished her briefing, AG-37's freighter was entering the orbit of the floating world of Mala. AG-37 reasoned that this rogue planet was not listed on the official star charts. Sauk was checking the trajectory and was dumbfounded to find that their destination was no other that the rogue planet which they had encountered earlier during the Carreras Incident."}, {"tag": "h3", "text": "The Mala trap"}, {"tag": "p", "text": "As AG-37's freighter descended into Mala's atmosphere, Sauk asked Ania which part of the planet they were going to begin their hunt for Jao and Darth Wredd.\nAnia then caught sight of the wrecked Carreras G51 communications array and urged AG-37 and Sauk to land their freighter near the site. Sauk then took part in the search party which explored the cave near the wrecked communications array. Ania ordered her stormtroopers not to send any offworld communications but the commanding officer, Blue Two, hung back from the rest of the group and sent Ania's coordinates to Empress Fel. They quickly found that Jao had been left strung up in the cave and Ania freed him. However, Jao quickly revealed that Darth Wredd had tricked him into sending the coordinates to Ania's rescue mission in order to lure the Imperials to Mala. There was also no sign of the elusive Darth Wredd."}, {"tag": "p", "text": "A large fleet of civilian ships landed on Mala's surface. This turned out to be a large army of One Sith acolytes led by the Twi'lek diplomat Fanoste, who demanded that Ania and her companions hand over Darth Wredd. The One Sith sought to kill and hunt down Darth Wredd since his insurgency sabotaged their plans to infiltrate governments and corporations across the galaxy in order to restore their \"golden age.\" Fueled by blood lust and hatred, the One Sith horde advanced on Ania's party. During the ensuing fighting, Sauk and AG-37 opened fire on the advancing One Sith. Darth Wredd soon resurfaced and helped Ania's party to fight off the One Sith; even handing Jao a Sith lightsaber. Outnumbered, Sauk and his companions retreated into a defensible position within the wrecked communications array. Meanwhile, Darth Wredd and Jao kept the One Sith preoccupied by using their combined Force powers to bring down a large piece of the communication array's wreckage on the advancing Sith horde, delaying them."}, {"tag": "p", "text": "While setting up their positions within the wrecked structure of the Carreras communications array, Blue Two suggested that this place was a good place to make a stand since it was quite defensible. However, Sauk quickly recognized Blue Two as the stormtrooper who had held back while they were exploring the cave. Distrusting the stormtrooper, Sauk accused him of sending their coordinates. The Trandoshan stormtrooper vehemently denied the charge, and reiterated that he would never betray his Empress. Darth Wredd and Jao arrived, and Wredd confirmed that the stormtrooper was telling the truth by revealing that the One Sith were actually after him. He claimed that the One Sith had discovered his presence on Mala since he had been sloppy. In reality, Darth Wredd had intended to lure the One Sith to Mala in order to destroy them for the harm that they had wrecked on him, his family, and his homeworld."}, {"tag": "p", "text": "Sauk was present when an argument broke out between Darth Wredd and the Imperial Knight Jao Assam. Wredd tried to rationalize his actions by claiming that he was doing the Triumvirate a service by rooting out Sith infiltrators. Wredd also tried to recruit Jao into his new Sith Order, which would be based on the Rule of Two, but was rebuffed by the young Knight. While they were temporary allies since they were fighting against the One Sith, Jao insisted that he was loyal to the Empress and would never join the dark side. At that point, Sauk sounded the alarm that the One Sith had caught up with them. Despite fighting back, they were soon outnumbered by the One Sith. During the fighting, a One Sith attempted to stab Sauk from behind but the attacker was incinerated by a laser cannon fired by an Imperial Predator-class starfighter, the standard starfighter of the Fel Empire."}, {"tag": "h3", "text": "Imperial reinforcements"}, {"tag": "p", "text": "Sauk and his companions quickly realized that Empress Marasiah Fel had arrived with a fleet of starships and an an army of Imperial Knights. After the One Sith rejected an ultimatum that they surrender, the Imperial Knights launched a ground assault on Mala. This led to a bloody and violent battle known as the Battle of the Floating World. During the fighting, Sauk and his companions helped to deliver insect bites against the One Sith. While AG-37 fired his twin blaster rifles at the Sith, Ania and Jao rescued Antares Draco, the head of the Imperial Knights and Empress Fel's lover, who had been wounded by a One Sith acolyte. This earned them both the good will of Draco and the Empress herself, who had entered the battlefield in response to Draco's plight."}, {"tag": "p", "text": "After Ania recovered a heavy repeating blaster from a fallen stormtrooper, she convinced Sauk to help her blow up a Chadra-Fan Lander that was occupied by the One Sith. While Sauk used Draco's comlink to get the Imperial Knights to evacuate Sector Two-Point-Four, Ania fired her blaster rifle at the enemy starship, causing it to explode and kill or maim many One Sith in the process. Darth Wredd also aided the Imperial Knights by killing numerous Sith. Despite his help, the Imperials distrusted him because they knew that a Sith was only motivated by hatred. Darth Wredd's actions were fueled by his desire for vengeance against the One Sith, who had killed his family and destroyed his homeworld of Mala. He intended to destroy the One Sith completely."}, {"tag": "p", "text": "By dusk, the Imperial Knights had gained the upper hand over the One Sith and slaughtered most of their opponents. The battlefield was littered with thousands of corpses. Sauk was present when the Empress ordered her forces to evacuate all their wounded and to hunt down for any Sith survivors. AG-37 commented that the number of dead Sith was astonishing and pondered whether these were the last One Sith acolytes left in hiding. While Empress Fel was busy tending to the wounded Imperial Knights, she was attacked and stabbed in the chest by Darth Wredd. Before he could finish off his work, he was attacked and pursued by Jao Assam, who succeeded in slicing off both his hands. Despite severely incapacitating his opponent, Jao refused to kill the rogue Sith, knowing that Wredd wanted to trick him into slaying him in anger in order to lead him down to the dark side. In the end, Ania resolved this dilemma by shooting Darth Wredd with a heavy repeating blaster, sending him to his death and destroying the last known Sith."}, {"tag": "p", "text": "Following the battle, Empress Fel received medical treatment and survived her wounds. AG-37, Ania, and Sauk were also present when Jao gave a postmortem of the battle. When Sauk expressed his bemusement at why Wredd would turn on the Empress at the last minute and pondered whether Wredd had suddenly remembered that he was a Sith, Jao explained that Darth Wredd had completely given himself over to the dark side. However, Wredd still hated the Sith for what they had done to him, his family, and his homeworld of Mala. He wanted to destroy them and thus he engineered the Battle of the Floating World. However, despite the success of his plan, there was still only one Sith left: himself. Having delved too deeply into the dark side to believe in redemption, he had deliberately committed suicide by goading Jao into attacking him. Wredd thus almost succeeded in creating a new Sith in the process. When Ania assured Jao that he was not \"dark side material\", Sauk tried to comment but was interjected by Ania. Ania then dismissed the need for the Force when a sentient being owned a good blaster. When Sauk asked whether she was the source of that quote, Ania replied that she was sure that she had said it before."}, {"tag": "h3", "text": "A life of adventure"}, {"tag": "p", "text": "Following the events on Mala, Sauk and his companions returned to Coruscant. Ania secured an audience with the Empress Marasiah Fel, who was bedridden and recovering from her injuries. Ania was allowed to enter Empress Fel's medical bay by Antares Draco, who was grateful to the junk dealer for saving his life on Mala. Out of gratitude for Ania's help and bravery, Fel offered to make her the captain of her personal guard. However, Ania declined the offer but managed to convince the Empress to drop Jao Assam's desertion charges. Jao was also allowed to leave the Imperial Knights and to join Ania and her companions on their travels throughout the galaxy. Ania then rejoined her companions at the hangar bay housing AG-37's freighter where she was greeted by Sauk and Jao who were delighted at the success of her meeting."}, {"tag": "p", "text": "Sauk was also present during a farewell meeting between Jao Assam and Master Val. With the apparent demise of the Sith, Empress Fel had announced plans to reform the Order by removing the rule that the Knights had to pledge complete loyalty to the Empress. Jao also promised his Master never to stray from the light side of the Force. Jao's Imperial comm droid was also allowed to join Ania's party. After embracing Val for the final time, Jao departed with Ania's companions into space. Prior to their departure, Sauk asked Ania about what the Empress had wanted from him. Ania explained that the Empress had offered her a job as the head of her personal guard, a very lucrative and esteemed job offer. However, Ania revealed that she had turned down the offer simply because she could not stand Coruscant."}, {"tag": "p", "text": "By the following year, Sauk and his companions were traveling throughout the galaxy. At some point, the stabilizing core on AG-37's freighter broke down and Sauk went to a cantina to procure a new one. There, he managed to purchase a retrofitted stabilizing coil from Jariah Syn and his companions Cade Skywalker and Deliah Blue. While Sauk was unhappy at having to fork out a large amount of credits to pay for the coil, he reluctantly agreed to buy it after Jariah pointed out that it was difficult to obtain a new coil in this star system, Sauk's purchase of the starship part came at an opportune moment. Later, Sauk, Ania, Jao and AG-37 were attacked."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In his youth, Sauk was adventurous and wanted to go an explore the wider galaxy. This led him to apprentice himself offworld as a trainee engineer; a decision which he later lived to regret since he lost contact with his family following the Sith Genocide on Dac. Due to the loss of his family during the Sith Genocide on Dac, Sauk became a pessimist who at times was consumed by moments of grief and guilt. Consequently, Sauk harbored the desire in his heart to return to Dac in order to make peace with his past. In 138 ABY, Sauk saw a perfect opportunity to do so after he and his traveling companion AG-37 received a distress transmission from their companions, Ania Solo and Jao Assam. By returning to the ring to rescue his companions and the enslaved Mon Calamari and Quarren there, Sauk was able to regain a sense of purpose to his life and came to treasure his friends. During the fighting, he helped Ania to save countless Mon Calamari and Quarren captives from being exposed by the pirates to the vacuum of space. In the end, Sauk's loyalty to his friends led him to decline an offer by his liberated compatriots to settle down in the flooded interiors of the Mon Calamari Shipyards."}, {"tag": "p", "text": "Sauk also had a warm friendship with Ania Solo which dated back to the time when she took him under her wing when he was living on the streets of Carreras Minor. Despite being total strangers, Ania was compassionate enough to vouch for him so that he could get a roof and a meal. Due to this small act of kindness, Sauk always held Ania in high regard and was the first to spring to her defense when she was framed for the murder of the Imperial Knight Teemen Alton. Despite being from separate species, Sauk liked Ania enough to hug her. As a Mon Calamari refugee living in the aftermath of the Second Imperial Civil War, Sauk had to endure constant racial taunts while working with at a Shifala mine in Carreras Minor's ice ring. While Sauk was rightfully skeptical about the success of Ania's \"get-rich-quick\" scheme after she found the Imperial Knight Yalta Val's lightsaber, he grabbed the opportunity to move offworld with both hands, discontented with his unhappy work environment. When a better opportunity presented itself, Sauk willingly accepted AG-37's offer to serve as his engineer."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Sauk was a skilled engineer who was able to repair various objects including starships and droids. The assassin droid AG-37 was sufficiently impressed with his improvised workmanship to offer him a job as an engineer aboard his freighter. Sauk accepted the offer despite its low pay because AG-37 was a good friend whom he found preferable to working in a Shifala ice mine. While Sauk was a poor combatant and was wounded during a skirmish with Darth Wredd, he was a good team player as best shown when he joined forces with Ania to blow up a Sith Chadra-Fan Lander during the Battle of the Floating World."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sauk first appeared as a protagonist in Corinna Bechko and Gabriel Hardman's Star Wars: Legacy Volume 2 comic series, a spinoff of Dark Horse Comics' popular Star Wars: Legacy comic series. According to Bechko, she and her co-writer chose to include a Mon Calamari protagonist in their story because the Mon Calamari species had a significant role to play in the original Star Wars: Legacy series, which ran from 2006 to 2010. They wanted to explore the species' plight through the lens of a member of that species. Both Hardman and Bechko also liked the fish-like design of the Mon Calamari species. According to Hardman, Sauk's engineering were vital to the survival of Ania's company throughout the series. The script-writer also mentioned that he had an affinity for the Mon Calamari species since Admiral Gial Ackbar was one of his favorite characters from the Original trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}