{"url": "Satine_Kryze", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Clan Kryze", "Category:Duchesses", "Category:Humans", "Category:New Mandalorians", "Category:Planetary leaders"], "nodes": [{"tag": "h1", "text": "Satine Kryze"}, {"tag": "p", "text": "Satine Kryze was a Mandalorian duchess and the pacifistic leader of the New Mandalorians and the planet Mandalore during the waning years of the Galactic Republic. Believing that change was Mandalore's only hope for a future, she longed to move Mandalore and its people past its violent warrior history. Her goals mired her in controversy throughout her leadership, and she faced opposition from conservative Mandalorian groups who rejected her peaceful ideology. As the Republic's stability became threatened by the pan-galactic Clone Wars, Kryze attempted in vain to keep Mandalore out of the conflict. One of the primary and most vocal opponents of the war, Kryze fought against the rising militarism and nationalism in the Republic that threatened her people. The burden of peace cost Kryze nearly everything as the war continued, and she ultimately fell victim to the forces that conspired to take her down."}, {"tag": "p", "text": "A major proponent of the New Mandalorian movement in her youth, Kryze became the leader of Mandalore following the Mandalorian Civil War between the pacifist New Mandalorians and the Mandalorian warriors of tradition. The war cost an immense loss of life, and Kryze led Mandalore through reconstruction, helping the planet rebuild into a peaceful society. Her actions continued to face opposition from insurgent groups, most actively the terrorist group Death Watch, among whose members was Kryze's estranged sister Bo-Katan. While Mandalore maintained its peace and prospered under Kryze, the Republic began to fracture and entered war with the Confederacy of Independent Systems. Kryze chose not to choose a side in the conflict, making sure that Mandalore was neutral and becoming the leader of the Council of Neutral Systems. This move earned Kryze criticism from both the Republic and Confederacy, both of whom considered Mandalore to be a crucial asset to their war efforts."}, {"tag": "p", "text": "The Clone Wars tested Kryze's leadership to its limit, with her planet facing supply shortages and an increase in terrorist activity by Death Watch. The threat of Death Watch led the Republic to consider occupying Mandalore, but Kryze knew that the Republic had, in reality, wanted access to the system and that an occupation would only bring the war with it. Despite political setbacks, assassination attempts, and even an arrest warrant being levied against her, Kryze managed to appeal to the Republic Senate and halt the occupation before it could begin. Kryze's efforts also brought about the end of the Death Watch threat for a time. Mandalore continued to face issues as the war continued, with the growing presence of a black market on the planet and corruption among Kryze's fellow leaders. Kryze's defense of neutrality alienated her from the Republic and, although not many, she managed to find allies to help her deal with the crises, including her close friend, Jedi Master Obi-Wan Kenobi, with whom she had a complicated past."}, {"tag": "p", "text": "As the war raged on, Death Watch became affiliated with the rogue Sith Lord Maul, who brought together several crime families to aid them in defeating Kryze once and for all. Known as the Shadow Collective, Maul led Death Watch leader Pre Vizsla and their militia to Mandalore's capital, tearing through the city and causing chaos. Kryze was deposed and arrested, though infighting among Death Watch brought about the death of Vizsla by Maul's hand as well as the defection of Bo-Katan. Bo-Katan freed Kryze from prison, and the two reconciled in order to find a way to rid Mandalore of Maul. The rescue was short-lived, though before her recapture Kryze was able to contact Kenobi on Coruscant. Maul, having a lust for revenge against Kenobi for an incident from years earlier, murdered the captive Kryze in front of the Jedi. Kryze died in Kenobi's arms, proclaiming her love for her friend as her government lay in ruin and Mandalore's era of peace and pacifism ended."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Satine Kryze was a Mandalorian female human born to Duke Adonai Kryze on the Outer Rim world of Kalevala, into Clan Kryze under House Kryze. Satine was the sister of Bo-Katan, and the two shared a nephew named Korkie, with whom Satine was very close. Kryze spent her childhood living on Mandalore, the homeworld of the Mandalorian people. Mandalore was a planet with a long and violent history of warring factions both internal and external, and by Kryze's time there was a rising group known as the New Mandalorians birthed in the Mandalore city of Sundari who sought to channel the best aspects of Mandalorian society to rebuild their culture into a nonviolent and peaceful one. Kryze was a major proponent of the New Mandalorians and eventually became the de facto leader of the movement. Kryze's ideology was in stark opposition to more conservative-minded individuals on Mandalore who sought to preserve the old ways and continue the Mandalorian custom of waging war for the glory of their world. The New Mandalorians realized that this expertise in warfare was of no lasting benefit to the majority of Mandalorians and gradually began to grow in strength in order to eventually challenge the minority of  traditional warriors. These traditionalists used violence to hold on to power as Kryze, recognized by her title of nobility as Duchess, spearheaded the growing movement. Kryze's goals and aspirations estranged her from Bo-Katan, who believed in embracing Mandalore's martial past."}, {"tag": "h3", "text": "Mandalorian Civil War"}, {"tag": "p", "text": "In the year 42 BBY, as the New Mandalorians increased in strength and became a major political and ideological force on Mandalore, a civil war broke out between the reformist movement and the traditional Mandalorian warriors for control of the planet. The war decimated the already-damaged surface of Mandalore, and the capital city of Keldabe was devastated. Among the many casualties of the war was Satine's father. The conflict grew so large that it eventually required the intervention of the Jedi Order. The Jedi Council sent Jedi Master Qui-Gon Jinn and his apprentice, Obi-Wan Kenobi, to Mandalore to protect the young duchess from her enemies. The insurgents sent bounty hunters after Satine to eliminate her, forcing the two Jedi to remove the duchess from Mandalore for her own protection. They remained on the run with no certainties about what the next day would bring for nearly a year. At some point, they were attacked by a swarm of venom-mites on Draboon, and Obi-Wan carried Satine to safety. Unfortunately, the chivalric act was tarnished somewhat as the Padawan accidentally fell and dropped her unceremoniously, leaving her with a permanent scar from the fall. During this time, Satine and Obi-Wan began to fall in love and develop feelings for one another."}, {"tag": "p", "text": "Eventually, the New Mandalorians managed to defeat the martial traditionalists, and Satine was allowed to return to Mandalore. The death toll wrought by the war was immense, and the young duchess was left with the difficult task of rebuilding her world. Obi-Wan's commitment to the Order ended their relationship, and he left to continue his Jedi training despite his feelings for her. Both were left heartbroken by their separation, and Kenobi later admitted that, had Satine asked him to stay, he would have left the Jedi Order for her. Kenobi's master Jinn later brought up his relationship with Satine in the months prior to the Invasion of Naboo, while the two were reading over taxation bills submitted to the Galactic Senate as Jinn was suspicious that something was going on with them."}, {"tag": "h3", "text": "Reconstruction and the Clone Wars"}, {"tag": "p", "text": "After Kenobi and Jinn left Mandalore, Satine began work on the challenging task of rebuilding following the damages caused by the war. The considerable number of deaths had left Satine with a fierce hatred of violence, and she became a staunch pacifist. The surviving traditionalists were exiled to the Mandalorian moon of Concordia, where infighting for dominance led many to believe that they had died out. Sundari became the new capital  of Mandalore and a memorial to those who died during the war was established at Peace Park. Kryze reformed the government of Mandalore into a cabinet of ministers known as the Ruling Council, who were each charged with governing different aspects of the planet. Although Kryze oversaw the workings of the ministry, the body itself was chaired by a Prime Minister. By the time of the Clone Wars, the position was occupied by Almec. While Mandalore was under the direct jurisdiction of the Ruling Council, the other planets and moons of the Mandalore Sector became provinces and were led by various acting governors. Kryze outlawed many ancient Mandalorian weaponry and practices, such as the use of mobile vaults as a form of imprisonment. One of few martial practices to see continued use under the New Mandalorians was the tradition of the Protectors, a group of elite warriors who were charged with the protection of the Mandalorian ruler. As such, they formed the personal guard of Duchess Satine. Under her rule, Mandalore prospered and turned into a modern and peaceful society. However, Satine's reforms were actively opposed by a group of conservatives known as the Death Watch, which formed from the last remaining insurgents of the civil war. Despite their banishment and infighting, remnants of the traditionalists secretly rebuilt their strength to overthrow the duchess and reclaim Mandalore. The Death Watch considered Kryze and her pacifist ideals unworthy to rule Mandalore, especially in the wake of her father's death. They used fear tactics to recruit individuals from throughout the Mandalore Sector to their cause. Death Watch's attacks on Satine's government has limited success in swaying public opinion however, and throughout much of her reign the duchess and her ideals were popular among the people of Mandalore. Aware of the Death Watch's activities, Satine assigned several officials she trusted, such as Prime Minister Almec and Concordia Governor Pre Vizsla, to investigate and root out the movement."}, {"tag": "p", "text": "Under Duchess Satine's rule, Mandalore continued to prosper despite the Galactic Republic's increasingly fragile state. Several members of the Republic absconded from the government and joined the nascent Confederacy of Independent Systems, prompting a militarized response from the Republic that led to the outbreak of full-scale war with the Battle of Geonosis in 22 BBY. Early into the war, trade and supply routes became a point of contention and Kryze introduced rationing policies to her world. Despite being officially a member of the Republic, Kryze was adamant in keeping Mandalore out of the conflict and declared neutrality for her planet and her people. With the support of her people, Kryze became the head of the Council of Neutral Systems, a group of 1,500 star systems that wished to stay neutral. As the designated regent of the organization, Satine was a leading advocate for their position of neutrality as well as the primary representative in negotiations with the Republic Senate. Her choice to declare neutrality drew the ire of both the Republic and the Confederacy. Many in the Republic saw the Mandalore Sector as a key component in the war effort given its location between the Republic capital Coruscant and the Outer Rim along the Hydian Way. Both the New Mandalorians under Kryze and the Death Watch opposed a Republic presence on Mandalore, and as Death Watch began targeting Republic forces, rumors started circulating that Satine was building an army for the Confederacy."}, {"tag": "h3", "text": "Maintaining neutrality"}, {"tag": "h4", "text": "The Duchess and the Jedi"}, {"tag": "p", "text": "The rumors of Kryze building an army for the Confederacy emboldened following a terrorist attack on a Republic cruiser. The terrorist in question was seen by holographic feed wearing Mandalorian armor. The Jedi High Council was concerned about the incident and sent Obi-Wan Kenobi, now a Jedi Master, to meet the duchess and investigate the situation. Kenobi arrived at the Royal Palace, where he was greeted by Prime Minister Almec. Almec explained to Kenobi that Mandalore's warrior past was behind them, emphasizing that Kryze valued peace more than her own life. Satine entered the throne room and quipped about how Kenobi was once again on Mandalore to help her. Kenobi complimented her beauty, but Kryze rebutted his kind words and called him out for accusing her of treachery. Kenobi told Kryze that he wouldn't personally believe she could commit wrongdoing and showed her the hologram of the Mandalorian terrorist. Kryze, Almec, and Kalevala Senator Tal Merrik, one of Satine's oldest friends, again asserted that there were no Mandalorians in their government who would commit such an atrocity. When asked what happened to the perpetrator, Kenobi informed them that he had committed suicide to avoid arrest. Kryze expressed her belief that Kenobi's mission had been authorized by the Senate to intervene in Mandalore's affairs, but was corrected by the Jedi Master that the Jedi Council had sent him. Kryze invited Kenobi to join her on a stroll around the city, which he accepted."}, {"tag": "p", "text": "Kryze and Kenobi traveled to Peace Park, where Kryze told the Jedi that she was glad to see him again. Kenobi complimented her leadership of Mandalore, telling the duchess that her pacifism had paid off in the long run. Kryze told Kenobi that despite Mandalore's peaceful efforts, there were groups who continued to oppose her rule, specifically Death Watch. Kryze believed that they might be who Kenobi was looking for. She assured Kenobi that she had officials working to root out the criminals in an ongoing investigation, but refuted him when he asked how widespread the Death Watch movement was. Satine told Obi-Wan that Death Watch was just a group of vandalists, adding that her investigations had tracked them to the Mandalorian moon Concordia. Kryze and Kenobi's conversation gradually shifted to one about ideology. Kenobi stated that the job of a peacekeeper was to be on the front lines of conflict to solve the issue first hand. Satine disagreed, instead suggesting that the work of a peacekeeper was to ensure that conflict didn't have the chance to arise. Kenobi commented that her belief was noble, but not entirely realistic. Satine took aim at the Jedi Order's insincere justifications for promoting violence in the name of peace, suggesting that the \"reality\" Kenobi believed in was what made the Jedi abandon their ideals in the name of political convenience."}, {"tag": "p", "text": "As Kryze and Kenobi approached the Civil War memorial, the shrine exploded. The blast knocked down several civilian bystanders and destroyed part of the shrine. Kenobi asked Kryze if she was alright, but she brushed off her safety and ran to aid the injured. Kenobi followed her and told her that a group of vandalists was incapable of arranging an attack of that scale. Kryze suggested that it must have been an offworlder, but a hologram marker at the scene of the explosion showing the sign of Death Watch proved her wrong. Kenobi decided to take charge, ordering the Protectors to take Satine back to the palace and that all civilians present be kept at the scene for interviewing. As Kenobi helped Satine to her guard, one bystander broke from the crowd and began running. Kenobi chased after the fleeing man, and Satine followed him. Obi-Wan cornered the man on a balcony in the park. Once Kryze arrived, the man yelled in Concordian and jumped from the ledge and onto the glass below. Kryze ran to the balcony edge and looked over, wincing at the sight of the man writhing on the cracked floor. Accompanied by Obi-Wan, Satine descended to the level below, where she approached the dying man and held his hand. The man spoke to her in his native language and she responded in kind, comforting him in his final moments."}, {"tag": "h4", "text": "Warriors from the past"}, {"tag": "p", "text": "Having recognized the terrorist's dialect as Concordian, Kryze and Kenobi decided that it would be best to investigate the moon themselves and find Death Watch before they could carry out another attack. Kenobi's plan was for him to accompany the body as it was sent to the moon, but Kryze pointed out that Concordia was a province and that she would have to accompany him to set up a meeting with Governor Vizsla. The two set up a transport and left Sundari for Concordia. En route to the moon, Kenobi questioned whether or not it was an agricultural world, as he believed it to be. Kryze explained to him that before the Civil War, the moon had been converted to a mining-based economy at the cost of the native forests, which had recently begun growing back as the mining facilities were shut down. Once their ship landed on the planet, they were met by Governor Vizsla. Kryze introduced Kenobi to the Governor, who Kryze also identified as one of the leading officials in the investigation of Death Watch. With the body of the terrorist unloaded, Vizsla left to tend to the body. Kryze was stopped from following him by Kenobi, who asked that the duchess keep Vizsla occupied during their scheduled dinner. Kryze asked where he planned on going, and he replied that he was interested in looking at the mining facilities in private. Kenobi gave Kryze an earpiece so that the two could stay in contact if anything went wrong. The Jedi took a speeder bike from the hangar and left for the mines."}, {"tag": "p", "text": "Kryze arrived at the dining room as Vizsla was writing a condolence letter to the dead man's family and making arrangements for the body. Kryze lied to Vizsla that Kenobi would join them later on because he needed to meditate. As they had drinks before dinner, Kryze questioned what purpose the Republic or Confederacy had for spreading rumors that she was amassing an army. Vizsla simply replied that it was Death Watch, but Kryze believed that an external force was behind Death Watch's recent campaigns. Vizsla believed that it would have to be a leader of the Confederacy and told her that as the leader of the Council of Neutral Systems, she was a major hindrance to the Separatists' plans. Meanwhile, Kenobi had located one of the defunct mines and found it to be completely operational and developing weapons and armor similar to that of the terrorist who attacked the Republic Cruiser. As he searched the mine he was attacked by a member of Death Watch and taken hostage. As he was held in suspension on a production line, he contacted Kryze through her earpiece. Kryze responded to him in conjunction with Vizsla to keep herself inconspicuous. Kenobi instructed her to follow the tracking beacon on his comlink. Vizsla noticed something was off, but Satine managed to leave the room by suggesting that fresh air would do her good. Once out of the room, Kryze ran to the hangar and took a bike. The duchess sped off and followed Kenobi's signal to the mine."}, {"tag": "p", "text": "Kryze arrived at the mine and contacted Kenobi. She asked him where he was, and he sarcastically responded that she had to listen to the loud machinery of the production line to find him. Kryze took out her earpiece and left it on a control box, which she activated to set off a disturbance alarm. The duchess snuck into the room Kenobi was being held in as the Death Watch guards left to find out what had tripped the alarm. Kryze found Kenobi on the production line, about to be crushed by the machinery. The two sarcastically argued as Satine deactivated it before he could be crushed. The two Death Watch members returned and grabbed Kryze. Kenobi, still suspended on the moving production line, called out to Kryze as he was about to be dropped into a grinder. Satine kicked a barrel onto the grinder to jam it, and Kenobi jumped from the production line and knocked out the two Death Watch soldiers. Kryze and Kenobi continued their banter as they boarded an elevator. Kryze noted Kenobi's eagerness to fight, to which he mentioned her seeming lack of concern for the fact that he could have been killed. Kryze pointed out that he wasn't killed, adding that he still hadn't thanked her. When the elevator stopped, the doors opened to reveal a Death Watch warrior standing guard. Kenobi quickly took him out, only to notice that the two had entered into a Death Watch camp."}, {"tag": "p", "text": "A large group of Death Watch soldiers opened fire on Kryze and Kenobi. The two hid behind a large boulder near the elevator. Kenobi quipped that the two would have to stand and fight, adding that in Satine's case, just stand. Since the two soldiers in the mine had taken his lightsaber, he used a blaster from the guard he knocked out to fire at a trio of warriors flying towards the boulder, making quick work of them. He was tackled by another member of Death Watch, who Satine distracted by throwing a stone at him. The soldier fired at Kryze, who dodged the blasts and jumped behind the boulder. Kenobi took out the warrior and rushed to see if Kryze was alright. A group of Death Watch, led by their leader, advanced towards the boulder. The leader, who was in possession of Kenobi's lightsaber, removed his helmet, revealing that he was, in reality, Vizsla. Vizsla tossed Kenobi his lightsaber and told the Jedi that Kryze had tarnished the name Mandalorian and gave him the chance to defend her. Vizsla unveiled the Darksaber, and ancient Mandalorian weapon, and engaged in a duel with Kenobi. Kenobi managed to beat Vizsla, who ordered his soldiers to kill the Jedi. Three Death Watch warriors fired missiles at Kenobi, who dodged them with ease. The missiles turned to retarget Kenobi, who grabbed Satine and jumped down the elevator shaft before they could be hit. The two hit the ground as the missiles made impact and quickly made their escape from the mine, where Kryze and Kenobi made light banter once more. Kryze told Kenobi that they were on even terms, seeing as how they had each saved the other's life, but Kenobi jokingly replied that his rescue of her had been the more daring. Kryze rolled her eyes at his remark as they prepared to ride their bikes back to the city."}, {"tag": "h4", "text": "Voyage aboard the Coronet"}, {"tag": "p", "text": "In the aftermath of the bombing at Peace Park, Kryze ordered that the Civil War memorial be left in its broken state as a warning against pointless violence. With his role in Death Watch now known, Vizsla escaped surveillance and disappeared. Vizsla's disappearance interrupted the investigations into the scope of Death Watch and their operations, but their alleged affiliation with the Confederacy led many in the Republic, including Kenobi, to believe that Mandalore would have to openly side with the Republic to stop them. Kryze planned to travel to Coruscant to reassert her position of neutrality before the Republic Senate and stave off the threat of a Republic occupation."}, {"tag": "p", "text": "Duchess Kryze departed Mandalore for Coruscant aboard her personal vessel, the luxury yacht Coronet. She invited several senators to accompany her on her aircraft, including two members of the Council of Neutral Systems, Senator Onaconda Farr of Rodia and Senator Kin Robb, as well as Senator Merrik. The other dignitary, Senator Orn Free Taa of Ryloth, was not a member of the neutral faction. In addition to Kryze's personal guard and the crew of the Coronet, a small detachment of clone troopers led by Obi-Wan and his former Padawan, Anakin Skywalker, rounded out the security forces on the voyage. Kryze did not want the Jedi and their soldiers on the ship, but they were stationed onboard at the behest of her guests. Kryze spoke with her retinue about her reasons for remaining neutral, citing her opinion that war in and of itself was an affront to life. Kenobi's support of occupation had made Kryze bitter with him, and the two became aggressive and argumentative about their opinions following the Coronet's departure. Kryze opined heavily that the Jedi were no longer peacekeepers, which Kenobi argued against in response. The duchess saw Kenobi's reasoning for the Jedi's involvement in the war to be contradictory and hyperbolic, whereas Kenobi saw Kryze as a dreamer who only listened to those who agreed with her. Despite Skywalker and Senator Taa's efforts to settle the arguing, the two remained at aggressive odds. As the arguing became a standoff, Senator Merrik suggested that they put aside politics and went to dinner. Both Kryze and Kenobi gave in, and Kryze pushed Kenobi out of her way as she left the room."}, {"tag": "p", "text": "Meanwhile, in the cargo bay, two clone troopers went missing. The search team found a large shipping container knocked over and open with the contents missing. Kenobi reported to the dining room, where he asked Kryze and the accompanying senators to stay where they were until the situation was solved. While Satine and her guests stayed tensely seated at the dining table, Anakin contacted Kenobi and told him that he and the clones had located assassin probes in the cargo bay, and that one of the droids was heading up the lifts to the dining room. Obi-Wan ordered Kryze and the senators to stand back from the lift. The droid violently entered the room and killed two of Satine's guards before Kenobi managed to disable it. The brief moment of peace was broken quickly when smaller probe killers were ejected from the larger droid and started crawling towards towards the duchess and her retinue. While Obi-Wan did what he could to keep the droids away from the senators, Kryze took out a small but powerful deactivator pistol and fired at the probes. Kryze and Kenobi stood back-to-back as they took out the droids, easily shifting position in conjunction with each other. Kenobi questioned why Kryze was carrying a deactivator. Kryze defended herself by saying that, despite being a pacifist, she was still willing and able to defend herself. Kenobi joked that her contradiction made her sound like a Jedi. Once the droids were all destroyed, Kenobi reminisced about the swarm of venom-mites he and Kryze had encountered on Draboon during the Civil War. Kryze joked that she remembered the incident and still had the scar from when he had dropped her."}, {"tag": "p", "text": "Skywalker soon found from the cargo manifest that the container that held the assassin probes had been authorized to board the Coronet under the stamp of the Senate. Using this information, he and Kenobi deduced that one of the senators had ordered the crate onto the ship. Kryze and the senators, meanwhile, had reconvened for dinner. Senator Taa noticed that Kryze was not eating, and she explained that she had lost her appetite. Kenobi soon arrived carried a dish that Taa believed to be dessert, but Kenobi revealed that he was carrying one of the small probe killers. Kenobi explained that he believed the droid would attack the duchess and everyone besides the senator who had the droids brought onboard the ship. Kryze objected to Obi-Wan's use of interrogation, but he assured her that the situation was under control. Kenobi walked around the table, where the droid displayed hostility towards Senator Farr, Senator Robb, and Kryze, but did not react to Senator Merrik. Merrik knocked the tray out of Kenobi's hand, freeing the probe. The droid scurried towards Kryze, but Kenobi used a plate to bat it away. The droid attacked Senator Farr, who panicked as Kenobi sliced it in two using his lightsaber. Using the disarray to his advantage, Merrik grabbed hold of Kryze and put a blaster to her head, then left the room with her as a hostage. Merrik brought Kryze to the bridge, where he mercilessly killed the crew. The traitorous prince took the ship out of hyperspace and contacted a Death Watch soldier. Merrik told the soldier that he had succeeded in kidnapping Satine, but that he would need help making his escape. The soldier in turn told Merrik that reinforcements were on their way. Three Confederate boarding ships entered the space around the Coronet. The ships, which were carrying B2 battle droids, lodged themselves into the Coronet's hull, where the droids were deployed."}, {"tag": "p", "text": "Kenobi found Merrik and Kryze on the bridge, where he told the senator that he was under arrest. Still holding Kryze hostage, Merrik explained that he had wired the ship's engines to explode. Kryze pleaded with Obi-Wan not to try to free her when everyone on the ship's lives were at stake. Merrik left the room with the duchess, closely followed by Kenobi. Once they arrived at the Separatist boarding ships, Merrik sardonically told Kryze to say goodbye to Kenobi. Kryze, believing that it would be the last time she would ever see Obi-Wan, told the Jedi that she loved him and had loved him since their time during the Civil War. Though he didn't think it was the right time or place, Obi-Wan confessed that had she asked him to, he would have left the Jedi Order. Merrik was annoyed by the display, but as he started to leave Kryze dug her heel into his foot and freed herself from his grip, taking his blaster in the process. Merrik simply mused that even if he didn't take Satine to the Separatists, he still had the engines wired. Merrik also took note of the fact that if either Kryze or Kenobi killed him, they would prove that they were a hypocrite and a murderer respectively. Confident in his victory, Merrik dared either one of them to strike him down and prove themselves a cold-blooded killer. Before he could push the button to destroy the ship, Merrik was killed by Skywalker. Kryze threw the blaster aside and approached Obi-Wan, but before she could speak CC-2224 and the other clone forces arrived to inform the Jedi that the droids had been defeated. Satine simply told Obi-Wan that she had to return to the other dignitaries, and Kenobi responded that they would have to speak some other time."}, {"tag": "p", "text": "The Coronet arrived at Coruscant soon after, where the ship docked on a landing pad. Republic Supreme Chancellor Sheev Palpatine was awaiting their arrival. The Chancellor greeted the senators as Kryze approached Kenobi. Kryze told Kenobi that it was ironic for them to be meeting again following the incident, only now once again on opposing sides. Kenobi brushed their opinions aside and told Satine that the needs of her people were what was most important, adding that they were in capable hands. Satine told Obi-Wan that his words were kind and came from a thoughtful and committed Jedi. Their arguing and confrontational attitudes gone, Kryze jokingly told Obi-Wan that she still wasn't sure about his beard. Kenobi nervously asked her what was wrong with it, and she replied that it hid \"too much of [his] handsome face.\" Kryze smiled at Obi-Wan and walked towards the Util-313 bus with the Chancellor and the senators."}, {"tag": "h4", "text": "Friends in very few places"}, {"tag": "p", "text": "Despite being betrayed by Merrik, Kryze remained steadfast in her goal to keep the Republic from occupying Mandalore. On Concordia, a member of the Mandalorian guard located the new Death Watch base, where Pre Vizsla was mobilizing his forces to invade Mandalore in the event of a Republic occupation. Vizsla planned to strike once Republic forces arrived, becoming liberators in the eyes of the people. Meanwhile, in the Republic Senate, Kryze made her appeal to the Senate against a Republic invasion. Kryze's primary ally in her case was Senator Padmé Amidala of Naboo, who was opposed to the resolution as well. Supreme Chancellor Palpatine pushed for an occupation, using the bombing at Peace Park and Merrik's treason on the Coronet as the basis for his claims that Death Watch was a significant threat to the New Mandalorian government. Kryze explained to the Chancellor that Death Watch was not strong enough to destabilize her government and that her forces were close to finding the leaders of the terrorist organization. Kryze reasserted her position of neutrality, knowing that occupation would only lead to more violence. Vice Chair Mas Amedda denounced her speech to be the talk of an idealist, but Kryze stated that her words, and by proxy the words of her people, came from a place of pacifism and non-violence. The Chancellor informed Kryze that his office had received a message that morning, adding that she would find it illuminating. Amedda played a testimony from Kryze's friend and Mandalore's Deputy Minister, Jerec, arguing that a Republic occupation was needed to stop Death Watch. Kryze watched the testimony in shock, then ordered that the feed be stopped. Kryze told the Chancellor and Vice Chair that Jerec would not have said those things. The Chancellor continued the testimony, during which Jerec stated that Kryze's government was weak and that she acted out of pride. Kryze was quick to denounce his words and demanded to speak to Jerec, but the Chancellor informed Satine that Jerec had been killed in a Death Watch bombing on Kalevala. Palpatine used Jerec's death as a rallying point for the occupation to the distress and opposition of Kryze. Despite her pleading, the damage was done and the Chancellor ended the session."}, {"tag": "p", "text": "As she left the Senate building, Kryze was stopped by Obi-Wan, who had been present in the Senate chamber. Obi-Wan told Satine that he knew what had happened. Though she was grateful for his concern, Satine told him that she would be alright. Kenobi told her that he was still concerned, and went on to say that he didn't think she should make any decisions in her state of mind. Satine was confused by what he meant, and the Jedi explained that a person in her position would be hysterical, which infuriated the duchess. Kryze yelled at Obi-Wan, telling him that the Republic was attempting to impede on innocent people and that if more people were hysterical then they would be willing to speak up against the Republic as it trampled their rights. Kenobi softly told Kryze that her actions were foolhardy, again insulting the Mandalorian. Satine told Kenobi that his words were ironic, considering that he was one who rushed into battle without consideration as if on a crusade, pointedly telling him that he was, in her opinion, foolhardy. Upset and saddened by their encounter, Kryze boarded her airspeeder and departed. As Kryze's speeder left the Senate building, the navigation system failed and the transport lost control. The speeder had been wired by a Death Watch assassin sent to Coruscant to kill Satine. With the speeder accelerating and beginning to emit smoke, Kryze asked the pilot, Aramis, what was happening. Aramis ordered the Protectors on board to get Kryze off the speeder, then attempted to fly the craft closer to a platform ahead. Satine protested in fear of her friend's life, but the Protectors grabbed the Duchess and formed a protective circle around her. They jumped off the speeder and onto the roof of a building, remaining in their circle to keep Satine from being harmed. Kryze quickly got her bearings and stood up, only to see Aramis and the speeder hit a nearby building and explode."}, {"tag": "p", "text": "The increasingly distraught Kryze met with the Chancellor and Vice Chair in a private meeting later, where Kryze was disturbed that no charges were to be filed against whoever compromised her speeder. The Chancellor, however, found there to be no evidence of tampering with the controls and instead suggested that it was simply an accident. Kryze argued that it couldn't have been an accident due to how it happened so shortly after her defense of neutrality. Amedda agreed with Kryze, though to her horror he twisted her words and made the case that Death Watch was out of control and that the Republic had to intervene immediately. Kryze protested the Vice Chair's misuse of her words but the Chancellor rendered her position useless, given that the resolution was no longer up for debate and was in the hands of the Senate. Kryze left Palpatine's office to head to the Ministry of Defense, where she planned on speaking to a contact of hers who had information that would stop the occupation from happening. Outside the Chancellor's office, she was immediately greeted by Obi-Wan, who had heard about her accident. Kryze expressed her disgust with the Chancellor and Vice Chair, but found no words to describe them. Kenobi persisted in asking if she was well, and she explained to him that she wasn't hurt in the accident, though added that she hadn't told him to keep him from worrying. Kenobi laughed and joked that she had failed to stop him. Both Satine and Obi-Wan agreed that the attack proved that Satine had enemies on Coruscant as well. Obi-Wan intuited Satine's intent to follow up on the accident herself, but she didn't waver to his protests and told him that Republic authorities were not reliable. Obi-Wan tried changing her mind about being so self-reliant, telling her that she didn't need to be alone. As Kryze tried to explain her feelings, Senator Amidala approached the two. Amidala told Kryze and Kenobi that the Senate had completed its vote on the resolution, and had decided in favor of occupation. Kryze was confused and asked when the vote, which was meant to happen the following day, took place. Amidala told the duchess that, after the attempt on her life, the Senate had accelerated the vote and decided its outcome during Kryze's meeting with the Chancellor. Kryze, extremely upset at the sudden revelation, despondently told Obi-Wan that she was right not to trust the Republic."}, {"tag": "p", "text": "Knowing that getting the information from her contact in the Ministry of Defense, Davu Golec, was the only way to halt the occupation, Kryze went undercover on the streets of Coruscant to meet him. In a back alleyway of Sector GL5, Golec found Kryze and gave her a tape he had found buried deep in the Evidence Facility of the Ministry. The tape was the original testimony from Jerec, which Golec explained had been tampered with and altered before its presentation to the Senate. Golec was fatally shot by the Death Watch assassin after handing Kryze the disc. Kryze took out her deactivator and looked around for the killer, but before she could find him she was surrounded by civilians and a police droid. The onlookers mistook her as Golec's murderer, and the droid reported the shooting and identified Kryze as the killer. Several police units arrived at the scene, but the terrified duchess ran before she could be arrested. Satine was pursued by both the police units and the assassin, who made attempts to shoot Satine as she ran. Using her deactivator, Kryze disabled the police droid, which fell and tripped the police following it as Kryze disappeared into a large crowd. Kryze ran into an alley, where she spotted a man getting into his speeder. Kryze used the departing man as a distraction; the police units saw Kryze enter the alleyway, then saw the speeder depart. Kryze managed to evade notice, and once she was in the clear she contacted Obi-Wan. Obi-Wan was again concerned for the duchess, who asked her friend for help."}, {"tag": "p", "text": "Obi-Wan met with Satine at Monument Plaza, where the two sat back to back on a bench to avoid bringing attention to themselves. Obi-Wan asked Kryze to turn herself in, but Kryze handed him the disc and explained that it was the evidence she needed. The two deduced that Satine could not bring it to the Senate herself, figuring that since it was someone in the government who had doctored the recording, it would be destroyed upon arrival if given to the wrong hands. Kryze suggested that Obi-Wan bring it to Senator Amidala, knowing that she was someone they could trust. Two clone police units started walking towards Kryze and Kenobi's position, so the two got up and reentered the city's alleyways. Kenobi asked Satine what she planned to do while he was in the Senate, and she explained that she would turn herself in. Obi-Wan was anxious about the idea, but Satine reasoned that he would need a distraction to enter the Senate building and not be searched on account of their association. Obi-Wan countered that since he was a Jedi he wouldn't be searched. Kryze replied that times were changing. As they continued walking, the Death Watch assassin threw a detonator at the pair. Kenobi used the Force to push Satine out of the blast radius and he fell to the ground as the blast knocked him over. The assassin walked towards Satine, who ran out into the street as Obi-Wan ignited his lightsaber and engaged the soldier. The assassin knocked Kenobi's lightsaber out of his hand, and they two brawled into the street. Satine picked up Obi-Wan's lightsaber and tossed the weapon to him. Obi-Wan managed to subdue the assassin, who flew away in defeat on a jetpack. Kryze and Kenobi left and found a bus to the Senate building."}, {"tag": "p", "text": "Once at the Senate building, Kryze approached two guards and surrendered herself. With the guards distracted, Obi-Wan entered the complex unnoticed, giving the duchess a quick nod as he walked through the doors. Kenobi managed to bring the disc to Amidala, who interrupted the current session finalizing the resolution to play the recording for the Senate. The undoctored testimony from Jerec proved to the Senate that the New Mandalorians did not need intervention from the Republic and restored faith in Satine's ability to lead. With the new information now in the hands of the Senate, an emergency session was called to revote on the resolution. The Senate rescinded its earlier approval of the occupation and Mandalore was allowed to remain a neutral state. The news that the occupation was no longer underway soon found its way to Vizsla and Death Watch, whose plans fell through and were no longer supported by the Confederacy. Freed from custody, Kryze met with Amidala, Kenobi, Skywalker, and the Chancellor and Vice Chair later at an informal meeting in the Chancellor's office. Palpatine and Amedda offered Kryze an apology on behalf of the Republic, but Kryze did not accept their apology wholeheartedly. As the others left the office to finish ratifying the Senate's decision, Kryze and Kenobi stayed behind to talk. Satine thanked Obi-Wan for all he had done, saying that his actions were what made things right, but the Jedi disagreed and told the duchess that it was her unshakeable faith and determination that stopped the occupation. Kryze questioned who was behind the mysterious factors of the situation, namely who had tampered with the recording and who had tried to convict her of murder. Obi-Wan didn't have an answer for her and simply told her that times were changing."}, {"tag": "h3", "text": "An unending war"}, {"tag": "h4", "text": "The Duchess and the Senator"}, {"tag": "p", "text": "Kryze's decision to stay neutral soon brought major ramifications to her people. Satine effectively became an outsider to the Republic at large and was given no aid as trade routes became disrupted by the war and Mandalore faced supply shortages. Kryze knew that smuggling had become an issue on the planet, and asked Senator Amidala to visit Mandalore to help in finding a way to alleviate some of the issues. Amidala's visit was excitedly awaited by the people of Sundari, who gathered outside the dockyard to cheer on the senator's arrival. Kryze wanted to welcome Amidala in private and met the senator as she departed her ship. The two began discussing the crisis. Kryze recognized that the Senate was reluctant to aid Mandalore, but was reassured by Amidala that there were still members of the senate sympathetic to Mandalore and willing to help. As the two entered a speeder, Kryze asked that they put aside political discussion, as she wanted to surprise Amidala with the crowds gathered just inside the city. The crowds cheered on Kryze and Amidala, who made their way to the Royal Palace. Once at the palace, Kryze and Amidala began their formal business. The Ruling Council argued amongst themselves, unable to find a way to deal with the surge of black market dealings. Amidala noted to Kryze that Prime Minister Almec seemed overwhelmed, and Satine invited the senator to enter the discussion. The senator advised that they reject any illegal business dealings and trust in the Republic, but was quickly called a hypocrite, given that the Republic had their own issues with rising underworld operations. Satine was angered and embarrassed by the council's behavior and adjourned the meeting to let the tensions dissipate."}, {"tag": "p", "text": "Kryze and Amidala later attended a private dinner in the palace. Kryze inquired about Amidala's personal feelings about the ongoing war. Amidala admitted that Republic propaganda made the war seem to be in their favor, but her own sources contradicted it. She also admitted that she wished she and her homeworld, Naboo, had taken up the opportunity to become a neutral state as Kryze had with Mandalore. Satine took the moment to mention her own problems with the Republic, and though Amidala agreed with her she believed that there was still hope of solving those issues. Kryze told the senator that she arranged a visit to a new hospital that had opened, where she believed that the two would be able to see true good at work. The following day, Kryze and Amidala arrived at the hospital only to find it at full capacity with a large portion of the student populace. Kryze was disturbed by the sight and demanded to know what had happened. She was informed that children across the planet had been poisoned, though the doctors had no idea what had caused the outbreak. As Amidala discussed the sudden crisis with Doctor Zak Zaz, Kryze solemnly comforted one of the ill students. Kryze and Amidala met with Almec soon after, who guessed that Death Watch was behind the outbreak. Satine disputed this claim, reasoning that Death Watch had only targeted her and her administration, not children. Almec left to speak to the Ruling Council, and Kryze and Amidala became concerned about his lack of care for the sick children, many of whom had died from the poisoning. Kryze decided to mobilize her personal guard to conduct a secret investigation into the crisis after concluding that Almec and the council would be of little help."}, {"tag": "p", "text": "With her guard prepared to begin their assignment, Kryze and Amidala took it upon themselves to visit the schools where the epidemic originated from. The food given to the children was tested prior to their arrival by Doctor Zaz, and there were no signs of poison. Kryze asked whether or not the bottled tea the children had was tested, but was told that the drinks were not part of the school's menu and were allowed from an outside venue. One of these drinks was tested shortly after by Zaz, and was found to contain high levels of slabin, which had become lethal from the mixture with the tea. Knowing where the outbreak had come from, Amidala and Kryze traveled to the dockyard to read the school's import log to find the origin of the tea. Once at the docks, however, they discovered that the import log had been erased. The school's superintendent, who had come along, hastily walked towards a speeder and ignored Kryze's order to stop, but was arrested by two of Satine's guards. Kryze uncharacteristically threatened the schoolmaster with violence and demanded he tell her what he knew. The superintendent told her that he had welcomed the tea as a way to cut costs and make a profit for himself, but was unaware the drinks were poisoned. He told the duchess that he had only met with an importer named Siddiq on his end of the bargain. Once Satine and Amidala located Siddiq, who worked for a shipping company elsewhere in the city, he admitted his role in the black market ring and willingly gave up what he knew, believing that he was free of consequence by his corporate contracts. He told Kryze that the tea had been imported from Mooga and showed her a shipping log to back it up. Siddiq also told them that there would be a shipment from Mooga later that day."}, {"tag": "p", "text": "Kryze and Amidala, now knowing when and where to intercept the smuggled tea, undertook a discreet mission to locate the Moogan ship. Amidala and Kryze, escorted by one of the duchess' guards, enjoyed some light banter as they made their way to the dock, where they arrived just as the Moogan smugglers did. The three witnessed a customs official receive credits from the Moogans, who unloaded several crates of tea from their ship. Despite their evidence, Kryze could not convince Captain of the Mandalorian Guard Patrok Ru-Saxon of the illegal activity. Kryze accused Ru-Saxon of stalling their investigation, and she, Amidala, and the captain traveled to the docks once again, where they found two guards stationed at a warehouse. The two guards refused to comply with either Kryze or Ru-Saxon's orders and were quickly arrested. Ru-Saxon opened the door to the warehouse, where Kryze saw several Moogans and Mandalorians brewing the imported tea. The Moogans and their workers opened fire on Satine and her escort, and a firefight ensued. Ru-Saxon was shot during the fight, and Amidala had two of Kryze's guards push a storage container in front of the warehouse door. Amidala picked up a blaster and, with the two guards pushing the container into the warehouse, closed in on the smugglers, who were captured in quick succession. With the smuggling operation shut down, Satine ordered the warehouse to be burned down. Ru-Saxon protested that evidence would be destroyed, but Kryze threatened to have him arrested if he didn't do as she said. The warehouse was set aflame as a warning and an example of what fate corruption would meet on Mandalore."}, {"tag": "p", "text": "Kryze and Amidala met with Almec later, who they informed that Death Watch was not a part of the smuggling ring. Kryze ordered that an antidote be shipped to all schools and hospitals, and Almec was relieved that the situation was over. Kryze told Almec that the issue was far from over and that corruption still remained in the government, and he ensured her that he was setting up a committee to oversee the problem. Despite Almec's promise, Kryze remained skeptical. As she escorted Amidala back to her ship, Kryze confided in Amidala that she believed there to be corruption in the Prime Minister. She asked Amidala to send a Jedi to aid her in finishing their work, proposing that they could go undercover at the Royal Academy of Government to help root out the corrupt leadership. Amidala promised to speak with Jedi Grand Master Yoda about the request and told Kryze not to lose hope as she boarded her ship."}, {"tag": "h4", "text": "Corruption at the heart"}, {"tag": "p", "text": "Senator Amidala held her promise to Kryze and spoke to the Jedi Council on her behalf. The Council assigned Ahsoka Tano, the padawan learner of Skywalker, to teach at the Academy. Skywalker personally shuttled Tano to Mandalore, where they were met by Kryze and Almec at the Sundari dockyards. As the Jedi's ship landed, Almec questioned the integrity of having a Jedi teach at the Academy, specifically what he perceived to be a lack of understanding of Mandalorian ways. Kryze dashed aside his concerns by saying that it wouldn't hurt to have the students be exposed to new ideas. Skywalker and Tano exited their ship, and the Jedi Knight greeted the two Mandalorians. Kryze expressed her thanks to the Jedi Council for their ability to spare the two Jedi, but Skywalker informed her that only Tano would be staying on Mandalore. Almec was taken aback by the revelation, but Skywalker assured him that Tano was capable. Relieved, the Prime Minister brought forth several students at the Academy to meet Tano, among them Satine's nephew, Korkie. Korkie excitedly saw Tano's lightsaber, but Almec informed the Jedi that her weapon would have to be taken away because of Master Kenobi's visit to the planet. Tano gave Skywalker her lightsaber, and Kryze thanked the Jedi for respecting their ways. GAR Captain CT-7567 interrupted the welcoming to inform Skywalker that they had to depart. Skywalker bid farewell to the Duchess and boarded his ship. Kryze, Almec, and the rest of the welcoming party left as well, accompanied by Tano."}, {"tag": "p", "text": "While Tano taught the students about the nature of corruption in politics, Korkie and his friends Amis, Soniee, and Lagos, decided to take it upon themselves to investigate the nature of a food shortage at their school. While undercover in the warehouse district, they discovered a meeting between a hooded figure and several Gotal seemingly being protected by unmarked members of the Mandalorian Guard. The pupils were caught watching and made their escape, but not before discovering large quantities of food and recording part of the secret meeting. Once back at their dormatory, Korkie decided that they needed to speak with Satine. The students visited Satine in her private office, where Korkie told his aunt about their discovery. Satine questioned how Korkie found the information, but the students disregarded her concern and told her that they needed her help to fully uncover the corruption. Satine remained unmoved, however, and told the students not to continue investigating for their own safety. Korkie was angry that Satine seemed to be ignoring the situation, but the Duchess corrected him and again asked that they let her handle the crisis. Satine walked them out and told them that they would get the chance to save the world when they were older. Despite her warning, the youths were angry that she wouldn't help them and turned to Almec for guidance. The Prime Minister told them to meet him at the Palace plaza that night."}, {"tag": "p", "text": "The students, instead of finding Almec, found themselves arrested by a large group of unmarked police officers. The children put up a fight but were easily defeated. Padawan Tano arrived, however, and easily took out the guards. The Jedi and her students deduced that Almec set them up, so they decided to speak with Satine as quickly as possible. The Duchess, meanwhile, was kidnapped by Almec's guards from her office. The Protectors guarding her were all killed, and she was brought to prison, where she was kept in an elevated security cell. Tano and the youths found Satine's office in disarray and figured that Almec was keeping her in custody. They devised a plan to find where Satine was being held. Tano would turn the children in to Almec, and once in prison she could locate Kryze. The plan worked, and Tano learned that Almec was preparing a statement about a conspiracy by Satine and the students against him. Tano found the Duchess's cell, and using a Jedi mind trick was able to access the controls and free Satine. Once free, however, Satine warned Tano that it was a trap, and Almec entered the room with several guards."}, {"tag": "p", "text": "The treasonous Prime Minister told Tano that his guards were playing along with her plan, then had the Jedi stunned. Almec had written out a confession of treason for Satine, which he demanded she sign. Kryze angrily confronted Almec for his traitorous ways and realized that he was responsible for the sumggling and growth of the black market on Mandalore. Almec laughed at her, then explained that he had established the black market on Mandalore for the people. Tano told the Prime Minister that he was wrong, but Almec continued and said that the black market had created a new economic benefit for humanitarian aid. Kryze disputed his claim by pointing out that there was no new aid and that he had reaped the benefits from his crimes for himself. Almec had a shock collar put on Kryze, then pushed a button on the control panel that sent electric shocks throughout the Duchess' body. Despite the pain, Satine did not waver and refused to sign the confession. Almec ordered that the cadets be brought to the chamber in order to convince Kryze. Almec told one of his guards to put a collar on Korkie. Before Korkie could be submitted to torture, Padawan Tano broke from her captor's grip and took out several guards, as did the children. Tano removed Kryze's shock collar and placed it on Almec, who ordered his guards to stop fighting. Satine sent for her personal guards, who arrested Almec's police and placed him in the holding cell she had been kept in. With Almec in custody for his crimes and the crisis over, Kryze thanked Tano for her work and hugged Korkie. Satine, Korkie, and the other students later escorted Tano to the dockyard, where Skywalker arrived to pick up his student. Tano bid farewell to Korkie and silently nodded to Satine, who watched as the Jedi left Sundari."}, {"tag": "h4", "text": "Attempted peace"}, {"tag": "p", "text": "Despite having adamantly stood by her neutrality in the war, Satine continued to have a presence in the Senate. As the war began to take a heavy toll on the funds of the Republic, several members of the Senate began pleading for an increase in the production of clone troopers and the deregulation of the banking system. Senator Amidala was staunchly opposed to the bill and began negotiating for peace with a friend of hers, Confederate Senator Mina Bonteri. The peace talks broke down after droids under the command of Confederate General Grievous bombed the Coruscant power grid and Bonteri was allegedly killed in a Republic attack. The strike on Coruscant dramatically swung many Senators in support of deregulation and the bill was swiftly passed. Subsequently, Kamino Senator Halle Burtoni put forward the motion to increase clone trooper production. Despite the setbacks, Senator Amidala remained headstrong. Satine was present in the senate chamber for a speech made by Senator Amidala in opposition to the bill, where the senator argued that an increase in military spending came at the expense of social services. Amidala's speech, a touching and passionate defense of basic social amenities that suffered as a result of the war, received rousing support from many of those present, including Kryze."}, {"tag": "p", "text": "Although Amidala's speech was well received, Burtoni's bill was passed. Amidala and her ally, Senator Farr, put forward their own motion aimed at preventing Burtoni's bill from taking place. Later on, however, Farr died of what appeared to be heart failure. Still on Coruscant, Kryze attended the funeral of her fellow Council of Neutral Systems member. Kryze was flanked by two Journeyman Protector guards as she solemnly listened to a eulogy spoken by Farr's aide Silood. After the eulogy, the mourners watched silently as Farr's body was loaded onto a Consular-class cruiser and ferried back to his homeworld Rodia. Farr's death was soon identified as murder and his murderer was later discovered, but the bill he and Amidala had worked hard to pass was defeated."}, {"tag": "p", "text": "In 20 BBY, Mandalore was chosen to host a peace conference between the Republic and Confederacy, with Kryze moderating the event. Held in Kryze's throne room, the representatives for the Republic were Senators Amidala, Bail Organa, and Mon Mothma, and representing the Confederacy were Senators Voe Atell, Bec Lawise, and Amita Fonti. Also in attendance was Padawan Tano. The conference was filled with tension, with the Republic senators reluctant to fully engage, as they would have to declare the Separatist state as legitimate. The meeting was interrupted by Lux Bonteri, son of the late Mina Bonteri. Bonteri announced that he had something to say regarding the legitimacy of the Separatists, and approached Satine's throne. He bowed before the Duchess, who with a silent hand wave and a nod allowed him to speak. Once Bonteri had taken up a podium, however, he angrily accused Count Dooku of murdering his mother, earning a quick and equally angry refutation from Senator Lawise. Lawise had Bonteri arrested by two commando droid units, though Kryze stood up and ordered that they stop. Senator Atell asked that Satine remain out of the matter, and Bonteri was taken away. Senator Amidala allowed Tano to go free Bonteri, but his rescue led to a firefight between the Separatist and Republic forces accompanying their representatives, and the peace negotiations quickly broke down."}, {"tag": "p", "text": "Not long after the failed peace conference, Obi-Wan Kenobi purportedly perished at the hands of the bounty hunter Rako Hardeen. A funeral for the fallen Jedi Master was hosted in the Jedi Temple on Coruscant. The funeral was attended by many of Kenobi's friends and comrades, including Satine. During the procession, Satine stood with Senator Amidala and Padawan Tano to her left and Jedi Master Shaak Ti to her right. Kryze openly cried during the service, utterly distraught at the apparent death of the man she loved. Unbeknownst to those outside of the Jedi High Council, Kenobi had survived his encounter with Hardeen and was impersonating the assassin in the hopes of bringing to light and hopefully stopping a plot to assassinate Supreme Chancellor Palpatine. Obi-Wan's mission was ultimately successful, and upon its completion his survival was made public."}, {"tag": "h3", "text": "Fall of Mandalore"}, {"tag": "p", "text": "Death Watch, despite having been in exile after their exposure on Concordia and abandoned by the Confederacy, still wished to topple Satine's government. They encountered the renegade Sith Lord Maul and his apprentice Savage Opress, both of whom had been on a spree of chaos across the Outer Rim and recently escaped from a fight with Obi-Wan, who Maul had a personal vendetta against. Pre Vizsla helped Maul and Opress recover from their injuries, and the two Sith soon created an alliance with Death Watch against Kenobi and Kryze. Vizsla wanted to take on Kryze directly, but Maul took over his plans and decided to build a larger alliance with several crime syndicates, including Black Sun, the Pykes, and the Hutts. Maul also altered the plan to take into account the over two thousand neutral systems under Kryze and Mandalore's affiliation, which they would have control over once Satine was no longer in power. With their criminal alliance, the Shadow Collective, intact, Maul and Vizsla began preparations to overthrow Satine and use her as bait for Kenobi."}, {"tag": "h4", "text": "Attack on Sundari"}, {"tag": "p", "text": "The Shadow Collective's forces soon arrived to Sundari, first attacking the shipping docks. Their plan was to undermine Satine's rule by sowing chaos and destruction across the city, only for Death Watch to enter the fray and \"rescue\" the people of Sundari from the criminals. The plan was similar to Vizsla's original takeover plan with the Confederacy, which Kryze had inadvertently halted by defeating the Republic occupation. Maul's forces at the docks easily overwhelmed the guards stationed there and took hold outside the city. News of the attacks spread quickly, and the Mandalorian people became nervous and demanded Kryze take action. Satine herself was first informed of the attacks by Armatan. Satine believed that Death Watch was behind the sudden violence, but was told that it was a crime syndicate acting alone. Sundari's law enforcement was unable to fend off the numbers of the Shadow Collective and the criminal armies began advancing on locations across the city, including Peace Park. While her forces did what they could to stop the Shadow Collective's spread, Duchess Satine addressed a large crowd outside her palace. Satine asked the people to remain calm and reassured her constituents that the attackers were merely thugs. Her attempt at easing the crowd was ineffective, and just as she finished speaking Pre Vizsla and two other members of Death Watch arrived to confront her, among them her estranged sister Bo-Katan. Vizsla called out Satine in front of the crowd, telling the people that Satine had led them to ruin. Satine questioned him on whether or not he was behind the attacks, but he replied that he was not. He turned to the crowd and told them that he had a solution to ridding the city of the gangsters. Vizsla told the people that they were at war and that siding with him was necessary to win it, adding that Satine's pacifism had failed. Satine tried to dispel Vizsla's claims, telling the crowd that his \"war\" would lead to the end of Mandalore as they knew it."}, {"tag": "p", "text": "Vizsla once again used his passionate rhetoric with the crowd, telling them how they needed to take action. As he lifted from the ground on a jetpack, he said that the name Mandalore should strike fear into the hearts of the gangsters. The crowd began chanting his name, and a distraught Satine was left to watch her peaceful citizens turn their support to Vizsla. With the people looking to Death Watch for help, Maul and Vizsla began the next stage of their plan. Death Watch started countering Maul's forces, \"arresting\" the leaders of the crime families. The chanting of Vizsla's name only grew louder, and as the Shadow Collective and Death Watch continued their coup, Vizsla himself entered the palace to confront Satine personally. The desolate Duchess did not try to stop him, knowing that her support had dwindled to a loyal few. As Vizsla and his warriors entered the throne room, Satine's guards drew their weapons. Satine told them to stand down, standing strong in her desire to not be provoked to violence. Vizsla told Kryze that the people wanted change and that her rule of Mandalore was at an end. With no one else to stop him, Vizsla had his men arrest Satine, the Mandalorian Protectors, and the remaining members of the Ruling Council. In a speech to the crowds outside the palace, Satine's sister Bo-Katan told the people that Satine and her fellow leaders had fled, then presented the \"captured\" leaders of the Shadow Collective as proof of Death Watch's strength while Vizsla had himself named the new prime minister."}, {"tag": "h4", "text": "Deposed by Death Watch"}, {"tag": "p", "text": "In prison, Satine was held in a cell adjacent to Almec, who was still incarcerated for his crimes. Many members of Satine's administration were killed for their loyalty to her, while others chose to join Vizsla to avoid punishment. Satine tried to compel the guards walking past her cell that Mandalore was heading towards its destruction, though the only response she got was from Almec. Almec snidely inquired whether or not she was in for a visit or if peace had betrayed her. Satine lamented that peace only existed in the mind of the faithful. Almec replied that faith had been the greatest disappointment to her, but Satine countered that it only disappointed when it was broken, citing his actions as prime minister as having betrayed the trust of both her and the people. Almec told her that she herself had betrayed his trust, saying that his actions were made because he believed she had led the people to destitution. He claimed that what he did, despite being illegal, was what kept her in power. The powerless Satine told him that it was an error of judgement, that corruption was not the answer to the sacrifices the people made for their freedom. Almec simply joked that Satine should enjoy her freedom, adding that she had plenty of time to tell him all about it. Meanwhile, Vizsla had betrayed Maul, saying that he had no plan on following through with the plan of expanding to the other neutral systems, then had the Sith Lord arrested. With Maul in custody, Vizsla addressed a crowd outside the palace, telling them that Satine had abandoned the people and that her pacifistic ideology only encouraged aggression. Using Maul as an example, Vizsla told the crowd that his actions were the consequences of pacifism."}, {"tag": "p", "text": "Maul and Savage were brought to prison, where they easily broke out and searched the cells for someone who would help them in retaking Mandalore from Vizsla. Maul approached Satine's cell and asked whether or not she was the former Duchess. Satine asked what he wanted with her, though he simply stated that he would have a use for her in time. He told her that he wanted to know where the other leaders of Mandalore were being held. Satine remarked that he should have known, given that many had either sided with Vizsla or been killed. She told Maul that all there was left was she and Almec, saying the latter was as corrupt and vile as they were. However, this was more than enough reason for Maul to approach the man next. Maul asked Almec what his position in government he formerly was, and the ex-prime minister responded. Satine tried to reason with Maul that Almec was not to be trusted, citing his crimes to try and dissuade the Zabrak. Savage told Satine to be quite, and Maul revealed his new plan to overthrow Vizsla to Almec. Maul planned on challenging Vizsla to a duel, knowing that as a warrior he would not refuse. Almec was freed by the Sith Lords, his place now secured as Vizsla's successor, leaving Satine alone to lament Mandalore's fall. Maul, Savage, and Almec then left for the palace, where Vizsla accepted Maul's challenge. Maul defeated the Death Watch leader, who accepted that Maul had earned his place by winning. Maul brutally beheaded Vizsla then claimed the Darksaber and his place as ruler. Bo-Katan and a small group of Death Watch, distraught by Vizsla's death, refused to accept Maul's claim and fled the palace."}, {"tag": "h4", "text": "Reunion, rescue, and recapture"}, {"tag": "p", "text": "With Vizsla dead, Almec became the public face of the Mandalorian government. He addressed a large crowd, where he falsely claimed that Satine had murdered Vizsla and was under arrest for it. The crowd supported Almec despite his past crimes, and Maul had begun building his steps towards a large criminal empire. As Maul began to settle into his new power, a small group of Satine's loyal followers mounted a rescue attempt. Korkie came to Satine's cell with Bo-Katan, who had decided to reconcile with her estranged sister to rid Mandalore of Maul. Satine, hopeful, told her that there was once a time when they weren't enemies, adding that that time could come again. Satine, Korkie, and Bo-Katan escaped the prison, where they were picked up by Lagos, Soniee, and Amis, as well as some of Bo-Katan's warriors. Satine asked Korkie for his comlink, knowing that contacting the Jedi Council was their only option. Korkie told her that they wouldn't have a signal unless they left the city, as all frequencies were being jammed. Satine told Korkie's classmates that they were taking a major risk in trying to free her, and the group boarded an airspeeder to escape. They were quickly followed by Maul's forces, who Bo-Katan and her warriors left to deal with. One of Maul's soldiers hit the airspeeder, causing it to crash just as they reached the outer layer of the city. Satine activated the comlink as her rescuers were taken down. She asked that the message be given to Obi-Wan, telling him that she had lost Mandalore and that Almec was in power. As she was surrounded, she again asked Obi-Wan for his help before being arrested once more. At the royal palace, Almec informed Maul of Satine's transmission. Maul had planned for Satine to reach out to Obi-Wan, and mused that her actions had only brought him closer to his goal."}, {"tag": "p", "text": "At the Jedi Temple on Coruscant, Jedi Masters Yoda and Ki-Adi-Mundi called Obi-Wan to a private meeting to show him Satine's message. Obi-Wan was denied his request to help, the reason being that Death Watch was no longer part of the Confederacy and that Mandalore had repeatedly made it's neutrality clear. Kenobi, wanting to help his friend, decided to break orders and go to Mandalore in secret. Obi-Wan borrowed a ship from Anakin, the Twilight, and disguised himself in a bounty hunter outfit so he could leave Coruscant unnoticed. Upon landing at the docks at Sundari, he stole the armor of one of Maul's soldiers and infiltrated the city with ease. He made his way to the prison and opened the door to Satine's cell. Satine unknowingly believed that it was one of Maul's followers and snidely asked if he was there to do more of his master's bidding. Obi-Wan took off his helmet and jokingly told Satine that he does his own bidding, and the two embraced. Satine asked Obi-Wan if he was alone, and he told her that the Jedi and Republic would not be of any help. The two made their way to an elevator, where they were joined by a one of Maul's Mandalorian soldiers. After a few moments of silence, the soldier questioned if there was a prisoner transfer, but was knocked out by Kenobi before he could figure out what was happening."}, {"tag": "p", "text": "Satine and Obi-Wan found a speeder outside the prison, which the Jedi lightheartedly asked Satine if she would mind if he stole. Satine joked back that since the speeder was government property, it was technically hers to begin with, which made Kenobi smile. As they sped towards the docks, Obi-Wan told the duchess that their escape brought back memories, though Satine reminded him that they had had many bad memories together. Obi-Wan lightheartedly told her that some were pleasant, and Satine replied that she hoped this one would be among them. As they closed in on the docks, they had become followed by a large group of Maul's warriors, as well as Maul and Opress, who wanted to see Kenobi taken in themselves. Evading blaster fire, Satine and Obi-Wan made their way aboard the Twilight. As Kenobi quickly prepped the ship for takeoff, Satine told him that they needed to contact her sister, who she knew would send reinforcements. Obi-Wan had never heard of Bo-Katan before, and asked who her sister was. Satine simply explained that she was a member of Death Watch. Before Obi-Wan could respond, the ship began to malfunction and explode from blasterfire. Satine and Obi-Wan were flung from the spiraling ship to the ground below, narrowly escaping it's destruction. Once he got his bearings, Kenobi used the force to lift a large piece of metal off of the unconscious Satine. Maul confronted Obi-Wan as Opress picked up the duchess, and the two were carried off to the palace."}, {"tag": "h4", "text": "Death"}, {"tag": "p", "text": "Kryze and Kenobi were brought before Maul in the Sundari throne room, where Satine was made to kneel beside the throne. Maul taunted Kenobi, lifting and choking Satine with the Force while Obi-Wan watched, unable to help. Obi-Wan at first struggled against his captors as Satine was hurt by Maul, who preyed on the Jedi's love for the duchess and used her as bait to his dark emotions. Satine, still under Maul's grasp, begged Obi-Wan to not listen to the Sith Lord's words, only to be silenced by Opress. Obi-Wan assured Maul that the Sith could kill him, but his resolve would never be broken. Kenobi tried to identify with Maul, bringing up the his horrific past, which angered the Sith Lord. A furious Maul remarked that the perfect tool for his vengeance was now available to him, and that he could finally watch the Jedi Master suffer as he had. Drawing the Darksaber, Maul tightened his grip on Satine and forcefully pulled the duchess towards him, impaling her with the ancient saber as Obi-Wan watched in despair. As Maul dropped Satine's dying body to the floor, Kenobi rushed to her side and gently held her. Holding the side of his face, Satine professed her unyielding love for Obi-Wan in her dying breath before passing away in his arms."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Kenobi's shadow"}, {"tag": "p", "text": "Just as Satine died, Obi-Wan felt a growing inner turmoil as he processed what happened. Obi-Wan was at first sorrowful that Satine would never live to see her world and people thrive or be able to look back on the good she had done for them, but his sorrow became anger as he focused on Maul and the fact that she should never have become involved in their struggle. For a moment, he found a desire to murder Maul, Savage, and Almec in cold blood for their roles in Satine's murder. Maul was amused by his anger, and this led Obi-Wan to realize that in doing so he would become something Satine would never have wanted him to be. Shortly after returning to Coruscant, Obi-Wan met with Anakin, who asked him what had happened on Mandalore. Though his words came with a struggle, Kenobi admitted that he had lost \"someone important\" to him. He also revealed that he had felt anger in a way he never had before because of Satine's death. Later in the war, Obi-Wan questioned Anakin about the nature of his connection to Senator Amidala. Hoping to get Anakin to open up about his feelings, Obi-Wan resonated with his former student, reminding him that he had harbored feelings for Kryze prior to her untimely demise. By the end of the Clone Wars, Obi-Wan had come to accept his relationship with Satine, but struggled to balance his feelings for her with his duties as a Jedi. Even by 0 BBY, Obi-Wan continued to carry guilt and blamed himself for failing Kryze and every other person he truly loved. While talking with the Force spirit of Qui-Gon Jinn, Kenobi was comforted by his old master, who reassured Obi-Wan that the responsibility for his failure was Jinn's own for not having completed his training."}, {"tag": "h4", "text": "The fate of Mandalore"}, {"tag": "h5", "text": "Republic invasion"}, {"tag": "p", "text": "After Satine's death, Obi-Wan was sent to prison by Maul, who hoped that Obi-Wan would break under his misery with Satine's death. As he was being transported to prison, his escort was intercepted by Bo-Katan. Bo-Katan helped Obi-Wan escape Sundari, which had fallen into civil war as the remains of Death Watch shattered over Maul's rule. Bo-Katan hoped that Obi-Wan would inform the Republic of Maul's actions on Mandalore, despite the fact that it would lead to a Republic invasion. Obi-Wan told Bo-Katan that bringing war to Mandalore would be against Satine's wishes, but she explained that Satine's devotion to Mandalore meant the late duchess would be willing to do anything to save her people. As he was preparing to leave, Obi-Wan came to the realization that Bo-Katan was Satine's sister, and he apologized for her loss as they parted ways. Maul's rule was briefly usurped by his former Sith master Darth Sidious, though he managed to regain his position nearing the end of the Clone Wars. Bo-Katan and her Nite Owls began tracking Maul's movements, eventually coming into contact with Ahsoka Tano, at that point no longer a Jedi, who herself had discovered of Maul's return to Mandalore. Together, Bo-Katan and Ahsoka managed to contact Obi-Wan and Anakin. They arranged a meeting to discuss sending Republic aid to help Bo-Katan. Despite his prior commitment to helping Mandalore, Obi-Wan was reluctant to commit to sending aid, continuously stating that they would need the approval of the Jedi Council."}, {"tag": "p", "text": "Obi-Wan's unwillingness to send aid angered Bo-Katan, who reminded him of what Maul had done to Mandalore. Bo petulantly referenced Obi-Wan and Satine's relationship, pointing out that she thought Satine meant something to Obi-Wan. Kenobi remained stagnant in not committing to helping Bo-Katan, but told her that Satine still meant something to him, though he added that he wasn't going to let his feelings for her cloud his judgement. As he left to consult the Council, Bo angrily told Ahsoka that asking for help was a waste of time. With some quick negotiations, Ahsoka managed to secure a division of clone troopers to take to Mandalore to help Bo-Katan oust Maul. They managed to enter Sundari with relative ease, quickly taking strides to take hold of the city. Although Maul remained elusive and difficult to locate, Bo-Katan managed to easily defeat Almec and take him into custody, where he was later assassinated by Gar Saxon. The New Mandalorian people were uncomfortable with the clone presence, but were assured that once Maul was arrested the Republic forces would leave the planet. Soon after the citizens of Sundari were evacuated into shelters, Maul's warriors were defeated by Bo-Katan and Ahsoka's forces in a decisive battle. Ahsoka herself managed to capture the former Sith Lord, who was placed in an ancient Mandalorian vault. Ahsoka, upon seeing the device, questioned whether or not Satine had outlawed such devices, which Bo-Katan says she had. With Maul imprisoned and the Shadow Collective fragmented, it seemed that Mandalore could rise again with Bo-Katan as their new leader, leading the Mandalorian people into a new era just as Satine had."}, {"tag": "h5", "text": "Age of the Empire"}, {"tag": "p", "text": "Just as Mandalore was freed from Maul's grip, the Clone Wars came to a tumultuous end as the Republic finally crumbled after years of fracturing and the Confederacy lost its leadership and power in quick succession. Supreme Chancellor Palpatine declared himself Emperor and reorganized the Republic into the Galactic Empire. Under Emperor Palpatine's new rule, the Jedi were nearly wiped out, leaving survivors such as Obi-Wan, Ahsoka, and the escaped Maul as fugitives. Among those who died during the chaotic end of the war was Kryze's friend, Senator Amidala. Using the clones left on Mandalore, the Empire began an occupation of the planet, which led Bo-Katan and several other warrior groups to refuse to acquiesce to the Empire's rule. With Bo-Katan no longer recognized as the ruler of Mandalore, Gar Saxon took the mantle of leader as Imperial Viceroy. The Mandalorian Protectors, meanwhile, established a base on the third moon of Concord Dawn and safeguarded the system on the Empire's payroll."}, {"tag": "p", "text": "Years before the early rebellion against the Galactic Empire, a young cadet at the Imperial Academy of Mandalore named Sabine Wren developed a superweapon that became the Arc Pulse Generator. Wren nicknamed the weapon \"the Duchess\" after Satine. She developed the weapon to target beskar alloy used in Mandalorian armor and disintegrate the soldier inside, taking it as a challenge to her abilities since beskar was widely regarded as indestructible. After finding out that the Empire not only had weaponized her design but tested it on her people, Sabine was horrified. Although she sabotaged the original prototype, Wren's mistake brought tension between her and her family, and she eventually joined the Spectres, a rebel cell under the lead of Hera Syndulla. In 3 BBY, the Protectors of Concord Dawn came into conflict with the Spectres, who were trying to secure safe passage in the system. The Protectors relented and allowed the nascent rebellion access to their space after their leader, Fenn Rau, was taken prisoner by the rebels. About a year later, the rebellion lost contact with the Protectors, who had been wiped out by Viceroy Saxon and his Supercommandos."}, {"tag": "p", "text": "In the years prior to the Battle of Yavin, Maul had under his possession a painting of Satine which he kept in the Nightsister lair on Dathomir. Maul kept the painting as part of a large collection of items from his life, among them the Darksaber. By 2 BBY, the painting was heavily defaced, with the eyes and throat of Kryze scratched out and the overall artwork in poor condition. The painting was placed in a twisted shrine to the Darksaber and Maul's decades-old vendetta against Obi-Wan. That same year, Maul lured young rebel Ezra Bridger, one of Sabine's crew, to Dathomir in order to find the location of the exiled Obi-Wan from the young boy. Ezra briefly explored Maul's lair, where he saw Satine's painting and looked at it for a moment. Maul growled at him to get away from the shrine, and the two began a ritual to find the location of Obi-Wan. In the subsequent skirmish between the Spectres and Maul to free Ezra, Sabine took the Darksaber from the former ruler of Mandalore. Maul later managed to track down Obi-Wan on Tatooine, where he was defeated by the Jedi Master during a brief lightsaber duel. Despite all he had done to his enemy, Maul was comforted in his final moments by Obi-Wan."}, {"tag": "h5", "text": "Sister begets sister"}, {"tag": "p", "text": "Now in possession of the Darksaber, Sabine was trained by Rau to wield the ancient weapon, which they believed they could use to help rally Mandalorians against the Empire. Sabine and Rau traveled to Krownest, where they attempted to gain the support of Clan Wren in their fight against the Empire. During their mission, Clan Wren leader and Sabine's mother Ursa Wren killed Gar Saxon, which led to war between Clan Wren and Clan Saxon, who were staunchly in support of the Empire. Sabine continued to wield the Darksaber as the Spectres and Clan Wren began striking at the Imperial forces on Mandalore, who were led by Tiber Saxon. Wren and Rau's efforts eventually gained support from Bo-Katan and her Nite Owls. Sabine attempted to give Bo-Katan the Darksaber, reasoning that she was more worthy to wield the blade. Bo-Katan at first refused to accept the weapon, seeing her failure to lead the Mandalorian people after the Siege of Mandalore as the prime example of why she was not worthy. Despite her refusal, Bo-Katan continued working with Sabine and Rau. Their work was brought to a halt with the news that the Empire had recreated the Arc Pulse Generator and had begun using it on members of Clan Wren in battle. Bo-Katan was disgusted that the weapon had been named after Satine, viewing it as an insult to her late sister's memory. Bo-Katan and Sabine managed to destroy the weapon, after which several Mandalorian clans reassured Bo-Katan that they were willing to follow her as their leader. Bo-Katan decided to accept the Darksaber and became the Mandalorian's leader once again, rallying support against the Empire in the name of her sister."}, {"tag": "h4", "text": "Continued remembrance"}, {"tag": "p", "text": "At some point after her death, the Drearian Defense Conglomerate named a model of its Defender sporting blaster pistol after the late duchess, the Satine's Lament. One of these was put to good use by the daughter of Kryze's friend Amidala, Leia Organa. Also at some point following her demise, accounts of Duchess Satine's life and struggles were depicted on a series of illustrated maps by the Ithorian artist Gammit Chond. Although he was a recluse, Chond based his maps on stories he heard from travelers, including stories of Kryze's rule and various other notable events in Mandalore's history. Much of Chond's artwork was stored in the Shadow Stacks of the Graf Archive on the moon Orchis 2 until a student archivist exhumed the set."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Satine Kryze, a human female, had short blond hair, piercing blue eyes, and pale skin, along with a slender build and defined features. Satine always took care to present herself with dignity, and she reflected that in her appearance. Satine fashioned her hair in a Kalevalan style, and in her clothing made use of soothing and rich colors with floral-inspired designs that were reminiscent of the forests and lakes that once populated Mandalore's surface. Her elegant clothing was not worn out of vanity, but was strategically chosen to reflect Mandalore's past beauty and remind those who saw her of what the planet once was and what it could still be."}, {"tag": "p", "text": "Strong-willed and ambitious, Duchess Satine Kryze was an avowed pacifist and was committed to nonviolent actions throughout her life. Her peaceful ideology was formed from her experiences during the Mandalorian Civil War, a harrowing experience after which she dedicated herself to changing Mandalorian society for the better. Satine's reforms brought about an era of peace and prosperity that Mandalore had never before experienced. Kryze was so devoted to her ideals that she was willing to die for them and often put herself in danger to help others. Even with her ambitious goals, however, Satine was unwilling to push others to align themselves with her and instead acted only with the help and consent of her constituents. Kryze cared deeply for her people and was distraught whenever hardship befell them. Despite the difficulties she faced and the threats levied against her, Satine remained convinced that change was Mandalore's only hope for a future."}, {"tag": "p", "text": "Although she was successful in keeping Mandalore and its people out of the Clone Wars, Satine faced deception and issues at home early into the conflict. Three of her most loyal and prominent allies betrayed her during the war, two of whom had already been plotting against her for years. The first was Governor Vizsla, who Kryze had seen as an honorable man before the revelation that he was the secret leader of Death Watch. Despite his betrayal, Kryze refused to believe that he could be capable of killing innocents and that he only wanted to harm her and her administration. Shortly after Vizsla's betrayal, Senator Prince Tal Merrik attempted to take Satine hostage and murder several Republic dignitaries aboard the Coronet. Satine was blindsided by Merrik's betrayal but could not bring herself to kill him when she had the chance. Satine was most outraged and hurt by the betrayal of Prime Minster Almec, whom she had suspected of corrupt practices but was willing to give the benefit of the doubt. Almec's actions, unlike those of Vizsla or Merrik, had led to the death of innocent civilians, which Kryze saw as the ultimate betrayal of the people's trust. Although each betrayal challenged the duchess, she was able to keep herself headstrong by raising an eyebrow at everything around her in the name of her people's well being."}, {"tag": "p", "text": "Kryze was greatly sympathetic to all life forms, including those that threatened her life. Following the failed assassination attempt on her life at Peace Park, she approached the dying Death Watch bomber and spoke to him in Concordian, comforting the man in his final moments despite what had happened earlier. Satine likewise disapproved of Obi-Wan's brutal handling of several members of Death Watch. Satine was initially reluctant to believe that Death Watch was anything more than a group of thugs, though after their exposure as a militia, she realized the threat they posed to her and her government. Just as with Vizsla, however, Satine also knew that they wouldn't harm the Mandalorian populace and would only hurt her and officials in her government. The epidemic brought on by Almec's smuggling ring brought out a stricter and more emotionally impulsive Kryze, who was determined to solve the mystery behind the corruption around her before more lives were lost. Kryze uncharacteristically threatened both the school administrator and Captain Ru-Saxon with violence and punishment if they disobeyed her orders, even ignoring Senator Amidala's pleas for the duchess to calm down. Throughout the war, Duchess Satine had foiled and outsmarted her enemies time and again, but her luck ran out when Vizsla allied himself with Maul. The arrest of Almec restored both Kryze and Mandalore to a place of peace, though Vizsla would soon reappear and disrupt Kryze's reign. Vizsla's Shadow Collective-backed coup against Kryze was successful in making her look weak in the eyes of the distraught and frightened Mandalorians, and Kryze willingly surrendered to Vizsla in order to keep her beloved people from facing more bloodshed."}, {"tag": "h3", "text": "Views on the Republic and the Jedi"}, {"tag": "p", "text": "Duchess Satine's reform efforts during the Mandalorian Civil War were supported by the Galactic Republic. Following her victory and the installment of the New Mandalorian government, Mandalore became a member of the Republic. Despite this, Satine was an active voice against the Clone Wars and found herself at odds with the Senate's interests. Kryze's opposition to the Clone Wars stemmed from her devotion to nonviolence and she opposed the war for everything it represented. Her vocal opposition to the conflict inspired several hundred systems and planets to place their trust in her to advocate for their neutrality, which she was successful in accomplishing as the Regent of the Council of Neutral Systems. Satine saw the Confederacy of Independent Systems as extremists, but did not oppose their actions and believed that they could be reasoned with. Many in the Republic saw Kryze's inaction as ignorant, with even Obi-Wan opining that Satine was not willing to collaborate with those she disagreed with. Satine herself decried the very nature of the Senate and believed that the body was incapable of accomplishing anything other than discord. Kryze had a particular distaste for the policies of Supreme Chancellor Palpatine and Vice Chair Amedda. Kryze found the Republic to be distrustful and greedy, and during her time on Coruscant to make her case against the occupation of Mandalore, she went so far as to conduct a private and off-the-record investigation into Jerec's doctored testimony to avoid working with Republic authorities. Although she felt that the Republic at large was contaminated with greed and corruption, Kryze made a friend and ally in Senator Amidala, one of few senators to stand by Mandalore's neutrality and provide aid as trade routes became inaccessible to the planet. She was also willing to allow the failed Confederate-Republic peace conference to be held on Mandalore, and even moderated the event in her throne room."}, {"tag": "p", "text": "In addition to her opposition to the Republic's militarist activities, Kryze also denounced the militant actions taken by the Jedi Order. During her time under the protection of Master Qui-Gon Jinn and then-Padawan Obi-Wan, Satine witnessed firsthand the peacekeeping nature the Jedi ascribed to themselves and knew them to be devoted to their cause. By the time of the Clone Wars, however, Kryze viewed the Jedi differently. Satine saw the Jedi's political affiliation with the Republic and their involvement in the war as a betrayal of their core values. In her opinion, the Jedi had sacrificed their ideals for political convenience. Kryze described their reliance on violence to solve conflicts as foolhardy and compared their actions to a pseudo-crusade, though she admitted that they came from a place of devotion and commitment to the Order, albeit misguided. Satine found it amusing and ironic how the Jedi adopted the attitudes and titles of military officers while promoting themselves as peacekeepers, and called out both Kenobi and Skywalker aboard the Coronet for doing as such."}, {"tag": "h3", "text": "Relationships"}, {"tag": "h4", "text": "Clan Kryze"}, {"tag": "p", "text": "Satine was close with her nephew Korkie and was very protective of him and his safety. Korkie sought to help Satine with her struggles during the Clone Wars and protect the New Mandalorians in kind. When Korkie and his friends uncovered Almec's treason, they attempted to appeal to Satine and get her help, but the duchess was concerned that they were becoming too involved and that their safety was at risk. Satine's desire to keep her nephew safe came across as belittlement to Korkie, which only made him more willing to rebel against her wishes and continue investigating. Even when tortured by Almec in prison, Satine tried to keep Korkie from suffering like her and protested the traitorous Prime Minister's attempt to put a shock collar on him. Korkie remained loyal to his aunt and her ideals as the Clone Wars continued, even as Maul and Pre Vizsla's takeover of Sundari took place. When Satine was deposed and imprisoned, Korkie led a rescue attempt to free his aunt, who was overjoyed to see him alive and well."}, {"tag": "p", "text": "Korkie's attempt to rescue the deposed Satine reunited the former duchess with her estranged sister, Bo-Katan, whom she affectionately called \"Bo.\" Satine and Bo-Katan were close when they were younger, but their differing opinions and ideas about Mandalore's future estranged them. Satine was alarmed to see her sister, who in the intervening years had become a leading member of Death Watch. Korkie and Bo-Katan reassured the duchess that they were working together. Satine believed that she and her sister could reconcile their differences and become friends again, though her death soon after the failed rescue mission dashed that future. Bo-Katan, despite her estrangement from and opposition to Satine, was devastated by her sister's death, and in the decades after the Siege of Mandalore, came to respect her for her ambition despite not understanding her idealism."}, {"tag": "h4", "text": "Obi-Wan Kenobi"}, {"tag": "p", "text": "Satine Kryze first met Obi-Wan Kenobi during the Mandalorian Civil War. The two spent nearly a year together while on the run with Qui-Gon, and throughout their time together the young Jedi fell in love with the duchess, who reciprocated his feelings. Once the war ended and it was deemed safe for Satine to return to Mandalore, they both decided to commit to their work as the leader of Mandalore and a Jedi Padawan, respectively. Both Kryze and Kenobi looked back on their past with regret, but also relief. In her later years, Satine did not hide her feelings for Obi-Wan and recognized that, despite their complicated past, he was an important part of her life and she would never be able to forget him even if she tried."}, {"tag": "p", "text": "Several years later, during the Clone Wars, the two met each other once more during the Death Watch crisis. Satine was cold to Obi-Wan at first, mostly because she believed he had been sent to Mandalore by the Senate. Once Obi-Wan corrected her mistake, she mellowed significantly and invited him for a walk around the city of Sundari. Satine was glad to see Obi-Wan again, and throughout their time together investigating Death Watch, the two retained their camaraderie and flirtatious banter. Their friendship became strained when Satine learned that the Jedi supported a Republic occupation of Mandalore, and she was saddened by his seeming lack of care for the planet's sovereignty. Aboard the Coronet, their opposing ideas and conflicting philosophies led them to bicker relentlessly to the point of insulting each other pettily. Once forced back into action by the attack of the probe droids, their friendly nature and ability to work together returned. As the situation escalated and Prince Merrik attempted to kidnap Satine, the duchess confessed to Obi-Wan that she had loved him during the Civil War and had ever since, believing that she would never see him again. Obi-Wan confessed that he would have left the Jedi Order for her had she said the word. When Merrik was killed by Skywalker, Satine tried to talk to Obi-Wan about their feelings but was interrupted by the arrival of the clone escort. The two didn't see each other for the rest of the voyage but met once they were safely on Coruscant. Satine was disheartened when Obi-Wan later referred to them as just friends, but they remained close and continued with their responsibilities as peacekeepers."}, {"tag": "p", "text": "When Korkie and Bo-Katan mounted their rescue attempt to free Satine from prison, the duchess knew that they had to contact Obi-Wan to secure help from the Republic and oust Maul. The Jedi Order refused to help because Mandalore was not involved in the war from either the Republic or Confederacy, but Obi-Wan decided to undertake a secret mission to help Satine. Satine was beyond glad to see the Jedi and hugged him when he removed his helmet. After they were captured and as Maul was taunting Kenobi by choking Satine through the Force, the duchess used what little strength she had to tell him not to listen to the Sith. When impaled with the Darksaber by Maul, Satine reached out to Kenobi. In her final moments, Kryze reaffirmed her love for Obi-Wan and touched his face before dying in the Jedi's arms."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Satine was a strong-willed and determined politician, and as such was a gifted public speaker and showed strength in analyzing her surroundings. She managed to hold her own before the Galactic Senate, even when under pressure by Supreme Chancellor Palpatine and Vice Chair Amedda. Although she abhorred violence and abstained from the opportunity of violence whenever she could, Satine had some skill in combat and could hold her own in a fight, even against the skilled Death Watch warriors. Satine additionally always carried a deactivator hold-out pistol, which fired an energy blast that could deactivate droids. When Obi-Wan questioned her choice to carry a weapon with her, she reasoned that even though she was a pacifist she was not unwilling to defend herself. Among her other abilities, Kryze could drive speeder bikes and could evidently fly aircraft; when Obi-Wan attempted to free her from imprisonment following Vizsla and Maul's coup, she was ready to take control of the Twilight but did not have the time to do so. Satine was also very resourceful and was able to correctly program the controls in the Concordia mines to free Obi-Wan from the conveyor belt despite the extreme circumstances."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Satine Kryze first appeared in \"The Mandalore Plot,\" the twelfth episode of the second season of the animated television series Star Wars: The Clone Wars. The episode was directed by Kyle Dunlevy, written by Melinda Hsu and Drew Z. Greenberg, and first aired on January 29, 2010. \"The Mandalore Plot\" was the first in a trilogy of episodes, which also included \"Voyage of Temptation\" and \"Duchess of Mandalore.\" Initially, \"Voyage of Temptation\" was the only planned episode of the trilogy, however, George Lucas and Dave Filoni decided to expand upon the character of Satine and the Mandalore story-arc, leading to the development of the \"The Mandalore Plot\" and \"Duchess of Mandalore.\""}, {"tag": "p", "text": "The idea to give Obi-Wan Kenobi a romantic interest in The Clone Wars came from story editor Henry Gilroy. From the conception of the character the team behind the show always intended to have Satine killed off. Satine's design was based off of unused concept art of Queen Padmé Amidala for Star Wars: Episode I The Phantom Menace illustrated by Iain McCaig. She was inspired by Cate Blanchett, particularly her performance as Queen Elizabeth I, whom she portrayed in Elizabeth and Elizabeth: The Golden Age. Henry Gilroy, who came up with her name, denied she was named after Nicole Kidman's character in Moulin Rouge!, who was the love interest of Ewan McGregor's character. Dave Filoni said he did not realize that initially, and said, \"I still wanna question Gilroy about that, because I'm like, 'Come on, really? I mean, out of all the names, really?' It's pretty weird, I'll give you that.\""}, {"tag": "p", "text": "In The Clone Wars, Satine was voiced by Anna Graves. Graves was drawn to the character because, despite her deep connection to the story of Obi-Wan Kenobi, Satine stood out to Graves as someone who wasn't reliant on the narrative of another character to shine. Although initially unaware of the history and culture of the Mandalorians, Graves educated herself upon landing the role. By the time of recording, Graves understood the importance of her role and was \"excited to speak in the Concordian dialect.\" Following Filoni's direction, Graves tried to deliver some of Satine's speeches with the same gravitas as Blanchett's performance as Elizabeth I. She also used the bickering relationship between Princess Leia Organa and Han Solo in Star Wars: Episode V The Empire Strikes Back as a basis for her voice work, wanting the character of Satine to challenge Obi-Wan as much as Organa challenged Solo."}, {"tag": "p", "text": "Early plans of the Star Wars Rebels episode \"Twin Suns\" featured Maul experiencing visions of both Kryze and Savage Opress before facing Obi-Wan Kenobi on Tatooine."}, {"tag": "p", "text": "In her entry in the Encyclopedia, Satine's homeworld was listed as being Mandalore. However, Tal Merrik's Databank entry correctly lists her homeworld as Kalevala."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}