{"url": "Balance_of_Power_in_the_Airam_Sector", "categories": ["Category:Legends articles", "Category:Battles in the Airam sector", "Category:Galactic Civil War campaigns"], "nodes": [{"tag": "h1", "text": "Balance of Power in the Airam Sector"}, {"tag": "p", "text": "Balance of Power in the Airam Sector is a \"Battle\" from the Star Wars: X-Wing vs. TIE Fighter computer game, i.e. a set of eight different missions grouped together without forming a coherent campaign; Battles do not follow a storyline and the missions have no clear chronological order."}, {"tag": "p", "text": "This third Battle was provided with the Balance of Power expansion pack and ties in with the two campaigns presented therein:"}, {"tag": "p", "text": "Balance of Power in the Airam Sector augments the storyline of these two campaigns by providing additional engagements that were fought between the Rebel Alliance and the Empire on the sidelines of these opposing campaigns. However, the Battle missions are not a direct part of the campaigns proper. Their outcome is irrelevant to the overall storyline, and they need not be played to finish either campaign. Like with the other Battles in the game, they present evenly balanced missions where players can fly for either side, unlike in the campaign missions, where the player flies for one particular side and must achieve the mission goal to proceed to the next mission in the campaign."}, {"tag": "p", "text": "On the rebel side, Rogue Squadron is deployed against the Empire in all missions."}, {"tag": "p", "text": "On the Imperial side, Avenger squadron (in TIE Avengers) and Talon Squadron (in Gunboats) feature prominently in most of these scenarios. Since Task Force Vengeance was only equipped with these craft during the 7th mission of the Imperial campaign and Talon squadron had not even been created before then, this indicates that in the overall chronological order, the Battle scenarios occur after the 7th Imperial campaign mission."}, {"tag": "h2", "text": "Battle missions"}, {"tag": "h3", "text": "Attack on Imperial Convoy near Mylok"}, {"tag": "p", "text": "An Imperial convoy, consisting of three waves of two groups of BFF-1 bulk freighters, of four ships each (FRT groups Lumin and Mazur) and Assassin-class corvette group Bira (five ships each), is under attack from Rebel starfighters in the Mylok system. Responding to their distress call the Nebulon-B2 frigate Blue Ruin and its starfighters intervene and try to defend the convoy."}, {"tag": "h3", "text": "Two on Two - Alliance CRLs vs Imperial STRKCs"}, {"tag": "p", "text": "The Rebel MC40 cruisers Re and Ta are brought to battle by the Imperial Strike-class cruisers Asp and Eel."}, {"tag": "h3", "text": "4 Imperial Starships vs. Mon Calamari Cruiser Chie"}, {"tag": "p", "text": "Four STRKCs from group Longbow, supported by starfighters, launch an attack against Mon Calamari Star Cruiser Chie and its fighter screen."}, {"tag": "h3", "text": "Attack on Secret Imperial Base"}, {"tag": "p", "text": "The Rebel Alliance has found an Imperial base in the Talcim Cluster from where the Empire sends forth a group of 16 Escort shuttles (E/S group NoShow). These shuttles carry biological weapons to be unleashed against Airam supporters of the Rebels. The Rebels try to intercept the shuttles and Avenger Squadron is called in to reinforce the weak defenses of the base."}, {"tag": "h3", "text": "Attack on Rebel Capital Ships"}, {"tag": "p", "text": "Imperial fighters carry out a heavy starfighter attack against a small rebel flotilla consisting of CRS Odysseus, CRL Zeus and STRKC Thor."}, {"tag": "h3", "text": "ISD Conqueror vs. 3 Alliance Frigates"}, {"tag": "p", "text": "Imperial-class Star Destroyer Conqueror faces a rebel strike fleet consisting of M/FRG Lion, M/FRG Lance and FRG Ornik. The Rebel mission briefing indicates that the mission is already considered a success if the Conqueror retreats; its destruction is not required. (The Conqueror must later be destroyed during a canonical campaign mission for the Rebel campaign, ruling out the possibility of its (canonical) destruction in this battle mission although it is technically possible to destroy the ship during the mission.)"}, {"tag": "h3", "text": "Attack on Imperial Shipyard"}, {"tag": "p", "text": "Several Imperial capital ships (FRG Fury, ESC Straasa, STRKC Manticore, M/FRG Sicorro, CRV AD88 and 3 ships of Assassin-class corvette (M/CRV) group 192) have powered down for maintenance at Depot XLS in the Fondor system. Rebel starfighters stage a surprise attack against the helpless capital ships but ISD Hammer is en route to bolster the Imperial defenses."}, {"tag": "h3", "text": "Imperial STRKC Ull vs. Alliance DREAD Karei"}, {"tag": "p", "text": "Yet another evenly matched fight pits Rebel Dreadnaught Karei against the Imperial Strike-class cruiser Ull, along with their respective fighter complement."}, {"tag": "h2", "text": "Canonicity"}, {"tag": "p", "text": "Although the occurrence of the individual missions can be considered canonical, they can be played for either side and the outcome naturally depends on the player's actions. Therefore, the actual canonical outcome of each mission is unclear. Since the setup of the individual battles and their participants are canonical but not their destruction, it is safe to assume that no side achieved a lasting effect (such as the destruction of a starship) over the course of the Battle missions."}, {"tag": "h2", "text": "Sources"}]}