{"url": "Savareen", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Articles in need of updating", "Category:Desert planets", "Category:Savareen locations", "Category:Savareen sector planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Savareen"}, {"tag": "p", "text": "Savareen was a planet that was located at one spur of the Kessel Run, in the galaxy's Outer Rim Territories. The planet consisted of sandy landmasses and huge oceans. Savareen was also known for its famous brandy drink. The Crimson Dawn once had a business there and they chopped off the tongues of the natives."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "At some point prior to 10 BBY, the crime syndicate known as Crimson Dawn had a business on Savareen. When the natives tried to rise up against Crimson Dawn, they lost their tongues."}, {"tag": "h3", "text": "Showdown on Savareen"}, {"tag": "p", "text": "After the raid on Kessel, Han Solo and the rest of Beckett's gang went to Savareen to refine the coaxium they had stolen from the Pyke Syndicate on Kessel. While they were there Enfys Nest and her gang of Cloud-Riders had a stand-off with Beckett's gang, after which Enfys regaled them with the story of how Crimson Dawn had terrorized the village. Han decided he could not give the coaxium to Dryden Vos, and thus came up with a plan to cheat him. Tobias Beckett refused to have any part of this treachery. Han Solo, Chewbacca, and Qi'ra went to Dryden's office, while Enfys and her marauders defended the villagers from the Hylobon Enforcers. While in Dryden's office, it was revealed that Beckett had betrayed Han Solo. Then, Beckett betrayed Dryden and fled with the refined coaxium. Qi'ra killed Dryden, and Han killed Beckett. Qi'ra then contacted Maul and informed him of Dryden's death. Han then watched with Chewbacca as Qi'ra left Savareen on the First Light."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Savareen was first mentioned in the 2017 reference book Star Wars: The Last Jedi: The Visual Dictionary written by Pablo Hidalgo, and later appeared in the 2018 film Solo: A Star Wars Story. Its name is derived from the eponymous brandy featured in the Star Wars Legends continuity (whose canonical equivalent is mentioned in Solo); the beverage (and the descriptor Savareen) originated in the West End roleplaying supplement Galaxy Guide 9: Fragments from the Rim."}, {"tag": "p", "text": "An inspiration for the appearance of Savareen in Solo were the lavish landscapes of the American West by the 19th century painters Frederick Church and and Albert Bierstadt. The design of the dilapidated structures at Savareen, on the other hand, were based on a piece of concept art entitled \"Bespin - Floating City Ruins\", created by the legendary Star Wars concept artist Ralph McQuarrie and previously shown in 1995's The Illustrated Star Wars Universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}