{"url": "Savi%27s_Workshop", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Batuu stores"], "nodes": [{"tag": "h1", "text": "Savi's Workshop"}, {"tag": "p", "text": "Savi's Workshop, located in the Black Spire Outpost on the Outer Rim planet Batuu, presented itself as the front office for Savi & Son Salvage. Savi and his Gatherers, who admired the Jedi Order and had faith in the the Force, secretly operated a lightsaber workshop within despite the First Order occuptation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Savi's Workshop was located in the Land Port of Black Spire Outpost on the Outer Rim planet Batuu. Officially, the building was the front office of the company Savi & Son Salvage, and sold scrap metal and items salvaged from the junkyard owned by the business. The most notable items were curated by the \"Gatherers,\" a group of beings who admired the Jedi and hoped to bring balance to the Force by teaching people the ways of the Jedi Order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 34 ABY, Savi and the Gatherers operated a workshop in a hidden back room where they helped visitors create their own custom lightsabers. They were assembled with parts the Gatherers salvaged from fallen Jedi temples and starships, kyber crystals in containers obtained from the Galactic Empire, and natural items such as rancor teeth; rumors suggested other parts originated with the Sith. Because the First Order occupiers of Batuu were not fond of the group's ideals, the workshop was operated in secret and the Gatherers left the workshop for a time to \"seek out scrap metal.\""}, {"tag": "p", "text": "Despite the need for secrecy, author Eloc Throno wrote in his Traveler's Guide to Batuu that he had overheard travelers discussing Savi's Workshop as if it was something more than it appeared to be. He witnessed a visitor tell a Gatherer, \"I'm here to gather some parts. Savi sent me.\" After leaving with the Gatherer for a time, the visitor returned with an item on her belt that Throno suspected was a lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Savi's Workshop is one of the experiences at the themed land Star Wars: Galaxy's Edge, which opened on May 31, 2019 at Disneyland Park and August 29, 2019 at Disney's Hollywood Studios. Visitors to the parks can build and purchase their own custom lightsabers. It is not open to the general public, but is by appointment only for one lightsaber builder, plus one guest who may observe. The builders select from one of four styles of lightsaber: \"Elemental Nature,\" \"Peace and Justice,\" \"Power and Control,\" and \"Protection and Defense.\" They are then given a collectible cloisonné pin to signify which of the four styles they selected; in-universe, the pin symbolizes they are not a First Order spy. Once inside, Gatherers guide the builders to select the color of their kyber crystal from blue, green, red, or violet. The theme selection determines the box of parts from which the builders receive one predetermined hilt and choose two sleeves, one emitter, one pommel cap, and one set of an activation plate and switch. The builders are guided through constructing the completed hilt, after which they participate in a ceremony of activating the blades. The lightsaber blades provided are 31 inches in length, as opposed to the 36- or 26-inch lengths offered for sale in Dok-Ondar's Den of Antiquities, though further customization items are sold at that store."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}