{"url": "Scandium_Team", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic Special Forces units"], "nodes": [{"tag": "h1", "text": "Scandium Team"}, {"tag": "p", "text": "Scandium Team was a military unit founded by the Alliance to Restore the Republic during its first days."}, {"tag": "p", "text": "Under the leadership of Dutra Zeneta and Harovan Toth, it included another twenty-six agents, among them:"}, {"tag": "p", "text": "Scandium Team was based on Tharin sector, traveling on Anxarta-class light freighter Agent, but their influence became well-known throughout all the sectors of the Galactic Empire. Scandium Team was famous because of its' role in both the Loac Campaign and the Vidicx Campaign - both of these conflicts were won by the Rebel Alliance, mostly because of the Scandium Team."}, {"tag": "p", "text": "The Scandium Team included different units. Probably the most famous one was Delta Unit, which inspired the names of Delta Base and Delta Team. Unit Theta was famous because of its high rate of mortality, and of success. The Ebranites in the team, the Ta'rak sisters, founded Sandstorm Team, specialized in desert infiltration."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Pilot leader Talamiin was injured during the Battle of Gendrah-Narvin, suffering permanent damaged that left him a handicapped person. He had to retire and Aven Cholus became the new flight leader."}, {"tag": "p", "text": "Scandium Team fought on the plains of Bresnan, a planet on Wellte-ir system. The battle, later to be known as the Wellte-ir Massacre: Fifteen members of the Scandium Team were defeated, the survivors being Dutra Zeneta, Harovan Toth, Rith Ta'rak, Aven Cholus, Korgath and Opit-Wenbruh. Cholus rescued the rest of the team from the Umber Banks."}, {"tag": "p", "text": "After the Wellte-ir debacle, Scandium Team was dismantled and the few survivors parted looking for different destinations."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}