{"url": "Scalt", "categories": ["Category:Legends articles", "Category:Creatures of Tatooine", "Category:Scavenger creatures", "Category:Species of undefined sentience", "Category:Vertebrates"], "nodes": [{"tag": "h1", "text": "Scalt"}, {"tag": "p", "text": "Scalts were creatures apparently hailing from Tatooine. They evolved into scavengers, and could be found across the galaxy on starships. They featured large air sacks, clubbed tails, and emitted a high-pitched noise for which they were named."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The front of the Scalt featured large air sacks, and their body ended in a clubbed tail. From their sacks to the tip of their tail, they were often 2½ to 3 feet in length. The Scalts had four legs, and could use all four of them for walking, or two of them if they so chose. Scalts also possessed the ability to lay eggs. Their skin was predominantly yellow, although they featured green mottling on their underbellies."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Scalts were so named for the ear-piercing noise they emitted. They were eventually given to the lifestyle of a scavenger. They preferred to move about in a bipedal fashion. Scalts were termed as being \"hyper\" creatures, and were also considered to be highly strung."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Scalts were believed to have originated on the arid world of Tatooine. They eventually evolved into scavengers, and could be found on starships throughout the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars Galaxy Magazine 3 (1995), the \"Design An Alien\" competition was launched, asking Star Wars fans to create artwork depicting completely original aliens inspired by the original trilogy of Star Wars films. In Star Wars Galaxy Magazine 7 (1996), the winners were announced. In the \"honorable mentions\" section of the \"under 16\" division, the Scalt, a creation of 14-year-old Mary Burroughs, was published. Star Wars continuity editor Leland Chee later stated that the published material from the \"Design an Alien\" competition was to be considered canon. However, the Scalts have yet to be referenced in any other later Star Wars materials."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}