{"url": "Sayormi", "categories": ["Category:Legends articles", "Category:Mid Rim species", "Category:Sayormi"], "nodes": [{"tag": "h1", "text": "Sayormi"}, {"tag": "p", "text": "The Sayormi were a mysterious species that lived in the Dead Forest, a dark, rotten part of the Kkowir Forest on Kashyyyk."}, {"tag": "p", "text": "They were led by the Sayormi Queen, who commanded her people with a fierce fist. Their most feared warrior was Cyrans the Unfeeling."}, {"tag": "h2", "text": "Culture"}, {"tag": "p", "text": "The Sayormi were a rather primitive society, living in simple huts built from animal skins and decorated with bones and skulls. Scarecrows made of wood and bones marked their territory in the Dead Forest, which they defended ferociously."}, {"tag": "p", "text": "Female Sayormi were called witches, while the males were divided into monks and warriors. Their small society was ruled by the Sayormi Queen."}, {"tag": "p", "text": "They worshiped a dead pantheon of deities and tamed some of the wildlife for their use. Mystical tomes bound in Mouf leather, found in their possession, detailed forgotten legends and wild tales."}, {"tag": "p", "text": "The Sayormi were said to possess dark and deadly \"magical\" abilities. They performed dark, bloody rituals that included sacrifices of animals, Wookiees and other unfortunate beings. Voodoo dolls were used to curse their enemies. Their strange rituals lead the Wookiees to believe that the Sayormi were ghosts, haunting their forests in search of blood."}, {"tag": "p", "text": "Bottles with strange potions and juices were found on many killed Sayormi, some with insects or eyes swimming in them. They also brewed their own, very potent alcoholic beverages."}, {"tag": "p", "text": "They wielded rather primitive but deadly melee weapons in battle against their enemies. Sayormi witches were infamous for their skills with their Blackbane nails, primitive chipped stone blades. The Sayormi monks spend many years training with their Sayormi Heartstrikers, small sharp blades named for their ability to crack through the rib cages of their enemies. And among the bloodthirsty warriors, that were known to spill the blood of even their most dangerous enemies, a heavy battle axe called Lifeblood cleaver was the preferred weapon of choice."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Wookiees of the Kerritamba Village often fought with the Sayormi, who they believed constantly searched for blood as evidenced by the humanoid bodies, including those of Wookiees, that hung outside their territory."}, {"tag": "p", "text": "Many years before the Battle of Yavin, Cyrans the Unfeeling killed Chief Kerritamba's father and his family. The young inexperienced Kerritamba was thrown into the leadership role and had to lead his tribe through many years of fights against the Sayormi. Since then, the tribe had thrived again, but still could not defeat their enemy. By the time of the Galactic Civil War, the tribe had all but given up hope of winning, afraid of the Sayormi's tricks and powers."}, {"tag": "p", "text": "In 1 ABY the Sayormi were stirred when Chief Kerritamba successfully cured the poisoned Great Tree. They began to roam the Kkowir Forest area, destroying the trees. Kerritamba decided that the Shoartu tribe would not stand idle and watch their sacred trees die. A brave individual that had helped him cure the Great Tree agreed to help the tribe once more. He ventured into the Dead Forest and killed several Sayormi warriors. Then he struck at the core of the Sayormi people, defeating and killing both the Sayormi Queen and Cyrans the Unfeeling. While some Sayormi still lived in the Dead Forest, the Wookiees were sure that their forests were safe once again."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sayormi, in terms of name, appearance, and out-of-place immigration, resemble the Sanyassan Marauders of Endor."}, {"tag": "p", "text": "The little information known about their culture mainly comes from various items found on killed Sayormi in Star Wars Galaxies: Rage of the Wookiees. The real extent of their supposed \"magical\" abilities is unknown, although it could be speculated that their queen was a Nightsister who could have at least some Force powers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}