{"url": "Scarif_vault", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Galactic Empire locations", "Category:Scarif locations"], "nodes": [{"tag": "h1", "text": "Scarif vault"}, {"tag": "p", "text": "The Scarif vault was a six-story-high data vault located within the Citadel Tower of the Imperial security complex on the tropical Outer Rim planet of Scarif. The vault held scientific treatises, bureaucratic memoranda, and schematics, including the plans to the Galactic Empire's planet-destroying battle station, the Death Star."}, {"tag": "p", "text": "In 0 BBY, the Rebel Alliance squad \"Rogue One\" infiltrated the data vault and stole the station's technical readouts in order to locate its fatal weakness."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located on the tropical Outer Rim planet of Scarif, the Scarif vault was a data vault situated within the Citadel Tower of the Imperial security complex, a research and development installation used as part of the Galactic Empire's Death Star project. A cavernous, refrigerated shaft, the data vault was six stories high and consisted of three towers of stacked data banks, each with nodes aglow with dim red lights that indicated the storage status of ten thousand data-tapes. The tapes, held within individual storage slots, contained copious amounts of data, such as scientific treatises, bureaucratic memoranda and schematics detailed to a microscopic level. Secured behind a large door, the vault was cut off from the local computer network and could only be accessed by a right hand-print scanner. Inside the vault, the data tapes themselves were situated behind a glass barrier and accessed using a manually-controlled retrieving mechanism. After the tape was highlighted green using a computer outside the vault, two handles were used to move the retrieving mechanism up and down the towers to the desired tape."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galen's message"}, {"tag": "p", "text": "In 0 BBY, the Alliance to Restore the Republic, a rebel organization opposed to the Galactic Empire, received word that rebel extremist Saw Gerrera had acquired a message from Imperial scientist Galen Erso pertaining to a new Imperial superweapon he had helped design. In response, Alliance High Command sent Captain Cassian Andor, reprogrammed Imperial KX-series security droid K-2SO and Galen's estranged daughter, Jyn Erso, to the Force-sacred moon of Jedha to retrieve the message and find out how to destroy the weapon. After meeting with Gerrera, Jyn was shown the holographic message in which Galen revealed that the plans to the Death Star, an immense battle station capable of destroying entire planets, were held within the data vault in the Citadel Tower on Scarif."}, {"tag": "h3", "text": "Infiltrating Scarif"}, {"tag": "p", "text": "A few hours later, Jyn, Andor, and K-2 went on an unauthorized mission to Scarif as part of the newly formed Rebel Alliance unit \"Rogue One\" in order to to steal the plans."}, {"tag": "p", "text": "After infiltrating the complex, the trio found a lone KX-series Security Droid which K-2SO proceeded to access the data banks of. After retrieving a map showing the location of the data vault, a distraction triggered by the Rebel Marines outside allowed the three to proceeded to the vault unopposed. Once they arrived, K-2SO knocked out the technician outside and assumed control over the vault's control computer. Upon entering the vault, Jyn skimmed through the files in search of the plans and stopped at \"Stardust,\" the nickname her father gave her, and realized that they must be the plans. As K-2SO tried to fight off stormtrooper reinforcements, he used the computer to highlight the data-tape's position. Andor used the retrieving mechanism to get it, however, before he could fully extract it the door control was shot and the device's power went out. K-2SO implored them to climb to the tape and proceeded to lock the vault before being killed by stormtroopers."}, {"tag": "p", "text": "After the pair removed their disguises, Jyn shot the glass between them and the data towers and jumped across onto the closest one, with Andor following after her. Once she retrieved the data-tape, they climbed up to escape, but before they could, a door opened in the wall revealing Director Orson Krennic and a pair of death troopers. Andor covered Jyn's escape, killing two death troopers before a bolt from Krennic caused him to fall and hit a platform unconscious. Jyn, knowing she couldn't save him, continued climbing. Reaching a malfunctioning hatch, Jyn timed her escape, climbing through the exit just in time."}, {"tag": "p", "text": "After Jyn successfully transmitted the plans to the Rebel Fleet, Grand Moff Wilhuff Tarkin ordered the Death Star to fire on the communications array atop the Citadel using a single reactor ignition, pulverizing the transmission tower and hitting a point several kilometers away from the complex. The resulting explosion destroyed the data vault along with the rest of the complex, and in the process, the surviving members of Rogue One."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Scarif vault was a location created for the premier Star Wars anthology film, Rogue One: A Star Wars Story, released on December 16, 2016. The vault made its first appearance in the teaser trailer for Rogue One: A Star Wars Story on April 7, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}