{"url": "Scavenger/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Salvaging occupations", "Category:Scavengers"], "nodes": [{"tag": "h1", "text": "Scavenger"}, {"tag": "p", "text": "A scavenger or salvager, often abbreviated \"scav,\" was a person or droid whose primary occupation was collecting lost or abandoned items or recovering wreckage from disaster or battle sites."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Some sentient species were predominantly scavengers, such as Jawas, Teeks and Ugors. It was also a common occupation for Humans and near-Humans. Though many scavengers were honorable, the term \"scav\" or \"scavver\" was sometimes used as an insult."}, {"tag": "p", "text": "Meetra Surik encountered some small camps of salvagers on the planet Dantooine, who tried to live by selling the Jedi artifacts they had found in the ruins of the Jedi Enclave in the years after Darth Malak's attack. These salvagers generally held beings with regular jobs in contempt, and would have been particularly pleased if the settlers had been driven off the planet."}, {"tag": "p", "text": "Salvage droids were commonly used to collect debris at podraces during the last decades of the Galactic Republic. Other scavenger droids were less benign, and were used by Trandoshans to kill people and \"scavenge\" their corpses."}, {"tag": "p", "text": "During the height of the Galactic Empire, salvagers that wished to operate needed to register with the Imperial Trade and Commerce Authority. This company was notoriously bureaucratic and receiving the proper permits from them could take months and sometimes even years. Additionally, if a salvager wished to work under the Empire, they would have to submit to an extensive background check. These requirements sometimes lead to aspiring scavengers to forge the proper permits."}, {"tag": "p", "text": "Particularly aggressive scavengers operated in the immediate aftermath of the Imperial Civil War, some of whom maintained small private armies to assist in their operations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}