{"url": "Scavenger_Hunt", "categories": ["Category:Real-world articles", "Category:Book stubs", "Category:West End Games adventure supplements"], "nodes": [{"tag": "h1", "text": "Scavenger Hunt"}, {"tag": "p", "text": "Scavenger Hunt is a roleplaying adventure published by West End Games for Star Wars: The Roleplaying Game. It was written by Brad Freeman and was first published in January 1989."}, {"tag": "p", "text": "In this adventure, a group of Rebel agents must recover datapacks that the Galactic Empire has retrieved from a ruined Rebel base on Dankayo. In the course of their mission, they must haggle with Squibs and encounter malevolent, trash-worshipping Ugors. Aboard the wreckage of the Death Star they recover the lightsaber of Obi-Wan Kenobi, Darth Vader's spare helmet and cape, and an unstable gravity well projector. After fighting pirates sent by Jabba the Hutt and Ugorian forces, they intercept the Imperial transport Elusive on its way to Coronar. In the ensuing battle, an artificial black hole is born."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Front cover"}, {"tag": "p", "text": "In Paradise Sector one alien's garbage is another's treasure. But when that junk sparks a wild quest across the galaxy, only a courageous group of Rebel heroes can save the Alliance."}, {"tag": "h3", "text": "Back cover"}, {"tag": "p", "text": "A funny thing happened on the way to an ambush…and now the largest pile of garbage in the galaxy stands between a Rebel strike team and the fate of secret Alliance sympathizers."}, {"tag": "p", "text": "The Imperials have destroyed the Rebel base on Dankayo, reducing the facility to slag. Now that slag has been loaded into a transport for shipment to an Imperial research base. Buried within the wreckage are intact data banks containing the locations of every Rebel contact in this portion of the galaxy. If that information is discovered, thousands upon thousands of people will die!"}, {"tag": "p", "text": "A Rebel strike team has been assembled to intercept the Imperial transport. Problem number one: figure out the transport's destination so an ambush can be set up along the appropriate space lane. Problem number two: convince the scavenger Squibs to help with problem number one. The Squibs know where the ship is headed, but will only reveal the information in exchange for a favor. A big favor…"}, {"tag": "h2", "text": "Contents"}, {"tag": "h2", "text": "Appearances"}]}