{"url": "Scatalpen_(Podracer)", "categories": ["Category:Legends articles", "Category:Podracer pods"], "nodes": [{"tag": "h1", "text": "Scatalpen  (Podracer)"}, {"tag": "p", "text": "The Scatalpen was the personal Podracer of the Aleena pilot Ratts Tyerell."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Podracer was acquired by Tyerell from a local Tatooine merchant, who had finished fixing it up. Tyerell named the customized Titan 2150 rocket engine Scatalpen, after a deadly predator from Aleen."}, {"tag": "p", "text": "After Sebulba beat him due to cheating, Ratts decided to eliminate him by implanting illegal weaponry in his racer. During the Boonta Eve Classic, on the first lap, his Titan 2150's accelerator jammed in the middle of the Laguna Caves. The engines of his Podracer slammed into the stalactites, and the vehicle exploded, killing Tyerell."}, {"tag": "p", "text": "A few years later, Ratts' son Deland managed to repair the Podracer, and intended to use it in a race illegally and secretly added to the Galactic Games to win his sister's freedom. This plan had to be modified when Sebulba broke Deland's arm in a fight, preventing him from racing. Fortunately for the Tyerells, Anakin Skywalker was one of the Jedi present on the planet and immediately volunteered to pilot in Deland's stead."}, {"tag": "p", "text": "Unknown to Skywalker, in order to help secure a victory -and thus Djulla's freedom- Deland had made a deal with Maxo Vista to have his podracer's navicomputer supplied with advance information of the track ahead. (Skywalker knew someone had received this illicit aid, but due to his knowledge of Sebulba's history of cheating assumed it was the Dug racer's son Hekula). However, Maxo Vista had an ulterior motive for tampering with Deland's navicomputer; he intended to create a scandal by causing one of the pods in the race to crash at the finish line. It was to Vista's great misfortune that Anakin was piloting in Deland's place; the Jedi was able to cut out the navicomputer and use the Force to guide himself through the rest of the course, as well as overpower the backup override. The podracer was damaged in the process; it is unknown if it was repaired again to race another day."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}