{"url": "Scholar", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Stub", "Category:Education and training occupations", "Category:Scholars"], "nodes": [{"tag": "h1", "text": "Scholar"}, {"tag": "p", "text": "A scholar was an individual who was devoted to study of a particular field of work."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Specialization"}, {"tag": "p", "text": "Some scholars specialized in history and historical sites, attempting to form a better understanding of the past.[source?]"}, {"tag": "p", "text": "Korin Aphra, the father of the archaeologist Doctor Chelli Aphra was one such scholar who specialized in the study of the Ordu Aspectu and the Jedi Order with whom they had split. The Ugnaught Korin Pers was also a scholar, having written works on various antiques. Veris Hydan, advisor to Emperor Palpatine, was a scholar of Jedi and Sith history whilst Izal Garsea's father, a Batuuan who was prone to anger yet caring for his daughter, had also once been a scholar."}, {"tag": "p", "text": "Individuals who studied history were also known as historians."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Mysteries of the Force"}, {"tag": "p", "text": "The Force was a topic of great interest to many scholars. The command of knowledge over the will of the Force was jointly sought by scholars and mystics."}, {"tag": "h4", "text": "The Jedi"}, {"tag": "p", "text": "Many scholars believed that the Mid Rim desert moon of Jedha owed its name to the Jedi, while some believed it was the other way around. Nonetheless, all agreed that their histories were entwined. In an attempt to locate the Jedi Order's first Temple, scholars studied several worlds, such as Jedha, Ahch-To, Coruscant, Ossus, and Tython."}, {"tag": "p", "text": "The ranks of the Jedi Order included their own scholars, who were similarly intrigued by the mysteries of the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}