{"url": "Schizophrenia", "categories": ["Category:Legends articles", "Category:Mental conditions"], "nodes": [{"tag": "h1", "text": "Schizophrenia"}, {"tag": "p", "text": "Schizophrenia was a severe mental illness that was often characterized by delusions and hallucinations. Sufferers would sometimes demonstrate a proclivity to violent behavior. This condition could affect multiple species, such as Aleena, Gands, and Humans."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Schizophrenia was a mental illness that would afflict its sufferers with delusions and hallucinations. These hallucinations were often auditory and would manifest as voices. Some schizophrenics would have visual hallucinations, as exemplified by the Aleena Jedi Kazdan Paratus, who believed that his junk constructs of the Jedi Council were actual living individuals."}, {"tag": "p", "text": "Schizophrenics would sometimes exhibit violent behavior. Victor Jun, an Alliance recruiter, would often act on the orders given to him by the voices in his head, which sometimes involved murder. Zuckuss, a Gand bounty hunter, also suffered from schizophrenia, which developed after he had left his homeworld. Co-morbid with his multiple personality disorder, the condition caused him to hear voices and it contributed to the Gand's violent outbursts. It was speculated by Gawynn Karastee, the forensic psychiatrist who diagnosed Zuckuss, that the Gand's mental illnesses may have stemmed from his role as a findsman."}, {"tag": "p", "text": "Although most common with living sentients, droids and other machines are also capable of possessing schizophrenia. The Millennium Falcon, for instance, often had schizophrenic arguments with itself, as a side-effect of its owners modifying the ship's computer to utilize three different models of droid brains."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Schizophrenia, as a disorder, first appeared in 2001, with the publication of The Essential Guide to Alien Species. In a journal entry attributed to Gawynn Karastee, the mental illness served as a retcon to explain the drastic personality changes in Zuckuss, most notably in his appearance in The Bounty Hunter Wars series and the previously-established canon of Of Possible Futures: The Tale of Zuckuss and 4-LOM. The disorder appeared again in the Star Wars Roleplaying Game supplemental Ultimate Adversaries, with the introduction of the character Victor Jun."}, {"tag": "p", "text": "Due to its derivation from Greek for \"split-mind,\" schizophrenia, in media, is sometimes depicted similarly to dissociative identity disorder. For example, in both the The Official Star Wars Fact File 61 and the Star Wars: The Official Starships & Vehicles Collection 8, the characteristics of Zuckuss's schizophrenic diagnosis were described as being more akin to multiple personality disorder, with the illness being termed as simply \"schizophrenia\". However, real-world schizophrenia is characterized by delusions, hallucinations, disorganized speech patterns, abnormal psychomotor behavior, and a negative or flat affect, which are not present in a diagnosis of multiple personality disorder."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}