{"url": "Scepter_of_Ragnos", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with gameplay alternatives", "Category:Scepters", "Category:Sith artifacts", "Category:Sith weapons"], "nodes": [{"tag": "h1", "text": "Scepter of Ragnos"}, {"tag": "p", "text": "The Scepter of Ragnos was a powerful dark side artifact and weapon that once belonged to Marka Ragnos, a Dark Lord of the Sith in the ancient Sith Empire. The sword had the ability to siphon and store dark side energy, and it could also release the energy of the Force on ordinary beings to make them Force-sensitive. In 14 ABY, female Dark Jedi Tavion Axmis obtained the weapon from a collector on the planet Commenor and used it to make many members of the Disciples of Ragnos—a cult that was dedicated to bringing the long-dead Ragnos back to life—Force-sensitive. She and the cult were stopped, however, when Jedi Knight Jaden Korr destroyed the Scepter. Axmis was obliterated along with it when the spirit of Ragnos, who had taken over her body, was forced to leave her."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The metallic artifact known as the Scepter of Ragnos was created by Dark Lord of the Sith Marka Ragnos of the ancient Sith Empire sometime before 5000 BBY. The weapon consisted of a sword that terminated in a forked crest. Both the handle and blade tip were striated, and the pommel had a double guard, the inside guard shorter than the outside. A fuller ran vertically down the center of the blade. The Scepter crest and handle were slate gray, while the blade was silver."}, {"tag": "p", "text": "The Scepter had the ability to siphon and store large amounts of dark side power from areas in the galaxy; when an area was drained, its dark side aura disappeared. The Scepter could fire beams of Force energy or simply unleash a blast of power. The Scepter had the ability to infuse a dead body with enough Force power to reanimate the corpse's cells. It could also use its power to make ordinary beings Force-sensitive. Hidden inside the Scepter's handle was Ragnos's Sith sword, which could be taken out and wielded separately."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sith Lord Marka Ragnos, who lived during the time of the Old Republic, created the Scepter of Ragnos. Ragnos died in 5000 BBY, but his Scepter passed into the possession of a collector on the planet Commenor before 14 ABY. That year, Tavion Axmis, a female Dark Jedi and the leader of the Disciples of Ragnos—a cult dedicated to reviving the long-dead Ragnos—found the weapon in the possession of the collector and, after killing the being, found a more vital use than combat for the Scepter. She discovered the Scepter's ability to reanimate a corpse's cells, bringing the dead body back to life. Apart from that, small amounts of the stored Force power could be released on ordinary beings in order to grant them Force-sensitivity, sometimes on a scale equal to fully-trained Jedi Knights. Axmis used that ability to create an army of Force-sensitives from the ranks of the Disciples of Ragnos, mainly the Sith Cultists. However, the effect was not permanent; if the Scepter was ever destroyed, the beings would lose their Force-sensitivity and animation."}, {"tag": "p", "text": "Axmis used the Scepter to siphon dark side energy out of several places, including the moon Yavin 4. She also used it as a weapon numerous times, such as on the planet Vjun, where she used it to attack Jedi Knight Jaden Korr and Jedi Master Kyle Katarn while they were on a mission there. After gaining so much dark side energy, she attempted to resurrect Marka Ragnos in his tomb on the planet Korriban. Korr arrived on Korriban and battled Axmis, eventually defeating her. However, Axmis then unleashed the Force energy stored in the Scepter onto the sarcophagus of the ancient Dark Lord, and Ragnos's spirit was summoned. Ragnos's spirit immediately took control of Axmis's body, but Korr dueled the possessed Axmis and destroyed the Scepter. When the weapon was destroyed, Ragnos's spirit was drawn back into the sarcophagus, and Axmis died. Also, those who had been infused with the Scepter's power lost their abilities."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Scepter of Ragnos first appeared in the Raven Software video game Star Wars: Jedi Knight: Jedi Academy, which was released on September 16, 2003. It was later mentioned in the 2008 compendium The Complete Star Wars Encyclopedia, written by Stephen J. Sansweet and Pablo Hidalgo. In the non-canonical dark side alternative ending of Jedi Academy, Korr had no intention to destroy the Scepter. After Korr killed Axmis, Jedi Master Kyle Katarn entered the tomb to stop his former apprentice. After a brief battle, Korr fired a blast of energy at Kyle knocking him out, he then proceeded to fire at the roof causing rubble to fall over a knocked out kyle, partially trapping the Jedi Master in the tomb. Korr then blasted his way out of the tomb with the Scepter. After hijacking an Imperial II-class Star Destroyer, and taking over the Imperial Remnant, Korr kept the Scepter for personal use."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}