{"url": "Scimitar_assault_wing", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Imperial fighter wings", "Category:Imperial Special Forces units"], "nodes": [{"tag": "h1", "text": "Scimitar assault wing"}, {"tag": "p", "text": "The Scimitar assault wing was an elite bomber unit operating within the Imperial Navy during the Galactic Civil War. Led by Captain Tomax Bren, the Scimitar assault wing—also known as \"White Death\" due to the light coloration of their starfighters—was based off the Imperial-class Star Destroyer Retribution, and assigned to the Qeimet fleet. Comprised of six squadrons, the Scimitar assault wing employed a variety of craft to achieve their mission profiles. Their primary craft was the TIE/sa bomber, with TIE/LN starfighters and TIE/rc starfighters providing support along with MT/191 drop-ships for coordinated ground assault landings. The unit made its reputation during the Hook Nebula campaign, where Captain Bren's tactics and strategies—many of which breached Imperial High Command's guidelines on the use of TIE bombers—resulted in several victories, and the wing was credited for playing an integral part in the elimination of the Alliance to Restore the Republic presence in the Hook Nebula region."}, {"tag": "p", "text": "The Imperial retreat following the Alliance victory at the Battle of Endor saw the Scimitar assault wing change mission profiles, and they were increasingly called upon to cover retreats and evacuations. Still considered an elite unit, the wing survived the post-Endor period through inaction until the return of Grand Admiral Thrawn from the Unknown Regions. Thrawn rearmed the Scimitar assault wing with the new Scimitar assault bomber, a craft designed in conjunction with Captain Bren. Equipped with seventy-two of the new craft, the Scimitar assault wing was employed as a front-line asset, and was instrumental in the assault on the planet Mrisst during Thrawn's campaign against the Alliance's successor state, the New Republic. Following Thrawn's defeat at the battle of Bilbringi, the Scimitar assault wing was left to languish, and Captain Zgorth'sth of the New Republic's Department of Threat Assessment postulated that Bren would soon lead the unit to defect to an Imperial warlord faction in order to see action, leading Zgorth'sth to suggest that the New Republic would be prudent to eliminate the unit at the first opportunity."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Hook Nebula campaign"}, {"tag": "p", "text": "The Scimitar assault wing was a specialized bomber unit serving within the naval forces of the Galactic Empire during the Galactic Civil War. Formed shortly after the introduction of the TIE/sa bomber into the Imperial Navy, the Scimitar assault wing was created from six separate bomber squadrons, initially as a temporary measure to counter the Alliance to Restore the Republic presence within the Hook Nebula, a strategic sector in the Outer Rim Territories. The assault wing was assigned to the Qeimet fleet, and was based off the Imperial-class Star Destroyer Retribution, which was stationed near the Hook Nebula and tasked with eradicating the Alliance presence in the region. The Alliance had taken control of key manufacturing and industrial centers on several resource-rich planets within the Hook Nebula, and were using their output to resupply their own forces. In addition to driving out the Alliance forces, the Qeimet fleet was also ordered to punish those worlds that had allowed the Alliance to establish a presence on their surface in the first place. The Scimitar assault wing was assigned a key role in the operation, which included the precision bombing of enemy targets without damaging industrial and manufacturing facilities that the Empire wished to take control of for their own use."}, {"tag": "p", "text": "Placed under the command of Captain Tomax Bren, the Scimitar assault wing was the first unit of its type deployed to the Qeimet fleet. Upon assuming command, Captain Bren immediately set about changing the way the Scimitar assault wing operated. Instead of adhering to the guidelines issued by Imperial High Command regarding the deployment and usage of TIE bombers, Bren began altering the unit's tactics, deployment formations and mission attack priorities to better suit the mission profiles and battle theaters in which the wing was assigned to operate. The changes he implemented were looked down upon by some of the wing's older pilots, but they proved to be effective. During the Hook Nebula campaign, Bren and the Scimitar assault wing were responsible for curtailing Alliance gains in the sector."}, {"tag": "p", "text": "The Scimitar assault wing's primary mission was planetary assault and low-level atmospheric bombing runs. While fully capable of conducting these missions in support of ground troops, the Scimitar assault wing was also capable of independent bombing missions, which were used for psychological intimidation and to destroy tactical targets. The unit was so adept at this mission profile that they could bomb a single building to kill entrenched Rebel leadership, or eliminate an entire government by destroying them while in their own council chambers. Since the formation of the unit, the Scimitar assault wing performance record became the standard for Imperial planetary assault and orbital support missions."}, {"tag": "p", "text": "The first use of Bren's new tactics was at the siege of the planet Nulan VI, where the Scimitar assault wing employed deep-atmospheric precision bombing to force the surrender of the planet's Rebel-held capital. Later tactical innovations included the \"Vertical Swoop,\" which was used to great effect against entrenched Rebel anti-atmospheric defenses during the assault of the Aturi Cluster. The Scimitar assault wing also participated in an assault on the planet U'Dray. Combat losses incurred during the ongoing campaign placed the wing understrength, forcing them to accept replacements of TIE pilots from the training squadron aboard the Qeimet fleet flagship, Victorious. However, due to the ongoing assault on U'Dray, the new pilots had no time to undergo standard indoctrination into the wing and were required to complete their training exclusively in live-fire bomber combat missions. Despite the presence of the Scimitar assault wing, the Alliance secured victory at U'Dray, although the Empire was eventually victorious in the Hook Nebula campaign, and the actions of the Scimitar assault wing were credited as a major factor in the victory. During the campaign, the assault wing earned the battle name \"White Death\" due to the light coloration of their TIE bombers, which made them difficult to detect by ground observers during their attack runs until they had struck their target."}, {"tag": "p", "text": "Upon the conclusion of the Hook Nebula campaign, Captain Bren submitted several post-campaign reports regarding the deployment and composition of bomber wings, advocating a carrier-based fleet and the need for TIE wings to be reconfigured to suit the needs of the current mission and combat theater. He also submitted recommendations for a proposed TIE Bomber Mark 2 which would eliminate several flaws that he felt were present in the current generation of TIE bombers, including a less visible profile and upgrades to the craft's deflector shields and armor. Bren also filed reports on his new tactics, including the Vertical Swoop and the Coordinated Bombing-Landing. The reports and tactics were distributed to other TIE wings throughout the Empire: the Imperial Army–controlled wings adopted Bren's tactics, as they often faced similar challenges during their missions, but the Navy-based wings saw little use for his innovations. Despite their record and success rate, the configuration of the Scimitar assault wing was copied by only a handful of units within the Imperial Military."}, {"tag": "h3", "text": "Mixed fortunes"}, {"tag": "p", "text": "Following the Hook Nebula campaign, the Scimitar assault wing was deployed in a number of other assault missions, but none were as demanding as its previous assignment. Following the death of Emperor Palpatine at the Battle of Endor in 4 ABY, the Scimitar assault wing found itself employed in a new role. Instead of participating in invasions and ground assaults, the wing was assigned to covering evacuations and running interference as the Empire was reduced to a quarter of its size under constant pressure from the Alliance's successor state, the New Republic. Considered to be too valuable to waste on anything other than crucial missions, the Scimitar assault wing survived the post-Endor period mainly through inaction."}, {"tag": "p", "text": "In 9 ABY, Grand Admiral Thrawn returned from the Unknown Regions to take command of the remnants of the Empire. Thrawn had read Bren's mission reports and recommendations for an upgraded version of the TIE bomber and agreed with his assessments. After consulting with Bren, Thrawn ordered the production of a new TIE model based on the Captain's recommendations and specifications. The Scimitar assault bomber was the result; Bren's earlier reports had found some purchase with the designers at Sienar Fleet Systems, who had agreed with the pilots' findings. As a result, the Scimitar had been in the planning stages for several years, and production on the new starfighter began in weeks."}, {"tag": "p", "text": "Outfitted with the new Scimitar assault bomber, the Scimitar assault wing played a crucial role in Thrawn's campaign against the New Republic. They were employed to strike at targets such as shield generators and planetary defenses, and a full wing of seventy-two craft played a vital role in the assault on the planet Mrisst. However, Thrawn's death at the Battle of Bilbringi left the Scimitar assault wing as part of Captain Gilad Pellaeon's command. The wing was ignored by the resurrected Emperor during Operation Shadow Hand, and its members quickly found themselves as an elite unit with no mission profile. A High Command unwilling to engage the ascendant New Republic did not know how to use the wing, and it was often without adequate support."}, {"tag": "p", "text": "Sometime after the defeat of the resurrected Emperor, Captain Zgorth'sth of the New Republic Department of Threat Assessment authored a report on Imperial and mercenary units that could potentially pose a threat to the security of the New Republic. He believed that Captain Bren would ultimately bridle under the restrictions and inactivity that his unit was forced to endure, and eventually defect to another Imperial faction in order to be used effectively. While Zgorth'sth felt that inducing Bren to retire himself and his unit was the most ideal approach to countering the wing, he doubted that Bren would do so, as he was loyal to the New Order. Instead, he called for the elimination of the wing by drawing it into an assault mission and using high-speed starfighters to destroy or cripple the unit."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Flight personnel"}, {"tag": "p", "text": "Under Captain Bren's guidance, the officers assigned to the Scimitar assault wing were considered to be more dedicated to the goals of the New Order than their comrades, and more politically reliable. Scimitar assault wing pilots were held to a high level of discipline due to the unit's precisely timed and coordinated bombing runs, where split-second timing and reactions were needed to ensure a successful mission. Mission timing was considered to be extremely critical, as all deployed elements, flights, and squadrons were relied upon to be exactly where they were meant to be when the designated time came. Pilots were drilled that success was achieved through each member of the wing doing exactly what was required of them at the given moment. Penalties were enacted upon squadron members who failed in their duty due to their own negligence, or the application of initiative. In some cases, pilots who were deemed to deviate from the mission consistently were demoted to dropship duty. Extremely capable and dedicated, the pilots of the wing often sought to better their own outstanding records and mission performance. As most of their missions tended to be atmosphere-based, the pilots of the Scimitar assault wing were among the most skilled TIE pilots to fly in atmosphere throughout the Imperial Military."}, {"tag": "p", "text": "Each pilot assigned to the wing completed fifty combat missions before rotating out to serve in a support capacity, including pilot training and mission planning. As new pilots qualified for the support rotation, those pilots already serving in a support position returned to combat duty. Each individual pilot was trained to fly starfighters, with a speciality in piloting Scimitar assault bombers by 9 ABY. They were also trained gunners, and could repair their craft if the need arose. Technical skills possessed by wing members including training in communications equipment and computer programming and repair. They were also trained in survival techniques, and were skilled in the use of a blaster and unarmed combat. Each pilot was issued with a navigation computer linkup helmet equipped with an internal comlink, a high-gravity stress flight suit with life support equipment, a week's worth of emergency rations, and a blaster pistol."}, {"tag": "h4", "text": "Captain Tomax Bren"}, {"tag": "p", "text": "Captain Tomax Bren was the inaugural commander of the Scimitar assault wing, and presided over the unit until at least 10 ABY. Described as a loyalist maverick, Bren's changes to the wing's operational duties were in direct contravention to Imperial High Command's standing guidelines regarding the deployment of TIE bombers. Only the outstanding success rate of the wing saved the Captain from censure by High Command. An investigation into Bren's attempts to change Imperial doctrine was convened and prosecuted, but ultimately the wing's successes led Bren to be vindicated and left in charge of the assault wing. However, Bren had effectively exchanged his career for the good of the assault wing, but it mattered little to him, as it allowed him to remain in command and fly in service to the Empire. His career languished, but as long as he kept securing victory for the Empire, he was politically untouchable."}, {"tag": "h3", "text": "Headquarters"}, {"tag": "p", "text": "The Scimitar assault wing was stationed aboard the Imperial-class Star Destroyer Retribution, which was assigned to the Qeimet fleet during the Galactic Civil War. As the Scimitar assault wing earned a reputation for excellence and became the most well-known of the Qeimet fleet's fighter wings, their effectiveness and success led them to become the Qeimet fleet's shock unit of choice for dangerous assaults. As a result, the Retribution was subordinated to the assault wing, and was exclusively tasked with providing support to the unit which was an unorthodox move, but proof of Captain Bren's combat record. Following the Imperial defeat at Endor, the Retribution briefly served in the forces commanded by Governor Lobax Resuun and served as his flagship and the seat of government for the Tamarin sector. By 10 ABY, the Retribution was back with the Qeimet fleet."}, {"tag": "h3", "text": "Squadrons"}, {"tag": "p", "text": "The Scimitar assault wing was comprised of six individual squadrons. Three squadrons were equipped with the TIE/sa bomber, and were primarily employed to achieve the assault wing's main mission goals. In general, the assault wing deployed its bomber squadrons to attack strategic and tactical targets from orbit or atmosphere. While used to support ground operations, single flights or elements were routinely detached to eliminate smaller targets on the battlefield. Two squadrons flew TIE/LN starfighters and were used for escort and fighter support for the bomber squadrons. When not used to screen the bombers, the TIE fighter squadrons were employed in ground strafing missions, and to harass enemy soldiers and vehicle convoys."}, {"tag": "p", "text": "The sixth squadron was known as the Special Unit squadron, and was made up of reconnaissance craft and drop ships. The Special Unit squadron was divided into three flights; the first flight was comprised of equal numbers of TIE starfighters and TIE/rc starfighters, and were deployed to gather intelligence for the assault wing using the recon craft's specialized sensors and long-range communications packages. The TIE starfighters assigned to the flight would cover the slower reconnaissance fighters when needed, but if the mission profile allowed for TIE/rcs to be unescorted, the TIE fighters were detached to assist the escort squadrons. The other two flights of the squadron were made up of Meller & Dax MT/191 drop-ships used for the transport of ground troops during combined assaults. While not used for combat duty, the drop ships served as cargo vessels and shuttles."}, {"tag": "h3", "text": "Spacecraft"}, {"tag": "h4", "text": "TIE/sa bomber"}, {"tag": "p", "text": "The Scimitar assault wing operated three squadrons of TIE/sa bombers. Developed by Sienar Fleet Systems, the TIE/sa was the successor to the TIE/gt starfighter, which was a TIE starfighter variant that was deployed as a ground-targeting starfighter and bomber. Originally designed with a single elongated pod that contained the flight system and ordnance bay, Sienar soon realized that adding an extra pod would give them more room to incorporate the bomber's systems. The starboard pod housed the pilot, along with flight computers and life support, while the port pod was the bomber's ordnance bay. Measuring 7.8 meters in length, the TIE/sa was armed with two laser cannons and could be equipped with concussion missiles, proton bombs, orbital mines, and free-falling thermal detonators."}, {"tag": "h4", "text": "TIE/LN starfighter"}, {"tag": "p", "text": "TIE/LN starfighters were deployed in two dedicated squadrons by the Scimitar assault wing, with several more assigned to the first flight of the Special Unit squadron to act as escort for the unit's TIE/rc starfighters. Produced by Sienar Fleet Systems in staggering quantities, the TIE/LN starfighter was one of the most recognizable symbols of Imperial Military might, and several variant models such as the TIE/rc reconnaissance starfighter, TIE/fc fire control starfighter, and the TIE/gt bomber were employed by the Empire. Exceptionally fast and maneuverable, the TIE/LN lacked a hyperdrive and deflector shields and was armed with only two laser cannons. Delicate and vulnerable, TIE squadrons often compensated for their deficiencies by shooting first, attacking in swarms, and accepting casualties. Nevertheless, TIE pilots were considered to be an elite force within the Imperial Navy, and were respected and feared by their opponents."}, {"tag": "h4", "text": "TIE/rc starfighter"}, {"tag": "p", "text": "The Scimitar assault wing deployed TIE/rc starfighters in the first flight of their Special Unit squadron alongside TIE/LN starfighters for escort. Measuring 6.3 meters, Sienar Fleet Systems' TIE/rc, also known as the TIE/reconnaissance, was a variant of the standard TIE/LN used for forward scouting during combat. The TIE/rc carried an upgraded sensor package and a long-range communications array to allow them to scout ahead of the main Imperial force and relay data and intelligence on the enemy. Lacking a hyperdrive, the TIE/rc was equipped with enhanced thrusters to allow it conduct fast reconnaissance sweeps and avoid combat, and was mounted with a single laser cannon for offensive and defensive purposes."}, {"tag": "h4", "text": "MT/191 drop-ship"}, {"tag": "p", "text": "Scimitar assault wing's Special Unit squadron employed two flights of Meller & Dax MT/191 drop-ships. Measuring 52.5 meters in length, the MT/191 was designed to powerdive into a planet's atmosphere before landing on the surface in a controlled manner after the freefall. Covered in an ablative coating known as VACX to increase the craft's hull rating, MT/191 drop-ships were armed with a single light laser cannon which was retracted into the body during atmospheric entry. The MT/191 was capable of transporting up to 160 passengers, and was also capable of landing on a planet normally."}, {"tag": "h4", "text": "Scimitar assault bomber"}, {"tag": "p", "text": "Introduced in 9 ABY, the Scimitar assault bomber was the result of Captain Bren's recommendations for an improved TIE bomber, design work by Sienar Fleet Systems engineers who had agreed with his findings, and the return of Grand Admiral Thrawn. After consultations with Bren, Thrawn ordered the Imperial industrial centers to begin producing the Scimitar assault bomber. Measuring 13.8 meters in length, the Scimitar was powered by an ion thrust sublight engine and two interlocked repulsorlift generators. The result was a stable, nimble atmospheric craft that was employed as a dedicated assault bomber. Armed with two laser cannons—which could be angled to conduct strafing runs—the Scimitar's main weaponry was twin racks of concussion missiles mounted under its wings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Scimitar assault wing was first mentioned in the first edition of the Imperial Sourcebook, published by West End Games in 1989. The information was reprinted in the second edition of the work, published in 1994. Also in 1994, The Last Command Sourcebook made mention of the Scimitar assault wing—referred to as the \"Scimitar Wing assault group\"—in the entry for the smuggler Dravis. The information was reprinted in The Thrawn Trilogy Sourcebook released in 1996."}, {"tag": "p", "text": "The wing was mentioned within the entry for the Scimitar assault bomber in 1996's The Essential Guide to Vehicles and Vessels, and the unit's later history was detailed in the Special Military Unit Intelligence Update feature written by Timothy S. O'Brien and published in Star Wars Adventure Journal 15 in 1997. 1998's Star Wars Encyclopedia made reference to the unit in its entry for the Scimitar assault bomber, as did The New Essential Guide to Vehicles and Vessels in 2003. Issue 84 of The Official Star Wars Fact File mentioned the Scimitar assault wing while detailing the Scimitar assault bomber, while 2007's Starships of the Galaxy for Wizards of the Coast Roleplaying Game and 2008's The Complete Star Wars Encyclopedia did the same in their entries for the Scimitar assault bomber."}, {"tag": "p", "text": "In 2000, Decipher, Inc. produced the Death Star II Limited expansion pack for the Star Wars Customizable Card Game. In the expansion, cards representing a Scimitar Squadron were included, designating them as an elite TIE bomber unit. However, the squadron's commanding officer is designated as Major Rhymer, not Captain Bren. No official source has linked Scimitar Squadron with the Scimitar assault wing."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}