{"url": "Scimitar/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Star Couriers", "Category:Starships of the Order of the Sith Lords", "Category:Stealth ships"], "nodes": [{"tag": "h1", "text": "Scimitar"}, {"tag": "p", "text": "The Scimitar (or Sith Infiltrator) was a prototype stealth-ship used as the personal starship of Darth Maul, the Sith apprentice of Darth Sidious, prior to the Invasion of Naboo around 32 BBY."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Scimitar had a pair of folding wings around a round cockpit; a design which was used on T-class long-range personal cruisers like the Valcyn which were used by Sith Lords like Darth Bane during the New Sith Wars about a millennium earlier and would later resurface in the famous TIE Series of starfighters used primarily by the Galactic Empire."}, {"tag": "p", "text": "In front of the round cockpit (the whole forward-center section of the spacecraft) of the vehicle was a rare stygium crystal-powered cloaking device for creating an invisibility field. This enabled the ship to sneak through even the most advanced of security technologies and allowed its master to evade pursuit while on his missions."}, {"tag": "p", "text": "Built beneath the cloak field generator was a series of compartments containing various equipment for Darth Maul's missions including three DRK-1 Dark Eye probe droids, his speeder bike Bloodfin, several interrogation droids and several security droids, spying equipment, torture devices, bombs and mines."}, {"tag": "p", "text": "The Infiltrator was protected by six low-profile solar ionization cannons which could extend and fire several bursts in the blink of an eye. It was also equipped with an experimental high temperature X-C 2 ion drive array which would resurface in future Sienar designs while the ship's hyperdrive was an unmodified SSDS 11-A. It could also carry six passengers while its total capacity was 2.5 metric tons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Scimitar was an extensively modified version of a Sienar Design Systems prototype for an advanced Star Courier and was allegedly designed by Raith Sienar himself—though he would later dispute his involvement—for a mysterious client, later revealed to be Darth Plagueis. In reality, the ship had been designed by famed starship designer, Darth Tenebrous, Plagueis's Sith Master."}, {"tag": "p", "text": "Plagueis used the ship to escape from an attack on his fortress on Sojourn by a coalition of forces hired by the King of Naboo, Ars Veruna. He cloaked the ship and rendezvoused with Jabba the Hutt and his ship, the Star Jewel. Plagueis later bequeathed the courier to his apprentice, Darth Sidious, and recommended that he give the ship to Darth Maul."}, {"tag": "p", "text": "Having survived a dangerous training session with deadly combat droids, Darth Maul was sent on a mission by Lord Sidious to kill the leading Vigos of the powerful Black Sun crime syndicate which dominated a significant amount of crime in the galaxy. For this mission, Maul was equipped with the courier, which he would christen Scimitar. The Sith apprentice then left his master's base in the galactic capital of Coruscant cloaked by its powerful stygium powered-cloaking device and passed over the Jedi Temple itself, which only caused a slight disturbance in the Force for Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi."}, {"tag": "p", "text": "After disposing of the Black Sun vigos including Master Alexi Garyn on Ralltiir, Darth Maul returned the Scimitar to Coruscant while hunting the Trade Federation traitor Hath Monchar. Following the completion of that mission, Maul was assigned by his master to track down the missing Queen Amidala of Naboo, along with her entourage and her pair of Jedi guardians Qui-Gon and Obi-Wan. After breaking through the Trade Federation blockade on Naboo, Amidala and her guardians made their way to the remote desert planet of Tatooine. Thanks to the enhanced features of the Scimitar and its complement of spy droids, it was to this locale that Darth Maul finally tracked & confronted Master Qui-Gon, who only narrowly escaped."}, {"tag": "p", "text": "However, Darth Maul would later meet his foes again during the battle for Naboo, presumably landing the Scimitar within the confines of the Trade Federation-controlled Theed Palace. The Sith Lord managed to defeat Qui-Gon Jinn, before being seriously wounded and left for dead by Obi-Wan Kenobi. Following that, the Scimitar passed into the hands of the Republic."}, {"tag": "p", "text": "The first technicians to inspect the courier were killed by automated defenses, so Jedi Master Saesee Tiin was tasked to help in securing the craft. While he found a large amount of equipment, including torture devices and other less-sinister pieces of technology, the onboard computers had been erased. The ship was going to be transferred over to Kuat Drive Yards for study, but disappeared somewhere en route according to official records. In reality, as of 19 BBY, the Republic was storing it in a clandestine hangar in Theed. At some point, however, the Scimitar was recovered by Darth Sidious, who kept it during his reign as emperor of the Galactic Empire."}, {"tag": "p", "text": "The Scimitar was an influence in the creation of the Rogue Shadow, which was similarly produced by a Sienar company."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Darth Maul: Shadow Hunter, the ship is referred to as the Infiltrator."}, {"tag": "p", "text": "In the book Inside the Worlds of Star Wars Trilogy, there is a ship that looks very much like the Scimitar in the section on Mos Eisley.\nOn the deckplan of the Scimitar from Starships of the Galaxy, Saga Edition, the Scimitar's cockpit and airlock are shown to be on different levels, while in the book Episode I Adventures 3: The Fury of Darth Maul, Maul is said to have seen a Bartokk reflected in the cockpit viewscreen, while seated in the pilot's chair, and opened the airlock directly behind himself to vent the assassin."}, {"tag": "p", "text": "The Scimitar is playable in the last bonus mission in the 2000 video game Star Wars: Episode I: Battle for Naboo. In another video game, Star Wars: Starfighter, released in 2001, the Scimitar can be unlocked by beating all story-based missions with a \"Gold\" rank, or by entering the code \"SIENAR&!\" in the N64 version or \"FRBPTDAY\" in the PC version. The vehicle is equipped with specially powerful weapons that make gameplay easy—laser cannons and two fire-linked seeker missile launchers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}