{"url": "Scomp_link/Legends", "categories": ["Category:Legends articles", "Category:Technology stubs", "Category:Droid interfaces"], "nodes": [{"tag": "h1", "text": "Scomp link"}, {"tag": "p", "text": "A scomp link, computer interface arm, or computer-coupler was an astromech droid accessory that allowed the droid to plug into computers, via a computer terminal, and other equipment. It consisted of an extensible arm with a rotating tip. Other names included standard access adapter, computer input port, and computer interface socket."}, {"tag": "p", "text": "Code cylinders also contained a scomp link that allowed them to interface with security systems and computers."}, {"tag": "p", "text": "R2-D2 used this tool to save his masters many times. He saved Padmé Amidala on Geonosis by deactivating a piece of assembly line machinery that would have otherwise killed the senator. R2 also used his scomp link to control the turbolift Anakin Skywalker and Obi-Wan Kenobi occupied on the Invisible Hand. Later, he used it to stop Garbage Compactor 3263827 from crushing Luke Skywalker, Han Solo, Chewbacca, and Leia Organa on the Death Star. He also used it to open the door to the bay where the Millennium Falcon was located during the escape from Cloud City, and learned that the hyperdrive on the ship had been deactivated. R2 also tried to help using the scomp link during the Battle of Endor at the Endor shield generator bunker, but before he could slice into the door controls and override the security codes for the lock, a stormtrooper saw what he was trying to do and fired a single shot that hit R2 and sent him reeling back from the scomp link terminal, causing R2 to suffer a short-circuit as his various devices popped out as a result of the power surge, forcing Han to try to manually override it."}, {"tag": "p", "text": "Scomp links could also seemingly be used to transmit data from one device to another. While pursuing Rivo Xarran, Boba Fett had the scope on his blaster rifle scomp-linked to his visor, so he could aim while in a position that would otherwise preclude precision shots."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}