{"url": "Scimitar", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Confederacy of Independent Systems starships", "Category:Star Couriers", "Category:Starships of the Galactic Empire", "Category:Starships of the Order of the Sith Lords", "Category:Stealth ships"], "nodes": [{"tag": "h1", "text": "Scimitar"}, {"tag": "p", "text": "The Scimitar, also known as the Sith Infiltrator, was a heavily modified Star Courier and the personal starship of Darth Maul. After his defeat during the Battle of Naboo, the experimental starfighter was appropriated by Maul's master, Darth Sidious."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Sith Infiltrator featured folding wings around its spherical cockpit, and was secretly modified from a Star Courier manufactured by Republic Sienar Systems. The craft featured six laser cannons, a proton torpedo launcher and a minelayer. Along with its deadly armament, the Scimitar was equipped with a cloaking device, powered by rare stygium crystals from the planet Aeten II, that allowed it to disappear from view and any pursuing ship's sensors. Owing to the craft's experimental ion engines, radiator fins on the ship's wings were required to be open during flight in order to expel excess heat."}, {"tag": "p", "text": "The ship carried three DRK-1 Dark Eye probe droids and the Bloodfin, a Sith speeder utilized by Darth Maul during his mission on Tatooine. The Scimitar was capable of tracking a ship's signature through hyperspace, something considered impossible for other ships."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Age of the Republic and the Clone War"}, {"tag": "p", "text": "At the time of the Invasion of Naboo, the Scimitar was the personal starship of Darth Maul, who used it in an attempt to track Queen Padmé Amidala on Tatooine. After his defeat, the ship fell into the possession of Maul's master, Darth Sidious."}, {"tag": "p", "text": "During the Clone Wars, the Scimitar was used to transport Sidious and General Grievous to the surface of Dathomir, where the Sith Master had a duel with his resurfaced former apprentice and the Nightsister Mother Talzin."}, {"tag": "h3", "text": "Under the Empire"}, {"tag": "p", "text": "Many years later, the Scimitar was still in the possession of Sidious, who now ruled the First Galactic Empire as Emperor Palpatine. It was held in Imperial Facility 729-D, located somewhere in the Inner Rim, and curated by the droid O-66. At some point before the Battle of Hoth, the bounty hunter Chanath Cha was entrusted with the modified Star Courier in order to retrieve the stolen Imperialis, Palpatine's luxury pleasure craft."}, {"tag": "p", "text": "Chanath and O-66 used the Scimitar's advanced tracking systems to find the Imperialis's location. While O-66 waited aboard the Scimitar, Chanath boarded the Imperialis. O-66 also transmitted the Imperial yacht's operational codes. After Chanath had set the ship to self-destruct, she ordered O-66 to dock the Scimitar so that she, Lando Calrissian, and Lobot could flee the doomed Imperialis. However, O-66 refused to obey her orders because his primary directive was to protect and honor the Scimitar. Despite Chanath's threats, O-66 revealed he had removed her pulse bomb and flew the Scimitar away."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Scimitar first appeared as Darth Maul's personal transport in The Phantom Menace movie. The ship's backstory was further explored in several Legends media and literature including Daniel Wallace's 2003 reference book The New Essential Guide to Vehicles and Vessels.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}