{"url": "Balfus", "categories": ["Category:Canon articles", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Balfus"}, {"tag": "p", "text": "Balfus was a male Wookiee who lived on Kashyyyk some years before the Clone Wars. During Life Day, he was captured by Trandoshans hunters and held in captivity, along with other Wookiees and the Jedi Master Qui-Gon Jinn, until the Jedi Padawan Obi-Wan Kenobi and other Wookiee warriors came to save them. The Trandoshan hunters surrendered and returned Balfus and the other prisoners."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Balfus was a Wookiee who lived on Kashyyyk, a planet in the Mid Rim,  before the Clone Wars, a war between the Galactic Republic and the Confederacy of Independent Systems. Before the Life Day celebrations began, Balfus was captured by Trandoshan hunters because the Trandoshans knew that the Wookiees were weak during Life Day. When the Jedi Master Qui-Gon Jinn, who was on Kashyyyk with Obi-Wan Kenobi, his Padawan, to study the Wookiees, asked Brennonn, a Wookiee who lived in the same village as Balfus, where Balfus was, the Wookiee answered that he was missing. The Trandoshans later attacked the Wookiee village, capturing other Wookiees and Jinn himself."}, {"tag": "p", "text": "The Wookiees were eventually freed, using a trick thought by Obi-Wan Kenobi. Kenobi pretended to surrender to the Trandoshans, but he eventually freed his master Qui-Gon Jinn opening his cage with the Force and throwing his lightsaber at him. As Jinn was freed, other Wookiee warriors came to support the two Jedi. The hunters surrendered and released the five Wookiees that were held captive."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Balfus was first mentioned in the comic story \"Life Day,\" published in the comic book Star Wars Adventures 3 on February 3, 2021. The comic story was written by Michael Moreci and illustrated by Megan Levens and Charlie Kirchoff."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}