{"url": "Scourge_(Victory_I-class)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Victory I-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Scourge (Victory I-class)"}, {"tag": "p", "text": "The Scourge was an Imperial Victory I-class Star Destroyer that was active and well known in the Darpa sector of the Core Worlds by 0 ABY. Manufactured by Rendili StarDrive, the Scourge was 900 meters in length. Commanded by Vice Admiral Alpiett Gredge, the vessel patrolled the area around the planet Ralltiir, and regularly inspected the sector's two military space stations, Station 2LC/Blue and Station 1B6/Green."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Scourge was a Victory I-class Star Destroyer, 900 meters in length, and manufactured by Rendili StarDrive. It possessed a Class 1 primary hyperdrive, with a Class 15 as backup in case the other malfunctioned. Additionally, the Star Destroyer had functional sensors, deflector shields, and navigation computer. A full crew of 4,798 personnel and 402 gunners would operate the Scourge, though the ship could run on a skeleton crew of 1,785 and fifteen gunners if need be. It also had enough room to transport 2,040 troopers. The Scourge held enough consumables to last its crew four years, and had a cargo capacity of 8,100 metric tons. Armaments-wise, the destroyer possessed ten quad laser cannons, forty double turbolaser cannons, eighty concussion missile launchers, and ten tractor beam projectors. The Scourge had a maximum speed of 800 kilometers per hour in a planet's atmosphere."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Scourge was one of the Imperial Navy's Star Destroyers that was well known in the Core Worlds' Darpa sector as of 0 ABY, when the Galactic Empire was engaging the Alliance to Restore the Republic in the Galactic Civil War. Commanded by Vice Admiral Alpiett Gredge, the Scourge patrolled the restricted area surrounding the planet Ralltiir, and also regularly inspected the two Imperial border outposts in the sector: Station 2LC/Blue, a Bavos-I heavy-duty military space platform, and Station 1B6/Green, a Bavos-II heavy-duty military space platform. The ship also frequently stopped at 2LC/Blue to supply the space station with deliveries varying from new crew members to cargo pods filled with supplies. When Gredge learned that some of the crew of the EF76 Nebulon-B escort frigate Far Orbit had mutinied from under Imperial Captain Vocis Kenit, the Scourge's commander was happy to provide any help he could to Kenit in tracking the rogue vessel."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Scourge was helmed by Vice Admiral Alpiett Gredge, a respected and honorable commander who was an unwavering supporter of the Imperial Navy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Scourge was first mentioned in 1998's The Far Orbit Project, by Timothy S. O'Brien. The book was a supplement to West End Games' Star Wars: The Roleplaying Game and was a sequel of sorts to the previous publication, Pirates & Privateers, carrying on that book's theme by following the Far Orbit's adventures."}, {"tag": "p", "text": "The Scourge is one of the key players in the scenario hook \"Who is the More Foolish…\" and the adventure idea \"Smash the Scourge!\" The former involves the Scourge being drawn away from Ralltiir by the Far Orbit's raids on 1B6/Green, leaving the Rebels on Ralltiir with more room to breathe. \"Smash the Scourge!\" involves the Star Destroyer being lured to an ambush point by the Far Orbit where an Alliance taskforce captures or destroyes Gredge's vessel. However, neither of these adventures are canon, as they conflict with the events of the adventure scenario The Capture of Coh Veshiv, which is considered the better choice as it is a full blown scenario. The conflict between The Capture of Coh Veshiv and the scenarios in which the Scourge is featured arises because both lead to the Imperials fully going after the Far Orbit for the first time in the Darpa and Bormea sectors."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}