{"url": "Scouting_for_Leia/A_Mission_with_Maz", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:Articles needing illustration", "Category:LEGO Star Wars: All-Stars"], "nodes": [{"tag": "h1", "text": "Scouting for Leia/A Mission with Maz"}, {"tag": "p", "text": "Scouting for Leia/A Mission with Maz is the fourth episode of LEGO Star Wars: All-Stars. It was released on Disney XD on December 1, 2018."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "\"Scouting for Leia\""}, {"tag": "h4", "text": "Inventory duty on D'Qar"}, {"tag": "p", "text": "At the Resistance base on the planet D'Qar, Moxie Freemaker is carrying a barrel. She tells the Ka Pao this is how we prepare for the inevitable confrontation with the First Order. She presents the \"Parts You Need\" speeder, an old hovertruck one of whose wheels falls apart. Ka Pao jokes about the derelict truck while Roger suggests naming it the \"Mobile Parts Platter.\" Moxie sticks to her original name and tells them to get in. Roger is slow and ends up running after the truck."}, {"tag": "p", "text": "Moxie passes a landing gear tool to a Resistance mechanic working on a T-70 X-wing starfighter. She then asks Paige and Rose Tico what they need. Rose asks for a targeting computer and Ka Pao passes one to them. Rose thanks Moxie. Moxie then visits a group of ground crew working on a Resistance transport. She asks what is the diagnosis. The mechanic says that the stabilizing gyroscope is fried. Roger passes them one."}, {"tag": "p", "text": "As they continue their drive, Roger asks about the \"master faster parts blaster.\" Moxie says no and manages to brake her truck in front of Lieutenant Mundu. He tells Private Moxie that he assigned her to inventory duty and asks her why she is zipping to and fro. Moxie explains that she and Private Pao thought it was better that they brought the inventory to where it was needed. The speeder lets them get the right parts out there in half the time. A part drops off."}, {"tag": "p", "text": "Roger checks the datapad and says that he accidentally gave the transport ground crew a deflector shield energizer instead of a stabilizing gyroscope. Moxie is annoyed but Roger says he was distracted with coming up with other names for their truck. Just then, the Resistance transport spins out of control before crashing into an X-wing. The X-wing fires a laser bolt at the MG-100 StarFortress SF-17, causing it to crash forward and explode. The pilot crashes on Mundu."}, {"tag": "h4", "text": "Gatecrashing Graballa's party"}, {"tag": "p", "text": "Meanwhile at Canto Bight, the Hutt crime lord Graballa announces the opening of Graballa's Beachside Resort and Buffet. He tells the Toydarian Yeppau that it took forty years of hard work and that no one believed in his dream including Jabba, Darth Vader, and even Yeppau. Graballa is jubilant that he made his dream come true and drinks a toast to himself."}, {"tag": "p", "text": "However, First Order ships shoot down a yellow airspeeder, which crashes outside the beachside resort. Graballa remarks that his dream has become a nightmare. Kylo Ren's TIE Silencer soon lands outside the resort flanked by two Atmospheric Assault Landers. First Order stormtroopers march out of the landers while Kylo Ren climbs out of his TIE Silencer. The stormtroopers form an honor guard."}, {"tag": "p", "text": "Graballa welcomes Kylo Ren and offers to shuffle a few reservations. However, the Master of the Knights of Ren proceeds to levitate and Force choke Graballa. He tells Graballa he has need of his skills. When Graballa asks if he is trying to be like Darth Vader, Kylo Ren responds that Vader was his grandfather. Graballa quips that Vader doesn't seem to have been the family type."}, {"tag": "p", "text": "Kylo Ren lowers Graballa, who says he sees the resemblance. Kylo says he has his grandfather's helmet and will soon have his lightsaber. He tells Graballa that he wants Vader's former Jedi starfighter to complete his collection. When Graballa asks what that has got to do with him, Captain Phasma tells him that according to Imperial records his Jedi starfighter was last known to be in the hands of the Freemaker family. Phasma presents a hologram of the Freemakers."}, {"tag": "p", "text": "When Graballa asks what it has to do with him, Kylo Ren tells Graballa that he knew the Freemakers and that he once helped Darth Vader. He demands that Graballa help him. The Hutt says he hasn't seen those kids in thirty years and says he is a little busy at the moment. Graballa tells Kylo Ren that his hotel is having a grand opening and asks him to table the discussion to the future. However, Kylo Ren ignites his lightsaber and slices a statue of Graballa apart. Graballa says he can do it now. Phasma orders her troopers to roll out and Kylo Ren leaves in his starfighter. As the First Order flies off, Graballa bellows at the Freemakers in rage and frustration."}, {"tag": "h4", "text": "General Organa to the rescue"}, {"tag": "p", "text": "Back on D'Qar, Lieutenant Mundu asks Moxie what she was think while fire crews put out the bomber's fire. Moxie says that he uncle and father fought for the Rebellion and says that she is eager to help the Resistance. Ka Pao agrees that he was too eager as well. Mundu tells Moxie she is rash, foolhardy, and irresponsible. Roger doesn't disagree."}, {"tag": "p", "text": "Mundu tells Moxie that Roger is a walking security risk. Roger protests but Mundu orders Moxie to wipe his memory banks and shut him down. Moxie protests that Roger has been in her family for generations and says that he is her best friend. Mundu asks if she is refusing a direct order. Moxie counters that it is a very wrong order."}, {"tag": "p", "text": "General Leia Organa asks what is the problem here. Lieutenant Mundu apologizes for not seeing her coming. He tells her that Private Freemaker is refusing a direct order to wipe her droid's memory banks. Leia says she can let that slide because droids can mean a lot to the Rebellion and a family. There is a brief shot of the red-armed C-3PO tending to the hibernating R2-D2. Moxie smiles while Leia dismisses Lieutenant Mundu."}, {"tag": "p", "text": "Moxie thanks General Organa but the General tells her not to thank her yet because she has gotten an assignment for her. Moxie is excited and asks if it is a super, secret mission to sneak into Snoke's lair. When she asks what is the assignment, General Organa tells her that she needs Moxie to scout old rebel bases and report back to her on anything they can use. Moxie, Ka Pao and Roger tell her they are excited to serve the Resistance."}, {"tag": "h4", "text": "Searching for rebel bases"}, {"tag": "p", "text": "Moxie and her team report nothing on Yavin 4, Atollon, and Hoth. On Hoth, they are startled by the roar of a wampa. However, it turns out to be a baby wampa. While traveling through hyperspace on their Resistance transport pod, Ka Pao sighs but Moxie tells him they may have better luck on the planet Crait. On Crait, Moxie is initially dismissive of the Crait outpost and tells Pao that it will be a short report."}, {"tag": "p", "text": "Moxie prepares to type on her datapad a message to General Organa that they went everywhere and they found nothing. She asks how her work is helping the Resistance. Just then, Roger finds several ski speeder. Ka Pao thinks they are junk. Moxie agrees they look pretty messed up and decides to put them back together for a test drive. Ka Pao agrees."}, {"tag": "p", "text": "The three working on reassembling the ski speeders. Roger trips and rockets out on an engine. Ka Pao saves him but the engine crashes. The three take the ski speeders for a test drive on the deserts of Crait. Moxie and Ka Pao have success with their speeders while Roger complains his speeder is faulty. Moxie tells him to give it a go and that he is missing out on the fun."}, {"tag": "h4", "text": "Skirmish with the probe droid"}, {"tag": "p", "text": "The trio are detected by a white spherical First Order probe droid. Moxie takes the speeder for a spin and draws the rebel starbird on the salty ground, stirring up red soil. Ka Pao laughs. Roger says he has made some adjustments and is stating to get the hand of it when his speeder comes under fire from the First Order probe droid."}, {"tag": "p", "text": "Moxie tells Ka Pao to jam its signal to prevent the probe droid from busting their mission. Moxie and Ka Pao lead the probe droid on a chase skirting past a mountain. The probe droid blasts apart their transport pod which Roger draws attention to. While pursuing the probe droid, Pao's speeder collides with Roger's speeder. The two survive the crash. When Ka Pao blames Roger in his language, Roger responds that they would settle whose fault it is later. Via comlink, Roger tells Moxie it is all on her now."}, {"tag": "p", "text": "Moxie responds that it is a good thing she thrives under pressure. However, the probe droid is able to override her jammer. She vows to take out the probe droid or die trying. Moxie drives her speeder towards the probe droid. The probe droid blasts off one of her speeder's cannons. Staying on target, she rams the speeder into the droid before ejecting from the vehicle. The probe droid and the speeder go up in flames. Moxie parachutes down in her ejector seat and is greeted by Roger and Ka Pao. She is jubilant but says they have some cleaning to do before they go home. Ka Pao then points to the flaming speeder. Moxie realizes that going home will be a problem."}, {"tag": "h4", "text": "Roger's old friend"}, {"tag": "p", "text": "Roger says he has a friend who will be able to help out. When Moxie asks if he does, the droid replies that he has been around this galaxy for so long. Roger tries to promote his autobiography From Trenches to Wrenches: The Roger Story, which now has an updated cookies recipe. Ka Pao is pleased but Moxie tells him to just call his friend. Roger contacts Maz Kanata by holoprojector and asks for her help. Maz asks a Roger what mess he has gotten himself into this time."}, {"tag": "h3", "text": "\"A Mission with Maz\""}, {"tag": "h4", "text": "Graballa's gamble"}, {"tag": "p", "text": "Back in Canto Bight, Baash and Raam reassemble Graballa's statue, which had been cut into pieces by Kylo Ren. Upstairs, Graballa complains that the universe is conspiring against him. He tells Yeppau and a Gotal henchman that all he does is to want to overcharge for Canto \"mini-bites.\" Graballa doesn't know where the Freemakers are."}, {"tag": "p", "text": "Just then, Captain Phasma contacts him by holoprojector for a progress report. Graballa claims that he is flying through a nebula but admits that he doesn't know how the Freemakers look like after all these years. He slams his fist into the Gotal henchman and says that humans age so fast. Yeppau says yep and displays a hologram of Roger. Graballa then recalls that the Freemakers have a battle droid."}, {"tag": "p", "text": "Graballa says he knows how to find him and all that they need is a droid control ship. Graballa asks which is the nearest Clone Wars battle site. Consulting the datapad, Yeppau picks up Ord Tellarom, which is six parsecs away. Graballa laughs. Graballa travels to Ord Tellarom in the Rancor's Fist. After landing, Graballa exits through the cargo door with his entourage and remarks that the planet is a dump. However, he says that it has gotten a droid control ship. Graballa says \"let's find that Freemaker droid or more accurately make him find us.\" Yeppau agrees."}, {"tag": "h4", "text": "Hijacking Roger"}, {"tag": "p", "text": "While traveling through hyperspace on Maz Kanata's ship, Moxie asks who Maz is. Maz says that Moxie doesn't know her but that she knows her eyes. Maz remarks that she has seen these eyes before. Moxie is confused but Roger tells her to relax because this is something that Maz does. Maz recognizes Moxie as a Freemaker and tells her that she is an old friend of her family. She tells Moxie that her father once flew a ship through her doors and that he had the audacity to declare himself \"Superstar Pilot Guy.\""}, {"tag": "p", "text": "Meanwhile, Roger suddenly walks up and throws Ka Pao out of the pilot's seat. When Moxie asks what he is doing, Roger replies that he is responding to a strange thing. Max remarks that this is troubling news. Roger adds that he has no idea why he is plugging in new coordinates into the navicomputer but that he doesn't know why."}, {"tag": "p", "text": "As Roger takes Maz's ship into lightspeed, he adds that this isn't him doing this. Moxie, Maz, and Ka Pao try to force Roger away from the controls but Roger slams the brakes. Roger apologizes and says he feels terrible about this as they approach Ord Tellarom. In the bridge of the droid control ship, Graballa asks if this thing is working. Yeppau checks with the monitor which shows the ship approaching. Graballa boasts about being happy for a brief moment."}, {"tag": "p", "text": "Meanwhile, Moxie manages to pry Roger from the controls and tells him he has something coming for his \"unacceptable\" behaviour. Maz points out that it is already happening as her ship crash-lands on Ord Tellarom, colliding with some wreckage on the way. Roger exits the cockpit and says he is off and wonders where he is going."}, {"tag": "h4", "text": "Return to Ord Tellarom"}, {"tag": "p", "text": "He realizes that the planet is Ord Tellarom where the Freemakers first found him. Maz grabs him with her rocket pack and demands to know what has gotten into Roger. She tells him he is better programmed than this. Roger breaks free and the switches off the rocket pack's power button. He adds that his programming seems to be the problem. The two crash on the sands below."}, {"tag": "p", "text": "Roger apologizes before walking off. He says he doesn't know why he is doing it but is impressed by how he is doing it. Moxie and Ka Pao trap him using a makeshift cage made out of junk. Moxie asks what has gotten into Roger. Maz thinks they should be asking who and points at the droid control ship. She realizes that someone must have activated the ship's homing signal, summoning Roger here."}, {"tag": "p", "text": "Using her goggles, Maz discovers that the somebody is Graballa the Hutt. As Moxie and Ka Pao spy on Graballa with their macrobinoculars, Maz says that Graballa is slimy even by Hutt standards. Moxie asks what he wants with Roger and remarks that Roger will find a new way to mess up even a simple task. Roger disassembles himself and slips his parts out of the cage. He then reassembles himself. Moxie describes Roger as a good friend but reasons the Graballa doesn't want a friend. She asks what this is about."}, {"tag": "p", "text": "Roger the stuns Maz, Moxie, and Ka Pao and says that he wished he knew and remarks that he doesn't think that Graballa likes his cookies. Moxie and her friends soon awake and find Roger walking towards the droid control ship. Moxie proposes letting them have Roger but not the way they are expecting."}, {"tag": "h4", "text": "Turning the tables"}, {"tag": "p", "text": "As Roger approaches Graballa, the Hutt says long time no see. Roger disagrees and says not long enough. Graballa responds that he didn't and he won't. Meanwhile, Moxie and the others fly into the droid control ship's command bridge using Maz's rocket pack. Moxie says that they have used signal boosters and that they weren't taking any chances with Roger being out of range. Ka Pao asks what they should do now. Moxie proposes taking control of the droid and asks how they should do that. Maz replies she does and says that she lived through the Clone Wars and remembers some things. Maz accesses the computer while Moxie says let's take back our Roger."}, {"tag": "p", "text": "Roger suddenly does a hip hop dance before freezing. Baash asks what is going and Graballa thinks he has a glitch in his programming. Baash approaches the droid but Roger delivers a mighty kick, throwing him to the other side. Roger then attacks Raam and Graballa says that is a heck of a glitch and orders his men to get him."}, {"tag": "p", "text": "A Gotal armed with a wrench and Raam armed with a chain approach Roger but the droid knocks them to the ground. He also fights off Graballa's other henchmen. With the tide turning, Graballa says they can do something but Yeppau says he is not a fighter. Graballa disagrees and hurls him at Roger. Roger hurls Yeppau aside and asks how he is doing this. Roger says he doesn't know but that he is enjoying it."}, {"tag": "p", "text": "He hurls a STAP speeder at Graballa. Graballa hangs on to the speeder before crashing down on his henchmen. Roger asks when he learnt to do that. Moxie rockets down and says he didn't and tells him that Maz did. Roger and his friends leave Graballa and his henchmen behind. Graballa has his head buried in the sand. At that point, Baash tells his boss he has a call. Captain Phasma asks for a report. Graballa claims that everything is going fantastic. However, the Zillo Beast awakes and converges on Graballa and his henchmen. Graballa remarks this keeps getting better as the camera pans out."}, {"tag": "h4", "text": "Detour to Takodana"}, {"tag": "p", "text": "Maz says she has been away for too long and that she must get back to her castle. Moxie disagrees and says they have to get to General Organa. She says that she is waiting on their report. Maz replies that she has a business to run and that if they want to get home faster they can find another ride."}, {"tag": "p", "text": "At Takodana Castle, Moxie tasks her team with finding another ride and tells them to fan out. Moxie approaches a Rodian but he is hostile. Moxie asks an Aqualish patron but he shakes his head. Moxie has no success with the Dowutin Grummgar as well. Moxie bumps into Roger, who tells her that an Ithorian threaten to melt him down and use him as a footstool. In the corner, Han Solo enters the cantina with some guests."}, {"tag": "h4", "text": "Kidnapping Roger again"}, {"tag": "p", "text": "The Narquois spy Pru Sweevant contacts Graballa. Graballa says it is not a good time for him because he has gotten the First Order over his tail and that the Zillo Beast ate some of his men. Pru says he found his battle droid. Graballa tells him to bring Roger to him in return for a reward."}, {"tag": "p", "text": "Roger tells an astromech droid about his autobiography but the droid sneaks off. Pru stuns Roger from behind. Meanwhile, Moxie chastises Ka Pao for buying a starship. Pru says her language is hard to understand. Moxie grumbles about explains this to General Organa. Just then, Ka Pao and Moxie see Pru hauling Roger aboard his ship."}, {"tag": "p", "text": "The two are unable to stop Pru from escaping with Roger. Moxie thanks Pru for buying a ship and pursues Pru into space. She tells Ka Pao to target his engines but they are unable to stop him from escaping into hyperspace. Moxie is upset that Pru stole her droid and tells Pao to calculate the enemy ship's last known trajectory."}, {"tag": "h4", "text": "Outbreak of war"}, {"tag": "p", "text": "Just then, Moxie and Ka Pao witness several phantom energy beams from Starkiller Base traveling through space. They witness the destruction of the Hosnian system from afar in shock and horror. Over the comlink, they hear reports of Starkiller Base destroying Hosnian Prime."}, {"tag": "p", "text": "Moxie says they need to get back to the Resistance. Ka Pao wants to rescue Roger. Moxie says she is not giving up on Roger but that this war has become real and that the Resistance and General Organa need them. She tells Roger to be strong and promises to rescue him. Moxie tells Ka Pao to take them into hyperspace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}