{"url": "Scout_trooper", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Scout trooper units", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Scout trooper"}, {"tag": "p", "text": "Scout troopers, also known as biker scouts and Imperial sharpshooters, were specially trained stormtroopers of the Imperial Army's Stormtrooper Corps. They were used by the Galactic Empire on a range of missions, which mostly involved reconnaissance. They had lighter armor than standard Stormtroopers, much like their urban counterparts, patrol troopers who used C-PH patrol speeder bikes to navigate dense urban environments."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Succeeding the clone scout troopers of the Galactic Republic, scout troopers provided the excellent long-range fire for their stormtrooper counterparts.[source?] If in a situation where blasters were deemed insufficient, they were also skilled in melee combat, crowd control and defense against a lightsaber."}, {"tag": "p", "text": "During the reign of the Galactic Empire, scout troopers encountered the Spectres on Lothal. Scout troopers were stationed at Zeffo, at the Imperial Refinery on Kashyyyk and at the Fortress Inquisitorius on Nur where they were equipped with electrobatons. Scout troopers could be found aboard Darth Vader's personal fleet, Death Squadron. One of the scout troopers' priorities were to aid the Sith Lord in crushing the Rebel Alliance along with its sympathizers and secret allies."}, {"tag": "p", "text": "Scout troopers protected the Death Star's shield generator on Endor in 4 ABY, which shielded the DS-2 Death Star II Mobile Battle Station over the forest moon. While the Empire had first used All Terrain Armored Transports and All Terrain Scout Transports for the reconnaissance of areas that had been cleared, the underbrush and woodland terrain of the moon was inappropriate for the majority of Imperial vehicles due to their large size and stature. Therefore, most of the vehicular patrol duty was conducted by scout troopers on fast 74-Z speeder bikes. Despite the threat that Endor's tall trees posed, the forest's many trails could be used for safe travel. At least six scout troopers encountered Luke Skywalker, Han Solo, Leia Organa, and Chewbacca whilst on patrol. Scout troopers later participated in the Battle of Endor."}, {"tag": "p", "text": "Scout troopers also participated in the Battle of Jakku. Around 9 ABY, Moff Gideon operated an Imperial remnant, which included scout troopers."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Equipped with light armor for greater mobility and optics in their helmets that allowed faster reaction times when piloting speeder bikes, scout troopers were expert marksmen, trained in reconnaissance and infiltration as well as additional independence and adaptability than most Imperial troops. They commonly utilized 614-AvA speeder bikes, and later 74-Z speeder bikes, as well as All Terrain Reconnaissance Transports. Scout troopers could carry an EC-17 hold-out blaster, shock grenades, and sonic charges. Some scout troopers could use laser-trip mines, EE-4 carbine rifles, and repulsor cannons. Some were also equipped with electrobatons. Also within their ranks were the sniper troopers, specialists trained to use smoke grenades and the E-11s sniper rifle, DLT-19x targeting blaster or pulse cannons. Their helmets could also be retracted up while still being worn, allowing the wearer's face to be revealed unlike regular Stormtrooper helmets."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}