{"url": "Scurrier", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Creatures of Tatooine", "Category:Desert creatures", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Scurrier"}, {"tag": "p", "text": "Scurriers were a species of small non-sentient creatures that hailed from the desert planet of Tatooine. They were characterized by their long ears, distinctive snout, and skittish temperament. They normally roamed the desert, but were commonly found loitering outside inhabited settlements."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Scurriers were small non-sentient creatures that possessed some bipedal ability. They had a semi-upright posture, with their limbs directly underneath their body, their trunk in a near-horizontal position, their neck curving upwards, and their tail sticking straight out behind. They ran on all fours, adopting a fully horizontal posture, but were also capable of standing on their hindlimbs alone, freeing their forelimbs and paws for digging. Their heads boasted two sideways-facing eyes, a pair of long, tubular ears that were usually held upright, and a distinctive snout ending in a disc-shaped nose with four nostrils. Scurriers were covered in naked, wrinkled skin whose color varied from pink (on the underside) and grey (on the back and upper part of the skull)."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Scurriers used their forepaws to dig into the sand. Although they normally lived in the desert, scurriers could also be found near or even inside inhabited settlements. They traveled in groups, and tended to disperse at the first sign of perceived danger, such as a passing vehicle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Scurriers hailed from Tatooine, a suns-scorched, desert planet located in the Outer Rim region of the galaxy. They were a source of meat for the sentient inhabitants of Tatooine. In the town of Mos Eisley, dead scurriers were commonly seen hanging from food stalls."}, {"tag": "p", "text": "When Anakin Skywalker came to visit the Lars family in 22 BBY, a pack of scurriers were loitering outside the family's homestead on the Great Chott salt flat."}, {"tag": "p", "text": "The Volpai Moregi tossed bread crust to scurriers in the capital city of the moon Pantora in 19 BBY, the creatures' tails wagging as they ate."}, {"tag": "p", "text": "In 0 BBY, a pack of scurriers were present just outside Mos Eisley when Luke Skywalker and Obi-Wan Kenobi arrived aboard Skywalker's X-34 landspeeder, entering the city via Outer Curved Street. Startled by the passing vehicle, the scurriers dispersed with high-pitched squeaks. Mere moments later, Skywalker and Kenobi encountered another group of scurriers as they manoeuvred the landspeeder into Straight Street."}, {"tag": "p", "text": "Similarly, the Mandalorian warrior Din Djarin caused a group of scurriers to disperse when he arrived at Mos Pelgo on his Zephyr-J speeder bike one day in around 9 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The scurriers were created for the Special Edition of Star Wars: Episode IV A New Hope, which saw theatrical release in 1997. Along with the rest of the Mos Eisley menagerie, they were designed by TyRuben Ellingson. The concept of the scurriers varied from the reptilian to the mammalian to an indeterminate, Muppet-like creature. The final design was that of a horned rodent. The computer-generated models of the scurrier that appeared in the Special Edition were in fact heavily modified models loosely based on Velociraptor studies developed for the 1993 movie Jurassic Park."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}