{"url": "Scythe_Squadron/Legends", "categories": ["Category:Legends articles", "Category:Imperial starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Scythe Squadron"}, {"tag": "p", "text": "Scythe Squadron was an Imperial TIE/LN starfighter squadron that was stationed on the second Death Star. They saw action during the Battle of Endor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Scythe Squadron was a TIE/LN starfighter squadron in the Imperial Navy. When stationed in the Anoat system, some of the squadron's starfighters were provided with upgraded laser cannons to destroy asteroids cluttering the system. Later, when reassigned to the second Death Star, the squadron's TIEs were equipped with SFS P-w702 ion maneuvering jets and SFS L-s7.2 laser cannons to improve combat capability within confined spaces of the battlestation's superstructure."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime prior to the Battle of Endor between the Rebel Fleet and the Imperial Navy, the Scythe Squadron was stationed in the Anoat system, where some of its fighters were upgraded to assist in asteroid elimination."}, {"tag": "p", "text": "When reassigned to the second Death Star, however, Scythe Squadron TIEs were upgraded for combat in confined spaces by Death Star technicians to improve the squadron's fighters flight performances and increase their rate of weapons fire. In addition, the squadron flew a number of training missions within the second Death Star to familiarize the pilots with the interior superstructure of the battlestation."}, {"tag": "p", "text": "Major Mianda flew Scythe 1, and handpicked the pilots that flew in the squadron with him, including Lieutenant Hebsly, who flew Scythe 3. The squadron was present and flying in parade formation with the rest of the starfighter squadrons and groups stationed at Endor at the time Emperor Palpatine's shuttle arrived bringing the Emperor for his inspection tour. During the subsequent Battle of Endor, Moff Jerjerrod commanded Scythe Squadron to pursue Red Squadron and Gold Squadron when the Rebel snubfighters began their attack on the second Death Star's reactor core. However, the squadron was ultimately unable to prevent the Rebels from reaching their goal and destroying the battlestation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}