{"url": "Screerat", "categories": ["Category:Canon articles", "Category:Creatures of Corellia", "Category:Food creatures", "Category:Rodents"], "nodes": [{"tag": "h1", "text": "Screerat"}, {"tag": "p", "text": "Screerats were a species of rat found on the planet Corellia. They infested the Den of the gang known as the White Worms and the gang's scrumrats were expected to capture the vermin. The scrumrats added the rodents to their breakfast sludge, although the choicest screerats were fed to the gang's leader, Lady Proxima, or her children."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Screerats were a type of rat that had pink skin and brown fur. Their tails had a clubbed end."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Screerats could be found in urban regions on the planet Corellia. Some creatures had evolved long tongues that could whip out and catch screerats. In Coronet City, the Den of the White Worms gang was infested with screerats and other vermin. The members of the gang known as scrumrats hunted the rodents as part of their duties, bring the choicest specimens to their leader, Lady Proxima, who either ate the screerats or fed them to her children."}, {"tag": "p", "text": "The scrumrat Tsuulo repurposed a small fleet of janitor droids into ratcatcher droids to hunt vermin in the den, and they could be relied upon to catch several screerats or vervikks per day. These screerats would then be added to the scrumrat's breakfast sludge in order to provide some much needed protein. When the human scrumrat Han was starving, he claimed he would be willing to eat a raw screerat, although his fellow scrumrat Qi'ra found this disgusting. When Han stole a M-68 landspeeder in 13 BBY, he drove under a screerat climbing along a length of wiring."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Screerats were first mentioned in 2018 in the novel Most Wanted by Rae Carson and the reference book Solo: A Star Wars Story The Official Guide by Pablo Hidalgo, both of which were released as tie-in material alongside the Anthology Series film Solo: A Star Wars Story. The 2019 video \"Every Creature in the Star Wars Movies\", which was released on the Star Wars Kids YouTube channel, then retroactively identified a creature seen in Solo as being a screerat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}