{"url": "Scurrier/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Creatures of Tatooine", "Category:Desert creatures", "Category:Food creatures", "Category:Non-sentient species", "Category:Omnivorous creatures", "Category:Rodents", "Category:Scavenger creatures"], "nodes": [{"tag": "h1", "text": "Scurrier"}, {"tag": "p", "text": "The scurrier was a rodent native to Tatooine, and was considered a pest by the locals of Mos Eisley, Mos Espa and Mos Gamos. Scurriers had horns on their heads. Those of a male were thick and curved, while those of a female were thin and straight."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Scurriers were small omnivores with an appetite for garbage. They would scavenge in trash heaps in search of food and material for their nests. They were known to find their way aboard docked freighters and transports, thus propagating the scurrier population across the galaxy; they were even found on stations like Outland Transit Station. Worse, scurriers had a penchant for picking apart machinery, a trait that was hardly welcome on a cargo- or passenger-filled transport."}, {"tag": "p", "text": "Apart from this dangerous habit, scurriers posed only a marginal threat to sentients. Though they would fiercely defend their territory, scurriers usually fled at the first sign of danger (say, a passing landspeeder), able only to call upon a high-pitched squeak and a painful bite to use against advancing predators like anoobas and womp rats. Their bite sometimes carried an unusual disease known as Scurrier Disease. In spite of this, scurrier tips were a Hutt delicacy, referred to as \"scuzzi spits\" in their language."}, {"tag": "p", "text": "Scurriers traveled in packs of around thirty, and were often found hanging out with jakrabs and known to appropriate burrows of abandoned profogg towns. Occasionally, they would steal from food storage chambers in unabandoned profogg-occupied profogg towns, intent on taking the profoggs' collected underground molo seeds."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The scurrier was a new creation for the Star Wars Special Edition. The computer-generated model was based on that of the velociraptor created for Jurassic Park."}, {"tag": "p", "text": "In LEGO Star Wars II: The Original Trilogy and LEGO Star Wars: The Complete Saga, scurriers are mistakenly called womp rats."}, {"tag": "p", "text": "In Star Wars: Jedi Knight II: Jedi Outcast, when you approach a stormtrooper who doesn't immediately see you, he might rationalize Kyle's sounds as a scurrier."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}