{"url": "Scum_%26_Villainy", "categories": ["Category:Real-world articles", "Category:Star Wars PocketModel TCG"], "nodes": [{"tag": "h1", "text": "Scum & Villainy"}, {"tag": "p", "text": "The Scum & Villainy (SV), a smuggler/bounty hunter-themed expansion of the Star Wars PocketModel TCG (Trading Card Game), was released on May 28, 2008. Included with the usual booster pack distribution of this set, a starter set titled Thermal Detonation Theme Deck (TDTD) was released with a fixed 30 card deck along with PocketModels from the expansion. Additionally, the multimedia release, The Force Unleashed, figured into the SV expansion by way of a collector's tin that included exclusive game products."}, {"tag": "p", "text": "New gameplay rules and concepts in the Scum and Villainy expansion include:"}, {"tag": "h2", "text": "Cards"}, {"tag": "h2", "text": "Units"}, {"tag": "p", "text": "Unit types include:"}, {"tag": "h3", "text": "Thermal Detonation Theme Deck"}, {"tag": "p", "text": "The Thermal Detonation Theme Deck (TDTD) is a starter set from the Scum and Villainy expansion, and contains a fixed 30 card deck and a fixed set of game pieces based on pieces from the Scum and Villainy release but with battle damaged/scarred alternate art, 2 micro dice, and complete rules with strategy guide."}, {"tag": "p", "text": "Units"}, {"tag": "h3", "text": "Exclusive Mega PocketModels"}, {"tag": "p", "text": "In addition to units found in this collection, exclusive \"oversize\" PocketModel units, called Mega PocketModels (or MegaModels by fans), were made available (beginning in April, 2008) as prizesupport for Organized Play (OP) tournaments - public games registered with WizKids, Inc. and receiving limited edition prizes from them. Although the units were printed with rarity border colors, they were each equally available either during the time that they were being sold, or as prizes to the tournament champions in OP events. The units were also considered competition legal and were allowed to be used in games and tournaments."}, {"tag": "p", "text": "Units"}, {"tag": "h3", "text": "The Force Unleashed Collector's Tin"}, {"tag": "p", "text": "The special release coincident with George Lucas' 2008 multi-media release of the same name, The Force Unleashed Collector's Tin (TFU or TFU tin) included up to 51 PocketModel units and a two-sided playmat as an addition to the Scum & Villainy expansion of the game. Also introduced with this special release was the \"cloaking\" icon, allowing the ship of Vader's secret apprentice to move stealthily during the game. Among the PocketModel units that were available in Lucasfilm's multimedia release, the following are three units exclusive to the TFU:"}, {"tag": "p", "text": "Units"}, {"tag": "h2", "text": "External links"}]}