{"url": "Scupper_Bantoo", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Gymsnor-2 light freighters", "Category:Slaver starships"], "nodes": [{"tag": "h1", "text": "Scupper Bantoo"}, {"tag": "p", "text": "The Scupper Bantoo was a CorelliSpace Gymsnor-2 light freighter operated by the Bith Maddie Macatten in the Kathol Outback. Battered and considered to be an obsolete design by 12 BBY, the vessel formerly belonged to Macatten's slave master. When her master was killed by an Aing-Tii ship while on a trading junket, Macatten took the craft from its dock on Kal'Shebbol, the capital planet of the Kathol sector. Macatten used the Scupper Bantoo to supply the colonies of the Kathol Outback with replacement parts and luxury items, as well as to track down information regarding the Aing-Tii."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Scupper Bantoo was a modified Gymsnor-2 light freighter built by CorelliSpace, measuring 31.7 meters in length. It only required a crew of one and could carry four passengers. The vessel had a hold that could carry eighty-two metric tons of cargo, as well as two months worth of consumables. A Class Three hyperdrive propelled the Scupper Bantoo through hyperspace, with a Class Fourteen module as a backup. The ship could achieve speeds of up to 750 kilometers per hour in atmosphere. The vessel was also mounted with one heavy blaster cannon."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Scupper Bantoo was owned by a slave master and merchant who was based on Kal'Shebbol, the capital planet of the Kathol sector in the Outer Rim Territories. He attempted to keep the ship modernized, but the vessel had been considered obsolete since 12 BBY, and there was only so much he could do to improve the ship. When he was killed by an Aing-Tii ship while on a trading expedition, the vessel was acquired by his slave, the Bith Maddie Macatten. The Aing-Tii were known to despise slavers, and would often attack their ships when they encountered them. Macatten then took the ownership papers and simply flew the vessel out of the docking bay in which it was berthed."}, {"tag": "p", "text": "Striking out for the Kathol Outback, Macatten used the Scupper Bantoo as a merchant vessel, trading machine parts and luxury goods between the various colonies she found. She, too, attempted to modernize the vessel with new modifications, but found the same problem as her former master did—the ship was too old and could only take so much tweaking. While she plied the hyperlanes, Macatten also used the vessel as a mobile base to search for information regarding the Aing-Tii, whom she wished to personally thank for freeing her."}, {"tag": "h2", "text": "Owners and operators"}, {"tag": "p", "text": "The Scupper Bantoo had at least two owners in its operational life. The first, a merchant based on Kal'Shebbol, owned the vessel until his death at the hands of the Aing-Tii. One of his slaves, Maddie Macatten, took the opportunity to steal the vessel shortly after, operating the vessel alone."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Scupper Bantoo was introduced in The Kathol Outback, a roleplaying supplement for The DarkStryder Campaign, published by West End Games."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}