{"url": "Sebiri", "categories": ["Category:Legends articles", "Category:Kathol sector species", "Category:Reptilian sentient species", "Category:Sebiri", "Category:Sebiri culture"], "nodes": [{"tag": "h1", "text": "Sebiri"}, {"tag": "p", "text": "The Sebiri were a reptilian sentient species native to the planet of Sebiris in the Kathol sector."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Sebiri were covered in a thick, scaly hide that was generally greenish-brown in color. A ridge of bony horns started on the bridge of their noses and stretched to their foreheads in a cone shape. A long mane of black hair started just past the forehead, and flowed down the back. They possessed enhanced night vision and olfactory senses, the Sebiri could trap and kill the fearsome creatures of Sebiris."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Sebiri were organized into villages, with at least two or three dozen extended families being housed in one location. Each village was led by an elder Sebiri known as a headman. Sebiri were superstitious, but were generally friendly to strangers. Those that brought K'va't'uuk (gifts) were welcomed, but attempts by outsiders to trespass on L'ttuuk'chk (holy ground) were met with violence."}, {"tag": "p", "text": "The Sebiri were expert hunters, and could track prey through a jungle with effortless skill. They were also skilled in primitive combat, and were adept in the use of spears, clubs, and slings. Some Sebiri possessed primitive flintlock slugthrowers traded to them by Klendost Petrivoor. However, the Sebiri were poor marksmen, and the weapons were of an inferior quality. The noise of the weapon usually startled the shooter when it was fired."}, {"tag": "p", "text": "The language of the Sebiri was composed of multi-syllabic staccato phrases and phrases, and they had developed a sign language to supplement it. The sign language could also be used by the Sebiri to communicate silently between themselves."}, {"tag": "p", "text": "Males of the species were confident and outgoing, and had no problem dealing with outsiders. By contrast, Sebiri females were timid, and suspicious of outsiders. Males of the species generally decorated their hair with bone, plants, and decorative jewelry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}