{"url": "Second_Army", "categories": ["Category:Legends articles", "Category:Sector Armies"], "nodes": [{"tag": "h1", "text": "Second Army"}, {"tag": "p", "text": "The Second Army, also known as the 2nd Sector Army or Green Mantle Command, was a Republic Reserve Sector Army during the Clone Wars. Led by Senior Jedi General Ry-Gaul and based on Nubia, the 2nd was one of the two Sector Armies that composed Systems Army Alpha, which was commanded by High Jedi General Mace Windu. Officially charged with the defense of the Corellian Oversector, the forces of the 2nd Sector Army saw action across the galaxy as reserve troops for other Sector Armies, and the 2nd's 327th Star Corps became renowned under the leadership of Jedi General Aayla Secura."}, {"tag": "p", "text": "When Emperor Palpatine declared a new Galactic Empire, the clone troopers of the 2nd Sector Army turned on their Jedi commanders in accordance with Order 66, and the 2nd were placed under the command of Grand Moff Fliry Vorru."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The 2nd Sector Army was one of twenty Sector Armies that composed the Grand Army of the Republic during the Clone Wars, and was based on the planet Nubia. Green Mantle Command, as the 2nd became known, was one of two Sector Armies that made up Systems Army Alpha, which was commanded by the High Jedi General Mace Windu. The 2nd itself was led by Senior Jedi General Ry-Gaul, and was designed as reserve command for other Sector Armies."}, {"tag": "p", "text": "The 2nd Sector Army's primary role was to defend Sector 2 and the vital hyperlane junctions at Denon and Duro. Denon, an ecumenopolis like Coruscant, sat at the intersection of the Corellian Run and the Hydian Way, and Duro was one of the first stops of the Corellian Trade Spine after the route split from the Corellian Run at Corellia. The 2nd also blockaded the Neimoidian Purse Worlds later in the war."}, {"tag": "p", "text": "As a Sector Army, the 2nd initially consisted of 147,456 clone troopers and additional support personnel, divided into four corps. The most notable of the 2nd Sector Army's four corps was the 327th Star Corps, commanded by Jedi General Aayla Secura, which was one of the GAR's most active units during the Clone Wars. Troopers of the 327th were distinguished by yellow stripes on their armor, and they were led by Marshal Commander CC-5052 (nicknamed \"Bly\"). One of the Corps' squads was Talon Squad, which fell under the 2nd Platoon, Bacta Company, Hawkbat Battalion, 101st Regiment, and the 7th Legion of the Corps. Another known unit was Hawkbat Battalion's K Company."}, {"tag": "p", "text": "In 19 BBY, the 327th Star Corps participated in the Siege of Saleucami, a brutal five-month long campaign near the end of the Clone Wars. Not long after, Supreme Chancellor Palpatine declared himself Emperor and issued Order 66 to the Grand Army. The 2nd Sector Army turned on their Jedi commanders, with Marshal Commander Bly and his troops killing General Secura personally on Felucia, and Ry-Gaul only escaping the fate of his comrades by being on a special assignment in the Outer Rim. Under the new Galactic Empire, the 2nd Sector Army became part of the Imperial Military, and were place under the command of Fliry Vorru, the new Grand Moff of Sector 2—which was reorganized into the Corellian Oversector."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}