{"url": "Second_Duel_on_Ambria", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Battles of Ambria", "Category:Duels", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Second Duel on Ambria"}, {"tag": "p", "text": "A duel between the Sith Master Darth Bane and his apprentice, Darth Zannah, took place on the planet Ambria in 980 BBY. Bane had begun to fear that Zannah was waiting to challenge him until he grew weak, violating the purpose of his Rule of Two to ensure that the apprentice took the title of Master only because the apprentice was stronger. Bane thus sought the secret of eternal life so that he could live to train another apprentice. Meanwhile, Zannah had finally made her own plans to confront Bane in an attempt to become the Master, and upon learning of his quest for eternal life, she felt as though he had betrayed his own Sith Order. She found and confronted him on the planet Doan, but the duel led to a draw. Bane found a new apprentice, the Iktotchi Darth Cognus, and messaged Zannah to come to Ambria and finish their fight. Upon Zannah's arrival, Cognus swore to serve the true master—whomever won the coming battle."}, {"tag": "p", "text": "The duel began, and Bane instantly gained the upper hand, quickly forcing Zannah to give ground. She tripped while preparing to use a spell on him, and he cracked her rib before she was able to make an energy-draining escape. Zannah then attempted in vain to use sorcery to drive him insane and finally resorted to conjuring dark side tendrils from the ground. He charged her, hoping to strike her down before the tendrils hit him, but one connected with his arm and cut it off. Collapsing to the ground in pain, Bane grabbed Zannah and attempted to transfer himself into her body, using the technique he had learned in his search for eternal life. Her will was too strong, however, and after an intense mental battle she defeated him, casting his consciousness into oblivion—although part of Bane remained imprinted upon her. Zannah took from Bane the mantle of Dark Lord of the Sith and, with Cognus as her apprentice, continued the legacy of Bane's Sith Order and the Rule of Two."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Prakith and Doan"}, {"tag": "p", "text": "In 1000 BBY, the Dark Lord of the Sith Darth Bane formed a new Sith Order based on the principal of the Rule of Two, which allowed for the existence of only two Sith in the Order at any given time: a Master and an apprentice. The Rule was made so that in order for the apprentice to take the role of Master, the apprentice would have to defeat the Master in single combat, thus proving his or her superior strength and worthiness of the title. However, in 980 BBY, Bane began to grow concerned that his apprentice of twenty years, Darth Zannah, was waiting until his already dying body weakened even further before she attacked him to take over the mantle of Dark Lord. As such, he embarked on a mission to Prakith to acquire Darth Andeddu's holocron, which was rumored to hold the secret to eternal life, so that he could live long enough to train a more suitable apprentice. He successfully obtained the holocron and acquired from it the knowledge of essence transfer—a ritual in which one transferred one's consciousness into another's body."}, {"tag": "p", "text": "Despite Bane's concerns, Zannah had finally begun to contemplate her move to overthrow her Master. On a mission to the planet Doan, she learned of a Dark Jedi, Set Harth, and tracked him down, enlisting him as her apprentice in preparation for her challenge of Bane. Meanwhile, Princess Serra of Doan discovered that her father had been killed by a Sith Lord ten years previously. Believing the Sith Lord to be Darth Bane—who, during the New Sith Wars, had threatened to kill Serra if her father did not heal him—she hired an Iktotchi assassin, the Huntress, to capture Bane and bring him to her. The Huntress, along with about twenty mercenaries, ambushed Bane in his mansion on Ciutric IV as he returned from his mission to Prakith. They captured him and took him to the Stone Prison on Doan, where Serra interrogated him."}, {"tag": "h3", "text": "Duel on Doan"}, {"tag": "p", "text": "When Zannah returned with Harth to Ciutric IV and learned of Bane's quest for immortality, she grew furious, believing him to have betrayed his own Order. She and Harth tracked Bane to Doan, so that she could free him and challenge him. However, Serra's bodyguard, who had served alongside Bane during the New Sith Wars, had already freed the Sith Lord. Bane began hunting down Serra in the prison, but he was found and confronted by Zannah. She attacked Bane, who was still unarmed, as the Huntress had taken his lightsaber after his capture. Serra witnessed their fight and decided to set the prison to self-destruct and flee. Using the Force, Bane held Zannah off long enough to hit one of the detonators in the wall with his Force lightning, causing the passage to collapse between them and end the duel."}, {"tag": "p", "text": "Zannah found that Harth had fled while she had fought Bane and realized her mistake in choosing him as her future apprentice. Meanwhile, Bane escaped the prison with the Huntress, who returned his lightsaber to him and submitted herself to his teachings, taking the name Darth Cognus. Aboard Cognus' shuttle, the Stalker, they used the Iktotchi's precognition to track Serra to the planet Ambria, where Bane allowed his new apprentice to kill the Princess. Bane then sent out a distress message to Zannah's starship, the Victory, telling her where he was. Zannah deduced that the message was not a trick; rather, it was an invitation to come to Ambria and finish what they had begun on Doan."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "As Zannah arrived at the camp, Cognus swore loyalty to the true Sith Master—whomever won the duel—promising that she would not interfere. Bane then attacked Zannah, quickly pushing her back with the ferocity and power of his blows. He used several new techniques that he had never taught her before or used against her in their training sessions. Nevertheless, her defense stayed strong, and Bane soon settled into a pattern of feints and quick thrusts. As he continued to drive her backward, Zannah began to gather her power, preparing to unleash her sorcery against him, hoping to bring the duel to a quick end. However, Bane circled to come in on her left flank, and Zannah, her focus split between Bane and preparing her spell, failed to notice the freshly dug grave of Serra behind her. She stumbled on the grave and fell, and Bane immediately set upon her with a series of furious attacks, kicking and stomping at her, cracking one of her ribs. Zannah rolled with the impact, landed on her feet, and threw herself into a series of back handsprings before finishing the jumps with a thrust meant to impale Bane. Bane, however, had stopped several meters back, letting her tire herself out with her extraneous flips."}, {"tag": "p", "text": "Zannah quickly gathered the Force and attempted to overwhelm him with her sorcery, focusing on imprinting images of Bane's worst fears into his mind in an attempt to drive him insane. Although the ploy began to work at first, Bane had conquered his fears years before; he successfully summoned enough willpower to defeat the spells with a powerful blast of Force energy that sent Zannah flying backward. As Zannah rose to her feet, Bane charged at her once more. Desperate to end the duel, Zannah drew upon the power within Ambria itself and summoned tendrils of pure dark side energy from the ground around them. She thrust the tendrils at Bane, who attempted to dodge the attack as he advanced on her."}, {"tag": "p", "text": "One tendril clipped Bane's shoulder, causing him to fall to the ground in excruciating pain, greater than any pain he had ever felt before. Rising again to his feet, Bane charged Zannah, dodging the tendrils and realizing that his only hope was to cut her down before more tendrils hit him. When he was in range he struck out with his lightsaber, and Zannah, her focus split between the tendrils and defending herself from Bane, barely deflected the blow—but her lightsaber was knocked from her grasp. However, as Bane went for the final, killing blow, his sword arm was cut off by one of the tendrils. Bane collapsed to the ground in pain, and, realizing he had no other choice left, he grabbed Zannah's ankle and began the ritual of essence transfer."}, {"tag": "p", "text": "Bane's body was immediately destroyed, turning to ash as his consciousness transferred over to Zannah's body. However, he could still feel her consciousness within her as well, and she fought back. They engaged in a battle of wills, Bane seeking to obliterate her identity, while she attempted to force him out of her body. They were matched evenly for a moment, but Zannah finally defeated him, banishing his consciousness from within her. Nevertheless, part of Bane remained imprinted upon Zannah."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Cognus, who had watched the duel, cautiously approached Zannah, who rose to her feet, appearing to move awkwardly. Cognus asked if it was Bane, but Zannah replied that Bane was gone; she had defeated him and become the new Dark Lord of the Sith. Zannah took on Cognus as her apprentice, giving her Bane's old lightsaber to use until the Iktotchi constructed one of her own. She told Cognus that that they would continue Bane's legacy, and although individuals in the Order might die, the Order itself would live forever."}, {"tag": "p", "text": "Bane's Order of the Sith Lords and the Rule of Two survived for over a thousand years, and in 19 BBY, the Sith Lord Darth Sidious finally achieved the goal of galactic domination with the creation of the Galactic Empire. However, following the deaths of Darth Sidious and Darth Vader in 4 ABY, Bane's Order was reorganized into a new order by the self-proclaimed Dark Lady of the Sith, Lumiya, who continued to follow the Rule of Two. Finally, in 41 ABY, the Dark Lord Darth Caedus was killed and his apprentice, Tahiri Veila, redeemed, and the last vestiges of Bane's Order thus perished."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This duel was created by author Drew Karpyshyn to be the climax and the concluding confrontation of the final novel of the Darth Bane Trilogy, Darth Bane: Dynasty of Evil, released on December 8, 2009. The event served to kill the title character of Karpyshyn's trilogy, bringing the cycle of Darth Bane's life to an end. When writing the scene, Karpyshyn knew that no matter who won the duel, readers would be angry at him for killing off a favorite character, but he did not want to avoid the question and \"take the easy way out\" by leaving the ending nebulous."}, {"tag": "p", "text": "Nevertheless, the ending of the novel led to an abundance of fan speculation as to whether or not Bane had actually succeeded in taking control over Zannah's body and was hiding this truth from Cognus—some fans even speculated that Bane had continued in this line of taking over the bodies of his apprentices right up through Darth Sidious. However, Karpyshyn revealed in a post on his Web site that this had not been his intent at all; he clarified that Zannah had won the battle of wills, and Bane had only managed to imprint part of his identity onto Zannah. Rather, it was the extent to which Bane had been imprinted on Zannah that Karpyshyn had intended to leave ambiguous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}