{"url": "Second_Battle_of_Onderon", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Battles of the Freedon Nadd Uprising"], "nodes": [{"tag": "h1", "text": "Second Battle of Onderon"}, {"tag": "p", "text": "The Second Battle of Onderon occurred during the Freedon Nadd Uprising in the year 3998 BBY, resultant of Galactic Republic Military intervention solicited by the Tchuukthai Jedi Master Thon. Along with his apprentice Nomi Sunrider, Thon attended the Galactic Senate's Ministry of Defense hearing called to discuss the growing dark side threat on Onderon. Sunrider was chosen to lead the Republic fleet in battle against the worshipers of Dark Lord of the Sith Freedon Nadd, who were united under the banner of Onderon's ruler, King Ommin."}, {"tag": "p", "text": "Upon arrival in Onderonian space under escort of the full Republic Navy, Nomi Sunrider and a team of four other Jedi Knights engaged Ommin and his Naddist army. The battle commenced just as Tetan aristocrats Satal and Aleema Keto arrived on Onderon with the intentions of deciphering an ancient Sith spellbook. Caught in the midst of battle, the Ketos were shot down and crashed into Iziz, where, after searching for a time, were led to Ommin, who introduced them to Sith lore. Before he could begin their initiation into Sith teachings, they were ambushed by the Jedi Knights. The Jedi ultimately triumphed over the sorcerer King, rescued the imprisoned Jedi Master Arca Jeth, defeated Ommin's army, and freed Onderon of Nadd's dark influence. The Ketos also escaped Onderon, and, armed with their Sith artifacts, became the new Sith apprentices of Nadd."}, {"tag": "h2", "text": "Background"}, {"tag": "h3", "text": "Meeting of the Defense Committee"}, {"tag": "p", "text": "In the year 4000 BBY, Jedi Master Arca Jeth and his three apprentices, as watchmen of the Onderon system, discovered that the dark side held the planet Onderon under its sway. Over the course of the next two years, the Jedi revealed that the Onderonian royal family had been carrying on the legacy of the long-dead Sith Lord Freedon Nadd. As a result, the Knights had become embroiled in war against the rulers of Onderon and their Naddist followers. Realizing the threat to be more than a match for just four Jedi, Jeth requested assistance from the watchman of the Stenness system, the Tchuukthai Master Thon. Thon gladly obliged, sending his student Oss Wilum to assist Jeth and his apprentices with the uprising on Onderon. Thon however, felt it was time to also seek the Republic's intervention. Traveling to the galactic capital Coruscant with his new protégé, Nomi Sunrider, Thon attended an already-in-progress session of the Galactic Senate's Defense Ministry."}, {"tag": "p", "text": "The senators had recently received a garbled distress message sent to Coruscant by Jedi Knight Ulic Qel-Droma. In response, the senators engaged in a heated debate over whether to send aid to Onderon, or let the Jedi handle their own affairs. Thon and Sunrider entered the Grand Convocation Chamber, where, through Sunrider's translating of his native Tchuukthese, Thon addressed the Senate."}, {"tag": "p", "text": "Thon implored the assembly to come to the Jedi's aid, reminding them that the Order had aided the Republic for generations, and that once the dark side subdued Onderon, it would sweep across the galaxy indiscriminately. The Jedi Master also had a surprise in store for his apprentice. Sunrider learned that Onderon was to be her first real mission as a Jedi, joining her fellow Knights in. Thon won the senators over with his rousing pleas, and Sunrider was chosen to command the full might of the Galactic Republic Navy against the followers of Freedon Nadd immediately."}, {"tag": "p", "text": "Around the same time, two young nobles from the Empress Teta system had also arrived on Coruscant. Satal Keto and his cousin, Aleema, the heirs to the Tetan Monarchy, visited Coruscant's Galactic Museum, in search of dark side knowledge. They stole a Sith spellbook from an exhibit and fled back to their lodging quarters, but quickly realized that they were unable to decipher the book's text. The Ketos' hope was renewed, however, when they heard a news report about Dark Side Adepts on Onderon, who practiced ancient Sith magic. They knew that Onderon was where the secrets of the book had any chance of being revealed to them, and immediately left for that planet."}, {"tag": "h3", "text": "Trouble in Iziz"}, {"tag": "p", "text": "Back on Onderon, the Jedi, and drexl-mounted Beast Riders of the planet's wilderness, were engaged in fierce combat with the Naddists in the capital city of Iziz. Arca Jeth, Ulic Qel-Droma, and Queen Galia, daughter of the Onderonian ruler, the Sith sorcerer King Ommin, located the King and his Dark Sider Army within the catacombs under the Royal Palace, and Master Jeth confronted him over the sarcophagus of Freedon Nadd. Ommin revealed that he had been in league with Nadd's ghost all along, even as the specter of the Dark Lord rose up behind him. Nadd then ordered the armored Dark Jedi Warb Null to engage Qel-Droma, but the duel was only a ruse of the Dark Lord, and Null's Master, Ommin. The real prize was Arca Jeth, whom Ommin attempted to capture while Qel-Droma and Null fought."}, {"tag": "p", "text": "Newly empowered by the sudden arrival of Nadd, Ommin captured Jeth and carried him deeper into the catacombs of his lair, as Qel-Droma finished with Null, but could not save Jeth. Realizing that pursuing the King was a futile plan at best, Qel-Droma and Galia escaped the tunnels, closely followed by a contingent of her father's Dark Side Army. They emerged only to find battle fully underway aboveground, where they met up with Jedi Tott Doneeta, who ferried Galia away to the Nebulon Ranger while Qel-Droma went to meet with his brother Cay and Galia's new husband, the Beast-Lord Oron Kira."}, {"tag": "p", "text": "Kira, the Beast Riders, and the remaining Jedi had been held up for two days fighting the Naddists. The enemy had retaken the palace, and Kira was preparing to retreat to his own fortress just as Ulic Qel-Droma arrived. Qel-Droma had sent a distress call to the Republic in hopes that they would send reinforcements, though he was unsure if it was received. Determined to save Jeth from Ommin's clutches, but surrounded by Naddists on all sides, the Jedi Knights and the armies of Oron Kira were left with only one option: to survive long enough for reinforcements to arrive."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Republic relief"}, {"tag": "p", "text": "As Sunrider and the Republic Naval fleet entered Onderonian space, they began to stage their orbital attack run while preparing to deploy ground forces and a contingent of air-to-ground troops as well. The generals were finalizing their battle plans when an unidentified civilian yacht recognized as being of Tetan origin exited hyperspace right in the middle of the Republic Navy's bombardment. Despite warnings to steer clear of the security military zone, the civilian craft ignored the Navy's warnings and continued straight for the planet."}, {"tag": "p", "text": "As Republic rocket-jumpers began their air-to-ground assault over Iziz, the civilian vessel, carrying the Ketos, was caught in the crossfire, and crashed to the ground. The Ketos were able to escape the wreckage with their lives, and while searching through the city streets, managed to seek out authentic practitioners of the dark side. These Darksiders in turn brought them before Ommin."}, {"tag": "h3", "text": "Jedi offensive"}, {"tag": "p", "text": "Meanwhile, a team of Jedi Knights including Dace Diath, Qrrrl Toq, Shoaneb Culu, and Kith Kark arrived on Onderon with Sunrider to assist Oss Wilum, Tott Doneeta, Ulic and Cay Qel-Droma, who themselves were trapped inside Kira's forest citadel, taking heavy fire from the Naddist armies. Sunrider's Jedi team created a shield-wall with the Force as they fought towards their besieged comrades, and Sunrider used her battle meditation to sway the tide of the conflict. Sunrider's meditation skills were proving most beneficial to the Jedi, and though their fighting spirit was restored as a result, Kark died when he was shot down by the Naddists, becoming one with the Force."}, {"tag": "p", "text": "The Jedi were also affected by the suppression of the dark side in the Onderonian atmosphere, feeling their connections to the Force slowly being diminished. Sunrider managed to pinpoint the source to an old, incapacitated man, focusing his dark power somewhere nearby. The old man felt the novice Jedi woman's probe through the Force, and he lashed back at her with the dark side. Sunrider was knocked from her feet, just as Ulic Qel-Droma came up to her on the battlefield. It was their first meeting. Alarmed by the sight of a beautiful Jedi woman felled in battle, Qel-Droma rushed to her side. After conversing with her, Qel-Droma discovered that the old man whom she had felt attack her through the Force was indeed King Ommin. He told Sunrider that Ommin ruled Onderon under the power of Sith magic, and that with his powers he subdued Jeth. Gathering the rest of the Jedi Knights, Qel-Droma led them through the tunnels under the palace, into Ommin's lair."}, {"tag": "h3", "text": "Confronting King Ommin"}, {"tag": "p", "text": "At the same time, the Ketos met with the crippled and seemingly weak Ommin, who was depending on a steel armature for physical support. Satal showed the old King their stolen Sith spellbook and asked Ommin to translate it for them. Ommin in turn gave him an ancient Sith amulet, one of many Ommin had received from the last Dark Lord of the Sith, Freedon Nadd himself. With the amulet Satal was able to understand the ancient writings with ease. Ommin then took the book and gave it to his assistant Novar for duplicating."}, {"tag": "p", "text": "As Novar had the book transcribed, Ommin showed the Tetan heirs his \"most prized possession,\" a Jedi Master, hanging on the wall and bound by the King's Sith magic. Aleema gasped in horror as Ommin explained his plan to crush Jeth under the power of the dark side and raise him back up as a Dark Jedi. Ommin then leaned close to Jeth, who was whispering the King that his time was up, and that his Jedi Knights had arrived."}, {"tag": "p", "text": "As if on cue, seven Jedi Knights rushed into Ommin's lair, destroying many Sith Elite Warbots in the process. In the midst of the skirmish, Cay Qel-Droma was attacked from a blind spot and lost his droid arm. However, the Jedi pressed their way to Ommin and his Tetan visitors, who were completely surprised by the ambush. Ommin proved to be a most formidable and unexpected adversary as he blasted both Sunrider and Ulic Qel-Droma with waves of dark side energy. Before he could attack Qel-Droma again, the young Jedi slashed through the King's body with his lightsaber. Ommin sank to the ground like an Arkanian jellyfish. Before he could complete the transcription of the spellbook, Novar perished, having also been caught in the Jedi ambush. In the midst of all the commotion, Satal and Aleema Keto escaped into the tunnels."}, {"tag": "p", "text": "The Ketos retreated further into the depths under the castle, where they were met by the spirit of Freedon Nadd, who gave them a trove of Sith artifacts that included their book as well as two Sith swords that formerly belonged to Ommin. Nadd also told them that they were heirs to a great Sith destiny, and that wherever they went, Nadd would find them and begin their instruction in the ways of the dark side. He directed them to a passage leading to the surface, and the Ketos escaped the melee unscathed."}, {"tag": "p", "text": "Nadd then appeared by Ommin's side, whose life support contraption had been destroyed, rendering him utterly helpless. The Jedi had also successfully rescued Jeth, and upon seeing this, Nadd realized that the old King had failed him. Nadd withdrew his power from Ommin and reminded him that these Jedi did not belong to the dark side. Nadd soon corrected himself, however, stating that perhaps one or two of them might fall to darkness. Jeth denounced Nadd's spirit as Ommin passed into darkness himself, and congratulated Qel-Droma on his victory. Nadd only laughed at Jeth and told him that in reality the Jedi had lost that day, as he would soon realize."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As the Republic established martial law on Onderon, off-worlders were evacuated to their home planets. The customs personnel were told to stop anyone trying to get dark side weaponry off of Onderon, but Satal and Aleema Keto blended in with the masses and slipped past their check-points."}, {"tag": "p", "text": "The sarcophagi of King Ommin, his wife, Queen Amanoa, and Freedon Nadd would later be transported to the far side of the Dxun moon, as was originally planned before the Naddist Uprising began. Jeth had succeeded in cleansing Onderon, and the native people took to restoring civilization to their war-torn planet. With the threat of Ommin finally removed, Oron Kira and Galia could rule from the throne of Iziz as King and Queen of Onderon peacefully."}, {"tag": "p", "text": "The Jedi, after all their efforts, enjoyed a short season of respite on the planet, learning to ride Beast-Riders' mounts. But for Jeth, there was little room for relaxation. He had not forgotten about the two young Tetan nobles whose curiosity for dark side things led them to Ommin. Hearing news of a recent political political in the Empress Teta system, the Jedi Master suspected that Sith magic had survived defeat on Onderon and made its way to the Tetan worlds. As a result Jeth accepted a Jedi watchman's responsibility for Empress Teta, and prepared his Jedi to face the dark side once again."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Freedon Nadd's prophecy, that one or two of the Jedi present would fall to the dark side, indeed came to pass. Of the eight surviving Jedi Knights, two of them became aligned with the Sith. Ulic Qel-Droma would eventually defect and join the Ketos' Sith-inspired Krath, and would also become a Dark Lord. Oss Wilum would be seduced to the dark side by Dark Lord of the Sith Exar Kun, and would become possessed by a dark side spirit trapped within Kun's stolen Sith holocron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Second Battle of Onderon first appeared in the issue Freedon Nadd Uprising 2: Initiates of the Sith of the Tales of the Jedi series of comics. The battle was conceived and written by author Tom Veitch, and was drawn by artist Tony Akins. Originally, Veitch was contracted by Dark Horse Comics to do a \"one-shot deal,\" and the end result was The Freedon Nadd Uprising. Eventually, both Veitch and Kevin J. Anderson would use the events portrayed in this battle and the Freedon Nadd Uprising as background details for their joint venture Dark Lords of the Sith, where such characters as Aleema and Satal Keto would be explored in depth while playing integral parts to the story line. The battle also provides a backdrop for the Krath Holy Crusade, which was written as part of the larger Great Sith War. The battle was recounted in the Tales of the Jedi audio drama, written by John Whitman and based on the original script by Veitch."}, {"tag": "p", "text": "In the original comic appearance of the Second Battle of Onderon, Nomi Sunrider is on Ossus when she is chosen to lead a team of Jedi in assisting Arca Jeth's Knights. She then arrives on Onderon with a team of Jedi Knights including Dace Diath, Shoaneb Culu, Kith Kark, and Qrrrl Toq. In the audio version, however, Sunrider first accompanies Thon to Coruscant, completely bypassing Ossus. It is here that she is chosen to lead not the Jedi, but the Republic Fleet in the battle for Onderon. Also, the other Jedi Knights that arrived on Onderon in the comic with Sunrider were not mentioned in the audio drama."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}