{"url": "Second_Battle_of_Lok", "categories": ["Category:Legends articles", "Category:Battles of the Occupation of Karthakk"], "nodes": [{"tag": "h1", "text": "Second Battle of Lok"}, {"tag": "p", "text": "The Second Battle of Lok was battle between the combined forces of the Lok Revenants and the Mere Resistance led by Nym, and the Trade Federation allied with Sabaoth Squadron in an attempt to retake Nym's pirate base on the planet Lok The battle was fought in two parts, one in orbit around the moon Khons and one on the ground, taking place ten years after the Federation occupied the base."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Second Battle of Lok was fought between the allied forces of the Lok Revenants and the Mere Resistance in 22 BBY. After recovering parts of an Orbital Defense Cannon onto the Tritus at the Battle of Nod Kartha, Nym's forces set off to install the Cannon on Khons to help reclaim Nym's Base that was lost ten years earlier. En route to Khons, the Mere cruiser Tritus suffered an engine failure. Captain Juno unloaded the parts to the Cannon onto Mere Tugs and entered hyperspace. The group's first step was to establish a foothold and install the Cannon to support the attack on the surface."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Khons moon"}, {"tag": "p", "text": "Upon exiting hyperspace, Nym ordered his pilots to take out the anti-capital ship turrets to make way for Juno and his tugs. Nym then received a message from Kole that several of their starfighters had dropped out of hyperspace and that there were only two of them left. Nevertheless, Nym was able to destroy the turrets before they could destroy the tugs."}, {"tag": "p", "text": "The battle then moved to the planet side of the moon. The Trade Federation had a refueling station where four Missile Frigates were stationed. Juno held the tugs out of range while Nym cleared a landing pad to assemble the Cannon on. After the frigates were destroyed, Kole landed to supervise the Cannon's construction. As the Cannon was being assembled, a wave of droid bombers approached to bomb it, soon followed by several more."}, {"tag": "p", "text": "While Nym and his allies defended the Cannon from the bombers, a Trade Federation Cruiser happened to arrive. The cruiser headed toward the moon and, once in range, began to fire waves of cruise missiles at the Orbital Cannon. Undaunted, Nym allowed the cruiser to keep coming so it would be in the Cannon's range. Kole then attempted to power up the Cannon, unwittingly frying its targeting systems. However, Kole was able to reroute the system through the targeting systems on Nym's Havoc. Meanwhile, the cruiser powered up its weapons array to launch a final wave of missiles. Nym targeted the cruiser and Kole fired the Cannon, bringing down the shields of the cruiser. After recharging, the Cannon fired again, completely destroying the cruiser."}, {"tag": "h3", "text": "Down to the surface"}, {"tag": "p", "text": "The pirate fighters flew down to the planet's surface, where they were met by companies of tanks and squadrons of Vulture droid starfighters. Three Mere troop transports held a high orbit while the fighters destroyed the tanks and Trade Federation Missile Frigates that were refueling on the ground. Once they were taken out, the transports moved in, protected by the Mere starfighters. The remaining Vulture droids swarmed on the ships, resulting in a fierce dogfight."}, {"tag": "p", "text": "The transports, landing in a crater, launched speeder bikes led by Sol Sixxa into the base to blow the door. After the door was blasted open, Nym flew in and destroyed the docks for the frigates inside it. Lieutenant Bella then flew out to attack the Resistance in her personal ship but was killed by Nym. The Lok Revenants had finally reclaimed their base, albeit one that was drastically different."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the planet secure, the pirates would be free to assist their allies fighting on Geonosis. Their ships arrived just in time to fight with Jedi Master Adi Gallia and eliminate the remainder of Sabaoth Squadron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This article was created based on two missions in the 2002 video game Star Wars: Jedi Starfighter. The first is the mission \"Cannon Fodder.\" The mission's bonus objectives have the player destroying all the turrets on the moon and making sure all the Mere Tugs survive."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}