{"url": "Second_Duel_on_Byss", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Byss", "Category:Battles of Operation Shadow Hand", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Second Duel on Byss"}, {"tag": "p", "text": "The Second Duel on Byss was an engagement between Imperial Military Executor Sedriss QL and two rogue Imperial Force Adepts."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Emperor Palpatine's most recent death during the Battle of Pinnacle Base, the two Force adepts, Nefta and Sa-Di, attempted a power grab. Spreading rumors that Palpatine would not return in another clone body, and began looking to eliminate any opposition. One of their primary opponents was the Imperial Executor Sedriss QL, so Sa-Di began calling for the Executor's execution, claiming that his failure during the Battle of Balmorra had shaken faith in him. Sedriss rushed to Byss to address this issue."}, {"tag": "p", "text": "Storming into the Emperor's cloning laboratory, Sedriss found Nefta and Sa-Di killing Palpatine's few remaining clones. When Sedriss angrily questioned them, Nefta explained that he and Sa-Di were fearful of the Empire collapsing during Palpatine's absence, believing that he could be trapped in the Netherworld of the Force for millennia. Feeling that the Empire needed a powerful individual on the throne, and seeking to place themselves on that pedestal, they took the initiative."}, {"tag": "h3", "text": "The Duel"}, {"tag": "p", "text": "While Sedriss agreed with the idea that the Empire needed a powerful individual on the throne, he did not believe Nefta or Sa-Di were worthy of this. He drew his lightsaber and attacked."}, {"tag": "p", "text": "Nefta was the only one of the two able to engage Sedriss, as Sa-Di was wielding a battle axe rather than a lightsaber. He managed to fend off Sedriss' frenzy, but was quickly outmatched. His attempts to attack Sedriss through the Force were useless, provoking only the Executor's scoffing at his \"magic\". Nefta was slashed in half just below the chest."}, {"tag": "p", "text": "With Nefta handily defeated, Sedriss began advancing on the grovelling Sa-Di. Sa-Di attempted to convince Sedriss that he had not called for the Executor's execution, claiming to respect all of Sedriss' decisions. Sedriss countered that if Sa-Di respected all of his decisions, then he would approve of Sedriss' decision to execute him."}, {"tag": "p", "text": "Sedriss cut Sa-Di in half with a powerful overhand."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the two traitors eliminated, Palpatine revealed himself. Having taken a new clone body, he complemented Sedriss' handiwork, pleased that at least one of his \"chargemen\" has remained faithful, Palpatine called for the capture of Leia Organa Solo and her unborn child, and revealed that he had a set of surprises in store for the rebellion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}