{"url": "Second_Battle_of_Coruscant", "categories": ["Category:Legends articles", "Category:Battles of Coruscant", "Category:Battles of the Imperial Civil War", "Category:Battles of the pre-Shadow Hand campaign", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Second Battle of Coruscant"}, {"tag": "p", "text": "The Second Battle of Coruscant was a lengthy conflict in 10 ABY waged between the New Republic and the Imperial Coalition. Inspired by the recent campaign led by the now deceased Grand Admiral Thrawn, a massive Imperial force bombarded both Republic and Imperial forces the planet Coruscant's shields, ultimately forcing Mon Mothma to evacuate the capital; however, once they acquired their prize, the Imperials fell upon each other in what became known as the Imperial Mutiny."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Within days of Thrawn's death, and inspired by what he had accomplished with so little in such a short amount of time, the Imperial Ruling Council and six former Imperial Starfleet commanders agreed to unite for an attack into the Galactic Core. General Alix Balan was placed in command of the overall assault."}, {"tag": "p", "text": "The New Republic was no match for the military might of the once-more-unified Empire with its fleet facing enough problems in the Outer Rim, and after a short and decisive campaign, the Empire had retaken several key New Republic systems in the Core including Ralltiir, Esseles, and Chandrila."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Conquest of Coruscant"}, {"tag": "p", "text": "This forced Chief of State Mon Mothma to consider a last-minute plan for the defense of the galactic capital Coruscant. However, she never got a chance, since the combined Imperial armada began bombarding Coruscant's energy shield from orbit, causing heavy damage to the heavily populated ecumenopolis below. The Imperials' first target were Coruscant's comm centers, knocking out the ability of the capital to communicate to its forces throughout the galaxy and requiring a number of commandeered courier ships, including the Messenger, to break through the blockade and send word."}, {"tag": "p", "text": "Mon Mothma ordered a general evacuation of the entire population of the capital, carried out by Garm Bel Iblis. Thus, the Empire had retaken its Center and the New Republic resorted to guerrilla fighting."}, {"tag": "h3", "text": "Imperial civil war"}, {"tag": "p", "text": "However, after Coruscant had been retaken, the Council decided that it was time to elect a new Galactic Emperor. The various admirals, generals, Moffs, Inquisitorius, COMPNOR, and Imperial Security Bureau officials disagreed, and an armed conflict (the \"Imperial Civil War\") soon broke out amongst the various Imperial factions on Coruscant."}, {"tag": "p", "text": "Meanwhile, the New Republic was quick to take advantage of the chaos caused by the warring Imperial factions and conducted raids on Imperial territories through the use of two captured Star Destroyers from earlier battles."}, {"tag": "p", "text": "One such raid over a devastated Coruscant ended in disaster when the New Republic Imperial-class Star Destroyer Liberator, under the command of Lando Calrissian, Luke Skywalker and Wedge Antilles, crash-landed on the war torn cityscape."}, {"tag": "h3", "text": "The rescue mission"}, {"tag": "p", "text": "In response, the New Republic dispatched a task force to rescue surviving crew of the Liberator under the command of Leia Organa Solo, her husband Han Solo, the Wookiee Chewbacca and the famous droid C-3PO. It consisted of the famous Millennium Falcon and two EF76 Nebulon-B escort frigates Rebel Star and Antares Six."}, {"tag": "p", "text": "These two escort frigates were under the command of Captain Huoba Neva and Captain Syub Snunb respectively. Having exited hyperspace, the task force came across the wreckage of a massive space battle around the orbit of Coruscant."}, {"tag": "p", "text": "Unfortunately, Neva's frigate Rebel Star collided with the space wreckage and was destroyed. While the Antares Six waited in orbit above the planet, the Falcon entered Coruscant. While on the way, they encountered a squadron of elite Imperial I-7 Howlrunners. However, having arrived on the outskirts of a war-torn Imperial City, the fighters disappeared."}, {"tag": "p", "text": "Having followed Luke's coordinates, the Millennium Falcon arrived in the middle of a fierce battle between the various Imperial factions. Near the old Imperial Palace was the wreckage of the Liberator. For the surviving crew, the Falcon's arrival was a relief since they were besieged by formidable AT-AT walkers."}, {"tag": "p", "text": "Han and Leia quickly wiped out the Imperial walkers before proceeding to land near the wreckage. Upon landing, they were greeted by Lando Calrissian and Wedge Antilles along with the surviving New Republic troops which included Ewok commandos. However, Luke was not present since he had sensed the dark side in the Imperial Palace and had gone to investigate."}, {"tag": "p", "text": "Suddenly, they were attacked by a gang of scavengers which deployed an armored tank and several war droids. The scavengers began looting the Falcon and also unleashed vicious Neks. However, Leia used the Force to confuse the neks and then hurl them while Han preferred finishing off the attacking droids and neks with his blaster."}, {"tag": "p", "text": "It was then that Luke reappeared from the wreckage of the Imperial Palace and used his growing Force powers to dispose off the remaining war droids. He then took on an AT-AT walker on his own and destroyed it as well. Following that, a small reunion took place in which Han, Leia and Luke embraced each other. Unfortunately for them, Luke revealed that he had sensed a great disturbance in the Force, which was actually being caused by Palpatine using his dark side powers to create a massive hyperspace wormhole."}, {"tag": "h3", "text": "The wormhole"}, {"tag": "p", "text": "Meanwhile, the hyperspace wormhole appeared in orbit above Coruscant. This spectacle was witnessed by the crew of the Antares Six. The wormhole then swept furiously across the war-torn surface. Luke quickly realized that it wanted only him and ordered his companions to leave immediately. Though Leia tried to persuade him to leave with them, Luke responded by saying that his destiny was not hers, and instructed her to protect her children."}, {"tag": "p", "text": "While his companions and the surviving Rebels fled on board the Falcon, Luke remained with his faithful companion R2-D2. Soon, the hyperspace wormhole came over him and swept him into space where he was funneled into an Imperial Dungeon Ship bound for Byss."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Millennium Falcon and the Antares Six returned to the New Republic on Da Soocha V. Soon, across the Core, New Republic agents and probe droids witnessed Imperial ships from every side of the conflict retreat into the Deep Core. This was reported to Admiral Ackbar who in turn reported it to Mon Mothma."}, {"tag": "p", "text": "The Imperials had learned that Palpatine had been reborn in a clone body. Under his orders, the Imperial fleet departed from the Core and began attacking New Republic worlds, including Dac. General Alix Balan led a formal ceremony to reconsecrate Imperial City after the battle, an act which earned him fame throughout Imperial Space and included a triumphant parade by Balan's ground forces on the planet's grandest boulevards."}, {"tag": "p", "text": "Following the battle, the New Republic commander ordered Wedge Antilles to reform Rogue Squadron into a more versatile, multi-fighter unit. Bahni, an associate of historian Arhul Hextrophon, believed the loss of Coruscant spelled the end of the New Republic."}, {"tag": "p", "text": "A New Republic soldier named Kinalos wrote about his experiences in the battle in The Year of Rage: A Citizen's History of the Coruscant Wars, detailing his experience of returning to his destroyed home."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}