{"url": "Second_Battle_of_Endor", "categories": ["Category:Legends articles", "Category:Battles of the Nagai-Tof War", "Category:Conflicts on Endor", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Second Battle of Endor"}, {"tag": "p", "text": "The Second Battle of Endor was the first major battle in the Nagai invasion of 4 ABY. It took place nearly one month after the destruction of the second Death Star."}, {"tag": "h2", "text": "Battle"}, {"tag": "h3", "text": "Buildup"}, {"tag": "p", "text": "Although the Nagai had encountered the Alliance of Free Planets on numerous planets, such as Kashyyyk, Kabray and Kinooine, those missions only laid the groundwork for their intended invasion of the wider galaxy. They were establishing forward bases, and trying to capture parts of the Alliance leadership. The assault on Endor would be a strike at the very heart of the Alliance, and mark the opening of outright war between the two parties."}, {"tag": "h3", "text": "Battle"}, {"tag": "p", "text": "The Alliance was alerted to the attack when sensors detected a fleet of small craft heading towards Endor. Admiral Gial Ackbar and Mon Mothma put into effect their withdrawal plans, sending a wing of fighters to engage the incoming ships while the base was evacuated."}, {"tag": "p", "text": "Meanwhile, Luke Skywalker and Han Solo, who had both been deemed unfit to fly, set out to investigate a disturbance in the forest that had been reported by the Ewok Tippet. They found a squad of Nagai and Maccabree preparing to attack the Alliance base, covered by the diversion taking place in space. Luke set off to warn the base, while Han dueled with a Maccabree warrior."}, {"tag": "p", "text": "In space, the Alliance ships were being slaughtered by the Nagai squadron, led by Lumiya, thanks to the Alliance battle plans that had been leaked to the Nagai by their double agent, Bey. By resorting to one of Han's old piloting tricks, Lando Calrissian was able to drive the Nagai forces into retreat."}, {"tag": "p", "text": "On the planet's surface, Lieutenant Hol B'shaki sent a squad of Maccabree warriors against the Alliance tracking station, pinning down Leia Organa and her Zeltron advisors. B'shaki then led Nagai troops toward the Alliance's command center. Luke was able to warn Ackbar and Mothma at the main base in time to escape the attack, and the Jedi set off to defend Leia and her friends at the tracking station. B'shaki's group was eventually intercepted by Rebel troops commanded by Major Bren Derlin."}, {"tag": "p", "text": "Meanwhile, stranded in the jungle, Han Solo faced off against the traitor Bey. Although Bey bested Solo in hand-to-hand combat, the Nagai Commander Ozrei \"Knife\" N'takkilomandrife intervened—the same Nagai Han had encountered on Kashyyyk—and tried to shoot Han. Bey had not wanted to kill Han and so tackled Knife, knocking the shot off target. This give Solo chance to grab his blaster and shoot Knife—he didn't miss. An anguished Bey revealed Knife was his half-brother, and allowed Han to continue on to the tracking station. By the time he arrived there, the Maccabree had been driven off by Skywalker, flying away in their flight-suits."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Although the battle was a victory for the Alliance, it was a Pyrrhic victory, marking the start of the first galactic war since the defeat of the Galactic Empire at Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}