{"url": "Sebulba/Legends", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Dugs", "Category:Males", "Category:Podracers", "Category:Slaves", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Sebulba"}, {"tag": "p", "text": "Sebulba was a male Dug hailing from the Mid Rim planet Malastare. He was a former slave who had bought his freedom with his incredible skills at piloting a high-speed Podracer, and the well-known archrival of a young Human Podracer named Anakin Skywalker. Before long, Sebulba became the star racer of the Galactic Podracing Circuit, based not only on his formidable racing skills but also his penchant for violence. Many fellow Podracers were killed or injured by Sebulba's reckless steering or out-and-out cheating, but Sebulba was far too popular to be blamed or penalized."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Sebulba was a Dug from the city of Pixelito on the planet Malastare. Like most Dugs, Sebulba was belligerent and aggressive, and constantly felt the need to prove his superiority. Despite their camel-like facial structures, Dugs were arboreal, and could use all four of their limbs equally. Sebulba preferred supporting his weight with his arms and performing fine tasks with his legs. While in the seat of a Podracer, however, he used all four limbs, his arms to steer and his legs to manipulate the finer instruments in the pod."}, {"tag": "p", "text": "Sebulba spent his earnings on a decadent lifestyle enjoyed by very few Dugs. His most prized possessions included a pair of Twi'lek sisters, named Ann and Tann Gella, who were skilled masseuses. He also owned at least two more female Twi'lek slaves, a Rutian and a Lethan, who were in his apartment by 32 BBY. Sebulba often used his fame for cheap dalliances with Dug females. Sebulba also had his hands in several slaving rings for Gardulla the Elder."}, {"tag": "p", "text": "When decked out for a race, Sebulba always looked his finest. On his heavily padded racing suit hung numerous trophy coins, a testament to his success. In order to ensure victory, the wily Dug would stop at nothing. While bribing and flat-out cheating were certainly useful, Sebulba largely preferred either pressing his opponents from the track and into obstacles or using the built-in weapons on his Podracer. He would even try and sabotage other pods when racers were not looking. At one time, his vehicle was designed to shoot nails into opponents; later, he poured funds into his racer to install a flamethrower."}, {"tag": "h3", "text": "Boonta Eve Classic"}, {"tag": "p", "text": "In the year of the Invasion of Naboo, Sebulba was the obvious favorite to win the Boonta Eve Classic. He also got into a fight with Jar Jar Binks in retaliation for Binks accidentally spitting a Gorg he attempted to eat after learning of its expensive cost, into Sebulba's soup. However, the local slave boy Anakin Skywalker, who was also one of his opponents in the Classic, broke up the fight before it began. Sebulba dismissed his anger at Jar Jar to insult Anakin's chances at Podracing."}, {"tag": "p", "text": "Sometime before the race, Sebulba gave a secret note to a pit droid called DUM-4, to deliver to Jabba the Hutt. In the first lap, he destroyed Mawhonic's Podracer in the first stretch of the course. In the second lap, he used the illegal flamethrower mounted on his Plug-F Mammoth to roast Clegg Holdfast's engines, destroying his pod. He also ditched a piece of iron into Mars Guo's giant engine turbines, blowing it up. In addition, he also was targeted by fellow racer Ratts Tyerell for death in large part due to his cheating methods, although Tyerell never got the opportunity to kill him, ending up getting killed in the Laguna Caves during the first lap. However, during the last lap, Skywalker caught up with him. After a few attempts to ram his Podracer into Anakin's to knock him off course, their pods tangled with each other. Anakin boosted his engines, sending Sebulba's left engine flying. It hit a rock, went spinning, and then burst into three flaming pieces. His right engine was devastated when it hit the ground and exploded. Sebulba survived without injury, merely cursing in frustration over his defeat."}, {"tag": "p", "text": "The loss was a temporary blow to Sebulba's reputation and ego. Sebulba recovered quickly: purchasing Anakin's Podracer from Qui-Gon Jinn, he showed up his rivals at the Vinta Harvest Classic and the Phoebos Memorial Run race on his home planet of Malastare the following season. Sebulba went on to win many more races, with his brutal competitive edge."}, {"tag": "h3", "text": "Later life"}, {"tag": "p", "text": "At some point in 32 BBY, Sebulba had learned that a Dug called Gazurga had bet against him in the Boonta Eve Classic Podrace. Sebulba considered Gazurga a traitor, and posted a bounty on him of 4,000 credits. This bounty was claimed by Jango Fett."}, {"tag": "p", "text": "Sebulba, after a while, took a rest and quit Podracing. His son, Hekula, was allowed to fly Sebulba's new Podracer six years after the Boonta Eve Classic, also being beaten by Anakin. Hekula, however, was a rookie and smashed the Podracer in his debut race. Sebulba then purchased a Plug-G Gargantua, a remake of his famous podracer that crashed in the Boonta Eve Classic. After purchasing the pod, Sebulba forbade Hekula from Podracing, never letting him near any Podracer or Podrace again."}, {"tag": "p", "text": "Eight years after Anakin Skywalker had won the Boonta Eve Classic, Sebulba wanted revenge and challenged Anakin one last time to race on his home turf once more, with his newly acquired Gargantua. After Anakin salvaged parts of his Podracer that Hekula crashed, he entered the race. The result of the race is unknown."}, {"tag": "p", "text": "Sebulba's grandson Pugwis continued the Podracing tradition. He was a better racer than his dad, and he inherited his grandfather's violent temperament, but he lacked the skills and cleverness of his grandfather and often ended up disqualified."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sebulba was a completely CGI character, and was played by Star Wars voice actor Lewis MacLeod in Star Wars: Episode I The Phantom Menace. MacLeod reprised his role as Sebulba in the video games Star Wars Episode I: Racer, Star Wars: Super Bombad Racing, Star Wars: Racer Revenge, LEGO Star Wars: The Video Game and Kinect Star Wars. He also played Obi-Wan Kenobi in Star Wars: Obi-Wan, Star Wars: Galactic Battlegrounds and Star Wars: Super Bombad Racing."}, {"tag": "p", "text": "Early script notes for Sebulba described him as \"spidery,\" and Lucas envisioned a character with a tangle of agile limbs that functioned both as hands and feet. Since he had to operate a Podracer—and be one of the preeminent pilots in the sport—he had to be light in frame yet powerful and deadly. Thus came Sebulba's thin yet muscular build. His face was inspired by that of a camel, though early drawings gave him tusks that hindered lip-sync. Sebulba's costume was inspired by medieval armor, and his goggles magnified his eyes to make his appearance even more unsettling."}, {"tag": "p", "text": "Some fans erroneously believe Sebulba makes a cameo appearance in Attack of the Clones, in an air taxi during the speeder chase on Coruscant. However, this is actually Seboca. He can also be seen exiting Dex's Diner while Obi-Wan Kenobi and Dex are talking. Other Dugs appearing in the film include Rednax."}, {"tag": "p", "text": "In the bonus features of The Phantom Menace, Sebulba briefly uses a flamethrower in a failed attempt to fry Anakin's pod. The scene was eventually cut."}, {"tag": "p", "text": "In the game Star Wars: Bounty Hunter, one of many secondary bounties on the planet Malastare is a Dug named Xijulba. The ID scanner on Jango's helmet shows that he is part of Sebulba's family."}, {"tag": "p", "text": "In the video game Episode I Racer he is a track favorite three times, yet the only way of unlocking this racer and his pod is to complete the galactic circuit with first place on each race of the tournament. Sebulba indeed has the highest top speed in the game without enhancements, topping 600 miles per hour. However, while most racers can boost their speed by 200 to 400 mph, his speed boost thrust adds 185 mph, the second slowest speed boost in the game."}, {"tag": "p", "text": "Sebulba also appears in the sequel Racer Revenge. In this game the player plays in Sebulba's new Podracer, the Gargantua. His Episode I vehicle, which is faster than his newer podracer, is unlockable by beating the tournament. The game play is radically different, with the inclusion of a new and improved combat system where the player is given a single pod to pilot for the duration of the race. It has a health bar, and when it is depleted the pod crashes and explodes spectacularly. Graphics and handling are also improved, and there are new pilots and tracks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}