{"url": "Second_Duel_in_the_Jedi_Temple", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battles of the Great Jedi Purge", "Category:Battles of the Jedi Temple", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Second Duel in the Jedi Temple"}, {"tag": "p", "text": "The Second Duel in the Jedi Temple was a lightsaber duel between the Sith Lord Darth Vader and former Padawan, Ferus Olin, in the Jedi Temple on Coruscant."}, {"tag": "h2", "text": "Entering the Temple"}, {"tag": "p", "text": "Entering the Temple through a rooftop breakfast room, Olin accessed a stairwell from a ruined atrium at the base of the High Council Tower and climbed to the Jedi Temple Map Room. There, he accessed its data banks, where he discovered evidence of a partnership between Darth Vader and Flame, a woman who was supposed to be helping Olin. Deleting the message Flame had left for Vader, Olin made his way back down to the atrium where he encountered Vader."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "As they began the duel, Olin held his own. Because all of the turbolifts were powered down, Olin was forced onto the stairs leading up to the High Council Chamber. In the once pristine room, the two dueled around the chairs, now rubble in the circular chamber. As the wind whipped back Vader's cape, Olin threw taunts at the Sith Lord, distracting him enough for the former Jedi to land a blow on the cyborg's control panel. Throwing blackened furniture, floor tiles and conduits from the ceiling at Olin, Darth Vader attempted to force him from the chamber out the shattered windows."}, {"tag": "p", "text": "The Sith holocron Olin carried in his tunic pocket encouraged him to strike Vader down and become Darth Sidious's new apprentice; however, as Olin was pinned against the wall after a misstep, he was filled with the light side of the Force, as if the Jedi Masters were once again in the Chamber. Overcome by the goodness left in the ruins, Olin leapt over Vader and dove through a hole in the floor, dropping several stories into the Map Room. Racing down through the Tower, he headed for the Temple's power core, where the residual energies within were enough to destroy the holocron and its evil energies."}, {"tag": "p", "text": "Vader found Ferus in the Core, yet before he struck the final blow, he raced out of the Temple on the orders of his Master to see to the destruction of the Jedi asteroid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}