{"url": "Second_battle_of_Florrum", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Florrum"], "nodes": [{"tag": "h1", "text": "Second battle of Florrum"}, {"tag": "p", "text": "A battle on the Outer Rim planet of Florrum took place in 20 BBY. The battle was fought between Hondo Ohnaka's pirates, backed by the Jedi Order, and the Confederacy of Independent Systems. Because Ohnaka had held Count Dooku for ransom, General Grievous launched an assault on Ohnaka's pirate outpost. Catching the pirates by surprise with his attack, Grievous entered the outpost and met Ohnaka in person. Grievous then opened a holo-communication channel through which Count Dooku spoke with Ohnaka. The Count, who had neither forgotten nor forgiven Ohnaka's questionable hospitality during their first encounter, announced that he was taking control of the planet and planned to dismantle Ohnaka's arsenal. When Ohnaka protested against this, he was swiftly incarcerated. Gwarm, who was returning from recapturing Ahsoka Tano and the six Jedi younglings, was surprised upon seeing droids in the outpost. Tano convinced her captors that the Jedi and pirates needed to join forces against the invaders. When they agreed, the Jedi and pirates proceeded to free Ohnaka and the captured pirate forces. Grievous, however, learned of their presence and ordered AATs to destroy the outpost. After a chase through the trenches of a dried geyser field and a brief confrontation with Grievous, the Jedi and pirate forces escaped Florrum aboard Slave I to Obi-Wan Kenobi's flagship."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Clone Wars, Hondo Ohnaka and his pirates had hijacked a Jedi training cruiser, the Crucible, in an attempt to steal lightsaber crystals. They were repulsed from the ship, but they captured Padawan Ahsoka Tano as they escaped. The Jedi younglings on the Crucible, Byph, Ganodi, Gungi, Katooni, Petro, and Zatt, rescued Tano from the pirates by disguising themselves as circus performers within Preigo's Traveling World of Wonder, but the pirates began chasing them once they figured out their plan. When they reached the Crucible, they took off, but the ship's engines were shot by a pirate's WLO-5 speeder tank. The Crucible crashed and Tano and the younglings were recaptured by the gang. When the pirate captors returned to the outpost, they spotted a droid army massing an invasion against the base. The Separatist forces, led by General Grievous and a tactical droid, had first seized control of the Florrum system, which the Republic had held up until that point, before leading an attack on Florrum itself. Confederate Head of State Count Dooku, having been previously captured and held for ransom by the Ohnaka Gang, ordered Grievous to launch an assault on Florrum in retribution for Ohnaka's actions."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "With the Jedi and the pirate joined forces together, Tano devised a plan to use R2-D2 and the pirate's tank to divert the droids' attention for a bit while they sneaked into the pirate base and freed Hondo Ohnaka from the captivity. After they rescued Ohnaka, they freed the rest of the pirate forces, but one droid managed to alert Grievous to their presence. Grievous decided to cut the problem short by having the prison section leveled by his tanks, but the Jedi and the pirates managed to break out, fight through the droid forces, and flee the outpost. Ohnaka, his pirates, and Katooni piloted Starhawk speeder bikes, while Tano, Professor Huyang, R2-D2 and the other younglings piloted a WLO-5 speeder tank. Grievous then pursued them in his combat speeder with three commando droids piloting STAPs for support. During the chase, the Jedi and pirates were separated; Ohnaka, Katooni and pirates were able to reach Hondo Ohnaka's secret starship vault, while Tano's team were still pursued by Grievous. Ohnaka was going to fly away from the battle at first, but Katooni succeeded in appealing to his sense of honor."}, {"tag": "p", "text": "In the meantime, Grievous prepared to board the Jedi's speeder tank, which forced R2-D2 to execute some risky maneuvers in an attempt to shake him off. However, this move crashed the tank, causing both Grievous and the Jedi to fall from the vehicle. The stunned Jedi were recovering just as Grievous moved in for the kill when Slave I arrived to help the Jedi. Tano sent her youngling charges to the craft and engaged Grievous in combat to cover their escape. She then barely escaped onto the ship on her own, and before Ohnaka had a chance to properly repay Grievous for his cordiality, a squad of AATs fired at them and forced them to escape."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the last of Ohnaka's pirates and the Jedi retreated from Florrum, the planet was fully conquered by the Separatists. The pirates and the Jedi met with Obi-Wan Kenobi, who had been defeated by Grievous and rescued by the Republic rescue team. Aboard Kenobi's Jedi cruiser, Ohnaka boldly attempted to weasel his way out of trouble by claiming the various expenses he incurred saving the younglings, so Kenobi decided to leave it at that. Ohnaka then departed and the younglings were invited by Kenobi to form a wheel with their ignited lightsabers."}, {"tag": "p", "text": "Later during the Clone Wars, Ohnaka returned to his destroyed base with the remaining of his pirates. The resurfaced Darth Maul and his brother Savage Opress launched an attack on Ohnaka's destroyed outpost with his renegades pirates. However, they were repelled from the outpost and eventually defeated with Kenobi's help, forcing the brothers to retreat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle was first mentioned by Hondo Ohnaka in \"Revival\" then, StarWars.com's episode guide wrote that \"A Necessary Bond\" answers what exactly happened to Hondo Ohnaka's base, which was seen destroyed in \"Revival,\" the season opener. Originally, \"Revival\" was planned to air later in the season, in proper chronological order, but it was moved to the start in order to better showcase the Darth Maul storyline. In \"Revival,\" Ohnaka describes his base being overrun by General Grievous.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}