{"url": "Second_attack_on_the_Peregrine", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Airam sector", "Category:Battles of Spreading the Rebellion campaign", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Second attack on the Peregrine"}, {"tag": "p", "text": "The Third Battle of Mobetta was a space battle between the Alliance to Restore the Republic and the Galactic Empire. It saw the conclusion of the refit of the Strike-class medium cruiser Peregrine with the Compeller's gravity well projectors."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The earlier attack resulted in a total craft loss for the Imperial patrol deployed there. As a result, the Empire doubled its caution in that area and deployed a larger strike force to look out for both the Compellor and the missing patrol."}, {"tag": "p", "text": "Rogue and Green Squadrons were tasked with protecting the Airam X7 Factory Gallofree, the modified Strike-class cruiser, and the vulnerable interdictor Compellor while the shuttle Electro boarded the Peregrine to implement the finishing touches."}, {"tag": "p", "text": "The Imperial attack consisted of escort transports armed with proton torpedoes, targeting any major ship or station, plus the Ton-Falk-class escort carrier Tyrant with a full complement of TIE/LN starfighters, TIE/IN interceptors, and TIE/sa bombers."}, {"tag": "p", "text": "Included in the task force were a number of Corellian Engineering Corporation Assassin-class corvettes, including those designated 327-A, 327-B, and 327-C. These vessels were assigned to attack the factory and the transports evacuating it."}, {"tag": "p", "text": "While the Tyrant's fighters kept Rogue and Green Squadrons occupied, three Gamma-class ATR-6 assault transports of flight group Omicron launched from the flight deck in another attempt to secure the interdictor for the Empire."}, {"tag": "p", "text": "Eventually though, the Empire's pilots were defeated by Rogue Squadron, and the only lightly armed and armored escort carrier quickly fell prey to Green Squadron's proton torpedoes."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The victory won here was an important one for the Alliance. While the search group the Empire mounted this time was a bit stronger than the previous one, it was still relatively weak and easily dispatched by the two Rebel squadrons."}, {"tag": "p", "text": "The truly important part was that the Alliance managed to refit one of their fast cruisers with gravity well technology, effectively granting them their first ship with interdiction capability—the Compellor had served its purpose now and was left a dead hulk beside the Gallofree, loaded with explosives."}, {"tag": "p", "text": "Now, the Rebels could start to plot their next moves against Task Force Vengeance."}, {"tag": "h2", "text": "Appearances"}]}