{"url": "Second_migration", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Migrations", "Category:Pre-Republic events and conflicts"], "nodes": [{"tag": "h1", "text": "Second migration"}, {"tag": "p", "text": "The Second Migration referred to a time in Tython's early history when non-Forceful Tythans were forced to leave their homeworld by the Je'daii Order for their own safety. It followed the First Migration, or the arrival of the Tho Yor in the Tython system. The migration led both to the eventual colonization of the Settled Worlds and a lasting resentment for the Je'daii who cast them away."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "When the Tho Yor arrived on the planet Tython in the Deep Core in 36,453 BBY during the First Migration, the mysterious ships deposited their Force-sensitive passengers on the dangerous world where they were faced with many challenges and mysteries. Because of the violence of the world's unpredictable weather and wildlife, non-Forceful individuals found it extremely difficult to survive on the world. While the original settlers all could learn to wield the Force, their children were not all gifted with the ability to touch the Force. Within the second millennium of the Je'daii Order's presence on Tython the city of Aurum was tragically destroyed and made clear that the Je'daii could not protect their families on the volatile world."}, {"tag": "p", "text": "Despite protests, the non-Force-sensitives were sent away from Tython for their own safety. In the process, families were torn apart, children separated from their parents and deep wounds cut into the psyche of the non-Forceful Tythans. The second migration saw these individuals carried aboard ships to the moons of Tython, called Bogan and Ashla. Settling there in vast stone cities, the colonists eventually moved beyond the moons and colonized the other planets in the system, collectively known as the Settled Worlds."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Long after the migration took place, sentiment between the Je'daii and the others were strained. The cities built by the colonists on Tython's moons were eventually abandoned and transformed into meditative retreats for members of the Je'daii Order. During their exiles to the moon of Bogan, both Daegen Lok and Xesh were assigned quarters in an old city."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}