{"url": "Second_Galactic_Civil_War", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Civil wars", "Category:Confederation", "Category:Conflicts of the Colonies", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Deep Core", "Category:Conflicts of the Expansion Region", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Mid Rim", "Category:Conflicts of the Outer Rim Territories", "Category:Conflicts of Wild Space", "Category:Galactic Alliance", "Category:Second Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Second Galactic Civil War"}, {"tag": "p", "text": "The Second Galactic Civil War, alternatively known as the Corellia-GA war, Alliance-Confederation War, Confederation-Galactic Alliance War, Corellian-Galactic Alliance War, New Galactic Alliance War, New Galactic Civil War, the second Corellian Insurrection, or simply CivWar Two, lasting from 40 ABY to 41 ABY, was a conflict originally between the Five Worlds—which later grew to become an interstellar alliance known as the Confederation—and the Galactic Federation of Free Alliances. The conflict began when the Corellian system seceded from the Alliance over local defense limitations and increased taxes to pay for reconstruction in the aftermath of the Yuuzhan Vong War, and gained allies such as Bothawui, Bespin, and Fondor, forming the Confederation. As the conflict quickly escalated, the New Jedi Order battled the rebels alongside the Alliance. Many who had once been allies during the First Galactic Civil War and Yuuzhan Vong War found themselves on opposing sides during the conflict."}, {"tag": "p", "text": "Eventually, many events in the war became uncontrollable, with a decisive fleet victory proving impossible. Amid months of desultory naval skirmishing, the Galactic Alliance Guard was formed in the name of state security, and under Jacen Solo's command committed acts such as the internment and assassination of dissidents that were increasingly viewed as dictatorial. In a coup, Admiral Cha Niathal and Colonel Jacen Solo ousted Chief of State Cal Omas and took his place on Coruscant. Corrupted by and apprenticed to the Sith Lady Lumiya, Jacen secretly became Darth Caedus, the new Dark Lord of the Sith after killing Mara Jade Skywalker. An attempt by the Confederation to push into the Core Worlds was halted at the Battles of Kuat and Balmorra, but the increasing authoritarianism of the GA's government led the New Jedi Order to withdraw from the Alliance, and in the aftermath of Caedus's actions at the Battle of Kashyyyk, they formed the Jedi Coalition. Following this battle, the war became a three-way conflict."}, {"tag": "p", "text": "The war continued with the Galactic Alliance now facing two rebellious factions. The Jedi destroyed Centerpoint Station to prevent it from falling into Alliance hands but failed to capture Caedus. The latter allied himself with the Imperial Remnant, and a major battle occurred at Fondor, the Confederation's largest shipyard. During the Second Battle of Fondor, Grand Admiral Gilad Pellaeon was executed after refusing to obey Caedus's orders, and Niathal and her allies joined the Jedi Coalition as the Alliance-in-exile after refusing to bombard civilian population centers. Concurrently, Jedi Knight Jaina Solo trained under Boba Fett, leader of the Mandalorians, in order to take down her brother, who was by this time completely consumed by the dark side. As Caedus, Niathal, and the Confederation's forces continued to fight, Luke Skywalker planned to create a trap that would allow Jaina to kill her brother. In a climactic duel, Jaina defeated Darth Caedus as well as his New Sith Order. With Niathal's faction of the Galactic Alliance, the Jedi retook control of Coruscant and defeated Caedus' Alliance and Imperial faction, placing Jagged Fel as the leader of the Imperial Remnant. Tense relations between the Alliance and the Jedi resulting from the war continued in its aftermath, and the Confederation refused to formally rejoin the Galactic Alliance. To make things worse, Darth Caedus' actions had accidentally awoken Abeloth, the Mother of Chaos."}, {"tag": "p", "text": "The Second Galactic Civil War was just the first of several galactic wars that disturbed the peace in the cosmos for a hundred years (40 ABY-140 ABY). The following wars were the Lost Tribe War, the galaxy's Second Cold War, Sith-Imperial War, Second Imperial Civil War and Darth Wredd's Insurgency."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "After the Vong"}, {"tag": "p", "text": "Following the conclusion of the Yuuzhan Vong War, much of the galaxy had been ravaged by the Yuuzhan Vong. However, Corellia had emerged relatively unscathed, placing it in a position to increase its already impressive economic power and offer reconstruction loans to less fortunate planets. Nearly a decade after the Yuuzhan Vong's defeat, the economies of most sectors and systems were rebounding: richer worlds were assisting poorer ones and populations that had escaped harm pledged to assist those that had not."}, {"tag": "p", "text": "Corellia was rewarded by the Galactic Alliance with the removal of the office of the Governor-General. The Five Brothers were united through a system government, with each planet electing its own Head of State and the system led by Prime Minister Aidel Saxan. As the Five Worlds prospered, it forgave wartime criminals like Thrackan Sal-Solo, who was subsequently elected the system's Minister of War and Head of State of Corellia."}, {"tag": "p", "text": "However, into this relative peace came the return of historical tensions between the central government and outlying worlds: the destruction of the galactic economy during the war led to poverty and unrest, while Galactic Alliance rebuilding efforts were hampered by inefficiency and corruption. Economic gains in some systems were mirrored by losses in others, breeding resentment and accusations of favoritism. Corellia began to chafe under the Galactic Alliance as it previously had under the New Republic and Galactic Republic: Corellian money and Corellian Defense Force ships were being used by the Galactic Alliance for reconstruction across the galaxy, with apparently little in return for Corellia except for restrictions on its fleet and its ability to strike trade agreements with other systems."}, {"tag": "h3", "text": "The Swarm War"}, {"tag": "p", "text": "In 35 ABY, the Galactic Alliance was caught up in the Swarm War between the Killiks and the Chiss. The conflict revealed that the Galactic Alliance Defense Force was ill-prepared for a major war, and the Galactic Alliance Senate passed measures requiring more reconstruction taxes and military resources from the GA's member states. Some systems and sectors balked at the idea of handing over more money and warships to centralized control, and this was compounded by the Sector Defense Limits of 37 ABY. The galaxy's various Planetary Security Forces were being dramatically expanded by governments that feared piracy, threats from the Unknown Regions, or other conflicts in the destabilized galaxy. The Sector Defense Limits put ceilings on military forces and their capabilities, but enforcement proved difficult and little could be done to stop determined sectors from re-arming."}, {"tag": "p", "text": "The Swarm War coincided with the return of Jacen Solo to the New Jedi Order. Solo had left the Jedi after being exposed to the philosophy of the Jedi mystic Vergere during the Yuuzhan Vong War, who held that the dark side of the Force was not inherently corrupting or evil, as the Jedi believed. While making a five-year odyssey learning from various different Force traditions throughout the galaxy, Solo experienced a terrible vision of a dark, armored figure ruling the galaxy. Determined to alter this future, he came to believe that any level of sacrifice was justified in the name of the greater good. During the Swarm War, he even advocated for the extermination of the Killiks in the name of preserving galactic peace. This philosophy would come to inform many of his decisions during the Second Galactic Civil War."}, {"tag": "h3", "text": "Corellian re-armament"}, {"tag": "p", "text": "The prime mover as tensions mounted against the Galactic Alliance government was Corellia, which had a long history of opposition to central authority. Corellia began to delay its military contributions and tax payments to the Alliance, while at the same time making use of Alliance infrastructure and trade benefits. It also consistently opposed greater central control over systems and sectors. Slowly, other industrialized planets like Commenor, Fondor, and Bespin began to display similarly rebellious streaks. While Corellia made no overt public challenge at this time, it secretly began building a fleet comparable to a planetary assault force, with ships equipped with fast-strike capabilities and long-range weapons, supplied by planets like Adumar."}, {"tag": "p", "text": "In 40 ABY, Alliance accountants had located records of Corellia's secret fleet, while Jedi Knight Jacen Solo and his apprentice Ben Skywalker had discovered an Adumari arms manufacturer producing concussion missiles and proton torpedoes in violation of Order GAO-B11333B. Corellia claimed that the galaxy was too dangerous to justify the Sector Defense Limits, and that its wealth was being taken advantage of by the Galactic Alliance. Meanwhile, Corellian scientists worked to bring Centerpoint Station online, hoping to once again use the power of the supernova-inducing Celestial artifact as leverage in any negotiations with the GA. As tensions grew, Corellia's soft rebellion led to the imprisonment of key Corellians like the Galactic Civil War hero Wedge Antilles, whom the Galactic Alliance Intelligence Service perceived as potential threats."}, {"tag": "h2", "text": "The War"}, {"tag": "h3", "text": "Tensions"}, {"tag": "h4", "text": "Operation Roundabout"}, {"tag": "p", "text": "As the crisis and the security dilemma between Corellia and the GA intensified, the Galactic Alliance chose to bring rebellious Corellia and its followers to heel with a show of military force. Admiral Matric Klauskin was placed at the head of elements of the Second Fleet, including several Jedi teams that would carry out a plan, codenamed Operation Roundabout, to neutralize the Corellian government and military, including Centerpoint Station. Meanwhile, Wedge Antilles had managed to break out of the Galactic Alliance Intelligence compound where he had been confined and was installed as the link between Sal-Solo and Saxan."}, {"tag": "p", "text": "As Dodonna, Klauskin's flagship, arrived in the space above Corellia, five Jedi operations—Slashrat, Purella, Tauntaun, Womp Rat and Mynock—were put into action. As the Jedi taskforces headed for the surface, Klauskin, who was haunted by the ghostly voice of his dead wife, was confronted with a well-prepared Corellian warfleet, including Nebulon-B frigates and Strident-class Star Defenders. A collision sparked a high-pitched starfighter engagement."}, {"tag": "p", "text": "Meanwhile, the Jedi operations on the surface of Corellia met heavy resistance. Team Purella, led by Jaina Solo and including Zekk, Kolir Hu'lya and Thann Mithric ambushed Prime Minister Saxan's motorcade, but were confronted with exploding YVH droids. Task Force Tauntaun, including Tahiri Veila, Doran Tainer and Tiu Zax managed to penetrate Thrackan Sal-Solo's mansion, but were also set upon. Zax managed to stay behind on Corellia and remain hidden, later acting as an invaluable source of intelligence. Both teams were rescued by Luke Skywalker's Hardpoint Squadron, encompassed in Task Force Womp Rat. Team Slashrat, a two-person operation watching Behareh Spaceport, was not required due to the arrival of the assault fleet and lack of launches. But as Klauskin's starfighter forces, including disguised Syal Antilles, were forced into engagement, Ben Skywalker and Jacen Solo, or Team Mynock, infiltrated Centerpoint Station and attempted to disable it. After days of training with Centerpoint scientist Toval Seyah, Ben Skywalker managed to convince a droid that believed it was Anakin Solo to shut down the station's destructive capability, while Jacen distracted Thrackan Sal-Solo."}, {"tag": "p", "text": "Admiral Klauskin struggled against the Corellian fleet until he hit what he thought was a stroke of genius: Klauskin ordered all Alliance forces to prepare to withdraw. As Syal Antilles unknowingly engaged her father, her tactics allowed VibroSword Squadron to disable a Nebulon-B frigate before returning to Klauskin's fleet. The Alliance forces, including Mon Calamari cruiser Blue Diver micro-jumped to Tralus, the system's fifth inhabited world, and two hours later, Rellidir, Tralus's capital city, was securely under Alliance control. The Alliance had saved face, disabled Centerpoint Station and gained a foothold in the Corellian system."}, {"tag": "h4", "text": "Attack on Toryaz Station"}, {"tag": "p", "text": "As the Galactic Alliance and Corellia's relationship came under increasing strain, the leaders of both parties decided to enter into peace talks. The Galactic Alliance chose to reopen negotiations in a neutral setting in the Kuat system. However, following an attack on the delegates which claimed the life of Prime Minister Saxan, the talks failed. Dark Lady of the Sith Lumiya, hoping to bring about a Corellian-GA conflict, was the conspirator behind these attacks."}, {"tag": "h4", "text": "Battle of Tralus"}, {"tag": "p", "text": "The Battle of Tralus was the opening engagement of the Second Galactic Civil War. Wedge Antilles, after hearing a life-wasting plan to retake Tralus made up by Thrackan Sal-Solo, presented him another plan: Operation Noble Savage. The Galactic Alliance had set up a base in a Tralus museum of arts. Below this base was a shield protecting the building. At the edge of the shield sphere, there was a half-constructed building which had enough open area for a fighter to fly through it. This building also provided a gap in the Alliance's shields. Wedge's plan was for two of the new YT-5100 Shriek bombers to fly through the building and destroying the building, removing the GA's beachhead on Tralus completely. The plan passed and so Han Solo was secretly picked to fly one of the bombers, and Wedge flying the other."}, {"tag": "p", "text": "The next day, with the Alliance fleet along with the flagship Dodonna in orbit above Tralus, the Corellians dispatched squadrons of fighters to Tralus to distract the Galactic Alliance ships. During the chaos, Wedge and Han Solo dived to the surface in the Shriek bombers and flew with much difficulty through the structure, eventually reaching the interior of the shield. Together, they destroyed the museum and the shield generator, and the remaining Corellian fighters covered their escape. After this, the Galactic Alliance fleet also withdrew from the system."}, {"tag": "h4", "text": "Turn to the dark side"}, {"tag": "p", "text": "After the assassination of Aidel Saxan, Jacen and Ben attempted to trace her assassins. They went to Lorrd and met up with Jacen's former apprentice Nelani Dinn. It was on Lorrd that they were contacted by people who claimed to be under the influence of a Force Ghost. This ghost was revealed to be Brisha Syo, the Dark Lady Lumiya."}, {"tag": "p", "text": "Lumiya took the three Jedi back to her asteroid home and told them that it was the lair of a Sith Lord called Darth Vectivus. The four of them went down to the caverns to confront Vectivus, where Lumiya separated them. Ben and Nelani battled Force ghosts while Jacen and Lumiya confronted Vectivus."}, {"tag": "p", "text": "Lumiya told Jacen that she had been trained by Vergere to finish Jacen's training after she had died. She turned Jacen to the dark side but Nelani attacked first. Lumiya and Nelani fought a brief duel, but Jacen intervened, and killed Nelani. Jacen, now in the service of the Sith, covered up Lumiya's existence by wiping Ben's memory."}, {"tag": "h3", "text": "The crisis escalates"}, {"tag": "h4", "text": "The Galactic Alliance Guard"}, {"tag": "p", "text": "In the weeks following the Battle of Tralus, Jacen Solo successfully lobbied Cal Omas and the Senate into the creation of a new organization meant to counter the increasing threat of terrorists sympathizing with Corellia. This came following the bombing of the Elite Hotel in Galactic City, which was discovered to be connected to Corellian terrorists. The bombing left hundreds dead and many wounded."}, {"tag": "p", "text": "After Mara Jade Skywalker turned down the job, Omas asked Jacen if he would be willing to lead the new paramilitary organization on Coruscant. Jacen agreed and achieved the rank of colonel. Bringing in Coruscant Security Force operators, ex-New Republic Intelligence Service agents, and members of the special forces, the Galactic Alliance Guard, or GAG, used extremely effective and public methods of cracking down on Corellian insurgents. The move prompted Supreme Commander Pellaeon to resign as leader of the Galactic Alliance Defense Force, replaced by the ambitious and stern Cha Niathal."}, {"tag": "p", "text": "Much to the dismay of Luke Skywalker and the Jedi Council, high-profile images of Jacen and Ben Skywalker leading the Galactic Alliance Guard on their raids began to usher in contentions that the Galactic Alliance was transforming into the Empire once again and that yet another member of the Skywalker bloodline was at the helm."}, {"tag": "p", "text": "Under the tutelage of Captain Lon Shevu, Ben Skywalker found the Guard as a place of refuge. His enthusiasm for learning and making a difference in \"adult\" situations added yet more tension between the young Jedi and his parents, and when Jacen convinced Omas to proceed with the internment of Corellians on Coruscant, the Galactic Alliance Guard's 967 Commando detachment became known as \"stormies\" among both its members and the populace. This move added more fuel to the fire, spurning on riots and leading to moves of secession by dozens of worlds. Worst of all, Han Solo, enraged that his son was leading the effort in interning thousands and possibly millions of Corellians, realized that he no longer recognized the boy he had raised."}, {"tag": "h4", "text": "The Blockade of Corellia"}, {"tag": "p", "text": "The Galactic Alliance Guard had become Jacen Solo's \"fist\", mirroring his grandfather, Darth Vader and the 501st Legion (aka \"Vader's Fist\"). With the GAG at his complete disposal, Jacen led the Blockade of Corellia, taking the first open strike against the Five Worlds in a new effort to force them to surrender."}, {"tag": "p", "text": "Months of desultory skirmishing would follow as the Corellian Home Fleet attempted to break out of the Corellian Exclusion Zone. Many system governments were outraged by the blockade, and as the Galactic Alliance Defense Forces' agenda of centralizing all military resources became clear, planets like Bothawui, Atzerri and Commenor were drawn into the war on Corellia's side."}, {"tag": "h4", "text": "The assassination of Thrackan Sal-Solo"}, {"tag": "p", "text": "Concurrent to the events on Coruscant, Han and Leia Solo were contacted by Dur Gejjen, a member of Corellia's Democratic Alliance, who secretly wanted Thrackan Sal-Solo removed from office—permanently. Gejjen brought up the idea of killing Sal-Solo, something the Solos needed time to consider."}, {"tag": "p", "text": "Not fully confident that the Solos would accomplish their task, Gejjen also hired Boba Fett to kill Sal-Solo. Fett was already considering accepting a job from Thrackan to protect Centerpoint Station from the Galactic Alliance blockade. However, Boba agreed to Gejjen's contract."}, {"tag": "p", "text": "Before arriving at Sal-Solo's office, Boba (along with his granddaughter Mirta Gev) confronted Han Solo. Solo, who already had a bounty placed on his head (along with his family) by Sal-Solo, was being targeted by Fett's estranged daughter, Ailyn Vel. Fett saw this as an opportunity to reunite with the daughter he hadn't seen since she was an infant. Han informed Fett that Jacen had already captured Ailyn (who was hiding with Corellian insurgents on Coruscant). Solo and Fett then made a deal. If Han could be allowed to kill his cousin, he would convince Jacen to free Ailyn (it was later revealed that Jacen killed Ailyn during interrogation)."}, {"tag": "p", "text": "Boba, Mirta, and Han (disguised in Mandalorian armor) arrived at Sal-Solo's office. Boba briefly discussed his deal with Sal-Solo before Han revealed his identity and attempted to kill the Corellian president. Sal-Solo revealed that he lured Ailyn to Coruscant intentionally. He meant for her to be caught and hide the threat of the other bounty hunters Sal-Solo hired to kill the Solo family. In a fit of rage, Mirta shot Sal-Solo in the forehead. Fett then shot him in the chest to ensure he was dead. Han, needing some sort of revenge, slowly put a final blaster bolt into his cousin's lifeless body."}, {"tag": "p", "text": "Following Sal-Solo's assassination (which was blamed on the Galactic Alliance), Gejjen assumed control of the Corellian government. Under Gejjen's leadership, the Corellian government continued to decline talks with the Alliance. Chief of State Omas then officially declared a state of war between the Galactic Alliance and Corellia."}, {"tag": "h4", "text": "The return of Alema Rar"}, {"tag": "p", "text": "As the crisis escalated, Jacen was forced more and more to rely on Coruscant's World Brain to help him track down terrorists. This was a Yuuzhan Vong dhuryam left over from the invaders' occupation of the planet during the Yuuzhan Vong War, grown to coordinate terraforming. However, fearing assassination by Bothans of the True Victory Party intent on continuing the ar'krai genocide against the Yuuzhan Vong, the Brain fled from the World Well and Jacen had to pursue it into Coruscant's depths. He didn't realize that he was also being followed, by the former Killik Night Herald Alema Rar. She desired to kill Jacen in revenge for the Solo family's perceived abandonment of her at the Battle of Tenupe during the Swarm War."}, {"tag": "p", "text": "Jacen eventually found the World Brain and attempted to bring it back into the fold. However, Alema attempted to kill Jacen with a poisoned dart but Lumiya alerted Jacen and the dart struck and killed the World Brain instead. Jacen, angered by the World Brain's death and convinced that Bothans were responsible, ordered the death of many Bothans on Coruscant, which drove Bothawui to join Corellia. Meanwhile, Alema continued to shadow him and Lumiya. Alema eventually revealed herself to Lumiya when Jedi Tresina Lobi was about to reveal her to the Jedi. Together, Alema and Lumiya killed Lobi and Alema pledged herself to Lumiya's service."}, {"tag": "p", "text": "When news of Lobi's death reached the Jedi Council, Luke believed that it was the work of Lumiya. Together with Mara, he followed the trail from Lobi's body to Lumiya at the Roqoo Depot. There they battled Lumiya and Alema separately. Mara defeated Alema and discovered that she was carrying a bomb vest. Disarming it, she went after Luke, who she found shooting Lumiya. Mara told Luke about the bombs and left the building before it exploded, leaving Lumiya and Alema supposedly dead."}, {"tag": "h4", "text": "Coup attempt at Hapes"}, {"tag": "p", "text": "During the war, the Corellian leadership planned on drawing the Hapes Consortium into the war on their side by assassinating Queen Mother Tenel Ka Djo and her daughter Allana, and replacing them with a pro-Corellian faction. The Corellians allied themselves with disgruntled Hapan nobles - who operated under the name of Heritage Council - and sent a secret force of new Corellian Dreadnaughts to assist the forces of these Hapan rebels. In the end both parts of the plan failed, as the Hapan rebels and their Corellian allies were defeated in the Battle of Hapes and the Queen Mother and her daughter survived the assassination attempts. Apparently most of the Hapans allied with the Five Worlds were captured or killed. However, the failed coup attempt only expanded tensions further."}, {"tag": "h3", "text": "All-out war"}, {"tag": "h4", "text": "Breaking the blockade"}, {"tag": "p", "text": "By the latter half of 40 ABY, the blockade of Corellia by the Galactic Alliance was still underway. However, Bothawui, furious over the murder of several prominent members of the True Victory Party on Coruscant and suspecting that the GA was almost certainly behind it, had begun assembling a battle fleet. The Alliance knew of this and had taken precautions to make sure the fleet would not be able to leave Bothan Space without the GA knowing of it. However, the sabotage of the Alliance observers by Admiral Matric Klauskin under the influence of Lumiya permitted the Bothans to jump to the Corellian system, where they helped Corellia to break the blockade. The Alliance was forced to retreat, attempting to damage Centerpoint Station beyond repair before they left."}, {"tag": "h4", "text": "Mission on Ziost"}, {"tag": "p", "text": "As the war escalated, Ben, who had been separated from Jacen when Luke feared that Jacen would take Ben with him to the dark side, was sent a message via Seha Dorvald, an apprentice working with Jacen. He was told to track down the Amulet of Kalara on the Almanian moon of Drewwa. He did this, but discovered that it had already been stolen by a man named Faskus and taken to Ziost."}, {"tag": "p", "text": "Ben discovered a dying Faskus on the planet following an attack by agents led by the Bothan Byalfin Dyur who were sent by the Dark Lady Lumiya, who was testing whether Ben was ready to become Jacen's apprentice. Ben, along with an R2 unit called Shaker, rescued Faskus's daughter Kiara and took her with him where they discovered a Sith Meditation Sphere and used it to escape the planet, wrecking Dyur's ship in the process."}, {"tag": "p", "text": "Ben returned Kiara and Shaker to Drewwa and returned the ship to Jacen and gave him both the ship and the amulet. However, his ordeals had shaken his trust in his cousin while Lumiya believed that Ben would never be able to become Jacen's apprentice."}, {"tag": "h4", "text": "The Confederation"}, {"tag": "p", "text": "Shortly after the breaking of the blockade, Commenor and Bothawui joined Corellia, and the Confederation was formed. Other planets soon followed; Fondor, Bespin, and Adumar prominent among them. For several weeks, the GA and Confederation were locked in a state of standoff, with both sides concentrating more on preparing for an inevitable war rather than a direct assault; instead making sporadic and minor raids against each other."}, {"tag": "p", "text": "Galactic Alliance Intelligence received word that the Confederation were planning a meeting on Gilatter VIII to elect a new Supreme Commander. In response to this newfound information, Jacen Solo laid out a four step plan to ambush the Confederation and end the supposed meeting. The Alliance attempt to sabotage that meeting ended in the Battle of Gilatter VIII, when the meeting turned out to be a Confederation trap, the election having been held the day before. The battle ended in a draw, and both sides retired to make more preparations for war."}, {"tag": "p", "text": "The individual fleets reorganized themselves to become the united Confederation Fleet with former Imperial General Turr Phennir as Supreme Commander of the Confederation military."}, {"tag": "h4", "text": "Light against dark"}, {"tag": "p", "text": "While the battle raged about the planet, Jacen and Lumiya, who had traveled with him, were attacked by Luke, Mara, Han and Leia. In the ensuing fight, Mara fought off the Corellians while Lumiya again teamed up with Alema to fight off the other three."}, {"tag": "p", "text": "The duels ended with Leia forcing Alema to flee and Lumiya offering peace with Luke before leaving. With the duel over, Lumiya and Alema went to collect the Sith ship from Ben, who had collected it on Ziost, while the others escaped a freighter collision."}, {"tag": "h4", "text": "Escalation and political crisis"}, {"tag": "p", "text": "After the events of Gilatter VIII, the war continued to escalate, with additional worlds seceding from the Alliance, including Beris and Las Lagon. While such losses were minor in terms of overall effect, it represented a continuing worsening of the conflict, as well another step closer to full scale galactic civil war."}, {"tag": "p", "text": "Actions intensified in Bothan Space, as Alliance fleet units engaged a Bothan flotilla during the Battle of Bothawui. At the same time, numerous worlds across the galaxy began to pursue old vendettas with rival worlds, forcing the Alliance government to further spread their fleets to keep the peace. Increasingly a minority voice for peace in the upper echelons of the government, Cal Omas struggled to hold the majority of the Alliance together."}, {"tag": "p", "text": "In an effort to lull Coruscant into a false sense of peace, in order to buy time for a massive Confederation strike on the galactic capital, Dur Gejjen approached Cal Omas for secret peace talks. Omas, eager at the chance to end the war and preserve the Alliance, went to the neutral world of Vulpter to have direct talks. Due to the tapping of high level Alliance leaders by the Galactic Alliance Guard, Jacen was able to dispatch several GAG units to the site of the meeting."}, {"tag": "p", "text": "During the meeting, Omas was lured by the possibility of the Confederation calling for a cease fire and returning into the folds of the Galactic Alliance. Gejjen's only demand was the removal of Jacen and Cha Niathal, either politically (Omas's preference) or permanently (Gejjen's). The meeting was bugged, allowing Jacen the story he needed to arrest Cal Omas and remove him from office. Furthermore, Dur Gejjen was assassinated by Ben Skywalker on the orders of Jacen, which took a heavy toll on the Confederation."}, {"tag": "h4", "text": "The rise of Darth Caedus"}, {"tag": "p", "text": "After successfully manipulating galactic law to allow him powers not seen since the end of the Old Republic, Jacen Solo moved to gain control of the Alliance. Using the footage of Omas seemingly agreeing to enemy demands for the sake of peace, Jacen and Admiral Niathal staged a bloodless and quiet coup. Placing Omas under house arrest, the duo became a duumvirate, ruling the Alliance as co-Chiefs of State. While Admiral Niathal genuinely believed that the military coup was only for the duration of the war, Jacen began laying the plans for his eventual rule of the entire galaxy as Sith Lord."}, {"tag": "p", "text": "Now that he was Co-Chief of State of the Galactic Alliance, Jacen Solo was ready for his ascension to Dark Lord of the Sith. However, he first had to make his sacrifice to show his commitment."}, {"tag": "p", "text": "Ben Skywalker, distraught over his assassination of Dur Gejjen, confided in his mother Mara about Jacen and Lumiya. After failing to kill Lumiya on Hesperidium, Mara pursued her to Kavan but met Jacen instead and they engaged in a vicious duel. Mara was able to bring down Jacen and was about to kill him when he used a Force illusion of Ben to distract her before he stabbed her with a poison dart and killed her."}, {"tag": "p", "text": "Having made his sacrifice, Jacen was now ready to become a true Sith. Lumiya realized this and went off to fulfill her part of the plan and buy Jacen some time. She went to Luke and claimed that she had killed Mara. Luke pursued her to Terephon and shot her down before dueling and decapitating her. With Lumiya's death, Jacen was ready to become Darth Caedus, Dark Lord of the Sith."}, {"tag": "h3", "text": "Push to the Core"}, {"tag": "h4", "text": "Kuat and Balmorra"}, {"tag": "p", "text": "With the failure of the peace talks, the war continued and spread across the galaxy. The Confederation began a push towards the Galactic Core. Reinforced by a Commenorian and Hutt fleet, the Confederation laid siege to Balmorra. Jacen Solo, now Darth Caedus, led the Galactic Alliance Fourth Fleet in a counterattack. Though Balmorra was lost, the Confederation took heavy losses and were prevented from reinforcing their own fleet at the Battle of Kuat."}, {"tag": "p", "text": "The Battle of Kuat lasted nearly a week. Darth Caedus led the attack on the Confederation Fleet from the Star destroyer Anakin Solo. Caedus was depending on the Jedi to quickly end the battle, and had already sent a large GAG force to hold the Jedi Academy on Ossus hostage. Luke Skywalker, still grieving over the death of his wife, led the Jedi force, but after he found out Jacen had used Ben to assassinate Cal Omas, broke off and jumped to Kashyyyk, where his fugitive sister and her husband were trying to convince the Rock Council to aid the Jedi, and were eventually able to sway the Wookiees to their side, depriving both the Alliance and the Confederation of a sizable fleet. Unable to quickly end the battle at Kuat, Caedus decided to attack Kashyyyk and make it an example to other rebellious star systems."}, {"tag": "h4", "text": "The death of Omas"}, {"tag": "p", "text": "Having become Darth Caedus after killing Mara Jade Skywalker, Jacen was determined to turn the young Ben Skywalker to the Dark side of the Force. During a brief conversation with Ben during the Battle of Kuat, Caedus revealed a faked conversation strung together from words taken from recorded meetings with Cal Omas, which ordered Mara Jade's assassination. While not totally convinced that the former Chief of State was responsible for his mother's death, Ben snuck into Omas's Coruscant home, prepared to kill him. Omas, however, was already waiting."}, {"tag": "p", "text": "In a standard similar to that of his predecessor, Borsk Fey'lya, he had rigged a proton bomb that would be triggered by the cessation of his heartbeat. Learning the truth from Omas, Ben tried to convince the ex-Chief to fake his own death. Omas refused, and impaled himself on Ben's lightsaber. Ben escaped before the bomb exploded, but, having learnt the identity of his mother's murderer, he was prepared to kill Caedus."}, {"tag": "h4", "text": "Treachery on Ossus"}, {"tag": "p", "text": "In order to keep the Jedi Order on the side of the Alliance, Jacen had a battalion installed since the masters had left for Mara Jade's funeral on Coruscant. This battalion was commanded by Major Salle Serpa, an officer on the brink of insanity and willing to murder the occupants in the Academy to keep order. Only Masters Kam Solusar and Tionne Solusar were left to guard the children along with a handful of Jedi Knights."}, {"tag": "p", "text": "However, Jaina Solo, Jagged Fel and Zekk had hunted Alema Rar to Ossus, believing that she had killed Mara. Although Alema escaped, the three of them stayed to help protect the children. Following the Jedi withdrawal from the Battle of Kuat, Serpa made his move on the Academy."}, {"tag": "p", "text": "Serpa used coma gas to take out the two Jedi Masters quickly while they took the children hostage. However, Jaina was warned by Ben Skywalker and she alerted the other masters. However, GAG troops had already killed many of the Jedi in the Academy and Tionne was wounded by Serpa and captured. Serpa then used Tionne as bait, shooting off her arm and leg in front of the children and the other Jedi.\nKam Solusar could take no more and along with two other Jedi Knights but they were shot down by snipers. The two Knights were killed and Kam Solusar was injured. Jaina and Fel managed to kill the snipers and Jaina confronted Serpa who then attempted to shoot her. However, Zekk arrived and disarmed Serpa, twice, and he was taken captive. The Jedi were then forced to abandon Ossus in fear of reprisals."}, {"tag": "h4", "text": "Revelation on Korriban"}, {"tag": "p", "text": "Following Lumiya's death, Alema took the Sith ship to search for a Sith artifact to help the new Sith Lord, Darth Caedus. She infiltrated the Jedi Temple on Ossus and downloaded some data before traveling to Vectivus's asteroid, which led her to the One Sith on Korriban."}, {"tag": "p", "text": "Meeting with the Sith leader known to herself as \"White Eyes\", Alema discovered the meaning of Vergere and Lumiya's plans. \"White Eyes\" gave her a Sith holocron which she attempted to take to Jacen during the Battle of Kashyyyk. The holocron was revealed to contain useless data which showed Jacen how little the Sith on Korriban thought of him."}, {"tag": "h4", "text": "Devastation of Kashyyyk"}, {"tag": "p", "text": "Determined to punish Kashyyyk and claim its fleet for the Galactic Alliance, Caedus led the Galactic Alliance Fifth Fleet to the planet and proceeded to burn its forests with the Anakin Solo's long-range turbolasers. A squadron of interceptors began to attack the Anakin, at which point, Ben Skywalker marched onto the bridge and attempted to kill Caedus. A Jedi shadow bomb struck the bridge, killing much of the bridge crew and causing Ben to miss Jacen with his lightsaber and accidentally bisect Commander Twizzl. Caedus took Ben to a torture chamber in the depths of the ship and locked him in an Embrace of Pain, a Yuuzhan Vong torture device. Meanwhile, a large Confederation and Bothan fleet entered the system and engaged the Galactic Alliance forces. Luke Skywalker boarded the Anakin Solo and engaged Caedus in a lightsaber duel. At the same time, the Hapan Royal Navy arrived, led by Caedus's lover Tenel Ka. Instead of helping the Alliance, the Hapans joined the Jedi, Wookiee, and Confederation forces in attacking the Fifth Fleet. Aboard the Anakin Solo, Luke bested Caedus in a duel, and Ben was determined to finish him off. Caedus escaped, but was badly wounded. The Fifth Fleet only escaped by exploiting a hole in the Bothan lines, which had been created by Alema Rar, manipulating the Bothans from a Sith Meditation Sphere. Due to the threat coming from Jacen Solo, the New Jedi Order, Hapes Consortium and the Confederation concluded a pact of neutrality."}, {"tag": "h3", "text": "Formation of the Jedi Coalition"}, {"tag": "h4", "text": "Withdrawal of the Hapes Consortium"}, {"tag": "p", "text": "The Battle of Kashyyyk was a major blow to the Galactic Alliance. The New Jedi Order and Hapes Consortium seceded from the Alliance, removing twenty percent of the GA's fleet strength."}, {"tag": "p", "text": "The Galactic Alliance forces attacked Commenor to contain its forces, not to occupy the world. During the battle, elements of the Galactic Alliance Third Fleet launched a cloaked asteroid at Commenor. This resulted in the Commenorians releasing the affliceria virus on Coruscant which infected many civilians and military personnel."}, {"tag": "p", "text": "After Tenel Ka turned against him, Caedus felt heartbroken and betrayed. He admitted that he would kill Tenel Ka and anyone else who stood between him and Allana, his daughter. He also planned to get the Hapes Consortium back into the Alliance by taking Allana away from Tenel Ka. He kidnapped her, leaving a message that he would kill Allana unless the Hapes Consortium once again gave the Alliance military support."}, {"tag": "h4", "text": "Attack on Jacen Solo"}, {"tag": "p", "text": "Following the Devastation of Kashyyyk, Luke Skywalker decided that it was time to have his nephew Jacen Solo removed. Acting on a plan formulated by Kyp Durron, a team of Jedi led by Kyle Katarn traveled to Coruscant to confront Jacen. The team was made up of Katarn, Valin Horn son of Jedi Master Corran Horn, Thann Mithric, Kolir Hu'lya and Seha Dorvald who was once a spy of Jacen's."}, {"tag": "p", "text": "Although the team managed to confront Jacen, the mission was a disaster. Jacen, now with the powers of a Sith Lord managed to be quite a match for the Jedi team and the arrival of a squad of GAG troopers tipped the odds in his favor. Jacen stabbed Katarn in the chest, taking him out of the fight and while Seha and Horn dragged him to safety, Mithric was decapitated by Jacen. The rest of the Jedi team escaped with Katarn and although it seemed that the mission had failed, it was only a distraction so that Seha could plant a tracking device on the Sith Lord allowing the Jedi to track his movements."}, {"tag": "h4", "text": "Decimation of the Alliance Second Fleet"}, {"tag": "p", "text": "Shortly after the attempt on his life, Jacen met with Cha Niathal who told him that Five Worlds Prime Minister Sadras Koyan wanted to defect to the Alliance and she wanted to open negotiations with him. Jacen was sent with a small force to open space between Corellia and Coruscant where he met a small group of ships commanded by Captain Hoclaw."}, {"tag": "p", "text": "The debate went on, with Hoclaw unwilling to give too much away. The Alliance force became suspicious when they discovered that there was only a skeleton crew onboard the Corellian ships. Following the arrival of Leia Organa Solo, Jacen took Allana up in his fighter into space. A Corellian force arrived and Jacen ordered the Second fleet under Admiral Tarla Limpan to engage them."}, {"tag": "p", "text": "However, this was all a part of the Corellian trap, as the Corellian leadership ordered Centerpoint Station to be fired. The blast destroyed much of the Second Fleet, killing Limpan, but Jacen and the Anakin Solo escaped. This move also backfired on the Corellians and led to an embargo of the Corellian system on the orders of Turr Phennir, commander of the Confederation forces."}, {"tag": "h4", "text": "The end of Alema Rar"}, {"tag": "p", "text": "Following the Battle of Kashyyyk, Alema Rar fled to the lair of Darth Vectivus and used it as her base of operations. From here she learned the Force Phantom ability and used it to try and kill Leia and Han on Kashyyyk. However, this failed and Han, Leia, Jaina, Zekk and Jag tracked her to her new lair."}, {"tag": "p", "text": "Due to Alema's use of Force Phantoms and the arrival of an enemy frigate Poison Moon commanded by the Sith Dician, they were separated, with Han attempting to escape the Sith, while Leia dueled an Alema phantom. Jaina also confronted another Alema phantom on the surface while Zekk confronted Alema's Sith ship."}, {"tag": "p", "text": "Zekk convinced the Sith ship to leave, and this distracted Alema, and the Force phantoms vanished. Dician decided to pursue the Sith ship and left the asteroid field, but not before detonating bombs she had planted on the surface. Jaina confronted the real Alema and pursued her up towards the asteroid surface."}, {"tag": "p", "text": "Jag arrived and told Jaina to go and help Zekk, who was in shock after using the dark side to convince the Sith ship to leave. Jag battled Alema and was wounded and Alema took his blaster. As she was about to finish him, the blaster exploded when it was no longer in Jag's grasp blowing Alema's arm off. Jag then used his crushgaunts to snap Alema's spine and kill her, ending her threat. Jaina, Zekk and Jag all managed to escape the asteroid as it exploded."}, {"tag": "h4", "text": "Destruction of Centerpoint Station"}, {"tag": "p", "text": "Following the destruction of the Second Fleet, Jacen traveled to Centerpoint at the head of a task force to capture the station for use against the Confederation. Seeing that it would tip the balance of power greatly in favor of anyone who possessed its enormous destructive force, Grand Master Luke Skywalker and the New Jedi Order carried out a raid upon the station in order to finally destroy it. Jedi Master Kyp Durron led the raid, with Toval Seyah, a Galactic Alliance scientist and former spy who had worked on the station. Seyah was able to modify Centerpoint's galactic data reserves in such a way that all coordinates in the galaxy were altered to become those of the station."}, {"tag": "p", "text": "During the pitched battle between Confederation and Galactic Alliance forces, a technician named Rikel who had lost his wife on the galactic capital of Coruscant was left in charge of the station's firing station. He set the coordinates to target Coruscant, and when he fired Centerpoint, the massive construction targeted itself. The resulting gravitic pulse detonated the station, wiping all traces of the enigmatic structure from the system, killing all on board, and destroying countless vessels in its blast radius."}, {"tag": "p", "text": "During the battle, a strike team boarded the Anakin Solo and rescued Allana from Caedus, taking away the only leverage Caedus had over Tenel Ka and the Hapes Consortium. Meanwhile, Sadras Koyan was killed by an Alliance agent while fleeing the battle."}, {"tag": "h3", "text": "Split of the Galactic Alliance"}, {"tag": "h4", "text": "Enter the Imperial Remnant"}, {"tag": "p", "text": "Shortly after the breaking of the Blockade of Corellia, the planet Fondor had declared itself independent of the Galactic Alliance and began supplying ships to the Confederation. Recognizing the need to bring Fondor and its extensive shipyards back into the GA's fold, Caedus began planning the invasion of Fondor."}, {"tag": "p", "text": "Short of ships and needing new allies, Caedus sent Tahiri Veila (by now his Sith apprentice) to the Imperial Remnant to negotiate an alliance with Grand Admiral Gilad Pellaeon. Knowing that Pellaeon would never accept, Caedus offered the planets Bilbringi and Borleias to the Moff Council headed by Grand Moff Quille, Pellaeon's chief rival. Bilbringi possessed extensive shipbuilding facilities, and Borleias was a major financial center. Though Pellaeon possessed considerable sway among the Moffs, the Council agreed to join Caedus in the fight."}, {"tag": "p", "text": "Apparently, Caedus had neglected to tell the two planets that he would be selling them to the Remnant. This information was enough for Admiral Niathal to begin planning to defect to the Resistance to Jacen Solo. Pellaeon, meanwhile, recalled Admiral Natasi Daala to the Remnant to help in his fight against Caedus."}, {"tag": "h4", "text": "Training under Boba Fett"}, {"tag": "p", "text": "Realizing that she was the only one who could bring Caedus down, Jaina traveled to Mandalore in an attempt to learn the skills that would allow her to do so. Boba Fett agreed to train her in Mandalorian martial arts and weapons skills and began to instruct her. Along the way Jaina learned some harsh lessons from the legendary bounty hunter."}, {"tag": "p", "text": "Jaina learned much about Mandalorian culture and helped to heal the mind of Sintas Vel, Fett's long believed dead wife. Jaina would later attend the wedding of Mirta Gev, Fett's granddaughter and would become incorporated in Mandalorian society. She also began to train in total war and realized she would be the only one willing to kill Caedus."}, {"tag": "p", "text": "She would later accompany the Mandalorians to Fondor when they were hired by Admiral Natasi Daala. Jaina would later hear a conversation between Daala and Fett where they both expressed their desire to be rid of the Jedi and the Sith."}, {"tag": "h4", "text": "Assault of Fondor"}, {"tag": "p", "text": "The Galactic Alliance launched an attack on Fondor. When the fleet arrived, Caedus discovered that the minelayers he had sent to plant a huge minefield around Fondor had disappeared. There was also no sign of the minefield, nor any sign of the enemy fleet. It later transpired that Niathal had told Luke Skywalker of Caedus's plan, and the minelayers had been destroyed the moment they had exited hyperspace."}, {"tag": "p", "text": "After ordering the planet's surrender, to which the Fondorians refused, Caedus advanced on the planet. At that point, the entire Fondor defense fleet, having been hidden inside the shipyards, opened fire. Caedus forced his way through and ordered the bombardment of its capital city."}, {"tag": "p", "text": "Admiral Niathal signaled the planet to surrender, which it did, but Caedus continued to bombard it. Niathal relieved Caedus of his command because of this, but Caedus did not recognize her authority and continued. A large portion of the Alliance fleet sided with Caedus, but Pellaeon decided to support Niathal and ordered his ships to protect them."}, {"tag": "h4", "text": "Coup aboard the Bloodfin"}, {"tag": "p", "text": "As the battle began to turn against Caedus, Pellaeon retired to his cabin to talk with Daala. However, he was followed by Tahiri Veila, who attempted to convince him to join Caedus. Pellaeon refused, so Tahiri shot him and the Moffs led by Quille watched Pellaeon die. As Pellaeon lay dying, he learnt of the Moffs' treachery and whispered Quille's name to Daala before ordering her to attack as he died."}, {"tag": "p", "text": "However, the coup did not go well for the Moffs. Although they convinced the Imperial fleet to side with Caedus, the crew of the Bloodfin rebelled, trapping the Moffs. Daala attacked Caedus's fleet and the Mandalorians she hired under Boba Fett killed Quille and the other Moffs before forcing Caedus and Veila to flee the ship. They retrieved Pellaeon's body and took it to Corellia for a funeral."}, {"tag": "p", "text": "With the help of the Jedi Coalition, the Maw Irregular Fleet led by Daala, and a team of Mandalorians led by Boba Fett and Jaina Solo, Niathal's forces were able to drive Caedus off. Niathal later occupied Fondor and used it as the capital of her faction of the Galactic Alliance."}, {"tag": "h4", "text": "A murderer revealed"}, {"tag": "p", "text": "During this time, Ben resolved to prove that his cousin Jacen had murdered Mara. Traveling with Lon Shevu to Kavan he saw his mother's ghost which told him to look for some lost hair. After carrying out an investigation into Jacen's StealthX, Ben discovered a strand of Mara's hair, which matched with one Luke still had in his possession."}, {"tag": "p", "text": "This, together with Jacen's confession to Shevu, was enough to convince the Jedi that Jacen had killed Mara. This discovery made Luke more determined that Jacen should be removed as a threat."}, {"tag": "h3", "text": "The final moves"}, {"tag": "h4", "text": "Assault on Roche"}, {"tag": "p", "text": "The Imperial Remnant, having allied with Caedus, attacked the Verpine in the Roche asteroids in an attempt to gain their advanced technology and turn the tide of the war. The Mandalorians, under an agreement with the Verpine, rushed to their aid with the help of Jaina Solo. The Imperials used a nanovirus to wipe out the Verpine soldier caste and leave the workforce for Alliance service. However, the Mandalorians and the Verpine defeated this first Imperial force and destroyed its flagship, a Super Star Destroyer called Dominion but the Imperials took the planet anyway. The Moff Council landed on Nickel One, later joined by Darth Caedus, who had supposedly traveled there to protect them."}, {"tag": "p", "text": "Later the Jedi Coalition responded to the attack on Roche by counter-attacking at Nickel One. Later they were joined by a Confederation fleet and by forces from the Alliance-in-exile under Cha Niathal. However, Admiral Nek Bwua'tu was able to out maneuver them, causing them heavy casualties and bringing victory to the Galactic Alliance."}, {"tag": "p", "text": "Meanwhile, Jaina Solo landed on Nickel One, intending to kill Caedus. Joined by a group of Mandalorian commandos, including Boba Fett's granddaughter, Mirta Gev, Jaina made her way through the asteroid's tunnels, unnoticed by Caedus, who had his attention focused on the presence of Luke Skywalker in the battle above. After the Mandalorians attempted to assassinate the Moff Council, however, Caedus entered the fray, killing all the Mandalorians but Mirta. Jaina and her brother engaged in a duel which resulted in Caedus losing his arm. The duel ended when Jaina was forced to retreat with the rest of the Coalition."}, {"tag": "p", "text": "At the same time, Admiral Atoko and the remains of the Galactic Alliance Fifth Fleet attacked Mandalore in an attempt to take the Mandalorians out of the war. He released a second strain of the nanovirus that wiped out many of the old clones and their descendants."}, {"tag": "h4", "text": "Sith succession"}, {"tag": "p", "text": "As both sides readied for their final confrontation at Shedu Maad, Jacen dispatched Tahiri Veila to discover the location of the Jedi's hidden base. Tahiri captured both Ben and Lon Shevu and tortured the latter in an attempt to make Ben betray the Jedi. However, Shevu died under torture and Ben escaped, knocking Tahiri unconscious in the process."}, {"tag": "p", "text": "However, Jacen had already learned of the location of the base at Shedu Maad. After losing his arm to Jaina on Nickel One, Caedus' blood had been spattered across Jaina's face and neck. Using an arcane Dathomiri Force spell known as a Nightsister Blood Trail, he was able to track his sister to the remote location."}, {"tag": "p", "text": "The Alliance also captured Isolder, father of Tenel Ka and Caedus attempted to torture him into revealing the location of the Jedi's base in the Transitory Mists. However, unknown to Caedus, the Moff Council had taken some of Isolder's DNA to create a nanovirus to attack the Hapan Royal family. When Caedus discovered this he attempted to free Isolder, but Isolder refused to trust him, so Caedus snapped his neck. The nanovirus was released anyway and Caedus had no time to warn Tenel Ka of it."}, {"tag": "h4", "text": "The final battle"}, {"tag": "p", "text": "The Galactic Alliance and the Imperial Remnant attacked the Jedi Coalition at Shedu Maad, in what would prove to be a turning point in the war. Before the battle, members of the Moff Council had finished the nanovirus they had developed from Isolder's DNA and released it on board the Dragon Queen, Tenel Ka's flagship. The resulting outbreak killed most of the crew, since most of the people staffing the Dragon Queen were all related to Isolder in some way. As far the public knew, the Hapan Chume'da Allana also succumbed to the nanovirus, but this was a ploy developed by Tenel Ka. The Queen Mother and Allana both remained unharmed, possibly due to an unexpected warning Tenel Ka received through the Force from Darth Caedus."}, {"tag": "p", "text": "As the battle raged, Ben Skywalker confronted Tahiri Veila on Shedu Maad and persuaded her to surrender to him. Meanwhile, Jaina Solo boarded the Anakin Solo to duel her brother. The resulting duel ended in Caedus's death when he allowed Jaina to strike him down in order to save Tenel Ka and Allana from the Moffs' nanovirus by warning Tenel Ka through the Force of the threat to her and their daughter. Jaina Solo was severely injured in the process and spent several weeks recovering in a medical facility."}, {"tag": "h4", "text": "Victory"}, {"tag": "p", "text": "The Coalition was victorious, with the Imperial Remnant being forced to switch sides and join them and the Confederation surrendering. Jagged Fel was appointed as leader of the reformed Imperial Remnant. The war ended, with former Imperial Admiral Natasi Daala being named the Chief of State of the Galactic Alliance after Admiral Nek Bwua'tu declined the post. Tenel Ka, in order to protect Allana, asked Han and Leia to adopt her, which they did."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although the war was over, the Confederation, Imperial Remnant, and Hapes Consortium refused to join with the Alliance, leading to Daala calling the Unification Summit in 43 ABY in an attempt to unite the galaxy. However, blame for Darth Caedus's power would ultimately be placed on the Jedi, particularly Luke Skywalker, who was placed under arrest and later exiled by Daala."}, {"tag": "p", "text": "Following the end of the war, Jaina Solo believed Jacen had achieved his dream of galactic peace, sacrificing his name, his reputation, and ultimately, his life to do so. But unknown to everyone else, there were other Sith on Korriban, hiding in the shadows, growing in numbers and waiting to strike when the Galaxy would be ready to turn on the Jedi yet again, in 86 years."}, {"tag": "p", "text": "Even though a period of stability was required in order to allow the galaxy to recover, this war erupted, and turned out to be one of the greatest scourges of the last aeon. Although the length of this war paled in comparison to the first Galactic Civil War, this conflict had, in a sense of irony, destroyed the fledgling peace and order throughout the Galaxy in just over a year (40-41.5 ABY), though Chief Daala promised peace throughout the galaxy during her inauguration, that peace was destroyed when Daala and the Jedi Order began to engage in a war of wills, war that was pushed by the military officers who had risen to power after the war and who harbored the ambition to destroy the Jedi. In 44 ABY, peace was destroyed when anti-slavery movements started to rise up around the galaxy, Daala ordered swift and ruthless repression. The Jedi Order turned fully against her to support the rebels."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Second Galactic Civil War spans the entire Star Wars: Legacy of the Force book series. It was introduced in Legacy of the Force: Betrayal by Aaron Allston and ended in Troy Denning's Legacy of the Force: Invincible. The novels show a progression of the war as well as the changing mentalities of the main characters. The Fate of the Jedi novels deal with the aftermath of the war in the years following it, particularly Luke Skywalker's exile. The war was first called the \"Second Galactic Civil War\" in Invincible. The Essential Atlas provided large amounts of information on the war, including portraits of Darth Caedus, Lumiya, Mara Jade Skywalker, Ben Skywalker, Tenel Ka Djo, and Boba Fett, as well as a map and a detailed explanation of the war."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}