{"url": "Second_Mission_to_Coruscant_(Yuuzhan_Vong_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Yuuzhan Vong War", "Category:Missions to Coruscant"], "nodes": [{"tag": "h1", "text": "Second Mission to Coruscant  (Yuuzhan Vong War)"}, {"tag": "p", "text": "In 28 ABY, a second mission to Coruscant during the Yuuzhan Vong War was undertaken by the Jedi Corran Horn and Tahiri Veila to extract the Prophet Yu'shaa."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Finding out that Supreme Overlord Shimraa feared the living planet Zonama Sekot, Nom Anor, as Yu'shaa, wanted to get to the planet. Knowing he couldn't leave Coruscant on his own, he sent a qahsa to the Galactic Alliance. Included in the qahsa was Yu'shaa's plea, Coruscant's planetary defenses, and times Yu'shaa could meet them."}, {"tag": "p", "text": "After receiving the qahsa and some debate, it was decided that Corran Horn and Tahiri Veila would take a Yuuzhan Vong ship to Coruscant and escape with the Prophet."}, {"tag": "h2", "text": "The Mission"}, {"tag": "p", "text": "Being that satellites were falling from Coruscant's orbit daily, Tahiri and Corran were able to enter without detection easily at first. However, the landing was rough, and the ship wouldn't be able to fly again. Knowing that there were many Yuuzhan Vong on patrol, they decided to pilot the ship up a pipe that connected to the lake they landed in."}, {"tag": "p", "text": "After reaching the top, they exited and met up with a Yuuzhan Vong named Kunra and soon Yu'shaa, who explained the situation. A change of plan happened, and the new plan was to infiltrate the shaper damutek, 'kidnap' Nen Yim, and then escape to Zonama Sekot."}, {"tag": "p", "text": "Using a mob of Shamed Ones attacking a gla, a building used for breeding amphistaffs, as a distraction, Corran and Tahiri managed to draw a great deal of warriors away from the entrance to the damutek. Four other Shamed Ones approached the damutek, wearing brown robes and wielding glowing plants, giving the appearance of four Jedi, drawing all but one of the remaining warriors away."}, {"tag": "p", "text": "From inside, Nen Yim paralyzed the damutek with a toxin, stopping any of its defenses from working. She then killed three Yuuzhan Vong while Tahiri and Corran entered, dispatching the rest. Corran and Tahiri proceeded to cut a hole in the wall of the damutek for their Sekotan ship to exit, although three warriors entered. Tahiri took them on, with one managing to bite her with his amphistaff. Weakened, Corran saved her, and then took her into the ship."}, {"tag": "p", "text": "Leaving the damutek, they landed beside a shrine and picked up Yu'shaa, along with another Yuuzhan Vong, Harrar. Although not part of the original plan, he was allowed to come along. After being pursued by coral skippers, Corran took over flying the ship. Finding out that the ship had no weapons, Corran's only option was to run, and after tense flying, escaped."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}