{"url": "Second_battle_of_Leritor", "categories": ["Category:Legends articles", "Category:Battles in the Yucrales sector", "Category:Battles of the Galactic War"], "nodes": [{"tag": "h1", "text": "Second battle of Leritor"}, {"tag": "p", "text": "During the renewed war between the Sith Empire and the Galactic Republic, a three-way battle occurred above the mineral-rich planet Leritor in 3640 BBY. After losing control of Leritor in a previous engagement, the Sith Lord Darth Gravus led a fleet to the planet and engaged the Republic Navy there, leading the battle from the helm of his Harrower-class dreadnought Exemplar. However, the prototype battlecruiser Ascendant Spear arrived in the system under the command of Darth Karrid, Gravus' rival in the competition for a seat on the Empire's ruling Dark Council, and the elder Human ordered his fleet to attack the Falleen in order to eliminate the threat she posed. Gravus' decision allowed the Republic fleet to tear apart his own, and the Ascendant Spear wiped out both fleets after the Exemplar struck the first blow. With the death of Gravus at the end of the battle, Karrid ascended to the head of the Sphere of Technology and became a Dark Councilor."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3640 BBY, not long after the Sith Lord Darth Gravus successfully conquered the planet Taris during the Galactic War between the Galactic Republic and the Sith Empire, Gravus lost control of the mineral-rich Mid Rim world of Leritor. Determined to reclaim the planet and secure his place on the Dark Council and at the head of the Sphere of Technology, Gravus gathered a fleet of three Terminus-class destroyers and eighteen Fury-class Imperial interceptors to complement his Harrower-class dreadnought Exemplar in an attack."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Under Gravus' command, the fleet entered the Leritor system and began to engage the Republic fleet, which was led by the Valor-class cruiser Mardorus. The cruiser was supported by two Hammerhead-class cruisers, three Thranta-class corvettes, and six BT-7 Thunderclaps served as the fleet's light attack craft. Upon arriving in the system, Gravus deployed the destroyers to engage the corvettes and Thunderclaps, while the Exemplar remained at long range and the Fury-class interceptors strafed the Mardorus and the Hammerheads. However, not long into the battle, Gravus' rival in the competition for the Council seat Darth Karrid arrived in the Ascendant Spear—a powerful prototype warship that was controlled by the Sith Lord through a combination of Sith alchemy and cybernetic implants. Karrid hailed her rival as she began to approach the battle and offered her aid, but Gravus refused her offer. One of the Hammerheads disengaged from the main battle and began to attack the Spear with two of the BT-7 Thunderclaps, but Karrid easily destroyed the two fighters and then the corvette."}, {"tag": "p", "text": "This infuriated Darth Gravus, who ordered the Exemplar and the rest of his fleet to change targets and attack the Spear. The interceptors abandoned their attacks on the Mardorus and the remaining Hammerhead as the Terminus-class destroyers ceased the assaults on the Thranta-class corvettes to attack the Spear, and the Republic took advantage of the Imperials' confusion to quickly wipe out seven interceptors and pummel the retreating destroyers with turbolaser fire. Karrid then drove the Spear through the heart of the battle, surprising both fleets as the massive capital ship began to engage them at close range and causing the entire theater to dissolve into chaos. A Thranta-class corvette and two Thunderclaps attempted to stop the Spear when it engaged the Mardorus, and eight interceptors defended the damaged Imperial destroyers from the rest of the Republic fleet while the remaining three tried to attack the Spear and the last Hammerhead engaged the fleeing Exemplar. The Republic's efforts were in vain, however, as the Spear destroyed the Mardorus in a matter of seconds, but Gravus decided to take advantage of Karrid's preoccupation by firing on his rival."}, {"tag": "p", "text": "With Gravus' attack, Karrid was then able to engage the Imperial ships without fear of a reprisal from the Dark Council, and she quickly destroyed the Republic starfighters attacking the Spear before turning to the Imperials. The Exemplar was forced to abandon the assault on the Spear when the pursuing Hammerhead caught up to it, and Karrid destroyed two of the attacking interceptors while the Republic corvettes destroyed one of the Imperial destroyers. She then caused the Spear to bank at a nearly impossible angle so that the remaining interceptors crashed into the ship's hull, and the Sith Lord quickly wiped out the remaining interceptors before turning the Spear's weapons on the corvettes and destroyers. The Hammerhead attacking the Exemplar was the last Republic ship to fall, giving Gravus the breathing room to try and jump to hyperspace—but a calculated strike from Karrid knocked out her rival's engines. Ignoring his attempt to contact her, Karrid destroyed the Exemplar and transferred command back to Moff Gelmid Lorman so that she could rest."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the death of Darth Gravus, Karrid was the only remaining candidate for the Dark Council seat, and the Council met several hours later in their chambers beneath the Imperial Citadel on the capital of Dromund Kaas to review the battle. Even though they recognized Karrid's subterfuge in killing Gravus, the other members of the Council accepted Darth Marr's proposal that she be rewarded with the position. Analysis by Davidge, the Imperial Minister of Logistics, showed that the loss of the Imperial fleet outweighed the resources that the Empire gained from controlling Leritor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The second battle over Leritor appears in Chapter 8 of The Old Republic: Annihilation, a 2012 novel by Drew Karpyshyn written as a tie-in to the video game Star Wars: The Old Republic. The battle features inaccurate names of several Republic and Imperial ship classes but the descriptions of the ships was enough to identify them correctly. The Valor-class cruiser Mardorus was referred to as a \"D-class attack cruiser\", the Thranta-class corvettes as \"CR-12 corvettes\", and the three Terminus-class destroyers as \"C-class destroyers\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}