{"url": "Second_Raid_on_Daiman%27s_compound", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Chelloa", "Category:Battles of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Second Raid on Daiman's compound"}, {"tag": "p", "text": "The Second Raid on Daiman's compound was a mission in 1032 BBY by the Jedi Knight Kerra Holt to rescue former Jedi Gorlan Palladane from Sith Lord Daiman's compound during the Chelloa campaign."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Following Operation Influx, Lord Daiman ordered an investigation to discover who supplied the Jedi Order and his rival Sith Lord Odion with intelligence on Chelloa's baradium mining operations. His soldiers captured the Rodian mechanic Skodo and discovered a transmitter which they substituted for one of Daiman's, hoping to catch any accomplices. He then had Skodo tortured to death with Force lightning. However, one of the Jedi survivors of the ill-fated Operation Influx—Kerra Holt—infiltrated Daiman's compound on the mountains above Jenith. She then dueled with him, imprisoning him in a force field."}, {"tag": "p", "text": "However, Daiman tricked her into going after Odion to reveal \"intelligence\" about his new mobile munitions complexes. Daiman intended to lure Odion down to Chelloa where he and his forces would be destroyed by the fake munitions complexes—actually world-destroying Kinetic corruptors. Still angered by the fact that the Chelloan people had harbored a Jedi agent, he had the Chelloan leader Gorlan Palladane apprehended and tortured. Palladane had early been caught in a sting operation attempting to contact Odion with the substitute transmitter. In retaliation, Daiman ordered the destruction of the town of Jenith. During the massacre, Palladane's family was rescued by Kerra Holt who then proceeded to rescue Gorlan Palladane from Daimanate captivity."}, {"tag": "h3", "text": "Infiltration"}, {"tag": "p", "text": "She hitch-hiked aboard a shuttle carrying the village leaders of the Chelloan mining towns, who had been summoned for an audience with Daiman. Upon landing at a docking hangar, Holt emerged from her hiding place near the engine consoles and killed the Daimanate Sith troopers guarding the prisoners. Having freed the prisoners, she instructed them to move the transport to the outer wall. If Daiman returned, she instructed to leave without her and Palladane and to make for a safehouse in the town of Arboth."}, {"tag": "p", "text": "Dispatching several Correctors, Holt made her way to Palladane's cell where she freed him from his manacles. A sorrowful and wounded Palladane confessed to contacting Odion, indirectly causing the deaths of Vannar Treece during the ill-fated Operation Influx. He explained that he and Skodo had used a transmitter to reactivated a single interstellar routing station. However, he was unaware that Odion had been tapping into the signals. He then explained he had only contacted Odion to dissuade the Sith Lord from returning to Chelloa. Seeing the good motives behind his actions, Holt comforted Palladane by telling him that he had done his best to protect his people."}, {"tag": "p", "text": "They then returned to the shuttle and departed Daiman's compound. He was not present at the hangar since he was inspecting his palace. Before she left, Holt realized that her primary mission from Treece was not to destroy the two Sith Lords but rather to evacuate the Chelloan people. As a final gesture of defiance to Daiman, she beheaded all his statues. When Daiman returned with more reinforcements, he ordered his troops to prepare for Odion's invasion and to coat his replacement statues with cortosis plating."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Following the raid on Daiman's compound, his brother Odion launched a planetary invasion of Chelloa. Despite wiping out Daiman's token resistance, Odion quickly discovered that he and his forces had landed themselves into a trap. Daiman's vaunted factory carriers turned out to be kinetic corruptors, large machines capable of generating destructive explosions. In the midst of the chaos, Kerra and Gorlan evacuated thousands of Chelloan civilians on the Freedom Fleet, a fleet of commandeered freighters. During the fighting, Odion was grievously wounded and vowed revenge against both Kerra and Daiman."}, {"tag": "h2", "text": "Appearances"}]}