{"url": "Second_attack_on_the_Son-tuul_Pride", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Outer Rim"], "nodes": [{"tag": "h1", "text": "Second attack on the Son-tuul Pride"}, {"tag": "p", "text": "Shortly after the infiltration of Hivebase-1, the Galactic Empire launched an attack on the Son-tuul Pride, led by Lieutenant-Inspector Magna Tolvan. The entirety of the mercenaries there were either killed or captured except for their leader 0-0-0 and his assailant BT-1 who pretended to be innocent droids caught in the crossfire. Tolvan then had Chelli Lona Aphra and Dek-Nil taken away to Accresker Jail."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Sometime after the Battle of Yavin, Chelli Lona Aphra and her crew were hired to find the long lost memories of the Son-tuul Pride's leader, 0-0-0. They successfully infiltrated and destroyed the R&D hub of the Tarkin Initiative, Hivebase-1, to obtain it and Aphra returned to 0-0-0 soon after. 0-0-0 was delighted of her success. However he decided to taunt Aphra about her decisions to double cross her allies. Aphra tried to deny it but she gave in and 0-0-0 told her that love was murder."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "As he began to leave the Son-tuul Pride audience room, 0-0-0 ordered his men to kill Aphra. However, the wall in front of him exploded and an overwhelming force of stormtroopers began gunning down 0-0-0's men, backed by three All Terrain Scout Transports. At the rear of them was Lieutenant-Inspector Magna Tolvan, who had tracked Aphra to Son-tuul. She ordered the stormtroopers to kill anyone with a weapon and seize the rest. 0-0-0 and his assailant, BT-1, scurried past the stormtroopers, claiming to be innocent droids, and escaped."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The battle ended soon after, with the surviving of 0-0-0's men being arrested. Tolvan ordered the deaths of their ring leaders. A stormtrooper then brought Aphra to her and Tolvan had Aphra put in Shuttle Six, under the name \"Joystick Chevron,\" to be taken to Accresker Jail. There, Aphra was forced to serve in their convict legion. She attempted to escape twice, failing both times, and after Accresker command discovered a sentient fungus was in the prison, They had it decommissioned."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}