{"url": "Second_battle_of_Korriban", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Great Hyperspace War", "Category:Battles of Korriban"], "nodes": [{"tag": "h1", "text": "Second battle of Korriban"}, {"tag": "p", "text": "A battle was fought over Korriban during the Great Hyperspace War between the battered and diminished forces of Dark Lord of the Sith Naga Sadow and the forces of Koros system leader Empress Teta, who had followed her adversaries to the worlds of the Sith Empire. Fought immediately after Sadow's defeat of his old rival, Ludo Kressh, in a previous clash at Korriban, the battle was the final engagement in the war. The forces of Empress Teta, motivated by revenge for the harm done to their worlds in the Great Hyperspace War, overpowered the Sith. Eventually, Sadow found himself without any defenses aboard his flagship, the Corsair, and was forced to fake his death and flee to the faraway moon of Yavin 4 by way of the Denarii Nova, where he used the dark side of the Force to both destroy his pursuers and cover up his tracks. Sith Lord Shar Dakhan then took over command of the Sith force, ordering suicide attacks by the remaining ships as a last resort. However, the Koros forces prevailed, and the Great Hyperspace War was ended."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 5000 BBY, Dark Lord of the Sith Naga Sadow gathered an invasion force and launched an attack on the Galactic Republic. The Great Hyperspace War, as it would be called, consisted of a three-pronged attack on Coruscant—the capital of the Republic and the heart of the government—and the planets Kirrek and Koros Major, both located in the Deep Core Koros system. However, Sadow was betrayed by his Sith apprentice and one of his top commanders, Gav Daragon, a native of Koros Major, who was appalled at the destruction done to his home."}, {"tag": "p", "text": "Daragon's attack on Sadow led to Sith defeats at Coruscant, Kirrek, and Koros Major, all but ending any hope of Sith conquest. Sadow was subsequently defeated again in the Battle at Primus Goluud, where the remnants of his battered fleet were nearly wiped out by a military force under the command of Empress Teta, the ruler of the Koros system. Sadow activated a secret weapon to trigger the red giant star Primus Goluud's solar flares, killing Daragon, but not before he gave Teta's forces, which included his sister, Jori Daragon, the location of the Sith Empire."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Upon returning to the Sith Empire, Sadow found himself near the Sith mausoleum world of Korriban, where he was quickly attacked by his old rival, Ludo Kressh. Although Sadow was victorious, his fleet was diminished further by Kressh. Sadow was given no time to rest, however, as Teta and her forces arrived out of hyperspace and immediately commenced the battle. Sadow fought back with wild abandon, but the Koros forces, with numbers on their side and fueled by Teta's rhetoric, were too much for the Sith to overcome."}, {"tag": "p", "text": "Jori Daragon herself took the controls of a Koros starfighter, and, looking to avenge the death of her brother, Gav, caused the destruction of several Sith starfighters. Individual dogfights between starfighters dotted the scene of the battle, and laser fire focused on the Sith capital ships worked to great effect. Aboard Sadow's flagship, the Corsair, chaos reigned, as Sadow had found himself with weapons spent and systems failing. Desperate, Sadow set course for the Denarii Nova, using the dark side of the Force to destroy the system and any pursuing Koros soldiers. Teta declared victory, despite Sadow's escape. Back over Korriban, Sith Lord Shar Dakhan, former commander of the Sith forces on Coruscant, took over the hopeless situation as acting Dark Lord. Seeing that surrender was their only option, Dakhan ordered suicide attacks on the Republic forces, a tactic which worked for a time. However, the Sith were finally defeated."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the Sith defeat in the Second Battle of Korriban, the Koros and Republic forces left Sith Space. Later, the Supreme Chancellor Pultimo ordered a full scale invasion of Sith space, with the Jedi Order and Republic forces invading Sith space to seek out remaining Sith strongholds and artifacts and destroy them, resulting in the fall of the Sith Empire."}, {"tag": "p", "text": "Naga Sadow, having survived the conflagration, fled to the faraway moon of Yavin 4, where he struggled to rebuild his former glory. Some Sith Lords disappeared to strongholds on planets such as Vjun and Thule, and the name of Sith did not return to the galaxy at large until a thousand years later. One Sith survivor and his armada, along with his most trusted Lords, fled the crumbling empire and after twenty years of random hyperspace jumps in desperation to avoid the Republic, he and his armada eventually came across the forgotten planet of Dromund Kaas and established himself as the Sith Emperor. There, he performed dark rituals, altering the planet's ionosphere into an electrical storm and prolonging his own life. He re-built the Sith forces there on Dromund Kaas and bid his time, until he launched a surprise attack against the Republic, a conflict known as the Great Galactic War between 3681 BBY and 3653 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The second battle to occur over Korriban during the Great Hyperspace War originally occurred in Tales of the Jedi: The Fall of the Sith Empire, a story arc of the comic book series Star Wars: Tales of the Jedi, written by Kevin J. Anderson and released in 1997. The battle occurs in the arc's fifth and final issue, End of an Empire. In this appearance, it was illustrated by Dario Carrasco, Jr. The 2000 reference book The Essential Chronology described the Republic forces as arriving during Sadow and Kressh's battle, in contradiction to the events portrayed in Tales of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}