{"url": "Second_Sister", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Females", "Category:Humans", "Category:Inquisitors", "Category:Jedi trainees of the Jedi Order", "Category:Pilots", "Category:Sith acolytes and apprentices"], "nodes": [{"tag": "h1", "text": "Second Sister"}, {"tag": "p", "text": "The Second Sister, formerly known as Trilla Suduri, was a Force-sensitive human female who served in the Inquisitorius during the reign of the Galactic Empire. Trained in the Jedi arts, the Second Sister was an expert lightsaber duelist and one of the Empire's deadliest Jedi hunters. However, Suduri's strongest asset was her brilliant intellect, being able to anticipate the behavior of her prey."}, {"tag": "p", "text": "The Second Sister was once a Jedi who learned the ways of the Force under the Jedi Knight Cere Junda. In the aftermath of the Clone Wars, Suduri and Junda sought to hide from the newly-risen Empire while protecting a group of Jedi younglings. Ultimately, both Master and Padawan were captured and subjected to torture, allowing the dark side of the Force to transform Suduri into the Second Sister. Having forsaken her former identity and the Jedi way, the Second Sister was a relentless Inquisitor dedicated to destroying the last remnants of the Jedi Order. An ambitious and cruel woman, she sadistically toyed with her prey and desired to win the approval of Emperor Palpatine."}, {"tag": "p", "text": "In 14 BBY, the Second Sister tracked the Jedi fugitive Cal Kestis to the planet Bracca. Kestis managed to escape from the Inquisitors with the help of Junda, however. As a result, the Second Sister hunted the two Jedi across the galaxy, confronting Kestis on Zeffo and later Bogano. When the Second Sister acquired a holocron containing the list of Force-sensitive younglings, Kestis followed her to the Inquisitorius headquarters on Nur and defeated the Second Sister in a lightsaber duel, giving Junda a chance to make amends with her fallen apprentice. Their reconciliation was cut short by the arrival of the Sith Lord Darth Vader, who executed the Second Sister for her failure. Before her death, the Second Sister told Kestis and Junda to avenge them all."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Capture and fall"}, {"tag": "p", "text": "Before the end of the Clone Wars, Trilla Suduri was taken as a Padawan by Jedi Knight Cere Junda. The pair served alongside clone troopers until the end of the war when the Jedi Order was wiped out by the implementation of Order 66, and escaped along with a group of younglings. Suduri and her master's luck would quickly run out as their hiding place was discovered by an Imperial patrol soon after the start of the Great Jedi Purge. During the Empire's attack, Suduri insisted that she and her master should stick together, but Junda decided to attempt to lead the Imperials away from their position. As her master ran to confront the enemy, Suduri begged her not to leave them. After Junda left, Suduri comforted one of the younglings."}, {"tag": "p", "text": "While Junda would succeed in leading the Imperials away, she would eventually be captured. During her imprisonment at Fortress Inquisitorius on Nur, Junda was subjected to torture by her captors and would eventually reveal the location of Suduri and the younglings. Suduri would soon be captured and subjected to the same torture as her master. Gradually, the torture, along with her master's betrayal, wore Suduri down and she succumbed to the dark side, becoming an Inquisitor known as the Second Sister. When Junda witnessed her former Padawan in Imperial garb, she flew into a rage and used the dark side to kill everyone in the room but the Second Sister, escaping after."}, {"tag": "p", "text": "In 14 BBY, the Second Sister was present at the Inquisitorius Headquarters alongside the Grand Inquisitor, Seventh Sister, Fifth Brother, Eighth Brother, a red-skinned Inquisitor and a Twi'lek Inquisitor. She stood beside a table where two of the Inquisitors toasted with Dust Juice to the death of Eeth Koth during their recent mission as they began discussing what Darth Vader would do after all the Jedi were dead."}, {"tag": "h3", "text": "Hunting Cal Kestis"}, {"tag": "h4", "text": "First encounter on Bracca"}, {"tag": "p", "text": "Sometime later, the Second Sister traveled to planet Bracca with the Ninth Sister and some Purge Troopers in search of a possible Jedi. Halting a train carrying members of the Scrapper Guild, she had the passengers rounded up, and ordered them to hand over a possible Jedi under the threat of having the entire Guild summarily executed. As Purge Troopers took aim at the scrappers, an Abednedo named Prauf defiantly spoke out, confronting and shaming the Empire as a whole for overworking the Scrapper Guild. The Second Sister in response then executed Prauf, and his friend, Cal Kestis, reacted by trying to cut her down with his lightsaber, revealing himself as the Jedi. She blocked Kestis' attack with her double-bladed spinning lightsaber and lifted him with the Force, throwing him over to the Ninth Sister, who then dropped him off the ledge."}, {"tag": "p", "text": "The Jedi survived the fall, landing onto a train. While he fought his way towards the front carriage, Cere Junda arrived aboard the Stinger Mantis to extract him. When the Jedi attempted to board the Mantis, the Second Sister shot at the ship from her TIE/IN interceptor. The Jedi fell onto a platform, where the Second Sister then landed her TIE to confront him. From his stance, she identified that he had underwent training and questioned his master. The two briefly fought, until the Mantis returned, shooting at them and separating the two. The Jedi limped onto the ship as Junda shot at the Second Sister until the door closed. The Second Sister then latched onto the cockpit window and used the Force to alter the steering. Junda, however, took back control of this and the Second Sister was shaken off the window, allowing the Mantis to escape."}, {"tag": "h4", "text": "Duel on Zeffo"}, {"tag": "p", "text": "Since her first encounter with the Jedi, the Second Sister discovered him to be Cal Kestis, the apprentice of Jaro Tapal. She also learned that his intentions were now linked with Junda's master, Eno Cordova, and his holocron containing the locations of Force-sensitive children. After Kestis fought on Kashyyyk with Saw Gerrera's insurgent force, the Partisans. When the Empire took back the Imperial Refinery there, Gerrera retreated, but the Second Sister was able to confront one of his insurgents. She questioned the insurgent, before killing her. Prior to Kashyyyk, Kestis was investigating ancient ruins on the planet Zeffo, which prompted the Empire to reinstate its excavations there. The Second Sister predicted Kestis would return to find out more, and awaited his arrival near the Tomb of Miktrull."}, {"tag": "p", "text": "When Kestis found her, the Second Sister revealed her knowledge of him and his intentions, asking where Cordova's holocron was. The pair initiated a duel that ended in the Second Sister pushing him to the ground. Cal's droid, BD-1, then activated a shield that separated the two. The Second Sister commended his learning, comparing him to Junda's last apprentice (herself). After talking more of Junda and her apprentice, she removed her helmet, revealing that she was that apprentice. Kestis wished to resist her manipulation, but the Second Sister coined the possibility of Junda selling him out like she did to her and told him that Junda had used the Dark Side. Continuing to predict Junda's betrayal of him, the Second Sister also brought up Cal's master, Tapal, and proceeded to anger Kestis who said he would protect the force sensitive on that list Trilla said once held that view too before departing the scene."}, {"tag": "p", "text": "As Kestis continued towards the Tomb of Miktrull, he attempted to contact Junda when the Second Sister sliced and rerouted his communications, claiming that she had perfected all of Junda's techniques. She claimed that she had acquired an artifact at the rear of the tomb, and taunted Kestis, speculating Cordova's intentions with the Zeffo. As she continued to taunt him, she sent Purge Troopers after Kestis, all of which he defeated. After Kestis raised the tomb from the floor of a chamber and examined it, the Second Sister thanked him for clearing the way, revealing that she had deceived him to find the tomb. Kestis had BD-1 reverse her slicing of his comms and encrypt it."}, {"tag": "h3", "text": "Mission to Ontotho"}, {"tag": "h4", "text": "Joining the battle"}, {"tag": "p", "text": "The Second Sister, alongside a number of Purge Troopers, traveled to the world of Ontotho after rumors of the presence of a Jedi there arose. Upon her arrival in the midst of a battle, she demanded a report of the conflict, yet her identity was questioned by Stormtrooper Commander Atty, to which she told him she was a person who did not ask things twice. Despite Atty insisting that they had the situation under control, the Second Sister merely informed him that she would not be there if he was correct, and addressed the rumors that had brought her there, rumors of an unusual foe."}, {"tag": "p", "text": "Atty once again dismissed the idea, saying that a trooper had thought he had seen a lightsaber yet since the trooper had died days ago, the story had taken a mind of its own. The Second Sister did not share Atty's view of the situation, and informed him that she wished to meet their enemy herself, ordering Atty to have his men cease fire, before surging forwards with her Purge Troopers. They were fired upon, prompting the Second Sister to ignite her lightsaber to repel enemy fire, before ordering her Purge Troopers to return fire, spread out, and capture her one of the attackers alive."}, {"tag": "h4", "text": "The fake Jedi"}, {"tag": "p", "text": "The Second Sister soon noticed that the enemy had stopped firing, and when questioned by a Purge Trooper on whether they should pursue, the Inquisitor dismissed the idea, saying she thinks that their foe would come to them instead. The Second Sister then moved again, noticing an individual wielding a lightsaber. She ordered her troops to secure the area, and declared that the individual was her target, before attacking. The Second Sister then engaged in a lightsaber battle against an apparent Jedi. As they fought, the Second Sister quickly gained the upper hand in the fight, even mocking her adversary by calling her too slow and too soft."}, {"tag": "p", "text": "Forcing her opponent back into a corner, the Second Sister told her that the Force had abandoned her, only for her opponent to attack her with a blaster, which was easily deflected off the Second Sister's armor, yet made the Inquisitor realize that the old woman was no Jedi. The Second Sister then slashed out with her lightsaber, and severed the woman's arm, before torturing her, demanding to know where an insurgent like her had got a lightsaber. The woman revealed the weapon was taken from a temple, but before the Second Sister could question her prey further, she was interrupted by a Purge Trooper, who reported that the area was secure per their orders, as the Insurgent Cell was smaller than expected. Not getting any further information from the old woman, who declared they would never find the temple, the Second Sister killed her, and ordered that any other insurgents found be brought to her, and that she would find the temple herself."}, {"tag": "h4", "text": "Investigating the temple"}, {"tag": "p", "text": "The Second Sister later saw to the attack on a village during her search for the temple. When she arrived at the village, she questioned the Purge Trooper Captain on whether the people of the village were still fighting back. When the Captain confirmed that they were, the Second Sister informed him that that meant that they knew something, and was keeping it from them. When the Captain declared that they had found nothing, the Second Sister merely used the Force to expose a stairway leading underground, stating that they just didn't look hard enough."}, {"tag": "p", "text": "Arriving at the entrance of the temple, the Second Sister told her troopers that only two of them would accompany her. As they entered, she questioned what the locals had been keeping from them in the temple. She began examining the writing on the walls when one of the Purge Troopers identified a droid in the rubble. The Second Sister reactivated it and it continued a sentence stating that someone had gotten everyone killed. When she asked who it was talking about, it said the Jedi had caused all of it."}, {"tag": "p", "text": "One of the Purge troopers informed the Second Sister that the Jedi had been to the temple before. When he asked what had happened at the temple, she replied that it was impossible to say but acknowledged the temple's importance to the locals. The droid that she had questioned began to shut down due to low power. Finding a datapad in its hand, the Second Sister realized that it had belonged to Eno Cordova. Seeing that its last entry was incomplete, she ordered her troopers to prepare to depart for the planet Bogano."}, {"tag": "h3", "text": "Final duels and death"}, {"tag": "p", "text": "After Kestis recovered the key to recovering the holocron, he traveled to Bogano to retrieve it from a vault. The Second Sister, however, found him there, and confronted Kestis after he uncovered the holocron. In their exchange of words, Kestis told the Second Sister that she made a mistake not killing him on Bracca. She bragged that she had only wagered him against finding the holocron and winning the favor of the Emperor. After she proceeded to taunt him, the two fought each other. During their duel, Kestis was able to push the Second Sister to the ground and take her lightsaber. The lightsaber, though, caused him to view the Second Sister's past, and she grabbed the holocron and fled."}, {"tag": "p", "text": "The Second Sister took the holocron to Fortress Inquisitorius. Junda knew she would take it there and she and her crew traveled to Nur to retrieve the holocron. The Stinger Mantis was able to pass the Imperial blockade unnoticed and Kestis and Junda used escape pods to reach the surface, infiltrating the fortress and killing many troops. As Kestis made it to the interrogation room to take back the holocron, the Second Sister ambushed him, and the pair fought once again. Kestis said that he saw the suffering she had been through, telling her it was not too late to let go of her hate. The Second Sister refused by claiming the pain made her stronger and taunting him with the holocron."}, {"tag": "p", "text": "As the two continued to fight, Kestis disarmed the Second Sister, leaving her vulnerable. Junda then arrived and approached the Second Sister, wishing to redeem her old Padawan, although the Inquisitor insisted that it was too late. Junda didn't believe it was and apologized to her for all of the pain she had caused her. Feeling ashamed, the Second Sister told her how much hate she carried against her. Before she could forgive her, she sensed the arrival of Darth Vader, who used the Force to hold her. Unable to break free, she told Junda and Kestis to \"avenge us\" before Vader, who was unforgiving of the Second Sister's inability to complete her mission in hunting Kestis, activated his lightsaber and executed her."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In the years following the fall of the Galactic Empire, Jedi Master Luke Skywalker traveled the galaxy to rediscover the history of the Jedi Order that had been suppressed by the Empire. In his search for knowledge, Skywalker became aware of the Second Sister's existence. During his self-imposed exile on Ahch-To, Skywalker wrote a book he titled The Secrets of the Jedi, which chronicled the information he had learnt on his travels. The Second Sister was one of several Inquisitors who were depicted in the book as illustrations, alongside information pertaining to the Inquisitorius."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Trilla Suduri was a tall, slender human female with dark skin, blue-green eyes and sleek black hair. During her time as a Padawan, she was kind and compassionate, caring for her master and the younglings under her protection."}, {"tag": "p", "text": "However, after her master's betrayal and her torture at the hands of the Galactic Empire, her personality became twisted.[source?] As the Second Sister, she was cruel and ambitious, relishing in hunting down all Force-sensitive survivors for the Empire. She was an exceptionally cunning and intelligent individual. Her sociopathic tendencies allowed her to patiently manipulate almost any adversary into revealing their weakness and fears. While she was known to sadistically toy with her opponents, an extension of her manipulative abilities, she was also quite arrogant, bragging to Kestis that there was no technique Cere Junda had at her disposal that she hadn't perfected. However, despite her intimidating posture, she showed an immense fear of Darth Vader, and was seen visibly trembling when he appeared behind her just before her execution at his hand."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Second Sister was an expert lightsaber duelist and adept with the dark side of the Force. She could use Force Dash to great effect in battle, and also utilized Force drain during her duel with Kestis on Nur, though her greatest weapon was her preternatural ability to predict the behavior of her prey. She was capable of telekinetic techniques such as Force push and Force pulse. She could also slow her fall. She was also proficient at saber throw, being capable of throwing it multiple times in a row and make it to temporarly orbit around her. During her time as Cere Junda's Padawan, Trilla was taught how to slice by her master. The Second Sister demonstrated her slicing proficiency when she managed to easily reroute Cal Kestis' comm signal that had initially been connected to Junda on the Stinger Mantis."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The Second Sister was equipped with a helmet and wore a personalized version of the standard gray and black Inquisitor attire. She also had a black cape with an Imperial crest in white on the shoulder portions. She was armed with a double-bladed spinning lightsaber. After losing her lightsaber to Cal Kestis after their third encounter, the Second Sister replaced it with an identical one. During the duel on Nur, she used flash grenades."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Second Sister was created for the 2019 video game Star Wars Jedi: Fallen Order. She first appeared in Darth Vader: Dark Lord of the Sith 19, a comic book written by Charles Soule, penciled by Giuseppe Camuncoli and released on August 8, 2018. She was later identified in the 2018 reference book Star Wars: The Dark Side, written by Tricia Barr. The Second Sister was later identified as Trilla Suduri in Star Wars Jedi: Fallen Order, in which she is voiced by Elizabeth Grullon. Grullon started motion-capturing the role in October 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}