{"url": "Secret_Weapons", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Secret Weapons"}, {"tag": "p", "text": "\"Secret Weapons\" is the tenth episode of the Star Wars: The Clone Wars television series' fifth season. It first aired on December 1, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"R2-D2 is part of a team of Republic droids chosen for an important mission led by the diminutive Colonel Gascon to obtain an encryption module from a Separatist dreadnought. The droids must overcome numerous challenging obstacles to succeed in this crucial assignment.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Jedi High Council has devised a plan to capture a Separatist decoding module from within the vault of an enemy battleship. Since the mission involves a special level of infiltration capability, the Council has decided to employ a team of handpicked droids for the undertaking. Thus, several Republican droids are assembled in the Jedi Temple war room: the astromech droids R2-D2, QT-KT, M5-BZ, and U9-C4, as well as WAC-47, an overenthusiastic and bumbling pit droid who promptly arrives late for the mission briefing by Master Windu because of a hearing mistake and thus does nothing to garner much confidence from the others."}, {"tag": "p", "text": "The mission is to be led by the diminutive Colonel Meebur Gascon, a highly esteemed strategist for the Grand Army of the Republic. Gascon, whose strict and no-nonsense attitude immediately is off to a wrong start with WAC's flippancy, wastes no time going through the finer details of the plan and takes the droid to see the technician Dr. Gubacher, who outfits most of the droids with special gadgets for the mission. WAC, however, is exempted because he is to take the role of the pilot for the team, while M5-BZ has his memory core is removed so that Gascon can use him as a disguise and rolling command platform."}, {"tag": "p", "text": "As the mission begins, WAC over-confidently decides to take matters in his own hands by setting their transport shuttle on a collision course with their targeted ship in order to attract its attention. The result of this maneuver gathers a bit more attention than necessary, as the shuttle is taken in by a tractor beam and the dreadnought's droid crew proceeds to cart off the astromechs off for interrogation. The droids, however, manage to overpower their guards and sneak away to initiate the next step of their mission by having C4 cause a temporary power outage to circumvent the security settings at the decoding module vault, and WAC successfully manages to dupe to the droid guards stationed outside the vault."}, {"tag": "p", "text": "But when Gascon attempts to open the vault door, he accidentally inserts M5's tools into a power outlet, causing the astromech to suffer an enormous electric shock. Gascon then unexpectedly appears unsure about what to do next, and under WAC's questioning, he reluctantly reveals that while he does have a reputation for being a tactical analyst, he has no real field experience whatsoever and that he sees this mission as an opportunity to promote himself. Upon WAC's challenge to treat his team with more respect, Gascon and the droids finally find a common ground and make a truce to see the mission succeed."}, {"tag": "p", "text": "The droids manage to disable the security measures within the vault itself and penetrate to the module storage chamber. However, their undertakings have caught the attention of the ship's droid commander, Aut-O, who arrives on the scene with an escort of battle droids to investigate. But R2, who conveniently stands near a control pad for the chamber's artificial gravity, promptly turns it off, causing all the droids to float helplessly around. This gives the droid team the opportunity to finish off the battle droids; Aut-O still remains functional and attempts his best to thwart them, but by cooperating, Gascon, WAC and R2 manage to put him out of commission as well. Aut-O still manages to sound the general alert before he deactivates, forcing the team to evacuate immediately. At first eager to leave to prevent their capture, Gascon consents to his team's wish to take the damaged M5 with them, and amidst the hubbub the alarm has caused, Gascon and his droid team manage to slip away with the decoding module in their possession and a newfound appreciation for each other."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "\"Secret Weapons\" was originally reported by Star Wars Insider 137 as the ninth episode of Season Five, but this was later revised to \"A Necessary Bond.\""}, {"tag": "p", "text": "The opening logo for the episode, traditionally colored yellow, was rendered blue to salute R2-D2. The following three episodes—\"A Sunny Day in the Void,\" \"Missing in Action,\" and \"Point of No Return,\" which are part of the same arc—also feature this blue opening logo. This is not the first time the logo changed color: In Season 4's last two episodes (\"Brothers\" and \"Revenge\"), the logo was red, on account of the return of Darth Maul."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}