{"url": "Secret_Agent_Droids,_Part_2", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2017) backup stories"], "nodes": [{"tag": "h1", "text": "Secret Agent Droids, Part 2"}, {"tag": "p", "text": "\"Secret Agent Droids, Part 2\" is a comic story featuring C-3PO, BB-8 and R2-D2. The story was written by Michael Moreci, illustrated by Tony Fleecs, and published in Star Wars Adventures 28 on November 27, 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the planet Garel, Likana was examining Director Orlok \"Gamemaster\" with her electrobinoculars. Orlok was incharge of the communications technology on the planet. C-3PO still did not understand how they were going to destroy the communications tower, but Likana did not plan to destroy the tower. Orlok planned to bring the tower online from a space station orbiting the Garel. If bought online, all communications would be controlled by the First Order and the Order would be able to spread their power across The galaxy. Likana planned to get inside the tower to sabotage it and prevent it from working. She employed R2-D2 and BB-8 to provide a distraction for them."}, {"tag": "p", "text": "At the base of the tower two First Order Stormtroopers were on guard when R2-D2 and BB-8 began to fight each other to cause a distraction. The droids then attacked the stormtroopers and chased them away from the tower. C-3PO and Likana then moved in and got inside the tower."}, {"tag": "p", "text": "When they got to the elevator, many First Order personnel were waiting to use. Liakana then grabbed a nearby mouse droid and reprogrammed it to ram itself into a wall, causing an explosion. The First Order personnel then retreated and sounded the emergency alarm."}, {"tag": "p", "text": "C-3PO and Likana reached the top of the tower and she began her work. C-3PO tried to get her to move faster. Likana was almost there but was then stopped. She turned around and Director Orlok introduced himself and was excited to finally meet them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}