{"url": "Balmorran_Arms/Legends", "categories": ["Category:Legends articles", "Category:Balmorran Arms products", "Category:Droid manufacturers", "Category:Techno Union corporations"], "nodes": [{"tag": "h1", "text": "Balmorran Arms"}, {"tag": "p", "text": "Balmorran Arms was a droid manufacturer based on Balmorra, in the Colonies. It was responsible for manufacturing the SD-series battle droid and the X-1 Viper."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to the outbreak of the Clone Wars, the company's Technology Lead, Hoipa Vonill announced a partnership with the Melody Fellowship for whom Balmorran Arms designed the RO-D-series droid."}, {"tag": "p", "text": "After the First Battle of Geonosis, the Separatist-allied Techno Union seized control of Balmorran Arms and used it to manufacture SD-6 Hulk infantry droids. Under Emperor Palpatine's New Order, Governor Hinch Beltane ran the planet and also oversaw production of Balmorran Arms which churned out the majority of the AT-STs in use by the Imperial Army. However, the Balmorrans longed for independence from the Galactic Empire, wishing for a free market to sell their renowned weapons technology on."}, {"tag": "p", "text": "Following the Battle of Endor in 4 ABY, Balmorran Arms was liberated by the New Republic, allowing it to remain independent for five years. During the Thrawn campaign in 9 ABY, the company also supplied SD-9-series battle droids to the New Republic in limited numbers. However, during the reborn Emperor Palpatine's insurrection, Balmorran Arms was brought back into Imperial service. However, following Palpatine's supposed death near Da Soocha V, the rebellious Balmorrans rebelled against the Empire."}, {"tag": "p", "text": "In retaliation, the planet was attacked by a force under the command of Executor Sedriss QL, including Shadow Droids and SD-9 battle droids. After suffering surprising losses at the hands of the SD-10 battle droids and new Viper Automatons, Sedriss called off his attack in exchange for a shipment of the molecularly-shielded droids."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}