{"url": "Secrets_of_the_Jedi_(novel)", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Legends Young Readers"], "nodes": [{"tag": "h1", "text": "Secrets of the Jedi (novel)"}, {"tag": "p", "text": "Secrets of the Jedi is a Star Wars Legends junior novel written by Jude Watson. Like its predecessor, Legacy of the Jedi, it explores the relationships between three generations of Jedi, and it prominently features Qui-Gon Jinn, Obi-Wan Kenobi, and Anakin Skywalker. Secrets of the Jedi was published on March 1, 2005 by Scholastic, and it was republished with Legacy of the Jedi in 2006."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "THREE GENERATIONS OF JEDI."}, {"tag": "p", "text": "THREE UNTOLD SECRETS."}, {"tag": "p", "text": "A Jedi is never to fall in love...."}, {"tag": "p", "text": "Grieving for the loss of his friend Tahl, Jedi Master Qui-Gon Jinn has been sent back to the Jedi Temple to recover. But this peace is soon shattered by an urgent mission — a young boy with a knack for technology has intercepted a message that indicates a mass assassination of planetary leaders is about to take place. It is up to Qui-Gon and his apprentice, Obi-Wan Kenobi, to protect the boy from the bounty hunter assassins…and to foil the deadly plot."}, {"tag": "p", "text": "Joining Qui-Gon and Obi-Wan on their mission are the Jedi Master Adi Gallia and her headstrong apprentice, Siri. Obi-Wan and Siri have been sparring friends for a long time. But as the assassins' pursuit tightens, they find their relationship beginning to change in an unexpected direction...."}, {"tag": "p", "text": "A generation later, Obi-Wan, Siri, and the boy they tried to save are reunited once more — with the fate of the Clone Wars hinging on the outcome. Old tensions rise once more — as well as new conflicts and secrets. Obi-Wan's apprentice, Anakin Skywalker, has many things to hide, and when his secret wife, Padmé Amidala, joins the Jedi mission, the risks become even greater than before."}, {"tag": "p", "text": "SECRETS ARE DANGEROUS."}, {"tag": "p", "text": "SECRETS ARE DIFFICULT."}, {"tag": "p", "text": "SECRETS CAN KILL."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The working title for Secrets of the Jedi was Jedi Quest Special Edition."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The novel has two parts, with the second part being set \"twenty years\" after the first. The 2005 book The New Essential Chronology originally placed the story's latter half in 19 BBY, and the 2012 book The Essential Reader's Companion ultimately dated it to around 22 BBY."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}