{"url": "Sector_Group/Legends", "categories": ["Category:Legends articles", "Category:Imperial Military"], "nodes": [{"tag": "h1", "text": "Sector Group"}, {"tag": "p", "text": "A Sector Group was a formation of the Imperial Navy, and to some extent the Imperial Army, defined as the total naval strength available to a sector. Command of a Sector Group was delegated to a High Admiral. Usually, \"high admiral\" was a title granted to the sector Moff; however, in cases where sector naval forces were constantly engaged in high-intensity operations, the high admiral was a separate position to the Moff to allow the latter to concentrate on running the sector without devoting a disproportionate amount of time on naval matters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sector Group level of organization came about somewhat by accident: the Moffs of the Empire's sectors, installed under the Sector Governance Decree in the final days of the Republic, complained that the Imperial Navy's force requirements in quelling Separatist holdouts routinely robbed their sectors of resources without sufficient consideration for local security needs. Under the Sector Governance Decree, the Moffs held the power of the old Governor-Generals to raise forces and began raising their own local militias. Alarmed by the prospect of local military forces not loyal to Imperial Center, the Admiralty stepped in and created Sector Groups, local forces directly controlled by the Moffs but carefully scrutinized by Coruscant. In addition, the Sector Group was also created as a means to ensure both the Imperial Army and Imperial Navy could work together on a common goal, due to the jurisdictions under the Old Republic making it impossible for the Republic Army and Navy, respectively, working together."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The early Sector Groups were drawn largely from the old Planetary Security Forces, nationalized in the final days of the Galactic Republic. Sector Group HQ included a squadron under the personal command of the Moff, and some Moffs with political connections or proven tactical ability sometimes had more squadrons available to them."}, {"tag": "p", "text": "On average, a standard Sector Group was composed of 2,400 ships, of which 24 were Imperial-class star destroyers and an additional 1,600 were smaller warships. The Group's combat elements were split between \"Superiority\" and \"Escort\": a superiority fleet was a space-combat force spearheaded by six Star Destroyers, each nominally accompanied by a battle squadron of eighteen smaller ships; escort fleets, meanwhile, were composed of force escorts and were designated for combat against pirates and raiders, which in practice meant that they were the Empire's first line of defense, protecting civilian freighters, attacking corsairs' hideouts, and guarding remote outposts. Officially, the Sector Group is the largest unit in the Imperial Navy. However, there does exist even larger naval forces to be assembled than Sector Groups known as regional groups or Oversector groups, although these are not considered part of the standard Order of Battle. The number of ships guarding Kuat numbered at least that of a Sector Group."}, {"tag": "p", "text": "Additional Sector Group resources outside the combat element included the assault fleet, capable of deploying four entire surface Armies; the support fleet, used to fulfill the immense logistical requirements of the Sector Group, the deepdock fleet, which provided repair capability; and the bombard fleet, a rare formation nominally composed of eighteen Torpedo Spheres, used to break down planetary shields in offensive operations."}, {"tag": "p", "text": "In 10 ABY, New Republic historian Arhul Hextrophon recognized that, owing to Sector Group resources like Super Star Destroyers and Torpedo Spheres, it had been almost impossible for the Rebel Alliance to properly estimate the power of the average Sector Group during the Galactic Civil War. He made this observation in a guest lecture at the Brionelle Memorial Military Academy on Chandrila shortly after the Battle of Calamari."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}