{"url": "Sector_Army/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Organizational military units", "Category:Sector Armies"], "nodes": [{"tag": "h1", "text": "Sector Army"}, {"tag": "p", "text": "A Sector Army was a type of military formation used by the Grand Army of the Republic and, later, the Imperial Army and the Imperial Navy, although the role and composition of these units evolved markedly between the Clone Wars and the Galactic Civil War."}, {"tag": "h2", "text": "Sector Armies in the Clone Wars"}, {"tag": "p", "text": "In the Clone Wars, Sector Armies were the main subordinate component units of the ten Systems Armies that formed the military backbone of the Grand Army of the Republic. There were two Sector Armies in each Systems Army, making a total of twenty Sector Armies; each of them was commanded by a Senior Jedi General, and had a nominal combat strength of 147,456 troopers, divided into four Corps (although it should also be noted that many of the Legions which made up the Corps also included \"Corps\" within their unit names). Under the \"1/4/16/64 Plan\", one corps was maintained as a mobile reserve force while the others were theoretically divided into progressively smaller units so that one army could fulfil one corps operation, four brigade-level operations, sixteen regiment-level operations or sixty-four battalion-level operations. In reality, sector army deployments were rarely so neat, and typically one corps in each army remained intact, but the others were divided into hundreds of small, fast-moving raiding companies."}, {"tag": "p", "text": "The 2nd Sector Army, commanded by Jedi Master Ry-Gaul, was part of Systems Army Alpha, while the 4th Sector Army, known unofficially as the \"Outer Rim Sector Army\", was the main GAR force in the Outland regions. The 2nd Sector Army numbered among its component units the 327th Star Corps, led by Commander Bly and Jedi Master Aayla Secura, and the 4th Sector Army was the parent of the 21st Nova Corps, Ki-Adi-Mundi's Galactic Marines.[source?]"}, {"tag": "p", "text": "The twenty oversectors created by the Sector Governance Decree matched the Sector Armies' theaters of operations. The decree gave twenty of the new Moffs responsibility for supporting the Sector Armies. This system also freed them from having to constantly consult local authorities."}, {"tag": "h2", "text": "Sector Armies under the Empire"}, {"tag": "p", "text": "After the Declaration of a New Order, oversectors were reorganized as part of the Imperial militarization. This sectors and the Sector Armies were placed under the authority of a Grand Moff. Notably, following Imperialization, the positions of sector armies and systems armies in the military hierarchy were reversed: systems armies were now subordinate commands to sector armies."}, {"tag": "p", "text": "Under the New Order, the number of Sector Armies rose dramatically; each of the Moffs, the Governors who Palpatine dispatched to oversee the thousand Sectors which the Empire had inherited from the Old Republic, bore the title of Surface Marshal of a Sector Army. And each of these Sector Armies could serve in turn as the high command for an Assault Fleet capable of deploying four full surface Armies against any resistance or hostility in the sector - 774,576 combat troops in a total muster of 1,180,379 personnel - to say nothing of a number of autonomous Corps HQs for garrison duty."}, {"tag": "h3", "text": "Imperial Army sector army level symbol"}, {"tag": "h2", "text": "List of Sector Armies under the Clone Wars and early Imperial Period"}, {"tag": "h3", "text": "Reserve Sector Armies"}, {"tag": "p", "text": "\"Reserve\" Sectors was the term given by the Grand Army of the Republic to its first six Sector Armies. Headquartered in the Core Worlds, the six sector armies were officially designated as reserve commands, but they act in a variety of roles."}, {"tag": "h3", "text": "Northern Campaign Sector Armies"}, {"tag": "p", "text": "The Northern Campaign Sector Armies were the Grand Army of the Republic's six Sector Armies that were assigned to the northern quadrant of the galaxy during the Clone Wars. Sector Armies 7-12 made up the Systems Armies Delta, Epsilon, and Zeta, the three Systems Armies that were assigned primarily to the northern quadrant."}, {"tag": "h3", "text": "Southern Campaign Sector Armies"}, {"tag": "p", "text": "The Southern Campaign Sector Armies were the Grand Army of the Republic's eight Sector Armies that were assigned to the southern quadrant of the galaxy during the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sector Armies were introduced as elements of the Imperial Army in the Imperial Sourcebook, and retrospectively given their Clone Wars back-story only in the Guide to the Grand Army of the Republic. In the Imperial Sourcebook, the most obvious reading of the text is that a Sector Army is divided for administrative purposes into two Systems Armies and represented in combat by four front-line Armies and an associated Navy Assault Fleet; but this enumeration cannot represent the entire order of battle of a standard Sector Army, as it omits the Corps HQs and combat battalions of planetary garrison, each of which was designed as the basis to build up a new combat Corps on a world when required. It is very possible that the number of Systems Armies, surface Armies, front-line Corps and garrison details in a Sector Army should be thought of as varying markedly from sector to sector."}, {"tag": "p", "text": "The Rebellion Era Campaign Guide implied that the Rebels had their own Sector Armies, citing that the most senior Generals commanded them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}