{"url": "Balog_(Human)", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Police"], "nodes": [{"tag": "h1", "text": "Balog  (Human)"}, {"tag": "p", "text": "Balog was a Human male who served as the Chief Security Controller of the planet New Apsolon and an active Absolute. He was the one responsible for the death of Jedi Master Tahl."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Balog lived in the planet of New Apsolon, which had a social revolution at 47 BBY. In that revolution, the exploited majority Workers reclaimed equality between them and the ruling minority, the Civilized, in a bloodless campaign that saw the people's hero Ewane be elected ruler of the planet in the first ever free elections, closely supervised by the Jedi Qui-Gon Jinn and Tahl. After six peaceful years, chaos returned to New Apsolon, as Ewane was murdered shortly after being re-elected."}, {"tag": "p", "text": "Balog was a Worker and at the time of Ewane's death (41 BBY) he was the New Apsolon's Chief Security Controller, but secretly he was in league with the outlawed former secret police, the Absolutes and with Ewane's twin daughters Alani and Eritha. In fact, he was an Absolute informant when they were in power. In the course of the plan to gain power and reinstall the Civilized to dominant position, Balog helped kill Ewane's successor Roan, by staging a kidnap of the twins."}, {"tag": "p", "text": "He also kidnapped Jedi Master Tahl in order to retrieve a list of the Absolutes' agents that he thought she had, as she was undercover in the remnant of the disbanded secret police. That list also contained his name. Qui-Gon Jinn and Obi-Wan Kenobi crossed Balog's path, as they were searching for the missing Tahl. Balog had placed her in a Sensory deprivation containment device for days, slowly torturing her in the process. When the Jedi infiltrated the Absolutes' hidden base, they set charges to the whole facility. As the explosives went off one by one, Balog set the weapons room to self-destruct and fled to Tahl's cell, seeing that he didn't need to keep her alive anymore. Qui-Gon and Obi-Wan followed him inside, where he held a transmitter that would terminate Tahl, if they came any closer. However, Qui-Gon moved so fast that he sliced off Balog's finger before he could detonate. In pain, Balog fired his blaster at the sensory deprivation devise to ward the Jedi off as he made his escape."}, {"tag": "p", "text": "Although the Jedi rescued Tahl, she would eventually die as a result of the injuries sustained during captivity. In being the person to blame for Tahl's death, Balog incurred in the anger of Qui-Gon, who almost fell to the dark side as a result of the grief he felt. Qui-Gon managed to control his anger, and that kept him from killing Balog. Along with his associates Eritha and Alani, Balog was arrested for his actions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}