{"url": "Security_Guard/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Law enforcement occupations", "Category:Naboo organizations", "Category:Royal Naboo Security Force personnel", "Category:Security occupations"], "nodes": [{"tag": "h1", "text": "Security Guard"}, {"tag": "p", "text": "The Security Guard was a division of the Royal Naboo Security Forces stationed on the planet Naboo. They served as the planetary militia and police force."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Security Guard corps was composed of somewhere between five and six thousand men and women as of 32 BBY, though this number was commonly raised during times of tension in the Royal Court. Many Security Guards were natives of Naboo who had performed off-world military service, though it was known for nobles or businesspeople to receive martial training within the Security Guard before joining its ranks. Training was roughly similar to the galactic standard for a local police force."}, {"tag": "p", "text": "Security Guards commonly served as sentries and patrolmen in Theed, and the group was adept at handling riots and other civic disturbances, though military analysts did not believe the corps could defend Naboo against a military ground assault—such as that performed by the Trade Federation during the Invasion of Naboo. Security Guards commonly served fifteen standard hours a week on average, and most tended to remain with the unit for two years. They were outfitted with a yellow-and-brown armored uniform, and carried CR-2 heavy blaster pistols, though in times of peril, the guards were equipped with blaster rifles. Sometime between 32 BBY and 22 BBY, the Security Guards adopted a darker uniform."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the assassination of King Veruna, the Security Guard quelled uprisings by elements of the Ralthar Syndicate. Prior to and during the Trade Federation invasion, the Security Guard was led by Captain Quarsh Panaka. Though unable to withstand the invasion of Naboo, the Security Guard assisted underground resistance movements, and fought in the Battle of Naboo."}, {"tag": "p", "text": "Two prominent guards were killed in an assassination attempt on Padmé Amidala when their ship returned with her to Coruscant for the Senate vote on the Military Creation Act. Rumors that the guard shown below standing in the ship was a suicide bomber were false, as the terrorist responsible for murdering the guards and Amidala's handmaiden Cordé was in fact bounty hunter Zam Wesell, who worked for the Confederacy of Independent Systems via fellow bounty hunter Jango Fett."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}