{"url": "SedriMotors_Ltd.", "categories": ["Category:Legends articles", "Category:SedriMotors Ltd. products", "Category:Vehicle manufacturing companies"], "nodes": [{"tag": "h1", "text": "SedriMotors Ltd."}, {"tag": "p", "text": "SedriMotors Limited was a New Republic-allied company founded by the Sedrians. Considered to be the most successful Sedrian company, SedriMotors specialized in aquatic craft. It was known to equip its vehicles with exotic propulsion systems such as hydro-jets and hover propulsion drives. SedriMotors developed the Amphibion aquatic troop transport, used by the Republic during the Battle of Calamari."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sedrian sentient species evolved on the aquatic planet Sedri of The Periphery. They remained undiscovered by the spacefaring species up until the Galactic Civil War. After being attacked by forces of the Galactic Empire and helped by the Alliance to Restore the Republic, the Sedrians became members of the Alliance and later of the New Republic. Although their technology lagged far behind of the standard of the galactic community, the Sedrians soon made spectacular advances, particularly in both submarine and surface transport. Soon, the Sedrians could contribute to their allies with their machinery."}, {"tag": "p", "text": "The Sedrians created several manufacturing companies, with SedriMotors Ltd. being considered the most successful of these. This concern manufactured aquatic vehicles. Created in times of the Alliance, SedriMotors was later directly associated with the New Republic. SedriMotors used uncommon propulsion systems, including hydro-jets and hover propulsion drives, even if these drives were considered obsolete by their time."}, {"tag": "h2", "text": "Products"}, {"tag": "p", "text": "SedriMotors manufactured several military vehicles, including the deep-water combat pod and the Republic Amphibion. The Amphibion was a troop transport that was mass-produced following the specifications of the Republic. The Republic had asked SedriMotors for a cheap vehicle and SedriMotors answered with this lightly-armored, lightly-armed but fast, silent and versatile speeder. The Alliance and later the Republic used groups of SedriMotors Amphibions in combination with other vehicles in their activities. The Amphibion was extensively used by the Republic forces during the Battle of Calamari, in 10 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "SedriMotors Limited was first mentioned in Dark Empire Sourcebook, giving a name to the company that created the vehicle seen in the Star Wars: Dark Empire comic-book series. This linked the Amphibion to the previously-known Sedrian species seen in the roleplaying adventure Battle for the Golden Sun."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}