{"url": "Secutor-class_Star_Destroyer", "categories": ["Category:Canon articles", "Category:Wookieepedia Featured articles", "Category:Battlecruiser classes", "Category:Carrier classes", "Category:Galactic Empire starship classes", "Category:Secutor-class Star Destroyers", "Category:Star Destroyer classes"], "nodes": [{"tag": "h1", "text": "Secutor-class Star Destroyer"}, {"tag": "p", "text": "The Secutor-class Star Destroyer, also known as the Secutor-class battlecarrier, was a type of Star Destroyer, carrier, and battlecruiser used by the Galactic Empire. Dating from early in the Imperial Era, the multi-kilometer Secutor was possibly the largest dedicated starfighter carrier in the Imperial Navy. Heavily armed with turbolasers, ion cannons, and tractor beams, the Star Destroyer also carried tens of thousands of personnel, as well as two wings of starfighters, walkers, and other armored fighting vehicles, allowing it to easily lay siege to a planet."}, {"tag": "p", "text": "The Secutor-class was commonly used as a command ship or flagship in charge of a task force, often encountered during offensive operations against Rebel Alliance fleets, strongholds, and rebellious worlds. Alternatively, the Star Destroyer could also be used as an escort to larger Star Dreadnoughts. One particular Secutor-class Star Destroyer was the Conquest, which was commanded by Naval Intelligence Agency Vice Admiral Dodd Rancit, who used the ship to lead a flotilla above Carida in 14 BBY. However, he was later outed as a traitor to the Empire and killed by his own crew."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A model of Star Destroyer, carrier, and battlecruiser, the Secutor-class Star Destroyer, also known as the Secutor-class battlecarrier, was perhaps the largest dedicated starfighter carrier in the Imperial Navy, measuring several kilometers long. It had more in common with the Venator-class Star Destroyer than any other Imperial Kuat Drive Yards vessel. The Secutor featured twin bridges situated on a vertical command superstructure, which rose from its instantly recognizable flat, arrowhead-shaped body and was uniquely placed amidships, rather than aft over the ion drives. The command bridge itself featured an elevated walkway, viewports, and consoles that featured forward chairs with a communications board behind them."}, {"tag": "p", "text": "As a carrier, the Secutor-class featured two gaping ventral hangar bays, which could carry two wings of 144 total starfighters, as well as numerous other shuttles, landing craft, utility vehicles, AT-series walkers, and ground assault vehicles. It possessed ion drives and held a primary hyperdrive rating of Class 2, with a backup at Class 14. The Secutor-class could carry 40,000 officers, pilots, and enlisted crew, as well as 14,000 troops. Two years' worth of consumables were carried for this crew."}, {"tag": "p", "text": "The ship was heavily armed with a wide variety of turbolasers, heavy ion cannons, and tractor beams. Specifically, it possessed fifteen heavy turbolaser batteries (five port, five starboard, five dorsal), fifteen light turbolasers (five port, five starboard, five forward), ten battleship ion cannon turrets (five port, five starboard), five battleship ion cannon batteries (ventral), sixteen medium ion cannons (eight port, eight starboard), and twelve hull-mounted heavy tractor beam emitters. Secutors were also heavily armored, with shields able to easily absorb a whole battle group's worth of damage with little effort. The ships additionally boasted a long-range sensor, a navigation computer, a life-form scanner, and escape pods."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Secutor-class Star Destroyer could be used as a command ship or flagship capable of leading a task force or flotilla, surrounded by smaller escorts. Alternatively, it could also be used to escort larger Star Dreadnoughts. The ships carried sufficient assorted materiel to easily lay siege to a planet."}, {"tag": "p", "text": "Secutors were commonly encountered during offensive operations against Rebel Alliance fleets, strongholds, and rebellious worlds. When engaging in battle, Secutor commanders directed their starfighters to engage with numerical superiority, normally with a two-to-one or three-to-one ratio, but also to protect the carrier's aft quarter. If fighters were destroyed, more were launched to take their place."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Secutor-class dated back to the earliest days of the Imperial Era and was constructed by Kuat Drive Yards at a cost of 200 million credits. At some point, a Secutor-class Star Destroyer exchanged fire with a Providence-class Dreadnought and another vessel reminiscent of a Quasar Fire-class cruiser-carrier above two tan celestial bodies. In the engagement, all three ships received damage to their hulls."}, {"tag": "p", "text": "In 14 BBY, the Secutor-class vessel Conquest served as the command ship of the Naval Intelligence Agency's Vice Admiral Dodd Rancit. Rancit, who was dissatisfied with his position within the Empire, assembled a rebel cell that stole the Carrion Spike, the personal corvette of Moff Wilhuff Tarkin. The cell then attacked several Imperial operations. However, Rancit planned to betray the rebels and win favor with the Emperor for their defeat."}, {"tag": "p", "text": "Rancit, in the Conquest, led a task force stationed around Imperial Navy Deepdock Facility Two over the planet Carida, which he had instructed the cell to attack next. However, the rebels had become aware of Rancit's planned betrayal and sent the Carrion Spike on autopilot to Carida, so as to fake their deaths. Once the corvette appeared, and just as Rancit was about to order the ship's destruction from the Conquest's bridge, the Sith Lord Darth Vader arrived and instructed the Star Destroyer's commander to scan the Carrion Spike for life-forms."}, {"tag": "p", "text": "After the scan came back negative, Vader outed Rancit as a traitor and the one who had orchestrated the recent chain of attacks. The Sith Lord then instructed the Conquest's crew to order the rest of the flotilla to stand down. For Rancit's execution, Vader had his stormtroopers escort the vice admiral to an escape pod, which launched to a distance from the Conquest. Following Vader's command and resigned to his fate, Rancit then ordered his crew to destroy the pod, with him inside."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Secutor-class Star Destroyer first appeared in the new Star Wars canon in the 2014 novel Tarkin, which was written by James Luceno. It was first pictured in the 2020 Fantasy Flight Games Star Wars Roleplaying sourcebook Starships and Speeders, in an image reused from the company's 2014 Star Wars: Age of Rebellion sourcebook Stay on Target from Star Wars Legends."}, {"tag": "p", "text": "The Secutor class originated in the Star Wars Legends continuity, as a background ship in Dark Empire 2, a comic book written by Tom Veitch, illustrated by Cam Kennedy, and released by Dark Horse Comics on February 18, 1992. Although the vessel went unnamed in the Dark Empire issue, a full specification based on the ship was designed by fan Ansel Hsiao and was featured in the 2012 reference book The Essential Guide to Warfare, which was written by Jason Fry. The Secutor class's name was not mentioned in the book itself, but Fry stated in his Tumblr endnotes that the name and some of Hsiao's specifications had been approved by Lucasfilm. In Latin, the word \"secūtor\" means \"pursuer.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}