{"url": "Sedesia", "categories": ["Category:Legends articles", "Category:Druess sector planets", "Category:High-gravity planets", "Category:Sedesia locations", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Sedesia"}, {"tag": "p", "text": "Sedesia was a high-gravity Mid Rim world with harsh terrain and rough weather."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet had a tilted axis of 45 degrees, which resulted in extreme weather conditions. During the winter, nearly a sixth of the planet's surface received no sunlight. The high rotating speed and the extreme differences in temperature resulted in violent weather conditions with sudden winds and storms. This made the use of repulsorcrafts rather impossible."}, {"tag": "p", "text": "Most of the planet's terrain was dominated by vast steppes and tundras, and the occasional forest."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sedesia was colonized several centuries before the Galactic Civil War. The inhabitants settled mostly in spread-out farms, smaller communities and several cities, the largest being Besia Osurne. They made their living from ranching, herding and logging in the wetter regions. The harsh climate and gravity made the Sedesians self-reliant, tough and determined, but also very stubborn. Technology-wise Sedesians employed modern technology, but also relied on imported space-age and locally made industrial-age items and equipment. In the tundras, where roads were very bad, Striders were still the most common method of transportation."}, {"tag": "p", "text": "During the Galactic Civil War, Sedesia was a hotbed of Rebel activity. Rebel operatives and fugitives often found refuge on the outlying farms, and tonnages of breedtash meat were smuggled off-world and supplied to the Rebel Alliance. This changed when the Galactic Empire retaliated: Under the Pathogen-Based Loyalty Enhancement Program, lead by Dr. Fesjo Negleem, the Empire spread the \"Gray Death,\" an artificially created virus, under the population to pacify the planet. Within two weeks, the virus infected over 99 percent of the population, killing over 35,000 inhabitants and effectively disrupting the government, military and all Rebel resistance."}, {"tag": "p", "text": "After the outbreak, COMPNOR and military personnel moved in and took over the planet in a completely bloodless occupation. SAGroup volunteers then distributed a cure under the auspices of humanitarian relief. For months, this quashed all Rebel sentiment on the planet before the revelation of the truth by Rebel agents. As a result, Sedesia revolted against the Empire. However, while initially disorganized, the taskforce swiftly responded and took over the planet by force."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Besia Osurne"}, {"tag": "p", "text": "The only starport of the planet was located in Besia Osurne, the largest city on Sedesia. It had a population of 250,000 people and several stockyards and processing plants for breedtash meat. It also contained the tavern Trail's End."}, {"tag": "h3", "text": "Imperial research center"}, {"tag": "p", "text": "Located half a kilometer outside Besia Osurne, this former veterinary center served as a research center for the Imperial scientists to develop a cure for the Gray Death plague as well as the headquarters for Dr. Fesjo Negleem."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}