{"url": "Sedesia_taskforce", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Imperial task forces"], "nodes": [{"tag": "h1", "text": "Sedesia taskforce"}, {"tag": "p", "text": "The Sedesia task force was an Imperial detachment composed of various Imperial branches sent to the planet Sedesia to deal with an outbreak of the \"Gray Death,\" a highly deadly plague. It was part of the Pathogen-Based Loyalty Enhancement Program, led by Dr. Fesjo Negleem."}, {"tag": "h2", "text": "Composition"}, {"tag": "h3", "text": "COMPNOR"}, {"tag": "p", "text": "The largest part of the task force was the detachment of the Commission for the Preservation of the New Order. The Redesign Bureau of the Coalition for Improvements sent a large medical group to conduct on-site research on the plague, led by Dr. Fesjo Negleem."}, {"tag": "p", "text": "The SAGroup sent many volunteers to distribute the antivirus among the population. These volunteers operated so-called health-stations and carried medpacs, hand computers and a blaster pistol."}, {"tag": "p", "text": "To provide security, a CompForce regiment was sent along as well. This regiment was composed of an assault battalion and two infantry battalions. The extreme climate of Sedesia made the use of repulsorlift units impossible, so the fourth battalion, a repulsorlift was outfitted with 88 hoverscouts and an assortment of 22 wheel bikes. Of the usual total complement of 3,380 troopers, 2,560 men were sent to Sedesia."}, {"tag": "h3", "text": "Imperial Navy"}, {"tag": "p", "text": "The Imperial Navy sent four ships to Sedesia: one Dreadnaught-class heavy cruiser, one Strike-class medium cruiser and two Guardian-class light cruisers. The Dreadnaught and the Strike cruiser each carried a single squadron of TIE/LN starfighter. This was an extremely small force for a planetary occupation, since these squadrons would usually include at least a Star Destroyer. However, since there was hardly any resistance and most ships avoided the planet because of the plague, these four ships proved to be enough to maintain a blockade."}, {"tag": "h3", "text": "Imperial Army"}, {"tag": "p", "text": "The Imperial Army sent 3,000 regular Army troopers, roughly regiment strength. They were stationed on board the Dreadnaught-class cruiser."}, {"tag": "h3", "text": "Stormtrooper Corps"}, {"tag": "p", "text": "The Stormtrooper Corps sent a company of stormtroopers, together with an AT-AT and two AT-STs, all stationed aboard the Strike cruiser."}, {"tag": "h2", "text": "Deployment history"}, {"tag": "p", "text": "The planet of Sedesia, which had been a hotbed of Rebel sympathizers, had suddenly been hit by a terrible plague that quickly spread among the population. Over ninety-nine percent got infected with the Gray Death within the first two weeks, and over 35,000 people lost their lives. Government, military and Rebel resistance ceased to function. As part of the Pathogen-Based Loyalty Enhancement Program, the Empire formed the Sedesia task force and moved in to help the planet."}, {"tag": "p", "text": "The starships were deployed along the spacelanes around the planet, establishing a blockade and enforcing the quarantine. The plague had already disrupted the government and military of Sedesia, so when the Empire arrived, the CompForce Regiment was enough to ensure a bloodless occupation. For the following months, the CompForce regiment remained the only military presence on the planet. Company-sized units were deployed in the most important cities on the planet, with the capital of Besia Osurne becoming the garrison headquarters. Stationed there were four companies, a Heavy Weapons Company armed with light repeating blasters, an infantry, a wheelbike and a hoverscout company."}, {"tag": "p", "text": "Shorty after the establishment of the quarantine, almost all remaining ships had left the planet, and regular merchant ships avoided the plague-infested planet. The medical unit had set up headquarters in an old veterinary medicine center outside the capital to search for a cure. Volunteers from the SAGroup then began distributing the antiviral shots among the population from so-called health stations set up in the streets of nearly every neighbourhood. Most of the Rebel sympathizers on the planet didn't trust the Empire and refused to take the cure, and they died shortly after the outbreak. Although the garrison commander could summon help from the troops in orbit in case of trouble, there was no need to do so. The rest of the population welcomed the Empire and accepted their help."}, {"tag": "p", "text": "Due to the outbreak of the plague, the rest of the galaxy avoided the planet. For the following six months, the ships and troops in orbit remained idle. This changed when the Rebel Alliance noted the situation on the planet. Doctor Andros Hareel of the Rebellion's medical section sent a team to infiltrate Sedesia. The agents attacked the research center and delivered the data about the Pathogen-Based Loyalty Enhancement Program and FNA-23-B to the population."}, {"tag": "p", "text": "After discovering the truth behind the Gray Death, the mob of Sedesia filled the streets and revolted against the Imperial forces. Although CompForce and SAGroup personnel had better weapons, they were spread thin, outnumbered and disorganized in the initial moments of the uprising. However, as the Imperials realized that Dr. Negleem's project had failed, another task force arrived and quickly took over the planet by force. The Rebel agents continued to fight the Imperials, formed a resistance and conducted guerrilla operations. Dr. Negleem escaped the situation on Sedesia and continued his work on several other planets."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This task force was introduced in the roleplaying game adventure The Cure, first published in West End Games' Star Wars Adventure Journal 6. It detailed the task force's composition and deployment, but gave no name for this unit."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}