{"url": "Seff_Hellin", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Humans", "Category:Jedi Knights of the New Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Seff Hellin"}, {"tag": "p", "text": "Seff Hellin was a Jedi Knight who served during the time period following the Second Galactic Civil War. He had been a student at the Jedi Academy on Yavin 4 and was approximately fourteen when it was evacuated during the war with the Yuuzhan Vong. He wore his hair in a curly style."}, {"tag": "p", "text": "Hellin was one of the first Jedi in the New Jedi Order to develop the Force-related psychosis that came upon the galaxy in 43 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Seff Hellin was born in 12 ABY."}, {"tag": "p", "text": "During the Yuuzhan Vong War Seff Hellin along with the other Jedi Younglings were sent to Shelter in the Maw. It was during this time that the being Abeloth contacted the younglings and put the madness in him that would come when he was older. The Jedi Masters wouldn't know about this until years later.\nHe went on to train as a Jedi."}, {"tag": "p", "text": "By 43.5 ABY he was a full Jedi Knight."}, {"tag": "h3", "text": "Later life"}, {"tag": "p", "text": "Hellin rescued Han Solo and his family when Allana was kidnapped on Taris. These actions involved killing or maiming several members of an arms syndicate based on Denon. Because he had no authority to act on Taris, Seff was ordered by Galactic Alliance Intelligence agents to surrender his lightsaber. He was told by Leia Organa Solo to do so and that she would call Jedi Grand Master Luke Skywalker on his behalf, but Seff refused, stating that Skywalker \"didn't understand.\""}, {"tag": "p", "text": "He then disarmed and temporarily paralyzed the intelligence agents attempting to take him into custody with the Force, and fled the room at incredible speed. This led Leia to comment that he should not have been able to do that, meaning his abilities had progressed beyond what was normal. Seff was then declared a rogue Jedi, refusing to submit to the authority of the Masters by returning to Coruscant."}, {"tag": "p", "text": "His actions on Taris caused even further distrust of the Jedi on the part of Chief of State Natasi Daala, which led her to dispatch a team of Mandalorians to bring him into custody. As a result of this, Luke Skywalker was forced to recall all of the Jedi to the Temple at Coruscant until further notice, as well as try to reassure Daala that the Jedi were self-policing and that Mandalorians should not be involved."}, {"tag": "p", "text": "It was known that Seff was extremely distrustful of Daala's intentions towards the Jedi and the Mandalorians involvement in Galactic Alliance affairs. So much so that he approached Lando Calrissian—without the authority or knowledge of the New Jedi Order—about Tendrando Arms producing a Mandalorian Hunter Droid similar to the YVH class of droids. This conversation occurred only a month or two before the events on Taris."}, {"tag": "p", "text": "After hearing of Valin Horn's mental state, Seff came to believe that he and Valin were the only ones who had not been replaced by impostors. Seff spent weeks planning to rescue Valin from the prison where he was being held encased in carbonite. During his rescue attempt, Seff was captured by a group of conspirators known as Darkmeld led by Jaina Solo and Jagged Fel. Seff was sedated and secretly brought back to the Asylum Block in the Jedi Temple where Master Cilghal and Jedi Knight Tekli tried to ascertain the nature of his mania."}, {"tag": "p", "text": "When Chief Daala attempted to gain possession of all psychotic Jedi, the Solos smuggled them out of the Temple, and took them to the academy on Shedu Maad."}, {"tag": "p", "text": "In 44 ABY, Hellin and the other Jedi suffering from the mysterious Force psychosis snapped out of their delusions in the aftermath of Luke Skywalker's first battle with Abeloth on Abeloth's planet. They were brought from Shedu Maad to the Jedi Temple by Zekk and Tekli. Hellin participated in the rescue of Jysella and Valin Horn as a member of \"Team Saav'etu.\" Disguised as exterminators, the team used foam coating to mask the cam bubbles of the facility and then breached the outer walls with thermal detonators."}, {"tag": "p", "text": "Inside, the team discovered thousands of prisoners frozen in carbonite alongside the Horn siblings. During the raid, Hellin provided security for his team's escape and managed to destroy one of two Galactic Alliance Security troopsleds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}