{"url": "See-Seven", "categories": ["Category:Canon articles", "Category:Droids of the Galactic Empire", "Category:RA-7 protocol droids"], "nodes": [{"tag": "h1", "text": "See-Seven"}, {"tag": "p", "text": "See-Seven was an RA-7 protocol droid in the service of the Galactic Empire. According to a story told to the Mustafarian youths Giggek and Tuttel by the elder Lellis, See-Seven assisted Imperial Inspector Vaneé when he was sent to investigate a number of insane stormtroopers stationed at Fortress Vader, of the Sith Lord Darth Vader on the planet Mustafar. See-Seven stunned one of the victims after the trooper threatened and attacked Vaneé, who requested that the protocol droid have the trooper restrained. Vaneé entered deeper within the fortress to investigate the circumstances, subsequently being driven mad due to lava fumes leaking into the structure."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The RA-7 protocol droid See-Seven served the Galactic Empire during its reign. According to a tale told by the Mustafarian Lellis, See-Seven accompanied Inspector Vaneé after he was dispatched to Fortress Vader, the castle of the Sith Lord Darth Vader on the planet Mustafar, in order to investigate the cause behind numerous Imperial stormtroopers being driven insane. After Vaneé's arrival at the fortress, he and See-Seven were faced by one of the mad troopers. See-Seven informed Vaneé on the similar state of the other troopers, who numbered over a dozen. Vaneé suggested that the victims were simply weak and paranoid, leading the trooper to grab the inspector and threaten him. See-Seven stunned the maniacal trooper, and Vaneé thanked the droid, asking for the trooper to be restrained while he investigated the issue."}, {"tag": "p", "text": "Vaneé's investigations brought him to Vader himself, and the inspector was similarly driven mad by the lava fumes within the fortress, becoming a servant of the Sith Lord. Shortly after the Battle of Endor in 4 ABY, the story of Vaneé, featuring See-Seven, was retold by the Mustafarian elder Lellis to the young Mustafarians Giggek and Tuttel after the latter two intended to break into and destroy Fortress Vader."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "An RA-7 protocol droid, See-Seven was manufactured by Arakyd Industries, standing 1.7 meters tall. The protocol droid had black plating and a red sensor."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "See-Seven carried a blaster weapon, which the droid carried slung over its back when not in use."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "See-Seven appeared in a flashback in the comic Star Wars Adventures: Shadow of Vader's Castle, written by Cavan Scott, illustrated by Derek Charm, and published by IDW Publishing on November 4, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}