{"url": "Seek", "categories": ["Category:Canon articles", "Category:Wookieepedia Comprehensive articles", "Category:Humans", "Category:Males", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Seek"}, {"tag": "p", "text": "Seek was a red-headed human boy from the planet Tatooine who was born around 42 BBY. When Seek was ten, in 32 BBY, he and a group of other children visited his friend Anakin Skywalker in a courtyard of Slave Quarters Row in Mos Espa spaceport. Skywalker was working on his podracer and revealed that he was going to participate in the Boonta Eve Classic podrace taking place the next day, causing the children Kitster Banai, Wald, Amee, and Melee to express doubts about his chances."}, {"tag": "p", "text": "Unimpressed by Skywalker's mechanical talents, Seek was so indifferent that he suggested that the group go and play a ball game. He then cruelly predicted that Skywalker would crash during the race before he and all of the group bar Banai left while giggling. Skywalker instead won the race and subsequently left Tatooine. Seek had light, freckled skin and dark eyes. He wore brown and gray robes with a black scarf and brown belt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Seek was portrayed by Oliver Walpole in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. His name was not stated in the film but was given in the credits. Walpole is the son of the film's set decorator, Peter Walpole, and visited Leavesden Studios with his father to see the sets. As Oliver was the same size as Jake Lloyd, who played Anakin Skywalker, he tried out one of the podracers seen in the film. Director George Lucas spotted Oliver in the vehicle and suggested that he take a screen test. Two weeks later, Oliver learned that he had a speaking part in the film and was flown out with his mother, Alison, to Tunisia to shoot for ten days."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}