{"url": "Seelah_Korsin", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Females", "Category:Force-sensitives", "Category:Humans", "Category:Korsin family", "Category:Sith healers", "Category:Sith in the Lost Tribe of Sith", "Category:Sith military personnel", "Category:Sith of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Seelah Korsin"}, {"tag": "p", "text": "Seelah Korsin was a Human female healer and miner who eventually rose to become one of the foremost leaders of the planet Kesh's Lost Tribe of Sith. Born a slave to Sith Lord Ludo Kressh on the planet Rhelg, Seelah escaped a life of servitude after the execution of her family. She fell in with a young Sith mineralogical corps member named Devore Korsin, whom she married—together they had a son, Jariad. In 5000 BBY, the new Seelah Korsin joined her husband's mining crew on a mission to obtain valuable Lignan from the planet Phaegon III's largest moon, only for their ship, the Omen, to get knocked off-course as it jumped to hyperspace during a Jedi attack. The Omen violently crash-landed on the remote world of Kesh—Korsin survived the disaster along with Devore, Jariad, and her brother-in-law, Omen captain Yaru Korsin. The survivors made camp in the mountains, where after an attempt to usurp control of the group, Devore was killed in single combat by his brother Yaru. Aggrieved by her loss, Korsin dedicated the rest of her life to avenging the death of her husband. After several nights stranded in the mountains, the Sith made their way to local civilization, where they posed as the native Keshiri gods and took their place as rulers of the world."}, {"tag": "p", "text": "Although determined to kill him, Korsin married Yaru Korsin in the coming years in order to secure the statuses of both herself and her young son in the new Sith organization known as the Lost Tribe—as part of the ploy, Korsin had a daughter, named Nida, with her sworn enemy. Korsin used her past experience as a battlefield medic and her skill with the Force to lead the Sith sick wards, pursuing a dream of physical perfection for all future members of the Lost Tribe. To that end, in 4985 BBY Korsin engineered the purge of the entire contingent of Pureblood Sith on Kesh, framing their leader Ravilan Wroth for the deaths of thousands of Keshiri, then convincing Yaru that the Purebloods posed a threat and needed to be eliminated. As Jariad grew older, Korsin set him up to succeed Yaru as Grand Lord of the Lost Tribe. Finally, in 4975 BBY, Korsin decided that it was time to strike. Along with Jariad and a group of Sith Saber warriors, Korsin ambushed Yaru in their mountain temple. However, the surprise entry of Nida and her Skyborn Rangers turned the tide, and though Yaru died in the battle, Jariad was killed along with the rest of Korsin's force. Korsin was gravely wounded when Yaru's Houk friend Gloyd detonated a proton detonator that brought down the room in which she was located, and subsequently lost the use of her legs. In accordance with Yaru's wishes, the new Grand Lord Nida Korsin ordered the withdrawal of the Lost Tribe from the temple, leaving Korsin to live out the rest of her days there alone."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Escape from servitude"}, {"tag": "p", "text": "Born a descendant of Tapani refugees, the Human female known as Seelah grew up on the planet Rhelg of the remote Sith Empire in the era before the Great Hyperspace War. In her youth, Seelah was a slave to the Sith Lord Ludo Kressh, who maintained his lordship on Rhelg. Seelah discovered her Force-sensitivity at a young age, using the Force along with natural talent to become a skilled healer by the age of thirteen. Her ability was noticed by Kressh, and she was soon charged with the care of the Sith Lord's feet, an immensely proud moment for her family. However, unlike her kin, Seelah was not content to be a slave and began to question her lot in life. She was inspired by the ambition of Kressh's nemesis Naga Sadow, and in Kressh's entourage met many people of high status, including a prominent Sith naval captain named Eldrak Korsin. Kressh's rivalry with Sadow, and his aversion to Sadow's desire to stretch the Empire's boundaries, sometimes caused the Sith Lord to fly into drunken rages, and Seelah found herself the recipient of beatings on at least one occasion. Shortly before 5000 BBY, Kressh wounded his ankle in a battle, and Seelah failed to effectively treat the infection. As punishment, Kressh killed her entire family, driving Seelah to escape. She found her chance when one of Sadow's mining teams stopped on Rhelg to refuel and finally left life under Kressh. She connected with a young man in the Sith mineralogical corps named Devore Korsin, the son of the naval captain whom she had met years before. She soon married him, becoming Seelah Korsin, and had a son, Jariad. She secured a place on his mining crew and set to work at his side."}, {"tag": "p", "text": "In 5000 BBY, Korsin, along with an infant Jariad, accompanied Devore on the Sith invasion fleet's Sith dreadnaught Omen, serving as a mining operative—the Omen had been sent on a mission to mine valuable Lignan crystals from the planet Phaegon III's largest moon, an endeavor taking place at the height of the Great Hyperspace War between the Sith and the Galactic Republic. However, the endeavor ended in disaster. A Jedi attack caused the Omen's sister ship, the Harbinger, to bump into the Omen as it jumped to hyperspace. Pushed off-course, the Omen was severely damaged by a gravity well before dropping back into realspace in front of a mysterious world called Kesh. In the immediate aftermath, Devore sent Korsin to save herself and Jariad by escaping the vessel in one of the escape pods. However, as Korsin would soon find out, the pods were inaccessible and non-functioning. Instead, Korsin made her way to the bridge, finding it in chaos as the ever-ambitious Devore struggled with his half-brother, Omen captain Yaru Korsin, over the ship's controls. Along the way, she stopped by the cargo bay, where through the hold's angled viewports she spotted land on the strange world toward which the Omen was headed. Carrying Jariad in her arms, Korsin arrived at the bridge unhurt, but severely shaken. While Devore and Yaru continued to quarrel, Korsin notified them of her discovery of land."}, {"tag": "h3", "text": "Stranded on Kesh"}, {"tag": "p", "text": "As the Omen screamed toward a mountain range, destined to crash, the crew of the Omen took cover—Korsin instead wandered around the bridge in a panic, nearly losing Jariad in the commotion. At the last moment, Yaru pulled her behind the command chair, protecting her as the ship slammed into a granite ridge. Along with her son, husband, and Yaru, Korsin was one of 355 survivors of the crash—she silently blamed Yaru for the disaster. In one night, Korsin and the other remaining crewmembers made their way from the crash site high in the mountains to a clearing below, a march in which twenty-one died along the way. Once the Sith had settled down, Korsin quickly went to work, using her skills picked up as a medic to treat the wounded and incapacitated, many of them Massassi. Meanwhile, her husband Devore caused trouble when he, in a spice-fueled rage, killed the Omen's elderly navigator, Boyle Marcom. When Yaru, desperately trying to keep order among his men, confronted Devore about the attack, Korsin attempted to cover for her husband by claiming that Marcom had attacked first. After an argument between the three about how the Sith should proceed, Yaru went up to the Omen's wreck to hopefully find something that would help them escape—Devore preceded him there, and a confrontation ensued that led to an all-out duel and Devore's death."}, {"tag": "p", "text": "Until Yaru's return to their camp, Devore's whereabouts were unknown to Korsin—all she knew was that he had gone further up the mountain. When Korsin asked Yaru where Devore was, Yaru feigned ignorance, and she realized that her husband was gone and that Yaru had something to do with it. Knowing that the Sith were going to be stuck on Kesh for the foreseeable future, Korsin resolved herself not to underestimate Yaru and to bide her time until she could get her revenge. Although their situation seemed most dire, salvation soon came in the form of a native Keshiri woman named Adari Vaal, who stumbled across the Sith camp while fleeing from religious trouble. Korsin, along with several others, was one of the first to encounter Vaal and telepathically attacked her, ordering her to help the Sith escape the mountains. Korsin was the most aggressive of those probing Vaal's mind, and her furious commands caused Vaal significant distress. It was Yaru who succeeded in bringing Vaal to their side, and the Keshiri agreed to bring them to civilization. Nevertheless, Korsin remained mistrustful of Vaal and voiced to Yaru suspicions that she would abandon them in the mountains. Still concerned about Devore and anxious to get Jariad out of their predicament, Korsin would never lose her distrust of Vaal."}, {"tag": "p", "text": "Vaal succeeded in bringing the Sith to Keshiri civilization, where they posed as the species' gods in order to attract the devotion and subservience of the natives. They were successful in that aim, and the Sith settled in the homes of the Keshiri ruling council, the Neshtovar—Korsin and Yaru moved into the home of the Neshtovar leader, Izri Dazh. Although the Sith thereafter set off to find materials to repair the Omen, they soon found that there were none on Kesh. Though they had escaped from the mountains, it appeared that there would be no such escape from the planet."}, {"tag": "h3", "text": "Deadly scheme"}, {"tag": "p", "text": "Over the coming years, many important changes occurred in Korsin's life. Soon after the Sith's deliverance from their mountain predicament, Korsin married her brother-in-law Yaru, though she resented him and secretly plotted against him out of vengeance for his suspected responsibility in the death of Devore. It was an agreeable arrangement for both sides—the marriage solidified the bonds between Yaru and the Omen's mining crew, although Korsin felt no affection for her husband. Korsin also gained power and influence in the newly-created Lost Tribe of Sith, ensuring that she and her growing son would live comfortably. She also was given a lofty position as the administrator of the Sith sick wards, using her title to gain comprehensive information on every Sith on Kesh. In 4995 BBY, Korsin gave birth to a daughter named Nida, the only child in her marriage to Yaru. Jariad grew to adolescence, and Korsin instilled in him the same hatred for Yaru that she had; together, they bid their time until the day they would avenge Devore's death. While she groomed Jariad to be the next Grand Lord of the Lost Tribe, she actively hampered Nida's learning of the Sith ways, boarding her in various villages with different tutors. While ostensibly an ambassadorial effort, she ensured through this approach that Nida received nothing more than superficial training. Although now twice a mother and subsisting on poorer quality food than that to which she was used, by 4985 BBY Korsin was as fit as ever. Korsin's day-to-day activities were managed by her Keshiri attendant, Tilden Kaah, while she focused on her duties as a medical officer. Korsin put into practice a form of eugenics, meticulously examining each Sith child to determine whether they would be allowed to reproduce, concerned with the gene pool and the aesthetics of future members of the Lost Tribe. Meanwhile, she actively resisted the idea of employing Pureblood Sith as midwives and medical workers, while secretly causing the deaths of all Purebloods born in her wards."}, {"tag": "p", "text": "In 4985 BBY, Ravilan Wroth, leader of the Sith Pureblood contingent of the Lost Tribe, went on a mission to investigate a type of fluorescent algae being harvested in the southern towns of the Ragnos Lakes region. However, word soon reached the Korsins that a disaster had occurred, and the entire population of the town Tetsubal, the first to be visited by Wroth, had mysteriously died. Korsin, along with Yaru and his Houk friend Gloyd, flew to Tetsubal as fast as they could, finding Wroth standing alone amidst the corpses of the city's 18,000 residents. Wroth maintained that he knew nothing about what caused the deaths—Korsin speculated that it might have been an airborne biological agent. When the body of a Human victim, Wroth's assistant, was found, Korsin feared for her life as well. Wroth was adamant that whatever had killed the Keshiri was dangerous to the Lost Tribe, and suggested that the Sith should separate themselves from the natives entirely, an idea that Korsin abhorred. While Yaru and Wroth discussed the matter, Korsin went off on her own, surveying the grim scene before her. She examined the body of Wroth's aide, which prompted a revelation—she had seen symptoms like those before in Humans poisoned by cyanogen silicate. Korsin realized that Wroth was responsible, mounted an avian uvak beast and flew with great haste back to her ward, where she held the last remaining supply of cyanogen silicate on the planet. Seeing her opportunity to finally rid Kesh of the Pureblood Sith, Korsin sent her minions to poison the water supplies of the other towns visited by Wroth's retinue. By doing this, she hoped to convince Yaru that the Purebloods were responsible, and that they were a threat that needed to be eliminated."}, {"tag": "p", "text": "Korsin's plan went off without a hitch. News soon reached the Kesh Sith Temple of thousands of deaths in the targeted cities, shocking all but Korsin. She then decided it was time to put into action the next stage of her plan. She brought a vial of cyanogen silicate to Yaru, proclaiming that the chemical caused the Keshiri deaths. Korsin implicated Wroth—during work on the Omen some time earlier, a Keshiri worker named Gorem had died from accidental cyanogen silicate poisoning. Korsin suggested that Wroth had seen Gorem's death and realized that he had a weapon against the Keshiri, and aimed to frighten Yaru and the other Humans to focus on finding a way off Kesh. Every town visited by Wroth and his retinue had suffered the same gruesome fate, which was enough evidence to convince Yaru, who ordered a wholesale purge of the Pureblood Sith from Kesh. The genocide lasted a single night, in which all forty-five Pureblood Sith in the Lost Tribe were eliminated. Korsin was personally involved in the killing of Hestus, a translator who at one point had worked closely with Yaru. As Yaru and his chief lieutenants drove the Purebloods to a last stand high in the mountains, Korsin visited the captive Wroth, who was being held alive at a public plaza in the city of Tahv. Bloodied and beaten, and still none the wiser to Korsin's machinations, Wroth admitted complicity in the deaths at Tetsubal, but expressed no knowledge in those of the other towns. Korsin revealed to him the entirety of her scheme, as well as her responsibility for the deaths of the Pureblood infants in her creche. As Wroth cursed her name, she left him to die at the hands of Jariad, who had been waiting in the darkness. With the Purebloods gone, Korsin took steps to ensure that knowledge of that faction was erased from existence."}, {"tag": "h3", "text": "Quest for vengeance"}, {"tag": "p", "text": "Over the next decade, Korsin and Jariad continued to plan for their eventual vengeance against Yaru. By 4975 BBY, her belief and suspicion that Yaru was responsible for Devore's death had given way to complete certainty. Upon her first meeting with Adari Vaal high in the mountains, Korsin had rifled through the Keshiri's mind—coincidentally, Vaal had encountered the memory of an uvak-mounted Yaru throwing Devore off the side of a cliff, killing him. Upon contemplation of what she had seen in Vaal's mind, Korsin realized just what the Keshiri woman had witnessed. At that time, the Lost Tribe was in a major transition. Attempts to find a way off Kesh had borne no fruit, leading Yaru to make the decision that the Lost Tribe would live among the Keshiri for good. With no reason to stay near the shattered and inoperative Omen, the Lost Tribe began a full-scale transition away from their mountain temple in favor of the cities below. This move was announced and celebrated in a formal ceremony in the old Circle Eternal plaza of Tahv, where before masses of cheering Keshiri the Lost Tribe expressed their commitment to Kesh. Korsin attended the event along with Yaru, who had not touched her in years; Jariad, who had come of age and had gained popular support as the successor to Yaru's Grand Lordship; and Nida, whom Korsin perceived to be a useless bumbler, there as the leader of a uvak-riding hobby club called the Skyborn Rangers. During the ceremony, Korsin gave a secret message to her son, telling him that the time for revenge was soon to come."}, {"tag": "p", "text": "Soon thereafter, Korsin and Jariad implemented the first part of their plan: misdirection. After thoroughly thrashing a group of Sith Saber warriors in an exhibition battle, Jariad declared to Yaru that he was taking them on a training mission to the Northern Reaches. They would thus ensure that Yaru, even if he did suspect that his wife and stepson were up to something, would not expect them to strike at that moment. As Yaru paced the Sith Temple, accompanied by only Gloyd and four bodyguards, Korsin decided that it was time. She drew Yaru's attention, and Jariad descended upon Yaru and his retinue with the Sith Sabers he had \"defeated\" earlier in the day. While Jariad faced his stepfather down, Korsin loudly accused Yaru of killing Devore. However, Korsin did not anticipate what came next. As it happened, Korsin's grab for revenge coincided with an operation by a Keshiri resistance movement, secretly led for years by Adari Vaal. The rebel mission, headed by Vaal herself, planned to steal the Lost Tribe's uvak beasts and fly them to their doom, crippling the Lost Tribe's ability to move and setting up an armed uprising. While Korsin and Jariad confronted Yaru, Vaal and crew made their move, stealing the uvak and flying them away from the temple. The flight of the beasts distracted several of Jariad's Sabers, allowing Yaru and his retinue a chance to make a run for it. While Korsin watched, Jariad and the Sabers chased after Yaru, who soon found himself separated from his dear friend Gloyd. Yaru fought back fiercely, aided by the valiant resistance of his bodyguards and the insufficient training of Jariad's Sabers."}, {"tag": "p", "text": "Although Korsin had taken an active role in the purge of the Pureblood Sith ten years before, during the attack on Yaru she stayed out of the fray and observed the action. As the battle came to a head and Yaru found himself wounded and cornered, he revealed the last trick up his sleeve. Riding on uvak-back, Nida and the Skyborn Rangers descended onto the scene, proving themselves to be much more than a group of hobby riders. Although Korsin had done her best to curb Nida's training in the Sith ways, Yaru had taken the initiative to secretly groom her as his eventual successor, and throughout the years she secretly became adept in the dark side. With Yaru's enemies flushed out into the open, Nida and the Rangers routed Korsin's force. As Yaru and Jariad faced off for the final time, Gloyd brought the fight to Korsin's observation post. Cornered, Gloyd detonated a proton detonator, bringing down the entire room. The blast knocked Korsin out—she later awoke in her old sick ward, having permanently lost the use of her legs. She was only accompanied by Nida, who explained that while Yaru had died from his injuries, she had personally killed Jariad. According to Yaru's final will and testament, recorded with his dying breaths, the Grand Lord passed on his legacy, and leadership of the Lost Tribe, to Nida. As her first act as Grand Lord, Nida ordered that the Tribe immediately remove itself from the mountain and barricade the path, leaving Korsin to live out the rest of her days alone in the Sith Temple. Regular uvak overflights would provide necessary supplies, but without the use of her legs, she would never leave the mountain."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "At some point over the coming years, Seelah Korsin died alone in her old wardroom high in the mountains. Although any monuments to her were removed after her failed coup, as of 3000 BBY she had become revered by an all-female political faction known as the Sisters of Seelah, who revered her as the true founder of the Lost Tribe. By that time the reading of Yaru's last testament had become a major event, taking place once every twenty-five years. Iliana Merko, leader of the Sisters of Seelah, was indignant at the omission of Korsin's accomplishments from the common record and was determined to change that. Merko was inspired by an incident in her youth, where she saw a Force vision of Korsin washing Ludo Kressh's feet, and the specter of Korsin asked Merko to avenge her. To this end, Merko accosted Varner Hilts, caretaker of Yaru's testament, to change the document's wording to declare that Korsin and those who followed her were the legitimate heirs to power on Kesh. However, her endeavor was unsuccessful—as Merko was too young to have experienced the festivities of Testament Day, she failed to realize that the testament was actually a recording of Yaru in his dying moments, and a forged document would not suffice. Another faction, Force 57, remembered Korsin quite differently. The group was named after the Pureblood group that Korsin had wiped out millennia before, who were known as the \"Fifty-seven\" due to the fact that only fifty-seven of their rank survived the first nights after the crash of the Omen. Feeling kinship with the Fifty-seven, the faction was comprised of misshapen and blemished Humans that demonized Korsin for wiping out their forebears."}, {"tag": "p", "text": "As it happened, Force 57, along with the Sisters of Seelah and another sect called the Korsinite League, saw Yaru's testament as a means to further their political goals. They pressured Hilts to play the recording of the testament for them and thus stumbled across a hidden message below Yaru's words. It was in fact a briefing from Naga Sadow dating to before the Omen's mission to Phaegon III, revealing the idolized Grand Lord as a mere servant of the Sith Empire. While all who witnessed this development swore it to secrecy, word reached the Keshiri populace and resulted in mass riots and upheaval, infighting that tore apart the Sisters of Seelah. In search of something that could save Kesh, Hilts, along with Merko and several others, went into the mountains to Korsin's final resting place and the remnants of the Omen. The first to tread in the area for millennia, their route took them through her wardroom. There, they discovered Korsin's skeletal remains, which greatly distressed Merko, who realized that her idol had been trapped there and died alone and wretched. In a fit of rage, Merko smashed Korsin's bones to pieces with the Force, leaving only her Tapani commitment band, which Merko took as a keepsake. Twenty-five years later, on the far-off continent of Alanciar, the personal memoirs of Adari Vaal, who had made her way to the land after the failure of her resistance movement, were discovered. These pages included notes on Korsin, specifically describing the psychological torment that she inflicted upon Vaal."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Above all, Seelah Korsin was intensely loyal to both her husband, Devore, and her son Jariad. Although Devore could be rather dismissive of her, she was crushed by his death and stayed by his side, devoting the rest of her life to avenging his death. Though she acknowledged Devore's immaturity and recklessness, she saw plenty to work with and united with him in a common ambition. As for Jariad, she did all she could to ensure her son's station in life and security, even going so far to marry the man she hated the most, Yaru Korsin. Even though she had no real proof, Korsin correctly believed from the start that Yaru was responsible for her beloved husband's death, and she was determined not to underestimate the man as Devore had done. She focused all her hate, anger, and will against Yaru and bided her time until she could eventually serve revenge on the man who had killed her husband. Korsin distrusted Adari Vaal from the start, hating her with a furious animosity that would never leave her, putting the Keshiri through psychological torment from the moment they met. Although Vaal and Yaru were close, Korsin never suspected infidelity and was content to allow them to waste their time with one another. Korsin was obsessed with physical perfection, working very hard to achieve it for herself and to ensure it for future generations of Sith. She respected the abilities of the Keshiri to act as laborers and assistants, doubting that the Lost Tribe could survive without them, even though she found them unattractive. She was personally aided by the Keshiri Tilden Kaah, who was very physically attracted to her—Korsin enjoyed teasing him, one of the rituals that started her day."}, {"tag": "p", "text": "Korsin was extremely cunning and manipulative, able to form and execute complex plans, pitting people against one another along the way. She displayed this skill in her engineering of the purge of the Pureblood Sith in 4985 BBY, framing Ravilan Wroth and his kin for the deaths of thousands of Keshiri, convincing Yaru to wipe the whole group out, all without anyone discovering her treachery. Korsin held an intense loathing for the Purebloods—to the point that she willingly engineered genocide—and sought to separate her new Lost Tribe from its more diverse predecessor, ensuring that their infants born in her wards never reached adulthood, culminating in her purge. She also hid her hatred of Yaru from him, playing the part of wife and mother until she could get her chance at vengeance. Meticulous in her attention to detail, Korsin had a good memory, especially when it came to lineage, a trait that she put to good use in her duties at the Keshiri medical wards. She was proud of her healing work and became apprehensive if anyone, especially Yaru, infringed upon it. Korsin was extremely ambitious, even from a young age. She greatly admired the Dark Lord Naga Sadow, respecting his efforts to expand the power of the Sith and seeing him as a visionary. She aspired to a higher station in life and made sacrifices to reach her goals, such as marrying Yaru and having a daughter with him to provide security and opportunity for both her and her son Jariad. Although Korsin treasured Jariad, she held no such love for Nida, seeing her as her daughter only in terms of genealogy. Ever concerned with superficial beauty, she resented her daughter's perceived lack of style and saw her as a threat to Jariad's claim to Grand Lordship."}, {"tag": "p", "text": "Neverthless, for all her cunning and plotting, Korsin was eventually outsmarted by Yaru and Nida. While she strove to create a perfect Sith Tribe with herself and Jariad as its leaders, Yaru had been secretly training Nida to succeed him right under his wife's nose. For Korsin, it was a bitter irony, as the daughter she so reviled outsmarted her, leaving her to waste away alone in the mountains. In the end, she was not above begging her daughter, trying to play on a filial bond that they never had, for her to spare her. Korsin had darker skin than either Yaru or Devore Korsin, and auburn hair."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "An experienced healer, Seelah Korsin functioned as well on a battlefield or in a disaster zone as she did in a sterile ward, with a calm bedside manner—except when dealing with Pureblood Sith, whom she despised. Being Force-sensitive, she was adept in the use of the Force, able to—as she did with Adari Vaal—assail someone's mind and rifle through her target's subconscious, along with sensing the presence of those around her. Above all, however, Korsin used the Force mainly to augment her natural talent as a healer. Her pursuits were aided by her analytical mind and keen eye for genetics, which bolstered her efforts to maximize the physical beauty of future Lost Tribe generations. She was also somewhat proficient in combat, as evidenced by her takedown of Hestus in the purge of the Pureblood Sith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Seelah Korsin first appeared in John Jackson Miller's 2009 eBook Lost Tribe of the Sith: Precipice, the first in the nine-part Lost Tribe of the Sith series. Korsin went on to be a main character in the next three installments of the series: Skyborn, Paragon, and Savior. After her final appearance in Savior, she was mentioned in three subsequent sequels, with her skeletal remains appearing in Secrets. Korsin was also mentioned in the 2012 reference book The Essential Reader's Companion. John Jackson Miller, in his endnotes for Paragon, described Korsin as one of the most evil characters he ever wrote, and in his endnotes for Savior, he revealed that Korsin's death tied in with the concept of the death of the Grand Lord's spouse previously created by the authors of the Fate of the Jedi series of novels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}