{"url": "See/Legends", "categories": ["Category:Legends articles", "Category:Creatures of Naboo", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Scalefish"], "nodes": [{"tag": "h1", "text": "See"}, {"tag": "p", "text": "The see, also known as a binocular fish, was a non-sentient, predatory scalefish native to the oceans of the Mid Rim planet Naboo. It was a long thin fish that possessed large blue eyes and a stomach that could distend to accommodate larger meals. With these eyes, the see was capable of binocular vision. The fish also possessed green and yellow scales across the length of its body."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The typical see was distinguished by its binocular vision —with both eyes located on the front of their blunt heads—and green and yellow scales. Their long, thin bodies were dominated by their stomachs, which could distend to accommodate large meals, including those as large as itself, like Laas and Daggerts. Males of the species were distinguished by their darker yellow bodies, while the females were lighter in tone."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "See evolved in the lakes and oceans of the planet Naboo, and were present in Lake Paonga shortly after the Invasion of Naboo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The see, along with various other musically-inspired scalefish, such as the doo, ray, mee, faa, laa and tee, first appeared in the 1999 prequel trilogy film Star Wars: Episode I The Phantom Menace, and other associated media. The fish could be caught in lakes on Naboo along with mee, gooberfish, fatfish, and gumfish in Star Wars Galaxies to acquire the title of “Nabooinan Angler”. The see were later seen as a hologram alongside two mee in a holographic nursery mobile in an episode of Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}