{"url": "Sel-Makor", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Force entities", "Category:Individuals of unidentified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sel-Makor"}, {"tag": "p", "text": "Sel-Makor was a mysterious dark side entity that resided in the Dark Heart on the planet Voss. Created when the Jedi influenced the native Gormak by teaching some of them to use the Force, Sel-Makor began to gorge itself on the suffering and anger that resulted from the Gormak rising up against Sith invaders, and soon spread its corruption to form the region known as the Nightmare Lands. Influencing the Gormak into waging war on the newly created Voss, Sel-Makor's power and influence spread outward, aided by the various avatars and minions he used as physical forms. When the Gormak king Jokull entered the Nightmare Lands, Sel-Makor gave him the power to see the future as the Voss did, and influenced Jokull to build a starship to escape to the stars and a cannon to destroy the Voss in their mountain city."}, {"tag": "p", "text": "However, when the Galactic Republic and the reconstituted Sith Empire began to aid the Voss in their fight against the Gormak, the Voss discovered the existence of Sel-Makor and the truth about their species. Sel-Makor's avatars were destroyed at the hands of outsiders, and he was left without a host until the Sith Emperor was lured into a trap by the Sith Lord Darth Baras. The Emperor was imprisoned in the heart of Sel-Makor's domain, unable to escape as he battled the entity for control of his host body. The Emperor was freed by his Wrath, who killed the Sith ruler and released the Emperor's essence after battling Sel-Makor."}, {"tag": "p", "text": "Sel-Makor's end came at the hands of the Emperor's mortal enemy, the Jedi Knight known as the Hero of Tython, and a Voss Commando named Tala-Reh. The Emperor's servant Lord Fulminiss enlisted the entity's aid in releasing a plague of madness across the planet, but the Mystic Valen-Da manipulated events so that the Hero and Tala-Reh were able to confront Fulminiss at the heart of Sel-Makor's power before the plague could be unleashed. When Fulminiss fell in battle with the Knight, Sel-Makor's attempts to bribe the Jedi with unimaginable power failed, and the entity was destroyed once and for all when Tala-Reh sacrificed her life to end Sel-Makor's own."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Beginnings"}, {"tag": "p", "text": "Sel-Makor's origins could be traced to ancient times, when the Sith first invaded the planet Voss. At that point, the planet had only one native species, the Gormak, which the Sith ignored as they began to harvest the world's resources. However, the planet and the Gormak were irrevocably changed when the Jedi attempted to drive the Sith off of Voss. Seeking allies among the natives, the Jedi agreed to teach some of the Gormak tribes how to use the Force, but the Gormak were unprepared for the knowledge. Those tribes underwent radical evolutionary changes in the course of a few generations, becoming a new species named the Voss. The Jedi attempted to teach the Voss how to control their emotions and new powers, but the Voss instead attacked the Sith on the planet, bringing the new species in contact with the dark side of the Force. This caused the dark side to manifest in a Sith structure on the planet, and this entity came to take the name Sel-Makor as it gained intelligence."}, {"tag": "p", "text": "Sel-Makor began to feed on violence and suffering, fueling its dark side powers and spreading corruption across the surrounding area. The entity, which developed a masculine personality, twisted the minds of the animals and beings within his reach, and they became his crazed servants. The area under Sel-Makor's control became known as the Nightmare Lands, and the ancient Sith complex that the entity inhabited was known as the Dark Heart. Not long after his creation, Sel-Makor captured the spirits of two of the Gormak who had been taught by the Jedi, Damek-Ol and Nemok-Ta, and imprisoned their spirits in slave bodies. Damek-Ol was imprisoned in the body of a Dashade, while Nemok-Ta was placed in the body of an Abyssin, and the two became avatars of Sel-Makor's power."}, {"tag": "p", "text": "After the extermination of the Sith, the Voss founded the city of Voss-Ka atop the planet's highest peak, and the Jedi eventually died out or departed. Those Voss who could use the Force to see into the future became known as the ruling Mystics, and the Voss commandos protected the city. Sel-Makor, meanwhile, influenced the Gormak's bloodlust and drove the far more numerous species to attack their cousins throughout the centuries so that he could feed off of their dark emotions."}, {"tag": "h3", "text": "Outsiders"}, {"tag": "p", "text": "Around 3645 BBY, during the Cold War between the resurgent Sith Empire and the Galactic Republic, the planet of Voss was rediscovered by the galaxy as a whole. Upon learning of the Voss' prophetic abilities, the Sith Emperor arranged for an Imperial attack on the planet while his agents kidnapped one of the Mystics. The Voss obliterated the attacking fleet from orbit, and both the Republic and the Empire established diplomatic presences on the planet in an attempt to lure the powerful species from their neutrality."}, {"tag": "p", "text": "Around the same time, a Sith Lord named Darth Baras began to plot to seize control of the Empire, and so began a long con on the Emperor. Learning of Sel-Makor's existence, Baras met with the entity and promised the Emperor's powers if Sel-Makor would imprison the Emperor when Baras managed to draw the Sith ruler there. Knowing that his ruler was inhabiting the body of a Voss, as the Emperor existed by possessing hosts known as the Emperor's Voices with his consciousness, Darth Baras learned that the inner chamber of the Dark Heart was a place where no Voss could leave after entering."}, {"tag": "p", "text": "Both galactic powers ignored the Voss' warnings not to enter the Nightmare Lands as their Cold War continued, and Sel-Makor soon brought those who entered the region under his control. At some point during the Cold War, a Gormak by the name of Jokull entered the Nightmare Lands and traveled to the Dark Heart itself, where he entered the caves known as the Dark Hollow and the Grim Warrens—two of the places where Sel-Makor was most powerful. But instead of consuming the Gormak's mind like he had done to so many Voss, Sel-Makor instead chose to awaken within Jokull his species' natural ability—the power to see visions as the Voss did. Horrified that he had been corrupted and seeing all Voss as being marked with evil because of their powers, Jokull returned to the Gormak Lands and became king of his people in order to wage war upon the Voss—so that the Gormak would never be corrupted like he was."}, {"tag": "p", "text": "In an effort to gain an alliance with the Voss, both the Republic and the Empire lent aid to the Voss in their fight against the Gormak. The Sith aided the Voss in destroying Gormegan-1, a starship being built by the Gormak on Jokull's orders, and the Republic helped the Voss to destroy the cannon the Gormak were building to use against Voss-Ka. However, in the process, the Voss discovered Jokull's ability to see the future, and they enlisted the aid of outsiders in retracing the Gormak king's steps in the Nightmare Lands. In the Dark Hollow, an outsider fought and killed the Dashade avatar, while another defeated the Abyssin avatar in the Grim Warrens, and the Voss soon learned the truth of their species' creation."}, {"tag": "h3", "text": "The Emperor"}, {"tag": "p", "text": "Throughout the Cold War, Darth Baras began to feed the Emperor information on Sel-Makor's powers, tempting the Sith ruler with knowledge of the dark entity's mysterious abilities, until finally the Emperor decided to investigate around 3640 BBY. Arriving on Voss in the guise of a Mystic, the Emperor entered the Dark Heart only to find that he was trapped just as Baras had planned. While Baras began preparations to declare himself the Voice of the Emperor and therefore the supreme ruler of the Empire, the Emperor was forced to battle Sel-Makor for control of the Voss body he was inhabiting. Weakened by the loss of his avatars and desiring the Emperor's unimaginable power, the entity prevented him from releasing his spirit by committing suicide and attempted to suppress the Sith's mind."}, {"tag": "p", "text": "Fortunately for the Emperor, Baras' apprentice had been appointed the new Emperor's Wrath at the Emperor's request by agents of his Hand, and the Emperor was able to communicate his situation to Servant Two of the Hand in a moment of strength. The Wrath, whom Baras had tried to kill at the beginning of his coup attempt, traveled to Voss and was able to locate the Emperor in the Dark Heart after gathering the Blessing of Oneness and the Pendant of Bone needed for entrance. The Emperor ordered his Wrath to kill the Voice and free his essence, but Sel-Makor refused to allow his prize to escape and seized full control of the Voice's body. The Wrath was forced to battle the possessed Voice and the dark side phantoms that Sel-Makor conjured, but managed to defeat the entity and drive him out of the Voice long enough to slay the Emperor's host."}, {"tag": "h3", "text": "The Knight"}, {"tag": "p", "text": "After taking a new host on the Imperial capital of Dromund Kaas, the Emperor continued preparations for his ritual, which would consume all life in the galaxy and channel it into the Emperor. To that end, he dispatched the Sith sorcerer Lord Fulminiss to Voss, ordering the Sith Lord to utilize Sel-Makor's powers to ensure the thousands of simultaneous deaths necessary to start the ritual. Fulminiss approached a young Mystic named Valen-Da and enlisted his help to enter the Voss sanctuary known as the Shrine of Healing. Valen-Da had experienced a vision of himself and two others standing at the brink of a chasm, and saw that one of them would have to cast themselves into the pit in order to destroy Sel-Makor, agreed to help the Sith because his vision demanded it."}, {"tag": "p", "text": "In the Shrine of Healing, Fulminiss learned a healing ritual from the spirits of long-dead Mystics, but he corrupted the ritual so that it twisted minds and drove its victims insane. With Valen-Da, Fulminiss followed his master's instructions and traveled to the Dark Heart in order to meet with Sel-Makor. However, the Jedi Knight known as the Hero of Tython was attempting to foil the Emperor's ritual, and the Jedi tracked Fulminiss to the Dark Heart with the help of the Voss Commando Tala-Reh. The Hero had also killed the Gormak Guardian, a massive vorantikus that Sel-Makor had been using as an avatar to corrupt the Gormak. Upon learning of Valen-Da's treachery when the Jedi and the Voss arrived, Sel-Makor ordered Fulminiss to cut down the Mystic."}, {"tag": "p", "text": "Fulminiss failed, however, and fell to the blade of the Jedi Knight in battle. Valen-Da then revealed the truth of his vision to Tala-Reh and the Jedi: the Commando would descend into the pit before them, the heart of Sel-Makor's power, and destroy the entity once and for all at the cost of her own life. In a desperate attempt to save himself, Sel-Makor offered unimaginable power to the Jedi in exchange for casting Valen-Da into the pit, but the Knight refused and watched as Tala-Reh descended the steps to confront the entity. Her sacrifice counteracted Sel-Makor's powers, destroying the creature with a burst of golden Force energy and sealing the heart of power when the chamber collapsed onto the pit."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sel-Makor was born from the dark side of the Force itself, and the entity's sole purpose was to cause suffering so that he could spread his corruption further. As he fed off of the suffering created by the conflict between the Voss and Gormak, Sel-Makor's driving goal was to prolong that conflict eternally. He had no concern for galactic events, and took no sides in the conflict between the Jedi and the Sith—Sel-Makor attempted to steal the Emperor's powers and body, but not long afterwards he worked with the Emperor's servant Lord Fulminiss to destroy the Voss and Gormak simply because the Sith sorcerer promised bloodshed and violence."}, {"tag": "p", "text": "While intelligent, Sel-Makor had a unique way of speaking: he rarely formed complete sentences, instead uttering single words and short phrases in an attempt to communicate. When faced with death, Sel-Makor was unable to defend himself once Lord Fulminiss was killed, and his fear drove him to beg for aid from the Jedi Knight. Sel-Makor offered the Hero unlimited power if the Jedi would kill Valen-Da, but when the Knight refused Sel-Makor was only able to roar in fury and fear when Tala-Reh descended to destroy him."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "An entity formed from the Gormak's first contact with the dark side of the Force, Sel-Makor lacked a physical form. Therefore, he corrupted and twisted the minds of those within his realm, transforming them into his servants and spreading the corruption of the Nightmare Lands. Sel-Makor's center of power was a deep pit within the Sith ruins that became the Dark Heart, though his reach extended to the edges of the ever-growing Nightmare Lands. The entity also possessed various beings and creatures to serve as his avatars and minions, which allowed him to spread his power and influence beyond the Dark Heart and take a more active role in the corruption of Voss."}, {"tag": "p", "text": "As a being born of the Force, Sel-Makor possessed immense power, enough to match the Sith Emperor in a battle of wills and the Force. The Emperor, whose own abilities were beyond that of most beings in existence at the time, was unable to overcome Sel-Makor's influence and was instead locked in a stalemate with the entity over control of his body. In battle, Sel-Makor could summon phantoms and his own twisted minions, but without a body or avatars he was largely defenseless. After the death of his avatars, Sel-Makor was unable to stop Tala-Reh from descending into his heart of power—he could only rage at the Voss Commando as she sacrificed herself to destroy him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sel-Makor first appeared in the video game Star Wars: The Old Republic, where he is featured throughout several class missions and general missions on the planet Voss. In the Republic quest series, players confront a Dashade \"Avatar of Sel-Makor\" in the Dark Hollow, and they learn about Sel-Makor's past from the spirit of Damek-Ol. Imperial players, on the other hand, fight an Abyssin Avatar in the Grim Warrens and speak to Nemok-Ta's spirit. Sel-Makor also appears in the Sith Warrior and Jedi Knight class storylines on the planet—the Emperor is imprisoned by Darth Baras in the Dark Heart, and the Warrior is forced to battle Sel-Makor takes control of the Emperor's host body. The Jedi Knight discovers late in the class storyline that Sel-Makor is working with Lord Fulminiss, and after defeating the Sith the player is presented with the dark side option of sacrificing Valen-Da to Sel-Makor instead of Tala-Reh. If the player chooses to kill Valen-Da instead of the light-side option of allowing Tala-Reh to sacrifice herself, then they must kill the Commando when she attacks the Knight in revenge, and Sel-Makor spreads his corruption across all of Voss."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}