{"url": "Seismic_charge/Legends", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Bombs", "Category:Sonic demolitions", "Category:Weapon types"], "nodes": [{"tag": "h1", "text": "Seismic charge"}, {"tag": "p", "text": "A seismic charge (also sonic mine or sonic charge) was a weapon released from a starship, capable of unleashing a devastatingly explosive shock wave. Seismic charges were commonly filled with a mix of baradium and volatile collapsium gas."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "A few seconds after launch, a seismic charge would detonate into a blue ball-shaped explosion which had the unusual side-effect of drawing in all sound from a given area around it. This small explosion soon collapsed in upon itself before releasing a shock wave of energy that would obliterate material in its path. They were particularly effective in asteroid fields, enabling the pilot to clear an area of hazardous asteroids. Such seismic waves were even capable of penetrating thin durasteel plating, such as the Void-7 seismic charge produced by Krupx Munitions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The sound from an explosion of this weapon is an interesting take on the Star Wars \"ignorance\" of the fact that there is no sound in a vacuum. There is no sound at the start of a blast, but there is still the impossible phenomenon of sound in space afterward. The idea during the production of Episode II was that the charge would suck in and absorb all the sound around it (such as the sounds of Obi-Wan Kenobi and Jango Fett's ships during their fight in the Geonosis asteroid belt), and then release them in a sonic explosion, resulting in the shockwave effect heard in the explosion sound."}, {"tag": "p", "text": "In Star Wars: Battlefront, Wookiee time bombs bear a strong resemblance to Krupx Munitions Void-7 seismic charges."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}