{"url": "Selby_Jarrad", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:New Republic Intelligence personnel"], "nodes": [{"tag": "h1", "text": "Selby Jarrad"}, {"tag": "p", "text": "Selby Sel Jarrad was a female Human native of Averill and a New Republic Intelligence agent sent to Verkuyl by the New Republic in an attempt to liberate the planet from the Galactic Empire in 7 ABY. She along with Claris and their commanding officer Cobb Vartos were sent to force Governor Parco Ein to surrender Verkuyl to the New Republic or die. She split up from Vartos during a reception for bidders to the new bacta manufacturing plant Ein had asked to be built, so Vartos could thoroughly reconnoiter the reception and then to reconnaissance the Hall afterwards. Three hours, two plates and endless bidder chitchat later, Sel slipped out of the reception to find Ein's office, discovering and dismantling a dozen security sensors before reaching the office. She effectively planted a tiny eavesdropping device hidden within her necklace after she enlisted the aid of a cleaning droid which dropped the eavesdropping device into Ein's wastebasket near his desk."}, {"tag": "p", "text": "After completing the first part of the mission, she was nearly caught by one of Ein's aids, Daven Quarle who inquired whether she had the wrong floor. To avoid any Imperial entanglements, she told him that she was up so high in the Verkuylian Imperial Governor's Hall to see the view and that the turbolift would not take her to the roof of the building. Quarle willingly offered to take her to the roof and she agreed and accompanied him to the roof of the Governor's Hall. She didn't like in that moment that she couldn't tell a sincere offer from a lie. Sel was surprised that Quarle had just wanted to stargaze with her and even more surprised at how pleased she was to just talk to him and not have to worry. During their conversation she inquired what he would do if he were in control of Verkuyl after learning that it was his homeworld and that he had never left it. He escorted her to her room after their conversation after being interrupted by another of Ein's aides Jorli. Sel didn't want to have a confrontation between herself and Quarle as enemies and she was relieved to learn that Quarle was a resistance fighter with the Verkuylians from Vartos."}, {"tag": "p", "text": "The next morning she learned that Claris had been arrested and his transmission captured as she was on a turbolift to meet with Ein. Attempting to meet with Ein proved difficult as she was denied access to him by his guards and was forced to reschedule her appointment. She left to rejoin with Vartos only to come across him and Quarle being arrested by stormtroopers. Before she could kill the stormtrooper arresting Vartos she was ordered to stop by another. The troopers order was not enough to deter her from attempting to free Vartos as she fired on the trooper arresting him. After the first shot she dove for cover and came back up firing killing the first trooper and providing enough of a distraction by destroying the lighting switch to the room for her and Quarle to escape, but not without being wounded in the arm from a stray blaster bolt. Sel and Quarle fled from another pair of troopers and successfully evaded them with after Quarle led the two of them into the secret passages of the Governor's Hall. Her arm was patched up by Quarle who told her of his grandfather and why the people of Verkuyl had been so resistant to repelling the Empire. Quarle left her to seek a way to a terminal to contact the New Republic fleet in waiting outside of the Verkuyl system. She was shocked to find Quarle a double agent working for Ein who ordered Quarle to stall her until an Imperial fleet could arrive to reinforce Verkuyl. Sel was stunned by Quarle's opinion on the Republic and was forced to stun him with her blaster and tie him up while she contacted the Republic fleet, successfully completing the mission in the process. After the liberation of Verkuyl, she didn't feel as good about it as she thought she should, but was pleased that both Vartos and Claris had made it out alive."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}