{"url": "Sei_Taria/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Clerical workers and assistants", "Category:Coruscanti", "Category:Females", "Category:Galactic Republic bureaucrats", "Category:Humans", "Category:Spira residents"], "nodes": [{"tag": "h1", "text": "Sei Taria"}, {"tag": "p", "text": "Sei Taria was a Human female from the planet Spira who served as Finis Valorum's Staff Aide during the latter's tenure as Supreme Chancellor of the Galactic Republic. Taria worked for the Office of the Supreme Chancellor on the galactic capital world of Coruscant as early as 37 BBY, a post in which she helped Valorum follow the Republic's myriad bureaucratic policies and procedures. Taria became Valorum's lover, and she often accompanied him to social events as well as on diplomatic missions. In 37 BBY, she helped the Chancellor prepare for a visit to the capital by Baroness Omnino of the planet Vena by arranging a Jedi escort for the woman."}, {"tag": "p", "text": "In 33 BBY, as Valorum's popularity and hold on power waned, Taria helped him weather such conflicts as the Yinchorri Uprising and the terrorist actions of the renegade Nebula Front. However, she also grew close to Senator Palpatine of Naboo, a rising star in the Galactic Senate, in whom she could sense increasing power. When Palpatine and Valorum drafted a resolution to tax free trade routes in order to appease both the Nebula Front and its enemies in the Trade Federation, Taria studied the proposed tax bill and additionally accompanied the Chancellor to a trade summit on the planet Eriadu that was organized to finalize the proposed legislation."}, {"tag": "p", "text": "The summit was prematurely adjourned when the entire Trade Federation Directorate was assassinated, and Taria, despite being soon after assaulted by agents of the terrorist organization known as the Flail, dedicated her time to gathering information on the Federation's new Neimoidian leaders. The Neimoidians launched an Invasion of Naboo in 32 BBY as a means of protesting the taxation of free trade routes, and when bureaucratic procedure prevented Valorum from immediately sending aid, Taria could only watch from the Chancellor's Podium of the Senate Building's Grand Convocation Chamber as a Vote of No Confidence ousted him from power. Although he was replaced by Palpatine, Taria chose to leave political life."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Political ascent"}, {"tag": "p", "text": "The Human female Sei Taria hailed from the planet Spira and lived during the last decades of the Galactic Republic. By 37 BBY, she had begun a political career in the Republic's Office of the Supreme Chancellor. Based on the galactic capital world of Coruscant, Taria worked directly for Supreme Chancellor Finis Valorum as his Staff Aide and a close advisor. In these capacities, she researched the procedural regulations of the Republic's bureaucracy and assisted Valorum in confirming and following them. Taria additionally accompanied him on many diplomatic missions, attended official meetings of the Galactic Senate, and occasionally spoke publicly on the Chancellor's behalf. The two became lovers, and rumors of their affair reached the ears of others on Coruscant. As the Chancellor's Staff Aide, Taria was a considerably wealthy woman."}, {"tag": "p", "text": "In 37 BBY, Taria prepared for a diplomatic visit to Coruscant from the planet Vena's Baroness Omnino, whom Valorum hoped to convince to join the Republic, thereby providing Coruscant with resource shipments from her home system. Taria took precautions to ensure that the Baroness was not followed to the capital world by the radical Vena Isolationists, who had marked their ruler for assassination. Taria's offer of a Jedi escort was refused by Omnino, but Taria nevertheless arranged for Jedi Master Qui-Gon Jinn to pose as one of the Senate Guards who awaited the arrival of the Baroness's starship on a Coruscant landing platform."}, {"tag": "p", "text": "As the ship touched down, Taria and Valorum stood on the platform and mused on Omnino's reasons for visiting. After their guest disembarked, she was greeted by Valorum just before one of her bodyguards was fired upon by a renegade Senate Guard, who fled and was killed while trying to escape from Jinn's nearby Padawan learner, Obi-Wan Kenobi. An angered Omnino made her way to Coruscant's Holographic Zoo of Extinct Animals to await the arrival of her son, Sando, but when a Republic beacon received a distress signal from Sando's freighter, Taria and Valorum proceeded to the zoo to let the Baroness know. Jinn and Kenobi were immediately dispatched to investigate, and they eventually discovered that Omnino had used a mind control device to influence her bodyguard's assassin as part of a plot to destabilize the Republic and discredit the Jedi Order, whom she blamed for the death of her husband. Jinn foiled her by severing her head."}, {"tag": "p", "text": "Four years later, the Yinchorri species staged an uprising against the Republic due to the manipulations of the Sith Lord Darth Sidious, who hoped that the conflict would simultaneously kill Jedi and check the Yinchorri's warlike ways. Several battles occurred between Jedi and Yinchorri forces, and Chancellor Valorum proposed to the Senate an embargo of the planet Yinchorr. While the embargo was under consideration, Taria and Valorum attended a senatorial gathering at the 500 Republica tower in the apartment suite of Palpatine, senator of Naboo. Palpatine was a close political ally of Valorum's; however, unbeknownst to the galaxy, he was in fact Darth Sidious, the mastermind of a plot to seize control of the Republic. The Sith Lord greeted his guests, and Taria deviously complimented him on both his modesty and his choice of attire. Palpatine then led them into the crowd of guests, and, after receiving a drink, Taria left her companions and began to converse with the wife of Alderaanian Senator Bail Antilles."}, {"tag": "p", "text": "Valorum was ultimately forced to call in many political favors in order to see the embargo passed. He and Taria met with a group of senators in a restaurant, where the Chancellor received confirmation that they would support his proposal. Taria gave Valorum a datapad, which he used to converse with Jedi Master Yoda and share the news. Valorum also sent four attack groups of the Republic's Judicial Forces to assist the Jedi, and the Yinchorri were defeated. Taria continued to follow Palpatine's rising political star, and she grew close to the charismatic Senator. Taria viewed him as a mentor and learned much from him, and rumors persisted that she was romantically involved with Palpatine's aide, Kinman Doriana. At one point, Taria was mentioned in a HoloNet report that also featured Senator Antilles."}, {"tag": "h3", "text": "Trade troubles"}, {"tag": "p", "text": "Later in the year, a terrorist organization known as the Nebula Front began to launch militant strikes on the Trade Federation, a corporation believed by the Front's members to hold an unfair monopoly on galactic trade. Together with Palpatine, Valorum hatched a plan to subject free trade routes to Republic taxation in exchange for granting the Federation's request to augment their battle droid defenses. They hoped that such taxation would limit the Federation's power, appease the Nebula Front, and additionally enrich the Republic's outlying star systems. Taria assisted the Chancellor with his plan by studying the proposed tax bill. Before the matter was brought to the Senate, Taria accompanied Valorum to a performance of the opera The Brief Reign of Future Wraiths at the Coruscant Opera. Their arrival at Valorum's balcony was delayed so that the Chancellor would be the last guest to be seated, but the entire audience stood up to applaud him upon their arrival. A group of twelve senators seated in their own balcony waited until Taria took her seat before returning to their own."}, {"tag": "p", "text": "When the bill was officially proposed, opposition in the Senate was strong enough that a trade summit on the planet Eriadu was organized to discuss and finalize the resolution. After the Senate session concluded, Taria made her way through the Senate Plaza to Valorum's office in the Senate Building. The plaza was filled with both supporters and detractors of the Chancellor's proposal, and Valorum's security detail recommended to Taria that he leave the building via rooftop platforms. Upon entering his office, Taria updated her boss on his meeting-filled afternoon and the suggested precautions, but he insisted on moving through the plaza itself as a show of good faith. Taria joined him and a triple-strength Senate Guard detail as he moved through the building's corridors and the crowded exterior avenue. Before they reached a waiting shuttle, six Nebula Front assassins attacked the entourage. Two of the Senate Guards were killed, but the rest of their number, along with the nearby Jedi Masters Qui-Gon Jinn and Adi Gallia, were able to fell the attackers. A blaster bolt struck Valorum in his side during the chaos, and he was rushed to the Galactic Senate Medcenter."}, {"tag": "p", "text": "By the time Taria arrived at the medcenter, Palpatine was waiting outside of Valorum's treatment room. After he ensured that she was unharmed, he entered the room for a private visit with the Chancellor. The two agreed that a Jedi escort was needed for the forthcoming trade summit, and after Valorum recovered, Jedi Masters Yoda and Mace Windu visited him in his office. Taria received them outside and escorted them in before being subsequently dismissed. The Masters agreed to send representatives of their order to Eriadu, and Master Gallia led a four-Jedi–strong entourage that accompanied Taria, Valorum, and the rest of the Coruscant delegation to the summit. The delegation traveled to Eriadu and landed their ship at the planet's principal spaceport, from where a limousine took them to the mansion of the world's lieutenant governor, Wilhuff Tarkin. They were soon after whisked to Eriadu City's Seswenna Hall, the location of the summit itself, for a reception. There, Taria and Valorum were greeted by Tarkin."}, {"tag": "p", "text": "Following the reception, Taria and the others returned to the mansion, where Valorum was given temporary quarters. Taria continued to serve him at his ersatz office, and when Gallia, Jinn, and Kenobi arrived for a visit, she led them inside. The Jedi were concerned with the possibility of another Nebula Front attack, but none in the room could guess at the group's motives. However, Valorum wished to maintain the appearance of order, and he refused their requests to postpone the commencement of the summit. The next morning, as Taria and the rest of the Coruscant delegation waited outside the mansion for a repulsorlift caravan to take them to Seswenna Hall, Gallia and Master Saesee Tiin arrived and informed them that the Nebula Front had breached Eriadu security. A stubborn Valorum consented only to enabling his vehicle's force field, and the delegation made their way to the event."}, {"tag": "p", "text": "Delegations from a number of planets, the Trade Federation, and various other organizations met in Seswenna Hall, ignorant of the Nebula Front assassins and Jedi defenders battling on the building's roof. During the event's opening musical fanfare, Taria was one of the first to notice a lightfight occurring in the hall's ceiling rafters. She announced it with a scream immediately before an assassin plummeted to the floor. The present members of the Trade Federation Directorate activated a force field around themselves, but everyone present watched in horror as several Federation security droids used the protection to fire on the Directorate members unchallenged. All thirteen directors were killed, and the trade summit was prematurely adjourned. Secretly orchestrated by Darth Sidious, the murders had been arranged by the Nebula Front's leader, Eru Matalis, in order to allow the Sith Lord's Neimoidian allies in the Trade Federation to assume sole control of the organization."}, {"tag": "h3", "text": "The Chancellor's fall"}, {"tag": "p", "text": "In the aftermath of the slaughter, Taria and the rest of her delegation returned to Coruscant. The tax bill was ratified by the Senate, and representatives of the media afterward met Valorum and Taria outside of the Senate Building's Grand Convocation Chamber to field questions. Taria addressed the reporters on the Chancellor's behalf, praising both the bill and what had been accomplished on Eriadu despite the tragedy. She closed the discussion by informing them that the Chancellor would later issue an official statement. A cadre of guards then escorted them to Valorum's office, where he dictated a statement to Taria that she recorded on her wrist comlink. His speech was interrupted by the arrival of Bail Antilles, who informed the Chancellor that he had been summoned to the Republic's Supreme Court on charges of corruption and illegal enrichment."}, {"tag": "p", "text": "The Supreme Court had discovered that House Valorum's shipping company stood to profit from taxation of free trade routes. With his reputation under fire, Valorum performed his job with renewed vigor and concentrated much of his efforts on ending the threat of a terrorist group known as the Flail. Members of the Flail had been attacking public utilities on Coruscant in protest of government policies, and when Valorum began to strike back at them, they sent him death threats and physically assaulted Taria. However, their threat was soon after ended by a special task force put together by the Chancellor. Around the same time, Taria accompanied Valorum to an event in Coruscant's Perlemian Orbital Facility. As potential candidates for the next Chancery Election mingled with other politicians and powerful individuals, Taria and Valorum stood with a group that included Jedi Masters Yoda, Windu, and Gallia."}, {"tag": "p", "text": "As debate raged over whether or not the Republic in fact had the legal authority to tax free trade routes, the Trade Federation's new Neimoidian leaders augmented their battle fleet and used it to blockade Naboo in protest in 32 BBY, thereby preventing all shipping to the planet. Valorum dispatched Jinn and Kenobi to Naboo to negotiate with Trade Federation Viceroy Nute Gunray, and Taria assembled a dossier on both Naboo and the Trade Federation for the Jedi's perusal."}, {"tag": "p", "text": "Seeking more information on the Trade Federation, Taria employed a trusted team of troubleshooters to purchase a packet of information from a Trade Federation brokerage house on the planet Corulag. An informant in the house was willing to provide the Republic with the information, and Taria gave the troubleshooters some rare and valuable coins to use for payment. When a corrupt functionary in the Chancellor's office learned of the arrangement, he sold the troubleshooters out in an attempt to profit. Taria's team arrived on Corulag to find the informant dead, and they were forced to dodge both Federation security and bounty hunters on their way back to Coruscant. Upon their return, they rooted out the traitorous functionary and confirmed that Taria was innocent of any wrongdoing."}, {"tag": "p", "text": "Jinn and Kenobi returned from Naboo with the world's Queen Amidala, as well as the news that the Federation's blockade had escalated into a full-scale invasion. Valorum called a special session of the Senate to allow her to plead her case, and both Taria and Senate Vice Chair Mas Amedda joined him in the Grand Convocation Chamber's central Chancellor's Podium as he chaired the session. When Amidala, seated in Palpatine's repulsorpod, stated her allegations of an invasion, Trade Federation Senator Lott Dod demanded that a commission be sent to her homeworld to ascertain the truth of the claims. After a brief discussion with Taria and Amedda, Valorum reluctantly conceded the point, citing procedural regulation Section 523A. On Palpatine's advice, Amidala responded by calling for a Vote of No Confidence in Valorum's leadership. Senator Edcel Bar Gane of Roona seconded the motion, and a stunned Valorum requested a recess."}, {"tag": "p", "text": "Following the recess, Taria and Amedda returned to the podium alone. The session continued, and the Vote of No Confidence passed. Three candidates were nominated to replace Valorum: Senators Palpatine, Antilles, and Ainlee Teem, the latter a representative of Malastare. Having found no help from the Republic, Amidala returned to Naboo and captured Gunray with the aid of her Royal Security Forces. Palpatine's scheme came to fruition when he was elected the new Supreme Chancellor, and Taria afterward chose to leave political life. A woman named Sly Moore fulfilled her role in Palpatine's new administration, and rumors abounded that Moore had blackmailed Taria into retiring or had otherwise eliminated her from public office. However, nothing was ever conclusively proven."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sei Taria was a petite woman who stood 1.78 meters tall in adulthood. Her skin was the color of burrmillet grain; her eyes were oblique in shape and brown in color; and her brown hair was often tied behind her head. She was considered lovely, and Finis Valorum found her attractive. As Valorum's aide, Taria's favored attire consisted of expensive burgundy septsilk robes that signified wealth when worn with a high Coruscanti collar. She also wore a wrist comlink that included a recording function."}, {"tag": "p", "text": "As a close advisor and trusted aide to Supreme Chancellor Valorum, Taria was dedicated both to peace and to approved procedure. Although Valorum abhorred policy and procedure and believed that they constantly caused him to compromise his morals, Taria helped him confirm and follow them, even when he displayed significant reluctance to do so. Taxation became high on her political agenda when Valorum proposed the taxing of free trade routes."}, {"tag": "p", "text": "Taria's working relationship with Valorum was casual, and she sometimes spoke deviously to his peers. After many years of working under the Chancellor, Taria learned to anticipate his stubbornness and to accommodate it in times of crisis. Their relationship grew into a physical one, and the two often appeared in public together due to Valorum's desire to attend events alongside an attractive young escort. Senator Palpatine thought of Taria as Valorum's \"trophy.\""}, {"tag": "p", "text": "Taria placed faith in the abilities of the Jedi and contravened Baroness Omnino's refusal to accept a Jedi escort during her diplomatic visit to Coruscant. Politically astute, Taria was able to discern some of the Baroness's motives behind the visit and to sense Palpatine's increasing political power. She grew close to Naboo's Senator and learned much from him. Nevertheless, Taria chose to leave political life when Palpatine replaced Valorum as Supreme Chancellor. During Valorum's fall from power, Taria was slightly shaken by the murders and assassination attempts of which she found herself in the midst."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Sei Taria was created for George Lucas's 1999 film Star Wars: Episode I The Phantom Menace. She appears in the Chancellor's Podium during the film's Senate sequence, but she is not identified in the script, which merely states that Valorum confers with Mas Amedda and \"several of his aides\" after being challenged by Lott Dod. The film's novelization similarly identifies Valorum as being in the company of his Vice Chair and \"staff.\" Taria does appear in The Phantom Menace's various comic book adaptations, however, although the second issue of the film's manga adaptation depicts her as standing to the Chancellor's right during the Senate sequence, while in the film, she stands to his left."}, {"tag": "p", "text": "In The Phantom Menace, Taria was played by British actress Kamay Lau. Her scene was filmed in front of a bluescreen at Leavesden Studios, England. Lau's profile on the talent directory website starnow calls Taria the \"Assistant to the Chancellor of the Universe,\" and includes two promotional photos of the character that have never been used in an official Star Wars product."}, {"tag": "p", "text": "Although unidentified in The Phantom Menace's script and credits, Taria was given a name in 1999's Star Wars: Episode I The Visual Dictionary. She was first pictured in Star Wars media in Star Wars: Episode I The Phantom Menace Scrapbook. Taria additionally plays a relatively large role in James Luceno's 2001 novel Cloak of Deception. Although she has a fixed role in The Security Leak, a roleplaying adventure included in the 2001 sourcebook Secrets of Naboo, completion of the adventure is an optional part of the player's experience."}, {"tag": "p", "text": "Taria's birth year has never been revealed in canon, but Cloak of Deception states that in 33 BBY, she halves Valorum's age. However, Valorum's birth year is similarly unknown."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}