{"url": "Seismic_activity_team", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Galactic Alliance organizations"], "nodes": [{"tag": "h1", "text": "Seismic activity team"}, {"tag": "p", "text": "The seismic activity team was a Galactic Alliance organization tasked with locating seismically dangerous sites across the galactic capital planet Coruscant. In 44 ABY, the world was assaulted by a Sith Tribe and the entity Abeloth, a destroyer of civilizations. Although Abeloth was eliminated and the Sith forces were defeated, Coruscant sustained heavy damage. The seismic activity team was thus dispatched to identify positions that required careful examination, and they reported over 100,000."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The seismic activity team was established on the galactic capital world Coruscant by 44 ABY, operating under the Galactic Federation of Free Alliances. In that year, the planet came under the control of the dark side entity Abeloth—who periodically rose over the millennia to destroy civilizations—and the recently resurged Lost Tribe of Sith. The New Jedi Order and Galactic Alliance defeated Abeloth and eradicated the Sith, but Abeloth caused massive groundquakes and volcanic activity all across the city-planet while the last surviving Sith were hunted through the city, leaving destruction in their wake."}, {"tag": "p", "text": "The seismic activity team was quickly tasked with gauging the damage done to the world. Though the volcanic activity had ceased, they found that the undercity had been so ravaged by the attack that it would likely require years to acquire just a rudimentary assessment. The team also had trouble identifying what to look for, as possible causes of the widespread destruction included terrorist assaults, fountains of magma, and structural failure. The undercity was further swamped with clouds of poisonous gas, and preliminary estimates of the civilian casualties were in the billions. The seismic activity team ultimately reported well over 100,000 sites that were in need of further inquiry. Galactic Alliance Chief of State Wynn Dorvan later relayed the team's findings to the Jedi Council and Jedi Grand Master Luke Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The seismic activity team was mentioned in author Troy Denning's 2012 novel, Fate of the Jedi: Apocalypse, the ninth and final volume of the Star Wars: Fate of the Jedi series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}