{"url": "Selestrine", "categories": ["Category:Legends articles", "Category:Females", "Category:Icarii", "Category:Queens", "Category:Religious workers"], "nodes": [{"tag": "h1", "text": "Selestrine"}, {"tag": "p", "text": "Selestrine was an Icarii Queen and sorceress with precognitive powers captured by the Imperial Lightning Battalion during the Icarii Campaign on Vestar. Selestrine's long hair was intricately woven with jewelry and precious stones worth billions of credits."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Selestrine was a psychic Icarii with precognitive powers. As the leader of her tribe, she was captured by Colonel Abal Karda, who hoped that the threat of her execution would convince the Icarii to surrender. When this strategy proved ineffective, Karda authorised the use of a bio-agent which wiped out the entire species. Realizing that she was now the last of her kind, Selestrine acquired poison and tried to kill herself, but Colonel Karda, who wanted to profit from Selestrine's prophecies, decapitated her and developed technology allowing her head to survive in a plain, Kneeb-hide casket."}, {"tag": "p", "text": "Furious that she had been denied her death, Selestrine tricked Karda with a prophecy suggesting that his hated superior, General Nim, would soon die, and that Karda would soon receive a significant promotion. However, when Nim arrived to take possession the casket from Karda on the orders of Darth Vader, Karda became enraged, killing his commander and ensuring his promotion to the status of Enemy of the Empire. He fled with Selestrine and claimed sanctuary in the hermitage of the Ancient Order of Pessimists on Maryx Minor."}, {"tag": "h3", "text": "Retrieval on Maryx Minor"}, {"tag": "p", "text": "Darth Vader hired Boba Fett to find Karda and return the box containing Selestrine's head. Upon killing Karda and confirming his suspicions about the contents of the box (directly violating Vader's instructions) Fett kept it for himself (although Selestrine recognized that Fett was more interested in the price she could earn him than in her precognitive powers). However, Vader had followed Fett to Maryx Minor and the two engaged in battle over control of the box. Vader began using the Force against Fett, who kicked the box into a pool of lava. Not willing to let Selestrine be lost, Vader shoved Fett aside and dove for the box, narrowly retrieving it from the lava. Selestrine was greatly disheartened that she had yet again been cheated of her much-longed-for death."}, {"tag": "p", "text": "Vader returned to his Star Destroyer and was given two glimpses into the future from Selestrine: one in which Emperor Palpatine betrayed Vader and had him arrested and executed, and another in which Vader rose up, killed his master, taking his place as Emperor. (The latter glimpse later became the focal point of the fulfillment of the prophesy of the Chosen One who would bring balance to the Force.) A moment after these glimpses, the Emperor contacted Vader having received word that the Icarii queen had come into his possession, and demanded that she be delivered to him on Coruscant. Although he had determined that he had little use for Selestrine himself, Vader was unwilling to hand her over to his master, instead choosing to kill Selestrine and send her remains to be inspected."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}