{"url": "Selene", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Sith of Revan's Sith Empire"], "nodes": [{"tag": "h1", "text": "Selene"}, {"tag": "p", "text": "Selene was Human female Sith Acolyte who studied at the Sith Academy on Korriban."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Selene was born at the time of the Mandalorian Wars and decided to join the Sith during the start of the Jedi Civil War. She met a young man named Dustil Onasi, the son of Carth Onasi. The two grew close and she felt sorry when Dustil's homeworld, Telos IV, had been bombed by the Sith Lord Darth Malak. Believing that the Sith could help Dustil, she convinced him to go with her to Korriban and attend the Sith Academy. They arrived at the Academy, which was under the leadership of Headmaster Uthar Wynn."}, {"tag": "p", "text": "During her training at the academy, Selene had encountered problems in dealing with the dark side and felt that being a Sith was the worst mistake of her life. She decided to use her relationship with Dustil to hinder his progress at the academy. Dustil genuinely loved Selene and remained close to her. However, Uthar discovered their relationship, and found that while Dustil was talented and showed promise, Selene was a mediocre student who was only a hindrance to Dustil's training. The ruthless ruler of the Academy decided to get rid of Selene, and sent her on a mission into the Valley of the Dark Lords, and Selene was killed by the Headmaster. Dustil was concerned of her disappearance, but Uthar lied that Selene was killed during a mission. Dustil was heartbroken, but he continued his training in the Academy."}, {"tag": "p", "text": "The true circumstances behind Selene's death were revealed to Dustil by his father, Carth Onasi and a redeemed Revan. Dustil was angry and upset that Uthar lied to him, and saw the deception of the dark side. He agreed to leave the Academy and warn other students to convince them to leave with him."}, {"tag": "h2", "text": "Appearances"}]}