{"url": "Selonian/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Articles needing illustration", "Category:Core Worlds species", "Category:Mammalian sentient species", "Category:Selonians"], "nodes": [{"tag": "h1", "text": "Selonian"}, {"tag": "p", "text": "A sentient species from the Corellian system, Selonians were large musteline carnivorous mammals with long, flexible spines."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "This fur-covered, sleek and powerful species were carnivores who were believed to have descended from aquatic mammals. They were furry bipeds who stood at an average height of two meters tall making them taller than most Humans with slightly shorter legs and arms. In fact, adult Selonians were capable of standing between 1.8 meters to 2.2. meters tall with the female members of the species being larger. Their bodies were covered by a sleek brown or black fur and they normally did not wear clothing on their homeworld. However, when working or visiting elsewhere, they wore the appropriate clothing or outfits. Their long bodies were equally comfortable walking on either two legs or on all four. On two legs, they were able to reach a base speed of 10 meters a second though were capable of reaching 12 meters per second on all four which was the same level of speed they were capable of accomplishing when swimming in water."}, {"tag": "p", "text": "The half meter long tails served as a counterbalance for their bodies when standing upright. These tails were equally capable of being used as potent bludgeoning weapons in combat. Short glossy hair covered their bodies which was usually brown or black in color. At the end of their paw-like hands were retractable claws which not only gave them the capacity to dig but also made them excellent climbers. They had long pointed faces with bristly whiskers as well as long teeth. Selonians were able to see 20 meters in the dark with their dark-vision traits being black and white only. They also were able to see twice as far in dim lighting with them capable of distinguishing color and detail under such conditions."}, {"tag": "p", "text": "Selonians were capable of living over 75 years of age with specific range during their growth to adulthood. Those between 1-8 years were considered children whilst 9-14 were young adults and 15-35 age were adults. A Selonian between the ages 36-55 were considered middle aged whilst those being 56-74 were held to be old and any older than 75 were considered venerable."}, {"tag": "p", "text": "Most Selonians were infertile females. One in every hundred was male, and one in every five hundred were fertile females."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "Psychology"}, {"tag": "p", "text": "Despite the massive starship traffic to the Corellian shipyards, many visitors and even some native Corellians knew very little of the Selonians and their distinctive unique alien culture. In mindset, they were a thoroughly grounded and serious race who were primarily concerned with the safety of their people. This meant that the protection of their family dens and their species as a whole was a chief concern. The basis for this line of thinking was because they viewed that the needs of the society outweighed the needs of the individual. To those unaware of the deeper intricacies of the race, the Selonians appeared as an outgoing, friendly and charitable species. However, their interests rarely went beyond securing the good of their respective den."}, {"tag": "p", "text": "They also had a deep psychological need to reach a consensus when taking action. As individual Selonians felt that the actions of an individual impacted an entire den, they refused to lie as they believed such an act was a crime similar to murder."}, {"tag": "h3", "text": "Behavior"}, {"tag": "h4", "text": "Social structure"}, {"tag": "p", "text": "It was known that the Selonians did not recognize relations in the same manner as most Human cultures; Despite their mammalian appearance, the social structure of a Selonian family was more similar to insectoid races as they possessed a eusocial society."}, {"tag": "p", "text": "Selonians made their massive dwellings and intricate tunnels underground with their sharp claws. The underground nature of their existence meant that the Selonians suffered from agoraphobia and were more comfortable in confined spaces compared to open environments. Selonian dens consisted of a single fertile female who was the Queen or den mother, a few fertile males and a large number of infertile females."}, {"tag": "p", "text": "The Queen and few fertile males were responsible for siring all members of the den. Within the den were sub-groupings known as septs that were offspring fathered by the same fertile male. Females born of the same father and thus were members of the same sept were genetically identical. The Queen herself was capable of being pregnant five times a year where they gave birth to five or more children. Despite their importance, the fertile males were treated scornfully as holding little use beyond breeding and at best as prized breeding stock. Thus, a rare group had formed amongst the fertile males that attempted to promote breeder rights."}, {"tag": "p", "text": "The much more common element within their society were the sterile females who performed all the other functions of Selonian life. The breeding arrangements made by the Queens kept each den as a close knit operation with each sterile female being trained specific duties. Some were, in fact, responsible for both the males' and the Queen's safety. Den members were responsible for keeping the fertile Queen away from harm and protecting their home."}, {"tag": "p", "text": "Competing dens controlled regions of territory on their homeworld with the ruling group being known as the Overden. Their cities were actually a collection of several dens with each specializing in a skill or craft. These dens supported and aided each other by way of a complicated system of bartering and favor exchanges."}, {"tag": "h4", "text": "Material culture and technology"}, {"tag": "p", "text": "Though they maintained a seemingly primitive existence, the Selonians were in fact an information age level civilization. They were, in fact, considered technologically on par to galactic standards with their dens linked through computer networks and rapid transit systems."}, {"tag": "p", "text": "Their industrial capacity was also able to help feed the ravenous production needs of the Corellian Engineering Corporation who the Selonians provided with high-tech components. They had mastered shipbuilding technology and even created starships capable of traversing their home system. Selonians had possessed the ability for space travel for many years, though their reluctance to do so had more to do with their mindset. As they had little desire to go beyond the Corellian system, the Selonians did not construct hyperdrives for their vessels."}, {"tag": "p", "text": "Selonian warriors, who were almost always female, created their own personal glaives, in a manner similar to a Jedi's creation of their lightsaber. However, during the Galactic War, some warriors of Murthil's den made use of electrostaffs, blaster pistolss, or a blaster rifle during combat."}, {"tag": "h4", "text": "Interspecies relationships"}, {"tag": "p", "text": "A select number of Selonians were specifically trained to deal with aliens and Humans. These individuals were known to integrate themselves into Human societies where they put their carefully learned mannerisms and attitudes at work with aliens in order to interact with them better."}, {"tag": "p", "text": "The Human-centric Empire, in an effort to spread xenophobia among the Human population of the Corellian system, spread propaganda saying that Selonians were warlike and prone to violence. Few Humans from the system believed it, however, as the species hadn't been warlike in centuries and the two races co-existed in relative peace."}, {"tag": "p", "text": "However, several Selonian groups were known for xenophobia, including the Overden, Absolutists, and Sacorrian Triad."}, {"tag": "h4", "text": "Language"}, {"tag": "p", "text": "The species had their own language, Mandaba, which was both spoken and written, though those members of their kind that were accustomed to speaking to outsiders were able to speak in Basic. Selonians also spoke a modified language among their dens which was not diminished by auditory echoes in their burrows."}, {"tag": "p", "text": "Etiquette included ladies of some fashion."}, {"tag": "p", "text": "Some common Selonian names were Cavisek, Maronea and Vissica."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Selonians were seemingly natives to the planet Selonia within the Corellian system. The species were believed to had origins from an aquatic mammal species that lived in riverside burrows which they still used as their homes. Many Selonians also lived on Talus, Tralus, and Corellia, with additional dens on planets scattered throughout the galaxy. Much of the criss-crossed tunnels on both Selonia and Corellia were actually the result of the hard work of the Selonians. The tunnels on Corellia were in fact known as the Selonian Tunnels. At some unknown point, a den of Selonians were exiled from their homeworld for a dishonorable act which led to their banishment to the world of Sacorria. During the Cold War era, the Sith Empire invaded Corellia and the rebel Corellians allied themselves with the Selonians who allowed the use of their tunnels to combat the Sith's offensive."}, {"tag": "p", "text": "Around 400 BBY, the Afarathu sect terrorized the Corellian system for many years until their destruction in 380 BBY at the hands of Keiran Halcyon. Another notable group of Selonians were the Doloria who were a cult of assassins founded by the Selonians of Sacorria and operated in the Corellian sector. In 22 BBY, the Selonian Pumav came seventh in the quadruped race and seventh in the biped during Mobquet Presents: Fastest Land Beings. One known Selonian who left his peoples society was Zonder after he was discovered to be Force-sensitive leading to him joining the Jedi Order by the time of the Clone Wars."}, {"tag": "p", "text": "Their lack of involvement in galactic affairs saved the Selonians from domination during the Rise of the Empire era. During the Imperial Period, the Galactic Empire used the near forgotten actions of the Afaranathu to spread fear in the Corellian system. In addition, they attempted to cultivate xenophobia amongst the Human populations of the system by using propaganda to spread the belief that the Selonians were a war-like species that were prone to violence though this was never believed by the Corellians. A Selonian was known to work for Jabba Desilijic Tiure as a chef. Following the destruction of Alderaan in 0 BBY, the Selonians became more sympathetic to the plight of the Rebel Alliance after seeing the destructive actions of the Empire. After the destruction of the second Death Star, the glimmer of hope inspired the Selonians to fully embrace the Rebel cause in the resultant Galactic Civil War. The Selonians were swept up in the power struggles that broke out in the Corellian system following the collapse of Imperial rule leading to the very real prospect that their world would be destroyed in the process. This caused them to become even more withdrawn from other cultures, even amongst the ones inhabiting their home system. However, the resultant shock to Selonian society led to a rare few individuals seeking to change their culture so that they could deal with other species more honestly. Certain Selonians still supported the Rebel Alliance and in 4 ABY, Lady Leyli who had ties to the Tralus Queen, provided information to Rogue Squadron on an Imperial outpost on the planet."}, {"tag": "p", "text": "After the emergence of the New Republic, the system was represented by only a single member which was met with protests by both the Selonians and the Drall. By 18 ABY, radical groups such as the Absolutists and the Overden emerged on Selonia which had secretly allied itself with the Sacorrian Triad in their bid to gain independence from the New Republic. This led to the Corellian Crisis where the Overden worked alongside the Human League and the Drallists to take over the system. The separatist Selonians had to battle loyalist members of their kind such as the Republicanists who included the Hunchuzuc Den which brought about an undeclared civil war. During these hostilities, the rebel Selonians fired their planetary repulsor which left the Bakuran starship Watchkeeper a ruined wreck. By the time of the Battle of Centerpoint, the Selonian loyalist Dracmus along with Mara Jade were successful in getting the aid of the Overden which ended the conflict."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}