{"url": "Selvaris", "categories": ["Category:Legends articles", "Category:Wild Space planets", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Selvaris"}, {"tag": "p", "text": "Selvaris was a backwater planet of little significance during the Galactic Civil War. It was the closest inhabited planet to the Bilbringi system."}, {"tag": "p", "text": "During the Yuuzhan Vong War, it became the location of a major prisoner-of-war camp under the command of Malik Carr."}, {"tag": "h2", "text": "Geography and description"}, {"tag": "p", "text": "Selvaris was a lush planet covered in tropical jungles, forests and blue oceans. Its jungles and forests produced much tropical fruit while its oceans teemed with various forms of marine life. Selvaris was bathed by the rays of twin suns which created a hot, tropical climate."}, {"tag": "p", "text": "After taking the planet, the Yuuzhan Vong introduced a number of bioengineered life forms from their home galaxy to the ecosystem on Selvaris, grown to survive easily in their new environment. Vongforming had commenced on the planet's eastern hemisphere and was scheduled to envelop the entire planet with flora and fauna from their home galaxy within months. Several population centers had already been engulfed by the bioengineered vegetation and technology had been outlawed in favor of organic creations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Yuuzhan Vong War, Selvaris was conquered by the extra-galactic Yuuzhan Vong. A prison camp was located on the planet's southern continent for captured Galactic Alliance military personnel, including a large number from the Operation Trinity campaign on Bilbringi. The camp was administrated by Subaltern S'yito."}, {"tag": "p", "text": "These prisoners were comparatively lucky not to have been enslaved compared to countless others, and were even allowed a degree of freedom. However, Selvaris's hot climate took its toll on some of the inmates and a persistent salty wind from a nearby estuary did little to improve the situation. However, Selvaris was also rich in life and there was often food available to both prisoner and conqueror. The planet's oceans also teemed with marine life."}, {"tag": "p", "text": "In 29 ABY, an escape plan was formed after secret information was relayed to the camp from offworld. A Jenet named Thorsh was able to flee the prison world in the Millennium Falcon, carrying with him the vital data. The remaining prisoners—among them Judder Page and Pash Cracken—were soon transferred to transports destined for Yuuzhan'tar—formerly Coruscant. Though scheduled for sacrifice, many of the Selvaris prisoners were rescued in a daring strike by the Galactic Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}