{"url": "Senate_Guard_(New_Republic)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Senate Guard"], "nodes": [{"tag": "h1", "text": "Senate Guard  (New Republic)"}, {"tag": "p", "text": "The Senate Guard was a government security force established by the New Republic. Like its predecessor, the original Senate Guard of the Galactic Republic, the new guard was charged with protecting the Chancellor and the Galactic Senate."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The New Republic Senate Guards wore golden helmets and were equipped with shock-lances and blasters. Senate Guards were used to guard the Galactic Senate on Chandrila, state functions, and Imperial prisoners. They did not match the fighting prowess and discipline of the Royal Guards. Other Senate Guards wore red helmets with white plumes and carried batons. They also had the authority to stop ships from leaving Chandrila."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The formation of the New Republic resulted in the re-establishment of Old Republic institutions, such as the Galactic Senate and the Senate Guard, that had been dissolved under the reign of the Galactic Empire. Aside from guarding the Senate and official functions, guardsmen like Windom Traducier were also used to guard Imperial prisoners. In 5 ABY, several guardsmen were deployed for crowd control and security purposes during the Liberation Day celebrations held to celebrate the liberation of former Rebel Alliance prisoners from Ashmead's Lock prison on Kashyyyk."}, {"tag": "p", "text": "Several guardsmen tried to prevent Temmin Wexley and his B1-series battle droid Mister Bones from entering the Senate Plaza since the plaza was full. Temmin wanted to warn his mother Norra that his father Brentin Lore Wexley was not right. When one of the guards sheathed a shock-lance, Mister Bones attacked the guard and knocked him out with his own weapon. While Temmin and Mister Bones fought with the guards, the Ashmead's Lock prisoners began attacking New Republic officials and military commanders including Chancellor Mon Mothma and General Crix Madine. These prisoners were being controlled by inorganic biochips that had been implanted by Fleet Admiral Gallius Rax."}, {"tag": "p", "text": "Five Senate Guards were also assigned to guard the Imperial dignitary Grand Admiral Rae Sloane and her entourage in the Old Gather-House. During the attack, Sloane's two Royal Guards eliminated their guards under her orders. Meanwhile, other Senate Guards used blasters to stun the Ashmead's Lock prisoners. Senate Guards also tried to apprehend Sloane but she managed to escape offworld with Brentin to hunt down Rax. Windom was later arrested by the New Republic Security Bureau, who discovered his role in using a transponder to send signals which activated the Ashmead's Lock prisoners' biochips."}, {"tag": "p", "text": "Chancellor Mothma's rival Senator Tolwar Wartol later dispatched two Senate Guards to stop Temmin Wexley and Sinjir Rath Velus from leaving aboard the Millennium Falcon, claiming they had the chancellor's authority. This was an attempt by Wartol to create a rift between Sinjir, Han Solo, and Princess Leia Organa."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The New Republic's Senate Guard first appeared in Chuck Wendig's 2016 novel Aftermath: Life Debt, the second installment in Star Wars: The Aftermath Trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}