{"url": "Senate_Guard/Legends", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Senate Guard"], "nodes": [{"tag": "h1", "text": "Senate Guard"}, {"tag": "p", "text": "The Senate Guard, colloquially called the Blue Guard, and less frequently the Republic Guard, or sometimes prior to 22 BBY the Coruscant Guard, was an elite security force of the Galactic Republic. Its duties were to safeguard the Republic's Galactic Senate and the Supreme Chancellor. The Senate Guard was centered on the galactic capital planet of Coruscant and had a tradition that went back thousands of years, making it one of the oldest law enforcement agencies in service to the Republic. It also served as a secondary police force for Coruscant in addition to the Coruscant Security Force. Next to the Jedi Order, the Senate Guards were seen as the defenders of democracy and symbols of peace and security on Coruscant. In law enforcement circles, Senate Guard investigations were well known for meticulous and excellent investigative and forensic work. The Senate Guard's specialized division, the Senate Commandos, were the best of the Senate Guard. When not conducting police investigations or taking on secret missions for the Republic government, the Senate Commandos took a leading role in the protection of dignitaries and government property. The Senate Guards were a frequent sight in the halls of the Senate Building, their ceremonial uniforms and robes helping to blend in with the formal settings. In the waning days of the Republic, Supreme Chancellor Palpatine formed a personnel security detail, the Red Guard, who he favored over the Senate Guard. He additionally began to phase out the Senate Guard with the clone shock troopers of the Coruscant Guard. As Galactic Emperor, Palpatine disbanded the Senate Guard altogether and replaced them with his Emperor's Royal Guard and the Imperial stormtroopers, and to a lesser extent the Imperial Senate Guard and Imperial Senate Sentinels."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Duties and organization"}, {"tag": "p", "text": "The Senate Guard was an elite security force that was responsible for defending the Senators and Supreme Chancellors of the Galactic Republic. Centered on the galactic capital planet of Coruscant, the Senate Guard tradition went back thousands of years and it was as old as the Galactic Senate itself. Senate Guards were more than just bodyguards as they were also police officers. The distinctive and familiar blue armor and robes of the Guard served as symbols of both peace and security in Galactic City for which the Guard operated as a secondary police force. In order to protect the thousands of senators, the Guard was responsible not only for the Senate Building, but also the entire Senate District. Senate Guards would also be found on senatorial transports, in order to protect their charges, and conducting secretive government missions. Guards worked to protect senators from external threats such as assassinations but also from internal threats such as the bribery of senators which Guards had to report to their superiors. As time went on, the Senate Guard became a legacy system with several generations entering the service. Especially in the waning days of the Republic, the legacy system allowed corruption to breed such as senators paying their Guards to look the other way on criminal acts. This, despite the efforts of the loyal internal affairs department."}, {"tag": "p", "text": "To become a Senate Guard, candidates would go through a full training program while those who had previous experience as planetary police officers would go through a shortened training program. Immediately after graduating, Guards were given the rank of private and generally assigned to the Senate Guard Headquarters where they processed prisoners and profiled suspects. Corporals were assigned to protect a prominent senator, a group of less prominent senators, or government VIPs. The sergeants handed out bodyguard detail assignments and provided security for the Grand Convocation Chamber which was overseen by the Sergeant at Arms. A lieutenant would oversee a squad, composed of two to four Guards. Commanders were responsible for task forces of six to eight guards. The leader of the Senate Guard was called the Captain of the Guard who answered to a Senate committee and officials in the Republic Judicial Department. The elite of the Senate Guards would become a part of the Senate Commando division, considered the best and bravest of the Guards. Led by a captain, the Senate Commandos were volunteers who were selected and had to undergo a grueling four week combat training program. Often they were called on to perform secret government missions or conducted police investigations. They wore armor that was more functional then their regular Guard counterparts."}, {"tag": "h3", "text": "Training and equipment"}, {"tag": "p", "text": "Prospective recruits were cautiously selected from among the most respected law enforcement agencies in the galaxy. Part of the guidelines for selection involved the fact that all candidates must be superb combatants and that they be completely dedicated to the Galactic Republic. The candidates were trained at the Senate Guard Academy and upon graduation assigned to headquarters By the end of the Republic, membership in the Senate Guard increasingly became hereditary, with several generations of some families serving in their ranks. This meant that candidates were often dominated with family connections. However, acceptance was extended to distinguished members from recognized planetary law enforcement bodies. Should that be the case, these more experienced recruits often went through a shortened academy training program."}, {"tag": "p", "text": "The most notable element of the Senate Guard was their symbolic blue robes and helmets. Their blue armor had remained as a trustworthy symbol of both peace and security of the Galactic Capital for thousands of years. The striking blue robes had another symbolic meaning of representing the supreme authority of the Senate along with its long tradition of a wise and just rule. In addition to the robes, the helmets had large crests and the uniform consisted of simple drapes but these were ceremonial rather than functional. In terms of weaponry, new guardsmen were often provided with ceremonial rifles that were distinctive, powerful and accurate. These weapons were noted for capable of firing a strong stun blast and while they were known for being primarily ceremonial, they saw increasing usage during the final years of the Republic. Should their mission or security demand it, guardsmen were known to discard their long weapons in order to be outfitted with more practical forms of weaponry. The Guard were given extensive blaster training and instructed in the use of Force pikes. They were also drilled in the Hijkata martial arts discipline. To get around the capital, Senate Guards used a speeder. When in more serious situations, the Guard used the heavily armed assault vehicle."}, {"tag": "p", "text": "Among the facilities available, the Republic Guard used fully equipped and modern analysis laboratory's which were used to help them conduct their investigations. In the field, special analysis droids were used that released their sensitive data only to the appropriate officers."}, {"tag": "h3", "text": "Relationship with other law enforcement"}, {"tag": "p", "text": "The Senate Guard worked most closely with the Coruscant Security Force, though the two had a rivalry. The Senate Guard served as police force for Coruscant, but was secondary to the CSF which had primary jurisdiction of Galactic City. However, in cases involving the safety of senators, the Senate Guard also had primary jurisdiction. There were exceptions as the murder of Senator Onaconda Farr was investigated by the CSF, not the Senate Guard."}, {"tag": "p", "text": "Among the skills that distinguished the Guard was their use of some of the best investigative and forensic work in capital. However, this had the effect of leading to some among the ranks of the Blue Guard to be distrustful of the Jedi as the Guard preferred to deal in cold hard facts. Thus, they often relied on the field of forensic evidence rather than rely on what they believed to be the mysticism of Force sorcery. As such, they were often at odds with the Jedi Order due to their less tangible methods of evidence gathering."}, {"tag": "p", "text": "With the coming of the Clone Wars the Coruscant Guard was formed to assist the CSF in securing the capitol. The clone shock troopers of the Coruscant Guard took over the responsibility of the Senate Guard as Coruscant's secondary police force which diminished the power of the Senate Guard. When the Red Guard was formed to protect the Supreme Chancellor, the power of the Senate Guard was further diminished."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Separatist crisis"}, {"tag": "p", "text": "The history of the Senate Guard was ancient and was as old as that of the Galactic Senate itself thus tracing its origin to the ancient times of the Republic. It's known that among the artwork of the earliest times of the Republic, images of silent Guardsmen had been present during these earlier centuries as a silent testament during diplomatic negotiations that force was ready to be used if diplomacy itself failed."}, {"tag": "p", "text": "The Senate Guard launched an undercover operation to investigate the Black Heth gang that had been operating on the lower levels. The undercover informant sent in to investigate was discovered by the gang and held at a constructions site. The Senate Guard requested the assistance of the Jedi and Obi-Wan Kenobi, who had also been investigating the Black Heth, to assist in the rescue the informant. Fighting his way through several Black Heth thugs, Kenobi was able to prevent the execution of the informant who was being questioned as to his true identity. The informant passed on to Kenobi that the Black Heth were importing large quantities of illegal weapons into Coruscant. Kenobi then took charge of the investigation, eventually tracking down and eliminating the smuggling operation."}, {"tag": "p", "text": "By the time of the Separatist Crisis, the Guard was led by Jesra Loture. During the Clone Wars, the blue-armored Senate Guard were the elite honor guard to high-ranking government officials on Coruscant, and rarely left the capitol except on the most important Senate business."}, {"tag": "h3", "text": "War begins"}, {"tag": "p", "text": "During the Clone Wars, which began in 22 BBY, Korun terrorists under the leadership of Nuriin-Ar seized the Galactic City Spaceport and took several hostages, including Senator Meena Tills and her aide, Vun Merett Jai. The terrorists demanded that the Galactic Republic withdraw its forces and cease interference in the affairs of their homeworld, Haruun Kal. The Senator's involvement prompted Obrim and a Senate Guard detachment to respond to the hostage crisis, as did the Coruscant Security Force, the clone commando unit Omega Squad, Mandalorian Sergeant Kal Skirata, and Null ARC Captain Null-11, nicknamed \"Ordo.\""}, {"tag": "p", "text": "Jedi Master Kaim attempted to negotiate with the Korun terrorists, but they killed him and threw his body, strapped with explosives, outside of the spaceport. Clone commando RC-8015, nicknamed \"Fi,\" jumped onto the Jedi before the explosion went off, an act that saved the lives of the CSF police officers standing nearby. The hostage siege was brought to an end as the commando team forcefully entered the building and killed the terrorists. Fi survived the blast, and his heroism was remembered by Obrim and the CSF for a long time thereafter."}, {"tag": "h3", "text": "Traitor in the ranks"}, {"tag": "p", "text": "After the capture of Neimoidian Trade Federation Viceroy Nute Gunray, a member of the Separatist Council and an enemy of the Republic, Captain Faro Argyus along with additional commandos were sent to guard the captive viceroy while he was aboard the Star Destroyer Tranquility en route to Coruscant. However, Argyus had been contacted by Separatist leader Count Dooku and bribed into releasing the viceroy and returning him safely to Separatist space. Not wanting to be forever bound to Republic guardsmen duty, Argyus secretly changed allegiances. During the Tranquility's journey, the warship came under attack by vulture droids and three Droch-class boarding ships, which pierced the hull of the Tranquility, releasing a Separatist boarding party. Eventually, clone troopers under the leadership of Commander Gree destroyed the invading battle droids, but they had only been a distraction to allow Separatist assassin Asajj Ventress to infiltrate and cripple the Republic warship."}, {"tag": "p", "text": "Ventress briefly rescued Gunray in the detention level, despite Argyus's conveyed attempt to prevent it. Ventress Force-pushed Argyus out of her way, intent on departing with the viceroy. The arrival of Jedi Master Luminara Unduli thwarted Gunray's escape, however, and forced Ventress to flee. Unduli pursued Ventress into the engine room of the Tranquility, leaving Ahsoka Tano, the Padawan of Jedi Knight Anakin Skywalker, to guard the captive viceroy alongside Argyus, his commandos, and Gree. Argyus told the Padawan that following one's heart made them distinct from droids. At his urging, Tano went off to find Ventress, leaving Gunray under the watch of Argyus, his men, and Gree. In the course of her engagement with the Jedi, Ventress sent an all-clear signal to Argyus."}, {"tag": "p", "text": "His true loyalties revealed to the Republic, Argyus killed his fellow commandos, released Gunray, and took the Neimoidian viceroy as a living shield. Only Gree stood in his way. During the scuffle that followed, Gunray hit the clone over the head with the butt of Argyus's blaster, knocking him unconscious. Argyus signaled Ventress to inform her of his success and he and Gunray made it to a docked Consular-class frigate, which they used to make their escape. Ventress, meanwhile, had eluded the Jedi and entered an escape pod, arriving aboard the escaping cruiser before reaching Separatist space. Argyus arrogantly gloated to Ventress about his mission's success, and that he had been responsible for Gunray's rescue. Ventress silenced his gloating permanently, impaling him with her lightsaber and killing him."}, {"tag": "h3", "text": "Rampage on Coruscant"}, {"tag": "p", "text": "After discovering the last known Zillo Beast during the battle on Malastare, the Republic's scientific community and Chancellor Palpatine both desired to study the beast's invulnerable scales to create impenetrable armor for the Republic's clone troopers. However, they decided to conduct this study on Coruscant, and subsequently transported the heavily sedated beast to the Republic Science and Technical Center. Senate Guards accompanied Palpatine as the beast arrived under heavy guard. Doctor Sionver Boll, throughout the course of her examination of the beast, found that she couldn't remove the Zillo Beast's scales without harming it. On briefing Palpatine of this, he ordered her to kill it, angering the Zillo Beast. Later, during the attempted execution, the beast escaped from the facility and began a rampage across Coruscant. As alarms began wailing across Coruscant, orders were given for the Senate staff to evacuate to the lower levels. Upon the Zillo Beast's arrival at the Republic Executive building, looking for the Chancellor, Palpatine agreed to evacuate as well."}, {"tag": "p", "text": "Accompanied by Senator Padmé Amidala, Jedi Knight Anakin Skywalker, R2-D2, and C-3PO, they left the Chancellor's Suite through an emergency escape tunnel and boarded the Executive Shuttle that was piloted by a Senate Commando. As the shuttle left the docking bay, it was seized by the Zillo Beast. Skywalker cut the shuttle in half, loosening the passenger compartment from the beast's grip. However, the Commando and Palpatine were unable to jump from the falling shuttle. Upon it landing on the ground, the Zillo Beast noticed the Chancellor and the Commando and moved towards them just as R2-D2 arrived. Seeing the Zillo beast come towards them and knowing that R2-D2 could not carry both of them, the Commando forced Palpatine onto the droid to be carried to safety, sacrificing himself as the beast slammed its foot down on top of the shuttle's remains, killing the Commando. With the Chancellor in safety, Republic forces began a bombardment of poisonous gas, killing the beast. The next day, Palpatine, accompanied by robed Senate Guards, ordered the dead beast to be cloned."}, {"tag": "h3", "text": "Assassination attempts"}, {"tag": "p", "text": "Four Senate Commandos were stationed aboard the New Mandalorian vessel Coronet as bridge crew under the command of Captain Gray. They were taken by surprise and killed by Mandalore Senator Tal Merrik, a secret Death Watch operative who attempted to abduct Dutchess Satine Kryze. The Dutchess was rescued by the Jedi and Merrik was killed, Later Kryze had a clandestine meeting with a Republic Ministry of Intelligence agent, Davu Golec. A Death Watch assassin murdered Golec during the meeting, however, the police probe that found Kryze noticed that she had a weapon and identified her as a suspect. The Duchess fled, resulting in a chase by the police though Kryze was able to elude them. While the police kept searching for her, she met with Jedi Master Kenobi in Coruscant Park and gave him a video concerning Republic aid for the Mandalore system. With the information in secure hands, she surrendered to Senate Guards at the Senate Building. The video was played for the Senate, resulting in the Duchess's extortion and the resolution of the situation."}, {"tag": "p", "text": "A time later, Senate Commandos accompanied Senator Padmé Amidala to the Alderaan Conference on the Clone War Refugee Crisis. Jedi Padawan Ahsoka Tano went with them as well after receiving several Force visions that she believed indicated a threat against the life of Senator Amidala. Tano stood with the Senate Guards at the front of the room during the speech. It was at that point that she felt a disturbance in the Force. Rushing to the walkway above the room, Tano interrupted the bounty hunter Aurra Sing shortly before the assassin fired a shot at the senator. The shot struck Amidala in the arm, wounding her though not seriously. The Senate Guards rushed in to cover the Senator as Tano chased Sing. However she lost sight of the assassin. To set a trap for Sing, a droid was dressed up in Amidala's robes and entered the meeting room under a heavy Senate Commando guard force. Senate Commandos also swept the corridors and the walkways around the meeting room, ensuring that the area was secure. From her sleeping quarters, Amidala spoke through the droid using a comlink. However, Sing, realizing it was a trap, attempted to kill Amidala in her quarters. She was again interrupted by Tano who used her lightsaber to deflect the bolt. Amidala managed to stun the assassin just as Captain Gregar Typho and the Senate Commandos forced their way into the room and placed Sing under arrest."}, {"tag": "h3", "text": "Attack on the Senate"}, {"tag": "p", "text": "Arriving on Coruscant, Bane's team split up to gain entrance to the Executive Building. Bane, Alama, a sentinel droid, and two droid commandos arrived at the building in an airspeeder, where they were confronted by a squad of Senate Commando guards. From an adjacent tower, Sing distracted the guards with covering sniper fire, taking out most of the Commandos by herself, while Alama and the droids also engaged the Senate Guards. Bane eliminated the guard captain and the commando droids dressed up in the Senate Guards' armor to ensure that the fight would go undiscovered. Sing, Robonino, and the sentinel droids arrived at the scene in a second airspeeder. Leaving both commando droids outside to clear the platform of the dead Senate Guards, the team of bounty hunters made their way into the complex."}, {"tag": "p", "text": "Disposing of a guard stationed at the Executive Building's power control room, the group also destroyed an assistant droid, the protocol droid, a WED-15 Treadwell, and the astromech droid in the room. Leaving Robonino to sabotage the building's power distribution network, the rest of the team headed to the meeting of senators. On the way to the East Wing of the building where the senators had gathered, Bane tossed a thermal detonator into the Senate Commandos' barracks when two shifts were assembled there. Sing eliminated the only survivor with a shot to the head. The group then entered the Annex Dome, surrounding and taking prisoner Senators Organa, Amidala, Philo, Dantum Roohd, Zinn Paulness, Onaconda Farr, Riyo Chuchi, Jakker-Sun, Kin Robb, and a Christophsian senator, as well as C-3PO. Bane made contact with Palpatine who eventually agreed to Ziro's release."}, {"tag": "h3", "text": "Diplomatic functions"}, {"tag": "p", "text": "Senate Guards would continue to stand watch over the Senate and Republic Executive buildings. A special honor guard was present at the funeral of the murdered senator, Onaconda Farr. However, the Coruscant Security Force was instead called in and the investigation was led by Lieutenant Tan Divo. The inspector was given charge of the Senate Guards to assist in protecting the involved senators."}, {"tag": "p", "text": "When Duchess Satine Kryze of Mandalore hosted a peace conference on her planet to find a peaceful solution that would end the war between the Republic and the Confederacy of Independent Systems, Captain Taggart, several Senate Guards, and Padawan Ahsoka Tano were sent along to protect the Republic delegation, which consisted of Senators Padmé Amidala, Bail Prestor Organa, and Mon Mothma. During the conference, Taggart and some of his men, were stationed at the docks with the Phoenix, the Republic delegation's transport, while the conference was held in the Sundari Royal Palace. However, during that time, Tano, along with the former Separatist, Lux Bonteri, arrived where Taggart and his men were standing guard. Tano had rescued Bonteri from a potential execution by the Separatists for interrupting the peace conference, and the duo was chased by Separatist BX-series droid commandos. After Tano told Taggart that she and Bonteri were being chased by commando droids, the Captain and his men responded by giving them cover fire to reach the Phoenix, which attracted the battle droids' attention. Both sides sustained several losses in the following fight."}, {"tag": "p", "text": "Senate Guards, along with shock troopers of the Coruscant Guard and Jedi Mace Windu and Anakin Skywalker, escorted Chancellor Palpatine to the planet Naboo for the upcoming Festival of Light. One of the Commandos responsible for guarding the Chancellor was a male Human designated as SG-1984. During the ceremony, Cade Bane and Moralo Eval put their plan into action under the direction of Count Dooku to kidnap Palpatine. Together with their group of bounty hunters which included a disguised Obi-Wan Kenobi as Rako Hardeen, they infiltrated the security detail using holographic disguise matrices. A skirmish broke out and the Senate Guards moved in to protect Palpatine. However, using the disguise matrix, Eval and Bane were able to seize Palpatine and fled. They were pursued by Kenobi who was able to capture them shortly before the arrival of Windu, Skywalker, and a Coruscant Guard trooper who arrested the two kidnappers."}, {"tag": "p", "text": "Senate Guards also accompanied Senator Amidala on a diplomatic mission to the planet Scipio however they had to remain at the gates since the area was a neutral zone under the control of the InterGalactic Banking Clan."}, {"tag": "h3", "text": "The Battle of Coruscant"}, {"tag": "p", "text": "During the Battle of Coruscant, Shaak Ti and 2 other Jedi, along with a clone task force and 1 Senate Guard came to take the Chancellor to his bunker. Before they could General Grievous arrived. Shaak Ti, The Chancellor and the other Jedi withdrew from the scene leaving the task force and the Senate Guard to fight Grievous. The clones and the Guard were swiftly defeated by Grievous, and he went after the Jedi."}, {"tag": "h3", "text": "Last days"}, {"tag": "p", "text": "During this era, Supreme Chancellor Palpatine began marginalizing the role of the Senate Guard. Instead of relying on them, he began installing his own elite guard that consisted of red robed warriors that became known as the Red Guard. These soldiers were selected from the ranks of the Senate Commandos and took over the responsibility of security for the Chancellor. There was also a cosmetic change for the Blue Guard; the elaborate crests were removed from their helmets, and the open face was covered by a black visor similar to that of the Red Guard."}, {"tag": "p", "text": "Following the creation of the Galactic Empire, the post of Supreme Chancellor was removed by Palpatine who declared himself Emperor. This change saw his Red Guard becoming the new Emperor's Royal Guard that saw to his protection. Furthermore, the proliferation of clone forces led to the Guard being largely redundant and they were gradually phased out of service."}, {"tag": "p", "text": "By 2 BBY, the Senate Guard had been re-established as the Imperial Senate Guard. Members wore armor identical to the Royal Guard and the Emperor's Shadow Guard, albeit blue in color. Additionally, like the Royal and Shadow Guards, Senate Guards of this era utilized lightsaber pikes, possibly indicating that they were Dark Side Adepts. They still functioned as bodyguards (and possibly enforcers) of Imperial Senators while serving the Emperor's will. Galen Marek would fight many Imperial Senate Guard during his part in the formation of the Rebel Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hasbro toys name the Senate Guards as the Coruscant Guard. The \"Coruscant Guard,\" however, was initially made up entirely of clones, whereas the Senate Guard had no clones among the ranks. It is possible that the misnomer could have been due to the fact that the Coruscant Guard were also assigned to protect the Republic Senate facilities and all senators in residence, augmenting, but not supplanting, the non-clone Senate Guard already in place."}, {"tag": "p", "text": "A Quarren is mentioned as working for the Coruscant Guard in Star Wars: Obi-Wan however this is most likely referring to the Senate Guard"}, {"tag": "p", "text": "When they first appeared in The Phantom Menace, they were intended to be the direct predecessors of the Royal Guard. However, this idea was abandoned in Attack of the Clones, where they appear side-by-side, where the Red Guard would be the direct predecessors of the Royal Guard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}