{"url": "Senate_Resolution_BR-0371", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles needing additional sources", "Category:Finance", "Category:Galactic Republic laws and acts"], "nodes": [{"tag": "h1", "text": "Senate Resolution BR-0371"}, {"tag": "p", "text": "Senate Resolution BR-0371 was passed by the Galactic Senate in 32 BBY after the failed Eriadu Trade Summit. It created taxation for hyperspace routes in the Outer and Mid Rims, with the profit going to pay off the growing Republic budget crisis. Senator Palpatine was a prominent supporter of the resolution."}, {"tag": "p", "text": "It was in response to BR-0371 that Darth Sidious convinced the Trade Federation to blockade Naboo. The plan to get rid of it was to have Queen Amidala sign a \"treaty\" making Naboo a Federation protectorate to legitimize their occupation, which would be sent to the Senate. Instead, the Queen turned the tables and forced the Viceroy to sign another treaty."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A seemingly innoccuous bill, Senate Resolution BR-0371 created a tariff on hyperlane trade routes from the Outer Rim Territories to the Mid Rim. It was introduced to pay off the Galactic Republic's growing fiscal debt, and used to support relief and development projects in outlying systems."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background and Passage"}, {"tag": "p", "text": "The Galactic Republic had been in a period of decline and political corruption, with Supreme Chancellor Finis Valorum embroiled in a corruption scandal. Senator Palpatine of the Naboo system, secretly the Sith Lord Darth Sidious, urged Valorum to limit the power of the Trade Federation, a galactic conglomerate that functionally controlled every trade route in the Republic. Palpatine supported Senate Resolution BR-0371 as part of the Sith Grand Plan, hoping to bring the declining Republic into further turmoil to reinstate Sith rule of the galaxy."}, {"tag": "h3", "text": "Reactions"}, {"tag": "p", "text": "Senate Resolution BR-0371 was a resounding success for the Republic, acquiring the intended development funds. Within a month of its passage, the Trade Federation suffered significant financial losses as a result of BR-0371, losing profits through the taxation of the previously Free Trade Zone they controlled. The Federation senator Lott Dod argued against taxation in the Senate while the Trade Federation Directorate began planning their counterstrike. Trade Federation Viceroy Nute Gunray and Rune Haako supervised the secret expansion of their Droid Army. Through the manipulations of Palpatine in the guise of Darth Sidious, six months after the passage of BR-0371, the Trade Federation launched a blockade of Palpatine's homeworld Naboo. The blockade involved a fleet of battleships placed in orbit around the planet, preventing trade through Naboo and causing its inhabitants to become desperate. After the Senate still refused to overturn Senate Resolution BR-0371, the Federation launched a full scale Invasion of Naboo."}, {"tag": "p", "text": "Naboo's Queen Padmé Amidala was rescued from the Federation's clutches by Jedi Knights and taken to the galactic capital Coruscant. The queen presented her planet's crisis to the Senate, but when Valorum was unable to act due to the corruption and bureaucracy of the Senate, she called a Vote of No Confidence on the Chancellor, on Palpatine's advice. The unpopular Valourum was voted out, and as Palpatine had planned, he receieved the nomination for Chancellor and won due to the sympathy generated for the senator's besieged homeworld. Naboo was later freed by an alliance led by Amidala, and Palpatine became the last Supreme Chancellor, exceeding his term limits and transforming the Republic into the Galactic Empire in 19 BBY. Decades later, the New Republic rose from the fall of the Empire, and a Historical Council published Palpatine's full motivation of the Resolution in an historical document, where they noted the absurdity that the galactic government had been changed as a result of a taxation dispute."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The taxation of trade routes was alluded to in the 1999 prequel trilogy Star Wars: Episode I The Phantom Menace, written and directed by George Lucas. It was identified as Senate Resolution BR-0371 in the 2000 reference book The Essential Chronology."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}