{"url": "Senate_Plaza", "categories": ["Category:Legends articles", "Category:Coruscant monuments", "Category:Coruscant public spaces", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Plazas", "Category:Senate Building locations"], "nodes": [{"tag": "h1", "text": "Senate Plaza"}, {"tag": "p", "text": "The Senate Plaza, or Republic Plaza, was a large open area that surrounded the Senate Building on Coruscant throughout its history. Bisected by a grand avenue lined with statues of the original founders of the Galactic Republic from the Core Worlds; the plaza was dotted with potted plants, benches and access ways to the Senate Commercial District."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Constructed around the Senate Tower on Coruscant, the large Senate Plaza was a wide plain of stone dotted by potted plants, benches, stairs and landing pads. Bisected by the Avenue of the Core Founders, the avenue was flanked by the Gardens of Justice and Equality on either side. Following the attack on Coruscant by the Sith Empire during the final days of the Great Galactic War and the signing of the Treaty of Coruscant, the Plaza was cleaned of debris and reopened to the public. Frequented by Senators and their aides, lobbyists, petitioners, and Jedi, the Plaza connected the Coruscant Spaceport during the Cold War, terminating at a transportation terminal."}, {"tag": "p", "text": "Over the next three millennia, the spaceport was removed and the Plaza expanded. During the Chancellorship of Finis Valorum, a large protest took place in the Plaza, with vocal citizens lining the Avenue; some called for the dissolution of the Trade Federation, others for the retirement of the Chancellor for his ineffectual trade policies. As Supreme Chancellor Valorum made his exit from the Senate Building through the crowd of protesters on the Avenue, a band of terrorists attacked him and his contingent of Senate Guards. While the Chancellor sustained injury, the intervention of Jedi Masters Qui-Gon Jinn and Adi Gallia prevented his death and the terrorists were routed."}, {"tag": "p", "text": "When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Coruscant remained free of attack for three years, until Supreme Commander of the Confederation military, General Grievous, led an attack on the planet. Cordoning of the Senate Plaza and staging troops there to protect the Senate Building, the Grand Army of the Republic was able to drive off the Confederate army and keep the capital safe from invasion."}, {"tag": "p", "text": "During the time of the Galactic Alliance, the plaza was restored and once more served as a massive gathering place open to the public. During the controversial Blockade of Corellia by the Alliance in 40 ABY, mass protests erupted across the Plaza, denouncing the Alliance's treatment of the Corellians. As the conflict between the Republic and Corellia escalated to a full blown war and Jedi Knight Jacen Solo took over the Alliance, the Jedi High Council planned to plant a secret device on his clothing. A small contingent of Jedi, led by Jedi Master Kyle Katarn, infiltrated the Plaza and positioned themselves strategically to attack while Padawan Seha Dorvald remained hidden to telekinetically adhere the tracking device. While the device was successfully planted, Solo managed to slay Jedi Thann Mithric and seriously wound Master Katarn."}, {"tag": "p", "text": "Following the end of the war, Chief Of Staff Natasi Daala ordered the public arrest of Jedi Grand Master Luke Skywalker as he exited the Senate Building via the Plaza. Surrounding the Jedi delegation, several Coruscant Security Force ships landed in formation to enclose the Jedi to prevent escape. Offering no resistance, Master Skywalker delayed his exile from Coruscant after a meeting with the Chief of State and was on Coruscant when Jedi Valin Horn succumbed to an enigmatic madness. Jedi Master Octa Ramis and Padawan Seha Dorvald camped out on the Plaza in the mid-morning hours hoping to intercept Horn before he could do any damage or escape offworld. Not long after, Jedi Sothais Saar suffered the same affliction while in the Senate. Attempting to remain calm while fighting off the madness, Saar was intercepted by Master Cilghal and safely transported to the Jedi Temple for treatment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}