{"url": "Senate_Hall", "categories": ["Category:Legends articles", "Category:Coruscant government buildings", "Category:Galactic Republic locations", "Category:Senate Building locations"], "nodes": [{"tag": "h1", "text": "Senate Hall"}, {"tag": "p", "text": "The Senate Hall, Republic Senate Chamber, Senate agora, or Old Senate Chamber was the building that housed the Galactic Senate in Republic City on Coruscant from the earliest days of the Galactic Republic (circa 15,000 BBY) to the time of the Old Sith Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A large stone structure on Coruscant, the Senate Hall was used to convene sessions of the Galactic Republic Senate during the institution's early millennia of existence. The Republic Senate Guardsmen were responsible for guarding not only the building, but the senators, Supreme Chancellor, Vice Chair, and the Staff Aide during senatorial meetings. The building was also used during formal Inquisitions."}, {"tag": "p", "text": "In 3996 BBY, during the trial of the fallen Jedi Knight Ulic Qel-Droma, the Sith Lord Exar Kun entered the Hall, placing the assembled senators and the Supreme Chancellor under his control as he stormed the chamber. Following his execution of the Chancellor, Kun engaged Jedi Master Vodo-Siosk Baas in a duel, killing his former master before freeing Qel-Droma."}, {"tag": "p", "text": "Following the Great Hyperspace War's conclusion, the Senate commissioned the construction of a new Senate Hall to accommodate the increasing number of member worlds within the Republic. On the foundations of old Senate Hall, the new Senate Tower was established, crowned by a massive rotunda that rested over a hundred levels above the old hall. Coming into disuse, the old Senate Hall was used for the trial of the Mandalorian scientist Demagol in 3963 BBY for his role in the early Mandalorian Wars. One year later, the agora was used for another show trial, that of the Jedi Master Dorjander Kace and his followers, the Mandalorian Knights. At some point in its history, the Hall was retired and became a tourist attraction for the throngs of civilians who visited Coruscant daily."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "A massive stone and glass building, the Senate Hall was located at the heart of the Senate District on Coruscant. Originally an open-air stadium, the Senate Hall was enclosed within a towering A-frame shaped structure with walls slopping up and inward, following the attack on Coruscant by the Sith. The facility had a glass facade which allowed natural light to spill into the facility, and was located next to a large spaceport. The main entrance to the building was positioned at the top of a massive staircase and past an ornately decorated doorway. Beyond the entrance was a lofty chamber which made up the heart of the building, featuring stadium-style seating with stone benches accommodating a very large number of senators. The center of the massive room was occupied by the Supreme Chancellor's podium, a massive stone column ringed by a spiraling staircase leading to the smooth pinnacle platform. A smaller podium rose from the floor in front of the Chancellor's; this platform was used by delegations who wished to formally address the Senate, as well as an area used to hold criminals during formal trials."}, {"tag": "p", "text": "The upper level of the room was open to foot traffic and from which massive pillars stretched to the ceiling. At either end of the hall, dual statues of massive winged Humanoids knelt inward towards a large flaming podium."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Counter to all prior sources stating that the Grand Convocation Chamber was erected following the duel in the old Senate Hall between Exar Kun and Jedi Master Vodo-Siosk Baas during the Great Sith War, Timeline 12: The Great Hyperspace War depicts the Chamber in operation nearly one thousand years prior to when it should first make an appearance. Note that Ludo Kressh's appearance in the same Timeline video is also inaccurate to his true appearance as shown in Star Wars: Tales of the Jedi, and that the Massassi spotted in the video are inaccurately portrayed too. Such discrepancies could in fact be explained away as artistic licence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}