{"url": "Senate_Guard", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Senate Guard"], "nodes": [{"tag": "h1", "text": "Senate Guard"}, {"tag": "p", "text": "The Senate Guard, also referred to as the Blue Guard, the Republic guard, the Defenders of Democracy, or the \"Boys in Blue,\" was an elite security force of the Galactic Republic. Its duties were to protect the Republic's Galactic Senate and the Supreme Chancellor. The Senate Guard was centered on the galactic capital planet of Coruscant and as it was also responsible for protecting the Senate District, it shared policing jurisdiction with the Coruscant Security Force. Next to the Jedi Order, the Senate Guards were seen as the defenders of democracy and symbols of security, especially during the last centuries of the Republic when there was no standing army. The best of the Senate Guards would be invited to become a part of the elite Senate Commandos division who would carry out secret government missions. The Senate Guards were a frequent sight in the halls of the Senate Building and the Senate Office Building, their ceremonial uniforms and robes helping to blend in with the formal settings."}, {"tag": "p", "text": "In the waning days of the Republic, Supreme Chancellor Sheev Palpatine formed a personal security detail of red-robed guards whom he favored over the Senate Guard. He additionally began to phase out the Senate Guard with the clone shock troopers of the Coruscant Guard. Eventually, as Galactic Emperor, Palpatine disbanded the Senate Guard altogether and replaced them with his Royal Guard and the stormtroopers of the Galactic Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Senate Guard, also referred to informally as the, Blue Guard, the Republic guard, the Defenders of Democracy or the \"Boys in Blue,\" was an elite security force charged with the protection of the Galactic Senate and as bodyguards for the Supreme Chancellor of the Galactic Republic. The Senate Guards were mostly seen keeping watch over the Senate District on the Republic capital planet of Coruscant where the Senate Building, containing the Galactic Senate Chamber, and the Senate Office Building were located at. There, the Senate Guard shared jurisdiction with the police officers of the Coruscant Security Force."}, {"tag": "p", "text": "While the Senate Guards were sworn to protect the Galactic Senate, senators who required daily protection usually received it from personal bodyguards or through the security forces of their homeworld. The Senate Guards, meanwhile, stood as a security presence throughout the halls of the Senate's buildings and provided the chancellor with a continual bodyguard detail. Senate Guards were trained as elite soldiers at a time when the Republic had no standing army and instead relied on the Judicial Forces and the Jedi. The best of the Senate Guards would be chosen to become Senate Commandos who would undertake secret missions for the Republic government. The Senate Guard maintained an investigative branch to look into threats made to Senate officials. The elite of the Senate Guard were inducted into the Royal Guard and further trained."}, {"tag": "p", "text": "Senate Guards were easily identified by their blue robes and large helmets with a plume and open faceplate, their ceremonial garb blending in with the formal settings of the Galactic Senate. Underneath the robes, they wore blue colored armor, whereas the Senate Commandos would forgo the robes altogether and simply wore the armor and helmets. In the Republic's final years, as war became a constant presence, all Senate Guards wore the ceremonial robes less frequently or in a manner that openly showed the armor underneath. Their helmets were also eventually modified with the ceremonial plume removed and the faceplate filled in with a dark visor. Senate Guards were armed with a variety of weapons. While performing guard duty in the the halls of the Senate or escorting dignitaries, they most frequently carried Force pikes as well as blaster pistols or fanciful blaster rifles like the Mk II \"Paladin\" blaster rifle. They also utilized more heavy blaster rifles such as DC-15As and wooden stocked DC-15s."}, {"tag": "p", "text": "The Senate Guard was organized with a military structure, and as such, its members were familiar with military hierarchy and military ranks. Regardless of the past service of new members, all that were inducted were given the rank of private, and usually rose quickly to corporal. Subsequently, members could then be promoted to sergeant, lieutenant, captain, and then eventually commander. The entire organization was overseen by the Captain of the Guard, who in turn was overseen by a Senate committee that was advised by members of the Judicial Department."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The waning Republic"}, {"tag": "p", "text": "The Senate Guard was an old military and security institution that had been in service for centuries. In the aftermath of the Invasion of Naboo by the Trade Federation, a detail of the Senate Guards accompanied Supreme Chancellor Finis Valorum to a landing bay where the Chancellor and Senator Sheev Palpatine met the arriving Queen of Naboo, Padmé Amidala and her Jedi companions, Jedi Master Qui-Gon Jinn and Padawan Obi-Wan Kenobi. Throughout the encounter, the Senate Guards stood watch over Valorum at a respectful distance, silent yet imposing. The crisis on Naboo saw the election of Palpatine, secretly the Dark Lord of the Sith whose true identity was Darth Sidious, to the post of Supreme Chancellor. The Senate Guards took up the task of providing Palaptine with the same security detail afforded a chancellor. After Naboo had been freed by a coalition of the Naboo and the Gungans, the newly elected Chancellor Palpatine arrived with a contingent of the Senate Guard to congratulate the victors and participate in the awards ceremony. While Finis Valorum no longer held the post of chancellor, he was still afforded protection by the Senate Guard. By 28 BBY, Chancellor Palpatine had formed his own personal bodyguards from the ranks of the Senate Guard who were dressed in crimson robes and armor. They would later be phased out with the Emperor's Royal Guard. While they were present in the Chancellor's office protecting the Chancellor during the Separatist Crisis, Palpatine would still retain the services of the Senate Guard as bodyguards throughout the Clone Wars that erupted between the Republic and the Confederacy of Independent Systems, especially during the war's early stages."}, {"tag": "h3", "text": "Traitor in the ranks"}, {"tag": "p", "text": "After the arrest of Trade Federation Viceroy Nute Gunray, a member of the Separatist Council and an enemy of the Republic, Captain Faro Argyus was sent with a detachment of Senate Commandos to escort Gunray while he was aboard the star destroyer Tranquility en route to Coruscant. However, Argyus had been contacted by Confederacy leader Count Dooku to facilitate freeing Gunray and returning him safely to the Separatists. Dooku paid the captain a huge sum to change allegiances and not wanting to be forever bound to guardsmen duty, Argyus secretly agreed to betray the Republic. During the Tranquility's journey, the star destroyer came under attack by Separatist forces, which pierced the hull of the Tranquility, releasing a boarding party. Eventually, clone troopers under the leadership of  Commander CC-1004 \"Gree\" destroyed the invading battle droids, but they had only been a distraction to allow Separatist assassin Asajj Ventress to infiltrate and cripple the Republic warship."}, {"tag": "p", "text": "Ventress briefly rescued Gunray in the detention level, despite Argyus's conveyed attempt to prevent it. Ventress Force-pushed Argyus out of her way, intent on departing with the viceroy. The arrival of Jedi Master Luminara Unduli thwarted Gunray's escape, however, and forced Ventress to flee. Unduli pursued Ventress into the engine room of the Tranquility, leaving Jedi Padawan Ahsoka Tano to guard the captive viceroy alongside Argyus, his commandos, and Gree. Argyus told the Padawan that following one's heart made them distinct from droids. At his urging, Tano went off to find Ventress, leaving Gunray under the watch of Argyus, his men, and Gree."}, {"tag": "p", "text": "In the course of her engagement with the Jedi, Ventress sent an all-clear signal to Argyus. His true loyalties revealed to the Republic, Argyus killed his fellow commandos, released Gunray, and took the Neimoidian viceroy as a living shield. Only Gree stood in his way. During the scuffle that followed, Gunray hit the clone over the head with the butt of Argyus's blaster, knocking him unconscious. Argyus signaled Ventress to inform her of his success and he and Gunray made it to a docked Republic frigate, which they used to make their escape. Ventress, meanwhile, had eluded the Jedi and entered an escape pod, arriving aboard the escaping cruiser before reaching Separatist space. Argyus arrogantly gloated to Ventress about his mission's success, and that he had been responsible for Gunray's rescue. Ventress silenced his gloating permanently, impaling him with her lightsaber and killing him. The Jedi Grand Master Yoda was particularly disturbed by the treachery of Captain Argyus, whose actions revealed that the Republic was surrounded by enemies, even within the Senate Guard. After the scandal surrounding the betrayal of Captain Argyus, the entire loyalty of the Senate Guard was put into question, which weakened its authority and diminished its reputation. As such, Chancellor Palpatine began using the Red Guard more often, and they along with the Jedi oversaw high-level prisoner transfers."}, {"tag": "h3", "text": "Coruscant rampage"}, {"tag": "p", "text": "After discovering the last known Zillo Beast during the battle on Malastare, Chancellor Palpatine ordered it brought to the Republic Science and Technical Center on Coruscant. Senate Guards accompanied Palpatine as the beast arrived under heavy guard. Doctor Sionver Boll, however, reported that they could not further study the beast without killing it and so Palpatine ordered it executed. The poison was not potent enough and the Zillo Beast, angered, broke loose and stormed across the capital world towards the Senate Office Building. Escaping along with Senator Padmé Amidala, Jedi Knight Anakin Skywalker, R2-D2, and C-3PO, Chancellor Palpatine left the Chancellor's office through an emergency escape tunnel and boarded the executive shuttle that was piloted by a Senate Guard. As the shuttle left the docking bay, it was seized by the Zillo Beast. Skywalker cut the shuttle in half, loosening the passenger compartment from the beast's grip. However, the Senate Guard and Palpatine were unable to jump from the falling shuttle. Upon it landing on the ground, the Zillo Beast noticed the Chancellor and the Guard and moved towards them just as R2-D2 arrived. Seeing the Zillo beast come towards them and knowing that R2-D2 could not carry both of them, the Guard forced Palpatine onto the droid to be carried to safety, sacrificing himself as the beast slammed its foot down on top of the shuttle's remains, killing the Guard. With the Chancellor in safety, Republic forces began a bombardment of poisonous gas, killing the beast."}, {"tag": "h3", "text": "Assassination protection"}, {"tag": "p", "text": "In an attempt to dissuade the Republic Senate from sending troops to secure the planet Mandalore, New Mandalorian Duchess Satine Kryze traveled aboard the luxury vessel Coronet to Coruscant. She was escorted by Jedi Master Obi-wan Kenobi, Jedi Knight Anakin Skywalker, a unit of clone troopers below decks, and a detail of Senate Guards who were stationed on the bridge. They were taken by surprise and killed by Mandalore Senator Tal Merrik, a secret Death Watch operative, who had taken Kryze hostage. The Dutchess was rescued by the Jedi and Merrik was killed. Chancellor Palpatine and a detachment of Senate Guards greeted them as they arrived on Coruscant. Later, Kryze had a clandestine meeting with a Republic Ministry of Intelligence agent, Davu Golec, who secured hologram evidence for her to plead her case to the Senate. A Death Watch assassin murdered Golec during the meeting, however, a police probe that found Kryze near the body noticed that she had a weapon and identified her as a suspect. The Duchess fled, resulting in a chase by the Coruscant Security Force. Kryze was able to elude them and while the police kept searching for her, she met with Jedi Master Kenobi in Monument Plaza and gave him the hologram. With the information in secure hands, she surrendered to the Senate Guards at the Senate Building. The hologram was played for the Senate, resulting in the Duchess's exoneration and the resolution of the situation."}, {"tag": "p", "text": "A time later, Senate Commandos accompanied Senator Padmé Amidala to the Alderaan Refugee Conference. Jedi Padawan Ahsoka Tano went with them as well after receiving several Force visions that she believed indicated a threat against the life of Senator Amidala. Tano stood with the Senate Guards at the front of the room during the speech. It was at that point that she felt a disturbance in the Force. Rushing to the walkway above the room, Tano interrupted the bounty hunter Aurra Sing shortly before the assassin fired a shot at the senator. The shot struck Amidala in the arm, wounding her though not seriously. The Senate Guards rushed in to cover the Senator as Tano chased Sing. However she lost sight of the assassin. To set a trap for Sing, a droid was dressed up in Amidala's robes and entered the meeting room under a heavy Senate Commando guard force. Senate Commandos also swept the corridors and the walkways around the meeting room, ensuring that the area was secure. From her sleeping quarters, Amidala spoke through the droid using a comlink. However, Sing, realizing it was a trap, attempted to kill Amidala in her quarters. She was again interrupted by Tano who used her lightsaber to deflect the bolt. Amidala managed to stun the assassin just as Captain Gregar Typho and the Senate Commandos forced their way into the room and placed Sing under arrest."}, {"tag": "h3", "text": "Attack on the Senate"}, {"tag": "p", "text": "Arriving on Coruscant, Bane's team split up to gain entrance to the Senate Office Building. Bane, Alama, a sentinel droid, and two droid commandos arrived at the building in an airspeeder, where they were confronted by a squad of Senate Commando guards led by Captain Jayfon. From an adjacent tower, Sing distracted the guards with covering sniper fire, taking out most of the Commandos by herself, while Alama and the droids also engaged the Senate Guards. Bane eliminated the Senate Guard captain and the commando droids dressed up in the Senate Guards' armor to ensure that the fight would go undiscovered. Sing, Robonino, and the sentinel droids arrived at the scene in a second airspeeder. Leaving both commando droids outside to clear the platform of the dead Senate Guards, the team of bounty hunters made their way into the complex."}, {"tag": "p", "text": "Disposing of a Senate Guard stationed at the Office Building's power control room, the group also destroyed several droids in the room. Leaving Robonino to sabotage the building's power distribution network, the rest of the team headed to the meeting of senators. On the way to the east wing of the building where the senators had gathered, Bane tossed a thermal detonator into the Senate Commandos' barracks when two shifts were assembled there. Sing eliminated the only surviving Senate Guard with a shot to the head. The group then entered the Senate Office Building, surrounding and taking prisoner Senators Organa and Amidala and Jedi Knight Anakin Skywalker, as well as C-3PO. Bane made contact with Palpatine who eventually agreed to Ziro's release and freeing the Senators. While leaving the building, the bounty hunters were confronted by Coruscant Guard shocktroopers. Bane used the senators as leverage as he had wired the east wing with explosives. Palpatine ordered the shocktroopers to stand down allowing Bane to escape. However, the bounty hunter then set the bomb off anyway though not before Skywalker cut an escape route for the senators with his lightsaber."}, {"tag": "h3", "text": "Diplomatic functions"}, {"tag": "p", "text": "Senate Guards would continue to stand watch over the Senate and Republic Executive buildings. A special honor guard was present at the funeral of the murdered senator, Onaconda Farr. The Coruscant Security Force was called in and the investigation was led by Lieutenant Tan Divo. The inspector was given charge of the Senate Guards to assist in protecting the involved senators."}, {"tag": "p", "text": "When Duchess Satine Kryze of Mandalore hosted a peace conference on her planet to find a peaceful solution that would end the war between the Republic and the Confederacy of Independent Systems, Captain Taggart, several Senate Guards, and Padawan Ahsoka Tano were sent along to protect the Republic delegation, which consisted of Senators Padmé Amidala, Bail Prestor Organa, and Mon Mothma."}, {"tag": "p", "text": "During the conference, Taggart and some of his men, were stationed at the docks with the Phoenix, the Republic delegation's transport, while the conference was held in the Sundari royal palace. However, during that time, Tano, along with the former Separatist, Lux Bonteri, arrived where Taggart and his men were standing guard. Tano had rescued Bonteri from a potential execution by the Separatists for interrupting the peace conference, and the duo was chased by Separatist commando droids. After Tano told Taggart that she and Bonteri were being chased by commando droids, the Captain and his men responded by giving them cover fire to reach the Phoenix, which attracted the battle droids' attention. Both sides sustained several losses in the following fight."}, {"tag": "p", "text": "Senate Guards, along with shock troopers of the Coruscant Guard and Jedi Mace Windu and Anakin Skywalker, escorted Chancellor Palpatine to the planet Naboo for the upcoming Festival of Light. One of the Commandos responsible for guarding the Chancellor was a male human designated as SG-1984. During the ceremony, Cade Bane and Moralo Eval put their plan into action under the direction of Count Dooku to kidnap Palpatine. Together with their group of bounty hunters which included a disguised Obi-wan Kenobi as Rako Hardeen, they infiltrated the security detail using holographic disguise matrices. A skirmish broke out and the Senate Guards moved in to protect Palpatine. However, using the disguise matrix, Eval and Bane were able to seize Palpatine and fled. They were pursued by Kenobi who was able to capture them shortly before the arrival of Windu, Skywalker, and a Coruscant Guard trooper who arrested the two kidnappers."}, {"tag": "p", "text": "Senate Guards also accompanied Senator Amidala on a diplomatic mission to the planet Scipio however they had to remain at the gates since the area was a neutral zone under the control of the InterGalactic Banking Clan."}, {"tag": "h3", "text": "Dissolution"}, {"tag": "p", "text": "Towards the end of the Clone Wars, Chancellor Palpatine began relying less on the Senate Guards for protection and more heavily on his own personal unit of Red Guards, which would later come to be known as the Emperor's Royal Guard. Formed from the ranks of Senate Guards and was later also filled with clone troopers, the Royal Guard would come to be the Senate Guard's direct successors. After the formation of the Galactic Empire, the Senate Guard was dissolved with its functions taken over by the Royal Guard and the Imperial stormtroopers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}