{"url": "Senate_Spy", "categories": ["Category:Real-world articles", "Category:Semi-protected articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Senate Spy"}, {"tag": "p", "text": "\"Senate Spy\" is the fourth episode in Season Two of the Star Wars: The Clone Wars television series. It is the twenty-sixth episode of the series overall. It is the first in a five-part storyline."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "At the Jedi High Council's request, Padmé investigates a Separatist conspiracy in the Senate."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Anakin discreetly returns to Coruscant to his wife Padmé's apartment. They prepare for a romantic evening, when Anakin gets signaled by the Council to return to the Jedi Temple, forcing him to cut his evening short. Before the Council, he is told that they need a spy in the Senate to spy on Senator Rush Clovis, who is suspected of being a Separatist supporter. However, they can't afford to have Jedi taking official action in this, thus they need to convince Padmé to join their cause, as she is close to Clovis. Though Anakin doesn't believe that she would be right for the job, the Masters insist on him appointing her, because she trusts him; Yoda attempted to enlist her earlier but was rebuffed."}, {"tag": "p", "text": "The next day, at the Senate, Anakin locates his wife, who is obviously resentful of him leaving her last night. He asks her about Clovis, and she says she already told Yoda she doesn't want to spy on him, as he is a colleague and an old friend. However, when she learns that Clovis is collaborating with the Separatists, she immediately agrees to do it. Anakin tries to convince her not to, considering that it may be dangerous, but she reminds him that she is doing her duty."}, {"tag": "p", "text": "They both go before the Jedi Council, where Padmé admits that she hasn't seen Clovis for a long time. They were close in the past, but she wanted to maintain a professional relationship, which he took very hard. The Masters encourage her to regain his trust in finding out his treachery."}, {"tag": "p", "text": "She meets with Clovis at a bar, where he explains that he's planning on going to Cato Neimoidia to negotiate with the Trade Federation; he offers her to come along, for political and personal reasons. As they prepare to depart, Anakin, being the pilot for Padmé's ship, becomes jealous when Clovis kisses her on both cheeks. He assists them with getting seated on the ship, preparing a seat for Padmé, and breaking the one next to it, so that it can't get fastened. On takeoff, he jerks the ship around to prevent Clovis from kissing Padmé again."}, {"tag": "p", "text": "As soon as they arrive on Cato Neimoidia, they are greeted by Neimoidian Senator Lott Dod. Padmé is shown to her quarters while Dod and Clovis discuss \"business\"—which involves the amount of credits needed to build the new droid foundry—with Poggle the Lesser. Clovis refuses to lend them any more credits. Padmé attempts to spy on them while taking a \"walk,\" but they shut down the holographic blueprints. As Clovis leads Padmé away, Dod and Poggle realize that she is Clovis' weakness and plan on poisoning her to force him to cooperate."}, {"tag": "p", "text": "While Anakin and R2-D2 wait outside for Padmé's signal, she gets into an elegant dress for dinner with the other Senators. Dod tricks her into sharing his drink after smearing the rim with poison. Once dinner is finished, Clovis takes Padmé on a tour of the palace, both unaware of the symptoms of the poison, including thirst and head throbbing. While Clovis goes to fetch a drink, Padmé attempts to access the palace's files, but is barred by the computer's demand for a passcode. She soon figures out that it is her name, and sees the diagram from Dooku's new droid foundry. She signals Anakin, who sneaks into her quarters. As soon as she takes the hologram disc with the plans, she hides it from Clovis, who enters the room. When he asks to hold her hand, she spontaneously embraces him to hide the disc."}, {"tag": "p", "text": "She notices Anakin in the shadows, his face bursting with anger and jealousy, but she calms him down by brandishing the disc. She discreetly gives it to him, but as he slips away, Padmé passes out. Clovis reports this to Dod, but is informed that Padmé is a spy. At first he refuses to believe it, but is convinced when he finds the disc missing. He angrily confronts her for betraying him, but Anakin enters, demanding that he step away from her. Clovis realizes that he loves Padmé enough to save her, so he offers to get the antidote in exchange for the disc."}, {"tag": "p", "text": "As they carry Padmé back to the ship, they run into Dod and his aides. Clovis attempts to bluff his way out, but Dod refuses to let them leave, so Clovis pulls out a blaster. Dod is forced to give up the antidote, and the three run away. However, Anakin purposely leaves Clovis on the planet, who is forced to \"talk\" with Dod, as he himself injects Padmé with the antidote."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Although Captain Typho has a speaking line in the episode, neither the character nor the actor who usually voices him, James Mathis III, appears in the cast listing."}, {"tag": "p", "text": "The Jedi Temple Archives feature on The Complete Season Two Blu-ray includes the short deleted scene \"Padmé Glances Over Shoulder.\""}, {"tag": "p", "text": "In an entry on the Star Wars Blog, Bryan Young, the editor of bigshinyrobot.com, drew connections between the episode's story and director Alfred Hitchcock's 1946 thriller/spy film Notorious."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}