{"url": "Seneschal-series_factotum_droid", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Character stubs", "Category:Seneschal-series factotum droids", "Category:Service droid models"], "nodes": [{"tag": "h1", "text": "Seneschal-series factotum droid"}, {"tag": "p", "text": "The Seneschal-series factotum droid, also known as the 2V-series, or simply Toovee, was a model of service droid produced by Imperial DroidWorks during the Cold War. Four such units served the Emperor's Wrath, Darth Nox, Cipher Nine, and the Grand Champion of the Great Hunt during the Cold War, aboard their respective starships. One of the four droids came to serve the Outlander."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "2V-R8 is a companion character for all the Sith Empire classes with their ship of Star Wars: The Old Republic, a video game released by BioWare on December 20, 2011."}, {"tag": "p", "text": "Although he says he does not have any combat skills, 2V-R8 can be called to your side like any other companion character. 2V-R8 when acting as your companion is a healer and has healing related talents. However, when not healing actively, he does try to run and melee your targets. This occurrence does not bode well when it's a powerful target that has AOE abilities. He also can be geared like any other droid to increase his stats. Prior to patch 4.0, His primary stat was Aim, with his stats now derived from his \"Affection\" level, with his damage/healing per second increasing with each level of affection gained, due to companions no longer requiring stat focused gear."}, {"tag": "p", "text": "Initially, 2V-R8 did not receive any affection gains from companion gifts. However, after the release of patch 1.2, 2V-R8, and his Republic counterpart C2-N2, could gain affection from companion gifts."}, {"tag": "p", "text": "Additionally, 2V-R8 does not have any affection gains or decays from decisions made. 2V-R8 also does not naturally have any special affinities to any crew skills like most other companions possess; instead, one of several specialized sensor units can be installed in him to give him such."}, {"tag": "p", "text": "With the release of Knights of the Fallen Empire, both 2V and C2 gained offensive capabilities, allowing them to be either a healer, a tank or an offensive companion with the choice being up to the player and changed at any time. They also now have a blaster pistol, a \"Hoth Mining Blaster\", this however does not change the original introduction conversation where they continue to state they aren't combat models."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}