{"url": "Senni_Tonnika/Legends", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Criminals", "Category:Females", "Category:Kiffar"], "nodes": [{"tag": "h1", "text": "Senni Tonnika"}, {"tag": "p", "text": "Senni Tonnika was a Kiffar female and identical twin of Brea Tonnika. The two were known as the Tonnika sisters and became infamous con artists under the New Order."}, {"tag": "p", "text": "In 0 BBY, they earned additional fame for being in the Mos Eisley Cantina when Luke Skywalker first met Han Solo, but in fact, the \"Tonnika sisters\" in the Cantina were the Mistryl Shadow Guard warriors Shada D'ukal and Karoly D'ulin, masquerading as Brea and Senni in the course of a mission."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The best-known source of information on the Tonnika sisters is a biographical entry written by Rebel Alliance historian Voren Na'al. However, his account contains a number of inadvertent inaccuracies, and it is unclear how far it can be trusted."}, {"tag": "h3", "text": "Early years"}, {"tag": "p", "text": "According to Na'al's account, the sisters were near-Human \"Kiffu\" who grew up on the colony of Kiffex; although \"abandoned\" by their parents in early childhood, they were raised by the colonists in safety and with affection, but they were led astray through a desire for money which their homeworld could not offer. When a young scout pilot arrived on Kiffex to take on provisions, the teenage twins persuaded him to take them offworld with them, claiming falsely that they had been maltreated by the colonists."}, {"tag": "p", "text": "Several problems with this version of events must be noted straight away. Kiffu is not the name of a species, but of a planet, the homeworld of the near-Human Kiffar; the settlement on Kiffex was a notorious prison colony, an infamous den of lawlessness and depravity strictly interdicted by the local security forces. It can be inferred that the sisters grew up on Kiffex, and escaped in their teens through the help of a scout pilot who had landed at the colony; it may even be true that they were treated with relative affection and compassion by the criminals among whom they spent their formative years; but the entire timbre of the standard account must be treated with caution."}, {"tag": "h3", "text": "Career as con-artists"}, {"tag": "p", "text": "Over the following years, the Tonnika sisters acquired a reputation among the galaxy's leading con artists, running several notorious scams against high-society targets, ranging from crimelords to members of the Galactic Empire's new elite. On one occasion, they conned Grand Moff Argon out of twenty-five thousand credits, and in 0 BBY, just before the Battle of Yavin, they were on Tatooine to attend a party thrown by Jabba Desilijic Tiure at his palace on the edge of the Dune Sea. In this much, at least, Na'al's account would appear to be broadly accurate."}, {"tag": "p", "text": "However, Na'al was incorrect in his claim that the twins were arrested in Chalmun's Spaceport Cantina in Mos Eisley, a few hours before Alderaan was destroyed. Although he later acknowledged this mistake, he remained ignorant of the true identities of the women who had been in the cantina: the Mistryl Shadow Guard warriors Shada D'ukal and Karoly D'ulin. Masquerading as the sisters, they were arrested by Imperial Colonel Parq, who was hunting the real twins, but subsequently released by Rebel agent Riij Winward."}, {"tag": "p", "text": "The Tonnika sisters themselves eluded capture, despite the efforts of Argon's agents, and continued to operate as con artists. The true identities of the Mistryl \"Tonnika sisters\" were not disclosed in Winward's report to the Rebellion, and would go unrevealed to Rebel/New Republic personnel until D'ukal petitioned Leia Organa Solo to join the New Republic during the Caamas Document crisis."}, {"tag": "h3", "text": "Identical twins"}, {"tag": "p", "text": "Many of the stories told about the Tonnika sisters turn on the difficulty of telling them apart. They often masqueraded as a single woman named Bresenni, and Vul Tazaene, a Kiffar security officer searching for them, was in love with one of them, but did not know which."}, {"tag": "p", "text": "One of the best-known— and perhaps most reputable— stories about the sisters involves Han Solo, and a scam on Lando Calrissian. Solo had come to know the sisters through his dealings with Jabba Desilijic Tiure, and persuaded them to help him play a trick on the smooth-talking scoundrel. Solo arranged for Calrissian to meet \"Bresenni\" in The High Stakes Casino on the planet Balfron, and although Calrissian thought that his new \"girlfriend\" suffered from severe personality shifts as the sisters swapped around in the role, he genuinely believed that he was growing close to her when Brea and Senni revealed the deception. As he watched a holo-message from Han, Calrissian was at first dejected and angry, but quickly softened, although he vowed to get even with Solo for the stunt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In A New Hope, two tall girls appear together in the Cantina scene, wearing matching catsuits, and with braided hair piled high on their heads. Played by real-life friends Christine Hewett and Angela Staines, they were known by the simple production nickname \"Space Girls\""}, {"tag": "p", "text": "Christine Hewitt has since been identified as portraying Shada D'ukal, disguised as Brea Tonnika with Angela Staines portraying Karoly D'ulin, disguised as Senni Tonnika in 1977's Star Wars: Episode IV A New Hope."}, {"tag": "p", "text": "It is sometimes thought by fans that the girl who kisses Han in the ANH rough-cut is one of the Tonnika sisters. In fact, this \"Cantina Girl\" is a different character known only as Jenny, played by actress Jenny Cresswell."}, {"tag": "p", "text": "In Galaxy Guide 1: A New Hope, these characters were identified as the interplanetary con-artistes Brea and Senni Tonnika, but the article insisted that the sisters were identical twins, both 1.6 meters tall, while the characters seen on screen were visibly different in height and appearance. Hence, Timothy Zahn's short story Hammertong: The Tale of the \"Tonnika Sisters\" established a retcon that identified the girls in the Mos Eisley Cantina as Shada D'ukal and Karoly D'ulin, disguised as the Tonnika sisters."}, {"tag": "p", "text": "This retcon was possible due to the original Galaxy Guide material being presented from an in-universe perspective, as the work of Voren Na'al. Subsequently, however, the Galaxy Guide version of events has been further undermined by the depiction of Kiffex in the Star Wars: Republic comics, particularly in the Darkness storyline, which is largely set on the prison-world."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}