{"url": "Sensor_globe", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Capital ship components", "Category:General purpose sensors", "Category:Starship sensors"], "nodes": [{"tag": "h1", "text": "Sensor globe"}, {"tag": "p", "text": "A sensor globe allowed shipboard sensor systems to operate. A sensor dish could perform the same tasks, albeit with a different exterior appearance."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Sensor globes used on top of Star Destroyers and Super Star Destroyers contained hyperwave transceiver coils and long-range scanners, part of the com-scan system of the ship. The scanners could feed targeting information to the ship's weapons systems, which made them viable targets once the main shields went down in a battle."}, {"tag": "p", "text": "The sensor globes also contained projector vanes for an auxiliary shielding system that had a local-area effect only. The vanes were positioned in a crown-like formation around the sensor globes, forming the ISD-72x deflector shield generator dome system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There has been some controversy[source?] as to whether the domes on Imperial Star Destroyer bridge towers are sensor globes or shield generators. Richard Edlund, one of the special-effects artists on Return of the Jedi, noted in the February 1983 issue of Cinefex that they were \"radar domes,\" thus, for sensor purposes."}, {"tag": "p", "text": "Later guidebooks from Dorling Kindersley devoted to the worlds and vehicles of the films performed what was said to be \"the most thorough research done on the vehicles\" according to a Lucasfilm blurb in Star Wars Insider 68. These books also identified them as sensor globes. It further explained that they contained local-area shielding vanes, but were not the ship's main shield generators."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}