{"url": "Sentience", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Biology", "Category:Sentient species", "Category:Society and culture"], "nodes": [{"tag": "h1", "text": "Sentience"}, {"tag": "p", "text": "Sentience was the quality of self-awareness, abstract thinking, and higher reasoning. Sentients possessed a personality, feeling emotionally as well as thinking intelligently. Sentient species of the galaxy numbered in the tens of thousands, with 3PO-series protocol droids being programmed to recognize more than 30,000 of them. Some such species included humans, Ewoks, Patitites, Gungans, and Geonosians. Non-sentient organics of the animal kingdom were variously referred to as \"creatures\" or \"beasts.\" There also existed creatures that appeared to have emerging sentience, such as the Zillo Beast. Droids were also capable of being sentient, although as with organic beings, some droids, such as 0-0-0 and EV-9D9, took pleasure in inflicting pain upon others. The soul of the varactyl beast was simpler and purer than that of a sentient. Despite this, the creature was still intelligent in its own way."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "The majority of sentient species dwelt on land, where frequent rain sustains lush forests, gardens, and grassy plains, although many species also inhabited dry ecosystems and rocky habitats. These species ability to adapt to survive on these harsher worlds made them better equipped to adapt offworld as well. Certain sentient species preferred to be immersed in liquids, and lived on worlds covered in water, but could survive in airy environments without need for any breathing apparatus or environmental suits."}, {"tag": "h2", "text": "Sentient rights"}, {"tag": "p", "text": "Under the laws of the Galactic Republic, sentient beings could not be used as slaves. However, slavery thrived on certain remote planets such as Tatooine, and was considered a profitable trade among the Zygerrians. Droids were commonly treated as property and inferior to organic sentients, and most droids were afforded programming that did not allow them to harm organic sentient beings, with notable exceptions such as police droids and battle droids. Despite their programming, mechanical beings developed personality quirks and eventually sentience; however, this was suppressed through memory wipes, a process opposed by those in support of droid rights, who advocated for sentient rights for droids and raised the point of the Galactic Empire's Galactic Constitution declaring that all sentients were equal, and that slavery and forced servitude was outlawed."}, {"tag": "h2", "text": "Sentience and the Force"}, {"tag": "p", "text": "With his sentience, Darth Sidious manipulated unwitting senators of the Galactic Senate such as Jar Jar Binks to grant him supreme authority, although by the will of the Force, Sidious was deposed by the son of the Chosen One, who was conceived by the midi-chlorians—organisms that formed a symbiotic relationship with organic beings and communicated to them the Force's will; the foundation of life and what connects and maintains the symbiotic relationship between the Living Force—the energy of all life—and the Cosmic Force, which bound all things in the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars canon, sentience encompasses both sentience and sapience in the real-world."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}