{"url": "Separatist_Nightmare/Legends", "categories": ["Category:Legends articles", "Category:Low Altitude Assault Transports"], "nodes": [{"tag": "h1", "text": "Separatist Nightmare"}, {"tag": "p", "text": "The Separatist Nightmare was a LAAT/i gunship used by the Grand Army of the Republic during the Clone Wars between the Republic and Separatists. The Nightmare had its name painted in aurebesh on the both sides of its nose, along with a clone trooper's helmet painted to look like a Human skull. In 22 BBY, when the Republic launched a full-scale attack on the Separatist stronghold world of Geonosis, the Nightmare served as a troop transport during the battle. The Nightmare carried Jedi General Ki-Adi-Mundi, as well as several clone troopers, during a large aerial assault on the Separatists' main droid factory. However, the Nightmare and several other gunships were shot down by Separatist flak guns before it could reach the Republic's planned landing point, forcing it to crash-land. The gunship was utterly ruined by the landing, but Mundi and a few of his troopers were able to survive and pull themselves out of the Nightmare's wreckage."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Separatist Nightmare was a Low Altitude Assault Transport/infantry gunship, manufactured by Rothana Heavy Engineering, that was used by the Grand Army of the Republic during the Clone Wars between the Republic and Confederacy of Independent Systems. The Nightmare had customized nose art on either of its sides, with a clone trooper's helmet painted to look like a skull, as well as its name written in aurebesh next to the helmet. The gunship had a cockpit large enough to hold a clone pilot, two anti-personnel laser turrets at the front of the vessel, two rear engines, and four composite-beam laser turrets, two of which were at either side of the Nightmare and the other two built-into both of the gunship's wings. The Nightmare had a passenger compartment in the center of the ship that was large enough to hold several grown clone troopers and a Cerean. Although the Nightmare was well armored, it could not withstand continuous fire from enemy flak guns."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 22 BBY, the Republic discovered that the Confederacy had reactivated its battle-droid factories on the planet Geonosis, which the Republic had previously deactivated at the start of the war. The Republic decided to launch a full-scale assault on Geonosis, sending a large Republic fleet—which the Separatist Nightmare was a part of—to conquer the Separatist stronghold. The Republic task force planned to launch a large, three-pronged aerial attack against the well-defended main Confederate droid foundary."}, {"tag": "p", "text": "In the plan, the Separatist Nightmare, alongside many other gunships, would transport High Jedi General Ki-Adi-Mundi, clone Commander Jet, and several other clone troopers across the Confederacy's central defense perimeter and land at a rendezvous point, before continuing the attack on the foundary. At the start of the battle, the Nightmare, with its passengers aboard, launched from a Republic Star Destroyer and began its assault along with the other Republic transports as planned."}, {"tag": "p", "text": "However, the Republic's aerial offensive was met by a well-prepared Separatist counterattack. As the Nightmare approached the Confederate defense line, the gunship's left wing was hit by fire from Separatist flak guns, heavily damaging the Nightmare. The vessel and several other damaged gunships were forced to crash-land a distance from the Republic's planned landing point. The Nightmare was almost completely destroyed by the landing, and many of its passengers and crew were killed, but General Mundi, Jet, and a few other troopers survived and managed to pull themselves out of the gunship's wreckage."}, {"tag": "h2", "text": "Crew"}, {"tag": "p", "text": "The Separatist Nightmare was flown by a clone pilot, as well as a clone co-pilot, who operated the gunship's wing particle-beam turrets. The vessel also had a pair of clone gunners that operated either of gunship's side beam turrets. During the Second Battle of Geonosis, the Nightmare was used to transport several clone troopers—including clone Commander Jet—and Jedi Master Ki-Adi-Mundi. After it was shot down, many of the Nightmare's passengers were killed, but Mundi and Jet managed to survive the crash-landing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Separatist Nightmare's first and only appearance was in \"Landing at Point Rain,\" the fifth episode in Season Two of The Clone Wars television series. In the episode, the gunship had its nose art put in as an easter egg, which the \"Landing at Point Rain\" episode guide later pointed out."}, {"tag": "p", "text": "In a continuity error, when the Nightmare departs the assault ship, the outside of the cockpit is green, but later, it is red."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}