{"url": "Senya_Tirall", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Alliance individuals", "Category:Females", "Category:Humans", "Category:Knight-Captains"], "nodes": [{"tag": "h1", "text": "Senya Tirall"}, {"tag": "p", "text": "Senya Tirall was a Human female Force-sensitive native of Zakuul, the capital of the Eternal Empire. Joining the ranks of the Knights of Zakuul, she rose to become a member of the personal guard of the Immortal Emperor Valkorion and caught his interest. The two began a romantic affair, and Tirall bore three children—the twins Thexan and Arcann, and her daughter Vaylin. Senya grew troubled by Valkorion's indifference to his children, which culminated with him locking Vaylin on Nathema and subjecting her to mental conditioning. Senya attempted to rescue her daughter to no avail and later attempted to run away with the children, but they refused to leave, calling her weak. Senya abandoned her family, but not the Empire, taking assignments on the fringes of Zakuulan space. Seeing her family only in public broadcasts, she eventually learned that Thexan was killed during the raids into the Core Worlds. Not long afterwards, Valkorion was assassinated and Arcann claimed his Eternal Throne, launching Eternal Empire conquest of the galaxy and enacting a Scion massacre, which was the last straw for Senya and caused her to oppose the tyranny of her children."}, {"tag": "p", "text": "After the Outlander blamed for killing Valkorion was rescued from carbonite by Senya's associate Lana Beniko, she was asked to provide assistance in their escape. Senya joined Beniko's group in the Endless Swamp, where she helped raise the legendary Gravestone from the mud, escaping on the ship alongside Zakuulan defector Koth Vortena. The group traveled to the shadowport of Asylum, where Senya introduced the Outlander to the Scions of Zakuul and revealed her relationship to the Emperor and his High Justice. She later accompanied the Outlander back to Zakuul on a mission to find and recruit the Lady of Sorrows, returning with her to Asylym shorly before Arcann's Eternal Fleet launched an attack. Senya helped defend the Gravestone against skytrooper assault and engaged her daughter in a Lightsaber duel, during which Vaylin revealed to her that it was Arcann who killed Thexan. Escaping from the Eternal Fleet on the Gravestone, Senya traveled with the rest to Odessen, where she joined Lana Beniko's Alliance to oppose the Eternal Empire. Senya participated in Alliance operations on Zakuul and Vandin, providing valuable information on the Eternal Empire. She joined an assault party that boarded an Eternal Fleet warship in an attempt to control the ships' GEMINI captains, which inadvertently resulted in SCORPIO taking control of the Eternal Throne."}, {"tag": "p", "text": "In the resulting battle of Odessen Senya rescued wounded Arcann from his Eternal Flagship and fled from the Alliance forces determined to redeem him. An attempt to contact loyalist Zakuulan Knights turned disastrous when Vaylin intercepted the call and massacred the Knights on Ord Mantell, with Senya herself barely escaping her daughter. Senya later brought Arcann to Voss, where Vaylin again found her and launched an Invasion of Voss before Voss healing ritual could fully help Arcann. Desperate, Senya contacted the Alliance for help and begged the Commander to hold off Vaylin's forces and allow Arcann to be redeemed. However, there was still not enough time and Senya ordered Voss Mystics to give her strength to her son, which healed Arcann, but left Senya comatose. She remained on Odessen under watch, waking up only when Vaylin found a way to break her conditioning and launched an assault on Odessen. Senya joined her son, who had been redeemed and joined the Alliance, in defending the Gravestone from the ground assault and conronted Vaylin together with the Alliance Commader, who struck her a killing blow. To stop the rampage of the leaderless Eternal Fleet, Senya and Arcann accompanied the Alliance Commander to Zakuul, allowing them to seize the Eternal Throne and pacify the rampaging Fleet. However, Valkorion's spirit then attempted to take over the Commander's body and Senya and Arcann used Dramath's holocron to enter Commander's mind and aid them in finally destroying Valkorion, ending his millenia-long existence."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A Knight of Zakuul"}, {"tag": "h4", "text": "The Emperor's family"}, {"tag": "p", "text": "Senya Tirall was born on the Wild Space planet of Zakuul, the capital of the Eternal Empire ruled by Immortal Emperor Valkorion. When her Force-sensitivity was discovered, she joined the ranks of the Knights of Zakuul and eventually earned a place in Emperor Valkorion's elite guard. Senya didn't hesitate to speak her mind, speaking out against replacing human soldiers in military positions with skytroopers, catching the Emperor's interest. Two years later, Valkorion and Senya become romantically involved, eventually marrying and bearing his children, giving birth to twins Arcann and Thexan. Despite Senya showering them with love, her sons gave none in return, seeking to impress their father, who seemed content to ignore them in turn. Their third child and only daughter, Vaylin, was a trouble from the very start, being so powerful that she made furniture move with the Force while still in the womb. As a toddler, Vaylin tore droids apart and one time, when a guard dropped a ball she tossed, Vaylin crippled him. Senya spent as much time as she could with her daughter and the two shared many happy moments, but Vaylin preferred to do even mundane tasks using Telekinesis instead of her hands. Eventually during a sparring exercise Vaylin gave way to her rage, crushing several Zakuul Knights inside their own armor."}, {"tag": "p", "text": "Senya went to Valkorion and pleaded with him to help his children, but the Emperor's solution was merely to cage Vaylin's mind, locking her power away along with most of who she was, and continuing to ignore Thexan and Arcann. He took Vaylin to Nathema, a blighted world devoid of the Force and locked her in the Sanitarium, where she underwent brutal mental and physical torture at the hands of Nathema Zealots, while Anomid scientist Jarak worked her on her mental conditioning, transforming Vaylin from a sweet but troubled child into a psychopath devoid of empathy. Sensing her daughter's suffering home on Zakuul, Senya decided to get Vaylin away from Nathema. A shuttle delivered her to Sanitarium, where she found Vaylin unconscious and carried her to the landing platform. There, her path was blocked by six of the Nathema Zealots and after Vaylin opened her eyes, Senya ordered her to stay back, while she took great care to knock out all six Zealots without killing them. Senya then asked Vaylin to come with her, but the look in her daughter's eyes was filled with hate, with Vaylin blaming her mother for her suffering. Valkorion himself then emerged from the Sanitarium and ordered several Knights of Zakuul to restrain Senya and take her away, while taking Vaylin with him back into Sanitarium. Deciding that her children were not safe around Valkorion, Senya attempted to run away with them, but the children idolized their father and refused to leave, calling their own mother weak. Even as children and with Vaylin's powers locked away, the three of them were more powerful than Senya, so she was forced to leave alone. Valkorion didn't even try to stop her, although years later he privately admitted to the Commander that he made a mistake in letting her go. Senya transferred to the Knights' enforcement division and took assignments at the fringes of the Eternal Empire."}, {"tag": "h4", "text": "A lone Warrior"}, {"tag": "p", "text": "Despite the falling out she had with her family, Senya remained a loyal Knight of Zakuul for years. She spent some time overseeing the treasury ship Gilded Star. In 3636 BBY the Eternal Empire made a contact with the larger galaxy, leading a series of raids meant to test the strength of the Core Worlds. Following one such attack on Korriban, it was publicly proclaimed that prince Thexan was killed during the fighting. Senya watched her son's funeral on the public broadcast, the only way she could now see her family. Later that year, Valkorion was assassinated at the hands of an Outlander captured during one such raid, and Arcann took his father's Eternal Throne, proclaiming himself the new Eternal Emperor, with Vaylin as his High Justice. Arcann launched a full-scale invasion of the galaxy, claiming it a retaliation for the Outlander's crime. During the Occupation of Denon a crew serving under captain Koth Vortena refused to massacre civilian rioters on Denon and deserted, and Senya was assigned to hunt them down, spending months attempting to capture the deserters. During that time she met Sith Lord Lana Beniko who was looking for the whereabouts of the Outlander, exchanging what information she could with her. Senya later became sympathetic to Beniko's cause, seeing how oppressive and cruel Arcann's rule had become, but the final straw for her was the Scion massacre, when Arcann ordered the Zakuulan Knights to kill the Scions of Zakuul who served alongside them. Horrified by her son's actions, Senya felt that the Knights had lost their honor when they decided to follow that order instead of rebelling. She abandoned the Knights and went to find for a way to stop the cruel rule of her children."}, {"tag": "h3", "text": "Opposing own children"}, {"tag": "h4", "text": "Joining Beniko and Vortena"}, {"tag": "p", "text": "By 3631 BBY, five years into Arcann's rule, Lana Beniko and Koth Vortena had found and rescued from being imprisoned in carbonite by Arcann the Outlander that blamed for Valkorion's assassination. Aware of Koth's prior history with Senya, Lana contacted her in secret, asking her to come to their hiding place and provide assistance in escaping their pursuers. Senya went to Lana's coordinates in the Endless Swamp of Zakuul, where the fugitives have found and partially repaired the legendary vessel called the Gravestone. Senya arrived on her speeder bike just as Beniko and the Outlander were fighting off skytrooper forces and helped them hold their ground against Zauulan Knights. When another wave of attackers was dealt with, Koth Vortena rushed to their help and upon seeing Senya, immediately showed his distrust of her, refusing to let her aboard. However, there was no time for argument with more pursuers on their way and Senya worked together with Lana to raised the Gravestone from the swamp using the Force. As everyone got onboard and the vessel left the atmosphere, the Eternal Fleet arrived to intercept them, only for the Outlander to fire the Gravestone's omnicannon, destroying more than two dozen Eternal Fleet warships in a single shot and enabling the Gravestone to jump into Hyperspace. Hostilities soon erupted on the bridge as Koth and Senya's past history prevented them from working towards a common goal."}, {"tag": "p", "text": "The ship was able to get a short distance away before the Gravestone hyperdrive failed. After informing the Outlander that they were going to Asylum, Senya responded to Koth's hostility with insistence that her pursuit of him was justified, considering his status as a deserter. With their argument going nowhere, Senya left the bridge to wander and explore the ship, going down into the deeper part of the ship and finding an enigmatic monolith in an area called \"the Dark Sanctuary\". The Outlander found her there, and the two had a brief conversation, in which Senya formally introduced herself. The Gravestone managed to limp to the shadowport and dock as the Asylum, where Vortena's crew of Zakuulan exiles joined him to work on the ship, prompting a sarcastic remark from Senya who was not told of their company beforehand. Senya then went to meet with the Scions of Zakuul who had a secret enclave on the Asylum, asking the Outlander to join her there later. She waited at the hidden entrance to the enclave until the Outlander arrived in the company of Lana's Bodyguard droid HK-55. Senya opened the secret entrance, upon entering which the HK was hit by an electromagnetic pulse that disabled him and wiped his short-term memory. Senya explained to the confused Outlander that the Scions, led by Heskal, wanted to meet with only the two of them to determine whether they would join the Outlander's rebellion against Arcann."}, {"tag": "p", "text": "Heskal explained that for some reason the Outlander remained a blind spot in the Scions' visions and they had to understand the Outlander's role in the events to come before any talk of cooperation. Senya joined the Outlander in persevering through the Scions' trials, to better understand the person who intended to kill her son and daughter. They were engaged in combat by Scions and had their intentions questioned by Heskal, who insisted that Arcann and Vaylin had to die for their slaughter of the Scions. Still unable to perceive the Outlander's fate, Heskal knocked out Senya and engaged the Outlander one-on-one. The Outlander emerged victorious and stood over a defeated Heskal, and Senya pleaded not to harm Heskal, insisting that they needed the support of the Scions. At that moment, the sanctuary was stormed by Hk-55, Lana Beniko, Koth Vortena and his crew, who demanded that the Scions stand down. Heskal ordered his men to out away their lightsabers and asked the Outlander a final question about their intentions for the galaxy after Arcann's defeat. After the Outlander gave the answer, Heskal shocked everyone by revealing that the reason why the Scions could not see the Outlander future was because Valkorion had survived within their mind. The revelation excited Koth, who believed that Valkorion's survival meant salvation for Zakuul, while Lana stated that the Emperor was a threat to all life everywhere. As the Outlander prepared to leave the enclave, Senya confessed her ulterior motive for including herself in the trials, revealing herself to be Arcann and Vaylin's mother."}, {"tag": "h4", "text": "Return to Zakuul"}, {"tag": "p", "text": "The team then regrouped at the Gravestone, where Koth lashed at Senya again for lying and asked whether she really expected them to believe that she was going to oppose her own children. Senya suggested asking Valkorion directly, though the Outlander rejected the notion of being merely Valkorion's mouthpiece. Koth and Lana soon began to argue over whether Valkorion was benevolent or a monster, each arguing that they knew more about him than the other. Senya interjected that she knew him better than anyone else, which only made the situation awkward given her unintended implication. The argument was interrupted by HK-55, who relayed a message from Lana's astromech droid T7-O1 on Zakuul, informing them that the information broker known as \"Lady of Sorrows\" wished to establish a dialogue with the Gravestone computers. Senya explained to everyone that the Lady of Sorrows was an information broker who had remained out of the reach of Zakuulan law and volunteered to guide the Outlander through the Old World district of Zakuul, where the Lady was known to operate."}, {"tag": "p", "text": "Upon returning to Zakuul in a shuttle, Senya puzzled the Outlander by singing a song, in spite of the fact that they're headed into hostile territory. After meeting up with T7-O1, Senya went to meet with her contact Reg in the Platform 6 cantina. However, the Knights were not welcome in the Old World and Reg set Heralds of Zildrog led by Aitan Brewgs on Senya, who managed to hold her own against the three attackers until the Outlander arrived and helped her to finish them off. Afterwards, Senya confronted Reg, who explained that the Heralds made a deal with Arcann; in exchange for the Knights keeping out of the Old World, the Heralds would keep crime levels down. Senya demanded to know where to find the Lady of Sorrows but Reg refused, so Senya had to use the Force to demand answers of him, and Reg gave up, pointing Senya and the Outlander to one of the Lady's business partners, Mona Gale. Senya and the Outlander found Gale at the Market Station, taking bets on Arena Grand fights, which Senya found brutal and barbaric. Senya asked Gale on hos to contact the Lady just as a public broadcast from Arcann labeled Senya as the Outlander's accomplice. This unintentionally gave them some street clout, as Gale admitted that she didn't know how to contact the Lady, but suggested they go to the Heralds in Breaktown to get a meeting with her."}, {"tag": "p", "text": "Senya and the Outlander traveled to Breaktown, but just as they were about to enter the Heralds' lair, they were interrupted by Koth Vortena, who learned of their destination from T7-O1 and decided to follow. Koth insisted that the Heralds' leader, The Exalted, detested Knights and wouldn't talk to Senya, arguing that he should accompany the Outlander instead. The two began arguing, with Senya insisting that she could simply strongarm the Exalted into compliance, and Koth claiming that as an average Zakuulan, he could reason with them better. The Outlander made their decision and took one of them to meet with the Exalted, while the other was ambushed and brought to the Lady directly. The Exalted refused to cooperate and was about to order his Heralds to open fire on the Outlander, but was interrupted by a holocall from Lady's Nautolan aide Thea, who told them that the Lady wished to meet both the Exalted and the Outlander at the Razor. The parties converged on the base of operations of the Lady of Sorrows, who was revealed to be an advanced Artificial intelligence calling herself SCORPIO. She killed the Exalted and his Heralds and agreed to accompany the Outlander, departing Zakuul alongside Koth and Senya."}, {"tag": "h4", "text": "Asylum and start of the Alliance"}, {"tag": "p", "text": "Back on the Asylum, Heskal called the Outlander for another meeting at the Scions hideout, where it was revealed that he gave up their location to Arcann, acting in accordance with a prophecy. The Eternal Fleet emerged from hyperspace and opened fire on the shadowport, while the Gravestone remained grounded by Asylum docking clamps. Lana Beniko and Koth's crew led by Len Parvek held their own against the skytroopers, but when Vaylin herself arrived at the scene and personally confronted the Outlander, Senya rushed to aid the defenders. She first dispatched a Zakuulan Knight going after Koth's crew before telekinetically tossing the Outlander away before Vaylin could land a single blow. Seya then urged Beniko to follow the Outlander and free the Gravestone, staying behind to deal with her daughter herself. After a brief exchange of words Vaylin attacked her and the two engaged in a Lightsaber duel, as Senya attempted to reason with her daughter but failed. Ultimately, Senya managed to disarm Vaylin and had her at her mercy, she but unable to land a finishing strike. This amused Vaylin, who revealed to her mother that it was Arcann who killed Thexan in cold blood, a revelation that shook Senya to the core. Senya managed to gather her wits enough to rejoin her allies aboard the Gravestone after it was released from docking clamps and fled Asylum. The ship escaped from the Eternal Fleet to hyperspace, and the Outlander collapsed from injuries sustained in a duel against Arcann."}, {"tag": "p", "text": "The Battle of Asylum served as a rallying cry for those who wished to oppose Arcann, and Lana called her multiple contacts to gather on the remove planet Odessen, where she laid the foundations of an Alliance against the Eternal Empire. The Gravestone arrived to Odessen, where Senya noted that it was unwise to leave SCORPIO with access to the ship's systems. Elements from the Galactic Republic and the Sith Empire threw their support behind the new Alliance, establishing a base on Odessen. Senya intended to sing in a new Alliance cantina, but was put off by Koth again and went outside to contemplate, where she was later approached by the Outlander. She congratulated the new Alliance Commander on the progress that was made, while musing about how many Scions followed Heskal to their deaths, despite knowing that the visions were not infallible. She also revealed the circumstances of Thexan's death at Arcann's were told to her by Vaylin and became reaffirmed in her confidence that her children had to be stopped by any cost and that she had to live with the consequences. Some time later Arcann, trying to lure the Outlander and the Gravestone out of hiding, ordered the Eternal Fleet reprisal bombardments of five inhabited worlds, reducing them to rubble and causing millions of deaths. Senya was appalled by this tragedy and insisted to the Alliance leadership that they must make her children answer for their crimes."}, {"tag": "p", "text": "The new Alliance made several bold strikes against the Eternal Empire, which attracted new members and volunteers. The Commander recruited Kaliyo Djannis, an experienced anarchist known as \"Firebrand\", who survived on Zakuul for two years, and assisted Republic Special Forces Division Havoc Squad under Major Aric Jorgan in wire-tapping a Zakuulan listening post in the Eternal Swamp, a missing for which Senya and other Alliance members provided a major distraction. Combining the information from the two sources allowed SCORPIO to reveal the existence of the GEMINI frequency, by the means of which Arcann controlled the Eternal Fleet. The Alliance planned an attack on the Hyperwave relay station hidden ten kilometers beneath the Spire on Zakuul and connecting the Eternal Throne to the Eternal Fleet, sending the Havoc Squad and Kaliyo Djannis on the mission, one of them providing a diversion for the other's main objective. Bearing animosity for Firebrand's anarchist attacks, Senya was against Kaliyo's involvement in the operation. Unfortunately, the Commander went missing and was unable to join on the mission, so the Alliance had no choice but to proceed regardless. In the process the contact with the infiltration team was lost, prompting the diversion team to attempt a rescue. At that point, the Spire went into full lockdown with no transmissions coming in or out, making any rescue attempt all but impossible and leaving the Alliance leadership no choice but to wait."}, {"tag": "h4", "text": "The Gilded Star and GEMINI trap"}, {"tag": "p", "text": "While awaiting the status of the away team, the Alliance was approached by Gault Rennow, who offered them the opportunity to raid Arcann's treasury ship the Gilded Star, with which Senya was familiar. Strained for funds, the Commander agreed to the plan and accompanied Gault to Vandin along with Lana Beniko, Theron Shan, Senya Tirall and SCORPIO. There Gault brought in his partner Vette and identity slicer Dretcher, who forging the identity of High Justice Vaylin for Senya Tirall, who provided a genetic match and required character knowledge and would take SCORPIO aboard as her \"attache droid\". They would access the bridge and lower security, allowing Vette, Gault and the Commander to get onboard and detonate a warhead inside the vault, while Shan and Beniko would pilot a tanker to siphon off the vaporized previous metals. When the Gilded Star docked with the skyhook its annual resupply, Senya, disguised as her own daughter, escorted SCORPIO past the guards onto the bridge, where SCORPIO took control of the ship's functions, enabling the Commander and Gault to plant a warhead inside the vault, which upon detonation vaporized its valuables, while leaving everything outside the vault safe and intact. The vault's entire content of precious metals was then pumped into the tanker piloted by Lana Beniko and Theron Shan, where SCORPIO and Senya soon joined them. Those aboard the Gilded Star had to avoid the real Vaylin, but were picked up by Hylo Visz, with both ships safely returning to Odessen."}, {"tag": "p", "text": "The celebration was interrupted by the return of Aric Jorgan and Kaliyo Djannis, who managed to escape Zakuul with a database on the GEMINI droids. Its analysis let SCORPIO reveal that the GEMINI droids were produced from a template called GEMINI Prime in a weapons factory on Darvannis. Senya identified Darvannis as one of the first worlds conquered by the Eternal Empire and a staging point for their invasion in the wider galaxy. After the Commander secured the Prime with the help of Mandalorians, SCORPIO determined that plugging the Prime into any of the warships in the Eternal Fleet would enable her to take over the entire network, and with it the Eternal Fleet. Senya noted that while infiltrating a ship inside a formation would be suicide, individual ships made cargo runs from the Core Worlds all the time and presented a much easier target. After SCORPIO located a lone warship scheduled to recharge its hyperdrive as their target, the Alliance leadership moved to intercept it."}, {"tag": "p", "text": "As the Gravestone was traveled through hyperspace towards the Eternal Fleet warship's location, Senya advised the Alliance to expect massive swarms of skytroopers to rush the breach point as soon as they boarded the ship. Emerging from hyperspace, SCORPIO confused its targeting systems while Theron Shan piloted a shuttle inside its hangar, where Senya immediately noted the absence of skytroopers as suspicious. Inside, the GEMINI captain noted their presence and separated the Commander and SCORPIO from Lana, Senya and Theron. While making their way to a rendezvous point, the three found that the ship was transporting prisoners for Arcann to interrogate - Imperial Admiral Zasha Ranken, Republic Senator Tai Cordan and Zakuulan holostar-in-exile Malita Tal. SCORPIO apparently was destroyed in her attempt to override the GEMINI captain, and Lana send Senya to assist the Commander. Lana and Theron escorted the freed prisoners to the escape pods, as Senya and the Commander confronted and defeated the GEMINI captain on the ship's bridge. The GEMINI however, revealed their sabotage to Emperor Arcann and triggered the ship's self-destruct. One of three escape pods was destroyed and the Alliance could barely manage to escape the vessel's destruction in time and jump into hyperspace onboard the Gravestone. SCORPIO then contacted the Alliance and revealed that she faked her death, using the GEMINI network to transport herself to Zakuul, where she took control of the Eternal Throne."}, {"tag": "h3", "text": "Redeeming Arcann"}, {"tag": "h4", "text": "Taking refuge"}, {"tag": "p", "text": "Returning to Odessen, the Alliance learned that a portion of the Eternal Fleet remained under Arcann's control and that SCORPIO revealed to him the location of the Alliance base. With Eternal Fleet on its way, the Commander left behind some forces in case of a ground assault, while taking the fight to Arcann from the Gravestone. As the battle of Odessen began, Beniko determined that the only way to ensure safely of the Alliance was to annihilate Arcann's Eternal Flagship and Senya volunteered to join the boarding party, determined to face her children. Infiltrating the Eternal Flagship, Senya, Lana and the Commander were spotted by Vaylin on the security cameras, who contacted them through a loudspeaker and revealed that Arcann's was on the ship's bridge and that she only cared about facing her mother alone. Senya urged the Commander and Lana to deal with Arcann, while she went after Vaylin. The Commander confronted and defeated Arcann on the bridge, crushing him under a pile of debris as SCORPIO took control of what remained of the Eternal Fleet to fire on the Flagship, attempting to eliminate Arcann and the Commander in one fell swoop. Senya arrived soon after the Outlander left the bridge and pulled Arcann from under the rubble, lamenting her inability to save him. She was then interrupted by the arrival of Vaylin and offered both her children to come back to her. Vaylin refused, still angry at Senya for abandoning her and launched herself at her mother, but Arcann Force-pushed his sister away, saving Senya and leaving Vaylin feeling betrayed. Senya took it as a sign of hope for both of her children and urged Vaylin to come along with her and Arcann. Before Vaylin could answer, falling debris forcing her to retreat and flee back to Zakuul. Senya then took Arcann into his personal shuttle and contacted the Alliance, informing them that she was taking Arcann to redeem him, before fleeing into hyperspace."}, {"tag": "p", "text": "Returning to Zakuul, Vaylin allied herself with SCORPIO and claimed the Etenal Throne. As one of her first acts as Empress of Zakuul, Vaylin declared a bounty on her mother, pursuing every lead herself. Arcann fell into coma from injuries sustained during the battle, and Senya hooked him into a system of tubes and vials keeping him alive, but could not acquire medical equipment and supplies necessary to heal him on her own. With nowhere to turn to, Senya was unexpectedly contacted by the remaining Scions of Zakuul, who refused to meet with her directly, but instead arranged for Senya to meet with a group of Zakuul Knights who had turned against Vaylin. Afraid that Vaylin might disband or even destroy their order, this group of Knights awaited Senya on Ord Mantell, where they could provide healing supplies for Arcann. Cautious, Senya landed her stolen shuttle several kilometers away from the meeting spot and make the final approach on foot, in the cover of the night. Upon reaching the camp's coordinates, Senya found only the bodies of dead Knights lying in the puddles of spilled rhydonium, and a small wooden toy, the ony that Vaylin herself made as child and kept in her possessions even in Nathema's Sanitarium. After Senya realized that Vaylin became aware of the dissident Knights and slaughtered them before she even arrived, Vaylin herself appeared from the shadows, using Force-lightning to ignite the rhydonium streams. Vaylin used the Force to snatch Senya's Lightsaber pike from her hands and attacked, while Senya grabbed one of the fallen Knight's lightsabers and defended herself from her daughter's attack. The two dueled among the flames and exchanged taunts, with Vaylin calling her mother afraid while Senya implied that her daughter was taking orders from SCORPIO. The duel ended when Vaylin launched Senya's lightsaber pike at her and hit the Hyperdrive of a damaged shuttle, which exploded, giving Senya a chance to escape in confusion. She ran back to her shuttle on foot and quickly took off from Ord Mantell after making sure Vaylin was not following her."}, {"tag": "h4", "text": "A mother's sacrifice"}, {"tag": "p", "text": "Senya eventually made it to Voss and brought Arcann to the Shrine of Healing, where she hoped to use the Voss healing ritual to heal both Arcann's injured body and his spirit, curing him of the hatred that had consumed him. However, Vaylin followed her and launched an invasion of Voss, determined to kill all her family in one fell swoop. The Eternal Fleet met resistance from the Alliance forces and Senya was forced to contact Theron, Lana and the Alliance Commander, for help. The Commander and Theron Shan traveled to Senya's location, but before they could talk, Vaylin addressed them through a Skytrooper holocomm, taunting her family and ordering the Eternal Fleet to bombard the Shrine in an attempt to kill them all. Senya asked the Alliance to hold off Zakuulan forces so that the healing ritual could be completed and rushed to her son after they agreed. Lana Beniko and a team of Mandalorians held off Eternal Empire forces from pouring into the Shrine, while the Commander and Theron Shan collapsed the tunnel behind them to stop the ones already inside from reaching Senya's position. Senya herself battled and single-handedly defeated a host of Zakuulan Knights, but as it became clear that there was not enough time until their position was overwhelmed, Senya ordered the Mystics to take her strength to heal her son. The Mystics complied and transferred her strength to Arcann, healing his injuries and mending his broken spirit, though this act left Senya comatose. Arcann awoke confused and, witnessing his mother's lifeless body, fled the Shrine back to his shuttle, believing her dead. Alliance forces soon found Senya and transferred her to Odessen, where Doctor Juvard Illip Oggurobb stabilized her condition, and began looking for possible treatments."}, {"tag": "p", "text": "During the Grand Festival of Empress Vaylin Alliance operatives infiltrated Vaylin's Palace of the Eternal Dragon on Zakuul in an attempt to take her down, while Arcann and his loyalists assaulted the Palace with a similar goal. Vaylin escaped the carnage, and Arcann thanked the Commander for saving his mother and offered to join the Alliance to atone for his crimes. Arcann joined the Alliance on Odessen, while Vaylin returned to Nathema, where Jarak helped her break free from her mental condition. Sensing her daughter break free of her last restrictions, Senya awoke from her coma, with Arcann at her side."}, {"tag": "h4", "text": "The end of Valkorion"}, {"tag": "p", "text": "No longer chained by her conditioning, Vaylin immediately launched an assault on Odessen, intending to wipe out the Alliance and her entire family. As the battle raged on multiple fronts, Senya and Arcann teamed up to protect the dry-docked Gravestone from the Vaylin's forces. When the Commander caught up with them, the mother and son pledged their support for the Alliance cause once more and offered to stand by the Commander's side against Vaylin. The Commander contacted Vaylin via a holo-call, successfully taunting her to abandon the safety of her flagship and travel to Odessen surface for a face-to-face confrontation. Holding an Alliance member hostage, Vaylin awaited on the Alliance landing platform as the Commander and her family arrived to stop her. Her power raging out of control, Vaylin killed her hostage and caused a massive Force Storm, leaving the Commander no choice but to strike her down. As Vaylin lay dead, Senya and Arcann lamented her loss, but were relieved that the conflict was over."}, {"tag": "p", "text": "However, Vailyn's death left the Eternal Throne empty, leading the GEMINI captains to revert to their basic programming and commanding the Eternal Fleet to bombard inhabited worlds indiscriminately. The Alliance leadership boarded the Gravestone and departed for Zakuul, intending to end the threat once and for all. Using upgrades from Iokath, the ship was able to breach the Eternal Fleet blockade, and Senya and Arcann volunteered to accompany Commander to the Eternal Throne. Together, they traveled down to surface in a boarding pod that landed in the Garden of Izax and made their way to the Spite as the Eternal Fleet burned Zakuul around them. After entering the Eternal Throne room, Arcann was taken aback at seeing his old Throne and lamented the death of millions he caused while holding it, while Senya assured him that he became a better man since then. The Commander took the Throne and pacified the Fleet, but immediately afterwards Valkorion revealed his ultimate goal, assaulting the Commander for control of their body. Within the depth of their mind, the Commander fought back by locating the Dramath's holocron, which held power to destroy Valkorion once and for all. The Throne room was breached by the attacking skytroopers and mother and son held them off for a while, until Senya told Arcann to use the physical Holocron to join the Outlander in the fight against his father. Inside the Commander's mind, Arcann joined Vaylin's essence, which remained bound to Valkorion after her death. Using the holocron to free her from Valkorion's control, Arcann and the Outlander convinced Vaylin to joined their side and attacked the Immortal Emperor. After toying with them for a while, Valkorion destroyed the holocron, but since his spirit was now bound to Vaylin's, the Commander used Vaylin's mental key phrase \"Kneel before the Dragon of Zakuul\" to rob him of his own strength. Overpowered and weakened, Valkorion watched as Senya joined her children in the Commander's mind and together the family watched the Immortal Emperor's final words and moments, until the Commander put a final end to his millennia-long existence. Back in the physical world, Senya congratulated the Commander on finally putting an end to Valkorion and opened a system-wide holochannel to announce the Alliance victory. The Commander then proclaimed the age of the Eternal Alliance, unifying the military of Zakuul and the Eternal Fleet with the cause of the Alliance, which Senya continued to be a part of."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Senya Tirall possessed a sense of duty and honor, continuing to serve the Eternal Empire even after being abandoned by her family and holding a grudge for exiled officer Koth Vortena even after she became a defector herself. A loving mother to her children, Senya faced great difficulty raising them due their father's power and status, causing the twins boys to have nothing to do with her and her daughter Vaylin to eventually be taken from her and turned against her mother. Witnessing the atrocities committed by her children, Senya became determined to put them down, only to realize she was unable to do the deed herself. She could not bring herself to strike Vaylin on Asylum when she had her at her mercy and later choose to try to redeem Arcann rather than let the Alliance kill him. A talented warrior, she was also well-versed in Zakuul history and enjoyed singing in her spare time. Despite her usual soft nature, Senya could be swift and ruthless when on a mission, no stranger to using threats and coercion to get information."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Senya was an experienced duelist capable of holding the upper hand in a fight against her daughter, she was also capable of performing great feats of telekinesis as she could help Lana Beniko free the Gravestone from the Endless Swamp."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Senya Tirall appears in Star Wars: The Old Republic: Knights of the Fallen Empire as a major companion character voiced by Abby Craden. First appearing in Chapter V: From the Grave, she becomes a companion in the following Chapter VI: Asylum before departing and becoming unavailable at the end of Chapter XVI: The Battle of Odessen. Early on in the Knights of the Eternal Throne player has to choose between allowing Senya to heal Arcann or insist on the intention to kill him. In the Light Side option, Senya later rejoins as a companion after awakening from her coma, as does Arcann. In the Dark Side option, Senya is killed on Voss and becomes permanently unavailable, though players can still reclaim her from a terminal on Odessen for use in non-storyline purposes."}, {"tag": "p", "text": "Senya featured prominently in Betrayed cinematic trailer, released between the end of the Fallen Empire and the release of the Eternal Throne expansions. Her face in the trailer was noticeably different from her in-game model, which was changed with the release of the Eternal Throne to more closely match her cinematic appearance. Senya uses a telescopic lightsaber pike in the trailer, and the item \"Senya's Lightsaber Pike\" was later made available from Cartel Market packs, however she uses a normal lightsaber in the game. Betrayed trailer ends on a cliffhanger as Vaylin attacks Senya, the full story of the events on Ord Mantell including Senya's escape were laid out in A Mother's Hope, a short story by Drew Karpyshyn published on the game's website."}, {"tag": "h3", "text": "Gameplay alternatives"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}