{"url": "Separatist_Crisis", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Mid Rim", "Category:Conflicts of the Outer Rim Territories", "Category:Galactic Republic events", "Category:Jedi", "Category:Rebellions and uprisings", "Category:Separatist Crisis", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Separatist Crisis"}, {"tag": "p", "text": "The Separatist Crisis (24–22 BBY), also called the Secessionist Movement, was a period of political turmoil at the end of the Republic Era in which thousands of star systems seceded from the Galactic Republic and pledged loyalty to Count Dooku and the Confederacy of Independent Systems. The period took place in the years following the Invasion of Naboo, and was manipulated by Dooku and his Sith master, the Sith Lord Darth Sidious—publicly known as Supreme Chancellor Palpatine of the Republic. The goal of the Sith was to launch a galactic war that would allow them to amass total control over the Republic, transform it into the Galactic Empire, and destroy the Jedi Order. To help with that goal, the Sith secretly oversaw the creation of an army of clone troopers on the planet Kamino that would become an army for the Republic."}, {"tag": "p", "text": "The political turmoil bred by the Separatist Crisis rocked the Republic, with Chancellor Palpatine publicly claiming that he hoped to find a diplomatic solution and avoid a war with the Separatist Alliance. Many in the Confederacy, including members of the Separatist Senate, also did not wish to fight, as they simply wanted to be free of what they saw as the corruption of the Republic. After the attempted assassination of Padmé Amidala, the senator of Naboo and an influential member of the Republic's Loyalist Committee, the Jedi Knight Obi-Wan Kenobi began an investigation that led him to discover the clone army on Kamino, as well as a gathering of powerful business interests on Geonosis. These business leaders, who would become known as the Separatist Council, committed their resources to Count Dooku's cause. These interests included the Trade Federation, which committed to producing countless battle droids for the Separatists."}, {"tag": "p", "text": "The Crisis culminated in the First Battle of Geonosis, when members of the Jedi Order arrived on Geonosis to rescue the captive Master Kenobi, Senator Amidala, and Padawan Anakin Skywalker from execution. The clone troopers, commissioned as the Grand Army of the Republic through emergency executive power granted to the chancellor by the Galactic Senate, arrived under the command of Jedi Grand Master Yoda and fought the Separatist Droid Army. Although the Republic was victorious in battle, it was merely the first conflict of the three-year Clone Wars. At its end, the goals of the Sith were realized; the Republic defeated the Confederacy, but the Chancellor used the war as a pretense to reform the Republic into the Galactic Empire in the name of security. Though the Empire was ultimately defeated by a New Republic nearly twenty-five years later, the legacy of the Separatist Crisis lived on for decades after, with the First Order rising from the ashes of the Empire in a further attempt to bring the kind of stability to the galaxy that the Galactic Republic was unable to bring during the Separatist Crisis."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "For centuries, the Galactic Republic's lucrative trade with Core World markets helped it inexorably pull nonmember worlds into closer cooperation with the body politic. Senators, however, feared the addition of new member worlds would appropriate their own wealth to protect \"provincial territories,\" far from the civilized and cosmopolitan Core Worlds. As a result, states were often left waiting—some for centuries—to be admitted into the Republic, while those that were admitted found themselves largely ignored in the chaotic senate chamber. Local power blocs soon emerged from neighboring systems in the galaxy's periphery, demanding greater representation and rights for their own respective sectors."}, {"tag": "p", "text": "Over time, senators of the Republic began prioritizing their own interests above the common good, slowly eroding the foundations of democracy that initially built the Republic. Monolithic corporations such as the Trade Federation found themselves granted representation in the Galactic Senate amidst blatantly exploiting loopholes in existing Free Trade Zones. With many outlying worlds lacking protection from Republic Judicial Forces, who were often withheld from aiding the Outer Systems after refusing to provide the Core with profitable deals, the Outer Rim world of Eriadu formed the Outland Regions Security Force to protect the Seswenna sector, and soon saw stunning success when a young cadet, Wilhuff Tarkin ascended into its forces."}, {"tag": "p", "text": "Despite this, little impact was made on galactic society as a whole within the next few years. When the Trade Federation blockaded the serene planet of Naboo over disputes about plasma exports, then Supreme Chancellor Finis Valorum was replaced by Senator Palpatine through a Vote of No Confidence. Unbeknownst to all but a select few, Palpatine was secretly the Dark Lord of the Sith. Portraying himself as a mild-mannered servant of the common good, Palpatine had in fact manipulated the entire crisis from the start to enable himself to be elected Chancellor. In his true persona as Darth Sidious, the new Chancellor manipulated the dashing political idealist and former Jedi Master Count Dooku to pledge himself as his new apprentice following the supposed death of Palpatine's apprentice, Darth Maul, during the Invasion of Naboo. When Dooku took an eight-year leave of absence from the Jedi Order, many galactic citizens supposed he merely wished to form an offshoot of the Jedi, while rumors circulated of him fomenting political turmoil on a host of worlds. Following Dooku's denouncement of the Republic after hijacking a HoloNet relay station in the Raxus system, many believed that a galactic war was imminent. Moving in secrecy—some believed one step ahead of Republic assassins—Dooku became the focus of galactic attention. Backing coups on Ryloth and meddling in the affairs of a variety of worlds including Kashyyyk, Sullust and Onderon, Dooku further alienated distant worlds from the Republic political process and spurned all attempts to negotiate from Supreme Chancellor Palpatine."}, {"tag": "h3", "text": "The Separatist Crisis"}, {"tag": "p", "text": "Dooku's words of inflammatory rhetoric found receptive audiences among young intellectuals in Mid and Inner Rim universities, with the so-called jumpover sectors of the Republic lacking the political pull of the central systems and the ability to effectively profit from their Outer Rim neighbors. Charismatic and exuding confidence, Dooku's message rallied thousands of hearts and souls, relaying his decades of experience within the annals of the Republic and publicizing its hypocrisies, corruption and ineffectiveness. Inspiring action, Dooku's tone expounded a message of rebellion that mesmerized young psyches and spurred them into political activism."}, {"tag": "p", "text": "The mixing of different species could cause issues during the tense period that was the crisis. This was once seen on the Republic capital world of Coruscant in Port Quarter's eastern spaceport through the Weequay-Houk brawl."}, {"tag": "p", "text": "As the Separatist crisis grew more and more heated, Dooku's appearances grew rarer and were announced with much shorter notice, with his message often inciting violence on the most polarized worlds—such as on Ando and Ansion. Rallying together systems into the newly formed Confederacy of Independent Systems, Dooku sought to create a southern Separatist sphere of influence by coercing Yag'Dhul and Sluis Van to his side, along with the prosperous Outer Rim world of Eriadu. With its location at the confluence of the Hydian Way and Rimma Trade Route, Dooku needed Eriadu's allegiance to control the Greater Seswenna and effectively collapse the core back onto itself, undoing millennia of galactic exploration, conquest and colonization. Despite appearing in his regal elegance and attending dinners with Eriadu's then Governor,Wilhuff Tarkin, the attempt to claim Eriadu's loyalty would fail, as Tarkin refused, believing that an ineffective yet unified galaxy was better than a fractured one. Despite this, thousands of dissatisfied star systems soon seceded from the Republic and fully embraced the Confederacy's fiery message of resistance. The agrarian world of Ukio found itself questioning how its value as the breadbasket of the Core Worlds was reciprocated, and after citing a litany of neglect, senatorial representatives of the Abrion sector tendered their articles of secession along with other worlds in the galaxy's hinterlands. The idea that the Republic was distant, dispassionate and unworthy of membership ultimately marshaled disgruntled systems into a new galactic government."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "While the Separatist movement gained power under the secret guidance of the Sith, the Galactic Senate debated the Military Creation Act to determine the merits of raising an army. It eventually decided in favor of the notion, especially after Palpatine was granted emergency powers at the suggestion of the Gungan Junior Representative Jar Jar Binks. His first act was to adopt a secret clone trooper army from the ocean world Kamino as the newly formed Grand Army of the Republic. Unknown to the galaxy at large, the army was in fact created by Jedi Master Sifo-Dyas, who foresaw hostilities between the Core and Outer Systems well in advance of the conflict. After being assassinated by Dooku, the knowledge of the clone army was shrouded in mystery for years until Jedi Master Obi-Wan Kenobi discovered its presence after a failed assassination attempt against Senator Padmé Amidala, who opposed the military buildup."}, {"tag": "p", "text": "Investigating the barren world of Geonosis, Kenobi discovered a secret meeting of Confederate leaders under the guidance of Count Dooku. Having lured members of a variety of commerce and corporate guilds into his new Confederacy, including the Techno Union, Corporate Alliance, Retail Caucus, and Trade Federation, among others, Dooku planned on using a vast army of newly formed battle droids of the Separatist Droid Army to force the Republic to negotiate a settlement. Coming to the aid of Kenobi after his capture, the newly formed Grand Army of the Republic engaged the Confederate forces on the planet—not, however, before Dooku and other members of the Separatist leadership escaped. With full-blown war now embroiling the galaxy, the deadly Clone Wars would devastate thousands of systems over the next three standard years."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Upon the rise of the autocratic Galactic Empire, supplanting the democratic Galactic Republic that preceded it, the newly formed Imperial Security Bureau conducted vast loyalty purges, along with punishing worlds involved in the Separatist rebellion, with one of the most criticized dubbed the Antar Atrocity. Pamphlets, books, and Separatist propaganda were subsequently burned and declared illegal, while former Separatist warships were dismantled, and droids found on the black market, often ending up in the hands of nationalist rebels or criminal organizations."}, {"tag": "p", "text": "While initial Separatist holdouts would occupy Imperial efforts in its early years, the Secessionist Movement would eventually be taught as an example of the corruption and ineffectiveness of the Republic, a corruption that the new Empire claimed to have solved. Scarred by memories of the war, many systems would cheer at the sight of new Imperial-class Star Destroyers and symbols of Imperial might. Additionally, in an effort to increase the loyalties of worlds embroiled in the Separatist Crisis, the Imperial Academy reserved slots to those from former Separatist worlds of the Inner Rim in an effort to increase their loyalty."}, {"tag": "p", "text": "With the fall of the Galactic Empire approximately three decades after the Secessionist Movement began, the New Republic rose to power. However, many star systems refused to join the New Republic fearing a repeat of the Empire, resulting in the New Republic being smaller than both the Republic that preceded it and the Galactic Empire. Despite this, many systems remained on friendly terms with the new establishment, and the decision to host the New Republic's capital on a rotating basis based on voting among member worlds helped to alleviate the fears many former systems embroiled in the Secessionist Movement, encouraging them to rejoin the Republic long after the chaos and violence of the Secessionist Movement, Clone Wars, and the Galactic Civil War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}