{"url": "Separatist_Parliament", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Confederacy of Independent Systems organizations", "Category:Legislatures", "Category:Separatist leadership"], "nodes": [{"tag": "h1", "text": "Separatist Parliament"}, {"tag": "p", "text": "The Separatist Parliament, also known as the Separatist Senate or the Separatist Congress, was the civilian legislature that governed the Confederacy of Independent Systems, representing thousands of its member worlds during the Clone Wars. When the charismatic Count Dooku founded the Confederacy in 24 BBY, the swaths of sectors and star systems seceding from the Galactic Republic formed their own congressional assembly to oversee the Separatist state. A number of the appointed delegates, having served as members of the Republic Senate prior to their secession, continued to represent their constituents in the Confederacy. Operating by a bill of rights known as the Bylaws of Independent Systems, the Parliament was headed by the Confederate Head of State, Dooku, as well as by Separatist Congress Leader Bec Lawise. It became headquartered on the Separatist capital of Raxus Secundus, where sessions were held in the Separatist Senate Building."}, {"tag": "p", "text": "Although the representative voices of the Parliament gained a role in state matters, various elements of the Separatist hierarchy often rendered them ineffective. The corporate interests on the Separatist Council also made governmental decisions, and Dooku himself—who was secretly the Dark Lord of the Sith Darth Tyranus—manipulated situations to ensure that pan-galactic war continued for the purposes of the Sith. At times maneuvers on the part of other war-profiteering parties negated legislation that the Parliament had enacted; some came to see the assembly's members as Dooku's pawns. Furthermore, the senators of the Parliament as well as the citizens of the Confederacy were repeatedly shielded from front-line reports of brutal campaigns waged by such commanders of the Separatist Droid Army as General Grievous. Ultimately, the Confederacy was regarded more as a movement instead of a centralized government, in spite of the Parliament's involvement in public affairs."}, {"tag": "p", "text": "A wide range of views comprised the Parliament, leading to a division of positions about maintaining the war effort against the Republic. In 21 BBY, after the Clone Wars had been raging for over a year, Senator Mina Bonteri of Onderon, in collaboration with Republic Senator Padmé Amidala, introduced a bill to open peace negotiations with the Republic. Her bill passed in session by a majority, and the Parliament's motion for peace was extended to the Republic Senate. Yet Dooku conspired with a group of war profiteers to ensure that the Republic rejected the offer, culminating with his orchestration of Bonteri's murder and the withdrawal of the proposal. A delegation later represented the Parliament at an unprecedented peace conference with Republic congresspeople on Mandalore, but the talks similarly failed. The Confederacy was dissolved in 19 BBY with the death of Dooku and the execution of the Separatist Council, ending the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Organization"}, {"tag": "p", "text": "The Separatist Parliament, alternatively becoming known as the Separatist Senate or the Separatist Congress, was a ruling body established to oversee affairs of the Confederacy of Independent Systems. Comprising delegates speaking for thousands of the Confederacy's member worlds, the Parliament was presided over by a Separatist Congress Leader, who was tasked with being the body's speaker. The Confederate Head of State, serving as the leader of the Senate, was also allowed to officiate at sessions. In addition to member worlds, corporations such as the Corporate Alliance were granted representation, becoming a part of the legislature's decision-making. While in session, individual congresspeople could propose legislation, which required a majority vote to be enacted into law. A bill of rights, the Bylaws of Independent Systems, dictated operational procedures for the Parliament; for example, a voice vote was to be taken for matters such as opening peace negotiations with the Galactic Republic."}, {"tag": "p", "text": "The Parliament was viewed primarily as a civilian political branch of the Confederacy's government, more so than another Confederate ruling body, the Separatist Council. Comprising solely corporate leaders who funded the Separatist war machine, the Council also made governmental decisions for the Confederacy, in addition to managing the war effort and overseeing the distribution of assets to member worlds."}, {"tag": "h3", "text": "The Separatist hierarchy"}, {"tag": "p", "text": "Controversy surrounded the efficacy of the Separatist Parliament during the time of the Clone Wars, when the Confederacy was engulfed in full-scale war with the Galactic Republic. As a separatist government, the Confederacy consisted of sectors and star systems seceding from the Republic as well as megacorporations and trade cartels such as the Corporate Alliance, Trade Federation, InterGalactic Banking Clan, and Commerce Guild, among others. These conglomerates were represented on the Separatist Council, which existed alongside the civilian-based Parliament. With the wide reach of philosophies, some political and others corporate-driven, the Separatists fell into more of a hierarchy than a formal, centralized government. Such was the framework of the Confederacy that at times the Parliament's decrees were ignored, manipulated, or made ineffectual. Count Dooku himself, Head of State of the Confederacy, had a hand in invalidating Parliament legislation as part of schemes that the Order of the Sith Lords concocted. Senator Lux Bonteri believed that Dooku would betray the members of the Parliament if his machinations warranted such expedience."}, {"tag": "p", "text": "Separatist delegates who were affiliated with companies like the Corporate Alliance garnered criticism for perpetuating corporate voices in political affairs, as was the case in the Republic Senate. Yet those same galactic enterprises were the cornerstone of the Confederacy, as their security forces constituted the Confederacy military, particularly the Separatist Droid Army. Furthermore, Parliament members as well as Separatist citizens were constantly kept in the dark about the exploits and onslaughts of ruthless military commanders such as General Grievous. This conduct resulted in an incomplete view of the Separatists' presence in the galactic war theater, creating further problems for the Parliament. Some individuals on the side of the Republic saw the Separatist senators as pawns of Dooku, while the Parliament itself was widely considered abortive due to the formation of the Separatist hierarchy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "The Confederacy of Independent Systems was founded in the year 24 BBY, when the charismatic Count Dooku, a former Jedi Master, delivered fiery rhetoric that criticized the Republic Senate of corruption, with the Jedi Order guilty for supporting such a regime that was beyond saving. The Raxus Address, as his speech was dubbed, established the Confederacy as a separatist state from the Republic. Thousands of sectors and star systems began issuing Articles of Secession to the Republic, flocking to the Confederacy alongside megacorporations including the Trade Federation, InterGalactic Banking Clan, Corporate Alliance, Techno Union, and others seeking Dooku's promise of free trade. In reality, the Confederacy was created to secretly serve the Grand Plan of the Order of the Sith Lords, of which Dooku was a member under the alter ego of Darth Tyranus. While Tyranus led the Confederacy into war with the Republic, the Dark Lord of the Sith Darth Sidious—in his guise as Supreme Chancellor Palpatine of the Republic—would destabilize the Republic so that the Sith could eventually claim absolute power over the galaxy. The Confederacy was thus a sham, the result of Sith plotting against the Republic."}, {"tag": "p", "text": "Over six thousand worlds joined the Confederacy during the period of tensions termed the Separatist Crisis, which lasted from 24 BBY to 22 BBY. The InterGalactic Banking Clan, Trade Federation, and their fellow Separatist-loyal companies officially signed on to the cause in 22 BBY, pledging their financial support as well as their standing security forces to the Confederate military. When the First Battle of Geonosis erupted that year, the corporations' various battle droid security forces, eventually organized as the Separatist Droid Army, were deployed against the newly-created Grand Army of the Republic. Pan-galactic conflict broke out following the Battle of Geonosis in what would become known as the Clone Wars."}, {"tag": "p", "text": "While the Separatist Council was formed from the corporate leaders overseeing the war effort, another ruling body was established from the civilian populace. The Separatist Parliament, as it came to be known, comprised representatives from thousands of Separatist member worlds, comparative to the makeup of the Republic Senate. Indeed, a number of the senators who were appointed to the Parliament were former members of the Republic Senate, such as Mina Bonteri, who continued to represent her homeworld of Onderon in the Confederacy. Senator Bec Lawise became the Separatist Congress Leader, presiding over Parliament sessions alongside Confederate Head of State Dooku. The assembly was headquartered on the Separatist capital world of Raxus Secundus, which was blockaded by a sizable fleet from the Confederate Navy. The Separatist Senate Building was installed at the center of a large city on Raxus Secundus with an upper viewing gallery for observers."}, {"tag": "p", "text": "The Parliament faced many challenges during the Clone Wars, including justifying the very existence of the Confederacy. In spite of a number of attempts to negotiate with the Separatists, the Republic Senate refused to acknowledge the legitimacy of the Separatist state, going so far as to pass a law prohibiting Republic senators from engaging in communication with Separatist officials. The Confederacy's appointed Supreme Commander of the Droid Armies, General Grievous, committed many exploits on the front lines, but the politicians and citizens of the Confederacy were kept unaware of his crimes as well as other atrocities being performed in their name against the Republic. Dooku and Darth Sidious were at the center of perpetuating conflict between the Republic and the Confederacy so as to further the Sith Grand Plan to rule the galaxy."}, {"tag": "h3", "text": "A failed peace"}, {"tag": "p", "text": "As the Separatist Droid Army gained ground on battlefronts across the galaxy, some Parliament senators campaigned to escalate the war effort against the Republic. Yet the majority of delegates had difficulty deciding if they should cast their support to further expansion of their armed forces. Similar conditions in the Republic Senate came to a head in 21 BBY, the second year of the war, and led Republic Senator Padmé Amidala of Naboo to journey to Raxus Secundus in violation of the Republic's non-contact statute. A vocal advocate for diplomacy amidst the increasing cacophony of the Republic Senate, Amidala was concerned about a rising bill in her own Senate that would deregulate the galactic banks, opening new lines of credit to expand the Republic Military and thus increase the fighting. She traveled to Raxus Secundus with Jedi Padawan Ahsoka Tano to seek out a meeting with Mina Bonteri of Onderon, who had mentored her in politics during her early career, in the hopes of ending the war via diplomatic negotiations. In talks with her former colleague, Amidala convinced Bonteri that if the Separatist Parliament extended an olive branch of peace, there might be enough of a sympathetic response in the Republic Senate to begin formal intergovernmental dialogue. Bonteri agreed and promised to tender a motion for peace to the Parliament."}, {"tag": "p", "text": "Bonteri drafted her bill, which would immediately sanction an offer for peace negotiations to Supreme Chancellor Palpatine and the Republic, and introduced it at a following Parliament session. She prefaced her proposal, to cries of support and rejection from all sides of the Separatist Senate Building, by decrying the futility of the war's casualties and calling for a peaceful coexistence between Confederate and Republic worlds. Once she had finished, numerous senators stood up to applaud her words, though other delegates did not agree. Among the dissenters was Senator Voe Atell, an affiliate of the Corporate Alliance, who asserted that the commerce guild would never allow the passage of such a proposal. Senator Kerch Kushi disputed her claims, citing the democratic system of the Parliament as well as its lack of corporate governance. Amidst the widespread debate that broke out after Kushi's statements, Count Dooku called for order so that Bonteri's bill could be brought to a vote. As per the Bylaws of Independent Systems, Dooku held a voice vote, with Senators Bonteri, Kushi, By Bluss, and Amita Fonti among the supporters. Voting nay were Atell, Punn Rimbaud, and a number of others, but they were ultimately outvoted."}, {"tag": "p", "text": "Following the enactment of Bonteri's bill, Amidala returned with Tano to the Republic capital of Coruscant. Palpatine was skeptical of the Separatists' offer for peace given their past refusals for negotiation, but Amidala confidentially assured him of its sincerity because of its origination with Bonteri, allowing the vote to be brought to the Senate floor. No party was less alarmed by the Parliament's offer than the coalition pushing for Republic banking deregulation, consisting of Trade Federation Senator Lott Dod, InterGalactic Banking Clan lobbyist Nix Card, and Senator Gume Saam, the latter of whom was receiving payoffs from the Techno Union. All three profited from the war through their corporate affiliations and had already arranged—through their secret ties to Dooku—for an attack on Coruscant to panic the Senate into passing the deregulation legislation. On Dooku's orders, without Parliament authorization, Grievous had a team of Infiltrator/Demolition droids sabotage the Coruscant power network. The assault coincided with the Republic Senate's vote on the bank reform bill, which had its intended effect. Reported as an act of Separatist terrorism, the bombing of the power generator portrayed the Parliament's offer for peace as insincere and, much to Amidala's dismay, prompted the Senate to overwhelmingly vote in favor of banking deregulation. The Senate later rejected the Parliament's motion in light of the attack on Coruscant."}, {"tag": "p", "text": "With negotiations with the Republic thwarted, Dooku swiftly engineered a secret attack on Confederate territory in which Sith assassins murdered Bonteri, then publicly alleged that she had been killed in a Republic assault that had targeted the people of the Confederacy. Rife with fear of attack, the Parliament withdrew Bonteri's peace proposal, with Dooku relaying that decision in a direct transmission to the Republic Senate. Although Republic spies uncovered evidence of Bonteri's assassination, many Parliament members did not believe that their Head of State had executed their highly esteemed colleague or that he was even capable of such wrongdoing. In any case, Dooku's actions ensured the collapse of Confederate–Republic diplomatic negotiations."}, {"tag": "p", "text": "In the aftermath of the Republic Senate's deregulation of the banks, the Separatists took out a loan from the InterGalactic Banking Clan to finance the manufacture of three million additional battle droids for the Separatist Droid Army, even with an interest rate hike from ten to twenty-five percent. The Republic Senate soon responded by approving an order for five million new clone troopers for its Grand Army, guaranteeing that the Clone Wars would continue across the galaxy. Mina Bonteri's Parliament seat for Onderon was filled by her son, Lux Bonteri."}, {"tag": "h3", "text": "Conference on Mandalore"}, {"tag": "p", "text": "The Parliament later agreed to send a delegation of senators to meet with Republic representatives in the first-ever peace conference between the two states. The neutral world of Mandalore was chosen as a meeting ground, with Duchess Satine Kryze of the New Mandalorians hosting the gathering. Senators Voe Atell and Amita Fonti and Separatist Congress Leader Bec Lawise consented to represent the Parliament, meeting in the royal palace of the capital city of Sundari with Republic Senators Padmé Amidala, Bail Prestor Organa of Alderaan, and Mon Mothma of Chandrila, all of whom hoped for a peaceful end to the fighting. In accordance with Mandalorian law, both delegations were to remain unarmed, though the Parliament senators' BX-series droid commandos were equipped with blasters as security droids. As soon as Amidala, the leader of the Republic representatives, opened the conference, the Separatist delegation's first order of business was to address an age-old issue for the Confederacy: the legitimacy of the Separatist state. Speaking for her fellow delegates, Atell demanded that the Republic confer political recognition on the Confederacy, an act that Amidala and her colleagues hesitated to perform."}, {"tag": "p", "text": "The proceedings were thereafter interrupted by Lux Bonteri, who had recently resigned from the Parliament and renounced his Separatist affiliations. The Parliament senators were nettled by Bonteri's uninvited presence, particularly when he took to the podium and publicly accused Dooku of complicity in his mother's homicide. Lawise ordered his security droids to arrest Bonteri and remove him from the royal palace. Although Kryze objected to the droids' handing of Bonteri, Atell cited the matter as an internal affair, blocking outside interference. Lawise apologized on the Separatists' behalf for the interruption and allowed the discussions to continue, though they ultimately failed to bear fruit. The deliberations broke down due to shadowy interests on both sides, with the Senate and Parliament delegations unable to negotiate an end the war. Further adding to the tensions was the discovery that Bonteri had escaped from custody aboard the Separatists' C-9979 landing craft at the Sundari docks with the aid of an old friend, Ahsoka Tano, who was serving as Amidala's bodyguard. Having pursued Tano and Bonteri to the Republic transports, the Parliament's squad of security droids engaged in a firefight with the Republic's Senate Guards, though they were unable to prevent Bonteri from escaping off-world with Tano."}, {"tag": "p", "text": "In 19.1 BBY, the final month of the war, the Confederate government recognized a new head of the InterGalactic Banking Clan: Rush Clovis. A Separatist delegation, headed by Bec Lawise, was allowed to attend the transfer of power at the Banking Clan's headquarters on the planet Scipio. The proceedings saw direct interference from Dooku, who—having aided Clovis's rise to power—engineered a plot to usurp control of the banks. On behalf of the Confederacy, Dooku refused to pay the interest on their loans from the Banking Clan, manipulating Clovis into instead raising the Republic's interest rates. Dooku then brought a Confederate Navy flotilla to Scipio, decimating the Republic's on-world security garrison in order to implicate Clovis in a partisan alliance with the Separatists. After Dooku arrested Padmé Amidala, the leader of the Republic delegation, Lawise voiced opposition to his scheme, as he believed that the Parliament would not approve so brazen a move. Dooku responded by using the Force to telekinetically maneuver Amidala into gunning down Lawise. He then withdrew his naval armada from Scipio, leaving the Banking Clan in shambles and eventually leading to the Republic Senate transferring full control of the banks to Supreme Chancellor Palpatine."}, {"tag": "h3", "text": "War's end and legacy"}, {"tag": "p", "text": "After three years of conflict, the Confederacy was defeated in 19 BBY with the death of Count Dooku at the Battle of Coruscant and the following execution of the Separatist Council on Mustafar. The Sith Grand Plan finally came to fruition: Palpatine reestablished the Republic as the first Galactic Empire, with himself as Galactic Emperor for life. Without its corporate leadership, the Confederacy surrendered, and a mass signal was transmitted from Mustafar to deactivate the Separatist Droid Army. Nevertheless, holdout factions of unrepentant Separatists took several years for the new Empire to conquer and subjugate."}, {"tag": "p", "text": "The Parliament was remembered for its ultimate ineffectiveness in the Separatist hierarchy. When Senator Mon Mothma of the Imperial Senate became the Chief of State of the Alliance to Restore the Republic after its founding in 2 BBY, she looked to the representative Parliament while organizing the Rebel Alliance. Given the uselessness of the Parliament, Mothma believed that treating the Rebellion as a Republic-in-exile would inevitably remind the galaxy of the Confederacy. Being a separate government, a Republic-in-exile would also give credence to the Empire as a legitimate state instead of a corruption of the Republic, as was intended. In the resulting Galactic Civil War, the Rebel Alliance succeeded in overthrowing the Empire, eventually installing the New Republic as the dominant galactic government."}, {"tag": "h2", "text": "Notable members"}, {"tag": "h3", "text": "Count Dooku"}, {"tag": "p", "text": "The Head of State of the Confederacy, Dooku served as the leader of both the Separatist Parliament and the Separatist Council during the Clone Wars. Initially a Jedi Master, Dooku resigned from the Jedi Order in 32 BBY, disputing its place in a corrupt Republic. While reclaiming his title of Count of Serenno, he secretly became the apprentice to the Dark Lord of the Sith Darth Sidious, taking up the mantle of the Sith Lord Darth Tyranus. His duties in the Parliament included officiating over sessions and overseeing votes, usually doing so via hologram, as he was frequently prosecuting the war from a distance."}, {"tag": "p", "text": "Although he maintained the public persona of a charismatic and reasonable politician to many in the Parliament, Dooku did not hesitate to override the assembly's decisions without its knowledge, including the proposal for peace that Mina Bonteri introduced. He sought to keep the war going so that it could fulfill the Sith Grand Plan, to ultimately bleed the Republic dry to the point that the Sith could claim it. He thus manipulated the Confederacy and its Parliament on multiple occasions, even engineering the demise of members of the Parliament—such as Mina Bonteri and Bec Lawise—as he saw fit, while also enlisting ruthless enforcers such as General Grievous and the Dark Acolytes to carry out his agenda of deception and manipulation."}, {"tag": "h3", "text": "Mina Bonteri"}, {"tag": "p", "text": "A prominent senator of the Separatist Parliament, Mina Bonteri represented her homeworld of Onderon. Initially a member of the Republic Senate, Bonteri came to disagree with the Republic's direction and withdrew alongside her homeworld, which Onderonian King Sanjay Rash allied to the Confederacy at the outset of the war. In leaving the Senate, she forsook a number of connections and close friendships. Yet unlike other more aggressive Separatists, Bonteri had no inclination to pursue conquest or warfare, instead believing in ending the war through diplomacy. She admired Count Dooku as a political leader, though she, like many other Separatist citizens, remained unaware of the atrocities being committed in their name on the battlefield."}, {"tag": "p", "text": "A respected example of Separatist idealism, she championed coexistence between Republic and Confederate worlds as a solution to the fighting. When an old friend, Padmé Amidala, came to Raxus Secundus to pursue a peaceful resolution to the war, Bonteri collaborated with her former colleague to open negotiations with the Republic, proposing a bill to the Parliament calling for an immediate end to the conflict. While the majority of her associates voted with her, Dooku had her murdered to derail the peace effort and further his own wartime agenda. Her position in the Parliament was filled by her son, Lux Bonteri, who uncovered Dooku's complicity in her death and sought to avenge her."}, {"tag": "h3", "text": "Bec Lawise"}, {"tag": "p", "text": "Senator Bec Lawise served as the Separatist Congress Leader, presiding over Parliament sessions alongside the Head of State. As speaker of the Parliament, he was a firm supporter of Count Dooku, refusing without a second thought to believe allegations of Dooku's crimes. Lawise was one of several congresspeople who petitioned the Republic to acknowledge the Confederacy as a legitimate government, a move that the Republic delegation hesitated to make at the peace conference on Mandalore. He was irked by Lux Bonteri's uninvited appearance at the negotiations and was quick to label him as a Separatist traitor for his charges levied against Dooku. He immediately responded to Bonteri's words with force, not hesitating to have the young man taken into custody despite the clear prospect of Dooku having him executed for his accusations. Nevertheless, Lawise ultimately proved expendable to Dooku, who engineered Lawise's death when the senator raised objections to his arrest of Padmé Amidala on Scipio, as part of a plot to wrest control of the banks from the InterGalactic Banking Clan."}, {"tag": "h3", "text": "Voe Atell"}, {"tag": "p", "text": "A senator affiliated with the Corporate Alliance, Voe Atell spoke for the commerce guild at times in the Separatist Parliament. During the debate over Mina Bonteri's bill to initiate diplomatic negotiations with the Republic, Atell took a stand against her pro-peace colleague, going so far as to swear that the Corporate Alliance would never permit a Parliament decision to end the war. Some of her fellow delegates took umbrage at her remarks, with Kerch Kushi likening her Corporate Alliance ties to the seats that such megacorporations held in the Republic Senate. Atell voted against the bill for peace, though she ended up being in the outvoted minority. Although opposed to negotiations with the Republic on that occasion, she accepted afterward a place on the three-member Parliament delegation at the Mandalore peace conference, where she pushed for recognition of the Confederacy's legitimacy. Padmé Amidala was reluctant to meet her demands, and the discussions later collapsed."}, {"tag": "h3", "text": "Lux Bonteri"}, {"tag": "p", "text": "The son of Mina Bonteri, Lux Bonteri continued his mother's representation of Onderon in the Separatist Parliament following her death. Having grown up as a Separatist, Bonteri was idealistic from a young age, sharing some of his mother's views about the futility of war. He was eventually orphaned by the Clone Wars: his father, a military officer, was killed in the line of duty, while his mother died for her ideals, as Count Dooku arranged. Although Bonteri saw himself as a patriot and loyal Separatist, he renounced his Confederate ties and resigned his Parliament seat after discovering Dooku's actions. He cautioned other senators about Dooku, believing that he would one day betray them just like he had with Mina. Bonteri resolved to bring Dooku to justice, withdrawing to support the Mandalorian Death Watch, a splinter group of terrorists, in its hunt for Dooku. As part of his plan, he interrupted the peace conference on Mandalore to publicly accuse Dooku of murder, so that he would be brought to the count and be able to pinpoint his exact location for the Death Watch."}, {"tag": "p", "text": "Bonteri later joined a resistance movement on Onderon and helped to liberate his homeworld from Separatist control, following which he was reappointed as the senator of Onderon given his brief tenure in the Parliament. He decided that Onderon's best course of action would be realignment with the Republic, intending to follow in his mother's footsteps by joining the Republic Senate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Separatist Parliament was created for the Star Wars: The Clone Wars television series as the civilian government of the Confederacy of Independent Systems. First alluded to at Celebration V in August 2010 by Series Supervising Director Dave Filoni, it was mentioned in the third season episode \"Supply Lines\" in September 2010, with the episode's accompanying guide on StarWars.com identifying it as a civilian-based section of the Confederate government. The Parliament was introduced in \"Heroes on Both Sides,\" which was released on November 19, 2010. In addition to the prominently featured Mina Bonteri, several other senators were identified in the episode's online guide. The Parliament also played a role in the fourth season episode \"A Friend in Need,\" in which a delegation from the Parliament was portrayed taking part in an unprecedented peace conference with the Republic. The episode aired on January 13, 2012."}, {"tag": "p", "text": "The Parliament represented a retcon to Star Wars canon regarding the government of the Confederacy, which had—up until the Parliament's introduction—only consisted of the corporate-based Separatist Council. The Parliament's exact relationship with the Council has yet to be clarified, though the television series had previously referred to the existence of the Council in the first season. According to Filoni, Series Producer George Lucas saw that the Expanded Universe mistakenly portrayed the Separatist Council as the government of the Confederacy, as well as the Trade Federation's allegedly clear Separatist ties. Lucas dictated that megacorporations like the Trade Federation, Commerce Guild, and others on the Separatist Council were more of a neutral party during the events of The Clone Wars series, with the Parliament being the Confederacy's true civilian government. The ineffectiveness of the Parliament, which was implied through Count Dooku's machinations in \"Heroes on Both Sides,\" was acknowledged in the April 2012 The Essential Guide to Warfare, which also tied it into the formation of the Rebel Alliance. One of the book's co-authors, Jason Fry, commented that he made a point to compare the Rebels to the earlier Separatists, incorporating the Parliament when the opportunity presented itself."}, {"tag": "p", "text": "According to Series Writer Brent Friedman, the Parliament would have been featured in a future story arc of the television series, though those episodes were never produced after the series was removed from being broadcast in March 2013."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}