{"url": "Sera", "categories": ["Category:Canon articles", "Category:Artists", "Category:Collectors", "Category:Females", "Category:Humans", "Category:Scavengers"], "nodes": [{"tag": "h1", "text": "Sera"}, {"tag": "p", "text": "Sera was a female human scavenger who Obi-Wan Kenobi met on the planet Carnelion IV. Sera summoned the Jedi to the planet after watching an ancient holographic recording. She believed that the Jedi could forcefully end the war that was happening the planet between the Open and the Closed, not realizing that the warrior she observed in the recording was actually a Sith."}, {"tag": "p", "text": "After Kenobi and Grecker were shot down by Pran, they made their way to Sera's fortress museum. The two men were attacked by Carnelian dragons and Sera opened her building to let the men escape the creatures. Grecker attempted to force Sera to close the door and leave Kenobi to die, but she shot him with a blaster. Kenobi entered the building and Sera explained that it was a place where she kept items she had scavenged from the outside in hopes that one day she might be able to pass them on to the young people of Carnelion."}, {"tag": "p", "text": "Sera explained that she watched a recording and learned how to send a Jedi distress signal. Her fortress was attacked by the Closed, and she and Kenobi went to the roof of the building to assess the situation. She demanded that Kenobi kill all the Closed, but he explained to her that the Jedi tried to spare everyone and did not kill indiscriminately. The Open arrived soon after the Closed and a large battle broke out. Anakin showed up with the Open young ones, and Kolara met Sera on the roof. The Scavenger explained her plan of sending up kites with pieces of art attached in the hopes of showing the young that there was more to life than fighting. Kolara and the rest of the young ones went to join the battle, and Sera called them fools for not abandoning the fight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}