{"url": "Sephjet_Josall", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Humans", "Category:Jedi Knights of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sephjet Josall"}, {"tag": "p", "text": "Sephjet Josall was a human male Jedi Knight who served the Jedi Order during the final years of the Galactic Republic. In 22 BBY he fought the Separatist Droid Army as a member of Jedi Master Mace Windu's assault team prior to the outbreak of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Discovered to be Force-sensitive during infancy, Sephjet Josall was taken to the Coruscant Jedi Temple for training in the ways of the Force. Josall was selected to be a Padawan by a Jedi Master. After years of study and having constructed a blue-bladed lightsaber for himself, Josall went on to pass his Trials of Knighthood and was given the rank of Jedi Knight."}, {"tag": "p", "text": "In 22 BBY, Josall was stationed at the Temple when Master Mace Windu rallied all available Jedi to join an assault team in order to rescue the Jedi Obi-Wan Kenobi and Anakin Skywalker, as well as the Naboo senator Padmé Amidala from the Confederacy of Independent Systems. Arriving on the desert plains of the planet Geonosis, Josall stormed the Petranaki Arena with his comrades in order to free the prisoners. Armed with an extra lightsaber, Josall passed it to Kenobi while Nicanas Tassu did the same for Skywalker."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Wearing Jedi robes, Josall wielded a blue-bladed lightsaber in the Battle of Geonosis, which became his second sword.[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sephjet Josall first appeared in Star Wars: Episode II Attack of the Clones and is portrayed by Joseph Jett Sally, a film editor of the prequel trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}