{"url": "Separatist_stronghold", "categories": ["Category:Legends articles", "Category:Avilatan locations"], "nodes": [{"tag": "h1", "text": "Separatist stronghold"}, {"tag": "p", "text": "The Separatist stronghold was a fortress used by the Mantellian Separatist Movement in the heart of Mount Avilatan, a volcano on Ord Mantell."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The still-active volcano of Mount Avilatan held a large base, originally thought to be built by a gangster known as 'The Corellian.' Several years into the ongoing civil war, the gangster disappeared from his volcano stronghold."}, {"tag": "p", "text": "The original stronghold was thought to be on the island fort of Mannett Point, but Republic operatives discovered it inside Mount Avilatan."}, {"tag": "h2", "text": "Layout"}, {"tag": "h3", "text": "Exterior"}, {"tag": "p", "text": "The Separatist stronghold appeared as a volcano from the outside. It was entirely within the volcano. Mount Avilatan has a predator-eye view of Fort Garnik, Mannett Point, and the entire Avilatan island."}, {"tag": "h3", "text": "Interior"}, {"tag": "p", "text": "The volcano fortress was made up of three levels. The entry level, or level one, was composed of a long hallway with multiple antechambers. The hallway terminated into the heart of the volcano. While above the lava, level one was the closest to the lava floor, and much of its ground was composed of rock from the volcano. Level one was also the primary cargo level. Lava eruptions could easily surpass the ground floor of level one."}, {"tag": "p", "text": "Level two could be reached by an elevator on level one. The second level was composed of a large catwalk surrounding most of the edge of the volcano core. Several antechambers extended into the volcano walls. Most of the command room could be found on level two. Separatist commanders were often found here."}, {"tag": "p", "text": "Level three was the largest of the levels. It included storage space for freight, command centers, and a large hanger capable of accepting several freighters. Separatist leaders were also found here."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}