{"url": "Separatist_probe_droid", "categories": ["Category:Canon articles", "Category:Arakyd Industries products", "Category:Imperial droids", "Category:Probe droid models", "Category:Separatist battle droid models"], "nodes": [{"tag": "h1", "text": "Separatist probe droid"}, {"tag": "p", "text": "The Separatist probe droid was a model of probe droid manufactured by Arakyd Industries. It was used by the Confederacy of Independent Systems during the Clone Wars. It came in varying sizes, with the large Viper recon droid, also known as the Ringneck recon droid, being one of the most feared variants."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Separatist probe droid was manufactured by Arakyd Industries. It came in a variety of sizes."}, {"tag": "p", "text": "One of the most feared variants was the Viper recon droid, also known as the Ringneck recon droid, which was over 1.65 meters in height. It sported a large, bulbous central photoreceptor alongside several smaller ones that dotted the probe droid's main body. The droid was used by the Confederacy of Independent Systems during the Clone Wars against the Galactic Republic. The Republic's successor state, the Galactic Empire, in turn deployed the droid against the Spectres group of rebels on Lothal."}, {"tag": "p", "text": "Another variant was a small probe droid model with a main, contractable photoreceptor installed on its body. The model was also used by the Confederacy during the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "On the planet Maridun, its newly-arrived Separatist command center deployed small Separatist probe droids during Lok Durd's expedition to the world for the experimentation of his defoliator superweapon."}, {"tag": "p", "text": "At the Citadel on Lola Sayu, the smaller variant was deployed by the Separatists alongside larger Ringneck recon droids."}, {"tag": "p", "text": "In the Imperial Era, the droid was used by the Galactic Empire on its occupied world of Lothal. There, the probe droid patrolled Imperial installations alongside the smaller sentry droids and TIE fighters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Separatist probe droid first appeared in the Star Wars: The Clone Wars episode \"Counterattack.\" It again featured in the early-2015 mobile game Star Wars Rebels: Recon Missions, where it is identified simply as a \"Probe Droid.\" The 2015 reference book Star Wars Rebels: Visual Guide: Epic Battles identifies the larger droid variant as the Viper recon droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}