{"url": "Separatist_outpost_(Felucia)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Confederacy of Independent Systems military bases", "Category:Felucia locations", "Category:Galactic Republic military bases"], "nodes": [{"tag": "h1", "text": "Separatist outpost  (Felucia)"}, {"tag": "p", "text": "A Separatist outpost was a CIS mobile command center on the planet Felucia. It was used by the Confederacy of Independent Systems during the Clone Wars against the Galactic Republic. The outpost was manned by a force of DSD1 dwarf spider droids, B1-series battle droids, and BX-series commando droids, all under the command of the T-series military strategic analysis and tactics droid TZ-33, who commanded the outpost from his Separatist command center. During the Second Battle of Felucia, the outpost was captured by Republic forces led by the Jedi Knight Anakin Skywalker."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Confederacy of Independent Systems controlled an outpost on the planet of Felucia during the Clone Wars against the Galactic Republic. During the long, drawn out Second Battle of Felucia, in which the Republic and the Separatists viad continuously for control of the planet, the outpost was manned with a force of DSD1 dwarf spider droids, B1-series battle droids, and BX-series commando droids under the command of the T-series military strategic analysis and tactics droid TZ-33. When Separatist General Grievous learned that the Jedi Knight Anakin Skywalker and his Padawan Ahsoka Tano were leading several clone tank divisions on Felucia, he sent a C-9979 landing craft full of more type B1 battle droids to reinforce the outpost."}, {"tag": "p", "text": "As the reinforcements arrived, the Republic forces commanded by Skywalker observed the outpost, planning an attack. Splitting into three attack groups, the clones and Jedi took up positions around the outpost, with Skywalker and his troops at the front gate, Tano and her men, led by Clone Coporal \"Comet,\" at the rear wall, and the Jedi Master Plo Koon leading clones on the left flank. Before the Republic could attack, the Separatists spotted several All Terrain Tactical Enforcers that were supporting the Republic troops from a nearby ridge. On Koon's orders the AT-TEs opened fire, prompting TZ-33 to order his troops to leave the base and counterattack. As soon as the droids left the outpost's gates, Skywalker and his men charged the Separatists and fought their way into the bases interior. Once Skywalker's forces had begun the assault, Koon and his men jumped over the outpost's walls with the Force and jetpacks respectively, while Tano's troops shot down the sentries on the rear wall above them, then scaled it using grappling hooks and joined the assault. Tano herself never made it into the base, as before scaling the wall she was stunned by the Trandoshan hunter Lo-Taren and captured."}, {"tag": "p", "text": "Once inside the base, the Republic forces made quick work of the Separatist droids, with Skywalker slicing TZ-33 in two himself. Once the outpost was declared secure, Skywalker ordered a search for the missing Tano, but to no avail. After numerous more searches, Koon managed to persuade Skywalker that they needed to leave Felucia, promising that Tano could fend for herself and would return. A portion of the Republic forces then left the outpost to fight elsewhere, with Skywalker and Koon returning to the planet Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}