{"url": "Separatist_supply_ship", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems starship classes", "Category:DH-Omni Support Vessels", "Category:Transport classes"], "nodes": [{"tag": "h1", "text": "Separatist supply ship"}, {"tag": "p", "text": "The Separatist supply ship, also known as the Separatist support ship or the Separatist transport, was a massive transport and supply ship utilized by the Confederacy of Independent Systems during the Clone Wars. Originally a corporate vessel, the supply ship was adapted to compensate for the inadequate cargo capacities of other craft in the Confederate Navy, particularly the Lucrehulk-class battleship. The supply ship was over one thousand meters wide and housed several hangar bays, which could accommodate multiple C-9979 landing craft to transport the battle droid infantry of the Separatist Droid Army to battlefields across the galaxy. Being able to store over five million metric tons of cargo, it was primarily used for arms and resupply shipments to the organic defense armies in the Confederacy military, often supporting planetary campaigns from orbit. It was armed with point-defense laser cannons and could be crewed by B1-Series battle droids overseen by a T-series tactical droid."}, {"tag": "p", "text": "During the lengthy Battle of Umbara of 21 BBY, the Confederacy provided a Separatist supply ship to the Umbaran militia, which used the transport to reopen supply lines to the capital city following the Galactic Republic's capture of an Umbaran airbase. The supply ship sustained the capital's defenses until the craft was infiltrated and destroyed by a trio of clone trooper–commandeered Umbaran starfighters, leading to the capital's fall to the Grand Army of the Republic. A number of supply ships were involved in the Confederacy's massive blockade of Serenno, the headquarters of Head of State Count Dooku, while General Grievous used a pair of supply ships to support his invasion of Dathomir. Dooku also enlisted a pair of supply ships to supplement his invasion of Scipio, a stronghold of the InterGalactic Banking Clan."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Initially a corporate vessel, the Separatist supply ship was converted as a model of transport craft by the Confederacy of Independent Systems. It was 908.78 meters long and 910.35 meters tall, while its armored hull and barbell shape afforded a width of 1257.32 meters. It was armed with point-defense laser cannons but also relied upon other ships for protection. Its body housed a number of hangar bays, which could carry multiple C-9979 landing craft, each of which had a wingspan of 370 meters and a 150 meter height. The main hangar, accessible via an aft entry, was located in the midsection of the ship's starboard hemisphere and was equipped with ceiling cranes and other equipment for cargo loading and storage. At the end of the main hangar was the ship's reactor room, which was protected from outside access by ray shielding."}, {"tag": "p", "text": "The Separatist supply ship was painted with the blue livery of the Confederacy, as well as with a Confederate roundel on both sides of its hull. It had an overall cargo capacity upward of five million metric tons. It was equipped with a hyperdrive. The transport could be commanded by a single T-series tactical droid, while B1-Series battle droids made up the bridge team as well as the main hangar's cargo supply crew."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Separatist supply ship served as a heavy transport in the Confederate Navy during the Clone Wars, fulfilling the Confederacy's needs by compensating for the insufficient cargo capacity of other craft such as the Lucrehulk-class battleship. Originally a corporate transport, the supply ship was converted for wartime service in the Confederate Navy, proving to be a more dedicated cargo carrier than other vessels. It became a valuable combat asset during lengthy conflicts due to its massive size and capacity, which allowed it to serve as a transport for C-9979 landing craft and their troops, the battle droids of the Separatist Droid Army. Yet it primarily contributed to the Separatist war machine by supplying arms, power supplies, and other matériel—for example, long-range missiles—to organic defense armies like the Umbaran militia. Supply ships could be employed in campaigns from orbit, providing weaponry and supplies to ground forces on the planetary surface, while their isolated position in space would allow them to be defended by warships of the Confederate Navy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The supply ship initially served as a corporate vessel until being repurposed by the Confederacy of Independent Systems during the Clone Wars, becoming an integral part of the supply chain of the Confederate Navy. As more member worlds contributed their organic-based armies to the Separatist war machine, supply ships were used to support them during campaigns against the Galactic Republic, meeting a variety of replenishment needs, in addition to ferrying detachments of the Separatist Droid Army to the front lines. Due to its new role, it became known as the Separatist supply ship, or alternatively the Separatist support ship or Separatist transport. Late in 21 BBY, the second year of the war, the Confederate world of Umbara was subjected to an invasion by the Grand Army of the Republic. In response to the Republic 501st Legion's capture of an airbase that had been supplying the defenses of the capital city, the Confederate Navy provided the native Umbaran militia with a Separatist supply ship, with a large fleet of Confederate warships defending the transport. The vessel, commanded by a T-series tactical droid, remained in orbit and was used to rebuild the Umbarans' supply lines to the capital, providing the city's defenders with shipments of long-range missiles and other arms."}, {"tag": "p", "text": "A fleet from the Republic Navy targeted the Separatist supply ship to sever the capital's supply lines, but the flotilla was unable to destroy the vessel due to being outclassed in strength by the Confederate armada. During the battle over Umbara, Advanced Recon Commando Fives and two 501st clone troopers, Jesse and Hardcase, undertook an unsanctioned mission to destroy the supply ship. They joined the space battle in stolen Umbaran starfighters, using them to slip past the supply ship's defenses, as the battle droid crew was unable to identify that they were not friendlies until too late. Once inside, Fives, Jesse, and Hardcase piloted their starfighters through the main hangar, intending to blow up the ship by rupturing its reactor core. While the ship's droid crew attempted to defend their vessel from the clone troopers, the tactical droid commander activated the reactor chamber's ray shields, forcing the three soldiers to resort to other means. Hardcase manually walked one of his starfighter's missile pods through a service door into the reactor room, sacrificing himself by driving the missile pod into the reactor. The resulting explosion consumed the supply ship and its crew and lit up the Umbaran skies; it could even be seen from the surface through the clouded atmosphere. The supply ship's destruction enabled the Republic to conquer the capital and thus retake Umbara."}, {"tag": "p", "text": "The Separatist stronghold of Serenno, which housed the palatial headquarters of Head of State Count Dooku, was heavily blockaded by the Confederate Navy during the war. Five Separatist supply ships were dedicated to the blockade, along with a considerable number of warships. When Dooku authorized an assault on the planet Dathomir to target his former agent Asajj Ventress, General Grievous brought along a pair of supply ships to support his invasion. They remained in orbit of Dathomir with his invasion fleet, while he personally landed on the surface with a droid battle group aboard C-9979 landing craft to target the Nightsisters, slewing the entire clan of witches."}, {"tag": "p", "text": "Around 20 BBY, the war's final year, Dooku brought along a pair of supply ships as part of an invasion fleet targeting the planet Scipio, a stronghold of the InterGalactic Banking Clan. Upon arrival at Scipio, Dooku had his forces obliterate the Republic's on-world clone trooper garrison and then proceeded to the surface, leaving the super tactical droid Kraken in command of the supply ships and the rest of the fleet. Just as Jedi General Anakin Skywalker arrived with a fleet of Republic Star Destroyers to retake the banks, Dooku returned to his armada in orbit and ordered a retreat from Scipio, and the supply ships joined in the withdrawal from the battlefield by jumping to hyperspace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Separatist supply ship was designed for the Star Wars: The Clone Wars television series and debuted in the episode \"Plan of Dissent,\" which aired as part of the series' fourth season on November 11, 2011. Much of the design of the ship model's interior was constructed from existing assets made for previous episodes from the series' second season, such as cargo containers from \"Senate Murders,\" fuel pipe conduits in \"The Zillo Beast,\" and spot lamps from \"The Zillo Beast Strikes Back.\" As part of its appearance in \"Plan of Dissent,\" the supply ship received an entry in the StarWars.com Encyclopedia. Supply ships have since been featured in the episodes \"Massacre\" and \"Crisis at the Heart.\""}, {"tag": "p", "text": "In \"Plan of Dissent,\" the supply ship aiding the Umbarans was originally a Trade Federation Lucrehulk-class battleship. According to Series Supervising Director Dave Filoni, Series Producer George Lucas asked that it be changed to a vessel more clearly affiliated with the Separatists, to show that the Trade Federation was more of a neutral corporation in the Clone Wars. The result was the Separatist supply ship, with its in-universe connection with the Lucrehulk-class battleship being that the larger supply ship was more suited for the task."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}