{"url": "Sergeant_Boom-Boom", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Corso Riggs's weapons"], "nodes": [{"tag": "h1", "text": "Sergeant Boom-Boom"}, {"tag": "p", "text": "Sergeant Boom-Boom was a weapon owned by a Human mercenary named Corso Riggs by the end of the Cold War and into the following Galactic War, fought between the Galactic Republic and the Sith Empire. While serving with a smuggler captain who worked as a privateer for the Republic, Riggs preferred using Sergeant Boom-Boom against the forces of the Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Human mercenary Corso Riggs gave the name Sergeant Boom-Boom to one of the weapons he owned by the end of the Cold War, fought between the Galactic Republic and the Sith Empire. Riggs was in possession of the weapon while he served with the crew of a smuggler captain who worked for the Republic as a privateer beginning in 3642 BBY and into the following Galactic War. Sergeant Boom-Boom was the weapon that Riggs favored using against Imperial opponents by the time the smuggler captain was working as a Republic privateer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sergeant Boom-Boom is first mentioned in the 2011 BioWare–LucasArts MMORPG Star Wars: The Old Republic in two companion conversations between a Smuggler player and Corso Riggs—\"The Peace Brigade\" and \"In Harm's Way.\" The weapon was originally going to be mentioned by Riggs in \"Just Desserts,\" a Smuggler mission on the planet Corellia, but the section of dialogue that contained the mention was removed from the final game. The cut dialogue has Riggs offer the weapon to the Smuggler and indicates that Sergeant Boom-Boom was an intimidating weapon in his eyes. Riggs also referred to the weapon with a male pronoun and used the nickname \"Sergeant Boom\" in the removed dialogue. Despite multiple mentions in the game's dialogue, the weapon type of Sergeant Boom-Boom was never specified."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}