{"url": "Sera_Fray", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Humans", "Category:Scientists", "Category:Sith Empire individuals"], "nodes": [{"tag": "h1", "text": "Sera Fray"}, {"tag": "p", "text": "Sera Fray was a Human female scientist for the Sith Empire during the Cold War between the Empire and the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "She, under the orders of the Sith Lord Darth Ouzal, tried to duplicate the informations contained in a Sith holocron into the brain of two Republic prisoners, Felix Iresso and Milo Pellam, captured on Althir III. The experiment was a success with Iresso, locking away in a corner of his mind a library of Sith knowledge. However, the experiment was unsuccessful with Pellam, driving him mad. Both were freed some time later."}, {"tag": "p", "text": "Years later, Fray had escaped the Empire and had gone into hiding. Iresso, while working with the Barsen'thor of the Jedi Order, attempted to look for her after Pellam became destructive and destroyed a starship belonging to a gangster, thinking it contained Sera Fray. This search led to her revealing herself to Iresso to explain the circumstances behind the experiment as well as to ask Iresso to remove her image from the Republic database, as it endangered her."}, {"tag": "p", "text": "Following the Barsen'thor's advice, Felix Iresso erased her from the Republic database stopped searching for her, ensuring her safety."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sera Fray first appeared in the 2011 video game Star Wars: The Old Republic by BioWare, as a non-playable character that's part of Felix Iresso's companion quest, available to Jedi Consulars."}, {"tag": "p", "text": "The player has the option to advice Felix into erasing her from the Republic databases for light side points, or to endanger her in revenge for dark side points."}, {"tag": "h2", "text": "Appearances"}]}