{"url": "Serias", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Terrestrial planets", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Serias"}, {"tag": "p", "text": "Serias was a planet located within the Serianan system in the Wild Space region of the galaxy. The lone inhabited world in the star system, Serias was theorized by the New Republic Scout Service captain Korren Starchaser to be the home of a sentient humanoid species. Upon exploring the Serianan system, Starchaser's scouting team only gave the planet a cursory inspection without making any contact with the local civilization due to the already amassed information from the nearby Serianan Belt of asteroids."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Serias was a terrestrial planet that was located within the remote Serianan system, a part of the Wild Space region of the galaxy. The only planet in the star system, Serias was sufficiently large and located close enough to its star to be habitable by standard life forms. The planet gave its name to the Serianan Belt, an expansive asteroid belt that took up more than half of the star system, and a pirate base was also located nearby."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point during the New Republic's reign, the Human New Republic Scout Service captain Korren Starchaser and his team explored the Serianan system in the scout starship Jedi Dreamer. However, they decided to only make a short inspection of Serias, without even scanning it with sensors, because of the abundance of information the team had already collected from several markings and statues on some of the asteroids in the Serianan Belt as well as the desire to inspect that data before making any contact with the civilization that existed on Serias. Starchaser later included a report on the exploration of the Serianan system in his datafiles."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Serias was an inhabited world, and the discovery of advanced markings and statues on the asteroids led Captain Starchaser to theorize that a sentient humanoid—albeit probably non-Human—species lived on the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Serias was introduced in the \"Scouts' Dispatch\" feature of West End Games' Star Wars Adventure Journal 8, published in November 1995. The feature was written by Peter Woodworth. The 2009 reference book The Essential Atlas placed the planet in grid square P-2."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}