{"url": "Serpent_Masters", "categories": ["Category:Legends articles", "Category:Military units", "Category:Planetary governments"], "nodes": [{"tag": "h1", "text": "Serpent Masters"}, {"tag": "p", "text": "The Serpent Masters were the warrior planetary authority on Ophideraan who served as the paramilitary forces of Supreme Serpent Master Tyrann during the Galactic Civil War. They were based in the Great Well, and commonly wore salvaged stormtrooper armor. They carried power lances that fired disrupter rays."}, {"tag": "p", "text": "The Serpent Masters were named as such for their control of the flying serpents native to Ophideraan. The warriors found these beasts responded to certain ultrasonic tones and pulses. Tyrann used a transmitter held within his medallion to send special tones to the serpents, effectively controlling their movements."}, {"tag": "p", "text": "The Serpent Masters oversaw a slave operation in the Great Well, commanding a workforce that drilled into the bottom of the sinkhole for water, while the Serpent Masters themselves dwelled in the upper levels. They also carried out a salvage operation, and would scout the planet for crashed starships, devices and droids to be taken back to the Great Well. Tyrann employed Tanith Shire to program droid barges from Fondor to crash-land on Ophideraan, which would then be salvaged by slaves."}, {"tag": "p", "text": "When Tanith herself accidentally crashed on the planet with Luke Skywalker, the Serpent Masters took them to the Great Well, and put them to work in the Slave level. However, Skywalker's droid, R2-D2, was able to duplicate the Serpent Masters' control signal, giving Luke control of a serpent. With it, he reached the upper levels and destroyed Tyrann's medallion—resulting in the Supreme Master's death—which effectively broke the Serpent Masters' control of their beasts. The slaves then took over operations in the Great Well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}