{"url": "Serpent%27s_Smile", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Victory-class Star Destroyers", "Category:Zsinj starships"], "nodes": [{"tag": "h1", "text": "Serpent's Smile"}, {"tag": "p", "text": "Serpent's Smile was a Victory-class Star Destroyer in the service of Warlord Zsinj, a former Imperial admiral who forged his own empire following the Battle of Endor and the disintegration of the Imperial Starfleet. An old warship outclassed by the Imperial-class Star Destroyers that made up much of Zsinj's fleets, Serpent's Smile nevertheless served alongside Zsinj's flagship, the Executor-class Star Dreadnought Iron Fist, during the warlord's extended conflict with New Republic and Imperial forces. Zsinj had great faith in the captain of the Victory-class Star Destroyer, whom the warlord perceived as a fine pilot and a shrewd officer. In 8 ABY, Serpent's Smile was deployed at the battle of Levian Two, in which Zsinj had set a trap for General Han Solo, who was directing the New Republic task force against the warlord. Before Serpent's Smile could engage the enemy closely, however, Solo escaped."}, {"tag": "p", "text": "The Victory-class Star Destroyer was deployed later that year in the Vahaba system, where Zsinj believed Solo was located. Alongside Iron Fist and Red Gauntlet, the latter an Imperial-class Star Destroyer, Serpent's Smile arrived in the Vahaba system, only for Zsinj to discover that he had been led into a trap, his forces prevented from escaping into hyperspace by the gravity well projectors of the Imperial Immobilizer 418 cruiser Stellar Web. The warlord subsequently ordered Serpent's Smile and Red Gauntlet to advance upon Stellar Web and either destroy it or force it off course, thus allowing Iron Fist to slip out of its artificial gravity well and enter hyperspace. Serpent's Smile took tremendous damage from the New Republic forces as it approached the Interdictor, and Zsinj ultimately decided to sacrifice the old warship, ordering its crew to lock down its course on Stellar Web and abandon ship in an attempt to ram the Interdictor off course. Although Stellar Web was forced off course, enabling Zsinj to escape, the Interdictor evaded the flaming wreck of Serpent's Smile, which was classified destroyed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Shipyards began manufacturing Victory-class Star Destroyers in the last years of the Clone Wars; by the time Serpent's Smile had joined Zsinj's warfleet, which had been formed after the Battle of Endor, the warship was deemed to be very old. As well as its main bridge, it possessed an auxiliary bridge and carried a complement of starfighters, as well as escape pods to enable evacuation. Its communications system allowed for logistical data concerning the warship's status to be broadcast to other vessels. Serpent's Smile was underarmed in the face of larger capital ships, possessing few guns on her stern and weaker shields, but its narrow profile and high maneuverability allowed its pilot to move the Star Destroyer at speed through gaps between other warships."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Service under Warlord Zsinj"}, {"tag": "p", "text": "In 4 ABY, Emperor Palpatine of the Galactic Empire was killed at the Battle of Endor, where the Imperial Starfleet suffered a disastrous defeat. Admiral Zsinj, de facto ruler of the Quelii sector, decided to set out on his own following the Battle of Endor, amassing a large force and gradually expanding his influence, coming to dominate a third of the known galaxy by 7 ABY. Among the large starfleet at Zsinj's command, spearheaded by the Warlord's flagship, the Executor-class Star Dreadnought Iron Fist, was the Victory-class Star Destroyer Serpent's Smile, which—despite its age—was fielded by Zsinj alongside newer model capital ships such as Imperial-class Star Destroyers. Having consolidated his power base during the chaos following the fragmentation of the Galactic Empire, Zsinj became the target of both a New Republic task force, led by General Han Solo, and an Imperial loyalist fleet, commanded by Admiral Teren Rogriss. From 7.5 ABY until 8 ABY, Zsinj engaged in an extended campaign against the two enemy task forces."}, {"tag": "p", "text": "During the campaign, which increasingly descended into a personal contest between Zsinj and his New Republic opponent, General Solo, Serpent's Smile was commanded by a captain who was held in high regard by Zsinj. The Victory-class Star Destroyer was paired with other warships—such as the Imperial I-class Star Destroyer Red Gauntlet—in task forces consisting of several capital ships. In 8 ABY, Zsinj set a trap for General Solo in the Levian system. Dividing his forces into three task forces, Zsinj grouped Serpent's Smile; Red Gauntlet; the Dreadnaught-class heavy cruiser, Reprisal; Iron Fist; and two Carrack-class light cruisers together for his main flotilla. The Warlord then lurked with his forces on the outskirts of the Levian system, having attacked the New Republic base on the planet Levian Two to lure Solo and his flagship—the MC80B Star Cruiser Mon Remonda—into a trap. Zsinj also kept two other task forces waiting in ambush."}, {"tag": "p", "text": "Once Mon Remonda arrived with a small force of supporting warships, and investigated events on Levian Two, Zsinj sprung his trap, ordering Serpent's Smile and the other four warships composing the group to follow Iron Fist as it advanced upon Solo's position. The New Republic general immediately began maneuvering his forces in response, advancing on Zsinj's task force in an attempt to escape Levian Two's gravity well and flee the system. Zsinj brought his other two task forces into the engagement while retreating his own group before the oncoming New Republic fleet, hoping to prolong the engagement rather than exchange a brief salvo."}, {"tag": "p", "text": "As Solo's fleet neared Serpent's Smile and the rest of Zsinj's first group, New Republic starfighters engaged the Carrack-class light cruisers on the left flank of the group, knocking both starships out of the fight. As Mon Remonda neared Iron Fist and the other warships, however, a second New Republic task force emerged from hyperspace, composed of three capital ships, to harry Iron Fist's port and aid Mon Remonda's flight. Vexed, Zsinj ordered Serpent's Smile, Red Gauntlet and Reprisal to advance upon the new arrivals and prevent them from throwing up a protective screen around Solo's flagship. Meanwhile, the Warlord recalled the starfighters harrying the Mon Remonda in order to have them support Iron Fist against the newcomers."}, {"tag": "p", "text": "Serpent's Smile and the other two capital ships complied with Zsinj's orders and moved forward, engaging the enemy, but were unable to prevent the MC80 Star Cruiser Mon Karren from interposing itself between Iron Fist's turbolaser barrage and Mon Remonda, absorbing the damage meant for Solo's flagship on its shields. Without Zsinj's starfighters to harass them, Solo and Mon Remonda escaped, along with the rest of the New Republic forces. Over the next weeks, Zsinj grew increasingly determined to eliminate Solo, as the general appeared to be flying personally into the Warlord's territories aboard his YT-1300 light freighter, the Millennium Falcon. When a New Republic defector informed Zsinj that Solo and his light freighter would next be located at the Vahaba system, the Warlord made preparations to intercept his adversary there."}, {"tag": "h3", "text": "Destruction at Vahaba"}, {"tag": "p", "text": "Zsinj led Serpent's Smile, Red Gauntlet, and Blood Gutter, a Carrack-class light cruiser, to the Vahaba system, in response to Petothel's advice. There, the Warlord discovered that a New Republic task force was in fact lying in ambush waiting for him, headed by Solo himself aboard Mon Remonda. Zsinj immediately ordered a retreat, but when it became apparent that an Immobilizer 418 cruiser had charged up its gravity well projectors and was preventing the departure of his fleet to hyperspace, the Warlord dispatched Serpent's Smile and Red Gauntlet to eliminate the interdictor. The captain of Serpent's Smile received the order, and directed the warship toward the interdictor, which was being escorted by the Crynyd and the Skyhook, two New Republic Star Destroyers. As time was of the essence, the captain merely needed to force the Immobilizer 418 cruiser, Stellar Web, to divert from its heading, thus shifting the sphere of effect of the gravity well projectors away from Iron Fist. Serpent's Smile was, however, outgunned by Crynyd and Skyhook and prepared to take heavy damage as it approached the interdictor. As the Warlord wished to leave the Vahaba system as quickly as possible, he did not order any of his warships to deploy their starfighters, instead trusting the commanders and crews of Serpent's Smile and Red Gauntlet to complete their mission."}, {"tag": "p", "text": "As Crynyd and Skyhook opened fire on Serpent's Smile and Red Gauntlet, both of Zsinj's warships took damage. Serpent's Smile's captain ordered his crew to rotate the Victory-class Star Destroyer ninety degrees on its long axis, allowing the warship to knife between the New Republic Star Destroyers and continue its approach upon Stellar Web, while Red Gauntlet brought its main turbolaser batteries to bear on Crynyd and Skyhook. The captain's maneuver brought Serpent's Smile some time, as due to its position between the two New Republic Star Destroyers it suffered less damage, due to the fact that the New Republic commanders could not risk firing all batteries upon the Victory-class Star Destroyer without fear of hitting each other's vessels. Serpent's Smile then came face to face with Stellar Web, which was continuing its path toward Iron Fist from behind its protective Star Destroyer screen. The captain of the Victory-class Star Destroyer and the captain of the interdictor were now locked in a game of brinkmanship; whoever altered the course of their vessel first would lose. Stellar Web advanced upon Serpent's Smile, unloading its forward turbolaser batteries upon the aged warship. Serpent's Smile decelerated into the path of the oncoming interdictor, its bow taking heavy damage from its opponent's guns. The shields protecting the bridge of the Victory-class Star Destroyer collapsed and the top hull of the warship was soon awash with flame. The bridge was destroyed in the inferno and the crew in the auxiliary bridge contacted Iron Fist for new orders."}, {"tag": "p", "text": "Despite the belief of the surviving crew that the aged warship could be saved, Warlord Zsinj ordered them to abandon ship, launch all starfighters and lock down their current heading—which was leading to a seemingly imminent collision with Stellar Web—in the knowledge that rather than run the risk of Serpent's Smile's crew diverting away from Stellar Web, he should instead send an empty wreck to collide with the interdictor. Just as the flaming Victory-class Star Destroyer hulk was about to collide with Stellar Web, however, Admiral Rogriss aboard the Stellar Web reversed the Immobilizer 418 cruiser's gravity well generators so that they pushed his flagship away from Serpent's Smile. In doing so, Rogriss altered course suddenly, leaving the wreck of Serpent's Smile to hurtle through the space where Stellar Web had been. The aged Victory-class Star Destroyer was finished; nothing more than a flaming hulk, it was classified destroyed. Although it had forced Stellar Web off-course and enabled Iron Fist and Zsinj to escape, Serpent's Smile's destruction was a significant blow to the Warlord. Serpent's Smile's partner ship, Red Gauntlet, was also lost during the battle, captured by the New Republic forces."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "During its service under Zsinj, Serpent's Smile was commanded by a male captain who was held in high regard by the Warlord. Zsinj viewed the man as a canny commander and a fine pilot, trusting him to force Stellar Web off course. When Zsinj realized that the captain of Serpent's Smile was up against Imperial Admiral Rogriss, however, the Warlord became less confident. The crew of Serpent's Smile were ordered to abandon ship during the Battle of Vahaba and its pilots instructed to launch in their starfighters; before doing so, the auxiliary bridge crew reported to the Warlord that they would be able to save the old Victory-class Star Destroyer if they were given the chance, a request that Zsinj ignored."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Serpent's Smile appears in the third novel of Aaron Allston's Wraith Squadron trilogy, Solo Command, published in 1999. Allston identified Serpent's Smile as a Victory-class Star Destroyer in the warship's second appearance in the novel, at the Battle of Vahaba, but did not specify whether it was a Victory I-class or a Victory II-class Star Destroyer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}