{"url": "Serp", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Outer Rim Territories species", "Category:Reptilian sentient species", "Category:Serps"], "nodes": [{"tag": "h1", "text": "Serp"}, {"tag": "p", "text": "The Serps were sentient, humanoid reptiles indigenous to the planet Serphidi in the Belial system. They were a sexually dimorphic species, with red-scaled and flat-faced males, and orange-scaled and long-snouted females. The Serps once had superior technology, but they used it for devastatingly destructive acts. Eventually, they chose to sign a pact that banned advanced technology and united the planet under a single King. Their remaining technology was simple, and they sublimated their destructive urges with jousting competitions. Each year, they held a tournament to remember the day of peace."}, {"tag": "p", "text": "Shortly before the eruption of the Galactic Civil War, King S'Shah came to power. He allied with the Galactic Empire, revived some of the Serps' ancient technology, and turned the previously nonlethal jousts into deadly affairs. Most Serps disliked S'Shah's reforms and showed sympathy to the Rebel Alliance; thus, the Human Rebel agent Luke Skywalker came to Serphidi to work with the Rebel-friendly natives in deposing S'Shah. With the help of an older Serp named Elglih, Skywalker entered the yearly tournament and defeated the King. Elglih became the new monarch, and the Serps officially allied with the Rebel Alliance."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Serps were a species of humanoid reptiles. Aside from a few traits held in common between the sexes—including clawed and webbed hands with four or five fingers each, knobby, scaled hides, and sharp, white teeth—the species exhibited a high degree of sexual dimorphism. The males had muscular physiques and a relatively flat face. A scaly ridge defined the brow, which arched above two brilliant, blue—or, rarely, red—eyes. The males had no appreciative nose but a large, oval-shaped mouth brimming with sharp teeth and sporting a pale-red, forked tongue. A caudal, buzz-saw-shaped crest ran atop the heads of some males, while other males lacked the trait. Nearly all male Serps had red scales, although at least some were green. Male Serps were able to grow facial hair, which was red in some individuals but turned white with age."}, {"tag": "p", "text": "In contrast, females were distinguished from the males by their slimmer physique and prominent breasts. They had a protuberant snout that featured two nostrils. Their eyes were yellow and smaller than those of the males. Females, like some males, had a crest of curved spikes running along the center of the head. They also featured orange skin. In addition to whitening hair in males, with age Serps lost the strength of their youth and their teeth began to fall out and lose their sharpness."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Serps had a highly stratified society with the population ruled by a monarch. Under the King were a band of warriors known as knights. Knights, in turn, were served by warriors-in-training known as squires. Serps valued age as well, with elders afforded great respect. They viewed time in recurrent terms, speaking of \"cycles\" rather than years."}, {"tag": "p", "text": "During the Galactic Civil War, the Doom-Jousts were an annual combat tournament. Serp warriors underwent intensive training to prepare for the Doom-Jousts, traveling to secluded sylvan environments to both perfect mounted jousting techniques by engaging in exercises such as skewering a spinning ball, practicing archery, and drilling with weapons used in hand-to-hand combat. The Doom-Jousts were popular with the Serp populace; spectators filled the stands, and heralds announced the events by blowing long trumpets. While all the jousting contestants were males, female Serps showed their support by throwing red flowers at the knights of their choice. Before each bout, an announcer called out the names of the challengers. The joust itself consisted of two phases: in the first, two mounted warriors rode at each other with lances and separated by a wooden fence, while attempting to unseat the opponent. In the second part, the unseated warriors engaged in mêlée combat with hand weapons. The match ended when one of the contestants was killed or yielded. Other recognized Serp vocations included chefs and jesters, who entertained their compatriots with displays of juggling."}, {"tag": "p", "text": "Serps practiced marriage, with a male and female Serp forming a wedded pair. They found Humans physically unattractive due to what they perceived to be dull coloration, soft flesh, and a lack of scales."}, {"tag": "h3", "text": "Technology"}, {"tag": "p", "text": "The Serps developed a high level of technology, with access to items such as starfighters and blaster cannons. They lived in high-tech cities with multistory buildings. However, after the Serps united as a single political union, high technology was banned, and their society adapted a simpler lifestyle."}, {"tag": "p", "text": "Thus, at the time of the Galactic Civil War, Serp technology was relatively primitive by the standards of the outside galaxy. Some Serps lived in simple cottages made of brown wood and thatched with yellow straw. Windows allowed sunlight to illuminate the interior in daytime, while candles served that function by night. Entrance and egress were facilitated by doors. Individual homes lay in fields of green grass, separated from neighboring plots by picket fences. Interior furnishings were wooden and included tables, stools, and benches. Serps used black, metal pots and utensils for cooking and eating and glass jugs for storing liquids. Porridge was one representative Serp meal, although at least some Serps found the flesh of other sentient beings, such as Humans, delectable."}, {"tag": "p", "text": "The Serp King, in contrast, lived in a large castle known as Castle S'Shah. The imposing structure was made of stone, boasting large towers and parapets, from which banners streamed in the wind. The castle featured stalwart, wooden doors. Torches ensconced in the walls provided interior lighting. In such opulent settings, glassware was preferred."}, {"tag": "p", "text": "Serp fighters wielded lances, bows and arrows, daggers, quarterstaffs, longswords, nets, and maces in combat and rode large, green, bipedal, reptiles as mounts. Despite the relatively primitive nature of their technology during the Galactic Civil War, the Serp King S'Shah reserved for himself a lance that fired energy bolts."}, {"tag": "h3", "text": "Clothing"}, {"tag": "p", "text": "Serps' styles of clothing varied with the individual's social setting and occupation. At home, at least some Serp women wore full, long-sleeved dresses whose simplicity was countered by a frilly collar and sleeves as well as a waist apron. A kerchief tied under the chin covered the head. Serp females who served in the King's castle wore much less clothing, their outfit consisting of a collar attached to a metallic brassiere, armlets, bracelets, and skimpy panties. Another possible outfit included a wide-sleeved dress and a conical hennin headdress with cloth flowing from its tip."}, {"tag": "p", "text": "Some Serp males, in contrast, sported long, short-sleeved tunics over boots, accentuating their outfit with wristbands. Outside combat, high-ranking Serp men, such as the King, wore minimalist clothing. For instance, the King S'Shah wore a sleeveless shirt partially covered by a long cape tied with a brooch, a belt over briefs, a pair of wristbands, and leather boots. A Serp King might sometimes wear a golden crown. Royal guards dressed similarly, with conical, open-faced helmets, armbands, a sleeveless tunic, a belt, and leather boots. Such guards carried long spears or halberds."}, {"tag": "p", "text": "In combat, warriors wore suits of gray, metal body armor, which included pauldrons, a breastplate, pieces to cover the arms, legs, and feet, and a helmet with a hinged visor, and a large shield bearing an emblem. The helmets often sported colorful plumes. Lower-ranked soldiers sported simpler armor, such as conical, open-faced helms, leather boots, and short-sleeved tunics. Meanwhile, Serp entertainers were recognized by their colorful doublets, frilled collars, and hats characterized by several drooping points terminating in pompoms."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Serphidi, a planet of mountains and forests in the Belial system served as the backdrop for the Serps' evolution. The planet fell within a region of space first explored by outsiders between 3000 and 1000 BBY, eventually becoming part of the Sanbra sector in the Outer Rim Territories. By 1004 BBY, during the New Sith Wars, the Serp homeworld had fallen within the domain of the Sith Empire, and by 22 BBY, during the Clone Wars, it was within Separatist space."}, {"tag": "p", "text": "The Serps advanced to a state of high technology. However, access to advanced weaponry tempted Serp factions to go to war with one another, leading to centuries of conflicts, which, in turn, led to planet-wide devastation. The costs of war grew so dear that, at some point at least several cycles before the Galactic Civil War, the warring groups agreed to a pact: high technology was banned on Serphidi, and the Serps swore fealty to a single King. The annual Doom-Jousts were instituted as an outlet for aggressions once reserved for war."}, {"tag": "p", "text": "Many cycles before 0 ABY, the Serp S'Shah assumed the Serphidian throne. The new King broke with tradition and gained access to some of the planet's theretofore lost high technology. He used the forbidden knowledge to power his personal jousting equipment, in turn reconstituting the Doom-Jousts as contests to the death. S'Shah decreed that he could not be removed as the Serps' King until someone defeated him in the Doom-Jousts. The King took on all challengers and prevailed each time. Nevertheless, Serps continued to train for their opportunity to oust S'Shah from power; the elderly Serp Elglih was one example."}, {"tag": "p", "text": "After the founding of the Galactic Empire in 19 BBY, the Belial system lay outside Imperial control until at least 17 BBY. However, the Serp homeworld had fallen under Imperial dominion by the outbreak of the Galactic Civil War. Nevertheless, the Serps sympathized with the Alliance to Restore the Republic in their opposition to the galactic government. When the Empire scaled up its activities in the star system by sending TIE/LN starfighters, Alliance High Command decided that the increased Imperial activity posed too great a risk to Rebel operations, since the Alliance had no bases nor allies in the sector. The Human Alliance operative Leia Organa thus sent a strike team—made up of the Human starfighter pilots Berl, Luke Skywalker, and Cinda Tarheel—on a mission to Serphidi to attempt to befriend the Serps and thus gain valuable agents in the area who could apprise the Alliance of Imperial activities in the region."}, {"tag": "p", "text": "The Rebels came under fire by Imperial forces when they arrived in-system. They fled to the planet's surface, but there they came under attack by King S'Shah, eager to add to his legend, and several Serp warriors, including one named Chahis. The Serps killed Berl and injured Tarheel in the fighting, but Skywalker shot some Serps and fled in the nearby woods. The Serp King took Tarheel as a personal plaything, transporting her back to Castle S'Shah."}, {"tag": "p", "text": "In the forest, Skywalker stumbled upon the Serp Elglih, who was caught by a carnivorous plant. The young Human rescued the elder Serp, who revealed that he had been practicing for the Doom-Jousts when he fell into his predicament. In his cottage in Harmony Glade, Elglih explained the history of the planet to the offworlder and, realizing he was too weak and old himself to defeat S'Shah in combat, asked the Human to enter the Doom-Jousts on his behalf. Skywalker agreed."}, {"tag": "p", "text": "At the castle, the King toyed with Tarheel for a time, dressing her in an elegant gown and feigning physical attraction to her. He finally revealed his true intentions, however: he planned to eat the Human woman. A pair of Serp guards took Tarheel to be fitted for a dress, but she escaped. S'Shah recaptured the woman and brought her to the Doom-Jousts, which began that day, where she was forced to sit in his personal viewing box."}, {"tag": "p", "text": "The arrival of the Doom-Jousts brought Elglih's intense training regimen to a close. At the tourney, the elderly Serp challenged the King but asked that Skywalker be allowed to fight in his stead as a personal champion. S'Shah accepted the proposal, and the Serp ruler faced off against the Human in a joust. The King's energy bolts proved too much for the offworlder, who was dismounted. S'Shah's attempt to finish his opponent brought him within range of the Human's counterstrike and allowed Skywalker to unseat the King and engage him in hand-to-hand combat. Grabbing the King's energy-bolt-firing lance, the Human gained the upper hand, and S'Shah yielded. Nevertheless, he attempted to surprise his opponent with a high-tech weapon known as a micro-jolt. The offworlder shot and killed the King in reaction."}, {"tag": "p", "text": "Elglih asked Skywalker to take the Serphidian throne, but the Human insisted that Elglih was best suited to rule the planet. The Serp agreed and succeeded S'Shah as King—and as a loyal supporter of the Rebel Alliance. Decades later, in 137 ABY, Sephidi fell within the domain of Darth Krayt's Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Serps were created by writers Michael Fleisher and David Michelinie for the 64th issue of the Marvel Comics Star Wars comic book. Artists Joe Brozowski and Vince Colletta created the species physical appearance. The issue in which the Serps appear was first published in October 1982. Unlike the other Serps featured in the issue, the Serp depicted on the cover of Star Wars 64 has green skin and red eyes. Whether this is a variant phenotype for the species or an artifact of the Rebellion's digital display is not indicated."}, {"tag": "p", "text": "The Serps are mentioned in \"ComicScan: Marvelously Silly Aliens,\" an article written by Charlie Novinskie for Star Wars Galaxy Magazine 3, a magazine first published in Spring 1995. The article misspells the species' name Sepr."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}