{"url": "Serra_Keto", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Females", "Category:Humans", "Category:Jedi Generals", "Category:Jedi Purge victims", "Category:Keto family", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Serra Keto"}, {"tag": "p", "text": "Serra Keto was a Human female Jedi Knight. Originally a Padawan of the renowned Jedi Master Cin Drallig, she was considered his best student. Keto was a practitioner of Jar'Kai, a dual-blade fighting technique, and like her Master, was known for her skills with a lightsaber. Keto fought in the Clone Wars, serving as a Jedi General, and even fighting alongside the famed Jedi Anakin Skywalker during one battle. In 19 BBY, she was killed during Operation: Knightfall, when the Sith apprentice Darth Vader stormed the Jedi Temple on the planet Coruscant. Though she dueled Vader to prevent him from killing any other Jedi present, she was unable to best him."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Serra Keto was a Human female who served the Jedi Order during the waning years of the Galactic Republic. Trained by the skilled lightsaber master, Cin Drallig, Keto became his prize pupil. In time, she became a Jedi Knight herself. Like her Master, she was a skilled lightsaber duelist, and was known as Drallig's finest pupil. Keto used Jar'Kai, the art of dueling with two blades at once."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Keto fought in the Clone Wars as a Jedi General. Some time during the Outer Rim Sieges in 19 BBY, the war's third year, a space station carrying Keto, another Jedi, and a unit of clone troopers was attacked by a pink blob-like species able to combine and morph into machinery. Keto was the sole survivor of the assault and sent out a distress signal in the Outer Rim Territories that caught the attention of Jedi Knight Anakin Skywalker. Leaving his ally, Obi-Wan Kenobi, the \"Hero With No Fear\" traveled to the space station where he encountered Keto. She demanded immediate transport off the facility. Skywalker, however, refused in order to find out what happened to her unit. Because of his curiosity, the two Jedi were forced to fight the pink shape-shifting creatures, who had shaped themselves into two Separatist spider droids. They were eventually defeated, but the Jedi were forced to break a bulkhead, exposing them to the vacuum of space. In order to prolong the station's existence, Skywalker wanted to activate the emergency ray shields. Keto, however, believed that the only way to destroy the blobs was to allow the station to destroy itself, and them along with it. Skywalker refused to give in to the prospect of death, so he and Keto quickly rushed to the hangar and barely escaped with their lives in his Jedi Interceptor."}, {"tag": "h3", "text": "Raid on the Jedi Temple"}, {"tag": "p", "text": "Shortly after the Battle of Utapau, the Republic's Supreme Chancellor Palpatine managed to turn Skywalker to the dark side of the Force, and began the Great Jedi Purge. Skywalker, now known as Darth Vader, was sent to the Jedi Temple on the planet Coruscant to kill all the Jedi there. Serra Keto and Cin Drallig made a last stand together, fighting off numerous clone troopers until they were separated by All Terrain Recon Transports. Finally, Keto faced off against Vader in the data room by the Tower of First Knowledge."}, {"tag": "p", "text": "Despite her emotion-laden dual lightsaber attacks, she deemed Vader to be stronger. During the fight, Keto taunted and provoked Vader, hoping that he would make a mistake and give her an advantage. Unfortunately for her, Vader was able to tire and corner the young Jedi, trapping her in the training room at the base of the Tower of First Knowledge. In desperation, she used the Force to throw a huge pillar between her and her attacker to make an escape. However, Vader dodged the attack and followed her up on a balcony. After a short battle against the Sith, the young Jedi managed to pin Vader to a pillar and attempted to behead him. Vader ducked under her strike, causing her to slice through the pillar instead. Before the exhausted Keto could attack Vader again, the Dark Lord used the Force to cause the pillar she had cut to fall onto her, knocking her off the balcony and crushing her in the training room below. Serra Keto was dead, one of the many Jedi to fall at the hands of Vader."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Serra Keto was confident in her abilities, as shown during her duel with Darth Vader. This confidence, however, never led her to make any snap decisions in a combat situation. A selfless woman, she was prepared to sacrifice herself if necessary. She was willing to destroy the ship along with herself to defeat the \"machine-aliens,\" believing it to be the Jedi way. Keto was also bold, taunting her opponents in an attempt to distract them."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Keto's master, Cin Drallig, developed his own unique style of lightsaber combat, relying on enhanced speed and unconventional and unpredictable movements, and his apprentice followed his lead. Her combat style was fast, dynamic and acrobatic. She was a practitioner of Jar'Kai, using both lightsabers to strike harder and perform more powerful attacks. Keto proved capable of holding her own against Darth Vader and almost beheaded him before the Sith Lord crushed her under a pillar. Keto was also skilled at telekinesis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Serra Keto was created for the 2005 LucasArts' Star Wars Episode III: Revenge of the Sith video game. Her voice was performed by Kari Wahlgren.[source?]"}, {"tag": "p", "text": "According to early drafts of the Revenge of the Sith game, Keto was supposed to fight Vader alongside her Master, Cin Drallig, in a two-on-one battle. The fight would have required the Sith Lord to use all of his dark side powers to defeat the two highly skilled combatants. In The Complete Star Wars Encyclopedia, it is incorrectly stated that Serra Keto was expelled from the Jedi Order due to her boldness and defiance of rules."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}