{"url": "Sesid", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Corva sector planets", "Category:Galactic Empire planets", "Category:Jungle planets", "Category:Volcanic planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Sesid"}, {"tag": "p", "text": "Sesid, the homeworld of the Draedan species, was an aquatic planet located in the Outer Rim Territories. It was a popular tourist destination, and many vacationers traveled across the galaxy to visit its tropical islands. The Galactic Empire conducted pharmaceutical research on Sesid, and deployed a military garrison on the scenic world to protect their assets."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Astronomy"}, {"tag": "p", "text": "Sesid was a planet located in the star system of the same name, which was contained within the Outer Rim Territories' Corva sector."}, {"tag": "h3", "text": "Geology"}, {"tag": "p", "text": "From space, Sesid appeared to be a brilliant blue ball, with a cloud-laced atmosphere and numerous green and black dots that were actually the planet's many tropical and volcanic islands floating in an ocean. At least one of the planet's volcanoes was active during the Age of the Empire, located east of the main island chain containing the port town Thrinaka. The sand was black, and littered with white shells, and the beach rose into green jungle and the slope of the volcano itself."}, {"tag": "h3", "text": "Flora and fauna"}, {"tag": "p", "text": "The turquoise waters contained massive floating leaves, much like spongy lily pads, which were utilized as landing platforms by the natives. The fibrous veins of the leaves made natural walkways, although boardwalks were also constructed from a white wood shot through with whorls of purple and green. Sesid's waters were home to schools of tropical fish, while birds wheeled in the sky."}, {"tag": "p", "text": "The native Draedans were a species of humanoids with silvery green skin, red eyes, and sharp teeth and claws. The resistance leader and pirate Aurelant believed that no self-respecting Draedan was a friend of the Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Most of the islands of Sesid catered to the tourism trade, and local authorities were happy to indulge visitors as long as it meant an influx of credits. Sesid Traffic Control regulated incoming vessels, typically directing tourists to land on the huge floating leaves that served as landing platforms for islands such as the port town Thrinaka. Hundreds of species vacationed on Sesid, and multi-armed droid merchants were a common sight on the boardwalks. Wooden repulsorlift boats could be rented for large sums. Because of the threat of volcanic activity, hundreds of escape pods were maintained at the beach resorts, capable of blasting beings into space to avoid natural disaster. These tall, black cylinders were kept in clusters, and the government fined their use in non-emergencies."}, {"tag": "p", "text": "The Age of the Empire brought an end to freedom and hope on Sesid, and sparked a war with the Draedans. Imperial corporations carried out pharmaceutical research on Sesid, protected by a garrison which included stormtroopers, waveskimmers and amphibious transports."}, {"tag": "p", "text": "During preparation for the Battle of Endor, the Alliance to Restore the Republic dispatched Leia Organa and her team to several planets along the Sanctuary Pipeline, including Sesid, to seed misinformation as part of Operation Yellow Moon. Hoping to meet their contact, Aurelant, Leia's team was attacked by stormtroopers, but were picked up by the Draedan pirates—whose leader turned out to be Aurelant himself. He helped Organa and her colleagues escape, although the Empire was quick to dole out reprisals, taking many Draedans captive and tightening the Imperial presence on Sesid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Sesid first appeared in the Star Wars Legends roleplaying game supplement Galaxy Guide 12: Aliens — Enemies and Allies. It was established to be canon after it appeared in Moving Target: A Princess Leia Adventure, a 2015 junior novel written by Cecil Castellucci and Jason Fry."}, {"tag": "p", "text": "In the 2018 reference book Star Wars: The Rebel Files, Sesid is misspelled as \"Sessid\" on the page 153. The adventure book Rebel Rescues refers to Sesid as an island."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}