{"url": "Bane_Brigade", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles needing illustration", "Category:Military units and formations of the Imperial Army (Sith Empire)"], "nodes": [{"tag": "h1", "text": "Bane Brigade"}, {"tag": "p", "text": "The Bane Brigade was a military unit that served the reconstituted Sith Empire by the time of the Great Galactic War. This unit was created by Khun Tazith who was noted to had nurtured the men and women that served within the brigade during their operations against the Galactic Republic. Tazith was also involved in planning their mission assignments and the unit became an elite force within the Imperial Military and were led by Sith commanders into battle."}, {"tag": "p", "text": "Amongst their achievements saw them purge a Jedi Enclave on Genarius and set fire to the seas of Iskalon. These missions saw the Republic refer to the Bane Brigade as butchers and war criminals. Their campaigns saw the members of the Bane Brigade receive replacement limbs with Tazith sitting beside them during such moments. One of their missions saw the brigade deployed onto Rhen Var where they attacked a Jedi encampment and slaughtered its inhabitants. However, the unit lingered too long at the site which allowed the Republic Military to respond with an aerial strike that destroyed the entirety of the Bane Brigade thus defeating them. The Gran Shodarra who served in the Republic forces was noted to had witnessed the destruction of the Bane Brigade and believed that none could had survived the attack on them. Tazith was noted to had wept for the death of his men though the units men and women died as heroes to the Sith Empire."}, {"tag": "p", "text": "During the Cold War, the Sith staged an assault to seemingly capture the planet Hoth. This saw the Republic mobilize to combat the Empire in order to retain control of the planet. However, this was a ruse by the Sith Empire who intended to sap the Galactic Republic's resources on a worthless planet. To further ensure this goal, Special Advisor to the Minister of War Khun Tazith started a secret project with the aid of a Sith spacer to make it appear that the Bane Brigade was alive and operating on Hoth. The operation was noted to had been such a success that Captain Graich of the Imperial military came to believe that the Brigade still lived and would obliterate the Republic Army on Hoth."}, {"tag": "p", "text": "The ultimate goal of Tazith's plan was to bring about the arrival of the Republic's elite forces that would had been redeployed to fight the phantom Bane Brigade. These enemy forces were intended to fight the suspected Brigade's operations in Clabburn Tundra though in actuality these were cannon fodder that were expendable. Once there, the Republic attackers would had been killed when the Clabburn was brought down upon them. As such, the brutal strikes conducted by the Sith spacer succeeded in attracting their enemy's attention and their belief in the Bane Brigade's continued existence with projections of morale plummeting within the Republic forces. A intercepted Republic holocall saw General Uchang reported that the Bane Brigade was still alive though General Shodarra doubted this on the basis that he saw them die years ago. General Krepkit urged his comrades to investigate this finding as the Brigade destroyed his people's capital in the past."}, {"tag": "p", "text": "As a result, the operation was a success and the Empire determined that Republic Special Forces Division and members of the Jedi Order were dispatched as part of the elite response from the Galactic Republic. Thus, Tazith prepared for their arrival and his trap for them at Clabburn Tundra. With the Sith's mission complete, Special Advisor Tazith congratulated the Imperial spacer and stated that through them the myth of the Bane Brigade would live on."}, {"tag": "h2", "text": "Appearances"}]}