{"url": "Sev_(pirate)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unidentified species", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Sev  (pirate)"}, {"tag": "p", "text": "Sev was a male pirate who served aboard the pirate freighter Jynni's Virtue, captained by Naz Felyood. While trying to escape an Imperial patrol six months before the Battle of Yavin, the freighter crashed on the surface of the planet Korriban. After the crash, Sev was killed by Korriban zombies and was reanimated as a zombie that returned to attack the Jynni's Virtue's crew. However, during the attack, Sev's zombie was shot by the ship's First Mate, Babbnod Luroon."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 1 BBY, Sev was a male pirate who worked for the Corellian pirate captain Naz Felyood on the freighter Jynni's Virtue. Six months before the Battle of Yavin, the Jynni's Virtue was attacked over the Sith tombworld of Korriban by Imperial patrol ships equipped with cloaking shields. The Jynni's Virtue crashed on the surface of Korriban near the planet's equator, causing Sev—along with everyone else aboard—to be stranded in the Valley of Golg near a Sith tomb. While exploring the planet, Naz Felyood discovered the tomb and was possessed by the spirit of the deceased Sith King Dathka Graush, an act which caused his undead army of Korriban zombies to awaken. Some time after the zombies were unleashed, Sev was bitten by one, and he was infected with a plague that was transmitted through the zombie's bite. Sev died from the zombie attack, but the plague later reanimated his body."}, {"tag": "p", "text": "Three days after Felyood was possessed by Graush, the zombies of Sev and several other beings attacked the Jynni's Virtue. Even though he was missing part of his face and one of his arms, the reanimated zombie of Sev, along with many others, attacked the Jynni's Virtue. During the skirmish, the zombies of Sev and Derec, another pirate-turned-zombie, assaulted Babbnod Luroon, Felyood's First Mate. However, when the zombie that was once Sev attacked her with a rusty sword, Luroon killed him and Derec with a blaster. Naz Felyood later recorded Sev's death on a piece of seven-thousand-year-old parchment when he wrote about the incident while stranded on Korriban."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sev's species had a face and at least two arms. By 1 BBY, he had turned to piracy and served under captain Naz Felyood. When he was reanimated as a zombie, he was missing one of his arms, and part of his face was gone. As a zombie, Sev was armed with a rusty sword."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sev was a minor character mentioned in \"Korriban: Planet of Lost Souls\", which was written by Cory J. Herndon as part of the Planet Hoppers series of articles on the Wizards of the Coast website. He was only mentioned after he was killed by Korriban zombies, when he returned as a zombie to attack the remaining members of the Jynni's Virtue's crew, and on the captain's parchment."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}