{"url": "Sev%27rance_Tann", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Chiss", "Category:Dark Acolytes", "Category:Females", "Category:Separatist admirals and generals"], "nodes": [{"tag": "h1", "text": "Sev'rance Tann"}, {"tag": "p", "text": "Sev'rance Tann was a Chiss female who left Chiss Space to become a Dark Acolyte and general as Supreme Commander in the Confederacy military during the Clone Wars. Hailing from Csilla in the Unknown Regions, she became one of few Chiss to leave her people during her time, along with her lover Vandalor, both becoming agents of Count Dooku and the Confederacy of Independent Systems (CIS) shortly before the outbreak of the Clone Wars in 22 BBY. Dooku taught Tann the use of the dark side of the Force, and she became one of his most trusted underlings. When the war broke out, Tann fought at Geonosis and later commandeered the Kaer Orbital Platform for Separatist use. When Dooku learned of the new Republic technology known as the Decimator, Tann was ordered to locate the weapons and steal them for the CIS to use."}, {"tag": "p", "text": "After winning battles on Tatooine, Eredenn, and Alaris Prime, Tann stole the Decimators from the Republic and prepared them for Separatist use. She then launched an ambitious attack on Sarapin, on Dooku's orders, capturing one of the most heavily fortified planets in the galaxy and leaving many Core Worlds in darkness as a result, having destroyed the planet's geothermal generators. Tann was then sent to oversee Decimator construction on Krant, but was pursued by Jedi Master Echuu Shen-Jon, whose Padawan Tann had killed at Geonosis. After Shen-Jon destroyed the Decimator-producing foundries, Tann kidnapped his new Padawan, Naat Reath, and fled. Later, in a final confrontation in a CIS stronghold in the heart of the Krantian forest, Shen-Jon killed Tann. Although Tann had been a successful commander, her service in the Clone Wars lasted just a standard month."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Sev'rance Tann was a Chiss female born on the planet Csilla during the waning days of the Galactic Republic. She was one of very few Force-sensitive Chiss on record, with an uncanny ability to predict her enemy's movements. Tann attended the Chiss Academy, studying military strategy and tactics. One of Tann's professors once challenged her with training a group of Yresilini, considered an untrainable species into a cohesive, organized army. She started by choosing one of the creatures to be her \"general,\" and teaching him a number of simple commands. Her general and his comrades laughed at her efforts; in response, Tann had him executed on the spot, with his would-be troops present, and appointed a second general, who was taught same rudimentary commands. The successor was far more co-operative than the first, leading the troops to follow her orders implicitly, for which Tann received high marks. The story of her taming of the Yresilini was later repeated by troops under her command. Tann became a talented military tactician, with a large repertoire of strategic and tactical knowledge and an innovative mind, which some believed was furthered by her ability to use the Force."}, {"tag": "p", "text": "Tann eventually became one of few Chiss to leave Chiss Space, along with her lover, Vandalor, brought to Republic space by Darth Sidious, Dark Lord of the Sith. Historians of a later era speculated that Thrawn, an officer in the Chiss Expansionary Defense Force who was in contact with Sidious, had alerted the Dark Lord to Tann and Vandalor's existence. Historians were unsure whether it was an attempt to remove Tann from a dangerous situation on Csilla or merely to provide Sidious with a tactician he could have confidence in. Tann became a Dark Acolyte of Count Dooku, Sidious' Sith apprentice, studying the dark side of the Force under him and learning how to wield a lightsaber. She quickly won the trust of her master and several other prominent Separatist leaders with many successes in missions, becoming a general in the Confederacy and the leader of Dooku's Dark Acolytes."}, {"tag": "h3", "text": "The war begins"}, {"tag": "p", "text": "Tann had joined Dooku during a period known as the Separatist Crisis, and the count was preparing to wage war on the Republic. In 22 BBY, he contacted Tann, informing her that he was en route to the planet Geonosis in the Outer Rim Territories to secure the support of the final constituents of the Confederacy. However, Dooku had foreseen a battle taking place on the planet, and wanted to take the necessary precautions; he ordered Tann to travel to Geonosis and be ready to secure his escape should Dooku need to flee the impending battle. As the count had predicted, a battle did occur, with the Jedi and their newly formed Grand Army of the Republic clashing with Dooku's droid armies, beginning the Clone Wars. Dooku fled the initial battleground, the Geonosians' Petranaki arena, and was making his way to his swoop bike, which would take him to his ship, located in a hangar some distance away from the arena. To reach his swoop, Dooku had to travel through a narrow valley, wherein skirmishes were taking place between small groups of CIS and Republic forces. Tann, along with a number of B2 super battle droids, made her way through the canyon, leading her forces and defeating the few pockets of clone troopers present. As she went, Tann ordered the remaining CIS forces which had been fighting to join her group."}, {"tag": "p", "text": "Resistance was light, consisting mostly of clone troopers and several Clone Personal Walkers, which Tann and her droids were able to dispatch with ease. Tann eventually came upon a number of CIS OG-9 homing spider droids defending themselves against Republic All Terrain Tactical Enforcers, but again these posed no problems to Tann and her burgeoning forces, and she also slew a Jedi Padawan. Eventually, with the valley entirely cleared of any Republic threats, Dooku passed through, congratulating Tann on her success. However, the count had been pursued by a number of Jedi, including Plo Koon, Ki-Adi-Mundi, Echuu Shen-Jon, and Shen-Jon's Padawan, Stam Reath. Dooku fled, and all the Jedi bar Reath went to try and intercept him; the young Reath approached Tann, demanding that she drop her weapon. Amused, Tann stabbed Reath with her lightsaber, mocking his master and escaping before the Jedi could attack her. Dooku, too, was able to flee Geonosis, returning to Coruscant, and he contacted Tann, informing her that the CIS needed to strike back at the Republic quickly, and that he had a special task for her."}, {"tag": "p", "text": "Dooku wanted Tann to oversee the Geonosian production of a new army for her to take command of and strike at the Republic with. He chose the Kaer Orbital Platform in the Outer Rim as the base of operations for the army's construction; an old InterGalactic Banking Clan manufacturing plant which had long since been abandoned, it contained many large stockpiles of raw resources which had been abandoned by the Banking Clan after interference from the Hutt Cartel. It also housed a number of deactivated production centers which Dooku ordered Tann to capture. The Chiss general would remain at Kaer until she and her Geonosian workers had amassed a formidable army. Tann established a temporary base there, hoping to finish her task as quickly as possible; time was of the essence, as it was only a matter of time until the Republic discovered her presence there and tried to purge her."}, {"tag": "p", "text": "After capturing the abandoned production centers, the Geonosians built a large force of dwarf spider droids and homing spider droids. However, Dooku contacted Tann to inform her that the Jedi had learned of her presence on the orbital platform, and Tann's scouts discovered a Republic base on the station, as well as a grounded Acclamator-class assault ship. The Republic forces were led by Jedi General Jor Drakas, and Tann opted not to fight, but to take her fresh army and leave the station immediately. She departed, and was again congratulated by Dooku for her success; he was ready to move into the next phase of his plan."}, {"tag": "h3", "text": "Secret project"}, {"tag": "p", "text": "Tann was sent to the remote world of Tatooine in the Outer Rim along with her newly retrofitted army. Boorka the Hutt, a powerful member of the Hutt Cartel that controlled the world, reportedly had top-secret information about a Republic project in development, and Dooku wanted to get his hands on the info as quickly as he could. Boorka was willing to sell to the highest bidder, and Tann was charged with persuading him to deal with the CIS. Time was short, so Dooku cleared her to meet any of Boorka's demands in exchange for the information—they would not necessarily honor their agreements. As Tann set down on Tatooine with her droids, Dooku contacted her with a last piece of advice, informing the Chiss general that Hutts were impervious to Jedi mind tricks and that she should tread lightly when dealing with them."}, {"tag": "p", "text": "Tann and her forces had to travel from their landing site to Boorka's palace near Mos Osnoe, and as they went she was forced to cut down a number of Boorka's henchmen, who were attacking. They finally reached the Hutt's palace, and he was impressed with her for having succeeded against the soldiers. He informed Tann that the Republic—wanting to get in on the lucrative Outer Rim trading in order to help fund the Clone Wars—had built a heavily fortified spaceport just outside of Mos Osnoe, which disrupted his own criminal activities. Boorka agreed to hand over all the information he possessed about the Republic project if Tann and her forces destroyed the spaceport. Knowing that the spaceport was well-defended, Tann opted to build a temporary base on Tatooine; she ordered a detachment of droids to raid a local camp of Jawa scavengers and steal a number of droids that could help them build the camp. Her battle droids did as instructed, destroying the Jawas' sandcrawler and retrieving numerous droids which helped them construct a base camp."}, {"tag": "p", "text": "After preparing her forces, Tann launched an attack on the Republic trading outpost and spaceport. The Republic defended it with clone troopers, Jedi, and even a number of locals in an attempt to repel Tann's attack, but she proved too strong for them, and was able to destroy the spaceport in what was her first real taste of combat under Dooku. Boorka was delighted, and, as agreed, provided her with the information, which she sent straight to Dooku. The Republic was developing a type of weapon, known simply as Decimators, at a secret testing facility on remote, inhospitable Eredenn Prime. Because the planet was so far from any potential Republic reinforcements, Dooku sent Tann and her forces there immediately to investigate further. She was ordered to scour the planet and capture any Decimators, ensuring none were destroyed—Dooku wanted to preserve the possibility of the CIS using them against the Republic—and discover where they were being manufactured before being transferred for testing to Eredenn."}, {"tag": "p", "text": "Tann's scouts soon located the first small Decimator construction facility, capturing it but ensuring no damage came to the Decimators themselves. The Separatist analysts present were unable to decipher the operational codes, so the Decimators were unusable. Tann contacted Dooku to inform him of this; he told her to carry on with her mission as before, and that the codes could likely be found by hacking into the databases of the Republic's control centers. Tann located the second Decimator site, before finally finding the third, larger base, wherein the control center was located, in the mountains to the north. Tann penetrated the Republic's meager defenses and ultimately captured the base. They found a protocol droid in whose memory banks the Decimators' operational codes were stored, but they were heavily encrypted, and Tann's analysts could not use them. However, they did learn from the droid that the Decimators were being manufactured by the Wookiees on their colony world, Alaris Prime. Tann had the droid and the Decimators put onto her transports, and she departed for Alaris Prime."}, {"tag": "h3", "text": "Into the Core Worlds"}, {"tag": "p", "text": "Tann took the droid and the captured Decimators with her to Alaris Prime, along with a small force of battle droids. They set down on a small island in a lake, which was surrounded by five Wookiee colonies, though did so stealthily enough to not be noticed. The Wookiees had established a long-range communication tower, defended by clone troopers; Tann was advised to disable it, to ensure no Republic reinforcements would arrive. Her forces destroyed the communication tower, and scouts later discovered the Decimator facilities, guarded by Republic forces, to the east. After the Republic's defenses were terminated, Tann escorted the droid to the facility, where the Separatists were able to decrypt the codes contained within the droid's memory. The ability to unlock the Decimators now in her power, she had the construction facilities destroyed, and departed Alaris Prime. With his new weapon, Dooku was ready to attack the Republic where they least expected it."}, {"tag": "p", "text": "Dooku's target was the volcanic, inhospitable world of Sarapin, located in the Core Worlds. Sarapin generated enough geothermal energy to provide the Core Worlds with 80% of their power, making it an important Republic planet. Protected by a fortified defensive grid and a strong shield, whose energy was relayed from the system's asteroid field, it was one of the most heavily defended planets in the galaxy, and attacking it was an ambitious move for Dooku. Tann assembled an elite task force, consisting of many Confederacy Cruisers, strong ships that could help the Separatist forces navigate the asteroid fields, Geonosian Nantex-class starfighters, and transports laden with ground troops and Geonosian construction workers, as well as Tann's personal starfighter. Tann was ordered to destroy the power relay on Asteroid 426, which would collapse Sarapin's shield and leave it vulnerable to further attacks. The asteroid was heavily guarded, though; the surrounding, smaller asteroids were littered with heavy turrets, and there were Republic ground forces—consisting of clone infantry, Jedi, and vehicles—as well as starfighters posted on Asteroid 426, guarding the power relay. However, there was also a supply depot containing enough resources for Tann and her task force to construct a base on the asteroid."}, {"tag": "p", "text": "Tann's task force made it to Asteroid 426, destroying or avoiding all the turrets in their path. Her droids destroyed the Republic supply depots on the near side of the asteroid, allowing the Geonosian workers to harvest the stockpiled resources stored there by the Republic. Tann had a base constructed, building up her forces and defending the base from occasional strikes by small groups of Republic forces, sent from the other side of the asteroid, where the power relay was located. Eventually, when she deemed her forces sufficient to overwhelm the Republic presence on the asteroid, Tann launched an attack at the power relay, though unlike in previous campaigns, she did not lead from the front with the infantry, opting to pilot her starfighter instead. The CIS triumphed over the Republic in the battle, destroying the power relay and taking with it Sarapin's shields, leaving the vital world ripe for attack. Dooku contacted Tann, congratulating her on her success, and ordering to her to gain a foothold on Sarapin, using as much force as she could bring to bear."}, {"tag": "p", "text": "Tann brought all the forces at her disposal to Sarapin's surface, including the stolen Decimators. However, while the planet was relatively undefended and there for the taking, its volatile nature threatened to make Tann's efforts all the more arduous. Dangerous, unpredictable lava flows and harsh conditions, as well as native predators, were all obstacles to be overcome if Tann was to be successful in her mission. The main energy repositories—which Tann sought to capture—were located atop Mount Corvast, a large volcano, alongside the massive Mount Corvast Citadel. Corvast was well-defended, though, with a thick web of Republic forces surrounding it and four major Republic military installations located between Tann's position and the volcano. Tann and Dooku knew that the Republic forces, on full alert having just suddenly lost contact with their primary defense grid, would put up a stern resistance, but they believed that, with the Decimators giving them a marked advantage, they would triumph over their opposition."}, {"tag": "h3", "text": "Battles on Sarapin"}, {"tag": "p", "text": "Tann built a base near to where she landed on Sarapin, and began preparing for her impending strike on the Republic. Mount Corvast's defenses were primarily geared towards repelling attacks from the air, with many anti-air units, so Tann opted to build up her ground forces instead. As well as destroying the Mount Corvast Citadel, Tann was to destroy all drill platforms between her base and Mount Corvast, further disrupting the Republic, though she was to take precautions to ensure that the planet's collection repositories remained intact, so that the Confederacy could make use of them after they had fully captured the planet."}, {"tag": "p", "text": "Having prepared her forces, Tann sent her battle droids to attack the first Republic military installation. To reach it, they had to make a perilous journey on narrow walkways, surrounded by lava, tussling with native vaapads. Additionally, lava blowholes dotted the area; magma contained within deep fissures spitted out frequently, destroying anything that was standing over the blowhole. Traveling over the walkways and blowholes via air transports was ruled out because of the Republic anti-air units. The Separatists eventually arrived at the first Republic installation, protected by a number of AT-TEs, infantry, and IG-series assassin droids, but Tann's forces were able to overcome them, with the advantage given to them by the Decimators. The second Republic camp was larger and more spread out, but aside from turrets, was relatively undefended, and Tann's forces again razed it. As they moved, they destroyed the Republic energy drills. The third and fourth Republic camps were lightly armed and posed no problem for Tann."}, {"tag": "p", "text": "Tann and her forces then clashed with the Republic defenses posted on the slopes of Mount Corvast, which consisted of further AT-TEs and mounted clone troopers. Using the stolen Decimators, the Separatists overcame these defenses as well as reinforcements sent from within the walled Republic base which contained the Mount Corvast Citadel. Tann's forces entered the base, routing the remaining Republic forces. When the Separatists began getting close to the citadel, reinforcements under the command of Jedi Knight Jor Drakas attacked Tann. She was able to defeat them, slaying Drakas personally and ending the Republic's defense of the planet. Sarapin was in Separatist hands, its collection repositories ready for Separatist use; the Mount Corvast Citadel was destroyed, as was Sarapin's geothermal generators, vaporized by the Decimators. Dozens of Core Worlds plunged into darkness. Coruscant was among those worlds, with some regions of the galactic capital losing power; panic began to take hold in the Core Worlds, and the Senate was in uproar."}, {"tag": "p", "text": "Dooku was pleased with Tann's efforts, and she had once again surpassed his every expectation. Because of her success, she became one of his most valuable assets, and held more sway than any other Separatist general, even the cyborg Jedi killer Grievous. In the wake of her success at Sarapin, Dooku contacted Tann to inform her that she would be traveling to the planet Krant, where the CIS had begun manufacturing their own Decimators using the Republic's designs. She would oversee operations there, in preparation for her next assignment from Dooku, while Zian Finnis was placed in charge of Separatist operations on Sarapin. Tann traveled to Krant, establishing a base there. The maze-like base was heavily defended and located in the midst of an expansive jungle, though Tann's efforts were occasionally disrupted by native Wookiee colonists. The Trade Federation, part of the CIS, had an illegal mining operation located on one of Krant's moons, Aereen, led by the Neimoidian Plure Barron, which Tann used to provide her operations on Krant with power."}, {"tag": "h3", "text": "Republic counterattack"}, {"tag": "p", "text": "The Republic counterattack on Sarapin was swift. Echuu Shen-Jon, whose Padawan, Stam Reath, Tann had killed at Geonosis, was tasked by the Jedi High Council with retaking the planet, along with his new Padawan, Naat Reath, Stam's sister. Both wanted vengeance for Stam's death, and together they were able to retake Sarapin with a large force of clones, capturing Zian Finnis. The Council had decided that Tann was a threat that needed to be stopped as quickly as possible, so Shen-Jon and Reath were put on her trail, and they were led to Krant by Jabba Desilijic Tiure on Tatooine, a rival of Boorka. Shen-Jon then captured Aereen and built a base there, to prepare for a Republic strike on Krant. While on Aereen, he learned that Tann would be inspecting Decimators at one part of the CIS facility, and decided to assassinate her."}, {"tag": "p", "text": "Shen-Jon took a task force to Krant's surface in preparation for his attack on Tann. He attacked, with help from the remaining Wookiees who had not fled offworld, defeating the CIS forces and battling his way through the compound. Tann remained in her ship for the battle, waiting for the inevitable confrontation with Shen-Jon. The Republic forces were able to destroy the remaining Decimators and construction facilities, which saw a permanent end to the weapons, before Shen-Jon and Reath came searching for Tann. They quickly found her ship; she emerged from it, engaging the two Jedi in lightsaber combat, with no other beings present. After a brief duel, Tann managed to subdue Reath and kidnap her, taking her aboard Tann's ship and fleeing deeper into the Krantian forests."}, {"tag": "p", "text": "Tann took Reath to the heavily fortified Separatist fortress, located in the heart of the Krantian forest. She had the Padawan placed in stasis, and awaited Shen-Jon's arrival. The Jedi Master pursued them, eventually penetrating the Separatist defenses and attacking the stronghold. When his forces began to get close to Tann's location, she told Shen-Jon to approach her alone, threatening to end Reath's life if he brought any additional clone forces with him. Shen-Jon did as instructed, and when he reached his Padawan in stasis, Tann revealed herself and attacked him. During his search for Tann, Shen-Jon had unwittingly turned to the dark side of the Force in his lust for vengeance over Stam Reath's death by Tann's hands, and the Chiss general could feel the dark side radiating from him. She mocked him, asking if he would like to take her place at Dooku's side, and see the end of the Republic and Jedi as the count planned."}, {"tag": "p", "text": "Tann and Shen-Jon engaged each other in combat once again, with Reath watching, helpless and unable to move in the stasis chamber. Calling on the power of the dark side, Shen-Jon cut Tann in half with one swift sweep of his lightsaber. With her dying words, she told him that the Jedi would ultimately be wiped out in this war. Shen-Jon, acknowledging his fall to the dark side, decided to flee into the Krantian wilderness and become a hermit, while Reath returned to Coruscant to report Tann's death to the council."}, {"tag": "p", "text": "Tann's demise was a setback for Dooku, who had planned to use her further against the Republic. Having lasted just a month in the Clone Wars, she was replaced as the Confederacy's top general by Grievous, who became the Supreme Commander of the Droid Armies. Fallen Jedi Master Sora Bulq replaced her as the leader of Dooku's Dark Acolytes. The Republic Senate subsequently put a stop to the Decimator project. Her lover, Vandalor, worked for Dooku against the Republic after Tann's death, until he was killed by the Jedi Anakin Skywalker while fighting for the Confederacy on Metalorn, and the CIS ultimately lost the war. Being one of the few Chiss to ever leave Chiss Space, Tann was a figure of great interest to historians and sentientologists of later eras, who speculated on how she came to leave her people."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sev'rance Tann was confident in her abilities. She had every belief that she would be able to carry out any tasks Dooku asked of her; when ordered to capture Sarapin, she boasted that she could have it under control within a single day. She thought little of the threat posed by Jedi Knight Jor Drakas, defeating him in combat, and had enough faith in her abilities to fight against Echuu Shen-Jon and his Padawan without any backup. This ultimately led to her demise, as Shen-Jon killed her."}, {"tag": "p", "text": "Tann was known to mock her enemies, and she respected neither her adversaries nor their abilities. After killing Stam Reath during the Battle of Geonosis, she mocked his master, and during her final duel with Shen-Jon, she ridiculed him numerous times, contemptuously asking if he had any more Padawans she could take away from him and if he wanted to take her place as a Dark Acolyte. Tann was persuasive, able to persuade other Separatist forces not under her command to join her group during the Battle of Geonosis, and she expected she could manage to influence Boorka the Hutt to trade with the CIS. Tann was ruthless; during her time in the Chiss Academy, having been tasked with a difficult assignment, she killed one of the wild Yresilini creatures she had been told to tame despite his having done nothing wrong. Her actions were supposed to engender obedience among his comrades, making them fearful that they too would meet the same fate if they disobeyed her. They followed Tann's orders to a tee, never questioning them."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Sev'rance Tann was known for her knowledge of military strategy and military tactics, and she successfully commanded numerous battles during the Clone Wars. She also actively participated in combat during her battles, unlike other Separatist generals, wielding her lightsaber alongside the Separatist infantry. Tann was also Force-sensitive and trained in the ways of the dark side by Count Dooku. She fought with a yellow-bladed lightsaber, defeating at least two Jedi with it during the Clone Wars. Unlike some of her fellow Dark Acolytes, she could conjure up Force lightning, which she used on many of her missions. Ultimately, Tann was more at home as a general than a Dark Acolyte. No one was able to outfox her tactically in the Clone Wars before her death, but she was ultimately defeated in lightsaber combat by Master Echuu Shen-Jon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Sev'rance Tann was created for Clone Campaigns, an expansion pack for the computer game Star Wars: Galactic Battlegrounds. Voiced by Paula Killen, Tann is a playable hero in the game as part of the Confederacy campaign, and subsequently acts as a villain in the Republic campaign, in which she is killed. The character also receives a biography in the in-game DataBank, which details her backstory. Tann has since been referenced in The Official Star Wars Fact File, The New Essential Chronology, The New Essential Guide to Alien Species, and The Complete Star Wars Encyclopedia. The New Essential Chronology, by Daniel Wallace, presented an alternate capitalization of her name: in Clone Campaigns, The Official Star Wars Fact File and The Complete Star Wars Encyclopedia, it is \"Sev'Rance,\" but Wallace spells it \"Sev'rance,\" and this has been repeated in subsequent sources. The New Essential Guide to Characters connected her with another video-game character of the Chiss species, Vandalor, who appears as an antagonist in Star Wars: The New Droid Army."}, {"tag": "p", "text": "Tann is established to be the leader of the Separatist Droid Army in Clone Campaigns, with the New Essential Chronology reinforcing that. Because of this, some fans believe she held the title of Supreme Commander, later given to General Grievous, which was not held by Grievous until the Mission to Trenchant space station, after Tann's death. Abel G. Peña, author of Unknown Soldier: The Story of General Grievous, has stated that Tann would be the prime candidate to hold the title, but that it may not have existed until it was given to Grievous."}, {"tag": "p", "text": "Tann is established as a Chiss in Clone Campaigns, which somewhat contradicts other sources such as Star Wars: The Hand of Thrawn Duology, which establish that Chiss were not discovered by mainstream society until long after the Clone Wars. However, while her species and homeworld is established within the Clone Campaigns DataBank, they are not referred to in the game itself, so presumably other characters were unaware of her origins. The New Essential Guide to Alien Species, authored by Helen Keier and Ann Margaret Lewis, addressed the issue by stating that Tann and Vandalor were likely taken to the Republic on the recommendation of Thrawn, an ally of Darth Sidious. The Complete Star Wars Encyclopedia explicitly establishes that Tann was taken from Chiss Space by Sidious. However, no source has addressed the discrepancy with Tann's name and the usual Chiss naming convention, with Chiss names consisting of three distinct sections separated with apostrophes, such as \"Mitth'raw'nuruodo.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}