{"url": "Bane_Malar/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Bounty hunters", "Category:Humanoids", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bane Malar"}, {"tag": "p", "text": "Bane Malar was a telepathic male bounty hunter in the employ of the Galactic Empire. He was hired to track down and apprehend inmates who escaped from the Spice Mines of Kessel. Malar was quite good at his job, and soon enough mere mention of his name struck fear into the hearts of the inmates. While on Kessel, Malar developed an addiction to glitterstim. Though it enhanced his telepathic abilities, it also made him increasingly paranoid."}, {"tag": "p", "text": "Malar also accepted jobs from other entities while on Kessel, such as Jabba Desilijic Tiure, Black Sun and the Meatlumps. In 4 ABY, Black Sun hired him to assassinate Jabba, and he accepted, making his way to Tatooine. Once at Jabba's Palace, where he had an open invitation, he telepathically encountered the Jedi Luke Skywalker. The encounter scared Malar, and he departed Tatooine, ruining the operation. In the hopes of staving off any trouble from Black Sun, he tried to liberate one of their agents from the Spice Mines but failed in the attempt, earning himself a death mark."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Kessel operative"}, {"tag": "p", "text": "A male bounty hunter, Bane Malar was hired by the Galactic Empire to monitor and track down escaping prisoners from the Spice Mines of Kessel. Many political dissidents who had violated the Empire's ban on subversive music were likely among the prisoners. He armed himself with a Noslo-19 slug rifle from Czerka Arms and donned a black enviro-suit that gave him an advantage in Kessel's thin atmosphere. In addition to his equipment, he was naturally telepathic, giving him another advantage over his quarry. Malar took on the task of tracking escaped inmates across Kessel's surface and was usually able to return them. In time, he was greatly feared by those working in the Spice Mines, and those he returned to confinement were usually haunted by the memory of him for a considerable amount of time afterward."}, {"tag": "p", "text": "Malar enhanced his abilities with glitterstim spice from Kessel's mines. The spice allowed him to actually touch the minds of those he targeted, affecting them, and making him an even more effective hunter. Malar became heavily addicted to the glitterstim, to the point where he had to outfit his suit with inhalers, allowing him to enjoy regular doses of the spice. Although his skills continued to be above par, Malar became increasingly paranoid. He began to take contracts from other employers while on Kessel—if someone the Hutt crime lords wanted dead was working in the spice mines, Malar made sure they were killed while trying to escape. To enhance his capacity to track down his quarry, Malar was known to pay fellow bounty hunter Tutti Snibit for his valued intel. He also made a profit by selling materials to the troops stationed on the planet."}, {"tag": "h3", "text": "Corellia and Tatooine"}, {"tag": "p", "text": "At some point Malar was hired by the Meatlumps gang from Corellia to take care of a group of rogue droids. Malar decided that he needed a partner for the job, so he contacted a spacer and arranged a meeting with the individual at a local cantina. There, he explained the situation to his temporary partner: a lone DLC-13 mining droid had gone rogue and managed to reprogram a large number of other droids to serve his purposes. The only way to remove the droids from the Meatlumps' hideout was to destroy them all. After a few days of preparations, Malar and the spacer went down into the Meatlumps' hideout, where they were attacked by dozens of droids, as ordered by the lava collector. Malar fought like a possessed man, utilizing his slug rifle with great efficiency. In the close quarters of the Meatlump basement, the droids were furious adversaries. All of the droids, including DLC-13, were eventually defeated. At another point, Malar came to confront a Sullustan, on whom he employed telekinesis as a disarming tactic."}, {"tag": "p", "text": "Although he rarely left Kessel, Malar had an open invitation to the palace of Jabba Desilijic Tiure, one of the Hutt crime lords, on Tatooine. He was later offered a considerable sum by the Black Sun crime syndicate to assassinate Jabba in 4 ABY, and, seeing it as a way to obtain more money for spice, Malar accepted the task. Traveling to the Hutt's palace, the bounty hunter planned to kill Jabba by placing some tainted spice in the crime lord's hookah pipe."}, {"tag": "p", "text": "On arrival, Malar telepathically connected with the Jedi Luke Skywalker and was given reason to believe that Skywalker would somehow cause Malar's own death. Panicking, the bounty hunter fled Tatooine and returned to Kessel. In order to placate Black Sun, he attempted to help one of their agents escape from Imperial custody but failed in the attempt. Left with no other choice, Malar was forced to depart from Kessel, the source of his glitterstim, only now with a death mark on his head."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Despite proficiency in his craft, Malar became highly unstable when addicted to glitterstim, and it affected his ability to operate as a bounty hunter. Nevertheless, he was universally feared by prisoners due to his telepathic abilities. Malar's addiction evolved to such a stage that he was reluctant to leave Kessel, and his only loves became money and glitterstim. While working for the Meatlumps on Corellia, Malar's paranoia was apparent—even in breathable atmosphere, Malar kept his enviro-suit on to shroud his identity, as he believed that there were many who wanted to kill him. When going up against rogue droids, Malar became overly worried that they would be hard to combat, as he had no way of reading their minds. He later fought like a possessed man against the droids occupying the Meatlump basement."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "With his telepathic abilities, Malar invaded the minds of his quarry, leaving them mentally scarred long after their encounter with him. His addiction to glitterstim only enhanced his capabilities. When meeting with others, Malar was able to use his powers to divine just what their questions would be, allowing him to truncate conversations. Malar was also able to use telekinesis to disarm opponents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although the Databank stated that Bane Malar appears in Star Wars: Episode VI Return of the Jedi, he does not actually appear in the finished film. Bane Malar was first brought into canon with the \"Jabba's Palace Limited\" set of Decipher's Star Wars Customizable Card Game. Malar was originally intended to appear in Return of the Jedi as a Human skiff guard, but his backstory was changed when Edward M. Erdelac, writing as \"caledre,\" elaborated upon his past through StarWars.com's Hyperspace feature, \"What's The Story?\". Malar was the last Star Wars element put up in the feature, before it finished in 2008. On the Jedi Council Forums, Erdelac mentioned that he had intended to identify the character as a Draethos, but the reference was cut. Bane Malar's Return of the Jedi costume included a helmet that was created from a modified motorcycle helmet."}, {"tag": "p", "text": "A Bane Malar action figure was created for Hasbro's 2008 Star Wars: The Legacy Collection series. In 2009, Malar was illustrated in the Galactic Hunters expansion of Star Wars Galaxies Trading Card Game. He was also included in the \"Destroy All Droids\" promotional scenario, in which the character exhibits traits outlined in Erdelac's original Databank entry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}