{"url": "Sev%27s_ARC_trooper", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Unidentified Advanced Recon Commandos"], "nodes": [{"tag": "h1", "text": "Sev's ARC trooper"}, {"tag": "p", "text": "During the Clone Wars, an ARC trooper served under the command of the Weequay Jedi General Sev. In the war's final year, the clone trooper accompanied Master Sev and his Padawan Joc Sah to the Outer Rim world Ragmar V, which was considered a vital staging planet for a planned Republic attack on a Separatist base. After Sev dispatched Sah to the planet's surface in order to secure a base for the Republic, the ARC trooper was commanded by Supreme Chancellor Palpatine to execute Order 66, a directive that branded all Jedi Knights as traitors to the Republic. The commando and the other soldiers immediately killed Sev, traveled down to the planet's surface, and attacked the village where Sah and the outcasts with whom he had formed an alliance were based."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A clone of the Mandalorian bounty hunter Jango Fett, this clone trooper was bred on the world of Kamino. An Advanced Recon Commandos, he was trained to serve on behalf of the Galactic Republic. When the Clone Wars were initiated in 22 BBY, the ARC trooper served in the Grand Army of the Republic and was eventually placed under the command of the Jedi General Sev."}, {"tag": "p", "text": "In 19 BBY, the war's final year, the ARC trooper traveled with Sev and his Padawan, Joc Sah, to the Outer Rim world Ragmar V, which the Republic viewed as an essential staging planet that was necessary for a planned assault on a Confederate base. The clone remained aboard Sev's Venator-class Star Destroyer as the Jedi Master dispatched Sah and a squad of soldiers to the planet's surface in order to secure a base for the Republic. Shortly after Sev's and Sah's conversation, the commando was contacted by Supreme Chancellor Palpatine, who instructed him to execute Order 66—an order which labeled the Jedi Knights as traitors to the Republic—and to thus kill Sev. The ARC trooper and the other clones on the Star Destroyer's bridge attacked Sev and slew the Weequay Jedi Master. After Sev's demise, the ARC trooper went with a detachment of clones to the planet's surface and attacked the village where Sah and the settlement's leader, Gaan, were located. The Jedi and the village leader ultimately survived the battle and proceeded to stage a number of hit-and-run attacks against the ARC trooper's forces."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As an ARC trooper, the man was personally trained by Jango Fett and possessed the Mandalorian's ruthlessness and efficiency. He was trained to be self-sufficient, although he was not entirely independent. Like most clone troopers, the commando was bred to be utterly loyal to the Republic and to follow his orders from superior officers. The clone's loyalty to the Republic prompted him to execute Order 66 without hesitation, succeeding in eliminating Sev; the ARC trooper also made it a point to personally lead a detachment of soldiers in order to eliminate Joc Sah."}, {"tag": "p", "text": "The ARC trooper wore a set of Phase I class armor adorned in yellow which was also worn with a blast dampening kama and rank-signifying pauldron. He used an E-11 blaster rifle during combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The ARC trooper was introduced in the short story The Order of Outcasts, which was one of four comics compiled in the fifth volume of the Star Wars: Clone Wars Adventures trade paperbacks. The character was created by Matt Jacobs and drawn by Matthew and Shawn Fillbach. In 2008, Hasbro created an action figure of both the ARC trooper and Sev as part of the second wave of the Order 66 part of its 30th Anniversary Collection."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}