{"url": "Setor/Legends", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Colonies planets", "Category:Northern Dependencies planets"], "nodes": [{"tag": "h1", "text": "Setor"}, {"tag": "p", "text": "Setor was a Colonies world. A group of colonists were persecuted on, and then exiled from, Setor nearly a decade before the Battle of Yavin. The colonists intended to settle the Outer Rim Territories world Wetyin's Colony but changes in financial support from the Galactic Empire left them virtually abandoned. The colonists then searched for a new homeworld, and the scout Lile Gorsek eventually became convinced that the moon Yavin 4 would over time allow the Wetyin's Colony's inhabitants to rival and even surpass their original home, Setor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Setor was a world located in the Setor system, a part of the Northern Dependencies portion of the Colonies."}, {"tag": "p", "text": "It constituted a part of the Trebela sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Nearly a decade before the Battle of Yavin, a group of colonists were exiled from Setor after suffering persecution. The colonists were sent to the world Wetyin's Colony, in the Outer Rim Territories' Gordian Reach, with bulk freighters filled with grain seed and embryos of the nerf creatures. The Galactic Empire also granted the Setor exiles title to all agriculturally-promising uninhabited worlds of the Gordian Reach; however, the change in the budgets of the Imperial ministries then left the colonists virtually abandoned on Wetyin's Colony."}, {"tag": "p", "text": "Eventually, scouts from Wetyin's Colony searched for a new homeworld for their people. When the scout Lile Gorsek sent a report on an initial flyover of the jungle moon Yavin 4 to Commander Deffan of Wetyin's Colony, the former expressed confidence that that celestial body would eventually allow the colonists to rival and even eclipse Setor itself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Setor was first mentioned in the 1989 sourcebook Galaxy Guide 2: Yavin and Bespin, which was published for use with West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed Setor in grid square L-8."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}