{"url": "Seyyerin_Itoklo", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Etti", "Category:Jedi Knights of the New Jedi Order", "Category:Males", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Seyyerin Itoklo"}, {"tag": "p", "text": "Seyyerin Itoklo was a Force-sensitive Etti male from the planet Etti IV who trained as a Jedi in Luke Skywalker's New Jedi Order. In 25 ABY, the galaxy was invaded by the extra-galactic Yuuzhan Vong, who targeted Skywalker's Order as a threat to their plans of conquest. Itoklo had risen to the rank of Jedi Knight by this time. Early in the second year of the war, however, the Etti was turned over to the invaders and killed, following a Yuuzhan Vong ultimatum that stipulated the surrender of the Jedi Order in return for the cessation of the invasion."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hailing from the planet Etti IV, Seyyerin Itoklo was a member of the Etti species, a pale-skinned Near-Human race known for their slender and delicate physiques. As a Force-sensitive, Itoklo trained in Jedi Master Luke Skywalker's New Jedi Order. In 25 ABY, however, the galaxy was invaded by an extra-galactic warfaring species known as the Yuuzhan Vong. Blazing a path of conquest from the Outer Rim Territories toward the Galactic Core, elements of the Yuuzhan Vong leadership saw a threat in the New Jedi Order and its members, whom the invaders perceived as the galaxy's most powerful warriors. By the second year of the Yuuzhan Vong War, Itoklo held the rank of Jedi Knight."}, {"tag": "p", "text": "After the conquest of the Core World of Duro, Yuuzhan Vong Warmaster Tsavong Lah called for the inhabitants of the galaxy to turn the members of the New Jedi Order over to him in return for the cessation of the Yuuzhan Vong advance. Following the ultimatum, several Jedi were killed in quick succession, either by the Yuuzhan Vong, Peace Brigade collaborators, or the citizens in the galaxy who took the invaders at their word. Itoklo was one of the early victims of the purge; the Etti Jedi Knight was turned over to the Yuuzhan Vong in accordance with Tsavong Lah's decree and subsequently killed. Kyp Durron, a Jedi Master who proposed that the Yuuzhan Vong should be fought with aggressive techniques, later lambasted Skywalker during a Jedi conclave on the planet Coruscant, blaming Skywalker's defensive approach to warfare as the reason why Itoklo and other Jedi had lost their lives."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Seyyerin Itoklo trained as a Jedi—individuals who spent their lives in service to others and the Force—in Luke Skywalker's New Jedi Order. He had dark hair and light skin."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "At the time of his death, Itoklo held the rank of Jedi Knight, having been deemed worthy of ascension to Knighthood by the Masters of Skywalker's Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Seyyerin Itoklo has never appeared directly in any Star Wars literature and was only mentioned in Greg Keyes' novel The New Jedi Order: Edge of Victory I: Conquest, published in April 2001. While two of the three Jedi Knights mentioned by Kyp Durron during his critique of Skywalker had been portrayed briefly in the prologue of the novel as they were killed, Itoklo's death was merely referenced, and no indication of his age, gender, rank, or species were provided."}, {"tag": "p", "text": "In Daniel Wallace's Who's Who in the New Jedi Order, an article published in Star Wars Insider 57 a little under a year later, further information on Itoklo was provided, revealing him to have been a male Etti Jedi Knight. Itoklo's entry also described him as having \"suffered the consequences\" of Tsavong Lah's decree that all Jedi were to be surrendered to the Yuuzhan Vong, indicating that Itoklo was taken by the invaders and killed. Who's Who in the New Jedi Order was illustrated by Dan Veesenmeyer and Russell Walks, and also included a drawing of Itoklo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}