{"url": "Seviss_Vaa", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Dark Lords of the Sith of the New Sith Wars", "Category:Individuals of unspecified species", "Category:Males", "Category:Members of the Brotherhood of Darkness", "Category:Sith Masters"], "nodes": [{"tag": "h1", "text": "Seviss Vaa"}, {"tag": "p", "text": "Seviss Vaa was a male Sith Lord and a powerful member of Lord Skere Kaan's Brotherhood of Darkness during the late movements of the New Sith Wars. A scholar, Vaa took particular interest in the alchemical practices of long-dead Sith Lord Naga Sadow, and dreamed of resurrecting the lost art of Sith alchemy. Vaa hoped to create a storehouse filled with the most insidious Sithspawn pulled from the recesses of the dark side of the Force. To that end, the Sith Lord began conducting a series of experiments, hoping to devise monsters with which he could battle the Jedi."}, {"tag": "p", "text": "An early experiment of Vaa's took place on the world later known as Aduba-3. Taking a local lizard, Vaa used his powers to mutate the animal, giving rise to a gargantuan creature, conditioned to go berserk at the sight of a Jedi lightsaber. The experiment was unstable, however, and Vaa had it stored in suspended animation below Aduba-3's surface for future study. The Sith Lord subsequently perished during the Ruusan campaign in 1000 BBY that also saw the deaths of the other members of the Brotherhood of Darkness. His Aduban behemoth caused a great deal of carnage a millennia later, when it wreaked havoc on the village of Onacra."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Monster mash"}, {"tag": "p", "text": "Seviss Vaa was a male Sith Lord and a member of Lord Skere Kaan's Brotherhood of Darkness during the later stages of the New Sith Wars, circa 1000 BBY. The Brotherhood was a confluence of the great Sith Lords of the time, and Vaa was considered one of the greatest of Kaan's subordinates. He was a scholar of Sith lore, and found particular interest in ancient alchemical texts authored by the long-dead Lord Naga Sadow, architect of the Great Hyperspace War and the leader of the old Sith Empire. Vaa also sojourned to the ruins of several Sith temples."}, {"tag": "p", "text": "Lord Vaa launched extensive research into the worlds of the Sith Empire. He counted over a hundred habitable worlds that had comprised the Empire, and discovered that the Sith had previously controlled the wealth of a thousand sentient species. It was his hope that under the leadership of Kaan, the Brotherhood of Darkness could reclaim the worlds of the Sith Empire, and perhaps expand beyond those borders. Vaa discovered the locations of Sith temples on various worlds, including Thule and Dromund Kaas. He shared the locations with only Lord Kaan. Vaa also explored ancient ruins on Khar Delba and its moon, Khar Shian, though he found no material objects of particular worth. Nonetheless, he found the explorations to be interesting."}, {"tag": "p", "text": "To his disappointment, Vaa discovered that many Sith worlds had been stripped of their relics. In his view, the greatest loss had been the destruction of Veeshas Tuwan, the Sith library on Arkania. Vaa felt the destruction of the Sith Empire's history alone justified Kaan's intended destruction of the Jedi, the mortal enemies of the Sith. He recorded his findings in the Telos Holocron, although he maintained a degree of secrecy as to the location of several of the temples. In addition to profiling ancient Sith worlds such as Korriban and Ziost, Vaa also outlined the worlds that the Brotherhood of Darkness was using to foster their development, such as Honoghr and Umbara."}, {"tag": "p", "text": "Vaa also hoped to revive the lost art of Sith alchemy, and planned to give rise to a storehouse of the most sinister creations, borne from the depths of the dark side of the Force. He chose the world that would later be known as Aduba-3 as one of his testing grounds. In particular, one of his earliest experiments was conducted there. He found a native lizard, and used his considerable knowledge and power to mutate it into a gargantuan dark side abomination. The experiment was inherently flawed, but was deemed a work worthy of further study by the Sith Lord."}, {"tag": "p", "text": "Vaa's monster would be driven mad by the mere presence of a lit Jedi lightsaber. As a result, the creature would target the Jedi, utilizing a specially designed organ that allowed it to fire concentrated blasts of deadly lightning from its head. Vaa's abomination, however, was unstable, and the dark side energies holding it together were in danger of losing their cohesion. Vaa's interest moved on to other projects, so he had his Aduban behemoth placed into suspended animation and inserted into a cave deep below the planet's surface."}, {"tag": "h3", "text": "Death at Ruusan and legacy"}, {"tag": "p", "text": "A short time afterward, Vaa participated in Lord Kaan's Ruusan campaign, in which the Brotherhood of Darkness engaged in protracted battle with the Jedi Lord Hoth's Army of Light. Vaa was killed in the engagement, and was therefore unable to return to his suspended experiments. The New Sith Wars came to a conclusion shortly afterward with the Seventh Battle of Ruusan, in which the Brotherhood of Darkness was annihilated."}, {"tag": "p", "text": "Centuries afterward, colonists from the Sacred Way religion settled on Aduba-3, and later still the farming village of Onacra was founded close to the cave in which Vaa had stored his behemoth. A Force-sensitive among the villagers discovered the behemoth and passed down knowledge of its existence to his heirs. The creature eventually found its way into the Onacra folklore, and it was foretold that the monster would actually defend the village from harm. By the time of the Imperial Period, knowledge of the behemoth had fallen to a Force-sensitive known as the Old One. When the village fell under attack from the marauder Serji-X Arrogantus, he summoned the beast, and it wreaked havoc. It trampled both the Old One and Arrogantus to death, effectively fulfilling the prophecy that it would in a way defend Onacra."}, {"tag": "p", "text": "The behemoth was eventually destroyed by Corellian smuggler Han Solo, who was wielding a lightsaber, to which the creature was in fact highly vulnerable—which explained why it was driven berserk by the mere appearance of the weapon. It was profiled by Alliance to Restore the Republic historian Voren Na'al two years later, who believed that Vaa's experiment resembled the earlier works of Sadow. Na'al also believed that Vaa would have marveled at the resemblance, and the fact that he had come close to replicating the legendary creations of the earlier Sith Lord. Other commentary on Vaa's work was provided by Palpatine, a Sith Lord who ruled the galaxy during the time of the behemoth's reemergence. He provided an addendum to Vaa's entry in the Telos Holocron, having discovered a great deal more at Khar Delba and Khar Shian than the earlier Sith Lord. However, Palpatine acknowledged Vaa's findings, as the discovery of the temple on Dromund Kaas was a significant find."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A scholar, Lord Vaa aspired to revive the alchemical arts that had been in vogue during the reign of Naga Sadow. Even though his experiments were later called \"wicked\" and \"abominations,\" he found them to be of considerable interest and worthy of study. He was not one to dwell on projects, however, and was pragmatic enough to have promising endeavors preserved and stored for future reference. Vaa's personality was later speculated upon by Voren Na'al, who supposed that the Sith Lord would behold his accomplishment of the Aduban behemoth with a sense of wonder and awe, had he lived to see the creature put to use against the Jedi."}, {"tag": "p", "text": "Vaa viewed himself as subordinate to Kaan, and fully believed that he could be considered a trusted servant of the Brotherhood. He held a particularly high opinion of Lord Kaan, and believed that his superior had a certain devotion and responsibility to the relics of the ancient Sith. He was also fiercely loyal to the Brotherhood of Darkness. Vaa found his work fascinating, and advised other Sith disciples to explore the same ancient Sith worlds he himself had traversed. He was particularly incensed by the actions of the Jedi, who had seen to the destruction and loss of significant portions of the Sith's history. For their transgressions, it was Vaa's hope that the Jedi would be destroyed. In spite of his passion for history and research, Vaa's work later came under criticism from another Sith Lord, Palpatine, who found that Vaa's records were incomplete and incomprehensive."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Lord Vaa was considered one of the most powerful and \"great\" members of Kaan's Brotherhood of Darkness. He demonstrated the ability to mutate creatures through the power of the dark side, and although his experiments were unstable, they possessed considerable destructive power. He was able to condition and manipulate his creations to specifically target Jedi—the sworn enemies of the Sith—and his Aduban behemoth in particular proved to be a weapon of mass destruction."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Seviss Vaa was first mentioned in the article \"The Starhoppers of Aduba-3,\" written by Pablo Hidalgo, Cory J. Herndon, and Michael Mikaelian. It was published in Star Wars Gamer 4 (2001). The character was later referenced in The New Essential Chronology (2005), and had his \"in-universe writings\" featured in Jedi vs. Sith: The Essential Guide to the Force (2007), penned by Ryder Windham."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}