{"url": "Sever_Force/Legends", "categories": ["Category:Legends articles", "Category:Alter powers", "Category:Light side powers"], "nodes": [{"tag": "h1", "text": "Sever Force"}, {"tag": "p", "text": "Sever Force was a non-lethal Force power by which a being's connection to the Force was interrupted, or blocked from them with a wall of light side energy. According to the ancient Jedi scholar Odan-Urr, severing an individual's Force connection was the most powerful attack a Jedi could perform."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "While intended to be an attack with usually irreversible consequences, severing an individual's Force connection was not always permanent. When the affected being had the Force restored to them, it returned as a painful and sudden rush of feelings, as the Force immediately allowed the individual to sense everything around them at once. This was the case with Jedi Ben Skywalker, who had his Force connection severed by his cousin and Sith Lord, Darth Caedus. Caedus had blocked his cousin's Force abilities while holding him captive in the Yuuzhan Vong torture device known as the Embrace of Pain."}, {"tag": "p", "text": "In the times of the ancient Jedi, severing Force connections was used as a means of punishment. In 3951 BBY, Jedi Masters Zez-Kai Ell, Kavar and Vrook Lamar attempted to use this power on Meetra Surik, but Kreia stopped them not by severing their own Force connections—rather draining them, which killed them in their inability to let go of the Force. Surik used the power unconsciously on herself to shield herself from the devastating effects to those who could sense the Force when the Mass Shadow Generator was activated on the surface of Malachor V, obliterating almost everyone and everything on the planet in the process. The severance was so utter, so complete that Surik created a wound in the Force in the process. She did not know this, and at first, thought the Jedi Council had severed her connection, and she believed that they had cut her off from the Force as a punishment for fighting in the Mandalorian Wars."}, {"tag": "p", "text": "When the Sith Emperor was still a child named Tenebrae, he used a dark side variant of Sever Force to strip his father Lord Dramath of both his powers and his sanity. He later used a Sith ritual to strip the Force from an entire planet, its inhabitants, and many Sith Lords, consuming their Force essence to ensure his own immortality."}, {"tag": "p", "text": "After nearly falling to the dark side, Jedi Knight Kyle Katarn also severed his connection with the Force before returning to his mercenary ways. However, after his partner Jan Ors was seemingly killed by the Dark Jedi Desann and his student Tavion, Katarn was driven by revenge and sought to reestablish his Force powers by any means necessary in order to present Desann as a worthy adversary. Kyle hastily revisited the Valley of the Jedi and restored his connection to the Force, allowing him to quickly relearn powers of both the light and dark side of the Force in a relatively short amount of time."}, {"tag": "p", "text": "During her capture by the Yuuzhan Vong, the Fosh ex-Jedi Vergere used this ability on Jacen Solo."}, {"tag": "p", "text": "In a very taxing variation of this technique usable only by those with experience in battle meditation, the Force-user could use the Force to sever a target who was heavily tainted or consumed by the dark side. This technique effectively caged the user's power within their own darkness and rendered them blind to the Force, though not dead to it. Nomi Sunrider used this technique on Ulic Qel-Droma after he killed his brother Cay on Ossus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}