{"url": "Sha_Koon", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Females", "Category:Jedi Purge victims", "Category:Kel Dor", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Sha Koon"}, {"tag": "p", "text": "Sha Koon was a Kel Dor female Jedi Knight and the niece of Jedi Master Plo Koon. Her uncle, who shared a telepathic bond with her, brought Koon from her homeworld of Dorin to the Jedi Temple on Coruscant to begin her initial training under Jedi Grand Master Yoda. Koon eventually became the Padawan of Ithorian Master Saldith. In 44 BBY, she was involved in the Stark Hyperspace War between the Galactic Republic and the Stark Commercial Combine and assisted her uncle and the Jedi High Council in bringing an end to the conflict. After rising to the rank of Jedi Knight, Koon took the Jedi Baylis Archan as her Padawan. In 19 BBY, the final year of the Clone Wars, Koon fought alongside Jedi Knight Halagad Ventor and a detachment of Republic clone troopers in a battle on the planet Bal'demnic. Later that year, Koon, Archan, and a command of troopers fought against the Separatists in a battle on Giju. During that engagement, Koon's soldiers were killed, along with her Padawan. After the battle, Koon returned to the Jedi Temple and refused to resume fighting in the war."}, {"tag": "p", "text": "Shortly after the Sith Lord Dooku's death during the Battle of Coruscant, Koon was tasked by her uncle to search the Jedi Archives for any information regarding the mysterious Sith Lord that Dooku had mentioned to be in control of the Galactic Senate. While at the Archives, Koon was targeted as part of the initial stages of Order 66, which was Supreme Chancellor Palpatine's order to the Republic's clone troopers to eliminate their Jedi Generals. She escaped the attack on the Jedi Temple, which was led by the Dark Lord of the Sith Darth Vader. Weeks after Palpatine declared himself Emperor of the Galactic Empire, Koon lured Darth Vader into a trap in the Jedi Temple's underlevels. In the ensuing duel, Koon was able to injure Vader but was mortally wounded by the Sith Lord. Before she died, Koon experienced a vision of Vader's redemption, Palpatine's death, and the return of the Jedi Order through Vader's children, Luke Skywalker and Leia Organa."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and Jedi training"}, {"tag": "p", "text": "Sha Koon was a Kel Dor female born into the Koon family, which had a reputation for being strong with the Force, during the final decades of the Galactic Republic. She possessed a telepathic bond with her uncle, Jedi Knight Plo Koon. At some point during her childhood, her uncle came to her homeworld of Dorin to bring her to the Jedi Temple on Coruscant, the galactic capital. Because of her bond with her uncle, the young Koon understood that he had come to take her to be trained as a Jedi without having to ask. She began her initial instruction under Jedi Grand Master Yoda and was eventually assigned to be the Padawan of the Ithorian Jedi Master Saldith."}, {"tag": "p", "text": "In 44 BBY, during the Stark Hyperspace War between the Galactic Republic and the Stark Commercial Combine, Koon remained at the Jedi Temple. Her uncle Plo Koon, meanwhile, was on the planet Troiken in an attempt to resolve the conflict with Masters Tholme and Qui-Gon Jinn and the pair's respective Padawans, Quinlan Vos and Obi-Wan Kenobi. Shortly after the Fourth Battle of Qotile, Koon was contacted by her uncle through the telepathic bond that they shared. Plo Koon asked his niece to go to the Jedi High Council so that he could communicate with the Councilors through her."}, {"tag": "p", "text": "Koon and her Master, Saldith, met with the Council, and Koon informed the Masters of the Council that her uncle wanted to speak with them. Saldith reassured the Council that Koon's mind was calm and told the Jedi Council member Mace Windu that he had felt it best to approach the Council on this matter, since Saldith knew that the Kel Dor species communicated with their minds. The Councilors joined their minds with Koon's, contacting Plo Koon and the Jedi on Troiken. After speaking with Plo Koon, the Council sent a Jedi strike force to assist his team, which ultimately helped to bring a resolution to the Stark Hyperspace War."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "After Koon passed the trials necessary to become a Jedi Knight, she took the Corellian Baylis Archan—who possessed telepathic abilities like she did—as her Padawan. In 19 BBY, during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, Koon was part of a task force sent by the Jedi Council to respond to intelligence that revealed the Separatists' intent to mine lightsaber-resistant cortosis ore on the Outer Rim world of Bal'demnic. The task force—which included Jedi Knight Halagad Ventor, several other Jedi, and a back-up squad of clone troopers—was assigned to investigate and terminate the CIS operation."}, {"tag": "p", "text": "When Koon's forces arrived on Bal'demnic, they found the planet in chaos, with the native Kon'me species rebelling against the Confederacy. After the clone troopers landed, the Kon'me became furious and attacked all of the off-worlders. Although Koon and her forces were forced to retreat from Bal'demnic, the Confederacy also halted its mining operation on the planet. After the battle, the Republic assigned a fleet to protect Bal'demnic from further Separatist operations. Later that year, Koon and Baylis Archan were sent with a command of clones to the planet Giju. A battle ensued with the Separatists, and both Koon's forces and her Padawan were killed. After the battle and Archan's demise, Koon returned to Coruscant to recover from her wounds, particularly one to her right eye, and to meditate on her actions. She refused to return to the war."}, {"tag": "p", "text": "Shortly after the death of the Confederate Head of State and Sith Lord Dooku during the Battle of Coruscant, Koon was assigned by her uncle to search the Jedi Archives for any leads regarding the Sith Lord that Dooku had claimed was in control of the Galactic Senate. Koon met with Jedi librarian Jocasta Nu, who offered Koon her assistance. Koon refused, however, believing that the Jedi librarian would be unable to help her. As Koon was searching through the Archives, Plo Koon was murdered in Cato Neimoidia's atmosphere by his clone troopers when Supreme Chancellor Palpatine issued Order 66, a directive that instructed all Republic soldiers to eliminate the Jedi. Koon felt her uncle's death both through the Force and in her mind and lost consciousness."}, {"tag": "p", "text": "Koon awoke to find members of the Grand Army of the Republic's 501st Legion attacking the Jedi Temple. The clones she ran into attacked her, and Koon deflected their blaster bolts with her lightsaber. While fleeing the soldiers, Koon witnessed Jedi Knight Anakin Skywalker—who had recently been christened as the Sith Lord Darth Vader—kill Jocasta Nu. Koon felt Skywalker's emotions and immediately realized that he had fallen to the dark side and joined the Sith. Koon then fled from Vader and his legion by way of the secret passageways under the Jedi Temple that she had learned from Padawan Jin-Lo Rayce."}, {"tag": "h3", "text": "Confronting Darth Vader"}, {"tag": "p", "text": "As time passed by in the Coruscant Underworld, Koon befriended a group of zombie-like creatures called Cthons. She plotted to cripple the newly crowned Emperor Palpatine, the instigator of the Great Jedi Purge, by defeating his Sith apprentice, Darth Vader. Koon eventually contacted Palpatine over his secure holographic channel and lied to the Emperor, expressing her desire to become his Sith apprentice by offering to eliminate Vader. Although Palpatine was not deceived by Koon, he sent Vader to the Jedi Temple underlevels to confront her."}, {"tag": "p", "text": "After Vader—who was forced to wear a suit of life-preserving armor due to previous injuries dealt to him by Jedi Master Obi-Wan Kenobi—arrived in the underlevels, Koon was surprised to find that the person under Vader's mask was Anakin Skywalker. Vader recognized Koon's emotions and commented that he would have killed Koon if she had chosen not to flee during his raid on the Jedi Temple. Vader also stated that Palpatine saw through Koon's lies, claiming that Koon had only spoke via holocomm to hide her true intent of killing Palpatine. Koon revealed to Vader that her fallback plan was to cripple Palpatine by killing his Sith apprentice instead. With that, Koon unleashed the Cthons on Vader."}, {"tag": "p", "text": "As the creatures attacked the Dark Lord of the Sith, Koon explained that they were easily controlled by the Force. The Cthons then threw an electroshock net on Vader, which damaged the life support systems on his armor. Vader broke free of the net and killed the Cthons, remarking that while the attempt was impressive, Koon had to face Vader then and there. The two combatants ignited their lightsabers, and Koon stated that she had been waiting to face him. Vader asserted that with her death, his mission to eliminate all the Jedi would be complete and added that she was the last Jedi alive to oppose the Sith."}, {"tag": "p", "text": "As Koon and Darth Vader began a lightsaber duel, Koon contemplated the Sith Lord's claim that she was the last surviving Jedi. She became all the more determined to kill Vader, feeling that no one else would be able to do so if she failed. Koon was able to injure the Dark Lord by slashing him across his chest. Vader eventually gained the upper hand by gripping her throat with the Force. He then drew Koon right towards his lightsaber, impaling her through the chest. Before she died, Koon experienced a vision through the Force of a rebellion against the Galactic Empire, Vader redeeming himself by killing Emperor Palpatine, and the rebirth of the Jedi Order through Vader's children, Luke Skywalker and Leia Organa. Realizing that the future did not depend on her, Koon died at peace."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "To the Kel Dor female Sha Koon, a telepath's images were more than words—they were bits of melody or explosions of feeling. She viewed her uncle's mind as rich and textured, yet full of contradictions. Yet, she knew that Plo Koon understood himself and what it meant to be a Jedi. After she rose to the rank of Jedi Knight, Koon was given a Padawan named Baylis Archan. Training Archan seemed natural to Koon, since Archan also possessed telepathic gifts. Koon viewed Archan's mind as playful, similar to a fast-moving river, and felt that Archan's thoughts were like fish in that river, darting and sparkling."}, {"tag": "p", "text": "Koon believed that the Clone Wars were a violent and needless war. After her Padawan died in battle with the Separatists on Giju, she refused to return to combat against the Confederacy. When Darth Vader attacked the Jedi Temple, Koon chose to flee her attackers and was determined not to be killed like a mindless beast. Before Koon dueled Vader underneath the Jedi Temple, she told the Sith that she believed him to be a murderer of children, a traitor to his friends, and a destroyer of the Jedi to whom he was once allied. She expressed her desire to face Vader, and the Sith replied that Koon was the last Jedi and that his mission to eliminate every Jedi would be complete with her death."}, {"tag": "p", "text": "After hearing this, Koon felt that her success in killing Vader was of the utmost importance—as she believed that if she was unable to defeat Vader, no one else would be able to and the Sith would rule the galaxy. Before Koon died from the fatal injury dealt to her by Vader, she initially saw her death as the mark of her mission's failure. After she experienced a vision depicting the Emperor's death, Vader's redemption, and the Jedi Order's rebirth through Vader's children, she realized that the future of the galaxy did not depend on her and died at peace with herself."}, {"tag": "p", "text": "Because Kel Dor were unable to breathe oxygen, Koon was forced to wear a set of protective goggles and an antiox breath mask when not on her homeworld of Dorin. She also wore a set of brown Jedi robes and used a lightsaber containing a green crystal."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Sha Koon possessed telepathic abilities and had a strong telepathic bond with her uncle, Plo Koon. When her uncle came to Dorin for her, she knew without a word being said that he had come to take her to Coruscant's Jedi Temple so that she could begin her training. Near the end of the Stark Hyperspace War, Koon was able to receive a telepathic contact from her uncle all the way from the planet Troiken while she herself was on Coruscant. When Order 66 was initiated, Koon sensed her uncle's death and temporarily slipped into unconsciousness. During the assault on the Jedi Temple led by Anakin Skywalker—who had taken up the mantle of Darth Vader—Koon was able to read Skywalker's thoughts and determine that he had joined the Sith. Before they dueled in the underlevels of the Jedi Temple, Koon used her telepathic abilities to confirm that Vader was Anakin Skywalker."}, {"tag": "p", "text": "Koon was able to utilize the ability to telekinetically push her enemies away with the Force and was capable of using the Force to control the Cthons, who were easily dominated with the Force. She was also skilled in the use of a lightsaber and wounded Darth Vader before he gained the upper hand in their duel. Before she died, Koon had a vision through the Force that depicted future events."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sha Koon was created by John Ostrander for the fourth issue of The Stark Hyperspace War story arc of the Star Wars: Republic comic series. Koon was later mentioned in StarWars.com's Databank entry on the planet Bal'demnic. In addition, she was mentioned in Jedi vs. Sith: The Essential Guide to the Force and The Clone Wars Campaign Guide and received an entry in The Complete Star Wars Encyclopedia. Koon was also the central Jedi protagonist in the comic Star Wars: Purge: Seconds to Die, which detailed her death during the Great Jedi Purge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}