{"url": "Shaak_Ti", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Females", "Category:Jedi Generals", "Category:Jedi High Council members", "Category:Jedi Purge victims", "Category:Pilots", "Category:Togruta"], "nodes": [{"tag": "h1", "text": "Shaak Ti"}, {"tag": "p", "text": "Shaak Ti ( pronounced /ʃɑk ti/) was a Force-sensitive Togruta female Jedi Master of the Jedi Order and member of the Jedi High Council in the waning years of the Galactic Republic. Considered to be amongst the wisest and most patient in the Order, she was a skilled fighter and devoted believer in the ways of the Jedi. During the Clone Wars, a galaxy-wide conflict between the Republic and the Confederacy of Independent Systems, Ti took part in the pivotal battles of Geonosis, Kamino, and Coruscant as a general for the Grand Army of the Republic."}, {"tag": "p", "text": "Early in the Clone Wars, she was chosen to represent the Republic on Kamino, where she personally oversaw the training and development of clone forces. While in this role, she became entangled in a conspiracy surrounding the origins of the organic inhibitor chips placed in every clone, and the secrets being kept from the Jedi about them. As she attempted to root out the conspiracy from ARC Trooper Fives, she clashed with Kaminoan Chief Medical Scientist Nala Se, who was attempting to dispel his claims regarding the chips' true purpose. Despite her efforts to the contrary, Ti was unable to help Fives as he suffered a breakdown, and upon his death, his secrets passed on to only a few. Ti had a tenuous relationship with the Kaminoan leadership during this time, finding difficulty in working with their emotionless demeanor and struggling to balance her compassion for the clones with the demand of producing capable soldiers for war."}, {"tag": "p", "text": "As the war began to draw to a close, Ti and the Council became increasingly aware of the mystery behind the Dark Lord of the Sith, devoting much time to discovering their identity and motives. During the Battle of Coruscant in the late stages of the Clone Wars, Ti was sent to protect Supreme Chancellor Sheev Palpatine but was knocked unconscious in a duel with Separatist General Grievous. At the war's end Ti became a victim of the Great Jedi Purge, murdered at the hands of fallen Jedi Anakin Skywalker whilst she meditated during the Siege of the Jedi Temple. Prior to her death Ti recorded a message of hope on a holocron, urging its finder to not let the fall of the Order be the end of the Jedi."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Shaak Ti was born on the planet Shili. Identified as a Force-sensitive individual, she joined the Jedi Order and eventually gained the rank of Master. At some point following the Battle of Naboo, she gained a seat on the Jedi High Council, taking the place of Master Yaddle, who had chosen to retire from the body and take a less active role in Jedi affairs."}, {"tag": "h3", "text": "Road to war"}, {"tag": "p", "text": "The Galactic Republic was in a state of turmoil during this time, as the Separatist Movement, led by former Jedi Count Dooku, threatened the stability of the Republic. The Secessionist Movement led to debate over the creation of a military force to combat an impending war. After the attempted assassination of Naboo's Senator Padmé Amidala, Ti and the other members of the Jedi Council assigned Jedi Knight Obi-Wan Kenobi to investigate the assassination attempts while his Padawan, Anakin Skywalker, protected the senator. Ti was present in the Jedi Archives when Kenobi was researching the planet Kamino, which he believed had a connection to Amidala's would-be assassin. Upon arriving to the planet, Kenobi learned that the deceased Jedi Master Sifo-Dyas had, years earlier, secretly ordered a clone army from the Kaminoans with the help of a man named Tyranus. On Kamino, Kenobi found a bounty hunter named Jango Fett, whom the clones were created from, and believed him to be Amidala's attempted assassin. Later, while following Fett to Geonosis, Kenobi discovered that the Separatists were creating their own army made up of droids, but was captured by Dooku's forces moments after contacting the Jedi Temple to report his findings. Skywalker and Amidala, who were on the nearby planet of Tatooine, unsuccessfully attempted to rescue him, leading to their capture."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "Battle of Geonosis"}, {"tag": "p", "text": "Ti participated in the First Battle of Geonosis, the conflict that sparked the Clone Wars between the Republic and the Separatist Alliance. As a participant, she was a part of the group of 212 Jedi assembled by fellow Jedi Council member Mace Windu to rescue Kenobi, Skywalker, and Amidala from being executed by the Separatists at Petranaki Arena on Geonosis and crush the Separatist army. Upon arriving at Geonosis, the assault team infiltrated the arena and hid, waiting for the right time to strike. When Windu made the Jedi's presence known, every Jedi ignited their lightsabers and revealed themselves. Ti and Master Luminara Unduli ignited their lightsabers simultaneously, and quickly joined the battle. Dooku unleashed hordes of battle droids to counterattack the Jedi, who were quickly overwhelmed. The onslaught resulted in the deaths of nearly the entire assault team, with the surviving Jedi, including Ti, encircled by Dooku's forces. The Droid Army was ready to end the survivors when Grand Master Yoda arrived with the newly deployed Grand Army of the Republic. Several LAAT/i gunships formed a perimeter around the Jedi. Ti, Unduli, and Master Saesee Tiin boarded a gunship and were airlifted out of the arena and brought to the front lines of the battle, where the clone army was in combat with the Separatist forces. Once there, Ti was among many Jedi who led the assault on the Separatist core ships. Ti fought alongside Windu on the battlefront, cutting down droids and helping the clones push the Separatist armies back. With the clone's help, the Jedi successfully rescued Kenobi, Skywalker, and Amidala, and won the ensuing battle."}, {"tag": "p", "text": "Shortly following the clash on Geonosis, Separatist forces established footholds on various worlds in the Outer Rim. Seeking to ascertain the reason for a Separatist presence on Hissrich, Ti and the Council sent Windu, along with a covert team of Jedi, to investigate the planet."}, {"tag": "h4", "text": "Deployment to Kamino"}, {"tag": "p", "text": "Early in the war, Ti was chosen by the Council to represent the Republic on Kamino. Her primary role was to oversee the cloning initiative, which included training the clone forces for combat. She worked alongside two bounty hunters contracted by the Republic, Master Chief Bric and El-Les. Ti and the bounty hunters were tasked with conducting training exercises for cadets. In addition to her mentorship role, she was also the commanding officer of the Kamino security force. At some point, Ti flew her Eta-2 Actis-class light interceptor while on Kamino."}, {"tag": "h5", "text": "The Domino Squad"}, {"tag": "p", "text": "One clone training group, Domino Squad, was ineffective in following protocol and working as a team. Ti, Bric, and El-Les presided over their pre-graduation exercises in the Citadel Challenge. Following one such failed exercise, Bric implied that the group were \"rejects,\" and should be demoted to sanitation detail. El-Les was more sympathetic and wanted Domino Squad to continue training. Ti, although disagreeing with his sentiment, agreed with Bric that the squad was not ready for combat. She ended the test and requested that maintenance clone 99 send a cleaning crew to the training ground."}, {"tag": "p", "text": "Ti later conversed with the Kaminoan Prime Minister, Lama Su, on the squad's ineffectiveness. Su recommended that the Republic find another donor for the cloning process, believing that the squad's failure was a genetic malfunction. He suggested rejecting the squad, by means of termination, an idea Ti strongly opposed. Su ultimately left the final decision of their consequence up to Ti as she was in charge of training. The squad failed their graduation testing, and despite Bric's opposition El-Les sent a request to Ti asking she allow the squad to retake the test. She was later approached by two members of Domino Squad, CT-5555, \"Fives,\" and CT-1409, \"Echo,\" who asked for a transfer to another squad. Sensing their stress, Ti disapproved of their plea and told them that when in battle, they should fight as a group, not as individuals. She told them that she had decided to allow them to retake the test."}, {"tag": "p", "text": "In the early stages of their final exercise, the squad worked as a team and managed to proceed further than they had before. Upon reaching the citadel, however, they realized that the ascension cables needed to scale it were missing. Bric revealed that he had removed them in hopes that they would fail. El-Les protested that Ti end the test because Bric's actions made it unfair, but she denied his request, stating that adversity would be a constant in war and that the Separatists wouldn't play fair either. Despite Bric's efforts, the squad managed to overcome their disability and complete the test by scaling the tower using the wall-mounted turrets. Having successfully proven themselves and passed their final exercise, Ti graduated them to the Grand Army of the Republic."}, {"tag": "h5", "text": "Battle of Kamino"}, {"tag": "p", "text": "After the Republic intercepted a message between Separatist General Grievous and assassin Asajj Ventress discussing a planned attack on Kamino, Ti and Su prepared to greet Kenobi and Skywalker when they arrived at Tipoca City with reinforcements. Ti welcomed the pair to Kamino while Su expressed doubt that an attack would take place, as he believed that the Republic blockade was far too strong. A Separatist fleet soon arrived and engaged the blockade. As the two fleets began to clash, Ti monitored the progress of the battle from Tipoca City's control room alongside Kenobi, Su, Captain Rex, and Commander Cody. She noted that the Separatist fleet was not large enough to defeat the blockade, and ordered Skywalker to lead the Republic's fighters in assaulting the enemy. Several Munificent-class star frigates were destroyed protecting Grievous' flagship, with their debris crashing in the ocean near Tipoca City. Ti pointed out the unusual tactic to Kenobi. Kenobi became concerned that the battle was too easy, and left Ti and the others to investigate the wreckage in the ocean beneath the city. He discovered AQ-series battle droids assembling Trident-class assault ships underwater but was unable to warn the city before the droids began their assault."}, {"tag": "p", "text": "Ti continued to monitor the battle with Su as Grievous and his forces joined in on the ground battle. When the control room came under assault by several Aqua droids, Ti quickly dispatched them and contacted the other Jedi, warning that the attacking droids were spread thin throughout the city and that the Republic needed to press their counterattack quickly. While Kenobi engaged Grievous and Skywalker hunted down Ventress, who attempted to steal a genetic sample of the clone's DNA, Ti led the clone troopers in pushing the droids back to Tipoca City's main hangar. As the remaining aqua droids were rounded up and destroyed, Ti contacted Cody to inform him of the progress made. The clone forces were soon able to corner Ventress, though she managed to escape with Grievous on an escape pod without the DNA."}, {"tag": "h4", "text": "Serving the Council"}, {"tag": "p", "text": "When the Jedi received a nearly 2,000-year-old distress code, Ti and the Council sent Kenobi, Skywalker, and his Padawan, Ahsoka Tano, to the Chrelythiumn system, where they were to investigate the signal and rendezvous with a star cruiser helmed by Rex. Despite having the correct coordinates, the three Jedi could not find the other ship and became trapped in an otherworldly plane. They later managed to leave and complete their rendezvous. Sometime later, while in the face of a Separatist invasion, the Togrutan governor of Kiros decided to negotiate with Dooku, knowing that Republic aid would arrive too late. Kenobi and Skywalker arrived with their entourages, only to discover that the Togrutan colonists were relocated by the Separatists. When Ti and the Council learned of this, they dispatched Kenobi, Skywalker, Tano, and Rex with finding the colonists and rescuing them. Not long after it was discovered that Dooku and criminal mastermind Moralo Eval had a plot to kidnap Palpatine at the Festival of Light on Naboo, Ti and the rest of the Council arranged for Kenobi to go undercover as bounty hunter Rako Hardeen to stop Eval and Dooku from succeeding. Ti attended the faux funeral of Kenobi, standing alongside Windu and Satine Kryze of Mandalore. She later attended a meeting held by Windu, where he discussed the security being put in place during the festival. The Council's plan was a success, and the Chancellor came out unscathed."}, {"tag": "p", "text": "When the Separatists invaded Onderon and replaced its king, Ramsis Dendup, with their own, Sanjay Rash, a small group of Dendup's followers rebelled against the new monarch. They reached out to the Council, asking for support. Ti and her fellow Council members were wary, as the rebel's fight did not involve the Republic, and sending aid would earn the Jedi scrutiny from the Senate. Nonetheless, the Council sent Kenobi, Skywalker, Tano, and Rex to train the rebels in secret."}, {"tag": "h4", "text": "Bombing of the Temple and Trial of Ahsoka Tano"}, {"tag": "p", "text": "Following the bombing of the Jedi Temple hangar, Ti and the Council met to discuss who the culprit could be. Windu entertained the idea that the bomber could be a rogue Jedi, and assigned Skywalker and Tano to investigate. Their investigation led to the arrest of Letta Turmond, who had fed nano-droid explosives to her unwitting husband, a worker in the Temple. Ti later attended the funeral for the six Jedi killed in the bombing. Following the services, Ti and the Council met to listen to Kenobi's report on the Separatist activity on Saleucami. His report was cut short by Admiral Wilhuff Tarkin, who told those present of Turmond's request to speak to Tano. Tano met with the prisoner, and in a startling turn of events, Turmond was killed and Tano was on the run, blamed for her murder. Ti attended the Council meeting in which Tarkin accused Tano of masterminding the attack, causing Ti to exchange a shocked look with Kit Fisto."}, {"tag": "p", "text": "After Tano's capture, Tarkin requested that the Council expel Tano from the Order so that a military trial could take place, free of what he believed to be a bias among the Jedi. Fearing that a refusal would be seen as an act of sedition, the Council reluctantly agreed. Ti was one of the judges during Tano's trial in the Chamber of Judgment, where the young Padawan was expelled from the Jedi Order and stripped of her ranks within the Grand Army of the Republic. Skywalker ultimately proved Tano's innocence, revealing that it was Padawan Barriss Offee who had become disillusioned with the Order, gave Turmond the nano-droids, and framed Tano for it all. The Council apologized to Tano and offered her a chance to rejoin, though she refused and left the Jedi Order."}, {"tag": "h4", "text": "Clone conspiracy"}, {"tag": "h5", "text": "Search for the source"}, {"tag": "p", "text": "Following clone trooper Tup's breakdown during the Battle of Ringo Vinda, in which he killed Jedi General Tiplar, he was sent to Kamino for an examination. He was accompanied by Rex and Fives, whom Ti, still stationed on the ocean world, met with shortly after their arrival. As they accompanied the sedated Tup to an examination room, Ti informed Rex that he was needed back on the battlefront and sent Fives for an examination, as he was close with Tup and any information gathered would be beneficial to the investigation. Ti and Kaminoan doctor Nala Se then began their testing on Tup. Se conducted a hyper test, a practice Ti was not fond of. During the tests, Tup began shaking violently, which a concerned Fives noticed from the neighboring examination room. Ti shuttered the viewing window between rooms so that Fives would not panic. The tests yielded nothing, and Se's readings showed him to be in perfect health. Ti suggested that they missed something and asked if he was conscious only for Tup to look at her and violently mutter \"kill the Jedi\" before Se sedated him. Ti and Se were at a loss and the two had no answers."}, {"tag": "p", "text": "The medical droid AZI-3 suggested a phase 5 atomic scan be performed on Tup, in order to find the source of his breakdown. Se claimed that the scan could kill him, and instead suggested that they terminate the clone and do an autopsy on his body, as she believed that the cause of his behavior was a virus. Ti instead believed that the cause was mental, suggesting that the Separatists had brainwashed him during his time at Ringo Vinda. Each decided to speak with their respective peers on what they should do next. While Se conversed with Lama Su, Ti contacted the Jedi Council on Coruscant to discuss the issue. Ti told them of the situation and backed up her theory of brainwashing with the fact that Tup had gone missing for five rotations while on Ringo Vinda prior to murdering Master Tiplar. The Council told her to bring the clone back to the Jedi Temple, where they would examine him through the Force."}, {"tag": "h5", "text": "Fives on the run"}, {"tag": "p", "text": "Ti was then alerted to an invader alarm on Kamino which she found had been triggered by Fives, who, along with AZI-3, had run the atomic scan against orders. They had located and extracted a tumor which they believed to be the cause of Tup's behavior. Tup soon died muttering that he was \"free of the nightmares.\" Ti and Se contacted Supreme Chancellor Sheev Palpatine and told him about the situation. Ti requested that she be able to continue testing on the tumor at the Jedi Temple, but the Chancellor told her to bring the data to the Grand Republic Medical Facility on Coruscant. Se agreed with Palpatine's suggestion, and the outnumbered Ti informed the Chancellor that she would do as he asked. Later on, Ti and Se met with Fives in his examination room. Ti told Fives about the Chancellor's orders and explained that the investigation was better left to medical professionals, inquisitively adding that there was much they didn't know about the tumor yet before placing it in a case. Se stated her opinion that Fives' actions kept them from learning more about the tumor, which irked the clone. The two began arguing over the situation before Ti stopped them. With their arguing settled, Ti told the two that she had arranged for the tumor and all the data gathered to be sent to the Jedi Temple. The outraged Se tried to dissuade the Jedi Master, but Ti simply told Se that her word was final. Ti told Fives that he had one last physical to pass before he would be returned to duty."}, {"tag": "p", "text": "Before she could leave for Coruscant, however, Ti was alerted that Fives and AZI-3 were attempting to escape. Ti and Se led a squad of clones to a hangar, where they chased after the fleeing duo. The group couldn't reach Fives and AZI-3 in time, and they watched from the hangar as the two fugitives left in an escape pod. Ti ordered that the pod be tracked so they could bring them in alive. Unbeknownst to Ti, Fives and AZI-3 had not planned to escape, but to create a diversion so they could investigate Tup's death and the origin of the tumor in secret. In the central control room, Ti and Se continued their search. Ti told Se that she had a feeling that they were searching in the wrong place. She was soon informed that there had been strange activity in the Genetic Records Hall and that someone was accessing the Jango Fett template data. Ti ordered that the room be evacuated quietly, and immediately left with a group of clones and Se to investigate. Ti's suspicions turned out to be true and they found Fives and AZI-3 in the Records Hall. Ti, Se, and the clones gave chase once again, but the two renegades escaped into the emergency flooding system. Back in the control center, Ti correctly surmised that Fives and AZI-3 weren't planning to escape, but rather that they were researching something, she just didn't know what. She later saw Se quietly leaving the command center and followed her with a squad of clone troopers. She arrived at the Embryo Room in time to see Fives holding a blaster to Se's head, and told him to surrender as she ignited her lightsaber."}, {"tag": "p", "text": "Fives told her how he, assisted by AZI-3, discovered that the tumor had been bio-engineered and suspected a larger plot to be the cause of Tup's actions. The duo had also discovered that all troopers, including Fives, had been implanted with the same organic inhibitor chip, which had malfunctioned in Tup. Ti asked for an explanation of why Tup's had degraded, but Fives told her that it didn't matter and that the entire Republic army could be compromised unless the chips were removed. Se claimed that the chips had been placed to inhibit aggressive behavior and that Tup's malfunction was an isolated incident, as well as that removing the chip caused Tup to die. When he told them that he had removed his own chip, Se claimed that Fives was a threat and should be terminated. Fives was angered by the suggestion and told Se that she had no right to treat him like hardware, to which Se stated that the clones were merely the property of the Kaminoans. At this remark, Ti interjected on Fives' behalf, saying that the clones were technically the property of the Republic and invoking Jedi authority once more to insist that Fives be sent to the Chancellor for investigation, rather than let him be terminated by the doctor. Se countered that he was not part of the Chancellor's initial request, but Ti remained sturdy in sending him to Coruscant. Fives thanked her for believing in him, to which Ti replied that she was only doing what was right."}, {"tag": "h5", "text": "Deception"}, {"tag": "p", "text": "Ti led Fives, as well as Se, to the Grand Republic Medical Facility on Coruscant. As they approached Coruscant, however, Se drugged Fives behind Ti's back, making the clone paranoid and aggressive. Upon arrival, they were greeted by Mas Amedda, who led them inside to the Chancellor. The Chancellor greeted Ti as Fives was put on an examination table. Ti gave the chips to the Chancellor and Se explained what they were. He asked whether or not a virus was the sure cause of the decay in Tup's chip, to which Se said that they only knew that the chip had failed and that Fives was now a threat after removing his own. Fives insisted to the Chancellor that the Kaminoans were covering something up about the chips and that if not, he and Tup were victims of a Separatist plot. Se again argued that a virus was responsible and that Fives should be terminated. The Chancellor requested that Ti and Se wait outside while he talked with Fives. Ti protested, but the Chancellor assured her that he and Fives would be safe. As she was meditating outside, Ti heard blaster fire and opened the door to see Fives disarming the Chancellor and his security. Fives began to aim his weapon at the Chancellor, but Ti used the Force to stop him. The Chancellor claimed that Fives had tried to assassinate him. While Ti was helping the Chancellor up, Fives ran out of the room and down a staircase. She chased after the fleeing clone and jumped down the staircase to the medical bay. She ordered that the blast doors be closed, but Fives managed to make it through in time."}, {"tag": "p", "text": "Ti met with Masters Plo Koon, Yoda, Windu, and Skywalker and told them about Fives' actions. Skywalker, whose legion Fives belonged to, expressed disbelief upon hearing that he had tried to assassinate the Chancellor. Ti told them that the Kaminoans believed that a virus had caused the clones' inhibitor chip to malfunction, resulting in this behavior, while Fives believed that he was the victim of a conspiracy. Windu informed the Jedi that the Chancellor had been moved to his senate quarters and that all security and clone forces on Coruscant were ordered to join the manhunt for Fives. He added that the Jedi were not asked to take part in the search, something those present found odd. Windu suggested that they lead an undercover investigation to find if any plot involving the clones existed, which Skywalker volunteered to do. Ti warned him to be cautious, as the removal of the chip might have changed Fives. Shortly after being found by Skywalker and Rex, the unstable and neurotic Fives was killed by Commander Fox as he attempted to reveal what he had learned about the chips' true purpose."}, {"tag": "p", "text": "Ti, along with Skywalker, Windu, and Yoda, met with the Chancellor later, where he gave his own explanation of the clones' breakdown. Palpatine told the Jedi that his investigation had led him to believe that a parasite native to Ringo Vinda had caused the chips to malfunction, and that an inoculation for it had been developed which would be administered to the clones. Ti and Skywalker remained silent during the meeting, listening as Yoda and Windu accepted the words of the Chancellor, who ensured that nothing more would be made of the situation and that their attention be redirected to the war."}, {"tag": "h4", "text": "Crisis on Bardotta"}, {"tag": "p", "text": "Soon after, Palpatine informed the Jedi Council of Queen Julia of Bardotta's request for Jar Jar Binks to assist her after the disappearance of several Dagoyan Masters. Ti, along with the rest of the Council, discussed the matter, ultimately deciding that Binks should not go alone, leading to Windu's decision to accompany him."}, {"tag": "h4", "text": "Tyranus revealed"}, {"tag": "p", "text": "After receiving a decades-old distress call from the lost ship of Sifo-Dyas, the Jedi Council sent Master Koon to investigate. After confirming the ship as Sifo-Dyas', the Council chose to investigate the matter deeper. Ti was present when Skywalker and Kenobi gave a report of their mission to Oba Diah, where they were confronted by Dooku. They had learned the startling realization that Dooku and Tyranus, the man who helped Sifo-Dyas order the clone army, were one and the same. Dooku had, under the name Tyranus, enlisted Jango Fett to be the template for the clone army Sifo-Dyas had ordered and paid the Pykes on Oba Diah to kill Sifo-Dyas by shooting down his ship. Ti and the Council chose to keep this revelation secret, knowing that belief in the war effort would disintegrate if the public knew that the Sith had a secret connection to the army and that they had no reason to doubt the clones' loyalty at the time. Yoda lamented that the Council would have to play along with the Dark Lord of the Sith's games until they could unravel their web and learn their intentions."}, {"tag": "h4", "text": "Yoda's visions"}, {"tag": "p", "text": "Shortly after the Council's investigation of Sifo-Dyas' death, Yoda began hearing the voice of long-dead Jedi Qui-Gon Jinn during meditation. Ti and the Council met to discuss the revelations surrounding Dooku, specifically the idea that Dooku was not the Sith Lord they had been searching for and merely an apprentice. When asked his opinion during the meeting, Yoda told them that he was deep in thought and had not been listening. The Council was confused by the Grand Master's strange behavior, and Ti looked to Oppo Rancisis and Kit Fisto with concern. Sometime later Yoda called a meeting to tell the Council what had been troubling him and requested that they join him in meditating to see if they could hear the voice as well. Ti joined the rest of the Council in meditation at the center of the room, where she placed her hand on Ki-Adi-Mundi and knelt. Despite remaining in a state of meditation for the duration of an entire day, their efforts proved fruitless as not one of the Jedi present heard the voice. As Fisto helped Ti up, Yoda walked away from the other Jedi in disillusionment. Mundi proposed that Yoda had been deceived by the Sith, which Kenobi argued against despite Yoda's agreement. Yoda later heard Jinn's voice again and was told to travel to Dagobah to find the answers he sought. While on Dagobah, he experienced a harrowing vision in which Ti was impaled by Anakin Skywalker's lightsaber while meditating."}, {"tag": "p", "text": "Ti, alongside many Jedi both dead and alive, later appeared in another of Yoda's visions as he walked through the Valley of Extinction in the mysterious Wellspring of Life. Ti was seen conversing with Barriss Offee and Adi Gallia. The former was imprisoned on Coruscant and the latter was killed during a skirmish on Florrum. All Jedi present gathered underneath the Great Tree, where Yoda realized that these events were an illusion, calling out Jinn and Gallia as being deceased, and Dooku as being a traitor. The illusions, including Ti, were lifted into the sky and the vision was ended."}, {"tag": "h4", "text": "Crisis on Utapau"}, {"tag": "p", "text": "Following the death of the Jedi Tu-Anh on Utapau, Kenobi and Skywalker discovered that the Separatists were secretly transporting a massive kyber crystal to Serenno. Ti was present during Kenobi's report of the situation, listening as Yoda ordered him to keep the crystal out of Separatist hands. The subsequent mission led to the crystal's destruction by the Jedi. Ti sat among her fellow masters when Skywalker and Kenobi reported their actions to the council. The Jedi learned from Yoda that kyber crystals like the one on Utapau had once powered ancient superweapons constructed by the Sith and that the mysterious Dark Lord of the Sith might one day discover another giant kyber crystal and craft a new superweapon."}, {"tag": "h4", "text": "Plot to assassinate Dooku"}, {"tag": "p", "text": "Ti was present at a Jedi Council meeting following the attack on Mahranee, where Windu suggested that assassinating Dooku could help end the war. Ti remained silent during the meeting, her expression calm but sorrowful. After careful consideration, the Council chose to send Quinlan Vos. Vos, alongside Dooku's former assassin, Ventress, trained to take down Dooku. The plan failed, as Vos was captured and Ventress narrowly escaped."}, {"tag": "p", "text": "Following a failed attempt to free Vos and the revelation that he was Dooku's new apprentice, Ventress met with Kenobi and was brought to the Temple. Ti was in a meeting with Yoda, Windu, Koon, and Ki-Adi-Mundi when Kenobi and Ventress entered. All except Yoda raised their lightsabers in response to Ventress' appearance. With reassurance from Kenobi, the Jedi lowered their defenses. With the Jedi's help, Vos was freed. The Council learned that he had, according to his own recollection, not fallen to the dark side and was merely imprisoned by Dooku. The Council met soon after to discuss what to do with him, as Ventress refused to believe that he was no longer free of the dark side and the Council was divided on how he should have been handled. Windu wanted to keep him away from the war effort, as Vos posed a threat to the Republic, due to his knowledge of both Republic and Separatist information and his ties with Dooku. Both Kenobi and Ti spoke against this, saying that his knowledge would aid the Republic, and they should give him smaller assignments until he was deemed ready to rejoin the war at hand. Over the next several months, Vos led several smaller missions to small Separatist storage facilities and listening posts, each of which ended with growing suspicion as to Vos' loyalty, as every outpost seemed to have been abandoned by the Separatists before the Republic forces arrived. To test his loyalty, the Council sent him to assassinate Dooku once more. He recruited Ventress again, and they traveled to Christophsis. Ventress was proven right in her belief that he was still under the influence of the dark side, but sacrificed herself at the hands of Dooku in order to redeem him. Vos was ultimately allowed to rejoin the Order, and he returned Ventress' body to her homeworld of Dathomir."}, {"tag": "h4", "text": "Battle of Coruscant"}, {"tag": "p", "text": "During the Outer Rim Sieges, the Separatists staged a massive invasion of Coruscant. The battle, however, was a ruse to slip Grievous onto the surface of the planet to kidnap Palpatine. Ti and Jedi Knight Roron Corobb, along with a clone task force, were sent to protect the Chancellor. Corobb and the clones fell to Grievous, but Ti managed to fight further. Using both her lightsaber and a MagnaGuard electrostaff, she dueled with the General. Grievous managed to get the upper hand, however, by electrocuting Ti with cables, knocking her unconscious in the process. Grievous took her lightsaber and fled with the captive Chancellor to the Separatist flagship Invisible Hand. The loss of contact with Ti resulted in alarm from the Jedi Council, and as a result Kenobi and Skywalker were called upon to rescue the Chancellor. The ensuing battle ended with not only his rescue but also the death of Dooku."}, {"tag": "h4", "text": "Tension in the Order"}, {"tag": "p", "text": "Following the Separatist's loss on Coruscant, Grievous was named the Confederacy's new Head of State. The Council, upon learning of this, made his capture their highest priority in order to end the war. Palpatine, who the Council already strongly distrusted, took it upon himself to appoint Skywalker to the Council. With little option, the Council agreed but refused to grant him the rank of Master, infuriating the young Jedi. The Council had only agreed in order to spy on the Chancellor through Skywalker. Ti was not present during these events but did attend the meeting where Skywalker informed the Council that Republic Intelligence had located Grievous on Utapau. Skywalker volunteered to lead the mission but was replaced by Kenobi at Windu and Mundi's urging. These events strained the relationship between not only the Council and the Chancellor, but also Skywalker."}, {"tag": "h4", "text": "Siege of the Jedi Temple and death"}, {"tag": "p", "text": "Soon after the Battle of Coruscant, it was discovered that Palpatine, revealed to be the true Dark Lord of the Sith, Darth Sidious, had been manipulating the Republic and the Jedi. Sidious was the mastermind behind the creation of both the clone and droid armies, as well as Dooku's Sith mentor. After Sidious revealed to Skywalker his true identity, Windu gathered together Fisto, Tiin, and Agen Kolar to arrest the Supreme Chancellor for his crimes. Sidious killed Windu's team in quick succession, with Windu falling shortly thereafter courtesy of Skywalker's betrayal. With the promise of saving those he loved from dying, Sidious turned Skywalker to the dark side of the Force. He enacted Order 66, which used the clones' inhibitor chips to turn them against the Jedi. As the Jedi spread across the galaxy were being massacred, the temple was attacked by Skywalker, newly christened Darth Vader, aided by the 501st clone legion. Ti recorded a message on a holocron urging whoever found the message to continue the legacy of the Force, and not to let the Purge be the end of the Jedi. As she meditated during the attack, Ti was murdered by Vader, in accordance with Yoda's visions."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Despite only owning it for a short period of time before his death at the hands of Kenobi on Utapau, Ti's lightsaber was among the most prized in Grievous' collection. During the onset of the Battle of Utapau, he used the saber during a brief bout with Kenobi, but it was lost when the hand wielding it was cut off by the Jedi."}, {"tag": "p", "text": "Shortly after the Battle of Fortress Vader in 12 BBY, Vader entered a portal constructed by Darth Momin to resurrect his deceased wife, Padmé Amidala. While walking through and experiencing various illusions, he entered one where several Jedi, dead and alive, including Ti, confronted him. One by one, Vader destroyed the illusions, impaling both Ti and Koon simultaneously as the words \"Let the past die\" resounded in his mind."}, {"tag": "p", "text": "At some point following Order 66, the holocron Ti used shortly before her death became part of Grakkus the Hutt's vast collection of Jedi artifacts on Nar Shaddaa. Sometime between 0 ABY and 1 ABY, Vader's son Luke Skywalker was kidnapped by Grakkus after a series of skirmishes in the streets of Nar Shadaa, during which he brandished his father's former lightsaber and revealed his intention of sneaking into the old Jedi Temple on Coruscant. Skywalker awoke in the Hutt's palace, where the Hutt showed him a holocron. Knowing that Skywalker must have had some connection to the Force, Grakkus ordered that he open the holocron. While under pressure from the Hutt, he opened several holocrons in the room, among which was Ti's. Luke listened to her recorded plea before once again facing the Hutt. In 4 ABY, Luke, by then a Jedi Knight, helped redeem Vader and end Sidious' rule over the galaxy. In the years afterward, Luke began researching and rediscovering the history of the long-dead and forgotten Jedi Order. During his search for knowledge, he learned of Ti's life and role in the Clone Wars and later chronicled her history in a personal journal he entitled The Secrets of the Jedi."}, {"tag": "p", "text": "Around 34 ABY, fifty-three years after her death, stone artwork of Ti and several other Jedi could be found at Dok-Ondar's Den of Antiquities on Batuu."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Shaak Ti was a female Togruta with dark grey/blue eyes and red skin. Around her eyes were large white markings, a pigmentation unique to Ti. She had a jeweled headdress adorning her face that lay along the border between her face and her montrals, which along with her lekku were marked by gray stripes. Ti's colorful features were a hereditary pattern evolved by Togruta to confuse the predators of their homeworld, Shili. Ti was regarded as wise and patient, and a devoted believer in the ways of the Jedi. According to Luke Skywalker, Ti was likely given the assignment to oversee the training of clones because she excelled as both a teacher and a combatant. The lessons she passed onto the clones proved to be far more effective than she imagined. During her deployment to Kamino, she often struggled to balance the need to produce capable soldiers for the war effort and her compassion for the clones, which was made all the more difficult by her power struggle with the Kaminoan leadership. Despite her feelings for the clones, however, she could be tough on her students in order to bring the best out of them."}, {"tag": "p", "text": "As a member of the Jedi High Council, Ti took part in many important meetings alongside the greatest Jedi in the Order. She held a seat on the Council from her inception following Master Yaddle's retirement to her death during the siege of the Jedi Temple. She often remained silent during meetings, showing emotion though calm expressions, though she sometimes interjected into conversations to voice her opinion on a matter. At the meeting wherein the Council debated Quinlan Vos' loyalty, Ti sided with Obi-Wan in his trust in Vos, saying that the Council could discern his loyalty by allowing him to take on smaller assignments. Ti's commitment to the Jedi made her willing to act against the orders of others, for instance arranging for the data on Tup's breakdown and subsequent investigation be sent to the Jedi Temple before the Republic Medical Facility, which went against the direct command of the Supreme Chancellor."}, {"tag": "p", "text": "Ti was noted by Fives to be a helping and caring individual, valuing the lives of the clones not as objects but as people. This often led to conflict with the Kaminoans, who regarded them as property. She openly opposed the Kaminoan's preferred methods of handling clones, such as hyper tests and termination, as well their mistreatment of the soldiers. The Kaminoans in turn criticized Ti and the Jedi, citing their compassion and creative thinking as poor influences on the clones. Ti had a particularly difficult relationship with Doctor Nala Se, who had little regard for her moral and spiritual beliefs. Although the two had some respect for each other, their relationship quickly soured as they tried to track down the rogue Fives. Despite the need to keep the situation professional, Ti stood up for Fives against Se where she could, disputing her baseless claims and trying to ease Fives whenever Se would instigate him. Ti became increasingly suspicious of Se as they worked together during the crisis, and even though Fives' behavior and discoveries deeply troubled her, Ti decided to invoke her authority over Se to allow Fives a chance to present his findings to the Chancellor. When Fives thanked her for what she had done for him, Ti told him that she had made the decision not because she believed in either side, but because it was the right thing to do."}, {"tag": "p", "text": "When the Jedi Temple came under siege by Vader and his clone forces, Ti accepted that the Order would not prevail that night and, instead of fighting, attempted to preserve what knowledge she could by recording a message on a holocron, urging its future finder to continue the Jedi way."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Force-sensitive, Ti was skilled in using telekinesis during battle. During the Battle of Kamino, she used telekinesis to lift two aqua droids and slam them into two other droids hard enough to destroy all four. Ti used the Force to disarm Fives as he was about to assassinate Palpatine, and while chasing after the rogue clone, performed a Force jump to catch up, leaping easily over a large crowd. As a Togruta, Ti's hollow montrals allowed her to sense the movement of objects around them. This echolocation, which could reach up to 82 feet, paired with her natural Force abilities allowed Ti to be very perceptive of her surroundings. Because of her increased spatial awareness, she was exceptional at group combat as she was not hindered by the complexity of movements."}, {"tag": "p", "text": "Ti's martial capabilities were also enough to ensure her survival during the Battle of Geonosis, an engagement that saw the deaths of nearly 200 Jedi. She had the skill to wield two melee weapons at once as she, at one point during the Battle of Coruscant, wielded both her lightsaber and an electrostaff. In addition to her combat skills, Ti was also a capable pilot."}, {"tag": "p", "text": "As the overseer of clone training on Kamino, Ti demonstrated an affinity for teaching. She was also well-adept in leadership roles and had experience working as a diplomat."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ti wielded a blue lightsaber, using it throughout the Clone Wars until it was stolen by Grievous during the Battle of Coruscant. The saber's hilt was 26.60 centimeters in length and was crafted from copper and durasteel. Like many of her fellow Jedi in the Clone Wars, Ti was the owner of an Eta-2 Actis-class light interceptor."}, {"tag": "p", "text": "Although she commonly wore a standard Jedi robe, underneath she wore a traditional Togruta dress comprising of a flowing brown skirt and an intricately designed scarf and tabard, along with a sleeveless brown undershirt accompanied by matching sleeves that stretched from her shoulders to her wrists. At some point later in the Clone Wars, she acquired a wrist comm with a similar design to her tabard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shaak Ti was created by concept artists Dermot Power and Iain McCaig, who designed her as a Jedi with a rubicund complexion and an intricately patterned and layered brocade for use in Star Wars: Episode II Attack of the Clones."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "h4", "text": "Attack of the Clones and Revenge of the Sith"}, {"tag": "p", "text": "Shaak Ti was played by Israeli actress and model Orli Shoshan in Attack of the Clones. Ti is seen throughout the film as a background character and has no speaking lines. Shoshan was offered the part while living in Sydney, Australia. She was a former member of the Israeli Army, but despite her previous training in martial arts the bulky costume made it tricky for her to perform melee combat. Shoshan had filmed several scenes as Ti for Star Wars: Episode III Revenge of the Sith, but they were cut from the final product. In the only scene in Revenge of the Sith that features Ti, that being a short cameo at a Jedi Council meeting, she is portrayed by Maria Brill, a member of the Visual Effects department. Both Shoshan and Brill were uncredited for their roles in Attack of the Clones and Revenge of the Sith, respectively."}, {"tag": "h4", "text": "Star Wars: The Clone Wars"}, {"tag": "p", "text": "She was voiced by Tasia Valenza in Star Wars: The Clone Wars. Valenza notes that Ti was written for the show to have an \"accent with a Spanish flavor,\" something with an \"exotic flair.\" For the role, Valenza, who usually records in her closet, recorded in a studio with the other actors. Ti first appeared in the Season Three episode \"Clone Cadets\" as a supporting character, and was featured in a similar role in the following episode, \"ARC Troopers.\" Valenza reprised her role as Ti for the Season Six episodes \"Conspiracy,\" \"Fugitive,\" and \"Orders,\" where Ti is featured again in a major supporting role. Ti was a recurring minor character throughout the show following the third season, appearing in silent cameos in Seasons Four and Five with a slightly more substantial role in Season Six. Ti does not appear in any episode of Season Seven, though a short clip from the Season 5 episode \"The Wrong Jedi\" featuring Ti is used in the flashback sequence of \"Gone with a Trace.\" She is, however, mentioned by name in the episode \"Old Friends Not Forgotten,\" which makes reference to her fight with Grievous during the Battle of Coruscant."}, {"tag": "h3", "text": "Deleted scenes and canonical fate"}, {"tag": "p", "text": "In the final edit of Revenge of the Sith, most of the footage featuring Shaak Ti was cut, including two possible death scenes for her. In one, she is captured by General Grievous and taken aboard the Invisible Hand. When Anakin Skywalker and Obi-Wan Kenobi make it aboard the ship they find a strangely despondent Ti sitting at the feet of Grievous, stating that she is sorry for failing him before Grievous stabs and kills her in front of the two Jedi. In another deleted scene of Episode III, which takes place during the Jedi Purge, Ti is meditating when she feels the presence of Vader and asks what he wants, believing him to still identify as Jedi Knight Anakin Skywalker. Vader then stabs and kills her. The scene exists as \"Anakin kills Shaak Ti\" animatic and is part of the deleted scenes released on the Blu-ray in 2011. Ti's canonical death was finally confirmed as being killed by Darth Vader while meditating during Order 66 in the 2016 reference book Star Wars: Galactic Atlas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}