{"url": "Seventh_Sister%27s_lightsaber", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Seventh Sister's lightsaber"}, {"tag": "p", "text": "The Seventh Sister's lightsaber was a double-bladed spinning lightsaber wielded by the Jedi hunter known as Seventh Sister, similar to other double-bladed spinning lightsabers wielded by Imperial Inquisitors."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "The weapon featured a ringed emitter which could partially detach from the remaining hilt, allowing both blades to rotate rapidly without effort from the wielder. For a Jedi hunter like an Inquisitor, this function likely served as a way to intimidate opponents, as well as deflect any form of direct attack. However, this was also the weapon's primary weakness, as a lightsaber-wielding opponent could simply separate the emitter itself and cut the weapon in half, as was demonstrated by Kanan Jarrus during his final duel with the Grand Inquisitor aboard the Sovereign."}, {"tag": "p", "text": "The handgrip could be removed entirely from the ring-shaped emitter, allowing the Force-imbued circlet of metal to be used as a throwing disc."}, {"tag": "p", "text": "It could also be used to fly, spinning in a helicopter-like motion strong enough to lift the wielder off the ground."}, {"tag": "p", "text": "Additionally, the Seventh Sister's lightsaber was cosmetically distinct among other double-bladed spinning lightsabers used by her fellow members of the Inquisitorius in that the weapon had two small blades and ornate engravings on its ringed emitter."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Seventh Sister was trained in the use of this lightsaber alongside her fellow Inquisitors in The Works on Coruscant under the tutelage of the Grand Inquisitor."}, {"tag": "p", "text": "This lightsaber saw recurring use by the Seventh Sister as she was dispatched by Darth Vader alongside the Fifth Brother to hunt down the Spectres. This hunt would bring the pair into several duels with rebel Jedi, engaging in combat against the cell's Jedi members: Kanan Jarrus and Ezra Bridger, as well as the Phoenix Cell's former Jedi leader, Ahsoka Tano."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}