{"url": "Bangroft_Casas", "categories": ["Category:Canon articles", "Category:204th Imperial Fighter Wing members", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bangroft Casas"}, {"tag": "p", "text": "Bangroft Casas was a human male ensign in the Galactic Empire, who was stationed the tibanna gas mining station above the planet Pandem Nai. When Colonel Shakara Nuress of the 204th Imperial Fighter Wing took control of operations on the planet, she chose Casas to be her pilot rather than waste the time of one from the 204th. One day, the ensign flew the Colonel from the settlement Induchron, confirming their destination to be Orbital One and relaying news from the station on the arrival of the 204th's Squadron Four. After their shuttle reached the station's hangar Nuress left Casas to tend to the vessel."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Shuttle pilot"}, {"tag": "p", "text": "During the Galactic Civil War, Bangroft Casas was assigned to the tibanna gas mining station Orbital One, located in the orbit of the planet Pandem Nai. There, he served as an ensign and a pilot. Several weeks after the Battle of Endor in 4 ABY, the Empire's 204th Imperial Fighter Wing, led by Colonel Shakara Nuress, gained control of Pandem Nai and its orbital stations to establish a base of operations to restock and resupply Imperial forces."}, {"tag": "p", "text": "Colonel Shakara Nuress, the 204th's commanding officer, chose Casas fly her around for appearance purposes aboard a Zeta-class Heavy Cargo Shuttle. The colonel chose the ensign wishing not to waste the time of her fighter wing's pilots. When Casas flew Nuress out of Induchron, a settlement on Pandem Nai, one day, he asked if she wanted to return to Orbital One. The Colonel, who sat in the co-pilot's seat, told the pilot to take the long route to the station, specifying the route when Casas began to ask what she meant. The ensign acknowledged her details and proceeded to fly the shuttle along the route."}, {"tag": "p", "text": "When a message reached the shuttle from Orbital One, reporting the return of the 204th's Squadron Four from a mission. Casas informed Nuress, adding that the squadron had taken no losses, but the colonel told the pilot that the news could wait. Some more time passed until the vessel reached the top of the atmosphere, where the ensign notified the colonel of their descent towards the mining stations, asking her if she wanted to pilot the starship herself. Nuress declined, letting Casas fly the shuttle into Orbital One himself. One the vessel landed, the colonel left him to tend to the starship and traveled to her quarters."}, {"tag": "h3", "text": "TIE duty"}, {"tag": "p", "text": "Sometime after, the New Republic's Alphabet Squadron attacked the 204th at Pandem Nai. Nuress was killed during the battle, with many of the fighter wing fleeing the system as their base of operations was devastated. Casas traveled with the 204th, and was promoted to TIE duty. Around 5 ABY, the fighter wing attacked New Republic forces, Alphabet Squadron among them, at the Cerberon system, decimating the enemy fleet. As the 204th's TIE fighters attacked New Republic forces on the planet Troithe after, Casas was killed in the fighting. Upon hearing of this news, Colonel Soran Keize reflected on the ensign's death, and remembered that he had meant to meet with every new addition to the 204th, but had lost track of time."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A human male ensign, Casas' had the impression of an errand boy to Shakara Nuress, who found his record to be unexceptional. The pilot was sure to inquire directives from the colonel and report any incoming news to her, even offering for her to fly the shuttle herself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bangroft Casas first appeared in the 2019 novel Alphabet Squadron, written by Alexander Freed. His first name, Bangroft, was identified in Alpahabet Squadron's sequel, Shadow Fall, written by Freed and published in 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}