{"url": "Seventh_Sister", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Females", "Category:Inquisitors", "Category:Mirialans", "Category:Pilots", "Category:Sith acolytes and apprentices", "Category:Torturers and interrogators"], "nodes": [{"tag": "h1", "text": "Seventh Sister"}, {"tag": "p", "text": "The Seventh Sister was a female Mirialan Inquisitor who served the Galactic Empire and operated as a Jedi hunter in the years before the Battle of Yavin. She was tasked with tracking down Ahsoka Tano, a prominent figure in the rebellion against the Empire, by the Sith Lord Darth Vader. Following the death of the Grand Inquisitor, the Seventh Sister sought to replace him as the leader of the Inquisitorius."}, {"tag": "p", "text": "In the fourth year before the Battle of Yavin, the Seventh Sister came into direct conflict with the Spectres. She fought them on many occasions: aboard an Old Republic medical station, in Hammertown on the planet Takobo in an attempt to kidnap Force-sensitive children, and on Garel in an attempt to destroy the rebel fleet. The Seventh Sister was ultimately killed by Maul on Malachor."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The individual who became known as the Seventh Sister was born on the planet Mirial."}, {"tag": "h3", "text": "Fallen Jedi"}, {"tag": "p", "text": "She originally occupied a position within the Jedi Order and was even a survivor of Order 66 herself. At some point after the Galactic Republic was reorganized into the Galactic Empire, she was inducted into an Imperial agency of Force-sensitive assassins called the Inquisitorius, tasked with hunting down and eliminating any Jedi who survived Order 66. To accomplish this, she and her colleagues were trained by The Grand Inquisitor in The Works, but soon fell under the command of Darth Vader when Darth Sidious first demonstrated the Inquisitorius to Vader in the Inquisitorius Headquarters, who continued their training in the ways of the dark side of the Force. In doing so, she was taught the lesson of loss by unpleasant methods by Vader as all inquisitors in the Works were."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "h4", "text": "Hunting Jedi"}, {"tag": "p", "text": "Following the hunt for Eeth Koth, the Seventh Sister celebrated the death of the former Jedi alongside the other Inquisitors. Later, she, taken aback, witnessed Vader igniting his lightsaber, attempting to strike down an Inquisitor he suspected was a traitor. Another Inquisitor tried to stop him, and the Dark Lord hunted and killed the pair."}, {"tag": "h4", "text": "Serving the Empire"}, {"tag": "p", "text": "After the death of the Grand Inquisitor, the Seventh Sister became a vital commander among the ranks of the Inquisitorius and sought to ultimately replace the Grand Inquisitor."}, {"tag": "p", "text": "The Seventh Sister was dispatched by the Sith Lord Darth Vader to deal with the growing rebellion against the Empire, as well as to hunt down the former Jedi Padawan Ahsoka Tano. This brought the Seventh Sister into conflict with the Spectres, who flew a starship known as the Ghost."}, {"tag": "h4", "text": "Skirmish aboard the medical station"}, {"tag": "p", "text": "The Seventh Sister was ordered to scout an abandoned Republic medical station. One of her ID9 seeker droids reported seeing the rebel Sabine Wren. Meanwhile, another proceeded to knock out Chopper. As Ezra Bridger and Sabine searched the medical station for supplies, they found themselves standing face-to-face with the Seventh Sister. Ezra mistook the Inquisitor for a bounty hunter; she revealed her true nature to the boy by activating her lightsaber. Outmatched, Ezra and Sabine fled, only to run into their attacker's accomplice, the Fifth Brother. With the help of her \"little pets,\" the Seventh Sister succeeded in capturing Ezra and remarked on the nobility of his sacrifice to let Sabine escape. At that moment, the Fifth Brother attempted to murder Bridger on the spot but the Sister deflected it lazily with her own blade whilst commenting on her surprise at seeing him there as well. When the Brother protested at her having stolen his kill, she derided him for his short-sightedness and sent him off with two of her droids to capture Wren so she could use him as bait to lure out the other rebels."}, {"tag": "p", "text": "The Seventh Sister brought Ezra to the medical station's command center to slowly break him by using psychological tactics, a combination of threats, taunts and Force powers, including an attempted mind probe. Ezra refused to break and fired back with a few taunts of his own, vaguely impressing her but also causing her to lose patience as he continued to resist. When the Brother returned with an unconscious Sabine, he asked if she had made any progress in getting the boy to talk but she refused to answer directly to cover her embarrassment. Ezra and Sabine were then contacted by the Lasat rebel Garazeb Orrelios, who was using the pseudonym \"Commander Meiloorun\" and told them to rendezvous with him at Bay Six, as well as to keep their \"chins up.\" The Seventh Sister saw her chance to destroy the rebels once and for all."}, {"tag": "p", "text": "At Bay Six, Zeb ambushed the Seventh Sister and Fifth Brother from aboard the Phantom, allowing Ezra and Sabine to escape onto the ship. The Inquisitors used telekinesis to pull the rebel ship towards them in an attempt to prevent its escape, with the Sister also using her powers to close the hangar doors. Sabine started to shoot at the Fifth Brother, forcing him to break off to deflect the shots. Unable to hold the ship herself, the Seventh Sister was almost pulled out into the vacuum of space as the Phantom escaped with the rebels onboard. Realizing she had failed to complete her objective in the presence of another Inquisitor, the Seventh Sister became flustered."}, {"tag": "h4", "text": "Abducting children"}, {"tag": "p", "text": "Following their failure to capture the rebels aboard the Republic medical station, the Seventh Sister and Fifth Brother boarded a passenger ship above the planet Chandel to seize a Force-sensitive infant named Alora. They succeeded and killed everyone aboard the ship, save for the child's grandmother, Darja. This act attracted the attention of the Spectres and Ahsoka Tano."}, {"tag": "p", "text": "The Seventh Sister next traveled with the Fifth Brother to Takobo to capture an Ithorian infant named Pypey. They confronted the child's mother, Oora, and when they learned their target had been sent away in the care of a droid, they smashed all of the furniture in Oora's home."}, {"tag": "p", "text": "In the streets of Takobo, the Seventh Sister and Fifth Brother managed to intercept the droid that had left with Pypey; the child was nowhere in sight, for he had been taken by Zeb. The Seventh Sister and Fifth Brother pursued Zeb to a nearby apartment; they entered it only for Ezra to escape with Pypey."}, {"tag": "p", "text": "After failing to lure out their quarry, the Seventh Sister and Fifth Brother faced the Jedi Kanan Jarrus and Zeb. The pair of Inquisitors bested the two rebels, who escaped on a speeder. The Seventh Sister and Fifth Brother gave chase on a speeder of their own; after another skirmish, the Inquisitors cornered their foes outside the local spaceport."}, {"tag": "p", "text": "The Seventh Sister and Fifth Brother successfully overpowered Kanan, Ezra, and Zeb once again. However, before the Inquisitors could finish the trio of rebels off and retrieve Pypey, Ahsoka Tano appeared before them. Surprised but delighted by this, the Seventh Sister and Fifth Brother engaged their former Jedi prey in combat while Ezra, Kanan, and Zeb escaped with Pypey aboard the Phantom. However, it was quickly shown that both Seventh Sister and Fifth Brother were no match for Ahsoka, who easily overpowered the Brother and knocked him out before suddenly kneeling in apparent surrender; leaping in for the kill, the Seventh Sister was flabbergasted when the Togruta grabbed her spinning lightsaber, deactivated it using the Force, and tossed it aside before telekinetically throwing her against a nearby pillar. Ahsoka claimed she had beaten the Seventh Sister, but the Inquisitor laughed maniacally as Imperial reinforcements arrived in the form of stormtroopers and a few Imperial Troop Transports. While the Seventh Sister intended to capture Ahsoka and please Darth Vader, the rebel commander managed to make a getaway with her comrades and the successfully reclaimed Force-sensitive infants."}, {"tag": "p", "text": "Adding insult to injury, the Seventh Sister and Fifth Brother discovered that the Spectres had destroyed their TIE Advanced fighters. The Inquisitors were elated, however, when one of the Seventh Sister's droid \"pets\" revealed that the enemy was hiding on the planet Garel."}, {"tag": "h4", "text": "Raid on Garel"}, {"tag": "p", "text": "Together with Agent Kallus and Admiral Kassius Konstantine, the Seventh Sister and Fifth Brother attacked the Phoenix Cell, of which the Spectres were a part, on Garel. The pair of Inquisitors faced Ezra and Kanan in a hangar bay. The Seventh Sister managed to goad Ezra into attacking her, but Kanan shut a blast door that was between them, thus preventing a fight from taking place. The crew of the Ghost then took advantage of this delay and escaped into Garel's atmosphere."}, {"tag": "h4", "text": "Jedi Temple on Lothal"}, {"tag": "p", "text": "On the planet Oosalon, the Seventh Sister and Fifth Brother engaged Kanan and Ezra in a lightsaber duel; overpowered, the Jedi managed to escape their attackers on the back of a tibidee."}, {"tag": "p", "text": "The Seventh Sister and Fifth Brother were able to track Kanan and Ezra to Lothal; via one of the Seventh Sister's seeker droids, they discovered an ancient Jedi Temple on the planet's surface. The pair of Inquisitors used the Force to summon the temple from under the ground, though it put up a fight; lightsabers at the ready, the duo entered its depths only to be attacked by the manifestations of several Jedi Temple Guards, including one who resembled the Grand Inquisitor."}, {"tag": "p", "text": "In the aftermath of this encounter, the Seventh Sister and Fifth Brother found themselves in the presence of Darth Vader. The Sith Lord coldly stated that the rebels' growing power would be their undoing."}, {"tag": "h4", "text": "Mission to Malachor and death"}, {"tag": "p", "text": "The Seventh Sister was ordered by Darth Vader to travel to Malachor with the Fifth Brother and obtain a Sith holocron from within a Sith temple located beneath the planet's surface. She and her accomplice came to the aid of the Eighth Brother after he was captured by Kanan Jarrus and Ahsoka Tano; all three Inquisitors were forced to retreat when their opponents were joined by Ezra Bridger and his new companion, the former Sith Lord Maul. Having escaped her adversaries, the Seventh Sister dispatched some of her ID9 seeker droids to spy on them."}, {"tag": "p", "text": "The Seventh Sister later attacked Ezra and Maul as they scaled the Sith temple in an attempt to reach a chamber at its top. The Inquisitor was engaged by Ezra in a brief lightsaber duel; she was then lifted into the air by Maul and overcome with terror when the former Sith Lord ordered Bridger to execute her. The young Jedi could not bring himself to do so, much to her smug relief, but Maul had no such restraint and hurled his own weapon at her head. Powerless, she could only scream before either of the twin blades slashed across her body, much to Ezra's horror. Maul then released his grip on the Seventh Sister's bisected corpse, letting it fall to the ground. Her fellow Inquisitors would also fall soon after."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Seventh Sister kept a tight hold on her emotions and spoke calmly, even during combat. She favored agility over brute strength, and she had a certain level of respect for her opponents. The Seventh Sister often disagreed with the methods of the Fifth Brother; this suggested a rivalry between the two. Unlike most inquisitors, she preferred not killing her targets as she believes it is not the best approach. Unlike the Fifth Brother, she was tactically minded and often used cutting barbs or sarcastic comments when sparring with her opponents to put them off-guard. She would often engage her opponents in flirtatious banter, occasionally bordering on seductive, and use her probe droids in combat to distract them. The Seventh Sister also demonstrated occasional sadism and willingness to torture, as shown when she remarked that she only needed Ezra alive and not in one piece, clearly threatening dismemberment if he didn't start talking; but, the Seventh Sister was profoundly impressed with Ezra's abilities."}, {"tag": "p", "text": "Like the Grand Inquisitor and Fifth Brother, the Seventh Sister wore black armor. She wore a pointed, curved helmet that was red on the interior and a white outline of a half-circle on the top. It had a retractable faceplate that hid her green skin and red facial tattoos from view. The Seventh Sister's eyes were yellow in coloration and her sclera were black. She bore Imperial crest on her shoulders and the portions of her gloves that covered the palms of her hands were red."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Seventh Sister was trained in the dark side of the Force for the purpose of hunting down and killing Jedi. Agile and acrobatic, she was skilled lightsaber duelist, capable of dueling Ezra Bidger and Kana Jarrus on several occasions, briefly held her own against Ahsoka Tano alone,, and was considered one of the most capable of inquisitors. Despite her skill, her dueling abilities could not match the skills of more experienced combatants, such as Maul or Ahsoka Tano."}, {"tag": "p", "text": "While relying less on the Force and often preferring the use of her lightsaber instead, she proved capable of using the Force, able to augment her natural speed and agility, perform telekinesis, holding back the accelerating Phantom (albeit with great amounts of effort), while simultaneously shutting massive hangar doors, and raising an ancient Jedi Temple, although all with the Fifth Brother's aid. She could also induce pain with the mind probe, as well as levitate and manipulate objects and people with the Force, and was of a unique Force ability capable of delivering painful scratches to her opponents. Despite being far less bulky than the Fifth Brother, she was apparently much tougher and had a high tolerance of pain, as she recovered almost immediately from being telekinetically hurled against a stone pillar hard enough that it cracked under the impact, while Fifth Brother was rendered unconscious from a relatively lesser blow to the head against the same pillar."}, {"tag": "p", "text": "In addition to her Force abilities and dueling capabilities, Seventh Sister proved herself a capable tracker and could pilot a TIE fighter."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Like all Inquisitors, the Seventh Sister carried a double-bladed spinning lightsaber. The weapon had two spikes and ornate engravings on its ringed emitter, and it was worn on the Seventh Sister's belt when not in use. It was lost on Malachor when she was killed by Maul."}, {"tag": "p", "text": "The Seventh Sister also possessed several ID9 seeker droids; these could be dispensed from a hole in the armor on her back."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Seventh Sister was created for the second season of Star Wars Rebels. She is voiced by Sarah Michelle Gellar, who is married to Freddie Prinze Jr., the voice of Kanan Jarrus. In the book The Art of Star Wars Rebels, Plunkett stated that the shape of the Seventh Sister's helmet is based on the ones worn by Nightsisters and there was an error in her character name of being Second Sister."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}