{"url": "Seyugi_Dervish", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Dark side organizations", "Category:Force-based organizations"], "nodes": [{"tag": "h1", "text": "Seyugi Dervish"}, {"tag": "p", "text": "The Seyugi Dervishes were a Force-sensitive order of assassins that originated on the sulfuric planet of Recopia, located in the Core Worlds. They were founded several centuries before the Battle of Yavin by a Force-sensitive leader of the Seyugi culture named Karrh. Dervishes used their abilities with the Force to enhance their unarmed combat skills and to locate their targets. They also sold their services as hired killers and terrorized the Core for several centuries. The Jedi Order recognized the threat the Dervishes posed and spent decades eliminating their bases in the Core and Mid Rim. By the outbreak of the Clone Wars in 22 BBY, the Jedi believed that the Dervishes were extinct. However, a few hundred survivors relocated to a hidden fortress in Recopia and froze themselves in carbonite, waiting for an opportunity to return to the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Seyugi Dervishes were formed from the extinct Seyugi culture on the sulfuric planet of Recopia, which was located in the Core Worlds. The Seyugi were nomads that traveled in Recopia's atmosphere on huge repulsorlift barges. The rest of Recopia's population regarded the Seyugi as a culture of outlaws. Several hundred years prior to the Battle of Yavin, a Force-sensitive Seyugi leader named Karrh gathered warriors that showed Force potential and began training them in stealth tactics; Karrh also imparted to these acolytes his views on the Force. These warriors became the first Seyugi Dervishes and began eliminating various threats to the Seyugi people. Eventually, the Dervishes spread throughout the Core, establishing bases on most of the Core planets and a few in the Mid Rim. They sold their services as assassins, albeit for an expensive price. The Dervishes specialized in killing nobles, heads of corporations, and other important figures. The Sith Lord Darth Bane believed that the Dervishes had turned their combat abilities into an art form and at some point after the Ruusan campaign, he mentioned the Dervishes in his book, The Rule of Two"}, {"tag": "p", "text": "Eventually, the Dervishes attracted the attention of the Jedi Order, which decided to end the threat that they posed. The Jedi's campaign against the Seyugi Dervishes went on for decades, and the Jedi managed to eliminate all the Dervishes' bases in the Mid Rim and the Core. By the outbreak of the Clone Wars in 22 BBY, the Seyugi Dervishes were believed by the Jedi Order to be extinct. However, a few hundred Dervishes retreated to a secret temple-fortress on Recopia and froze themselves in carbonite."}, {"tag": "p", "text": "The Mallif, religious monks and descendants of the Seyugi people, hijacked HoloNet transmissions and broadcast their philosophies to the public. While most of the Mallif were unaware of the Dervishes' survival, a minority knew and took care of the hibernating Dervishes and their hidden base, waiting until the opportunity was right to take their charges out of their frozen state. Several years later, the Dervishes were accidentally revived by one of the Mallif monks. One of the Dervishes, Razi Khan, killed the monk and tried to reach the island-chain city of Scapio to locate someone who could open the Seyugi vaults beneath the fortress. Khan kidnapped a slicer, but was caught, forcing the Seyugi Dervishes to go into hiding once again."}, {"tag": "h2", "text": "Philosophy, training, and techniques"}, {"tag": "p", "text": "The Force Adepts that adhered to the Seyugi Dervish tradition usually ignored the Jedi Order's theories on the Force. The Dervishes viewed the Force as a way to master their bodies and hone them into weapons. While the Dervishes used the dark side of the Force and committed deeds that were evil, they did not follow many dark side practices. They abstained from random acts of violence and chaos and were motivated by avarice and personal gain, not power. They also possessed patience, which was often utilized during their training, and hid their emotions. Despite this, many Dervishes found themselves in the employ of Dark Jedi. Seyugi Dervishes also spread rumors of their skills; this was done so that the mention of the organization would instill fear."}, {"tag": "p", "text": "The Dervishes sought out infants to older younglings who showed Force potential for training in the Seyugi Dervishes' ways. They trained recruits from this age group so that the initiates became fanatical to the Seyugi Dervish tradition. When a potential trainee was located, the Dervishes kidnapped and sent the child to one of their many bases to begin a lifelong study of the Force tradition and monastic practices. After a Seyugi Dervish had trained for fifteen years, the apprentice was sent on his or her first mission with a master who monitored the learner's actions from afar. Should the apprentice fail, the master removed any trace of the incident. After a Dervish apprentice completed the necessary training, the individual was free to explore the galaxy, although the Dervish still received orders from his or her masters through the Force and encrypted transmissions."}, {"tag": "p", "text": "The Seyugi Dervishes were masters of unarmed combat. They were capable of sneaking into an armed fortress and murdering their targets discreetly and with incredible speed. The Dervishes were named such by the few survivors of their attacks, who described their confusing, whirling movements as a \"beautiful dance of death.\" Dervishes rarely carried weapons, preferring to use their unarmed skills and the Force to complete their objectives. They did not typically carry much equipment unless an assignment called for it. The Dervishes wore red clothing and white masks not only to conceal themselves, but to capitalize on the fear that the outfits caused. Dervishes studied the anatomies of a variety of different species so that they could locate a species' central nerve clusters and cause more damage to an individual. Most Dervishes preferred to work alone, but on occasion, they combined forces to complete a hazardous task. In rare instances, a Seyugi Dervish hired mercenaries for assistance, including demolition experts and computer slicers. The mercenaries were usually unaware of who their employer truly was, and they were murdered by the Dervish to keep the Dervish's identity a secret."}, {"tag": "h2", "text": "Notable members"}, {"tag": "h3", "text": "Karrh"}, {"tag": "p", "text": "Karrh was a Force-sensitive male who led the Seyugi people several centuries prior to the Battle of Yavin. He gathered warriors with potential in the Force and trained them in the arts of stealth and assassination. Karrh and his fellow Dervishes began to eliminate threats to the Seyugi people."}, {"tag": "h3", "text": "Razi Khan"}, {"tag": "p", "text": "Razi Khan was a member of the Seyugi Dervishes. Before the Jedi Order nearly destroyed the cult, several of its members, including Khan, were frozen in carbonite underneath the Mallif Cove on Recopia. Some years later, they were accidentally revived by one of the monks of Mallif Cove. Khan killed the monk and tried to reach the island-chain city of Scapio in an effort to locate someone who could open the Seyugi vaults beneath the fortress. He kidnapped a slicer, but was apprehended, forcing the Seyugi Dervishes to go into hiding once more."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Seyugi Dervishes were first introduced in the Wizards of the Coast resource book Coruscant and the Core Worlds, a supplement to the Star Wars Roleplaying Game that was released on January 3, 2003. In the book, the Dervishes were featured as a new prestige class for playable characters. The organization was also featured as a basis for the Seyugi Dervish Razi Khan's backstory. The organization's background was later expanded in the Jedi Academy Training Manual, another Wizards of the Coast source book for the Star Wars Roleplaying Game, that was released on May 19, 2009. In the Training Manual, they were featured as one of the many Force-using organizations that a roleplaying character could train under. The Seyugi Dervishes additionally received an entry in The Complete Star Wars Encyclopedia. The planet of Recopia, which was the Seyugi Dervishes' headquarters, was featured in The Essential Atlas, released on August 18, 2009. They were further mentioned in the resource guide Book of Sith: Secrets from the Dark Side."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}