{"url": "Sgauru", "categories": ["Category:Legends articles", "Category:Females", "Category:Named creatures", "Category:Yuuzhan Vong creatures"], "nodes": [{"tag": "h1", "text": "Sgauru"}, {"tag": "p", "text": "Sgauru was a bio-engineered beast created by the extragalactic Yuuzhan Vong during their invasion of the galaxy. She was part of a symbiotic pair of bio-engineered beasts known as the Biter and Beater with the other being Tu-Scart."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Sgauru resembled a massive, muscular, segmented slug and was covered by armored plates of flat, white chitin. She had six stubby legs and a tail which ended in pincers. A pair of beady black eyes were set flat upon her oversized, armored white head. A powerful set of neck muscles supported the massive cranium and allowed Sgauru to use it as a wrecking ball against enemy structures. This gave rise to her nickname 'bludgeon.' The late Warmaster Tsavong Lah also nicknamed Sgauru 'biter.'"}, {"tag": "p", "text": "Sgauru's mouth contained 48 feeder-tendrils; with each being 4 meters long and used to devour fallen rubble and fleeing enemies. Sgauru's presence also had been known to have adverse effects on populations subjected to her rampage. While in the presence of the biotechnology of her creators and during space travel, Sgauru remained calm. However, when she came in contact with the technology of the inhabitants of the galaxy, she became furious since she had been conditioned by the Yuuzhan Vong."}, {"tag": "p", "text": "When deployed onto a planet, Sgauru was herded out of the landing craft and pushed into combat, attached to Tu-Scart's top coil with her tail pincers. While rampaging through cities, Sgauru reared up and flailed her thick, stubby legs against a building and smashed her armored head through the structure. The 'Biter' used its many mouth tentacles to pull the resulting rubble and debris into her mouth, whereupon her powerful stomach acids dissolved the materials."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sgauru and Tu-Scart were created by a group of Master Shapers about 50 standard years before the Yuuzhan Vong War. Sgauru was the 'Biter' while Tu-Scart was the 'Beater'. According to legend, the pair were created by the Slayer Yun-Yammka whom also blessed the Shapers involved in the project with the knowledge necessary to create such creatures."}, {"tag": "p", "text": "The Slayer ordered the creation of the pair for the use of destroying the monolithic duracrete structures in use by the galaxy and to allow the Warrior caste to attend to more \"honorable duties.\" Due to the 'divine nature' of their conception, Tu-Scart and Sgauru were respected by the Yuuzhan Vong military."}, {"tag": "p", "text": "\"Beater' and the Biter\" were first deployed against the New Republic during the Evacuation of Rychel in 25 ABY, and afterward at the Battle of Duro in 26 ABY. During the battles, Sgauru was deployed to smash buildings and also radiated a demoralizing aura of terror and revulsion at the New Republic troops. Later, New Republic scientists and psychologists involved with the Eclipse Project came to believe that the aura was created by a combination of the undulation of Sgauru's feeder-tendrils and the secretion of fear-inducing pheromones. The researchers also speculated that the 'Pair' may have been only deployed for only the most important battles at the command of the Warmaster."}, {"tag": "p", "text": "During the Battle of Yuuzhan'tar in 29 ABY, Jedi Knight Jacen Solo faced the 'Biter' and the 'Beater.' However, he used the Force to persuade the World Brain to turn on its Yuuzhan Vong masters. Since the World Brain controlled all the Yuuzhan Vong war beasts present at the battle including the 'pair', it used Sgauru to transport Jacen to Shimrra's Citadel, where the Supreme Overlord of the Yuuzhan Vong was located."}, {"tag": "p", "text": "Unfortunately, this action angered the surrounding Chazrach slaves whom began pelting both warbeasts with razor and thud bugs, and firejelly grenades. Luckily for the 'Beater and Biter', help arrived when the rakamats turned on the Chazrach. This chaos allowed the Galactic Alliance forces to recapture the Glitannai Esplanade canyon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}