{"url": "Shaak_Ti%27s_quarters", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Coruscant rooms", "Category:Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Shaak Ti's quarters"}, {"tag": "p", "text": "The living quarters of High Council member Shaak Ti served her from her appointment to the High Council until the dissolution of the Order during the Great Jedi Purge."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Erected within the Jedi Temple sometime during the rebuilding of the structure in 1000 BBY,[source?] these quarters were assigned to Master Shaak Ti upon her appointment to the High Council following the death of Master Yaddle. Within these chambers, Ti maintained an atmosphere conducive for meditation on the Force."}, {"tag": "p", "text": "During the Clone Wars, Master Ti was distraught after the Battle of Brentaal IV and sought meditation to clear her head. While deep in meditation, fellow Master Plo Koon joined her and encouraged Ti to sit and meditate with him, not as warriors or as Jedi, but as friends."}, {"tag": "p", "text": "Two years later, Ti was stationed at the Temple while Master Mace Windu went to arrest the Dark Lord of the Sith Darth Sidious. Going to her chambers to meditate, she sensed Windu's death and began to rally all the Jedi in the Temple. As the Temple was seized by the 501st Legion, Master Ti confronted the newly christened Darth Vader in the halls as Jedi fell around her. Fighting to a stalemate, Ti managed to end the duel and gather a group of Padawans and Knights and evacuate the Temple."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Located on the Council Members' Level of the High Council Tower, the room was accessed through a black door off a hallway that ringed the tower's central shaft. Bare and hexagonal, the room was empty save a few metallic meditation pads and a sleep couch. Like the rest of the Masters' accommodations, the chamber was ringed by pillars which framed blinded windows looking out onto the cityscape of Galactic City."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shaak Ti's quarters were constructed as a set for Revenge of the Sith. Though it was filmed, Ti's death scene never made it into the final release. Shaak Ti's chamber actually appeared two years prior to its scheduled debut in Revenge of the Sith, it was featured at the end of the comic, Jedi: Shaak Ti. Her quarters were also featured in the non-canononical version of her death (based on the original filmed version in which she dies in her quarters at the hands of Darth Vader) in LEGO Star Wars: The Video Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}