{"url": "Shadow_Droid", "categories": ["Category:Legends articles", "Category:Cyborgs", "Category:Dark Side Adepts", "Category:Droid starfighter classes", "Category:Imperial Department of Military Research products"], "nodes": [{"tag": "h1", "text": "Shadow Droid"}, {"tag": "p", "text": "Shadow Droids were Imperial starfighters piloted by surgically implanted organic brains, making the Shadow Droid more of a cyborg rather than a true battle droid."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It was said that the possible concept for the Shadow Droids came from Palpatine's interest in life-enslaving technology of the Ssi-ruuk. The chief engineer Umak Leth could not duplicate the reptilian aliens' complicated \"entechment\" process and instead he fell back on the proven success of a direct circuit-to-cerebrum neural link. To be able to do this Leth had to remove the still-living gray matter from scores of grievously wounded or incapacitated TIE pilot aces. The brains were sustained in a protected cocoon awash with nutrient fluids, and the brains were hardwired to external sensors, flight-control and weapons-control systems, and sophisticated tactical computers."}, {"tag": "p", "text": "When the brains became cybernetic hardware, they stripped the pilots of every remaining shred of Humanity, but augmented their reflexes and abilities far beyond anything they would have otherwise known. Emperor Palpatine had also given to his creations one final gift: the ability to touch the dark side, which made them essentially remote extensions of his own will."}, {"tag": "p", "text": "The Shadow Droid was a streamlined starfighter that was capable of keeping pace with the New Republic's X-wing in space, and in the atmosphere they utilized a maneuverable repulsorlift system, but they could easily reach supersonic speeds with a short blast from their ion engines. These droids were also covered with a very glossy black alloy that made them difficult to pinpoint on sensor scans. The droids' twin wings that were extended from the side of the control pad supported repeating blasters, ion cannons, and electromagnetic pulse guns. The droids had two additional pylons to serve as racks and launchers for proton torpedoes and concussion missiles. The droids' two smaller dorsal lasers covered the rear field of fire, and a long-range antenna allowed the fighters to transmit their dense binary code stream between each other and their command ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The shadow droid project, under the guidance of Umak Leth, was one of the most twisted schemes embarked on by the Empire. Their biotic nature gave them additional advantages that automatons couldn't match; these sleek fighters were armed with the power of the dark side of the Force. The Shadow Droids would never have existed if not for Emperor Palpatine's experimentations, and following the First Galactic Empire's defeat at Endor, Palpatine's spirit inhabited a fresh clone body and set in motion new plans of military conquest.\nThe Emperor's throne world of Byss was the homeworld of the research for the Shadow Droids, and it soon spread to several think-tanks and manufacturing centers sequestered on hidden worlds throughout the Deep Core."}, {"tag": "p", "text": "The deadly machines were more cyborg than droid as they were implanted with the brains of mortally wounded TIE fighter ace pilots and were able to manipulate the dark side of the Force. Shadow Droids were first devised on the resurrected Emperor Palpatine's throne world of Byss. As manufacturing was secretly stepped up, the malevolent machines were produced on other Deep Core worlds."}, {"tag": "p", "text": "It is still very unclear how these droids were able to access and manipulate the dark side of the Force, but it is very likely they used it as a sixth sense for identifying potential threats. The Galactic Empire used the Shadow Droids during the Battle of Balmorra and in defense of Palpatine's flagship Eclipse II near Onderon."}, {"tag": "p", "text": "After the collapse of the First Galactic Empire and the rise of the Second over a century later, Shadow Droids were again produced and utilized by Sith Lords, often to guard their personal holdings."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}