{"url": "Shadda-Bi-Boran_(species)", "categories": ["Category:Legends articles", "Category:Extinct sentient species", "Category:Outer Rim Territories species", "Category:Shadda-Bi-Borans"], "nodes": [{"tag": "h1", "text": "Shadda-Bi-Boran  (species)"}, {"tag": "p", "text": "The Shadda-Bi-Boran were a race of green-skinned humanoids indigenous to the planet Shadda-Bi-Boran. A peaceful sun-worshipping civilization, the Shadda-Bi-Boran faced extinction in 43 BBY when their system's star began to die, depriving them of radiation without which they could not produce vital enzymes. The plight of the Shadda-Bi-Boran became a galactic cause célèbre, but all efforts to relocate them ended in failure, and the last of the species died in 38 BBY."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "The Shadda-Bi-Boran were a humanoid species distinguished by their large black eyes and green skin. They were dependent on unique radiation emitted by their star, Shadda, to produce vital enzymes to break down toxins."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Eons before the Clone Wars, the star Shadda expanded into a red giant. The cooling star emitted a unique radiation that gave life to the people of the planet Shadda-Bi-Boran. The species became a peaceful society ruled by sun priests."}, {"tag": "p", "text": "Tragedy struck the Shadda-Bi-Boran in 43 BBY when it was discovered that Shadda was cooling into a white dwarf and would soon undergo a supernova. Because the Shadda-Bi-Boran thrived on radiation emitted by the star, they could not be evacuated to just any world. The Shadda-Bi-Boran's plight became a galactic cause célèbre, with armbands and kerchiefs of handcrafted Shadda silk becoming popular symbols of concern and solidarity."}, {"tag": "p", "text": "The Refugee Relief Movement attempted to locate planets with similar stars to relocate the Shadda-Bi-Boran; a young Padmé Amidala of Naboo assisted in relocating a colony which included N'a-kee-tula, whom Padmé befriended offworld. However their efforts were in vain; entire colonies died off within months due to their failure to adapt."}, {"tag": "p", "text": "The Republic made a last offer to the Shadda-Bi-Boran to put them in stasis or to be frozen in carbonite until a new home could be found, but it was refused. The last of the species died in 38 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}