{"url": "Shades_of_Reason", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Shades of Reason"}, {"tag": "p", "text": "\"Shades of Reason\" is the fifteenth episode of the Star Wars: The Clone Wars television series' fifth season. It first aired on January 26, 2013."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"Backed by the criminal underworld, the Sith and Death Watch launch an attack on Mandalore.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Shadow Collective convenes on Zanbar to discuss Death Watch's planned takeover of Mandalore. Maul instructs their criminal allies to assault several locations in the city of Sundari, creating civil unrest that would weaken the Duchess Satine Kryze's political standing. Death Watch would then swoop in an \"stop\" them, winning the support of the people. As the meeting adjourns, Bo-Katan Kryze converses with Pre Vizsla and remains hesitant on trusting the criminals. Vizsla tells her that they need Maul and the criminals to cause trouble in Sundari just to make Satine feel weak so that the citizens will accept them, afterward they would execute Maul and his thugs after taking over Mandalore. Meanwhile inside, Savage Opress expresses doubts on Vizsla betraying them to which Maul solemnly agrees as they can't rule openly without drawing the attention of the Jedi and that they need Vizsla as the face of Mandalore for now, until they find a new face."}, {"tag": "p", "text": "The Shadow Collective journeys to Mandalore and begins their attack. The various criminal syndicates capture the docks, assault a bank and open fire in the streets. As the Duchess attempts to encourage her people to remain calm, Vizsla and his men arrive and \"arrest\" the criminals. Satine is then deposed and imprisoned next to former Prime Minister Almec."}, {"tag": "p", "text": "As Vizsla consolidates his power and prepares the Mandalorian people for their return to their warrior roots, Maul suggests moving in on the Council of Neutral Systems and the 2000 systems they control, but the Death Watch leader reveals he has no interest in expansion. Death Watch turns on Maul and Opress, though Vizsla promises to deliver Obi-Wan Kenobi to them."}, {"tag": "p", "text": "As the Zabrak brothers are imprisoned, Maul states that they need a puppet to rule Mandalore and figures that the prison must hold political prisoners suitable for their ends. They then break out and search the prison for a worthy candidate. Due to an indirect comment from Satine, Maul chooses Almec. He then returns to the throne room and challenges Vizsla to a duel for Death Watch's leadership, which Vizsla is honor-bound to accept. They engage in an intense duel with Vizsla gaining the upper hand before Maul destroys his jetpack. Vizsla then shoots Maul's lightsaber out of his hand and charges towards him for the kill. However, Maul overpowers Vizsla with his martial skills and claims his Darksaber after beating him into submission. Stating that only the strong will rule, a defeated Vizsla offers no resistance as Maul decapitates him. Despite his victory, a number of Death Watch dissidents, led by Bo-Katan, refuse to swear fealty to an outsider and flee."}, {"tag": "p", "text": "Almec is reinstated as prime minister. As he addresses the Mandalorian people, he tells them that Satine murdered Vizsla. He then reports to Maul his plans to set up his new administration, the Sith warning that he'd be responsible for their failures. Almec then asks Maul if he has any other plans. Maul only tells him to go and rule Mandalore."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "\"Shades of Reason\" was adapted in the young reader's book The Clone Wars: Darth Maul: Shadow Conspiracy. The episode was originally reported by Star Wars Insider 137 as the fourteenth episode of Season Five, but the reported order was revised following the magazine's publication."}, {"tag": "p", "text": "According to a post for the official Star Wars: The Clone Wars Facebook page as well as the Trivia gallery for the episode on StarWars.com, a mural that appeared on the royal platform of the Sundari Royal Palace, depicting a battle between Mandalorians and ancient Jedi, had a similar artwork style to the cubist artwork Guernica by painter Pablo Picasso. In addition to official statements, the mural's composition (characters positioned on the left and right sides of the image) and theme (soldiers on the right aiming guns and a sword) are similar to that of another painting by Picasso, Massacre in Korea. StarWars.com confirmed that the Royal Palace mural was a different painting from the one in Governor Vizsla's residence in \"The Mandalore Plot\"."}, {"tag": "p", "text": "In the early stages of the episode, the makers had planned for a scene where after Vizsla was defeated, his severed head would roll down the stairs. This was cut later because it was deemed too graphic. Unlike a similar edit in \"Eminence\", this was cut very early in the episode's development, although it was eventually restored in the DVD/Blu-Ray release."}, {"tag": "p", "text": "The trivia gallery for the episode confirmed that the place that Ziton Moj attacked in the episode was Peace Park from \"The Mandalore Plot,\" which also retained the scars from the Death Watch bombing from the same episode."}, {"tag": "p", "text": "The tour droid that got blasted in this episode bore the same body design as the droid that gave Anakin Skywalker and Padmé Amidala a lift at Mos Espa in Attack of the Clones. The Mandalore Banking Center was likewise a redesign of the Mandalorian Hospital in Season 3."}, {"tag": "p", "text": "The episode's Director's Cut was included in the Star Wars: The Clone Wars The Complete Season Five DVD."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}