{"url": "Shadow_Arsenal", "categories": ["Category:Legends articles", "Category:Weapon stubs", "Category:Missiles", "Category:Nasan Godera's projects", "Category:Superweapons"], "nodes": [{"tag": "h1", "text": "Shadow Arsenal"}, {"tag": "p", "text": "The Shadow Arsenal was the term given to a large quantity of superweapons developed by the Galactic Republic by the end of the Great Galactic War. It was orchestrated by Colonel Laren Omas of Republic Special Forces Division who was involved with weapon research projects and brought together some of the galaxy's greatest scientists who were led by Doctor Nasan Godera. Their mission was to create warheads designed to bring about complete destruction to the restored Sith Empire."}, {"tag": "p", "text": "While Dr. Godera was skeptical, Colonel Omas was successful in the creation of a stockpile of interplanetary missiles that were each equipped with a cloaking device and had continent shaking power. It was hoped that the Arsenal would become the ultimate deterrent for further warfare and that it was a weapon too powerful to ignore or defend against. However, the development team began to fall apart during work on the project and Colonel Omas's death at Hoth led to the program being shut down after each of the scientists went their separate ways. Dr Godera, however, continued to secretly build the Arsenal on Quesh until he realized the destructive power of the finished product."}, {"tag": "p", "text": "The completed weapons proved to be an indiscriminate and catastrophic weapon capable of killing millions of civilians in addition to its intended target. This proved to Dr Godera that he had gone too far on this project and he abandoned the Shadow Arsenal on Quesh. The results of the program led to Dr Godera changing his weapon development methodology as he intended to built future devices intended for either imprisonment, guarding or selectively target its enemies."}, {"tag": "p", "text": "During the Cold War, Ardun Kothe used resources and agents of the Republic Strategic Information Service to locate the Shadow Arsenal. This led to the induction of a seemingly defecting Cipher Nine and used this Imperial Agent to recover the lost weapon codes from Colonel Omas's shuttle on Hoth. Once recovered, Kothe intended to bring a fatal blow against the Sith Empire by using the warheads to destroy Kaas City and end the conflict with the Sith Empire. However, Nine broke the brainwashing program with the aid of Watcher X and killed Kothe's team. But before the agent could secure the arsenal for the Empire, Hunter, another member of Kothe's team and secretly working for the Star Cabal, called in an Imperial bombing run, preventing the arsenal from falling into either galactic power's hands."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}