{"url": "Shaak_Ti%27s_lightsaber", "categories": ["Category:Canon articles", "Category:Weapon stubs", "Category:Incomplete lists", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Shaak Ti's lightsaber"}, {"tag": "p", "text": "A blue-bladed lightsaber was carried by the Togruta Jedi Master Shaak Ti prior to and during the Clone Wars. She wielded the weapon from some point before 22 BBY until it was stolen by Separatist General Grievous during the Battle of Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shaak Ti wielded her lightsaber throughout the Clone Wars, starting with the First Battle of Geonosis in 22 BBY."}, {"tag": "p", "text": "Early in the war, Ti was chosen by the Jedi High Council to oversee the development and training of clone forces on Kamino. The war was quick to come to Kamino, as the Separatists invaded the planet in order to seize the cloning facilities. Ti monitored the battle from Tipoca City's control room. She became involved in the fighting after the droids reached the control room, after which she used her lightsaber to help the clone forces push the droids back to the hangar."}, {"tag": "p", "text": "When the investigation of Jedi Master Tiplar's murder at the hands of CT-5385, who went by the name Tup, was moved to Kamino, Ti and Dr. Nala Se found themselves in a power struggle regarding how to deal with CT-5555, also known as Fives, who had gone against orders and performed a brain scan on Tup. Fives' research led to the discovery of an inhibitor chip, which he found to be within every clone. As Ti and Se were tracking the renegade, Se left the control room to confront him. A suspicious Ti followed the doctor to the embryo room, where she found the clone pointing a blaster at Se's head. Ti ignited her lightsaber as a warning to Fives, who proceeded to explain what had happened and what he had discovered. Ti, knowing that Se would have Fives terminated, decided that Fives and all data on Tup be sent to Coruscant, rather than let him be killed by the doctor."}, {"tag": "p", "text": "Later in the war, the Jedi Council reluctantly decided that the only way to cease the fighting was to kill Separatist leader Count Dooku. They chose Quinlan Vos, who trained to assassinate the Count with Asajj Ventress, a former Sith assassin and apprentice to Dooku who was now working as a bounty hunter. Their plan failed, and Ventress was forced to seek the Jedi for help. She was brought before a small group of Jedi, including Ti, who all ignited their lightsabers in defense. After learning of the situation they de-activated their lightsabers and agreed to help her."}, {"tag": "p", "text": "Nearing the end of the war, the Separatists staged a massive invasion of Coruscant. Ti, along with Jedi Knight Roron Corobb and a clone task force, were sent to protect Supreme Chancellor Palpatine from General Grievous. Corobb and the clones fell to Grievous, but Ti managed to fight further. Grievous, however, got the upper hand by electrocuting Ti with electric cables, knocking the Jedi unconscious. Grievous took Ti's lightsaber as a trophy and escaped Coruscant with the captive Chancellor. Despite only owning it for a short time before his death during the Battle of Utapau, the lightsaber was a favorite among Grievous' collection. He used it against Jedi Master Obi-Wan Kenobi during his final duel on Utapau but lost it when the hand wielding the saber was cut off by Kenobi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}