{"url": "Shadow_Four/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Clone trooper pilots", "Category:Shadow Squadron personnel", "Category:Squadron callsigns"], "nodes": [{"tag": "h1", "text": "Shadow Four"}, {"tag": "p", "text": "\"Shadow Four\" was the call sign of a clone trooper pilot who served in Shadow Squadron, a starfighter unit in the Navy of the Galactic Republic. In the first year of the Clone Wars, Shadow Four and his squadron were sent on a mission to destroy the Confederate warship Malevolence. Led by Jedi General Anakin Skywalker, Shadow Squadron piloted BTL-B Y-wing starfighters through the Kaliida Nebula, where the pilots evaded gigantic neebrays. Arriving at the Kaliida Shoals Medical Center, which the Malevolence had targeted, Shadow Four managed to avoid an ion ray launched by one of the battleship's ion cannons. Despite losses caused by the ion ray, the squadron continued its attack on the Malevolence and was eventually able to cripple its starboard ion cannon."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The clone trooper pilot with call sign \"Shadow Four\" served in the starfighter unit Shadow Squadron of the Republic Navy during the Clone Wars. A clone of the Mandalorian bounty hunter Jango Fett, Shadow Four was born on the planet Kamino. In 22 BBY, after the destruction of a Galactic Republic fleet in the Abregado system, the Republic learned about the Subjugator-class heavy cruiser Malevolence. The warship, commanded by the Confederate General Grievous, was armed with twin ion cannons capable of disabling enemy ships. After the Malevolence destroyed a medical convoy in the Ryndellia system, Jedi General Anakin Skywalker assumed that the battleship was on its way to the Kaliida Shoals Medical Center, located near Ryndellia, and devised a plan to stop the cruiser. The Jedi Knight, together with his Padawan Ahsoka Tano and Jedi Master Plo Koon, decided to lead Shadow Squadron, including Shadow Four, through a shortcut in the Kaliida Nebula in order to arrive to the medical center before the Malevolence."}, {"tag": "p", "text": "Departing from the Venator-class Star Destroyer Resolute in BTL-B Y-wing starfighters, Skywalker contacted Shadow Four and the squadron, who checked in with the Jedi General. The squadron then jumped to hyperspace and eventually emerged at the Kaliida Nebula, where Skywalker led the pilots into the nebula. The squadron was caught by surprise upon noticing the space neebrays inhabiting the nebula, but all of the pilots managed to evade the massive creatures. As Shadow Four and his squadron piloted their bombers out of the nebula, the Malevolence arrived from hyperspace. Shadow Squadron began their attack on the battleship, from which several Vulture droids were launched. Grievous then ordered to fire the ion cannon toward the squadron, which was forced to take evasive actions. Shadow Four was one of the pilots that managed to avoid the ray, but a part of the squadron was left disabled in space. The remains of Shadow Squadron continued their attack on the Malevolence, but upon facing heavy laser fire from the turbolasers of the battleship, Tano and Koon advised Skywalker to abandon the original attack plan of targeting the bridge, where General Grievous was. Skywalker eventually agreed and ordered Shadow Four and the rest of the squadron to target the starboard ion cannon in order to prevent the Malevolence from launching its cannons on the medical center. Using proton torpedoes, the Republic starfighters managed to cripple the cannon, preventing the destruction of the medical center."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When the Malevolence launched an ion ray toward Shadow Squadron, Shadow Four was successfully able to evade the ray in time, while some of the pilots were struck by the ion ray, leaving them disabled in space."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The clone trooper pilot using the call sign \"Shadow Four\" was first featured in \"Shadow of Malevolence,\" the third episode of the first season of the Star Wars: The Clone Wars television series. Like all clone troopers in the series, Shadow Four was voiced by Dee Bradley Baker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}