{"url": "Shadow_stormtrooper", "categories": ["Category:Legends articles", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Shadow stormtrooper"}, {"tag": "p", "text": "The shadow stormtroopers, also known as Blackhole stormtroopers due to their association with Agent Blackhole, were specialized Imperial stormtroopers."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Their most distinguishing feature was their all-black armor—a stark contrast to the typical white armor common to other stormtroopers. This unique black armor provided some stealth benefits, which resulted from the stygian-triprismatic polymer material used in the production of the armor. Lord Blackhole also incorporated meltmassif into his shadow stormtroopers for use when he would disable them. Shadow stormtroopers also carried cloaking devices that rendered them invisible, or at the very least enter a state close to such, for a short period of time by warping the light around them."}, {"tag": "p", "text": "They carried a variety of weaponry, from standard issue E-11 blaster rifles, DEMP Ion Pistols, and thermal detonators. Some could use vibroknucklers to hand to hand combat. For boarding actions, breaching charges and fusioncutters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The shadow stormtroopers acted as the personal stormtrooper unit of the head of Imperial Intelligence, Agent Blackhole, which earned them their moniker of \"blackhole stormtroopers.\" They frequently underwent special training in infiltration and ambush tactics, and were often assigned to extremely classified missions."}, {"tag": "p", "text": "Shortly after the Battle of Yavin, Luke Skywalker and Leia Organa were sent on a mission to Vorzyd V, the \"Gambler's World,\" where they were to disrupt the Imperial gambling operations with the support of the president of that world. However, the operation was disrupted by Blackhole himself, and platoons of his stormtroopers were seen fighting the local resistance and the Alliance troops."}, {"tag": "p", "text": "Lord Shadowspawn led legions of shadow stormtroopers against New Republic forces at the Battle of Mindor in 5 ABY. These shadow troopers' armor was made of meltmassif, which allowed Shadowspawn to control them completely at will."}, {"tag": "p", "text": "In 11 ABY, a squad of shadow stormtroopers formed a bodyguard for aspiring Dark Lord Carnor Jax during his attempt to take control of the Empire; it is believed that these were soldiers from Blackhole's old elite unit, but it is not known how they had come into service with Jax, or whether their attachment to him implies any contact with Blackhole. It is possible they were some of the forces placed under his command by the Imperial Ruling Council following the Battle of Endor. It is notable that Jax himself had formerly served in Blackhole's old unit. Although crack troops, they were all slain by Kir Kanos on Yinchorr."}, {"tag": "p", "text": "The only noticeable difference between Jax's shadow stormtroopers and the original group were black viewplates on the helmet. The first Blackhole stormtroopers had white viewplates."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sometime between June-July 2008 the StarWars.com Databank retitled the entry from \"Blackhole stormtroopers\" to \"shadow stormtroopers\", however the original URL remained the same."}, {"tag": "p", "text": "Hasbro produced a shadow stormtrooper action figure for the 2006 San Diego Comic Convention, although it was only sold at StarWarsShop.com. The exclusive figure is referred to as a \"shadow stormtrooper\" on the packaging; however, the Databank entry has the name as \"Blackhole stormtrooper\". Hasbro later re-released the action figure as part of the Saga Legends line."}, {"tag": "p", "text": "The LEGO Group Released two Shadow Stormtrooper Minifigures in 2007 in the \"TIE Crawler\" set. Another Shadow Stormtrooper also came with the 2008 \"Imperial Dropship\", and the same toy was rereleased  in 2019 to mark the twenty-year anniversary of LEGO Star Wars with updated minifigures. It also was released by the Lego Group as a limited edition maquette in partnership with Gentle Giant. According to DK's Lego Star Wars mini-figure book the Imperial Dropship set incorrectly labled the Shadow Stormtrooper as an Imperial Pilot."}, {"tag": "p", "text": "In the MMORPG Star Wars Galaxies, Shadow stormtroopers were called \"black hole stormtroopers\" (note the space). In appearance, they were little more than standard stormtroopers with black armor. They would often be given randomly generated names, such as TK-807."}, {"tag": "p", "text": "Star Wars: The Force Unleashed featured stormtrooper variants identified as Shadow Troopers that visually differ from Blackhole stormtroopers, however no Star Wars Legends source ever identified these particular troopers as one and the same. The troopers, as depicted in Star Wars: The Force Unleashed, differ in that the trooper armor is not black in coloration but gray with blue-lit plating. Furthermore, the in-game databank identified these Shadow Troopers as possessing armor that was laced with durasteel fibers, not the stygian-triprismatic polymer material used in the production of shadow stormtrooper or Blackhole stormtrooper armor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}