{"url": "Shadow_Trooper", "categories": ["Category:Legends articles", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Shadow Trooper"}, {"tag": "p", "text": "Shadow Troopers were a branch of Imperial shock troopers deployed during the Rise of the Empire era. These units were often either under the command of stormtrooper commanders, or the Emperor's Shadow Guard. They had many encounters with Galen Marek."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Shadow Trooper armor was laced with durasteel fibers, unlike the stygian-triprismatic polymer material used in the production of the shadow stormtrooper armor. They also had cloaking devices that allowed them to sneak up on enemies without being seen. Their armor was completely different compared to the common shadow trooper who wore the black specialized stealth armor. Their equipment consisted of E-11 blaster rifles, and a specialized built in cloaking device. The armor seen from these troops was painted grey and had blue glowing light panels surrounding them."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "These specialized shock units either served under the command of stormtrooper commanders, or assisting the Emperor's Shadow Guard on classified operations. They had several known encounters with Galen Marek, a secret assassin trained by Darth Vader. A detachment of them were stationed aboard the research vessel Empirical, or Bespin, Kashyyyk, Felucia, Raxus Prime, and even the unfinished DS-1 Orbital Battle Station."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "These troopers visually differ from both the Shadowtroopers created by Desann more than a decade later in 12 ABY, as well as the Clone Shadow Troopers and Shadow stormtroopers as evidenced by the blue-lit panels beneath their durasteel-colored armor. Given the troopers appearance in The Force Unleashed and their portrayal by Hasbro, the troopers armor can be surmised as not being black-colored like shadow stormtrooper armor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}