{"url": "Shadow_trooper", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Shadow trooper"}, {"tag": "p", "text": "Shadow troopers were elite and highly trained stormtroopers that served the Galactic Empire during the Galactic Civil War against the Rebel Alliance. They wore distinguishing black suits of experimental armor coupled with portable cloaking devices, rendering them almost completely invisible and highly suited for stealth missions. Shadow troopers overwhelmed their enemies by attacking in hordes, using various weaponry such as T-21 heavy blasters and flash grenades."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Shadow troopers were highly trained, elite, and fanatically loyal stormtroopers that served the Galactic Empire and carried out its commands. They wore specialized, experimental stealth armor made from stygian-triprismatic polymer that enhanced the shadow troopers' stealth capability and allowed them to avoid sensors. The armor, similar in appearance to standard stormtrooper armor, was entirely black in color, with the exception of the white Imperial crest adorning the left chest."}, {"tag": "p", "text": "Like standard stormtrooper helmets, the armored helmets worn by shadow troopers featured heat dispersion vents and blue-tinted exhaust filters located on each sides of the face. In the same manner, the shadow trooper helmets were equipped with a direct speaker placed between two induction filters on the chin section. The helmet's eye lenses and mouth area were gray in color."}, {"tag": "p", "text": "Shadow troopers were equipped with portable cloaking devices that rendered them almost completely invisible as they moved around. Outfitted with a wide range of survival equipment, weapons in their arsenal included T-21 heavy blasters, flash grenades, E-11 blaster rifles, DLT-19 heavy blaster rifles, and jetpacks."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Shadow troopers' stealth equipment made them highly suitable for missions requiring cunning rather than brute force. They were able to appear out of thin air and surprise their enemies. With their T-21 heavy blasters capable of delivering massive damage at long ranges, and flash grenades capable of disorienting their enemies, these elite shock troops attacked in hordes to overwhelm their opponents."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shadow troopers served the Galactic Empire during the Galactic Civil War against the Rebel Alliance. They were based off their clone shadow trooper predecessors, a variant of the clone troopers that served the Galactic Republic during the Clone Wars. According to Admiral Gial Ackbar of the Rebel Alliance, shadow troopers were elite soldiers who were not to be underestimated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Star Wars Battlefront"}, {"tag": "p", "text": "Shadow troopers first appeared in the new Star Wars canon in Star Wars Battlefront, a 2015 video game developed by EA DICE. For the Star Wars: Force Collection digital card game, trading cards representing shadow troopers were initially titled \"Shadow Stormtrooper\" but were later changed to \"Shadow Trooper,\" in keeping with the nomenclature used in Star Wars Battlefront. The capitalization of both \"Shadow\" and \"Trooper\" was later again used in the Star Wars: The Vintage Collection figure line. Additionally, Prima Games' Star Wars Battlefront Strategy Guide spells the trooper's name as \"shadowtrooper.\""}, {"tag": "p", "text": "Besides being an unlockable appearance customization in Star Wars Battlefront's multiplayer mode, shadow troopers only appear in the game's survival mode, where the player can play as one of two rebel troopers stranded in an area surrounded by Imperial forces. Shadow troopers are part of incoming enemy waves that the rebels must hold off until their extraction. The same scenario can be played in various locations on Hoth, Sullust, Tatooine, and Endor."}, {"tag": "p", "text": "According to Dennis Brännvall, associate design director for Star Wars Battlefront II, shadow troopers were not included in the sequel game due to the addition of another black-colored stormtrooper—the death trooper."}, {"tag": "h3", "text": "Star Wars Legends origins"}, {"tag": "p", "text": "All-black stormtroopers equipped with cloaking devices originated in the Star Wars Legends continuity. They were known as \"shadow stormtroopers\" or \"Blackhole stormtroopers\" and first appeared in the 1979 comic strip Gambler's World by Russ Manning. Additionally, the 2008 Legends video game Star Wars: The Force Unleashed introduced gray-colored stormtroopers with blue-lit plating who also possessed cloaking devices, identified as \"Shadow Troopers.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}