{"url": "Shadow_Three_(Kadavo)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Clone trooper pilots"], "nodes": [{"tag": "h1", "text": "Shadow Three  (Kadavo)"}, {"tag": "p", "text": "\"Shadow Three\" was the call sign of a clone trooper pilot in the Grand Army of the Republic's Shadow Squadron. In 21 BBY, during the Clone Wars, he participated in a battle over the planet Kadavo, in which the Galactic Republic planned to liberate Jedi Master Obi-Wan Kenobi, Clone Captain CT-7567, and a number of Togruta who had all been enslaved by the Zygerrians, a species with close ties to the Confederacy of Independent Systems. During the battle, Shadow Three flew a V-19 Torrent starfighter and was killed by Confederate Commander Asajj Ventress and a squadron of Hyena-class bombers."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "One of the many clones of bounty hunter Jango Fett created on the planet Kamino, the clone trooper pilot using the call sign \"Shadow Three\" was serving with the Grand Army of the Republic's Shadow Squadron during the Clone Wars. In 21 BBY, Shadow Squadron was dispatched to the planet Kadavo as part of a Galactic Republic task force led by Jedi Knight Anakin Skywalker. Skywalker was planning to liberate Togruta slaves—as well as the captured Jedi Master Obi-Wan Kenobi and Clone Captain CT-7567—who were being held inside a Labor Processing Hub on the surface of the planet."}, {"tag": "p", "text": "The Labor Processing Hub was owned and operated by the Zygerrian slavers, who were allied with the Confederacy of Independent Systems, the Republic's enemy in the war. After arriving at Kadavo, Skywalker, his Padawan Ahsoka Tano, and a number of clone troopers landed on the surface and tried to break into the Labor Processing Hub, while the Republic fleet took position above the planet. Soon enough, however, Confederate warships also arrived at Kadavo with the aim of killing the slaves and the Zygerrians alike. A battle broke out between the two fleets over the planet, and Shadow Squadron, flying V-19 Torrent starfighters, engaged Confederate droid starfighters."}, {"tag": "p", "text": "As Shadow Three and two more Shadow Squadron pilots attacked a group of enemy fighters, Shadow Five told Shadow Three to stay close. Shadow Three provided cover for Shadow Five, and the clones successfully destroyed some of the enemy craft. However, the three pilots then fell under fire from Confederate Commander Asajj Ventress—flying her starship, the Trident—and a squadron of Hyena-class bombers. Shadow Three was unable to evade enemy fire and was killed, along with his fellow pilots. Although Ventress broke through the Republic defenses and reached the planet, the Republic eventually won the battle and liberated the slaves."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Shadow Three had brown eyes, fair skin and, as a clone of Jango Fett, stood 1.83 meters tall."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the battle over Kadavo, Shadow Three wore a clone trooper pilot uniform."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shadow Three appeared in The Clone Wars 6, a 2009 comic book written by Henry Gilroy and illustrated by Scott Hepburn. In 2011, the Slaves of the Republic story arc was adapted into three episodes of The Clone Wars TV series' fourth season. The TV adaptation featured a number of major differences from the comic books, however, which resulted in Shadow Three being omitted from the episodes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}