{"url": "Shadow_Stalker", "categories": ["Category:Real-world articles", "Category:Legends one-shot comics", "Category:Star Wars Galaxy Magazine fiction", "Category:Star Wars: Shadows of the Empire (comics)"], "nodes": [{"tag": "h1", "text": "Shadow Stalker"}, {"tag": "p", "text": "Shadow Stalker was a one-shot comic originally serialized in Star Wars Galaxy Magazine 10 and tied into the Star Wars: Shadows of the Empire multimedia campaign by expanding on the character of Jix, introduced in the comic version of Shadows of the Empire. It also serves as the prequel of the comic strip Iceworld, showing the origins of the Frija Torlock replica droid."}, {"tag": "p", "text": "It was released on November 19, 1997 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Darth Vader has a covert agent to take care of his dirty work: Jix. Vader dispatches Jix to take care of an Imperial governor who has defected to the Rebel Alliance. But Jix finds a different, more important traitor, and winds up in a one-man war against a legion of stormtroopers. This one-shot collects the hit serial from Topps' Star Wars Galaxy magazine."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Former Imperial Gunnery Sergeant Wrenga Jixton (a.k.a. Jix) is called before Darth Vader on Coruscant. He evades Vader's castle's security and meets the Dark Lord of the Sith in his meditation chamber (much like the one that will be aboard the Executor). Vader wants Jix to go to Corulag and assassinate Imperial Governor Torlock, who is supposedly planning to defect to the Rebel Alliance. He wants the kill to look like the work of the Rebels. Jix makes it to Corulag and finds a landspeeder under attack by Rebels. Inside, he finds Frija Torlock and a hologram of the governor. Frija tells him that her father is suspected of treason and in\nhiding or in prison. Jix realizes that more is up than he believed when he notes the Rebels who attacked the speeder were actually Black Sun operatives. He takes her to relative safety and then heads for the prison where Governor Torlock has supposedly been taken. Upon breaking in, he finds that the Torlock in the prison is actually a human replica droid (HRD) of Torlock. He is captured by Imperial Admiral Droon, who is in league with the real Frija. (The one he saved was another HRD.) They are dropped into a pit with a dragon slug, but manage to survive. The Torlock HRD then tells Jix that the real Torlock had learned that the Rebels would soon attack Corulag, so he built the two HRDs and made an escape plan. He then learned that Droon and Frija had been conspiring to implicate him as a traitor so that\nDroon could rule Corulag in his place. Jix notes that since Vader wanted Torlock dead or captured (which would've left Droon in power either way), Droon's plan almost succeeded. Jix breaks into Droon's quarters and kills Frija when she tries to kill Droon for saying it was all her idea. He knocks out Droon and notices Droon's collection of lightsabers, taking one with him. Jix reunites the Torlock HRD and Frija HRD and they escape to Coruscant. Jix brings Droon to Vader, where Vader informs Droon of how Jix came to be in the Dark Lord's service. After the mission to Falleen and Jix's subsequent court-martial and escape from Kessel, Vader was on a mission to Aridus when he was nearly killed when a tower he was in\nexploded. He awoke aboard Jix's craft. Jix had been in hiding on Aridus, and in return for keeping the Empire from Jix's newfound \"home\" of Aridus, Jix would do whatever the Dark Lord commanded. Knowing that Vader will not let Droon live with this new knowledge, Jix gives Droon the lightsaber from Droon's quarters and walks out of the room as Vader ignites his lightsaber and kills Droon in a very uneven match. Outside, Jix is thanked by the two HRDs and lies when he tells the Frija HRD that Frija survived the encounter on Corulag. The Frija HRD is happy about this, hugs him, and she and her \"father\" depart from Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Omnibus: Early Victories places this tale, \"Almost three years after the Battle of Yavin...\"."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}