{"url": "Shadowlands/Legends", "categories": ["Category:Legends articles", "Category:Forests and woods", "Category:Kashyyyk locations"], "nodes": [{"tag": "h1", "text": "Shadowlands"}, {"tag": "p", "text": "The Shadowlands, also known as the Shadow Forest and the Nother World, was the dark ground level of the forests of the planet Kashyyyk. It was dark since the sunlight could not reach it through the tall trees and the rich foliage."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Shadowlands were a dangerous place, inhabited by savage beasts like katarns and terentateks. Wookiees seldom went there (by means of wooden elevators) from their platforms. They visited only for ceremonial reasons, such as rites of passage. Famous Wookiees like Chewbacca would often go there to prove themselves against the forest's strong, natural obstacles. It was also a place of exile."}, {"tag": "p", "text": "The creation of the Shadowlands may have been due in part to a malfunctioning terraforming machine created by the Rakata Infinite Empire. According to a holo-adapted interface installed by Darth Revan to better access the ancient data, the planet was incapable of sustaining sufficient levels of production and had to be terraformed in order to export produce. According to Jolee Bindo, the dark side energies of the Star Map and the malfunctioning machine may have led to the accelerated evolution of various species, leaving the Shadowlands extremely dangerous when the Rakata abandoned Kashyyyk."}, {"tag": "p", "text": "When Revan visited the Shadowlands to find the Star Map for a second time, he found Jolee living in a hut in the depths of the forest. In order for Revan to find the Star Map, he was asked by Jolee to deal with Czerka Corporation employees that were hunting tach glands for use in Tarisian ale. The hunters were displaced when Revan managed to deactivate the sonic field, which they had set up to prevent large predatory animals of the Shadowlands from attacking them. The deactivation resulted in a terentatek rampaging through the camp. Jolee then agreed to shut off a force field that the Czerka crews had set up, allowing Revan to access the ancient Star Map."}, {"tag": "p", "text": "In 3638 BBY, new burial sites were discovered in the Shadowlands of Kashyyyk that gave new information regarding the ancient history of the Wookiees."}, {"tag": "p", "text": "Around 155 BBY, Tojjevvuk fell in the Shadowlands and was killed by the creatures below."}, {"tag": "p", "text": "At some point in time before 1 ABY, a large group of battle droids, including B1-Series battle droids and Droidekas, was abandoned in the Shadowlands below the Rryatt Trail. Later, a group of dark-adapted Gotal hunters and poachers also discovered the dark jungle, built a hunting camp and began exploiting the fierce wildlife."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}