{"url": "Shadows_of_the_Empire_(novel)", "categories": ["Category:Real-world articles", "Category:Legends novels", "Category:Star Wars: Shadows of the Empire"], "nodes": [{"tag": "h1", "text": "Shadows of the Empire (novel)"}, {"tag": "p", "text": "Shadows of the Empire is a 1996 novel written by Steve Perry. It describes the events between the films The Empire Strikes Back and Return of the Jedi. It was part of the Shadows of the Empire multimedia project."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Hardcover"}, {"tag": "p", "text": "Back Cover"}, {"tag": "p", "text": "It is a time of crisis. Han Solo, frozen in carbonite, is being taken to the vile gangster Jabba the Hutt. As Princess Leia mounts a rescue mission and Darth Vader scours the Galaxy for Luke Skywalker, another sinister figure emerges. Cunning and ruthless, leader of a powerful crime syndicate, he will pit himself against Vader for the favor of their mutual master...the dreaded Emperor."}, {"tag": "p", "text": "Inside flap"}, {"tag": "p", "text": "His name is Xizor, Underlord of a galaxywide criminal organization called Black Sun. He seeks to displace Darth Vader as Emperor Palpatine's right hand. To do so, he will hatch a brilliantly evil plan to discredit Vader in the Emperor's eyes. But in the meantime he will join the Dark Lord in an unholy alliance whose common target is the young Rebel hero, Luke Skywalker."}, {"tag": "p", "text": "While Vader and Xizor bait their trap for Luke, Han Solo is being held captive, flash-frozen in a carbonite slab. Mourning the loss of the man she loves, Princess Leia mounts a rescue mission to free Han. She enlists the aid of Luke, who is sharpening his skill in the Force at Ben Kenobi's home on the edge of Tatooine's Western Dune Sea. Skywalker organizes a crack fighting force, including Wedge Antilles and his famous X-wing squadron; Lando Calrissian; and the mercenary Dash Rendar. Yet the fierce battle that ensues to rescue Han will not go according to plan. For the Empire's spies are everywhere."}, {"tag": "p", "text": "What's worse, though he is cold and reptilian, Xizor has a certain predatory charisma that not even Leia can totally resist. Against the judgment of Chewbacca, who has promised Han to keep her from harm, Leia walks willingly into Xizor's lair in a dangerous play of passion and willpower to get the information she needs to defeat him. At the same time, Luke stands in the crosshairs of a conspiracy of assassins and bounty hunters recruited by Xizor's lieutenant, the beautiful but lethal Human replicant Guri. As the struggle between Xizor and Vader intensifies, Luke finds himself the potential prize of the two most evil entities in the galaxy — one who wants him alive, and one who wants him dead."}, {"tag": "p", "text": "In a final, explosive showdown, the Rebels must infiltrate Xizor's impregnable stronghold and fight the combined forces of Black Sun and the Empire in deep space. With death and betrayal looming on every side, Luke, Leia, Lando, and Chewie must use every weapon and resource at their disposal, including the Rebel fleet and some intriguing new allies, if they are to prove victorious. In Shadows of the Empire, Steve Perry adds an exciting new chapter to the Star Wars saga and introduces important new characters and situations no Star Wars fan will want to miss."}, {"tag": "h3", "text": "Paperback"}, {"tag": "p", "text": "It is a time of crisis. Han Solo, frozen in carbonite, is being taken to the vile gangster Jabba the Hutt. As Princess Leia mounts a rescue mission including Luke Skywalker, Lando Calrissian, and a brilliant young pilot, Darth Vader pits himself against a cunning and ruthless rival. Xizor is the leader of a powerful crime syndicate who seeks to supplant Vader for the favor of their mutual master, the dreaded Emperor. Their target: Luke Skywalker. Suddenly Luke finds himself the potential prize of the two most evil entities in the galaxy - one who wants him alive...and one who wants him dead."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Princess Leia organizes a rescue team to save a carbonite-frozen Han Solo from the hands of the infamous bounty hunter known as Boba Fett, who is taking Han to the ruthless Jabba the Hutt. The mission is unsuccessful, and Fett gets away with Han."}, {"tag": "p", "text": "Meanwhile, Darth Vader is hunting down his son, Luke Skywalker, so that he can turn him to the dark side of the Force. However, the leader of the Black Sun criminal syndicate, Prince Xizor, is trying to kill Luke. Xizor pretends that he wants Luke to become an agent of Palpatine's Galactic Empire, just as Vader is trying to realize. Though Vader is aware of Xizor's plans, Palpatine forces his pupil to trust the prince."}, {"tag": "p", "text": "In order to lure Luke over so that he can kill him, Xizor has Princess Leia kidnapped. Luke, Lando Calrissian and Dash Rendar sneak into Xizor's palace from underground to rescue Leia, and this all leads into a conflict that ultimately leads to the palace's destruction. Luke, Leia, Lando and Dash all escape, but so does Xizor. Eventually, a battle plays over Imperial Center where Xizor is killed in the destruction of his own skyhook."}, {"tag": "p", "text": "The novel ends as Luke and Leia plan to rescue Han from Jabba the Hutt's clutches, leading into Star Wars: Episode VI Return of the Jedi."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "When asked about cut or disputed content of the novel, Steve Perry explained, \"I wanted to have Luke and Lando stop at the SW's equivalent of a gas station to use the phone, but nobody thought that was funny except me. At first, everybody was leery of having droids fly the FALCON, didn't want to do it, but I begged them to let me try and toss it if they didn't like it. They decided they liked it.\""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}