{"url": "Shahan_Alama/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Bounty hunters", "Category:Cyborgs", "Category:Males", "Category:Weequays"], "nodes": [{"tag": "h1", "text": "Shahan Alama"}, {"tag": "p", "text": "Shahan Alama was a male Weequay bounty hunter from Sriluur who was active during the Clone Wars. After being kicked out of a pirate gang, he was recruited alongside fellow bounty hunters Aurra Sing and Robonino by the Duros hunter Cad Bane to see how well they would work together. Bane decided to task them with the capture of the mercenary Davtokk, and the trio successfully carried out their mission. Bane, impressed with their teamwork, formed the three into his new posse, and they traveled to the galactic capital of Coruscant to attempt to free the Hutt crime lord Ziro Desilijic Tiure from Republic prison."}, {"tag": "p", "text": "During the raid, the bounty hunters captured several senators, holding them hostage in the Republic Executive Building to force Supreme Chancellor Palpatine to free Ziro. Jedi Knight Anakin Skywalker was present in the Senate Building and attempted to foil the bounty hunters' plan, but Alama, Sing, and Robonino managed to find and incapacitate him. Palpatine agreed to free Ziro, and after the Hutt was released, the bounty hunters escaped with Ziro, leaving a system of explosives in the atrium to use the senators as leverage for their escape. Afterward, Bane ordered his posse to go into hiding. Alama traveled to the planet Florrum, where he was attacked first by a Confederate frigate and then by nearby Republic forces. He was forced to crash-land on Florrum, where he found the Weequay pirate Hondo Ohnaka, who intended to hold him for ransom."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Recruitment"}, {"tag": "p", "text": "Shahan Alama was a male Weequay bounty hunter from the planet Sriluur. He was a member of a gang of pirates but was eventually deemed too nasty and kicked out, earning him a bad reputation among other pirates. At some point during his career, he stole a belt from a Twi'lek noble, and by approximately 21 BBY he had the arm of a combat droid grafted onto his right elbow. During the Clone Wars, Alama, along with the technician Robonino and the Jedi-turned-hunter Aurra Sing, was recruited by the Duros bounty hunter Cad Bane to see how well they would work as a team. Bane hoped to use them in his upcoming mission to free the Hutt crime lord Ziro Desilijic Tiure from Republic prison on the galactic capital of Coruscant. Ziro had been placed in the Republic Judiciary Central Detention Center for his role in the kidnapping of his great-nephew, Rotta, and Bane had been hired by the Hutts to free him—but first he wanted to assess the hunters' ability to work together. Bane decided to test the trio by having them capture the bounty hunter Davtokk on the planet Keyorin. The Duros convinced Davtokk to come to Keyorin by telling him that he needed recruits, although Bane knew that the hunter would betray him for the large bounty on the Duros's head. When Davtokk arrived on Keyorin, he met Bane in an explosives-wired building and abruptly shot him, only to find that what he had shot was actually a B1-Series battle droid mannequin of Bane."}, {"tag": "p", "text": "Davtokk was instantly ambushed by Robonino, who detonated the building's explosives, forcing the hunter outside. Alama was waiting for him and quickly caught him in a razor net. The hunter managed to break free and use a flash grenade to evade the onrushing Weequay, but Davtokk was abruptly shot through the knees by sniper fire from Sing. Bane then arrived on the scene and killed Davtokk. Pleased with the trio's performance, Bane took his new posse to Coruscant to prepare for the operation to rescue Ziro. Bane's plan was to capture several senators and hold them hostage, using them as leverage to force Supreme Chancellor Palpatine to free Ziro."}, {"tag": "h3", "text": "Raid on the Senate"}, {"tag": "p", "text": "The mission began as Bane and Alama, along with two BX-series droid commandos and an IG-86 sentinel droid, landed at the entrance to the Republic Executive Building in an airspeeder. As they were confronted by a squad of Senate Commandos, a unit within the Senate Guard, Sing attacked the squad with sniper fire from a nearby building, and the commandos were quickly eliminated. Sing and Robonino flew down to the entrance in another airspeeder with several more sentinel droids. Leaving the droid commandos outside, Alama, Sing, Robonino, Bane, and the sentinel droids entered the Executive Building. Robonino stayed in the building's power control room to shut down the building's power, while the others continued to the East Wing, sabotaging the Senate Guards' barracks along the way. The group reached the atrium, which was filled with several senators who had gathered to discuss the Enhanced Privacy Invasion Bill. The bounty hunters quickly surrounded them, taking them hostage. With the captives secured, Bane contacted Supreme Chancellor Palpatine and requested that Ziro be released. As Palpatine refused, Robonino successfully shut down the building's power and activated the emergency lockdown, trapping Palpatine and Senator Orn Free Taa in the Chancellor's office."}, {"tag": "p", "text": "Jedi Knight Anakin Skywalker—who had been spending time in the Senate Building with his secret wife, Senator Padmé Amidala, when the attack began—found the senators being held hostage and spied on the events taking place. Noticing Skywalker, Bane opened fire on the Jedi, who quickly took off running. Recognizing the Jedi as a potential threat to the mission, Bane sent Alama and a sentinel droid after him. As they searched the building, Alama and the droid heard Skywalker in a room, speaking with Palpatine via comlink. The Jedi hid before they walked in and proceeded to use a mind trick on the Weequay to get the pair to leave. After Alama and the sentinel droid split up to continue the search, Skywalker attacked the droid; but since he had earlier given his lightsaber to Amidala, he was forced to engage the droid in hand-to-hand combat."}, {"tag": "p", "text": "By the time Alama returned to the scene, Skywalker had escaped, but after examining the droid's remains, Alama deduced that the Jedi was not in possession of his lightsaber. Alama reported this finding to Bane and continued the search with the help of Sing. They found Skywalker trying to break into the power control room, but the Jedi pulled Alama's blaster out of his hand before the Weequay could shoot. Alama suddenly ducked, and Sing, who had been standing right behind him, took aim at the Jedi, shooting Alama's blaster out of Skywalker's hand. Robonino ambushed the Jedi from behind, shocking him and knocking him out, and the hunters put the unconscious Jedi in stun cuffs and took him to Bane."}, {"tag": "p", "text": "Palpatine, meanwhile, finally agreed to give a pardon disc to Senator Taa, who was to deliver the disc to the prison so that Ziro could be released. Sentinel droid HELIOS-3D then escorted the freed Hutt back to the Executive Building, where Bane, Alama, and the team set up a system of lasers around the hostage senators that, if triggered, would set off explosives and detonate the entire atrium. Bane held an alternate detonator for the explosives and used it as leverage to ensure his team's escape. As they flew away, Bane activated the explosives as payback for the indignities that Ziro suffered while in prison, but Skywalker, who had awoken and retrieved his lightsaber from Amidala, was able to save the senators."}, {"tag": "h3", "text": "On the run"}, {"tag": "p", "text": "Shortly after the bounty hunters escaped, Alama revealed that he didn't trust Bane to hand over his share of the credits. Bane ordered Alama and the other hunters to temporarily go into hiding, and the Weequay traveled out to the Outer Rim Territories in his Flarestar-class attack shuttle. Over the planet Florrum, he ran into Confederate forces under the command of a Neimoidian captain. The captain, believing Alama to be a pirate, ordered his troops to open fire on the ship. Alama began to head for Florrum's surface, but Republic forces stationed nearby arrived on the scene and defeated the Confederates before going on to attack Alama, shooting him down. The Weequay crash-landed his ship on the planet, where he found fellow Weequay Hondo Ohnaka, who was the leader of a group of pirates. Ohnaka then suggested that he would hold Alama captive and give him to whomever was willing to pay him the most."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Alama usually preferred to work alone, but he also worked well with other such solitary beings. His \"excessive nastiness\" caused his membership in a pirate gang to be revoked and earned him a reputation as a bad pirate. The Weequay had a sense of self-confidence about him and was not afraid of confronting Anakin Skywalker, a well-known Jedi Knight. However, Alama proved to be vulnerable to certain Force effects, as Skywalker was able to employ a mind trick on the Weequay. Still, Alama was also observant; during investigations of the sentinel droid that Skywalker had destroyed, he noticed instantly that the droid bore no lightsaber marks. From this observation, Alama quickly came to the conclusion that Skywalker was unarmed. After the bounty hunters escaped with Ziro, Bane told them all to go into hiding. He promised that he'd take care of distributing their earnings, and although Alama didn't trust Bane to do this, he left without his share of the bounty."}, {"tag": "p", "text": "Alama was a highly skilled tracker, a competent pilot, and a proficient gunman; and he acquitted himself as a bounty hunter who was quick with a blaster. For weaponry, Alama carried an LL-30 blaster pistol, a blaster rifle, and a razor net, and he often wore a red beret that he had saved from his tenure as a pirate. He also wore boots of nerf-hide, a belt that he had stolen from a Twi'lek noble, and a combat droid arm that was grafted on his right elbow."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shahan Alama made his first appearance in The Clone Wars webcomic Invitation Only, which led directly into \"Hostage Crisis,\" the final episode of Season One of the Star Wars: The Clone Wars television series, in which Alama also appeared. In the episode, Alama was portrayed by voice actor Corey Burton. Shahan Alama was first identified by name in the episode guide of \"Hostage Crisis\" on StarWars.com, though he was named \"Filonebal\" in writer Eoghan Mahony's original script for the episode. Alama later appeared in the webcomic The Clone Wars: Hunting the Hunters (Part I), and he also received an entry in 2010's Star Wars: The Clone Wars Character Encyclopedia. Alama was pictured in The Art of Star Wars: The Clone Wars, and in the acknowledgments of the book a \"Shahana Alam\" was listed. In 2011, Alama received a non-canonical appearance in the video game LEGO Star Wars III: The Clone Wars, appearing as a playable character in the game's adaptation of \"Hostage Crisis.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}