{"url": "Shadows_of_the_Empire:_Evolution_(TPB)", "categories": ["Category:Real-world articles", "Category:Star Wars: Shadows of the Empire (comics) TPBs"], "nodes": [{"tag": "h1", "text": "Shadows of the Empire: Evolution (TPB)"}, {"tag": "p", "text": "Shadows of the Empire: Evolution collects the five-issue Shadows of the Empire: Evolution series of comics, which served as a sequel to Shadows of the Empire. It was released on February 2, 2000."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Xizor, the leader of the Black Sun criminal organization, has been destroyed, and Guri, a beautiful Human replica droid and Xizor's personal assassin, is left wondering what her future will hold now that she no longer has anyone to answer to. Throughout the ongoing struggle for underworld supremacy, Guri endeavors to uncover hints of her Human side – if it even exists. But in her quest to alter her programming and gain Humanity, Guri becomes the quarry of both bounty hunters and Rebels (led by a Jedi-to-be named Luke). What secrets lie buried in her android mind that make her such valuable prey? Evolution is the sequel to the best-selling novel Star Wars: Shadows of the Empire and is the first foray into comics by best-selling Shadows novelist Steve Perry."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "With Black Sun in shambles, various members attempt to win dominance within the\norganization, while Guri searches for the answer to just how \"human\" a human replica droid can be. Alone in space with her Stinger she single-handedly destroys an Imperial Star Destroyer and continues on her way to Hurd's moon. At about the same time, on Coruscant, Azool, a Falleen antique trader, learns from a Rodian informant, Prevaro, that Guri is alive and soon meets with Kar Yang, a Hiitian bounty hunter whom he hires to track Guri down. As Guri reaches her destination, Yang and his droid companion Lintu discover the remains of the Star Destroyer she destroyed. On Hurd's moon, Guri tracks down her creator, Massad Thrumble.\nShe wants him to reprogram her and delete her assassin programming. He cannot do so,\nhowever, without his droid, Doc, who was kidnapped by the Pike (Pikkel) sisters. She leaves to track Doc down. The women take Doc to Spinda Caveel on Murninkam. Guri tracks them there, but her ship is damaged by a robotic picket ship and crashes in a nearby swamp. At Hurd's moon, Yang speaks with Thrumble and learns where Guri has gone. Back on Murninkam, Caveel wants Doc to program one of his droids to be an assassin.\nOn Coruscant, Prevaro corners Azool and accuses him of being Xizor. When Azool takes off \"his\" mask, however, \"he\" reveals \"himself\" to be Xizor's niece, Savan. As Yang heads for Murninkam, Guri makes her way into Caveel's estate and recaptures Doc. On Coruscant, a meeting of many powerful Black Sun members is held as they argue over who will take over the organization. From elsewhere, Leia Organa, Luke Skywalker, Han Solo, Chewbacca, and Lando Calrissian observe via video. On Murninkam, Guri and Doc make their way to the Stinger but a newly-arrived Yang, now wanting Guri for himself, puts a tracking device on the ship. The Rebels arrive on Coruscant to negotiate terms with the fractured Black Sun.\nXizor's niece disguises herself as a human and tempts Han Solo, leading them into a\nsituation in which they must save her from assassins. On Hurd's moon, Yang, knowing his droid will stick to the orders they were given, destroys the droid. Guri arrives shortly and is about to be reprogrammed when Yang enters the lab. She kills him and the procedure continues, as Savan heads for the moon. On Coruscant, the feuding members of Black Sun engage in an inter-organizational war for power. The Rebels soon learn of Savan's identity and head to Hurd's moon to find her, even as she and Prevaro and Savan arrive on the moon themselves. They gather some \"scum\" and prepare to attack the lab, even as the Pike (Pikkel) sisters arrive on orders from Caveel to destroy Guri. In the lab, Guri awakens,reprogrammed. The Rebels land on the planet and head for the lab as well. Shortly, the Rebels engage the sisters and Caveel outside the lab, as Savan and Prevaro make their way\ninto the lab. In the street, the Pike (Pikkel) sisters cease fighting and leave Caveel behind. Guri, Doc and Thrumble head for the Stinger, but Savan has set up an ambush. When they arrive at the ship, Guri takes out the goons, showing that she has been reprogrammed, but her reflexes remain to protect her. Unknowing that she has been reprogrammed, Savan uses a Falleen phrase to order her to kill Thrumble and Doc, but she turns on Savan and knocks her out because the phrase no longer works. With Savan in custody, the Rebels introduce themselves to the \"new\" Guri and head away from the moon. As they leave, Guri meets a familiar man in the cantina. They had never met formally, but he recognizes her from his past experiences. The man is Dash Rendar, and a new partnership is formed."}, {"tag": "h2", "text": "Collected issues"}, {"tag": "h2", "text": "External links"}]}