{"url": "Shalla_Nelprin", "categories": ["Category:Legends articles", "Category:Females", "Category:Galactic Alliance Intelligence personnel", "Category:Humans", "Category:New Republic Intelligence personnel", "Category:Wraith Squadron personnel"], "nodes": [{"tag": "h1", "text": "Shalla Nelprin"}, {"tag": "p", "text": "Shalla Nelprin was a female Human X-wing pilot from Wraith Squadron who was selected for her proficiency in hand-to-hand combat, and for her knowledge of Imperial Intelligence doctrine and tactics."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Nelprin family was fairly well known in the New Republic Defense Fleet for their proficiency in unarmed combat. Shalla's father was Vyn Narcassan, a Galactic Republic intelligence officer who disappeared after the rise of Palpatine's Galactic Empire. He was hunted by the Imperials but was never found. Nelprin and her sister, Vula, were both trained by Narcassan in hand-to-hand techniques, leading Vula to become a successful instructor in the art. Vula was Kell Tainer's instructor, and could toss him around like a rag doll—Nelprin claimed she was even better, and her performance supported this."}, {"tag": "p", "text": "She managed to infiltrate Zsinj's headquarters, thanks to Kell's previous mention of her under an alias, during a previous meeting with Zsinj. However, due to an absent-minded boast during said meeting, she was forced to fight Captain Radaf Netbers in hand-to-hand combat. Face had bragged she could beat a Wookiee, Kell gave details, and this prompted Netbers to try and confirm it. Luckily, Nelprin's own boasts were not exaggerated, leading to Netbers having his nose broken. Shalla (posing under the alias \"Qatya Nassin\" for the mission) worked with several other hired pirates to infiltrate Kuat Drive Yards/Legends and steal the Razors' Kiss for Warlord Zsinj. At one point, Nelprin was able to isolate herself from the group and fake her death using some explosives provided by other Wraiths. In the ships' hanger, Shalla located a customized hyperdrive-equipped TIE/IN interceptor and decided to use the vehicle as an escape craft. Parking beneath the command deck of Razors' Kiss, Shalla waited until Mon Remonda starfighter forces were inbound before targeting the Dreadnoughts' shield generators- rendering the massive vessel vulnerable to attack."}, {"tag": "p", "text": "After her participation in the Battle for the Razor's Kiss with the Executor-class Star Dreadnought Razor's Kiss, Nelprin was promoted to lieutenant and awarded half the kill of the titular ship for her participation in disabling the craft- granting permission to paint half of an Executor-class silhouette on her X-wing. The TIE Interceptor captured prior to the battle would eventually be traded for the ship that would eventually be codenamed Millennium Falsehood for a long-term covert project."}, {"tag": "p", "text": "During the Wraiths' infiltration of  Binring Biomedical Product Shalla faced Netbers a second time- the captain recognized her and she charged him to prevent discovery of her identity. Netbers nearly murdered her, except her squadron-mate Hohass Ekwesh intervened- breaking the mans' neck."}, {"tag": "p", "text": "Although not present during the Wraith operations against the Yuuzhan Vong, Nelprin transferred to New Republic Intelligence Service with the majority of her squadron when they were recommissioned as an intelligence unit."}, {"tag": "p", "text": "Nelprin would again appear in 40 ABY as a member of Intelligence investigating Syal Antilles during the Second Galactic Civil War, no longer a Wraith Squadron member."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}