{"url": "Shan", "categories": ["Category:Canon articles", "Category:Humans", "Category:Imperial Navy captains of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Shan"}, {"tag": "p", "text": "Shan was a male human who served as a Captain in the Imperial Navy of the Galactic Empire. He commanded one of three Star Destroyers sent to the recover the Imperialis—personal pleasure corvette of Galactic Emperor Palpatine—when it was stolen in the Castell system. After Commodore Idel, commander of one of the other Star Destroyers, offered one million credits to whoever captured the corvette, Shan tried to use his vessel's tractor beam to secure it. Captain Conro of the third Star Destroyer had the same idea, and the two vessels' beams locked onto each other causing the ships to collide and allowing the Imperialis to escape."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male human Shan served the Galactic Empire as Captain of one of the Imperial Navy's Imperial-class Star Destroyers. His vessel and two other Star Destroyers under the commands of Captain Conro and Commodore Idel respectively, were sent to the Castell system in order to prevent the escape of Galactic Emperor Palpatine's personal pleasure yacht Imperialis, which had been stolen from Imperial Orbital Shipyard CC-24 by the smuggler Lando Calrissian and his team of thieves. Upon entering the star system, Idel informed the two captains of their mission via hologram, and then destroyed Orbital Shipyard CC-24 to make an example of those who lost the Emperor's property. The Commodore then ordered Shan and Conro to stand by while he dealt with Calrissian and his companions, releasing a pair of gravity mines designed to stick to the hull of the Imperialis and prevent it from jumping out of the system."}, {"tag": "p", "text": "The yacht's defense system destroyed the two mines before they could attach to it, prompting Idel to offer a million credits to the man that captured the Imperialis. Eager to claim the reward, Shan activated his Star Destroyer's tractor beam in order to pull in the yacht. The beam successfully locked onto the Imperialis, but Calrissian had piloted the vessel to lie directly between Shan and Conro's Star Destroyers. Conro had also activated his tractor beam to capture Calrissian, and the two Star Destroyer's tractor beams locked onto each other. Realizing what had happened, Shan screamed for his vessel to disengage but was too late, and the two Star Destroyers crashed into one another as the Imperialis escaped."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Shan was a fair-skinned human with brown hair. He considered the use of three Star Destroyers to capture a single yacht overkill, but was happy to take up the challenge once Idel put one million credits on offer. When he caught the Imperialis, Shan was pleased with his crew and ordered that they send commiserations to Conro."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shan first appeared in the second issue of the Star Wars: Lando comic book mini-series. The comic was published in 2015 and was written by Charles Soule with illustrations by Alex Maleev."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}