{"url": "Shanko%27s_Hive", "categories": ["Category:Legends articles", "Category:Bars and clubs"], "nodes": [{"tag": "h1", "text": "Shanko's Hive"}, {"tag": "p", "text": "Shanko's Hive was a drinking and dining establishment located on the inner floor of the asteroid spaceport Borgo Prime. It was known for the chaotic activity that occurred with its walls, the unsavory clientele that it attracted, as well as the drinks mixed by Shanko, who was its owner and bartender."}, {"tag": "p", "text": "Shanko's Hive was a conical structure that stood at least a quarter of a kilometer above the inner floor of Borgo Prime inside its own containment field. Its exterior had a gray-green pigment and had a rippled texture. One had to pay for entry into the Hive."}, {"tag": "p", "text": "Once inside among the first things that a patron would notice was Shanko himself, as well as an odious smell that came from burning objects, some of them customers. The chaotic atmosphere that the clientele of Shanko's Hive produced was augmented by the music (or noise, depending on how one looked upon it) emanating from the instruments of no less than six bands that played at once. Stairways lined the ridged sides of Shanko's Hive, leading to gambling rooms and lodgings in the upper levels."}, {"tag": "p", "text": "While at Shanko's Hive, one could engage in various activies, whether it be drinking, dancing, conversation, blaster battles, or a friendly game of rocket darts. Unruly patrons were by and large tolerated, but if one could not pay for a mess that he created, he would be ejected from the Hive by large bouncer droids."}, {"tag": "p", "text": "It could have been argued that the greatest draw of Shanko's Hive was not the drinks mixed by Shanko, but its diverse clientele, especially of the criminal variety. The Hive was gathering place for information brokers and buyers, smugglers, and others engaged in illicit activity. Shanko took great pride in them, for their presence attracted a great many more paying customers than there would have been had he not tolerated their presence."}, {"tag": "h2", "text": "Appearances"}]}