{"url": "Shar%27Ack", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Articles with elements from unlicensed sources", "Category:Arboreal planets", "Category:Atrivis sector planets", "Category:Galactic Empire planets"], "nodes": [{"tag": "h1", "text": "Shar'Ack"}, {"tag": "p", "text": "Shar'Ack was a planet located in the Shar'Ack system, a part of the Atrivis sector in the New Territories portion of the Outer Rim Territories."}, {"tag": "p", "text": "A forested world, Shar'Ack was the homeworld of the avian sentient species known as the Shaliz'Na. The species produced many artisans, and in combat, its members preferred to use chemically-propelled slughtrower weapons over off-world laser weaponry."}, {"tag": "p", "text": "By the time of the Galactic Civil War, the Galactic Empire controlled all liquor manufactured on and imported to Shar'Ack. The Empire also enslaved the Shaliz'Na, leading to many among the species to become addicted to alcohol. Around that time, the Shaliz'Na musician Tyric had left his native Shar'Ack and was traveling throughout the galaxy, eventually joining the Rebel Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shar'Ack was mentioned in \"The New Rogues Gallery: Unsung Heroes of the Rebellion,\" an article written by Joe Littrell as a supplement for West End Games' Star Wars: The Roleplaying Game and published in Polyhedron 59 in May 1991. Since the article was released outside of the Lucas Licensing process, its canonicity within the Star Wars Legends continuity was never confirmed."}, {"tag": "p", "text": "However, Jason Fry, co-author of the 2009 reference book The Essential Atlas, has stated that the star systems listed in the book's Appendix section are named after the most prominent planets or celestial bodies located in those systems. This article therefore considers the existence of the planet Shar'Ack to be canonical with respect to the Legends continuity. The Essential Atlas placed the Shar'Ack system in grid square L-5."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}