{"url": "Shanna_Kinn", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Females", "Category:Humans", "Category:Technicians"], "nodes": [{"tag": "h1", "text": "Shanna Kinn"}, {"tag": "p", "text": "Shanna Kinn was a Human female criminal and mechanic from the planet Dorriella. She worked for the Bith Fiz Cor'gril as an acquisitions specialist acquiring stolen parts and sometimes even stolen ships."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Shanna Kinn was born on the planet Dorriella as the youngest of three children. She learned starship repair from her two older brothers. When the Galactic Empire invaded Dorriella her family was killed in an Imperial raid on a suspected Rebel hideout. She lived off the streets using thievery to survive and eventually stowed away on a passing freighter. She traveled around the galaxy for a while and established several underworld contacts as she took illegal jobs to survive. She eventually wound up on the planet Trevi IV where she tried to steal a used starship from Fizzi's Slightly Used Starships. The Bith owner, Fiz Cor'gril caught her but he immediately recognized her intelligence and mechanical aptitude as well as the number of parts she had \"acquired\" and was selling on the black market. He offered her a position and she accepted as she had been looking for more steady employment. Most of the time she spent working on acquisitions but she would also sometimes lend a hand to the Verpine mechanic Garginoolaara, or 'Gargi' as she nicknamed him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kinn was a beautiful Human female in her early twenties around the time of the Galactic Civil War. She kept her hair up to keep it out of her way. She was cold and mysterious and did not reveal to Cor'gril how she acquired her parts and ships although the Bith never bothered to ask anyway. Kinn tended to be hardened and cynical due to her past experiences and harbors a fierce hatred of the Empire. She enjoyed working with 'Gargi' though."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Kinn was intelligent with technical aptitude. She was equally skilled at repairing ships as she was bypassing security systems. She was more adept at subterfuge and stealth rather then resorting to violence although she was decent with a blaster if necessary."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shanna Kinn was designed by John J. Richardson III for the article Fizzi's Slightly Used Starships that was published in Star Wars Adventure Journal 9 in February 1996. It was published as a supplement to the Star Wars Roleplaying Game created by West End Games."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}