{"url": "Shaper_caste", "categories": ["Category:Legends articles", "Category:Yuuzhan Vong castes", "Category:Yuuzhan Vong shapers"], "nodes": [{"tag": "h1", "text": "Shaper caste"}, {"tag": "p", "text": "The shaper caste was the caste responsible for creating all things used by the Yuuzhan Vong."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "This class in Yuuzhan Vong society were considered the equivalent of bioengineers and scientists. Ranging from the mighty Koros-Strohna to simple clothing, the shapers made everything, and techniques were written in instructions known as cortexes, of which there were eight. Adepts were only allowed access to information up to the Fifth cortex with Masters being the only individuals that were capable of giving access to the higher ones."}, {"tag": "p", "text": "The shapers were guided by strict protocols, and deviance from these protocols was grounds for demotion to another caste, or death. This was due to the Yuuzhan Vong religious beliefs which stated that knowledge was incapable of being created as it was given to them from the mind of Yun-Yuuzhan through Yun-Harla's handmaiden Yun-Ne'Shel. As such, this caused a serious lack of ingenuity and inventiveness on the part of the shapers."}, {"tag": "p", "text": "This caste worshiped a particular deity among the pantheon of the Yun'o which was Yun-Ne'Shel, the Modeler. Just as the Warrior caste emulated Yun-Yammka, the Shapers attempted to model themselves after their goddess. This meant that they did not have an excessive level of outward scarring but instead made use of necessary ones. As such, they were often fully tattooed, wore form fitting oozhiths and had special headdresses that displayed their rudimentary emotional state though at times they were capable of controlling the display of the headdress's tentacles."}, {"tag": "p", "text": "When Shaper Initiates entered the rank of Adept, they were required to make their sacrifices to the gods. This involved them being in the Grotto of Yun-Ne'Shel where they sacrificed a hand to the organic creature which was replaced with a Shaper hand which would aid them in shaping new creatures. Furthermore, there was the implantation of a Vaa-tumor which was painful over the years but remodeled their brain to accept the new knowledge they learned over their training. It was believed that the tumor sculpted their brains to match the divine form of Yun-Ne'Shel and by the time they became a Master Shaper, the tumor was required to be removed. Some, however, held an emotional connection to the tumors presence and were sometimes ashamed to admit that they were saddened to see it removed in the ceremony."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Yuuzhan Vong War, the invaders made a number of victories against the infidels of the New Republic thanks to their organic technology. However, as the war progressed, their enemies began to develop mechanical based solutions to the Yuuzhan Vong technology while the Yuuzhan Vong empire was stagnant in its development which potentially meant that they might have lost the war if their enemy continued to progress technologically."}, {"tag": "p", "text": "After continued exposure to the Jedi, the Yuuzhan Vong became intensely interested in this new foe due to their perceived powers from the Force. As all Yuuzhan Vong were blind to it yet saw its usage by the Jedi, they began to fear this threat. Thus, a number of shaper sects were assigned to deal with the Jedi \"problem\". They eventually learned of Emperor Palpatine, the dark side of the Force and Wayland where they attempted to find clues through which they could destroy the Jedi threat. This meant that a number of holy programs were developed which included the attempted Shaping of the Jedi Tahiri Veila and the creation of the voxyn from the vornskrs. Another plot by the Shapers involved the poisoning of the bacta supply on Thyferra."}, {"tag": "p", "text": "As the invasion progressed, Supreme Overlord Shimrra Jamaane recruited the Shaper Adept Nen Yim who had been convicted of heresy due to the actions of her master Mezhan Kwaad. She was then secretly placed in a development program to create new Shaping techniques and fill the Eighth cortex with new knowledge as it was nearly empty; something that the vast majority of the Yuuzhan Vong were unaware of."}, {"tag": "p", "text": "The shaper caste were heavily involved in the Shaping of the galactic capital of Coruscant and reforming it as a simulacrum of their long lost homeworld of Yuuzhan'tar. They were also involved in fixing a number of problems that seemed to originate from the World Brain."}, {"tag": "p", "text": "After the end of the war, the shapers joined their caste brethren by leaving in peace and settling on the living planet Zonama Sekot which departed into the Unknown Regions. The Shapers eventually made contact with the New Jedi Order and were asked to help in the Ossus Project; an initiative to terraform destroyed planets. However, their efforts were sabotaged by the One Sith and their people were made scapegoats by the inhabitants of the galaxy."}, {"tag": "p", "text": "Other shapers living outside of Yuuzhan Vong society on Sekot employed their skills to the inhabitants of the galaxy at large. Although Yuuzhan Vong biots were illegal, enhancements by shapers were desired by the likes of pirates and (very rarely) Imperial officers."}, {"tag": "h2", "text": "Ranks"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}