{"url": "Shar_Dakhan", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Males", "Category:Sith Lords of the Sith Empire", "Category:Sith species"], "nodes": [{"tag": "h1", "text": "Shar Dakhan"}, {"tag": "p", "text": "Shar Dakhan was a Sith Lord active during the years leading up to the Great Hyperspace War. Dakhan ruled over the Sith Space world of Ch'hodos, which served as his primary base of operations. In the year 5000 BBY, Dakhan pledged his fleet to Dark Lord of the Sith Naga Sadow, who at the time was preparing for a war against the Galactic Republic. To celebrate, Dakhan staged a large war rally on Ch'hodos, replete with vast legions of soldiers, warbeasts, and warships. Dakhan's fleet later served in the Sith invasion force in the Great Hyperspace War, with Dakhan himself personally commanding the Sith forces in the attack on the Republic capital of Coruscant. Dakhan's forces were opposed by a numerically inferior group of Jedi and Republic soldiers, but the Sith were defeated. After the defeat in Republic space, Shar Dakhan returned to the Sith Empire with the remaining Sith forces, and participated in a skirmish near Korriban against pursuing Republic forces. Towards the end of the battle, Sadow found himself trapped and fled; Dakhan subsequently took charge of the force, although he would be defeated again."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Shar Dakhan, a male member of the Sith species, was a Sith Lord in the years leading up to the Great Hyperspace War. Dakhan ruled over the world of Ch'hodos, located in the northern part of the Unknown Regions area of Sith Space, which served as his central base. In 5000 BBY, after the death of Dark Lord of the Sith Marka Ragnos, the expansionist Sith Lord Naga Sadow came to power. After defeating his rival, Ludo Kressh, in the Battle of Khar Delba, Sadow announced his plans to attack the Galactic Republic. Dakhan supported Sadow and pledged his personal fleet to Sadow's war effort. Soon afterward, Dakhan hosted a war rally at his personal fortress on Ch'hodos, replete with legions of Sith Massassi warriors, dozens of warships, and Sith war behemoths. Dakhan himself rode astride a large green Sith war rhino."}, {"tag": "p", "text": "Dakhan later accompanied Sadow's invasion force in the Great Hyperspace War, and personally commanded the Sith attack on the Republic capital of Coruscant after Sadow demanded that Dakhan and the Sith force capture the planet. Dakhan's assault pushed the Republic forces back to the steps of the Senate Hall. Sadow aided Dakhan by enhancing his numbers with some of his Sith illusions, which made it appear that his force was much larger. A small group of Jedi and Republic soldiers defended the Senate Hall, holding the building until Sadow's concentration was broken and the illusions disappeared. Emboldened, the Jedi charged on Dakhan's force and defeated them. Dakhan survived the battle, and returned to the Sith Empire with the remaining Sith forces. The Republic pursued them, and Dakhan participated in the subsequent second battle of Korriban. Sadow was forced to flee the battle towards the end, and Dakhan took over as acting Dark Lord."}, {"tag": "p", "text": "During the subsequent Jedi-Republic counterinvasion of the Sith Empire that followed the war's conclusion, acting Dark Lord Shar Dakhan oversaw the defense of the Empire alongside those Sith survivors who chose to continue opposing the Republic. Suicide attacks undertaken at Dakhan's orders managed to successfully expel Republic occupation forces from the Horuset system, during which time Sith survivors began crawling out of the shattered tombs and cities in which they had taken refuge. In the brief lull that followed, a reclusive Sith Lord named Vitiate appeared in their midst and gathered the remaining eight thousand Sith Lords in preparation for a ritual of Sith magic that Vitiate claimed would bring about the destruction of the Republic."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Shar Dakhan was an ardent supporter of Naga Sadow, going so far as to pledge his entire fleet to Sadow's war effort. Dakhan had a flair for celebration, staging a large and ornate war rally on Ch'hodos. As a symbol of his power, Dakhan wore a large gold-colored helm, adorned with horns."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Shar Dakhan first appeared in Tales of the Jedi: The Fall of the Sith Empire, a story arc of the Tales of the Jedi comic book series, written by Kevin J. Anderson. He appeared briefly in one panel of the arc's second issue, Forces in Collision. He later appeared in the series' third issue, in which he was given a larger role. In this appearance Dakhan was illustrated by Dario Carrasco, Jr. In 2008, Dakhan was given an entry in The Complete Star Wars Encyclopedia. Dakhan is also mentioned in Paul S. Kemp's novel Crosscurrent. In it, his last name is misspelled as \"Dakhon,\" a misspelling that also appears in 2012's The Essential Guide to Warfare."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}