{"url": "Sharp_(Resistance)", "categories": ["Category:Canon articles", "Category:Humans", "Category:Males", "Category:Resistance military enlisted personnel"], "nodes": [{"tag": "h1", "text": "Sharp  (Resistance)"}, {"tag": "p", "text": "\"Salty\" Sharp was a human male soldier who served as a sergeant in the army of the Resistance during its war against the First Order. After surviving the First Order's attack on the Resistance fleet, he was amongst the Resistance personnel who managed to reach an outpost on the planet Crait. Sharp was deployed into the trenches outside of the outpost in order to hold off the First Order once they attacked."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sharp, known by the nickname \"Salty,\" was a sergeant in the army of the Resistance during its war against the First Order. In the year 34 ABY, Sharp was amongst those Resistance members who survived the attack by the First Order on the Resistance fleet after it evacuated from the Resistance base on the planet D'Qar. Along with the other survivors, the sergeant arrived at the abandoned outpost on the planet Crait in a U-55 orbital loadlifter transport and was amongst the troops who manned the outpost's trenches in preparation for the First Order's assault."}, {"tag": "p", "text": "General Caluan Ematt climbed out over the trench next to Sharp in order to try and spot the First Order forces with a pair of quadnoculars and in doing so disrupted some of the salt that covered Crait's surface, revealing the red soil beneath. Curious about the salt, Sharp tasted a small amount and then confirmed its nature to the soldier next to him. The First Order attacked soon after, but ultimately those Resistance members who survived the battle escaped on the YT-1300 light freighter known as the Millennium Falcon."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sharp had fair skin, gray eyes and gray hair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "He wore a brown poncho and brown pants and boots on Crait, also carrying a hepta-mag ammunition carrier belt and a helmet marked with his rank. He used a EL-16HFE blaster rifle while battling the First Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Salty\" Sharp was portrayed by key assistant second director Matthew Sharp in the film Star Wars: Episode VIII The Last Jedi, which was released on December 15, 2017, although he was first shown in the \"Worlds of The Last Jedi\" featurette released on December 9. He was only identified by his nickname in the film's credits, but received a surname in the reference book Star Wars: The Last Jedi: The Visual Dictionary, which was written by Pablo Hidalgo and released in conjunction with the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}