{"url": "Shark_(starfighter)", "categories": ["Category:Legends articles", "Category:Aquatic vehicles", "Category:Confederacy of Independent Systems starfighters", "Category:Mon Calamari Shipyards products", "Category:Starfighters"], "nodes": [{"tag": "h1", "text": "Shark (starfighter)"}, {"tag": "p", "text": "The Shark was Commander Merai's personal heavy starfighter during the Clone Wars. It was of Mon Calamari design."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Merai was a military officer who had aligned himself with the Confederacy of Independent Systems, and retained command of a Lucrehulk-class battleship. While outfitted with CIS assets, he made sure to keep the Shark in the hangar, often relying on his own piloting skills to take the fighter out and direct battle actions from it."}, {"tag": "p", "text": "Separatist leader Count Dooku approved Passel Argente's plan to attack Kamino, and Argente decided to employ Merai as the on-location commander of the assault forces. It was a poorly planned and coordinated attack, with the loosely defined objective of destroying the main reactor of Tipoca City, thereby hampering the Republic's ability to create clones. With such limited resources and intelligence, Merai charged headlong into the assault."}, {"tag": "p", "text": "Within minutes, Merai's forces were engaged by Jedi starfighters defending Kamino. Merai's own warship was severely crippled, and true to form, he raced to the cockpit of the Shark. Bent on completing the objective, he pressed on towards to what was believed to be the reactor, only to encounter Jedi and Republic fighters waiting for him en masse."}, {"tag": "p", "text": "Hounded and beset on all sides by the defenders who now became the aggressors, Merai turned the Shark back towards orbit, hoping to destroy as many hyperspace rings as he could, thus stranding the Jedi here on Kamino. With no other option left, he enacted the self-destruct, but even in this, the resulting damage was marginal in light of his own loss."}, {"tag": "p", "text": "The battle concluded as a victory for the Republic, and Merai and his Shark became little more than footnotes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}