{"url": "Shard", "categories": ["Category:Legends articles", "Category:Mineral-based sentient species", "Category:Outer Rim Territories species", "Category:Shards"], "nodes": [{"tag": "h1", "text": "Shard"}, {"tag": "p", "text": "Shards were a silicon-based species native to the planet Orax, who took the form of irregularly faceted cylindrical crystals thirty to forty centimeters in length. Faint pulses of light—thought signals propagating through their \"brains\"—could be seen inside their bodies. Shards were immobile in their natural state, but could be installed in specially modified droids."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Shards on Orax lived in large clusters of crystals which grew among the planet's many hot springs. These colonies consisted of hundreds or thousands of individual Shards, each connected in a group mind via their natural electromagnetic communication abilities. This electromagnetic sense was the only one the Shards possessed naturally. Shards reproduced by growing new Shards directly off an adult Shard, and could live for millennia before succumbing to natural erosion. As expected of a long-lived, unmoving species, Shards were patient, spending all of their time in slow, contemplative thought. Political decisions were made by mutual consensus, which sometimes took centuries to reach."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Human colonists on Orax took a long time to discover that the Shards were sentient. When they did, they developed translator units which allowed the crystalline aliens to translate their electromagnetic pulses into audible speech (and vice-versa). Curious about other worlds, some Shards volunteered to be detached from their colonies and attached into specially modified droids. The Shards began to trade mineral rights for access to droids and computer technology, which their electromagnetic sense allowed them to understand instinctively. Shards in droid bodies, disconnected from their group-mind, became insatiably curious, and almost intoxicated by the new sensory experiences. Individual Shards began understanding the ideas of limited time, thinking and acting much faster than their counterparts in the group-minds. Some of the Shards remaining on Orax regarded this as a corruption of their traditional culture, while others welcomed the knowledge gained from Shards who eventually returned to their colonies."}, {"tag": "p", "text": "When the Shards made contact with the Galactic Republic, it was in the last few decades of its existence. Many of the Shard ambassadors were murdered soon after the Galactic Empire arose. Orax became a mining center using slave labor, and many Shard colonies were destroyed. In order to keep surviving offworld Shards away from their home, all droids were banned on Orax. During the Galactic Civil War, the Shards allied themselves with the Alliance to Restore the Republic in order to free their homeworld. They often worked as droid and computer technicians for the Alliance."}, {"tag": "p", "text": "Though inorganic, some Shards were Force-sensitives. These Shards, installed in droid bodies, formed the Iron Knights, an offshoot of the Jedi Order. Ilum, a survivor of the Great Jedi Purge, and Ilum's daughter Luxum, who fell to the dark side of the Force and was killed by the Yuuzhan Vong, were among them. Another knight named Firkrann was killed during the Clone Wars by General Grievous."}, {"tag": "p", "text": "The Shards should not be confused with the Tsil, another crystalline sentient species similar in appearance and in certain other characteristics."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}