{"url": "Shasfath_Cluster", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Inner Rim star clusters"], "nodes": [{"tag": "h1", "text": "Shasfath Cluster"}, {"tag": "p", "text": "The Shasfath Cluster was an Inner Rim star cluster. Following the Imperial occupation of Cloud City on the planet Bespin in 3 ABY, the Rebel Alliance was forced to search for other sources of the important Tibanna gas. Alliance Captain Eedan therefore tasked a group of Rebel agents with surveying gas giant planets in several star systems, as well as in the Shasfath Cluster. The exploration of the star cluster eventually proved fruitless, and the Rebel scouts continued with their search on the planet Taloraan."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Shasfath Cluster was a remote star cluster located in the Inner Rim. The star cluster contained at least one gas giant–type planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly after the Galactic Empire occupied the Cloud City settlement on the Outer Rim Territories planet Bespin in 3 ABY, the Rebel Alliance, which until then had been acquiring Tibanna gas from Cloud City for use with blaster and laser weaponry, was forced to seek other sources of Tibanna. To that end, Captain Eedan of the Alliance's Ordnance and Supply section tasked a group of Rebel agents with surveying gas giants in several Inner Rim and Expansion Region systems for any deposits of Tibanna."}, {"tag": "p", "text": "After finding no usable Tibanna deposits on planets within the Lequabis and Poviduze systems in the Expansion Region and the K'taktaxka system in the Inner Rim, the Rebel scouts explored the Shasfath Cluster in their modified YT-700 Transport, the Jackpot. The group was unsuccessful there as well and continued its search on the Expansion Region planet Taloraan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Shasfath Cluster was first mentioned in \"Wind Raiders of Taloraan,\" an article published in the February 1995 fifth issue of the Star Wars Adventure Journal. The article was written by James L. Cambias and contained a roleplaying game adventure for use with West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas, written by Daniel Wallace and Jason Fry, placed the star cluster within grid square J-14."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}