{"url": "Sharr_Latt", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Humans", "Category:Males", "Category:New Republic Intelligence personnel", "Category:Wraith Squadron personnel"], "nodes": [{"tag": "h1", "text": "Sharr Latt"}, {"tag": "p", "text": "Sharr Latt was a Human male from the planet Coruscant and a member of Wraith Squadron during the Yuuzhan Vong War. After the Battle of Coruscant in 27 ABY, the Wraiths made their way to Borleias, where much of New Republic Fleet Group Three under Wedge Antilles was stationed, and were incorporated into the New Republic Intelligence units under the umbrella of Iella Wessiri Antilles. There, Latt served as an adviser to Jaina Solo on psychological warfare during the New Republic's occupation of Borleias, aiding her in creating the appearance that she was an avatar of the Yuuzhan Vong goddess of deception, Yun-Harla. Latt also helped plan Luke Skywalker's mission to Coruscant to hunt down the deranged Dark Jedi Lord Nyax, though he did not accompany this mission, instead temporarily joining Twin Suns Squadron under Solo to act as one of her personal advisers. At Borleias, he served aboard a B-wing starfighter as a gunner, piloted by a Mon Calamari pilot named Beelyath, and was responsible for launching the Goddess missile as Twin Suns Ten, luring several Yuuzhan Vong pilots to their death in a dovin basal minefield as they chased the projectile."}, {"tag": "p", "text": "In 44 ABY, after the Wraiths were disbanded during the Daala administration, Latt was recruited by his former leader Loran to reform Wraith Squadron. He recruited and led a team of operatives tasked with investigating Galactic Alliance General Stavin Thaal, who was suspected of conspiring against the government. Latt's team was able to gather evidence that implicated Thaal, but stumbled across another Wraith Squadron team during their investigation. The two teams were discovered and pursued by forces loyal to Thaal, but managed to escape and join forces under the command of founding Wraith Squadron member Voort saBinring. Latt then assisted in creating a complicated series of ruses that lured Thaal to Kuratooine, where the Wraiths exposed his treachery and ultimately captured him. Following their success, Latt continued to serve as part of Wraith Squadron, which had been officially reinstated by Garik Loran."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sharr Latt was a native of Coruscant. At some point in his life, he joined the New Republic Defense Force and became part of Wraith Squadron as a psychological warfare expert around the time of the Yuuzhan Vong War."}, {"tag": "h3", "text": "Adviser to a goddess"}, {"tag": "p", "text": "Latt was present along with other members of the Wraiths during the Siege of Borleias. After Jedi Knight Jaina Solo arrived from the Hapes Cluster to join the New Republic garrison at Borleias, she discussed the possibility of using a Yuuzhan Vong suspicion that she was related to their deception goddess, Yun-Harla, against the Yuuzhan Vong in the Pyria system. The garrison commander, Wedge Antilles, saw potential in her idea and assigned two pilots of Wraith Squadron, Latt and Gamorrean Voort saBinring, to help Solo execute her disinformation and psychological warfare campaign. This essentially involved creating the appearance of Solo being an avatar of Yun-Harla."}, {"tag": "p", "text": "In their first meeting, Latt took the opportunity to casually flirt with Solo, though she rejected his overtures flatly. Instead, he informed her that he and saBinring would be her advisers, supervising her deification into Yun-Harla. He criticized some of the deceptions she had employed against the Yuuzhan Vong at Hapes—such as when Solo fired tracers at enemy vessels that gave the Yuuzhan Vong ships her sensor signature, causing them to fire on one another—saying they were too one-dimensional and that they could be eventually deciphered. Latt advised Solo that as a goddess, she needed to have an endless supply of deceptions to continually confound the Yuuzhan Vong, ones that they couldn't figure out. Solo agreed and also began taking up several other mannerisms that marked her as special and even worthy of a deity, such as not doing manual labor and only doing work related to creating deceptions or combating the Yuuzhan Vong. Latt noted that he and saBinring fit into that plan by serving as the unusually dressed and mannered companions that one might expect a goddess to keep around her."}, {"tag": "p", "text": "Latt also aided Solo in making her personal squadron, Twin Suns Squadron, into the personal bodyguard of a goddess. Their unit saw looser regulations, full torpedo loads, and had a separate mess from the rest of the pilots, even the elite squadrons of the Borleias garrison. He also told her that she could have a porter to act as her personal servant and Solo chose her boyfriend and fellow Twin Suns pilot Jagged Fel for the role with glee. However, when informed of his new duty, Fel rejected the plan. Latt was at first indignant, but Fel informed them that he had a better person in mind for the role: Jedi Master Kyp Durron, who was also in Twin Suns Squadron. Latt liked this plan better and furthermore recommended that all the pilots in Twin Suns have their titles and ranks inflated to help elevate their prestige, as the unit's unorthodox command structure would not be affected by the addition of ranks or titles. Also, when Solo allowed her pilots to decorate their snubfighters however they pleased, Latt suggested that Solo decorate her own craft with images of voxyn, a Yuuzhan Vong-created creature designed to kill Jedi. Solo had already faced off against voxyn and survived, but the beasts had slain several of her friends; Latt therefore figured that having Solo identify herself with such a symbol would confuse the Yuuzhan Vong."}, {"tag": "h3", "text": "Service in Twin Suns"}, {"tag": "p", "text": "Latt later joined Twin Suns Squadron and flew with the unit during the final stages of the Battle of Borleias. In this capacity, he served as the gunner for a B-wing starfighter, which Solo had been given. While a Mon Calamari pilot named Beelyath flew the craft through groups of coralskippers, Latt manned the weapons station of the starfighter. As a wave of coralskippers closed in on the Twin Suns' position, Latt fired off the Goddess missile, a specially engineered projectile that emulated the specific gravitic signature of Solo's starfighter. As the Yuuzhan Vong craft's sensors operated on gravitic frequencies, they were fooled into chasing the missile. Latt then remotely piloted the missile through a dovin basal minefield, luring many Yuuzhan Vong fighters to their demise before slinging the missile around a mine and ramming it into the final pursuer. Shortly after this, however, the Executor-class Star Dreadnought Lusankya rammed the Domain Hul worldship, effectively marking the end of the battle, as the New Republic forces withdrew thereafter. Although Borleias had been lost, the New Republic had inflicted heavy casualties on the Yuuzhan Vong forces and had slain one of the premier strategists of the Yuuzhan Vong, Czulkang Lah."}, {"tag": "h3", "text": "Wraiths reborn"}, {"tag": "p", "text": "Latt survived the events of the Yuuzhan Vong War, but Wraith Squadron was disbanded when Natasi Daala became the Chief of State in the New Republic's successor state, the Galactic Alliance, and Latt retired. However, in 44 ABY, following the overthrow of the Daala administration, Latt was re-recruited by his former leader Garik Loran to unofficially reform Wraith Squadron in order to investigate the head of the Galactic Alliance Army, Stavin Thaal. Thaal was suspected of involvement in the Lecersen Conspiracy, which had nearly deposed the government a year prior before being discovered and stopped. To accomplish this mission, Latt recruited Wran Narcassan, a sniper and close-quarters combat specialist, a communications expert and slicer named Thaymes Fodrick, a Wookiee talented in infantry operations and wilderness survival named Huhunna, and a Devaronian medic named Drikall Bessarah."}, {"tag": "p", "text": "Latt's Wraiths investigated one of Thaal's bases on Vandor-3 and Fodrick and Huhunna infiltrated the nearby settlement of Ackbar City as they gathered information. Fodrick devised transponder devices which were covertly attached to bacta casks in an army base on Coruscant, which transmitted their whereabouts back to Latt. When several of them ended up in Ackbar City, outside of a normal army base, Latt concluded they had been stolen and took his team to investigate. Though Loran had initially warned them away from Ackbar City, they decided to check out their evidence after Loran disappeared."}, {"tag": "p", "text": "After finding a subterranean facility manned by Thaal's elite Pop-Dog soldiers, Latt's Wraiths ventured belowground to investigate by boarding a ground vehicle. While underground, they determined that Thaal was crooked, running an operation to acquire supplies to set up his own private empire with the help of his loyal Pop-Dogs. While underground, Latt's team ran into a separate Wraith team led by Latt's former colleague Bhindi Drayson. After a quick stand-off, the two teams realized they were on the same side, more so when Latt was recognized by Myri Antilles in Drayson's team, whose father had founded Wraith Squadron and who had met Latt when she was a little girl. Loran had put together two Wraith teams, unknown to either Drayson or Latt, and they had stumbled upon the same objective. Their combined infiltration efforts triggered an alarm."}, {"tag": "p", "text": "Fleeing the Pop-Dogs, Latt and his team followed Drayson's team up on ropes and winches through the lift shaft that the alternate Wraith team had entered through. Both Wraith teams were able to escape, meeting up with a getaway speeder piloted by Voort saBinring, another former Wraith who had joined Drayson's team. The united Wraith Squadron teams fled in their speeder with the Pop-Dogs in hot pursuit. As hostile speeders closed on them, Latt ordered Fodrick to combine the data he had gathered with the information collected by Drayson's team and transmit it to the proper authorities, but their signals were jammed. The lack of clear authority between Drayson and Latt did little to aid their situation, but they ended up heading towards the derelict Mount Lyss Meteorological Station."}, {"tag": "p", "text": "During their flight, Antilles, accompanied by Jesmin Tainer from Drayson's team, slipped away from the speeder in an attempt to avoid the jamming and transmit either their findings or a call for help. To act as a diversion, Drayson decided to also debark and lay down covering fire. Latt was asked for someone on his team to help and he sent Huhunna due to her skill in rough terrain. saBinring piloted Latt and the remaining Wraiths to the abandoned station where they hunkered down. Latt took command, assigning some of the Wraiths to defensive positions to play for time while Antilles and Tainer sent their messages. He assigned other Wraiths to scope out the station for resources, escape routes, and weaknesses. Lastly, he set aside the two Duros civilians whom Drayson's team had rescued, Usan and Dashan Joyl and a Clawdite Wraith from Drayson's team named Turman Durra whom Bessarah had sedated during their entrance into the concealed base after mistaking him for a sentry."}, {"tag": "p", "text": "When the Pop-Dogs brought in several self-propelled plasma artillery vehicles, Latt pointed out the artillery would not remain in the area for too long, as they were almost certainly stolen vehicles that Thaal would not want to be seen in the open due to being reported destroyed in exercises. The Pop-Dogs nevertheless surrounded the station and began firing on them with both blasters and the artillery, though Narcassan was able to destroy one of the artillery units with his laser rifle. The siege was maintained through the night, with Huhunna and a badly-wounded Drayson returning in the early morning. Drayson's wound was mortal and despite Bessarah's efforts, she passed away after insisting that they not surrender. Her final words were to saBinring and Latt to \"get these kids home safe.\" In light of her death, saBinring took command, and Latt did not voice any objections, knowing that saBinring had far more experience."}, {"tag": "p", "text": "The Wraiths were rescued by the arrival of Wedge Antilles and his wingman Tycho Celchu, who had responded to Myri's distress signal and arrived after obtaining StealthX starfighters. Their aerial assault drove off the Pop-Dogs long enough for an evacuation shuttle piloted by another former Wraith, Kirney Slane, to convey them to safety on Corellia. Regrouping, they headed in small groups to Kuratooine, the likely destination for Thaal when the treacherous general decided to hatch his private empire scheme due to its remoteness and a sizable Pop-Dog presence on that world. Latt and Huhuna arrived via airspeeder at a cluster of abandoned prefabricated offices perched on a cliff overlooking an inactive quarry. After learning of a series of naval cargo ship hijackings linked together by all of the seized ships having a communications system produced by HyperTech Industries onboard, Latt hoped that they were connected to Thaal, surmising that at least it was likely they had been involved with the Lecersen Conspiracy. saBinring revealed that after the conspiracy had failed, Thaal was still using the sabotaged HyperTech systems to hijack the cargo in order to fund his extensive black-market operations. Antilles furthermore concluded that the hypercomms were also forwarding key data in their transmission to Thaal, which gave him a considerable bargaining chip to either wield against the Galactic Alliance or sell to the highest bidder. saBinring devised a scheme to lure out Thaal to Kuratooine, dismantle his operations, and expose him as a traitor."}, {"tag": "p", "text": "To accomplish this, he sent Latt back to Coruscant to retrieve Zehrinne Thaal, the general's estranged wife. While on Coruscant, Latt was approached by an army investigator who was asking about Wraith Squadron. He realized that Thaal knew the Wraiths were onto him and deceived the investigator into thinking he was writing and making a living writing self-help quizzes. The investigator's questions also revealed that Thaal was looking for a third Wraith team, which was in fact a ruse of Loran's in order to deceive Thaal and his collaborator, Galactic Alliance Security chief Borath Maddeus, who had originally asked Loran to investigate Thaal while planning to betray Loran and the Wraiths. The fact that the ostensible third Wraith unit was allegedly composed of either fictitious or dead individuals confused the Wraiths, who were unaware that Loran had been misleading Maddeus in the event that Maddeus sent information about the Wraiths to Thaal to hunt down. Upon returning to Kuratooine with Zehrinne Thaal, Latt also saw General Thaal arrive."}, {"tag": "p", "text": "As the Wraiths unleashed a complicated series of ruses to expose Thaal's operation and ultimately capture him, Latt was assigned to bring down Zehrinne from where he'd stashed her in orbit on Skifter Station. She arrived to find Thaal in a public confrontation after being driven into the open by the Wraiths and helped denounce him. He was arrested and taken away, allowing Latt to meet up with the other Wraiths in a delivery speeder re-purposed both for extraction and transmitting messages to lure down Galactic Alliance investigators to arrest Thaal. Once the operation was complete, the Wraiths extracted, returning to Coruscant, where Loran was able to also expose Maddeus. Following the successful takedowns of both Maddeus and Thaal, the Wraiths were reinstated by the new head of Galactic Alliance Security, Garik Loran, with saBinring as the new leader."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sharr Latt was a jokester and a flirt, making multiple advances towards Jaina Solo, all of which were rejected. He routinely tried to make light of numerous situations and employed witticisms and sarcasm in his day-to-day conversations. However, Latt also knew how to be serious, particularly when his job required him to be; as a Wraith, he was dedicated to completing his missions. Many of his more extravagant mannerisms were actually ploys to divert attention from himself even while being the center of attention; people didn't see Latt for who he was as a result. He was a skilled pilot able to hold his own even in an elite unit such as Twin Suns Squadron, capable enough to remotely pilot a missile with enough skill to lead several Yuuzhan Vong starfighters to their destruction. Latt was also an expert in psychological warfare, having been trained in that discipline, and he had no problems with telling a higher-ranking officer when he thought their work in that area could have been better or could use improvement. Latt was also a capable leader, though his primary skillset remained psychological warfare. His specialty was in creating extensive ruses that instilled doubt or mistrust in their targets."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sharr Latt's first appearances were in the Enemy Lines duology, written by author Aaron Allston. While it is possible that he may have been in the Wraiths during other parts of the Yuuzhan Vong War, no source has explicitly stated that. He later appeared in Allston's follow-on novel X-Wing: Mercy Kill."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}