{"url": "Sharlissia_system", "categories": ["Category:Legends articles", "Category:Bon'nyuw-Luq sector star systems", "Category:Confederacy of Independent Systems star systems"], "nodes": [{"tag": "h1", "text": "Sharlissia system"}, {"tag": "p", "text": "The Sharlissia system was situated at the endpoint of the Sharlissian Trade Corridor hyperlane, in the Outer Rim Territories' Bon'nyuw-Luq sector. At various points in time it was controlled by the Brotherhood of Darkness, the Confederacy of Independent Systems, and the Galactic Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Sharlissia system was located in the Bon'nyuw-Luq sector, a part of Trailing Sectors portion of the Outer Rim Territories. It lay at the endpoint of the hyperlane known as the Sharlissian Trade Corridor, which linked it to the Kabal system in the Mayagil sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sharlissia system was situated in space explored at some point between 3000 BBY and 1000 BBY and by the latter year it fell within the territory controlled by the Sith Brotherhood of Darkness. During the first campaigns of the Clone Wars in 22 BBY, the system was located in space controlled by the Confederacy of Independent Systems, and the Fifteenth Army of the Galactic Republic was tasked with defending the system's vicinity against the military forces of the Confederacy."}, {"tag": "p", "text": "By 19 BBY, however, the Sharlissia system no longer lay within Separatist-controlled territories, and it was situated within the borders of the Galactic Empire two years later. The population of the Sharlissia system around 25 ABY numbered from 100 million to 500 million."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sharlissia system was introduced in the 2009 reference book The Essential Atlas, written by Daniel Wallace and Jason Fry, which placed it in grid square N-18."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}