{"url": "Shard_(Oblee)", "categories": ["Category:Legends articles", "Category:Artifacts"], "nodes": [{"tag": "h1", "text": "Shard  (Oblee)"}, {"tag": "p", "text": "The shards were three crystals that were created by the Oblee species."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Thousands of years before the Clone Wars, a shadow creature traveled to the planet Oblis in the Cularin system and settled into the atmosphere of the world. The Oblee, a sentient species that were native to Oblis, came to view the creature as a threat and the Oblee scientist-philosophers built a weapon to harness the abilities of the Darkstaff—a Sith artifact—to repulse the shadow creature from the planet. In order to power their machine, the scientist-philosophers created three crystal shards that could channel the hopes and fears of the Oblee into the Darkstaff. They then placed the shards at strategic locations around Oblis: one mounted on a pole in a marketplace, one on an altar inside a temple that served the Oblee Priests of Nether and one inside a great hall in which the philosophers' weapon had been situated. The entire Oblee species focused their thoughts onto the crystals, to channel their energies into the Darkstaff, and a scientist-philosopher inserted the staff and one of the shards into the machine. The device successfully removed the shadow creature from Oblis, but the Darkstaff used the energy that it had absorbed from the shards to trigger a chain reaction that destroyed Oblis seconds later. The shards were left unharmed by the cataclysm and the Oblee were transformed into incoporeal beings that became known as \"shadow lurkers.\" The Darkstaff continued to draw energy from the Oblee via the shards and as a result, the shadow lurkers were forced to take in energy from anything that they could reach, in order to prevent themselves from being completely absorbed by the artifact."}, {"tag": "p", "text": "The remains of Oblis eventually settled to form the Cularin system asteroid belt and the shards came to be located inside a small asteroid within the belt. In about 21 BBY, a group of freelance agents traveled to the asteroid and the shadow lurkers urged them to destroy the shards, to sever the lurkers' connection to the Darkstaff. However, the Darkstaff learned of the agents plans and it dispatched a team of Believers to prevent the agents from destroying the shards. The agents defeated the Believers and shattered the shards, severing the shadow lurkers' connection to the Darkstaff and allowing the Oblee to be reborn in physical form."}, {"tag": "h2", "text": "Appearances"}]}