{"url": "Sharack_Breev", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Humans", "Category:Scouts", "Category:Sith Empire individuals", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Sharack Breev"}, {"tag": "p", "text": "Sharack Breev was a female Human acolyte who served as a loyal servant of Darth Baras during the Cold War between the Galactic Republic and the resurgent Sith Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A native from Tatooine, Sharack Breev knew the nuances of the desert better than her, and she often works as a scout and tracker. She wouldn't dare venture through any hostile regions, which includes the Sand People. Eventually, she came into Darth Baras's service and became one of his agents during the war."}, {"tag": "p", "text": "In 3643 BBY, she made an encounter with one of Baras' apprentices who was on Tatooine with a mission to find Jedi Master Yonlach. Sharack Breev helped the Sith Warrior retraced the trials of Yonlach's Padawan, Jaesa Willsaam, whom Baras deemed a threat to his plans. She directed the Sith to Izzeebowe Jeef and assisted him in completing the Demon's Blood ritual. Breev later witnessed the Warrior confront and defeat a light side reflection of themselves, revealing Yonlach's location in the Dune Sea. She ran up to the Warrior, warning that their destination lay beyond the Forbidden Pass, where no one has ever returned from. She refused to accompany the Warrior any further and returned to Mos Ila spaceport to report to Baras. Some time later, the Warrior returned unscathed, to the surprise of Breev. Realizing she let fear paralyze her, Breev decided to explore the Forbidden Pass herself and said her goodbyes to the Warrior."}, {"tag": "p", "text": "Breev later sent a message to the Warrior, explaining her successful journey beyond the Forbidden Pass and the discovery of Yonlach's hut, where the corpse of the deceased Jedi Master laid."}, {"tag": "p", "text": "During the Galactic War, Breev became aware that Baras' apprentice had ascended to the position of the Emperor's Wrath and had executed Baras for treason, prompting her to transfer to allegiance to the Wrath. She sent a message to the Wrath, informing her new master that she had spotted Lana Beniko, the Sith accused of murdering Darth Arkous on Lehon, on Tatooine attempting to get lodging with a Jawa clan. She attempted to shadow the fugitive but the Sith could sense her presence and fled to the Wookiee Jakarro's ship and departed the planet."}, {"tag": "h2", "text": "Appearances"}]}