{"url": "Shatras", "categories": ["Category:Legends articles", "Category:Races and species stubs", "Category:Outer Rim Territories species", "Category:Reptilian sentient species", "Category:Shatras"], "nodes": [{"tag": "h1", "text": "Shatras"}, {"tag": "p", "text": "The Shatras were sentient reptilian bipeds indigenous to Trascor."}, {"tag": "p", "text": "Shatras had a gaunt complexion, but they were stronger than they looked, with retained scales in their backs and joints. They had flat heads with two bulbous elongated eyes to each side. Those eyes provide them with infrared vision."}, {"tag": "p", "text": "A Shatras' snakelike neck could rotate up to almost 720 degrees. Due to that flexible neck, it was difficult for another person to sneak up on a Shatras. When finding a sneaking threat, a Shatras could use any of their multiple natural weapons against it: Narrow, clawed hands; talon-like powerful feet; or a very painful bite."}, {"tag": "p", "text": "There were five different races of Shatras, although they can only be distinguished by Shatras or experts. The most common race, Y'tras, composed the 87% of the Shatras population. They were technologically advanced and commonly traveled through hyperlanes."}, {"tag": "p", "text": "The second race in numbers was the Hy'tras, with only a 10% of the population, concentrated in the island-continent of Klypash. They were probably technologically advanced once, but a vast, centuries-long war made them reject technology."}, {"tag": "p", "text": "After that, the Y'tras made a deal with them: Leaving the Hy'tras alone in exchange of their riches. Both parties respected the agreement."}, {"tag": "p", "text": "The other three races, composing a total of the 3% of the population, lived only in portions of Trascor."}, {"tag": "p", "text": "The Shatras had a deeply-imprinted loyalty to their species. Although they could feel a certain animosity towards individual Shatras, a Shatra would never be betrayed to a non-Shatra."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}