{"url": "Shawken_Device", "categories": ["Category:Legends articles", "Category:Superweapons"], "nodes": [{"tag": "h1", "text": "Shawken Device"}, {"tag": "p", "text": "The Shawken Device was a weapon designed to be the most destructive superweapon imaginable."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The weapon's creator intended for it to destroy the universe, but there is no record of a successful test of any kind, nor any evidence to suggest that it was actually capable of doing so. The weapon was intended to accomplish this by destroying the planet Shawken and hurling its fragments through hyperspace to collide with other planets, theoretically setting off a chain reaction that would eventually destroy all matter and end the universe, presumably allowing the birth of another universe."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The weapon was designed by an unknown Shawkenese scientist in the distant past. The unknown scientist who developed the weapon was an extreme nihilist, and believed that the only way to imbue purpose into existence was to destroy the current universe and trigger a new Big Bang, re-creating the universe."}, {"tag": "p", "text": "The scientist's descendant Santor pointed out that he \"never became quite depressed enough to use his device,\" and noted that \"its secrets were lost with his death.\" It was buried underground on Shawken and remained in obscurity for many years, until it was accidentally activated shortly after the Battle of Endor in 4 ABY, by the Corellian con artist Rik Duel and his gang; it was quickly deactivated by Luke Skywalker and Kiro, leaving it a matter of speculation as to whether or not the device actually worked."}, {"tag": "p", "text": "The Empire also heard of the Shawken Device and its destructive output, noting it in the field manual for the Imperial Military, the Imperial Handbook: A Commander's Guide. Luke Skywalker, who at the time had just stopped the device before it could trigger a new big bang, was surprised to see it mentioned in the Handbook."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Shawken Device was introduced in the 1984 comic book Star Wars 87, written by Mary Jo Duffy and drawn by Tom Palmer. The superweapon went unnamed for years until it was nicknamed by Pablo Hidalgo as the \"Shawken Device\" in his article Checklist: 10 Star Wars Superweapons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}