{"url": "Shattered_Empire_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Shattered Empire"], "nodes": [{"tag": "h1", "text": "Shattered Empire 4"}, {"tag": "p", "text": "Shattered Empire 4 is the fourth and final issue of the Marvel comic book mini-series Star Wars: Shattered Empire, set between Star Wars: Episode VI Return of the Jedi and Star Wars: Episode VII The Force Awakens. The comic, written by Greg Rucka and with art by Marco Checchetto, was released on October 21, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "• Concluding the first new-canon comic tale set between episodes VI and VII! • As the Empire Shatters around them, Rebel heroes fight for a better tomorrow! • Greg Rucka (Punisher, Cyclops, Wolverine) and Marco Checchetto (Punisher, Avengers World) take us into the more recent long, long time ago!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Opening crawl"}, {"tag": "h3", "text": "No end in sight"}, {"tag": "p", "text": "The Alliance Fleet is gathered at Muster Point: Stalwart, and Admiral Gial Ackbar briefs the pilots on the planets targeted by Operation: Cinder. General Crix Madine tells them that while they wish the end was at hand, there appears to be no respite from hostilities from the Imperial remnants."}, {"tag": "p", "text": "In the hangar bay, Shara Bey talks to her commander, Captain L'ulo L'ampar. L'ampar remarks that Bey's husband, Kes Dameron, has submitted his paperwork to be mustered out, and that he has taken the liberty of submitting her papers as well. Bey says he should not have done that, but he says she has done more than her fair share for the Rebellion, and it is time for her to settle down with her family."}, {"tag": "p", "text": "Bey is approached by R2-D2, who leads her to Luke Skywalker. Skywalker asks her to accompany him as his co-pilot on a trip to Vetine, to retrieve something he needs to get. He introduces himself and asks if they have met before—Bey responds that she was the pilot who nearly shot down his shuttle during the Battle of Endor, and he remarks on the coincidence that the pilot Artoo fetched happened to be her."}, {"tag": "h3", "text": "Mission to Vetine"}, {"tag": "p", "text": "In hyperspace, Bey asks why she is wearing an Imperial Security Bureau uniform, and Luke tells her she will be impersonating an ISB officer, Commander Alecia Beck, to infiltrate an Imperial base on Vetine to retrieve something the Emperor stole long ago. Using security clearances obtained from the raid at the Wretch of Tayron, Bey and Skywalker are cleared to land on Vetine and are greeted by base commandant Hurron. Bey introduces Luke as her bodyguard, and announces that she is conducting a surprise inspection of the base's laboratories. Hurron escorts them to the inner lab, which he assures them was accessible to only himself and the Emperor. He confesses that he never saw the need for such high security until now, and reveals that he has known of their deception since their arrival—Commander Beck is missing her left eye."}, {"tag": "p", "text": "Hurron asks Luke what is so special about the contents of the lab—two small trees. Luke answers that they are all that remains of the tree which grew at the heart of the Jedi Temple on Coruscant, and that the Force is with them. Hurron responds that the Force is meaningless, and Luke says he couldn't be more wrong. He uses the Force to push Hurron and his stormtroopers away, then catches his lightsaber ejected by Artoo. As Bey shuts down the field holding the trees, she catches them, and the two of them escape."}, {"tag": "p", "text": "In the hangar bay, Hurron orders his troopers to stop shooting and blow the intruders up. The troopers throw several thermal detonators, which Luke hurls back using the Force, killing the commandant and the troopers. Skywalker and Bey board the shuttle and take off into hyperspace."}, {"tag": "h3", "text": "Mustering out"}, {"tag": "p", "text": "Luke says that Artoo overheard Bey's conversation with L'ampar about mustering out, and she says she is trying to decide if that's what she wants. Luke replies that if the cost of their struggle is the lives they fought to protect, then what are they fighting for? He says that he didn't know there would be two trees on Vetine—one is spoken for, but he suggests a good home could be found for the other one."}, {"tag": "p", "text": "In the jungles of Yavin 4, Shara Bey and Kes Dameron plant the second tree in the ground. Dameron takes her hand and says, \"Let's go home, Shara Bey.\""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}