{"url": "Shattered_Empire_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Shattered Empire", "Category:True Believers"], "nodes": [{"tag": "h1", "text": "Shattered Empire 1"}, {"tag": "p", "text": "Shattered Empire 1 is the first issue of the comic book miniseries Star Wars: Shattered Empire, published by Marvel Comics. The issue was written by Greg Rucka, penciled by Marco Checchetto, and published on September 9, 2015. The story is set during and immediately after the events of Star Wars: Episode VI Return of the Jedi."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "For the first time in the new Star Wars canon, journey with us into the time after the end of Return of the Jedi! Writer Greg Rucka (PUNISHER, WOLVERINE, Gotham Central) and artist Marco Checchetto (AVENGERS WORLD, PUNISHER) take us past the destruction of the second Death Star into the chaos of a Shattered Empire."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In the final moments of the Battle of Endor, Green Squadron escorts Gold Leader during the attack on the DS-2 Death Star II Mobile Battle Station's main reactor. Green Four (Shara Bey) intercepts a Lambda-class shuttle escaping from the Death Star, nearly shooting down Luke Skywalker before confirming his identity."}, {"tag": "p", "text": "With the battle station destroyed, Bey and the other surviving pilots return to the Rebel fleet, and are then shuttled to Endor, where the Rebellion is celebrating its victory with the native Ewoks. Bey seeks out and finds her husband, Kes Dameron, and they spend the night together in a hut before Dameron is called out to another mission to destroy an Imperial holdout on the far side of the moon."}, {"tag": "p", "text": "Bey volunteers as the mission's pilot, and as Dameron and the Pathfinders unit start their attack, he mentions that he was thinking they should find a nice planet and build a house. Bey questions his timing of such a proposal in the midst of a battle, and worries as the strike team is inside the base for a long time."}, {"tag": "p", "text": "As they emerge, Han Solo announces that the computers in the outpost contain a lot of data and communications, including details of many Imperial plans, and that \"It's not over yet.\""}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The Marvel comic miniseries Star Wars: Shattered Empire was first announced on March 10, 2015 as part of the Journey to Star Wars: The Force Awakens series of novels, comics, and other books leading up to the December 18, 2015 release of Star Wars: Episode VII The Force Awakens. Shattered Empire was announced as the title of the comic series on March 13, 2015. The announcement was made on StarWars.com and included the first issue's cover, featuring the main original trilogy characters from the final scene of Star Wars: Episode VI Return of the Jedi."}, {"tag": "p", "text": "In celebration of Star Wars Day on May 4, 2016, Marvel re-released Shattered Empire 1 as part of its \"True Believers\" budget reprint program, which reprints popular comic titles for the suggested retail price of $1."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}