{"url": "Shatterpoint_(novel)", "categories": ["Category:Real-world articles", "Category:Clone Wars novels", "Category:The Essential Legends Collection"], "nodes": [{"tag": "h1", "text": "Shatterpoint (novel)"}, {"tag": "p", "text": "Shatterpoint is a novel written by Matthew Stover. The first novel in the Clone Wars novel series and the first released in the Clone Wars multimedia project, it was originally published as a hardcover by Del Rey in June 2003. The paperback edition was published in April 2004, with a prologue by George Lucas and the short story Equipment, also written by Stover. The eBook of Shatterpoint was released in December 2005. The novel was republished on June 15, 2021 as part of The Essential Legends Collection."}, {"tag": "p", "text": "The story centers on Jedi Master Mace Windu as he attempts to rescue his former Padawan, Depa Billaba, from his homeworld of Haruun Kal. Caught up in the Summertime War, Mace found himself dealing with, among other things, the religious consequences of war and the toll it takes on people. However, he was too late to save the one person who was like a daughter to him. Lured to the dark side of the Force by Kar Vastor (the last of Ghôsh Windu, aside from Mace), Depa attacked and was defeated by her former master. Upon being returned to Coruscant, Billaba remained floating in bacta in an insane status. Though her physical wounds would heal, she would remain comatose until her end."}, {"tag": "h2", "text": "Editions"}, {"tag": "h3", "text": "American"}, {"tag": "h3", "text": "Foreign"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Hardcover"}, {"tag": "p", "text": "Mace Windu is a living legend: Jedi Master, senior member of the Jedi Council, skilled diplomat, devastating fighter. Some say he is the deadliest man alive. But he is a man of peace—and for the first time in a thousand years, the galaxy is at war."}, {"tag": "p", "text": "Now, following the momentous events climaxing in the First Battle of Geonosis, Master Mace Windu must undertake a perilous homecoming to his native world—to defuse a potentially catastrophic crisis for the Republic…and to confront a terrifying mystery with dire personal consequences."}, {"tag": "p", "text": "The jungle planet of Haruun Kal, the homeworld Mace barely remembers, has become a battleground in the increasing hostilities between the Republic and the renegade Separatist movement. The Jedi Council has sent Depa Billaba—Mace's former Padawan and fellow Council member—to Haruun Kal to train the local tribesmen as a guerrilla resistance force, to fight against the Separatists who control the planet and its strategic star system with their droid armies. But now the Separatists have pulled back, and Depa has not returned. The only clue to her disappearance is a cryptic recording left at the scene of a brutal massacre: a recording that hints of madness and murder, and the darkness in the jungle…a recording in Depa's own voice."}, {"tag": "p", "text": "Mace Windu trained her. Only he can find her. Only he can learn what has changed her. Only he can stop her."}, {"tag": "p", "text": "Jedi were never intended to be soldiers. But now they have no choice. Mace must journey alone into the most treacherous jungle in the galaxy—and into his own heritage. He will leave behind the Republic he serves, the civilization he believes in, everything but his passion for peace and his devotion to his former Padawan. And he will learn the terrible price that must be paid, when keepers of the peace are forced to make war…."}, {"tag": "h3", "text": "Paperback"}, {"tag": "p", "text": "Mace Windu is a living legend: Jedi Master, skilled diplomat, and devastating fighter. But he is also a man of peace—and for the first time in a thousand years, the galaxy is at war."}, {"tag": "p", "text": "The jungle planet of Haruun Kal, the homeworld Mace barely remembers, has become a battleground for the Republic and the renegade Separatist movement. The Jedi Council has sent Depa Billaba—Mace's former Padawan—to the planet to train the local tribesmen as a guerrilla resistance force to fight against the Separatists. But Depa has vanished. The only clue to her disappearance is a cryptic recording that hints of madness and murder…a recording in Depa's own voice."}, {"tag": "p", "text": "Mace Windu trained her. Only he can find her. Now Mace must journey alone into one of the most treacherous jungles in the galaxy—and into his own heritage. He will leave behind the Republic he serves, the civilization he believes in, everything but his passion for peace and his devotion to his former Padawan. And he will learn the terrible price that must be paid when keepers of the peace are forced to make war."}, {"tag": "h3", "text": "Star Wars Legends paperback"}, {"tag": "p", "text": "Now for the first time in trade paperback: A Star Wars Legends classic featuring Jedi Master Mace Windu, repackaged to celebrate the 50th anniversary of Lucasfilm."}, {"tag": "p", "text": "Mace Windu is a living legend: Jedi Master, senior member of the Jedi Council, skilled diplomat, devastating fighter. Some say he is the deadliest man alive. But he is a man of peace—and for the first time in a thousand years, the galaxy is at war."}, {"tag": "p", "text": "Now, following the momentous events climaxing in the Battle of Geonosis, Master Mace Windu must undertake a perilous homecoming to his native world—to defuse a potentially catastrophic crisis for the Republic…and to confront a terrifying mystery with dire personal consequences."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In 22 BBY Mace Windu's former Padawan and fellow Jedi Master Depa Billaba has been sent to Haruun Kal to start a revolution against the Separatist-allied government two months after the Battle of Geonosis, which started the Clone Wars; however, all contact has been lost with her. Four months after Depa is shipped to Haruun Kal, a message is found on a voice chip that indicates Depa has fallen to the dark side of the Force or even lost her mind. Since Windu taught her, he knows he is the only one who can intervene, and is sent by the Jedi Council by himself to his birth world."}, {"tag": "p", "text": "Mace lands on planet, and is apprehended by Lorz Geptun, Security Chief for Haruun Kal and leader of its offworlder militia faction. After negotiating with the Chief, Mace is let free into the planetary capital of Pelek Baw. He duly meets up with his supposed contact, Phloremirrla Tenk, who is shot and killed in a subsequent incident. Mace is rendered unconscious, and is acquainted with Nick Rostu, a young Korun and his associates, Besh, Lesh and Liane Trevval, who also goes by the name Chalk. Rostu reveals that Tenk was a Separatist agent, and that he and his cohorts saved Master Windu from detention."}, {"tag": "p", "text": "Nick leads Mace into the harsh jungles of Haruun Kal on grasser-back, where Depa is apparently at large. Nick tells Mace of the Summertime War, a seasonal conflict between the natives of Haruun Kal—Korunnai—and the offworlders—Balawai—over materials and ways of life. The Balawai are also now affiliated with the Confederacy of Independent Systems. A Balawai gunship attack menaces the party, and soon after, Lesh is killed by wasp-larvae from contaminated thyssel bark and the young Korun is euthanized by Mace. Besh is also lost a short time later."}, {"tag": "p", "text": "Further on, Mace and the party encounter Kar Vastor, a dangerous lor pelek (lord of the jungle) and volatile Force-user who leads a cadre of elite men known as Akk Guards. After a conflict, Vastor allies with Mace, and the Master rendezvouses with Depa Billaba, who has fallen to the dark side of the Force. He arrests her after learning that she has been responsible for several atrocities."}, {"tag": "p", "text": "The assault ship Halleck, which Mace has standing off near Haruun Kal, is summoned to the planet to extract Mace and Depa, but comes under attack from droid starfighters. Mace orders the ship to jump outsystem and deploy its landers. The acting commanding officer of the ship complies with doubt."}, {"tag": "p", "text": "Soon after, Mace and Kar Vastor defeat a Balawai militia attack using grassers and akk dogs, and Mace manages to defeat the droid starfighters using a militia gunship and some clever sensor modifications. The landers from the Halleck land at Pelek Baw Spaceport, and the clone forces take the facility. However, Mace is forced to surrender to Geptun, whom he later enlists to help him stop the battle, which is reignited by turncoats Depa and Vastor. Mace defeats them both, sustaining serious injury, and Nick is critically wounded by an Akk Guard.\nMace stands triumphant, despite the campaign's many downfalls."}, {"tag": "p", "text": "After the affair, Master Billaba is taken to the Jedi Temple, where she is detained. Kar Vastor is tried for war crimes. Nick, having been awarded the brevet rank of major during the fight, convalesces in a medical center in the capital."}, {"tag": "p", "text": "Throughout the mission, Mace keeps a journal, which he finishes by hoping that Anakin Skywalker, as the \"Chosen One,\" will bring balance to the Force."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The plot of Shatterpoint was highly influenced by both Joseph Conrad's book Heart of Darkness and the movie based on it, Apocalypse Now. This was chosen to give the story a gritty feel, and Matthew Stover describes the concept as arising in a brainstorming session, encapsulated in a single sentence: \"Apocalypse Now with Jedi.\""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The events of Star Wars: Episode III Revenge of the Sith and the events of the The New Jedi Order series book The New Jedi Order: Star by Star are foreshadowed in this book. After defeating Depa Billaba and Kar Vastor, Mace experiences a moment of disorientation, where he does not remember where he is. He thinks \"He could have even been in the Jedi Temple. But the Temple would never smell like this. Would it?\" This moment foreshadows the execution of Order 66 and the subsequent slaughter in the Temple halls. Earlier in the novel, Mace has a nightmare, where he envisions \"Coruscant shattered by immense ships of impossible design…the center of galactic civilization has become a jungle more alien than Haruun Kal's,\" foreshadowing the bombardment and Vongforming of Coruscant."}, {"tag": "p", "text": "On one page, \"akk\" is misspelled as \"aak.\""}, {"tag": "p", "text": "Stover heavily references Shatterpoint, along with Labyrinth of Evil and numerous graphic novels, in his novelization of Revenge of the Sith."}, {"tag": "p", "text": "In the back of many New Jedi Order books released around the time, Shatterpoint and Rogue Planet is wrongly listed as The New Jedi Order: Shatterpoint, but still has a blurb describing it as a Clone Wars novel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}