{"url": "Shattered_Empire_3", "categories": ["Category:Real-world articles", "Category:Star Wars: Shattered Empire"], "nodes": [{"tag": "h1", "text": "Shattered Empire 3"}, {"tag": "p", "text": "Shattered Empire 3 is the third issue of the Marvel comic book miniseries Star Wars: Shattered Empire, set between Star Wars: Episode VI Return of the Jedi and Star Wars: Episode VII The Force Awakens. The comic, written by Greg Rucka and with art by Marco Checchetto, was released on October 14, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Concluding the first new-canon comic tale set between episodes VI and VII! As the Empire Shatters around them, Rebel heroes fight for a better tomorrow! Greg Rucka (Punisher, Cyclops, Wolverine) and Marco Checchetto (Punisher, Avengers World) take us into the more recent long, long time ago!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Opening crawl"}, {"tag": "h3", "text": "Operation: Cinder begins"}, {"tag": "p", "text": "Kes Dameron and Sakas are conducting reconnaissance on an Imperial Security Bureau (ISB) black site on the Wretch of Tayron. As Han Solo gives the go-ahead, they fire a rocket into the base, breaching the southeast wall. Dameron is nearly shot by a scout trooper, but is saved just in time by Chewbacca. The Pathfinders strike team regroups before entering the base, and Solo tells Chewbacca to locate C-3PO to break the Imperial encryption. C-3PO protests that he is not programmed for combat operations."}, {"tag": "p", "text": "On Naboo, Captain Korro reports to Queen Soruna that the planet is under some kind of attack from orbit, and that the Gungans have confirmed typhoon-strength storms all over the planet. Shara Bey suggests to Leia Organa that it must be an Imperial remnant, using an orbital array to alter the weather. Leia says they need ships and pilots to attack the array and the Star Destroyer, but Korro says Naboo has no starfighters or combat-trained pilots after the Empire demilitarized Naboo years ago. Soruna responds that this is not entirely true—the starfighter-bay wing of the Theed Royal Palace was sealed off by Queen Neeyutnee after the invasion of Naboo, but the N-1 starfighters it contained were still there. She uses her royal authority to override the seal. As Leia enters the bay, she feels a cold chill, and has a vision of Darth Maul. Bey finds three operational fighters, but is not sure she can tackle the Imperial task force alone—Leia and Soruna also volunteer to pilot ships in the attack."}, {"tag": "p", "text": "The commander of the ISB base orders the stormtroopers to hold off the Rebels long enough for him to initiate a data purge, but surrenders when his troops are defeated. C-3PO begins to slice the ISB computer system, and is alarmed to discover that an Imperial program called Operation: Cinder is in progress, running across multiple targets specified by the Emperor—including Naboo."}, {"tag": "h3", "text": "Battle for Naboo"}, {"tag": "p", "text": "Captain Korro strongly objects to Queen Soruna's participation in the mission and suggests one of her handmaidens take her place, but she refuses and orders him to continue the evacuation of Theed city. As Bey and her two royal co-pilots take off, Governor Gesset advises that the advisory council estimates one to two hours before the planet becomes inhospitable. In Naboo's orbit, the three pilots see the satellite array causing the storms, and the Star Destroyer Torment. Bey takes on the Torment's TIE fighter squadron, while Leia and Soruna destroy the satellites. Bey tells Leia that she has a husband and son, and that she doesn't want them to receive one of Leia's condolence letters. As another TIE squadron launches from the Star Destroyer, Bey realizes the overwhelming odds against them. As she states it has been an honor flying with them, the Alliance cruiser Restoration drops out of hyperspace, with Lando Calrissian in the Mellcrawler II and a squadron of starfighters, relieving the Naboo fighters."}, {"tag": "p", "text": "Back at Rebel Fleet Command, Leia asks Bey why she didn't want her writing a letter to her family, and she replies that she didn't want to add to Leia's burdens of command. Bey is reunited with Dameron, and they embrace."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}