{"url": "Shattered", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Shattered"}, {"tag": "p", "text": "\"Shattered\" is the eleventh and penultimate episode of the seventh and final season of Star Wars: The Clone Wars. It premiered on May 1, 2020."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Maul is captured and the Siege of Mandalore is won. But evil lurks elsewhere, and the galaxy will never be the same."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Maul captured"}, {"tag": "p", "text": "The Siege of Mandalore is over. Republic forces take Gar Saxon into custody, as Bo-Katan Kryze watches. A gunship lands nearby, and the hatch opens revealing Ahsoka Tano, with Maul bound behind her. Kryze tells Tano she is impressed that she managed to capture Maul. Ahsoka replies it is what the Council wanted, and Bo-Katan agrees, saying that Ahsoka has succeeded where many have failed. Ahsoka says she learned from the best and that includes her, and Bo-Katan says she wishes she was good at something other than war, as she looks down at the wreckage of Peace Park. Ahsoka suggests that the Mandalorians need a new kind of leader, but Bo-Katan says her sister tried that and she never understood her idealism."}, {"tag": "p", "text": "Rex approaches, saying that the Jedi Council is waiting to speak to Ahsoka. She asks if he was able to contact Anakin Skywalker, and he says he was in the meeting when they asked for her. Bo-Katan says she can handle it from here and urges Ahsoka to go. Inside a mobile communications unit, holograms of council members Mace Windu, Ki-Adi-Mundi, and Yoda, along with Aayla Secura, discuss the situation. Windu tells the others that he senses a plot to destroy the Jedi, and that the dark side of the Force surrounds the Chancellor. Mundi says that Palpatine must give up his emergency powers after Grievous has been destroyed or be removed from office. Windu replies that the Jedi would have to take control of the Galactic Senate to ensure a peaceful transition."}, {"tag": "p", "text": "Ahsoka and Rex enter, and Ahsoka confirms her mission was a success, that they have captured Maul and she will escort Rex while he transports Maul to Coruscant. Yoda congratulates her on her service, and Ahsoka replies that she did her duty as a Republic citizen. \"Not as a Jedi?\" Yoda asks, and Ahsoka tells him \"No. Not yet.\" She asks to speak to Anakin, but Windu tells her that he sent Anakin to inform the Chancellor that they have located Grievous on Utapau, and Obi-Wan Kenobi is engaging the enemy. Ahsoka muses the war could be over soon, and Windu replies that it depends on the Chancellor. She asks for more information, but Windu denies her request because she is only a Republic citizen and not a member of the Council. Ahsoka says she understands and the council members leave, except for Yoda, who remains and asks if she has a message for Skywalker. Ahsoka pauses and says she will tell him herself when she sees him. As they leave the ship, Rex notes she didn't tell them about Maul's prophecy regarding Skywalker."}, {"tag": "p", "text": "Bo-Katan and Ursa Wren escort Maul, encased in a Force-proof capsule, to a Rho-class transport shuttle. Ahsoka is impressed at the device, saying she doubts even Maul could escape. Bo-Katan says it is a relic of a bygone era, when the Mandalorians had reason to imprison \"Force-wielding maniacs.\" Ahsoka asks if Satine had outlawed such devices, and Bo-Katan says she had, but this is the last one. They shake hands and bid farewell."}, {"tag": "h3", "text": "Betrayal"}, {"tag": "p", "text": "Enclosed in the Mandalorian capsule, Maul watches as Ahsoka talks to Rex. The transport lands in the Tribunal, and the clone troopers escort the capsule to a detention cell."}, {"tag": "p", "text": "The clone officers salute Ahsoka as she walks onto the bridge, and the ship jumps into hyperspace. Ahsoka stares into hyperspace deep in thought, and Rex asks what's on her mind. She notes that she was trained as a Jedi to be a keeper of the peace, not a soldier, but since she was a Padawan she has only been a soldier. Rex says he has also known nothing but war, but without the Clone Wars, the clones would not exist. Ahsoka replies that at least some good has come out of the war, since the Republic couldn't have asked for better soldiers or she a better friend, and throws him a salute that he returns. An officer tells Rex he is needed for a briefing. He asks Ahsoka if she would like to listen in, and she declines, telling him it is probably more good news. Rex enters the briefing room."}, {"tag": "p", "text": "In his cell, Maul's eyes open as he hears in his head the voices of Palpatine, Windu and Skywalker as they duel in Palpatine's office. Ahsoka likewise feels the massive disturbance pulsing through the Force, and whispers \"Anakin?!\" In the briefing room, Rex watches a hologram of Darth Sidious, who intones, \"Execute Order 66,\" and Rex replies, \"Yes, Lord Sidious.\" Ahsoka enters, saying she feels something terrible has happened to Anakin. Rex starts shaking, and he drops his helmet. The other troopers on the bridge receive a message, and they turn around, training their rifles on Ahsoka. Rex tells them that he'll do it, drawing his pistols on Ahsoka and telling her to stay back. He tells Ahsoka, \"find him… Fives… find him!\" before opening fire. Ahsoka leaps over him, drawing her lightsabers and sealing the door, but more troopers led by Jesse enter from the other side. They surround Ahsoka and fire at her, but she deflects their blaster bolts into the ceiling, then leaps up through the hole. Rex orders two troopers to proceed to the detention level and execute Maul. He then tells the others that the Jedi have been marked for summary execution for treason against the Republic, and that any soldier who does not comply with the order to execute the Jedi will also be executed for treason. He orders the troopers to search the ship for Ahsoka."}, {"tag": "h3", "text": "A dark distraction"}, {"tag": "p", "text": "Maul watches as two clone troopers enter his cell and open the capsule. As they raise their rifles, Ahsoka enters and incapacitates them. She releases Maul, telling him not to make her regret this. Maul is impressed she has survived, but denies any involvement, saying he was not privy to his master's plan. He also tells her that they have both felt what has happened though the Force, and Sidious has turned the Jedi's own army against them. He says she has done the right thing coming to him, but she says she is not here to team up with him; all she needs is a diversion, and Maul is good at causing chaos."}, {"tag": "p", "text": "The clones report to Rex, telling him they have swept the detention level and that both Tano and Maul have escaped. Rex orders them to destroy the escape pods and secure the hangar decks to prevent their escape."}, {"tag": "p", "text": "Ahsoka sneaks past the clones and enters the cruiser's droid bay. She activates three astromechs: R7-A7, RG-G1, and CH-33P. She asks R7 to patch into the Republic central computer and retrieve any files on clone trooper CT-5555, better known as Fives. The files contain medical records and a hologram of the Kaminoan medical scientist Nala Se, who states that a defect had been found in the trooper's inhibitor chip, and that the findings had been accepted by the Jedi Council and a Senate committee. However, she also notes that a grievance report was logged by trooper CT-7567. Using Anakin's passcode to decrypt the report, Ahsoka watches as Rex voices his suspicions about the inhibitor chips placed in the clones by the Kaminoans having some sort of ulterior purpose."}, {"tag": "p", "text": "In the hallways outside, the clones engage Maul, who rips panels from the bulkhead to shield himself from blaster fire, as well as throwing them to crush and decapitate troopers. The troopers report to Rex that Ridge is down and Maul is headed toward the main hangar. Rex orders them to close the blast door, which they do; Maul, however, pulls one trooper's arm through the door, severing it. He kneels down to listen to the chatter on the clone trooper's wrist comlink."}, {"tag": "h3", "text": "Saving Rex"}, {"tag": "p", "text": "As Rex runs down the corridor, R7-A7 rolls in front of him, separating him from his squad. CH-33P closes the blast doors around him, while R7-A7 activates a hologram of Ahsoka. She tells Rex that she saw his report on Fives and that she knows he was programmed to turn against the Jedi. Rex trains a pistol on R7-A7 and demands to know where she is. Ahsoka appears behind Rex; as he turns around, R7 shocks him, knocking him out. Ahsoka and the droids carry Rex to the medical bay, sealing doors behind them. A medical droid runs a scan on Rex, but it finds no anomaly. Ahsoka puts her hands on Rex's head and recites the Guardian's Mantra: \"I am one with the Force and the Force is with me,\" with the unconscious Rex joining in. Suddenly, the scan detects the chip and R7 sends Rex into the surgery chamber."}, {"tag": "p", "text": "The clones manage to manually override the door. Ahsoka draws her lightsabers and deflects their blasters as they open fire, but is slowly overwhelmed. Her left wrist is shot, causing her to drop her shoto lightsaber and defend with only one lightsaber in hand. Behind her, Rex recovers and draws his pistols, opening fire on the clones as G-G re-seals the door. He tells Ahsoka he is okay, apologizing for almost killing her. Ahsoka asks Rex about how widespread the inhibitor chips are, and, to her horror, Rex states that they are in all of the clones. He slowly adds that the entire Grand Army of the Republic has been turned against the Jedi. He and Ahsoka turn to the door as the clone troopers begin cutting through."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "When Ahsoka and Rex walk onto the bridge of the Venator-class Star Destroyer, the right half of his kama, closer to the camera, is transparent in one shot, revealing his thigh armor beneath. Later in the scene, when Ahsoka tells Rex to go see the latest briefing by himself, the rectangular pouch attached to the right side of his pauldron is missing."}, {"tag": "p", "text": "The episode, like most of the Siege of Mandalore story arc, takes place concurrently with the events of Star Wars: Episode III Revenge of the Sith, containing several direct references to the film. The conversation between the Jedi Council members prior to Ahsoka's arrival occurs the same as it did in the movie. Later, Ahsoka senses Anakin's fall to the dark side, even hearing the dialogue between him, Mace Windu and Sheev Palpatine in the latter's office right before Anakin cuts off Windu's hand (the scene uses archival dialogue from Revenge of the Sith). Moments later, Palpatine contacts Rex and issues Order 66, which leads to the clone troopers turning on Ahsoka."}, {"tag": "p", "text": "While trying to locate Rex's chip using the Force, Ahsoka utters \"I am one with the Force, and the Force is with me,\" a line which is said numerous times by Chirrut Îmwe in Rogue One: A Star Wars Story."}, {"tag": "p", "text": "In the Star Wars Rebels episode \"The Lost Commanders,\" Rex states that he had his control chip removed, which is why he didn't turn on \"his Jedi\" when Order 66 was issued. However, this episode shows that Rex didn't remove his chip and he attacks Ahsoka at first, before she subdues him and removes the chip herself, restoring Rex's free will. Dave Filoni later explained that Rex was only telling Kanan enough so that Kanan would \"understand who Rex is and what he's really about,\" and that Rex likely told Kanan the exact details offscreen."}, {"tag": "p", "text": "In the Ahsoka novel, Order 66 is implied to occur on Mandalore shortly after Maul's capture, and he is able to escape during the confusion. In this episode, however, Order 66 occurs on a ship, and Ahsoka lets Maul out of his prison to distract the clones."}, {"tag": "p", "text": "Like the previous episode, the title card is different from most other episodes. No theme music is played, and the logo remains in place instead of zooming out, with only \"The Clone Wars\" shown initially and the \"Star Wars\" border slowly fading in around it. The newsreel style narration is also omitted for the second time in the series."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}