{"url": "Bansu_Ro", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Humans", "Category:Lothalites", "Category:Males", "Category:Squadron Five members"], "nodes": [{"tag": "h1", "text": "Bansu Ro"}, {"tag": "p", "text": "Bansu Ro was a human male from Lothal, who became an Imperial cadet at the Galactic Empire's academy on the planet Carida. He and fellow cadet Rac Syrmo competed for the top spot on their class's leaderboard until their class was commandeered by the Empire's navy. Ro and Syrmo were requested by the Empire's 204th Imperial Fighter Wing, which inducted them into the fighter wing's Squadron Five."}, {"tag": "p", "text": "Ro and Syrmo joined Squadron Five in preparations for an attack on a rebel recruitment base. When the battle came, Ro struggled to keep up with her squadron in her TIE fighter, but was advised by Squadron commander Teso Broosh to compensate for the TIE's limitations. Ro was later saved by Syrmo from an pursuing T-65B X-wing starfighter, and Squadron Five proceeded to destroy the recruitment base and its remaining escorts."}, {"tag": "p", "text": "After the battle, Ro assured Syrmo about a mistake he had made which had caused a friendly casualty, reminding his comrade that he was there to fight for his comrades. The pilots were then given news of the death of Galactic Emperor Sheev Palpatine. After, Squadron Five returned to the rest of the 204th, which continued to clash with the Alliance and its successor, the New Republic, through many battles."}, {"tag": "p", "text": "In 5 ABY, the 204th was stationed with the Empire's loyalist faction at the planet Jakku. During a social gathering with other 204th personnel, Ro went under the influence of narcotics and grieved the victims of the 204th's genocides before he was taken to his bunk. The New Republic later defeated the Empire at Jakku, and Ro fled the world, soon finding himself on the planet Freerock as an ex-Imperial."}, {"tag": "p", "text": "At the Rim's Edge cantina on Freerock, Ro was approached by the New Republic veteran Nath Tensent, who revealed what he knew of the ex-Imperial. While prepared to draw a weapon as he did not trust his visitor, Ro listened as Tensent offered an invitation into his crew of freelancers, which already had taken in two other ex-204th pilots. Tensent left a bewildered Ro with an offer to speak again at Roderick's."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Training to be a pilot"}, {"tag": "p", "text": "Bansu Ro was born on the planet Lothal and lived during the reign of the Galactic Empire. He became estranged from his family after they sided with rebels against the Empire. After, Ro joined the Imperial Academy at the planet Carida as an Imperial cadet and trained as a pilot under Flight instructor Yurib Nakan. He formed a rivalry with fellow cadet Rac Syrmo, and both competed for the top rank on the class leaderboard, outdoing the rest of their class. However, the allegiance of Ro's family tainted his career, setting him on course to have a career making shuttle runs. Around 4 ABY, the Empire's navy chose to commandeer Ro's entire class for its latest war effort. The Empire's 204th Imperial Fighter Wing specifically requested for Ro and Syrmo, as the top two ranked of their class, to make up for their recent losses, the fighter wing being impressed by Ro's aptitude tests."}, {"tag": "p", "text": "Meanwhile Ro and Syrmo took part in a training exercise, flying TIE fighters, where their target was a deflector shield generator dome marked with the insignia of the Rebel Alliance, the Empire's largest opposition. During the exercise, both cadets flew at the dome together, each trying to make the killing shot on the shield generator, but the pair fired on and destroyed it at the same time. After the training exercise, Ro and Syrmo disembarked from their TIEs and argued on who had made the killing shot on the shield generator dome."}, {"tag": "p", "text": "As Ro bragged about his intentions to be better than his fellow cadet, Nakan interrupted the pair, criticising their constant arguing. The flight instructor then told Ro and Syrmo about their transfer to the 204th. Upon realizing that they were still the top ranked in their class after their last exercise, Ro and Syrmo argued who had been more pivotal in destroying the dome. Nakan interrupted, telling the pair that how well they could fly together would matter in their new assignment rather than their class rankings."}, {"tag": "h3", "text": "Induction into the 204th"}, {"tag": "p", "text": "Ro and Syrmo were taken to the Empire's Ryleel Base, where they were ferried on a Lambda-class T-4a shuttle to a Quasar Fire-class cruiser-carrier carrying the 204th's Squadron Five. Onboard the shuttle, Syrmo questioned if the 204th was supposed to be elite, to which Ro remarked that they were no elite enough to not have openings. When Syrmo mentioned his parents not being able to see their graduation, Ro rekindled their debate on who was ahead of each other in their class at Carida. Ro and Syrmo's shuttle then docked into the cruiser-carrier, and the pair exited to meet their new squadron."}, {"tag": "p", "text": "The squadron commander, Second Lieutenant Teso Broosh, was displeased that his squadron was receiving two cadets to fill in for their two dead TIE pilots, Lyttan Dree and Zin Graw. Ro and Syrmo explained that their whole class had been transferred to the Imperial Navy and that they were the top ranked cadets, but Broosh only asked of their combat experience, which the pair lacked. The squadron commander parted to fetch Ro and Syrmo datapads with Squadron Five's formations."}, {"tag": "p", "text": "Squadron Five was enroute on the Quasar Fire-class cruiser-carrier to attack a rebel recruitment base, and Broosh held a briefing with his pilots, including Ro and Syrmo. The squadron commander laid out his plan to hit the Alliance forces fast and hard after arriving out of hyperspace. After Broosh mentioned Zin Graw, whose failed defection attempt had led the Empire to locate the recruitment base, Ro quietly asked Syrmo who Graw was, which his fellow cadet did not know the answer to. Their commander continued his brief, discussing the possibility of taking prisoners with Flight Officer Ganem Kahi and detailing tactics before squadron then exited the briefing room to begin their mission."}, {"tag": "h3", "text": "Into battle"}, {"tag": "p", "text": "The cruiser-carrier exited hyperspace near the Alliance's recruitment base, a GR-75 medium transport, deploying a complement of TIE bombers with Squadron Five escorting them. Ro's squadron flew TIE interceptors aside from Ro and Syrmo, who flew TIE fighters. The interceptors targeted and disabled the transport's hyperdrive, blocking the recruitment base's ability to escape into hyperspace. The Imperial forces were then met with many T-65B X-wing starfighters, which outnumbered the TIEs. As Squadron Five moved to engage the X-wings, Broosh told Ro and Syrmo that the pair were lagging behind."}, {"tag": "p", "text": "Ro stressed that his and Syrmo's TIEs were not as fast as the TIE interceptors, but Broosh advised him to compensate for his \"lesser ship\" and prove that he was top of his class. Squadron Five clashed with the X-wings to protect the TIE bombers. During the dogfight, Ro was pursued by an X-wing which he could not shake off. He called to his squadron for help, and Syrmo moved in to assist and destroyed the rebel fighter. Squadron Five then returned to formation and, after shooting down at least two X-wings, the pilots helped the bombers destroy the rebel recruitment base. Victorious, the squadron returned to the Quasar Fire-class cruiser-carrier."}, {"tag": "p", "text": "With Syrmo disappointed that he had failed to save a bomber, Ro assured him that it was just a mistake. Syrmo expressed doubt that he was ready for active duty, but Ro told him that he could continue to save others like he had saved his fellow cadet. The pair were then interrupted by a voice over the intercom, which announced that a major battle between the Alliance and the Empire had caused the destruction of the Empire's new DS-2 Death Star II Mobile Battle Station and the presumed death of the Galactic Emperor Sheev Palpatine. Broosh told Ro and the other pilots to await further orders, reminding them that there was still a command structure and that they were still an intact squadron."}, {"tag": "h3", "text": "On the run"}, {"tag": "p", "text": "Squadron Five eventually returned to the rest of the 204th, which found itself on the run as Imperial worlds began to fall to Alliance forces. The fighter wing took part in the genocidal campaign known as Operation: Cinder before eventually setting up a base of operations at the Pandem Nai system. After a battle group from the New Republic, the Alliance's successor, drove the 204th from the system in a crippling attack, the fighter wing worked to rebuild again before battling the same battle group at the Cerberon system."}, {"tag": "p", "text": "In 5 ABY, the 204th carried out a string of genocides on behalf of the Empire's loyalist faction against breakaway Imperial factions, using the bulk freighter Yadeez as a flagship. However, the New Republic forces from Pandem Nai and the Cerberon system pursued the fighter wing through a series of systems. At the planet Chadawa, the 204th's next target, the fighter wing found itself enclosed under a cage of planetary mechanical rings which channeled radiation. In an effort to reach out to the pilots of the 204th, Starfighter Commander Wyl Lark began trying to speak to them over an open comm channel. Ro was the second pilot he tried to speak to, and Lark told a story in hopes that the TIE pilot was listening."}, {"tag": "h3", "text": "Fall of the Empire"}, {"tag": "p", "text": "The 204th eventually escaped the Chadawa system and rendezvoused with the Imperial loyalist forces at the planet Jakku. There, the fighter wing's personnel occupied themselves by visiting friends and family in other units or taking part in war games. At one point, a number of personnel had a social gathering in the Yadeez's hangar. Ro, who had acquired narcotics, found himself under the influence of the drugs. He began sounding his grief over the victims of the genocides the 204th had caused. Soran Keize, the 204th's commanding officer at the time, and Creet, a TIE mechanic, helped Ro into a bunk and Keize told the TIE pilot that there was no shame in serving with his comrades during the massacres."}, {"tag": "p", "text": "Shortly after, the New Republic attacked and defeated the Imperial loyalist forces at Jakku. With the 204th defeated during the battle, Ro fled Jakku, and soon found himself on the planet Freerock at the edge of the galaxy's Unknown Regions as an ex-Imperial. Four months after the Empire's defeated at Jakku, Ro sold his blaster and went to the Rim's Edge cantina, sitting in an alcove. That was where he was approached by Nath Tensent, a veteran from the New Republic battle group which had repeatedly fought the 204th, who sat at his table. Ro turned down Tensent's offer to buy a drink, not recognising his guest, who called Ro by his name. Ro was surprised Tensent knew his name, and the veteran summarized what he knew of the ex-Imperial's past."}, {"tag": "p", "text": "Realizing who Tensent was, Ro reached for where he used to keep the blaster he had sold, and questioned whether the veteran had been sent to hunt him and if Yrica Quell, a former TIE pilot who had betrayed the 204th, had given information on him. Tensent confirmed the second inquiry and revealed that he was no longer with the New Republic. Ro did not believe the veteran's latter claim, reaching for his vibroknife. The veteran then invited Ro to join his crew of freelancers, revealing that he had already recruited Creet and the 204th pilot Nord Kandende, who Ro dismissed as an idiot. After Tensent's astromech droid, T5, interrupted him about some other business, Ro's visitor advised the ex-Imperial to think about the offer and visit Roderick's if he wished to speak more. Perplexed, Ro watched Tensent leave with the droid."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bansu Ro was a human male with tan-colored skin  and slick black hair which ran down his scalp. He gave a short and lean impression on Nath Tensent."}, {"tag": "p", "text": "Ro formed a strong rivalry with Rac Syrmo, competing for the glory of being the top ranked cadet in his class. During an exercise, he grasped to get the winning shot on a shield generator dome and tried to take as much credit as possible for the victory after. With him and Syrmo still beating their class on the leaderboard, Ro was sure that he had the top spot over his fellow cadet, bragging about it to his classmate. When Teso Broosh was dissatisfied that he was taking on two cadets into his squadron, Ro tried to downplay his concerns, assuring the squadron commander that he and Syrmo were the best in their class. Flying with Squadron Five, Ro learned about his duty to protect his comrades in the Empire, and lectured such to Syrmo after when the other cadet was guilty about a mistake he made which cause the death of another pilot."}, {"tag": "p", "text": "While under the influence of narcotics, Ro felt grief over the people that the 204th Imperial Fighter Wing had killed during genocides, openly wailing about them. After fleeing Jakku and becoming an ex-Imperial, he tried to stave off unwanted company like that of Tensent, and prepared to draw a weapon when he realized who the veteran was, distrusting his visitor. Ro was also weary of his surroundings during his meeting with Tensent, scanning for other possible enemies. He was initially skeptical of Tensent's offers, believing that he was trading his problems for other problems, but he was confused when the New Republic veteran finished pitching his offer and left Ro in peace."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Bansu Ro wore a TIE pilot flight suit when he flew a TIE fighter and the standard Imperial cadet uniform when he was not. At Freerock, he owned a blaster, but eventually sold it, as well as a vibroknife."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bansu Ro first appeared in the fourth issue of the Star Wars: TIE Fighter comic series, written by Jody Houser, penciled by Rogê Antônio and Ig Guara, and published on July 17, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}