{"url": "Bant_Eerin/Legends", "categories": ["Category:Legends articles", "Category:Females", "Category:Jedi Generals", "Category:Mon Calamari", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Bant Eerin"}, {"tag": "p", "text": "Bant Eerin was a female Mon Calamari Jedi Master who served the Jedi Order during the waning years of the Galactic Republic. Eerin was a contemporary and a childhood friend of Master Obi-Wan Kenobi."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "As a Force-sensitive female Mon Calamari, Bant Eerin was trained in the ways of the Force. A contemporary of Obi-Wan Kenobi, Darsha Assant, Reeft, and Garen Muln, Eerin excelled in her classes at the Temple academy, though she often took breaks throughout the day to visit the Room of a Thousand Fountains. Due to her aquatic nature, her dormitory was filled with moisture to keep her skin moist and cool. Though two years younger than him, Eerin was a close confidant of Kenobi's. She attempted to console him when he was at first assigned to the Agricultural Corps, then welcomed him back to the Temple after Jedi Master Qui-Gon Jinn accepted Kenobi as his Padawan."}, {"tag": "p", "text": "In 44 BBY, when Kenobi briefly left the Order during the Melida/Daan Civil War, Eerin blamed Master Jinn for abandoning her friend to the Young. However, she was asked to aid Masters Jinn and Tahl during this time as a series of robberies began plaguing the Temple. When the stolen items were discovered at the bottom of the pool of water on the Lake Level of the Temple, Jinn asked Eerin to dive down and bring up the crates, due to her ability to hold her breath for extended periods of time. After recovering the objects, Eerin was kidnapped by fellow apprentice Bruck Chun, who had been swayed to the dark side by the mastermind behind the attacks on the Temple, Xanatos. Discovering that she was gone, the Jedi began searching for her; a returning Kenobi found and rescued her from the bottom of the waterfall pool in the Room of a Thousand Fountains before she drowned."}, {"tag": "p", "text": "Following this ordeal at the Temple, Master Tahl chose to take Eerin as her Padawan, convinced by her bravery and her resourcefulness that they were a good pairing. While Tahl respected Eerin's heart and skill, she feared she was too young for some of the more challenging missions she was assigned, and often left her at the Temple. Eerin began to feel neglected as a Padawan, and her self-doubt was made far worse when Tahl was killed on an assignment to New Apsolon. She had blamed Obi-Wan Kenobi for Tahl's death by not contacting the Temple after her capture. However, her anger had diminished in time as they worked together to track down Balog."}, {"tag": "p", "text": "Orphaned, Eerin remained at the Temple in mourning for her dead master, until she was approached by the quiet and reflective Master Kit Fisto. Fisto offered to continue the girl's training and she accepted. During their time together, the pair discovered disturbing evidence of Sith cultists practicing on Korriban. Contacting the Temple immediately from the ruined world, the pair's discovery led to the eventual incarceration of Sith supporter Murk Lundi."}, {"tag": "h3", "text": "Jedi Knighthood"}, {"tag": "p", "text": "Eventually, like most of her friends, Eerin faced her Trials of Knighthood and was elevated to the rank of Jedi Knight by the Jedi High Council. While her duties took her far away from her friends, she maintained contact with Kenobi by exchanging small gifts they would leave at the Temple. Eerin and Kenobi met in 25 BBY after a three year separation when the former joined Master of the Order Mace Windu and Garen Muln in rescuing Kenobi from the armies of Roy Teda on the planet Romin. About four years after this encounter, Eerin would aid in the rescue of Kenobi again. Responding to Master Windu's summons, Eerin joined a strike team to rescue Kenobi, his Padawan Anakin Skywalker, and Senator Padmé Amidala from execution by the Confederacy of Independent Systems. Piloting a Delta-7 Aethersprite-class light starfighter to the planet Geonosis, she flew alongside Master Adi Gallia and Siri Tachi in a massive space battle that ensured the Grand Army of the Republic could land safely on the planet to extract the captives."}, {"tag": "p", "text": "After the opening battle of the Clone Wars, Eerin reported back to Coruscant where she took up the mantle of General within the ranks of the Grand Army as well as the title of Master. When the High Council decided to increase the number of Padawans being trained, Eerin selected an apprentice from the Temple's academy. Together with her student, Eerin tracked the CIS scientist Bitt Panith to the Kashyyyk system. Crafting an offensive military operation that would take place on three fronts, Eerin dispatched her student to Akoshissss to negotiate with the local Trandoshans while she pursued Panith. Accompanied by the Eighteenth Battalion, Eerin and her troops were victorious in battle, capturing Panith and fending off the Sith assassin Asajj Ventress."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Clone Wars concluded in 19 BBY due to Supreme Chancellor Palpatine's issuance of Contingency Order 66 to the Grand Army, effectively outlawing the Jedi Order and commanding the execution of all Jedi. While records regarding Eerin's fate were lost, her old friend, Master Kenobi reflected on her death during his exile on Tatooine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}