{"url": "Bantha-II_cargo_skiff", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic repulsorcraft", "Category:Hutt Cartel vehicles", "Category:Skiffs", "Category:Ubrikkian Industries products"], "nodes": [{"tag": "h1", "text": "Bantha-II cargo skiff"}, {"tag": "p", "text": "The Bantha-II cargo skiff, also known as simply as the Bantha class skiff or desert skiff, was a model of skiff manufactured by Ubrikkian Industries."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Measuring 9.5 meters in length, the Bantha-II cargo skiff was a fast-moving model of repulsorlift skiff. Despite being lightly armored, they were extremely durable making them an austere choice for desert climes and perfect transports for passengers, cargo, or slaves. Featuring an elongated deck, Bantha-IIs were little more than floating platforms and were easily identified by their rust coloring, reinforced bows build to withstand head-on collisions, and intermittent safety railings designed to protect passengers or cargo around the perimeter. They were operated from a rear control station designed for a single pilot and could exceed 250 kilometers per hour at their maximum speed. Bantha-IIs also came equipped with planks."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Manufactured by Ubrikkian Industries, the Bantha-II cargo skiff was common outside the Galactic Republic, and later the Galactic Empire, and were used by the Hutt Clan and the Zygerrian Slave Empire. The Hutt crime lord Jabba Desilijic Tiure used a number of the rugged skiffs equipped to survive the heat and sandstorms of the Tatooine deserts."}, {"tag": "p", "text": "During the Galactic Civil War, the Alliance to Restore the Republic outfitted Bantha-IIs with weapons specifically designed to defeat more heavily armed Imperial vehicles."}, {"tag": "p", "text": "Accompanied by Jabba on his sail barge, the Khetanna, two Bantha-IIs were used by him when he attempted to execute Jedi Knight Luke Skywalker and his companions at the Great Pit of Carkoon. However, the prisoners managed to kill Jabba and used one of the skiffs to escape."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}