{"url": "Sheckil/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Sheckil"}, {"tag": "p", "text": "Sheckil was a Human male hailing from the Mandalorian planet Concord Dawn and the twin brother of a famous mercenary. A former warrant officer on his homeworld, Sheckil served the Galactic Empire as a lieutenant during the Galactic Civil War. In early 3 ABY, in the wake of the Battle of Hoth, Sheckil accompanied the Dark Lord Darth Vader and a stormtrooper occupation force during the clandestine seizure of the Bespin mining colony of Cloud City in a scheme to capture Han Solo, Princess Leia Organa, and, ultimately, Luke Skywalker of the Rebel Alliance. The Empire forced city Baron Administrator Lando Calrissian into accepting a deal in which the Empire would not permanently occupy Cloud City in return for Calrissian's compliance in helping to apprehend the Rebels."}, {"tag": "p", "text": "The responsibility fell to Sheckil during the occupation to ensure Vader's command that the stormtrooper detachment remain out of sight until Vader himself was ready to seize the Rebels. However, the plan went awry when the Rebels' protocol droid, C-3PO, unexpectedly happened upon the hidden position of an Imperial squad, which then blasted the droid into bits. Sheckil retrieved the dismantled droid at Vader's order and presented its blasted pieces to the Dark Lord, who instantly recognized it as the same droid he had once constructed in his childhood. Although Vader ordered Sheckil to first have the droid destroyed, he later countermanded his decision by instructing the lieutenant to return C-3PO to the Rebels' Wookiee companion, Chewbacca, thus paying respect to a lesson of responsibility he had learned while first building the droid. However, the mysterious moral was lost on Sheckil."}, {"tag": "p", "text": "Following Vader's planned capture of the Rebels, Sheckil fell prisoner himself upon attempting to escort the princess, the Wookiee, and the still-dismantled C-3PO to Vader's ship. Calrissian defied his Imperial occupiers by organizing a team of his Bespin Wing Guards into a surprise ambush of Sheckil and four accompanying stormtroopers, placing them in Cloud City captivity and helping his newfound Rebel companions to escape from Bespin."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Managing the Cloud City occupation"}, {"tag": "p", "text": "The Human male Sheckil was a native of Concord Dawn, a planet in the Outer Rim Territories with a strong bond to Mandalorian culture, where he served as a warrant officer. Sheckil eventually earned a promotion due to his superb performance. He was also the twin brother of an individual who became a famous mercenary. By the time of the Galactic Civil War, in early 3 ABY, Sheckil served the Galactic Empire as a lieutenant. Shortly following the Battle of Hoth, he was part of the Imperial force, attached to the Dark Lord Darth Vader's personal Death Squadron, that secretly occupied Bespin's Cloud City in preparation of capturing the Rebel Alliance fugitives Han Solo and Princess Leia Organa. Sheckil served directly under Vader's command during the occupation."}, {"tag": "p", "text": "The Imperial occupation force arrived at Bespin well ahead of Solo and Organa's party, which also included the Wookiee Chewbacca and the protocol droid C-3PO. The Rebels had journeyed to Cloud City aboard the freighter Millennium Falcon on a crippled hyperdrive to seek refuge from Vader's forces with Solo's old friend city Baron Administrator Lando Calrissian. However, Vader had already coerced Calrissian into a deal in which Vader promised the Empire would leave the city unmolested once the Dark Lord captured his Rebel quarry, provided Calrissian cooperated with the Imperials. By the time the Rebels arrived, Sheckil and the occupation force were in position and waiting."}, {"tag": "p", "text": "As the Millennium Falcon landed on Cloud City's Platform 327, Sheckil waited out of sight within a Cloud City conference suite alongside Vader and Boba Fett, a bounty hunter whom the Dark Lord hired to hunt down Solo and the Rebels. Sheckil, listening via comlink to an incoming progress report, kept Vader apprised of the developing situation, announcing as Calrissian led Solo and his unsuspecting group into the city. However, the situation soon turned complicated for Sheckil. No sooner had Vader reminded the lieutenant to keep his men out of sight and that the capture would ultimately be at Vader's command than Sheckil received a report that the Rebels' protocol droid, C-3PO, had fallen behind the group and stumbled upon the Imperial unit Gamma Squad's position. The squad's stormtroopers promptly blasted the droid into bits. Although Sheckil noted that, fortunately, the princess and the others did not hear the shots, Vader countered that Sheckil was the only fortunate one and ordered the lieutenant to bring the droid to him at once, for it might contain valuable information."}, {"tag": "p", "text": "Sheckil soon returned to the conference room with two stormtroopers, who carried an open container with the dismantled pieces of C-3PO inside. Holding up the droid's head for Vader's inspection, Sheckil noted that the droid's damage was, unfortunately, quite extensive and that the unit most likely belonged to the princess herself. He also pointed out that, judging from the way the droid had broken apart, it was most likely built a long time ago. As Vader looked closer at C-3PO, he quickly recognized it as the same droid he had once built as a young slave boy living on Tatooine. Watching curiously, Sheckil interrupted the Dark Lord's moment of nostalgia by inquiring whether he should have the Empire's technicians recover the droid's memory, but Vader refused, declaring the droid useless and ordering Sheckil to have it destroyed."}, {"tag": "p", "text": "Vader sprung his trap soon thereafter by capturing Solo and his group, planning to use them as bait for drawing his true target to Cloud City: his Jedi son, Luke Skywalker. While Vader revealed his presence to the Rebels inside of a Cloud City dining room, Sheckil stood by in an adjacent room alongside a waiting stormtrooper squad. He received a report via comlink of an alarming new development regarding C-3PO. Although his men had taken the droid down to one of Cloud City's smelting rooms to be destroyed, the droid had resurfaced during a search of the princess's quarters. Sheckil ordered two stormtroopers down to the junk room to question the Ugnaught workers there just as Vader emerged from the dining room and ordered the waiting stormtrooper squad to escort the Rebel prisoners to detention cells. With some excitement, Sheckil reported the news to Vader, who quickly started for the princess's suite to inspect the situation firsthand."}, {"tag": "p", "text": "Sheckil followed quickly behind in Vader's wake through Cloud City's corridors toward the princess's quarters, where they found two stormtroopers standing with two Ugnaught workers—and the same container holding the dismembered C-3PO. Sheckil tried to rationalize his failure to destroy the droid by explaining to Vader that the Ugnaughts reported that the Rebels' Wookiee had broken into the junk room, retrieved the dismantled droid, and brought it straight to the princess. He also noted that, given the Rebels' apparent interest at preserving the droid, perhaps there was more value to the unit than realized. Once again, Sheckil asked Vader whether he should have their technicians recover the droid's memory or if he would rather have the Ugnaughts smelt it. After a moment of private contemplation, Vader rescinded his previous order and instructed Sheckil to return the droid to the Wookiee, much to Sheckil's bewilderment. When Sheckil inquired further, Vader explained only that he was giving the Wookiee what he deserved—a childhood sentiment of responsibility he had learned from his mother upon first constructing C-3PO, the significance of which Sheckil did not grasp. With that, Vader departed, issuing one final order to Sheckil to see that Solo found his way to his scheduled appointment with Cloud City's interrogation chamber."}, {"tag": "h3", "text": "Calrissian turns the tables"}, {"tag": "p", "text": "Per Vader's orders to Sheckil, C-3PO was returned to the Wookiee, and the Empire thoroughly tortured Solo in the interrogation chamber, though Vader asked no questions of his prisoner. The Dark Lord merely used the Rebels' pain to send a signature through the Force that would draw Luke Skywalker to Cloud City, presenting an opportunity for Vader to convert his son to the dark side of the Force. Later, Vader had Solo encased in a block of carbonite in one of Cloud City's carbon-freezing chambers as a test to determine whether Skywalker could survive the process himself. Skywalker arrived at Cloud City just as Solo's freezing concluded, and Vader ordered Calrissian to take Organa, the Wookiee, and the still-dismantled C-3PO to his shuttle while he prepared himself to confront his son. Sheckil and a group of four stormtroopers escorted Calrissian and the Rebel prisoner processional through the city toward Vader's waiting ship."}, {"tag": "p", "text": "While Sheckil led the group through one of Cloud City's corridors, four blaster shots suddenly rang out from behind, catching the attention of Calrissian and Organa—unbeknownst to the group, Skywalker had entered the city and drawn fire from Boba Fett, who was himself leading Solo's carbonite slab through another corridor toward his own waiting vessel. Calrissian took the opportunity to act. Adjusting his cape to shield his activity from Sheckil beside him, Calrissian tapped a key sequence into a small comlink on his wrist, transmitting the command \"Code Force Seven\" to his aide, Lobot, Cloud City's computer-liaison officer. Only a moment later, Skywalker rounded a nearby bend and encountered the prisoner procession. Sheckil was the first to notice a shadow moving along the wall of an adjacent hallway. The lieutenant stopped and gestured for Calrissian to open a nearby door for their escape. Moving quickly, Sheckil ordered the escorting stormtroopers to open fire on their pursuer and grabbed hold of Organa to drag her along, using her body as a Human shield to protect himself."}, {"tag": "p", "text": "Sheckil's stormtroopers fired several shots at Skywalker, forcing him to take shelter around a corner, while the group ushered the Rebel prisoners through the open doorway. Sheckil dragged the princess through last, but she momentarily grabbed hold of the door frame to scream a warning to Skywalker that he was walking into a trap. With one final tug, Sheckil finally pulled Organa through the door, and the group disappeared from Skywalker's sight. The Jedi ran after them a moment later and stepped through the doorway, which remained open for him, but he entered only a dark antechamber with no sign of Sheckil or the Rebels—Imperial Captain Bewil had used his control of Cloud City's hatchways to restrict Skywalker's access, cutting off his pursuit of Sheckil's group by lowering a blast door and thereby directing him toward the waiting Vader."}, {"tag": "p", "text": "With Skywalker dispatched from their tail, Sheckil led his group down yet another of the city's corridors, completely unaware that he was about to be ambushed. As the group passed an intersection, Lobot and several of Calrissian's Bespin Wing Guards emerged from all sides, surrounding Sheckil and his stormtroopers with blaster pistols raised at the Imperials. Calrissian had turned the tables with his secret issuance of Code Force Seven, instructing Lobot to assemble a dozen of his personal guardsmen to rescue the Rebel prisoners. Sheckil and the stormtroopers were caught off-guard and unprepared, and they offered no resistance. The ambush a success, Calrissian shoved Sheckil toward one of his guards and confiscated each of the stormtroopers' blaster rifles, then instructed Lobot to discreetly move the Imperials to Cloud City's security tower. Lobot and the Cloud City guards then led Sheckil and the four stormtroopers away. Calrissian and the Rebels proceeded to safely escape from Bespin but at the expense of leaving Cloud City in the hands of the Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lieutenant Sheckil, a former warrant officer on his homeworld of Concord Dawn, originally earned a promotion due to his stellar performance. During his service with the Imperial Military, he specialized in the transporting of high-profile criminals. Sheckil held a command role during the Empire's Bespin occupation of 3 ABY, serving directly under Darth Vader; however, his service on Cloud City was marred by constant failure. Although Vader instructed Sheckil to keep his men out of sight as Han Solo and the rest of the Millennium Falcon's passengers arrived in the city, one of the occupation force's stormtrooper squads was unable to avoid having C-3PO inadvertently stumble upon its position, in which case the stormtroopers simply blasted the droid into pieces. Sheckil angrily derided his men as \"imbeciles\" for having done so. Later, Sheckil failed to have his men carry out the Dark Lord's order to destroy C-3PO's dismantled body; and, finally, following Solo's carbon-freeze, Lando Calrissian and his guardsmen foiled Sheckil's efforts to escort the captive Princess Leia Organa and Chewbacca to Vader's waiting shuttle, after which Sheckil himself became a prisoner in the Imperial-controlled city."}, {"tag": "p", "text": "Sheckil demonstrated a certain difference in perspective from the Dark Lord during the Cloud City occupation. Although the lieutenant credited luck for the Empire reaching Bespin ahead of the damaged Millennium Falcon, thus allowing Vader time to weave his trap for the Rebels, Vader denounced Sheckil's analysis, declaring that luck had nothing to do with their journey. Later, after a reminiscent Vader recalled his mother's lesson of responsibility during his childhood and ordered the dismantled C-3PO be returned to the Wookiee, Sheckil was clearly confused and did not understand the Dark Lord's mysterious reversal."}, {"tag": "p", "text": "Once Sheckil's group intercepted Luke Skywalker while escorting the Rebel prisoners through Cloud City to Vader's ship, the lieutenant ordered his stormtroopers to open fire on the intruder and immediately moved to take hold of the princess. He held her form in front of himself, using her as a Human shield until he could move out of range of the immediate danger that Skywalker presented—a certain departure from the Imperial tenets of honor and bravery. Sheckil had blond hair, blue eyes, and light skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Lieutenant Sheckil wore the standard-issue Imperial officer's uniform during the Empire's occupation of Cloud City. He frequently utilized a handheld comlink to manage the occupation force and keep Darth Vader apprised of developments."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sheckil first appeared in the 1980 film Star Wars: Episode V The Empire Strikes Back as the unnamed Imperial officer who escorts the captive Princess Leia, Chewbacca, and C-3PO through Cloud City to Darth Vader's ship before being captured himself by Lando Calrissian's security forces. A film still of Sheckil was first included in the April 1980 The Empire Strikes Back Storybook, a young-readers adaptation published just prior to the film's theatrical release. The character was portrayed by actor Jeremy Bulloch, who is best-known for also playing the masked bounty hunter Boba Fett in both The Empire Strikes Back and Star Wars: Episode VI Return of the Jedi. According to Bulloch, the actor who was originally slated to play the Imperial officer was unavailable the day of shooting, so Bulloch filled in, thus providing fans a rare opportunity to see the actor outside of the Boba Fett costume."}, {"tag": "p", "text": "The Sheckil character was first identified by name and provided a brief backstory on the \"Lieutenant Sheckil\" card from the November 1997 Cloud City Limited expansion set of the Decipher, Inc. Star Wars Customizable Card Game. The card explains that Sheckil originated from the planet Concord Dawn and was the \"twin brother of a famous mercenary,\" both intended as tongue-in-cheek references to Bulloch's dual portrayal of Boba Fett in the film. At the time of the card set's release, Boba Fett's character was canonically established to have also originated from Concord Dawn, according to the 1996 short story The Last One Standing: The Tale of Boba Fett. However, any in-universe connection between the two characters was effectively erased with the release of the 2002 prequel film, Star Wars: Episode II Attack of the Clones, which instead established Fett as a clone \"born\" on the planet Kamino. According to a Star Wars CCG fan site, Sheckil was named as an anagram of Decipher game designer Tom Lischke."}, {"tag": "p", "text": "Bulloch also portrayed the Alderaanian pilot Jeremoch Colton in the 2005 film Star Wars: Episode III Revenge of the Sith. In writing the August 31, 2004 entry for the StarWars.com Hyperspace feature \"Episode III Set Diary,\" entitled \"Inside the Alderaan Cruiser,\" author Pablo Hidalgo previewed the film's upcoming scene aboard the Alderaanian cruiser Tantive IV, later established to be the Sundered Heart. Hidalgo revealed in the diary entry that Bulloch would be playing the ship's pilot, also noting that the actor previously portrayed Sheckil and jokingly considering the character's familial connections—\"Makes you wonder if Sheckil has an Alderaanian relative.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}