{"url": "Sheathipede-class_Type_B_shuttle", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Class Type B escort shuttles", "Category:Confederacy of Independent Systems starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "Sheathipede-class Type B shuttle"}, {"tag": "p", "text": "The Sheathipede-class Type B shuttle, also known simply as the Class Type B shuttle, was a model of cargo shuttle manufactured by Haor Chall Engineering Corporation and used by the Confederacy of Independent Systems during the Clone Wars. At least one was captured by the Galactic Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The vessel had a similar design to the Sheathipede-class transport shuttle, but was greater in length.[source?]"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 20 BBY, Shuttle 81572 was used by a Jedi strike team led by Anakin Skywalker, Obi-Wan Kenobi, and clone trooper officers Captain Rex and Commander Cody to rescue Jedi Master Even Piell, who was being held captive in the Citadel on Lola Sayu. Although the mission was successful, the shuttle itself was destroyed by BX-series droid commandos manning defense turrets."}, {"tag": "p", "text": "Later, Count Dooku and bounty hunters led by Cad Bane, Moralo Eval, and Obi-Wan Kenobi posing as Rako Hardeen, used another escort shuttle to Naboo in an attempt to capture Supreme Chancellor Palpatine. However, it was revealed that the bounty hunters were merely a diversion to distract Republic troops, while Dooku lured Anakin and Palpatine to the dinner room. Although Anakin foiled the plot, Dooku used the shuttle to escape from Naboo once more."}, {"tag": "p", "text": "Several Type B escort shuttles were parked in a DH-Omni Support Vessel that was infiltrated by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker during an attempt to rescue the kyber crystal. However, Obi-Wan Kenobi destroyed the crystal instead, leading to the destruction of the shuttles as both Jedi escaped along with General Grievous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}