{"url": "Shepperton_Design_Studios", "categories": ["Category:Real-world articles", "Category:Real-world companies"], "nodes": [{"tag": "h1", "text": "Shepperton Design Studios"}, {"tag": "p", "text": "Shepperton Design Studios is a manufacturer of Star Wars props and memorabilia, based in England. Established in 1974 by Andrew Ainsworth, the company was asked in January 1976 to produce first the helmets, then the body armor for the Imperial stormtroopers in the classic Star Wars films."}, {"tag": "h2", "text": "Copyright dispute with Lucasfilm"}, {"tag": "p", "text": "Permission from Lucasfilm to produce replicas of the stormtrooper helmets was granted since then to various companies. However, in 2004 Shepperton Design Studios claimed to have discovered in their possession one of the molds used to create the original helmets, and began production of new replicas from them. In 2006, Lucasfilm sued Shepperton Design Studios for infringing copyright and making false claims regarding the original status of the molds they used. The United States District Court for the Central District of California ruled in favor of Lucasfilm, awarding a USD $20 million compensation."}, {"tag": "p", "text": "To ensure the decision was enforced in England, Lucasfilm also took the case to the High Court of Justice. Ainsworth's legal team argued that the stormtrooper helmet was a piece of industrial design rather than a work of art, and as such was not under Lucasfilm's copyright. In addition, they claimed that Ainsworth was not under a formal contract with Lucasfilm when assigned to produce the helmets, and that copyright in the design was vested in him, stating that SDS would counterclaim for a percentage of merchandising profits. However, the case was thrown out after Justice Mann ruled that the stormtrooper costumes were industrial props, and so are not within the remit of British copyright law."}, {"tag": "p", "text": "In March 2011 representatives of George Lucas took the case to the United Kingdom Supreme Court, claiming that the stormtrooper helmet is a sculpture, and so is covered by UK copyright law. However, the legal team of Andrew Ainsworth contended the helmet was a movie prop with functional value, which would place it outside of UK copyright law."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}