{"url": "Shettora%27s_criminal_faction", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Shettora's criminal faction"}, {"tag": "p", "text": "Run by the Hutt Shettora, a criminal faction operated out of the planet Brentaal IV in 0 ABY. The faction sold decent merchandise that was priced only a bit higher than its real value. That year, the organization dealt with the privateering crew of the EF76 Nebulon-B escort frigate Far Orbit in a business agreement."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Hutt Shettora led a criminal faction by 0 ABY that was based out of the planet Brentaal IV. The organization controlled the black market on Brentaal IV and had good-quality merchandise that was marked up only a bit over its real value. Puullo, another Hutt, was a lieutenant in the faction and acted as the \"beachhead\" of Shettora's operations."}, {"tag": "p", "text": "In 0 ABY, Puullo and the other Hutts in the organization dealt with the crew of the Alliance to Restore the Republic privateering frigate Far Orbit. In exchange for 30 percent of the goods and merchandise seized by the Far Orbit, the Hutts would give the frigate a shadowport to use, illegal weaponry, and protection from the bounty hunters who might search for the crew of the ship. However, Far Orbit Captain Dhas Fenoep Vedij excluded any military hardware he seized from being handed over to the organization as part of the deal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The criminal faction was first mentioned in 1998's The Far Orbit Project, by Timothy S. O'Brien. The book was a supplement to West End Games' Star Wars: The Roleplaying Game and was a sequel of sorts to the previous publication, Pirates & Privateers, carrying on that book's theme by following the Far Orbit's adventures. It is possible that the Hutts of the organization demand that the crew of the Far Orbit pass a test or undertake a risky errand before the faction agrees to do business with the privateers."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}