{"url": "Shimrra_Jamaane", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Domain Jamaane", "Category:Males", "Category:Supreme Overlords"], "nodes": [{"tag": "h1", "text": "Shimrra Jamaane"}, {"tag": "p", "text": "Shimrra Jamaane was the Supreme Overlord of the Yuuzhan Vong during the Yuuzhan Vong War, although in truth he was merely a puppet of the Force-sensitive Shamed One Onimi. Born to Domain Jamaane, he was marked from birth as a candidate for Supreme Overlord. Around 29 BBY, he fell under the sway of the former Shaper Onimi, who used his powers to take control of Shimrra. Under Onimi's direction, Shimrra overthrew Supreme Overlord Quoreal with the support of many warriors. He then announced the discovery of a new galaxy, and proclaimed that the Yuuzhan Vong were destined to conquer it, whereas Quoreal had made the decision to avoid the galaxy, due to the presence of the living planet Zonama Sekot, which he believed to be a portent of doom."}, {"tag": "p", "text": "In 25 ABY, the Yuuzhan Vong launched their invasion of the galaxy, beginning the Yuuzhan Vong War. The Yuuzhan Vong made early gains and soon had the New Republic reeling. Three years into the war, Shimrra settled on Yuuzhan'tar, which would be his home for the rest of the war. He conducted meetings from his palace, directing the war and attempting to quash the Jeedai heresy. However, the war took a downward spiral after the Battle of Ebaq 9, and Shimrra grew increasingly unstable. In 29 ABY, Zonama Sekot—purportedly a sign of doom—appeared above Yuuzhan'tar, sparking riots and weakening Shimrra's already-declining power base. Soon after this, the Battle of Yuuzhan'tar commenced. Refusing to surrender Yuuzhan'tar to the Galactic Alliance, Shimrra set fire to large swaths of the planet. Shimrra was finally attacked in his citadel by a trio of Jedi led by Jedi Master Luke Skywalker, who dueled and finally killed the Supreme Overlord. The aftermath of Shimrra's demise saw the death of Onimi and the surrender of the Yuuzhan Vong."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and coup"}, {"tag": "p", "text": "Shimrra, a male Yuuzhan Vong, was born into Domain Jamaane many decades before the Battle of Yavin. The Yuuzhan Vong were an extra-galactic species that had been traveling through the Intergalactic Void for millennia in hopes of finding a new galaxy, after destroying much of their home galaxy in an intra-species war. As the followers of a belief system known as the True Way, the Yuuzhan Vong were devoutly religious, and worshiped several gods, chief among them Yun-Yuuzhan, the creator god. Yuuzhan Vong society was divided into castes, consisting of the Supreme Overlord, warriors, intendants, priests, shapers, workers, and Shamed Ones. Because of their reliance on their gods, the Yuuzhan Vong placed a great deal of importance in their priests, and their god-king, the Supreme Overlord. Only the Supreme Overlord held a link to Yun-Yuuzhan, and all of the other Yuuzhan Vong were completely subordinate to the Supreme Overlord."}, {"tag": "p", "text": "Shimrra had a twin brother; they were only the third set of twins in the species' history. In the previous two instances, one of the twins had killed the other, and then gone on to lead the Yuuzhan Vong during times of crisis. Because he was a twin, and of noble birth, Shimrra was placed into a small group of candidates for the position of Supreme Overlord. As a candidate for Supreme Overlord, Shimrra received many luxuries, and was trained in warfare and religion. Due to the work of Shapers, he grew to an extraordinary size. At the age of seven, Shimrra killed his brother to eliminate a possible rival for the throne, early on displaying aggressiveness and ruthlessness."}, {"tag": "p", "text": "After many hopeless years traveling through space, the Yuuzhan Vong discovered a galaxy, which they began scouting. In 32 BBY, Supreme Commander Zho Krazhmir, who had been dispatched to scout the galaxy by Supreme Overlord Quoreal, discovered the planet Zonama Sekot in the new galaxy. Zonama Sekot was a sentient planet, one with many similarities to the species' original homeworld, Yuuzhan'tar. Ancient legends told of a living planet that would bring about the doom of the Yuuzhan Vong, and so, when informed of this discovery in 29 BBY, Quoreal elected to keep traveling in hopes of finding another galaxy. This decision made him unpopular among the Yuuzhan Vong, particularly Domain Jamaane."}, {"tag": "p", "text": "At this point, a disgraced former shaper named Onimi decided to act. Earlier, Onimi had learned that the eighth cortex—the final level of Shaping protocols dispensed directly by the gods and available only to the Supreme Overlord—was empty, contrary to what the species had been taught and believed. Upon discovering this, Onimi realized that the Yuuzhan Vong were doomed if they could not adapt. He attempted to graft yammosk tissue to his brain, but the experiment left him physically deformed, causing him to be marked as a Shamed One and stripped of his rank. However, it also opened him up to the Force, which the Yuuzhan Vong had been cut off from millennia ago. Onimi believed that after traveling through the void for thousands of years, the Yuuzhan Vong would wipe themselves out if they did not have an enemy to direct all their focus toward. Furthermore, he sought to take the place of the gods, and believed that by conquering a new home, the Yuuzhan Vong could ascend to the same level as the gods."}, {"tag": "p", "text": "Using his powers, he bade Shimrra to take him as his familiar, and jester. Onimi took control of Shimrra, who then launched a coup aimed at seizing the throne. With the aid of many warriors, Shimrra was able to overthrow and kill Quoreal. He then executed many of Quoreal's most ardent supporters, as well as the other candidates for the position of Supreme Overlord in an effort to consolidate his power. He also suppressed all knowledge of Zonama Sekot. Having done all this, the new Supreme Overlord announced to the rest of his people the discovery of a new galaxy that he claimed had been revealed to him in a dream from the gods. However, before the Yuuzhan Vong could take the galaxy for their own, they would have to defeat the countless beings already in the galaxy. The Yuuzhan Vong viewed them as infidels, as they did not worship the Yuuzhan Vong gods, and used machine technology, which was disdained by followers of the True Way. Thus, before the Yuuzhan Vong would be content to settle in the new galaxy, all infidels would have to be killed or converted, and their technology destroyed. Though not all members of the species supported Shimrra and his decisions, the dissidents were silent, as they knew that anyone who opposed Shimrra would be killed. Meanwhile, as Onimi's power grew, less and less of the Supreme Overlord's original personality remained, although the fact that Onimi was anything more than Shimrra's jester remained a secret known only by Onimi, the power behind the throne, and the true Supreme Overlord."}, {"tag": "h3", "text": "The invasion begins"}, {"tag": "p", "text": "After several decades of preparation, the Yuuzhan Vong launched their invasion of the galaxy in 25 ABY. The ensuing war began well, with the Yuuzhan Vong catching the New Republic completely off-guard. Reluctant to enter into all-out war, the New Republic concentrated on defending the major hyperlanes leading to the Core Worlds and the Colonies, while the Yuuzhan Vong made major advances in the war's first six months. Under the command of Warmaster Tsavong Lah, they captured a number of planets, such as Obroa-skai and Ord Mantell, surprising the citizens of the galaxy with their brutality. With the galaxy in turmoil, the Yuuzhan Vong would continue to make gains over the next two years. In 26 ABY, they captured Yavin 4, home of the Jedi Praxeum, and penetrated the Core, taking the planet Duro."}, {"tag": "p", "text": "In this year, Onimi discovered the heretical shaper Nen Yim. Yim operated outside of the normal Shaping protocols, and while this normally would have marked her for death, Onimi brought her before Shimrra. The Supreme Overlord proclaimed that she would serve him, working in secret to create new techniques that could be used to fill the eighth cortex, thus providing their species with techniques to be used by the shapers. In 27 ABY, Warmaster Lah enacted Battle Plan Coruscant, which focused on gaining control of Coruscant, the galactic capital. The Yuuzhan Vong were able to defeat the New Republic in the Battle of Coruscant, taking over the planet and leaving the New Republic reeling. The New Republic later attacked Obroa-skai, believing that Shimrra was visiting the planet. Though the New Republic was victorious, they found that the fleet they had attacked was led not by the Supreme Overlord, but by Supreme Commander Komm Karsh."}, {"tag": "p", "text": "In 28 ABY, Shimrra arrived at Coruscant in his flagship, a specialized Koros-Strohna worldship. With tens of thousands of Yuuzhan Vong on the planet assembled to cheer their leader, the ship landed. The ship eventually became Shimrra's Citadel, where the Supreme Overlord's throne room was located. Shortly after landing on the planet—now renamed Yuuzhan'tar, after the Yuuzhan Vong's original homeworld—Shimrra held a meeting in his throne room with the Elite, the leaders of the four main castes. There, he chastised Tsavong Lah for the heavy casualties the Yuuzhan Vong had suffered in taking Coruscant, as well as for failing to adapt to new techniques used by the New Republic. He also questioned Executor Nom Anor, who had served as an advance spy, about the government of the other beings of the galaxy, finding their tolerance and democracy to be a new—and foolish—concept. After finishing his interrogation of Anor, he began speaking to Master Shaper Ch'Gang Hool, who was directing the terraforming of the planet. The effort had been replete with failures, however, and when Hool confessed the fault, a furious Shimrra ordered him to be executed."}, {"tag": "p", "text": "Soon after this meeting, Shimrra was present at a ceremony dedicating a temple to the creator god Yun-Yuuzhan. The Yuuzhan Vong planned to execute over a hundred captives from the Battle of Coruscant, many of them senators or military officers. However, before the ceremony could begin, the Square of Sacrifice was filled with waste that had, for some reason, been rejected by the maw luur, creatures that disposed of sewage. Angered, Shimrra declared the ritual null and void, and ordered the captives to be killed without onlookers. He then held a meeting in the temple with the Elite, scolding them and questioning if the World Brain—the creature in charge of the terraforming—could be behind the various failures in the process. After ordering that a shaper be killed for the failure of the ceremony, he agreed to let Lah attack the New Republic soon."}, {"tag": "p", "text": "At some point, the Supreme Overlord met alone with Nom Anor regarding the movements of the New Republic, and the Peace Brigade, a group of beings native to the galaxy that had allied with the Yuuzhan Vong in hopes of being on the winning side. Anor also brought news of Thrackan Sal-Solo, a Corellian politician who had promised to sign a treaty of neutrality with the invaders and disable the Centerpoint Station superweapon if the Yuuzhan Vong would leave the Corellian system alone. Sal-Solo, along with his bodyguard Darjeelai Swan, had come to meet with Shimrra. An interrogation of Swan revealed that the New Republic, not Sal-Solo, was in control of Centerpoint Station. This deception greatly angered Shimrra, although he agreed to meet with the Human."}, {"tag": "p", "text": "Sal-Solo was ushered into the chamber, where Shimrra informed him that he had decided to accept the Human's offer. However, he had altered the deal; the Yuuzhan Vong would help Sal-Solo's Centerpoint Party take control of the Corellian system, after which Shimrra would be in charge of the system. In addition, the Yuuzhan Vong planned not to send Sal-Solo back to the Corellian system, but to make him leader of the Peace Brigade on their headquarters of Ylesia. The citizens of the galaxy saw the Peace Brigaders as traitors, and Shimrra knew that by forcing Sal-Solo to associate with them, the Human would be discredited and kept under the Yuuzhan Vong's thumb. When informed of the many changes to his plan, Sal-Solo tried to negotiate his way out; however, his speech only angered the Supreme Overlord. Infuriated by the fact that an individual he saw as scum would attempt to speak to him like an equal, Shimrra ordered Sal-Solo removed from his chambers to be sent to Ylesia."}, {"tag": "p", "text": "The Supreme Overlord later held a meeting with Anor and Lah in his private chamber. Anor had collected evidence indicating that the New Republic had fled to the Deep Core moon of Ebaq 9, and the three planned a surprise attack that Anor felt would break the back of the New Republic. However, the battle was actually a trap created by the New Republic, resulting in the death of Tsavong Lah. After the battle, Shimrra met with the Elite in his throne room, and informed them that the defeat was merely a test from the gods. Swearing revenge on the infidels, he also proclaimed Nom Anor to be a traitor, placing a death sentence on his head. Around this time, Shimrra began to slip from Onimi's control, as the Shamed One grew preoccupied with the Trickster Goddess Yun-Harla, whom he blamed for ruining him."}, {"tag": "h3", "text": "The tide turns"}, {"tag": "p", "text": "In the time after the Battle of Ebaq 9, the war continued to take a downward turn for the Yuuzhan Vong. As Nen Yim's efforts to develop new Shaping protocols continued to produce no results, Shimrra grew increasingly angered. Part of this was due to the recent Jeedai heresy led by the prophet Yu'shaa, who was secretly Nom Anor in disguise. The Jeedai heresy was a rapidly growing movement of Shamed Ones that worshiped the Jedi as their saviors, and condemned Shimrra as the \"Rainbow-Eyed Enemy,\" the being who kept them enslaved. Around this time, Shimrra received a report from Commander Ekh'm Val. Val had stumbled upon a mysterious planet, and brought back a starship from that world with several features characteristic of Yuuzhan Vong vessels. After hearing details of the apparently living planet, Shimrra knew that it was Zonama Sekot. Seeking to prevent others from learning of the planet's existence, he had Val killed, his name removed from the records, and his vessel, the Noble Sacrifice, destroyed. In this way, he successfully prevented anyone from learning of Zonama Sekot's existence, keeping his power secure."}, {"tag": "p", "text": "Much to the Supreme Overlord's displeasure, Yu'shaa remained at large in the Coruscant Underworld, and the heresy continued to grow. Several members of his court, such as Prefects Ash'ett and Drosh Khalii, were found to be guilty of heresy, as several members of their household were believers in the Jeedai movement. On the strength of this evidence, a furious Shimrra had the Prefects and their families killed. However, the evidence had actually been planted by the Priestess Ngaaluh, a secret follower of Yu'shaa. Nom Anor sought revenge on his enemies, and had arranged for their downfall; Ash'ett and Khalii had been innocent of the crimes they were charged with. Unbeknownst to Ngaaluh and Anor, however, was the fact that Shimrra was suspicious of the evidence; he believed it to be too perfect."}, {"tag": "p", "text": "The Supreme Overlord began conducting his own investigations and interrogated the Yuuzhan Vong heretics that had been planted in the Prefects' homes. When confronted by their ruler, the terrified heretics confessed that they had merely been placed there, effectively absolving the Prefects of the alleged crimes. When Ngaaluh accused Prefect Zareb of heresy and presented the evidence in front of the Elite, Shimrra questioned the leaders of the various castes. After successfully intimidating several of the most powerful beings in the Yuuzhan Vong Empire, Shimrra turned on Ngaaluh. He revealed that he had learned that she had fabricated the evidence, and ordered his guards to seize her. However, the Priestess committed suicide by poison before they could stop her."}, {"tag": "p", "text": "Shimrra refused to let the dead Prefects' honor be restored, claiming that they would stand as a powerful reminder to those who tried to oppose him. The Jeedai heresy, he swore, would be stopped, and its members killed. Later, Onimi showed Nen Yim the starship that had been brought to the Supreme Overlord by Ekh'm Val. The ship was of Sekotan origin, and while examining it, Nen Yim discovered that it had many similarities to the Yuuzhan Vong's yorik-et fighters. When Yim revealed her discovery to Shimrra, he ordered her to develop weapons that could be used against the vessels if the Yuuzhan Vong ever met such ships in battles. Despite the fact that Shimrra sought weapons to use against similar ships, he stated that the planet where the ship had come from had been destroyed, as he wished to keep knowledge of Zonama Sekot from spreading among his people."}, {"tag": "h3", "text": "Dissidence and intrigue"}, {"tag": "p", "text": "A short time after Nen Yim began studying the ship, she fled from Shimrra's Citadel with the help of several Jedi and dissident Yuuzhan Vong. In her absence, Shimrra promoted Shaper Adept Qelah Kwaad to the rank of Master Shaper. During his questioning of Kwaad, she stated that she believed that Master Shaper Ahsi Yim, who had been assisting Nen Yim, had played a part in Nen Yim's disappearance. An irate Shimrra then had Ahsi Yim killed. Not long after this, he received a message from intendant Phaa Anor. Anor informed the Supreme Overlord that he had been contacted by Nom Anor, who had crucial information for Shimrra."}, {"tag": "p", "text": "Shimrra spoke to Nom Anor via villip, and the former Executor stated that he was on Zonama Sekot with Nen Yim and the Priest Harrar. When Shimrra proclaimed that such an action was impossible, as Zonama Sekot had been destroyed, Anor told him to contact Harrar, knowing that the Supreme Overlord would be unable to locate him on Yuuzhan'tar. Realizing that his bluff had been called, and that other Yuuzhan Vong had at last learned of Zonama Sekot, Shimrra was frightened. Nom Anor stated that he could cause his villip to act as a tracer, allowing Shimrra to send a fleet to destroy the planet. As he knew how difficult Zonama Sekot was to destroy, Shimrra was hesitant; however, the Supreme Overlord was swayed when Nom Anor pledged to sabotage it, enabling the Yuuzhan Vong to destroy the planet. If Anor succeeded, Shimrra—who remained unaware that he was Yu'shaa—promised to forgive the former Executor and allow him admission to his court once more."}, {"tag": "p", "text": "The Red Qurang, commanded by Ushk Choka, was sent to bring Nom Anor back to Yuuzhan'tar. Anor did sabotage the planet as promised before Choka arrived; however, his efforts failed to destroy Zonama Sekot. Unaware of this, Shimrra promoted Anor to the rank of Prefect. Meanwhile, the Supreme Overlord had begun to hear rumors from his spies that, due to the turn in the war's tide, a number of Yuuzhan Vong were losing their faith in him, and believed that he had fallen out of favor with the gods. Determined to quash any thoughts of rebellion, he held a meeting with the Elite, warning the high-ranking Yuuzhan Vong of the consequences of betrayal while also putting the blame for the recent losses in battle on the Elite, claiming that they had been disloyal to him, and by extension, the gods. While the Supreme Overlord castigated the Elite, Onimi followed him around, spouting rhymes, as was his custom."}, {"tag": "p", "text": "After he had finished lecturing his underlings, Shimrra revealed to them his ten Slayers, warriors equipped with unique weapons and biot technology. Because they were a fusion of the priest and warrior castes, the others in his court viewed them with contempt, and proclaimed them to be abominations. When Supreme Commander Chaan questioned Shimrra's wisdom in creating the Slayers, the Supreme Overlord ordered him to choose ten of his warriors and do battle with the Slayers. Two of the Slayers were able to defeat Chaan and ten of his warriors, to the shock of the assembled crowd."}, {"tag": "p", "text": "After the public audience, Shimrra held a private meeting with Nom Anor, revealing his belief that the Yuuzhan Vong's greatest enemy was not the Galactic Federation of Free Alliances—as the New Republic was now known—but the gods. The gods, the Supreme Overlord believed, had grown angry because the Yuuzhan Vong no longer needed them. In Shimrra's view, the Yuuzhan Vong had become strong enough to survive without their gods, and even take their power. True believers in the gods—such as the majority of Yuuzhan Vong—posed a threat to Shimrra's plans to usurp the gods' power, although he remained confident in his ability to manipulate others and promote his own agenda. However, by this point he was completely insane, his mind twisted by Onimi's visions of power and his own hatred of the gods."}, {"tag": "p", "text": "Three days after the Battle of Caluula, which saw the capture of thousands of infidels, many Yuuzhan Vong, including the Supreme Overlord, met at the Place of Sacrifice on Yuuzhan'tar for the ceremonial execution of the prisoners. However, before the ritual could begin, the Yuuzhan Vong were attacked by a mass of Shamed Ones, who were able to free a number of the captives. This skirmish, an indication of the increase in strength of the Jeedai heresy, infuriated Shimrra, as the movement threatened his power. He ordered three thousand Shamed Ones to be rounded up in the ensuing days, regardless of whether they were believers in the heresy movement, and had them executed. At some point, he was able to convince the errant World Brain to perform its tasks dutifully, rather than sabotaging a number of projects it was supposed to be directing. With this accomplished, the terraforming of Yuuzhan'tar finally began to proceed smoothly."}, {"tag": "h3", "text": "The appearance of Zonama Sekot"}, {"tag": "p", "text": "Shimrra later ordered Nas Choka to attack Mon Calamari, the new headquarters of the Galactic Alliance. Though Choka cautioned against such an attack, the Supreme Overlord stated that an assault was necessary to placate the bloodthirsty gods, chiefly Yun-Yuuzhan. Three days later, a fleet commanded by Choka was dispatched from Yuuzhan'tar. Shimrra and the Elite saw to its departure, with the Supreme Overlord urging Yun-Yuuzhan to aid the fleet in its mission to destroy the infidels on Mon Calamari. By this point, Shimrra had become reviled by many, who had lost all confidence in his leadership ability and believed that the gods no longer favored him."}, {"tag": "p", "text": "The Yuuzhan Vong launched their assault on Mon Calamari and were able to gain the upper hand over the Galactic Alliance fleet, when suddenly Zonama Sekot appeared in the sky above Yuuzhan'tar. Nas Choka retreated to Yuuzhan'tar, while ordering the Yuuzhan Vong ships already there to resist from attacking the strange planet. The sudden appearance of Zonama Sekot—which had been proclaimed by Yu'shaa to lead to the defeat of Shimrra and the salvation of the Shamed Ones—created chaos on Yuuzhan'tar. Ecstatic Shamed Ones rioted, while many higher-class Yuuzhan Vong were struck with fear and confusion."}, {"tag": "p", "text": "After several days with the planet sitting in space near Yuuzhan'tar, Shimrra called for a private meeting with Nom Anor. Although the Prefect admitted his failure to kill the world earlier, Shimrra revealed that he did not blame Anor—rather, he felt that the gods were at fault. As he explained to Anor, the Supreme Overlord believed that the gods had saved Zonama Sekot and brought it to Yuuzhan'tar. If they could now destroy it, the Yuuzhan Vong would win the war, he stated. To prevent the gods from interfering, Shimrra ordered to Anor to inform all the priests that they were to cease worshiping any god other than the Trickster, Yun-Harla. If they focused all their rituals on her, Yun-Harla would grow arrogant, and the jealous gods would strike at her, starting a war amongst themselves. This would be payback for the suffering the gods had caused the Yuuzhan Vong during their journey through the Intergalactic Void, Shimrra felt, and while the gods were distracted, the Yuuzhan Vong would destroy Zonama Sekot."}, {"tag": "p", "text": "Shimrra later met with the Elite, and after mocking them for their cowardice, he informed them that he was aware of the rumors that he was unfit to rule. In addition, Shimrra revealed to them his knowledge of Zonama Sekot, whose existence he had previously denied, and said that after his coup, he had dispatched forces to look for Zonama Sekot. However, as they had been unable to locate the fabled living world, Shimrra stated that he had questioned if it was merely an invention of Quoreal's, borne out of cowardice. The appearance of Zonama Sekot, he believed, was but a final test by the gods. Shimrra also claimed that in his prayers to Yun-Harla, a solution had been provided."}, {"tag": "p", "text": "During a brief skirmish with Galactic Alliance forces on Caluula just days before, all Yuuzhan Vong and their biots on the planet—as well as several other life-forms—had become ill and died. Shimrra deduced that this the result of a chemical weapon developed by the Alliance. One ship had made it back to Yuuzhan'tar, where it was kept in the atmosphere to prevent it from infecting any other Yuuzhan Vong. The Supreme Overlord planned to crash the ship on Zonama Sekot, an action that would release the pathogen, infect the planet, and eventually kill it. Soon afterward, an armada led by Choka was dispatched to Zonama Sekot with the mission of infecting the planet."}, {"tag": "h3", "text": "The final battle"}, {"tag": "p", "text": "Shimrra was later interrupted from his meditation by Supreme Commander Laait, who informed the Supreme Overlord that Nas Choka had a message for him. A Galactic Alliance fleet had stood between the Yuuzhan Vong and Zonama Sekot, and though Choka's forces had broken through the enemy's lines, Zonama Sekot had launched its own defenses—living ships. Shimrra and all the Yuuzhan Vong present were stunned by this news. When several priests questioned whether Shimrra could have been mistaken, the Supreme Overlord had his Slayers execute them, lest his tenuous hold on power continue to slip. In reply to the musings of High Prefect Drathul and High Priest Jakan, he proclaimed that the heretics were responsible for the appearance of these infidel vessels."}, {"tag": "p", "text": "To settle this matter, Shimrra placed half of the warriors in his Citadel under the command of Nom Anor, who would then direct the execution of every single heretic on Yuuzhan'tar. Fearing defeat, the Supreme Overlord was also able to convince the World Brain to create fires all across the surface of Yuuzhan'tar, in hopes of rendering it uninhabitable for anyone. Meanwhile, the Battle of Yuuzhan'tar raged on, with Galactic Alliance vessels battling Yuuzhan Vong ships above Yuuzhan'tar. Contemporaneously, the Yuuzhan Vong tried to crash the infected vessel on Zonama Sekot, which was currently in-system near the planet Muscave."}, {"tag": "p", "text": "A number of Galactic Alliance soldiers and Jedi were able to land on Yuuzhan'tar, and three Jedi managed to penetrate the Yuuzhan Vong's defenses and enter Shimrra's Citadel. In his private quarters with Onimi and fifteen Slayers, Shimrra waited for their arrival, keeping in his robes the lightsaber of the Jedi Anakin Solo, who had died during the Mission to Myrkr two years earlier. Soon, the trio made their way to Shimrra's private dwelling. There, the Jedi—Luke Skywalker, Jacen Solo, and Jaina Solo—engaged the Slayers in combat."}, {"tag": "p", "text": "Despite Onimi's employment of his powers to shift the Citadel, constantly throwing everyone off-balance, the Slayers were unable to defeat the Jedi, with Luke Skywalker in particular putting up a furious assault. Shimrra soon entered the fight, wielding his Scepter of Power, a special amphistaff. He engaged Skywalker in single combat while the remainder of the Slayers dueled the Solos. The Supreme Overlord was able to gain the upper hand, wrapping his amphistaff around Skywalker. The Jedi also suffered a bite from the creature, spreading poison through his body. With Skywalker at his mercy, Shimrra then drew Solo's lightsaber from his robes."}, {"tag": "p", "text": "As Shimrra moved to decapitate Skywalker, the Jedi used the Force to pull the weapon from the Supreme Overlord's hand. With the Yuuzhan Vong distracted, Skywalker quickly sliced his Scepter of Power into pieces, and then cut off Shimrra's head, ending his life. Meanwhile, Jacen and Jaina Solo pursued Onimi up to the Citadel's private yorik-trema escape vessel, where the Shamed One revealed that he was the true Supreme Overlord, having used his powers to control Shimrra for decades. Jacen Solo was able to kill him, and a short time later, the Yuuzhan Vong fleet over Yuuzhan'tar—which had failed to destroy Zonama Sekot—learned that Shimrra had died. For the first time in their history, the species was without a Supreme Overlord, their conduit to the gods. In addition, because Shimrra had eliminated all potential challengers, the Yuuzhan Vong had no one to take up his mantle and lead them. Completely lost without their ruler, the species surrendered. Soon after, the Sekot Accords were signed, stating that the Yuuzhan Vong would destroy all their weapons, abandon their war-like ways, and settle on Zonama Sekot—which the Jedi had realized was a seed of the original Yuuzhan'tar. With this, the war was ended."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Shimrra spent most of the last six decades of his life under the control of Onimi, who used his Force powers to bend Shimrra to his will. During his time as Onimi's puppet, Shimrra was characterized by his cruelty, his desire to protect his power, and his ability to manipulate others. Though the Yuuzhan Vong were a violent species, Shimrra had a reputation as being more vicious than most members of his species."}, {"tag": "p", "text": "Shimrra sought to exterminate all infidels, believing it to be his duty as demanded by the gods. He was ruthless in this quest, and by the end of the Yuuzhan Vong War over one-third of the warrior caste had died. Despite reprimanding Tsavong Lah for wasting his troops, Shimrra was content to sacrifice a great number of Yuuzhan Vong in pursuit of his goals, namely the conquest of the galaxy."}, {"tag": "p", "text": "He hated the Jeedai heresy, decrying its followers and leader, Yu'shaa, and was willing to kill all the members in the households of two Prefects simply for having heretics in their homes. Even when it was proven that the heretics had merely been planted by Ngaaluh, Shimrra refused to allow the reputations of the now-dead intendants to be restored, stating that their deaths would stand as examples for other Yuuzhan Vong. So great was Shimrra's hatred for the heresy that he had Zareb killed after being accused of heresy by Ngaaluh, despite the fact that he had already determined that the Priestess was merely falsifying the evidence."}, {"tag": "p", "text": "As Supreme Overlord of the Yuuzhan Vong, Shimrra was believed to be the species' sole link to the most important god, Yun-Yuuzhan, and consequently, had near-unlimited power over his people. He served as the head of all castes, having the authority to command everything from the efforts of the warrior caste to the priests' worshiping. Shimrra loved his power, and went to great lengths to protect it after overthrowing Quoreal. This included killing many thousands of heretics, as well anyone who opposed his will. Shimrra suppressed all knowledge of Zonama Sekot, and killed Ekh'm Val for discovering the planet during the Yuuzhan Vong War so as to prevent others from learning of the world that supposedly foretold the Yuuzhan Vong's doom. He also kept from his species for decades the knowledge of the emptiness of the eighth cortex, knowing that if such knowledge ever spread, his authority would greatly weaken."}, {"tag": "p", "text": "For much of his life, Shimrra exerted total control over the Yuuzhan Vong. Ruling with an iron fist, he frequently ignored the advice of his advisors on the Great Council. The Supreme Overlord intimidated other members of his species into submission, and gained a reputation for being ruthless and terrifying. Other Yuuzhan Vong were fearful of him, and even Warmasters trembled in his presence. In addition, Shimrra had an uncanny ability to sense what others were thinking, thanks to Onimi's Force-sensitivity. Such was the Supreme Overlord's seeming omniscience that High Prefect Yoog Skell once warned Nom Anor to never even think of lying to Shimrra. Shimrra was also very skilled at manipulating others, and was talented in the field of political intrigue. Onimi was able to use his Force powers to subtly influence other Yuuzhan Vong, thus making it appear as though Shimrra had the mysterious ability to affect others' minds. This added to his reputation as a terrifying, omniscient leader."}, {"tag": "p", "text": "To help further his stature as an omnipotent vessel of the gods, Shimrra had both his public and private thrones in his Citadel equipped with dovin basals—creatures that could produce gravitational fields. Through use of these dovin basals, Shimrra made it seem as though those who walked toward his throne were walking uphill, and that to merely approach the Supreme Overlord was a monumental task in itself."}, {"tag": "p", "text": "Unlike most Yuuzhan Vong, Shimrra did not place his faith in the gods, but sought to overthrow them, much as he had overthrown Quoreal. Under the influence of Onimi, Shimrra grew to hate the gods, and declared war on them. He believed that the Yuuzhan Vong had surpassed them, and were ready to take their place. Shimrra thought that the gods were fearful of this, and that they conspired to destroy the Yuuzhan Vong. The appearance of Zonama Sekot in 29 ABY was just a test, the Supreme Overlord believed. By destroying Zonama Sekot, he felt that the species would prove themselves and force the gods to surrender."}, {"tag": "p", "text": "By 29 ABY, Shimrra had gone completely insane. Despite his ability to intimidate and manipulate others, many Yuuzhan Vong had lost confidence in Shimrra. His declarations that the gods were the Yuuzhan Vong's true enemy, not the Galactic Alliance, were met with skepticism from the Elite, a group that normally was greatly fearful of him. However, some of them had heard rumors of Zonama Sekot, and as the war began to take a downward spiral, their faith in Shimrra wavered, with some believing that the Yuuzhan Vong had been better off under Quoreal. Prefect Nom Anor and High Prefect Drathul were two such members of the Supreme Overlord's court who had lost all confidence in Shimrra by the time of the Battle of Yuuzhan'tar. Anor believed that Shimrra no longer provided stable guidance for the Yuuzhan Vong, and that the species was lost."}, {"tag": "p", "text": "To maintain the charade that Shimrra was the Supreme Overlord, and Onimi nothing more than his jester, Onimi had Shimrra abuse him in public. This prevented anyone from learning that Onimi was the power behind the throne, and though many wondered why the Supreme Overlord kept a Shamed One as his familiar, they did not question Shimrra to his face. As Supreme Overlord, Shimrra was frequently addressed as \"Dread Lord,\" \"Great One,\" or \"Fearsome One,\" among similar titles."}, {"tag": "h3", "text": "Appearance"}, {"tag": "p", "text": "Modified by Yuuzhan Vong shapers, Shimrra grew to an extremely large size. Luke Skywalker noted that the Supreme Overlord was the largest Yuuzhan Vong he had ever seen, and Nom Anor observed that he towered over the Elite in meetings. The hau polyp creatures that made up his throne would occasionally burst due to the strain placed on them from supporting the Supreme Overlord's massive frame. Shimrra had thin limbs and a large head, and his torso and head were covered in brands and tattoos honoring the gods. He wore gray robes made from the flesh of Steng, a rebellious Yuuzhan Vong Warmaster from millennia ago."}, {"tag": "p", "text": "Shimrra had mqaaq'it-implant eyes that constantly shifted colors, although they were most often red. His eyes glittered when he was angry, and had the effect of causing anyone under his gaze to feel intimidated and as though the victim's mind was being read. Nom Anor feared the Supreme Overlord's eyes, finding the frequent color-changes to be unnerving."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shimrra Jamaane was created for The New Jedi Order, a nineteen-book series published by Del Rey between 1999 and 2003. The character was mooted during the initial meetings between several authors and Lucas Licensing editors that plotted out the overarching progression of the series. At this preliminary stage, James Luceno, who was then acting as a consultant but later authored three of the series' novels, suggested the idea that the Supreme Overlord could be a mere \"puppet ruler\"."}, {"tag": "p", "text": "Shimrra was first mentioned in Luceno's The New Jedi Order: Agents of Chaos I: Hero's Trial, published in 2000 as the fourth novel in the series. He was then mentioned in several other novels, playing the role of a major villain controlling events from the background, and as the driving force behind the invasion. He made his first appearance in Greg Keyes' The New Jedi Order: Edge of Victory II: Rebirth, published in 2001. Shimrra's true role as Onimi's puppet was hinted at in The New Jedi Order: Destiny's Way, and the character's importance grew near the end of the series, as he was given a major role in several books, culminating with the final novel in the series, The New Jedi Order: The Unifying Force. Written by Luceno, this ultimate installment in the series finally revealed Shimrra's role as figurehead for the apparent jester Onimi."}, {"tag": "p", "text": "Following the conclusion of The New Jedi Order, Shimrra received mentions in several novels and reference books. He was first identified as \"Shimrra Jamaane\" in Luceno's novel, Millennium Falcon, published in 2008. Both The New Jedi Order: Edge of Victory I: Conquest and Legacy 44 misspell his name as \"Shimmra.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}