{"url": "Shintel", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Galactic Empire planets", "Category:Kathol sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Shintel"}, {"tag": "p", "text": "Shintel was a planet located in the Shintel system of the Kathol sector, which was part of the Outer Rim Territories. A remote, muddy, and wet world, Shintel's only distinction was that it was the location of a supply depot established by Warlord Moff Kentor Sarne as part of his military forces. Commanded by veteran Imperial Army officer Colonel Heget, the depot was intended to be used by Sarne in the event that the Galactic Empire ever decided to attempt to reabsorb the Kathol sector."}, {"tag": "p", "text": "In 8 ABY, following Sarne's defeat by New Republic forces at his capital, Kal'Shebbol, the Moff fell back to Shintel to strip the depot of its supplies, simultaneously stranding those members of his forces that were not personally loyal to him on the planet. Shortly thereafter, the New Republic CR90 corvette FarStar arrived in orbit, tracking Sarne. The commander of the FarStar, Captain Kaiya Adrimetrum, struck a deal with Colonel Heget to assist him in contacting outside help to rescue the marooned Imperial personnel in exchange for information on Sarne's likely destinations."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Shintel was the third planet located in the system of the same name, which was part of the Kathol sector of the Outer Rim Territories in grid coordinates M-21. The world was connected via hyperlane to three other star systems; the Peirs system was three hours' travel away, the Ivatch system was eight hours distant, and it took three days to transit to the Pembric system by Class One hyperdrive. Additionally, Shintel was connected to a small nebula that was the location of the space station Tanquilla Beach, the sector's major shadowport, which was a day's travel away."}, {"tag": "p", "text": "Shintel was a temperate, wet and muddy world with heavy cloud cover. A day on Shintel lasted nineteen standard hours, and a year lasted 343 local days, divided into ten months. The planet's northern hemisphere experienced a rainy season that lasted for seven months, with mild summers and winters. The atmosphere was breathable for Humans and other oxygen-breathing species, and the planet had standard gravity. The planet's terrain consisted of forests, mudflats, and mountains, with low seas. Shintel's only population center was Imperial Depot 4290-1, a military supply station. As such, the planet produced no exports and relied on regular imports of food and technology to remain viable."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 4 ABY, following the death of Emperor Palpatine during the Battle of Endor, Moff Kentor Sarne of the Kathol sector quietly withdrew his sector from Imperial control and established himself as a warlord. Mindful of the possibility that Imperial forces would move against him to re-secure their former holdings, Sarne began establishing unofficial supply depots on the edges of his territory so that he would have resources available if he was forced to retreat and lie low. Shintel was selected as one such world, and Imperial Depot 4290-1 was established. Located in the planet's northwestern hemisphere, the installation consisted of a supply depot and a landing field manned by an Imperial Army contingent under the command of Colonel Heget. The base was stocked with munitions, and the facility's computers were used by Sarne to back up his navigational data of the Kathol sector."}, {"tag": "p", "text": "In 8 ABY, Sarne was forced to flee his capital on Kal'Shebbol as New Republic forces liberated the planet. Sarne managed to retreat with the majority of his forces, and as he withdrew he began visiting all the depots he had established, taking on as many supplies as possible to provision his forces and deny the supplies to any potential pursuers. After visiting Gandle Ott, Sarne traveled to Shintel to pick up the arsenal supplies. Sarne had three more objectives while at Shintel; firstly, he erased all the navigational data regarding the Kathol sector from the base's computers. Secondly, he replaced it with a less detailed map—Sarne was aware that the New Republic was tracking him, and that they were using one of his former vessels, the FarStar, to do it. Unbeknownst to the New Republic crew, Sarne had built multiple programming trapdoors into the ship that, when activated by certain stimuli, would incapacitate systems aboard the corvette. The new map that Sarne placed in Imperial Depot 4290-1's computers contained embedded programming designed to react with the FarStar's systems once uploaded. His last objective was the final purge of his officer corp. Sarne prized loyalty to himself over loyalty to the Empire or even actual skill, and he had created a personality cult where those officers more loyal to him were given prized assignments and favorable treatment. At Shintel, he transferred those officers and men whom he judged loyal to him to the fleet, and rotated out those officers he felt were disloyal, stationing them on the depot."}, {"tag": "p", "text": "Sarne left orders for the base's personnel to construct a blastboat landing field for future use to keep them occupied; he decided against killing those he thought of as \"traitors\" so as not to cause unrest within his own forces. Just prior to his departure, Sarne's men destroyed the hyperdrive engines on every hyperspace-capable vessel on the planet, as well as the courier droids assigned to the depot. Sarne further isolated Shintel by seeding the planet's orbit with Merr-Sonn Mark III Defender ion mines. Although he had no intention of returning to Shintel, Sarne did recognize the possibility that he might have need of the base in the future, so he left it intact."}, {"tag": "p", "text": "Stranded on the planet, the Imperial forces under Heget's command could not risk attempting to clear the minefield. Although they had five TIE/LN starfighters and cargo shuttles, they did not have the resources to recover any disabled ships that might have resulted from an attempt to destroy the mines. As the days passed, the personnel in the camp began to fall into two distinct camps. The first, led by Heget, saw Sarne's actions against them as a betrayal and had no wish to devote their resources on a project that was clearly designed to just keep them busy. They wanted to restore communications with the proper Imperial command authority. The second group rallied around Major Danthe, the base's second-in-command. While he had no love for Sarne, Danthe's followers held the belief that the Moff would eventually return and that the extreme measures taken by Sarne were to protect the facility in case of its discovery by New Republic forces. To further confuse the situation, one of the depot's officers, Lieutenant Palme, was one of Sarne's deep-cover agents. He had been given the responsibility of ensuring that the doctored astrogation charts were successfully uploaded to the FarStar. Amongst the personnel that Sarne stranded on the planet were four of his most loyal agents who were assigned to assist Palme in his endeavors."}, {"tag": "p", "text": "A week after Sarne's visit, the CR90 corvette FarStar arrived in orbit after receiving information regarding the Moff's possible movements from Colonel Olaver Lansel on Gandle Ott. Lansel, one of Sarne's deep-cover agents, had purposefully guided the Farstar to Shintel so that Sarne's doctored astrogation charts could be used to sabotage the vessel. Upon approach to Shintel, the FarStar was contacted by the Imperial Depot, who informed the ship's crew of the minefield orbiting the planet and requested that they identify themselves. The crew of the FarStar identified themselves as a New Republic vessel; the personnel at the depot cared little for the vessel's allegiance, only the fact that it had a working hyperdrive and was the solution to escaping the system. The FarStar was invited to land on the planet, but was informed that the minefield would have to be cleared first."}, {"tag": "p", "text": "The FarStar proceeded to clear part of the minefield, neutralizing five of the ion mines to clear a path to descend into Shintel's atmosphere. During the descent, two TIE starfighters and a Delta-class shuttle intercepted the FarStar. After a brief moment of anxiety, the trio of Imperial vessels announced they were an honor guard assigned to escort the FarStar to the depot landing field. The FarStar landed, and a delegation of the crew led by Captain Kaiya Adrimetrum and including First Officer Gorak Khzam, chief medical officer Akanseh, security officer Kl'aal, Chief Engineer Lofryyhn, and mechanic Brophar Tofarain, disembarked and met with an Imperial welcoming committee led by Heget and Danthe. After an awkward exchange of pleasantries and greetings, Heget invited Adrimetrum and her officers to meet in more comfortable surroundings. The Imperial and New Republic delegations adjourned to the main depot, traversing the kilometer-long distance on six-wheeled trams."}, {"tag": "p", "text": "The two delegations met in the depot's Officers' Barracks; Heget was candid with the FarStar crew, telling them that Sarne had effectively stranded them. In exchange for transporting a small delegation—himself and an aide—off-world so that they could contact the proper Imperial authorities and arrange for rescue, Heget would provide them with astrogation charts and information on Sarne's possible locations, and would resupply the FarStar with what he could spare from the base's stores. Although wary of an Imperial trick, Adrimetrum agreed to the deal. As the FarStar underwent resupply, Adrimetrum was approached by Lieutenant Palme, who informed her that Heget was intending to betray the FarStar and give them incorrect coordinates that would lead them into a trap. Palme claimed to have a back-up of Sarne's navigational data that he copied as the Moff arrived at the base, and desired nothing more than to get off-planet and see his family again. He gave Adrimetrum the data so that she could check its authenticity herself and assured her it was encoded with Sarne's personal ID codes. While Palme met with Adrimetrum, his four agents infiltrated the FarStar with the intention of dismantling the hyperdrive motivator on one of the T-65 X-wing starfighters stationed aboard the corvette. They did not expect to succeed in their mission, as their primary goal was to cause the FarStar crew to doubt Heget's intentions."}, {"tag": "p", "text": "The FarStar crew investigated the datacard given to them by Palme and found the contents to be authentic, coded with Sarne's personal ID codes. As the datacard was uplinked to the FarStar's computers, programming with the information activated a trapdoor program embedded in the corvette's systems. The boobytrap was designed to disable the FarStar's hyperdrive engines; when the hyperdrive was activated, an overload spiral would mount in the hyperdrive coils, which in turn would release a surge of energy designed to burn out the coils. As the FarStar departed Shintel and engaged the hyperdrive, the resulting explosion engulfed the engine room, injuring crew members and damaging equipment. The hyperdrive engines were completely destroyed in the process, stranding the FarStar in a system without any source of replacement parts. However, Sarne's trap was not finished. With the FarStar stranded and damaged, the modified YT-1300 light freighter Steel Fist, operated by the bounty hunter group Qulok's Fist, entered the system and attacked the FarStar. Qulok's Fist had been contracted by Sarne to assault the New Republic vessel, but merely to harass them. Once the FarStar recovered from the sabotage and the initial assault and began to return fire, the Steel Fist disengaged and jumped to lightspeed."}, {"tag": "p", "text": "Lofryyhn, the FarStar's Wookiee engineer, devised a plan to jury-rig the FarStar's engines using parts cannibalized from the corvette's X-wing complement. After several hours, Lofryyhn successfully completed his work, but stressed that the temporary repairs would be insufficient to take them to Gandle Ott. The only destination within reach with the necessary repair facilities was the shadowport Tanquilla Beach. The FarStar jumped to hyperspace, departing the Shintel system."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Shintel was the location of Imperial Depot 4290-1, a supply depot established by Moff Kentor Sarne in the planet's northwestern hemisphere. The depot consisted of two distinct parts, separated by a paved road a kilometer long. The first section was the depot itself, which comprised the barracks areas, storage blocks and hangars, and a power plant surrounded by a permacrete ditch. The second area was the landing field, which included a large hardpan, enough TIE racks to house twenty-five fighter craft, hangars, fuel tanks, and a control tower. The base was commanded by Colonel Heget and normally housed 1,500 personnel, but could hold up to 2,000 if needed."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Shintel's only inhabitants were the Imperial Army personnel assigned to Imperial Depot 4290-1, usually numbering around 1,500 men. This number increased by 500 following Sarne's visit to the planet. The personnel were commanded by Colonel Heget, with Major Danthe as his second in command."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Shintel first appeared in Shintel Downtime, the fourth adventure scenario of The DarkStryder Campaign published by West End Games in 1995. The adventure was written by Paul Sudlow."}, {"tag": "p", "text": "The adventure, Shintel Downtime, proceeds on the assumption that the FarStar physically lands on Shintel, and this article reflects that decision. If, however, the players choose not to land the corvette on the planet, the gamemaster is directed to alter certain events to fit. The sabotage attempt on the FarStar by Sarne's men, for example, would target another hyperspace-capable vessel such as an X-wing or shuttle that landed on the planet in place of the FarStar."}, {"tag": "p", "text": "The ion mines surrounding the planet can be disabled in several ways, including from range with the FarStar's weaponry, by utilizing an X-wing, or by sending out a space-suited individual to disable the mines. The adventure notes that moving the FarStar or an X-wing in close enough to detect the mines without being fired on would be very difficult, but that risking an X-wing was preferable to endangering the corvette. This article assumes that the FarStar safely neutralized the minefield, but provides no specifics as to how it was managed."}, {"tag": "p", "text": "The conclusion to the players' adventures on Shintel can occur in several ways. The players can reject Palme's offer of the datacard, in which case no harm befalls them. However, the gamemaster may choose to activate the programming boobytrap in the FarStar in some other way, such as by having Palme remotely transmitting a message to the ship's computers. If the gamemaster chooses not to activate the boobytrap, then the FarStar takes Colonel Heget to Tanquilla Beach and the adventure continues from there with appropriate adjustment to the storyline. It is recommended that gamemasters taking this option reward the players with extra character points for outwitting Sarne."}, {"tag": "p", "text": "The adventure does note, however, that the players are extremely unlikely to resist the temptation of checking out the datacard, which triggers the boobytrap programming. This article assumes that this is the course of action taken by the FarStar crew, as the adventure assumes that the FarStar is damaged enough by sabotage and combat to require a refit at Tanquilla Beach. The crew has the option of bringing Palme's bribery attempt to Heget's notice, in which case the Lieutenant is incarcerated in the brig."}, {"tag": "p", "text": "During the skirmish over Shintel, the players may use the ion minefield to their advantage by leading their opponents into the field, and successfully piloting close to the mines can result in their attackers being disabled. If, however, the players are struggling to recover from the initial attack, the gamemaster can have Heget order his TIE fighters into battle, or have them rescued by the Verpine adventurer Kyli Ned'Ix."}, {"tag": "p", "text": "Following the stranding of the FarStar, the players have two main options for rescue. One is to send the hyperdrive-equipped X-wings to Gandle Ott for replacement parts or to arrange for a rescue cruiser. If a rescue is arranged, then journalist Dana Cadwell will accompany the ship to report on the failure of the New Republic's vanguard. The second option is to jury-rig the FarStar's engines with components from the X-wings carried aboard and limp to Tanquilla Beach. As the adventure continues on the assumption that the FarStar arrives at Tanquilla Beach in need of repair, this article assumes this to be the correct outcome."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}