{"url": "Shiv_(clone_trooper)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles that are known by a nickname", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "Shiv  (clone trooper)"}, {"tag": "p", "text": "\"Shiv\" was the nickname of a clone cold assault trooper in the Grand Army of the Republic during the Clone Wars. During the war, Shiv enjoyed writing to fellow clone trooper Flanker, even after Flanker's death during the Battle of Christophsis. In 22 BBY, Shiv and his squad were assigned to Glid Station on the ice planet of Orto Plutonia to field-test an assortment of subzero gear. While on the planet, his squad encountered an elusive and dangerous species they nicknamed the \"ice men.\" The creatures killed any of the clone patrols they encountered. Shiv and his commander, Mag, were later killed by the ice men while inspecting one of the station's outer sensors. The rest of the clones stationed in Glid Station, along with all the battle droids at the nearby Separatist base, were killed by the ice men as well. A Republic investigation later discovered that the ice men were actually a colony of Talz that had been attacked by the Separatists and that Glid Station was caught in the ensuing conflict."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Orto Plutonia"}, {"tag": "p", "text": "\"Shiv\" was the nickname of a clone cold assault trooper born on the planet Kamino to serve in the Grand Army of the Republic. During the Clone Wars between the Galactic Republic and Confederacy of Independent Systems, Shiv enjoyed writing to fellow clone trooper Flanker, even after Flanker's death during the Battle of Christophsis. In 22 BBY, Shiv and the rest of his squad were stationed at Glid Station on the frozen planet of Orto Plutonia. Orto Plutonia was orbited by the sovereign moon of Pantora, populated by the Pantorans, which had remained allied to the Republic during the Clone Wars. Shiv and his squad were tasked with testing experimental cold weather equipment, including the CK-6 swoop bike, nicknamed the \"Freeco bike.\" During their desert training, Shiv and Flanker had always thought that Shiv would be shipped off to a water planet, so Shiv found it amusing that he was stationed instead on an ice planet."}, {"tag": "p", "text": "Shiv's stay at Glid Station was filled with many problems. His squad's rations were not shipped in insulated canisters and, due to the extreme cold, were frozen solid. This forced the clones to boil their rations, which took away the little flavor the rations had. In addition, the Freeco bikes would freeze up if not constantly maintained."}, {"tag": "p", "text": "Matters grew worse when Shiv's squad started to encounter a very dangerous and mysterious species, which they nicknamed the \"ice men.\" All the patrols that had apparently encountered the ice men were killed. Although there was a nearby Separatist base on the planet, Shiv and his squad never encountered any battle droids, but they still tried to stay in fighting shape by building snowmen that resembled B1-Series battle droids; B2 battle droids; and General Grievous, the Supreme Commander of Separatist Droid Army, and used them as target practice."}, {"tag": "h3", "text": "Death at the hands of the \"ice men\""}, {"tag": "p", "text": "One night, Shiv and his commander, Mag, were inspecting an outer sensor when their Freeco bikes froze up. The pair was forced to spend the night on the frozen tundra until Glid Station could send an LAAT/i gunship to pick them up at dawn. The clones set up a small camp and a tent, deciding they would take turns guarding the camp and sleeping. While Mag was taking his shift of guarding the camp, Shiv decided to stay up and wrote a letter to Flanker on a datapad to calm his nerves. While Shiv was lamenting about the pair's predicament in his letter, Mag came into the tent to find that Shiv was writing instead of resting for his turn on guard duty. Soon after Mag entered the tent, a group of ice men attacked the camp, ripping open the tent and killing Mag. As Shiv tried to grab a DC-17 hand blaster to defend himself, he too was attacked and killed by the ice men."}, {"tag": "p", "text": "After Shiv and Mag were killed by the ice men, the snow creatures attacked both the Separatist outpost and Glid Station, destroying all the battle droids and clone troopers stationed at the separate bases. When the Republic lost contact with Glid station, the Galactic Senate sent an investigation party, led by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker, to Orto Plutonia to find out what had happened to the outpost. The team was accompanied by representatives from Pantora: Chairman Chi Cho and Galactic Senator Riyo Chuchi. The Jedi's investigation discovered that the \"ice men\" were actually a peaceful group of Talz that had been attacked by the Separatist battle droids, and the Glid base had been caught in the middle of the resulting conflict."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When nervous, Shiv found that writing letters relaxed him. Some of these letters were written to Flanker, even after his hatchmate was killed on Christophsis. However, Shiv was reluctant to tell others that he still wrote letters to Flanker, such as when Mag asked him who Flanker was. Shiv also had a sense of humor, which he showed in his last letter to Flanker before his death. As a clone of the Mandalorian bounty hunter Jango Fett, Shiv had tan skin, brown eyes, black hair, and, like all clone troopers, stood 1.83 meters tall."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shiv made his first and only appearance in the six-page Star Wars: The Clone Wars webcomic Cold Snap, which led directly into \"Trespass,\" an episode in the first season of the Star Wars: The Clone Wars television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}