{"url": "Shipyard_(water)", "categories": ["Category:Legends articles", "Category:Industrial facilities"], "nodes": [{"tag": "h1", "text": "Shipyard  (water)"}, {"tag": "p", "text": "Shipyards, sometimes referred to as docks, were military facilities used to construct ocean-going vessels, such as utility trawlers, frigates, and destroyers. It was used by the Gungans, the Rebel Alliance, the Confederacy of Independent Systems, the Grand Army of the Republic, the Galactic Empire, the Royal Naboo Security Forces, the Wookiees, and the Trade Federation."}, {"tag": "h2", "text": "Known Shipyard types"}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "When the Galactic Empire's Naval Shipyards are first constructed, they were an \"I-shape\" and were relatively bare, only composed of few walls and exposed generators and girders. The shipyard also possessed docking area entrances to the left, right, and bottom areas of the docks, as well as seven docks overall (including the I-like structures)."}, {"tag": "p", "text": "Further construction eventually led to a more stable appearance, with the wires not being exposed. The roof was also completed to have a sloping aspect down the spine of the shipyards. The southernmost area also possessed a gate."}, {"tag": "p", "text": "The Naval Shipyards, upon further refurbishments, fully enclosed all but the spine itself, which now possessed a full gate coming down into the water. The two sides also were sloped, similar to half-circles."}, {"tag": "p", "text": "Eventually, the Naval Shipyards, upon completion, had become towering over the prior models, and had its central gate open. The southern area also had a minor panel at the bottom."}, {"tag": "h3", "text": "Gungan"}, {"tag": "p", "text": "Similar to other Gungan architecture, the Gungan shipyards utilized Hydrostatic bubble-like devices to allow for some structure, including for the actual docks."}, {"tag": "h3", "text": "Rebel Alliance"}, {"tag": "p", "text": "The Rebels' shipyards themselves were built inside the shipyard building, and was constructed with an \"L-shape\" entry/exit point. It possessed two communication satellite arrays."}, {"tag": "h3", "text": "Royal Naboo Security Forces"}, {"tag": "p", "text": "The Royal Naboo Security Forces' architecture was largely derived from Naboo architecture, and the docks themselves were \"H-shaped\". Further expansions included a pangola and a balcony."}, {"tag": "h3", "text": "Trade Federation"}, {"tag": "p", "text": "The Trade Federations' shipyards utilized Neimoidian architecture, and had a manning tower at the top. The docks themselves were located underneath the actual building."}, {"tag": "h3", "text": "Wookiee"}, {"tag": "p", "text": "The docks, at least in the initial stage, were T-shaped."}, {"tag": "p", "text": "In its first stage of construction, it had metallic stairs leading from the main control tower to the docks, and had two exterior hangars, one adjacent to each side of the tower. Eventually, the docks were given a bigger walkway, with the docks themselves being underneath the walkway."}, {"tag": "h3", "text": "Confederacy of Independent Systems"}, {"tag": "p", "text": "Similar to most CIS installations at the time, it was based primarily on Geonosis architecture."}, {"tag": "p", "text": "When first constructed, the docks were partially submerged, with most of the development and shipments being haphazard. They eventually managed to merge them together, with their eventually elevating the docks. Its docks in its final state were of a T-shape, and were on elevated terrain. The ships exited and entered beneath a bridge, of which the bridge led to the docks and an entryway to the main facilities."}, {"tag": "h3", "text": "Grand Army of the Republic"}, {"tag": "p", "text": "The shipyards were largely prismatic in design, and were defined by aquamarine and white colors."}, {"tag": "p", "text": "The docks and the main shipyard building were connected by a fine pole between the two, and were otherwise completely separated, although they eventually were connected by two iron angular beams, with the main building being expanded to include a tower with three circular knobs at the top."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}