{"url": "Ship_(Sith_Meditation_Sphere)", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles that are known by a nickname", "Category:Sith Meditation Spheres", "Category:Starships of the Sith armada"], "nodes": [{"tag": "h1", "text": "Ship  (Sith Meditation Sphere)"}, {"tag": "p", "text": "Ship was the name that Alema Rar gave to the Sith Meditation Sphere found by Ben Skywalker in 40 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A male-programmed Sith Meditation Sphere, Ship had a round cockpit and resembled Yuuzhan Vong creations, but was inorganic and had a rusty red-orange color. Its main weapon shot large spheres at a target. The interior was bare. The pilot sat in a meditative posture in the center of the cockpit and communicated mentally with Ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ship was first used by Ben Skywalker in 40 ABY after Ben found him on the planet Ziost. Ben flew Ship to the Anakin Solo, where he presented it to Jacen Solo, who then gave it to Lumiya. Ship surprised Lumiya by saying it had found her. Lumiya was using Ship when she was followed by Mara Jade Skywalker to Hesperidium. The two former Emperor's Hands dueled, and if not for Ship's interference, Lumiya's survival would have been questionable. Ship intervened because its purpose was to train apprentices to fight, and it disliked the idea of its \"students\" dying. For this reason, Ship allowed Skywalker and Lumiya to fight, but would not let either one be killed."}, {"tag": "p", "text": "Later, Lumiya used Ship to follow Jacen to the Hapes Consortium, where she discovered that he had a lover and child. Although Lumiya and Ship helped Jacen by firing at the pursuing StealthX of Mara Jade Skywalker, they were assaulted by Jacen, who wished to keep his relationship with Tenel Ka secret."}, {"tag": "p", "text": "Following Lumiya's death at the hands of Luke Skywalker, Alema Rar took control of Ship, held at the Roqoo Depot by the Hapans. Her first action after assuming command was to take Ship to the Jedi Academy on Ossus, then to Korriban, where she met with the One Sith."}, {"tag": "p", "text": "Following her trip to Korriban, Alema Rar traveled to Kashyyyk, where she used Ship to save Darth Caedus's life during the ensuing battle."}, {"tag": "p", "text": "Later, Ship took Alema to Lumiya's asteroid where the pair came into conflict with Jedi Knights Zekk and Jaina Solo. During the fight Zekk tapped into old Dark side training from the Shadow Academy and persuaded Ship to seek a more suitable master. Ship fled from the Home and was pursued by the Poison Moon to Ziost. Dician, the commander of the Poison Moon, attempted to convince Ship to join the One Sith, but she was turned down. Ship didn't think that it was wise for her cult to remain hidden and instead sought out others who would be more compelled to take what was theirs."}, {"tag": "p", "text": "Later in 41 ABY, Ship arrived on the planet Kesh, where he encountered a Lost Tribe of Sith; namely a young human female named Vestara Khai. Ship sensed Khai's desire to be a Sith Master and offered to teach her in the ways of the dark side of the Force. Over the next two years, Ship helped the Tribe to build a small Sith armada, by assisting the Sith attack and capture other ships they encountered in space. However, in 43.5 ABY Ship left Kesh abruptly, much to the dismay of the Circle of Lords, who planned to recapture it."}, {"tag": "p", "text": "The team of Sith followed Ship to a planet controlled by a being called Abeloth. Abeloth had called Ship to her and now had complete power over it. After losing many of their members due to meddling by Abeloth, the strike team left the planet, without Ship."}, {"tag": "p", "text": "Later, Luke and High Lord Taalon's Sith strike force returned to the Maw to confront Abeloth. Jaina Solo accompanied Luke to destroy Ship in her StealthX. Under Abeloth's control Ship attacked the StealthX until it was severely damaged, and then abruptly left the planet for space. This coincided with the moment Abeloth was subdued and lost control over both Ship and the paranoid Jedi."}, {"tag": "p", "text": "However, Abeloth was not dead as she had lead others to believe and had masqueraded as the now deceased Dyon Stadd to fool the Jedi and Sith. Despite being weakened by the Jedi and the loss of one of her host avatars, Abeloth regained her control over Ship and used him to draw the Sith and Jedi to the Pool of Knowledge to distract them while she stole the Jade Shadow and escaped her planet."}, {"tag": "p", "text": "Ship remained enslaved to Abeloth during such times as her battles with the Jedi on Nam Chorios, her alliance with the Lost Tribe of Sith, and her ruling of both the Tribe and the Galactic Alliance. During the Liberation of Coruscant, Abeloth fled on Ship with a captive Vestara Khai and Ben Skywalker. When Abeloth was killed by Ben and Vestara, and her remaining avatars were destroyed, Ship was finally released from her hold and rushed to save Vestara from the Jedi whom she had betrayed back on Coruscant. There, he named her a Sith Lady and told her of the existence of another faction of Sith in the galaxy that would need her experience with the Skywalkers and his knowledge of Sith training to develop. The two then left to join this new order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although Ship is italicized in its entry in The Complete Star Wars Encyclopedia, it is not italicized in the novels—including novels published after The Complete Star Wars Encyclopedia—in which it has appeared. This article does not italicize the name due to the majority of sources not doing so."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}