{"url": "Shluur", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bands"], "nodes": [{"tag": "h1", "text": "Shluur"}, {"tag": "p", "text": "Shluur was a smazzo percussive ensemble composed of musicians from more than two dozen species that toured the galaxy doing musical performances. They once visited the Purghom Musical Performance Hall in the Bith capital city of Weogar on the planet Clak'dor VII for a two-week-long series of sellout concerts. One of the group's arrangers, the male Wookiee named Wurokkk, used these shows as an experiment on Bith vibrations based on biorhythms and brainwave patterns by composing a piece that caused aggressive behavior in the Bith. After an investigation uncovered Wurokkk's secret, the Wookiee was escorted off-planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shluur was a galaxy-touring smazzo percussion group comprising musicians from more than two dozen species. They mixed rhythms and vocals from various civilizations and music cultures across the galaxy. The group was to perform sellout performances for two weeks at Purghom Musical Performance Hall in the Bith capital city of Weogar on the planet Clak'dor VII. One arranger in the group was the male Wookiee Wurokkk, who experimented at these concerts by arranging a piece that subliminally encouraged aggressive behavior in the Bith audience via the use of vibrations based on the Biths' biorhythms and brainwave patterns."}, {"tag": "p", "text": "By the second week, the Bith became erratic, damaging property and assaulting each other. The band was investigated by a low-ranking government official on Clak'dor VII, and many who attended multiple Shluur concerts were found to have experienced violent outbursts. When confronted, Wurokkk was delighted by his experiment's success, resulting in the shocked Bith to request him to be escorted off-planet. Wurokkk planned to have a sonic-based surprise for his escorts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shluur was introduced in the Star Wars Roleplaying Game sourcebook Geonosis and the Outer Rim Worlds, released in 2004 by Wizards of the Coast and written by Craig R. Carey, Jason Fry, Jeff Quick, and Daniel Wallace. The band was used in an adventure seed titled \"Beat of a Different Drum.\""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}