{"url": "Bantha_Squad_(Clone_Wars)", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Grand Army of the Republic squads"], "nodes": [{"tag": "h1", "text": "Bantha Squad  (Clone Wars)"}, {"tag": "p", "text": "Bantha Squad was a special unit of clone troopers during the Clone Wars that was formed by the Grand Army of the Republic in response to significant challenges presented by Separatist Hailfire droids."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Bantha Squad was quickly established by the Grand Army of the Republic as a response to the destruction of entire platoons in the Clone Army. Assigned to specifically target Hailfire-class droid tanks, Bantha Squad included specialists in heavy weapons, aerial recon and demolitions. With these combined skills, the squad was capable of pinpointing and attacking Hailfire droids with the firepower needed to immobilize and demolish them in any assault operation."}, {"tag": "p", "text": "The tank gunner commander of Bantha Squad was an expert in the use and application of heavy weapons and demolitions, uniquely qualifying him to formulate successful strategies against Hailfire droids. The troopers under his command used a modified version of the A6 Juggernaut turbo tank's heavy repeating laser cannon to bombard Hailfire droids with weapons fire before a final application of explosives."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Armor"}, {"tag": "p", "text": "Bantha Squad clones were outfitted in white Phase I armor, with light- and dark-green designs to mark their squad affiliation. The commander wore extra plating on his helmet and body armor, and a kama for anti-blast protection against crippling injury as well as to signify his rank."}, {"tag": "p", "text": "In addition to jetpacks, aerial recon troopers wore macrobinoculars on their helmets and carried special communications equipment to relay key tactical information."}, {"tag": "h3", "text": "Kit"}, {"tag": "p", "text": "Bantha soldiers were issued the standard DC-15A blaster rifles, with the more compact counterpart—the DC-15S blaster carbine—assigned to the aerial recon trooper. Jetpacks featured built-in warheads, which cause devastating blasts against enemy units. The squad's clones were each equipped with utility belts, with the addition of holsters for the commander, who sported a pair of customized DC-17 hand blasters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In August 2010, Hasbro released the Anti-Hailfire Droid Squad Battle Pack as part of their Shadow of the Dark Side toy line to introduce Season 3 of the The Clone Wars television series. On the Game cards, the pictures of the troopers are modified pictures of various clone troopers. The two Clone Troopers, Aerial Recon Trooper and Clone Commander figures came with weapon accessories and 4 Galactic Battle Game cards 4 battle bases and 1 game die."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}