{"url": "Shock_Drum", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Nasan Godera's projects", "Category:Sonic weaponry", "Category:Superweapons"], "nodes": [{"tag": "h1", "text": "Shock Drum"}, {"tag": "p", "text": "The Shock Drum was a Superweapon created by the Galactic Republic during the Cold War with the reconstituted Sith Empire."}, {"tag": "p", "text": "A large ovoid device the size of a cavern, when activated it generated intense ultrasonic vibrations that disabled droids and other technology in an ever widening circle with the Shock Drum at its epicenter. The Shock Drum's vibrations became increasingly powerful the longer it was left on and in time resulted in massive seismic groundquakes and damage and even death to organic life within range as their molecules literally vibrated apart."}, {"tag": "p", "text": "It was originally conceived of as a device for deployment against enemy fortifications and military bases where it would soften them up by disabling and weakening their defenses. However it was discovered by Republic scientists that over a prolonged period it would cause the core of a planet to destabilize eventually causing it to reach critical mass and literally shatter apart, destroying the entire planet. Following this discovery the head of the Republic's superweapons program, General Var Suthra shut the project down and they only ever produced a single prototype based on Tatooine."}, {"tag": "p", "text": "Unfortunately for the Republic, the details of the Shock Drum were among those plans stolen by Sith infiltrator Sith Lord Tarnis. This resulted in the Sith, under the command of Darth Angral seizing control of the project and stealing the prototype. On learning that the Jedi responsible for his son's death was on Tatooine, Darth Angral ordered his subordinate Lord Praven to activate the Shock Drum and destroy Tatooine in order to kill the Jedi and his companions. However, Praven disobeyed his master's order to destroy the new deactivation code, believing he should face the Jedi Knight honorably. Fortunately, after defeating Praven in a duel the Sith surrendered to him and was convinced to join the Jedi Order. With his help the Jedi Knight was able to shut down the Shock Drum before it destabilized the planet's core."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Depending on the player's choices, the Shock Drum can either be buried, leave its fate up to Var Suthra or agree to its continued use."}, {"tag": "p", "text": "Star Wars: Imperial Handbook: A Commander's Guide mentions the Shock Drum in its section on superweapons, but mistakenly states that it was built by the Sith Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}