{"url": "Shoan_Kilian/Legends", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Humans", "Category:Males", "Category:Republic Navy admirals"], "nodes": [{"tag": "h1", "text": "Shoan Kilian"}, {"tag": "p", "text": "Shoan Kilian was a male Human admiral of the Galactic Republic during the Clone Wars. He was overseeing the actions of Clone Youth Brigade aboard the Venator-class Star Destroyer Endurance when it was sabotaged by a young Boba Fett. Later he was captured by the bounty hunters Aurra Sing and Bossk and held hostage along with two clones."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Encounter with Boba Fett"}, {"tag": "p", "text": "Around 21 BBY, Admiral Kilian oversaw a visit by the Clone Youth Brigade from Kamino. He did not know, however, that amongst the cadets was a young Boba Fett, who had infiltrated the Youth Brigade in an attempt to get close enough to kill the man Boba blamed for his father's death Jedi Master Mace Windu - also aboard the Endurance. Kilian witnessed the exceptional skills shown by Fett, who was going under the name \"Lucky\", during a targeting exercise, and commented that he was a cadet to watch, not knowing the dark reality behind the young clone."}, {"tag": "p", "text": "When Boba Fett tried to kill Windu with a hidden explosive charge, Kilian was standing at the bridge and checked the ship for any damage caused by the explosion. He reported that the Endurance would remain in orbit over the planet Vanqor and he wouldn't allow the ship to become a fat and easy target for the separatists, with which he ended his transmission to the Jedi."}, {"tag": "p", "text": "With the cruiser slowly diving into the atmosphere of Vanqor, the Admiral felt it was his duty to send the Clone Youth Brigade to the escape pods, though he told the young clones that this was for training purposes and said that the whole event would be good for telling a story back at the base. After the cadets had left, he ordered a clone to send a distress beacon - the ship was going down."}, {"tag": "p", "text": "The Jedi attempted to convince Kilian to leave the Endurance, but Admiral Kilian refused to leave his vessel behind, binding himself to the old traditions of the good captain going down with his ship. The Jedi decided that they could not change the Admiral's mind and left to help gather the escape pods. A few clones of the command bridge crew along with Clone Commander Ponds stayed to help the admiral. Afterwards, the ship entered the atmosphere and crashed on Vanqor. At that point the communication with the cruiser, its Admiral and the clones was lost."}, {"tag": "p", "text": "The Jedi assumed that Kilian and all aboard were killed in the crash, but the Admiral was amongst the survivors captured by the bounty hunters who soon attacked the wreckage. Admiral Killian, along with Ponds and a clone officer, were taken hostage by Boba Fett, with the assistance of bounty hunters Aurra Sing, Bossk, and Castas. Aboard Slave I, the admiral tried to reason with Boba, saying he was not like Aurra Sing and the other bounty hunters. After Sing's broadcasting of them and Ponds's murder, Killian and the clone officer were taken to Florrum to wait for Windu to come. When Plo Koon and Ahsoka Tano arrived and Bossk lost communications with Sing, Bossk prepared to shoot Kilian and the clone officer. Before he could do so, however, Ahsoka arrived and subdued Bossk. Ahsoka then freed Kilian and the clone officer and Kilian held Bossk at bay with the Trandoshan's own gun."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Admiral Kilian lived by age-old spacer traditions. After Boba Fett's actions caused the Endurance's orbit around the planet Vanqor to disintegrate, Kilian insisted on staying with his ship until the end. He did not expect the Jedi present to understand this decision."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kilian first appeared in \"Death Trap,\" the twentieth episode of the Star Wars: The Clone Wars television series' second season. The character was named after The Clone Wars concept artist Kilian Plunkett. His voice was provided by Julian Holloway, a British actor who gave the character a Scottish accent."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}