{"url": "Shmi%27s_motif", "categories": ["Category:Real-world articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "Shmi's motif"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "\"Shmi's motif\" is a short theatrical motif used to represent Shmi Skywalker in Star Wars: Episode I The Phantom Menace and Star Wars: Episode II Attack of the Clones. It was written by John Williams and recorded by the London Symphony Orchestra in February 1999. It made only two appearances in the Star Wars Episode I: The Phantom Menace Ultimate Edition soundtrack and two appearances in the Star Wars Episode II: Attack of the Clones soundtrack. The motif is usually realized as an oboe solo. It is homophonic, non-metrical, and is in a minor mode."}, {"tag": "h2", "text": "Conception and development"}, {"tag": "p", "text": "Composer John Williams was chosen to write the score for the 1999 film Star Wars: Episode I The Phantom Menace, as had been the case for all three of the original trilogy films. He wrote Shmi's motif specifically to represent the character of Shmi Skywalker, mother of young Anakin Skywalker and slave to Watto on Tatooine. Williams used the London Symphony Orchestra and the London Voices to perform the score, which was written between October 1998 and February 1999 and recorded durign the month of February 1999 in England. However, only the orchestra was used in Shmi's motif. The motif was released on the Star Wars Episode I: The Phantom Menace Ultimate Edition soundtrack CD by Sony Classical on November 14, 2000. The album was also released on vinyl by \"IAmShark\" in 2013. The Attack of the Clones soundtrack was released by Sony Classical on CD April 23, 2002, and as an MP3 download on May 16, 2002. On September 25, 2015, Sony Classical announced it would be releasing the soundtracks to The Phantom Menace and Attack of the Clones along with the other five films' soundtracks in three new sets: the Star Wars: The Ultimate Vinyl Collection, the Star Wars: The Ultimate Soundtrack Edition, and the Star Wars: The Ultimate Digital Collection on January 8, 2016."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "The entire motif mainly comprises a single oboe solo during its few appearances. The oboe utilizes vibrato throughout the solo. The slow tempo and minor mode accent the melancholy scenes. The solo is backed by quiet violin chords and is homophonic and non-metrical."}, {"tag": "h2", "text": "Use"}, {"tag": "h3", "text": "In the soundtracks"}, {"tag": "p", "text": "The motif makes only two short appearances in the Ultimate Edition soundtrack for The Phantom Menace: one three minutes and fifty-four seconds into the track \"Anakin Is Free\" and the other, with significant variation, four minutes and twenty-eight seconds into the same track. The motif makes one appearance in the soundtrack for Attack of the Clones one minute and twenty-six seconds into the track \"The Tusken Camp and the Homestead.\""}, {"tag": "h3", "text": "In the movies"}, {"tag": "p", "text": "In Star Wars: Episode I The Phantom Menace, the motif appears exclusively in the scene when Anakin Skywalker makes his last farewell to his mother, Shmi Skywalker, before leaving a life of slavery on Tatooine. In Attack of the Clones, it appears when Skywalker mentions his mother to Obi-Wan Kenobi on Coruscant, and for a final time when Anakin is holding his dying mother in his arms in the Tusken Raider camp."}, {"tag": "h3", "text": "In other media"}, {"tag": "p", "text": "Shmi's motif was used several times throughout parts two and three of the 2001 mockumentary R2-D2: Beneath the Dome, which began airing following that year's Thanksgiving showing of The Phantom Menace on FOX."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}