{"url": "Shortpaw", "categories": ["Category:Canon articles", "Category:Articles with gameplay alternatives", "Category:Chadra-Fan", "Category:Cyborgs", "Category:Junk dealers", "Category:Males", "Category:Privateers", "Category:Trade Spine League members"], "nodes": [{"tag": "h1", "text": "Shortpaw"}, {"tag": "p", "text": "Shortpaw was a male Chadra-Fan who was publicly known as a junk dealer on the mining colony Burnin Konn, but in secret he was the leader of the Trade Spine League, a union/privateer organization which operated in the Anoat sector during the Galactic Civil War. After the death of Galactic Emperor Sheev Palpatine in the Battle of Endor, Governor Ubrik Adelhard of the Galactic Empire established the Iron Blockade around the Anoat sector to prevent the news from spreading. The blockade prevented Shortpaw's Trade League from sending starships outside of the sector, so the Chadra-Fan hired a young smuggler to probe the Imperial sensor network and find a weak point. With the Smuggler's assistance, Shortpaw located a gap in the blockade near the abandoned Hutt world Mataou, allowing him to send ships through."}, {"tag": "p", "text": "Soon after, Shortpaw was contacted by the gangster \"Happy\" Dapp, who had formed a plan to raid Imperial intercept facilities and steal the contraband that the blockade had confiscated. Shortpaw agreed to help, and for the first step of the scheme, the Chadra-Fan dispatched the Smuggler to Hoth, where they would scavenge parts to restore a Lambda-class T-4a shuttle to use in the heist. However, the Smuggler's actions on Hoth caught Imperial attention, so Shortpaw removed himself from the operation."}, {"tag": "p", "text": "Dapp and the Smuggler continued the plan, and during a raid on an intercept facility, the Smuggler discovered a holovid of Leia Organa, a leader in the Alliance to Restore the Republic, revealing that the Emperor had been killed. The Smuggler shared the information with Dapp, but the gangster was subsequently executed by Imperial Purge Troopers who sought to quash news of the Empire's defeat. The Purge Troopers learned that Shortpaw had been in contact with Dapp, so the Chadra-Fan and Trade League became the purge's next targets. Shortpaw was forced into hiding, and many of his associates, as well as his grandson Tiquip, were captured and quarantined. When the Smuggler heard of the Chadra-Fan's plight, they returned to Burnin Konn and liberated those captured."}, {"tag": "p", "text": "Later, many of the Smuggler's allies were captured by the Purge Troopers and locked in the Crypt, a high-security prison. The Smuggler planned a rescue, and their sister, Riley, contacted Shortpaw for help. The Chadra-Fan offered the Trade League starships to ferry the escapees off-world, and with the Smuggler, they freed hundreds of prisoners. After the mission, Shortpaw met with the Smuggler's and their allies on the planet Bespin to discuss a forming a revolution against the Empire. Shortpaw and the Smuggler's other allies agreed to the proposal, and they formally created the Uprising to oppose Adelhard and his blockade."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Meeting the Smuggler"}, {"tag": "p", "text": "Shortpaw was a Chadra-Fan male who worked as the trademaster of the Trade Spine League, an part-union, part-privateer organization which consisted of smugglers and mercenaries. The Trade League's operations made Shortpaw wealthy, and at some point he started a family and had a grandson, Tiquip. For many years, Shortpaw operated out of the mining planet Burnin Konn in the Anoat sector, where he played the unassuming role of a junk dealer in Longstar Marketplace. During those years, the Chadra-Fan noticed two young humans, Riley and her sibling, noting that Riley was dangerous, while her younger sibling was not."}, {"tag": "p", "text": "Shortly after the Battle of Endor, which was fought between the Galactic Empire and the Alliance to Restore the Republic, Imperial Governor Ubrik Adelhard of the Anoat sector formed the Iron Blockade to prevent news of the Empire's loss and the death of Galactic Emperor Sheev Palpatine. During the time of the blockade, the services of Shortpaw's smuggling ventures were in high demand, but the blockade halted all starships from leaving the sector. As a result, at least three of Shortpaw's freighters, the Mother of Pearl, the Cruel Mistress, and the Space Manta, were shot down when they attempted to leave the sector."}, {"tag": "p", "text": "Approximately two months after the formation of the Iron Blockade, Longstar Marketplace was subjected to an Imperial contraband sweep. When Shortpaw protested the search to an Imperial Security Officer, the human told him that the Empire did not care about the Chadra-Fan's \"garbage,\" and that they were looking for a shipment of illegal synthetic kyber crystals. Riley's younger sibling was also in the market during the search, and, unknown to anyone else, they were the one smuggling the crystals. The Imperial officer ordered the smuggler to stand next to Shortpaw during the sweep, referring to the Chadra-Fan as a \"thing.\" However, the Smuggler stunned the officer with a rat-stunner, prompting Shortpaw to question their rational. The human replied that they were \"making a bad choice worse,\" and the criminal then fled down a nearby mine shaft. The incident drew Imperial attention away from the marketplace, and Shortpaw's store was left alone."}, {"tag": "p", "text": "Soon after, one of Shortpaw's associates, the gangster \"Happy\" Dapp, introduced the Smuggler and Riley to the Trade League, and Dapp sent the young Smuggler to Shortpaw's shop. Meeting with the Smuggler, Shortpaw revealed himself as the Trade League's mastermind, also introducing Trade League advisor Leeka Pali, bodyguard Ndaya, and smuggler Onn Iria."}, {"tag": "h3", "text": "Breaching the Iron Blockade"}, {"tag": "p", "text": "Addressing the Smuggler, Pali explained that the blockade had halted shipments outside of the sector, and Shortpaw informed the individual that a starship with special cargo would soon arrive in the sector by the Mataou system, the location of the abandoned Hutt jewel world Mataou and a potential weak point in the blockade. Shortpaw then explained that it was the Smuggler's job to probe the Imperial sensor network, and Pali elaborated that the Smuggler was to travel to Mataou, fend off any security droids, and locate Hutt equipment to complete the task. When the Smuggler asked how they would get to Mataou, Shortpaw informed them that a hazmat scow would be arranged for the trip, and the Smuggler accepted the job."}, {"tag": "p", "text": "The Smuggler traveled to Mataou, and they reactivated ancient scanning systems from the Gnuda Kajidic ancestral estate. However, the collected data was insufficient, so the Smuggler returned to Burnin Konn. Once the Smuggler landed in Longstar Marketplace, Shortpaw commended the recruits actions, asking if they travel off world often. The Smuggler replied that they had when younger, joking that Mataou was the nicest place they had visited. Shortpaw then responded that the Smuggler would see wonders if they stayed with the Trade League. As Shortpaw finished, Pali noted that a new scanning station had been located, so the Smuggler prepared to return to the Hutt world."}, {"tag": "p", "text": "Later, the Smuggler reactivated the second scanner and returned to Longstar Marketplace. Once Pali reviewed the updated map of the sensor network, she located possible gaps for the scheduled ship. Curious, the Smuggler asked Shortpaw what the ship was smuggling into the sector, and the Chadra-Fan simply replied that the cargo was worth the effort, adding that more scans were still needed. After the Smuggler activated the third scanner, Shortpaw excitedly informed them that only one more scan was needed. The Smuggler soon completed the task, and to Shortpaw's delight, the Trade League found a vulnerable point. However, Pali recommended that a distraction was also necessary, and Shortpaw suggested that attacking the Imperial garrison in the palace of Yantuh the Hutt would draw Imperial attention."}, {"tag": "p", "text": "Decided on the plan, the Smuggler and Dapp created a diversion, engaging the Imperial forces on Mataou. Meanwhile, Shortpaw's valued ship entered the Mataou system unnoticed, marking the first shipment the Trade League had received in weeks. When Dapp and the Smuggler returned to Burnin Konn following their success, Shortpaw confessed that he had been watching the Smuggler and Riley for years, admitting that he underestimated the Smuggler's potential. The Smuggler asked if the ship and cargo had arrived intact, and Shortpaw affirmed that they had. Shortpaw added that the Smuggler would receive a portion of the profits, before being interjected by the young human, who asked what the profits were from. However, Pali scolded the Smuggler, saying that it was not their business to know. The Smuggler then asked if more ships would be sent through the blockade, and Shortpaw replied that they intended to try. Remarking that there was no need to rush operations, Shortpaw dismissed the Smuggler, telling the human that Dapp would contact them when their services were again needed."}, {"tag": "h3", "text": "Salvage from Hoth"}, {"tag": "p", "text": "Sometime later, Shortpaw was contacted by Dapp to discuss a \"score of a lifetime.\" To provide advice, Shortpaw was accompanied by Iria, and the two met Dapp in Longstar Marketplace. Dapp explained that he planned to steal contraband from the Empire's four intercept facilities within the sector. To conduct the heist, Dapp intended to scavenge a Lambda-class T-4a shuttle from the wreckage left by the Battle of Hoth, a battle fought between the Empire and Rebel Alliance on the ice planet Hoth The shuttle would be used to land at one of the facilities; once there, the shuttle would be filled with contraband, and then a sensor jammer a nearby planet would be activated, creating an escape route. The process would be repeated on all four locations, guaranteeing a large payout. As Dapp finished detailing the plan, the Smuggler, who was also contacted by Dapp, arrived. Dapp asked Shortpaw if he wanted to be a part of the plan, and against Iria's opinion, he accepted, volunteering the Trade League's assistance in return for a modest cut of the profits and no connection to the crime if problems occurred. Dapp assured Shortpaw that everything would work out fine, and the Chadra-Fan then informed the Smuggler of their role in the plan's groundwork."}, {"tag": "p", "text": "Shortpaw affirmed that the Smuggler had heard of Hoth, and the Chadra-Fan then elaborated, saying that the Battle of Hoth left wreckage scattered across the battleground. Continuing, Shortpaw explained that Dapp's plan required scavenging wreckage to reassemble an Imperial shuttle, although the thought of the cold made his fur bristle. Iria, who had made the run before, offered additional advice to the Smuggler, which Shortpaw suggested they listen to. When the Smuggler asked what Shortpaw would be doing during the runs, the Chadra-Fan simply replied that he would be preparing, also warning the Smuggler that any error would result in all of their deaths. Once the Smuggler departed, Shortpaw filled in Riley on the plan, instructing her to inform her sibling to begin by surveying the wreckage."}, {"tag": "p", "text": "While on Hoth, the Smuggler took a datapad from a scavenger camp, believing that the locals would have thorough maps of the area. However, the maps were incomplete, and Shortpaw expressed his disappointment when the Smuggler returned. Iria deduced that the scavengers' maps were pieced together from Imperial transmissions, so the Smuggler suggested stealing data directly from the source. Dapp agreed, noting that Imperial survey teams and Viper probe droids still prowled the battleground. Decided, the Smuggler again left for Hoth."}, {"tag": "p", "text": "Once the Smuggler returned from the second trip, Iria discovered that the survey info was stored inside an astromech droid, so the Smuggler then completed another run for the droid. The Smuggler brought the droid, B9-DT, to Longstar Marketplace, where Shortpaw admired it, expressed that it could sell in his shop for a good price. B9-DT exclaimed that it was not for sale, and Shortpaw apologized to his new friend, recalling that it contained information they needed. Dapp sent the Smuggler back to Hoth, and when the Smuggler returned, the young human brought a sizable collection of parts back to Shortpaw. However, the Chadra-Fan informed the Smuggler that more parts were still necessary, and that another trip was needed for an Imperial codebreaker, a trivalve assembly, and a vortex stabilizer."}, {"tag": "p", "text": "The Smuggler managed to acquire all the parts except the codebreaker, improving the moods of both Shortpaw and Dapp. However, B9-DT discovered that the codebreaker was being sold in an auction on Hoth by Bohento Splinth, the leader of the Wreckers scavenging group and a former associate of Dapp's. Upon hearing Splinth's name, Shortpaw was surprised, and when the Smuggler asked who Splinth was, Dapp merely hinted at their history. The Smuggler returned to Hoth, where they were forced to kill Splinth for the codebreaker. When the human returned, they asked if the shuttle could begin repairs. However, Shortpaw replied that they could, but with added difficulty, as Imperial survey teams were approaching the ship. Telling Dapp to prepare to continue, the Smuggler volunteered to slow down the Imperials."}, {"tag": "p", "text": "The Imperial forces near the shuttle were defeated by the Smuggler, and Shortpaw confessed that despite his doubts in Dapp's team, they had done well. Once Dapp and B9-DT were ready to depart for Hoth and make the repairs, they and the Smuggler left. The three managed to fend off attacking Imperials and scavengers, and the shuttle's flight capability was restored with a safety rating of two percent. Back on Burnin Konn, Shortpaw greeted Dapp and his team. Dapp praised the Smuggler's actions to Shortpaw, and the Chadra-Fan acknowledged that the young human showed more courage and loyalty than most people their age. Dapp told Shortpaw not to embarrass them, and Shortpaw explained that he was simply making a point before departing. Despite Dapp's project making progress, Imperial bodies were amassing, and the Chadra-Fan desired to remove himself from the risk of detection. When the Smuggler asked Shortpaw if they would see each other again, he replied that he hoped so, and that the human had earned a place within the Trade League (as long as debts were paid)."}, {"tag": "h3", "text": "The Purge Troopers"}, {"tag": "p", "text": "Weeks later, Dapp and the Smuggler followed through with the heist, and the young human raided the intercept facilities. At the fourth facility, the Smuggler found not goods, but a holovid of Leia Organa, a leader in the Rebel Alliance. To the Smuggler's surprise, the recording revealed that the Rebellion had won the Battle of Endor, and the Emperor had been killed aboard the DS-2 Death Star II Mobile Battle Station. The Smuggler transmitted a copy to Riley and Dapp, who were at Carbon Score Cantina on Burnin Konn, and the human went to reunite with them. However, when the Smuggler returned to the cantina they found it had been torched by Imperial Purge Troopers, and Dapp had been killed. Riley, who survived the attack, told her sibling that the Purge Troopers operated under Commander Bragh, and that they had a deadly protocol: anyone who learned of the Emperor's death, as well as everyone they knew, would be targeted, quarantined, and executed. Appalled by Bragh's actions, Riley and her sibling set out to create an uprising against the Empire, negotiating with the Ivax Syndicate, Noble Court, and the Kouhun."}, {"tag": "p", "text": "During this time, Bragh's forces discovered that Shortpaw had been in contact with Dapp, and the Trade Spine League became the purge's next target. At least four purge teams began searching for associates of Shortpaw on Burnin Konn in Drifter's Gorge, and they burned buildings, cornered starships, and quarantined individuals linked to the Chadra-Fan. Shortpaw's bodyguard Ndaya, smuggler Iria, and grandson Tiquip,—as well as a Zabrak family familiar with Shortpaw's shop—were among those captured in Drifter's Gorge and marked for execution. When the Smuggler learned of the Trade League's involvement, they felt responsible and sought to help. The human successfully rescued Ndaya, the Zabraks, and Iria, but Bragh noticed the pattern, and the Imperial set an ambush at the cell which held Tiquip. When the Smuggler arrived, the trap was sprung, but the human managed to defeat the team of Purge Troopers."}, {"tag": "p", "text": "Shortpaw, having learned of the Smuggler's plan, promptly contacted the human, asking if his grandson was alright. The Smuggler affirmed that Tiquip was safe, noting that Shortpaw had heard the news about their recent actions. Shortpaw replied, saying that he had heard a lot of news and remarking that the human had been busy. The Chadra-Fan then apologized for being unable to protect the human, Riley, and Dapp, expressing that the Empire's actions made his bones ache. The Smuggler returned the apology, saying that they had caused the trouble and that everything evened out. Shortpaw revealed that he had heard of the Smuggler's new alliance against the Empire, and the Chadra-Fan added that he did not have much to offer, but he could provide a few small ships if they were needed. The Chadra-Fan then told the Smuggler that they remained a good friend, and the human replied by telling Shortpaw to stay safe. Telling the human to keep in contact with him, Shortpaw suggested sending B9-DT to visit on occasion."}, {"tag": "h3", "text": "Rescue from the Crypt"}, {"tag": "p", "text": "Soon after, the Smuggler and their informal revolution staged an attempted kidnapping of Bragh, but the plan failed, and numerous individuals, including Her Majesty of the Noble Court and the assassin Loathe of the Kouhun, were taken prisoner. The Smuggler discovered that they were being held in the Crypt, a high-security prison on a moon of Pujool, a planet in the Anoat system, and the human infiltrated the compound to rescue them. To ferry the escapees off-world, Riley contacted Shortpaw, and the Chadra-Fan happily agreed to help. Once the Smuggler freed the first set of prisoners, Shortpaw personally contacted the human, commenting that they were in an \"awful mess\" and revealing that the Trade League would be assisting. The Smuggler asked if Riley had called him in, and the Chadra-Fan replied that he was hurt that he had not been contacted sooner. Shortpaw reminded the human that they must remember where they come from, and the Smuggler replied by saying that they owed the Chadra-Fan."}, {"tag": "p", "text": "The Smuggler liberated the prisoners of delta compound, gamma compound, and omega compound, rescuing hundreds of prisoners for the Trade League to ferry and killing Commander Bragh. Once the rescues were completed, the Smuggler had Riley contacted Shortpaw and other allies such as Her Majesty, Deathstick of the Kouhun, Voras of the Ivax Syndicate, and Tam Bastion of the Rebel Alliance, asking the five representatives to meet in the Paradise Atrium of Cloud City on the planet Bespin. When the groups arrived, they began to bicker, and the Smuggler took control, reminding them that the enemy was the Empire, and that the only way to stop them was by cooperating, as they had done in liberating the Crypt. Shortpaw, questioning the Smuggler's commitment, asked them if they wanted to lead a formal revolution. The human replied that they did, asking the Chadra-Fan if he would join. Noting that profits were down and that the Trade League favored freedom, Shortpaw accepted, followed by Bastion, Her Majesty, Voras, and Deathstick."}, {"tag": "h3", "text": "Liaison of the Uprising"}, {"tag": "p", "text": "After the Battle of Endor, an Imperial-class Star Destroyer suffered a technical failure when it exited hyperspace above Hoth, leaving it vulnerable. Members of the Trade League sent the news to Shortpaw, who contacted the Smuggler, requesting them to clear the ship for a team of technicians and logistics specialists. The Smuggler accepted the proposition and joined the Trade League in battle aboard the Star Destroyer, successfully completing the mission."}, {"tag": "p", "text": "Sometime after the battle above Hoth, Imperial forces on Mataou noticed that the insurgents were establishing a presence on the planet, and they began fighting to reclaim control. To assist in the fight, Shortpaw notified the Smuggler, forming a plan to board the Imperial Star Destroyer in the planet's orbit. Once aboard, the Smuggler would lead members of the Trade League, and deliver a \"special present.\" The Smuggler agreed, and they boarded the capital ship, executing the plan and liberating Mataou from the Imperial presence."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Publicly known to be a businessman who sold various items at fair prices, Shortpaw, a crafty, male Chadra-Fan, was the trademaster of the Trade Spine League. He managed to keep a low profile, and was on good terms with local gangs as well as the Empire. Shortpaw had a steely personality, although he enjoyed acting as a mischievous, kind, grandfatherly figure to his associates. Despite his sincere desire to provide good and lasting services for locals, Shortpaw ultimately longed for control and profit."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As the leader of the Trade Spine League, Shortpaw oversaw the operations of numerous starships, including Allanar N3 light freighters dubbed the Mother of Pearl, the Cruel Mistress, and the Space Manta. The Chadra-Fan also possessed a number of hazmat scows, as well as a few small ships which were used to ferry the Crypt escapees off of Pujool's moon."}, {"tag": "p", "text": "Desiring to maintain a low profile, Shortpaw wore simple, utilitarian clothes: brown boots, green pants and shirt, and a tan vest. The Chadra-Fan also had a cybernetic left hand, which he regarded as a \"paw.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shortpaw was created by design artist Brian Matyas for Star Wars: Uprising, a canon mobile game developed by Kabam, Disney Interactive, and Lucasfilm for iOS and Android platforms. During the development of Star Wars: Uprising, Shortpaw was simply named \"Mouse,\" until Matyas gave the character a cybernetic hand, dubbing the character \"Shortpaw.\" Once Matyas finalized the character design, he made two illustrations of Shortpaw for in-game loading screens, and the character was modeled and textured by Jay Doherty."}, {"tag": "p", "text": "In the game, which was released on September 10, 2015, Shortpaw is a non-playable character introduced in the first level, later serving as a supporting character in the game's Story Missions, in which he to assigns missions to players. Star Wars: Uprising also includes a feature called Special Offers, which allows players to purchase select items from Shortpaw upon startup. For the Special Offers page, Shortpaw was illustrated by Johannes Holm."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}