{"url": "Showdown_on_unidentified_forested_planet", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Non-canon Legends articles", "Category:Cleanup", "Category:Articles needing illustration", "Category:Battles"], "nodes": [{"tag": "h1", "text": "Showdown on unidentified forested planet"}, {"tag": "p", "text": "An showdown occurred in 19 BBY on an unidentified forested planet between the Galactic Empire and the Alliance to Restore the Republic in an attempt to recover the carbonite block in which the smuggler Han Solo was frozen, which was being delivered to the Empire by the bounty hunter Boba Fett. The skirmish ended up with the victory for the Rebels and the defeat for the Empire while Fett was supposedly killed during the skirmish."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 4 ABY, during the attempt to rescue the carbonite frozen smuggler Han Solo from the clutches of the crime lord Jabba the Hutt, whose palace was located at Tatooine; Princess Leia Organa, disguised as the deceased bounty hunter Boushh, entered into the palace along the Wookiee Chewbacca with the intention to gain the Hutt's trust. During the meeting, the protocol droid C-3PO helped to translated Jabba's Huttese and \"Boushh\"'s Ubese."}, {"tag": "p", "text": "While Jabba negotiated with Leia about the reward for the Wookiee, Jabba became angry for the amount of money that Leia ordered and knocked down C-3PO, causing his head to came off, leaving Jabba and \"Boushh\" with no means to communicate. With no translatorand forced to reveal herself to Jabba's criminal court, Leia threatened the Hutt to blown him up with a thermal detonator if he didn't agreed to release Solo, but when the bounty hunter Boba Fett started to draw his weapon, the disguised Lando Calrissian knocked him aside, but Fett still blasted his weapon and the blast hit Leia's elbow, prompting her to accidentally activating the detonator."}, {"tag": "p", "text": "As Jabba's court scattered for their lifes, Fett took the opportunity to escape with the frozen Solo with intentions to deliver the frozen smuggler to the Galactic Empire, now that Jabba didn't had any more use for him, departing from Tatooine aboard his ship the Slave I. Shortly afterwards, the palace was blown up, destroying C3-PO and killing several individuals, including Jabba and his majordomo Bib Fortuna, but Leia, Chewie and Lando managed to escape."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Leia and her Rebel friends, minus her brother the Jedi Knight Luke Skywalker, who went to Dagobah for rendezvous with the Jedi Master Yoda, had already arrived the unidentified forested planet where Fett was intending to deliver Solo to an Imperial officer and his stormtroopers to use him as a bait to attract his Rebel friends and finish off with them once and for all. Upon not seeing Han, Leia concluded that Solo must be locked aboard the Slave I. Just as the Imperial officer was heading to his ship, Leia shoot near his men, prompting them to grab their weapons and located the sniper. As Fett said to Leia how she thought that she was going to take them down if she came alone to the planet, leading Leia to reveal that she wasn't alone, with the presence of the Millennium Falcon commanded by Calrissian backing up her statement."}, {"tag": "p", "text": "Immediately, as Fett used his jetpack to get into the top of the Falcon to place a bomb on it, the Falcon blew up the ships of the Imperials, also killing them in the process. When Organa saw Fett at the Falcon's top, she warned Lando and Chewie after failing to shoot him down, leading the former to shake off the Falcon, causing Fett to fell along his bomb, which detonated near him, sending him aside to the landing platform, though Leia acknowledged that maybe he had faked his death to draw them in. Lando then stated that if he was faking his death it was the best acting job he had ever seen."}, {"tag": "p", "text": "Following Fett's apparent defeat, Leia went to the Slave I and departed from the planet aboard the Slave, while Lando and Chewie followed her with the Millennium Falcon to the Home One in order to have Han unfrozen once and for all."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "During the showdown, Solo's carbonite block was damaged either by the Imperials or accidentally the Rebels. Once aboard the Home One, the doctor who thawed Han from his carbonite block warned Leia that the long time of hibernation and the damage to the controls of the carbonite unit would have likely took its toll by rendering Han blinded for the rest of his life, though he stated there was still a little hope that he could regain his eyesight, though minimal. Afterwards, the Rebels, leaded by Mon Mothma and Admiral Gial Ackbar, prepared to face what could be possibly their greatest challenge: the Battle of Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}