{"url": "Showdown_on_Stend_IV", "categories": ["Category:Legends articles", "Category:Battles"], "nodes": [{"tag": "h1", "text": "Showdown on Stend IV"}, {"tag": "p", "text": "The Showdown on Stend IV was battle on the planet Stend IV between agents of the Army of Life and opposing forces including the Jedi Dree-Tekes, local Gran militiamen, and a government-recruited group of individuals."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "As of 31 BBY, the Army of Life operated on the planet Naboo, a planet which had some dangerous fauna on the wild. After the peace alliance between Naboo Humans and Gungans in 32 BBY, the Army of Life decided that they had a chance to cause chaos and at the same time follow their own goals."}, {"tag": "p", "text": "The Army noticed a local creature, clodhoppers. They reproduced quickly, having hundreds of children in a matter of days, and eating without any control. Clodhoppers could easily exist on Naboo because they had natural predators, and they were also hunted by the Gungans. However, exportation was strictly forbidden, under the maximum punishment, because it could cause, and caused centuries ago, the utter devastation of entire colonies."}, {"tag": "p", "text": "The Army of Life's goal was to transport two hundred eggs of clodhopper in sealed boxes, to the world of Stend IV. When reaching Stend IV, its atmosphere would trigger the seals of the boxes, and then the eggs would automatically incubate."}, {"tag": "p", "text": "The Army decided to hire an independent team for the transport, although the capture of eggs would be done by Army agents. Another Army member, Del Binjitt, hired a team on Keren city, and provided them with a ship, the Majestic Gundark. However, Binjitt did not know what was the cargo, except that it was \"bio-material\"."}, {"tag": "p", "text": "Binjitt met a Kubaz informer in the area, Talbrek, who concerted a meeting between Binjitt and some \"indies\" at Frundle's Cantina. Binjitt gave them all the details they needed, including the ship's codes and coordinates, and told them that the second part of the payment would be provided at Ryloth. None of them noticed that the bartender droid was listening and informed local authorities."}, {"tag": "p", "text": "Port security agents ambushed the indies at the Gundark but, unknown to all, the commanding officer of the attack was associated with the Army of Life and planned to let them go should they be captured. However, they would still had to deal with N-1 fighters under Lieutenant Davonn. The Gundark jumped to hyperspace towards Stend IV, escaping from Davonn. But Davonn could track its hyperspace vector and reported it to his superiors."}, {"tag": "p", "text": "Suspecting the importance of the operations, the reports of the activities reached the Jedi Temple on Coruscant. The Jedi Order sent a Padawan to Stend IV. Dree-Tekes, the Padawan reached Stend IV before the Gundark did, and prepared four local Grans with blaster carbines, heavy blaster cannons and a grenade launcher, to wait for the team."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}