{"url": "Shoto_Eyefire", "categories": ["Category:Legends articles", "Category:Crime lords", "Category:Defel", "Category:Duelists", "Category:Males"], "nodes": [{"tag": "h1", "text": "Shoto Eyefire"}, {"tag": "p", "text": "Shoto Eyefire was a male Defel. He made his living as a professional blastfighter and criminal with a local reputation. He made his home near Horn Station."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Shoto Eyefire was a powerful local criminal who ruled Horn Station with an iron fist. He was a professional blastfighter and maintained his authority by dueling against any who were foolish or brave enough to stand up and challenge him. Sometimes, Eyefire chose his opponents against their will, merely because they had shown themselves to be adept with a blaster. Despite his tremendous speed and accuracy as a gunsligner, Eyefire was also a notorious cheat known for his misconduct against other duelists. Challengers were commonly forced to use a malfunctioning blaster, while Eyefire wore blast armor in the duel arena and often brought armed henchmen aboard repulsor platforms as an insurance."}, {"tag": "h3", "text": "Duel with a Jedi"}, {"tag": "p", "text": "When an unknown Jedi was forced to make repairs on his hauler and land at Horn Station, Eyefire's luck changed. Disguised as a stuttering, mild-mannered miner, the Jedi entered a local cantina where he was attacked by a thug named Kerlo, who was in Eyefire's employ. As he was assaulted, the Jedi defended himself with a subtle Force Push, not wanting to reveal his identity. Kerlo then challenged the Jedi to a duel, which resulted in the thug ending up stunned."}, {"tag": "p", "text": "The Jedi was then invited, and later forced, to meet Eyefire in a showdown in his personal arena. Acting nervous, and with a strange looking blaster, the Jedi allowed Eyefire to become overconfident. Within seconds, Eyefire was shot through both legs, and had his blaster shot from his hand, due to the Jedi's quick reflexes. Rushing to Eyefire's aid, his guards tried to kill the Jedi, but the Jedi, who now wielded his lightsaber, easily defeated the guards. The Jedi then revealed that the strange bulbous parts of his blaster were in actuality shaped charges, and used them to destroy Eyefire's arena. Laying wounded, Eyefire noticed that the weapons that Pinky used were non-lethal, and he exclaimed that he hated Jedi."}, {"tag": "p", "text": "Eyefire was later seen on a stretcher being loaded into a vessel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}