{"url": "Shrine_of_Kooroo_(Boztrok)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Boztrok locations", "Category:Shrines of Kooroo"], "nodes": [{"tag": "h1", "text": "Shrine of Kooroo  (Boztrok)"}, {"tag": "p", "text": "A Shrine of Kooroo located on the planet Boztrok was one of a series of similar, ancient stone structures that were believed to have been constructed by an advanced alien species on several worlds throughout known space. The shrine on Boztrok was located on an ocean-surrounded island that was part of an archipelago, and atypically for a Shrine of Kooroo, it was not surrounded by a series of rune-inscribed stone obelisks."}, {"tag": "p", "text": "During the Galactic Civil War, the Boztrok Shrine of Kooroo was part of an estate owned by the Hutt art collector Prebda Thok. Each day, the shrine was visited by pilgrims of the Fellowship of Kooroo, a cult dedicated to the worship of the structures. The pilgrims were accompanied across Thok's estate grounds by an armed escort and meditated inside the shrine. In 2 ABY, the TriNebulon News reporter Andor Javin visited the Boztrok shrine as part of his tour to several of the Shrines of Kooroo. Following his visit to the shrine, Javin transmitted a NewsNet report describing his theories about the construction of the ancient structures."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Shrine of Kooroo was located on the Outer Rim Territories planet Boztrok. The shrine was situated on the largest island in the archipelago that constituted most of Boztrok spaceport."}, {"tag": "p", "text": "Like most of the other Shrines of Kooroo located on several worlds throughout known space, the ancient ruin on Boztrok consisted of a three-level central structure built out of the same type of native stone as the other shrines. The Boztrok shrine featured an inner sanctuary in the form of a central domed chamber. A pedestal was located at the sanctum's center, and a raised low step ran around the room's perimeter. Although the main structure of a Shrine of Kooroo was usually surrounded by a series of stone obelisks inscribed with runes, no such outlying structures had been discovered on the island housing the Boztrok shrine."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Galactic Civil War, the medium-sized island on which the Boztrok Shrine of Kooroo was located formed a part of an exclusive estate owned by the Hutt art collector Prebda Thok. Dedicated members of the Fellowship of Kooroo, a cult worshipping the Shrines of Kooroo, visited the island estate daily as part of a pilgrimage to various sites connected to the organization's supposed spiritual leader, Kooroo. On the grounds of Thok's estate, a large number of soldiers and bodyguards escorted the pilgrims to and from the Shrine of Kooroo. Inside the shrine, the pilgrims sat on the raised step running around the sanctum's perimeter and meditated."}, {"tag": "p", "text": "In 2 ABY, the sensationalist investigative reporter Andor Javin visited the Boztrok shrine at the conclusion of a tour to several of the worlds housing Shrines of Kooroo. The NewsNet reporter's visit to Thok's estate was hosted by the collector, and Javin came to believe that the stone obelisks which should have formed a part of the shrine were submerged beneath the ocean that surrounded the island."}, {"tag": "p", "text": "Following his visit to the shrine, on the date 38:1:15 Javin transmitted a TriNebulon News report from Thokisl, Boztrok. In the report, Javin briefly described his visit to the Boztrok shrine. In addition, Javin claimed that the supposedly primitive Shrines of Kooroo were constructed by an advanced alien species, which used the structures for interstellar communication based on either technological comm devices or telepathy. By 11 ABY, general consensus among scholars agreed that the Shrines of Kooroo were built by an ancient alien species, although the purpose of the structures was still unclear by that time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Boztrok Shrine of Kooroo was mentioned in the \"Galaxywide NewsNets\" feature of West End Games' Star Wars Adventure Journal 13, which was published in May 1997. The feature was authored by Peter Schweighofer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}