{"url": "Shroud_SF-4", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles that are known by a nickname", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Members of the Shroud's organization"], "nodes": [{"tag": "h1", "text": "Shroud SF-4"}, {"tag": "p", "text": "Shroud SF-4 was a member of the intelligence network that served the independent operative known as the Shroud during the Galactic War between the Galactic Republic and the Sith Empire. SF-4 was sent to Kuat to observe Imperial asset K-33."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Shroud SF-4 was a member of the intelligence network that served the independent operative known as the Shroud during the Galactic War between the Galactic Republic and the Sith Empire. Shroud SF-4 was stationed at Kuat to observe Imperial Asset K-33, an Imperial agent undercover in the Kuat Drive Yards. K-33 married into the Kuat family, giving him more political power. K-33 took up residence in the Kuat Drive Yards Governor Quarters. K-33 took control of the Kuat Drive Yards security oversight. SF-4 took the guise of a shipyard administrator concerned with lax security so that he can learn about the security of the Drive Yards. K-33 promised to take SF-4 through the security measures as an act of reassurance. SF-4 made an analysis that several newly made capital ships could be liberated for the network. SF-4 intercepted a transmission from K-33 to Admiral Ranken, in which K-33 suggested a single defensive station was key to subverting all Kuat Drive Yards security protocols. K-33 found SF-4 out, and stabbed SF-4 in the back with a vibroknife, although SF-4 managed to transmit the logs to the Shroud before he died. The Shroud sold the information provided by SF-4 through numerous intermediaries for the Republic Strategic Information Service to obtain, prompting the Republic to start mounting a force to counter the Sith Empire's invasion. The Shroud sent Asset SF-5 to dispose of SF-4's body and belongings, and to observe the outcome of the Battle for Kuat."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}