{"url": "Shu_Mai", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Pages needing citation", "Category:Business owners and executives", "Category:Commerce Guild", "Category:Females", "Category:Gossam", "Category:Separatist leadership"], "nodes": [{"tag": "h1", "text": "Shu Mai"}, {"tag": "p", "text": "Shu Mai was a female Gossam who served as Presidente of the Commerce Guild during the final years of the Galactic Republic. During the Separatist Crisis, she attended a meeting with Count Dooku and the heads of other noted corporate holdings on Geonosis to discuss joining the Confederacy of Independent Systems. Though Mai showed misgivings about the situation, stating that the proposal could be viewed as treason, she was the only one to do so and ultimately pledged the forces of the Commerce Guild to the Separatist cause and gained a seat on the Separatist Council as a result. She and the entire Council were slaughtered by Darth Vader on Mustafar when he visited the planet following the end of the Clone Wars."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a member of the Separatist Council, Shu Mai was obsessed with status and power. She opted to join the Confederacy after being convinced by Dooku on Geonosis, despite her initial doubts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shu Mai first appeared in Star Wars canon in the 2002 film Star Wars: Episode II Attack of the Clones. Before that, Mai appeared in the Star Wars Legends 2002 novel The Approaching Storm, primarily by Alan Dean Foster. She was realized as a computer generated character[source?] for Attack of the Clones and Star Wars: Episode III Revenge of the Sith."}, {"tag": "p", "text": "In a deleted scene of Attack of the Clones, Mai is present when Poggle the Lesser sentences Anakin Skywalker and Padmé Amidala to death.[source?]"}, {"tag": "p", "text": "In the illustrated screenplay of Revenge of the Sith, Mai lasts longer than in the final cut. Rather than getting killed almost immediately, she runs to the conference room along with Wat Tambor only to be cut down by Vader after Tambor's death."}, {"tag": "p", "text": "Shu Mai is also the name of a popular Chinese dumpling."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}