{"url": "Shug_Ninx", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Males", "Category:Mechanics", "Category:Nar Shaddaa residents", "Category:Near-Human Hybrids", "Category:Pilots", "Category:Theelins"], "nodes": [{"tag": "h1", "text": "Shug Ninx"}, {"tag": "p", "text": "Shug Ninx was a Near-Human male from Corellia. On Nar Shaddaa, Ninx owned and operated his famous Spacebarn, an enormous facility where smugglers could repair and modify their ships. The only access to the Spacebarn was through a cleverly-disguised tunnel called The Chute."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ninx started out working for mechanic Bammy Decree, and it is likely that he learnt the trade from the human. When helping Decree rebuild the Stellar Envoy, Ninx sought out the fence Masel, who supplied him with a new Droid brain. Unknown to Ninx, this was a ploy by Masel which resulted in the brain activating a cargo of buzz droids, which caused the explosion of an Acclamator-class assault ship. Ninx would later do more work on the Envoy, years later when it was known as the Millennium Falcon.\nNinx himself was a master mechanic, and probably could have found work in the Galactic Empire had he not been a \"half-breed\", meaning he was the son of a Human and a nonhuman: although his father was a Corellian, his mother was one of the last Theelin. This resulted in his mostly Human appearance except for blue and green mottling on his skin, and one thumb and two fingers on each of his hands. Given the prejudices of the Galactic Empire, he was fortunate to find work on Nar Shaddaa."}, {"tag": "p", "text": "The Spacebarn was located near the Corellian Sector. He made fast friends with many smugglers, including Han Solo, Chewbacca, Salla Zend, Roa, and Mako Spince among many others. For a time, he worked alongside a Tintinna named Kit. Ninx's only rules in the Spacebarn were:"}, {"tag": "p", "text": "Given Ninx's amiable personality and skill as a mechanic, he was quite popular. He was very involved with the defensive planning prior to the Battle of Nar Shaddaa, and helped many smugglers outfit their ships with additional weaponry and shields. After the battle when Han Solo left, Ninx was one of the few who did not have a grudge against Solo."}, {"tag": "p", "text": "When Emperor Palpatine returned in a clone body, Han and Leia Organa Solo returned to Nar Shaddaa and met Ninx, who helped repair the Millennium Falcon in the Spacebarn. Violence erupted in the Spacebarn with the arrival of Boba Fett, and Solo collaterally destroyed one of Ninx's prized ships during his escape. When Solo left Nar Shaddaa this time, Ninx did indeed have a sour taste in his mouth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}