{"url": "Shwuy_sector", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with elements from unlicensed sources", "Category:Colonies sectors", "Category:Galactic Empire sectors", "Category:Northern Dependencies sectors", "Category:Shwuy sector"], "nodes": [{"tag": "h1", "text": "Shwuy sector"}, {"tag": "p", "text": "The Shwuy sector was located in the Colonies and contained the Uviuy Exen system. The planet Uviuy Exen was situated at the intersection of the hyperlanes known as the Hydian Way and the Shwuy Exchange."}, {"tag": "p", "text": "Uviuy Exen was already a part of the Galactic Republic by 22,000 BBY and was a member of the Galactic Empire by 17 BBY. By the time of the Battle of Yavin, more than half of all the line squads of the Imperial Army in the Shwuy sector had been armed with light repeating blasters. During the later struggle between the Empire and the New Republic, Uviuy Exen was the site of a pair of battles between the two factions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Shwuy sector was located in the Northern Dependencies portion of the Colonies region. It shared its name with the area known as the Shwuy Perimeter and contained the Uviuy Exen system, which in turn was the site of the heavily populated planet of the same name."}, {"tag": "p", "text": "The sector also contained the Shwuy system."}, {"tag": "p", "text": "The Uviuy Exen system lay at the intersection of two hyperlanes. The minor hyperspace route known as the Shwuy Exchange connected the system to the Dankayo system. The Hydian Way super-hyperroute, specifically the portion that had at one point been known as the Corsin Run and had been merged into the modern Hydian Way by 3694 BBY, linked Uviuy Exen to the Eeropha and Wakeelmui systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although space surrounding the Uviuy Exen system became well-explored between 20,000 BBY and 15,000 BBY, the planet Uviuy Exen had already been incorporated into the Galactic Republic by 22,000 BBY. By 17 BBY, Uviuy Exen fell under the control of the Galactic Empire, and, by the time of the Battle of Yavin, more than half of all the line squads of the Imperial Army in the Shwuy sector had been armed with light repeating blasters. The latter fact was noted by Rebel Alliance historian Major Arhul Hextrophon in a compilation of Imperial documents for Alliance Supreme Commander Mon Mothma and other Rebel officers."}, {"tag": "p", "text": "The military of the New Republic defeated the forces of Imperial Warlord Zsinj at Uviuy Exen in 6 ABY as part of a drive to push Imperials up the Hydian Way, and the Shwuy sector world had fallen under New Republic control that same year. However, four years later, Imperial forces advancing from the Inner Rim's Chagri system defeated the New Republic in another battle in the Uviuy Exen system before continuing on to the Brentaal system in the Core Worlds."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Shwuy sector was first mentioned in the 1989 Imperial Sourcebook, written by Greg Gorden and published by West End Games for Star Wars: The Roleplaying Game. When discussing the writing of the 2009 reference book The Essential Atlas in the \"Blaster\" department of the 111th issue of Star Wars Insider magazine, Daniel Wallace, co-author of the book, mentioned that the Shwuy sector was connected to the Core Worlds' Uoti sector, despite no official Star Wars sources providing evidence of such connection."}, {"tag": "p", "text": "\"Twinkle, Twinkle Little Star, How I Wonder Where We Are,\" a 1990 roleplaying game source article published in Voyages SF 13, contained a map of the Shwuy sector, in which the Dalron, Gerrenthum, Qeimet, Sisk, and Vinsoth systems were placed. Since the article was released outside of the Lucas Licensing process, its canonicity within the Star Wars Legends continuity was never confirmed. Ultimately, the StarWars.com Online Companion to The Essential Atlas overrode the Voyages SF 13 placement by establishing that those star systems were located in the Mid Rim's Ariarch sector and the Outer Rim Territories' Anoat, Juris, Calaron, and Quelii sector, respectively."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}