{"url": "Shydopp_pirates", "categories": ["Category:Canon articles", "Category:Pirate organizations"], "nodes": [{"tag": "h1", "text": "Shydopp pirates"}, {"tag": "p", "text": "The Shydopp pirates was a pirate group comprising of aliens armed with spears and thermal detonators and riding skiffs. The pirates operated on the planet Morak during the New Republic's reign and targeted an Imperial remnant's rhydonium shipments. Around 9 ABY the Shydopp pirates destroyed Imperial Combat Assault Transports Juggernaut Three and Juggernaut Four and engaged in combat with Juggernaut Five."}, {"tag": "p", "text": "One of the transport's drivers, the disguised Mandalorian Din Djarin, fended off waves of pirates pursuing Juggernaut Five. Djarin managed to destroy several pirate skiffs, but was outmatched by five additional skiffs of pirates. However, the remaining Shydopp pirates were eliminated by two TIE fighters and some stormtroopers and shoretroopers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Shydopp pirates was a pirate group which included aliens of the same species as the convicted criminal Vorg Alsum. The pirates were armed with wooden, metal bladed spears as well as thermal detonators. The Shydopp pirates wore light clothing and rode on Shydopp Pirate Skiffs which typically carried four passengers and a driver. The skiffs were used to take pirates within jumping range of their targets."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the reign of the New Republic, members of the Shydopp pirates operated on the planet Morak, destroying Imperial Combat Assault Transports delivering rhydonium, an explosive material, to an Imperial remnant's refinery. Around 9 ABY, the pirate group coordinated an attack on some transports making their deliveries. Riding on skiffs, the Shydopp pirates made quick work of Juggernaut Three and Juggernaut Four, detonating both vehicles using thermal detonators. One skiff of pirates pursued Juggernaut Five to deploy pirates onto the transport. However, one of the drivers, the disguised Mandalorian Din Djarin, shot at the pirates, killing one. When another attempted to plant a detonator in Juggernaut Five, Djarin shot the pirate, who fell off with the thermal detonator and exploded the pursuing skiff."}, {"tag": "p", "text": "Two more Shydopp pirate skiffs intercepted Juggernaut Five, the front most deploying four pirates armed with wooden, metal bladed spears. Djarin engaged the pirates, defeating them one by one, but the second skiff caught up with the transport, backed by another arriving one, and brought four additional Shydopp pirates. The disguised Mandalorian fought the four pirates in hand to hand combat, but one placed a detonator into a hatch while Djarin defeated the other three. Luckily for Djarin, he was able to grab the detonator in time and throw it at the last pirate's skiff, destroying it as well as the skiff behind, which was caught in the blast."}, {"tag": "p", "text": "Djarin's victory was short lived, as five more Shydopp pirate skiffs arrived to destroy Juggernaut Five, which was approaching the refinery. The pirates aboard the skiffs prepared their detonators, but were thwarted when two TIE fighters intervened, destroying the skiffs in a barrage of laserfire. Shydopp pirates on the ground attempted to chase Juggernaut Five across the bridge to the refinery, but were swiftly gunned down by the refinery's complement of stormtroopers and shoretroopers. The transport was ultimately celebrated as the only one to successfully deliver a rhydonium shipment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Shydopp pirates appeared in \"Chapter 15: The Believer\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Rick Famuyiwa and released on December 11, 2020. The group's name was identified in Disney's media distribution page for the episode."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}