{"url": "Shusugaunt", "categories": ["Category:Legends articles", "Category:Galactic Republic planets", "Category:High-gravity planets", "Category:Pentastar Alignment planets", "Category:Raioballo sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Shusugaunt"}, {"tag": "p", "text": "Shusugaunt was a high-gravity planet located in the Outer Rim Territories' Raioballo sector. It was the homeworld of the warlike Shusugaunt species. Millennia before the Battle of Yavin, the spacefaring Shusugaunt encountered the sentient Anx of the nearby planet Gravlex Med. The former conquered and enslaved the latter, relocating many Anx to Shusugaunt. The Anx could not survive the planet's high gravity, however, and eventually perished."}, {"tag": "p", "text": "Centuries later, archaeologists of the Galactic Republic discovered the bones of the previously-unknown Anx on Shusugaunt, initially believing them to be the remains of a native species of aquatic creature. Eventually, Shusugaunt became a part of the Republic's Raioballo sector and had sanctions placed against its native Shusugaunt by the Galactic Senate. The Anx Senator Horox Ryyder of the sector subsequently attempted to have the sanctions eased. Between 4 ABY and 12 ABY, Shusugaunt was situated in the territory of the Pentastar Alignment."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Shusugaunt was a terrestrial planet located in the Shusugaunt system, a part of the Raioballo sector in the New Territories portion of the Outer Rim Territories. It was a high-gravity world with seas on its surface, and it lay dozens of light years away from the planet Gravlex Med."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Encountering the Anx"}, {"tag": "p", "text": "Millennia before the Battle of Yavin, Shusugaunt's eponymous sentient species encountered the Anx, a species from the low-gravity planet Gravlex Med that had recently colonized nearby star systems of the region known as Anx Space. The Shusugaunt launched a conquest of the region, driving the Anx back to their homeworld and enslaving them. Many Anx vassals were transported to Shusugaunt, but they could not survive the high gravity of the planet and perished there."}, {"tag": "p", "text": "In addition, the Shusugaunt conquest of the Anx was short-lived due to the inability of the former to adapt to the low-gravity conditions of Gravlex Med. The Shusugaunt soon launched a new series of internecine wars and lost interest in the Anx. The next species-wide jihad the Shusugaunt launched took them into the territory of the Galactic Republic and proved disastrous to the would-be conquerors in the face of the superior Republic military might."}, {"tag": "h3", "text": "Under the Republic"}, {"tag": "p", "text": "Republic archaeologists visited Shusugaunt centuries after the Anx relocated to the planet had gone extinct. There, the researchers discovered numerous skeletons of the species, which the Republic had not encountered before. The remains were thought by xenobiologists to belong to a native species of powerful aquatic creatures that had been hunted to extinction by the Shusugaunt shortly prior. At some point by 3643 BBY, further exploration of the region led to the Republic discovering the Anx on Gravlex Med, disproving the earlier theory on the origins of the bones found on Shusugaunt."}, {"tag": "p", "text": "Shusugaunt became incorporated into the Republic's Raioballo sector over the subsequent thousands of years, being situated on that territory's edge. It was among the thousands of the sector's worlds that were represented in the Republic Senate by the Anx senator Horox Ryyder until his retirement in 22 BBY. Ryyder was level-headed and impartial in representing his constituents and even pressed the Senate to ease the sanctions levied against the Shusugaunt. Over time, the proximity of the planet to Gravlex Med gave rise to one of the galaxy's strangest rivalries due to the contrasting natures of the warlike Shusugaunt and the placid Anx.  Between 4 ABY and 12 ABY, Shusugaunt lay within the territory of the Pentastar Alignment."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Shusugaunt was the homeworld of the Shusugaunt, a species of short, hyperactively warlike sentients that spoke the Shusugaunt language. The Shusugaunt had a spacefaring society that was prone to internecine religious conflicts. Occasionally, the Shusugaunt became united against perceived off-world enemies, and on such occasions, their leaders, known as hierarchs, sent Shusugaunt braves on species-wide jihads against their foes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shusugaunt was first mentioned in \"The University of Sanbra Guide to Intelligent Life: The Anx,\" an article authored by Craig R. Carey, Jason Fry, and Daniel Wallace and published in Star Wars Gamer 7 on October 16, 2001. The 2009 reference book The Essential Atlas placed the Shusugaunt system, and therefore Shusugaunt itself, in grid square L-4."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}