{"url": "Shyriiwook/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with non-canon elements", "Category:Articles needing additional sources", "Category:Wookiee languages"], "nodes": [{"tag": "h1", "text": "Shyriiwook"}, {"tag": "p", "text": "Shyriiwook, also known as Wookieespeak, was the main trade language of the Wookiees. In Basic, Shyriiwook translates to \"tongue of the tree people.\" It was not the only Wookiee language, but, being the main trade language, it was the language understood by most non-Wookiees who understood \"the Wookiee language\"—in fact, most non-Wookiees were unaware of the existence of multiple Wookiee languages."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "To outsiders, this language usually sounded like mere animalistic barks, roars, growls, and moans, conveying little more than emotion. However, Shyriiwook was in fact just as intelligent a language as Basic."}, {"tag": "p", "text": "The unique shape of the Wookiee throat made Shyriiwook a very difficult, even impossible language to speak for most non-Wookiees; presumably the word Shyriiwook itself, as well as other Wookiee words or names, were transliterations of the original Wookiee sounds into a form more easily pronounced by others. No tongue or lip movement was required to speak Shyriiwook; the jaw was typically locked open, with sound emanating from the throat and back of the mouth."}, {"tag": "p", "text": "It was also incredibly difficult, if not impossible, for most Wookiees to learn to speak Basic. As a result, most inter-species communication involving Wookiees had to be carried out in a bilingual format, usually with the Wookiee speaking Shyriiwook and the other party speaking Basic."}, {"tag": "p", "text": "Leia Organa Solo encountered a Wookiee with a speech impediment which conveniently rendered his Shyriiwook pronunciation much easier to understand by Leia, who was learning the language at the time."}, {"tag": "p", "text": "Shyriiwook had over 150 words for \"wood,\" depending on content, grain, moisture and underlying structure. It also had fifteen separate words meaning \"violence.\""}, {"tag": "p", "text": "However, standard Shyriiwook was considered lacking in suitable terminology, and perhaps semantic precision, for many technical subjects. Accordingly, when Wookiees talked about topics such as starship maintenance, the Thykarann dialect was often preferred, with many Wookiees capable of switching between the two with relative ease."}, {"tag": "p", "text": "Another Wookiee language, Xaczik, was indigenous to the Wartaki Islands on Kashyyyk and several outlying coastal regions. While Shyriiwook remained the common language of Wookiee trade and travel, the much rarer Xaczik language became the secret language of the Wookiee underground when Imperial forces took over their planet."}, {"tag": "h2", "text": "Examples"}, {"tag": "h3", "text": "Common phrases"}, {"tag": "h3", "text": "More complex phrases"}, {"tag": "h3", "text": "In dealing with telemarketers"}, {"tag": "h3", "text": "Common words"}, {"tag": "h3", "text": "Counting in Shyriiwook"}, {"tag": "h3", "text": "Words used as name prefixes"}, {"tag": "h3", "text": "Words used as names suffixes"}, {"tag": "h2", "text": "Notable non-native users of Shyriiwook"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}