{"url": "Shylar", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Females", "Category:Humans", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Shylar"}, {"tag": "p", "text": "Shylar was a Human female Jedi Master who served the Jedi Order during the Clone Wars. In 22 BBY, she tried to infiltrate the headquarters of Confederacy of Independent Systems leader and Sith Lord Count Dooku. However, Shylar was captured and subsequently tortured to death by Dooku and his Dark Jedi Kadrian Sey. Her old friend and fellow Jedi Quinlan Vos, with whom she had a romantic relationship earlier in her life, was unable to save her, as he acted as a spy for the Jedi in Dooku's inner circle."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Human female, Shylar lived during the waning years of the Galactic Republic and was trained in the Jedi Order, eventually attaining the rank of a Jedi Master. At some point during her youth, Shylar had a relationship with fellow Jedi Quinlan Vos. However, as the Order forbade romantic attachment of its members, both eventually ended their relationship. In 22 BBY, the Clone Wars broke out between the Republic and the Confederacy of Independent Systems, the latter led by Jedi-turned-Sith Lord Count Dooku."}, {"tag": "p", "text": "Six months after the beginning of the war, Shylar volunteered to infiltrate Dooku's headquarters on the moon Antar 4 as one of the agents of Jedi Master Tholme. However, she was captured and soon became the subject of intensive torture by Dooku and Dark Acolyte Kadrian Sey, who held her in a containment field. Shylar refused to reveal any information about her mission, although Dooku was unimpressed and simply continued interrogating her. During one of these torture sessions, Shylar's old friend Vos—similarly on assignment to infiltrate Dooku's inner circle—returned from a mission for the Count. Shylar was furious upon seeing Vos, cursing him and calling him a traitor to the Order. Vos, unable to help his friend unless he wanted his cover exposed, was forced to let her anguish continue. Shylar was eventually killed during another torture session."}, {"tag": "p", "text": "After eventually withdrawing from the Confederacy in 20 BBY, Vos reported back to Tholme and the Council of Reconciliation, the Jedi Order's body that passed judgment over fallen Jedi. Detailing his interaction with Shylar in Dooku's retreat, he cleared her name of any suspicion of being a possible traitor, as the Order had no information about her status. Vos revealed his relationship with Shylar to the Council and would fight the rest of the war hoping to one day atone for the death of his old friend."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Shylar and Quinlan Vos chose to break off their relationship, as it would have meant leaving the Jedi path. She became upset upon seeing Vos aligned with the Separatist leader Dooku during the Clone Wars, cursing his name and insulting him. She was able to endure enormous torture at the hands of Dooku and remained defiant, vowing to tell the Count nothing. Shylar had brown hair and eyes as well as light skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shylar first appeared in Jedi: Count Dooku (2003), the fourth issue of the Star Wars: Jedi comic series, written by John Ostrander and drawn by Jan Duursema. Shylar again appeared, although only in a flashback, in the Republic 71 comic (2004), also created by Ostrander and Duursema."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}