{"url": "Shyrack/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Creatures of Korriban", "Category:Creatures of unspecified diet", "Category:Flying creatures", "Category:Herd and pack creatures", "Category:Non-sentient species", "Category:Subterranean creatures", "Category:Vertebrates"], "nodes": [{"tag": "h1", "text": "Shyrack"}, {"tag": "p", "text": "Shyracks were large, bat-like avian creatures with razor like teeth native to the caves of Korriban."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "These winged monstrosities were eyeless beasts that hunted in swarms. Shyracks were cave-dwelling terrors that were fiercely territorial and attacked any intruder with aggression as well as frenzy. Whilst typically cave bound, every sixty-three years, the shyracks of Korriban spilled from their cave habitants every day for the entire summer. These periods saw them fill the sky where they blotted out the sun and moon where they rained their bluish droppings onto everything below. Prior to the return of the Sith Empire, biologists from across the galaxy arrived on the planet in order to witness every sixty-third summer where they observed the purpling of the red Korriban terrain."}, {"tag": "p", "text": "While ungainly and slow-moving with no eyes, shyracks were potentially dangerous pests, especially when they converged as a flock on an intruder. They were native to the Shyrack cave of Korriban and were natural rivals to the feared Tuk'ata."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Revan encountered numerous shyracks while exploring the tombs in the Valley of the Dark Lords, where he helped rescue rebellious Sith students who fled the academy into the caves after refusing to kill Dreshdae civilians."}, {"tag": "p", "text": "Meetra Surik discovered the tomb of Ludo Kressh within the very same cave, albeit deeper and farther into the mountain than Revan ventured."}, {"tag": "p", "text": "By the time of the Cold War, they were still a dominant species inside the tombs now developed into various types."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}