{"url": "Siege_of_Calimondretta", "categories": ["Category:Legends articles", "Category:Battles in the Grumani sector", "Category:Battles of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Siege of Calimondretta"}, {"tag": "p", "text": "The Siege of Calimondretta took place on Syned, the capital of the Arkadianate, in 1032 BBY. This battle marked the first time that the Brigadier Jarrow Rusher launched an assault on a fortress from the inside rather than the outside. The siege occurred in response to a plot by the Arkadianate ruler Sith Lord Arkadia Calimondra to assassinate Vilia Calimondra, her grandmother and the matriarch of the Calimondra family, a major Sith dynasty during the Republic Dark Age. Arkadia had conspired to kill her grandmother to avenge the death of her father Chagras several years earlier and to end Vilia's monopoly over the cycle of conflicts known as the Second Change Matrica. Arkadia also planned to exploit the crisis by launching an expansionist campaign against other Sith states in the Grumani sector. However, her plans fell apart due to the refusal of the Jedi Knight Kerra Holt to carry out the assassination."}, {"tag": "p", "text": "Arkadia was then forced to rely on the Bothan spy Narsk Ka'hane who was a secret agent working for Vilia. Vilia also learnt about the plot through unknown means and ordered Ka'hane to sabotage Arkadia's scheme. Narsk came up with a spur of the moment plan which involved hiring the services of the mercenary Rusher and the Jedi Kerra Holt. In return for being given hyperspace coordinates leading to the Galactic Republic, the two agreed to collaborate with Narsk against a common Sith enemy. Rusher and his crew from the Diligence hijacked an icecrawler which had been scheduled to bring the student refugees aboard his ship to Calimondretta, the main city on Syned where they would then be integrated into the Arkadianate. Meanwhile, Narsk broke Kerra out of prison and the Jedi Knight helped distract Arkadia's forces."}, {"tag": "p", "text": "Rusher meanwhile succeeded in breaching Calimondretta by using the hijacked icecrawler and launching an attack from within the fortress's walls, a feat which he had never accomplished before. Rusher and Kerra's actions caused substantial interior damage to the city. Meanwhile, the Diligence destroyed the planet's tractor beam emitters and Arkadia's parked military fleet by discarding its massive cargo extension pods, which created a series of explosions which caused further damage to Arkadia's assets. Narsk took advantage of the chaos to escape Syned with the catatonic Sith Lord Quillan, the younger brother of Arkadia and the grandson of Vilia, on a modified shuttle. He also sabotaged Arkadia's assassination plot by destroying the hover chair which was to be used as part of the assassination. It contained the nerve toxin Chagras's Blood, which had been harvested by the Sith Lord from Synedian algae."}, {"tag": "p", "text": "Following a lightsaber duel between Kerra and Arkadia, Rusher rescued Kerra and escape offworld aboard the Diligence. The refugees aboard the Diligence were also joined by 500 defecting Arkadianate citizens who wanted to escape to the Republic. The Siege of Calimondretta dealt a death blow to Arkadia's ambitions of killing her grandmother and launching an irredentist military campaign. The destruction of substantial military assets also forced Arkadia to withdraw substantial forces from the newly-acquired Dyarchy world of Byllura. Ultimately, custody of the late Chagras's younger children Quillan and his twin sister Dromika fell into the hands of their grandmother Vilia, who took steps to keep the twins separated and protected from opportunists like their elder sister Arkadia."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Guests of Arkadia"}, {"tag": "p", "text": "Following the Battle of Byllura, Arkadianate forces annexed the former Dyarchy. Jarrow Rusher, the Brigadier who led the mercenary group Rusher's Brigade, and the Jedi Knight Kerra Holt followed the Arkadianate fleet back to their capital world Syned, followed by the 560-strong crew and 1,700 student refugees aboard the troopship Diligence. The female Sith Lord Arkadia Calimondra had granted them safe passage to her territory, promising to provide a safe place to shelter the refugees. During the events on Byllura, Kerra had captured the adolescent Sith Lord Quillan, the younger brother of Arkadia Calimondra, who was the titular ruler of the Arkadianate. Upon arriving at Syned, the Diligence docked outside the underground city of Calimondretta, which was protected from the planet's frigid temperatures by magnetic barriers and heat generators powered by Synedian algae."}, {"tag": "p", "text": "Arkadia was initially warm and hospitable to the Brigadier and Jedi Knight. After taking a small delegation from the Diligence on a tour of Calimondretta, Arkadia succeeded in convincing Rusher that Syned was a safe place to drop the student refugees, who had escaped from the Battle of Gazzari. Throughout her tour, Arkadia tried to portray the Arkadianate as an enlightened benign dictatorship in comparison to other Sith states like the Daimanate and Odionate whose repressive rulers exploited their peoples without giving anything in return. The Sullustan student Beadle Lubboon also fell for Arkadia's propaganda after visiting a Promisorium, and even hugged the Sith Lord. The sole voice of caution was the Jedi Kerra who distrusted the Sith Lord and rightfully suspected that Arkadia wanted to exploit them in some way."}, {"tag": "p", "text": "Her suspicions were confirmed when Arkadia invited the Jedi woman to attend a family Bequest at her private museum. There, Kerra discovered that all the Sith Lords in the Grumani sector were related to each and part of large powerful dynasty that was managed by the family matriarch Vilia Calimondra. The internecine fighting occurring in the sector was part of a contest known as the Second Charge Matrica. Vilia had promised to grant all her holdings to the grandchild who accumulated the most territory through conquests. Arkadia also explained that an earlier Charge Matrica had been fought between Vilia's children with the winner being Lord Chagras, her and her twin siblings' father. The death of Chagras from a nerve toxin in 1042 BBY had sparked the second series of conflicts. Vilia covertly abetted these conflicts, pitting her own grandchildren against each other."}, {"tag": "p", "text": "Following the Bequest, Arkadia tried to recruit Kerra as an assassin with the target being Vilia. Arkadia blamed her grandmother for exploiting the Charge Matricas as a means of preventing a successor and alleged that she had a hand in the death of her father. As part of the plan, Kerra would serve as her personal courier to transport Quillan to Vilia, and would then assassinate the matriarch of the Calimondra family. Arkadia tried to reason with the Jedi by claiming that she was unable to carry out the assassination herself since her grandmother had multiple secret retreats and that her bodyguards kept a close watch on familiar presences. As a Jedi Knight, Kerra was regarded as her first choice since Jedi assassins had a reputation of being clean operatives. Finally, she tried to play on Kerra's personal feelings by claiming that Vilia had authorized the invasion of her homeworld of Aquilaris Minor; sensing that the young Jedi woman was a guerrilla operative for her own cause of protecting the common people and fighting for justice against the Sith warlords. However, Kerra unequivocally turned down Arkadia's offer, stating that she was a Jedi and would never work for a Sith."}, {"tag": "p", "text": "In response, Arkadia had Kerra arrested and sent to the Impound, an interrogation center where she planned to test the bioweapon Chagras's Blood on the inmates. Chagras's Blood was a nerve toxin harvested from Synedian alga. Arkadia then demanded that Rusher hand over the refugee students aboard the Diligence immediately. She had prepared an icecrawler with extended interior scaffolding to transport the refugees to Calimondretta. In return, the Sith Lord promised that she would allow Rusher and his mercenaries to leave Syned, handing him a set of secure coordinates in a datapad. In reality, she intended to kill the mercenaries by sending them on a one-way journey to the Nakrikal Singularity, a black hole. Rusher also tried to save Kerra by offering to take the Jedi offworld but Arkadia would have none of that. queried about Kerra and offered to take the Jedi offworld, Arkadia. Due to the historic animosity between the two Force-wielding orders, the Sith Lord was unwilling to allow an enemy Jedi to create havoc in her domain, just as she had done so earlier in the former Dyarchy. Arkadia also intended to interrogate the Jedi woman on any intelligence about the Republic and other Sith warlords before exposing her to the nerve toxin."}, {"tag": "h3", "text": "The Bothan's Counter-Plot"}, {"tag": "p", "text": "With Kerra unwilling to work as her assassin, Arkadia instead enlisted the services of the Bothan spy Narsk Ka'hane, a free-lance operator who worked for several different Sith Lords. She assigned him with the task of transporting Quillan to their grandmother's secure location. In return for his services, Narsk got Arkadia to compell Brigadier Rusher into returning his stolen stealth suit. Unknown to the other three parties, Narsk had always been secretly working for Vilia, his true master. While the Bothan had not been present at the family bequest with Arkadia and Kerra, he had received an encoded signal from Vilia through his embedded implant, telling him to beware of his current employer. Through unknown means, Vilia had sensed that her eldest granddaughter was posing a threat to her rule."}, {"tag": "p", "text": "After receiving his latest set of orders, Narsk convinced Rusher to work against Arkadia's orders, claiming that they would pose a danger to his crew. After briefly outlining plans for an escape attack from Syned which involved both explosives and sending one of his crew to fetch both Narsk's stealth suit and Kerra's lightsaber, Narsk gave Rusher part of the hyperspace coordinates to a jump-point in uncontrolled space which would bring them to another hyperspace lane leading to the Republic. He promised to give the other half of the coordinates to Kerra on the condition that she helped create a distraction that would allow both parties to escape the Arkadianate."}, {"tag": "p", "text": "Unaware of Vilia's secret counter-plot, Arkadia had a modified shuttle prepared for a single hyperspace jump to her grandmother's top secret destination at Embarkation Station 7. She reiterated to Narsk that his primary mission was to assassinate Vilia. Since the Bothan lacked the Force abilities and lightsaber combat skills of a Force-wielder, Narsk's weapon would consist of a remote-controlled series of pods containing the deadly nerve toxin Chagras's Blood. These nerve toxins had been harvested from Synedian alga, a flora indigenous to the planet Syned. Upon arriving on Vilia's world, he would slip out of the vessel unseen, shadowing Quillan. Once he located both Quillan and Vilia, he would activate the nerve toxins hidden in the chair; killing both targets and plunging her empire into anarchy. Arkadia hoped to benefit from this chaos by annexing other territories, thus furthering her larger ambitions of galactic dominance. In the event that the shuttle was captured by a third party, Narsk would claim that he was working for the Odionate in order to avoid attracting attention to Arkadia. For the mission, Narsk would be hidden within a secret compartment within one of the starship's engines."}, {"tag": "p", "text": "Since the planned assassination of Vilia would destabilize the Grumani Sector's political order, she had assembled several military parties to take advantage of the ensuing chaos by launching strategic attacks on the Arkadianate's neighbors. As part of her expansionist blitz, Arkadia planned to deploy the nerve toxin known as Chagras's Blood to wipe out any resistance. She intended to use the inmates at the Impound including Kerra as her test subjects prior to their operational deployment. During the meeting, the Duros mercenary Beadle Lubboon arrived in an environment suit, carrying Narsk's stealth suit within his pouch. Rusher had sent Lubboon to deliver both the stealth suit and Kerra's lightsaber, knowing that the cumbersome Duros would not attract Arkadia's suspicion. The Duros had managed to smuggle the lightsaber past Arkadianate security by hiding it within the left arm of his spacesuit. Feigning that his left arm had been injured during a fall, Lubboon was allowed by Arkadia to depart for the infirmary for medical attention."}, {"tag": "p", "text": "In return for his services, Arkadia paid the Bothan spy a datachip containing a wealth of intelligence she had gathered on her neighbors in the Grumani Sector. The Sith Lord explained that this information was highly-sought after by various different parties seeking to gain a strategic advantage in the Second Charge Matrica. The datachip was attached to the central gas canister in the hoverchair containing the nerve toxin. Following the meeting with Arkadia, Beadle left for the infirmary by feigning an allergic reaction to the algae. There, Narsk obtained Kerra's lightsaber from Lubboon and infiltrated the Impound using his stealth suit."}, {"tag": "p", "text": "After breaking Kerra out of her prison, he convinced the Jedi woman to help her create a diversion that would allow both the Diligence and Narsk to escape the Arkadianate after convincing her that he was working for someone opposed to Arkadia's plans. In return for agreeing to this task which Rusher was already involved in, the Bothan also supplied Kerra with the remaining half of the hyperspace coordinates. However, Kerra and Narsk were unable to free the remaining prisoners at the Impound since they had already been exposed to the deadly Chagras's Blood and quickly succumbed to the effects of the nerve toxin within minutes. When Kerra asked why Narsk had spared her life despite working for Vilia, Narsk replied that he did so because he had no orders to kill her before departing on a turbolift."}, {"tag": "h2", "text": "The Battle"}, {"tag": "h3", "text": "The Trojan Horse"}, {"tag": "p", "text": "As part of his arrangement with Narsk Ka'hana, Rusher agreed to help create a diversion that would enable the Bothan spy to fulfill his mission of sabotaging Arkadia's ploy. Feigning compliance with Arkadia's orders, Rusher's crew cooperated with the Arkadianate Citizen Guards to drive the icecrawler to the Diligence. To transport the student refugees, Arkadia's staff had suspended several levels of metal scaffolds at the rear of the icecrawler. The Arkadianate driver was a male Nazzar, who had earlier served as a rumblecar driver prior to being promoted to being the driver of the icecrawler. Rusher's crew had removed the cannon barrels on one side of the Diligence to enable the icecrawler to connect with the liner by extending its bushing towards the liner's entrance hatch."}, {"tag": "p", "text": "However, Rusher had made arrangements with his crew to hijack the icecrawler. On the other side of the tunnel, Team Ripper led by Zeller was waiting and ready to launch an attack on the Citizen Guards. After the door opened, Rusher's crew attacked the Arkadianates, quickly wiping out resistance. Meanwhile, Rusher personally killed the Nazzar driver by breaking his neck. By the time the pressure between the two vessels had equalized, Rusher's mercenaries had seized control of the icecrawler. Rusher and his crew then removed the metal decking and loaded the ancient artillery cannon \"Bitsy\" into the icecrawler."}, {"tag": "p", "text": "Meanwhile, Narsk returned back to Embarkation Station 7, where the modified shuttle and Quillan were waiting. While he was unaware about the full extent of Arkadia's plans for Vilia, the Bothan spy knew he would need a diversion for Vilia's errand to succeed. He could not rely completely on the Brigadier since the mercenary could be bribed by a higher bidder. Thus, he had freed Kerra because he knew that Jedi could not be bribed. Narsk also recalled that Arkadia had attached a timer to the gas canister assembly under the hover chair destined to be used during the assassination attempt. Narsk quickly realized that Arkadia had planted a fail-safe so that the nerve toxin would still be released even if Narsk failed or abandoned his assignment."}, {"tag": "p", "text": "When Arkadia asked Narsk what had kept him away so long, the Bothan claimed that he had to run his stealth suit through some diagnostics on the pretext that the Jedi woman had not taken care of it properly. Arkadia used the Force to levitate the catatonic Quillan onto his new velvet hover chair, which contained the nerve toxin gas canister. She then bid farewell to her younger brother, telling him that he never had a chance in life but that he would avenge their father through his death. Since Quillan dwelled entirely in his mind, he was not cognizant of the developments occurring around him."}, {"tag": "p", "text": "Prior to sending Narsk away on his mission, Arkadia instructed the Bothan to contact her via the encrypted channel programmed into his datapad after his mission had succeeded. At that moment the emergency sirens in the hangar activated. Arkadia and Narsk quickly learnt that Kerra had escaped the Impound. Arkadia was furious and commented that somebody had helped the Jedi woman to escape from her intended “morgue.” Arkadia departed to attend to this situation but ordered one of the Wookiee Citizen Guards present to ensure that the Bothan closed his hidden chamber securely so that he would not die from asphyxiation in space. Narsk complied by entering the hidden hatch in the shuttle's engine but anxiously pondered about when Rusher would fulfill his side of the bargain."}, {"tag": "h3", "text": "Two Diversions"}, {"tag": "p", "text": "Jarrow Rusher's hijacked icecrawler Crawler One travelled through Calimondretta Control without encountering any difficulties. They proceeded towards Patriot Hall where several Citizen Guards were waiting to receive the “passengers.” Rusher also ordered his mercenaries aboard the cargo hauler to prepare for a ground assault. During the first stage of the attack, Crawler One was greeted by a chubby depot manager who demanded that its crew open its frontal hatch. When the ramp lowered to disembark the \"refugees\", Rusher's troops had the cannon \"Bitsy\" ready to fire deep inside Calimondretta, killing several staff and causing significant interior damage to Patriot Hall. After deploying \"Bitsy\", Team Zhaboka fanned out to damage the atrium's interior with their missile launchers and deploy anchor bolts into the icy floor in order to stay afoot. Meanwhile, Team Ripper led by Zeller pushed the Brigade's remaining Kelligdyd 5000 cannon. Since this attack was a lightning raid for a diversionary escape, the cannons would be left behind following the attack."}, {"tag": "p", "text": "As part of the second stage of the attack, Team Zhaboka's missile launchers destroyed the screen protecting Patriot Hall from Syned's arctic climate, causing the atrium's warm temperatures to melt the transparent roof, which had been composed from metallic power. As planned, this caused Calimondretta's automatic durasteel doors to close in order to prevent a loss of heat and oxygen. Several Citizen Guards trapped outside Patriot Hall clamored on the barriers to be let in. Rusher then ordered his gunners to breach the durasteel barriers, leaving the underground city exposed to the frigid climate. While the remaining Citizen Guards retreated into Calimondretta, Rusher ordered Ryland Dackett, who was captaining the Diligence to launch the third stage of the attack. Rusher was also away that Kerra was still inside the city. For the Brigadier, this attack was a milestone in his career as a mercenary since this was the first time he had assaulted a fortress from the inside."}, {"tag": "p", "text": "Meanwhile, Kerra managed to escape the Impound and made her way to Patriot Hall by travelling across the underground hallways. Upon seeing two Citizen Guards, Kerra deliberately attracted their attention by activating her lightsaber and goading them into a fight. Kerra's escape coincided with Rusher's attack on Patriot Hall and she was caught in a crowd of workers fleeing to Reflection Prospect, a large public square. In the midst of this pandemonium, an inexperienced Houk Citizen Guard began firing indiscriminately at the crowd, killing the two Citizen Guards who had been pursuing Kerra. Kerra quickly killed the Houk Citizen Guard with a blaster taken from one of the fallen Guards. Unlike other soldiers utilized by other Sith states, the Arkadianate's Citizen Guards were not Sith wannabes but were rather ordinary sentient beings devoted or trapped within the Sith Lord's military-industrial complex."}, {"tag": "p", "text": "After felling a second Citizen Guard, Kerra headed towards a grotto facing Patriot Hall where several enemy snipers and guards had taken position. Kerra attempted to use her blaster to puncture a tube of Synedian alga alight in order to unleash its nerve toxin by-product but the cylinders were protected by a material tougher than transparisteel. Thus, Kerra resorted to using her lightsaber to deflect the Citizen Guard's blaster bolts but was unable to dent their electromesh tunics which cushioned the blaster shots. The shooting was interrupted by the arrival of Lord Arkadia who ordered her men to cease firing and deploy thermal detonators into Reflection Prospect. When one Guard pointed out that there were civilians and guards still below in the plaza, she curtly replied that they were doing their job and ordered her Guards to do theirs."}, {"tag": "h3", "text": "The Great Escapes"}, {"tag": "p", "text": "During the third stage of the attack, Rusher's shipmaster Ryland Dackett flew the Diligence towards the now breached Patriot Hall. Dackett saw the tall conical observation tower containing the tractor beam emitter to the north of the city. The tower's crew saw the Diligence approaching and immediately deployed their tractor beam which dragged the modified liner and its attached cargo assembly pods towards the parking area, which was packed with Arkadinate warships that were on stand-by to launch blitz raids on the Arkadianate's neighbors in the event that Vilia Calimondra was assassinated. Arkadia hoped to exploit such a crisis to further her own irredentist ambitions of ruling the Grumani Sector and then the galaxy. These ships were also loaded with shells of Chagras's Blood, a nerve toxin harvested from Synedian alga."}, {"tag": "p", "text": "As the Diligence struggled against the tractor beam force, Rusher ordered the crew of the Diligence to shed one of its massive twin cargo assembly pods. These multi-ton pieces crashed onto Arkadia's parked military fleet and the tractor beam emitter, destroying them in a massive conflagration. This effectively sabotaged the second stage of Arkadia's conspiracy by ending her expansionist goals for the moment. The destruction of the tractor beam emitter would allow the Diligence to escape Syned's orbit into hyperspace. Satisfied with his work, Rusher then used his encrypted comlink to issue Arkadia an ultimatum that she release the Jedi woman Kerra or he would destroy her and her city.\nMeanwhile, the Bothan Narsk overpowered an Unidentified Wookiee Citizen Guard by using his stealth suit to distract her, before knocking her unconscious. Quillan remained on the new burgundy hoverchair and was surrounded by three technicians."}, {"tag": "p", "text": "With the technicians distracted by the damaged caused to the chamber by the conflagration, Narsk took advantage of that opportunity to switch Quillan back into his original hoverchair, leaving the dangerous burgundy one behind in the hangar bay. While the technicians were distracted by Rusher's ultimatum being channeled across the intercom, Narsk got one a Human mechanic to help him push Quillan and the hoverchair into the shuttle's passenger compartment. Narsk claimed that there were saboteurs approaching the hangar bay and that they needed to complete the mission urgently."}, {"tag": "p", "text": "After attending to Quillan, Narsk entered his hidden engine compartment and activated the vessel's droid pilot by donning his gas mask. By then the ground crew had realized their mistake and attempted to stop the shuttle from leaving by contacting the droid pilot and raising a magnetic field. In response, Narsk quickly activated the nerve toxin assembly system. The burgundy hoverchair below immediately unleashed its deadly nerve toxin, killing the ground crew and covering Narsk's escape. The Bothan's jubilation was short-lived since his ears were permanently damaged by the thunderous roar of the accelerating engines. However, Narsk succeeded in fulfilling Vilia's command to sabotage her granddaughter's conspiracy."}, {"tag": "p", "text": "With their job done, Rusher ordered his troops including Team Zhaboka to cease action and board the Diligence. He was also reunited with Beadle Lubboon who informed his employer that he had successfully passed the lightsaber to the Bothan spy. However, he had not seen Kerra whom Rusher needed because she held the second half of the hyperspace coordinates. They were unable to reach Arkadia's museum in the southern part of Calimondretta since the explosion unleashed by Arkadia's thermal detonators had damaged the passageways. The Diligence then lifted off and headed for Arkadia's museum. They also disabled Arkadia's second tractor beam emitter by ramming the second cargo assembly into it, removing dead weight."}, {"tag": "h3", "text": "Jedi versus Sith"}, {"tag": "p", "text": "Kerra Holt survived the explosion caused by Arkadia's thermal detonators at Reflection Prospect but many civilians and soldiers were killed or wounded by friendly fire. With her escape route to Patriot Hall blocked by debris, Kerra headed to Arkadia's museum in an attempt to find a way out. However, she encountered the Sith Lord Arkadia who was wielding her double-bladed lightsaber. She was both bewildered and angered by Kerra's successful escape from the Impound but reiterated that it would stop here. Kerra parried with Arkadia but the novice Jedi Knight was unable to match the lightsaber dueling skills of the Sith Lord. The two Force-wielders also goaded each other with Arkadia deriding Kerra as a Padawan while the Jedi Knight in return labeled the Sith Lord a petty dictator."}, {"tag": "p", "text": "Arkadia was angered by this comparison, voicing that the Arkadianate was an enlightened regime. Kerra retorted by asking what \"enlightened Sith\" would want to kill their grandmother. Arkadia charged towards the Jedi Knight with her lightsaber but Kerra moved out of the way. Arkadia then launched another offensive by deploying the Jar'Kai sword-fighting style, forcing her Jedi opponent to retreat backwards. Arkadia remarked that she had been a fool to expect a Jedi to do her “dirty work” but expressed her comfort in the belief that her Bothan spy had already left to assassinate her grandmother and brother. Kerra criticized Arkadia for her willingness to use her own brother as collateral damage."}, {"tag": "p", "text": "However, their duel was interrupted by the Diligence releasing its second cargo pod assembly on the remaining tractor beam emitter. The resulting impact unleashed an avalanche of explosives and ice which destroyed the southern walls of the museum, exposing it to Syned's thin atmosphere. With Arkadia distracted, the Jedi woman knocked her over with her legs. A bruised but furious Arkadia attempted to advance on Kerra. After Kerra goaded the Sith Lord about her homicidal plans, Arkadia merely expounded her personal worldview \"there could be only one Sith and no Jedi.\""}, {"tag": "p", "text": "Before Arkadia could leap on Kerra, Rusher ordered the Bitsy's gunners precision shot fired at the museum, which opened a hole in its roof and allowed Kerra to escape to the surface. The Brigadier had known that his erstwhile ally was still in Calimondretta and reasoned that she was mostly likely to be at Arkadia's museum near the planet's surface. Within the thin and frigid atmosphere, Kerra fell unconscious due to a lack of oxygen. Rusher soon spotted Kerra lying on the frigid surface of the planet and had the Diligence to pick her up. After recovering Kerra, Rusher and his men returned to the Diligence, leaving their artillery guns behind since they were too heavy to transport."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Siege of Calimondretta was a humiliating defeat for Arkadia Calimondra. Besides being deprived of the Diligence's student passengers, substantial military assets including her chemical weapons factories and parked battle fleet were destroyed. Much of Calimondretta suffered extensive war damage and many civilians and soldiers had been killed during the fighting. Kerra's successful escape meant that the lone Jedi Knight still posed a threat to Sith interests within the Grumani Sector. As a final insult, Kerra also took Arkadia's prized twin-bladed lightsaber as a personal souvenir. Most importantly, Arkadia's plot to assassinate her grandmother Vilia failed completely. After contacting Arkadia, Narsk Ka'hane learnt from her that his spur of the moment plan had succeeded. By claiming that he had been in the hidden compartment throughout the entire duration of the fighting, Narsk was able to escape her suspicions."}, {"tag": "p", "text": "Narsk also alleged that he arrived on Vilia's planet with the wrong hover chair. Arkadia concluded that her aides had loaded the wrong chair aboard the shuttle and were killed when it was accidentally released during the fighting. In the end, both Quillan and his twin sister Dromika were safely spirited out of the Arkadianate by Vilia's agents and ended up in the custody of their grandmother. However, Vilia kept them on separate worlds due to the curious Force connection between them. Vilia ensured that her son's younger children would be kept away from any opportunists who sought to exploit or kill them. The Calimondra family matriarch had preserved the Jedi Knight Kerra since she wanted her grandchildren to have a \"learning experience\" of dealing with Jedi in preparation for the day that the Sith would invade Republic territory and face the Jedi Order again. Vilia also justified her policy of sowing discord within her family as a defining basis of Sith identity."}, {"tag": "p", "text": "Following the battle, Rusher personally carried Kerra back aboard the Diligence and was present in the medical bay when she woke up. Rusher then outlined the earlier events of the battle and explained how he had been able to locate her. He explained that he had used a signal from the tag on her lightsaber to pinpoint her location. He then sent the Diligence on a flyover the museum to confirm that Kerra was located at the top of a dome. The Brigadier and his men had then used Bitsy to fire at the museum, levelling the dome and allowing Kerra to escape. Through their shared experiences on Syned, the two became friendly allies and resolved their personal disagreements. As reconciliation, Rusher also offered to drop Kerra at Tramanos, a planet in neutral space. Kerra also changed her views about mercenaries since even those who worked for the Sith could be bent to serve the Jedi's purpose. Rusher also promised to cut Kerra a discount for any future trips throughout Sith Space."}, {"tag": "p", "text": "The Diligence's passengers were also joined by 500 defecting Arkadianate citizens who had used the fighting to escape Arkadia's dictatorship. This brought the total number of the ship's passengers to 2,200 people. Among these refugees was the same Twi'lek supply clerk who had helped Rusher restock his ship before being promoted to becoming a metallurgist. These defections dealt a death blow to Arkadia's earlier rhetoric that the Arkadianate was an enlightened island of stability within Sith Space. Due to the heavy damage on Syned, Arkadia was forced to recall substantial forces from Byllura and temporarily set aside her irredentist ambitions to concentrate on rebuilding her war-damaged capital of Calimondretta."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Siege of Calimondretta served as the climax for John Jackson Miller's first professional novel Knight Errant, which was first released on January 25, 2011. Miller himself coined the name \"Siege of Calimondretta\" as the official name of the battle. The events prior to and during the battle were narrated from the perspectives of three point-of-view characters: the protagonist Jedi Knight Kerra Holt, the Brigadier Jarrow Rusher, and the Bothan spy Narsk Ka'hane. The novel served as a bridging story between the events of the two comic arcs Aflame and Escape."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}