{"url": "Sibwarra", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Captured starships", "Category:Flagships", "Category:New Republic starships", "Category:Shree-class battle cruisers", "Category:Ssi-ruuvi starships"], "nodes": [{"tag": "h1", "text": "Sibwarra"}, {"tag": "p", "text": "Sibwarra, formerly the Shriwirr, was a heavily customized Ssi-ruuvi Shree-class battle cruiser, and was the flagship of the attack fleet on the remote Imperial world Bakura shortly after the Battle of Endor. After it was captured by the Rebel Alliance, it was renamed in honor of Dev Sibwarra."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Ssi-ruuk were a saurian race from the very far reaches of the galaxy. The Shriwirr was a formidable ship, about 900 meters long and had the Ssi-ruuvi equivalent of 24 heavy turbolasers, 24 ion cannons, 12 concussion-missile launchers, 12 tractor beam projectors. She also carried 500 Swarm-class battle droids which were the Ssi-ruuvi equivalent of starfighters."}, {"tag": "p", "text": "Since Ssi-ruuk place a very high priority on capturing enemy ships, they often used the Shriwirr's tractor beam projectors and ion cannons to capture enemy ships which they dragged into huge landing bays. They then captured the crew of the ships and used a process called entechment to draw the life forces out of their captives and then transfer them into their droids, ships and computers. The Shriwirr had one large entechment lab onboard where many captives were turned into Ssi-ruu slaves. Thirty more of these labs were under construction prior to their defeat."}, {"tag": "p", "text": "The Shriwirr had five meter tall ceilings since the Ssi-ruuk were very tall. There were also several tunnels and passage ways for the P'w'ecks, a species conquered by the Ssi-ruuk, to get around the ship and do their duties. The Ssi-ruuk used the P'w'ecks as slaves. Since the P'w'ecks could not be trusted, the Shriwirr had stun traps to ensure that the P'w'ecks followed their orders and keep out of the ship's sensitive areas. These stun traps could stun a P'w'eck and were lethal to Humans."}, {"tag": "p", "text": "Conductive nets were also used to stop energy surges and to maintain a stabilized gravity since the Ssi-ruuk were not advanced enough to install artificial systems onboard their starships."}, {"tag": "p", "text": "\"Shriwirr\" was the Ssi-ruuvi word for \"ripe with eggs.\""}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Invasion of Bakura, Luke Skywalker was captured, but he broke free of the entechment lab and disabled the engineering control station. Although the Jedi Knight had been weakened and infected with a parasite, the Ssi-ruuk abandoned the Shriwirr rather than facing him in combat."}, {"tag": "p", "text": "The ship was captured by the New Republic forces, who then outfitted it and made it part of their own fleet. They renamed it Sibwarra after Dev Sibwarra, who had saved Skywalker. Some technicians called it Flutie, a derogatory name given to the Ssi-ruuk because of the way they communicated. But it was not funny to the men and women who had fought the alien invaders."}, {"tag": "p", "text": "After the Battle of Bakura, the Sibwarra led a New Republic fleet into Ssi-ruuvi space to deal with the alien menace. Some of the crew onboard the Sibwarra were killed during the journey by Ssi-ruuvi security devices still onboard the ship. When the New Republic task force reached Ssi-ruuk space, they discovered that the Ssi-ruuvi Imperium had been attacked by an unknown species. Seeing a weakened foe, the New Republic task force retreated back to Bakura."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}