{"url": "Sictis_Wars", "categories": ["Category:Legends articles", "Category:Conflicts of the Deep Core"], "nodes": [{"tag": "h1", "text": "Sictis Wars"}, {"tag": "p", "text": "The Sictis Wars was the name of a two-decade subset of the New Sith Wars, a thousand-year conflict initiated by a revived empire of the Sith Order. Lasting from 1250 BBY to 1230 BBY, the beginning of the Sictis Wars marked the rise of a new major Sith figure, the Dark Lord Belia Darzu. In this period, Lord Darzu created the defining threat of the Sictis Wars—the organic-metal hybrids known as technobeasts. With an army of these mutated Sithspawn creatures bound to the Dark Lord's will, the technobeasts were unleashed upon the Galactic Republic and the Jedi. In the final year of this period, Darzu was assassinated by her former allies, the secretive Mecrosa Order. The Sith were nonetheless deemed victorious, though without a clear line of succession for a new Dark Lord to assume Darzu's place."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "For three quarters of a millennium since 2000 BBY, a conflict known as the New Sith Wars had been waged throughout the galaxy. The war was initiated by a resurgent faction of the Sith Order, a cult of dark side practitioners that opposed the Galactic Republic and the Jedi Order. In the later period of the New Sith Wars, the tide of the conflict had been turned against the Republic, strengthening the power of the Sith as a result. Before the Sictis Wars, the last major figure to lead the Sith was the tyrannical Darth Rivan, a Sith Lord who commanded his own brand of soldiers—the Battlelords. During an engagement on the planet Almas, Rivan unwittingly summoned a wormhole that transported him through time into the future Ruusan campaign, leading to the Sith Lord's demise."}, {"tag": "h2", "text": "War"}, {"tag": "p", "text": "In 1250 BBY during the last quarter of the New Sith Wars, the beginning of the Sictis Wars saw the rise of a new leader of the Sith, a female Shi'ido Dark Lord known as Belia Darzu. Using a hidden stronghold on the planet Tython, Lord Darzu experimented with Sith alchemy and the Force technique known as mechu-deru. In her efforts to create hybrids of metal and flesh, she developed the nanogene spore, a technovirus capable of transforming living organisms into Sithspawn called technobeasts. Inside Darzu's fortress, beings from several different species were subjected to the virus, forming an army of technobeasts known as the Metanecrons."}, {"tag": "p", "text": "Bound to the Dark Lord's will, the technobeasts were unleashed upon the Galactic Republic and the Jedi, becoming recognized as the signature horror of the Sictis Wars. In combat, the technobeasts were known to infect their victims with the nanogene spore, assimilating yet more subjects into the legions of mutated cyborgs. One male Jedi Knight, however, managed to resist the effects of the technovirus through the power of the Force. Preserving his identity and becoming known as the \"technobeast Jedi\", the Knight continued to serve the galaxy for decades under this new moniker."}, {"tag": "p", "text": "By the final year of the Sictis Wars, an alliance that was once formed between Lord Darzu and the Mecrosa Order—an underground assassin cult based in the Tapani sector—had fallen apart. Despite their former connections with the Sith, the Mecrosa themselves sought to retaliate in response to Darzu's unwanted incursion in their territory. In addition, Lord Darzu was betrayed by her own Sith followers, who would somehow play a role in her impending assassination. To this end, Belia Darzu was poisoned to death by the Mecrosa on the planet Tython, ending the Sictis Wars in 1230 BBY."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Sictis Wars, in the face of Belia Darzu's assassination, were ultimately deemed a victory for the Sith. This victory deprived the dark side cult of a clear line of succession, leaving no established individual to seize the mantle of Dark Lord. The murder of Lord Darzu sabotaged her technobeast army, halting the production of new Sithspawn hybrids. The end of the Sictis Wars, however, did not permanently bring an end to this signature threat. In the aftermath of the conflict, the Sith successors of Darzu would continue to employ the creatures—albeit in smaller numbers than before—until the New Sith Wars finally ended in 1000 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sictis Wars were first mentioned as an unidentified period of the New Sith Wars in Evil Never Dies: The Sith Dynasties, a Hyperspace article written by Abel G. Peña in 2006. This period was identified as the Sictis Wars by author Daniel Wallace in The New Essential Guide to Droids, a reference book published by Del Rey."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}