{"url": "Sibilaari", "categories": ["Category:Legends articles", "Category:Force-sensitive species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Sibilaari"}, {"tag": "p", "text": "The Silbilaari were a sentient species that evolved on a planet near to Senex-Juvex."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Sibilaari were roughly three meters long, with three lower limbs and two upper appendages. Each of these ended with four fully opposable digits that could serve as hands and could be use to deliver forceful blows or to carry out intricate tasks with the same ease. They were dark black in color, with resistant flesh and no obvious mouth. They had six eyes arranged in a line between the two large upper limbs and these were the only openings in their bodies. Each eye was capable of acting independently or in unison with the other five, allowing the Sibilaari excellent estimation of spacial geometry and the distances between objects. They would metabolize sounds to generate energy, so the areas immediately around them were completely silent. They could also absorb light to a limited degree and made them sensitive to the Force. As a result, they could survive in any environment that contained either sound, light or the Force."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Their ability to sense the Force warned the Sibilaari about an impending threat that would destroy their homeworld. As they lacked sufficient technology to leave their planet and travel interstellar distances, they created shielded complexes in the most stable parts of their planet. They took shelter in these and when their world was finally destroyed, these shielded areas were flung out into spaces, with the Sibilaari inside them in a comatose state. They drifted through space and a number of them eventually entered the Cularin system asteroid belt. When the Smuggler's Confederation began the Confederation Rock Rush, the exploration of the belt, in about 31 BBY, one of the Sibilaari rocks was discovered by the Heroes of Cularin and their presence there awakened a Sibilaari from its long sleep."}, {"tag": "h2", "text": "Appearances"}]}