{"url": "Siege_of_Lothal", "categories": ["Category:Canon articles", "Category:Battles of the Great Jedi Purge", "Category:Battles of Lothal", "Category:Duels", "Category:Galactic Civil War campaigns", "Category:Missions of the Ghost"], "nodes": [{"tag": "h1", "text": "Siege of Lothal"}, {"tag": "p", "text": "The Siege of Lothal was a lockdown ordered by the Galactic Empire on the Outer Rim planet Lothal in the fourth year prior to the Battle of Yavin. The Siege came about as a reaction to the ongoing insurgency and the unrest on Lothal following the success of a rebel operation in the Mustafar system, one that led to the destruction of the Sovereign, the flagship of Grand Moff Wilhuff Tarkin. As Lothal was an industrial world vital to the Imperial conquest of the Outer Rim, the Emperor, Darth Sidious, sent his apprentice, Darth Vader, to put an end to rebel activities on the world."}, {"tag": "p", "text": "As the Empire cracked down on Lothal, bringing numerous Star Destroyers over Capital City as an intimidation tactic, the demands on the local authorities to produce results in finding the rebels and their sympathizers intensified. Minister Maketh Tua, acting in place of the absent Governor Arihnda Pryce, was unable to produce the results that Darth Vader and Governor Tarkin expected. Worried that she would be punished by the Empire, she contacted the rebels and requested that they assist her in defecting from the Empire in exchange for a list of names of those on Lothal who sympathized with the rebellion. The crew of the Ghost, a cell of rebels that had been based on Lothal, agreed to take on the mission to rescue Tua. They returned to Lothal aboard a commandeered Star Commuter 2000 shuttle and intercepted the minister. However, the Empire had tracked her communications and knew she was planning to defect. Agent Kallus of the Imperial Security Bureau escorted her to the shuttle she was supposed to take to visit Governor Tarkin, but the shuttle exploded in an act of Imperial sabotage, which Kallus blamed the rebels for in order to turn public opinion against the rebellion."}, {"tag": "p", "text": "The Empire's response to the rebel incursion was to lockdown the planet, mandating that no ship could leave the surface of the planet without Imperial authorization. The rebels, effectively trapped on Lothal, hid within Capital City. They put together a plan to infiltrate the Imperial Complex, where they intended to steal a shuttle and escape the planet. They successfully made it through the complex and found a shuttle, as well as a number of military-grade shield generators that they stole on behalf of the rebellion. As they prepared to escape, they were confronted by Darth Vader, who engaged two of the rebels—Jedi Knight Kanan Jarrus and his Padawan, Ezra Bridger—in a lightsaber duel. Vader, who Jarrus realized was a Sith Lord, quickly overpowered them but allowed them to leave, as the shuttle had a tracking device on it and Vader intended to use it to track the shuttle to the rest of the rebel fleet. Before they could escape, however, the rebels contacted Lando Calrissian, a smuggler with whom they had dealt in the past, for help getting off of Lothal. In exchange for three of their shield generators, Calrissian gave the rebels a number of masking transponders that could duplicate the shuttle's signal and scatter the Imperial forces. The Empire, meanwhile, rounded up the citizens of Tarkintown, a refugee settlement the rebels helped in the past, and burned the town to the ground as punishment for the rebellion's activities."}, {"tag": "p", "text": "The rebels returned to the fleet after using their jammers to escape Lothal. Vader tracked them to the fleet using his personal TIE Advanced x1 starfighter and engaged Phoenix Squadron, a group of rebel A-wing starfighters, in combat. As he fought through Phoenix Squadron, he also mortally damaged the rebel command ship, Phoenix Home. The Lothal cell, along with one of the rebellion's leaders, Commander Ahsoka Tano, boarded the Ghost and engaged Vader's fighter. During the fighting, Jarrus and Tano used the Force in an attempt to learn more about the Sith Lord's identity. What Tano sensed overwhelmed her, while Vader realized that Tano, whom he had trained when he was a Jedi Knight, was still alive. Soon thereafter, the command ship was destroyed and the entire fleet retreated. Vader reported to the Emperor that Tano was still alive, which Sidious believed was an opportunity for the Empire to find other Jedi who had survived the Great Jedi Purge."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the years prior to the Battle of Yavin, a rebel cell carried out an insurgency against the Galactic Empire on and around the Outer Rim planet Lothal. During their insurgency, one of the cell's leaders, Jedi Knight Kanan Jarrus, was captured by the Empire and held prisoner by Grand Moff Wilhuff Tarkin, the Governor of the Outer Rim. Tarkin, along with Agent Kallus of the Imperial Security Bureau and the Jedi hunter known as the Inquisitor, interrogated Jarrus for information about a larger rebellion operating within the galaxy. Meanwhile, Jarrus' crewmates—Captain Hera Syndulla, Padawan Ezra Bridger, Mandalorian explosives expert Sabine Wren, Lasat warrior Garazeb Orrelios, and the astromech droid C1-10P (\"Chopper\")—put together a plan to rescue Jarrus. Their mission took them to the Mustafar system, where their captive leader was held aboard Tarkin's personal Star Destroyer, the Sovereign."}, {"tag": "p", "text": "The rebels boarded the Sovereign in orbit of Mustafar. Bridger located and freed his captive Jedi teacher, but the two were confronted by the Inquisitor and engaged him in lightsaber combat. As the other rebels made their way through the ship, Chopper, who had remained aboard a stolen Imperial cruiser, contacted the mysterious rebel contact known to the rebels only as \"Fulcrum,\" who Syndulla had discreetly received missions from, and requested that Fulcrum help the rebels escape from Mustafar. Fulcrum, whose true identity was Commander Ahsoka Tano, a former Padawan of the Jedi Order, led a fleet of rebel blockade runners to Mustafar. Jarrus and Bridger survived their duel with the Inquisitor, who was killed during the duel, and the Ghost crew fled the Sovereign after it was critically damaged during the fight. The rebels flew Imperial TIE fighters off of the Sovereign but were pursued by Imperial forces. During their retreat, the rebel fleet arrived and helped the Ghost crew escape from the Mustafar system. Shortly after their escape, the Sovereign was destroyed, though Governor Tarkin evacuated the ship before it exploded."}, {"tag": "p", "text": "In the battle's aftermath, the Ghost crew, who had limited knowledge of Fulcrum's activities, learned Tano's identity and that they were part of a larger rebellion. They joined the rebel fleet, known as the Phoenix rebels, and began to take on missions for the rebellion. On Lothal, meanwhile, reports of the Empire's failure at Mustafar sparked unrest across the planet, as citizens began to see the Empire as weak and vulnerable. The Emperor, Darth Sidious, sent his apprentice, Darth Vader, to Lothal so he could bring order to the planet. Vader oversaw a crackdown of public activities, with Minister Maketh Tua of the planetary government instituting increased military patrols, security checkpoints, and pubic curfews. The Empire's efforts did not lead to the results that Vader and Governor Tarkin expected, and Tua was commanded to report to Governor Tarkin off-world in order to account for her failures—a trip that Tua knew put her in great peril."}, {"tag": "p", "text": "Knowing that Tua had reservations about her role in the government, Vader and Kallus chose to use her as bait to bring the rebels out of hiding. The plan was put in motion when the terrified Minister Tua contacted the Ghost crew and asked for assistance in defecting from the Empire. In exchange, she promised to provide names of rebel sympathizers on Lothal and other nearby star systems, as well as the true nature of the Empire's presence on Lothal—a top concealed operation ordered by the Emperor himself. With the approval of Commander Jun Sato, the leader of the Phoenix cell, the Ghost crew prepared for their mission to Lothal."}, {"tag": "h2", "text": "The Siege"}, {"tag": "h3", "text": "Failed rescue"}, {"tag": "p", "text": "The rebels chose to return to Lothal aboard a Star Commuter 2000 shuttle that had been docked with the Phoenix fleet; the Ghost was left behind, as the rebels suspected that the Empire would be able to track its signal after the battle over Mustafar. While en route, they went over their plan: they would rendezvous with Minister Tua, who was scheduled to leave aboard a shuttle the next day to meet with Governor Tarkin. They would then escape from Imperial forces aboard the Star Commuter shuttle. The rebels soon arrived in orbit over Lothal, and the Star Commuter was given clearance to move past the heavy Star Destroyer presence. The rebels realized that, as a result of their actions on Mustafar, the military had increased its presence on Lothal, including flying directly over Capital City. Once the Star Commuter landed, Orrelios and Chopper were ordered to stay behind in the event that the group needed to make a quick escape."}, {"tag": "p", "text": "The crew made their way through Capital City to reach the rendezvous, which was guarded by a number of stormtroopers. To distract the stormtroopers and blend into the Imperial forces, Jarrus assaulted a trooper and stole their armor, allowing him to walk right into the landing bay. He waited in position while Syndulla, Bridger, and Sabine climbed to the rooftops overlooking the bay, where they would be able to attack the Imperials from above. Tua arrived shortly thereafter, accompanied by Agent Kallus; the ISB Agent claimed that Vader ordered him to escort her for her safety, but his presence was part of the Empire's plot to kill her. The rebels soon attacked the Imperial forces and Tua ran to the shuttle, with the rebels close behind her. As soon as she entered the vessel, however, the shuttle exploded and sent the rebels flying backward. Kallus, accompanied by a spy droid recording the explosion and their presence, accused the rebels of killing the minister—with Darth Vader watching from high above in a nearby building. Their mission a failure, the rebels called Orrelios and the Star Commuter shuttle arrived to pick them up. The vessel flew away, but it was shot down by an All Terrain Defense Pod and crashed in the streets."}, {"tag": "p", "text": "The Empire's plot unfolded as planned, and the rebels were forced underground. Vader ordered Kallus to lay siege to Lothal, commanding that travel off world be restricted and that any ship attempting to leave be destroyed. The Empire also broadcast a propaganda report via HoloNet News, with broadcaster Alton Kastle reporting that Minister Tua, whom he described as a devoted public service, was assassinated by the rebels. Kastle further encouraged citizens to report the whereabouts of the rebels if they were spotted. The rebels watched the transmission from a safe house, Bridger's former home, and realized that the Empire was attempting to sway public opinion against them. The Empire soon discovered the Bridger house and broke in, and the crew escaped just in time; the Empire set off a thermal detonator that destroyed the house."}, {"tag": "p", "text": "Knowing that the starports were locked down and that the planet was under siege, the rebels formulated a plan to infiltrate the Imperial Complex in Capital City to steal a Imperial shuttle. They believed that Imperial forces would be stretched thin due to the heavy deployments of troops out searching for them, and that the capital complex would be the last place the Empire would think to search for them—but in reality, Darth Vader suspected they would infiltrate the complex and was ready for their arrival. To sneak in, Jarrus maintained his stormtrooper disguise while Bridger impersonated an Imperial Academy cadet. They entered the complex and used a mind trick on a stormtrooper to allow them to pass, while carrying crates that contained the rest of the crew. Once safely inside, the rebels headed for the complex's starport to find a shuttle."}, {"tag": "h3", "text": "Duel with Darth Vader"}, {"tag": "p", "text": "The rebels entered the Imperial dock with ease, finding no opposition to stop them. While heading for a shuttle, they discovered a number of 49-v99 shield generators, similar to ones that the rebellion had attempted to acquire in a raid on Imperial freighters shortly before the mission to Lothal. Because the rebellion needed the shields for their defenses, the rebels stole them and brought them aboard the shuttle. Before they could leave, however, Kanan and Ezra could both sense a dark presence through the Force: Darth Vader, the Dark Lord of the Sith, appearing in the entrance of the airfield, who was reinforced by a squad of stormtroopers, igniting his red-bladed lightsaber, he approached the rebels with both Kanan and Ezra activating their lightsabers."}, {"tag": "p", "text": "The stormtroopers fired on the rebels, while the two Jedi engaged the Sith Lord in a lightsaber duel. As Vader was a far more experienced warrior than the two of them, the Sith Lord overpowered them with ease, knocking Kanan out in the beginning of the duel the fight, leaving his Padawan to fight Vader alone, who was pinned by the Sith Lord against an AT-DP walker with the Force, attempting to kill him by bringing the young Padawan's own lightsaber, still in his grasp, up towards his neck, while also taunting him that his master deceived him into believing he could become a Jedi. Before he could kill him, Kanan intercepted Vader, while Wren and Orrelios, making an attempt to stop him, threw thermal detonators against the legs of AT-DP walkers stationed in the bay. In the ensuing explosion, the destroyed walkers came toppling down on the Sith Lord, making the rebels believe him to be dead."}, {"tag": "p", "text": "However, as the rebels made their escape from a seemingly dead Vader, the walkers were lifted by the Dark Lord using the Force, moving them off of him and then moved them aside. Seeing how Vader's defeat is allegedly impossible, the two Jedi then made their way to the shuttle as Sabine made an attempt to stop Vader by firing two blaster shots towards him, though they were easily deflected back at her, hitting her chest and helmet, but managed to live. A Stormtrooper Commander informed Vader that we shall mobilize fighters to intercept the rebels, but Vader told him that it would be unnecessary, knowing that the rebels would not yet leave the planet until they were able to. As soon as they would make their escape however, they would not remain out of the Empire's reach for much longer, as the stolen shuttle was equipped with a homing beacon, which would allow them to locate the fleet. Inside the shuttle, Ezra inquired on what Vader was, wondering if he was another Inquisitor sent by the Empire, however, Kanan responded that he was not an Inquisitor but a Sith Lord, the ancient enemy of the Jedi, something far worse than the Inquisitors. Ezra then asked Kanan how they would defeat him, but he told him that they couldn't defeat him and were fortunate enough to have escaped alive."}, {"tag": "h3", "text": "Escaping Lothal"}, {"tag": "p", "text": "The rebels flew off into the night and began plotting their escape, but they knew that Vader would have a blockade waiting to intercept them in orbit. Because of that, they needed to find a way to smuggle themselves off of Lothal. Although they had reservations due to their last encounter, the crew turned to Lando Calrissian to smuggle them off world. Calrissian was not on Lothal, but they managed to contact him via hologram and get him to agree to help them in exchange for three of their shield generators. With the smuggler's blessing, the crew set a course for Calrissian's farm, where he assured them that his RQ protocol droid, W1-LE, would be waiting to assist them."}, {"tag": "p", "text": "As the rebels made their way to the farm, the Empire carried out an attack on Lothal re-settlement camp 43, referred to by its citizen as \"Tarkintown;\" the settlement was given the nickname after the refugees who lived there were expelled from their original homes on the orders of Governor Tarkin. The operation was carried out on the orders of Darth Vader, who wanted to draw the rebels out by exploiting their compassion for the refugees whom they had provided assistance to in the past. Tarkintown was burned to the ground, and its citizens became prisoners of the Empire. The destruction of Tarkintown, once discovered, prompted the rebels to resolve not to return to Lothal in order to protect the people from further Imperial reprisal."}, {"tag": "p", "text": "The crew arrived at Calrissian's farm, where Wren worked with W1-LE to modify masking transponders to emit the signal of the stolen Imperial shuttle. In doing so, the crew hoped that they would be able to scatter Imperial forces sent to pursue them and bypass the blockade. They soon left the farm and made their way into space, launching the transponders as they moved through the atmosphere. The Star Destroyer Relentless, commanded by Admiral Kassius Konstantine, tracked the signals and sent TIE fighters in pursuit of each. By the time the Imperial crews realized they had been tracking decoy signals, the shuttle was in space and able to make the jump into hyperspace. Unknown to the rebels was that Vader was tracking their signal and ordered that his TIE Advanced x1 fighter be readied for launch, so he could follow the rebels back to Phoenix fleet."}, {"tag": "h3", "text": "Fleet in retreat"}, {"tag": "p", "text": "The crew returned to Phoenix Home, where Chopper discovered that the tracking signal was activated on the shuttle. The rebels rushed to the command center and informed Sato and Tano that they were tracked. As they explained the situation, the fleet picked up the signal of a lone starfighter, Vader's TIE Advanced x1, that entered the area to engage the fleet by itself. Sato deployed Phoenix Squadron, a group of RZ-1 A-wing interceptors, to approach Vader's ship, but the Dark Lord was the superior opponent. He easily destroyed a number of the Phoenix ships before moving to attack Phoenix Home."}, {"tag": "p", "text": "With the command ship under siege, the Ghost crew, accompanied by Commander Tano, boarded their ship and entered the fray. Syndulla piloted the vessel while the other rebels attempted to destroy Vader, but their efforts were in vain. As the battle continued, Jarrus and Tano used their Jedi training to reach out through the Force in an attempt to discover the pilot's identity, as Tano sensed that he was strong with the Force. As they reached out, Bridger sensed the same dark feelings he felt on Lothal and realized that it was the Sith Lord. Tano discovered something about the pilot through the Force, information that overwhelmed her with fear and pain, and she fell unconscious. She and Vader sensed one another, and Vader realized that Tano—his Padawan when he was the Jedi Knight known as Anakin Skywalker—was still alive."}, {"tag": "p", "text": "Knowing that Tano was in league with the rebellion, Vader intended to capture the Ghost crew alive. As the battle neared its end, Star Destroyers entered the battle in an attempt to keep the rebel fleet from leaving. Sato and his crew abandoned Phoenix Home, which had suffered critical damage, and evacuated to the rest of the Phoenix fleet. As they evacuated and ultimately jumped into hyperspace, the Ghost made a run towards the Star Destroyers, including Konstantine's Relentless. On Vader's orders, the Relentless powered its tractor beam to capture the Ghost as it passed between it and another Star Destroyer. Syndulla, however, had other plans. She made it through the two Star Destroyers before the tractor beams were online, leaving Vader to be caught once the beams were powered up. The Dark Lord was trapped, and the Ghost jumped into hyperspace."}, {"tag": "p", "text": "The Ghost rendezvoused with the broken Phoenix fleet, where Sato had transferred his command to the CR90 corvette Liberator. The crew knew that, as a result of their actions and the entrance of a Sith Lord into the battle, the Empire would be sending more of their forces after them. Vader, meanwhile, contacted the Emperor and informed him that the fleet had been critically damaged. He also told his Sith Master that Tano was still alive, which the Emperor believed was an opportunity that could help them track down other survivors of the Great Jedi Purge. In order to hunt the rebels further, the Emperor ordered Vader to dispatch an Inquisitor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Siege of Lothal first appeared in Star Wars Rebels: The Siege of Lothal, the television movie that served as the second season premiere of the animated television series Star Wars Rebels. It was a continuation of the events of the first season finale, \"Fire Across the Galaxy,\" which led to the arrival of Darth Vader on the series. When The Siege of Lothal and the storyline for its conflict were first outlined, Governor Arihnda Pryce of Lothal was meant to play a role. The character, who to date has been mentioned but never seen in the show, would have been the one killed in the shuttle explosion as part of the plot to destroy the rebels' reputations. Minister Tua, who was killed in the final version of the story, would have then been promoted to Governor of Lothal. The Emperor was also initially not directly involved in the episode, but the scene with the Emperor and Darth Vader was added at the suggestion of the show's executive producer, Dave Filoni, thus bringing the character directly into the Siege's plot."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}