{"url": "Sifo-Dyas%27_lightsaber", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Sifo-Dyas' lightsaber"}, {"tag": "p", "text": "The lightsaber belonging to Jedi Master Sifo-Dyas was a blue-bladed weapon. Powered by a kyber crystal, the lightsaber was used by Sifo-Dyas during his time as a Jedi Master. Around 32 BBY, Sifo-Dyas was sent to the planet Oba Diah by Supreme Chancellor Finis Valorum on a secret mission to negotiate with the Pyke Syndicate, accompanied by Valorum's aide Silman. However, before negotiations could begin, the Jedi High Council, which Sifo-Dyas had recently been removed from, ordered him to Felucia to deal with a tribal dispute. While departing Oba Diah, Sifo-Dyas' shuttle was then shot down by the Pykes, who had been paid by a man they knew as Tyranus to assassinate the Jedi Master. The T-6 shuttle crashed on Oba Diah's moon, where the Pykes found Sifo-Dyas' corpse and a still-living Silman. Taking the aide prisoner, the spice dealers turned Sifo-Dyas' body over to Tyranus, but left the Jedi's lightsaber at the crash site."}, {"tag": "p", "text": "The Jedi Order for years afterwards believed that Sifo-Dyas had been killed on Felucia, but knew that his lightsaber had never been recovered after his death. Ten years after Sifo-Dyas' death, the Jedi discovered that he had secretly ordered a clone army for the Galactic Republic, the discovery of which came right before the onset of what became known as the Clone Wars. Late in the Clone Wars, Jedi T-6 shuttle 775519's distress beacon was reactivated and a signal was picked up, so Jedi General Plo Koon and the 104th Battalion were sent to investigate. Upon locating the crash site, Plo, searching the wreckage, discovered Sifo-Dyas' lightsaber, which led him to order the area cleared and the wreckage transported back to Coruscant. The find led the Jedi to uncover the true circumstances of Sifo-Dyas' death: he had been murdered by the Sith so they could take over the clone army project, and the mysterious \"Tyranus\" was in fact the fallen Jedi Count Dooku, Head of State of the Confederacy of Independent Systems that the Republic was fighting against. As a result of this discovery, Jedi Grand Master Yoda embarked on a journey that led him to believe the Jedi would lose the Clone Wars, but eventually prevail in the long run, although he did not know how."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sifo-Dyas' lightsaber first appeared in the Lost Missions episode \"The Lost One\" of Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}