{"url": "Siege_of_the_Jedi_Temple", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles of the Great Jedi Purge", "Category:Battles of the Jedi Temple", "Category:Duels", "Category:Genocides and massacres", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Siege of the Jedi Temple"}, {"tag": "p", "text": "The siege of the Jedi Temple, also known as the Attack on the Jedi Temple, was one of the last military engagements in the Clone Wars that took place in the year 19 BBY, around the Jedi Temple on Coruscant, the home of the Jedi Order. Following a duel between Jedi Master Mace Windu and Supreme Chancellor Sheev Palpatine, who had been revealed as the Sith Lord Darth Sidious, Jedi Knight Anakin Skywalker turned to the dark side of the Force and joined the Sith. Becoming a Sith apprentice to the Dark Lord of the Sith, Skywalker was given the name \"Darth Vader\" by his Sith Master and ordered to lead the clone troopers of the 501st Legion in a direct assault on the Temple."}, {"tag": "p", "text": "While thousands of Jedi were purged across the galaxy as a result of Order 66, the new Sith Lord and his legion invaded and occupied the Temple. During the siege, Senator Bail Organa of Alderaan traveled to the Temple but was turned away at blaster point by Clone Commander CC-1119 \"Appo.\" Before leaving, he witnessed Appo's soldiers gun down Zett Jukassa when the Padawan attempted to escape. In the aftermath of the attack, which saw the extermination of numerous Jedi, including Jedi younglings at Vader's hands, the Sith attempted to lure the survivors into a trap via a beacon signaling all Jedi to return to the Temple. However, their plan was thwarted by the efforts of Grand Master Yoda and Obi-Wan Kenobi, who reprogrammed the beacon to warn all Jedi to stay away from Coruscant."}, {"tag": "p", "text": "With the fall of the Jedi Temple and the near annihilation of the entire Jedi Order, Sidious issued the proclamation of the New Order, dissolving the Galactic Republic and replacing it with a new regime—the Galactic Empire, ruled by himself as Emperor. Coruscant continued to serve as Sidious' capital planet throughout the Imperial Era, during which he claimed the Jedi Temple as his private residence and renamed it the Imperial Palace."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Since their first encounter, Supreme Chancellor Sheev Palpatine—secretly the Dark Lord of the Sith Darth Sidious—had taken an interest in Anakin Skywalker, a boy strong in the Force and intent on learning the ways of the Jedi. He positioned himself as a mentor and father figure to the boy in order to influence his decisions, and eventually make him his apprentice. Skywalker, because of this, trusted Palpatine absolutely, confiding in him his greatest secrets, such as his slaughter of Tusken Raiders on Tatooine. Near the end of the Clone Wars, Palpatine invited Skywalker, who had become a Jedi Knight, to a performance of Squid Lake in the Galaxies Opera House. There, he told to Skywalker The Tragedy of Darth Plagueis the Wise, telling him that there were Sith techniques that he could learn to save people-such as his wife-from death. Later, Palpatine admitted to Skywalker that he knew how to utilize the dark side of the Force, and Skywalker realized that he was actually the Sith Lord that the Jedi had been looking for. The Knight was shocked by this revelation, and he fled to the Jedi Temple to inform Jedi Master Mace Windu, who took a squad of Masters to apprehend the Sith."}, {"tag": "p", "text": "In his office on Coruscant, Sidious was confronted by Windu's group, and all but Windu were quickly killed by the Sith. Sidious and Windu continued fighting until Skywalker arrived. Deciding that Amidala's life was more important to him than his commitment to the Jedi, Skywalker cut off Windu's arm to save the Sith Lord, and Sidious Force pushed Windu out of a window to his death. Skywalker then pledged himself to Sidious's teachings in order to save his wife, and was given the Sith name \"Darth Vader.\" Sidious took this moment to carefully admit that he did not actually know the secret to preserving life, but Vader evidently did not realize what he had said. With that, Sidious declared the Jedi Order an enemy of the Galactic Republic, assigning Vader the task of attacking the halls of the Jedi Temple and eliminating the growing \"menace.\" A large detachment of troopers from the 501st Legion was transferred to Coruscant to serve Lord Vader during the mission."}, {"tag": "p", "text": "While Vader prepared to begin his mission, Sidious enacted Order 66, a mandate that Republic clone troopers across the galaxy had been programmed to follow without question since before the Clone Wars had broken out. It commanded them to kill their Jedi Commanders in the name of the Republic. Within minutes, many Jedi were killed by their formerly loyal troops, though a few survived the Order."}, {"tag": "h2", "text": "The raid"}, {"tag": "p", "text": "Marching silently to the gates of the Temple with the clones, Darth Vader led the clones inside where they attacked its residents. The Jedi refused to die without a fight in defense of their home and fought back, killing many clone troopers. Vader altered and broadcast a beacon ordering all Jedi to return to the Jedi Temple because the war was over, leading any who heeded the call to their death at the hands of the clones. As the Sith Lord marched, a Jedi temple guard recognized him as his former identity Anakin Skywalker and said \"Skywalker\" under his breath before being cut down by Vader."}, {"tag": "p", "text": "Vader went to search the Council Chamber for more survivors, and it was there that he found a large group of younglings. A young boy approached Vader from where the other younglings had hidden themselves. The boy, not realizing that Skywalker had become Vader and defected to the Sith, asked him what the Jedi were going to do, and in answer, Vader re-ignited his lightsaber and proceeded to execute the entire group. The fierce fighting sparked a blaze which soon engulfed the entire Temple, attracting the attention of hundreds of beings who watched in horror as the ancient edifice burned. Witnessing the smoke and flames Bail Organa, the senator from Alderaan and a Jedi sympathizer, landed on the landing platform of one of the Tower hangars to investigate the fire. After being turned away by the clones guarding the hangar, the retreating Senator witnessed Zett Jukassa, a young Padawan, cutting his way through the group in an attempt to escape the massacre. Though Jukassa put up a tremendous fight and killed five clones, he was soon overwhelmed and shot dead right in front of the horrified Senator. The clones started to fire on Bail Organa until a trooper ordered them to stand down, telling the others not to worry about him. As she meditated in the temple, Shaak Ti was killed by Vader when he stabbed her through the back."}, {"tag": "p", "text": "Vader then confronted Cin Drallig, the Temple's battlemaster and one of the most powerful Masters in the Temple. After murdering two of Drallig's trainees, Bene and Whie Malreaux, the Sith entered a duel with Drallig, but Vader killed him by slashing his shoulder. Soon after, this would be briefly witnessed by Yoda and Obi-Wan Kenobi."}, {"tag": "p", "text": "As the fighting began to die down, Darth Sidious arrived at the Temple to check on Vader's progress. Vader knelt before his Master to be congratulated by the Dark Lord and said to go and bring peace to the rising Empire. Sidious then ordered Vader to travel to Mustafar to eliminate the leaders of the Confederacy of Independent Systems, an unrecognized state opposing the Republic that had seceded three years prior, assembled there by Sidious under the pretense of talks to end the conflict."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Leaving the clones to root out any remaining Jedi in the Temple, Darth Vader went to visit his wife in her apartment and explained the destruction of the Temple by telling her that the Jedi had betrayed the Republic. He told her where he was going and why while warning her to stay away from other members of the Senate, saying there were traitors there, too."}, {"tag": "p", "text": "Before the fires had been doused, an emergency Galactic Senate meeting was called by Palpatine the day after the attack on the Temple. During the assembly, he informed the senators of the Jedi's attempt to usurp control of the galaxy and the previous night's events. He also told them of the Temple's pacification and the clones' efforts across the galaxy to wipe out the organization in the wake of that realization. To fully sway his audience to his cause, Palpatine delivered a speech claiming the Jedi had orchestrated the entirety of the Clone Wars to weaken the Republic so that they could take over the galaxy. Palpatine also announced that to prevent another such attempt, the Galactic Republic would be reorganized as a unified body under his sole, absolute authority, the Galactic Empire."}, {"tag": "h3", "text": "The Jedi incursion"}, {"tag": "p", "text": "Following the raid, two survivors of Order 66, Masters Yoda and Obi-Wan Kenobi, received the message ordering all Jedi to return to the Temple and immediately recognized it as a trap. Since the emergency Senate session would make it easier to enter the Temple, the two Jedi Masters returned to the Temple during the meeting to take advantage of it. They found the Temple in shambles, fires still burning, and bodies from both sides of the conflict strewn through the halls."}, {"tag": "p", "text": "After fighting his way through their former allies alongside Yoda, Kenobi was able to enter the beacon room. There, Kenobi reconfigured the beacon to warn Jedi away instead of calling them to the temple, which was an idea inspired by a question from the youngling Caleb Dume earlier in the Clone Wars. Caleb himself had been on his way to Coruscant due to the fake message, but received Kenobi's warning message via his holocron as he was spotted by Imperial ARC-170 starfighters. Caleb was able to escape the Imperial ships, and he ultimately went on to change his name to \"Kanan Jarrus.\" Jarrus eventually became an important member of the early Rebel Alliance, and even trained his own Jedi Padawan, Ezra Bridger."}, {"tag": "p", "text": "Kenobi and Yoda also found a security hologram that showed Vader killing Cin Drallig and his Padawan students before conferring with Sidious. Kenobi was shocked by the revelation that Skywalker, his former Padawan, had fallen to the Dark Side and lead the massacre. In order to find him, he went to Amidala, who had been watching the Jedi Temple burn from afar, and stowed away in secret on her ship when she went to confront her husband on Mustafar. This led to a duel between the two Force users."}, {"tag": "p", "text": "Before her murder at Darth Vader's hand, Shaak Ti managed to record a message on a holocron urging any future readers to carry on the Order and not let the Jedi die in vain. This holocron would end up in the collection of Grakkus, a Hutt crime lord, and the message witnessed by Anakin's son, Luke Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The eradication of the Jedi Order and the turning of Anakin Skywalker were first indirectly mentioned in the Star Wars original trilogy. However, the 2005 film Star Wars: Episode III Revenge of the Sith depicted the event for the first time."}, {"tag": "p", "text": "George Lucas, the creator of Star Wars, felt that the portion of the raid featuring the Jedi youngling and his clan was a very necessary one. He wanted to demonstrate just how far Skywalker had fallen from his pedestal as a Jedi Knight, but he had absolutely no intention for actually showing them killed. Nonetheless, another child, Zett Jukassa, was killed on screen. He was portrayed by Lucas's son Jett Lucas."}, {"tag": "p", "text": "In the Star Wars: The Clone Wars television series episode \"Ghosts of Mortis,\" the Son shows Anakin Skywalker a vision of his future that included portions of the events of Revenge of the Sith. One of these visions was of Skywalker raising his lightsaber to strike down a child immediately after a vision of Palpatine using Force lightning, and before he saw his strangling Padmé Amidala with the Force just before his duel with Obi-Wan Kenobi. Taken as chronological visions of the movie, and interpreting Palpatine's scene as from the showdown with Mace Windu, that would place this child as a victim of the raid."}, {"tag": "h3", "text": "Cut content"}, {"tag": "p", "text": "Originally, Kenobi and Yoda were to be greeted by a squad of clone troopers disguised as Jedi in the movie. A promotional image of Temuera Morrison as one of these clones is on the second disc of the Revenge of the Sith DVD set, suggesting that they were considered for the movie. This scene can be viewed on the 2014 blu-ray release."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}