{"url": "Sien_Sovv", "categories": ["Category:Legends articles", "Category:Galactic Alliance Defense Fleet admirals", "Category:Galactic Alliance Supreme Commanders", "Category:Males", "Category:New Republic Defense Fleet admirals", "Category:New Republic Supreme Commanders", "Category:Sullustans"], "nodes": [{"tag": "h1", "text": "Sien Sovv"}, {"tag": "p", "text": "Sien Sovv was the male Sullustan Supreme Commander of the New Republic/Galactic Alliance Defense Force from roughly 23 ABY to 29 ABY, commanding the Defense Force just prior to and throughout the whole Yuuzhan Vong War, and again from 29 ABY to 36 ABY. Partially responsible for the disastrous loss of Coruscant to the Yuuzhan Vong armada, Admiral Sovv nevertheless retained the confidence of the Jedi and Galactic Alliance leadership and was allowed to remain on his post. A fleet under his command narrowly defeated the Yuuzhan Vong at Ebaq 9, an event that marked the turning point of the war, and he regained some of his former prestige. Sovv also served on Cal Omas' first High Council from 27 ABY to 29 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early years"}, {"tag": "p", "text": "Sien Sovv was born on Sullust, where he started a family. Like many Sullustans he had a large family, with over seven wives and numerous children. He eventually joined the New Republic Defense Force, where he slowly rose though the ranks. He developed a reputation as a good organizer, though he was never noted for possessing any special degree of tactical or strategic prowess."}, {"tag": "p", "text": "When Sander Delvardus of the Eriadu Authority attacked Sullust in 5.5 ABY, Captain Sovv led elements of the New Republic First Fleet to defend his homeworld and badly defeated the warlord. After his victory at Sullust, Admiral Firmus Nantz dispatched a task force along the Rimma Trade Route to support Sovv and the Sullustans. Delvardus then lost a series of battles along his border at Sanrafsix, Kabal, Clak'dor, and Sluis Van, which caused him to abandon his holdings and retreat to the Deep Core."}, {"tag": "h3", "text": "Supreme Commander"}, {"tag": "p", "text": "Following the election of Borsk Fey'lya as Chief of State, Admiral Sovv was appointed Supreme Commander as one of Fey'lya's first acts of office, replacing the retiring Admiral Ackbar. Some believed that Sovv was chosen by Chief of State Fey'lya because he would be easy to control, though most accepted that the Admiral was a perfect caretaker of the peace time military. Realizing the value of counsel from his retired superior, Sovv ensured that Ackbar received a number of important analyses, keeping him informed on the state of the Defense Force. He also used his new rank to appoint his own Sullustan favorites (including Yeel, Godt, Muun, Rabb, and a dozen more) to exalted positions within the New Republic military."}, {"tag": "h3", "text": "Yuuzhan Vong invasion"}, {"tag": "p", "text": "When the Yuuzhan Vong invaded the galaxy, Admiral Sovv was suddenly faced with the prospect of fighting a wide scale war. The political turmoil in the New Republic government affected his ability to run the Defense Force. As the invaders pressed deeper into known space, Sovv struggled to formulate a plan to turn the tide of the war. His brainchild, using Centerpoint Station to trap the Yuuzhan Vong in the Corellian system, seriously backfired. The Yuuzhan Vong attacked Fondor instead, which resulted in the loss of nearly three-quarters of the Hapan Fleet. Sovv barely survived a Senate Vote of No Confidence in his leadership, which further eroded his confidence in leading the New Republic's forces."}, {"tag": "p", "text": "At the Battle of the Black Bantha, Sovv actually commanded a fleet of New Republic warships in person, crippling a portion of the Vong fleet that was staging for an upcoming attack. Despite this major victory, the Yuuzhan Vong launched a massive armada under Tsavong Lah, intent on capturing Coruscant. Sovv's worst moment came while he was commanding the defense of Coruscant against the Yuuzhan Vong in 27 ABY. While in command of the Coruscant defense fleet, consisting of half the New Republic Defense Fleet, he refused to open fire on the screen of refugee ships the Yuuzhan Vong were using to cover their advance, despite being expressly ordered to do so by Chief of State Borsk Fey'lya. He was then relieved of command, but Fey'lya had no means to enforce this, as Sovv retained control of the fleet. Elements of his fleet, led by Garm Bel Iblis, mutinied and obeyed Fey'lya's order, but could not turn the tide alone. The battle turned into a rout, while some Senators hijacked elements of the fleet for personal defense. As New Republic forces retreated towards Dac, a despondent Admiral Sovv looked for someone to accept his resignation."}, {"tag": "h3", "text": "Turning point"}, {"tag": "p", "text": "After Cal Omas's election as Chief of State, Sovv offered his resignation mere minutes after Omas was sworn in. Yet, the Sullustan admiral would soon find the confidence he needed to continue the war. Retired admiral Ackbar began advising the new government in a plan to turn the tide of the war. Sovv immediately offered to resign in favor of Ackbar, but the aging admiral refused. Instead of taking the reigns of the Defense Force, Ackbar performed a consultative role. While Sovv did not realize it at the time, Ackbar would restore his confidence. Sovv worked closely with Ackbar in readying the Defense Force for the Battle of Ebaq. Sovv oversaw the battle from a war room on Dac, leaving field command to Bothan admiral Traest Kre'fey. The battle was a stunning success, turning the tide of the war in favor of the New Republic. As the government transitioned into the Galactic Alliance, Sovv continued as the Supreme Commander."}, {"tag": "p", "text": "In the following months, Admiral Sovv showed new confidence, both in himself and his forces. His time in command saw the liberation of Fondor and Yag'Dhul, though Operation Trinity turned out a failure after the crippling of the HoloNet. Sien Sovv finally resigned after the Battle of Yuuzhan'tar, leaving the command of the Galactic Alliance military to Bothan Admiral Traest Kre'fey. However, he was shortly reinstated due to Kre'fey's genocidal ar'krai leanings, and remained in the position over the next five years. He was lauded as being a capable administrator and peace-time commander - not a man of winning huge battles, but of defeating pirate groups and maintaining the peace."}, {"tag": "h3", "text": "Swarm War"}, {"tag": "p", "text": "After several years of commanding the Galactic Alliance Defense Force during the reconstruction of the galaxy, Sovv was killed in an accident when his personal transport was hit by another ship whose Vratix pilot was flying under the influence of black membrosia. Evidence from an investigation by Jedi Master Corran Horn pointed to sabotage. As membrosia was a drink used by the Dark Nest Killiks, many in the Galactic Alliance, including Chief Omas, believed the accident was arranged by the Dark Nest."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Whatever his own personal doubts about his abilities, the Sullustans held Sovv in the same degree of awe that the Mon Calamari held for Ackbar and the Bothans for Fey'lya and Kre'fey. He was buried on Sullust in one of the most impressive funerals the planet had ever seen, with numerous dignitaries from across the Alliance attending."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}