{"url": "Siege_of_Tahv", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Dreypa's rebellion"], "nodes": [{"tag": "h1", "text": "Siege of Tahv"}, {"tag": "p", "text": "The Siege of Tahv occurred during Dreypa's rebellion in 2974 BBY. Following the Battle of Sessal Spire, the Lost Tribe anarchist Parlan Spinner stole the Last Hope that was hidden beneath the Tribe's capital of Tahv. However, the Sith Lord Remulus Dreypa learnt of Spinner's theft through the Force. He then contacted Spinner via hologram and threatened to destroy Tahv unless Spinner handed over the ship. Dreypa used the hostage Sith princess Takara Hilts to coerce Spinner into returning to Tahv."}, {"tag": "p", "text": "However, Spinner used the Last Hope's turbolaser cannons to destroy Dreypa's Leviathans, ancient Sithspawn capable of draining the life energies of other beings. Takara then killed the final Leviathan with Force lightning. Dreypa and Takara then ended up on the Last Hope. Spinner flew the starship to the Southern Ocean where he returned the it to Dreypa, and escaped with Takara into the waters. Meanwhile, Dreypa took control of the ship only to find that the ship had been sent on a one-way journey into the volcanic crater Sessal Spire."}, {"tag": "p", "text": "Dreypa was killed during the subsequent battle and no information about Kesh's existence escaped to the wider galaxy until after the Second Galactic Civil War. Following the battle, the former anarchist Spinner was elevated as a hero of the Tribe. A grateful Grand Lord Varner Hilts even offered him a job as one of the Grand Lord's Hands, an elite agent. Meanwhile, Spinner developed a romantic relationship with his former enemy Takara."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Since 3000 BBY, the Lost Tribe of Sith—the descendants of ancient Human Sith who had become stranded on the planet Kesh in 5000 BBY—had experienced a period of peace and stability under the leadership of Grand Lord Varner Hilts. Prior to that, the continent of Keshtah Minor had been devastated by a millennial civil war known as \"The Time of the Rot.\" This conflict had been sparked by the death of Grand Lord Lillia Venn during the Night of the Upside-Down Meteor in 3960 BBY. Her death led to centuries of civil war between rival Sith factions. Under Hilts' leadership, the Tribe and their Keshiri serfs rebuilt Keshtah Minor and \"discovered\" Alanciar, another continent situated to the west of Keshtah Minor which was home to another Keshiri civilization. After a relatively peaceful annexation in 2975 BBY, the Tribe embarked on a mission to explore and catalogue the various lands and seas of Kesh."}, {"tag": "p", "text": "Kesh remained at peace until Dreypa's rebellion in 2974 BBY. The Sith Lord Remulus Dreypa had been one of the Dark Jedi who had been exiled to Korriban following the Hundred-Year Darkness. He was one of the founders of the Sith Order. Dreypa later led a group of Dark Jedi followers on a failed attempt to return to the wider galaxy in order to seek revenge against the Jedi and Galactic Republic. However, they were intercepted by Jedi forces outside the Stygian Caldera and both parties eventually crash-landed on Kesh, the homeworld of the Keshiri species."}, {"tag": "p", "text": "The arrival of these Force-users triggered the Great Calamity which devastated much of Kesh and gave rise to legends about the Skyborn and the Destructors. Eventually, Dreypa's Dark Jedi allies turned against him and imprisoned him within his own oubliette, a stasis casket capable of keeping individuals in suspended animation for millennia. Dreypa's former Dark Jedi allies then made peace with the Jedi and founded the Doomed, a Force-sensitive community dedicated to protecting the Keshiri and finding balance in the Force."}, {"tag": "h3", "text": "Dreypa's rebellion"}, {"tag": "p", "text": "The Sith Lord Remulus Dreypa remained in suspended animation for four thousand years until he was freed by the Sith outcast Parlan Spinner. Spinner hoped to use Dreypa as an ally against the Tribe, which he disliked for mistreating him. Spinner brought Dreypa back to the port town of Eorm on the south-western coast of Keshtah Minor. Using his dark side powers, Lord Dreypa seized control of Eorm and raised a rebel army with the aim of overthrowing the Lost Tribe's leadership in the Sith capital Tahv. Dreypa also planned to returned to the stars and seek revenge against the Jedi and the Republic."}, {"tag": "p", "text": "Dreypa clashed with the Tribe's forces at the Marisota Floodplain. He also unleashed several Leviathans which had been hibernating beneath the volcano Sessal Spire. Leviathans were ancient reptilian Sithspawn that were capable of absorbing the life energies of sentient beings. These wiped out much of the Tribe's military forces and completely annihilated the Doomed, who had arrived on Keshtah Minor in an attempt to stop Dreypa. However, Dreypa's lieutenant Spinner turned against the Sith Lord and helped the Sith princess Takara Hilts and her mother Grand Consort Iliana Hilts, the wife of Lord Varner, escape the fighting."}, {"tag": "p", "text": "Following the fighting at Sessal Spire, Lord Dreypa learnt about the existence of an ancient Jedi starship, the Last Hope, which was hidden beneath Tahv. Prior to her death, the Doomed's leader Kaliska also revealed the existence of the Jedi starship to Takara and Spinner, whom she convinced to destroy the vessel. Spinner managed to return to Tahv with Takara's mother Iliana but reneged on his promise to destroy the Jedi starship. He instead took it on a joy ride above Kesh and attempted to make a hyperspace jump to Coruscant."}, {"tag": "p", "text": "However, Spinner was contacted via hologram by Lord Dreypa who demanded that the former hand over the Last Hope. The Sith Lord threatened to destroy Tahv if Spinner refused. Spinner was unmoved by Dreypa's threat until the latter threatened to kill Takara, Spinner's love-interest. Spinner initially denied his affection for Takara and claimed they were still enemies. Dreypa countered that he had witnessed Spinner helping Takara save her mother through Kaliska's memories. Dreypa then offered to trade Takara and Kesh for the Jedi starship. He instructed Spinner to meet him at Tahv after he had made up his mind."}, {"tag": "h3", "text": "The Climax"}, {"tag": "p", "text": "News of the destruction wrought by Dreypa's rebellion was brought to Tahv by thoughtcriers, Force-sensitive individuals who were capable of transmitting information through mental telepathy. Due to the threat posed by Dreypa and his Leviathans, all abled-bodied citizens including Sith, Keshiri, and slaves were called up to participate in the defense of the city. Following his conversation with Spinner, Lord Dreypa's Leviathans assaulted and laid waste to Tahv, causing extensive damage to much of the city. Grand Consort Iliana Hilts led the defense of the city and reminded her Sith Sabers that they were the true Sith of the galaxy. She exhorted them to stand and fight for their Tribe. Due to Grand Lord Hilts' meritocratic reforms, several Keshiri were members of the Sith forces. However, the Sith defenders were unable to inflict significant damage on the Leviathans due to the monster's vast size and the Tribe's primitive pre-industrial technology."}, {"tag": "p", "text": "Meanwhile, Grand Lord Hilts ordered his servants to evacuate the city's documents and scrolls to the vault in an attempt to preserve its historical artefacts. However, they were interrupted by a Leviathan which had breached the Circle Eternal's walls. Hilts attempted to reason with the creature by offering to read it some scrolls but it refused. Before the Leviathan could devour Hilts, it was caught in the tractor beam projector of the Last Hope. Due to his love for Takara and his unwillingness to let Dreypa destroy his homeworld, Spinner had decided to stop Dreypa and his Leviathans. He got the ship's computer to give him a tutorial on operating the ship's tractor beam and laser blaster systems. Spinner used the Jedi starship's firepower to incinerate and destroy several Leviathans. This helped the Lost Tribe to gain the upper hand in the fighting."}, {"tag": "p", "text": "In the end, only Lord Dreypa and a lone Leviathan remained. The enraged Sith Lord ordered the beast to climb a tall building in order to meet the Last Hope. Dreypa reiterated his ultimatum to Spinner and threatened to crush Takara to death if he did not hand over the ship. Spinner retorted that he would send back Dreypa to his coffin in pieces. At that point, the captive Takara used her dark side powers to summon Force lightning and burnt a hole through the Leviathan's head, causing it to topple over. Takara and Dreypa managed to land on the Jedi starship."}, {"tag": "p", "text": "Spinner then activated the Last Hope's hyperdrive system and flew to the Southern Ocean. Due to its advanced technology, the vessel reached the Southern Ocean within a few seconds, something which was familiar to Lord Dreypa but was unknown to the Keshiri and Lost Tribe. While hovering over the Southern Ocean, Spinner opened the canopy of the cockpit. Feigning disinterest in the stars, Spinner offered to hand the starship to Dreypa. Dreypa accepted the offer, vowing to kill Spinner and Takara in revenge for the trouble they had caused. Before Dreypa could harm them, Spinner and Takara jumped into the sea."}, {"tag": "p", "text": "Lulled into thinking he had won, Lord Dreypa entered the Last Hope's cockpit. He dismissed Kesh as a \"planet of fools\" and pondered whether a similar fate had befallen his rivals in the Sith Empire. He vowed to continue his crusade against the Galactic Republic and the Jedi, his ancient foes. Dreypa then attempted to set the ship's hyperspace coordinates for the Republic capital Coruscant. However, Spinner had already programmed the ship's computer for a one–way journey into Sessal Spire's caldera. In the end, Dreypa and the Jedi Starship crashed into the volcano. Lord Dreypa was killed in the ensuing explosion, destroying the ancient Sith Lord and ending a major threat to the Lost Tribe."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The Siege of Tahv marked the end of Dreypa's rebellion and the survival of the Lost Tribe. However, due to the destruction of the Jedi Starship, Kesh would remain isolated from the galaxy for another three thousand years. Parlan Spinner and Takara Hilts survived the fall and swam to the beach. Takara was angry with Spinner for destroying the Tribe's only means of interstellar travel as well as his own way of escaping the planet. She wondered why Spinner had thrown away the opportunity to leave Kesh and questioned what type of Sith he was. Spinner retorted that he was just a vandal and that destroying stuff was what he did. Following the defeat of Lord Dreypa, Spinner was welcome as a hero by the Lost Tribe. His previous crimes and treachery against the Tribe were forgiven and he became a Hand of Grand Lord Varner Hilts; replacing the debilitated Iliana Hilts who had been weakened by the Leviathans at Sessal Spire."}, {"tag": "p", "text": "Tahv was also rebuilt by the Lost Tribe and their Keshiri servants and would remain the capital of Kesh for the next three millennia until it was destroyed by the Force entity Abeloth in 44 ABY. Hilts also revealed that he had sent Spinner and the Keshiri crew of the Southern Star to explore Eshkrene because he had theorized that the Lost Tribe were not the first offworlders to discover Kesh. Based on his studies of ancient Keshiri tapestries, Hilts reasoned that the Keshiri's quick acceptance of the Lost Tribe's ancestors was linked to the ancient Keshiri myths of the Protectors and Destructors. In reality, the Protectors and Destructors were two separate parties of Jedi and Dark Jedi who had become stranded on Kesh following the Hundred-Year Darkness. These offworlders became the ancestors of the Doomed."}, {"tag": "p", "text": "All members of the Doomed perished during Dreypa's rebellion. A second Sith expedition stumbled upon the ruins of the City of the Doomed. There was little left of their former city since it was only their will in the Force which was protecting their homes from the elements. While elements of the Lost Tribe including Takara and Spinner regretted the destruction of the starship, Lord Hilts argued that the Tribe was not yet ready to rejoin the galaxy since they were still too divided to advance their ambitions of galactic domination. Following the battle, Spinner also developed a romantic relationship with his former adversary Takara Hilts which pleased both their parents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While not officially named, the Siege of Tahv was the fourth and final battle of Dreypa's rebellion, which devastated parts of Keshtah Minor in 2974 BBY. It first appeared in John Jackson Miller's Lost Tribe of the Sith—Spiral 5, the fourth comic issue of the Spiral comic story, which was released on December 12, 2012."}, {"tag": "h2", "text": "Appearances"}]}