{"url": "Sienn%27rha", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Alliance to Restore the Republic members", "Category:Dancers", "Category:Desilijic servants", "Category:Females", "Category:Ryloth residents", "Category:Slaves", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Sienn'rha"}, {"tag": "p", "text": "Sienn'rha was a female Twi'lek who was a friend of Oola and joined the Rebellion during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sienn'rha was another slave girl kidnapped by Bib Fortuna and trained to be a dancer for Jabba Desilijic Tiure. While being transported to Jabba's Palace, Jerris Rudd hid both girls that later were discovered by Luke Skywalker. Luke tried to help them both to escape, but Oola was suspicious. Rudd came and a fight began. Luke deflected all bolts from Rudd's blaster and killed him, providing the dancers a chance to escape. Oola then distracted the recently arrived Fortuna and urged Sienn to flee, hoping to save her from Fortuna, who she had realized was evil."}, {"tag": "p", "text": "She would later return to Ryloth and would remain grateful to the Rebel Alliance for her rescue for years afterward. During Rogue Squadron's mission to Ryloth to obtain Ryll kor, Sienn'rha was one of the dancers who entertained the pilots. She passed a message to Wedge Antilles that she would entertain him with a private dance if he wished, an offer he politely declined."}, {"tag": "p", "text": "Sienn was a name commonly attributed to Twi'lek females, and meant maiden in the Twi'leki language."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sienn was created by author Kathy Tyers for Oola's story in Tales from Jabba's Palace. Later that year, Michael A. Stackpole gave her a brief appearance in X-Wing: The Krytos Trap, in which he introduced her full Twi'leki name of Sienn'rha."}, {"tag": "p", "text": "Sienn's entry in The Complete Star Wars Encyclopedia inaccurately states that she was presented to Jabba the Hutt along with Oola, and afterward rescued from Jabba's Palace by Luke Skywalker. All other sources, including Oola's entry in the same encyclopedia, maintain that Skywalker freed her in Mos Eisley before she could be taken to Jabba."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}