{"url": "Sienar_Fleet_Systems", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Arms manufacturing companies", "Category:Galactic Republic organizations", "Category:Imperial organizations", "Category:InterGalactic Banking Clan corporations", "Category:Shipwrights", "Category:Sienar Fleet Systems products"], "nodes": [{"tag": "h1", "text": "Sienar Fleet Systems"}, {"tag": "p", "text": "Sienar Fleet Systems (SFS) was one of the foremost starship, arms, and drive manufacturers within the galaxy, best known for its TIE line craft during the reign of the Galactic Empire. It was formerly known as Republic Sienar Systems during the Republic Era. The company reorganized into Sienar-Jaemus Fleet Systems and Sienar-Jaemus Army Systems following the Galactic Concordance to avoid arms restrictions against selling weaponry to the First Order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sienar Fleet Systems manufactured much of the Galactic Republic's military shuttles and landing craft during the Clone Wars. The Republic Navy also commissioned Sienar to manufacture a prototype corvette, a stealth ship equipped with an experimental cloaking device—reportedly developed by Republic engineers—that rendered the ship invisible and undetectable to scanners and sensors. Republic forces used the spear-shaped stealth ship to destroy a Separatist dreadnought, but the cloaking technology's enourmous expense and maintenance requirements discouraged the Navy from commissioning additional stealth ships."}, {"tag": "p", "text": "By the end of the Clone Wars, they were bankrupt and owned by the InterGalactic Banking Clan. After the invasion of Scipio, SFS' holdings fell to the office of the Chancellor."}, {"tag": "p", "text": "Upon the rise of the Galactic Empire, Raith Sienar became the head of SFS, designing the Imperial TIE/ln space superiority starfighter personally. A competitor to Kuat Drive Yards, the rise of the Empire saw Sienar acquire key assets and engineers formerly employed by KDY, leading to the design and manufacture of the TIE line."}, {"tag": "p", "text": "By the time of the First Order's rise to power, SFS had been succeeded by Sienar-Jaemus Fleet Systems and Sienar-Jaemus Army Systems."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}