{"url": "Sienn_Sconn", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Criminals", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sienn Sconn"}, {"tag": "p", "text": "Sienn Sconn was a male Human thief, hailing from Ryvellia in the Avhn-Bendara system."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "When he was seven years old, he lost both his parents at the hand of Imperial agents during an uprising in the capital city of Ryvellia, when the Empire opened fire on the dissidents with a battery of turbolasers. This resulted in most of the city block that Sienn lived in being destroyed and most of its residents being killed."}, {"tag": "p", "text": "This instilled an insatiable hatred of the Empire in Sienn, who was subsequently raised by his uncle, the rogue Cryle Cavv. Cavv taught Sienn the art of thievery and eventually Sienn rose to be among the best of master thieves. Sienn would use a range of unique equipment that he was given by his uncle."}, {"tag": "p", "text": "Having been taught moral ethics by his uncle and having a sophisticated sense of what is right and wrong, Sienn only stole from obnoxiously rich people and organization, from crime lords, and, obviously, from Imperials. While not officially affiliated with the Rebel Alliance or New Republic, Sienn was known to sometimes cooperate with them against the Empire."}, {"tag": "h3", "text": "Encounter on Venaari"}, {"tag": "p", "text": "While living on Venaari, Sconn experienced a lull in work and spent most of his time at the Binary Bar drinking Venaarian Cringe-Ale. He pondered stealing the Mobquet Nebulon-R Racer that was on display in the cantina as a way to make enough credits to pay off his landlord but was distracted when the New Republic agent Shandria L'hnnar entered the bar. He was intrigued by her appearance but before he could approach her, a young Venaarian man rushed into the bar and was shot dead by a group of pursuing stormtroopers. Sconn prevented the stormtroopers from shooting L'hnnar by attacking them with his stun-staff. He tried to sneak her out of the back of the bar, but was cut off by another group of stormtrooopers. L'hnnar found a vent that led out to the roof, and the pair climbed onto the roof. The thief jumped into the alley and eliminated the crew of a Venaarian Strike Speeder which he and L'hnnar used to escape."}, {"tag": "p", "text": "They headed to the Ven-Kavi Starport so that L'hnnar could get back to her ship and escape the planet. During the trip, they were intercepted by the bounty hunter Pentix Graphyt. Sconn climbed onto the roof of the speeder to fight the bounty hunter but was quickly overpowered. He managed to get a shot off from his wrist laser that damaged the coolant tank of Graphyt's rocket pack. As the bounty hunter struggled to remove the rocket pack, Sconn attached several explosives to him and sent him hurtling into a blockade outside of the starport. Once they reached the docking bay where L'hnnar's ship was, Sconn said he would hold off the Imperials so she could escape. She tried to entice him into leaving with her and joining the New Republic, but he didn't want to give up his independence. He took control of the mounted heavy blaster cannon on their speeder and opened fire on the approaching security forces. They destroyed Sconn's speeder and knocked him to the ground. He then noticed a locked access panel that led to the underground maintenance tunnels of the starport. He escaped from the Imperial forces led by Major Gaevril Daraada. As he made his way back to his apartment, Sconn discovered a cred stick in his pocket that L'hnnar had given him. He used the 25,000 credits on the stick to pay off his landlord and relax for the night."}, {"tag": "h3", "text": "Stealing a prototype weapon"}, {"tag": "p", "text": "Sconn was on Rydonni Prime posing as a servant so he could infiltrate Rilvvan K'ntarr's mansion during a party. He was hired by Draskha the Hutt to steal a prototype weapon."}, {"tag": "p", "text": "The thief hoped to access the Rythani Products Building and steal the prototype weapon that was going to be presented to Moff Caerbellak during a parade celebration. After slipping away from the party, Sconn was grabbed and pulled into a side room by Princess Kalieva K'ntarr and found himself in an amorous embrace. When she realized he wasn't the person she was expecting, she threatened to scream and draw the attention of the guards. Sconn managed to calm her down, and looked at the windows to see if he could get out of the building. Upon learning the windows had Type VII SafeScreens sensor alarms on them, Sconn stopped to re-assess his plans. While doing this, the Princess began to question him and deduced that he was there to steal the prototype. Wanting a way off the planet, she offered to assist Sconn in accessing the lab and stealing the weapon."}, {"tag": "p", "text": "Sconn accompanied her to Prototype Lab A where the princess attempted to gain access. When the guards tried to stop her, she distracted them so that Sconn could disarm them and knock them unconscious. He then tied up K'ntarr up and left her in a storage closet so he could proceed with his theft. He entered the lab and disabled a group of stormtroopers. Sconn found the prototype encased in a sphere of blast-shield durasteel and used a repulsorsled to load it on an AT-AT designated Unit 718-A. Before he was able to exit the lab, the thief was surprised by K'ntarr, who had managed to escape captivity. She pleaded with Sconn to take her with him. He relented, and told her to board the walker."}, {"tag": "p", "text": "After leaving the facility, Sconn was contacted by Imperial command, who questioned why the AT-AT was out. He managed to bluff them into thinking he was part of a maintenance crew who was taking the vehicle on a performance evaluation before the Moff's parade. As he piloted the walker towards his rendezvous point with the freighter he had hired to take him off-planet, the walker suffered a malfunction and stopped moving. Sconn was able to get it repaired, but it took several hours. The thief continued towards the meeting location and found himself caught up in the parade that was being thrown in the Moff's honor. Sconn was able to convince the other Imperial forces that he belonged and joined the ranks of Imperial walkers. He planned to proceed down the street past the gathered dignatiries and make his way to his escape ship. However, Moff Caerbellak was informed that the prototype was missing and started to impose martial law on the planet. K'ntarr saw her father being threatened and begged Sconn to do something. The thief got on the loudspeaker and got the attention of the dignitaries. He informed the Moff that he had stolen the prototype and then shot the legs out of the reviewing stand, causing it to collapse. He resumed his escape in the walker but noticed a sound in the back. Handing over control to K'ntarr, he went to investigate and was ambushed by Moff Caerbellak's personal bodyguard, the Mistryl Shadow Guard Variise. During the fight, he managed to force her out onto the assault ramp which he blew off the walker with one of his thermal explosives. Returning to the cockpit, he was informed by the princess that the fight had damaged the drive units and the walker was unable to steer or slow down. The walker went through the stands that were full of people watching the parade, although Sconn was able to warn them in time for them to flee. The walker continued on its path, and headed towards a starscraper housing the Rydonnian Imperial Consulate. Sconn quickly tied the repulsorsled with the prototype weapon to a speeder bike using magnalock grapplers. Sconn and the princess flew out of the walker as it hit the building and made it to the rendezvouse point to meet the ship he hired. The princess had a change of heart and decided to stay on the planet, so Sconn boarded the Ghtroc freighter Corellian Thunder and left the planet so he could turn in the prototype to Draskha and receive his credits."}, {"tag": "p", "text": "He helped capture the Executor-class Star Dreadnought Guardian."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Sconn carried a collapsible stun-staff that could extend to two meters. He had a wrist laser gauntlet and often used Thermal half-spheres."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}