{"url": "Siege_of_Mandalore", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles with conflicting sources", "Category:Articles in need of updating", "Category:Battles of Mandalore", "Category:Duels", "Category:Events during the Clone Wars", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Siege of Mandalore"}, {"tag": "p", "text": "The Siege of Mandalore, also known as the Battle of Mandalore or the attack on Mandalore, which engulfed the Outer Rim world of Mandalore at the end of the Clone Wars, was a battle that saw a Galactic Republic military intervention on the side of the rebels against  those loyal to the Shadow Collective during the Mandalorian civil war."}, {"tag": "p", "text": "Former Jedi Padawan Ahsoka Tano and Clone Commander Rex led a division of the 501st Legion of clone troopers to apprehend the former Sith Lord Maul, who controlled Mandalore by proxy via puppet leader Prime Minister Almec. Maul, having had visions of the coming fall of the Republic and the rise of the Galactic Empire under his old master, Darth Sidious, had intended the battle as a trap for Jedi Master Obi-Wan Kenobi and his former apprentice, Jedi Knight Anakin Skywalker, wishing to finally take his revenge on Kenobi and to kill Skywalker so that Sidious could not make him his new Sith apprentice. However, Maul's plan was foiled when the two Jedi were called away to the Battle of Coruscant instead."}, {"tag": "p", "text": "Although Rex and Tano succeeded in their mission, the issuance of Order 66 by Supreme Chancellor Sheev Palpatine — who was in fact Sidious — disrupted their effort to transport the captive Maul to the Jedi High Council, and the rise of the Empire rendered the victory essentially meaningless. The  Empire seized control of Mandalore and occupied the world, establishing an Imperial Academy there."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Mandalore's neutrality during the pan-galactic Clone Wars ultimately failed to stem the violent history of the Outer Rim world. In 19 BBY, the renegade Sith Lord Maul utilized his criminal organization, the Shadow Collective, to conquer Mandalore and oust Duchess Satine Kryze and her pacifistic regime, the New Mandalorians. However, Maul's takeover of the Mandalorian warrior group Death Watch led one of the splinter group's lieutenants, Bo-Katan Kryze, to form the Mandalore resistance, a rebel group that opposed Maul's leadership. Maul further deepened his enmity with Kryze after he murdered Satine, her estranged sister."}, {"tag": "p", "text": "As part of a campaign against Maul's Mandalorian super commandos, Kryze rescued Jedi Master Obi-Wan Kenobi from Maul's captivity. Before Kenobi left Mandalore, Kryze told him to inform the Galactic Republic of the state of the embattled planet as she hoped that a Republic invasion of Mandalore would result in Maul's demise. However, the Jedi High Council believed that the Republic Senate would refuse to intervene in the affairs of a neutral star system like the Mandalore system."}, {"tag": "p", "text": "Maul, meanwhile, was defeated and captured by his former Sith Master, Darth Sidious. Even though Maul later escaped from Sidious' custody, he remained absent from Mandalore. Still, the Mandalorian resistance kept the Republic apprised with intelligence regarding the world, including the fact that Prime Minister Almec, the puppet leader whom Maul had installed during his coup, maintained ties to the Shadow Collective. For their part, Jedi Generals like Kenobi and Mace Windu were determined not to let Mandalore fall to the Confederacy of Independent Systems. To that end, Kenobi and Windu led a Republic offensive against Maul and his Shadow Collective; however, Maul remained at large. In the end, Sidious and the Confederacy quashed the Shadow Collective, robbing Maul of his criminal power base, though it later managed to reform under Maul's command."}, {"tag": "p", "text": "Following Maul's escape from Dathomir with Gar Saxon and Rook Kast, Kryze and several of her loyalists, including Ursa Wren, tracked Maul through his dealings and communications on Oba Diah with Marg Krim and the Pyke Syndicate. After witnessing former Jedi Padawan Ahsoka Tano, whom Kryze had once encountered before on Carlac, escape the Pykes with her friends, the Martez sisters, Kryze and her Nite Owls followed Tano back to Coruscant and recruited her to help deal with Maul, their common enemy."}, {"tag": "p", "text": "Kryze's desire for a Republic invasion of Mandalore was eventually fulfilled. She and Tano tracked Maul for some time, and using codes Tano had stolen from the Pykes, they learned that he had returned to the Mandalorian capital of Sundari. Lacking the numbers for a prolonged siege and with time of the essence, Tano decided to contact her former master, Jedi Knight Anakin Skywalker, on his \"Fulcrum\" frequency."}, {"tag": "p", "text": "The Grand Army of the Republic was focused on other battlefronts as part of the Outer Rim Sieges, and Jedi Generals Skywalker and Kenobi had just completed a battle on the planet Yerbana. Despite wanting to assist Tano, Skywalker was unable to come personally because he and Kenobi were sent to Coruscant to respond to an attack by General Grievous, who had kidnapped the Supreme Chancellor. In his absence, Skywalker split the 501st Legion and allocated his former apprentice a division which included the 332nd Company of clone troopers, who had repainted their helmets to match her facial markings, showing their loyalty and appreciation towards her. To get around the fact that Tano, having left the Jedi Order, was no longer part of the Republic Military and thus could not officially be placed in command of the unit, Skywalker promoted Clone Captain Rex, an old friend of Tano's, to Commander and officially designated her as an advisor. He also returned Tano's lightsabers to her. Before parting ways, Kenobi advised Tano to capture Maul rather than kill him, as Kenobi had apparently done so previously, but Maul had a habit of cheating death."}, {"tag": "p", "text": "Maul, however, had foreseen Kryze seeking the help of the Jedi—in fact, it was a vital part of his plan. Having had a vision of the Great Plan of his former master Sidious coming to fruition soon, he intended to survive the chaos. Maul had orchestrated the siege with the intent of luring both Kenobi and his former apprentice to Mandalore to kill them, hoping to take his long-wished revenge on Kenobi. In Skywalker's case, Maul wished him dead in order to take revenge on Sidious, as his visions had revealed to him that the Dark Lord was grooming Skywalker to be his next apprentice. Maul was supported by his puppet Prime Minister Almec and his Mandalorian super commandos, among them Saxon and Kast, as well as the reformed Shadow Collective."}, {"tag": "h2", "text": "The siege"}, {"tag": "h3", "text": "Sky approach"}, {"tag": "p", "text": "Tano, Rex, and Kryze arrived at Mandalore with their forces in three Venator-class Star Destroyers. A fleet of LAAT/i gunships and Kom'rk-class fighter/transports descended upon Sundari from orbit. On the way down, the attacking force received a transmission from Almec, who indignantly told Kryze that the presence of Republic forces violated a century-old treaty and that she would be seen as an enemy in the eyes of the Mandalorian public for this action. Kryze retorted that she did not care and that she was coming for him since he was a puppet of Maul. Kryze then contacted Wren, in the city, for information on Maul's whereabouts, and Wren reported that he was definitely in the city, but she could not lock down his exact position."}, {"tag": "p", "text": "Almec ordered Saxon to ready Sundari's defenses, and Kast to inform the syndicate. The approaching forces soon came under attack from flying supercommandos, with a gunship being shot down. Kryze's warriors took to the air on their jetpacks to fight the enemy. As Shadow Collective supercommandos boarded a few gunships and killed the troopers inside, Kryze took to the air as well, followed by the clone troopers equipped with jetpacks. Rex, preparing to join the battle, apologized to Tano that he hadn't brought her a jetpack, but she assured him she didn't need one and proposed a race to see who would get down to the Sundari shipping docks first before leaping out of the gunship, causing him to chuckle."}, {"tag": "p", "text": "Leaping from ship to ship, Tano fought the enemy supercommandos she encountered, clearing them out of one gunship before eventually landing on a damaged LAAT hurtling towards Sundari. Finding that the pilot was unable to eject, Tano cut off the canopy to help him, for which he thanked her before doing so. Tano jumped off the stricken gunship before it crashed into the dock, facing a squad of supercommandos. She was swiftly backed up by Wren and her forces, as well as the clone troopers. Tano did not advance into the city until after Rex caught up to her, remarking that she'd won, to which he responded that some things never changed."}, {"tag": "p", "text": "The battle would bring destruction and fire to much of Mandalore, with a number of the world's plazas being engulfed in flames. At one point during the siege, in the event known as the Night of a Thousand Tears, gunships used their weaponry to devastate fields of Mandalorian recruits."}, {"tag": "h3", "text": "Assault on Sundari"}, {"tag": "p", "text": "The Mandalorian and Republic forces were quickly able to take the shipping docks, and Saxon and Kast's forces began to be pushed back as well. Informed of the development, Almec ordered the two and their forces to the Undercity and promised they would be met. Maul, having expected the assault, was waiting down in the sewer system, planning to set a trap for the Jedi Kryze brought with her, whom he had been hoping would be his old enemy Kenobi. Saxon was pursued by a squad of clone troopers led by Captain CT-0292 \"Vaughn.\""}, {"tag": "p", "text": "Tano regrouped with Rex and Kryze, before the Mandalorian set out with her squad to go after Almec at the Sundari Royal Palace. Tano ordered Rex to go reinforce Wren at the docks to decrease the chances that Maul might escape the city, to which he pointed out that if the former Sith was gone, all of their effort would play into his hands. Rex was then contacted by Vaughn, who reported that he and his squad had tracked Saxon entering the Undercity. Tano responded that she would be there, and she and Rex headed out. Arriving at the undercity portal, Tano was informed by Vaughn that Saxon had entered the city's sewage and maintenance pipes, and that he had seemed to be in a hurry. Tano set out into the tunnels with Vaughn and his squad."}, {"tag": "p", "text": "At the palace, Almec was informed by Kast of Tano's entry into the tunnels, as Maul had predicted, just before Kryze and her Nite Owls attacked. Kryze subdued several warriors before taking down Almec after a brief fight, demanding to know Maul's whereabouts. Cowed, Almec taunted her that Maul had wanted her to bring the Jedi to Mandalore, but she had brought the wrong one. Kryze immediately attempted to contact Tano to warn her, but got only static."}, {"tag": "h3", "text": "Trap in the Undercity"}, {"tag": "p", "text": "Down in the tunnels, Kast and her warriors watched Tano and her troops pass through the tunnels. Kast revealed herself and fired a missile at Tano, which knocked her down as she deflected it into a wall. The clones rushed after the Mandalorians, and Tano called after Vaughn to wait as she recovered herself. Running after her troops, Tano was too late as Kast and Saxon's warriors killed them all. Entering an open junction, Tano found Vaughn, who apologized to her for his failure just before he died. Tano was immediately surrounded in three directions by Kast, Saxon and their warriors. Maul emerged from the fourth tunnel as Tano took up a stance with her lightsabers, demanding to know why she had come instead of Kenobi."}, {"tag": "p", "text": "Maul stated that Tano's name was familiar to him, but he did not know who she was, and she retorted that she knew of him. He remarked that they had several mutual friends, and she said that that was not how she would describe things. Maul admitted that he had desired for Kenobi to come to Mandalore, hopefully accompanied by Skywalker. While he was talking, Tano covertly sent a signal with her wrist comm, which alerted Rex, who had come down to the Undercity, and he and his squad set out into the tunnels, following the signal."}, {"tag": "p", "text": "Tano pointed out that Kenobi had not come because he had had a more \"important\" engagement. Maul wondered if \"the moment\" would be upon them, but when Tano suggested that he surrender so he could tell Kenobi what he was talking about, Maul stated that that would be pointless, as the Jedi and Republic would soon no longer be the controlling powers in the galaxy. Tano inquired if he intended to replace them, and Maul informed her that Darth Sidious, a name she was unfamiliar with, would. Rex and his troopers arrived and began firing at the Mandalorians. Tano and Maul crossed blades briefly, but he chose to retreat, Force-throwing Rex into Tano to buy an opportunity to escape. Tano and Rex pursued, splitting up in the tunnels, but eventually ran into each other again and were forced to admit they had lost Maul's trail."}, {"tag": "h3", "text": "Making plans"}, {"tag": "p", "text": "Tano and Rex regrouped with Kryze back at the palace, where they had a holo-call with Master Kenobi. Kryze noted that there were still some firefights occurring in Sector 11, but that otherwise the clone troopers had been as effective in battle as promised. Tano told Kenobi about Maul's mention of Sidious, and Kenobi in turn told the three what the Jedi High Council knew of the mysterious Sith Lord: they suspected that he was the individual who had orchestrated the Clone Wars and was manipulating both sides. Kenobi had first heard the name from Dooku, but due to the Count's recent death at Skywalker's hands during the Chancellor's rescue, the Council had lost any further opportunity to get information out of him."}, {"tag": "p", "text": "Kenobi told Tano that taking Maul alive was the best opportunity the Jedi were going to get to learn who Sidious was. Tano asked for reinforcements to that end, but Kenobi told her he would be unable to reinforce her as he had been sent to Utapau to hunt down Grievous. When Tano asked if Skywalker could reinforce her, Kenobi asked to speak to Tano alone. After Rex and Kryze had stepped away, Kenobi told Tano that Skywalker had been assigned to, effectively, spy on the Supreme Chancellor as the Jedi were suspicious of his motives, since the Galactic Senate had allowed him to stay in power long beyond his allotted term. Tano pointed out that Skywalker could not be happy with this mission as the Chancellor was an old friend and mentor of his, and Kenobi said that that was why it would be a good idea for her to speak with her former master. However, Kenobi and Tano's discussion was cut short by Rex reporting an attack."}, {"tag": "p", "text": "Still lurking in the Undercity, Maul had ambushed a squad of clone troopers heading to reinforce the entry point at C-deck. Desiring information about Tano, he had targeted the ARC trooper Jesse and taken him hostage as, using the Force, Maul had realized he was older than the other troopers there. When Tano and Rex arrived and learned the details of the assault, she sent him to reinforce C-deck, before Sterling, a surviving trooper, told her what had happened to Jesse. Deeper in the tunnels, Maul was with his prisoner and his lieutenants Saxon and Kast. Jesse refused to give the darksider any information, which amused Maul, who reminisced about the Sith's Great Plan and how he and Dooku had both been used by Sidious, to the ARC trooper's confusion as he had no idea what Maul was talking about. Ruminating on the power of information, Maul sent Saxon to assassinate the captured Almec so he could not reveal any information to the enemy. Maul then began to mind probe Jesse for information on Tano as he tried to resist, screaming in agony."}, {"tag": "h3", "text": "Maul's regroupment"}, {"tag": "p", "text": "Seeking answers about Maul's goals, Tano, Rex, and Kryze went to the prison where Almec was being held to question him, which he was flattered they had the time for. Almec admitted that Maul had been troubled for weeks about something and had wanted to lure Kenobi to Mandalore, but that Kenobi was not the only Jedi the trap had been intended for. When the former Prime Minister grew cagey, Tano suggested that Kryze assist him with his memory. Intimidated, Almec began to talk, but was promptly shot by Saxon with a sniper rifle."}, {"tag": "p", "text": "As Kryze and her guards went after Saxon and Rex called for a medic, Tano tended to the dying man. Almec told her that Maul had had a vision, giving her the name \"Skywalker\" before dying. Kryze chased Saxon into the turbolift shaft, where they fought atop a lift car she had brought to a halt. Saxon eventually used his flamethrower to force Kryze into a neighboring shaft where she was stuck under a descending car. She managed to halt the car at the bottom of the shaft before it could crush her with her strength boosted by her jetpack, but damage to the device prevented her from pursuing Saxon."}, {"tag": "p", "text": "With the information he had gained from Jesse about who Tano was, Maul made new plans, plans which involved abandoning the super commandos and Mandalore. He contacted the leaders of Black Sun, the Pyke Syndicate, and Crimson Dawn — Ziton Moj, Marg Krim, and Dryden Vos, respectively — and told them to go into hiding, finishing up the conversation just as Saxon returned. Maul spoke to the super commandos, stating that their warrior culture did not prize hiding away and, playing on their sense of honor, promised them glorious deaths in battle as an incentive to attack the occupying forces."}, {"tag": "h3", "text": "Confrontation"}, {"tag": "p", "text": "Meanwhile, Kryze's warriors and the clone troopers were evacuating civilians from war-ravaged Sundari. Many of the civilians resented the Republic presence, and Kryze, watching from a balcony, told Tano that the people would not stand for the occupation for much longer, and neither would she. Rex pointed out that she had asked for the Republic's assistance, and that his men were not content acting as a police force. Tano reassured Kryze that Republic forces would leave after Maul had been captured. The three entered the throne room to find Maul awaiting them, slouching on the throne, having brought along the captive Jesse."}, {"tag": "p", "text": "Upon seeing Maul, Kryze charged at him firing her blasters, but Maul easily deflected the shots with the Force before levitating and choking her, asking her if that was any way to treat her \"rightful\" ruler. Maul said that, as a sign of \"good faith,\" he was returning Jesse to them, using the Force to remove the ARC trooper's binders. Traumatized by the ordeal he had gone through, Jesse was somewhat hesitant before stumbling across the room, apologizing to Rex and Tano for giving Maul the information he had wanted. Rex reassured him that it was okay, and Tano asked him to get Jesse out of there. As the two clones left, Saxon's forces outside began their attack, with explosions being heard from inside the room. Tano insisted that Kryze go fight as her people needed her, leaving the former Padawan alone with Maul."}, {"tag": "p", "text": "The conversation turned to the machinations of the mysterious Darth Sidious. Tano told Maul that if he surrendered, he could help the Jedi Council stop Sidious and his plans. Maul countered with an offer to Tano to join him, pointing out that they had both been abandoned by the Force-using orders they had previously served and suggesting that together they would have the power to destroy his former master. Tano considered the offer as the windows on one side of the room were shattered in by the fighting outside, and agreed, on the condition that Maul answer one question: what did he want with Skywalker? Maul told her of his visions that Skywalker was being groomed as Sidious' next apprentice, and that killing him would damage the Sith Lord's plans."}, {"tag": "p", "text": "Tano, angered and disbelieving that Skywalker would ever fall to the dark side, changed her mind and ignited her lightsabers, initiating a fierce duel between the two Force-Sensitive Outcasts. Tano was briefly disarmed of her primary lightsaber, leaving her with just her shoto, but she managed to knock Maul back and retrieve her weapon with the Force, remarking that Maul was lucky that Skywalker was absent as the Jedi would have easily defeated him. After a further clash of blades, Tano managed to kick Maul through a glass panel behind the throne."}, {"tag": "p", "text": "Outside, as the civilians of Sundari not in shelters fled, the 332nd and some of Kryze's warriors engaged the attacking super commandos. They were initially driven back, but the arrival of Kryze and more allied Mandalorians turned the tide of the battle, allowing Rex and his men to take the charge. Kast was captured along with some of her soldiers. Entire regions of Mandalore erupted into battle zones. Tano, exiting the throne room, saw the battle, eventually spotting Maul climbing on top of a building and setting out in pursuit."}, {"tag": "h3", "text": "Arresting Maul"}, {"tag": "p", "text": "Tano followed Maul to the support beams above Sundari's bio-dome. Maul, awaiting his ship, was contacted by Saxon, who requested reinforcements as the super commandos were being driven back. He instead told Saxon to \"die well\" as a warrior, before Tano revealed her presence by igniting her lightsabers and remarking that Kenobi was right about how difficult the Zabrak was to kill. Seeing Tano, Maul ignited his lightsaber as Tano rushed towards him. They then once again engaged in a duel on the support beams of the bio-dome, jumping around them while their blades clashed. Mid-duel, Maul commented on how they could have destroyed Sidious if Tano had only followed through on her agreement, but Tano knew that it would only allow for Maul to take Sidious' place. They then reengaged in the duel, allowing Tano to kick Maul across the support beams, Maul barely managing to catch himself before falling."}, {"tag": "p", "text": "As Maul regained his footing, Tano once again charged at Maul, giving Maul the opportunity to kick her back, almost causing Tano to fall. As he did this, Maul's ship arrived, and, as Maul broke the glass of the dome, Tano once again rejoined the fight, slashing her lightsabers at Maul, causing Maul to lose his balance. As the two reengaged, Maul managed to yet again disarm Tano of her primary lightsaber, leaving her to fight with only her shoto. Maul easily disarmed her of the smaller weapon, forcing Tano on the defensive. Tano began to lose her balance when Maul severed the support beam she was standing on, causing it to sag. Maul then leapt over the breach to stand on the sagging beam above Tano."}, {"tag": "p", "text": "Below, while escorting a captured Saxon, Rex noticed Maul's ship above the bio-dome and called for the gunships to capture Maul once and for all. Maul offered Tano one last chance to join him, but Tano once again refused and was forced to dodge Maul's incoming attacks. Gaining the upper hand, Tano managed to grab Maul's lightsaber and throw him over her back, sending him hurtling to Sundari's surface. However, Tano caught him with the Force as Maul cried out for her to let him go and to let him die. As she held him in place, the gunships Rex had called in arrived, allowing two Mandalorians to catch him with their wrist-cables. As he was arrested, Maul wailed in terror of what was to come, claiming that all would burn and die, with his cries ending once Rex shot him with a stun blast. After this, Tano looked up, thinking about everything that had been and what could be coming."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Afterwards, Kryze was appointed the regent of Mandalore. Some clone troopers were left on Mandalore afterwards to assist her rule. Nevertheless, the Republic's success did not last long. While Rex and Tano were en route to Coruscant to deliver the captive Maul aboard the Tribunal, Chancellor Palpatine — who was in fact Darth Sidious — issued Order 66, forcing the clones to turn on Tano. Rex, having harbored suspicions about the so-called \"inhibitor\" chips the Kaminoans had implanted in the clones after the deaths of troopers Tup and Fives, managed to resist the compulsion for long enough to give Tano the clue she needed to eventually subdue him and remove his chip. In the fighting, Tano released Maul from his Mandalorian-designed containment pod as a diversion against the mind-controlled clones. Eventually, Maul was able to escape the Venator-class Star Destroyer by destroying its hyperdrive and stealing a Nu-class shuttle."}, {"tag": "p", "text": "As Palpatine initiated a galaxy-wide Great Jedi Purge to expunge the Jedi Order, Rex and Tano parted ways and separately went into hiding in the Outer Rim. With the two of them and the escaped Maul the only survivors after the crash of the Star Destroyer they had been traveling on, Tano and Rex were able to cover their tracks, with the Togruta abandoning her lightsabers at the crash site to fake her death. Tano nonetheless suffered from guilt due to allowing Maul to escape, especially since the Jedi Order was no longer around to protect the galaxy from his wrath. Maul, for his part, eventually took control of the Crimson Dawn crime syndicate but later became stranded on the Sith wasteland planet of Malachor after his starship crash-landed there. Around sixteen years after the Clone Wars, Tano and Maul engaged in a rematch during an encounter on Malachor."}, {"tag": "p", "text": "The Siege of Mandalore, as it came to be known, further disrupted the balance of power on the Outer Rim world. The Galactic Empire, which replaced the Republic thanks to the machinations of the newly christened Emperor Palpatine, gained control of Mandalore and occupied the planet. The Empire also transformed the New Mandalorians' Royal Academy of Government into a local Imperial Academy to train cadets for its nascent military. Furthermore, the Empire outlawed the Mandalorians' mercenary practices, though it paid off certain groups like the Mandalorian Protectors of Concord Dawn in exchange for their loyalty. Kryze's position as regent did not last long, as she refused to do the Empire's bidding and was swiftly forced out of power by Clan Saxon."}, {"tag": "p", "text": "The siege was also recounted in songs, which Imperial Moff Gideon mentioned to Mandalorian bounty hunter Din Djarin during the skirmish on Nevarro in 9 ABY. Gideon guessed that the hunter may have heard of the Night of a Thousand Tears and revealed his E-Web heavy repeating blaster was similar to the weapons used on the gunships which had killed many Mandalorian recruits that night."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "The Siege of Mandalore was first mentioned in \"The Lost Commanders,\" the premiere episode of the Star Wars Rebels television series' second season. The episode, which was written by Matt Michnovetz, aired on October 14, 2015. Michnovetz included the mention of the event as a reference to the unreleased series finale of Star Wars: The Clone Wars, the television series that preceded Star Wars Rebels. The word \"siege\" in the battle's name was first capitalized in DLC for the 2017 video game Star Wars Battlefront II."}, {"tag": "p", "text": "Previously, as the head writer for The Clone Wars, Michnovetz detailed the Siege of Mandalore for a story arc that would have concluded the series' eighth and final season. According to Supervising Director Dave Filoni, the story arc revolved around the possibility that Ahsoka Tano would rejoin the Jedi Order. However, the episodes were not completed prior to the series' cancellation in 2013."}, {"tag": "p", "text": "The Siege of Mandalore first appeared in author E. K. Johnston's young adult novel Ahsoka, which was released on October 11, 2016. For her novel, Johnston drew upon plot points that Michnovetz had mapped out with Filoni. Prior to then, Filoni had released a number of details about the Siege of Mandalore in various forms, including concept art as well as a panel presentation entitled \"Ahsoka's Untold Tales\" at Celebration Europe in July 2016. Notably, Johnston's Ahsoka explained how the Siege of Mandalore tied into the events of the 2005 film Star Wars: Episode III Revenge of the Sith. The novel also confirmed that Tano confronted Maul on Mandalore, an encounter that was first referred to in \"Twilight of the Apprentice,\" the second season finale of Star Wars Rebels."}, {"tag": "p", "text": "At San Diego Comic-Con on July 19, 2018, Lucasfilm announced a twelve-episode revival of The Clone Wars, which included the Siege of Mandalore. When she wrote Ahsoka, Johnston was asked to not include action scenes to not conflict with Lucasfilm's plans for the season."}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "Maul's capture as depicted in \"The Phantom Apprentice\" is completely different from how it was shown in Ahsoka, as is his conversation with Tano beforehand. In the novel, Maul awaits Tano in a plaza, they exchange insults about him being \"half a Sith\" and her not being a proper Jedi, and the duel has Tano luring Maul to a point where her allies capture him in a ray shield. In the episode, Tano's final duel with Maul takes place on the beams on the underside of Sundari's bio-dome, their conversation is about his earlier offer to join him so they can defeat Sidious, and he is captured after disarming Tano when she manages to get him to fall off of a beam before catching him in midair with the Force, at which point Rex arrives with backup in several gunships, two Nite Owl warriors bind Maul with their wrist-cables, and Rex then shoots him with a stun blast."}, {"tag": "p", "text": "The novel also implies that Tano is still on Mandalore when Order 66 is issued shortly after the end of the siege. The episodes \"Shattered\" and \"Victory and Death\" instead establish that she, Rex, and the imprisoned Maul have already left the planet when the order is issued."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}