{"url": "Sigma-class_long-range_shuttle", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire starship classes", "Category:Sienar Fleet Systems products"], "nodes": [{"tag": "h1", "text": "Sigma-class long-range shuttle"}, {"tag": "p", "text": "The Sigma-class long-range shuttle was a lightly-armed Sienar Fleet Systems shuttle model used by the Fel Empire to ferry important individuals across the galaxy. In comparison to the Nune-class Imperial shuttle, which was often confined to one area of space and doubled as a troop transport, the Sigma-class shuttle was considered a luxury transport. The shuttle's amenities included large passenger quarters and a well-stocked galley; however, the class was not extravagant enough to be classified as a luxury yacht. The Sigma-class was incapable of carrying any starfighters, but a modified variant employed by the Imperial Knights could hold up to three Predator-class starfighters."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Designed by Sienar Fleet Systems, the Sigma-class long-range shuttle was equipped with a Class 1.0 hyperdrive and a Class 8.0 backup, along with a navicomputer. It was also outfitted with double heavy laser cannons and could carry ten passengers in addition to a minimum crew of one. The shuttle was able to hold three months' worth of consumables, and it supported up to 200 tons of cargo."}, {"tag": "p", "text": "A variant of the Sigma-class was utilized by Emperor Roan Fel's personal bodyguards, the Imperial Knights. Such craft were able to carry a maximum of three Predator-class starfighters but only thirty tons of cargo as a result of the decrease in available space. Painted in crimson, reminiscent of the color of the Knights' armor, the variant bore the Imperial crest on its ventral surface and upper wing."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Sigma-class was often employed to transport high-ranking Imperial officers and other diplomats throughout the galaxy. Whereas the Nune-class Imperial shuttle was limited to interplanetary travel in a given sector of space and commonly used as a troop transport, the Sigma-class was quite the opposite. Though not as extravagant as a luxury yacht, it was considered a luxury transport that provided comfort during long galactic travels. The interior of the shuttle consisted of a well-stocked kitchen, several large passenger compartments, and an open cargo space large enough to store personal speeders."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sigma-class was favored by Imperial officers who required a quick means of traveling throughout the galaxy and preferred to act as their own pilot or be accompanied only by a small retinue. Bureaucratic offices on planets throughout the Empire possessed a minimum of one Sigma-class shuttle in operable condition should an official need a means of transport."}, {"tag": "p", "text": "During the time of Fel's Empire-in-exile and the Second Imperial Civil War, one of the Imperial Knights' Sigma-class shuttles was utilized by Knights Marasiah Fel, Antares Draco, and Ganner Krieg during their mission to seek out an alliance with the remnants of the Jedi Order. To do so, they tracked down Jedi-turned-bounty hunter Cade Skywalker in 137 ABY using Imperial Knight Azlyn Rae, a former friend of Skywalker's during their time as Jedi apprentices, as their informant. The three Knights in their shuttle followed Skywalker's starship, the Mynock, to the Hidden Temple, a Jedi sanctuary on Taivas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Knight variant of this craft first appeared on the final page of part two of the Loyalties arc of the ongoing Star Wars: Legacy comic series, followed by a brief appearance in one panel of the following issue, part one of the The Hidden Temple story arc. The shuttle would go on unnamed until March 2009 with the release of the Legacy Era Campaign Guide, which named the transport as the \"Sigma-class long-range shuttle\" and provided details on the standard variant's characteristics and use."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}