{"url": "Silas_(Mandalorian)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Males", "Category:True Mandalorians"], "nodes": [{"tag": "h1", "text": "Silas  (Mandalorian)"}, {"tag": "p", "text": "Silas was a Human male who served as a Mandalorian during the final decades of the Galactic Republic. He was a rookie in the True Mandalorian mercenary army around 52 BBY, when he joined his friend and mentor Jango Fett in the Battle of Korda Six. The operation on Korda Six was led by Mandalore Jaster Mereel, with the objective of extracting members of the Korda Defense Force from hostile territory; however, the mission was actually a trap for Mereel and his men, set by the Mandalorian renegades known as Death Watch. The violent splinter group decimated the Korda extraction teams and murdered Mereel during the ensuing battle. Silas and Fett watched as Mereel's comrade, Montross, left him to die on the battlefield so that he might assume command of the Mandalorian armies."}, {"tag": "p", "text": "When Montross made his bid for control, Silas instead stood behind Fett and insisted that he become the new Mandalore in Mereel's stead. Silas's wishes were echoed by the other surviving Mandalorians, who exiled Montross and took Fett as their new leader. Silas served under Fett up until the debacle on the Outer Rim world of Galidraan, where members of the Jedi Order wiped out the remaining True Mandalorian mercenaries. Both men survived the event, making them the last two True Mandalorians of Mereel's discipline. Twelve years later, the Sith Lord Darth Tyranus took an interest in Fett; he kidnapped Silas and tortured the man in an attempt to extract information from him on the Mandalore's background. The Mandalorian eventually succumbed to Tyranus's overtures and told him the history of the battle at Korda Six. Although Silas offered to provide more information, Tyranus refused and had the Mandalorian killed."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Brothers in arms"}, {"tag": "p", "text": "Silas was a Human male who lived during the latter years of the Republic Classic era. At some point after 58 BBY, Silas joined the Mandalorian mercenary armies, at the time led by Mandalore Jaster Mereel. The young man endured the traditional training of a Mandalorian soldier to become a supercommando under Mereel's Supercommando Codex. During that time, he befriended the Mandalore's young protégé, Jango Fett, who had joined the warrior clans sometime prior to Silas's own induction. Silas grew to greatly admire Fett and supported the man's ascension through the Mandalorian command structure."}, {"tag": "p", "text": "In 52 BBY, the Mandalorians were contacted by the Korda Defense Force of Korda Six in a request for aid. Mereel accepted the job and formed a task force led by himself, Fett, and veteran commando Montross. Silas was assigned to serve under Fett during the operation, which marked Fett's first solo command of his squad, Jango's Grunts. During a briefing on the mission, Mereel explained to his commandos that the mission's objective was to locate and extract a rookie security team from hostile territory on Korda Six, which, according to the reconnaissance provided by the Korda Defense Force, was being lightly defended by Kordan forces with little defensive organization. Silas and the rest of Jango's Grunts were to provide covering fire for Montross's jetpack-equipped Vertigo Squad and keep the landing zone clear while Mereel led his Headhunter Squad to retrieve the security team."}, {"tag": "p", "text": "The commandos boarded Meteor-class Q-Carrier vessels and made their way for Kordan orbit, where they discovered a reality very different from the fictionalized reconnaissance provided by the Kordan Defense Force. The ships quickly came under fire from ion cannon installments on the planet's surface, forcing many of the carriers, including Silas's, to execute emergency crash landings. When Silas and the men of Jango's Grunts disembarked from their downed craft, they immediately came under fire from Kordan fortifications on a ridge above the crash site. The Mandalorian forces took heavy losses as they scrambled to find cover, but Fett and Silas were able to lead their squad into one of the trenches formed by the trajectories of the downed drop ships. The men were quickly followed by Headhunter Squad and Mereel, who decreed that the mission was a failure and that all forces were to abort their objectives and return to the dropships. The order was disregarded by Montross, who led his Vertigo Squad in a brazen attack run on the ridge. While the Mandalore left to retrieve his wayward subordinate, Fett and Silas took the three other members of Jango's Grunts to rescue the security rookies at the extraction site."}, {"tag": "p", "text": "Upon discovering the empty clearing that should have been the location of the rookie security team, Jango's Grunts were ambushed by members of the Death Watch—a renegade faction of Mandalorians who had split from Mereel's forces shortly before Silas joined the warrior clans. The Death Watch forces pursued the True Mandalorians through the Kordan forest, and eventually killed every member of the Grunts save for Fett and Silas. The two men were able to escape their attackers when Fett incinerated them with his flamethrower. They concluded that the entire job had been a Death Watch setup—the renegades had armed and trained the locals and then planted the false reconnaissance. As Fett contacted Mereel to inform him of the development, he and Silas trekked back toward the battlefield to rendezvous with their commander and depart the planet. Upon reaching the combat zone, the two bore witness to the Mandalore being gunned down by Death Watch leader Tor Vizsla while Montross fled the scene, leaving his comrade to die alone. Fett attempted to run into the crossfire to save Mereel and was nearly killed in the attempt, but he was instead saved by Silas, who threw him to the ground before the blaster fire could claim Fett's life as well."}, {"tag": "p", "text": "After the Death Watch and Kordan forces withdrew from the area, Fett and Silas approached Mereel's inert body. Silas watched as Fett bid his final farewell to his mentor and then followed the man back to the landing zone, where they found Montross claiming that Fett had died trying to save the Mandalore. The two interrupted Montross's attempts to usurp control of the Mandalorian forces in the wake of Mereel's death, revealing to their comrades that he had abandoned their commander on the field of battle. Fett rejected Montross's insinuation that he should be the new Mandalore, and Silas stood behind him, drawing his blaster on Montross and affirming that he would be led by no one other than Jango. Their fellow Mandalorians followed suit, and Montross was forced into exile while Fett assumed leadership and led his commandos off Korda 6."}, {"tag": "p", "text": "For the next eight years, Silas and the True Mandalorians followed Fett in his war against Vizsla and the Death Watch. In 44 BBY, the Mandalorians were contacted by the governor of the Outer Rim world Galidraan, who claimed that the Death Watch leader and his men were camped out on his planet. The governor agreed to reveal Vizsla's location, provided that Fett and his mercenaries first destroy a cell of political activists who were creating unrest for the Galidraan regime. Fett agreed and carried out the governor's wishes before confronting the man for the information on Vizsla. The Galidraan operation ultimately turned out to be a setup, just like Korda Six, and Fett was ambushed by the Death Watch in the governor's palace. Meanwhile, the remainder of the True Mandalorian mercenaries were confronted by members of the Jedi Order, who had been summoned to the world under the pretense that the Mandalorians had been slaughtering innocent civilians. The battle with the Jedi resulted in the destruction of the True Mandalorians, with Fett and Silas being the only surviving members."}, {"tag": "h3", "text": "After the war"}, {"tag": "p", "text": "In 32 BBY, Silas was kidnapped by Darth Tyranus, a Dark Lord of the Sith, who held him within his private retreat on the burial moon of Kohlma in the Bogden system. Tyranus was researching Jango Fett's history, as the Mandalorian had made a name for himself as a bounty hunter in the aftermath of Galidraan, and had since attracted the Sith Lord's attention. Silas's old comrade had been lured into a bounty hunting contest arranged by Tyranus, and was the expected victor. Because the contest's spoils were so important to the plans of the Sith, Tyranus hoped to collect extensive intelligence on the Mandalorian bounty hunter before entering into an agreement with the man."}, {"tag": "p", "text": "In the dungeons of the lair, Silas was tortured at the command of Tyranus with a number of interrogation droids and a scan grid, in the hopes of enticing the man to reveal Fett's history. As a Mandalorian, Silas had been trained to withstand torture, but he eventually succumbed when injected with the powerful truth serum Bavo Six. Upon learning that his prisoner had relented, Tyranus visited the dungeons to listen to Silas's admissions. The broken Mandalorian revealed to the Sith the carnage that had occurred on Korda Six and Fett's rise to power. Although he offered to provide Tyranus with an accounting of the massacre on Galidraan, his captor refused—the Sith Lord had previously been known as Dooku, the Jedi Master who led Jedi Order's task force during the mission to Galidraan. Understanding that Silas would yield no more useful information, Tyranus ordered his droids to stop the Mandalorian's heart functions. Silas's last wish was that the Sith Lord not inform Fett of his complicity; however, Tyranus refused to promise as much."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Silas's career as a Mandalorian and his death at the hands of Darth Tyranus were characterized by his devotion to his Mandalore, Jango Fett. Silas greatly admired Fett and considered him to be the greatest Mandalorian to have ever existed in the order's seven thousand-year history. The two men became friendly during Silas's early years in the warrior clans, when Fett was still serving as a low-level commando. Silas supported his friend's ascension to command and eagerly served under him during the battle on Korda Six. On Korda, Silas saved Fett's life by preventing him from running into oncoming blaster fire, and watched as the man bid farewell to his adoptive father, Jaster Mereel. When Montross tried to assume command of the Mandalorian forces, Silas was the first to draw his weapon on the usurper and nominated Fett for the role of the new Mandalore. The sentiment was shared by their comrades, and Montross's attempt was foiled. It was Silas's strong relationship with Fett that ultimately attracted the attention of Tyranus twenty years later, when the Sith Lord was attempting to glean information on the Mandalore from the man's former colleagues."}, {"tag": "p", "text": "Although he had been trained by the Mandalorians to anticipate a myriad of eventualities, including torture, Silas eventually caved in to Tyranus's demands, albeit regretfully. He felt that indulging the Sith Lord was tantamount to betraying his old friend, for whom he had nearly sacrificed his life on Korda Six. Despite his disappointment in himself for telling Tyranus of the bloodshed on Korda, Silas still offered to go into detail about the massacre on Galidraan. When the Sith refused and ordered that his prisoner be executed, Silas used his final words to ask that Fett not be informed of his failure."}, {"tag": "p", "text": "Silas had light green eyes, dark brown hair, and fair skin. During the mission on Korda 6, the young mercenary donned Mandalorian armor painted green and blue. In Mandalorian culture, the colors symbolized duty and reliability, respectively."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Silas was first seen in the second installment of Jango Fett: Open Seasons, a 2002 comic series that told the history of the Mandalorian Jango Fett through flashback sequences. All four issues of Open Seasons were written by W. Haden Blackman and penciled by Ramón F. Bachs. Silas was again seen in Star Wars: Bounty Hunter, as Open Seasons 2 was available for viewing in the video game via unlockable bonus content. He later received an entry in the 2008 The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}