{"url": "Silas_Tagge", "categories": ["Category:Legends articles", "Category:House of Tagge", "Category:Humans", "Category:Males", "Category:Nobility", "Category:Scientists"], "nodes": [{"tag": "h1", "text": "Silas Tagge"}, {"tag": "p", "text": "Silas Tagge was a Human male scientist who helmed the research wing of the Tagge Company during the Galactic Civil War. Although he was born into the powerful and ancient House of Tagge, Silas was wholly uninterested in anything outside of his scientific pursuits, living a simple and frugal lifestyle. When his older brother Orman became the new Baron of House Tagge, he put Silas' talents to use developing weapons in the Tagges' efforts to curry favor with the Emperor. Among Tagge's creations was Achtnak Turbine Station, which the Empire used to devastating effect during the Yavin blockade of 0 ABY before its destruction by Rebel pilot Luke Skywalker. In the wake of that defeat, Tagge developed another weapon called the Omega Frost, with which he and his brother planned to freeze an entire Rebel fleet. However, Skywalker foiled that plot as well, leading to the Tagges' crushing defeat at the Battle of the Corridor. Tagge was ultimately placed into custody by the Sith Lord Darth Vader, and later died while held by the Imperials."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A native of the Core World of Tepasi, Silas Tagge was born into the ancient and wealthy House of Tagge, the owners and operators of the galactic megacorporation known as the Tagge Company. While his brothers were consumed with worldly concerns from a young age—his older brother Orman was groomed his entire life to become their house's next Baron, while two younger brothers, Cassio and Ulric, embarked on careers in the Imperial Military—Silas was a natural-born scientist and developed few other interests. Tagge quickly developed into an accomplished physicist and engineer, and the Tagge Company made use of his talents by placing him at the head of its research wing, which included clandestine weapons development facilities and pharmaceutical labs. The department flourished under Tagge's direction, becoming one of the galaxy's top scientific braintrusts and recruiting a level of talent only rivaled by the Empire itself."}, {"tag": "p", "text": "The Tagges worked with the Empire during the Galactic Civil War, during which time Silas developed a design for a unique weapon to torment the upstart Rebels: a massive turbine that could hide within the atmosphere of a gas giant and generate a launch corridor for starfighter runs out of seemingly nowhere. Silas first approached the Empire with the concept only to have it summarily dismissed, leading Orman to take up the idea and pour millions of credits into making it reality. The station—named Achtnak Turbine Station, after a predator native to Tepasi—was complete by 0 ABY, when it played a part in the Imperial blockade of the Yavin system in the wake of the Rebellion's famous victory at the Battle of Yavin."}, {"tag": "p", "text": "Achtnak Turbine Station was ultimately destroyed by a young Rebel pilot named Luke Skywalker, forcing Tagge to move onto a new project: a new weapon called the Omega Frost, which had the ability to flash-freeze any object or living being that contained moisture. Silas and Orman tested the Omega Frost in the Jundland Wastes of the desert world Tatooine, finding that the device was potent enough to render even that planet's harsh and arid landscape a frozen wasteland. However, Orman had an ulterior motive for choosing Tatooine: it was the homeworld of Skywalker, with whom he'd been spoiling for an opportunity to get even. Sure enough, the Omega Frost tests drew the attention of Skywalker, who had returned home in order to find pilots skilled enough to run the Yavin blockade. The Tagges attempted to spring a trap on Skywalker and his confederates Han Solo and Chewbacca, but the Rebels managed to escape in a Jawa sandcrawler and slip back to Mos Eisley."}, {"tag": "p", "text": "With their tests on Tatooine completed, the two Tagge brothers departed the planet in a TaggeCo Mining Explorer. Although the meddlesome Skywalker was not in hand, they felt the time had come to enact a larger plan they hoped would decimate the Rebel fleet and earn the Emperor's favor. Their destination was Feriae Junction, where they rendezvoused with their brother Ulric and set up the Omega Frost in the nearby Feswe Corridor—they planned to lure a Rebel fleet into the asteroid belt and annihilate them with their new weapon, with Ulric's Imperial battle group waiting in reserve. Skywalker and company followed the Tagges to Junction, but the young Rebel was captured investigating the Omega Frost's implementation. Silas took command of the operation with Orman fixated on Skywalker, but the scientist still had to keep watch on his brother: when Silas learned that Orman intended to engage Skywalker in a lightsaber duel, Silas ensured that the Rebel's only possible escape vessel was a defueled TIE fighter that had been stripped of all arms and communications. Skywalker defeated Orman in their encounter, his skill with the blade proving to be so great that the Baron was incapacitated with shock."}, {"tag": "p", "text": "Silas' alterations ensured that Skywalker was stranded in a listing starfighter, although the Force-sensitive man miraculously managed to reach one of the Omega Frost's conductor towers as the Rebel ships approached the zone of attack. When Tagge realized Skywalker's location, the scientist rashly ordered the Omega Frost activated too early, with the Rebels just outside of its effective range. Meanwhile, Skywalker destroyed the device's conductor, ruining the Omega Frost's ambient effect. Panicked by his failure, Silas fled the Mining Explorer's bridge and rushed to Orman's side, desperately hoping his older brother had a plan to save them. However, the Rebel ships closed in at that moment, destroying the Mining Explorer and sending the Tagge brothers adrift. Although most believed Silas and Orman dead, they were picked up by the Sith Lord Darth Vader, who kept them on life support aboard his Star Destroyer and later used them as leverage to secure the obedience of Ulric Tagge."}, {"tag": "p", "text": "Orman soon escaped Imperial custody and confronted Vader on the planet Monastery, ultimately dying in a lightsaber duel with Skywalker. Silas remained in the Empire's hands, where he eventually died—news of his passing was one of the factors that led Tagge's younger sister Domina, who went on to become Baroness of the Tagge Company, to turn against Vader and the Imperials."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although Silas Tagge was born into one of the galaxy's richest and most powerful families, he was wholly uninterested in power, status or careerist ambitions: science was the man's life and his sole pursuit. Tagge's pursuit of his scientific goals was unencumbered either by material concerns—he dressed simply and ate only processed food substitutes such as nutrient pastes—or personal morality, as Tagge was a sociopath who was willing to make all sacrifices for his pursuits. That, in turn, led to a strident loyalty to TaggeCo, as it was the vessel through which Tagge could get his projects funded."}, {"tag": "p", "text": "Tagge worked closely with his brother Orman in his duties with TaggeCo, although Silas often looked down upon his older brother—he saw Orman as overly emotional and childish, deriding Orman's fixation with lightsaber training and penchant for eating real meat. Cold and logical, Silas still backed his brother despite having no interest in Orman's grudges and rivalries with men like Luke Skywalker and Darth Vader, although by 0 ABY he had started to show slight interest in assuming the title of Baron Tagge after his brother. However, Silas panicked when finally given a chance in charge, preferring the safety and stability of running experiments in his laboratory to all the unpredictable variables involved in leading a group in the field. In the end, Silas ran back to his brother, begging him to once again take command."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Silas Tagge first appeared in Star Wars 31, written by Archie Goodwin and released in 1980. He was featured several more times in the original Marvel Star Wars comic line, during which time he was illustrated by Carmine Infantino. Tagge last appears in Star Wars 36, where he is depicted as being held in stasis by Darth Vader alongside his brother Orman after the destruction of the Omega Frost. Although Orman escapes and dies at Luke Skywalker's hand in Star Wars 37, Silas' fate is left unclear. The 2010 Wizards of the Coast supplement Galaxy of Intrigue alludes to Silas' death in Imperial custody at some point after Star Wars 36, although the timeframe and circumstances of the event are not given."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}