{"url": "Sila_Kott/Legends", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Red Squadron personnel"], "nodes": [{"tag": "h1", "text": "Sila Kott"}, {"tag": "p", "text": "Sila Kott was a female Human starfighter pilot who fought and died at the Battle of Endor. Kott's A-wing was part of the Rebel Alliance's Red Squadron, in which she served as Red Three. She was shot down by two TIE Interceptors in the attempt to lead them away."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although played by British actress Poppy Hands in Return of the Jedi, Sila Kott was later dubbed by a male actor. She should not be confused with Green Leader Arvel Crynyd, a similar-looking A-wing pilot who was played by a male actor, Hilton McRae. Nevertheless, Crynyd's line \"Three of them coming in, twenty degrees!\" is attributed to \"Red Three\" in both Star Wars: The Annotated Screenplays and the junior novelization of Return of the Jedi, although in the film, the line is actually spoken by Crynyd after Kott's A-wing is destroyed."}, {"tag": "p", "text": "In Return of the Jedi, Kott responds to a command from Wedge Antilles of \"Red Three, Red Two, pull in.\" Later in the Battle of Endor, a Y-wing pilot is called \"Red Two\" by Antilles, thereby suggesting that Kott is Red Three. However, a Hasbro action figure set names Red Two as Kott's call sign, and the line \"Got it!\" is similarly attributed to Red Two in both The Annotated Screenplays and the Return of the Jedi junior novelization. This article defers to Return of the Jedi itself and assumes that in Star Wars Legends continuity, Kott is in fact Red Three. At least one source in the post-2014 rebooted Star Wars continuity has named her as Red Three."}, {"tag": "p", "text": "In 2011, original, unedited footage of Hands playing Sila Kott was included on the Star Wars: The Complete Saga Blu-ray release, speaking dialogue in her actual voice after being prompted by an off-camera crew member."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}