{"url": "Silman/Legends", "categories": ["Category:Legends articles", "Category:Clerical workers and assistants", "Category:Galactic Republic bureaucrats", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Silman"}, {"tag": "p", "text": "Silman was an elderly Human male who served as a former aide of Chancellor Finis Valorum during the last years of the Galactic Republic. Silman accompanied Jedi Master Sifo-Dyas during a mission to resolve a dispute on Felucia. However, their shuttle was shot down by the Pyke Syndicate under the orders of Count Dooku. Silman survived and was imprisoned by the Pykes for several years. In 20 BBY, he was rescued by Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker. He was murdered by Dooku before he could reveal the Sith apprentice's role in Sifo-Dyas's death."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Around 32 BBY, Silman accompanied Jedi Master Sifo-Dyas when he was sent to try and resolve a dispute with the Pyke Syndicate. This was a secret negotiation and therefore was not reported to the Jedi Order. En route to Oba Diah, they were diverted to the planet Felucia to resolve a tribal dispute. They never reached Felucia, as the Pykes shot down their shuttle. Sifo-Dyas was killed in the crash, but Silman survived. The Pyke Syndicate handed Sifo-Dyas' body off to Dooku, but the Pykes secretly held onto Silman, planning to use him as a bargaining chip, in case the Pykes needed to resolve their part on Tyranus's attack on Sifo-Dyas with the Jedi."}, {"tag": "p", "text": "Late in the Clone Wars, Anakin Skywalker and Obi-Wan Kenobi traveled to Oba Diah to find Silman after discovering he was with Sifo-Dyas. Lom Pyke was hesitant, but led them to the captive Silman's cell, in exchange for amnesty over the Pykes' betrayal of the Jedi. Silman's time spent isolated in his cell and his belief that he had been left for dead caused his mental state to degrade severely. He treated the insects in his cell as pets, having had only them for company, and spoke in rambling sentences. When Obi-Wan wanted information, specifically about Sifo-Dyas, Silman's memory appeared to work, as he remembered that there was someone else who wanted to \"be Sifo-Dyas,\" and ordered the Pykes to attack them, but before he could say who, Dooku killed Silman by choking him. However Dooku had betrayed his identity, so Anakin and Obi-Wan knew that Dooku had a hand in Sifo-Dyas's fate and that he was the Sith Lord Darth Tyranus."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Silman was a human male with blue eyes, fair skin, and brown hair. He was a senior government official who served as an aide to Chancellor Valorum. Due to his imprisonment by the Pykes, Silman's physical and mental health deteriorated, with his hair turning white and his body being emaciated by starvation. Silman's loneliness led him to befriend the vermin and lice that inhabited his cell. Despite his condition, Silman still maintained enough cognizance to communicate with Kenobi and Skywalker."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his time as a Chancellor's aide, Silman wore white robes and a medallion. By 20 BBY, he had lost his medallion to the Pykes and he wore rags."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Silman first appeared in The Clone Wars: The Lost Missions episode \"The Lost One\", which premiered on the streaming platform Netflix on March 7, 2014. He was voiced by Brian George, who had also voiced Ki-Adi-Mundi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}