{"url": "Sil_Unch", "categories": ["Category:Legends articles", "Category:Males", "Category:Neimoidians", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "Sil Unch"}, {"tag": "p", "text": "Lieutenant Sil Unch was a male Neimoidian who served as a comm officer aboard the Trade Federation flagship Saak'ak during the Invasion of Naboo. He was later transferred to the Droid Control Ship Vuutun Palaa, dying when it was destroyed during the Battle of Naboo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the year 32 BBY, Lieutenant Sil Unch served as a comm officer aboard the Trade Federation flagship, the modified Lucrehulk-class LH-3210 cargo freighter Saak'ak. During the Invasion of Naboo, he was assigned by Gunray to the Droid Control Ship Vuutun Palaa when the Saak'ak left the Naboo system, where he was killed when it was destroyed by Anakin Skywalker during the Battle of Naboo."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Specialized in battle droid control programming and interfaces, Sil Unch did not enjoy being commanded by Captain Daultay Dofine. A male Neimoidian, he had mottled gray skin and red eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Originally created for the 1999 film Star Wars: Episode I The Phantom Menace, Sil Unch was first identified in the 2001 Boonta Eve Podrace expansion set for the Star Wars Legends Young Jedi Collectible Card Game. However, Decipher claimed he was the Neimoidian sitting in the middle of the Vuutun Palaa's bridge, erroneously depicting him using an image of Tey How, an error repeated in its Theed Palace Limited expansion set for the Star Wars Customizable Card Game. The Devious Neimoidians Revealed, an article published in Star Wars Insider 147, retconed Unch as the Neimoidian sitting on the left side of the Saak'ak and Vuutun Palaa's bridges, which was set in stone by Leland Chee."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}