{"url": "Silya_Shessaun/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance to Restore the Republic members", "Category:Apprentice Legislators", "Category:Females", "Category:Galactic Republic senators", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Silya Shessaun"}, {"tag": "p", "text": "Silya Shessaun was a female Human from Thesme who represented the Thesme sector in the Galactic Senate during the waning years of the Galactic Republic. Coming from a working-class family, she was one of the few non-upper class citizens of Thesme able to make a name for herself in the political arena. Due to her origins, Shessaun consistently championed the causes of the poor and underprivileged. During her time as a Galactic Senator, she often confided in her close friend, fellow Senator Padmé Amidala of the Chommell sector. Shessaun received only minor criticism in her tenure, since she seemed to focus on her sector as a whole more than her native Thesme."}, {"tag": "p", "text": "Shessaun was forced back to her homeworld when the Separatist Crisis threatened it circa 22 BBY. During the Clone Wars, Amidala asked her to join the Delegation of 2000, but the Thesme native believed that such actions were little better than those of the Confederacy of Independent Systems. When the New Order rose in 19 BBY, and Amidala apparently died during the \"Jedi uprising,\" Shessaun launched an inquest into her friend's death, but the now-Emperor Palpatine barred it. She was later asked to step down as Senator due to her lack of enthusiasm for the Galactic Empire, and lived out her early retirement on Alderaan. Shessaun would later return to her native Thesme, where she peacefully died in 4 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Silya Shessaun was born on Thesme into a working-class family. She was considered a child prodigy, and was thrust into the political arena at an early age. She set about championing the causes of the poor and underprivileged in her work, which would carry on into her later career. When she became an Apprentice Legislator, she traveled to a summit on Alderaan, where she met Padmé Amidala. The two were paired off during a week-long workshop, with the older Shessaun taking the role of the mentor. The Thesme native was impressed with the young girl from Naboo, and the two became friends. They remained in correspondence with one another after the summit, and Shessaun was pleased to hear that Amidala became the Queen of Naboo."}, {"tag": "h3", "text": "Galactic Senator"}, {"tag": "p", "text": "At the age of twenty, Shessaun became Thesme's Galactic Senator, the first of her planet's working-class to do so. She carried her humble demeanor into office, where she would become a key figure in several social programs galaxy-wide. She did receive some criticism from those who felt she focused too much on the galaxy at large, rather than her native Thesme. Her friend Amidala would also join the Senatorial ranks in 24 BBY, and the two would confer on issues constantly."}, {"tag": "p", "text": "During the Separatist Crisis, Shessaun was called back to her homeworld to mediate a variety of territorial disputes. Several worlds under her jurisdiction in the Thesme sector threatened to secede and join the Confederacy of Independent Systems, but Shessaun had no intention of losing them, so she treated each dispute personally. She was one of the most vocal members of Loyalist senators outside Coruscant during the Clone Wars, due to spending a great deal of time away from the capital during the conflict, but she missed the luxury of being able to discuss issues with Amidala. Despite this, Shessaun refused to join the Delegation of 2000, feeling that any effort to undermine Supreme Chancellor Palpatine would be tantamount to a Separatist act."}, {"tag": "h3", "text": "The New Order and Rebellion"}, {"tag": "p", "text": "When the Clone Wars came to a close in 19 BBY, Shessaun heard that her good friend Amidala had perished in the so-called \"Jedi rebellion.\" Shessaun was skeptical as to the circumstances of her friend's death, but she attended the funeral on Naboo nonetheless. Returning to Coruscant, she attempted to launch a Senate inquest into the death, but her attempts were blocked by the now-Emperor Palpatine, who cited \"security concerns.\""}, {"tag": "p", "text": "Shessaun was now convinced that the Galactic Empire was a corrupt beast, but she kept her sympathies for the growing rebellion movements a secret. Despite her best efforts to distance herself from the Delegation of 2,000 and other rebellious groups, her previous ties to Amidala and the more vocally anti-Palpatine Senators prompted her more pro-Imperial colleagues to force her out of office. She was never specifically targeted as some of her fellow Senators were, but she was nonetheless replaced by a representative more amiable to the Empire."}, {"tag": "p", "text": "Moving to Alderaan, Shessaun spent her early retirement secretly aiding Bail Organa's rebellion movement. She aided Organa in raising his adopted daughter, Leia, not knowing that the young girl was actually the daughter of her late friend, Amidala. Eventually, Shessaun moved back to Thesme. There, on her homeworld, she died peacefully amongst her loved ones, including Leia Organa, shortly after the Battle of Endor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Silya Shessaun, having been born into a working-class family, had lived the life of the underprivileged, and decided to aid them once she had the requisite power. She would consistently champion the cause of the underdog, as she had been in their position before. Despite this, she understood how dangerous speaking out publicly against oppressive rulers was, and she chose not to openly defy Palpatine during the Clone Wars. She soon learned the error of her ways, but was still unable to act while in office, leading her to have to sacrifice her post in order to aid Organa's rebellious efforts. Her devotion to the working-class gained her a small set of detractors during her tenure as Senator, as she seemed to spend less time on Thesme than some of its inhabitants might have wanted. It took the threat of secession to draw her back, almost permanently. The talents that had gained her the status of \"prodigy\" and had allowed her to become a Senator in the first place allowed her to stave off any prospective secessionist movements in the Thesme sector."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Silya Shessaun was portrayed by Lisa Shaunessy in Star Wars: Episode III Revenge of the Sith, but was cut from the film. The name \"Silya Shessaun\" is derived from an anagram of the name \"Lisa Shaunessy.\" The backstory for Shessaun's character was developed by Nathan Hathaway Adams (under the alias \"Twi'LekEntertainer\"), through StarWars.com's \"What's The Story?\" feature. Adams' entry was elaborated on by Evan Burger (under the alias \"ShadowCultist\"), \"Master Starkeiller\" and Greg Mitchell (under the alias \"HedecGa\"). Mitchell's addition focused on her refusal to join the Delegation of 2,000, though the elements added by \"Master Starkeiller\" and Burger are unknown. The character was later given an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}