{"url": "Silri", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Females", "Category:Nightsisters", "Category:Zann Consortium members"], "nodes": [{"tag": "h1", "text": "Silri"}, {"tag": "p", "text": "Silri was a powerful Nightsister, a dark side witch of Dathomir. She worked for Tyber Zann and his criminal syndicate, the Zann Consortium, in the time following the Battle of Yavin in the hopes of being able to witness and partake in the destruction that Zann intended on causing. In combat, she used dark side powers, such as Drain Life, and also a lightwhip, an exotic variant of the traditional lightsaber. Silri also had a pet rancor, Cuddles, that she could summon during battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Imprisonment and rescue"}, {"tag": "p", "text": "After the Battle of Yavin, Silri and many Nightsisters were taken captive by Imperial Stormtroopers on Dathomir in an attempt by the Imperial Governor to control them. However, his threats to execute the witch prisoners failed to tame the spirits of the Nightsisters, who rebelled. Meanwhile, Tyber Zann managed to procure an unknown Sith artifact, eventually revealed to be a Sith holocron, from Jabba the Hutt. After exhausting many sources of information to find the secrets of the Sith artifact, he learned of the Dark Side witches of Dathomir, and how the Emperor feared them so much that he'd interdicted their planet with a fleet of Star Destroyers. In a swift covert strike, Tyber Zann and his lieutenant, Urai Fen, exfiltrated Silri from Dathomir, freeing her, and in return, she promised to unlock the holocron."}, {"tag": "h3", "text": "An uneasy alliance"}, {"tag": "p", "text": "This alliance was only transitory. Even before Zann and Urai Fen rescued her and took her off planet, they began to distrust her. Later, she claimed to have decoded the holocron and that it was merely a star map, showing systems that had been mapped centuries ago."}, {"tag": "p", "text": "When Zann took a fleet to Carida to sell the artifact to an Imperial connection he was promised by Prince Xizor, the holocron that Silri was attempting to unlock was stolen by the Empire's tactical genius Grand Admiral Thrawn, when Bossk, a bounty hunter purportedly working for the Consortium, betrayed his employers. However, this was arranged by the crafty Zann, who ordered his fleet not to fire on Bossk. Silri was angry at this outrage, as the artifact could be of greater value than some star charts. Tyber suspected she knew something she was not telling him and demanded to know what. She revealed that the artifact could lead to somewhere else. Tyber warned her that if she ever lied to and betrayed him, he swore to wipe the Nightsisters and rancors from the face of the galaxy -- with a standing order that would go on even if he died."}, {"tag": "p", "text": "Later, Zann took Fen and Silri to raid Emperor Palpatine's private vault on Coruscant. Zann's main goal was to find the pass key to the Emperor's files, to access the locations of the credit-filled Imperial vaults. But Silri, contrary to plan, skirted her duty to guard the transport and stole the artifact, fighting off three generations of Dark trooper models. Intending to run off with it herself, she met up with Zann and Urai and was forced to go along with them. The small group encountered many Royal Guards and finally battled a Dark Jedi. Fortunately, Zann had a ysalamir with him and the Dark Jedi was killed. A Juggernaut was hijacked aiding the quartet in their escape."}, {"tag": "p", "text": "On the way back from the narrow escape from Coruscant, Silri sensed the deaths of Emperor Palpatine and Darth Vader at the Battle of Endor, and informed Zann about it. Deciding it was time to steal the Eclipse, Zann launched a massive assault on Kuat. Silri was present in the boarding party which overtook the Eclipse. Soon after the massive battle was over, with Zann's forces victorious."}, {"tag": "h3", "text": "The Sith army"}, {"tag": "p", "text": "As they pilfered the accounts of the Empire, Silri managed to decode the rest of the holocron and then vowed to show Tyber Zann the \"true meaning of power\". Silri followed the holocron's clues, which led her to an unknown system where the witch discovered what appeared to be the remains of an ancient Sith army, frozen in carbonite."}, {"tag": "h2", "text": "Personality"}, {"tag": "p", "text": "Silri had a very violent personality, often threatening others with death when something did not go her way. She was often at odds with the Zann Consortium's second in command, Urai Fen, and both often threatened to kill the other. She had a slightly better relationship with Tyber Zann himself, although neither of them exactly trusted each other."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Silri was a powerful Nightsister, often using a lightwhip in battle. She was also capable of calling her rancor companion Cuddles to help her in battle. Unlike other nightsisters, she did not ride a rancor mount, instead she traveled by foot with Cuddles beside her."}, {"tag": "p", "text": "She could also drain the life from other beings in the area, increasing her own being in the process."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Silri was voiced by Kari Wahlgren."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}