{"url": "Silver_Crescent", "categories": ["Category:Legends articles", "Category:Galactic Republic awards"], "nodes": [{"tag": "h1", "text": "Silver Crescent"}, {"tag": "p", "text": "The Silver Crescent was an award given out by the Galactic Republic for serving with merit around the time of Great Galactic War. Republic General Elin Garza received the Silver Crescent for her actions in the war against the Sith."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Silver Crescent was either a medal or honorary citation that was awarded by the Galactic Republic for serving with distinction during the time surrounding the Great Galactic War against the resurgent Sith Empire."}, {"tag": "h2", "text": "Notable Recipients"}, {"tag": "h3", "text": "Garza"}, {"tag": "p", "text": "Serving as a general in the Republic Military during the Great Galactic War, Garza was a Human female from Coruscant. During the war, Garza was a brilliant strategist and performed with excellence, helping form and train the Republic's new Special Forces Division. Despite Garza's efforts, the Republic lost the war following the Sacking of Coruscant and the Treaty of Coruscant in 3653 BBY. For her deeds during her career, Garza was awarded the Silver Crescent, as well as several other medals and citations. However, in the uneasy peace between the Republic and Sith Empire that followed the Great Galactic War, General Garza became a controversial figure, developing into a political rival of Republic Supreme Chancellor Dorian Janarus."}, {"tag": "p", "text": "The Major of Havoc Squad was awarded after the Silver Crescent in the aftermath of Battle of the Gauntlet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Silver Crescent's only mention in Star Wars canon was in General Garza's in-universe entry in The Holonet on the Star Wars: The Old Republic official website. In the entry, the Silver Crescent is listed under the medals and citations Garza received in her career, but the entry does not specify whether the Silver Crescent was a either a medal or a citation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}