{"url": "Bao-Dur%27s_remote", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Droids of the Jedi Order", "Category:Second-degree droids"], "nodes": [{"tag": "h1", "text": "Bao-Dur's remote"}, {"tag": "p", "text": "Bao-Dur's remote was a droid remote that was built by the Zabrak when he was a youngling. It was programmed to follow Bao-Dur wherever he went. Bao-Dur upgraded it several times over the years, arming it with a laser that could both repair other droids (such as HK-47, G0-T0, and T3-M4) and damage enemies. G0-T0 developed an instant dislike of the Remote for unexplained reasons (possibly because he saw the Remote as being \"inefficient\" with its resources). When Meetra Surik went to Malachor V, Bao-Dur had preprogrammed his Remote to search for the Mass Shadow Generator, Bao-Dur's old invention from the last battle of the Mandalorian Wars that had the power to destroy Malachor V. Bao-Dur had programmed his Remote to activate the Mass Shadow Generator again using the engines of ships crashed on the surface during the Battle of Malachor V a decade before, so that his invention could destroy the planet. G0-T0, not wanting Malachor V to be destroyed, held the Remote hostage, having covertly reprogrammed it. However, HK-47 arrived with the HK-51's series assassin droid and destroyed G0-T0. Once Surik killed Darth Traya, she sent the order to Remote to destroy the planet. Surik and her companions escaped in the Ebon Hawk right before the planet pulled itself apart, but the Remote had to remain behind to activate the device and was presumably destroyed in the process."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bao-Dur's Remote's standoff with G0-T0 on Malachor V was supposed to have been longer, with them being interrupted by HK-47 and the HK-51s. Depending on the alignment of Surik, HK would either have destroyed G0-T0 himself or he would blast the Remote. The ending where HK-47 and the HK-51's destroyed G0-T0 was later made canonical by The New Essential Guide to Droids."}, {"tag": "p", "text": "At Peragus, during a comm transmission from Atton Rand, Surik has the option to mention the maintenance droids as sensor balls. After this is chosen Rand will say his dialogue, but instead of showing a maintenance droid, it will show a remote like Bao-Dur's. The training remotes on board the Ebon Hawk during the prologue also match it in appearance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}