{"url": "Simikarty", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Authors", "Category:Individuals of unspecified species", "Category:Jedi High Council members", "Category:Jedi Masters of the Jedi Order", "Category:Males", "Category:Philosophers"], "nodes": [{"tag": "h1", "text": "Simikarty"}, {"tag": "p", "text": "Simikarty was a Jedi Master of the Old Republic era."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Jedi Master of some renown, Simikarty produced a set of extremely influential writings about the Jedi Code. Part of these texts were the beliefs that Masters should be limited in their number of apprentices and that under no circumstances could Padawans over a certain age be taken. Over the years, Simikarty's interpretations began to be accepted as canon by the Jedi Order. Additionally, Simikarty's writings ended the Order's exploration of cloning technologies, causing all clone experimentation to be abandoned."}, {"tag": "p", "text": "Following extensive research of the Jedi Order during the time of the Pius Dea Era, Simikarty uncovered lost histories detailing the High Council's collusion with the Pius Dea adherents and their silent approval of the removal of Supreme Chancellor Pers'lya and the installation of Aldon Contispex as head of the Republic. Additionally, Simikarty reviewed the creation of the splinter group, the Order of the Terrible Glare and the High Council's actions in the Garn Conflict to ensure that the Terrible Order was destroyed. Presenting these findings to the High Council, of which he was a member, Simikarty proposed that the Order prohibit the training of adult apprentices, as it was Carel Kapekos' deeply-held religious convictions from before joining the Order which caused him to leave the Order in protest."}, {"tag": "p", "text": "Secondly, Simikarty argued that the High Council's admonishment of married Jedi having children should be strictly enforced, despite outcry by some members of the Order as a preeminent strike against the formation of Jedi dynasties. Suggesting that a Jedi should only know the Temple, the Code, and their Master and peers, Simikarty believed that children under the age of three would be ideal candidates for training. Noting that the Galactic Senate would need to be convinced of the righteousness of these ideas, Simikarty suggested that the High Council work to change the public perception of the Order and propagandize Jedi service as a great honor for children. Because the government of the era was not completely aware of the Order's empowering of the Pius Dea or of the Garn Conflict, Simikarty advised the Council to seal the records and prevent the mistakes of the past jeopardize the Order's future."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}