{"url": "Sinan_Mat", "categories": ["Category:Legends articles", "Category:Males", "Category:Yuuzhan Vong officers", "Category:Yuuzhan Vong"], "nodes": [{"tag": "h1", "text": "Sinan Mat"}, {"tag": "p", "text": "Sinan Mat was a member of the warrior caste of the Yuuzhan Vong. A field commander, Mat was dispatched into the jungles of Yavin 4 in 26 ABY in order to search for fugitive Jedi who had escaped the destruction of the Jedi Praxeum. Put on to the trail of Anakin Solo, after the young Jedi had downed a tsik vai scout craft over the forests, Sinan Mat led his warriors on an extensive search pattern, with orders to capture the Jedi once they encountered him."}, {"tag": "p", "text": "Unfortunately for the field commander, Solo's powers and communion with the familiar jungles of Yavin 4 gave him a great advantage when Sinan Mat and his party caught up with the Jedi. Having wounded the young Human, Mat was preparing to take Solo back to the Yuuzhan Vong base when a swarm of piranha beetles, summoned by Solo through the Force, fell upon him and his fellow warriors and rapidly stripped the flesh from their bones."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born into the warrior caste, Sinan Mat had risen to the rank of field commander by the time of the Yuuzhan Vong War. Assigned to the invasion of Yavin 4 in 26 ABY, Mat was subordinate to Commander Tsaak Vootuh, who had presided over the destruction of the Jedi Praxeum and the creation of a Yuuzhan Vong base upon the planet's surface. Although one Jedi, Tahiri Veila, had been captured by the shapers who were to undertake the project of twisting Force-sensitives to the purpose of the Yuuzhan Vong, another, Anakin Solo had escaped the Peace Brigade forces who had first assaulted the planet and was active in the wilderness surrounding the Yuuzhan Vong base."}, {"tag": "p", "text": "When the Jedi had a run in with a tsik vai and brought it down with his lightsaber, Sinan Mat and many other warriors were dispatched into the dense jungles to locate and capture the fugitive Solo, in order to return him to the shapers. Beginning a search pattern which expanded methodically from the site of the destroyed tsik vai, the field commander led a large group of warriors, who either separated into pairs, manned tsik vai or went out alone to find the Jedi. Three days after the destruction of the tsik vai, Solo was spotted, some twenty kilometers from the base, and Sinan Mat and his warriors closed in upon the Jedi. Although Solo managed to incapacitate several of the lone warriors who found him, Mat was able to hit the Jedi in the back with a nang hul, bringing the young Human down to the forest floor. Quickly, Sinan Mat and the other warriors closed in on the downed Jedi, and prepared to take him back to the damuteks. Equipped with a tizowyrm, Mat was able to announce in Basic his respect for the Jedi, and reluctantly turned down a duel with Solo, aware of his orders to return the fugitive alive."}, {"tag": "p", "text": "As Sinan Mat and the Jedi talked, Solo used the Force to summon a swarm of nearby piranha beetles which had been feasting in the jungle. Momentarily distracted by the tizowyrm's failure to translate the word \"forgive\", Mat and his fellow warriors were caught off-guard by the arrival of the deadly piranha beetles. The ravenous swarm devoured the field commander's face in an instant, and he died shortly thereafter."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although respectful towards Anakin Solo's prowess as a warrior, Field Commander Mat knew better than to disobey the orders of the shapers; thus he refused the tempting challenge of a duel. He also regretted the manner by which Solo had been brought down, mindful that close-quarters combat, rather than the use of a nang hul, would have been the more honorable way to incapacitate the Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sinan Mat has only a brief appearance in Greg Keyes's The New Jedi Order: Edge of Victory I: Conquest, as he is killed moments after his introduction."}, {"tag": "h2", "text": "Appearances"}]}