{"url": "Simon_Greyshade/Legends", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Administrators", "Category:Galactic Republic senators", "Category:Humans", "Category:Imperial Senators", "Category:Males"], "nodes": [{"tag": "h1", "text": "Simon Greyshade"}, {"tag": "p", "text": "Simon Greyshade was a Human male Senator who represented Columex and the Vorzyd sector in the Galactic Senate of the Republic in the years immediately prior to the Clone Wars. He was remembered as one of the few neutral Senators to flourish during the conflict, and in 19 BBY he supported the Galactic Empire during the declaration of the New Order. He retired shortly afterwards to take control of the Wheel, a luxury gambling resort."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Senate career"}, {"tag": "p", "text": "In 23 BBY, he was elected to replace his cousin, Senator Jheramahd Greyshade, who had been assassinated in an attempt to stall passage of the Financial Reform Act."}, {"tag": "p", "text": "During the waning days of the Galactic Republic, Greyshade was considered one of the most corrupt members of the Galactic Senate, and he enjoyed every minute of his term and the perks of holding the office. When not in the Senate, he would drive across the skies of Coruscant in his yellow XJ-6 airspeeder, spend time with various female companions, or engage in gambling with fellow senators (he even introduced legislation to legalize gambling in the entire Republic). After fellow Senator Padmé Amidala's assassination attempt, Anakin Skywalker \"borrowed\" the airspeeder to pursue bounty hunter Zam Wesell."}, {"tag": "p", "text": "During the Clone Wars, he would remain as one of the few neutral senators in the Senate. He resigned shortly after the formation of the Galactic Empire and took over the administration of a gambling resort known as The Wheel in 18 BBY. Prior to his resignation, he was part of the committee that expelled Mako Spince from the Imperial Academy."}, {"tag": "h3", "text": "Wheel administrator"}, {"tag": "p", "text": "The Wheel instantly made Greyshade a very wealthy man, mostly due to its exemption from any Imperial law or interference. Greyshade had been able to make this arrangement by making the \"generous\" offer that the bulk of The Wheel's tax profits would pay for the Empire's military funding. While serving as administrator, Greyshade insisted on being addressed as \"Senator\" even after the Senate itself had been abolished."}, {"tag": "p", "text": "During the Galactic Civil War, the Millennium Falcon was pursued to The Wheel by the relentless Imperial Commander Zertik Strom. Much to Greyshade's displeasure Strom ordered Imperial stormtroopers onto the gambling station to search for the Falcon's fugitive crew. He claimed that they had attacked a House of Tagge merchant ship carrying profits from The Wheel. Greyshade relented but allowed an Imperial presence only on the lower levels, keeping the distraction away from the paying customers on the upper levels."}, {"tag": "p", "text": "As Greyshade's security cameras tracked the fugitives on board, he discovered that one of the Falcon's passengers was Leia Organa, an old colleague from the Senate and an unrequited love of his. He sent his Wheel Security Force to free her from the stormtroopers and bring her to his suite. There, Organa revealed to Greyshade that the hijacking of the House of Tagge ship had only been made to look like the Rebels' work and that in fact it was the Empire who had been behind it. The Empire had framed the Rebels as part of a plan to justify a military takeover of the Wheel which was currently an independent operation."}, {"tag": "p", "text": "As Organa was convincing Greyshade of the truth, Strom suddenly arrived at his suite. The two men had always hated each other and Strom announced that the fact that Greyshade was harboring an enemy of the state was grounds enough to kill him. But before he could carry out his threat he was disarmed by Master-Com, the main computer running the Wheel. Greyshade then arranged a deal with Strom where he would not reveal the truth behind the attack of the merchant ship and ensure that all the Rebels would be killed on The Wheel. In exchange Leia Organa would be allowed to remain there with him."}, {"tag": "p", "text": "And so Greyshade set up events so that Han Solo and Chewbacca would face each other in The Big Game, and that the hospitalized Luke Skywalker would not recover from his coma-like state. The droids C-3PO and R2-D2 were also taken by The Wheel and scheduled to have their memories flushed, yet Master-Com released them because he was curious about their relationship with their master, Luke Skywalker."}, {"tag": "p", "text": "But all did not go according to plan as Leia escaped from Greyshade's suite and reunited with Luke who had now recovered from his sickness and escaped from the medical center. In the meantime, Greyshade had double-crossed his Imperial partner by sending his Wheel Security Force aboard Strom's Pursuit-class light cruiser to retrieve the stolen Wheel profits and load them onto his own personal space yacht. He then drugged the Imperial Commander and planned to make a clean escape with the treasure when he caught Leia and Luke along the way. He urged Leia to leave with him in his yacht, promising to allow all of her friends to go free in return. Believing Han Solo to have been killed in The Big Game, a distraught Leia accepted his offer."}, {"tag": "p", "text": "Strom recovered and ordered his stormtroopers to kill the Rebels and his traitorous partner, and they soon had the fugitives pinned down. Luke volunteered to stay behind to cover their escape, but Greyshade was tired of being upstaged by Luke's bravery and had also gained a new-found affection for his droid Master-Com. He decided that he would stay behind and let the Rebels escape in his yacht. They did, yet Greyshade was injured in the standoff with the stormtroopers. Strom finally caught up with the wounded Greyshade and intended to murder the traitor, but Greyshade tossed a proton grenade in the Commander's direction, killing him. However, both Greyshade and Master-Com were caught in the blast and fatally wounded as a result."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}