{"url": "Singing_stone", "categories": ["Category:Canon articles", "Category:Wookieepedia Good article nominations", "Category:Crystals"], "nodes": [{"tag": "h1", "text": "Singing stone"}, {"tag": "p", "text": "Singing stones were crystals that formed a small fountain used for Jedi Grand Master Yoda's meditation and contemplation purposes. Producing soft sounds as water flowed over them, the stones' music was found to be deeply soothing by the Jedi Master Obi-Wan Kenobi. However, the singing stone fountain's effects on Kenobi were diminished by the Jedi's worries for his fellow Master and friend, Quinlan Vos, when the latter disappeared during his mission to assassinate the Sith Lord Dooku in 19 BBY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Singing stones were crystals that emitted soft sounds under the flow of water. They formed a small fountain kept by the Jedi Order's Grand Master Yoda at his quarters at the Jedi Temple on Coruscant, the capital planet of the Galactic Republic. Jedi Master Obi-Wan Kenobi usually found the music emanating from the fountain deeply soothing and noted that it resembled sounds between that of a chime and a stringed instrument."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 19 BBY, when he was summoned to be counseled by Yoda at the latter's quarters, Kenobi found the Grand Master sat by a singing stone fountain as per usual, although Yoda was regarding the fountain's flow in the Force instead of meditating. Kenobi was concerned about the wellbeing of his fellow Jedi Master and friend, Quinlan Vos, who recently went incommunicado during his mission to assassinate the Sith Lord Dooku. As such, even the combined influence of the stones and the similarly soothing scent of special oils heated over small flames in Yoda's quarters failed to alleviate Kenobi's sense of worry."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Singing stones appeared in the 2015 novel Dark Disciple, written by Christie Golden. The novel adapts an unfinished eight-episode story arc for the Star Wars: The Clone Wars television series which was written by Katie Lucas, Matt Michnovetz, and Dave Filoni."}, {"tag": "p", "text": "Later, through the 2011 massively multiplayer online role-playing game Star Wars: The Old Republic's Update 4.1, which was released by BioWare in 2016, the stone was introduced to the Star Wars Legends continuity as the Singing Stone, which was pictured as a maroon gemstone."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}