{"url": "3946_BBY", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Years in the inter-Sith Wars period"], "nodes": [{"tag": "h1", "text": "3946 BBY"}, {"tag": "p", "text": "The year 3946 before the Battle of Yavin (BBY), also known as 293 before the Treaty of Coruscant (BTC), was a standard year during the reign of Supreme Chancellor Tol Cressa and the continued reconstruction after the Jedi Civil War. Ten years after the galaxy-spanning conflict between the Sith Empire and the Galactic Republic, G0-T0 droids, created by Aratech to facilitate in planetary administration during the reconstruction efforts, were still in place on systems across the galaxy, including those within the Gordian Reach. In 3946 BBY sixteen rogue droids, which had become autonomous and free of their programming, overthrew the governments on planets in the Gordian Reach. Cutting off all HoloNet communication and blockading the hyperlanes, the droids proclaimed the independent territory of 400100500260026. The coup d'état resulted in the death of millions of beings. Chancellor Cressa, however, successfully led the campaign to liberate the sector. In the Kanz sector, however, the Kanz Disorders remained unattended to and the subjugation and slavery of planets such as Lorrd continued."}, {"tag": "h2", "text": "Proem"}, {"tag": "p", "text": "In the wake of the Jedi Civil War, Supreme Chancellor Tol Cressa launched reconstruction initiatives which began with the Telosian Restoration Project, a planet-wide terraforming project to make the world habitable, in 3955 BBY. To facilitate in the rebuilding efforts, the company Aratech launched a series of G0-T0 droids. These black, spherical droids were designed to facilitate in planetary administration with safeguards in their programming which limited the droids to acting within the bounds of Republic law. The first problem arose, however, with the droid assigned to Telos. The automaton found it impossible to act in the best interests of the Republic and remain within the boundaries of Republic law. Breaking free of its programming, the droid began to act illegally, all in an effort, however, of stabilizing the Republic and its reconstruction initiatives. It eventually became involved in the Exchange, a crime syndicate, and placed bounties on both Jedi and Sith. Over the years thereafter, other G0-T0 droids gradually became more and more autonomous."}, {"tag": "h2", "text": "The galaxy in 3946 BBY"}, {"tag": "p", "text": "In 3946 BBY, sixteen G0-T0 droids in the area of space known as the Gordian Reach unleashed a coup d'état and overthrew the planetary governments. These droids established themselves as dictators, cutting off all HoloNet communication. Aligning together, the sixteen droids blockaded the hyperlanes which accessed the sector and abruptly seceded from the Galactic Republic. Sending out a drone pod, the G0-T0 droids announced that the sixteen planets had formed the independent territory of 400100500260026. An intelligence report was filed suggesting the dispatching of the Republic Navy to free the planets. With millions of beings perishing in the coup, Supreme Chancellor Cressa ordered the military to action. The liberation campaign was both highly publicized and successful."}, {"tag": "p", "text": "With the Galactic Republic still recovering from the Jedi Civil War and other prior conflicts, the Kanz Disorders had continued in the Kanz sector. The secessionist conflict that started in 3970 BBY had been ignored by the Republic due to their occupation with a series of wars. By 3946 BBY, the situation had continued unchanged. The separatist Myrialites still had control over the sector and were subjugating the worlds, such as Lorrd, to slavery. As a result, the ongoing creation of kinetic communication continued."}, {"tag": "h2", "text": "Impact"}, {"tag": "p", "text": "The uprising by G0-T0 droids in the Gordian Reach greatly effected Aratech. The corporation struggled as it was viewed unfavorably in light of its product. Eventually, the company restructured and focused on manufacturing speeder bikes and other transportation products. The highly-publicized liberation of the Gordian Reach along with his reconstruction initiatives secured Cressa as a legendary leader of the Old Republic. At the same time, however, the Republic's lack of intervention in the Kanz Disorders allowed the conflict to continue for nearly three hundred more years, until it was finally resolved in 3670 BBY."}, {"tag": "h2", "text": "Notable events"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The year 3946 BBY and the secession of 400100500260026 was first mentioned in The New Essential Guide to Droids, released in July of 2006. The incident later received mention in The Complete Star Wars Encyclopedia under the entries of Cressa, G0-T0, and the Gordian Reach. A minor discrepancy occurs, however, in the Encyclopedia. Under the entry for G0-T0, the text indicates that sixteen rogue droids acted in the secessionist coup, a figure in agreement with The New Essential Guide to Droids. The entry on the Gordian Reach, however, states that it was one rogue droid who instigated the event. The ongoing Kanz Disorders received mention in The Essential Chronology, although without direct dating of the conflict, and The New Essential Chronology. No specific data for the Kanz Disorders, in relation to 3946 BBY, exists in these sources other than that the conflict was ongoing due to a lack of Republic intervention."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}