{"url": "Bar_Neth", "categories": ["Category:Legends articles", "Category:Albarrio sector planets", "Category:Desert planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Bar Neth"}, {"tag": "p", "text": "Bar Neth (also spelled Bar-Neth) was a former desert planet located in the Bar Neth system, a quinary star system positioned in the Albarrio sector of the galaxy's Outer Rim Territories. By the year 4.3 ABY, Bar Neth had been turned into a \"Natural Wonderland\" with bountiful farmlands. As a result of its ambitious terraforming process, Bar Neth was considered pleasant to live in and was hugely apealing for galactic tourists. At that time, trips to Bar Neth were organized by the Star Tours travel agency as part of their Frontier Vacation Package."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Bar Neth was a planet located in the Bar Neth system, a quinary star system positioned in the Albarrio sector of the galaxy's Outer Rim Territories. Its landscape consisted of wide, ochre-colored cliffs, bluffs and canyons. However, following an ambitious desert reclamation process, flora was introduced in the planet's environment."}, {"tag": "p", "text": "Subsequently, nature reclaimed its rights over the planet's ecosystem. Many wild cacti grew on Bar Neth, and vast groves of cultivated fruits spread throughout the land, overflown by harvesting machines and airborne lifters. Occasional round desert houses were also scattered across the planet's surface. In its terraformed state, Bar Neth was regarded as a \"Natural Wonderland\" and an attractive place to live in. The climate on Bar Neth remained hot, with temperatures as high as 38° centigrade. Even after its terraforming, Bar Neth's surface was also subject to local dust storms, which could reduce visibility to at least two kilometers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally, Bar Neth was a complete wasteland devoid of lifeforms. However, at some point before the rise of the New Republic, a massive arid-zone agriculture project was launched, and a vast number of labor droids worked hard to change Bar Neth into a green planet with lush vegetation. As a result of the new flora and relaxing environment, Bar Neth became one of the most popular family resorts in the galaxy. Popular stops and activities on the planet included the Carl Hodgesville Dude Ranch, various camping and safaris sites, and a zero-gravity golf course."}, {"tag": "p", "text": "By the year 4.3 ABY, the Star Tours interplanetary travel agency organized trips to Bar Neth as a part of its Frontier Vacation Package. That package was notably advertised in the company's spaceports through a video display device known as the \"Tourscan,\" for which the droid announcer Dan Android would provide narration."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bar Neth was introduced in the Tourscan by Dan Android at the Tokyo Disneyland Star Tours. The location and footage was in actually recycled from one of the locations from the now-defunct Epcot dark ride attraction Horizons, specifically the Mesa Verde ending segment of the ride. Mesa Verde, the segment of Horizons that the clip originated from, focused on the concept of arid-zone agriculture, even going as far as to give a smell of fresh oranges at one segment of the ride."}, {"tag": "p", "text": "The models for the three ending segments of Horizons were designed, constructed and filmed by none other than David Jones, a special-effects veteran of Star Wars: Episode IV A New Hope. According to Jones, the desert film involved an 86-foot model and was the longest continuous sequence ever done with miniatures. In addition, to save up on the budget, the set only had one house developed. In the original Horizons ride, the plant groves being harvested were laorange trees, also known as long orange trees."}, {"tag": "p", "text": "The Star Tours attraction mentioned the \"Carl Hodgesville Dude Ranch,\" which was named after Carl Hodges, director of the Environmental Research Lab at the University of Arizona. He helped the team working on the Mesa Verde segment create a futuristic, yet plausible, environment. Hodges' research aim at creating vast saltwater irrigated farms along the world's desert coasts."}, {"tag": "p", "text": "Although the name of the planet was spelled both as \"Bar Neth\" and \"Bar-Neth\" on different screens of the Tourscan, Lucasfilm specifically requested that the unhyphenated version be used in Star Wars: The Essential Atlas Online Companion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}