{"url": "Singing_Mountain_Clan_Fortress", "categories": ["Category:Legends articles", "Category:Buildings", "Category:Dathomir locations"], "nodes": [{"tag": "h1", "text": "Singing Mountain Clan Fortress"}, {"tag": "p", "text": "The Singing Mountain Clan Fortress was a fortress stronghold near the summit of the Singing Mountain on the Outer Rim world of Dathomir."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The fortress had massive gates that led to a broad plaza inside the enclosure. The buildings were no taller than three stories.  A roundhouse was located straight across the plaza that seemed to act as an official greeting center. The roundhouse had a conical, twwo-story roof that was supported by huge columns carved from native tree trunks and capped with metal-clad ornamentation. Each column was adorned with a medallion of working metal that bore the sigil particular of a neighboring tribal or clan group. The roundhouse had a second-floor balcony that ran the entire circumference of the roundhouse. At the top of the stairs, ran away from each other. One hallway led to a large chamber with walls of reddish stone and a central hearth whose fire burned bright and warm, but consumed no fuel. The chamber had a wide, padded chair hewn from the same native stone as the slab and bricks that made of the walls and the floor."}, {"tag": "p", "text": "The fortress was said to be hammered with everywhere around the patchwork of blast shielding the rock was cracked and pounded. Chunks of red sandstone lay scattered on the walkways outside. The dark chambers of the fortress were honeycombed with halls and stairways. The walls were covered with thick tapestries and lit by sconces. A room was carved into the corner of the fortress so that windows opened on two sides. The huge room was nearly triangular in shape, with six openings looking out to the prairie. Blaster rifles lay stacked near each window, flak jackets had been tossed in piles on the floor, and a solitary blaster cannon poked out toward the mountains to the east. A huge dent showed where something had smashed its housing, so that green liquid coolant lay puddled beside it on the floor. The cannon was useless. In the center of the room a cooking pit was filled with bright embers. A large animal roasted above the coals while two men basted it with a pungent sauce and turned the spit. The fortress had a stone table used to prepare corpses that led to a flight of gray steps, past a woven mat that bore the image of a clan sister in yellows and white, holding a war spear. Beyond it was the warriors' hall, a room where commoners, those without the spellcasting ability or mere apprentices were never allowed entrance, no matter if their mother had been war leader, no matter what their level of talents. One of the drafty stairs led up to a large sleeping chamber with an opening that led from the room out to a stone parapet overlooking the valley. The room itself held dozens of straw beds spread out on the floor, covered with heavy blankets. Th fortress had a maze of stone passageways up six flights of stairs. One huge cavelike room was used as a hanger for starships.  The cavelike room had no large openings and several huge stones had been cracked on the far side. Teneniel's room was a small chamber that held a single mattress and a trunk. A large mirror made of silver sat on one wall, with a sink beneath it. The War Room had a huge map on the floor, molded of clay and painted."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}