{"url": "Sinton", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Rago sector planets"], "nodes": [{"tag": "h1", "text": "Sinton"}, {"tag": "p", "text": "Sinton was a planet of the Mid Rim region that was situated along the Rago Run hyperlane and was home to a non-Human populace. The Galactic Empire's Subjugation of Sinton conquered the planet and enslaved the non-Human denizens."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Sinton was located in the Mid Rim region of the galaxy, within the Sinton system of the Rago sector. The planet lay along the Rago Run hyperlane, near the edge of the Unknown Regions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sinton succumbed to Imperial subjugation at some point during the Galactic Empire's reign of the galaxy, one of many such Imperial atrocities committed against non-Human worlds. The Empire then used Sinton's alien populace as slave labor."}, {"tag": "p", "text": "By the year 12 ABY, the boastful Human male Sulamar, a fraudulently self-titled Imperial general, claimed to have participated in the Subjugation of Sinton, among many other purported military conquests—some nonexistent. In reality, Sulamar was a low-level Imperial technician with a failed military career."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Sinton was populated by non-Humans, whom the Empire conscripted into slave labor following the planet's Imperial conquest."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sinton was first mentioned in the 1995 novel Darksaber, written by Kevin J. Anderson, in which the character Imperial General Sulamar alleges to have played a part in the Subjugation of Sinton. Sulamar's claim is later called into doubt once he is exposed as a fraud. Sinton's subjugation was subsequently elaborated upon through the 1997 Dagobah Limited expansion set of the Star Wars Customizable Card Game and the 2009 reference book The Essential Atlas, the latter of which provided the planet with astrographical data."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}