{"url": "Sinkar_(species)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Colonies species", "Category:Gastropod sentient species"], "nodes": [{"tag": "h1", "text": "Sinkar  (species)"}, {"tag": "p", "text": "The Sinkars were a species of helium-based slugs native to the planet Sinkar. They survived on solar energy and impurities extracted from the planet's surface. Galactic rumors conflicted as to the exact nature of the Sinkars—some claimed that the slugs were telepaths of great strength who communicated wisdom accumulated over a long lifetime. Others claimed they were mindless creatures, capable of sucking energy from other beings or starship drives."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Sinkars were a helium-based species of slugs. They resembled huge black amoebas slowly oozing across the surface of their planet, Sinkar. They extracted impurities in the snowy oxygen layer that covered the planet, and they utilized solar energy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sinkars evolved on the planet Sinkar, located in the Lawreys system of the Fakir sector. The planet was at the outer extreme of its star system, and, as a consequence, it was frigid, with its oxygen frozen on the surface. Although that rendered the high-gravity world inhospitable for conventional life, it did give rise to the helium-based Sinkars."}, {"tag": "p", "text": "Conflicting rumors abounded in the galaxy as to the exact nature of the Sinkars. According to some opinions, the beings were long-lived, amassing great wisdom over the course of their lifetimes. Slow and ponderous thinkers, the Sinkars were rumored to communicate their thoughts telepathically to those who were patient enough. Other theories claimed the Sinkars were mindless creatures, capable of sucking energy directly from a starship's drives—or even from another sentient."}, {"tag": "p", "text": "During the Galactic Civil War, the Galactic Empire established a garrison outpost on the Sinkar homeworld, although they did not disclose the purpose of this installation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sinkars were created by Paul Murphy for the roleplaying game sourcebook Star Wars Campaign Pack, published by West End Games in 1988. The information on the Sinkars was presented as competing rumors with none definitively confirmed. The section featuring the Sinkars was later republished in Classic Campaigns in 1994, albeit in an abridged form."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}