{"url": "Sio_Bibble/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Pages needing citation", "Category:Galactic Republic governors", "Category:Humans", "Category:Legislators and councilors", "Category:Males", "Category:Naboo", "Category:Naboo Underground", "Category:Philosophers"], "nodes": [{"tag": "h1", "text": "Sio Bibble"}, {"tag": "p", "text": "Sio Bibble was the Governor of Naboo and the head of the Royal Advisory Council. At first, he served under King Ars Veruna, and was highly critical of the young woman touted to succeed him: Padmé Amidala. When Veruna eventually decided to abdicate, however, Bibble was instrumental in preparing Amidala as his successor. In time, he changed his opinion of her, and became one of her staunchest supporters. Some time into her reign, Station TFP-9, on the outer edges of the Naboo system, was attacked by a pack of Agamari pirates. Despite interfacing with the Agamari government in the wake of the attack, Bibble was unable to verify their involvement, although he did learn that they had been hoping to steal several of the Naboo Royal Space Fighter Corps' N-1 starfighters."}, {"tag": "p", "text": "The following year, Naboo was blockaded by the Trade Federation, who were protesting the Galactic Senate's new taxation of trade routes. Captain Quarsh Panaka, the head of Amidala's security, called for an increase in Naboo's armament, but Bibble disagreed with him vehemently. In due course, the Federation went so far as to invade the planet, arresting Bibble and the Queen. While Amidala was able to escape with the aid of two Jedi Knights, the governor elected to stay, and speak for his people. He led them in a hunger strike, and earned the ire of the Trade Federation Viceroy, Nute Gunray. Eventually, Amidala returned, and, allying herself with Boss Rugor Nass of the Gungans, was able to defeat the Federation, and free the planet. Bibble continued to serve Amidala's successor, Queen Jamillia, up until the Clone Wars. During that pan-galactic conflict, Jamillia was succeeded by Neeyutnee and her by Apailana, under both of whom Bibble also served."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Governor"}, {"tag": "p", "text": "A native of Naboo, Sio Bibble spent much of his adult life teaching philosophy at one of the planet's foremost universities. He was later elected Governor of Naboo during the reign of King Ars Veruna. He was also head of the Naboo Royal Advisory Council, and a member of the Naboo Governing Council. In his capacity as governor, Bibble oversaw all matters that were to be brought to the King or Queen's attention. As head of the Advisory Council, Bibble would deal directly with regional representatives, and governing officials from the towns in their day-to-day administration. Bibble was highly critical of Veruna, especially when the King fell under the influence of the planet's representative in the Galactic Senate, Senator Palpatine. Even more concerning to Bibble was the fact that Veruna's policies started to concern the galaxy at large, and away from Naboo specifically."}, {"tag": "p", "text": "In his official capacity, Bibble appeared with Padmé Amidala, Princess of Theed, at a public appearance on the steps of the Theed Royal Palace. He did not, however, support her in her campaign to be elected as the planet's ruler. Despite Bibble's opposition, as soon as King Veruna prepared to abdicate, the governor helped prepare Amidala to succeed him. As he and others groomed the princess for her coronation, a young man, Ian Lago, son of Veruna's advisor Kun Lago, confronted Amidala and told her that he loved her. Bibble, however, had to ask Lago to leave, repeatedly, as the coronation approached. The man was eventually ejected from the room. That night, Veruna formally abdicated, and the next morning, Amidala was elected Queen of Naboo. Bibble was kept as Governor of Naboo, due to his political experience and his famed intellect. The governor's opinion of Amidala changed as she ruled the planet, and he eventually became one of her strongest supporters."}, {"tag": "h3", "text": "The incident at Station TFP-9"}, {"tag": "p", "text": "In 33 BBY, Station TFP-9, located in the outskirts of the Naboo system, fell under attack by a band of what was assumed to be pirates. Bibble sat in as a Security Officer briefed the pilots of Echo Flight and Bravo Flight, who were to be dispatched to stop the attackers from destroying TFP-9. Bibble personally wished the pilots good luck before they departed. During the subsequent battle, seven of Echo Flight's pilots were killed, and one of the Naboo pilots, Dren Melne, turned on his compatriots. Apparently, Melne had been hired by the Agamari to aid in the capture of at least two of the Naboo Royal Space Fighter Corps' N-1 starfighters. The station was successfully defended however, and Melne was killed by the Agamari forces that had been attacking the station in order to lure out Naboo's fighters."}, {"tag": "p", "text": "Governor Challep of Agamar denied that his people had any degree of involvement in the incident, but Bibble and his people requested that Naboo's senatorial delegation prompt an investigation nonetheless. Bibble and his people learned that the Agamari had been purchasing a variety of weapons and starfighter technology, including vulture droids from Xi Char. Bibble's people had also traced a credit transfer from Melne's Ord Mantell account to his Selton account of one thousand credits, but were unable to verify where the credits had originated. Making matters more complex was the fact that the authorities on Ord Mantell were reluctant to cooperate with Bibble."}, {"tag": "p", "text": "Ric Olié, commander of the Royal Space Fighter Corps, and Bravo Flight leader Essara Till were summoned to Bibble's office five days after the incident, and Olié reported that the Agamari had made three requests to purchase N-1s or N-X Police Cruisers from the Corps, but the Advisory Council had declined each time. Bibble then inquired as to whether there were any connections between the Agamari government and Melne, but Olié conceded that most mercenaries would spend some time in the service of the Agamari. Till, who had once personally served with the Agamari, had nothing to add. Bibble was disappointed with the scant results, and did not look forward to informing Amidala about the lack of developments."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "In 32 BBY, a fleet of Trade Federation cruisers under the command of Viceroy Nute Gunray blockaded Naboo, as a protest against the Senate's new taxation of trade routes. With the planet threatened, Captain Quarsh Panaka, who was in charge of the Queen's security, called for greater armament, but Bibble strongly opposed such measures, as he considered himself a philosopher and a pacifist. Amidala, Bibble and Panaka contacted Palpatine on Coruscant, to inform him of the Federation's actions, and the senator promised them that he would immediately press the Republic to intervene. Supreme Chancellor Finis Valorum reacted by dispatching two ambassadors to Gunray's flagship, the Saak'ak, in the hopes of reaching a settlement. However, when Amidala contacted Gunray after the ambassadors were supposed to arrive, the viceroy claimed that he had met with no such emissaries. Bibble and the rest of the Advisory Council were present when Amidala contacted Senator Palpatine, and inquired as to what was going on. Palpatine was surprised, as he had been assured by Valorum that the ambassadors had already arrived. Before the senator could go on, however, his holographic image faltered, and then disappeared."}, {"tag": "p", "text": "Amidala demanded to know what had happened, and Panaka had one of his subordinates check the palace's transmission generator. Bibble, however, had come to his own conclusion already: that a disruption in communications meant that the Federation was invading Naboo. Amidala was not convinced, and Panaka agreed with her. The Queen insisted that they keep their faith in negotiation, but Bibble was quick to remind her that they had already lost all their capacity for communication. Also distressing to the governor was the absence and possible whereabouts of Valorum's ambassadors. Panaka reminded the Queen that his Security Forces would not be able to repel the Federation's advance, and Amidala insisted that she would not go to war with the aggressors."}, {"tag": "h3", "text": "Occupation of Theed"}, {"tag": "p", "text": "Sure enough, an invasion was in progress, and Gunray's Droid Army swept into Theed. Bibble was arrested, along with Amidala and Panaka. Gunray personally met with them in the palace, and spoke with the group briefly as they were escorted out of the building. Bibble was curious as to how the viceroy would explain the situation to the Galactic Senate, but Gunray was convinced that Amidala would sign a treaty legitimizing the Federation's occupation after she witnessed the suffering of her people. Bibble, Amidala, and Panaka were grouped with the Queen's handmaidens and several Palace Guards, and were to be taken to Camp Four."}, {"tag": "p", "text": "As the group was marched through the streets of Theed, two Jedi and a Gungan leapt in front of them, and the Jedi quickly dispatched the security droids that had been escorting the group. The elder of the two Jedi, Qui-Gon Jinn, urged the Queen and her entourage to move off the streets, and she obliged. Jinn and his apprentice, Obi-Wan Kenobi, were revealed to be Valorum's ambassadors, and Bibble quipped that their negotiations had been somewhat of a failure. Jinn retorted, claiming that they had never been given the opportunity to enter into such negotiations. He insisted that they make contact with the Galactic Republic, but Panaka informed him of the communications disruption. Needing another way to reach the Republic, the group made their way towards Theed Hangar."}, {"tag": "p", "text": "When they reached the hangar, Jinn requested that Amidala accompany him to Coruscant, but the Queen decided that she would stay on Naboo with her people. The Jedi warned her that the Federation would have her killed, but Bibble balked at the threat, insisting that they wouldn't dare to harm her. Panaka agreed, and he pointed out that the Federation needed her to sign the treaty. Jinn, however, felt that the situation was not what it seemed, and that if she were to stay, Amidala would be killed. Bibble, alarmed by Jinn's speculation, came to agree with the Jedi, advising the Queen that the aid of the Galactic Senate was their only hope, and that Palpatine would need aid from her. Amidala was unsure, but one of her handmaidens encouraged her, prompting her to join Jinn in leaving the planet. Panaka and his men departed with her, leaving Bibble to stay in Theed. Several of the guards and the handmaidens remained with him. With his Queen on the run, Bibble took it upon himself to represent his people, and to placate Gunray."}, {"tag": "p", "text": "In an attempt to locate Amidala, the Zabrak Darth Maul—a Sith Lord who was working with the Federation—transmitted a number of faked transmissions that purported to be from Bibble. Once such forged message, which depicted Bibble pleading that the Queen try to contact him and claiming that the death toll from the occupation was reaching \"catastrophic\" levels, was received by Amidala's J-type 327 Nubian royal starship. The ruse was successful and a reply was sent to the transmission, which allowed Maul to trace the ship to the planet Tatooine. Bibble was later re-captured by the Federation forces and he decided to protest the occupation by participating in a hunger strike, and he was soon joined by others. As a result, Bibble was brought before Gunray. The viceroy was growing impatient, and he saw fit to remind the governor of his current predicament. Bibble was defiant, however, lambasting Gunray and declaring that the people of Naboo participated in a democracy. The viceroy responded by having the governor dismissed from his presence. The Queen was unable to find support in the Senate, but when she returned to Naboo, she allied herself with Boss Rugor Nass of the Gungans. He, in turn, had the Gungan Grand Army engage the Federation's forces, and, in a combined effort between the Gungans, the Queen's security forces, and the two Jedi, Naboo was liberated. Gunray was arrested, and several days after the Federation's defeat, Bibble attended the funeral of Jinn, who had died in battle, before participating in a victory parade, helping Amidala present Nass with the Globe of Peace."}, {"tag": "h3", "text": "The Separatist Crisis"}, {"tag": "p", "text": "Although Gunray was taken to the Supreme Court for his actions at Naboo, he retained his position as Trade Federation Viceroy, to Bibble's outrage. In time, Amidala's term as Queen ended, and she was replaced by Jamillia. Bibble continued to serve, and when the Separatist Crisis came to bear, the governor feared that the galaxy would hurtle towards a state of war. Amidala, now serving as Naboo's Senator, returned home in 22 BBY following an attempt on her life by bounty hunters. She was accompanied by a bodyguard, Jedi Padawan Anakin Skywalker, and the pair of them met with Jamillia and Bibble in the throne room. Bibble, Jamillia, and Amidala all aired their opinions on the crisis, before Jamillia turned her attention to Amidala's safety. Although Amidala and Skywalker argued briefly, it was agreed that the senator would stay in the Lake Country."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "Bibble's predictions turned out to be correct: later that year, the Clone Wars broke out on the planet of Geonosis. As the conflict raged, war had again come to Naboo when a droid scout party was detected near the Eastern swamps by the Royal Naboo Security Forces. After learning about the incident, Bibble expressed his concerns about the possible upcoming invasion to the Queen Neeyutnee, successor to Jamillia. Later investigations by Naboo Senatorial Representative Padmé Amidala uncovered the presence of a Separatist laboratory on Naboo, which was successfully neutralized by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker and their clone troopers. Bibble attended the annual Festival of Light, a celebration held in Theed that commemorated Naboo's joining the Republic later that year and was present when a team of bounty hunters attacked. The group was attempting to kidnap Palpatine, now the Supreme Chancellor, who was the celebration's keynote speaker. Bibble was subsequently escorted to safety in a group lead by the Jedi Padawan Ahsoka Tano, and the bounty hunters were quickly apprehended by the Republic.[source?] In 20 BBY, Bibble accompanied Amidala to the Senate when Queen Julia called. Palpatine was about to assign Amidala and Senator Bail Organa, but Julia specifically called for Jar Jar Binks, confusing everyone."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "When the Clone Wars concluded in 19 BBY, Amidala was killed in a dispute with Anakin Skywalker. Her body was taken to Naboo for burial and Bibble joined her funeral queue in Theed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sio Bibble was an outspoken man, and was loath to resort to any sort of violence, as he had never wielded a weapon in his life, and believed himself to know more than a simple soldier. He was also intelligent, and saw himself as a scholarly and philosophical person. He was quick to jump to conclusions, and was consistently outraged at events he thought to be unconscionable. Bibble was defiant in the face of great danger, as he demonstrated when Nute Gunray invaded Theed. He would occasionally disagree vehemently with Captain Panaka, and was genuinely fearful for the safety of his Queen. Bibble spoke his mind on such matters as the Separatist Crisis and Gunray's continued trials in the Supreme Courts, and was considerably louder than others when doing so. In turn, Amidala trusted Bibble and relied on him, especially during the times of crisis."}, {"tag": "p", "text": "Bibble took particular care about his appearance: during Amidala's reign, he wore his beard sharply pointed, as was the fashion. His clothing was often flamboyant but stately, and at the time of the Invasion of Naboo, he opted to wear a Naboo philosopher's cloak, with a formal collar, as well as fashionable sleeves and cuffs. Complimenting his appearance was the fact that Bibble held a deep love for both art and fashion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Sio Bibble was conceived for George Lucas' 1999 film, Star Wars: Episode I The Phantom Menace. Concept art for the character was developed by Iain McCaig. Bibble was portrayed in the film by Oliver Ford Davies, who would go onto reprise the role in Star Wars: Episode II Attack of the Clones and Star Wars: Episode III Revenge of the Sith. During the principal photography of Attack of the Clones in Italy, Davies was unable to attend, as he was shooting another film, and was in a play. Nine months after principal photography on Attack of the Clones had ended, Davies' scene was shot on a bluescreen stage, and digitally inserted into the scene shot in Italy later. The character was voiced by Jamie Alcroft in the game Star Wars: Galactic Battlegrounds. According to George Lucas' daughter Katie, it was she who came up with the name \"Sio Bibble.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}