{"url": "Siroc", "categories": ["Category:Canon articles", "Category:Kings", "Category:Males", "Category:Pastorians"], "nodes": [{"tag": "h1", "text": "Siroc"}, {"tag": "p", "text": "Siroc was a Pastorian male who served as king of the planet Pastoria at the time of the war between the First Order and the Resistance. Knowing the First Order would eventually come to Pastoria, he wanted to remain unaffiliated with the Resistance so that he could attempt to negotiate with them."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Becoming king of Pastoria, Siroc was known to be an influential ruler. After the Battle of Starkiller Base, Siroc feared that the First Order would arrive on his planet, and wished to eliminate his closest rival so that he could negotiate with the First Order and prevent his rival resisting them and getting the Pastorians killed."}, {"tag": "p", "text": "Siroc's wish came true with the arrival of Black Squadron, who had been sent by General Leia Organa to locate allies for the Resistance. They met with Siroc, who acted as if he was thinking of assisting them. After speaking with Temmin Wexley and the other members of the squadron, who asked Siroc to send a public broadcast, knowing he could influence other star systems to resist the First Order."}, {"tag": "p", "text": "Siroc, who did not wish to fight against the power of the First Order, instead asked Black Squadron to assist with a group of terrorists who sought to depose him. Introducing them to Colonel Squill, he asked the squadron to escort one of his transports along with his own security forces, in order to send a message that he had powerful allies in the Resistance. In reality, he was setting Black Squadron up to help destroy his rival's transport, and did not plan to join the Resistance. Siroc's rival, believing that Black Squadron and the Pastorian forces were invading his terrority, sent fighters to defend his ship, leading Colonel Squill to order his forces to fight back."}, {"tag": "p", "text": "After Black Squadron witnessed the destruction of the transport and returned to Siroc, asking him what he made them do, Siroc explained that killing his rival would ensure that he could negotiate with the First Order and prevent them from being killed in the event of resistance. Despite Black Squadron's warnings that the First Order would not negotiate with the Pastorians, Siroc refused to help the Resistance, advising the members of the squadron to abandon what he thought to be a \"doomed crusade.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Siroc was known for his exceptional reason and judgement, and was an influential ruler. He was also a determined king, wanting to stay in power and doing anything he had to do to ensure that, including tricking members of the Resistance into destroying his political enemies. His wishes were not completely selfish, however—he wanted to stay in power in an attempt to prevent his potential rivals from resisting against the inevitable arrival of the First Order, which would lead to severe consequences for his people. Despite knowing the threat that the First Order posed, Siroc was naive enough to believe that they would be willing to negotiate with the Pastorians."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}