{"url": "Sionver_Boll/Legends", "categories": ["Category:Legends articles", "Category:Bivall", "Category:Females", "Category:Galactic Republic individuals", "Category:Scientists"], "nodes": [{"tag": "h1", "text": "Sionver Boll"}, {"tag": "p", "text": "Dr. Sionver Boll was a female Bivall scientist who served with the Galactic Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A scientist of an alien species, Sionver Boll lived during the waning years of the Galactic Republic. In 22 BBY, Dr. Boll and the Ministry of Science were working on the antidote to the virus released by Zeta Magnus on the population of the planet Marat V."}, {"tag": "p", "text": "Sionver Boll designed and developed the electro-proton bomb, an explosive device that created a massive electromagnetic pulse. In 22 BBY, the first deployment of the bomb during the Battle of Malastare deactivated an entire Separatist droid invasion force. However it opened a sink hole at the blast site which awakened a gargantuan Zillo Beast. In the ensuing rampage, the Republic's clone troopers and Dug allies sustained heavy casualties."}, {"tag": "p", "text": "Even Jedi lightsabers failed to penetrate the creature's thick armor, which led Boll and Supreme Chancellor Palpatine to express interest in studying the beast for possible reproduction of its scales as indestructible armor. When the beast was brought to Coruscant to be studied, Palpatine suggested that the beast should be killed as the process of removing its scales to study them was difficult and painful for the beast. Boll protested, stating that it was the last of its kind and there was a chance it might be sentient."}, {"tag": "p", "text": "Palpatine wasn't convinced and told her he'd replace her if she wouldn't kill it, but the beast heard his comments, and expressed its rage, as it recognized him as a Sith Lord. The Chancellor suggested killing the beast with the toxin produced from the Malastarian fuel that weakened it. Boll was able to turn the toxin into a\npoison gas, but she did not produce enough and the Zillo Beast escaped, beginning a rampage on Coruscant to find Palpatine, who had ordered him tortured."}, {"tag": "p", "text": "Palpatine contacted Boll, and ordered her to create more toxin to kill the creature. She succeeded, and the toxin was fired by several Republic gunships, killing the Zillo. The next morning, Palpatine ordered Boll to clone the beast, much to her surprise. However, before Boll had the chance to create a clone the Clone Wars came to an end, and Palpatine no longer had need of Boll's skills."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Boll was a caring individual. She expressed her desire to let the beast live rather than killing it. Boll also dryly commented on the beast's reaction to Palpatine's comment on the intelligence of the creature. She additionally consoled the Zillo shortly prior to beginning the execution."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sionver Boll was voiced by Cara Pifko, who also voiced Suu Lawquane."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}