{"url": "Sipsk%27ud", "categories": ["Category:Legends articles", "Category:Avian and airborne sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Sipsk'ud"}, {"tag": "p", "text": "The Sipsk'ud were a sentient species native to the Sipsk system in the Kanz sector. They were broadly avian in appearance, with a yellow duck-like beak and white feathers. They had a large cluster of seven eyes on their heads, and at least one Sipsk'ud wore a sealed spacesuit while in an atmosphere suitable for species such as Humans."}, {"tag": "p", "text": "During the Old Republic era, many Sipsk'ud were converted to Vianism by Argazdan settlers from the Core Worlds. They were one of many species that could be found wandering the streets of Nar Shaddaa at the end of the Clone Wars. During the Galactic Civil War, a Sipsk'ud was present among the space-freighters recruited by young Berd Lin to rescue his mother and her school after they were kidnapped by Imperial Major Stafuv Rahz. The individual was also present when Lin revised his plan in order to avoid an Imperial trap."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sipsk'ud were created by Russ Manning in the form of an unnamed freighter pilot present in Bring Me the Children, an arc of the Star Wars comic strip published in 1980, and reprinted in color in Classic Star Wars: The Early Adventures 7 in 1995. The species did not receive a name at that time."}, {"tag": "p", "text": "Adrick Tolliver introduced the name for the species in \"Death in the Slave Pits of Lorrd,\" a story released on Hyperspace. The story did not explicitly connect the Sipsk'ud with the species seen in Manning's comic, but Tolliver noted in his endnotes for the story that \"authorial intent is that they are the ducklike species with multiple eyes seen in Classic Star Wars: Bring Me the Children.\" While he also noted that \"authorial intent is, as always, to be taken with a grain of salt,\" Keeper of the Holocron Leland Chee later indicated that the name did go with the being seen in Bring Me the Children, and Abel G. Peña's short story \"Lone Wolf: A Tale of Obi-Wan and Luke\" cements this connection by referring to \"spider-eyed Sipsk'ud mallards.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}