{"url": "Sirak", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Dark Lords of the Sith of the New Sith Wars", "Category:Males", "Category:Members of the Brotherhood of Darkness", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Sirak"}, {"tag": "p", "text": "Sirak was a male Zabrak who trained as a Sith apprentice at the Academy on Korriban during the New Sith Wars. For much of his time at the Academy he was the top apprentice and was favored by many of the Sith Masters there, particularly Qordis. Sirak was renowned at the Academy for his strength in the dark side and his skills in lightsaber combat. He developed a rival in the fellow apprentice Bane, whom Sirak believed was one of the few students that could eventually challenge his place at the Academy. When Bane lost his own favor with the Masters for withdrawing from the dark side, he sought to re-establish his position by challenging Sirak. The Zabrak defeated his Human opponent easily, and from then on, disregarded Bane as a threat to his standing."}, {"tag": "p", "text": "A couple of months later, Sirak was challenged by Bane again. He was unaware that Bane had received secret training from Kas'im, the Academy's Blademaster, and another in Sith apprentice, Githany, a deserter of the Jedi Order. Githany taught him everything that the Sith Lords were teaching her. This was all in preparation for seeking revenge for his earlier loss. Bane's tediously-honed skills allowed him to fully manipulate the duel, drawing out Sirak's defeat. Hesitating on the killing blow, Bane was stopped by Kas'im, who recognized that Sirak was not only beaten but humiliated."}, {"tag": "p", "text": "Furious and desperate for vengeance, Sirak plotted ways of killing Bane. His opportunity presented itself when Githany offered to help Sirak kill his enemy. Along with the Zabrak twins, Llokay and Yevra, Sirak waited in the library while Githany lured Bane to them. However, Githany had in truth betrayed the Zabrak trio, and instead fought alongside Bane against them. The former Jedi proceeded to kill the twin Zabrak with her lightwhip, and Bane decapitated Sirak as he begged for mercy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Korriban Academy"}, {"tag": "p", "text": "Hailing from the Zabrak homeworld of Iridonia, Sirak was a Sith apprentice on the planet Korriban during the final years of the New Sith Wars. Because of his innate strength in the dark side of the Force, Sirak was inducted into the Sith academy on Korriban, an institution exclusively reserved for those with the potential to become Dark Lords of the Sith. During his time at the Academy, Sirak rose through the throng of students to become the foremost apprentice among them, gaining preferential treatment and tutelage from several of the Sith Masters. His strength in the dark side was such that it was rumored amongst some of the apprentices that Sirak had begun training under the Academy's Headmaster, Qordis, some twenty years before, even before the Korriban Academy was reinstated. It was even whispered amongst his fellow students that Sirak was the Sith'ari, an embodiment of the dark side itself. He had also won the admiration of two other Zabraks within the Academy, the twins Yevra and Llokay, and was considered by the other students to be superior to his fellow Zabraks in skill. The two apprentices followed him constantly, giving the appearance of obedient servants following their master."}, {"tag": "p", "text": "Sirak was also renowned in the Academy for utilizing the double-bladed training saber. Although there were other apprentices who used this type of saber, the student Bane noted it was only Sirak that wielded the weapon with any kind of skill, apart from the Twi'lek Blademaster of the Academy, Kas'im."}, {"tag": "h3", "text": "Rivalry with Bane"}, {"tag": "p", "text": "After Bane killed the Makurth apprentice Fohargh during a training duel, Sirak followed him until they were in a separate corridor of the Academy, alone. The Zabrak found Bane intriguing, and felt he would be a powerful opponent—one who would eventually challenge himself for the position of top student. Sirak attempted to intimidate the Human, telling him a confrontation between them would be inevitable, and when Bane felt he was ready, he knew Bane would eventually challenge him in the dueling ring."}, {"tag": "p", "text": "Bane recognized the challenge as an attempt to goad him into a duel before he was ready. However, in killing Fohargh, Bane had realized that he had killed his father many years ago through use of the dark side. Over the course of the next month, Bane began to lose his control of the Force, unable to access his anger. When the Sith Masters began to spurn Bane's approaches for private tutelage after orders from Qordis, headmaster of the Academy, Bane knew his prestige was diminished and had to take measures to re-claim it. Thus, Bane rashly challenged Sirak in an attempt to prove himself."}, {"tag": "p", "text": "Sirak had watched the slow decline in his opponent's skills as the weeks had passed. When Bane had killed Fohargh, Sirak felt Bane would rise to be a challenge, but now he did not consider him a threat to his position. Sirak wielded his double-bladed training saber with flourishes, before moving in to strike. Bane defended himself, but Sirak continued his attacks, incorporating moves from lightsaber combat Forms V and Form VII in alternating powerful and quick attacks, before demonstrating his true skills, blending several forms at once and overwhelming the weakened Bane. His opponent was crippled and defeated, and Sirak felt him beneath his notice once more."}, {"tag": "p", "text": "Shortly after the removal of his latest challenger, Sirak found a new rival to his position—the Jedi defector, Githany. She had recently joined the Brotherhood of Darkness, providing Lord Kaan with information on the Jedi positions which resulted in a Sith victory at the Fourth Battle of Ruusan. Sirak had witnessed her observing him as he did her, both analyzing each other and preparing, knowing they would battle for the position of the Academy's foremost apprentice."}, {"tag": "p", "text": "Several months later, Bane sought to challenge Sirak again. Sirak was cautious, knowing Bane would not challenge him again unless he had some strategy for victory. Indeed, Bane had in fact been training in secret with both Kas'im, the Academy's Blademaster, and Githany, learning lightsaber combat and how to use the Force from them respectively. Bane had spent considerable time learning the techniques of the double-bladed saber that Kas'im wielded, seeking to understand it and so nullify its unfamiliar cadence as well as Sirak's advantage in battle."}, {"tag": "p", "text": "When the battle began, Bane used all of his cunning, attempting to destroy his enemy entirely. He added false flaws in his technique, luring Sirak into a sense of security, but Sirak was never able to land a blow on the Human. As the battle wore on, Sirak grew weary, unaccustomed as he was to prolonged dueling. Bane often held back from striking when Sirak left himself exposed, sensing his opponent's desperation and using it to fuel his passion for revenge. Sirak's attacks became less honed as he was gradually worn down, and Bane closed in on the total domination he sought. In the final stretch of the duel, Bane crippled Sirak with a lightning-fast strike that shattered his forearm, and another that split his lower leg in two. As he prepared for the finishing move, Bane paused, allowing Kas'im to intercede on Sirak's behalf and save his life."}, {"tag": "h3", "text": "Fragile alliance"}, {"tag": "p", "text": "After spending several days submerged in bacta, Sirak emerged and began thinking about how he could take his revenge against Bane. Githany came to him, informing him that she helped train Bane to defeat him, and now, in turn, could aid Sirak in defeating Bane. The former Jedi believed Bane was weak after he failed to kill Sirak in the dueling ring, but she was also angry at him for leaving for Korriban's Valley of the Dark Lords without saying goodbye to her, or telling her why he had chosen to go."}, {"tag": "p", "text": "While Bane was in the Valley, Kaan contacted the Academy, calling all Sith to Ruusan for the final battle against the Army of Light—an army of Jedi led by Lord Hoth. All the apprentices were granted the title of Dark Lord of the Sith, declared equal members in the Brotherhood, and furnished with their own lightsabers. Shortly after this announcement, Bane returned, which pleased Sirak, who had felt his desire for revenge may have gone unfulfilled. Though he knew Llokay and Yevra would aid him in his revenge, Sirak knew he would need Githany to defeat Bane—her strength in the Force made her a better ally than either of his kin. Githany persuaded Sirak to wait in the library, where she would lure Bane to him. All too aware of Bane's power, Sirak told Githany he would have Llokay and Yevra assist them. Though displeased, she agreed nonetheless."}, {"tag": "h3", "text": "Githany's betrayal"}, {"tag": "p", "text": "As promised, Githany lured Bane to the library archives. There, he discovered Sirak, Llokay, and Yevra standing in waiting. Stalling for time, Bane appealed to Githany. When Sirak realized he was trying to turn her against him, he attacked. Githany, siding with Bane, tossed him his lightsaber—which she had taken from his room when they left. Bane ignited the blade via the Force, and summoned it to his hand in defense against Sirak's attack. A duel took place within the library, in which Yevra and Llokay were killed by Githany and Sirak was left facing the two Humans alone. Begging for mercy, Sirak's pleas went unheard as he was decapitated by his nemesis, Bane."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sirak had pale yellow skin and orange eyes. He was the most powerful of the three Zabrak studying at the Academy during the end of the New Sith Wars. The other Zabrak, the twins Yevra and Llokay, held Sirak in the highest regard and were regularly seen at his side. By contract, Sirak treated them like assistants, using them to carry belongings like his training saber or his cloak while he was dueling."}, {"tag": "p", "text": "Because of his superior skill to that of his fellow students, Sirak was also exceedingly arrogant. The preferential treatment he received from the Masters at the Academy due to his strength in the Force did nothing to mute his feelings of self-worth. He preferred to work alone, being suspicious of those that offered him assistance, such as Githany. Though proud, Sirak was highly cautious, being wary rather than overconfident when he suspected traps, such as during his second training duel with Bane."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Sirak's most renowned ability at the Korriban Academy was his proficiency at dueling, most notably in the seventh form of lightsaber combat, which was dubbed \"Vaapad\" by Blademaster Kas'im during that time. Using the largely unfamiliar double-bladed variant of the Sith training saber, he was considered at a standard almost equal to that of Kas'im. Sirak was able to incorporate Force techniques into his dueling, making him a formidable opponent in battle. However, the Blademaster also considered Sirak's arrogance to be a hindrance to his progress."}, {"tag": "p", "text": "A skill attributed to all the apprentices of Korriban's academy, Sirak was able to create protective shields with the Force to defend himself from physical, energy, and Force-based attacks. Sirak could anticipate his opponent's moves through the Force as well, another skill of all the apprentices at the Academy. He was able to counter an opponent's use of telekinesis—an ability he was also able to utilize himself. Sirak was among the apprentices that Qordis taught Force lightning, which he attempted unsuccessfully to use against Bane."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sirak was created by Drew Karpyshyn for the novel Darth Bane: Path of Destruction, which is his sole canonical appearance to date. In the novel, Karpyshyn mistakenly describes Sirak as being a practitioner of Vaapad, a lightsaber form based on Juyo, created millennium later by Jedi Master Mace Windu with the help of fellow Master Sora Bulq. Karpyshyn has acknowledged this error, and requests that readers consider Vaapad to read Juyo instead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}