{"url": "Sionver_Boll", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Bivall", "Category:Females", "Category:Scientists"], "nodes": [{"tag": "h1", "text": "Sionver Boll"}, {"tag": "p", "text": "Sionver Boll was a female Bivall doctor who served the Galactic Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A scientist of the Bivall species, Sionver Boll designed and developed the electro-proton bomb, an explosive device that, when detonated, released an immense electromagnetic pulse. This was intended to shut down all droids, the mainstay of the armed forces of the Confederacy of Independent Systems."}, {"tag": "p", "text": "In 22 BBY, the first test of the device occurred during the Battle of Malastare, a conflict out of which the Republic also hoped to obtain exclusive rights to resources on the planet pending their victory. However, when the device detonated, it not only eliminated the entire Separatist force deployed against Republic troops and local Dugs, but also opened a sinkhole that swallowed combatants from both sides and awakened a gargantuan Zillo Beast, a species previously thought extinct. In the ensuing rampage, the forces of the Republic and their allies sustained heavy casualties."}, {"tag": "p", "text": "The armor of the creature proved impossible to penetrate, even by the potent blades of the Jedi present at the battle, which led Boll and Supreme Chancellor Palpatine to express interest in studying the beast for possible reproduction of its scales as near-indestructible armor for clone troopers and ships. The Dugs demanded that the creature be killed, but trickery and quick thinking on the part of Jedi Generals Anakin Skywalker and Mace Windu allowed them to escape with a living but sedated Zillo Beast."}, {"tag": "p", "text": "When the beast was brought to Coruscant to be studied, the Chancellor suggested that the beast be killed as the process of removing its scales for study might prove too painful for the beast to endure. Despite this apparent desire for mercy, Dr. Boll protested, stating that it was the last of its kind and that there was a chance the creature might be sentient. She also indicated a scowl on the creature's face as a response to the Chancellor's remarks, stating that it \"didn't seem to like [his] comment.\""}, {"tag": "p", "text": "Palpatine was not convinced by her words and bluntly informed her that, if she continued to refuse his order, she would be replaced with someone who would. He also suggested that a toxic gas similar to that used by the Dugs to kill other members of the species be synthesized by Doctor Boll in an attempt to halt the creature. Boll mournfully complied, but she and her staff did not produce enough of the toxin to kill the beast. The Zillo Beast, seemed to prove the doctor's earlier statement right, as it reacted to the toxin by escaping the confines of the research facility and embarking on a second rampage, with Palpatine as the primary target. Untold numbers of civilians and Coruscanti police forces perished as the creature, seemingly aware of the meaning behind the Chancellor's words and potentially even his nature as a servant of the dark side, destroyed every image of Palpatine it could find and marched steadily onward toward the Senate Building."}, {"tag": "p", "text": "Out of desperation, the Chancellor contacted Boll and ordered her to create more of the gas. Following the doctor's immediate compliance, the toxin was fired from Republic LAAT/i gunships at the Zillo Beast as it climbed the citadel of the Senate Building, killing the creature. Boll remained somewhat mournful over the fate of the creature and was startled when the Chancellor privately ordered her to clone it. However, before Boll had a chance to do so, the Clone Wars came to a close and the Emperor, following his self-coronation, had no need for her services and skills any longer."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Boll possessed great empathy for the Zillo Beast, consoling the beast prior to its anticipated execution. She was also showed moral integrity, being willing to confront even the Chancellor of the Republic in regards to her beliefs and concerns regarding the beast and her experimentation on it. She also responded to Palpatine with dry sarcasm when the Zillo Beast scowled at him to show its discontent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sionver Boll first appeared in the Star Wars: The Clone Wars episode \"The Zillo Beast.\" She was voiced by Cara Pifko, who also voiced Suu Lawquane, Orphne, and Naa'leth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}