{"url": "Sith_Academy_(Korriban)", "categories": ["Category:Legends articles", "Category:Korriban locations", "Category:Sith academies"], "nodes": [{"tag": "h1", "text": "Sith Academy  (Korriban)"}, {"tag": "p", "text": "The Sith Academy on Korriban was a facility in use during the Jedi Civil War and later the Cold War, dedicated to training Force-sensitives in the ways of the Sith, and running archaeological projects in the Valley of the Dark Lords."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Founding"}, {"tag": "p", "text": "The Sith Academy on Korriban was established in 3996 BBY during the buildup to the Great Sith War by the disciples of the Sith Lord Exar Kun. One of them, called Jorak Uln, became the Headmaster of the Academy. Despite knowing the Academy's existence, the Jedi Order did not lead an assault on the facility after the conclusion of the war."}, {"tag": "h3", "text": "Revan's Empire"}, {"tag": "p", "text": "By the time of the Mandalorian Wars, the entrance to the Academy was the only surface level structure remaining, with sublevels being employed for the training of apprentices. When Darth Revan and Darth Malak reopened the Academy upon their return as Sith Lords to train warriors for their Empire, classes resumed in the sublevels as they trained to fight in the Jedi Civil War. Its students during this time were either Force-sensitives looking to take a side in the conflict, or fallen Jedi, disillusioned with either the Jedi Order, the war, or the Republic in general."}, {"tag": "p", "text": "Jorak Uln was eventually exiled and succeeded by his apprentice Uthar Wynn who operated the Academy during Lord Revan's reign over the Empire. Unbeknownst to Wynn, Revan had been captured by the Jedi during the war and his memory altered. Revan would return to Korriban in the guise of a Sith apprentice and infiltrate the Academy during his search for the lost Rakatan Star Maps. During this time, Revan killed Wynn with the help of fellow apprentice Yuthura Ban, Wynn's own apprentice. After Wynn's death, Revan convinced Ban to leave the Academy and rejoin the Jedi Order. However, the redemption of Yuthura Ban and the death of Wynn caused an uprising at the Academy. When leaving the valley, Revan and his crew were interrogated by the Sith Guards about why he left the Tomb of Naga Sadow untouched during his visit. Unintentionally revealing his purpose for visiting the tombs, the guards attacked, pitting the entirety of the Academy against the crew of the Ebon Hawk. However, due to the experience and training that the crew had and the sheer power and fighting prowess of the former Dark Lord, they managed to defeat the Sith and escape, killing most of the Sith present at the Academy."}, {"tag": "p", "text": "The history of the Academy all but ended with the climax of the Jedi Civil War. Shortly after the destruction of the Star Forge in the Battle of Rakata Prime, infighting at the Academy and elsewhere, known as the Sith Civil War, turned Korriban into a graveyard once more. It was looted after the fighting died out and the Academy was abandoned again. It wasn't until 3951 BBY that Jedi Knight Meetra Surik visited Korriban to search for Jedi Master Lonna Vash. Surik encountered an Academy totally different than Revan had during his Star Forge quest: due to lack of Sith teachers, the Academy had been completely automated, with students relying on computers for basic training. As Surik wandered the emptied Academy, encountering only tuk'ata and cloaked Sith assassins of the Sith Triumvirate, she found Vash's corpse inside an interrogation room. On her way out, she briefly dueled with Darth Sion; however, at the urging of Kreia—who preferred not to accompany Surik and thus stayed on the Ebon Hawk—she fled the battle, knowing she would have another chance to battle the Sith Lord."}, {"tag": "h3", "text": "True Sith Empire"}, {"tag": "p", "text": "When the Sith Empire recaptured Korriban and ousted the Republic garrison there during the start of the Great Galactic War, the Empire ordered the reconstruction of the Academy and the rejuvenation of the Valley. Rebuilding the pyramid structure that formed the main levels of the Academy, the Academy trained hundreds of Sith over the years, swelling the ranks of the Empire's forces. During the Cold War, the Sith Empire was losing more Sith than it was gaining, allowing for slaves and even aliens to train and become acolytes, although this was frowned upon by many Imperials.Eventually the Empire's Wrath and Darth Nox arrived and were trained, becoming immensely important members of the Sith Empire and reaching apprenticeship far quicker than usual acolytes. The Academy was plagued not only by failed acolytes who caused problems outside the Academy, but by instructors suspected of not being true Sith. Inquisitor Arzanon and his Intelligence agents patrolled the Academy's grounds searching for traitors in their midst."}, {"tag": "h3", "text": "Brotherhood of Darkness"}, {"tag": "p", "text": "Korriban was retaken by the Brotherhood of Darkness in 1006 BBY, and they reopened the Academy. During this period the Headmaster was Qordis, and the Blademaster was Kas'im. The most powerful Sith apprentices were trained here, including Sirak, Githany, and Darth Bane, who would later destroy the Brotherhood and found the Order of the Sith Lords. Because of the Jedi Order's ban on Sith knowledge, the Brotherhood's Academy Library relied on scrolls and ancient tomes rather than holocrons, as all known artifacts were lost or housed on Coruscant in the Jedi Order's Temple. The Sith Library's collection was ever-growing during this era, and was thus hard to navigate as new lore was added to the stacks with little care for reference or order. This was not just due to the lack of lore keepers in the Brotherhood, but also by design, to keep knowledge hidden and a challenge to obtain for the undedicated."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In 23 BBY, a team of Jedi Knights and their Padawans, headed by Obi-Wan Kenobi, entered the Sith Academy while on a mission to track down the galactic criminals Granta Omega and Jenna Zan Arbor. Upon entering the ancient ruins, Kenobi felt a distinct Sith presence—the dark shape of a Sith Lord. Though he did not realize it at the time, this later proved to have been Darth Tyranus, the Sith alter-ego of former Jedi Master Dooku, who was there on Korriban to rendezvous with Omega and Zan Arbor. The two criminals were seeking to strike an alliance of power with the galaxy's re-emergent Sith. Anakin Skywalker had fleetingly glimpsed the tall, black-hooded figure of the Sith Lord from behind. Kenobi shuddered at the thought of the thousands, who had come for knowledge and training, who had been trapped within the Academy by their own desires: he seemed to feel each wasted life, each terrible death. So thick and foreboding was the dark side of the Force within the structure, that it seemed to invade Kenobi's lungs, and he found it difficult to breathe. For 18-year-old Anakin, the surging feeling of the dark side seemed to rise up from the soles of his feet and blast through the crown of his head: its undeniable power was stomach-turning, nerve-splitting—nauseating."}, {"tag": "p", "text": "By the time of the Clone Wars, a very large space inside the abandoned academy building had been converted to a tomb for Darth Bane, founder of the new Sith Order. A colossal statue of the Dark Lord had been erected inside, and his remains had apparently been interred inside a stone sarcophagus which also served as a secret entrance to a chamber used by the Sith to sacrifice Jedi."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "A towering pyramidal structure at the rear of the Valley of the Dark Lords on Korriban, the Sith Academy was made of stone and durasteel and reflected the sun framed at the apex of the structure. At the base of the Academy, the entrance was located at the top of a wide staircase and framed by two kneeling humanoid statues representing slaves bearing the weight of the Sith's power. Symbolic of a Sith's climb to power, the Academy's main hall was located just past the main doors and contained dual stair cases leading to the upper levels. The center piece of the main hall was a narrow stone monument which was carved with the faces of Sith; the statue was meant to remind students that the climb to success meant crushing those who vie for power along the way. Containing jails in which prisoners would be kept before interrogation, the Academy's lower levels contained many chambers for studying, lecturing, meditation, and training."}, {"tag": "p", "text": "During the reign of Emperor Vitiate, the Sith Library was situated off of the main hall and contained several levels and chambers of resources contained on scrolls and holocrons as well as datapads and holobooks. Glowing an ominous violet, the technology in the Library was advanced and guarded by armed guards. Maintained by the Sphere of Ancient Knowledge's reigning head Darth Thanaton, the Library contained the teachings of Darth Vilus, the holocron of Darth Iratus, ancient Sith armor, and a variety of tablets. During the Korriban Incursion, the Library was held by Jedi Master Wytho, the stacks left to smolder and burn after the battle's conclusion."}, {"tag": "p", "text": "As a place of study, the Academy was equipped with dormitories to house its students. Guarded by the Dark Honor Guard, the Academy also housed secret Ritual Chambers where creatures such as the Bloodfiend lived; results of Sith alchemy and sorcery. Near the summit of the pyramid, the rooms were restricted to the highest ranking Sith on Korriban. The Dark Council kept chambers there when for conferences held on the planet and rumor held that the Sith Emperor had a throne room deep in the Academy, though it was seldom used."}, {"tag": "h2", "text": "Curriculum and faculty"}, {"tag": "p", "text": "Entrance to and life at the Sith Academy was difficult. To be admitted, prospective students were required to impress one of the teachers or students who was already in the Academy, receiving as proof a medallion, or to kill a student and take his or her medallion. Fallen Jedi usually did not have much difficulty in gaining admission, because they had already been trained in the ways of the Force. Prospective students were forced to compete against each other in a group; one would gain enough prestige to impress the headmaster and become a true Sith, while the others would be forced to wait a year before trying again, assuming they survived."}, {"tag": "p", "text": "Competition was fierce, and many students were killed in their attempts to outdo their competitors. Further, the Sith held no qualms about killing students to either facilitate an acquaintance's acceptance of the dark side or preventing other students being held back. Some students preferred to engage each other in a lethal duel within the Sith training room. Even the Academy's headmaster was not immune to backstabbing. It was not uncommon for a headmaster to be overthrown by his or her second-in-command. Whenever this or other political intrigue hit the Academy, people had a tendency to disappear."}, {"tag": "p", "text": "The cruelty was further demonstrated by the penchant of Academy students to visit the nearby colony of Dreshdae and torment hopefuls wishing to enter the Academy. The Sith also kept their own store of captive Republic soldiers for practice in torture and battle, and had a prison wing to detain and interrogate prisoners. It was also complete with an interrogation room, where Sith officers brutally interrogated their prisoners."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith Academy of Korriban made its first appearance in the RPG game Star Wars: Knights of the Old Republic and not long after, making another appearance in the game's sequel. It has recently made an appearance again on another video game, this time the massively multiplayer online role-playing game Star Wars: The Old Republic, released by BioWare in December 2011 as the spawning and ending place for both the Sith Inquisitor and Sith Warrior class storylines."}, {"tag": "p", "text": "The Academy on Korriban is referenced in the final volume of Jude Watson's Jedi Quest series simply as the \"ancient Sith monastery\"—thousands of years old, deserted for hundreds of years, but still a presence of evil. Once a bastion of Sith lore and learning where thousands had once trained \"and thousands of hopefuls had once disappeared forever,\" the Academy was, at once, repulsive and alluring to the Jedi. The original inhabitants of Korriban who had built (and, in later years, re-built) the Sith complex had, of course, long since vanished and nothing thrived there: but if the ancient stones could speak, \"they would talk of blood and terror.\" For though the Sith Academy had had the same goals as did the Jedi Temple—study and learning—this place had been ruled by fear. The high walls that narrowed in harsh lines and pyramidal angles near the top were designed to create a feeling of entrapment; slightly askew, they were meant to intimidate and keep beings off-balance. With no openings to light or air, there were only the massive columns, bleak towering walls, and hard floors of cold gray stone."}, {"tag": "p", "text": "Watson describes the massive Sith structures as having giant exterior walls comprised of great stones that, by 23 BBY, had \"shifted\" over the years, with sundry large slabs propped up against one another, and others that had toppled and crumbled into boulders; within, vast echoing chambers that rivaled the Jedi Temple Great Hall were shrouded in darkness. An oppressive dread emanated from the ancient cracks and hollows; the walls wept with moisture. Ancient voices could be heard, and spectral images of torture and pain passed, then vanished, like phantoms in the night. In Watson's description, huge statues of terrifying beasts from many worlds marched on either sides of its great corridors. Vestiges of the Sith's greed-torn Order were strewn across a vast, ancient hangar where aggression and technology met—remains of huge hulking ships were witnesses to the Order's own perceived invincibility that, ultimately, was brought down in disaster by vengeance, lust and pride."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}