{"url": "Sith_Empire_(Great_Sith_War)", "categories": ["Category:Legends articles", "Category:Sith states and governments"], "nodes": [{"tag": "h1", "text": "Sith Empire  (Great Sith War)"}, {"tag": "p", "text": "Exar Kun's Sith Empire was a revived faction of the Sith Order that was founded and ruled by the Dark Lord of the Sith, Exar Kun during the Great Sith War. As an ambitious and power-hungry Jedi, Kun became deeply immersed in the forbidden knowledge of the ancient Sith Lords and during his journey to the dark side decided to restore the ancient Sith Empire, by toppling the Galactic Republic and crushing the Jedi Order."}, {"tag": "p", "text": "The fall of another Jedi Knight (Ulic Qel-Droma) to the dark side, the establishment of the Krath cult in the prominent and powerful Empress Teta system, the corruption of the Mecrosa Order by Sith teachings in the Tapani sector, and the alliance with the warlike Mandalorian Crusaders provided Exar Kun, the newly christened Dark Lord of the Sith, with the necessary means to wage a short-lived, but very devastating war against the Republic and the Jedi. However inner tensions, great consolidation of the Jedi forces and betrayal by his Sith apprentice led to Kun's defeat."}, {"tag": "p", "text": "After this Sith Empire's collapse, many of its remnants and former leaders sought to restore it to power; ultimately, it would be resurrected in the form of the new Sith Empire of Darth Revan and Darth Malak."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "More than four centuries after the fall of the Sith Empire, the fallen Jedi Freedon Nadd discovered two artifacts that the Jedi Shadows had failed to destroy. The first was Adas's holocron and the second was Naga Sadow himself which Nadd used to absorb himself in the teachings of the Sith. After training under the ancient Sith Lord, Freedon Nadd destroyed Sadow, proclaimed himself the new Dark Lord of the Sith and subjugated the world of Onderon, where he ruled as king from the capital of Iziz until his physical demise. However, his spirit still influenced the events on the planet leading to two great conflicts: the Beast Wars and Freedon Nadd Uprising - both of them resulted in an unfortunate outcome for the Sith future. Despite his defeat on Onderon, Nadd's teachings would yet lead to a new Sith Empire."}, {"tag": "p", "text": "In 3997 BBY, a young Jedi known as Exar Kun became curious about the teachings of the Sith. He abandoned his master, Vodo-Siosk Baas, left Dantooine and journeyed to the planet Onderon and then its jungle moon, Dxun, where eventually he was lured to the dark side by the ghost of Freedon Nadd. Becoming Nadd's apprentice, he traveled to Yavin 4, where after he had discovered ancient Sith artifacts he acquired even greater Sith powers. Seeing himself as powerful as he always desired, he rebelled against his Sith Master. He then destroyed Nadd's spirit, becoming the new Sith Lord. Enveloped in the dark side, Kun elevated himself to the stature of a god - he enslaved local Massassi race, deeply immersed himself in Sith alchemy and magic and watched the construction of a series of massive temples. The fourth moon of Yavin Prime thus became one of the strongholds of a future resurrected Sith Empire."}, {"tag": "p", "text": "Meanwhile, another Jedi, Ulic Qel-Droma, although motivated by good intentions, also began his journey to the dark side. He had became Emperor of the Empress Teta system and leader of the Krath, a Sith inspired cult that had formed after the Freedon Nadd Uprising, and had learned much of their power from Sith artifacts that survived the conflict. Even before Qel-Droma joined their ranks, the power-hungry and very hostile Krath had staged a violent military coup in their native system, crushed all resistance and declared war against the Galactic Republic, carrying out also brutal attack on the Jedi Order, which resulted in massive Jedi casualties."}, {"tag": "p", "text": "Finding about the Krath, Exar Kun set off to their headquarters located in the Iron Citadel with intent to eliminate the self-proclaimed followers of Sith teachings. However, during the lightsaber duel between Kun and Qel-Droma, the spirits of a number of long-dead Sith Lords appeared, including that of Marka Ragnos, and they put a stop to the duel. Ragnos named Kun the new Dark Lord of the Sith and Qel-Droma his apprentice, believing that they would restore the Golden Age of the Sith. Uniting their forces, both Sith Lords vowed to raze the galaxy and destroy both the Republic and Jedi. This led to a shortly reborn Sith Empire under their reign which caused great destruction. Empress Teta, a very heavy-fortified planet in the Deep Core and the capital of the Krath faction, became the second Sith stronghold."}, {"tag": "p", "text": "The Great Sith War, which tore the galaxy apart and led to massive casualties, had begun. Exar Kun's and Ulic Qel-Droma's first act as Sith Lords was to consolidate the space immediately surrounding the Empress Teta system. To accomplish this goal, Kun used one of the many relics of Naga Sadow's which he had found on Yavin 4—the Dark Reaper. The superweapon was a very effective tool, which helped kill thousands of Republic soldiers and Jedi Knights. A memorable genocide ensued, spreading great fear throughout the galaxy. However, both Sith Lords knew that to challenge the Republic's rule over the galaxy and destroy the Jedi Order, they would need a larger Sith army, including more Force-users. Although their military forces consisted of devoted to the cause Krath troops and fanatically loyal Massassi soldiers, and they managed to gain some footholds in the galaxy, the Sith Empire appeared to be overstretched by their campaigns."}, {"tag": "p", "text": "In the first year of the war the Sith Empire entered into a non-aggression alliance with the Hutts, forcing the Republic to take action to remove the new ally of the Sith. Shortly after a new opportunity for the Sith Empire appeared on the horizon. When Mandalorian Crusaders invaded the Empress Teta system, supreme commander of Mandalorian forces, Mandalore the Indomitable challenged Ulic Qel-Droma to a duel on Kuar, promising his allegiance in case of defeat. The Sith Lord won this honorary battle, so Mandalore and all armies under his command swore loyalty to the Sith. With addition of well-trained and disciplined forces, specific resources in terms of war production and worlds conquered during the Mandalorian Crusade, the Sith Empire expanded greatly and strengthened, allowing the Sith to escalate the war to new heights. Now Mandalore, homeworld of many Mandalorian clans, joined the group of Sith Empire strongholds. In an effort to weaken the Republic, joint Krath/Mandalorian forces launched a series of successful raids against the Republic's shipyards and stole many warships, adding them to their already expansive fleets."}, {"tag": "p", "text": "Combating the Jedi Order also seemed to be going very well. Believing that his empire must have a strong and united group of fellow Force users, who would replace the weak and dogmatic Jedi Order, Exar Kun founded the Brotherhood of the Sith and recruited many Jedi into his new Sith organization. Some of them joined of their own free will, others were corrupted by Sith magic. Over time the Sith Brotherhood was full of Sith Acolytes, Dark Jedi, Krath cultists and Death Witches - all of them took part in killing many Jedi. For example, ex-Jedi Knights, possessed by the dark side spirits, were responsible for carrying out mass murder of the famous Jedi Masters. As in any war, some opportunistic mercenaries, criminals, smugglers and collaborators offered their service to the Sith Brotherhood."}, {"tag": "p", "text": "The Brotherhood of the Sith also received support from the Mecrosa Order headquartered in the decadent Tapani sector. The Order, under the leadership of High Lady Brezwalt III, began contributing financially to Sith war effort and sending very skilled assassins on Kun's secret missions. Now the Republic had to struggle with four aggressive and determined military factions in various parts of the galaxy, which were very close to topple the dominant galactic government."}, {"tag": "p", "text": "The Sith Empire's odds of winning the war were quite good, however after months of conquering planets from the Deep Core to the Outer Rim the Battle of Coruscant revealed the first signs of its crumbling - inner tensions, a well-known bad omen. Though Kun managed to kill Supreme Chancellor Sidrona in front of the Galactic Senate, slay Master Vodo-Siosk Baas, rescue his apprentice, Qel-Droma from imminent execution and plunder the Ossus library, the Jedi and Republic military decided to organize a decisive strike straight at the heart of his empire. The defecton of Ulic Qel-Droma, who revealed the secret location of the Brotherhood of the Sith's main staging center, led to Kun's defeat at Yavin 4 in 3996 BBY. At the same time, the Mandalorian clans were routed on Onderon with their leader, Mandalore the Indomitable killed. After these milestone events the Sith Empire lost its backbone."}, {"tag": "p", "text": "With the defeat of two Sith Lords, neutralization of the Sith powers on Yavin 4, the elimination of almost the entire Massassi race, killing many Sith Brotherhood members, halting Mandalorian Crusaders conquest and disabling the Dark Reaper on Thule, the Republic and Jedi had to wipe out the Empire's only remaining remnants — the Krath and Mecrosa Order. The first faction had retreated the bulk of its military to the Empress Teta system and it turned out to be a big mistake, because the Republic military laid a prolonged siege to the seven Empress Teta worlds, eventually recapturing the system and scattering the Krath remnants. The same happened in the Tapani sector - with the help of House Pelagia the Jedi Order destroyed the Mecrosa Order sponsored by House Mecetti. Exar Kun's Sith Empire virtually ceased to exist."}, {"tag": "p", "text": "After the Empire's collapse, some of its officials, leaders and commanders went into hiding. Many retreated to the Outer Rim, near Korriban which after the war remained under Sith control, waiting for the opportune moment to regain power. Mandalorians managed to do it before them, starting the next great war in the galaxy. The Sith heirs of Kun's Empire got finally their chance when Darth Revan and Darth Malak established their new Sith Empire in 3959 BBY."}, {"tag": "h2", "text": "Symbols of the Sith Empire"}, {"tag": "h2", "text": "Government and Politics"}, {"tag": "p", "text": "The Sith Empire was a magocratic and theocratic state. Its leader was the Dark Lord of the Sith Exar Kun alongside with his Sith apprentice, another Sith Lord Ulic Qel-Droma, who was his second-in-command, though this Sith Lord was quite independent regarding making political and military decisions. Other positions of power included Emperor/Empress of the Empress Teta system (Ulic Qel-Droma, Aleema Keto), the Krath Council based in Cinnagar (subordinates to the rulers of the Empress Teta system), Mandalore, the Indomitable leader of the Mandalorian Crusaders and Grand Master of the Mecrosa Order (High Lady Brezwalt III). These officials all led their own organizations in any way that pleased them, but were obliged to obey the orders issued by both Sith Lords."}, {"tag": "p", "text": "Just like the Jedi Order protected the Galactic Republic, the Sith Empire had its own state religious body called the Brotherhood of the Sith. It consisted of the Jedi corrupted by Sith magic, fallen Jedi, who joined of their own free will (Dark Jedi) and various Sith Warriors like Sith Marauders. They were supported by the Krath cultists and Mecrosa Order assassins. The predecessor of the Sith Brotherhood was the Naddists, a Sith cult ruled by King and Queen of Onderon, which was defeated before the establishment of the Sith Empire."}, {"tag": "p", "text": "The spiritual leader of the Empire was the ancient Dark Lord of the Sith Freedon Nadd, who had a big impact, both on the development of the Brotherhood of the Sith and Krath. However, his authority was challenged and he ceased to exist due to the actions of his successor."}, {"tag": "p", "text": "The main goal of the Empire was to overthrow the Republic and annihilate the Jedi Order, so its policy was to sow chaos and discord on a high level in the galaxy. Although its leaders based the new Empire on the model of the ancient one and vowed to bring back the traditions of the Golden Age of the Sith, destruction of their enemies was a top priority for them and was more important than gaining new territories like planets and hyperspace routes. While leading their campaigns, neither the Krath nor their Mandalorian allies had much interest in maintaining infrastructures or civil order. Therefore the Empire was known for its horrible atrocities, fondness for slavery, genocidal actions and devastation of worlds. However its forces managed to conquer some Republic worlds and gain footholds in various parts of the galaxy. The Sith garrisons, under the command of a Sith Lord/Krath commander and composed of Krath soldiers and war droids were tasked with defending conquered and occupied territories."}, {"tag": "p", "text": "The Empire used also, though rarely, diplomatic means. The most famous case is this, when it signed a non-aggression pact with the Hutts in the first year of the war."}, {"tag": "p", "text": "The factions of the Empire divided responsibilities between each other. The Sith Brotherhood devoted most of its time and effort to fight the Jedi Order and was remembered in the history for planning and executing the methodical killing of famous Jedi Masters, event which came to be known as the Jedi pogrom. The Mecrosa Order produced additional Force-using assassins. The Krath and Mandalorian Crusaders led military campaigns against the Republic mostly separately, but sometimes they took part in joint-military operations, including Battle of Foerost and Battle of Coruscant. Both factions carried on spectacular terrorist raids on Republic shipyards."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "The military forces of the Sith Empire was a mix of weapons of war battleships (Force-powered superweapons), battle droids and organic forces. The commander-in-chief was Exar Kun, who approved strategic attacks. Brotherhood of the Sith, Krath and Mandalorians had their own command structure, but there was a coordinator between them - a fallen Jedi Knight, Ulic Qel-Droma. He was the second Sith Lord and Kun's apprentice, co-ruler of the Empress Teta system, supreme commander of the Krath military forces and honorary master to Mandalore the Indomitable."}, {"tag": "p", "text": "The army consisted mainly of well-trained soldiers and fighters, including Tetan shock troopers, Krath troops, Mandalorian Crusaders, Massassi soldiers, Sith Marauders, Sith Acolytes, Dark Jedi, Mecrosa Order assassins, and other Darksiders. There were also brainwashed followers, who participated in suicide missions, known as (Chaos troopers). The Empire deployed also battle droids like Krath war droids, designed to fight the Jedi, and Basilisk war droids, produced and used by the Mandalorians. The creatures (silans, terentateks, giant wyrms) were also common in the armed forces of the Empire."}, {"tag": "p", "text": "The fleet boasted Supremacy-class attack ships, warships, Tetan Assault Ships, CX-133 Chaos fighters, Flying Decks, Mandalorian starships (Kyramud-type battleships, Shaadlar-type troopships, Davaab-type starfighters) and Republic warships stolen from the assaulted shipyards."}, {"tag": "p", "text": "Sith sorcery was a powerful military tool of the Empire. Sith amulets, large-scale illusions, swords, spellbooks and holocrons sometimes decided the outcome of a duel or battle. The Sith also utilized superweapons - notable examples were the Dark Reaper and Corsair."}, {"tag": "h2", "text": "Economy"}, {"tag": "p", "text": "The Sith Empire had a very diverse economy, because its wealth and military power were built by four disparate factions. Exar Kun's Sith Empire was born out of war, so it placed their entire economic, industrial, and scientific capabilities at the service of the war effort."}, {"tag": "p", "text": "The Brotherhood of the Sith, desiring to restore the traditions of the Golden Age of the Sith, planned to build the economic strength of their Sith Empire on the basis of slavery. Just like the ancient Sith Lords, they believed that extensive use of slave labor, is one of many factors that gives the Empire a military and economic advantage. It can be assumed that some other species, besides the Massassi, were transformed into \"willing\" slaves by Sith magic, which could even corrupt powerful Force-users."}, {"tag": "p", "text": "The Krath, whose leadership descended from the Tetan Monarchy, had the strongest and most developed economy. After the Great Hyperspace War, Empress Teta system experienced vigorous economic development. It was well known in the galaxy as being a prominent producer of carbonite, a mined ore that was an integral component in the manufacture of starship parts, most notably hyperdrive engines. The Carbonite Guild, a powerful and influential mining conglomerate associated with the Mining Guild and sharing rule over the system with the Tetan royalty, oversaw the production of this metal alloy. The system had also its own shipbuilding industry with Koros Spaceworks being the main Tetan starship manufacturer. After the violent coup, the Krath not only seized military and governmental control of the Empress Teta system, but also took control of the most important state-owned companies, using all their assets and resources to fund their military expansion in the galaxy. Being a Sith inspired cult, they legalized slavery and launched numerous military slave raids. It should be noted that some of Tetan technology was outdated and needed updates, which were eventually introduced by Ulic Qel-Droma."}, {"tag": "p", "text": "Mandalorian Crusaders implemented a centrally planned economy. It was structured around clans, who administered land the way they pleased, but were obliged to gear all materials and resources towards war production, when general economic mobilization for war was announced by their warlord, Mandalore. Mandalorian daily life was defined by conquests, so they exploited conquered worlds and species, though they respected alien technology and employed it to design new machines and weapons of war."}, {"tag": "p", "text": "The Mecrosa Order was sponsored by House Mecetti, a coalition of noble families that ruled the Mecetti Province, thus controlling the entire Leozi Route and a portion of Procopian Shipping Lane. House Mecetti, tainted by the dark side, sought to realize their imperialistic ambitions in the Tapani sector and establish a true Mecetti Empire. Disposing of the leaders of some rival houses and absorbing their territories, Mecetti were very close to achieving their goals. Though they maintained an isolationist policy, they decided to financially contribute to Kun's Empire in order to further weaken the Galactic Republic. For example, Sith Lords were granted tax-free holdings on the world Nyssa, where there was an ancient castle of the Mecrosa Order."}, {"tag": "h2", "text": "Astrography"}, {"tag": "p", "text": "During the Great Sith War, Exar Kun's Sith Empire's territory was spread across the whole known galaxy, stretching from the Deep Core to the Outer Rim Territories. The following list includes worlds controlled by the various factions of this empire (Brotherhood of the Sith, Krath, Mandalorians, Mecrosa Order) as well as Republic planets conquered by Kun's forces at different times of the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The relation of the Sith Empire to the Brotherhood of the Sith is not said, though both are mentioned separately in the Knights of the Old Republic Campaign Guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}