{"url": "Sith_Eternal_military", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Military stubs", "Category:Sith Eternal military units"], "nodes": [{"tag": "h1", "text": "Sith Eternal military"}, {"tag": "p", "text": "The military of the Sith Eternal comprised the various branches of the armed forces of the Sith Eternal, including an army and an extensive fleet, the Final Order. Formed prior to 35 ABY on the Sith world Exegol, it was defeated by the Resistance and the citizens' fleet at the Battle of Exegol during the war between the Resistance and the First Order."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Sith Eternal's military was created on Exegol from materials provided by corporations such as Kuat-Entralla Engineering and Sienar-Jaemus Fleet Systems, whose directorates were infiltrated with Darth Sidious' Sith loyalists. Its military members were young humans raised on the Sith world after the fall of the Emperor in 4 ABY."}, {"tag": "h3", "text": "Final Order"}, {"tag": "p", "text": "The Final Order was a fleet assembled on Exegol prior to Kylo Ren's arrival. This military branch was to aid the Sith in establishing a new Sith Empire over the galaxy. The fleet consisted of over a thousand Xyston-class Star Destroyers equipped with axial superlasers able to destroy entire planets and thousands of TIE/dg starfighters."}, {"tag": "h3", "text": "Sith Eternal army"}, {"tag": "p", "text": "The Sith Eternal army was composed of Sith troopers, Sith Jetpack Troopers, and the elite Sovereign Protectors. They utilized advanced AAL-2100/9.5 atmospheric assault landers. The Sith troopers were divided into legions named after ancient Sith Lords, while the Sith jet troopers were divided into squads named after Sith weaponry."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This military force was revealed to the galaxy in a demonstration of its destructive potential; one of the Final Order's Xyston-class Star Destroyers, the Derriphan, utilized its axial superlaser on the Mid Rim planet Kijimi, resulting in the decimation of the planet in a scale comparable to that of the Death Stars' and Starkiller Base's superweapons. This represented the true power of the military force and demonstrated the Sith Eternal's ability and willingness to obliterate entire planets, which refused to submit to the Emperor's authority."}, {"tag": "p", "text": "This military suffered extensive losses during the Battle of Exegol, where the Resistance and its allies—the citizens' fleet—emerged victorious from confronting the resurgent Emperor, who also perished on the world at the hands of his granddaughter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}