{"url": "Sith_Council", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Legislatures", "Category:Sith Councilors", "Category:Sith political factions"], "nodes": [{"tag": "h1", "text": "Sith Council"}, {"tag": "p", "text": "The Sith Council was a group of ten Sith Lords within the Sith Empire who served as advisors to the reigning Dark Lord of the Sith. This Council convened in a great citadel on Ziost. The Sith Council managed the affairs of the Empire. Each Lord that sat on the Council personally ruled over a minimum of a dozen worlds."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Naga Sadow, Ludo Kressh, Simus, Dor Gal-ram, and Horak-mul were five of the ten Sith Lords on the Council under Marka Ragnos. After Ragnos's death, two Lords on the council, Naga Sadow and Ludo Kressh, fought over the position of Dark Lord of the Sith. This conflict created a rift within the council, with several lords siding with Kressh, and the rest siding with Sadow."}, {"tag": "p", "text": "Eventually, Sadow was able to convince the council to make him Dark Lord after he convinced them that the Galactic Republic was executing hit-and-run attacks within the Empire. After Ludo Kressh discovered the deception, he and two other lords attacked Sadow's fortress, but they were soundly defeated, and Sadow secured his hold over his title."}, {"tag": "p", "text": "The Sith Lord Vitiate summoned the remaining members of the Council, along with almost 8,000 other Sith, to his homeworld of Nathema, where he broke their wills and forced them to participate in the Ritual of Nathema—an act that killed everyone on Nathema other than Vitiate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In a scene in Tales of the Jedi – The Golden Age of the Sith 3 the faces of eight members are shown (excluding Naga Sadow and the already dead Simus). Only one other person (besides Sadow) on the council seems to have Dark Jedi blood with the absence of protruding eyebrow ridges and a squashed nose."}, {"tag": "p", "text": "The Essential Chronology refers to it both as \"a tribunal of Sith Lords\" and the \"Sith council.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}