{"url": "Sith_Citadel", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Buildings", "Category:Exegol locations", "Category:Locations of the Sith", "Category:Sith Eternal"], "nodes": [{"tag": "h1", "text": "Sith Citadel"}, {"tag": "p", "text": "The Sith Citadel, also called the Citadel, was an ancient fortress located on the elusive Sith world of Exegol. It was the headquarters of the Sith Eternal cult following the demise of the last two Sith Lords at the Battle of Endor and contained the throne of the Sith, which the resurrected Dark Lord of the Sith, Darth Sidious, intended it to serve as the seat of his new Sith Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Citadel was both under and above ground, with the latter being a large, upside-down truncated pyramid structure made of black stone. The structure floated above Exegol's surface, with a platform being used to lower individuals into the underground portion of the Citadel."}, {"tag": "p", "text": "The Sith Citadel contained a large hall filled with ancient Sith statues, which included likenesses of Locphet, Mindran, Sissiri, Felkor, and Sadow. The Sith stronghold also featured an amphitheater that housed the throne of the Sith, and at least one other room used for medical purposes, such as genetic experimentation and life support."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The Sith Citadel on Exegol was one of the earliest bastions of the Sith."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "At some point during the reign of the Galactic Empire, Darth Sidious had two Sith wayfinders created to guide the way to the Citadel on Exegol. One was made for himself and stored within his throne room within the second Death Star, while the other was given to his apprentice, Darth Vader, who stored the cosmic navigator within his castle on Mustafar."}, {"tag": "p", "text": "After Sidious' rise to power, and his vanishing from public view, he prepared the throne in the Citadel to become his permanent seat of power. During this time, the Sith Eternal began experimenting with genetic augmentation and cloning technology in an effort to extend, and ideally, indefinitely sustain Sidious' life."}, {"tag": "h3", "text": "First Order-Resistance war"}, {"tag": "p", "text": "Sometime following the Battle of Endor, Sith cultists chose the Citadel to be their new fortress, as they believed Moraband—while once the greatest fortress of the Sith—was too likely to be discovered. At some point, Sidious was resurrected and came to reside at the Citadel, where he guided the actions of Snoke, whom Sidious himself had created sometime before, both to test Kylo Ren's worthiness to inherit the mantle of a Dark Lord of the the Sith and to rule over the First Order while Sidious plotted in the shadows."}, {"tag": "p", "text": "Meanwhile, Jedi Master Luke Skywalker believed the conflict with the Sith was not over despite Vader's conversion to Anakin Skywalker and the death of Sidious above Endor. He and Lando Calrissian set out to locate the Emperor's wayfinders in the hopes of locating the Citadel on Exegol, where Luke believed he could end the conflict with the Sith once and for all. Luke's hunt went cold on Pasaana and he ultimately went into exile on Ahch-To following the fall of his nephew, Ben Solo."}, {"tag": "p", "text": "In 35 ABY, Supreme Leader Kylo Ren arrived at the Citadel with the intent of eliminating the resurgent Emperor, whom Ren believed to be a threat to his newly obtained power. However, Sidious convinced Ren to instead renew his resolve in the hunt for the Jedi apprentice Rey, revealed to be the granddaughter of Palpatine himself. In exchange for the killing of  Rey, Sidious promised Ren authority over the Final Order, a massive fleet of Xyston-class Star Destroyers with  the destructive capacity to force the entire galaxy into eternal submission. However, Ren was turned from the dark side through the combined efforts of Rey and his dying mother, Leia Organa, and a Force vision of his father Han Solo and became Ben Solo once again."}, {"tag": "p", "text": "After using Ren's wayfinder, Rey arrived at the Citadel and confronted Sidious. However, Sidious told Rey that he never wanted her dead, but to have her kill him so his spirit can pass onto her and become Empress. If she refused, her friends would all be killed, as the battle was intended to be a trap so the Resistance can be wiped out by the Sith Eternal forces once and for all. As a redeemed Ben Solo arrived, she refused Sidious's offer to become a Sith and, joined by Ben, attempted to kill the Dark Lord once and for all. Instead, Sidious used their dyad in the Force to restore his mortal body. From the Throne of the Sith, Sidious unleashed a storm of power that nearly destroyed the Resistance forces. However, empowered by the voices of all the Jedi who came before her, Rey stood and defeated Sidious by reflecting his lightning back at him. The resulting shockwave destroyed the Citadel, its cultists, and left Rey alone, where she effectively died.  The explosion also ended the conflict between the Sith and Jedi once and for all. Rey was revived by Ben Solo, who used Force healing in conjunction with his dyad with Rey to trade his life for her's. Ben died in the ruined Citadel, and became one with the Force. Rey flew away from the ruins in Luke Skywalker's X-wing just as most of the Sith fleet fell to the ground in ruins."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}