{"url": "Sith", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles in need of updating", "Category:Cleanup", "Category:Pages needing citation", "Category:Religious organizations", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Sith"}, {"tag": "p", "text": "The Sith, also referred to as the Sith Order, was an ancient religious order of Force-wielders devoted to the dark side of the Force. Driven by their emotions, including hate, anger, and greed, the Sith were deceptive and obsessed with gaining power no matter the cost. The order reached the apex of its power under Darth Sidious, the Dark Lord of the Sith who achieved his order's goal of galactic conquest after a millennium of plotting. Within a generation, however, the deaths of Sidious and Darth Vader would mark the end of the order of Sith Lords."}, {"tag": "p", "text": "Thousands of years before the Clone Wars, the Jedi Order was fractured by a schism that began when a rogue and his followers turned away from the light side of the Force, believing the dark side was the path to true power. Having relocated to the planet Korriban in the Outer Rim Territories, their movement ultimately evolved into the Sith Order, resulting in a war between the former brothers and sisters in the Force as the Jedi Knights rallied to the defense of the Old Republic. Although the Sith were driven off of the Core World Coruscant by 5000 BBY, centuries of conflict ensued between the two orders, culminating in the Old Republic's collapse. Undermined by constant infighting and ruined by the last war against the Jedi, the Sith were rendered all but extinct with the exception of one; Darth Bane survived the ancient order's destruction and passed his knowledge to a single apprentice, Darth Zannah, before being entombed on Korriban, which became known as Moraband. Henceforth, the Sith was governed by the Rule of Two, a new philosophy dictating that only two Sith Lords—a Sith Master and a Sith apprentice—could exist at any given time. As a result, the Sith were all but forgotten while the Jedi focused their efforts on preserving the new age of peace under the modern Galactic Republic."}, {"tag": "p", "text": "The Sith remained in hiding for a millennium until the rise of Darth Sidious and Darth Maul in 32 BBY. Sidious, trained by Darth Plagueis, hid in plain sight as Senator Sheev Palpatine of Naboo. Orchestrating the blockade and invasion of his homeworld by the Trade Federation, Sidious maneuvered the Galactic Senate into electing him to the office of Supreme Chancellor. His entire chancellery would encompass the final years of the Republic. Over the next decade Sidious sowed the seeds of discontent within the galactic populace with the help of his new apprentice, the former Jedi Master Count Dooku, who adopted the name of Darth Tyranus and became the public face of the Independent Movement for Self-Determination. The Separatist Crisis culminated in the formation of the Confederacy of Independent Systems and the creation of the Separatist Droid Army which, in turn, compelled the Senate to support the establishment of the Grand Army of the Republic."}, {"tag": "p", "text": "The Clone Wars began with the First Battle of Geonosis in 22 BBY, after which entire armies of battle droids and clone troopers deployed across the galaxy, making war and devastation commonplace for the first time since the formation of the Republic. In the final months of the Clone Wars, Sidious sacrificed Tyranus as part of his plot to turn Anakin Skywalker, the Jedi Order's prophesied Chosen One, to the dark side. Playing on Skywalker's fear of losing his secret wife, Senator Padmé Amidala, Palpatine revealed his true identity while claiming that the dark side was the path to immortality. Members of the Jedi High Council, having learned from Skywalker's report that the chancellor was, in fact, a Sith Lord, attempted to arrest Palpatine, but the chancellor resisted. Torn between his faith in the Jedi and the fate he foresaw for his wife, Skywalker ultimately chose the Sith by betraying Mace Windu, allowing Sidious to kill the Jedi Order's great champion."}, {"tag": "p", "text": "Using the incident in the chancellor's office to frame the Jedi Order for treason, Sidious declared Order 66 was in effect, marking all Jedi as enemies of the state. The clone troopers' programming turned them against their Jedi Generals, who were betrayed and executed across the galaxy. With the majority of the order falling victim to the Great Jedi Purge, Sidious announced the creation of a new regime, transforming the Republic into the First Galactic Empire in 19 BBY. With the former Anakin Skywalker, renamed Darth Vader, at his side, the self-proclaimed Galactic Emperor's rise to power was complete, and the Sith were restored to dominance after centuries of plotting."}, {"tag": "p", "text": "The Sith's control of the galaxy remained relatively unchallenged for a generation until the birth of the Alliance to Restore the Republic which, in turn, led to the Galactic Civil War in 0 BBY. The Emperor, having felt a disturbance in the Force, discovered that his apprentice's long lost son, Luke Skywalker, was training to become Jedi. Aware of the potential Luke inherited from his father, the Emperor foresaw the possibility of his own destruction but resolved to turn the young man to the dark side as he did with Vader. During the Battle of Endor in 4 ABY, the Emperor forced father and son into a duel, which ended with Luke disarming Vader. However, he confounded the Emperor with his refusal to take Vader's place as Sidious' next apprentice. Knowing he had lost Luke to the Jedi, the Emperor proceeded to torture Luke with torrents of Force lightning. At that moment, Vader, overwhelmed by his son's compassion for him, chose to save Luke by killing his master."}, {"tag": "p", "text": "The death of Darth Vader, who succumbed to his injuries, marked the end of the Sith, bringing balance to the Force. Yet while the Chosen One prophecy foretold the Sith's destruction, it never predicted the end of the dark side. Approximately thirty years after the last battle in the Galactic Civil War, the First Order emerged from the Unknown Regions, seeking to reclaim the legacy of the Empire by overthrowing the New Republic. At this time, a new generation of dark side wielders surfaced; Supreme Leader Snoke and his dark apprentice Kylo Ren, who was the grandson of the late Darth Vader, commanded the First Order's armies as well as the Knights of Ren. Ultimately, Ren succeeded to Snoke's throne during the war against the Resistance. As the new Supreme Leader, he vowed to forge a new galactic order by destroying the legacies of both Sith and Jedi."}, {"tag": "p", "text": "Unbeknownst to Ren, however, Snoke was in fact only a creation and tool of a reborn Darth Sidious. Supported by the Sith cultists of the Sith Eternal on Exegol, the legendary hidden world of the Sith, Sidious announced his return to the galaxy and revealed the Final Order. Sidious's emergence from hiding resulted in desperate final battle with the Resistance which saw the Jedi Rey band together with a redeemed Ben Solo to destroy Sidious, preventing the rebirth of the Sith."}, {"tag": "h2", "text": "Philosophy"}, {"tag": "p", "text": "The Sith focused on primal emotions like anger and pain in order to gain power from the dark side of the Force. They followed a code that was the antithesis of the Jedi Code. The Sith code insisted on the importance of passion and the rejection of peace."}, {"tag": "p", "text": "The Sith wore clothing that obscured their identity while in hiding. They used the term \"dark side\" because they were secretive. The Sith felt it was easier to impose order if they kept their identities and knowledge a secret or, as Lona Aphra put it, \"hidden—in the dark.\""}, {"tag": "p", "text": "The Rule of Two ensured the relationship between a Sith Master and their apprentice was not one of trust; indeed, both the master and the apprentice constantly searched for any sign of weakness in the other, for a weak master deserved to be overthrown by their pupil, just as a weak pupil deserved to be replaced by a worthier, more powerful recruit. This philosophy was embraced by the Sith, who adopted it as a way to purify the weak and become stronger over time, since only an apprentice who had surpassed all previous Sith could take their master's place through honorable combat."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Ancient times"}, {"tag": "h4", "text": "The Hundred-Year Darkness"}, {"tag": "p", "text": "Formed thousands of years before the Clone Wars, the Sith were the ancient enemies of the Jedi Order who shared their name with a red skinned species. Established by a rogue Jedi during the Hundred-Year Darkness, the Sith sought further knowledge and power through learning the dark side of the Force. Eventually, this Jedi was able to amass a sizable following, all of whom adhered to this new philosophy that embraced the dark side. This schism in the Jedi Order led to a civil war where the Jedi and the newly-founded Sith Order, once brothers and sisters in the Force, fought against one another for power. The war ended in the defeat of the Sith, who fled from known space. Unbeknownst to the Jedi, however, the Sith settled on Moraband, a world of red sands that was known in antiquity as Korriban, where they rebuilt in secret and waited for another chance to strike."}, {"tag": "h4", "text": "Exile on Moraband"}, {"tag": "p", "text": "As the Sith Order grew, they constructed massive temples and tombs on Moraband in a location known as the Valley of the Dark Lords. The Sith built empires on the backs of their slaves and fought wars against the Jedi for control of the galaxy. During these wars, they built massive superweapons powered by giant kyber crystals. Eventually, an area of the Outer Rim came to be known as the Cloak of the Sith, a name which was similar to how Sith Lords were known to wear dark cloaks."}, {"tag": "h4", "text": "War on the Republic"}, {"tag": "p", "text": "It was believed the lightfoil was made by the early Sith. At one point, nearly five thousand years before the rise of the Galactic Empire, the Sith waged a war against the Jedi and the Old Republic. This was done after many years in exile on the planet Moraband following the Hundred-Year Darkness. During this war, the Sith attacked the Republic capital Coruscant. This allowed the Sith to build a shrine on the planet, which became a place of immense dark side power. Eventually, the Jedi were able to repel the Sith from Coruscant. Around this time, the Massassi, a slave race controlled by the Sith, constructed the Great Temple on Yavin 4, under the leadership of the Sith Lord Naga Sadow. Roughly a thousand years after the war, the Jedi raised their own temple over the Coruscant shrine in an attempt to contain and eliminate its power."}, {"tag": "h4", "text": "Malachor—bastion of the Sith"}, {"tag": "p", "text": "The Sith continued to expand their empire erecting temples on multiple planets. One such temple was built on the world Malachor. At the heart of this temple was a superweapon powered by a giant kyber crystal. The Jedi eventually learned of the weapon and assaulted the temple. A savage battle was then waged between the Sith Empire and the invading Jedi Knights. During the battle, the temple was activated, petrifying everyone on the planet. This would result in the planet being forbidden from Jedi and becoming a legend for millennia to come."}, {"tag": "h4", "text": "The rise and fall of Darth Momin"}, {"tag": "p", "text": "The Sith Lord Darth Momin, after killing his Master Darth Shaa, sought more knowledge in the dark side. He decided that his only audience was the Force and yearned to be worthy of it. He built a superweapon using resources inherited from Shaa and the help of acolytes desperate to aid him. Darth Momin's superweapon had the power to incinerate an entire city, but his true plan was different. He wanted to pour the Force into the weapon's engine and freeze the terrified expressions of the people in time forever, creating an artwork depicting fear and pain devoted to the dark side of the Force. When he attempted this, the Jedi intervened and Momin's body was destroyed, yet his mind remained inside his mask where he waited for his revival as ages passed."}, {"tag": "h4", "text": "Conflict for the Force"}, {"tag": "p", "text": "During one conflict, the Jedi and Sith fought on the planet Takodana. The pirate Maz Kanata later built her castle on top of the legendary battlefield. Jedi Master Tal Bota was a legendary Jedi who often fought against the Sith. His life became the inspiration for holostories, one of which depicted him fighting many Sith troops at once."}, {"tag": "p", "text": "The legendary Sith Darth Wrend fought against the Jedi. Despite being believed dead, Wrend returned to continue to battle. At some point, the Jedi Radaki fell to the dark side, becoming the Sith Darth Krall and winning the Battle of Wasted Years. He also tamed the Nightmare Conjunction and wielded a lightsaber with a gold hilt."}, {"tag": "h4", "text": "The Dark Age"}, {"tag": "p", "text": "During a period of time known as the Dark Age, the Jedi-Sith War broke out. Early on in the war, the Sith attacked the Old Republic capital world of Coruscant. The Sith successfully captured the planet as well as the Jedi Temple. The Liberation of Coruscant was one of the last battles of the Jedi-Sith War and resulted in the Sith being driven from Coruscant."}, {"tag": "h4", "text": "Fall of the Sith"}, {"tag": "p", "text": "The Sith numbered thousands, yet they eventually fell, and despite the Sith armada's quantitative advantage over the much smaller Ghostfinder fleet, the Sith were outmatched. The Sith's quest to gain power was ultimately their undoing, as the dark side made them turn against one another. Within a year, the Jedi managed to defeat the infighting Sith, bringing what was left of the dark order to its knees. However, one Sith, Darth Bane, survived. With his fellow Sith Lords destroyed, he reformed the order by establishing the Rule of Two, mandating that only two Sith, a master and an apprentice, could exist at any given time, lest they fall prey to infighting. The Sith abandoned their traditional homeworld of Moraband after it was scarred by many wars. Eventually, Darth Bane was killed and was buried in the Valley of the Dark Lords on its surface, but the Rule of Two continued through his apprentice, Darth Zannah. It was rumored that Zannah had killed Bane on the Inner Rim planet of Ambria."}, {"tag": "p", "text": "Many Sith worlds were then quarantined, including Rhelg, Jaguada, and Ziost. Some worlds were so cleansed of their Sith history that even locals had no idea of their past."}, {"tag": "h3", "text": "Fall of the Galactic Republic"}, {"tag": "h4", "text": "In the shadows"}, {"tag": "p", "text": "The Sith stayed in hiding for a thousand years, their survival unknown to the Jedi as they plotted revenge. With Sith teachings passed down by the Rule of Two, the Order managed to survive. In 82 BBY, the Jedi Padawan Dooku, after encountering the Presagers of Hakotei cult, heard the voice of the Sith Lord Darth Skrye in a Force vision. Within the vision, Skrye stated that the Sith were reborn and used the Cauldron, a superweapon that ripped a planet into two pieces."}, {"tag": "p", "text": "Eventually, the Sith apprentice known as Darth Sidious killed his master, Darth Plagueis, in his sleep, seizing the status of master for himself as he forwards a plot to destroy the Jedi. Thus, generations after the fall of the Sith, Sidious moved to strike a fatal blow against the Jedi Order and the Galactic Republic. Orchestrating his public persona's rise to the Republic's Chancellorship and the creation of an army that would purge the Jedi, Darth Sidious fulfilled the return of Sith rule over the galaxy, giving rise to the New Order under himself as Emperor."}, {"tag": "h4", "text": "The phantom menace"}, {"tag": "p", "text": "The Sith remained a distant memory until the last days of the Galactic Republic when Darth Sidious and his apprentice, Darth Maul, revealed themselves to the Jedi."}, {"tag": "p", "text": "Sidious hid in plain sight as the unassuming Senator Sheev Palpatine of Naboo while secretly orchestrating with the Trade Federation for the invasion of his home planet. This allowed the Dark Lord to make a play for the galaxy's highest office in his civilian persona and sow the seeds of Sith revenge. Maul attacked Queen Amidala of Naboo and later killed Jedi Master Qui-Gon Jinn, but to the dismay of Sidious, fell to Jinn's Padawan, Obi-Wan Kenobi. Despite this setback, the Sith had returned, clouding the Force with the power of the dark side. The arrival of Anakin Skywalker, a young boy especially strong with the Force, into the Jedi Order offered a potential recruit for the Sith with Darth Sidious in the public persona of Palpatine, who had become Supreme Chancellor of the Republic."}, {"tag": "h4", "text": "Separatist Crisis"}, {"tag": "p", "text": "Following Maul's apparent demise on Naboo, Darth Sidious approached the fallen Jedi Master Dooku, who had taken on the title of Count of Serenno, and offered him the chance to destroy the Jedi Order and reshape the Republic by becoming his new apprentice. Dooku agreed and was given the name Darth Tyranus, desiring both power and the elimination of the corruption that plagued the Republic."}, {"tag": "p", "text": "For nearly a decade after accepting Sidious's offer, Tyranus helped his new master to implement much of the groundwork necessary to begin the Clone Wars. During this period, Tyranus also recruited fallen Dathomirian Jedi Asajj Ventress as his assassin and potential Sith apprentice."}, {"tag": "p", "text": "Darth Tyranus, under his public identity as Dooku, reentered the public eye in spectacular fashion, commandeering a Galactic Republic Holonet station in the Raxus system and delivering a rousing speech in which he thoroughly lambasted the corruption and shortcomings of the Republic. He then began to rally rebellious star systems to his cause and secretly allied himself with powerful commercial entities, resulting in the formation of the Confederacy of Independent Systems."}, {"tag": "p", "text": "War broke out as both the Confederacy's droid armies and the newly-formed Grand Army of the Republic fought over the desert-landscape of Geonosis after the extent of Tyranus' secret alliance with the Trade Federation, the Techno Union, the InterGalactic Banking Clan, the Corporate Alliance, and the Commerce Guild was revealed. Though the Republic was able to score a victory, Tyranus and the rest of the Separatist leadership were able to escape the planet."}, {"tag": "p", "text": "In preparation for the upcoming galactic-scale conflict and its aftermath, Tyranus traveled to Coruscant's industrial district, known as the Works, after the First Battle of Geonosis, where he met with Sidious and delivered the \"good news\" of the war's beginning, as well as presented him with the plans for the DS-1 Death Star Mobile Battle Station."}, {"tag": "h4", "text": "The Clone Wars"}, {"tag": "p", "text": "In the aftermath of the battle at Geonosis, the Jedi, once peacekeepers, had become generals and commanders, ranks that they were formerly denied due to the Jedi Code. Ventress, as well as Dooku's other recruits, also benefited the Sith by concealing the fact that Dooku was merely an apprentice to Darth Sidious. For at least two years into the Clone War, many Jedi believed that Dooku had lied to Obi-Wan Kenobi on Geonosis about the existence of a second Sith Lord and that he was the master of the Order, allowing Sidious to continue manipulating the Republic for much of the war without arousing suspicion or unwanted attention.[source?]"}, {"tag": "p", "text": "On her tasks for the Sith, Ventress engaged Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano in lightsaber duels on numerous occasions. While loyal, she was ultimately betrayed by her Master on the orders of Darth Sidious. Dooku soon after traveled to Dathomir to meet with the Nightsisters in hopes of finding a new apprentice. Dooku and the Nightsisters eventually decided on a young Zabrak named Savage Opress, brother of the long-presumed dead Darth Maul. However, Asajj Ventress sought revenge for Dooku's treachery and used Opress as a means of attaining her goal. Torn between two demanding masters, Opress eventually turned on both Dooku and Ventress."}, {"tag": "p", "text": "Returning to the Nightsisters, Opress found that his brother, Maul, had not been killed as previously believed. Maul had survived his injuries on Naboo because of his sheer reliance on the dark side and was living in the junk heaps of Lotho Minor. However, Maul's tragic events had driven him to insanity. He remembered only one word: \"Kenobi.\" Guided by an Anacondan named Morley, Opress was able to return Maul to the Nightsisters for treatment. Now fully healed by the Nightsisters' magic and given a pair of new robotic legs, Maul began a hunt for the man who had nearly destroyed his life, Obi-Wan Kenobi."}, {"tag": "p", "text": "His revenge scheme eventually ended with Maul's control of Mandalore and the death of Kenobi's true love. However, Darth Sidious sensed his former apprentice's action and his stance as a potential rival, and traveled to Mandalore to put an end to it. He killed Opress and took Maul captive, locking him away in an old mountaintop prison known as the Spire, in an elaborate Sith gambit to settle a longstanding and deadly dispute with the Nightsisters."}, {"tag": "p", "text": "Later during the war, Yoda visited Moraband, the Sith homeworld. The Jedi Master encountered an illusory spectre of the ancient Sith Darth Bane, who was buried on the barren planet and battled Sidious on a spiritual plane as the result of an ancient, arcane Sith ritual. Through his experience, Yoda gained a new enlightenment about the Force that the Sith did not foresee."}, {"tag": "h4", "text": "Revenge of the Sith"}, {"tag": "h5", "text": "Seduction of the Chosen One"}, {"tag": "p", "text": "After three years of the Clone Wars, Darth Sidious' grand scheme was almost complete. He sacrificed Count Dooku to a violent killing by Anakin Skywalker to manipulate the young Jedi. As Palpatine, he told Anakin a Sith legend about Darth Plagueis the Wise. Plagueis, through the dark side, had gained the ability to keep people from dying until his apprentice killed him in his sleep. This story entranced Anakin, who was desperate to learn this power to save his wife, Padmé Amidala."}, {"tag": "p", "text": "Eventually, Palpatine revealed himself as Sidious and converted Anakin to the dark side. Jedi Master Mace Windu tried to arrest the Dark Lord but was killed after Anakin's late intervention, after this Anakin pledged himself to service under his new Sith Master, Sidious, and became Darth Vader."}, {"tag": "h5", "text": "A New Order"}, {"tag": "p", "text": "With a new Sith apprentice at his side, Sidious enacted his masterstroke: He executed Order 66, the slaughter of all Jedi, with Vader leading the siege of the Jedi Temple. He then ordered Vader to go to the Mustafar system to wipe out the Separatist Council and thus ending the Confederacy. In the political arena, he reorganized the Republic using the powers given to him as a result of the Clone Wars to transform the Galactic Republic into the Galactic Empire to restore the Sith Empire, installing himself as Emperor. Once more, the Sith ruled the galaxy, unbeknownst to all but the few surviving Jedi."}, {"tag": "h3", "text": "Rise of the Empire"}, {"tag": "h4", "text": "Consolidation"}, {"tag": "p", "text": "Following the reorganization of the Republic and purging of the Jedi Order, Darth Sidious and Vader ruled over the First Galactic Empire for over twenty years until the Battle of Endor. The two Sith Lords established a cadre of Dark Side wielders known as the Inquisitorius. The Inquisitors were tasked with hunting down Jedi Purge survivors and preventing Force-sensitive children from becoming Jedi. The leading Inquisitor was a Pau'an Grand Inquisitor, who was a former Jedi Sentinel and Knight. The Inquisitors were trained by Vader and wielded double-bladed spinning lightsabers."}, {"tag": "p", "text": "Sometime into the Imperial Era, Vader embarked on a mission to Mustafar. With him, he took the Chief Imperial Architect Colonel Alva Brenne, her assistant Lieutenant Roggo, and the mask that once belonged to Momin. Sidious had assured Vader that Momin's mask would guide him during his studies there. Whilst on the planet, Vader meditated in the Sith cave there. That was when Momin's mask possessed Roggo and Momin used his body to design a structure. When Brenne discovered this, she was shot dead, alerting Vader to the situation. Vader killed Roggo and removed the mask from his body. He took it to the Cave and reached into it using the Force. Momin revealed himself to Vader and told him his story, before attempting to possess him too. Vader resisted but came to let the mask take control of a Mustafarian, giving Momin a body again. The two discussed the structure Momin had designed and Momin claimed it could tune the energies of the dark side locus on Mustafar, opening the door to the dark side. Vader subsequently agreed to let him build the Fortress."}, {"tag": "p", "text": "Five years after the end of the Clone Wars, the Free Ryloth Movement led by Cham Syndulla embarked on a large-scale operation to assassinate the Emperor and Vader. Cham wanted to kill the two Sith Lords to bring about the demise of the Empire. However, Sidious had anticipated Cham's move, and the two Sith eluded Cham's attempts to assassinate them. This operation dealt a major blow to the Free Ryloth rebels, who were forced deeper underground, and also led to the exposure of Colonel Belkor Dray as a traitor. Despite Sidious' hopes, he failed to stamp out the sparks of the growing rebellion."}, {"tag": "p", "text": "After the outbreak of the Lothal insurgency about four years before the Battle of Yavin, Sidious dispatched Vader to hunt down the Spectres, who were part of the growing rebellion. Vader lured the Spectres into a trap on Lothal in an attempt to track down the Phoenix Cell. Vader led an attack on the Phoenix fleet which destroyed the rebel flagship Phoenix Home but failed to destroy the rebellion. During the skirmish, Vader discovered that his former apprentice Ahsoka Tano was still alive. Under Sidious' orders, he dispatched more Inquisitors to hunt down the Jedi Purge survivor Kanan Jarrus and his apprentice Ezra Bridger."}, {"tag": "h4", "text": "Struggle on Malachor"}, {"tag": "p", "text": "A year later, Vader visited the Lothal Jedi Temple where the Fifth Brother and the Seventh Sister had attempted to capture Ezra, Kanan, and Ahsoka. Vader remarked that the Emperor would be pleased with their discovery. When the Fifth Brother remarked that the power of the Jedi was growing, Vader responded that it would be their undoing. The Sith Lords later took an interest in the Sith temple on Malachor, which was reputed to be home to a weapon capable of destroying all life. Vader sent another Inquisitor called the Eighth Brother to hunt down a \"shadow\" and to obtain a Sith holocron."}, {"tag": "p", "text": "Ezra, Kanan, and Ahsoka encountered the former Sith apprentice Maul—who was the \"shadow\", whom the Eighth Brother was hunting - in the Malachor Sith Temple. Maul had become stranded on Malachor several years prior and had discovered a secret inside the Sith temple that would allow them to destroy the Sith. However, he lacked the strength to do so on his own. Maul managed to befriend Ezra and the two Force-wielders succeeded in obtaining the Sith holocron. Maul later helped the Jedi drive several Inquisitors away. Despite Kanan and Ahsoka's distrust, Maul managed to convince them to help him by teasing the opportunity of destroying the Sith once and for all."}, {"tag": "p", "text": "Maul convinced Ezra to place the Sith holocron in the obelisk at the top of the temple complex. He then helped Kanan and Ahsoka kill the Inquisitors before turning on both of them. Eventually, Maul blinded Kanan. Despite this, the Jedi Knight defeated Maul in combat and pushed him off the edge of the temple. Meanwhile, Ezra discovered that the Sith holocron was the key to reactivating the Sith temple, which was a powerful superweapon capable of destroying life. Shortly later, Darth Vader arrived to claim the temple's power for the Sith. Darth Vader fought with Ahsoka while Kanan and Ezra removed the holocron; triggering the temple's implosion. Ezra and Kanan escaped the temple, but Vader and Ahsoka were trapped inside when the Temple began to implode. Vader and Ahsoka survived and parted company."}, {"tag": "p", "text": "Later, Ezra came under the influence of the Sith Holocron, which was inhabited by an entity called Presence. Under the holocron's guidance, Ezra learned more aggressive combat techniques including forcing an AT-DP walker driver to attack his comrades and walk his machine off a bridge. Ezra's use of the Sith Holocron strained relations with his master Kanan, who confiscated it. Kanan later met a powerful Force-wielder called the Bendu, who formed a middle ground between the light and dark sides. He advised Kanan that an object could be used for both good and evil and that only the person had the power to change it. Kanan left the Sith holocron in the Bendu's care."}, {"tag": "p", "text": "Maul, who was revealed to have survived the events on Malachor, later captured Kanan and Ezra's rebel friends and used them as hostages to force the two Jedi to bring him the Sith holocron and Kanan's Jedi holocron. Kanan and Ezra recovered the Sith holocron from the Bendu, who warned them that Maul planned to combine the power of the holocrons to provide clarity of vision. After rendezvousing with Maul, Ezra and the former Sith combined the two holocrons. Ezra wanted to find a way to destroy the Sith while Maul was looking for hope. The holocrons projected a vision of twin suns, an old enemy of Maul, and offered to show Ezra the \"key\" to destroying the Sith. However, Kanan convinced his apprentice to look away, and the two holocrons separated. Maul took the opportunity to escape into space."}, {"tag": "p", "text": "Using the fragments of Ezra's memories in his mind, Maul tracked the rebels down to their base on Atollon. Using the dark side of the Force, Maul manifested in Ezra's visions. Maul managed to convince Ezra to follow him to Dathomir by offering to keep Chopper Base a secret. At the Nightsister lair, Maul and Ezra underwent a ritual to uncover the remaining fragments of the holocrons in each others' minds. After drinking a magic potion, Maul learned that Master Kenobi was still living on the planet with twin suns while Ezra learned that Kenobi held the key to destroying the Sith. The two were then attacked by the spirits of the Nightsisters, who demanded payment in flesh and blood for their services. Kanan and the Mandalorian weapons expert Sabine Wren arrived to confront Maul but were possessed by the spirits. Ezra and Maul managed to flee outside the lair. When Maul offered Ezra a place as his apprentice, the young Jedi refused to abandon his friends. After exorcising Kanan and Sabine, the three resolved to find the planet with twin suns and to reach Kenobi before Maul could kill him."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "In the years leading up to the Battle of Yavin, the Empire faced a growing rebellion that had grown into the Alliance to Restore the Republic. In secret, the Emperor commissioned the building of the Death Star, a massive superweapon capable of destroying entire worlds. After rebel elements stole the Death Star plans, Vader led a secret mission to Tatooine which ended with the capture of Princess Leia Organa, the adopted daughter of Bail Organa and one of the offspring of Anakin Skywalker. Shortly thereafter, the Emperor dissolved the Imperial Senate and ordered Alderaan's destruction."}, {"tag": "p", "text": "Lord Vader and Grand Moff Wilhuff Tarkin presided over Alderaan's destruction in the presence of Princess Leia. Before they could terminate Leia, she was rescued by a group of travelers including Anakin's son Luke Skywalker, the smugglers Han Solo and Chewbacca, the droids C-3PO and R2-D2, and the Jedi Master Kenobi. While the other rebels escaped aboard the Millennium Falcon, Kenobi sacrificed his life to delay Vader. Leia and her rescuers retreated to the rebel base on Yavin 4. The Death Star traveled to Yavin base in a bid to destroy the Rebel Alliance once and for all but this plan was ruined by a rebel starfighter force. During the Battle of Yavin, Vader sensed that the Force was strong in the rebel pilot Skywalker; who fired the missile that destroyed the Death Star, Vader, however, survived the destruction."}, {"tag": "p", "text": "Three years after the events on Yavin and following the Battle of Hoth, the Emperor disclosed that Luke was one of the offspring of Anakin Skywalker, though this was something Vader already knew. Vader believed that Luke would be a powerful ally if he could be turned. The Emperor charged Vader with winning Luke over and destroying him if he refused to turn to the dark side. During that time Luke had traveled to Dagobah, where he had been trained by Yoda, a Jedi Master who was once the leader of the Jedi Order. Vader managed to capture Leia, Han, C-3PO and Chewbacca in Cloud City on Bespin. Sensing the danger that his friends were in, Luke left his training and traveled to Cloud City where Vader was waiting for him. During their confrontation, Vader severed Luke's right hand and revealed that he was Luke's father. Despite the pain, Luke refused to join Vader, threw himself down a vane and escaped."}, {"tag": "h3", "text": "Fall of the Sith"}, {"tag": "p", "text": "In secret, the Emperor directed the building of a second Death Star above the forest moon of Endor. In an attempt to destroy the rebellion once and for all, the Emperor arranged for intelligence on the second Death Star to be leaked to Bothan spies. Using this information, the Rebel Alliance made preparations to launch an attack on the second Death Star. Before the Battle of Endor, Vader traveled to the second Death Star to warn Moff Tiaan Jerjerrod to accelerate construction. Shortly later, Sidious traveled to the battle station to oversee the final construction stages."}, {"tag": "p", "text": "After learning about Vader's true identity as his father— Anakin Skywalker— from Yoda and the Force spirit of Kenobi; Luke decided to face Vader on his own. He traveled with the rebel strike team to Endor and then surrendered himself to Vader. Luke hoped to turn his father back to the light, sensing \"conflict\" within him. Likewise, the Emperor sought to turn Luke to the dark side and replace his father as his new apprentice. On the second Death Star, Luke confronted Sidious. Sidious wanted to provoke Luke's anger by having the Imperial Navy engage the Rebel fleet, thus putting his friends' lives at risk, and ordering Vader to attack him personally. Luke, however, steadfastly refused in turn. Realizing Luke was a true Jedi, and would not be swayed, Sidious attempted to kill him through torturing him with Force lightning. However, Vader, torn between his loyalty to his master, his old Jedi connections, and his son, ultimately threw the Emperor down a reactor shaft, killing him and returning balance to the Force. With his life-sustaining armor badly damaged from the Emperor's Force lightning, Darth Vader died, but his selfless act allowed him to rejoin the Force as a Force spirit, and be \"reborn\" as his old self, Anakin Skywalker. Thus, the Sith Order, along with their tyranny was no more, as foretold by the ancient prophecy that predicted their downfall."}, {"tag": "h3", "text": "Interregnum"}, {"tag": "p", "text": "While the Sith Order was defeated at the Battle of Endor, it was merely one of many denominations of Force-worshiping religions that existed throughout galactic history. The Sith's ancient legacy as enemies of the Jedi and, at times, rulers of the galaxy, would continue to be felt in the decades that followed its extinction. The downfall of the Sith at Endor left behind a vacuum that others sought to fill, such as the Knights of Ren. Thus, while the ancient prophecy that foretold the destruction of the Sith came to pass, it did not foretell the destruction of the darkness, for as long as there existed light, there would always be shadow."}, {"tag": "p", "text": "Immediately following the deaths of Darth Sidious and Darth Vader, many individuals and groups still adhered to their philosophy. Yupe Tashu, an advisor to the late Sidious, was an admirer of the Sith interrogation methods, as well as their teachings and cunning. He believed that the remaining Imperial Military had to retreat \"beyond the veil of stars,\" to the Unknown Regions, to search for the source of the dark side that Sidious had come to feel reaching out to him. The Acolytes of the Beyond, who worshiped the Sith, collected Sith artifacts, such as what they believed to be Darth Vader's lightsaber, to destroy them, believing this returned the relics to their deceased owners. Kylo Ren pledged to finish what his grandfather Darth Vader had begun, although Supreme Leader Snoke scorned the sentimentality of Vader, which he believed had led to the Empire's downfall. Ultimately, Ren hoped to build an immunity to the light, and succeed where Vader failed."}, {"tag": "p", "text": "Luke Skywalker, Ren's former master and the last Jedi, once blamed the Jedi Order for Darth Sidious's rise to power. After usurping his dark side master Snoke, who was not a Sith, Ren implored the aspiring Jedi Rey to join him in building a new order for the galaxy and to let go of the past by forgetting the legacies of both the Jedi and the Sith."}, {"tag": "h3", "text": "Rebirth of Darth Sidious"}, {"tag": "h4", "text": "A sinister plot"}, {"tag": "p", "text": "Although Darth Sidious perished at Endor, the Sith Lord was able to cheat death, using the dark side of the Force to escape from his falling original body into a cloned body far away from Endor, and returned. Sidious settled on the hidden world of the Sith in the Unknown Regions, Exegol, along with a cult of followers, the Sith Eternal. However, the cloned body was unable to withstand Sidious's power and, as a result, it physically decayed, requiring it to remain connected to cybernetic components, such as an Ommin harness, in order to be sustained and move. On Exegol, the Sith Eternal oversaw the building of the largest fleet ever known to the galaxy, the Final Order, to establish a resurrected Sith empire. Meanwhile, owing to a secret Contingency plan designed by Sidious, former Imperial officers, nobles, and technologists were able to flee into the Unknown Regions, where they established the First Order."}, {"tag": "p", "text": "The Sith Eternal created artificial clone humanoid aliens, one of which, Snoke, came to be Supreme Leader of the First Order, though the First Order was unaware of Snoke's true origins nor of the existence of the Sith Eternal and the fact that their former Emperor was apparently alive in some form. In time, Snoke turned Ben Solo, the son of Han Solo and Leia Organa, to the dark side. Solo's fall to the dark side occurred after several events, including when he thought his uncle Luke Skywalker tried to kill him, a mysterious storm destroyed the Jedi training temple, and when \"Ren\" killed his friend Tai. Ben Solo succumbed to darkness, killing \"Ren,\" changing his name to Kylo Ren, and becoming the new master of the Knights of Ren, an enclave of dark side users. Elsewhere, Skywalker went into a self-imposed exile, his location unknown to the galaxy."}, {"tag": "p", "text": "Thirty years after the Battle of Endor, the First Order began its war of conquest, destroying the New Republic, the government established by the Rebel Alliance towards the end of the Galactic Civil War, in a surprise attack and launching an invasion of the known galaxy from the Unknown Regions. During the First Order's pursuit of the Resistance, a private military force led by General Leia Organa that opposed the First Order, Kylo Ren experienced a connection through the Force with Rey, a scavenger from Jakku who had defeated Ren in a lightsaber duel during the Battle of Starkiller Base and had been partially trained as a Jedi by Luke Skywalker. Together, the two defeated Snoke's Elite Praetorian Guard after Ren killed Snoke. Rey hoped her compassion would redeem Ren as Skywalker's had Vader, but Ren instead steeped deeper in the dark side and usurped his master as Supreme Leader. Rey fled, and helped her friends in the Resistance and the other surviving members of the Resistance escape the First Order's onslaught at the Battle of Crait while Rey's Jedi Master, Skywalker, sacrificed himself to distract Ren."}, {"tag": "h4", "text": "The Final Order"}, {"tag": "p", "text": "In the year that followed, Supreme Leader Kylo Ren found Exegol, where he discovered Sidious, the Sith Eternal, and the Sith fleet. Sidious told Ren that the fleet was part of the Final Order, which he planned to unleash on the galaxy in order to establish a new Empire. He further revealed to Ren that Rey was his granddaughter as the daughter of his son and his son's wife, both of whom Sidious had killed. Sidious offered Ren the Sith fleet, Final Order, and a new Sith Empire if he killed Rey. Ren later informed the First Order's Supreme Council of the existence of the Sith fleet. Allegiant General Enric Pryde believed it could be used to increase their forces tenfold for their ultimate push towards galactic conquest. After Ren abandoned the First Order, General Pryde, a veteran of the Old Empire, was given command of the Final Order for swearing fealty to Sidious."}, {"tag": "p", "text": "Rey arrived on Exegol to confront her grandfather in his throne room before an amphitheater of his followers, who chanted as Sidious spoke. Sidious told Rey he never planned to kill her, having manipulated Ren, but instead wanted her to take his place on the Sith throne. Sidious pressured her to sacrifice him, planning to use an esoteric power to transfer his spirit into her body. During his temptation, Sidious showed Rey the unveiling Battle of Exegol, which erupted as a result of Rey sending the coordinates to Exegol to her friends in the Resistance. Although the Resistance was initially outnumbered, they were reinforced by a citizens' fleet."}, {"tag": "p", "text": "A returned Ben Solo arrived on Exegol, who went on to defeat the Knights of Ren and accompany Rey, standing side-by-side against the Dark Lord of the Sith. Sidious angrily grabbed the two using the Force and inadvertently drew some of their life force, which caused his body to begin healing; realizing that their connection was a dyad in the Force, Sidious siphoned the life force of their bond to rejuvenate his body. Out of pure spite for the Skywalker bloodline, Sidious disposed of Solo into a nearby abyss. Sidious ascended the throne of the Sith, and used Force lightning to attack the Resistance and citizens' fleet, but Rey, strengthened by the spirits of the past Jedi, arose. Sidious proceeded to direct his lightning towards her, intent on killing her, but Rey defended herself with Anakin and Leia's lightsabers, deflecting the lightning back at Sidious, who disintegrated, ending the Sith and unleashing an explosion that caused the entire amphitheater to crumble. Rey died, but Solo survived and climbed out of the pit, where he found Rey lifeless on the ground. Crawling to her, Solo gave his life force to resurrect her, and died shortly thereafter. Rey ultimately rejected her dark ancestry; she took the Skywalker surname to honor the extinct Skywalker family and remained a Jedi, preventing the return of the Sith."}, {"tag": "p", "text": "Without the Sith, the First Order faced a series of attacks as people rose up across the galaxy, inspired by the victory of the Resistance and the citizens' fleet at Exegol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith first appeared as the primary antagonists of George Lucas' Original trilogy and the Prequel trilogy. The word Sith itself was first used in the 1976 novelization of Star Wars as a title for the key villain Darth Vader, the \"Dark Lord of the Sith\", a term cut from the original film. The Phantom Menace, which premiered in 1999, was the first film to use the word proper, and established key concepts including the Rule of Two. In addition, the origins and history of the Sith was explored by several non-canon Star Wars Legends works including the 1991 Dark Horse Comics Star Wars: Dark Empire story arc, the mid-1990s Star Wars: Tales of the Jedi comics, the 2003 BioWare game Star Wars: Knights of the Old Republic and its sequels, Drew Karpyshyn's Darth Bane Trilogy, the futuristic Star Wars: Legacy comic series, and John Jackson Miller's Lost Tribe of the Sith novellas. More recently, the canon television series Star Wars: The Clone Wars and Star Wars Rebels have touched upon the origins and history of the Sith."}, {"tag": "p", "text": "Sam Witwer, who has voiced Maul and Sidious in animation, opined the Sith do not believe in life after death. That is why they go to such extreme lengths to survive. However, the Jedi will sacrifice themselves as they believe their deaths can inspire others. \"You have Darth Vader, who lives a terrible life, he lives a pathetic, tortured existence but it's still preferable to having nothing, which is how he views death. The same thing with Darth Sidious, you look at him in Return of the Jedi. He's over 100 years old and is a bent, old man. But that's better than the alternative, which is nothing.\" An appearance from the Force spirits of Darth Bane and Revan in \"Ghosts of Mortis\" was removed at the last minute by George Lucas due to the disconcerting notion that the Sith could return."}, {"tag": "p", "text": "In the non-Canon animated television series LEGO Star Wars: The Freemaker Adventures, the primary antagonist Naare is identified as a Sith agent of Darth Sidious and Darth Vader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}