{"url": "Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Galactic governments", "Category:Sith Empire", "Category:Sith Empire organizations", "Category:Slaver organizations"], "nodes": [{"tag": "h1", "text": "Sith Empire  (Post–Great Hyperspace War)"}, {"tag": "p", "text": "The Sith Empire, also referred to as the True Sith or the reconstituted Sith Empire, was the galactic goverment created in the aftermath of the Great Hyperspace War of 5000 BBY. The remnants of the original Sith Empire established a reconstituted Sith Empire in the galaxy's Unknown Regions. This Empire, was created after Sith survivors of Dark Lord of the Sith Naga Sadow's disastrous campaign against the Galactic Republic fled known space to escape persecution by the Republic and its Jedi Order. Led by the Sith Lord Vitiate, the refugees wandered aimlessly through space in search of a new home. Twenty years after their departure from the original Empire's territory, the Sith discovered the forgotten world of Dromund Kaas and settled it to begin the process of rebuilding."}, {"tag": "p", "text": "During the rebuilding process, Vitiate proclaimed himself to be the Dark Lord of his order and Emperor of his people. Under the care of the Emperor and his Dark Council of Sith Lords, the Empire established its capital of Kaas City and began building a mighty war machine, with the intent of eventually returning to combat with the Galactic Republic once more. The Empire worked towards that goal for over one thousand years, gradually expanding and gaining more power and influence. During that time, the Sith were discovered by Jedi Knights Revan and Malak, who were forcibly turned to the dark side of the Force by the Emperor and became Sith. Although they were sent back to serve as the vanguards of the Empire's eventual invasion, they broke free from his conditioning and formed concurrently their own Sith Empire, but the Republic defeated the two and their remnant, and knowledge of the Empire remained hidden."}, {"tag": "p", "text": "Around three hundred years later, the Sith Empire—still under the command of Vitiate —was ready to return to the greater galaxy. After covertly installing puppet governments on Republic worlds across the Outer Rim Territories, the Sith invaded Republic space in an onslaught of unrivaled proportions."}, {"tag": "p", "text": "After capturing and securing much of the Outer Rim in the early stages of what would become known as the Great Galactic War, the Sith Emperor began preparing for the push towards the Republic's bastion in the Galactic Core. Despite several setbacks in its campaign towards the core, the Empire surged forward once more, crippling the Republic economy through an alliance with the Mandalorian warrior clans. However the blockade was eventually broken by Hylo Visz, and reinforcements from the Republic which brought the war into another stalemate. After nearly 3 decades of fighting, the Empire surprised the galaxy when the Dark Council extended an offer of peace to the Republic. Desperate, the Republic senate accepted, but during peace talks on Alderaan, the Empire launched a sneak attack on the Republic capital of Coruscant. The attack was successful, allowing the Empire to force the Republic to sign their draft of the document that would end the war, the Treaty of Coruscant."}, {"tag": "p", "text": "With the war at an end and the Empire stronger than ever, the Emperor retreated from the public view and passed responsibilities of the day-to-day maintenance of the Empire to the Dark Council. As a result of the Empire's co-existence with the Republic, an interstellar Cold War emerged in the immediate aftermath of the Great War, during which time the Empire engaged in proxy battles and small conflicts with the Republic and its allies. When war did break out again, the Empire started to suffer catastrophic defeats that ranged from losing members of its leadership, including the Sith Emperor himself. Additionally, the Empire began to weaken even further due to infighting and internal struggles between power-crazed Sith Lords. It soon became just as vulnerable and desperate as the Republic it was fighting. The infighting was the turning point for the Empire when Darth Marr assumed leadership. With the help of the their most powerful allies, he was able to stabilize the Empire. Marr ensured a bright future and even organized an alliance with the Republic in dealing with threats such as Revan and Vitiate. The Emperor's Wrath was tasked with preserving the Empire and led the Empire's forces in the battle against Darth Malgus and the Dread Masters alongside Darth Marr."}, {"tag": "p", "text": "By 3636 BBY, the Eternal Empire invaded the rest of the galaxy, defeating both the Sith and Republic and establishing political, military, and economic control over both superpowers. During the conflict, many of the remaining members of the Dark Council were killed or otherwise disappeared under mysterious circumstances, except Darth Acina. The sudden disappearance of her rivals, such as Darth Nox and the Empire's Wrath, allowed her to seize complete control of the Empire's remnants and crown herself Empress of the Sith. Despite the new external threat, neither the Republic or the Empire would agree to officially end hostilities or discuss any sort of partnership. The earlier cooperation forged by Marr due to his reasonable leadership, though, would have a lasting legacy over the course of the decade, eventually paving way for members of the Empire to willingly join in an official alliance with Republic defectors against their common enemy. The defeat of the Eternal Empire would ultimately lead to another war between the Republic and Empire."}, {"tag": "p", "text": "Eventually, the Empire was defeated and its territory absorbed by the Galactic Republic, which was now the dominant superpower in the Galaxy. By 2000 BBY, those who still clung to the old Sith ways ultimately followed Darth Ruin, who established a New Sith Empire in its place."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "In the year 5000 BBY, the Great Hyperspace War was fought between the Galactic Republic and the original Sith Empire. While the Sith were victorious in the early stages of the conflict under the rule of Naga Sadow, the Dark Lord of the Sith, the Republic eventually drove the Sith back to their primary territory within the Stygian Caldera nebula, and Naga Sadow fled into unknown space after he was defeated above the Sith's capital Korriban. Supreme Chancellor Pultimo of the victorious Republic ordered the Republic Navy to conduct a systematic extermination of the Sith Empire to permanently end the threat and to purge the corruption of the dark side from the Sith species."}, {"tag": "p", "text": "It was at this time that the Sith Lord Vitiate, a reclusive scholar who had ruled the distant planet Nathema for over a century, began to broadcast speeches from his palace describing how the Republic would pursue the Sith and massacre the people of the Empire, driving the Empire into a terrified frenzy—and at the same time, he ordered his historians and researchers to search for a long-lost Sith colony world named Dromund Kaas. When his research team found success in 4999 BBY, Vitiate then offered the people hope, calling all remaining Sith Lords to his world where he promised to aid them in completing a great piece of Sith magic that would bring about the salvation of the Empire."}, {"tag": "p", "text": "More than eight thousand Sith Lords answered the call, but when they arrived at Nathema, the scholarly Vitiate dominated their minds and enslaved their wills to his own. With the others acting in concert, Vitiate then led them in performing the most powerful and complex ritual of Sith magic ever attempted: a ritual that stripped the Force itself from the entire planet of Nathema, killing every living thing on the world and transferring all of their power into Vitiate. Now immortal, Vitiate shed his name and became known solely as the Sith Emperor, and he blamed Nathema's destruction on the Republic's Jedi protectors. Gathering the remnants of the shattered Empire on Korriban, particularly those of the younger generation, the Emperor and his followers boarded a small fleet of starships and departed on a exodus to Dromund Kaas, though only he knew of their destination."}, {"tag": "p", "text": "The Emperor ensured that the fleet's journey took them almost twenty years so that the people came to rely on him as their savior and ultimate leader, and he erased all hyperspace routes to Nathema and all mentions of Nathema from history beyond the name of the Ritual of Nathema, which Imperial scholars later celebrated as one of the greatest achievements of the old empire. When they finally reached Dromund Kaas in 4980 BBY, the Emperor addressed his people as they gathered before his throne on the jungle surface, and he declared a reconstituted empire that would one day return to the galaxy and gain their revenge against the Republic for the destruction of their civilization. With Dromund Kaas as their capital, the people dedicated themselves to the Emperor's cause and set about taming the jungles of their new homeworld."}, {"tag": "h3", "text": "Forging a new empire"}, {"tag": "p", "text": "The Emperor appointed twelve powerful Sith Lords, including one named Darth Zavakon, to the rank of Dark Lord of the Sith, and the twelve collectively formed the Dark Council—the highest position a Sith could attain in the new empire, and the de facto rulers of the Empire as the Emperor gradually retreated from public view over the following decades to pursue his own studies in the dark side. On account of the dangerous predators native to Dromund Kaas, the Dark Council tasked the Human Odile Vaiken with bringing order to the non-Sith members of the Empire and allowed him to develop an Imperial Military. Vaiken proceeded to recruit every non-Force-user of proper age into the new Imperial Army, and instituted a rigorous training regimen that instilled military discipline and training in his recruits."}, {"tag": "p", "text": "Vaiken then led his recruits in their first combat operation: clearing a region of the Dromund Kaas wilderness to make way for Kaas City, the planned metropolis that would serve as the Empire's center of government. Vaiken's forces battled terentateks and other fearsome creatures in their efforts, and the Empire's records made note of the fact that Vaiken slew a terentatek single-handedly on the site of the future government citadel. With Vaiken's success, the settlers set about building Kaas City and the Imperial Citadel, which they based on the original Great Citadel of the Old Empire on the planet Ziost and the Sith Academy on Korriban. Early in the Empire's history, they discovered the Dark Temple, a structure constructed by the original Sith colonists."}, {"tag": "p", "text": "The Sith Lord Brontes's insights into the natures of Sith artifacts and other objects of the dark side led the Emperor—already intrigued by the echoes of the dark side within.—to take control of the Dark Temple. The people of the Empire completed an expansion of the Temple on the Emperor's orders while also working on Kaas City, and after it was completed, the Sith ruler used it as both a storehouse for powerful artifacts and as a tomb for his enemies. The Emperor conducted a number of Sith magic rituals in the early years of the Empire, and the Sith magic affected Dromund Kaas's atmosphere, generating a near-constant cloud cover and causing powerful thunderstorms as the world became permanently storm-wracked. His experiments also generated a powerful dark side Force nexus within the Dark Temple."}, {"tag": "p", "text": "Early in the Empire's history, the members of the Dark Council each chose an area of the Empire's society and government as their sphere of influence. Darth Zavakon, who chose the recovery and study of ancient knowledge, came to realize that the Empire was suffering because his fellow Sith were unwilling to share the knowledge and secrets they discovered in Sith ruins and tombs. Zavakon therefore conducted an experiment where he dispatched a team of archaeologists and military officers to investigate ruins that other Sith had already surveyed. Zavakon's team made significant discoveries that the Sith had missed, as they had not compared their findings like the archaeologists, and the team's success led the Dark Council to authorize Zavakon to form the Imperial Reclamation Service—a branch of the Imperial Military devoted to the recovery and preservation of knowledge."}, {"tag": "p", "text": "Having secured their new homeworld, Odile Vaiken set about laying the foundations for the Imperial Navy, though he knew it would take centuries to complete. With the support of the Dark Council, Vaiken dedicated the entire Imperial Army to the task, assigning his forces to mine for resources, engineer the vessels, and manufacture the ships. Vaiken lived long enough to see the production of the first of his newly-designed Star Destroyers, and Vaiken's achievements earned him the title of Grand Moff from the Emperor himself. In the years afterward, Vaiken led the Empire's first campaigns out from Dromund Kaas to conquer alien societies and worlds around the capital, though he was killed during one such mission in 4904 BBY. Vaiken was fondly remembered by the Empire centuries after his death, with the Imperial Navy naming their staging area Vaiken Spacedock and the Imperial Military using his training methods for centuries afterwards, and an eternally-burning flame known as Vaiken's Torch was lit in the jungles of Dromund Kaas to symbolize the Empire's undying dedication to their revenge on the Republic. Though the Empire expanded, it was unable to reclaim their holy world of Korriban, which was kept under surveillance by the Jedi Order and the Republic."}, {"tag": "p", "text": "In the year 4606 BBY, the Sith Kel'eth Ur earned the personal attention of the Emperor when he began preaching the tenets of the light side and saying that the Sith should abandon the dark side. The Emperor killed Kel'eth Ur and entombed him in the Dark Temple, and shortly afterwards the Emperor ordered the Dark Temple sealed to contain the powerful artifacts and the ghosts of those entombed within. As the centuries passed, other cities were built across Dromund Kaas and came to cover much of the planet, though stretches of untamed and dangerous wilderness remained, and the Imperials developed lightning spires—towers that converted lightning strikes into energy—to power their cities and take advantage of Dromund Kaas's constant storms."}, {"tag": "p", "text": "Several centuries into the Emperor's reign, a Dark Councilor named Darth Lokess summoned her fellow Councilors to a secret meeting in the middle of one of Dromund Kaas's many violent storms. With an army of loyal Sith outside ready to murder the other Councilors if they opposed her, Lokess recruited her fellows into a plot to overthrow the Emperor and wage war on the Republic once more. However, the Emperor somehow learned of their plot, and as the twelve ascended the steps of the Citadel with the intention of confronting the Emperor, he acted: Lokess's co-conspirators died in a flash of light, and Lokess was whisked into the bowels of the Citadel where she was tortured and ultimately killed by the Sith ruler as a warning to those who would challenge him. Less than four centuries after the Great Hyperspace War, the Sith Lord Vodal Kressh attempted to challenge the Emperor's rule with an army of slaves that he had bred on the planet Athiss. However, Kressh's machinations never advanced beyond Athiss, and when the madman died, the Emperor declared Athiss forbidden."}, {"tag": "p", "text": "Around 4043 BBY, the Dark Councilors Darth Victun and Darth Qalar fought a Kaggath, a ritual Sith duel, in the Citadel. The duel tore the structure apart, bringing the edifice crashing down—so when the dust from the collapsing building settled, the other ten Dark Councilors acted as one and struck down the combatants. Qalar and Victun's family lines were exterminated, and the Emperor surprised the Council and the Empire by emerging from seclusion to contribute to the designs for the new Citadel. The Emperor appointed the Sith Lord Darth Nostrem as the architect, but when the building was completed—now with wings for the Ministries of Logistics, War, and Intelligence, as well as the Sith Sanctum and labyrinthine passages in the lower levels—the Emperor cast Nostrem into the building's depths to test the structure's defenses."}, {"tag": "h4", "text": "The Emperor's machinations"}, {"tag": "p", "text": "A few decades after the Kaggath, several Dark Councilors, among them Darth Nyriss and Darth Xedrix, rediscovered Nathema and what the Emperor had done to the world, and they formed a conspiracy to unseat the Emperor and save both their Empire and the galaxy from annihilation at the Sith ruler's hands. Not long afterwards, around 3978 BBY, the Emperor decided to test the Republic by sending a Sith emissary to Mandalore the Ultimate, the leader of the Mandalorian warrior culture, though the rest of the Empire was unaware of his actions. On the Emperor's orders, the Sith manipulated Mandalore's mind, convincing him to wage war on the Republic as a way for the Emperor to test the Republic's martial strength. Under the Sith's influence, Mandalore rallied his people and began the Mandalorian Wars, and they had the upper hand until the Jedi Knights Revan and Malak took command of the Republic Military in 3962 BBY."}, {"tag": "p", "text": "Revan and Malak drove back the Mandalorians and forced a confrontation at the Battle of Malachor V in 3960 BBY, where Revan defeated Mandalore in single combat and learned from the dying warrior about the Sith's manipulations. Already close to the dark side, Revan and Malak followed Mandalore's words to the planets Rekkiad, Nathema, and finally Dromund Kaas, where they discovered the hidden Sith Empire. Posing as mercenaries, the two attempted to assassinate the Emperor, but the Imperial Guard led them into a trap and the Emperor took control of their minds, turning them into his agents. He publicly announced to the Empire that the two were assassins and that they had been executed, but the Emperor actually sent Revan and Malak—now the Dark Lords of the Sith Darth Revan and Darth Malak—back to the greater galaxy to secure the Star Forge, a powerful factory of the long-dead Rakata species, and to prepare the Republic for the Empire's assault. However, Revan and Malak broke free of the Emperor's control and established their own empire, and the Emperor's plans for an invasion were forestalled in the absence of information from the two."}, {"tag": "p", "text": "Following the war, Revan abandoned the Jedi Order and returned to the Unknown Regions to combat the Sith Empire. He retraced his steps before the Mandalorian Wars, traveling to first to Rekkiad and giving his companion Canderous Ordo the mask of Mandalore, making him Mandalore the Preserver. He then traveled on alone with T3-M4 and the Ebon Hawk to Nathema, where he was captured by the Dark Councilor Darth Nyriss and Lord Scourge. Revan was imprisoned by Nyriss for the next three years, held in secret from the eyes of the Emperor."}, {"tag": "p", "text": "During this time, Revan's former master Kreia launched an independent investigation into his fall to the dark side, which eventually resulted in her discovery of Malachor V and her own fall to the dark side and acceptance of Sith teachings. She adopted the name Darth Traya and, along with her two apprentices, Darth Nihilus and Darth Sion, continued the battle against the Jedi. The three formed the Sith Triumvirate and nearly wiped out the Jedi Order, but the Sith Lords Nihilus and Sion were ultimately defeated by the Jedi exile Meetra Surik. Soon after, Traya, who left the Sith and was Kreia once more, revealed to Surik the continued existence of the true Sith Empire and Revan's mission to destroy it. After leaving Kreia and destroying Malachor V, the Jedi exile decided to follow Revan."}, {"tag": "p", "text": "Retracing her friend's steps in the Ebon Hawk, Meetra Surik was accompanied by T3-M4 as she went to the Unknown Regions. The crew eventually found Nathema, which held information the Ebon Hawk used to travel to Dromund Kaas. Arriving at the Imperial capital, the exiled Jedi had learned of Revan's location and allied herself with Scourge, who betrayed the conspiracy between several members of the Dark Council, including by Darth Nyriss, to the Sith Emperor. The Emperor then proceeded to kill the entire Dark Council, even those innocent in the conspiracy, while Scourge and Surik freed Revan from Nyriss' prison. In their escape, Revan killed Darth Nyriss, and the trio then infiltrated the Emperor's Citadel in order to kill the Emperor, just as Revan and Malak had done."}, {"tag": "p", "text": "Revan, Scourge, and the Jedi exile fought their way into the Emperor's throne room and attacked Vitiate himself. Revan and the Emperor were evenly matched at first, but Vitiate gained the advantage after destroying T3-M4 and subjecting Revan to a massive amount of Force lightning. During their battle, Scourge had a vision, which convinced the Sith that the Emperor would not be defeated by Revan, but by another Jedi. Scourge turned on his allies by stabbing Meetra Surik through the back, distracting Revan so that the Emperor could blast him into unconsciousness. Scourge explained that the Jedi had been in league with Nyriss, and he had led the Jedi to Vitiate so that they could be killed. The Emperor rewarded Scourge by appointing him to be the first Emperor's Wrath, and imprisoned Revan in the Maelstrom while he fed off of the Jedi Master's vitality and his knowledge for the next 300 years."}, {"tag": "h4", "text": "Preparations for war"}, {"tag": "p", "text": "In the three centuries that followed the Jedi Civil War, the Empire began a massive acceleration of their plans for their invasion into the Republic. While working in the shadows and bidding their time, the Emperor was responsible for establishing a network of spies and infiltrators who entered Republic space in order to prepare the way for the coming war. Managing to enter Republic political circles, this deep cover occurred over generations in order to place their operatives in positions of power. While the Empire bided its time in the shadows, infiltrators such as the Ovair family operated within the Galactic Republic where they served for three generations - outwardly appearing as loyal citizens while hiding their true loyalty to the Sith Emperor. The last known member of this family included Barel Ovair who even served within the Jedi Order itself as a Jedi Master. In 3756 BBY, Barel Ovair was tasked with an important mission by the Emperor to prepare the way for an eventual invasion of the Republic by first eliminating any potential enemies that might stand in the Sith Empire's way. This included an ambitious mission to the tomb of Naga Sadow on Yavin 4 in order to slay the Sith spirit that resided there to prevent it from interfering in the Emperor's plans. Ovair was ultimately successful and made it appear that he was working under the auspices of the Jedi Order, who were completely unaware of his true motivation."}, {"tag": "p", "text": "As the invasion date came closer, the Sith Empire began preparing a platform for their attacks in the Outer Rim. Their first act was establishing puppet governments on the worlds of Belkadan, Sernpidal and Ruuria who outwardly showed their loyalty to the Republic but awaited the appointed time for their true masters arrival. It was known that shortly after returning to Republic space, a young Sith Lord by the name of Darth Vich came upon the planet Rattatak. Being eager to make a name for himself, he decided to cast aside a thousand years of anti-alien tradition in order to recruit hundreds of tribes of Rattataki in order to create his own personal army. The people of Rattatak were known for their prowess in battle thus making them a dangerous force to contend with and dozens of their number were Force Sensitives who became Darth Vich's own acolytes. With his own army under his command, Darth Vich made a play for power that ultimately failed with rumors stating that a small cadre of his own acolytes betrayed him. Following his failed attempt at gaining power, the Dark Council enslaved or killed all the Rattataki that followed Vich."}, {"tag": "h3", "text": "Onslaught against the Republic"}, {"tag": "h4", "text": "Great Galactic War"}, {"tag": "p", "text": "It was in the year 3681 BBY that the Sith Empire finally decided to begin their long awaited plans against the Galactic Republic. They immediately began by sending their naval forces in the Outer Rim Territories where their war fleets appeared in the Tingel Arm. The Sith battle cruisers were completely unknown to the Republic at the time who sent a diplomatic convoy to meet with this new foe. As they approached and beamed their reports back to Republic space, the Sith warships fired and utterly destroyed the lightly armed diplomatic team. This was part of the Sith Emperor's plan by scaring his enemies and allowing images of the destruction being sent back to their leaders. What followed immediately was the subjugation of the Aparo sector before the Republic fleet could respond."}, {"tag": "p", "text": "The Republic military eventually responded by sending a fleet into the contested region where they fought against the Sith forces in what became known as the Tingel Arm campaign. However, the worlds of Sernpidal, Belkadan and Ruuria turned against the Republic whereupon they revealed their true allegiance to the Sith Empire. The Republic fleet was thus caught in-between the enemy forces and was devastated leading to what few remaining vessels to flee the battle. This shifted the movement of the early part of the war to the Sith's favor as the departure of the enemy fleet meant that many regions were now left uncontested. This allowed the Sith Empire to seize the Minos Cluster thus gaining its rich resources, conduct a strike against the Sluis Van Shipyards which destroyed it and cut off the Rimma Trade Route. Lastly, the Sith were successful in staging an assault against the Jedi security forces that defended Korriban which allowed the Empire to reclaim the tomb world."}, {"tag": "p", "text": "The Empire's invasion was initially successful and saw the near complete control of the Outer Rim following the conquest of the Seswenna sector. With that under their control, the Sith began to turn their attention to the Mid Rim as part of their offensive to strike the Core Worlds themselves. At this point, the Imperial military became overconfident as they believed that the Republic was now still recovering from heavy losses sustained in the war. As such, a squadron of warships were moved to take control over Bothan Space but were annihilated by the Republic fleet. This proved to be the first true defeat of the Sith Empire and a major victory for the Galactic Republic."}, {"tag": "p", "text": "This saw many warships drawn from across the galaxy in order to gain vengeance for their defeat at Bothawui thus instigating a second battle for control of the Bothan homeworld. As the planet was protected by a planetary shield, the Empire decided to deploy a 50,000 strong army to invade the planet that fought against its few defenders."}, {"tag": "p", "text": "Overconfident Imperial commanders dispatched their numerically superior forces but suffered heavy losses against the Republic forces thus forcing the Empire to bring in further reinforcements in order to defeat the defenders who were led by Jedi Master Belth Allusis who was slain in the closing stages of the conflict. However, the Imperial forces were driven to retreat on this occasion and the Battle of Bothawui was a draw between both sides. Thus, the early Sith onslaught began to be halted in the Mid Rim which stopped any further advances by the Empire."}, {"tag": "p", "text": "While the Republic gained a reprieve from further onslaughts, the second stage of the Sith Emperor's master plan was initiated. Imperial Intelligence agents during this time were responsible for preventing other factions such as the Hutt Cartels from joining the Republic. Furthermore, Imperial Diplomacy attempted to enlist the full support of the Mandalorians but were rejected though a few such mercenaries did join their ranks. It was through the actions of Imperial Intelligence that the Sith were able to orchestrate the rise of a young Mandalorian gladiator in the arenas of Geonosis."}, {"tag": "p", "text": "This gladiator became known as Mandalore the Lesser in later years and he assembled a large army from the Mandalorian clans who proceeded to bring their armada and began blockading the Hydian Way in order to confront the Jedi Order. The blockade thus prevented any military support to the Outer Rim Territories as well as stopped the flow of raw goods from the Colonies to the Core. This was a large advantage for the Sith as the Republic was now deprived of critical supplies and many holdouts ultimately fell to the Empire as a result. The advantage was only broken by the efforts of a Mirialan smuggler known as Hylo Visz who along with like-minded comrades broke the Mandalorian blockade. As a result, the Sith efforts at defeating the Republic were undermined by the smugglers attack who had now given much needed resources for the Republic military. This saw a radical shift in the Empire's strategy as they had now grown desperate in order to now secure a victory."}, {"tag": "h4", "text": "Deceived"}, {"tag": "p", "text": "Toward's the end of the Great Galactic War, the Sith Empire controlled half the galaxy. Despite the fact that the odds of victory were tipping into the Empire's favor, due to their large navies and various allies, Imperial forces were strained and spread thin. The Republic, on the other hand, was weakened, and gradually began consolidating its forces in the Inner Rim to defend the core worlds. Although the Empire had it within their power to destroy the Republic, the Sith Emperor had since grown impatient, having believed that victory would have already been achieved by this point. To that end, he opted to extend an olive branch to the Galactic Republic. This saw the Dark Council extending an offering of peace to the Republic, which was eagerly accepted, as they had since concluded that the war was practically unwinnable. The Empire thus dispatched a diplomat, Darth Baras, to the planet Alderaan in order to discuss a galaxy wide cease fire."}, {"tag": "p", "text": "While the people of the Republic, as well as Imperial isolationists and staunch supporters of the Emperor, were overjoyed upon hearing the news of peace, many of the more conservative dark lords, hawkish in ideology, were disgusted by the spontaneous situation, as they held the belief that war was the Sith way and that it was the only way to demonstrate true power. Two such Imperialists were Darth Angral and Darth Malgus, who firmly disagreed with the Emperor, the Dark Council, and Darth Baras, Angral's rival, who was handpicked by Vitiate himself to serve as the Imperial representative during treaty negotiations."}, {"tag": "p", "text": "Then two delegations met on the neutral world of Alderaan, where Empire and Republic were accompanied by both Sith lords and Jedi knights, and discussed what were initially believed to be reasonable terms of peace. At the Dark Council's orders, Darth Baras met directly with the Republic representatives, including Jedi Master Satele Shan, and negotiations seemingly got off to a smooth start."}, {"tag": "p", "text": "While negotiations commenced on Alderaan, the Sith, having been instructed by Emperor Vitiate himself, amassed what was almost the full strength of their fleet with the intent of capturing Coruscant and holding it hostage, which would give the Empire enough leverage and influence over the Republic to be able to get them to agree to terms that would be in their favor - ones deemed unreasonable under most circumstances. First dispatching a Sith vanguard commanded by Malgus with orders to attack the Jedi Temple, the Imperial fleet, under the command of Darth Angral, soon orbited Coruscant, causing massive destruction in an event that would become known as conducted the \"Sacking of Coruscant\". This saw the planet under siege as it was bombarded from orbit and invaded by ground troops, becoming an occupied world within a matter of hours. One of the casualties of this attack was the loss of the Jedi Temple and the capture of the Senate Tower thus allowing the Sith to hold the entire world hostage. Angral instated martial law on the devastated world, effectively oppressing its civilians, although occasional rioting did occur. Additionally, many government officials, including Supreme Chancellor Berooken, were executed by the Sith, further weakening any influence that the planetary government had left during the Sith occupation."}, {"tag": "p", "text": "The sacking and subsequent occupation of Coruscant forced the Republic diplomats on Alderaan to sign the Treaty of Coruscant, despite unfair terms for themselves. The terms of the treaty required that the Republic was to cede certain star systems over to the Empire, as well as abandon strategic worlds in buffer space. This would lead to the Empire quickly snatching them up, seeing as, even though the acquisition of those certain planets were not within the terms of the agreement, the Republic was far too weak to stop the increasing Imperial war machine. With entire star systems at the mercy of the Sith as far deep as the Inner Rim, the Republic scaled back on its previously aggressive stances as to not aggravate the growing Empire. In the aftermath, the Sith began to consolidate their power as galactic lines were drawn with now well over half the galaxy falling under the leadership of the Empire."}, {"tag": "h3", "text": "The Cold War"}, {"tag": "p", "text": "With the end of the Great Galactic War, an uneasy stalemate was formed between the Sith Empire and the Galactic Republic. The Treaty of Coruscant effectively resulted in further expansion of the Empire, which quickly overshadowed the strained Republic, thereby becoming the galaxy's prime superpower. Although at the time, the Emperor's motivation for signing the Treaty of Coruscant was unclear, specifically to those who were pro-war, it became clearer that the Empire's intention was to rebuild its dwindled forces to prepare for another war against the Republic, this time using the fact that they now controlled newly annexed strategic worlds that could be useful in the war effort. For nearly a decade, the Empire conducted espionage against the Republic, learning many of their secrets, with Imperial Intelligence becoming one of, if not the most, significant bureaucracy in the Empire. Although no official engagements occurred between both governments, a series of bloody proxy wars broke out across the galaxy on what were seen as being primarily contested worlds, such as Balmorra, Alderaan, and Ord Mantell. That aside, there were several instances in which elements from each faction engaged one another, although those were generally limited to small-scale skirmishes between independent operatives working alone, special forces, Jedi, and Sith. Despite the hostility between both factions, there was limited cooperation between several leaders on both sides, which often led to uneasy collaboration on rare circumstances. One such example was a combined effort to stop a droid army from unleashing a contagion on the galaxy, upon which they launched an orbital invasion on the remote world of Sebaddon. Although the brief and fatal alliance fell apart in the end, also resulting in the death of Sith commander Darth Chratis, it would not be the last collaboration between the two nations."}, {"tag": "p", "text": "Following the treaty, the Emperor gradually became more and more reclusive, eventually turning over complete political control of the Empire to the Dark Council. By 3643 BBY, the Dark Council concluded that the best way to weaken the Republic before reconstituting the war would be to eradicate Republic military leadership, which would cripple the command structure. Falling upon Darth Vengean, leader of the Imperial military, to organize a strategy, the Sith lord devised Plan Zero, an elaborate series of operations designed to cripple Republic command. The goal was to neutralize six key military officials without drawing too much attention. Vengean assigned Darth Baras, his subordinate, to oversee the directive, who would manage it on an operational level. Baras, in turn, assigned his own underling to plan and carry out the assassinations, his former apprentice, a Sith warrior who'd later go on to become the second Emperor's Wrath. After Plan Zero succeeded, both Baras and the warrior turned on Vengean, resulting in the former gaining a spot on the Dark Council."}, {"tag": "p", "text": "As Plan Zero proceeded in its execution, the Republic itself began to grow wary of the Empire's rapid military buildup, as well as the mysterious deaths of some of their most important military leaders. Many members of the Galactic Senate felt that if the need arose that they would need more powerful troops, they would have to be able to train and mobilize them quickly if they were to stand a chance against the might of the Empire."}, {"tag": "p", "text": "In the meantime, the Sith Emperor, seeing that war was right around the corner, decided to renew conscription of further troops, leading many to believe that he was once more preparing to attack the Republic. The Dark Council, despite the various members continuing to retain their differences, was stronger than before. Led primarily by Darth Marr, Darth Thanaton, and Darth Baras, the Empire was finally in a position to attack the Galactic Republic."}, {"tag": "p", "text": "While not as brutal as the earlier war, the Cold War saw explosive skirmishes erupt around the various regions of space, thus beginning a new period of warfare in the galaxy as both sides vied for dominance. After barely over a decade of uneasy peace, a new conflict sparked, which became known in history as the \"Galactic War\"."}, {"tag": "h3", "text": "Renewed conflict"}, {"tag": "h4", "text": "Battling the Republic"}, {"tag": "p", "text": "Following the outbreak of war, the Empire, which, towards the beginning of the conflict, had an advantage on the Republic due to the eradication of Republic high command, carried out a series of invasions and operations that would better strengthen their hold on the galaxy. One of the first major victories occurred on the planet Taris, when Imperial forces set out to disrupt the Republic's recolonization effort, overseen by Governor Leontyne Saresh, who would later be elected Supreme Chancellor. While this initiative began during the latter days of the Cold War, the victory was finally assured at the dawn on the Galactic War, when the Imperials became the dominant force on the planet, thanks to the efforts of Darth Gravus. Although seen as a major victory, the Republic tried to continue their restoration efforts of the devastated planet, which had been bombed from orbit by Darth Malak three centuries earlier. Despite this however, the Sith occupation of the planet nearly halted their ability to effectively recolonize the world. As tensions tightened, Darth Angral formalized a plan that would ultimately involve the destruction of Tython, the Jedi homeworld. Using a superweapon known as the Desolator, the Sith lord attacked Tython, but was killed by a Jedi knight, putting a stop to his scheme. With his key rival out of the way, this gave Darth Baras more control over the ultimate war effort, leading to a further string of Sith victories."}, {"tag": "p", "text": "Despite several victories early in the conflict, the Empire suffered two devastating blows within the first year of the war, particularly on Taral V, which ultimately resulted in the Republic fleet, led by the Jedi Master and Fleet Admiral, Oteg, discovering the location of Maelstrom Prison. The Republic mounted a full-scale attack on the station, resulting not only in its destruction, but also the death of Grand Moff Rycus Kilran and the liberation of a prisoner: Revan. This proved to be one of the most humiliating and costly defeats of the early war. Revan proved to be a major threat to the Empire, as it was reported that he was planning on using the power of the Foundry, an ancient Rakatan factory, to create a droid army with the intention of carrying out a massive genocide against the Sith species. In retaliation, Imperial command dispatched a strike team to infiltrate the foundry after using a captured Republic warship to disguise their presence. As the strike team went after Revan within the Foundry itself, the Imperial Expeditionary Fleet engaged the Republic vessels guarding the Foundry. The fleet was ultimately annihilated and Revan was defeated, saving the Imperial population from near total destruction."}, {"tag": "p", "text": "During the Empire's discovery of the prison planet of Belsavis, An imperial strike team had entered the very depths of the prison to release the captured Dread Masters, fear-wielding Sith Lords who serve the Emperor, all the while the Empire sought to free their own captured forces as many as they could. The Imperial Guard were personally overseeing the invasion."}, {"tag": "p", "text": "Darth Baras, chief orchestrator of the entire Imperial war effort, led the Empire to a number of further victories against the Republic. Additionally, more battlefronts and theatres opened up throughout the Outer Rim. The worlds of Hoth and Belsavis became key flashpoints, with both sides vying control for those worlds for months."}, {"tag": "p", "text": "The defining battle of the first stages of the war occurred in 3640 BBY on Corellia. Undoubtedly the bloodiest and most devastating battle of the entire war, the world of Corellia was nearly wiped out by the Sith Empire. Commanded by Darth Decimus, Imperial forces launched a full-scale invasion of the planet, eventually occupying Coronet City. What forces were on the world were obliterated, along with many of Corellia's protectors, the Green Jedi. The Sith, now controlling the planet, engrained themselves in Corellian politics, vying to appoint the young politician Darbin Sull as Prime Minister, who was, in fact, a political pawn. The Republic began mobilizing its own troops to liberate the planet, in the meanwhile helping organize a resistance movement to combat the Sith occupation. Despite crippling the world, the Republic regained the advantage once they had arrived, which resulted in the death of Darth Decimus. Although this was a turning point in the battle, the Empire remained on Corellia, continuing to fight the Republic. Across the galaxy, the war continued to escalate, and, since they were nearly evenly matched, both Empire and Republic seemed to be locked in a war that could last for years."}, {"tag": "h4", "text": "Fragmentation"}, {"tag": "p", "text": "The Sith Empire had renewed its war with the Galactic Republic. During this war, many Sith sought power within the Empire and began infighting among themselves. Darth Baras, having recently, ascended to the Dark Council, claimed that he was the Voice of the Emperor, host of the Sith Emperor's spirit, and had in fact trapped the real Voice on Voss. Baras was nearly successful but fellow Dark Council member Darth Vowrawn did not believe him and so Baras tried to kill him. The Sith Emperor declared Baras' former apprentice his new Wrath and put him on the path to destroy Baras. The Wrath saved Vowrawn, who was leading the campaign on Corellia, and with latter's help defeated Baras in sight of the Dark Council and was officially declared as the Emperor's Wrath and now the Dark Council acknowledged it and soon passed the information to the rest of the Empire."}, {"tag": "p", "text": "Darth Thanaton, another Dark Council member, was facing a similar dilemma from Lord Kallig, descendant of Alloysius Kallig. Sometime after Baras' coup, Darth Thanaton had declared a Kaggath against Kallig but he later fled in order to seek assistance from the Dark Council. The Dark Council was astonished that one of its own members was incapable of defeating a mere Lord so they decided to let Kallig challenge Thanaton. Darth Thanaton was defeated by Kallig and Darth Mortis of the Dark Council executed Thanaton. Darth Marr and the rest of the Dark Council gave Thanaton's seat to Kallig and so Kallig was named Darth Nox (Or, according to some, Darth Imperius)."}, {"tag": "p", "text": "These are only a few examples of the fragmentation and infighting in the Empire. There was much more, as was common in Sith tradition. Eventually, this led to the Empire growing weak and lacking unification, as Darth Marr confesses on Makeb."}, {"tag": "h4", "text": "Further Campaigns"}, {"tag": "p", "text": "After the battles of Corellia, the Empire fought on Ilum and Makeb as the war went on."}, {"tag": "p", "text": "On Ilum, battles were fought to stop Darth Maglus, otherwise known as the False Emperor, from having his New Empire take over. In the end, Malgus was struck down after trying to fight both the Republic and the Empire at once, and his New Empire crumbled shortly after."}, {"tag": "p", "text": "As for the campaign on Makeb, it was to mine a new precious resource only found there dubbed Isotope-5. However, the planet was under the Hutt cartel's control, armies of mercenaries stationed there as the criminal empire mined said resource, seeking to rekindle its age of glory with its power. The Empire was on the verge of collapse and so it was Darth Marr that decided Makeb had something valuable to give during this war. He sought to collect what little remained of the mineral and with it to recreate the Empire from the ground up in the Emperor's absence."}, {"tag": "p", "text": "The fight on Makeb was far from simple. It turned out that nearly all of the Isotope-5 had been used by the Hutts to create battle droids. There was only precious little left in the planet's now unstable core. In fact, Makeb was soon going to collapse upon itself."}, {"tag": "p", "text": "Miraculously, the tide was turned and Makeb was saved. So the Empire was able to collect what Isotope-5 it needed."}, {"tag": "h4", "text": "New Leadership"}, {"tag": "h3", "text": "The Fallen Empire"}, {"tag": "h4", "text": "A New Threat Arises"}, {"tag": "p", "text": "Darth Marr, the de facto head of the Sith Empire, kept a loose alliance with Republic so that they could hunt the former Sith Emperor and began a search in the far reaches of Wild Space but Marr had a second reason for investigating in Wild Space was that the core worlds of both the Republic and Empire were attacked by an unknown army led by twin conquerors and Marr had a hunch that the raids were connected with the Sith Emperor. The joint fleet came under attack by the Eternal Fleet and were decimated, however Darth Marr and an individual, later known as the Outlander, were taken as prisoners by Prince Arcann. Arcann led his prisoners to the throne room where Valkorion welcomed them and then Darth Marr recognized that Valkorion was Vitiate with a new name and face. Valkorion offered power if his prisoners would kneel but Darth Marr refused then retaliated and killed few Knights before being struck down by Valkorion. The death of Darth Marr was felt by everyone throughout the Sith Empire and also that his killer was Vitiate. Valkorion was then killed by Arcann and the Outlander was frozen in carbonite as a result."}, {"tag": "h4", "text": "Aftermath"}, {"tag": "p", "text": "With the leadership of Darth Marr gone and the disappearances of Darth Nox and Lord Wrath, the Empire was without its three most powerful Sith. The Dark Council did not immediately bend to Arcann's rule; however, it was plagued by infighting and self-interests. While some councilors fought against Arcann, others chose to leave and flee to unknown regions of space. Eventually, Darth Acina arose as its only surviving member. With no one powerful enough to challenge her, Darth Acina took control of the Empire and crowned herself as Empress of the Sith."}, {"tag": "h4", "text": "Acina's Rise"}, {"tag": "p", "text": "The Minister of Logistics stepped in for the defunct Dark Council and signed a treaty between the Eternal Empire and the Sith Empire. During the treaty period, the Sith Empire have been slowly but gradually rebuilding their military power and Empress Acina decided to bring about a change internally within the Sith Empire while also rebuilding the Dark Council. Darth Vowrawn, a survivor of the previous Dark Council, pledged his loyalty to Acina and continued to serve the Empire."}, {"tag": "p", "text": "While reigning as the new Sith Empress, Acina realized that Empire was lead to defeat mainly due to the infighting by Sith and also the disappearance of the Emperor in times of crisis. Acina resolved that in order for the Empire to strive the Sith must also adapt to the new era and leave behind the old ways. After the Battle of Odessen, Acina's resolve to form an alliance with the Alliance had gradually started to build up."}, {"tag": "p", "text": "Empress Acina also purged the idea of having only Sith have a say in political matters and thus allowed non-Sith and Sith to advise her in those matters."}, {"tag": "h4", "text": "Joining the Fight"}, {"tag": "p", "text": "After the battle of Odessen, the Eternal Empire was shown to not be as powerful as it was believed and that the Alliance was shown to be an equal contender for the Eternal Throne. During Vaylin's invasion of Voss, Empress Acina personally arrived with her fleet and drove off the Eternal Fleet and then offered the Alliance Commander an alliance between the Alliance and Sith Empire and personally invited them to Dromund Kaas to discuss it. The Outlander, along with, Lana Beniko and Theron Shan arrived to Dromund Kaas and where met with Minister Lorman who escorted them to the Empress's Throne Room."}, {"tag": "p", "text": "Empress Acina welcomed her guests and wanted to privately continue her conversation with the Outlander on her personal shuttle. Once away from Kaas City, the shuttle crashed as a result of sabotage leaving the Empress and Outlander stranded in the jungles. Empress Acina and the Outlander realized that they were being targeted by the GenoHaradan, a mercenary group loyal to the Republic, and soon they made there way to their main camp and took shelter in a nearby temple. Acina and the Outlander found out that their crash were the doings of Minister Lorman, who wanted to rule the Empire, and former Chancellor Saresh, who wanted to seize the Alliance."}, {"tag": "p", "text": "Acina and the Outlander dealt with Lorman and the latter left for Odesson to deal with Saresh. Soon afterwards Acina apologized for the events on Dromund Kaas and believed that their alliance would be greatly beneficial to which the Outlander agreed to."}, {"tag": "p", "text": "After the death of Vaylin by the Outlander's hand, the Eternal Fleet reverted to its primary function and started to bombard Zakuul, Coruscant and Dromund Kaas. Acina pleaded to the Commander for aid and then the Alliance ventured to Zakuul to seize the Eternal Throne."}, {"tag": "p", "text": "Once the Commander claimed the Eternal Throne and formed the Eternal Alliance, The Sith Empire extended their warmest congratulations to the newly formed superpower in hopes of an alliance against the Republic."}, {"tag": "h3", "text": "Short peacetime"}, {"tag": "p", "text": "With the threat of the Eternal Empire extinguished, the Sith Empire was once again preparing for war in response to the Republic's own preparation."}, {"tag": "p", "text": "Shortly afterwards, the Sith Empire and Galactic Republic found Iokath and a battle was commencing deciding on who would take control of Iokath and its resources which prompted the Eternal Alliance to step in. Empress Acina arrived with her forces to seize control of the superweapon before the Republic and sent Major Quinn, former compatriot of the Emperor's Wrath, to negotiate a deal with the Alliance Commander and to sabotage the Alliance base should the Alliance side with the Republic."}, {"tag": "h3", "text": "New galactic war"}, {"tag": "p", "text": "The incident on Iokath and the subsequent decimation of the Eternal Fleet and the Gravestone by the Order of Zildrog, which crippled the Eternal Alliance, set the galaxy's stage for the Third Galactic War, with reports arriving at Odessen about both factions redoubling their efforts to gather supplies, munitions, and fuel in anticipation. The Sith Empire was effectively at war with the Republic and they started by invading the ancient planet of Ossus which housed remnants of the Jedi Order, led by renowned Jedi Master Gnost-Dural, that fled into hiding during the Eternal Empire's conquest. Darth Malora of the Dark Council was sent to oversee the invasion but Malora focused more on her experiments rather than the war effort which prompted Emperor Vowrawn to dispatch a rebuilt, and subjugated, Darth Malgus to take control of the operation and indirectly dismiss Malora as a member of the Dark Council."}, {"tag": "p", "text": "Following the Invasion of Ossus, Darth Xarion of the Dark Council and head of Sith Intelligence orchestrated the Nova Blades pirates to plan an attack on Dantooine and distract the Republic from the Imperial activities on the planet."}, {"tag": "p", "text": "After the Dantooine Incursion, Darth Malgus amassed a massive invasion fleet to destroy the Meridian Complex, a state of the art shipyard on Corellia. To accomplish this, efforts were directed at assisting King Regalun Petryph on Onderon and sabotaging the Republic Fleet at Mek-Sha before Meridian Complex assault the Meridian Complex itself."}, {"tag": "h2", "text": "Government and politics"}, {"tag": "h3", "text": "Central authority"}, {"tag": "p", "text": "The Sith Empire was run as a magocratic authoritarian government. At the head of the Empire sat the Sith Emperor. The Dark Council served as an advisory board and ensured the smooth running of the Empire. The Dark Council served as a combined executive, legislative, and judicial branch of the government. Each of the 12 councilors were responsible for individual areas of the Empire called Spheres of Influence. A sphere would either have one of the three ministries report to it, or would have a bureaucracy under it to ensure its functions. A few spheres also had specific agencies that reported to it, separate from the ministries. These organizations included the Imperial Diplomatic Service and the Imperial Conquest Consolidation Corps."}, {"tag": "p", "text": "The three ministries served as the central pillars of the Sith Empire's rule and oversaw the majority of the Imperial government's operations. Each minister reported to a Sith Lord on the Dark Council or in some cases, to several."}, {"tag": "p", "text": "During the tenure of the Sith Emperor, the Emperor's Hands were the additional layer of power between the Emperor and the Dark Council."}, {"tag": "p", "text": "After the Dromund Kaas Operation, the Emperor went to slumber on Yavin 4 along with his entire power base, except the Emperor's Wrath, leaving control of the Empire to the Dark Council. The Emperor's Hands later decreed secretly to the Wrath to act in place of the Voice and to continue defending the Empire. The Revanite Incident and the Genocide on Ziost led the Dark Council to brand Vitiate an enemy of the Empire and as such Darth Marr took control of the Dark Council to assist in rebuilding the Sith Empire's power base with the help of powerful allies. The Empire's Wrath remained as the second-in-command of the Imperial military after Darth Marr per their order by the Hand to safeguard the Empire until the Emperor's return."}, {"tag": "p", "text": "The Revanite Incident opened the eyes of the Dark Council to the Emperor's plan to wipe out the galaxy and so Darth Marr, the de facto leader at the time, declared the Emperor a traitor and an enemy. Darth Marr then re-purposed the now former Emperor's Wrath into the Empire's Wrath in light of the Wrath's loyalty to the Empire rather than to the Emperor. During and after the Ziost Genocide, the Dark Council assumed total control of the Sith Empire and organized a search and destroy hunt for their former Emperor."}, {"tag": "p", "text": "After the death of Darth Marr and the disappearances of Darth Nox and the Empire's Wrath, the Dark Council fought against the Eternal Empire fiercely but without Marr's leadership and the loss of their other two most powerful Sith, their loss was inevitable. Most of the Dark Council members had either died or disappeared and when the dust cleared Darth Acina was left standing and declared herself as Sith Empress. After the fall of the Eternal Empire, Empress Acina reformed the Dark Council into five spheres through merging of the former ones. Nevertheless, she continued to rely on both Sith and non-Sith advisors."}, {"tag": "h3", "text": "Ministry of War"}, {"tag": "p", "text": "The Ministry of War was one of the three ministries of the Sith Empire's government, and it was charged with overseeing the armed forces of the Empire. The Imperial Navy's fleet deployments, repairs, maintenance, and starfighter squadrons were all arranged and organized by the Ministry of War, and the Ministry also oversaw the Imperial Army: deployments, combat tactics, strategy, security, Special Forces operations, black ops missions, and the Imperial Reclamation Service were all under the control of the Ministry. The Ministry was headed by the Minister of War, who answered to three Dark Councilors: the heads of the Defense, Military Offense, and Military Strategy spheres. Beneath the Minister were the Moffs, who served as governors and military leaders who oversaw wide regions of Imperial space, and a strict chain of command was maintained to ensure the military discipline and efficiency that the Empire prided itself on. The Minister of War has no jurisdiction over the Emperor's Wrath as they only answer to the Sith Emperor."}, {"tag": "h3", "text": "Ministry of Intelligence"}, {"tag": "p", "text": "The Ministry of Intelligence answered to the Sphere of Imperial Intelligence. Headed by the Minister of Intelligence, the Ministry was responsible for providing information and sowing disinformation as necessary. The largest organ of the Ministry was Imperial Intelligence. It served as the Empire's primary covert intelligence and counter intelligence service. Its day-to-day operations were headed by the Keeper who also ran Imperial Intelligence's Operations Division. Under Keeper were Watchers, charged with running field agents, Ciphers, the top tier of field agents, Fixers, technical agents, and the Minders, the internal security and secret police force. A second apparatus of the Ministry of Intelligence was the Outreach Bureau. The Bureau's purpose was to inform citizens of the daily news of the galaxy. More often than not, the Bureau reported facts as suited the Empire and produced copious amounts of propaganda praising the Empire and casting the Republic as evil."}, {"tag": "h3", "text": "Ministry of Logistics"}, {"tag": "p", "text": "The ministry was controlled by the Minister of Logistics who technically answered to the Sphere of Production and Logistics though he would also at times report to other councilors such as the Sphere of Defense of the Empire if it referred to a military issue. Though seen by some as the lowest of the Ministries, it was also the most vital. The ministry provided calculations to fend off enemy troops, logistical necessities of fleets and ground forces, and financial concerns of a war. The Ministry was additionally charged with the smooth running of the economy, managing both the nationalized industries and the factories that produce the weapons for the Empire's war machine. Along with this are agricultural worlds that are used for the food supplies of the Imperial military. The Ministry also supervised the Empire's slave labor and makes adjustments where necessary to complete building projects and run various industries. Added to this, the ministry runs the Empire's civilian transportation and trade network ensuring the transit of goods in the Empire."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Imperial population was much smaller when compared to the Galactic Republic and was divided between both Sith as well as non-Sith. This division between the ranks meant that both were worlds apart and that the upper echelons of power were reserved for only Force-sensitive Sith alone who served as the elite. While this was the case, the average citizen was still quite loyal to the Empire and everyone had the chance to become Imperial Agents, Grand Moffs or Grand Admirals. The membership in the Imperial Guard was explicitly reserved for non Force-sensitive individuals and because of the close ties with the Emperor himself not even the highest ranking Sith-Lord dared to resist them."}, {"tag": "p", "text": "The average Imperial citizens were convinced that the cause of the Empire was a righteous one. Imperials, like the Sith, saw the Republic as nothing more than an inefficient, chaotic, bloated, corrupt, mish-mash of different species and nations each supporting its own agenda ahead of that of the entire Republic. They also held great contempt for the Republic Senate and other political leaders who were placed in power through wealth, family connections, and corruption, rather than earning their position like the Sith Lords. Despite initial Jedi and Republic beliefs that most Imperials would welcome them as liberators from the yoke of the Sith, most Imperials were happy to serve the Dark Lords, and bore resounding hatred for the Jedi and Republic and all they stood for. Imperial society was based on the ideology of the strong ruling and the weak serving. Imperial citizens saw the Sith as a stronger force and therefore it was their natural right to rule."}, {"tag": "p", "text": "The vast majority of Imperials felt that the Empire was the only force that could impose peace, stability and order on the galaxy, and that it was their duty to see that it did by any means necessary. Also, many Imperials viewed the war with the Republic as a war for survival rather than conquest. Like the Sith, the Imperial citizens were educated about the end of the Great Hyperspace War and the carnage from the Republic and Jedi holocaust of the Sith people that resulted in the indiscriminate massacre and near extinction of the entire Sith civilization. The people of the Empire did not forget the horrors inflicted on them by the Republic, and Sith and Imperial alike believed that if they didn't wipe out the Jedi and Republic first, then they would be wiped out by them. They feared that the Jedi would succeed in destroying all traces of the Sith Empire."}, {"tag": "p", "text": "Among the Empire, slavery was a common practice left over from the old empire and typically consisted of alien species that were not true citizens of the Empire. The Sith Empire was known to make extensive use of slave labor, which some considered to be one of the many factors that gave them a military advantage over the Republic. It was somewhat frowned upon by the Sith if any of their members considered a slave either as a wife or a partner. Furthermore, they were expected to be treated harshly, though this was not always the case, as some Sith were quite fond of their slaves, treating them somewhat like pets. Many slaves became part of the Sith Empire as prisoners of war, or even by being transferred to Imperial ownership after their previous masters were defeated."}, {"tag": "p", "text": "At some point in the Empire's history the Emperor decreed that no slave could ever be freed for any reason and that their rank would be passed down to all their descendants as well. Because of this the majority of slaves in the Sith Empire are Twi'leks, Duros and Zabraks, whose ancestors were taken during the early Sith victories in the Great Hyperspace War. However during the Great Galactic War, to replenish the many Sith losses, the Emperor decreed that any slave of adequate Force sensitivity was to be sent to Korriban to be trained as a Sith acolyte. Because of this many slaves were freed from bondage and sent to Korriban, but the training either resulted in success or death, so the 'freedom' was not so literal. Sith acolytes that made it through the training regime were then brought under the tutelage of a Sith. During their apprenticeship they were often required to perform various tasks for their master to prove their worth and skill. While not as lethal to most as the acolyte phase, many Force-sensitives did not make it through the stage of apprenticeship. Those that did make it were recognized as worthy of being a member of the Sith Order and granted the rank of Sith Lord."}, {"tag": "p", "text": "The Sith Empire also had a distinct case of anti-alien sentiment with medical theaters on the field restricting their treatment in favor of humanoid species like Humans, Chiss, Duros, Kaleesh, Twi'leks, Aqualish, Zabraks and Sith purebloods. In fact, upon their return to Republic space, their prejudice against non-humanoids was a tradition that was at least a thousand years old, though certain Sith Lords ignored it to suit their own ends. The Sith Empire typically believed that Sith purebloods and humans were the master races of the galaxy, and alien humanoids, while superior to non-humanoids were only fit to be slaves. The purebloods were seen as superior as they were the biological descendants of the Sith native to Korriban, who fought off the Rakata. Humans were also seen as superior due to the fact that the first Dark Jedi exiles to arrive on Korriban were human, including Ajunta Pall, the first Dark Lord of the Sith. While many Sith purebloods viewed humans as a 'lesser species', they admitted they were near equals. Unlike aliens, humans had no restrictions on their movements or the ranks they could reach in Imperial society. Many humans rose to the highest ranks in the Imperial military, including Odile Vaiken, the first Imperial Grand Moff. Over the millennia many human Sith Lords held seats on the Dark Council. Not all Sith purebloods were welcomed into the elite ranks. A pureblood with no Force sensitivity was rare and considered an abomination. Unless the pureblood's family was able or willing to gain them an easy administration position, these non-Force-sensitive purebloods were either killed or enslaved."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "The Imperial Military was the backbone of Imperial society and the Empire itself, as Imperial culture and society had been highly militarized since the Empire's early years on Dromund Kaas. Odile Vaiken's training regimen, which saw use by the Empire for centuries after Vaiken's death, led to the drafting of every able-bodied adult into military service. This remained a mainstay of the military in the centuries after his death: every non-Force-sensitive in the Empire was automatically conscripted into the military upon reaching adulthood, and they remained in service until retirement or disability. While advancement and promotion helped skilled military officers establish powerful families with histories of military service, the children of those families were expected to earn their own place in the military and received no special treatment on account of their lineage."}, {"tag": "p", "text": "Above the ranks of generals and admirals in the Army and Navy, there existed the rank of Moffs and Imperial High Command, which answered directly to the Ministry of War. The individual who holds the rank of Grand Moff, which was established for Odile Vaiken, answers directly to the Minister of War and possesses special privileges, often developing close ties to the Dark Council. Moffs were allowed greater variety in their uniform colors, as they typically tailored their uniforms to reflect past service and their current command. Imperial officers also utilized code cylinders, which allowed them access to secure areas and intelligence resources."}, {"tag": "h3", "text": "Army"}, {"tag": "p", "text": "The Imperial Army was the ground forces of the Sith Empire, and the soldiers of the Empire typically wore black and red colored armor and carried blaster rifles into combat. Ground forces begin live-fire exercises in the jungles of Dromund Kaas within weeks of their enlistment into the military, and even those non-combatants in the military were trained in the use of basic weapons, survival skills, and first aid. The Army also made use of Imperial crawler tanks, walkers, and a number of models of war droids. Imperial heavy troopers were issued full-body black armor crafted from duraplast, with colored markings signifying their unit or special assignments. Their leg armor was specially designed to preserve mobility and to protect from shrapnel, and while their belt housed extra ammunition and grenades for easy access, the armor's bracers housed environmental and targeting controls, and the readouts on the suit's chest provided medical diagnostics for treating soldiers who were wounded in their armor. Imperial soldiers typically wore about a hundred pounds of armor, and most soldiers carried rifles, sidearms, grenades, and five days of rations. The typical service period for an Imperial soldier was twenty-five to thirty years."}, {"tag": "p", "text": "Imperial Army rank structure was as follows: Private, Specialist, Corporal, Sergeant, Ensign, Lieutenant, Captain, Major, Colonel, and finally General. A fire team typically consisted of two or three soldiers, while a squad ranged from five to ten, and a platoon from fifty to a hundred soldiers. Companies could range from a hundred to three hundred troopers, and a battalion, which was typically commanded by a major, consisted of 700-1,500. Colonels commanded brigades, which ranged from 5,000-7,500 soldiers, and the largest standard unit was a division, which ranged from 20,000-40,000 soldiers. A larger unit designated an \"Assault Group\" or \"Operations Group\" could be formed from over 40,000 soldiers, which were placed under the command of a Moff or high-ranking Sith Lord for specific assignments and then broken up after the completion of the mission."}, {"tag": "h3", "text": "Navy"}, {"tag": "p", "text": "The Imperial Navy was the naval branch of the Imperial Military, and was overseen by the Ministry of War alongside the Army. Imperial Navy ranks adhered to the following structure: Private, Specialists, Corporal, Petty Officer, Ensign, Lieutenant, Captain, Group Captain, Commodore, and Admiral. The primary vessel of the Navy was the Harrower-class dreadnought, a massive dreadnaught produced by Taerab Starship Manufacturing and measuring approximately 800 meters in length, that required a crew of 2,400 and carried a troop complement of 7,300. The Harrower-class was supported by the smaller Terminus-class destroyer, which was operated by 520 crewman and carried only 285 troops, and the even smaller Gage-class transport. The two main shuttles used by the Sith Empire were the Imperial Shuttle and the Imperial assault shuttle. The Navy deployed a number of starfighters—the Mark VI Supremacy-class starfighter and its numerous advanced models were the standard starfighter of the Navy, and they made use of B28 Extinction-class bombers as well as a variety of transports, assault craft, shuttles, and cruisers."}, {"tag": "h2", "text": "Astrography"}, {"tag": "h3", "text": "Territory"}, {"tag": "p", "text": "The domains of the Sith Empire were not strictly located within the known worlds and included planets within the Unknown Regions. These were taken by military expeditions into those unknown tracts of space and the claiming of such worlds further expanded the influence of the Empire."}, {"tag": "h3", "text": "Major locations"}, {"tag": "h4", "text": "Dromund Kaas"}, {"tag": "p", "text": "Dromund Kaas was the capital of the Sith Empire and the ground of the Empire's rebirth. A long abandoned Sith colony, Dromund Kaas was discovered by the Sith Emperor and his minions after twenty years of aimlessly wandering the stars. The Sith then re-colonized the planet. Thus, it became the new Sith capital and the Emperor's seat of power."}, {"tag": "p", "text": "In the planet's atmosphere, tainted Force Storms raged from the Emperor's dark rituals, and on the surface the Sith built Kaas City. In this city, they erected the Dromund Kaas citadel, a giant bastion built as a testament to the power of the Emperor. The citadel also served as the residence of both the Sith Emperor and his Dark Council."}, {"tag": "p", "text": "It was from Dromund Kaas that the Sith prepared their revenge against both the Galactic Republic and their Jedi guardians, for centuries. There they built an armada, great enough to challenge the Republic's, which they unleashed upon the galaxy in the Great Galactic War. After the Great War, the Emperor decided to pursue his own, mysterious, goals and the Dark Council ruled the Empire from Dromund Kaas in his stead."}, {"tag": "h4", "text": "Korriban"}, {"tag": "p", "text": "Korriban was the original homeworld of the Sith species and where the first Dark Lords founded the Sith Empire. A desert ridden planet of sand and red rock, it was considered holy ground by the Sith. Full of ancient Sith ruins, it housed many of the tombs dedicated to the ancient and powerful Dark Lords of the Sith. Thus it was a haven for the dark side of the Force."}, {"tag": "p", "text": "The retaking of Korriban was one of the top priorities for the Sith Empire when it re-emerged during the Great Galactic War. Early on in their galactic conquest, the Sith managed to reclaim their ancient homeworld in a well orchestrated military campaign. There they re-established the old Sith Academy in the midst of the Valley of the Dark Lords. A new generation of Sith students was then sent to the academy to be trained in the ways of the dark side. The Overseers pitted the students against each other, ensuring that only the strongest and most worthy survived long enough to become true Sith. On Korriban, with the intention to reclaim forgotten Sith knowledge, the Sith began unearthing old artifacts of the ancient Sith Lords."}, {"tag": "p", "text": "Korriban quickly became a major planet in Sith space once again, and many Sith Lords, amongst them several members of the Dark Council, settled on Korriban."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}