{"url": "Barabel", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Barabel", "Category:Outer Rim Territories species", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Barabel"}, {"tag": "p", "text": "The Barabel were a saurian species native to the irradiated planet Barab I. They had blaster-proof scales and were incredibly strong, earning a fearsome reputation that put them in high demand as hired muscle in the criminal underworld. The species revered the Jedi Order and its combat prowess, but shared little of their morality and found the pain of others amusing."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Barabel were a bipedal saurian species that possessed an imposing form with prodigious physical strength. Their bodies and tails were covered in dark green scales that were blaster resistant, and their reptilian visage and mouth full of needle-sharp teeth struck a primal fear into many mammalian species. Barabel made a \"sissss\" sound when laughing."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Barabels were native to the irradiated planet Barab I and revered the Jedi Order, telling tales of their combat prowess across their homeworld. The species shared little of the Jedi's morality however, finding the pain of others comical, particularly \"squishy\" species such as humans, who endlessly amused them. Barabels took some getting used to, considering apologies to be insulting, but Barabel loyalty ran deep once given."}, {"tag": "h2", "text": "Barabel in the galaxy"}, {"tag": "p", "text": "Barabel had a fearsome reputation that lead to them being coveted as hired muscles in the criminal underworld, and Barabel enforcers could be found serving at the right hand of many crime lords. Often found wielding the Gamorrean Arg'garok, they acted as bodyguards or doled out their employer's twisted sense of justice. On some occasions, the Barabel cultural hatred of apologies led to violence when they were sent to collect from debtors. Due to their deep sense of loyalty, some Barabel would form lasting partnerships with minor criminals such as smugglers, slicers, shipjackers, or arms dealers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the new Star Wars canon, the Barabel were first mentioned in the 2019 Fantasy Flight Games roleplaying supplement Allies and Adversaries. The species originated in the Star Wars Legends continuity, where it was first mentioned in Galaxy Guide 4: Alien Races, a 1989 Star Wars: The Roleplaying Game supplement written by Troy Denning and published by West End Games."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}