{"url": "Sith/Legends", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Articles in need of updating", "Category:We're Doomed!", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Articles needing additional sources", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Sith"}, {"tag": "p", "text": "The Sith, also referred to as the Sith Order was a sect of Force-sensitives who utilized the dark side of the Force. The term \"Sith\" originally referred to a species of aliens native to the planets Korriban and Ziost, who were later enslaved and ruled by exiled Dark Jedi from the Galactic Republic. These Dark Jedi had once been members of the Jedi Order, a monastic Force religion dedicated to peace through the use of the light side of the Force. The Dark Jedi, who refused to rely exclusively on the light side, challenged the Jedi by giving in to the dark side, which started the Hundred-Year Darkness. However, they had been defeated and subsequently exiled from known space, which led to their discovery of the Sith species. Following centuries of interbreeding and mixing of cultures between the aliens and the exiles, the Sith would no longer be identified by their race, but by their dedication to the ancient Sith philosophy. This religious order would survive in many different incarnations throughout galactic history. The rise of a new leader, or Dark Lord, would often cause drastic reorganizations in the cult, however the Sith would always be characterized by their lust for power and their desire to destroy the Jedi Order."}, {"tag": "p", "text": "The Sith were the most infamous of all dark side religions, and the members of the cult were often seen as the pinnacle of power within the dark side. Throughout their long history, the Sith commanded several Empires and initiated many galactic wars. With such great influence, the Sith religion inspired many cults that weren't technically part of the Sith Order, nor did they consist of actual Sith. Instead, they were founded and made up of Sith devotees and other Force-sensitives dedicated to prolonging the teachings and the memory of the Sith. Such cults included the Naddists, the Disciples of Ragnos, and the Krath."}, {"tag": "h2", "text": "Philosophy"}, {"tag": "h3", "text": "Forged by fire"}, {"tag": "p", "text": "The Sith believed that conflict was the only true test of one's ability, and so emphasized its importance. It was their belief that conflict challenged both individuals and civilizations, and so forced them to grow and evolve. They believed that the avoidance of conflict–like the pacifist teachings of the Jedi–resulted in stagnation and decline."}, {"tag": "p", "text": "Another purpose served by conflict was the elevation of the strong and the death of the weak. By encouraging strife, the strong were able to exercise their power while the weak were weeded from the ranks of the Sith. A core tenet to Sith philosophy was self-reliance and the idea that an individual only deserved what they were strong enough to take. Likewise, morality was treated as an obstacle to be overcome, as it got in the way of a Sith's ability to recognize and seize opportunities for advancement and self-empowerment. According to the Jedi Obi-Wan Kenobi shortly before dueling his former friend turned Sith Lord Darth Vader, a key mark for someone permanently becoming a Sith is if they \"deal[t] in absolutes.\""}, {"tag": "p", "text": "Such philosophies were embraced and taught at Sith academies, where students were encouraged to challenge one another and fight for prestige that would be recognized by the headmaster of the academy. At the academy on Korriban during the Jedi Civil War, students were tasked with gaining prestige so they might become one of the \"chosen few\" accepted into the ranks of Darth Malak's Sith Empire. The strife to achieve prestige caused rivalries and animosity between the students, as there were few tasks that offered prestige, and many prospective Sith. Similarly, the students of the academy during the New Sith Wars were pitted against each other in dueling sessions atop the academy. It was during these dueling sessions that intense rivalries were formed - rivalries that resulted in the deaths of students Fohargh and Sirak at the hands of Darth Bane."}, {"tag": "h3", "text": "Empowered by passion"}, {"tag": "p", "text": "The cornerstone of a Sith's power was emotion. While the Jedi taught that fear, anger, and pain were negative emotions to be overcome, the Sith believed that these strong emotions were natural, and aided individuals in their survival. By harnessing their emotions rather than suppressing them, the Sith believed they could achieve true power. This belief was in stark contrast to that of the Jedi, who strived to place themselves beyond such base emotions. Indeed, the Sith saw passion as the only real way to fully understand the Force. However, the Sith believed strongly that the worthy could control their emotions and use them, while the weak were ruled by them. In accordance, Dark Lady Lumiya refused to accept Jacen Solo as a Sith Lord until he was able to control his anger instead of becoming a slave to it, and Freedon Nadd renounced his faith in Exar Kun shortly before his destruction, when he discovered the limitless ambition Kun served."}, {"tag": "p", "text": "However, not all emotions were embraced by the Sith. They, like the Jedi, considered 'love' a dangerous emotion, but for different reasons. The Jedi discouraged love because it led to attachment, but the Sith taught that love led to mercy, which was anathema to them. While Darth Sidious preyed on Anakin Skywalker's love for his wife in order to corrupt him, he had no intention of allowing the relationship to survive Skywalker's fall to the dark side. Darth Bane had fallen in love with fellow Sith pupil Githany, however he did not allow himself to retain any connections to her, and did not regret her death on Ruusan. However, this didn't stop some Sith from taking lovers and allowing themselves to feel this emotion. Darth Malgus, for example, had a lover, Eleena Daru. In Malgus's case however, he eventually killed Daru as he realized that she constituted an intolerable weakness."}, {"tag": "h3", "text": "The Sith'ari"}, {"tag": "p", "text": "In the original Sith, the term \"Sith'ari\" translated literally into \"lord\" or \"overlord\". Over time however, the term became closely associated with the idea of a perfect being, who would rise to power and take control of the Sith Order."}, {"tag": "p", "text": "The prophesied coming of the Sith'ari was based around the notion that a perfect being, would epitomize the teachings of the Sith Code and became free of all restrictions. This being would lead the Sith, but also destroy them- a destruction that would make the Sith Order stronger than before. The identity of the Sith'ari has been confirmed as Darth Bane,[source?] who destroyed the Brotherhood of Darkness in order to remake the Sith through the Rule of Two. The prophesy of the Sith'ari is very similar to the Jedi's prophesy of the Chosen One—an extremely powerful Force-sensitive who would lead their Order to perfection."}, {"tag": "h3", "text": "Guiding codes"}, {"tag": "h4", "text": "The Code of the Sith"}, {"tag": "p", "text": "The code of the Sith was the mantra which stated the core beliefs of the Sith Order and is believed to have been created in contrast to the Jedi Code. The structure of the codes is almost identical, and the initial line of the Sith Code directly contradicts the initial line of the Jedi Code, which reads: \"There is no emotion, there is peace.\""}, {"tag": "p", "text": "Following the embrace of passion, which was believed to be a powerful aspect of nature, the code explains that the strength granted by passion leads to power, which then leads to victory. By way of victory, the Sith believed they could free themselves from the limitations of regular beings, and achieve their potential. Neophyte Sith believed that the breaking of chains represented the ability to do whatever one wished, however more seasoned members of the Order recognized that the true meaning of freedom was the end of all physical restrictions and the ability to attain perfection. The Sith believed that the only being who could truly live up to the code and attain freedom was the Sith'ari, and as such saw it as a guideline by which to live, not a law to abide by."}, {"tag": "h4", "text": "The rule of two"}, {"tag": "p", "text": "The Rule of Two was the principle upon which the Order of the Sith Lords was founded. It was created by Darth Bane, a Dark Lord and member of the Brotherhood of Darkness. Bane believed that the Sith had weakened themselves by accepting too many into their ranks and that the true dark side had abandoned them. After studying the holocron of Darth Revan, Bane decided that the Brotherhood needed to be destroyed and the Sith rebuilt as a secretive order consisting of two beings—a single master and a single apprentice."}, {"tag": "p", "text": "Bane believed this philosophy would solve the infighting that had long been the bane of the Sith Order. By allowing only two members into the cult at a time, the dark side would remain concentrated within those two beings, instead of legions of ineffective warriors. When the apprentice learned all they could from the master, it was their duty to kill the master and take an apprentice of their own, in order to ensure the continuing strength of the cult. As such, the Rule of Two embraced the idea of the rule of the strong. The small number of Sith allowed the Order to remain hidden for a millennium."}, {"tag": "h4", "text": "The rule of one"}, {"tag": "p", "text": "The Rule of One was the guiding code of the One Sith. Created by Darth Krayt after the collapse of the Order of the Sith Lords, it embraced the ideals of the ancient Sith, wherein there was a single Dark Lord of the Sith who led many lesser Sith Lords, along with other minions and acolytes. The \"One\" represented the Sith Order itself, a unified and cohesive group of Sith who restrained from infighting and were fanatically obedient to Dark Lord Krayt. The practice of one apprentice per master was retained, however there were many masters. Also retained was the practice of slaying a master once an apprentice's training was complete, however this was not done to continue the rule of the strong, but rather to show one's faith and devotion to the Sith cause."}, {"tag": "p", "text": "The Order was considered heretical by Darth Bane, Darth Nihilus, and Darth Andeddu, who voiced their opinions via holocron. Some, including Darth Nihl and Cade Skywalker believed that the lack of a line of succession would cause the One Sith to collapse if Darth Krayt were ever killed, though upon Darth Krayt's final death control passed to Darth Nihl and the One Sith continued to follow their Lord loyally."}, {"tag": "p", "text": "A similar yet different philosophy existed under Sidious's running of the Order. The main difference is that, while it does maintain that only one Sith lord (in this case, Sidious) actually matters, it otherwise superficially held to the Rule of Two."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Before the founding of the Jedi Order and the discovery of the dark side, the Sith species evolved on Korriban. The Sith species began to coalesce as a society some time prior to roughly 100,000 BBY, when their culture and religion developed. Early on, they immersed their culture in rites and lore of the dark side. Coming together as a species, they were able to fight off a Killik incursion circa 30,000 BBY, presumably resulting in an eventual Killik Sith Lord taking up residence on Alsakan, although how this Sith Lord was able to break from the hive-mind is unknown. Around 28,000 BBY, legendary Sith King Adas ruled his people and their Empire. Having ruled as a warlord for some time, he was able to unite the peoples of Korriban, and was pronounced the Sith'ari, or overlord. Adas's reign lasted for several centuries, ending only after the invasion of Korriban by the Rakata of the Infinite Empire."}, {"tag": "p", "text": "Initially friendly, the Rakata taught Adas how to create holocrons, and lent their knowledge of space travel to the Sith. However, it soon became apparent that the Rakata intended to take the Sith people as slaves, and Adas launched a war to rid his world of them. After driving them from Korriban, he hijacked several of their ships and used them to spread the Sith species to Ziost, Tund, and Malachor V, and was eventually successful in driving the Rakata from Sith space entirely. However, the victory cost him his life. The Rakata left behind a Star Map on Korriban, and possibly the origin for the Darth title."}, {"tag": "p", "text": "The death of Adas threw Korriban into civil war, with many different Sith scrambling for power. The world was devastated from the years of conflict, and no new leader arose from the ashes. One of the horrors of this war took place in 7000 BBY, when Dathka Graush destroyed most of the cities on Korriban, possibly resulting in the backwards, primitive cultural regression of the Sith species (ultimately witnessed by the exiled Dark Jedi, upon reaching Korriban).[source?] The Sith people moved their center of government and culture to the world of Ziost, and left Korriban, with that planet becoming a tomb world for their fallen leaders. A millennium prior to this, in 8000 BBY, humans and aliens escaping the oppression of the Tapani Dynasty arrived through the Stygian Caldera, possibly accounting for the Sith influence upon the future Mecrosa Order in later centuries."}, {"tag": "p", "text": "In 25,053 BBY, elsewhere in the galaxy, the Galactic Republic was forming. On the planet Tython, scholars, scientists, warriors, and religious figures met to discuss an anomalous energy field present in the galaxy that would become known as the Force.\nIn these discussions, several individuals advocated the use of Bogan, what would become known as the dark side. The followers of the light rejected this idea and defeated the followers of Bogan in the Force Wars of Tython.\nFollowing the conflict, the victors established the Jedi Order, a group of warrior-monks who followed the light side. Around 24,500 BBY, a Jedi named Xendor accepted the teachings of the dark side and left the order, along with many other students calling themselves the Legions of Lettow. The resulting conflict, known as the First Great Schism, ended with Xendor dead and the Legions of Lettow defeated."}, {"tag": "p", "text": "The dark side would not have a strong hold until 7000 BBY, when another group of Jedi left the Order to follow the dark path. These Jedi had been delving into alternative uses for the Force, and became increasingly reliant on it. They discovered that the Force could twist life to serve their purposes and create new life. These practices were looked upon with apprehension by other Jedi, as memories of the First Schism were still present. Feeling their power was threatened, the rogue Jedi sought supporters within the Order, but were turned away. Arguments for their cause turned to conflicts, and these Jedi were exiled from the Order. Taking their teachings with them, they became known as Dark Jedi, and launched a war against the Jedi Order that would come to be known as the Hundred-Year Darkness."}, {"tag": "p", "text": "Using alchemically altered soldiers and beasts, the Dark Jedis' war lasted a hundred years. It was during this war that the Leviathan was created, along with many other monstrosities. Eventually, the Dark Jedi were defeated at the Battle of Corbos as a result of infighting and Jedi bombing. As punishment, the surviving Dark Jedi were gathered by Republic forces and loaded aboard unarmed transport ships. Robbed of their weapons, the exiles were to be sent into the unknown regions of space to contemplate the error of their ways."}, {"tag": "h3", "text": "Creation and early history"}, {"tag": "p", "text": "The Exiles traveled the stars towards an unknown destination. They emerged from hyperspace above Korriban, where they were greeted by the primitive Sith people. The Exiles, who included XoXaan, Remulus Dreypa, Ajunta Pall, Sorzus Syn and Karness Muur, shocked the natives with their dark side abilities and were proclaimed Jen'jidai, meaning Dark Jedi in the language of the Sith. The Jen'jidai forged an alliance with the Sith ruler's second in command and used that relationship to overthrow the King and claim dominion over the Sith. They adopted the title \"Lords of the Sith\" and their ruler came to be known as the Jen'ari, or Dark Lord of the Sith. Shortly after settling on Korriban, however a splinter group of exiles, led by Remulus Dreypa, returned to Republic space to enact their vengeance, but they were intercepted by a Jedi patrol. The Jedi pursued those Sith across the galaxy, until both factions crash-landed on the planet Kesh. After a period of fighting, the Jedi and Dreypa's followers made peace and formed a new organization called the Doomed, which strived to achieve balance between the light and the dark sides of the force."}, {"tag": "p", "text": "One of the first Dark Lords was the Exile Ajunta Pall. Pall began remaking the Sith Empire into a new Imperial regime lead by the Sith Lords instead of the Kings of the Sith people. Over time the Jen'jidai and the Sith interbred to make the two groups indistinguishable from one another, and the Empire continued to be lead by a succession of Dark Lords, including Tulak Hord. Deceased Dark Lords were entombed in the Valley of the Dark Lords on Korriban instead of the Valley of Golg as Sith Kings had been. Their tombs were filled with the treasures they had accumulated during their life, as well as strong dark side energies. Often the tomb would also house the spirit of the Dark Lord himself, who remained attached to his body and possessions through the Force."}, {"tag": "p", "text": "During their reign, the Sith Lords fought for power, challenging one another with new and innovative weapons created through the dark side. One such weapon was the Muur Talisman, which was created by the Sith Lord and former Dark Jedi Karness Muur. Muur was an expert in Sith alchemy and may have helped to create the Leviathan during the Hundred-Year Darkness. His talisman had the power to transform humans into alchemically engineered monsters called Rakghouls, whom Muur would be able to command. When he discovered that aliens and Force-sensitives were unaffected, Muur created the Rakghoul plague, which would spread his monsters to those immune to the talisman's power. Eventually, a rival Sith Lord Remulus Dreypa created an oubliette which would contain Muur, his talisman, and the plague. Muur was killed before he could be captured and his talisman was lost, only to end up on Taris several millennia later by unknown means."}, {"tag": "p", "text": "Eventually, a legendary Sith half-breed named Marka Ragnos defeated Sith Council member Simus in combat and rose to power, claiming the title of Dark Lord of the Sith. His little-documented but long reign was known to have been during the \"Golden Age\" of the Sith Empire. During this time the Empire experienced relative stability and encompassed at least 120 planets, including Arkania, Malachor V, Thule, and Vjun. By this time the Galactic Republic and Jedi Order had forgotten about their fallen brethren, just as the Sith had forgotten about them. Both societies thrived in separate parts of the galaxy, unaware of the other's existence."}, {"tag": "h3", "text": "The Great Hyperspace War and Fall of the Sith Empire"}, {"tag": "p", "text": "The Golden Age came to an abrupt halt with the death of Marka Ragnos. Control of the Empire fell to the Sith Council, which was divided over who should succeed Ragnos as Dark Lord. Two contenders rose to the forefront- Naga Sadow and Ludo Kressh. Sadow was known as a progressive expansionist in contrast to Kressh's reputation as a conservative protectionist. Originally confined to arguments and debates within the council, the disagreement exploded violently during the Funeral of Marka Ragnos. The funeral procession was led by Kressh, with Sadow conspicuously missing during the ceremonies. Much to Kressh's chagrin, Sadow made his entrance in the middle of Kressh's eulogy for the fallen Dark Lord. The enraged Kressh demanded Sadow leave, however his rival instead claimed the mantle of Dark Lord. Kressh responded by claiming the title as well, and the two entered into a duel at the foot of Ragnos's tomb. The fierce battle was interrupted by the ghost of Marka Ragnos, who implored the two to stop fighting and pick their battles carefully, for the Sith Empire he had helped build was in the balance."}, {"tag": "p", "text": "Following Ragnos's departure, the two Sith Lords prepared to reenter combat, however they were once again interrupted, this time by the arrival of wayward hyperspace explorers Gav and Jori Daragon. The sibling explorers claimed to hail from the Galactic Republic, and were quickly taken into custody and imprisoned on the Sith capital world of Ziost. Setting aside their conflict for a time, Kressh and Sadow rejoined the Council, which was debating the fate of the Daragons. Unsurprisingly, the two disagreed on this as well. Kressh, under the belief that they were harbingers of a Republic invasion, called for their immediate execution, while Sadow saw them as a pathway to expansion, by way of conquering their Republic. The council was yet again split between the two, however Ludo Kressh was able to win with the support of the council majority. Simus, a former contender for the title of Dark Lord and ally of Naga Sadow's, went to inform the Daragons of their impending execution. However, Naga Sadow had no intention of following the will of the Council, and killed Simus with weapons confiscated from the Daragon's ship, the Starbreaker 12, making it appear as though it was a Republic attack. He freed the Daragons and hid them away in his fortress on Khar Shian, while reporting Simus's death back to the Council. Feigning shock, he claimed that the apparent Republic aggression and rescue of the Daragons required retaliation, something he had foreseen. The Council almost unanimously elected him Dark Lord, with the exception of Kressh, who claimed the title for himself and stormed out of the meeting. Shortly afterwards, Sadow staged yet another Republic attack by stealing the Starbreaker 12 from impound on Ziost. He would need the ship to return Jori Daragon to the Republic, thereby leading the Dark Lord to his next frontier. The human female was being kept in Sadow's decoy fortress on Khar Delba, while her brother remained on Khar Shian to be trained in the ways of the dark side by Sadow."}, {"tag": "p", "text": "In the process Sadow hoped to rid the Empire of Kressh, and so planted evidence on Ziost that would point to back to himself. Kressh acted predictably and attacked Sadow's decoy fortress on Khar Delba. Sadow had prepared for the battle and stationed his fleet on the dark side of the moon Khar Shian. He attacked an unsuspecting Kressh, whose commanders were betrayed by their crews. Kressh, knowing he could not win the battle, staged his own death and fled, leaving Naga Sadow as the undisputed ruler of the Sith. During the battle he allowed Jori Daragon to escape with the Starbreaker 12, which was wired with a homing beacon. In his first act as Dark Lord, Sadow gathered his forces for an invasion of the Republic, initiating a conflict known as the Great Hyperspace War. Sadow even used Sith Lords as generals in his powerful army, including Garu, and Shar Dakhan. The Republic, unwilling to believe Jori Daragon's story of impending war, was unprepared for the onslaught and was initially overwhelmed by the invasion. Sadow's warships and warriors spread throughout Republic space, attacking many worlds simultaneously, while Sadow himself aided by using battle meditation from within his Sith Meditation Sphere. Stationed above the star Primus Goluud along with his flagship, Sadow presented the Republic with a seemingly unbeatable enemy. Empress Teta of Koros Major was the only Republic official prepared for the assault, and her forces beat back Sith attacks on Cinnagar and Kirrek, and were able to pursue them back to Primus Goluud, where Sadow activated a superweapon within his flagship, the Corsair, that caused the star to supernova. The explosion killed Gav Daragon and forced the Sith to retreat back to their Empire, with Teta's forces in pursuit."}, {"tag": "p", "text": "Returning to Korriban in defeat, Sadow's forces were met with those of Ludo Kressh. After feigning his demise, Kressh had remained within the Empire, gaining support while Sadow lead the invasion of the Republic. The two fleets clashed, initiating the first battle of Korriban. When it appeared Kressh would win the battle against Sadow's already wounded forces, the Dark Lord ordered that one of his vessels ram Kressh's flag ship. The impact killed the rival Sith Lord and ended the battle, Sadow's final conflict with Ludo Kressh. Sadow was unable to enjoy his victory however, as Empress Teta's forces emerged from hyperspace moments later, crippling Sadow's ship and decimating his forces. Hoping to escape to Yavin Prime, Sadow fled the battle, and was believed killed in the Denarii Nova he created with the Corsair. As the remains of the Sith Empire crumbled behind him, Sadow and his remaining Massassi warriors landed on Yavin 4, where construction began on mountainous temples dedicated to the Dark Lord. With the Republic navy entering Sith space the Sith became desperate. Shar Dakhan as acting Dark Lord of the Sith ordered his Massassi pilots to ram invading Republic ships. This drove the Republic back for a while, however the Republic's triumph was inevitable. They destroyed most of the Sith Empire."}, {"tag": "p", "text": "However, this was not the end of the Empire. Various Sith survivors fled to different parts of the galaxy. Several Sith fled to Thule, where they would remain for generations, waiting for their revenge on the Jedi and the Republic. They established a military dictatorship, ruled by an oligarchy of eight generals. Several of the remaining Sith Lords sought refuge on Ambria, where they hid among the planet's dark side energies in order to avoid persecution. They stayed on the planet for many years, until passing into the Force themselves, leaving yet more dark side spirits on Ambria. On Kesh, the descendants of a crashed ship the Omen survived and formed the Lost Tribe of Sith. Several Sith sects survived on Vjun and passed on their teachings secretly through the families. On Tund, the Sith refugees eventually became mere charlatans known as the Sorcerers of Tund. As a result of an unstable hyperdrive, the Sith starship Harbinger traveled to the future to the year 41 ABY. Finally, one Sith Lord took his forces and retreated to the Unknown Regions where they would bide their time, and wait. This hidden Sith Empire still held on to Malachor V as a teaching center. Sadow was unable to rebuild the Empire after the war as he had hoped to do on Yavin, and so placed himself in suspended animation within one of his temples."}, {"tag": "h3", "text": "The rise of Freedon Nadd and conflict on Onderon"}, {"tag": "p", "text": "While Naga Sadow remained in stasis, the Sith Order survived in obscurity on Yavin 4 and the Jedi and Republic once again believed their enemy defeated. Around six-hundred years following the fall of the Sith Empire, a young human began training at Odan-Urr's Great Jedi Library on Ossus. The young Jedi named Freedon Nadd impressed his masters with his connection to the Force and eagerness to find harmony. The attention from his masters caused arrogance in Nadd that lead him to believe he would soon be elevated to knighthood. To his surprise, he was passed over for knighthood, causing him to become resentful and conflicted. Nadd sought out Jedi Master Matta Tremayne in the hopes that she might be able to show him what he must do in order to become a Knight. In a test for the young Jedi, Tremayne ignored him until his anger burst out and he turned to leave. Only then did she acknowledge him, challenging him to a lightsaber duel. The two engaged one another, and Freedon's anger rose. Sensing this, Tremayne deactivated her lightsaber, exposing herself to attack from Nadd. Realizing it had all been a test far too late, Freedon's saber cut through Tremayne, killing her. Initially regretful, Nadd soon became infuriated as he began to believe it was all a ploy to get him removed from the Order. Abandoning the Jedi, he fled Ossus craving revenge."}, {"tag": "p", "text": "Nadd first traveled to the heart of the now defunct Sith Empire in the hopes that the dark side teachings there would lead him to the revenge he desired. He arrived on the world of Ashas Ree, where the ancient Sith Lord Garu had hidden the holocron of King Adas. Learning from the holocron, Nadd studied deeper into the dark side and traveled deeper into old Sith Space. Eventually the he came upon the fourth moon of Yavin and the sleeping Dark Lord Naga Sadow. Sadow, finally recognizing Nadd as one who could restore the power of the Sith, awakened and consented to train the fallen Jedi in the ways of the Sith. The training lasted for a time, however before it was complete, Nadd's confidence in his own abilities once again took control. Believing himself strong enough for the title of Dark Lord, Nadd slew Sadow and seized the mantle. Sadow's death marked the end of the Sith species, as the remaining Massassi on Yavin had become primitive mutations of themselves following centuries of experimentation at the hands of Sadow."}, {"tag": "p", "text": "After gathering what relics he could from the Massassi Temples, Nadd left Yavin 4 behind and traveled to Onderon, an Inner Rim world. Onderon was a densely forested planet home to large beasts and a single, heavily guarded city, Iziz. The city was surrounded by walls and defense towers used to keep out the beasts of the jungle, which the people of Iziz had fought for centuries. Nadd arrived on the planet and wowed the populace with his dark side magic and Force powers. Much like the exiled dark Jedi millennia before on Korriban, Nadd proclaimed himself the ruler of the people in Iziz and King of Onderon. Iziz's law and order was based on the policy of banishing dissidents and \"criminals\" from the walled city, condemning them to death by the animals of Onderon. Eventually, the banished criminals organized themselves into the \"Beast Riders\" after taming the beasts of the jungle, such as the Drexl, Cannok, and Boma. The Riders continually attacked the city they had once called home in a centuries-long conflict known as the Beast Wars. Nadd was able to elevate himself to a near-God status with the people by repelling attacks by the Riders by use of the Force. Although his reign was oppressive, the Onderonians accepted his teachings and embraced his dark side influence. Nadd eventually died and was buried beneath the Iziz palace in his tomb. His bloodline continued to rule Onderon, and although he was dead, Iziz was still saturated with the dark side presence of Freedon Nadd."}, {"tag": "h4", "text": "The Onderonian Monarchy"}, {"tag": "p", "text": "His descendants would continue his oppressive rule as the kings and queens of Onderon, and call upon his lingering spirit for power and dark side teachings. His tomb beneath Iziz became a strong nexus of dark side power and his collections of artifacts became treasures to those seeking his dark side strength. Eventually the Dark Lord's descendant Ommin took the throne and trained extensively with Freedon Nadd's spirit. The two also seduced Amanoa into marrying the King and training in the Sith arts. Nadd played the two against one another hoping the competition would reveal the stronger of the two, and thereby the one worthy of becoming the vessel of his resurrection. Although Ommin became extremely capable in the dark side, his power in the Force caused him to lose control over his own body, and the King became confined to a mechanical exoskeleton that also served as a life-support system."}, {"tag": "p", "text": "Unfit for the public eye, he handed control of Iziz to his wife, Queen Amanoa, who abandoned her studies with Nadd to focus on the affairs of state. While the people of Onderon believed Ommin dead, he hid beneath Iziz in his lair, continuing his dark side study, collecting Sith artifacts, and gathering an cult of followers calling themselves Naddists. Ommin and his wife were both too embroiled with their own interests to take direct command of the cult, and so their proxies, Warb Null and Novar, acted in their stead. The armor-clad Warb Null was a young Force-sensitive who had been seduced to the dark side by a Sith spirit, while Novar had been an apprentice to Ommin and Amanoa following his tenure as Ommin's personal aide."}, {"tag": "p", "text": "Eventually, Freedon Nadd came to realize that neither the King nor the Queen would be fit to serve as the agent of his resurrection. Ommin had become far too weak under the pall of the dark side and Amanoa was no longer focused on the Sith. Unwilling to surrender, Nadd attempted one last time to pull the Queen back into the grip of the Sith, appearing before her and warning her not to allow the still ongoing Beast Wars to fully erupt, as it would result in her destruction. Although Nadd hoped this would scare the Queen back into her dark side studies, Amanoa took an entirely different direction and requested the aide of the Jedi Order to end the centuries-long conflict. The Jedi agreed and sent Master Arca Jeth's apprentices to Iziz to begin negotiations. Hiding the taint of the dark side from the young Jedi Ulic Qel-Droma, Cay Qel-Droma, and Tott Doneeta, Amanoa requested their assistance in defeating the Beast Riders, who kidnapped her and Ommin's daughter, Galia, shortly after the Jedi arrival. Soon, Amanoa learned that her daughter consented to be married to the leader of the Beast Riders, Oron Kira, and hoped to settle the war peacefully. Having no interest in a peaceful settlement, the enraged Queen revealed her dark side allegiance to her enemies, surrounding Iziz in a palpable darkness. During the ensuing battle, the Naddist army fought to defend the Queen as she retreated to Freedon Nadd's tomb beneath the palace. The Naddists fought valiantly against the Beast Riders for a time under Amanoa's dark side influence, however the arrival of Master Arca Jeth broke their advantage. Jeth was able to follow the Queen into the Dark Lord's tomb and dispel his dark energy, killing Queen Amanoa in the process."}, {"tag": "p", "text": "The death of the Queen and the supposed dispersion of Nadd's dark energy did little to pull Onderon out of darkness however. Even after Galia took the throne and the fighting ended, there was still a noticeable dark side aura throughout Iziz. The decision was made by the Jedi to exhume the remains of Freedon Nadd and bury both him and Queen Amanoa on Onderon's jungle moon of Dxun, where their presence could no longer corrupt future rulers. News of his wife's death at the hands of the Jedi and the end of the Beast Wars eventually reached King Ommin, still hiding beneath Iziz. Prepared to reveal himself once more, the frail king had the dark side slave, Warb Null, lead the Naddist cult into battle on the streets of Iziz during the Queen's funeral procession. The dark-siders tunneled up into the surface of the city and ambushed the Jedi. Null fought them off and the Naddists captured the sarcophagi of both deceased monarchs, quickly returning them to Ommin's underground sanctuary. Shortly after the battle, Ommin, empowered by the spirit of Freedon Nadd, distracted Arca Jeth long enough for the King to seize the Jedi Master and flee with him deep into the tunnels. Jeth's Padawan, Ulic Qel-Droma, was unable to save his master from abduction, as he had entered a duel with Warb Null. The duel ended quickly however, with Null dead."}, {"tag": "p", "text": "Meanwhile, on Koros Major, Satal and Aleema Keto, cousins and royal heirs of the Tetan Monarchy, had formed the Krath secret society with their friends. The group researched the Sith and their ancient Empire which instigated the Great Hyperspace war centuries before, and became so consumed with the history that the two decided to take a trip to Coruscant, where the Galactic Museum had prepared an exhibit featuring artifacts from the Sith Empire. At the behest of Aleema, Satal stole a Sith spellbook from the exhibit, The Dark Lords of the Sith, however neither of the two could read the contents, as it was written in ancient Sith glyphs. As the fighting continued on Onderon for days, word of the conflict spread across the galaxy via the HoloNet. A report of the Sith-worshipping dark side army was read on a newscast, which caught the attention of the cousins. The two resolved to travel to Onderon in search of an individual who could translate the text for them."}, {"tag": "p", "text": "Although the battle on Onderon was progressing well for the Naddists, the Jedi soon received reinforcements in the form of a Republic battle group and five additional Jedi from Ossus. One of these Jedi, Nomi Sunrider, was able to turn the tide with her battle meditation ability. The fighting, which had been confined to the jungle stronghold of the Beast Riders for two days, now returned to Iziz. As the streets once again became embroiled in war, the Keto cousins dropped out of hyperspace, right in the middle of the war zone. Ignoring warnings from the Republic fleet in orbit, the two descended towards the city and were shot down by crossfire. Aleema and Satal survived the crash and were able to contact King Ommin. He gifted the aspiring darksiders with a Sith amulet which granted them the power to read the Sith spellbook. In return, he asked for the opportunity to transcribe the spellbook for his own collection. As the trio completed their deal, Ommin introduced the Ketos to his latest addition to his collection: Arca Jeth. Ommin planned to torture the Jedi Master enough that he would be unable to resist the temptation of the dark side. However, it was at this moment that the Jedi task force in the city was able to penetrate Ommin's stronghold and ambush his defenders. As Satal and Aleema panicked and fled deeper into the tunnels beneath Iziz, the King fought the Jedi, but to no avail. Ulic Qel-Droma was able to slice through Ommin's exoskeleton, incapacitating him. The King begged for the assistance of Freedon Nadd, however the Dark Lord had decided that the Keto's showed more promise than Ommin. Nadd's spirit guided the two Krath founders to safety and returned to tell Ommin that he had forsaken him, and the Jedi that their victory would be short-lived. Before departing Iziz, Nadd prophesized on the fate of Ulic Qel-Droma, claiming he was destined to become one of the great Sith Lords."}, {"tag": "p", "text": "With Ommin's death, and the end of the Freedon Nadd Uprising, Onderon was finally free of Nadd's dark shadow. The bodies of King Ommin, Queen Amanoa, and Freedon Nadd were all moved to Dxun, into a tomb of Mandalorian iron, not to be disturbed again. Aleema and Satal, armed with new knowledge and artifacts from Iziz, returned to Empress Teta to plan their ascension."}, {"tag": "h3", "text": "The Great Sith War"}, {"tag": "p", "text": "With the Naddist Revolt crushed, Freedon Nadd's dream of a second Sith Golden Age was halted once again. However, a new opportunity would present itself in the form of the rising Krath cult in the Empress Teta system and the young Jedi Exar Kun."}, {"tag": "p", "text": "Exar Kun was the pupil of Krevaaki Jedi Master Vodo-Siosk Baas along with the Cathar Jedi Crado and Sylvar. Kun was extremely talented in the Force and, much like Freedon Nadd centuries earlier, developed an arrogance that led him to believe he was worthy of receiving special teachings. Becoming engrossed with the idea that he could research Sith teachings and powers, yet remain uncorrupted by the dark side, Kun began to delve into forbidden Sith holocrons on the Jedi world of Dantooine. During a lightsaber training session with his master and fellow students, Kun defeated Crado easily. Following Crado's defeat, Master Baas instructed Sylvar to enter a duel with Kun. Exar taunted Sylvar with claims that nonhumans were inept and unworthy, angering her, and in retribution, she struck the human with her claws, scarring and infuriating him. Kun attacked her viciously and nearly killed her when Vodo-Siosk Baas stepped in and stopped Kun's saber with his walking staff. In an attempt to teach Exar Kun a lesson in strength, Baas challenged his wayward apprentice to a duel and gained the upper hand quickly, despite the immense odds of walking stick versus lightsaber. Kun was able to defeat his master with aid from Crado, who threw Exar his lightsaber during the duel. Victorious, Kun declared himself a Jedi Knight and departed Dantooine to search for the secrets of the Sith."}, {"tag": "p", "text": "Kun followed his curiosity to Onderon, where the fighting had just ended. He learned here that the Sith Lord Freedon Nadd had recently been interred on Dxun, and traveled to the moon in search of answers. Kun broke into the sealed tomb and encountered the spirit of Nadd, who encouraged the young man to continue his search on the ancient Sith burial world of Korriban. As Kun left Dxun for old Sith space, Aleema and Satal Keto, who had also recently paid Onderon a visit, were setting their plan for domination in motion on Koros Major."}, {"tag": "p", "text": "The two Krath founders, after having used the late King Ommin's artifacts and the spirit of Freedon Nadd to become adept in Sith sorcery, traveled to the Tetan carbonite smelter above Koros where Lord Keto and Lady Magda Keto, rulers of the Empress Teta system and parents of Satal and Aleema, were being given a tour. The two were escorted by the royal tutor Korus, whose tongue was transformed into an Adegan eel by the children. This bewildered Lord Keto, who attempted to call for help, but his guard's swords were transformed into snakes that began to attack their wielders. Helpless, Lord and Lady Keto accepted defeat at the hands of their children and continued their tour, now guiding the new Emperor Satal and Empress Aleema of the Teta system. The group entered a smelting chamber, and the new rulers of Teta had the former rulers tied above vats of molten carbonite and lowered into them. With Lord and Lady Keto dead and the Tetan government under their control, Satal and Aleema took up residence in the Iron Citadel in Cinnagar. The worlds of Empress Teta quickly fell in line behind the Krath, all except for Koros Major itself. Initiating the Krath Holy Crusade, the Ketos launched an assault against their own capital world, hoping to bring it in line."}, {"tag": "h4", "text": "The Krath Holy Crusade"}, {"tag": "p", "text": "As the Ketos prepared to crush the resistance on Koros Major, word of the struggle and Krath usurpation reached the Republic capital of Coruscant. Jedi Master Arca Jeth petitioned the Republic leadership to send aid to the resistance fighters and help defeat the Krath, as the dark side cult reminded the Jedi too much of the Naddists recently defeated on Onderon. The Republic complied, and a battle group to relieve the resistance fighters was organized, lead by Jedi Knights Nomi Sunrider and Ulic Qel-Droma. However, when the Republic fleet arrived at Koros Major, the battle was already in progress, with Krath warships attacking the planet. As Qel-Droma ordered his ships into battle positions, Aleema and Satal began their counter-attack. Aleema utilized Sith magic to conjure illusions of space grazers which headed directly at the Republic fleet, causing the officers to panic and their ships to scatter. Nomi Sunrider was able to see through the illusion and refocus the fleet, however the Krath decided that the battle would require both the Force and physical military might, and so ordered wings of Chaos fighters to initiate suicide runs on the Republic vessels. As the fighters closed the distance between the fleets, Aleema conjured an illusion of additional wings of Chaos fighters to confuse and overwhelm the Republic ships. Sunrider again saw through the illusion and was able to block Aleema's ghost ships from interfering in the battle, but there were still many real fighters that collided with Republic vessels. The Republic fleet was crippled and forced to retreat with a severely injured Qel-Droma, while the Krath were left to complete their conquest of Koros. The Battle of Empress Teta was a complete success for the Krath, and marked the beginning of the wider Great Sith War."}, {"tag": "p", "text": "Because of the massive losses over Koros Major, the Jedi leadership decided it was time for an assembly to be called in order to discuss the Krath threat and other gathering shadows. Krath intelligence agents discovered that the grand convocation was to be held on Deneba, and Satal planned for a direct assault against the Jedi there. As thousands of Jedi vessels descended upon Deneba, Satal was able to sneak a Krath warship among them, hiding in orbit. Meanwhile, light-years away on Korriban, Exar Kun was exploring the planet once inhabited by the Dark Lords of the Sith. Guided by Freedon Nadd's spirit, Kun became trapped and injured beneath rubble during a cave-in within an ancient tomb. The cave-in was designed by Nadd as a test for Kun, who would need to touch the dark side in order to survive. Initially fearful, Kun reached out through the Force for his former Master Baas on Deneba, who attempted to help his pupil. Freedon Nadd refused to allow this to happen however, and blocked Vodo's attempts at aiding Kun. Near death and running out of options, Kun embraced the dark side and freed himself. Kun's anger and malice healed his broken body and sent ripples through the Force that greatly disturbed the Jedi assembly, however Baas accepted that he could no longer help the young man. Kun, still under the belief he could use both the dark and light side without consequence, left Korriban on a course for Yavin 4, where Nadd claimed his training would be completed."}, {"tag": "p", "text": "On Deneba the Jedi debated over how to best combat the dark side and it's followers, and after hearing proposals and arguments from Ulic Qel-Droma and others, the convocation took a short recess. Just before the conclave could resume, Satal set his plan in motion. The Krath warship in orbit above the planet launched a large number of escape pods, each filled with Krath war droids. Catching the Jedi unaware, the droids were able to kill many of them in the initial stages of the attack. In conjunction with the war droid assault, the service droids who had been serving the Jedi during the convocation also attacked their masters, having been sabotaged by Krath spies prior to the arrival of the Jedi. Although all the droids were destroyed at the Battle of Deneba, many Jedi were killed, including Arca Jeth. The death of his master caused Ulic Qel-Droma to plan a mission to destroy the Krath from within, a strategy frowned upon by many other Jedi, including his late master."}, {"tag": "p", "text": "Ulic traveled to the Empress Teta system and cut off contact with the rest of the Order. He was quickly able to convince Aleema that he had fallen from the Jedi way and become sympathetic to the Krath, however Satal was not so trusting. He had the young Jedi imprisoned and tortured which caused Ulic to begin a journey towards the dark side. Satal eventually came to trust Ulic, and Qel-Droma was instated as a warlord of the Krath. Fearing the worst after months with no contact, Ulic's lover Nomi Sunrider planned a mission to rescue Ulic from Cinnagar. Whe she arrived however, she found that Ulic still wished to maintain his cover and did nothing as Nomi was sentenced to death. He attempted to explain himself to her via a secret message that was intercepted by Satal. Not knowing Ulic's plan, Nomi escaped her prison but before she could depart, she was confronted by Satal, who was then confronted by Ulic Qel-Droma. Ulic had recently learned from Aleema that it was Satal who ordered the attack on Deneba, and in search of revenge for the late Arca Jeth, Ulic attacked Satal. During the ensuing struggle, Ulic killed Satal in a fit of anger and succumbed to the dark side, Keto's intent from the start. Although Nomi and other Jedi attempted to help him, he attacked them as well and drove them off while he stayed on Koros Major. Ulic soon took Satal's place at Aleema's side was awarded with a rare Sith amulet while Nomi began to plan yet another mission to rescue Ulic."}, {"tag": "p", "text": "Across the galaxy, Exar Kun was also continuing his descent into darkness. Much like Ulic, who believed he could conquer the dark side from within yet still remain true to the light, Exar believed he could use the power of the dark yet remain uncorrupted by it. Freedon Nadd, whose spirit still guided Kun, was intent on proving him wrong. As Kun arrived on Yavin 4, he was confronted by the primitive and savage Massassi people who easily captured the Dark Jedi, as Exar was still unwilling to fully give into the power of the dark side. On the verge of death, Kun was again visited by Freedon Nadd. Nadd once again told him that the only way to survive was to embrace the dark side and Exar complied, seizing a Sith amulet from a Massassi priest and using its power to free himself and kill his captors. Exar had fully accepted the Sith ways, much to Freedon Nadd's delight, who immediately demanded that Kun get to work on the creation of a new body for the long-dead Dark Lord to inhabit, a task both Ommin and Amanoa had failed on Onderon. Exar had grown annoyed with Nadd however, and used his newfound power to destroy his spirit once and for all. In his last moments, Nadd visited Ulic Qel-Droma and Aleema Keto in Cinnagar and warned them of Kun's rising power. Freedon Nadd, plague of the Jedi and father to the Naddists and Krath, was gone. Exar Kun, free from Nadd's command, went about enslaving the remaining Massassi on Yavin 4 and searching for threats to his power. He identified two darksiders on Koros Major, Ulic and Aleema, and set out to kill them."}, {"tag": "p", "text": "Kun arrived in Cinnagar directly after a Jedi assault lead by Nomi Sunrider was beaten back by Qel-Droma. Exar confronted Ulic and Aleema and quickly incapacitated the Tetan Empress. Qel-Droma was much more of a challenge however, and the two dark Jedi dueled fiercely. The duel was short-lived though, as Exar and Ulic's Sith amulets began to glow with dark energy, enticing the spirit of Marka Ragnos to appear as it had during the duel between Naga Sadow and Ludo Kressh. This time however, the combatants yielded to the spirit and stopped their duel to heed Ragnos's words. The ancient Sith Lord proclaimed that Exar Kun was to be the new Dark Lord of the Sith, while Ulic Qel-Doma was to become his apprentice. The two were branded with Sith tattoos on their foreheads to signify their new allegiance. With the inception of the new Sith Lords, the order was once again revived, the first time since the death of Freedon Nadd centuries before."}, {"tag": "h4", "text": "The Brotherhood of the Sith"}, {"tag": "p", "text": "Allied with Aleeema's Krath armies, the two Sith Lords set out to plan the final destruction of the Jedi and the Republic. Using the Dark Reaper,they inflicted near-genocidal casualties on worlds such as Raxus Prime. Exar used Sith alchemy to create Terentateks, large creatures with a thirst for Jedi blood. Ulic was also able to make an alliance with Mandalore the Indomitable on Kuar, and with the new addition of Mandalorian soldiers to their forces, the Sith overwhelmed the Republic defenders at Foerost. While the Krath and Mandalorian armies under Ulic's command terrorized the galaxy, Exar went about building a following of darksiders for the Sith Lords to command. He traveled to Ossus, where he gave an impassioned speech to the Jedi students there, claiming their masters were withholding knowledge and power from them. Many students, including Crado, left Ossus for Yavin 4, where they would become the apprentices of Kun, however before Kun himself left, he planned on retrieving the Sith holocron possessed by Odan-Urr, the ancient Jedi hero of the Great Hyperspace War. Kun confronted Odan-Urr and killed him, taking the holocron for himself and claiming the ancient Master declared Exar a Jedi Master directly before his death."}, {"tag": "p", "text": "On Yavin 4, his students expressed doubt about the path they had started on after sensing the dark taint of the moon. In response, Kun destroyed Odan-Urr's Sith holocron, releasing the spirits trapped inside which then possessed the doubtful Jedi. Reassured by the dark spirits now controlling their actions, the Jedi students trained with Kun in the dark arts and were eventually convinced by him that the last thing standing in the way of another Sith Golden Age was their former Jedi Masters. The students left Yavin to hunt down and kill their masters in an incredibly successful strike known as the Jedi pogrom. Meanwhile, Ulic had grown ambitious and arrogant with his new Mandalorian army and decided to strike the heart of the Republic, Coruscant. Although the plan was frowned upon by Kun, Ulic went ahead with the attack and lead Mandalore and Aleema into battle alongside their armies. Aleema, tired of sharing power over the Krath with Ulic, ordered a retreat while Qel-Droma was attacking the Republic war room alone. Abandoned, Ulic was eventually defeated by the Jedi on Coruscant and put on trial."}, {"tag": "p", "text": "Ulic's trial was presided over by the Republic Inquisition and he was found guilty on all charges. As he was sentenced to death, Exar Kun strode into the Senate Hall where the trial was being held. Immobilizing the senators and executing the Supreme Chancellor, Kun freed his apprentice only to be confronted by his former master, Vodo-Siosk Baas. Kun used his new weapon, a double-bladed lightsaber to overpower and murder Baas, who claimed he would one day return to defeat his apprentice. Kun and Qel-Droma departed Coruscant to continue their war after again proclaiming the dominance of the Sith. Upon Ulic's return to command, Mandalore informed him of Aleema's treachery at the Battle of Coruscant and the Sith apprentice began planning for revenge."}, {"tag": "p", "text": "The next stage of the war centered around the attack on Kemplex IX. Ulic hoped to use the battle as a trap for Aleema, while Exar planned to trick the Krath Sorceress into destroying the Cron Cluster, a group of ten closely packed stars, which would result in the destruction of a different target. Exar armed Aleema with the Corsair, the ancient flagship of Naga Sadow discovered on Yavin 4. Kun taught her how to use it's Sith magic to rip the cores from stars, but neglected to tell her that it would cause a supernova the ship could not protect her from. Aleema and Crado were to take the ship and lead the assault on Kemplex IX, however Aleema was overly eager to use her new weapon. After destroying the Republic jump-station that was their target, Aleema lured a Jedi fleet into the nearby Cron Cluster, just as Exar Kun had predicted. Aleema ripped the core out of one of the stars, incinerating the Jedi fleet, however she was unable to control the explosion. A chain reaction began, with all ten stars going nova and destroying the Corsair along with Aleema and Crado. Also according to Exar Kun's plan, the supernova headed directly at Ossus, the primary target of the Sith."}, {"tag": "p", "text": "While the Jedi attempted to evacuate Ossus with as many relics and artifacts as they could, Exar Kun and Ulic lead an attack against the planet. Kun's Massassi warriors looted what remained of the Jedi library while the Dark Lord himself attempted to steal a cache of ancient lightsabers from the Neti Jedi Master Ood Bnar. Kun failed as Bnar transformed into a giant tree and hid the lightsabers beneath his body, not to be disturbed again until millennia later. Ulic flew above the fray during the battle, only to be confronted by his brother, Cay Qel-Droma, who had sensed his presence. Ulic and Cay landed and began a duel which ended with Ulic killing the brother he had once fought alongside as a Jedi. Witnessing the murder, Nomi Sunrider trapped Ulic in a \"wall of light\" and cut him off from the Force out of disgust for what he had become. Ulic only now realized what he had done and renounced his Sith ties, agreeing to help the Jedi defeat the Dark Lord Exar Kun. After both the Jedi and Sith retreated from the planet, Ossus was hit by the Cron Supernova, destroying all life on the planet, save for Master Bnar."}, {"tag": "p", "text": "On other battlefields across the galaxy, the war still raged. Following the Jedi victory at the Battle of Toprawa, the failed Jedi apprentice Haazen was nearly killed by explosions in caverns that claimed the life of many of his fellow Jedi, including Barrison Draay. Haazen was revived by the Sith and turned to the dark side, only to hide his allegiances following the end of the war. On Onderon, the remaining Mandalorian warriors were beaten back and retreated to Dxun, where Mandalore the Indomitable was killed by wild animals. With Ulic's help, the Jedi also prepared for a massive assault on Kun's fortress on Yavin 4. The war was drawing to a close, and Exar Kun was the last leader of the Sith still standing.\nAbove Yavin, thousands of Jedi ships descended towards Kun's fortress. Realizing the war was lost, Kun assembled his Massassi warriors at the temples left behind by Naga Sadow. Exar Kun called upon Sith magic and drained his Massassi slaves of their life force, killing them. The energy he gained from them allowed the Dark Lord to break free of his mortal body and maintain his spirit, which hoped to leave Yavin to continue the war elsewhere in the galaxy. Sensing this, Nomi and rest of the assembled Jedi created a wall of light around Yavin 4, hoping it would have the same effect as it did against Ulic on Ossus. The massive surge of light side energy managed to keep Exar Kun's spirit trapped on the planet, tied to one of his temples, however the collision of light energy from the Jedi and dark from Kun's Sith magic caused a massive firestorm to erupt and rage across the moon, killing all life on its surface. The Jedi retreated, their mission accomplished. The Great Sith War was over, and the Sith Order was defeated."}, {"tag": "p", "text": "Following the conclusion of the Great Sith War, the remains of the Brotherhood of the Sith were disbanded. The Empress Teta system was finally liberated from the remnants of the Krath at the recapture of the Empress Teta system and the Jedi and Republic began the long process of rebuilding a broken galaxy. During this period, the Jedi initiated the Great Hunt, which was an effort to kill Exar Kun's remaining Tarentateks that terrorized the Order during the war. The program was mostly successful, however several beasts survived on both Korriban and Kashyyyk. The Jedi also attempted to destroy the Sith-inspired Mecrosa Order, however their attempts were unsuccessful. The few surviving members of the Brotherhood were still scattered throughout the galaxy. Toki Tollivar became a serial killer on Corellia, Haazen infiltrated the Jedi Covenant, an organization designed to ensure the extinction of the Sith, and Ulic Qel-Droma was killed shortly after his redemption on Rhen Var. The Old Sith Empire continued to survive in obscurity in the unknown regions, still lead by the same Sith Lord who had escaped the Empire's destruction centuries before during the Great Hyperspace War."}, {"tag": "h3", "text": "Surviving influences"}, {"tag": "p", "text": "The remnants of the ancient Sith Empire saw an opportunity for revenge in the form of the Mandalorians. After Mandalore the Indomitable's death on Dxun during the war, Mandalore the Ultimate rose to take his place as leader of the Mandalorian clans. This new Mandalore reformed his warriors into the Neo-Crusaders and made a base on the moon of Dxun. According to Canderous Ordo, Mandalore was approached by the Sith and goaded into attacking the Republic, as it was weak and still rebuilding in the aftermath of the Great Sith War. Mandalore accepted and readied his armies for war, and in 3976 BBY, twenty years after the conclusion of the Great Sith War, the Mandalorians began a brutal campaign for dominance over the Outer Rim and areas of Unknown Regions. The Neo-Crusaders were able to carve out an area of space for themselves that exceeded that of the Hutt Empire, however the Republic refused to respond to the threat until the Mandalorians neared the business world of Taris, at which point the Galactic Senate pledged it's support to the defense of Taris- a defense lead by Admiral Saul Karath. A military-security cordon was established and the battle entered into an uneasy period of tension. While the Republic leapt headlong into the conflict, the Jedi remained cautious. The High Council decided it would not aid the Republic, turning the sentiment of much of the Republic Army against them."}, {"tag": "p", "text": "During this period, the Jedi Covenant's First WatchCircle, a group of Jedi Consulars based on Taris, received a Force vision depicting the return of the Sith. The Jedi Covenant's purpose was to prevent this specific event from happening, thereby avoiding yet another Great Sith War. In response, these Jedi Consulars massacred their students, who they believed to be the source of the future Sith menace. Zayne Carrick, Padawan to Lucien Draay, was the only one of the five students to survive. The First WatchCircle and the Jedi Covenant framed Carrick for the massacre, claiming he had turned to the dark side. In reality, all of these events were being engineered by Haazen, the Sith acolyte still in hiding within the Jedi Covenant since the conclusion of the war. Haazen had been Draay's Jedi Master, and since his grievous injuries and turn to the dark side during the war, he had been plotting to destroy the Jedi Order from within by wresting control of the Covenant away from Lucien's mother, Krynda Draay."}, {"tag": "p", "text": "As the Jedi hunted for Carrick, he and Covenant Shadow Celeste Morne encountered the Muur Talisman on Taris. The ancient relic of the original Sith Empire had somehow made its way to the city-planet, where the Rakghoul Plague that had been created by Karness Muur several millennia before ran rampant. Shortly after the two Jedi discovered it, the Talisman was taken to Jebble by invading Mandalorian forces. There, it transformed an entire Mandalorian army into Rakghouls that threatened to leave the planet and spread the disease throughout the galaxy. Morne and Carrick also discovered that the Talisman still contained the spirit of Karness Muur himself, who hoped to possess a Force-sensitive body and create a new Sith era enforced by his Rakghouls. Celeste Morne, who had dedicated her life to the prevention of the return of the Sith, allowed the Talisman to attach itself to her. She was able to control Muur to some degree, however she was corrupted as well, and was in danger of slipping to the dark side. Carrick and Morne discovered another Sith artifact on Jebble that had been acquired by the Mandalorians—Dreypa's Oubliette. The oubliette was designed to contain both Muur and the plague, but Morne would have to be interred within it as well. Carrick planned to leave and return with help for her, but, shortly after his departure, the Mandalorian fleet arrived and bombarded the planet with nuclear warheads, killing the Rakghouls and flooding the once-frozen world. Carrick believed Morne to be dead; however, she was safely in stasis within the intact oubliette, and would remain there for almost four millennia."}, {"tag": "p", "text": "Zayne Carrick traveled to Coruscant shortly after, hoping to force a member of the First WatchCircle to confess to their crime and clear Zayne's name. Master Xamar gave in and confessed to the Jedi Council, which then ordered an assault on the Draay Estate, headquarters of the Covenant. Having already poisoned Krynda, Haazen set his plan into motion, initiating \"Vindication\", a contingency plan that was to be put into effect should the Jedi Council come under the influence of the Sith. \"Vindication\" placed the orbiting Republic fleet in Haazen's control, allowing him to kill many of the attacking Jedi with orbital bombardment. Carrick and Lucien Draay were the only two Jedi not forced to retreat, and although Haazen nearly pulled Draay to the dark side, the Jedi refused to join the Sith and instead killed Haazen by redirecting the Republic ships to fire directly at the Draay Estate. Both Carrick and Draay survived; however, neither returned to the Jedi Order, deciding to take different paths. Carrick and his friends later killed Toki Tollivar, another Sith Acolyte who had been in hiding since the conclusion of the war."}, {"tag": "h4", "text": "The making of Revan"}, {"tag": "p", "text": "As tension in the Outer Rim escalated, several members of the Jedi Order began to voice their opposition to the Council's decision to remain uninvolved. Foremost among these dissidents was the Jedi Knight Revan. He, along with his close friend Alek Squinquargesimus, began to advocate for the Jedi to enter the war alongside the Republic. Although many Jedi remained loyal to the Council's decision, many younger Jedi joined Revan and Alek and began to scout the front lines. Revan's followers soon adopted the name \"Revanchists\". As these renegades probed the borders between Mandalorian and Republic space, Taris descended into chaos following the \"Padawan Massacre\" and the departure of the Jedi Masters stationed there. Seeing his opportunity to seize the planet, Mandalore the Ultimate initiated the true Mandalorian War, unleashing his armada into Republic space and overwhelming the under-prepared security forces. The Republic suffered grievous losses in battles at Onderon, Vanquo, several Outer Rim Colonies, Taris, and Serroco."}, {"tag": "p", "text": "Seeing the carnage, Revan released records of the Genocide of Cathar, a Mandalorian operation that had occurred in the early stages of the war after the Council's refusal to take part in the conflict, to garner support for his cause. The reports shocked both the Republic and the Jedi, leading to more greater for both Revan and Alek, who had adopted the alias Malak since the events surrounding \"Vindication\". The two led the Revanchists (also known as the Jedi Crusaders) to join the Republic military and fight in battles across the galaxy. Revan and Malak, alongside Meetra Surik, proved to be capable military commanders and quickly rose through the ranks, eventually gaining control over a full third of the Republic Navy. The soldiers under their command became incredibly loyal to the Jedi and increasingly averse to the Council and Knights who chose to remain out of the war. As Revan and Malak continued their crusade, the tide began to turn in their favor. The Mandalorian armies were beaten back on Taris and crushed at Dxun. Revan and Malak's tactics became increasingly as the war raged on. They sacrificed countless Republic soldiers on Dxun simply to drive the Mandalorians off the moon and decimated Mandalorian ground forces on Althir. Soon the Mandalorians had retreated to their pre-war Empire in the unknown regions, pursued by Revan's forces. Revan was a hero to the Republic and the Jedi and appeared to have been vindicated in his defiance of the Council."}, {"tag": "p", "text": "However, appearances were deceiving. Early in the war, during Revan's original scouting of the area surrounding Mandalorian Space, he came upon Malachor V, a world considered forbidden by Mandalorians. By this time the hidden Empire had forgotten the world. The Jedi traveled to the planet's surface and was immediately overwhelmed by dark side energies. Malachor had once belonged to the ancient Sith Empire, and was saturated with the dark side. In an effort to save himself from being consumed by the dark side, Revan fed off of it instead. He had also stumbled upon the Trayus Academy, an ancient repository of Sith teachings built around a dark side geyser. It was there that he learned the location of Korriban and the existence of a hidden Sith Empire, the faction of the original Empire that had survived the Great Hyperspace War and been in hiding beyond the Unknown Regions for thousands of years. Revan, believing these Sith to be a greater evil than the Mandalorians, accepted the Sith way and the power it offered, hoping that he could defend the galaxy from this newly discovered threat. He also believed that these Sith had somehow influenced the Mandalorians into attacking the Republic. Revan introduced Malak to the teachings of the Sith, and together the two adopted the title of Sith Lords, with Revan as the Dark Lord and Malak as the Apprentice. They remade themselves into Darth Revan and Darth Malak, marking the first recorded use of the honorific Darth title. During the war, Revan also discovered a Star Map on Kashyyyk- an ancient relic of the Infinite Empire which had attempted to conquer the original Sith people far before the creation of the Sith religious order. The Star Map hinted at the existence of an ancient superweapon that Revan would focus on finding after the war. The new Sith made preparations for the final battle of the Mandalorian Wars and their forces in the aftermath of the conflict. Sith teachings began to spread through the Republic fleet, going largely unquestioned, as Revan and Malak were still the heroes of the Republic."}, {"tag": "p", "text": "The new Dark Lord decided that Malachor V would be the final battleground, positioning a fleet of Republic ships in orbit consisting of crewmen and soldiers who were not fanatically loyal to him. The Mandalorians temptation for battle eclipsed their desire to avoid Malachor, and so began a final, massive assault on the Republic fleet which was being lead by Surik. Prior to the battle, Revan had entrusted her with the Mass Shadow Generator, a new superweapon designed by the Zabrak engineer Bao-Dur. As the battle began, the Republic forces were overwhelmed and suffered crippling losses, but Revan soon arrived with reinforcements and the power of Sith teachings. He drew upon the dark energy of the planet below, invigorating his forces and drawing many of them to the dark side. Revan himself killed Mandalore the Ultimate, and the remaining Mandalorian forces were pushed towards Malachor. At this point the Jedi Crusader leading the fleet ordered the activation of the Mass Shadow Generator and watched in horror as thousands of ships from both the Mandalorian and Republic fleets were crushed in an artificial gravity well. The wreckage slammed into the planet and ruptured its crust, leaving nothing but a broken core. The countless deaths could be felt through the Force, causing the Jedi Crusader to cut herself off from the Force to avoid death. The battle ended with almost all of the Mandalorians killed, and the remaining declaring their unconditional surrender to Revan, who disbanded the warriors and sentenced them to perpetual exile. The surviving Jedi were either turned to the dark side or killed by Revan and Malak; however, the Dark Lord allowed the now-Force-dead Surik to escape and return to the Jedi Council on Coruscant, where she would be sentenced to exile for her actions during the war. Revan had single-handedly defeated the Mandalorian menace and could have returned to Coruscant as a hero, despite the tragedy over Malachor V."}, {"tag": "p", "text": "However, to everybody's surprise, he and Malak, along with a full third of the Republic fleet, disappeared into the Unknown Regions shortly after the Battle of Malachor. The official reason was that they were hunting down the last of the Mandalorians, but the Sith Lords and their fleet were actually searching the galaxy for the Star Forge, the ancient weapon which Revan had learned about from the Star Map. Several years passed with the Republic receiving no word from the missing fleet, and it was assumed that the heroes of the Mandalorian Wars were dead."}, {"tag": "h3", "text": "The Jedi Civil War and the redemption of Darth Revan"}, {"tag": "p", "text": "However, Revan and Malak were very much alive. During their time in the Unknown Regions, they encountered a Sith Empire established by the Sith Emperor. The Dark Lord converted them to his cause and recruited them. These two Sith Lords were dispatched back into Republic space to locate the Star Forge to allow the Empire to drastically boost its military production. Unfortunately for the Emperor, Darths Revan and Malak became overly ambitious without his direct supervision and claimed the Star Forge for themselves. Revan began a campaign to end the \"tyranny\" of the Jedi Council once and for all. Together with Malak, Revan went to Korriban and seized control of the planet, secretly establishing a new Sith academy not far from the settlement Dreshdae."}, {"tag": "p", "text": "About a year after Revan's return to known space, the first battle of the new conflict, the Jedi Civil War, began. In a surprise attack, Revan's fleet swept into the unprepared Foerost system, quickly overcoming their defenses. It was after this battle that Revan and Malak officially announced to the galaxy that they now were now Sith Lords, Darth Revan and Darth Malak, and captured the majority of the Republic Fleet based in the drydocks around Foerost, dealing a crippling blow to the Republic. The second planet to be attacked by the Sith was Telos IV, a strategically-important planet on the edge of Republic-controlled space whose military and economic power bases were considered vital to the Republic. Although Darth Revan had intended for Telos to be conquered, Darth Malak ordered the former Republic admiral Saul Karath to prove his loyalty to the Sith by destroying Telos - Karath complied."}, {"tag": "p", "text": "While a destructive war, Revan sought to do as little damage to the Republic's infrastructure as possible. Under his leadership, Sith forces bypassed militarily vital planets that would be required for the defense of the galaxy against the threat of the hidden Sith Empire. Revan never intended to 'destroy' the Republic, but to unite it under his banner, so it was vital for him to keep the Republic largely intact for the purposes of post-war rebuilding. Revan, seeing the need for corporate assistance in providing necessary materiél for the war effort, entered a partnership with the Czerka Corporation, a galaxy-spanning conglomerate with such diverse interests as mining, slaving, and manufacturing items such as arms, armor, and droids. Offered a trade monopoly within Sith space, the corporation helped to sponsor the establishment and growth of the Dreshdae colony on Korriban as part of their supply network. The corporation continued to provide logistical support for the Sith Empire throughout the course of the war. They also secured diplomatic relations with the ocean planet of Manaan so that they would able to export the healing substance known as kolto. Revan even took out a number of political figureheads who stood in his way. Amongst them was: Yusanis of the Echani, Senator Mimas Yoon of Corellia, and Lelin-Dor of Serroco. By doing so Revan would be able to begin his rule with a functioning army and a stable economy without his rule being questioned. He believed that even if he were to fail in his conquest of the Republic, the result would be the same; a stronger Republic more capable of defending itself against the hidden Sith Empire."}, {"tag": "p", "text": "Unlike most, Revan understood that his war was never truly against the Republic, but against the Jedi. Revan believed that whoever had the most and the strongest Jedi would win the war. He would either convert or kill captured Jedi, relying on secrecy instead of brute force. His Sith assassins quietly flooded into the Republic to achieve this goal Jedi throughout known space. Revan reestablished old strongholds and academies upon worlds of ancient power such as Lehon, Dxun, and Korriban. There his most faithful servants broke captured Jedi and converted them to the dark side. If any Force-sensitive was found within his ranks he captured them as well and made them into Dark Jedi."}, {"tag": "p", "text": "Darth Revan's tactical brilliance caught the Republic completely off-guard and the Sith won battle after battle until a young Jedi Knight named Bastila Shan entered the fray. Bastila could use battle meditation, a powerful Force-power that increased the combat effectiveness of the Republic's forces and sapped the will of enemy combatants. The Republic knew, however, that even with Bastila's powerful battle meditation, they wouldn't be able to stand against the Sith for long, so the Jedi Council drafted a plan to capture Darth Revan, thus depriving the Sith of their greatest leader and tactician. While Darth Revan's fleet was distracted by a small force of Republic warships, a Jedi strike-team consisting of Bastila Shan and a number of Jedi Knights boarded Revan's flagship, overcoming his guards and cornering the Dark Lord on the bridge. Darth Malak, determined to become the Sith Master, ordered the ships under his command to fire upon the bridge of his mentor's flagship, intending to kill both the Jedi boarding party and his master in order to claim the mantle of Dark Lord of the Sith for himself."}, {"tag": "p", "text": "Unknown to the newly crowned Dark Lord Darth Malak, his old mentor was still very much alive. As the only other survivor of the attack, Bastila Shan used the Force to preserve the flicker of life that remained within the unconscious Dark Lord. This act created a Force bond between the two, an event that would have lasting repercussions in the future. Shan then brought Darth Revan to the Jedi Council on Dantooine, where they used the Force to temporarily wipe his memory. Revan was then reprogrammed with a new identity, one loyal to the Republic, while Bastila Shan was charged with keeping Darth Revan's identity hidden and drawing out the former Dark Lord's memories."}, {"tag": "h3", "text": "Reign of Darth Malak and Revan's reemergence"}, {"tag": "p", "text": "Although Darth Malak lacked the tactical superiority of his former master, relying instead on brute force, the sheer size of his armadas allowed him to win many victories over the battered and outnumbered Republic forces. Unlike Darth Revan, Darth Malak would destroy worlds rather than capture them, taking away vital resources from both sides. Throughout the conflict Darth Malak became much more reliant upon the Star Forge than Revan had been. He took a former Jedi whose quest for power had set him apart from his fellow students and named him Darth Bandon, making him his Shadow Hand and the second-in-command in the Sith Empire. As his forces tore through Republic space, Darth Malak felt that the only thing that could stop him from taking over the galaxy was Shan's powerful battle meditation. Therefore, he expended tremendous resources to locate and capture Shan, hoping to turn her to his cause or kill her if this proved impossible."}, {"tag": "p", "text": "As the war raged on, Revan, under an implanted name and with no recollection of his real history or of his former mastery of the Force, was enlisted as a common soldier in the Republic army and placed on the Republic warship Endar Spire. Darth Malak's hunt for Shan led him to this ship, where he sent Darth Bandon, along with a Sith armada, to ambush the ship. There, while boarding the vessel, Darth Bandon encountered Revan, but before he had the chance to kill the amnesiac Dark Lord, a Republic ensign sacrificed himself so that Revan could escape the ship. Shan successfully fled the ship aboard one of the escape pods and crash-landed on Taris, as did Revan and the Republic commander Carth Onasi. Malak ordered a blockade of the planet so that the Sith could search for Shan."}, {"tag": "p", "text": "After crash-landing on the surface of Taris, Revan began experiencing flashbacks through the Force of his buried past. On Taris, Revan and Onasi had to rescue Bastila Shan from the Black Vulkars swoop gang with the assistance of the young Twi'lek Mission Vao, her Wookiee partner Zaalbar, and the Mandalorian war veteran Canderous Ordo. With the help of his new droid companion, T3-M4, Revan was able to steal the bypass codes to the Sith blockade from the Sith base and could escape the planet. However, once Revan and his newly formed team (which included Bastila) left the surface, Darth Malak ordered an orbital bombardment of the planet, hoping to eliminate Bastila together with the billions of Tarisians living on its surface."}, {"tag": "p", "text": "Deciding to regroup, Revan and his companions fled to the Jedi Enclave on Dantooine. There, Revan was trained again in the ways of the Force by a reluctant Jedi Council. During his training he performed various important tasks in the area around the Enclave. Among these tasks was to cleanse a meditation grove of a dark taint. The taint soon turned out to be a Cathar Dark Jedi named Juhani, who he redeemed and convinced to return to return to the Jedi. Soon afterwards, Shan and Revan shared a dream of Revan and Malak exploring the nearby ruins and discovering a Star Map, a Rakatan artifact that, when combined with the other four Star Maps, Revan had used to find the location of the Star Forge. Upon learning this, the Jedi Council placed it upon Revan and Shan to travel to the worlds where the other Star Maps were hidden and find the location of the Star Forge. Although the Council still wanted Bastila to continue to draw out Revan's memories, they were also curious to see if Revan could accomplish this mission without falling to the dark side. Juhani also requested that she be allowed to join Revan's party."}, {"tag": "p", "text": "Revan, Shan, and their companions journeyed to these worlds, retracing the steps of Darth Revan and Malak from years before. During these travels they gained two new companions; on Tatooine, Revan purchased HK-47, the assassin droid that he had created as a Sith Lord, and on Kashyyyk, the self-exiled Jedi named Jolee Bindo joined his party. Additionally, the crew of the Ebon Hawk found themselves hunted by both the Sith and bounty hunters and confronted with the problems of the local populace at every turn. One of their greatest challenges was when Darth Bandon finally caught up with the party, only to meet his end at the hands of Revan. Throughout their journey, Revan and Bastila grew closer due to the feelings created by their Force bond. Bastila feared their love, thinking it would lead to the dark side. In truth, she was afraid to face her feelings, out of fear of who Revan once was. She attempted to resist the feelings, but their love was too great to avoid."}, {"tag": "p", "text": "As the crew searched for the final Star Map, Revan and his allies were captured by the Sith flagship Leviathan under the command of Admiral Saul Karath. As the Ebon Hawk was being brought in via tractor beam, its crew decided that it would be best for another member of the party to use their talents to either avoid or escape confinement and then liberate the rest of the crew. Aboard the ship, Admiral Karath interrogated Revan, Shan and Onasi personally, informing them of the destruction of the Dantooine Enclave as he attempted to extract information from them; however, despite their torture, Karath was unable to learn anything. After the Admiral's eventual departure, both Bastila and Revan determined that Karath had sent a message to Darth Malak with their location and that he was making his way towards them. Meanwhile, the Ebon Hawk crewmember succeeded in getting away from their guards and managed to unlock the holding cells and force cages that held the rest of the group captive."}, {"tag": "p", "text": "Reunited, the crew worked together to escape the Leviathan. On the way, the crew confronted Admiral Karath on the bridge deck, and a furious battle took place, resulting in the Admiral's death. With his dying breaths, the onetime Republic officer told Onasi of Revan's true nature. Making a break for it, the crew fled towards the Ebon Hawk, but, despite their haste, the trio was intercepted by the Dark Lord. As surprised as he was amused at the events that had transpired since his betrayal, Darth Malak gleefully filled Revan in on the details of who he was—and what he had been made into. Revan, shocked by the revelation, asked Bastila if Malak spoke the truth. She affirmed said truth and went on to explain everything. Following their brief discussion, Darth Malak created a stasis field around Shan and Onasi and prepared to end his former Master. Revan proved himself a capable swordsman, holding his own against the Dark Lord. However, Shan intervened so that Revan and Onasi could escape. Darth Malak defeated and captured her. Reluctantly, Revan and Onasi left, and escaped the Leviathan with the rest of their crew. Revan was thus forced to deal with Darth Malak's revelation and the loss of his beloved Bastila."}, {"tag": "p", "text": "Darth Malak then attempted to turn Bastila to the dark side and become his new Sith apprentice, torturing her with Force lightning. She was firm at first, but after a week of endless torture, he succeeded in breaking her and turned her to the dark side. Shan became his apprentice, replacing the slain Darth Bandon. His primary motive in this was to gain the power of her battle meditation. Meanwhile, the preparations for the Star Forge were nearing completion and the Sith forces had grown greater than ever before, and Revan found the fifth and final Star Map, rediscovering the location of the Star Forge."}, {"tag": "p", "text": "Upon arriving, the Ebon Hawk was crashed on the unknown planet because of its disruptor field. With their hyperdrive damaged, Onasi was forced to make an emergency landing on one of the planet's smaller islands—the very same island that held the Temple of the Ancients. After several run-ins with the native Rakata, Revan was able to piece together what had transpired during his and Malak's last visit to the forgotten world. With the help of the Rakata, he, accompanied by Jolee Bindo and Juhani, entered the Temple of the Ancients in order to shut down the disruptor field so that the incoming Republic fleet would not suffer a similar fate. At the top the Temple they were confronted by Bastila; now a Sith apprentice to Darth Malak. Mocking the three and taunting the anguished Revan, she engaged them in a brief lightsaber duel. Shan was no match for Revan's power and threw a Force wave at the three in order to save herself from defeat. After seeing how powerful Revan was, she came to believe that Revan deserved to be the Dark Lord of the Sith. She attempted to entice Revan to reclaim his former title and take her as his apprentice. Revan rejected Bastila's temptation, choosing the path of the Jedi, and tried to turn Bastila back to the light, reminding her of the of love between them. Angered at her failure to turn Revan, Shan retreated to the Star Forge, where she and Revan would face each other again during the final battle."}, {"tag": "h4", "text": "The Fall of Darth Malak and Revan's departure to the Unknown Regions"}, {"tag": "p", "text": "Revan and his crew repaired the Ebon Hawk and pursued Shan as a Republic fleet and a group of surviving Jedi from the Jedi Enclave arrived, commencing an assault on the Star Forge. Revan, with his two companions and a Jedi strike team, boarded the Star Forge in hopes of disrupting Shan's battle meditation long enough to give the Republic fleet a chance. Aboard the Star Forge, Revan displayed his restored affinity for the Force and mastery of lightsaber combat by confronting and defeating Malak's army of Star Forge battle droids and Dark Jedi with little help from others. In the Star Forge's war room, Revan faced off against Shan once again, this time alone. Although Shan was able to draw on the Star Forge to renew her strength, Revan still bested her. She begged Revan to kill her after all she had done, but Revan attempted to convince her to return to the light side by drawing on the powerful bond of love they shared. He succeeded, and Shan used her battle meditation to aid the Republic, turning the tide of the battle."}, {"tag": "p", "text": "As Shan used her powers to shift the balance of power, Revan went on to confront Darth Malak atop the highest levels of the station. There Revan faced Darth Malak in a brutal lightsaber duel during which the Dark Lord attempted to siphon off the remaining Force-energy of several dead Jedi; Revan, however, was able to use his own power to prevent this. After defeating his former apprentice, he and Shan, along with Onasi and the others, boarded the Ebon Hawk and escaped the station's destruction. With the Star Forge destroyed, the will of the remaining Sith forces in orbit was broken and they were defeated; as a result of this action, the destructive war that had claimed so many lives—on both sides—finally came to an end. Revan and his crew were given a hero's escort back to Lehon. There, they were each rewarded with the Cross of Glory, the Republic's highest award. Jedi Master Vandar Tokare also thanked Revan, re-bestowing his rank of Jedi Knight and proclaiming him the \"Prodigal Knight\", and his friends as the heroes of the era and galaxy."}, {"tag": "p", "text": "After the war's end, however, Revan began to recover more and more of his lost memories despite what the Jedi had done to wipe them away. As time went on, the former Dark Lord remembered the threat posed by the hidden Sith Empire that he had encountered in the Unknown Regions. Leaving behind Shan, those who had served alongside him at war's end, and all of his possessions, Revan departed known space in order to face this threat in his own way. The exiled Jedi Master Kreia, who had taught Revan when he was still a Padawan, had gone in search of both him and what had driven him to leave the Republic behind and wage a war against it; eventually she too found Malachor V and, corrupted by its dark energies, began to form the Sith Triumvirate."}, {"tag": "h3", "text": "The Sith Triumvirate and the First Jedi Purge"}, {"tag": "p", "text": "With the death of Darth Malak and Revan's disappearance, the Sith were left with a massive power vacuum that resulted in their own civil war. The lesser Sith Lords of the Empire, left without a strong leader, turned upon each other, attempting to take what scraps they could from the ruins of the Empire. Declaring themselves sovereign warlords, they fractured the empire into a number of small, hotly-contested kingdoms. At the height of the civil war on Korriban, Revan led a host of Jedi in an invasion of the Sith homeworld, and his forces successfully drove the Sith Lords from the planet. When Republic forces arrived on Korriban approximately a year after the Jedi Civil War's conclusion, they found the planet to be barren and lifeless. With the fall of the Sith Empire, the Galactic Republic was able to conquer Sith space, and reclaim worlds that had been under Sith control since the Great Sith War."}, {"tag": "p", "text": "After the fall of Korriban, only one Sith faction remained active in Republic space, a secretive and elusive Sith faction known as the Sith Triumvirate, led by the three Sith Lords Darth Traya and her apprentices Darth Sion and Darth Nihilus. Darth Traya was the Sith alias of the former Jedi Master Kreia, the first and last master of Revan, who was exiled by the Jedi Council for her part in Revan's training, and of others who the Council deemed as failures."}, {"tag": "p", "text": "After her exile from the Order, Kreia started questioning her beliefs and philosophy. She began searching for answers, meeting those she had affected through her teachings. Eventually, she came to Malachor V, a dead world, powerful in the dark side. She was curious, and the Sith ruins drew her in. She became overpowered with the allure of the dark side, and became Darth Traya, the \"Lord of Betrayal,\" having been betrayed by the Jedi and ready to betray in turn. She attained the title of headmistress of the Trayus Academy, able to hold any students willing to fight for the cause of the Sith: to destroy the Jedi."}, {"tag": "p", "text": "Two more Sith Lords came to join forces with Darth Traya on Malachor. The first was Darth Nihilus, the \"Lord of Hunger,\" who before becoming a Sith, lost everything to the Mandalorians during the war. A survivor of the Mass Shadow Generator in the war's final battle at Malachor V, the experience of the shadows made him \"hunger\" for Force energy and the affliction began to ravage his body. In his pain he became a wound in the Force and was found by Darth Traya. She told him that she could teach him to feed his hunger. He accepted her offer, becoming Traya's apprentice. The next to come was Darth Sion, the \"Lord of Pain,\" a long-time Sith, having served Exar Kun's Sith Empire until the day he was struck down."}, {"tag": "p", "text": "Rather than die, Sion found that by calling on his pain, anger, and hatred, he could rise from certain death and achieve immortality at the cost of all-consuming agony. With a body fractured and decomposing but held together by the dark side of the Force, Sion survived the Great Sith War. When the civil war broke out Sion fled Korriban, he came to Malachor V, where he found the Trayus Academy and Darth Traya. His brutality and strength were noted by Traya during his tutelage under her, but the two soon disliked each other because rather than yearn for knowledge or studies as she did, he sought hatred and power."}, {"tag": "p", "text": "At the completion of their training, these three became co-rulers of an Empire. The remnants of Revan and Malak's forces soon joined them on Malachor V where they subtly intervened with galactic affairs, using Traya's idea of echoes in the Force and corrupting Jedi to the dark side. Sion quickly grew impatient of waiting to fight the Jedi and the Republic while Nihilus grew hungry and in need of Force sustenance. The two conspired against Traya for a time, and when she was vulnerable, they struck. She was cornered from two sides in the Trayus Core while meditating and violently subdued. During this time, the two Lords used an unknown Force technique to sever her connection to the Force, though this allowed their master to turn the dark side of the Force. Traya, Lord of Betrayal, was betrayed again."}, {"tag": "p", "text": "Cast out by both Jedi and Sith, Kreia directed her attention towards Meetra Surik, a Jedi who followed Revan into the Mandalorian Wars and was exiled from the Jedi Order for severing her ties to the Force. Kreia took Surik as her student as Sion and Nihilus, now with dual control of the remnants of the Empire, split the Empire into equal portions and went their separate ways as though they shared the belief in Jedi extermination, their conflicting philosophies, their being as Sith, ruled out working together."}, {"tag": "p", "text": "They took their respective factions into hiding and initiated a covert shadow war against the Jedi, starting the First Jedi Purge. Sion led an army of Sith assassins from the Trayus academy in a bloody crusade, while Nihilus worked from his ship controlling his half-dead thralls and using his powers to feed on the life-force of entire worlds, gravitating towards planets with a Jedi presence."}, {"tag": "p", "text": "Though working independently, the two reduced the number of surviving Jedi down to less than one hundred by 3951 BBY."}, {"tag": "h3", "text": "The Jedi Exile"}, {"tag": "h4", "text": "Survival and search"}, {"tag": "p", "text": "While the new Dark Lords thought Darth Traya dead, this was not the case. Left extremely weakened, she managed to escape and went into self imposed exile. Claiming the Ebon Hawk, Revan's old ship, for herself, she proceed to wander the galaxy, searching for a specific Jedi veteran of the Mandalorian wars."}, {"tag": "p", "text": "The veteran in question was Meetra Surik, a high ranking Republic general who had led numerous battles and was involved in the final battle at Malachor V. It was she who ordered the Zabrak engineer Bao-Dur to activate the Mass Shadow Generator at Malachor, decimating the Mandalorian fleet. With the end of the war, she was the only Jedi to answer the Jedi Council's summons and return to Coruscant. Within the High Council Chamber within the Jedi Temple on Coruscant, she stood before the Jedi for judgment. Due to her experiences at Malachor V, she had involuntarily disconnected herself from the Force, becoming a wound in the Force, an empty void. Sensing the emptiness within her, and unsure how to deal with it or its ramifications, the council exiled her."}, {"tag": "p", "text": "Surik took to wandering the galaxy, gradually revisiting most of the old battlegrounds where she had fought. As she traveled to Telos aboard the Republic cruiser Harbinger, she was drugged and stowed away by an HK-50 assassin droid looking to collect on the Jedi bounty posted by the Exchange crime syndicate. However, as this took place, the Harbinger encountered the Ebon Hawk, which was being pursued by a Sith warship commanded by Darth Sion. The Hawk was allowed to land on the Harbinger while it docked with the Sith warship and searched it. Kreia, Darth Traya no longer, found Surik and took her aboard the Ebon Hawk, unknowingly followed by the HK-50. At the same time, the Harbinger search teams found the Sith warship empty with the exception of a heavily mutilated body that somehow remained just barely alive despite the extreme damage it showed."}, {"tag": "p", "text": "The \"body\" was revealed to be Darth Sion himself. Sion relied on his rage-fuelled power in the Force to literally pull his body back together, achieving a form of immortality and used this ability to masquerade as a dead body. However, as he could only keep his body together, not repair the damage it sustained, he was left in constant agony and had the appearance of that which he pretended to be; a corpse."}, {"tag": "h4", "text": "Harbinger"}, {"tag": "p", "text": "Bursting out of the Kolto tank that his body had been placed in, he commandeered the ship with the aid of the Sith Assassin crew of his warship that had secretly infiltrated the Harbinger when it had docked with his own ship via umbilical. As he took over, Kreia took off in the Ebon Hawk with the drugged Surik in tow. However, the now Sith-controlled Harbinger fired on the Hawk as it jumped into hyperspace, forcing the ship to make a droid controlled landing at the Peragus Mining Facility."}, {"tag": "p", "text": "At the facility, the blacked out Surik and near-dead Kreia were placed in the medical bay while the HK-50 stowaway assumed the role of the facilities maintenance assistant. The assassin droid used his new position to reprogram the facilities droid miners to attack the organic ones, fool the computers into believing that there was an explosion, confining the remaining miners to the reinforced dormitories, sabotage the ventilation system to kill the trapped miners, and cause all the med-bay patients, including the Exile, to receive a near-lethal dose of sedative."}, {"tag": "p", "text": "While the other patients were killed by this, Surik's Jedi training enabled her to withstand the effects and survive, as HK-50 anticipated. However, she withstood the effects far better than the droid intended and awoke. Wandering the medbay, Surik encountered the now recovered Kreia and began searching the facility for an escape route, meeting the confined Atton Rand. With Rand's help, they managed to find a way to the hanger, where the Ebon Hawk was kept. Fortunately, the ship had been repaired under orders from the HK-50 to serve as an escape vehicle. However, before they could escape, the Harbinger, under Sion's command, arrived at the facility and docked. As they needed the current asteroid drift charts to navigate the field surrounding Peragus, they were forced to board the Harbinger to obtain them, battling and destroying the HK-50 along the way."}, {"tag": "p", "text": "Unfortunately, before they could make good their escape, they encountered Darth Sion."}, {"tag": "p", "text": "While Atton Rand and Surik fled to the Ebon Hawk, Kreia remained behind to hold off Sion. After a short conversation between the two, during which Kreia hid from her former apprentice with the Force, Sion took advantage of a momentary lapse in her illusion to amputate her hand with a lightning fast strike. This caused a Force link between Kreia and Surik to reveal itself, as Surik felt Kreia's pain. Despite this, they managed to escape to Telos."}, {"tag": "p", "text": "Unfortunately, the Peragus Mining Facility was destroyed by Sion as he pursued them, an event that would have drastic ramifications for the Republic."}, {"tag": "h4", "text": "Telos"}, {"tag": "p", "text": "Their visit to Telos was a total debacle. Firstly, as they had come from Peragus, they were arrested in connection with the destruction of the facility. While in custody, the Ebon Hawk was stolen and they were attacked by a bounty hunter that had infiltrated the Telos Security Force, then they were confined to house arrest, and while they were eventually let go, they were still confined to the Telos Citadel Station in orbit above the ravaged world. Though they managed to procure a shuttle to journey down to one of the restoration zones on Telos's surface, they were shot down by a Czerka Corporation survey team."}, {"tag": "p", "text": "Fortunately, they encountered Bao-Dur, who had taken a job as shield technician on Telos. He pulled them out of the burning wreck and helped them escape the restoration zone, commandeering a shuttle in the ruins of the Telos military base. In the shuttle, they flew to a secret academy established by Jedi Master Atris at the north pole of Telos. There the Exile met with Atris and negotiated the return of the Ebon Hawk, which had been stolen by her agents."}, {"tag": "p", "text": "While Surik met with Atris, Kreia forcefully probed Atton Rand's mind, discovering that he had been one of the Sith Troopers during the Jedi Civil War, specializing in Jedi hunting… and torturing. Atton, who was deeply ashamed of his actions, was blackmailed by Kreia to be an instrument of her manipulations."}, {"tag": "h4", "text": "Mission"}, {"tag": "p", "text": "Once under way again, the Exile resolved to gather the remaining Jedi, supposedly to fight back against the Sith, but truly to get an explanation of what happened to her and why she was exiled."}, {"tag": "p", "text": "They proceeded to journey to the various worlds the Jedi masters were last known to have been. On Dantooine, they found Master Vrook Lamar and aided him at defeating an Exchange-controlled mercenary army bent on destroying the worlds fragile government. On Nar Shaddaa, they became involved in the vicious intrigue between the Exchange, the Hutt crime lords, and the Bounty Hunters guild. In the end, Surik was captured by Goto, the Exchange crime boss controlling Nar Shaddaa. In the midst of all this, Jedi Master Zez-Kai Ell revealed himself and helped rescue Surik from Goto. \"Goto\", his control over Nar Shaddaa in shamble, joined Surik's party, revealing himself to actually be the droid; G0-T0. Obsessed with order and with no affiliation to any party, G0-T0 sought to use the Exile as an instrument to create order. Fortunately, as G0-T0 was the one who originally placed the bounty on the Jedi in the first place, his joining of their party forced him to rescind it."}, {"tag": "p", "text": "On Onderon, they became involved with the Onderon Civil War between the hereditary ruler Queen Talia and the isolationist militant upstart General Vaklu. Gaining the aid of the Mandalorians, now led by Canderous Ordo, they managed to end the war, siding with Talia and the royalists. However, they found out that the militant faction led by Vaklu had been receiving aid from the Sith, specifically Darth Nihilus's faction. While the war was ended and Jedi Master Kavar, who had been serving as Talia's advisor during the crisis, was freed up to join the gathering on Dantooine."}, {"tag": "p", "text": "On Korriban, they found the corpse of Lonna Vash in the torture chamber of the Sith Academy. As they prepared to leave, they encountered Darth Sion. After a quick lightsaber duel, they were forced to flee. Sion let them go, feeling that the Jedi Exile had earned the right."}, {"tag": "h4", "text": "Battle of Telos"}, {"tag": "p", "text": "During the Onderon Civil War, Kreia allowed one of General Vaklu's subordinates, the Colonel Tobin, to escape. Tobin fled to Nihilus and told the Sith Lord the information given him by Kreia regarding the existence of the Jedi academy Atris established on Telos. The information was a lie, the only Jedi there was Atris herself while the rest of the residents were Echani handmaidens trained to resist the Force. In any case, Nihilus prepared to attack Telos in order to drain the apparent Jedi Academy and once again sate his hunger."}, {"tag": "p", "text": "As this took place, Surik traveled to Dantooine and met with the masters. Unfortunately, the masters decided that Surik's condition as a wound in the Force made her a threat to the Force itself, and prepared to use their powers to permanently sever her connection to it. However, before they could do so, Kreia burst in on them. Kreia used the Force to drain their connection to it, killing them. While Surik laid unconscious, Kreia was led to Jedi Master Atris for judgment by one of Surik's companions, the Echani Handmaiden Brianna. Journeying to the Telosian Jedi Academy, Kreia revealed that Atris had herself been corrupted and turned to the dark side by the Sith holocrons she gathered, but could not admit it even to herself. Atris, the new Darth Traya per Kreia's words, then embraced the dark side openly, but was soon confronted and defeated by the Exile."}, {"tag": "p", "text": "With the new Traya defeated, Surik turned her attention to Darth Nihilus, who had just arrived in-system. While the Republic fleet arrived to hold Nihilus's fleet, Surik boarded the Sith Lord's flagship, the Ravager, and with the aid of Canderous Ordo's Mandalorian commandos, they prepared to destroy the ship. As this was done, Surik confronted Darth Nihilus and engaged the Sith Lord in combat."}, {"tag": "p", "text": "The Sith Lord attempted to absorb Surik's Force energy, however, he failed and exhausted himself. This was due to Surik's natural ability to draw on the Force energy of those around her, mirroring Nihilus's, as a result of her tie to the Force being cut at the end of the Battle of Malachor V. They engaged in a quick fight, with the Dark Lord seemingly too strong to defeat. Then, Surik learned of his aversion to her Force energy signature and turned the tide against him. Nihilus's former apprentice, Visas Marr, now one of Surik's companions, entered a trance and tried to disrupt the link with her former Master, undermining his connection to the Force through their Force bond. Nihilus was defeated, vanishing in a haze of dark side energy."}, {"tag": "h4", "text": "The echo's death"}, {"tag": "p", "text": "Kreia returned to the Trayus Academy, subverting Darth Sion and convincing him that she was his master Darth Traya once more. Having reclaimed the forces of the Sith, Kreia waited for Surik. Meetra Surik, following information from Atris, arrived on Malachor and stormed the Sith academy. Fighting her way through the army of Sith assassins and apprentices populating the training center, she confronted Darth Sion at the entrance to the Trayus core."}, {"tag": "p", "text": "After a lengthy battle, she convinced the Sith Lord to let go of his rage and allow himself to die. As Sion became that which he appeared to be, he expressed relief at finally leaving the world. Surik entered the core and confronted Kreia. After a discussion where Kreia revealed her disgust towards the idea of the \"Will of the Force\", and her intention to strip the Force of its will, Kreia forced her student into a duel to the death. Their bout abruptly ended when Surik cut off Kreia's remaining hand. However, the Sith used her telekinetic abilities to summon up a trio of lightsabers to assail Surik. Surik managed to cut down the weapons and defeat Kreia. As her mentor died, Meetra Surik was whole; Surik let go of Kreia to remain alive as an individual."}, {"tag": "p", "text": "While this took place, one of Bao-Dur's droids made its way through the wastes of Malachor V and found the remains of the Mass Shadow Generator in several crashed ships. Reactivating the weapon, the Trayus Academy was destroyed while Surik and her companions managed to escape aboard the salvaged Ebon Hawk."}, {"tag": "p", "text": "The threat of the Sith was once again thwarted."}, {"tag": "h3", "text": "The Empire's Spy, and Naga Sadow's Return"}, {"tag": "p", "text": "Although the Jedi thought the Sith were defeated, the Sith Empire that Revan had once encountered still existed. In fact, they had planted a Sith infiltrator within the Jedi Order itself, Barel Ovair. Barel selected Eison Gynt to be his Padawan, and together traveled the galaxy studying the Force and accepting the most dangerous of missions for the Order."}, {"tag": "p", "text": "Ovair was then given a mission by his superiors; he must destroy all of the long dead spirits of the Sith, who might attempt to challenge the Sith Emperor's return. Thus, the spy and his Padawan undertook the Mission to Yavin 4. The Jedi Order and Gynt believed they were to destroy the spirit of Naga Sadow, which still lingered in his tomb on the planet, in order to finally cleanse the Dark Side planet, so Barel was free to defeat the spirit without hesitation. Unfortunately, the pair was attacked by Massassi warriors that still lived on the surface, and they were forced to retreat into the temple of the dead Sith Lord."}, {"tag": "p", "text": "Later, Ovair returned to Coruscant injured and half-mad. His report to the Jedi Council was that Gynt had been killed during the mission, and the Jedi believed his lies. Eison was indeed alive, and even possessed by the spirit of Naga Sadow. Years later, the possessed Gynt arrived on Coruscant, and immediately challenged his old master to a duel. The two fought, and although Eison's powers were bolstered by Sadow's, Ovair was victorious, and slew his ex-Padawan. Ovair was questioned by the Jedi after the fight, but they once again believed him and he was treated as a hero."}, {"tag": "h3", "text": "Resurgence of the Sith Empire"}, {"tag": "p", "text": "In the aftermath of the Great Hyperspace War, the old Sith Empire was largely decimated by the final conflict between Naga Sadow and Ludo Kressh, and was forced to retreat to the Unknown Regions by the Republic, leading to the belief that the Empire was defeated."}, {"tag": "p", "text": "The reason for Revan's betrayal of the Republic was to strengthen it for its inevitable rematch with the old Sith Empire. However, with his plans largely undone by Malak's rampage, he journeyed into the Unknown Regions to search out the Empire and possibly stem the tide. Whatever his intent or actions, the Sith Empire ultimately returned."}, {"tag": "p", "text": "It had been three centuries since the Jedi Civil War, Revan's disappearance, and the collapse of the Sith Triumvirate. The Sith were thought long dead, so the invasion came as a total surprise. Their invasion marked the beginning of the decades long Great War."}, {"tag": "p", "text": "The Sith quickly seized most of the Outer Rim, destroying the Sluis Van shipyards. The battlegrounds spread to include such remote worlds as Ilum or Dathomir. Despite Manaan's attempts to remain neutral, it was ravaged by the Sith, and the Republic suffered further defeats at Agamar and Utapau. However, a heroic struggle at Bothawui helped slow the Sith onslaught, and the Jedi were able to bring the dark-siders advance to a halt in the Mid Rim. It was during this time that the Sith Emperor hatched a plan to capture enemy combatants and program into them his very essence. His apprentice Exal Kressh betrayed him and led a republic attack on the Sith homeworld of Korriban. There she faced Teneb Kel, the Sith apprentice chosen to hunt her down."}, {"tag": "p", "text": "However, things for the Republic were vastly complicated by the rebirth of the Mandalorians. In the bloody arenas of Geonosis, a gladiator who called himself the \"New Mandalore\" rose to prominence. The Sith Imperial Intelligence saw a tremendous opportunity in this gladiator. Dispatching agents to rig the arena bouts, they ensured the warrior's epic rise to power. Beating all his opponents in the arena, the gladiator claimed the currently defunct title of Mandalore. All surviving Mandalorians answered the New Mandalore's call and flocked to his banner. Fulfilling his end of the bargain with the Sith, the New Mandalore command was simple; face the greatest challenge the galaxy has to offer and battle the Jedi Knights. Obviously the plan was to disrupt the Jedi war effort against the Sith."}, {"tag": "p", "text": "In order to provoke the Jedi, the Mandalorians blockaded the Rimma Trade Route, cutting off supplies to and from the Outer Rim and hurting the war effort against the Sith Empire. Left with no choice, the Jedi were forced to attack the Mandalorian blockade in an attempt to break it. The attack was a total failure, the Jedi were soundly defeated and the Mandalorians continued their blockade. Were it not for the efforts of daring smugglers led by Hylo Visz, the Republic would have fallen much sooner. Visz gathered all the supply ships she could find, loaded them down, and parked them less than a parsec from the Mandalorian fleet. Distracted by the suspicion freighters, the Mandalorians were caught off guard by a joint Republic-smuggler attack, breaking the blockade."}, {"tag": "p", "text": "The Jedi war effort was able to continue, Visz was hailed as a hero, and the Mandalorians disbanded, the new Mandalore leading some of their number to seek new challenges while the rest returned to mercenary work. Ultimately, the new Mandalore was assassinated and replaced, though the allegiance of the current Mandalore remains ambiguous."}, {"tag": "p", "text": "However, due to their delays in the Mid Rim, the Sith tactics became increasingly aggressive and desperate. The Sith Emperor became increasingly impatient, having expected to triumph quickly. In his impatience, he presented a surprising offer to the Republic; a peace treaty. The Jedi Council advised caution, but even they admitted that the war was unwinnable. Peace was the only option."}, {"tag": "p", "text": "While diplomats and senators convened on Alderaan for negotiations with the Sith, the dark-siders played their final card. They attacked Coruscant. Using a stolen Republic ship, a group of Sith warriors crash-landed within the entrance to the Jedi Temple itself. Rendezvousing with Darth Malgus, who had arrived just previously, and a Sith-hired bounty hunter who had disabled the Temple security system. Sacking the Temple, they disabled the Coruscant defense mainframe, allowing their forces to land and storm the planet."}, {"tag": "p", "text": "With the Republic's capital firmly in their grip, the Imperial delegation took command of the Alderaan Peace Conference. Lord Baras introduced the Republic diplomats to the Treaty of Coruscant, an agreement greatly biased towards the Sith that would shape galactic events for decades. Although the Jedi Order's representatives protested, Senator Am-Ris agreed to the terms. The war was ended, but Coruscant was subjected to the rule of the Empire's Dark Council for a short time."}, {"tag": "p", "text": "With the Sith takeover of Coruscant, the Empire now controlled half of the galaxy, and thanks to the Treaty of Coruscant, they were recognized as a legitimate government for the first time in their history. The Jedi and Republic troops were recalled from their many battles, leaving thousands of star systems to fend for themselves under Sith control. With the Jedi Temple on Coruscant ransacked and in ruins, the Jedi Order was forced to relocate, choosing their ancient homeworld of Tython. As the Sith Empire consolidated its power and the Galactic Republic licked its wounds, the Cold War began."}, {"tag": "h3", "text": "The Cold War"}, {"tag": "p", "text": "The Cold War was a period of uncertainty and high tension between the two factions. Bordor skirmishes and proxy wars between the two powers brought the uneasy truce to the brink of collapse. However, neither side was ready to resume all out war; and the Sith Emperor's interests seemed to turn to something other than conquest. He handed control of the Empire over to his Dark Council, which oversaw the day-to-day affairs of the regime, and went on to pursue his own mysterious goals."}, {"tag": "p", "text": "While the Cold War broiled, the Jedi Order reconnected with their roots, and for the most part secluded themselves from galactic affairs, as public opinion had largely turned against them and irate senators blamed them for the war."}, {"tag": "p", "text": "The Cold War saw two powerful Sith Lords rise to power: Darth Nox and the second Emperor's Wrath."}, {"tag": "h3", "text": "Second Great Galactic War"}, {"tag": "p", "text": "The Second Great Galactic War was the culmination of a dozen years' worth of intense standoffs, uneasy peace and minor border skirmishes and proxy wars. When the galaxy returned to full-scale war, both sides more powerful than they had been previously, the galaxy was torn apart by vicious battles and scheming plots. The Emperor consolidated his power from the shadows, his agents relaying information of galactic events to him while he prepared his plan to annihilate life in the galaxy and gain ultimate supremacy and power."}, {"tag": "p", "text": "The Second Great Galactic War saw Darth Nox and the Emperor's Wrath lead Sith Forces into war, savagely attacking the Republic and battling ferociously with the Jedi. Though the Dark Lords of the Sith often engaged in mortal combat with the Jedi, they also suffered from internal betrayals and other schemes and plots against rivals. This intense rivalry and infighting was put to an end by the Emperor's Wrath, thus strengthening the Empire like never before. After the Emperor, Vitiate, was resurrected, he consumed all life on Ziost before fleeing into Wild Space. He secretly built up the Eternal Empire, which invaded the galaxy and subjected the Sith Empire and Republic, until a war hero rose up, and with the help of the Sith Lana Beniko and Republic SIS agent Theron Shan, created the Eternal Alliance that toppled the Empire and slew Vitiate. The Sith Empire would later engage in the Third Galactic War with the Republic."}, {"tag": "h3", "text": "Desolous's Insurgence"}, {"tag": "p", "text": "More than one hundred years after the fall of the Eternal Empire and the Third Galactic War, a Pau'an Force-sensitive was discovered by the Jedi. Brought into the order, he eventually became a revered and powerful Jedi Master. However, his innate lust for battle drove him to seek out Sith teachings, which forced the Jedi to expel him from the order."}, {"tag": "p", "text": "The master declared himself Dark Lord of the Sith and took on the name Darth Desolous. Desolous returned home to Utapau and proceeded to build an army around him, training hundreds of fellow Pau'ans in a personalized version of Jedi fighting techniques and equipping them with Cortosis alloy shields. He then rallied his army and embarked on a bloody campaign against the Jedi Order. Using ambush and guerrilla fighting tactics, Desolous and his army ultimately slaughtered over two thousand Jedi."}, {"tag": "p", "text": "However, with each victory, Desolous grew increasingly reckless and bold, his hatred of the Jedi eclipsing all other emotions, or reason. In his recklessness, Desolous allowed himself and his army to be drawn into a trap at Yaga Minor, where he and his army were destroyed."}, {"tag": "p", "text": "Meanwhile, in 2975 BBY, the two surviving Sith factions on Kesh, the Lost Tribe of the Sith and the Doomed clashed in a conflict that culminated with the dissolution of the Doomed, and the reawakening and death of Dreypa."}, {"tag": "h3", "text": "The New Sith Wars"}, {"tag": "h4", "text": "Ruin"}, {"tag": "p", "text": "Several hundred years after the fall of Darth Desolous, another charismatic and revered Jedi Master fell to the Dark side and recreated the Sith. This time, it was the Umbaran Phanius, a renegade master known for a disturbing philosophy, which included elements of moral relativism and solipsism, possibly echoed in certain aspects by the much later Potentium belief."}, {"tag": "p", "text": "Leaving the Jedi Order to pursue prohibited Sith teachings, Phanius became the first of what would be known as the Lost Twenty. The newly christened Darth Ruin set about recreating the Sith, uniting the various splinter factions that remained from the Old Sith Wars and the Cold War, and gaining the allegiance of fifty turn-coat Jedi Knights in an event known as the Fourth Great Schism. Ruin proceeded to initiate the New Sith Wars against the Jedi."}, {"tag": "p", "text": "However, his newfound power was not to last. Ruin, in his all-consuming ambition and single-minded hatred of the Jedi, caused the deaths of thousands of his own followers, sometimes on a whim. Ultimately, Ruin's actions led to the betrayal of his followers, and he was assassinated. However, the New Sith Wars continued on and off for almost a millennium."}, {"tag": "h4", "text": "The Dark Underlord"}, {"tag": "p", "text": "Following the death of Darth Ruin, several Dark Lords rose to power and reorganized the Sith, renewing war against the Republic. One of the first after Ruin was a mysterious being known only as the Dark Underlord. Theories regarding his true identity often gravitated towards him being a Sith spirit summoned from Chaos, some even stating that he was the resurrection of the Lettow General Xendor."}, {"tag": "p", "text": "During the first quarter of the war, the Underlord was a bloody marauder who earned the ire of the Republic. Attaining leadership of the Sith, the Underlord consolidated a number of elite Sith warriors known as the Black Knights. Setting up a base on Malrev IV, they continued the war against the Republic."}, {"tag": "p", "text": "As the Dark Underlord fought the Republic, he found a nemesis in the Jedi General Murrtaggh. The Jedi General, in a scheme to infiltrate the Underlord's fortress on Malrev IV, hired a group of Mandalorian mercenaries to stage a diversionary attack while he broke into the fortress and assassinated the Underlord. Murrtaggh's plan was ultimately successful, but at a terrible price. He confronted the Underlord and slew him, but fell to the Dark side as he struck down the Dark Lord."}, {"tag": "h4", "text": "Rivan"}, {"tag": "p", "text": "Sometime after the fall of the Dark Underlord, a Zelosian Sith Lord christened Darth Rivan rose to power. Rivan settled on the planet Almas, and built a fortress on the world. However, unlike many of his predecessors who devoted themselves to war against the Republic, Rivan's primary occupation was study. His goal was to find a way to eliminate the inherent infighting amongst the Sith, as enlightened cooperation was not considered a virtue amongst Darksiders."}, {"tag": "p", "text": "Rivan's researches turned his fortress into a massive focal point of Dark side energy, and resulted in the creation of the Sith battlelords. The battlelords successfully implemented Rivan's goal of eliminating infighting by causing a Force-bond to form between a commander and all of his subordinates, ensuring that whenever a subordinate attempted to assassinate his superior officer, the damage would instead be inflicted upon the soldier."}, {"tag": "p", "text": "Rivan's other researches resulted in the creation of the Kaluthin grass, which modified the toxic landscape and atmosphere of Almas, terraforming the planet into a gardenlike paradise. At some point, he also gained possession of an artifact known as the Darkstaff, an insidious semi-sentient weapon capable of draining the Force essence from living beings."}, {"tag": "p", "text": "It was initially believed that Rivan was betrayed and killed by his own apprentice, Darsin, after being driven off Almas by a joint Republic/Jedi assault. In truth, the Darkstaff created a massive Force storm that swept across the surface of Almas and transported Rivan through space and time to Ruusan during the final battle of the New Sith Wars several centuries later. He perished in the battle, being left extremely weakened by the journey."}, {"tag": "p", "text": "Until the rise of Darth Bane in the very same battle that resulted in his death, he was the last Sith Lord known to use the \"Darth\" title."}, {"tag": "h4", "text": "Darzu"}, {"tag": "p", "text": "Some time after Rivan's fall, a new Dark Lord known as Belia Darzu rose to power. Prior to her ascendance, the Shi'ido Darzu was a Dark Side Marauder and a Sith Alchemist. As Dark Lord, Darzu made the ancient Jedi world of Tython her seat of power, building a fortress and the planet and commencing with her alchemic experimentations, saturating the world with the Dark Side."}, {"tag": "p", "text": "Among her creations was a suit of heavy battle armor that was imbued with the Dark Side, granting the wearer invisibility and enhanced physical strength. However, possibly Darzu's most insidious creation was her personal army of Technobeasts, creatures whom she had mutated into twisted mechanical versions of their former selves through a combination of Nanogene technology and the Dark side of the Force. She controlled this army through the use of the Sith alchemic technique Mechu-deru."}, {"tag": "p", "text": "Belia Darzu was ultimately assassinated by Sith of the Mecrosa Order, who had her poisoned at the behest of her fellow Sith Lords. Though she died, her knowledge survived in the form of her many notes and journals left intact within her fortress, and her holocron, all of which later came into the possession of Darth Bane."}, {"tag": "h3", "text": "Brotherhood of Darkness"}, {"tag": "p", "text": "Due to the constant infighting amongst the Sith, their Empire was fractured into numerous pieces. Self-proclaimed Sith Lords rose to establish their own personal domains, while enslaved masses suffered under the rule of these warlords. Despite this division however, the Republic and the Jedi Order were both too weakened by their off-and-on conflicts with the Sith for them to capitalize on it. With the Republic crumbling due simply to a lack of infrastructure, the Mid and Outer Rims became lawless free-fire zones that, more often than not, were absorbed into the territories of various Sith warlords. In response to the lack of Republic and Jedi intervention against the Sith, many individual Jedi began personal campaigns to free oppressed worlds from the Sith. In the instances where they succeeded, they were often granted Feudal-styled control over the area they freed by their grateful populaces. These Jedi Lords eventually became so popular and powerful that they created their own council to oversee their affairs, completely ignoring the Jedi High Council. In an attempt to regain their authority and popularity, the High Council fielded their own champion, the charismatic and powerful Skere Kaan. However, Kaan believed that the Jedi were responsible for the chaos that plagued the galaxy, and defected with a group of like-minded Jedi to the Sith cause. However, unlike his fellows who were more concerned with establishing personal dominance, Kaan focused on bringing down the ailing Republic. To this end, he set about uniting the various factions of the Empire under a single banner."}, {"tag": "p", "text": "Kaan's plan to unite the Empire was unique in Sith history. Rather than individually challenge each of the Dark Lords to gain possession of their forces, Kaan instead acquiesced to their vanity, naming them all Dark Lords of the Sith and declaring them equal within the Empire. Advocating cooperation and unity within the Sith, Kaan ended the age-old power struggle and gained the backing of all the Dark Lords, who swore loyalty to him."}, {"tag": "p", "text": "Thanks to Kaan's efforts, the Sith Empire was reorganized into the Brotherhood of Darkness, and in a political sense, was now more united and stronger than before. Under Kaan's leadership, the Brotherhood set about destroying the Republic, securing the galaxy for the Sith."}, {"tag": "h4", "text": "Sith Campaigns"}, {"tag": "p", "text": "Now united under a single banner and with a common goal in mind, the Sith onslaught was vicious and inexorable. Gaining a startling victory at Korriban, the Sith reclaimed the Sith tombworld and reopened the Sith academy. Kaan installed several of his lieutenants as the leaders, with Lord Qordis serving as headmaster."}, {"tag": "p", "text": "Soon after, Kaan moved on to his next target; Ruusan. This world was largely insignificant save for its strategic placement. Kaan planned on using Ruusan as the staging area for the Sith invasion of the Core worlds. The first battle of Ruusan was a total Sith victory, with the Republic forces routed and annihilated thanks to Kaan's battle meditation. As they prepared to launch their invasion, Kaan easily repelled the Republic counter-attack."}, {"tag": "p", "text": "However, in the subsequent battles of the war, Kaan noticed a disturbing absence of Jedi. This absence was explained when Ruusan was suddenly attacked by the Jedi Army of Light, led by Lord Hoth. The Sith forces were driven off-planet, though Kaan quickly moved to retake the world. Thus began the protracted Ruusan campaign."}, {"tag": "p", "text": "During this series of battles, both the Jedi and the Sith began to unravel, members of both groups beginning to lose faith in their leaders. It was into this hostile climate that Darth Bane emerged."}, {"tag": "h3", "text": "The Rise of Darth Bane"}, {"tag": "h4", "text": "Bane's emergence"}, {"tag": "p", "text": "The man who would eventually become Darth Bane was born on the Republic mining world of Apatros. Dessel was born to an abusive father and cortosis miner named Hurst. Bullied by his father and the other miners, Dessel became a highly aggressive though cunning individual, fighting back until they left him alone. Known by the derogatory nickname \"Bane\", given by his father to the \"bane of his existence\", Dessel eventually learned to ignore the jibes and insults directed at him by the other miners."}, {"tag": "p", "text": "However, Dessel was challenged to a fight one day by one of his now dead father's friends; Gerd; Dessel bit off the drunken miners thumb. Suspended from work, Dessel went to the local cantina a little earlier than usual, beating the crowds. There, he got into a game of Sabacc with a group of off-duty Republic officers. Offended by his casually veiled insults, and enraged that Dessel won, they attacked him as he left. Dessel killed one of them in the ensuing fight."}, {"tag": "p", "text": "Knowing that the Republic officials would imprison him for killing the officer even though he was the aggressor, Dessel fled the planet and joined the Sith army. Rising to the rank of Sergeant in the Gloom Walkers unit, Dessel's skill as a soldier, along with his unconscious use of the Force, caused the unit to become one of the most famous in the military. However, during the Battle of Phaseera, the unit was sent on a suicide mission. The unit's CO, Ulabore, was too terrified of the Sith Lords to consider questioning the order, so Dessel incapacitated him and took command."}, {"tag": "p", "text": "Though the mission was successful, Ulabore had Dessel taken to be court-martialed. However, he was intercepted by the Sith Lord Kopecz, who had him sent to the Sith academy on Korriban instead. Presented with an offer to join the ranks of the Dark Lords, Dessel accepted. As a sign that he had cast off his old identity, Dessel took on the derogatory nickname his father had for him, becoming Bane."}, {"tag": "h4", "text": "Training on Korriban"}, {"tag": "p", "text": "Bane immediately began his training under the masters of the academy. On his own initiative, he studied the academy archives for ancient lore, something discouraged by the current masters, who emphasized their difference rather than attempted to continue the old ways. Eventually, Bane began to abandon his studies in the archives to focus on physical and mental exercises. Challenging one of his fellow students; Fohargh; to a sparring bout, Bane was beaten, though he killed his opponent with the Force in a blind rage."}, {"tag": "p", "text": "However, his killing of Fohargh caused him to think back on the death of his father, and Bane suddenly realized that he had unconsciously killed his father. This revelation caused him to doubt his ability, and Bane began losing his connection to the Dark Side. This caused his progress to slip, and after a disastrous failure in a sparring match, Bane was denied the right to train with the other students."}, {"tag": "p", "text": "As he could no longer attend classes, Bane resumed his studies in the archives. As he learned of the ancient Sith and their ways, Bane began to question the edicts of the Brotherhood of Darkness. However, he continued to despair in his own abilities, and it was only the intervention of Githany that kicked him out of his stupor."}, {"tag": "p", "text": "Githany was a Jedi deserter who had provided the Sith with intelligence on the Jedi movements in exchange for membership. Taking her place at the academy, her Jedi training provided her with an edge over the other students, and she became one of the foremost apprentices. A primary obstacle towards her advancement, however, was Sirak. Sirak was the top student at the academy, and the only individual skilled enough to cause her worry."}, {"tag": "p", "text": "Githany saw the opportunity to destroy Sirak in Bane, and approached him. The two formed an alliance, and Githany began providing Bane with the training he was forced to miss out on, helping Bane regain his connection to the Dark side, though he continued to play the weakling to keep Sirak's guard down. While receiving training in Force techniques from Githany, Bane also met with the Academy swordmaster; Kas'im; receiving lightsaber instruction from him. Thanks to the efforts of these two teachers, whom Bane kept secret from one another, he gained sufficient power and skill to challenge Sirak. The bout was an unprecedented victory for Bane, and Sirak suffered his first defeat. However, Bane allowed Sirak to live, shaking Githany's and Kas'im's faith in him."}, {"tag": "p", "text": "Despite this, Bane was now the top student at the academy."}, {"tag": "h4", "text": "Rebellion"}, {"tag": "p", "text": "After his bout with Sirak, Bane was approached by Lord Qordis. The headmaster revealed that he had been aware of the secret training Bane received from Ka'sim and Githany for some time, and saluted Bane's progress. However, he also ordered Bane to cease studying the Sith archives, citing the Brotherhood's efforts to \"seek a new path\" rather than continue the old ways."}, {"tag": "p", "text": "Enraged by this, Bane traveled to Valley of the Sith Lords and began inspecting the tombs, looking for some way to prove Qordis wrong and validate the old ways. Finding nothing, he determined that the current Sith were too weak to deserve the wisdom of the ancients, and the old Sith spirits had abandoned them. Returning to the academy, he was ambushed by a vengeful Sirak, along with Sirak's two lackeys, and Githany. However, Githany changed allegiances halfway through the fight, aiding Bane in killing Sirak."}, {"tag": "p", "text": "Shortly afterwards, the academy received word of the disastrous Ruusan campaign. As the Sith forces were in dire need of reinforcements, all the students immediately graduated and granted the rank of Dark Lord. However, Bane refused to accompany his fellow students, abandoning his mentors and rebelling against the Brotherhood."}, {"tag": "p", "text": "As a sign of his difference, Bane claimed the forbidden and defunct title of Darth. Darth Bane proceeded to steal Lord Qordis's ship and left Korriban."}, {"tag": "h4", "text": "The Holocron of Darth Revan"}, {"tag": "p", "text": "Following coordinates he discovered in the Korriban archives, Darth Bane traveled to the Unknown Regions, to Lehon. Landing on the Unknown World, Bane dominated a Rancor beast through Force persuasion, travelling to the Rakatan Temple of the Ancients. Entering, Bane began combing the structure for relics and artifacts. Eventually, his search led him to the sublevels. There he discovered a secret compartment in the central chamber containing the holocron of Darth Revan."}, {"tag": "p", "text": "Opening the device, Bane was given access to a plethora of information on the ancient Sith and their abilities. Bane managed to create a personal library of handwritten records of the information before the holocrons power cell depleted, receiving a final message from Darth Revan. Using Revan's knowledge and teachings as inspiration, Bane came to believe that the Force, specifically the Dark Side, was finite, and that the Brotherhood of Darkness, in addition to disregarding traditional Sith beliefs, was spreading the Dark Side too thinly. Bane became determined to destroy the Brotherhood and reform the Sith, in accordance with his own philosophy; the Rule of Two. This new edict reduced Sith numbers to merely two individuals; the master and the apprentice. To ensure a line of secession, the apprentice would eventually assassinate and replace the master after learning all he could, before taking an apprentice of his own, continuing the Sith."}, {"tag": "p", "text": "While Bane made his revelations, the Brotherhood of Darkness was worried by his absence from their ranks, as he had been one of their most powerful members. Kaan, fearful of Bane's intentions after Githany told him of a vision she experienced, dispatched Kas'im to Lehon with an ultimatum, \"join us or die\"."}, {"tag": "p", "text": "Kas'im followed the homing beacon in Bane's ship, which Bane had not bothered to deactivate, finding the \"wayward\" Dark Lord's landing site. Confronting Bane in the Temple of the Ancients, the two had a brief, heated discussion, which ended in conflict. In the ensuing lightsaber duel, Kas'im almost managed to defeat Bane with his knowledge of dual-saber combat, which Bane had not received training in. However, in the end, Bane prevailed, demolishing the Temple of the Ancients with a massive Force blast while Kas'im was still inside."}, {"tag": "p", "text": "Using Kas'im's death as the excuse, Bane began playing the weakling again, using this facade to deceive the Brotherhood into believing that he was ready to rejoin them, sending some of his records from Revan's holocron as proof of his sincerity. Meeting with Githany on Ambria, Bane was almost killed by her, being poisoned by a sample of the toxin synox Githany covered her lips with when they shared a kiss. Too weakened to heal himself, Bane rushed across the Ambrian desert to the hut of the healer; Caleb. Taking Caleb's daughter hostage, Bane forced the man to treat him. Cured by the healer, Bane allowed him to live, feeling that he could be a useful contact in the future."}, {"tag": "p", "text": "With that, Bane departed for Ruusan."}, {"tag": "h4", "text": "Destruction of the Brotherhood of Darkness"}, {"tag": "p", "text": "Arriving on Ruusan during the aftermath of the fifth battle of the campaign, Darth Bane stormed in on the Dark Lords during a strategic briefing. Disgusted by Kaan's mindset, Bane accused him of thinking like a dirt general rather than a proper Sith Lord. Kaan decided to accept Bane's tactical advise, and the Dark Lords gathered together in a ritual led by Bane, unleashing a Dark Side fueled wave of destruction upon the Jedi forces."}, {"tag": "p", "text": "While the attack itself was a total success, the Dark Lords sensed Darth Bane's intention, and broke the ritual, attacking the Jedi personally while their forces were in disarray. Bane, though enraged by their initiative, took advantage of the situation to thin their number. While the Dark Lords led the assault, Bane went to Kaan's tent and used his communication equipment to order the Sith fleet to attack the Jedi fleet, breaking the Sith blockade and allowing the Jedi to send reinforcements. The Sith were unexpectedly attacked and forced to flee. Before the Sith arrived back at camp, Bane was approached by Qordis, who sought to join Bane. Bane flatly refused and killed Qordis."}, {"tag": "p", "text": "Confronted by Kaan, Bane pretended to be dominated by Kaan's Force persuasion, and manipulated Kaan into preparing the Thought Bomb. The Thought Bomb was an ancient Sith weapon of terrible power, a massive focus of Dark Side energy that when detonated would cause mass devastation across a wide area, and kill any powerful Force-sensitives in the area. However, Kaan was unaware that the weapon would also kill the creators, namely the Sith Lords of the Brotherhood."}, {"tag": "p", "text": "The Sith forces and the Dark Lords all retreated to a massive network of caves and gathered in the central chamber. Kaan, using Bane's records, led the ritual, creating the Thought Bomb. When confronted by a group of Jedi led by Lord Hoth, Kaan detonated the bomb."}, {"tag": "p", "text": "The Brotherhood of Darkness was destroyed."}, {"tag": "h3", "text": "Rule of Two"}, {"tag": "h4", "text": "Darth Bane's reign"}, {"tag": "h5", "text": "Early Actions"}, {"tag": "p", "text": "One of Bane's first actions in the aftermath of Ruusan was to search out an apprentice. He found his disciple in the form of the young girl Zannah. After terrorizing a group of surviving Sith mercenaries to create easily discredited rumors of a surviving Dark Lord, allowing the Sith to remain hidden, he tasked Zannah with finding a way to Onderon, on her own, as a test. Abandoning her on the Ruusan battlefield, Bane departed for the planet himself."}, {"tag": "p", "text": "However, along the way, he was suddenly accosted by the spirits of Qordis and Kaan, both of whom had somehow found a way to escape the Thought Bomb. Provoked by them, Bane accidentally crippled his ship and crash-landed on the Onderonian moon; Dxun. Wandering through the wilderness, Bane came upon the Tomb of Freedon Nadd. Investigating it, he managed to gain entry, procuring Nadd's holocron. However, before he could exit the tomb, he was attacked by a swarm of orbalisks that had colonized the tomb. They latched themselves to his body, but instead of parasitically feeding on it, they instead fed upon his Dark Side energy. The two formed a symbiotic relationship, the orbalisks got to feast on Bane's energy, sustaining themselves, while they formed a set of nigh-impervious bio-organic armor for him, and they served as repositories of Dark Side energy that he could draw on at will."}, {"tag": "p", "text": "Using their power, he dominated one of the Dxun beasts to serve as his steed. Thanks to virtue of season, Bane had arrived on Dxun during the period where the atmospheres of the moon and Onderon overlapped. Pushing his steed to the limit, Bane made for Onderon."}, {"tag": "p", "text": "While Bane fought through his ordeal on Dxun, Zannah made her way to Onderon by hijacking a Republic vessel and killing the crew with a stolen blaster. Crash-landing on Onderon, she was ambushed by a clan of beast-riders. Before they could kill her, Darth Bane arrived. The beast-riders were slaughtered. Bane was impressed by Zannah's ability, and officially made her his apprentice."}, {"tag": "h5", "text": "Zannah's apprenticeship"}, {"tag": "p", "text": "Darth Bane and Zannah settled on Ambia on the shores of Lake Natth, a focus of Dark Side energy on the planet. Over the next decade, Bane trained Zannah in the arts of patience, secrecy and deception. Zannah herself developed a talent for Sith sorcery, becoming a skilled illusionist. Bane's abilities as a duelist also rubbed off on Zannah, and she developed into a formidable combatant in her own right."}, {"tag": "p", "text": "While he trained Darth Zannah, Bane utilized records stolen from the Brotherhood of Darkness to gain access to Lord Qordis's bank accounts, making off with the late Sith Lord's considerable funds. Using these credits, Bane began manipulating galactic politics, working through a variety of intermediates and middle-men. Bane began stirring up a variety of anti-Republic terrorist organizations, in order to distract the Jedi from investigating Sith rumors and keep the Republic united, ensuring that the Sith only had a single target to focus on, and to set the stage for the eventual Sith takeover."}, {"tag": "p", "text": "Bane also dispatched Zannah to infiltrate the Anti Republic Liberation Front, one of the more prominent terrorist groups, based on Serenno. Zannah's mission was successful, and she brought about the group's destruction. However, she also gained the attention of the group's reclusive leader; Hetton. Hetton was a Serenno nobleman and self-taught Sith acolyte. When he discovered Zannah's identity as a Sith Lord, he immediately begged her to make him her apprentice."}, {"tag": "p", "text": "Zannah seemingly agreed, and took Hetton and his entourage of Sith assassins to Ambria, supposedly to assassinate Darth Bane. Bane easily held off the attack, and killed Hetton. Zannah then revealed to Bane that the assassination attempt was a manipulation to eliminate Hetton and test Bane, and that the ultimate goal had been gaining the possession of Hetton's collection of Sith artifacts."}, {"tag": "p", "text": "While they gained a massive number of Sith equipment, Bane was still unsatisfied. He had been seeking to create a holocron, but had been repeatedly undone supposedly by the effects of the orbalisks, who enhanced his rage but inhibited his concentration. Bane dispatched Zannah to infiltrate the Jedi temple and gain access to the archives, so he might find a way to remove the orbalisks. While Zannah did this, Bane departed for Tython to search out Belia Darzu's fortress, and her holocron."}, {"tag": "h5", "text": "Near Disaster on Tython"}, {"tag": "p", "text": "Darth Bane landed on Tython and successfully infiltrated the fortress of Belia Darzu, evading the still active defenses. Making his way to the central chamber, he fought his way through her hordes of remaining technobeasts and retrieved her holocron. Studying the artifact, he discovered that his failure at creating a holocron had been due to design flaws on his part, rather than the orbalisks hindering his efforts. While Zannah sought out information on orbalisks in the Jedi archives, Bane began to rethink his decision to remove them."}, {"tag": "p", "text": "While Zannah successfully found the information she was looking for, she also encountered her cousin; Darovit. As children, Zannah and Darovit had been recruited by the Jedi to help in the Ruusan campaign. However, their ship was shot down as they came in to land, and the two were separated. Darovit had been found by the Jedi, though he shortly afterwards defected to the Sith, while Zannah had wandered the wilderness for several days before being found by Bane. In the aftermath of Ruusan, Darovit became the Healing Hermit, devoting himself to helping Ruusan recover from the war as a penance for his own actions."}, {"tag": "p", "text": "When a Republic construction team led by Johun Othone arrived on Ruusan to construct a memorial to the battle, Darovit was enraged, seeing this action as opening an old wound. Sabotaging their efforts, Darovit gained the attention of Othone, who pursued him back to his dwelling. Knowing that the game was up, Darovit surrendered. As the two spoke, Darovit revealed the survival of the Sith. After the battle of Ruusan, Darovit had encountered Bane and Zannah after the Thought Bombs detonation before they left. Zannah, as a final act of mercy, used the Force to destroy Darovit's right hand, disarming him, but indirectly sparing his life, as Bane no longer saw him as a threat. Bane allowed him to live, feeling that no one would believe the word of a traitor if Darovit tried reporting the Sith Lord's existence."}, {"tag": "p", "text": "Othone brought Darovit to the Jedi Temple to testify before the Jedi Council. However, while Othone set up an appointment with the Council, Darovit encountered Zannah in the archives while researching herbal lore. Zannah, having found the information she needed, abducted him and fled the planet. However, Darovit's absence was immediately noticed, and Othone managed to convince several Masters to accompany him in pursuit of Zannah. However, they had no time to inform any others of Darth Bane's survival."}, {"tag": "p", "text": "Zannah met Bane on Tython, with Darovit in tow. Convincing Bane to allow Darovit to live, as his abilities as a healer could aid them in removing the orbalisks, they prepared to confront the Jedi. Retreating to a large chamber deep in Belia Darzu's fortress, they stashed their artifacts and information in a small side room, along with Darovit, and prepared to meet the Jedi."}, {"tag": "p", "text": "Valenthyne Farfalla and Raskta Lsu took Bane, and Othone and Sarro Xaj attacked Zannah, while Master Worror Dowmat held back and reinforced them with Battle Meditation. Despite Dowmat's aid, the Jedi were unable to bring down the Dark Lords, Bane's orbalisk armor protecting him from their lightsaber strikes, enabling him to focus solely on offense, while Zannah's defensive technique proved adequate to hold off Xaj, whose efforts were being hindered by Othone's rusty skills. However, when Othone broke off to attack Bane, Xaj was able to take full advantage of his skills, gaining ground on Zannah."}, {"tag": "p", "text": "Bane, attempting to halt the Jedi's advance, attacked Dowmat. While Farfalla managed to save Dowmat from Bane, he also disrupted his Battle Meditation, distracting the Jedi and allowing Zannah to slay Xaj. Freed up to help Bane, Zannah impaled Lsu while Bane decapitated Farfalla and gouged out Dowmat's throats. As Bane prepared to execute Othone with a blast of Force lightning, Worror used the last of his strength to encase the Dark Lord in a Force shield, causing the lightning to backfire upon Bane."}, {"tag": "p", "text": "This revealed a major weakness in the orbalisks; they were unable to withstand electrical bursts, and were killed by the lightning. As they died, they released a toxic excretion into Bane's body that would leave him dead within days unless treated. Finishing Othone herself, Zannah quickly loaded Bane's dying body onto their ship, along with Darovit and their gathered artifacts and information and rushed to Ambria."}, {"tag": "p", "text": "Meeting with the healer, Caleb, whom Bane had earlier relied on when Githany had poisoned him, Zannah attempted to extort him. However, Caleb was unconcerned with any of Zannah's threats, as his daughter was all that mattered to him, and he had already sent her away. While Zannah despaired, Darovit convinced Caleb to heal Bane, on the condition that Zannah allow them to send a message to the Jedi informing them of Bane's existence, his location, and his helpless state. While Darovit hoped the Jedi would take Zannah and Bane into custody, and allow Zannah to redeem herself, the Sith apprentice had other ideas."}, {"tag": "p", "text": "Allowing them to send the message, which was written and delivered by message drone, Zannah waited until they healed Bane and then struck. Zannah dismembered Caleb and used her abilities to drive Darovit insane before hiding herself and Bane. The Jedi arrived soon after and found Caleb's remains. Attacked by the maddened Darovit, they quickly brought him down. Assuming Darovit to be the Dark Lord, they believed that he had brought down the masters on Tython single-handedly, but was wounded, and his attempts to heal himself through the Dark Side backfired. They believed that Caleb had been killed by \"Bane\" when he sought treatment and discovered that Caleb had sent the message to the Jedi. Collecting Caleb's remains for burial, the Jedi departed, satisfied that the Sith were finally defeated, and glorified the encounter as the \"Fall of Darth Bane\"."}, {"tag": "h5", "text": "Later Actions"}, {"tag": "p", "text": "Bane's efforts to construct a holocron would eventually come to fruition, this artifact eventually finding its way into the possession of Darth Krayt, though it would be of little use to him."}, {"tag": "p", "text": "However, as ten years passed, Zannah failed to make an attempt on Bane's life, and the Dark Lord began to become concerned with her worthiness. Worried that she might be unable to succeed him, Bane set about searching for the long lost holocron of Darth Andeddu, and the means for achieving immortality."}, {"tag": "p", "text": "However, when Bane gained the holocron and studied its immortal ways, it was stolen by Set Harth, who was once the apprentice of Zannah while trying to help her kill Bane. Bane then took an Iktotchi assassin dubbed Darth Cognus, but destroyed his own body from what he had read from Andeddu's holocron and seemingly himself in Zannah's body. Cognus then apprenticed herself to Darth Zannah, who was now the official Dark Lord of the Sith. Eventually, Cognus would rise to take her mistress' place and the rank of Sith Master."}, {"tag": "h4", "text": "Darth Cognus's reign"}, {"tag": "p", "text": "Darth Cognus was a member of the Sith Order who attained power from her mentor, Zannah. As Sith Master, she took as her apprentice an individual named Millennial, a three-eyed mutant human and a powerful Force-sensitive."}, {"tag": "h5", "text": "Millennial's Rebellion"}, {"tag": "p", "text": "Millennial proved to be an able apprentice, trained as a Shadow Hand by Cognus and possessing powerful precognitive abilities. However, Millennial and Cognus disagreed on several points, most notably on the continued application of the Rule of Two."}, {"tag": "p", "text": "Cognus was a staunch believer in the philosophy, training Millennial accordingly. The mutant apprentice, on the other hand, believed the doctrine to be too restrictive, instead supporting the more martial Rule of the Strong, which tolerated the presence of numerous Sith Lords, the leader being the strongest. The two clashed many times over this issue, and tensions eventually reached a boiling point."}, {"tag": "p", "text": "Cognus ended Millennial's training and cast him out. Whether this was a brutal execution attempt or a simple expulsion remains unknown, but either way, Millennial fled. While Cognus took a new apprentice and continued the Rule of Two, Millennial settled on Dromund Kaas and founded the Sith splinter cult known as Dark Force."}, {"tag": "h4", "text": "Darth Vectivus's Reign"}, {"tag": "p", "text": "The man who eventually became Darth Vectivus started out as a simple businessman, a shrewd but fair-minded individual. Taking control of a mining operation near Bimmiel, he discovered that he was a latent Force-sensitive, and began feeling Dark side energy permeating the mine. As he researched and learned from these energies, they also began adversely affecting the miners and contaminating the ore, forcing him to close the facility."}, {"tag": "p", "text": "As he was now freed up without needing to manage his business operation, the man began journeying the galaxy seeking knowledge on the Force. He eventually came into contact with the Order of the Sith Lords, and was apprenticed. Becoming Darth Vectivus, he managed to keep control of himself, relying on his staunch ethical code to prevent becoming corrupted by the Dark Side. Becoming the Sith Master, Vectivus returned to the mine, building a mansion on the sight and living out his life happily surrounded by family and friends."}, {"tag": "p", "text": "Vectivus remained an oddity among Sith, as he was not a power-hungry, rage driven schemer, but just an ordinary man."}, {"tag": "h4", "text": "Darth Plagueis's Reign"}, {"tag": "p", "text": "The Muun Plagueis reigned around the time of 60 BBY. Born on Mygeeto as Hego Damask, Darth Tenebrous, known as Rugess Nome found him actually before he was born. Though it is also known that he was a mystic obsessed with immortality. Thanks to the longevity his species possessed, he spent over a lifetime searching for such secrets. They came in the form of the ability to manipulate the midi-chlorians within a being to prevent death, and create life, in the form of a spontaneously generated pregnancy."}, {"tag": "h5", "text": "Sidious's Apprenticeship"}, {"tag": "p", "text": "Darth Plagueis was eventually ambushed by a Bith who claimed Sith Lordship, calling himself Darth Venamis. Trained by Darth Tenebrous in violation of the Rule of Two, Venamis engaged Plagueis in a lightsaber duel and was defeated by the Muun Dark Lord. Having appropriated the Bith's available resources, Plagueis discovered a list of Force-sensitives whom Venamis was scouting as potential apprentices. He sought them out himself, and in the course of his search he took an interest in the teenage son of a nobleman on the planet Naboo, an intelligent but arrogant young human of extraordinary Force potential named Palpatine. Plagueis was superficially motivated by a desire to exploit Naboo's wealth of plasma, but in Palpatine he saw a far greater opportunity. After realizing the boy's Force-sensitivity and cultivating his interest in the dark side's power, Plagueis manipulated him into murdering his own family, thereby initiating him into the fold of the Sith. Darth Plagueis dubbed Palpatine Darth Sidious and began the youth's training in earnest. At last, the Muun Dark Lord had found a satisfactory implement for setting the Grand Plan of the Sith in motion: Palpatine was actively involved in politics already, being that public service is mandatory for Naboo youth, and as such, Darth Plagueis saw an opportunity to dismantle the Galactic Republic from within. The young Palpatine would slowly climb the political ladder until absolute power was eventually his, and all who stood in his way would be eliminated. The Grand Plan was now underway; nevertheless, the Muun never abandoned a pet project of his, an experiment in midi-chlorian manipulation engendered to preserve his reign indefinitely."}, {"tag": "p", "text": "Aside from his own immortality, he also planned to create a pregnancy within a woman that would result in the most powerful Force-sensitive ever known. But unfortunately for Plagueis, Sidious suspected that his master was creating a replacement, the ultimate Sith apprentice. Many years later, having never lost sight of these suspicions, Sidious (now the newly elected Supreme Chancellor of the Republic) murdered Plagueis in his sleep, having plied his master with intoxicants on the pretext of celebrating his new chancellorship. After decades of learning from Darth Plagueis the Wise, the man who would become known as Palpatine the Great was now Dark Lord of the Sith."}, {"tag": "h3", "text": "Darth Sidious's Reign"}, {"tag": "h4", "text": "Maul's Apprenticeship"}, {"tag": "p", "text": "Sometime during his young adulthood, while still apprenticed to Darth Plagueis, Darth Sidious was given custody of an infant Zabrak named Maul by the baby's mother, a Nightsister of Dathomir who sought to spare her son the ordeal of his Nightbrother obligations. Sidious reluctantly took the infant into his charge, planning to train the child as an apprentice of his own. It was not altogether surprising; due to the martial prowess and Force sensitivity common to the Zabrak species, they were long a subject of interest to the Sith empires of old, these groups often spending ridiculous sums of money to hire Zabrak mercenaries. However, nothing could have prepared Maul for the brutal treatment he received from Sidious."}, {"tag": "p", "text": "Maul was subjected to numerous physical tests and training regiments, many of which bordered on torture. The goal of this vicious treatment was to strip Maul of his compassion and humility, turning him into a rage-fueled Sith killer. In the end, Sidious achieved his goal, and Maul became a powerful Sith Lord who demonstrated great martial prowess."}, {"tag": "p", "text": "As a final test, Sidious abandoned Maul on a remote and isolated world, where he was relentlessly hunted by his assassin droids. After leaving him to survive for a month, Sidious confronted the Zabrak and challenged him. Despite Maul's best efforts, he was defeated, and Sidious taunted that he had trained a new apprentice during the interim period, a replacement for Maul. The enraged Zabrak resumed fighting with renewed vigor, and even though he was defeated, he still passed Sidious's test."}, {"tag": "p", "text": "Darth Sidious declared his apprentice's training complete and dubbed him Darth Maul, Dark Lord of the Sith. Though this could be construed as a violation of the Rule of Two, Darth Sidious had informed Darth Plagueis of Maul's impending lordship, and indeed, had trained the Zabrak with Plagueis's permission. Moreover, Maul was never trained as a true Sith Lord, but rather as a Sith assassin, used for assignments deemed too risky for Sidious to undertake himself, lest he endanger his political ascension. Despite his success with Maul's training, Sidious regarded him as little more than a placeholder for his eventual target."}, {"tag": "h4", "text": "The Phantom Menace"}, {"tag": "p", "text": "While Sidious trained Maul, he also set about preparing for the ultimate revenge of the Sith. Using his alter ego; Palpatine; Sidious infiltrated the halls of power, starting as a relatively low-level politician on his native Naboo, and worked his way up. Sidious ensured that his rise was relatively slow, rather than an alarming meteoric rise to power that would attract his enemy's attention."}, {"tag": "p", "text": "In 52 BBY, Palpatine had the current Chommell sector Senator; Vidar Kim; assassinated. His complicity in the killing was never discovered, as the assassin committed suicide while being interrogated by Kim's Jedi son; Ronhar. In a demonstration of his cunning, Palpatine befriended Ronhar Kim during the late-Senator Kim's funeral, gaining a contact, and an unwitting pawn. Palpatine would use Ronhar Kim in a scheme that resulted in the creation of the Red Guard, and Kim's death during the Clone Wars would be used as propaganda to further Palpatine's power grab."}, {"tag": "p", "text": "With Vidar Kim out of the way, Palpatine assumed his place in the Galactic Senate of the Republic. Many of the power-brokers and Coruscanti politicians looked down on provincial delegates like Palpatine, believing such hopefuls would be overwhelmed by the complexity and enormity of galactic politics. Palpatine encouraged this opinion, as it made him harder to notice, and thereby less threatening."}, {"tag": "p", "text": "However, Palpatine's quiet position gained him many friends within the Senate, and he became increasingly popular. He was also an avid writer, and many of Palpatine's publications and theories about political science were taught at leading universities. However, despite Palpatine's fame and popularity, he remained unassuming, devoting all his time to his work, and to furthering his Sith agenda."}, {"tag": "p", "text": "Part of the preparation for his ultimate rise was to engineer the assassination of the Trade Federation directorate. Thanks to his contact and ally, Wilhuff Tarkin, the directorate was destroyed in a pirate raid on Eriadu, where they had gathered for a summit. This allowed for the Neimodians to take advantage of the situation and take over the Federation. The new leader of the corporation was the Viceroy; Nute Gunray."}, {"tag": "p", "text": "Once this was done, Palpatine supported the Senate resolution BR-0371, which caused many of the Galactic trade routes to have taxes levied on them. The Trade Federation was outraged, and was approached by Darth Sidious in short order. Sidious encouraged the Neimodians to retaliate, having them blockade Naboo in protest."}, {"tag": "h5", "text": "The Naboo Crisis"}, {"tag": "p", "text": "All the pieces were now in place; Palpatine heavily influenced both the Supreme Chancellor of the Republic; Finis Valorum; and the current monarch of Naboo; Padmé Amidala, and Sidious had direct control over the timid leaders of the Trade Federation. Everything that transpired did so according to his design.\nThe Blockade of Naboo kick-started uproar in the Senate, but as the Trade Federation had broken no laws, the Judicial department could not act. The Senate's stalling weakened Valorum's hold on power. However, surprisingly, Palpatine was unable to completely rein in Amidala as he had expected, and she contacted Valorum directly, holding him personally responsible for the crisis."}, {"tag": "p", "text": "Valorum panicked, backed into a corner by his own morality and desperate to shore up support, he contacted the Jedi Council. The Council sent Jedi Master Qui-Gon Jinn and his apprentice; Obi-Wan Kenobi; to Naboo as ambassadors to resolve the issue. The Jedi landed aboard the Trade Federation flagship in orbit above Naboo and waited to meet with Gunray and his aides. Darth Sidious was enraged by this new development, ordering them to proceed with the invasion and have the Jedi killed, as the Neimoidians could simply deny the Jedis' presence. However, Jinn and Kenobi managed to escape the dioxis-flooded conference room. Fighting their way to the bridge entrance, they attempted to force their way in, but were driven off by the Trade Federation Destroyer Droids. The Jedi managed to escape the ship aboard the Trade Federation invasion craft."}, {"tag": "p", "text": "While the invasion itself proceeded splendidly, the Jedi managed to make contact with Amidala and her entourage, spiriting them off-planet. However, as they escaped, their ship was damaged, and they were forced to detour to Tatooine to make repairs. Sidious was truly alarmed by this, sending Maul to Tatooine to retrieve the Queen, and also to prevent the Jedi from interfering with his potential replacement; Anakin Skywalker. However, despite Maul's efforts, he was unsuccessful, Amidala and the Jedi managed to escape Tatooine, taking Anakin Skywalker with them."}, {"tag": "p", "text": "The continued existence of the Sith, and their involvement in the crisis, was revealed."}, {"tag": "p", "text": "The Jedi and the Queen managed to make it to Coruscant, where Amidala met with the Senate, while Anakin Skywalker was taken before the Jedi Council. Palpatine manipulated Amidala into calling for a vote of No-Confidence in Chancellor Valorum, bringing about a Senate election. In accordance with his plan, Palpatine used the blockade of Naboo to take advantage of the sympathy vote, backing up his own popularity. While Palpatine went about his political machinations, the Jedi debated over whether or not to accept the incredibly potent but drastically over-aged Anakin Skywalker for training, a heated issue that added to the tension caused by the revelation of the Sith's continued existence. Ultimately, the issue was stalled when Queen Amidala rashly decided to return to Naboo in an attempt to wrest control back from the Trade Federation. Jinn and Kenobi were sent to accompany her, with Skywalker in tow."}, {"tag": "h4", "text": "The Battle of Naboo"}, {"tag": "p", "text": "When Amidala arrived on Naboo, she used the Gungan exile Jar Jar Binks who had joined her entourage before they fled the planet to make contact with the Gungan leadership. Making amends with the Gungans, whom the humans on Naboo had been tense with for centuries, she convinced them to mobilize their army to attack the Trade Federation droid forces. While the Battle of Naboo commenced, Amidala and the Jedi led a strike team into the Naboo capital to abduct Viceroy Gunray, and dispatch Naboo's air force to attack the Trade Federation flagship in orbit, as it controlled the droid armies that made up the corporations entire force."}, {"tag": "p", "text": "However, as the team prepared to exit the hangar after rallying the air force, they were confronted by Darth Maul. As the Jedi broke off to take the Sith Lord, the team took an alternate exit. As this all took place, Anakin Skywalker took refuge in the cockpit of one of the Naboo fighters, accidentally activating the autopilot and going off to join the space battle."}, {"tag": "p", "text": "It seemed that the Trade Federation and the Sith were going to be victorious in the struggle; Amidala was captured and taken before Gunray, the Gungan forces were routed and captured, the Naboo air force suffered heavy casualties, and Maul managed to kill Qui-Gon Jinn. Obi-Wan Kenobi fell on the Sith Lord in a blind fury, but was ultimately brought down by him, though not killed. However, Amidala managed to gain access to a hidden weapons cache in the throne room, taking Gunray hostage, Anakin Skywalker managed to land within the Trade Federation flagship, destroying the reactor before escaping, and Kenobi managed to get hold of Jinn's lightsaber and use it to defeat Maul with a timely sai tok maneuver, bisecting the Sith lord at the waist."}, {"tag": "p", "text": "Ultimately, none of these events proved to be setbacks; Palpatine's ultimate goal of gaining the Chancellorship was achieved. Even Maul's apparent death was of little importance; Sidious sent him to Naboo with full knowledge of his eventual fate, thanks to his own precognitive powers. Maul had been a capable apprentice, but he had outlived his usefulness and was ill-suited to the coming tasks."}, {"tag": "p", "text": "Unknown to Sidious and the Jedi, Maul had survived and had been hiding in Lotho Minor for over a decade, succumbing to madness until his brother, Savage Opress, found him and brought him home to Dathomir to be cured."}, {"tag": "p", "text": "In the aftermath of the battle, the Trade Federation leaders were taken to Coruscant for trial, though Sidious's manipulations ensured that they never came to a verdict; relations between the Naboo humans and the native Gungans improved considerably, with the two cooperating on numerous projects and public works; and Anakin Skywalker was accepted for Jedi training, his actions in the battle convincing the Jedi Council that he had the Force on his side."}, {"tag": "h4", "text": "Consolidation"}, {"tag": "p", "text": "Sidious was quick to eliminate any evidence of his involvement in the battle. Republic investigators claimed Maul's ship and equipment, but their bungled efforts to examine them resulted in their self-destruction. After the burned out wreck received a more careful examination by Jedi Master Saesee Tiin, he recommended that it be placed in the care of the Jedi Council. However, representatives from Kuat lobbied for the opportunity to study it, and the ship disappeared on its way to a Kuat facility."}, {"tag": "p", "text": "With these loose ends tied up, Sidious set about laying the foundations for the coming Clone Wars, and enacting several other minor schemes to whittle away the Jedi ranks little by little. Moving into the Chancellor's Suite in the Republic Executive Building, Palpatine redecorated the office to suit his own tastes, hiding many priceless Sith artifacts in plain sight, as many were too obscure to be recognized."}, {"tag": "p", "text": "Also, Palpatine required a personal detachment of body guards, but he could not be seen actively creating one. So he instead created a situation where they were apparently forced on him. While speaking with his unwitting pawn; Ronhar Kim; he had several members of his Senate Guard detachment attempt to assassinate him. Kim fended them off, and the survivors committed suicide on the spot. However, the damage was done, and the Red Guard was created."}, {"tag": "p", "text": "When his first term ended, Palpatine ensured that no opposing candidates rose up while keeping his own image spotless. This would be the last election in the history of the Republic, with a constitutional amendment near the end of his second term allowing him to serve indefinitely."}, {"tag": "h4", "text": "The New Apprentice"}, {"tag": "p", "text": "While Darth Maul was ill-suited for the tasks needed, Palpatine still required an apprentice. However, he could not simply train a new one from infancy as he had done with Maul, as neglecting his political career for his Sith duties could prove disastrous, and Anakin Skywalker was not yet a viable option. He examined several potential candidates, such as the Jedi Vergere and Dooku. After Vergere attempted to assassinate him and fled, Palpatine settled on Dooku."}, {"tag": "p", "text": "Dooku proved best-suited for what Sidious had in mind. A powerful Jedi master and a highly skilled duelist, Dooku was also known as a maverick and a political activist. Having left the Jedi Order in the wake of the Battle of Naboo, Dooku was also a free agent. Sidious approached him, and after long hours of discussion, convinced the ex-Jedi to join him. As a test of Dooku's commitment, Sidious set him after his old friend and colleague from the Jedi, Master Sifo-Dyas. Dyas, anticipating the coming chaos, had contracted the cloners on Kamino to create a clone army. While Sidious planned to seize control of this army, he couldn't allow Dyas to survive. Dooku killed him."}, {"tag": "p", "text": "Dooku was officially brought into the Sith fold, bestowed with the name Darth Tyranus."}, {"tag": "h4", "text": "Instigating The Clone Wars"}, {"tag": "p", "text": "Darth Tyranus subsequently infiltrated the Jedi Archives and erased several star-systems from the maps, most importantly Kamino, stealing information about several hyperspace lanes in the deep core, as well."}, {"tag": "p", "text": "The next thing Darth Sidious needed to settle was whose DNA would be used to produce the new clone army. At the same time, another problem had presented itself, for the Bando Gora cult had returned, and Sidious believed they had enough influence to endanger his plans. Sidious ordered Tyranus to deal with these problems, and Dooku obliged, putting a bounty of five million credits over the leader of the cult, Komari Vosa, and leaving the job to the bounty hunter to finish her off. Dooku also planned to ask the successful bounty hunter to be the model for the new clone army, knowing that several powerful mercenaries would seek to achieve the considerable bounty. Jango Fett, a Mandalorian bounty hunter, was able to defeat Komari Vosa at the moon Kohlma and was going to spare her life when Dooku appeared and killed her himself. Dooku then told Jango Fett that he wanted him to be the basis for the clone army."}, {"tag": "p", "text": "At a later meeting, Dooku tried to make Jango speak more about his past. The bounty hunter, not trusting Dooku because he was once a Jedi, tried to increase his payment by infecting the Sith Lord with a biological weapon. Dooku pretended to be defeated, but convinced Jango to tell the rest of his story. After Fett finished, Dooku healed himself with the force, eliminating Jango's advantage. Jango finally submitted, allowing himself to be cloned on the condition of having an unaltered clone to be his son."}, {"tag": "p", "text": "Later, Dooku supported Kh'aris Fenn when he tried to take power on planet Ryloth. He did this believing that under Kh'aris, Ryloth would secede from the Republic when the Clone Wars began. In order to gain leverage, Fenn kidnapped Nat Secura, son of Lon Secura, who was Kh'aris's enemy. A Jedi Master named Tholme attempted to rescue Nat, but was captured himself, and was only spared because Dooku believed he could use Tholme at a later date. Unfortunately for Dooku, two more Jedi arrived, Quinlan Vos and Aayla Secura, and they managed to rescue Nat and stop Kh'aris Fenn from gaining control of Ryloth. Although Dooku's plans failed, the Jedi had absolutely no clue he was involved."}, {"tag": "p", "text": "Dooku also assisted the Trade Federation when they tried to eliminate the army that served the Wookiee Trade Guild, since the Guild refused to pay taxes to the Federation. Because no Wookiees survived the battle, Dooku's involvement was unknown to the Jedi."}, {"tag": "p", "text": "Dooku and his master continued to plot the war against the Republic, and decided to use the Trade Federation and other corporations in order to make a large enough rift in the galaxy. Darth Sidious decided that the general to be behind the Separatist army should be the Kaleesh warrior Grievous, and sent Dooku to retrieve him."}, {"tag": "h5", "text": "Creating the Confederacy and Stirring the Senate"}, {"tag": "p", "text": "Dooku spoke to San Hill of the InterGalactic Banking Clan, for he knew that Grievous was last hired by them. Together they made a plan to cripple the commander and rebuild him as a cyborg. An ion bomb was planted on Grievous's shuttle, and his seat rigged so that when the bomb went off, the Kaleesh would be ejected."}, {"tag": "p", "text": "After the craft crashed, Dooku found a gravely injured Grievous and transported him to Geonosis. There, the Kaleeshan was made into a cyborg that would be perfect for the Clone Wars, with the combined power of his tactical genius."}, {"tag": "p", "text": "The Sith were very happy with the new Grievous, and only more so after Dooku trained him to be an expert lightsaber duelist. The droid armies now had a general, a position that Dooku did not want for himself."}, {"tag": "p", "text": "Dooku then commandeered a communications station and delivered a speech that greatly criticized the Republic. He then asked several systems to secede from the government, and to join his Separatist Movement. Some planets did indeed listen to his speech, and in some cases they built up private armies against the Republic, though it had not yet reached open war."}, {"tag": "p", "text": "Because of this, Darth Sidious, as Chancellor Palpatine, was allowed to keep his position, which canceled the next election. He then offered to make a fake peaceful meeting with Dooku, but it had been planned beforehand by the Sith. Dooku did not reply, which made the Separatists look like they could not be bargained with."}, {"tag": "p", "text": "Palpatine then tried to make an army for the Republic, and set out to get the Military Creation Act approved. He used a number of debates and even assassinations to show the inadequacy of the Jedi and the need for an army, although he publicly looked as if he had taken no side on the issue."}, {"tag": "h4", "text": "The Clone Wars Begin"}, {"tag": "p", "text": "Although everything was prepared for the Clone Wars, Dooku had run into a few complications. The Fondor Shipyards were critical to the Sith's plans, but three conspirators, Groodo, Rodd, and Hurlo Holowan sought to destroy them. Dooku managed to stop them by once again hiring Jango Fett, and after the trio was brought to him, they agreed to work for the Sith Lord."}, {"tag": "p", "text": "Count Dooku then recruited scientist Jenna Zan Arbor to the Separatist cause, and she became one of the leading scientists for the CIS."}, {"tag": "p", "text": "Dooku then tried to bolster the Separatists by trying to make the planet Ansion secede from the Republic, for it was the basis of several minor alliances, including the Malarian Alliance. If Ansion left the Republic, other systems would follow suit. Dooku left this to be done by Commerce Guild Shu Mai, who gave a considerable amount of support to Ansion's government, The Unity of Community, making it consider joining the Separatist. The plan failed due to the intervention of Jedi Obi-Wan Kenobi and Luminara Unduli, as well as their Padawans Anakin Skywalker and Barriss Offee. Dooku later explained to Shu Mai that the secession of Ansion was not necessary to the Confederacy's success."}, {"tag": "p", "text": "Although Darth Tyranus had gathered a large number of allies around him, he had only a pledge of support from the Trade Federation. Viceroy Gunray demanded the assassination on Senator Amidala as recompense for his defeat at her hands on Naboo before he would commit his droid armies to the Separatist cause. Dooku gave the order to Jango Fett who, in turn, collaborated with former ally Zam Wesell. After failing to kill the Senator upon her arrival on the Republic capital, she tried again by sending a remote droid with two lethally toxic insects to Amidala's apartment. This plan was foiled by the Senator's newly appointed Jedi protectors: Obi-Wan Kenobi and Anakin Skywalker. After chasing Wesell across the city, they eventually cornered her in a bar and she lost her arm to Obi-Wan's lightsaber. During her interrogation, just as she was about to reveal Jango's involvement, she was killed by a toxic dart fired (unbeknownst to the Jedi) by Fett himself."}, {"tag": "p", "text": "The Jedi Council then assigned Anakin to escort the Senator home to Naboo - his first solo assignment - whilst Obi-Wan was to discover the nature of the threat to Padmé's life. Obi-Wan searched through the Jedi archives for information on the toxic dart, but was forced to seek advice from an old acquaintance. This friend identified the weapon as a Kamino saberdart, used by the cloners of the planet Kamino. Obi-Wan returned to the archives and searched for the planet but was unable to find it, earning him a rather harsh rebuke from the archivist when he theorized that the archives were \"incomplete\". Finally seeking insight from Master Yoda, Obi-Wan discovered that the planetary data had been erased from the archives - a cause of great concern to both himself and Yoda."}, {"tag": "p", "text": "Traveling \"to the center of gravity's pull\" as advised by Yoda, Obi-Wan found Kamino exactly where it should have been. After landing, he was escorted to the Prime Minister who proudly displayed the 100,000 strong Clone Army and promised that a million extra troops were almost ready for deployment. After reporting this information back to the Council, Obi-Wan was order to return Fett to them for questioning. While attempting to capture the bounty hunter, he was forced to place a tracking device on the hull of Slave 1."}, {"tag": "p", "text": "Jango fled Kamino to Geonosis, where a meeting between Dooku and all of the Separatist leaders was taking place. They were finally forming the Confederacy of Independent Systems, a government that would stand against the Republic. This would be made up an alliance between the Corporate Alliance, Geonosian Industries, the Commerce Guild, the Techno Union, the InterGalactic Banking Clan, and the Trade Federation. Obi-Wan had pursued Fett to Geonosis, and witnessed the meeting. He then attempted to contact the Jedi Council, but was captured by the Geonosians, and was imprisoned in a containment field, which kept him totally incapacitated."}, {"tag": "p", "text": "The Senate had indeed received Obi-Wan's message, but Palpatine planned to use it for his own purposes. He showed the message to the Jedi, who agreed he should be given emergency powers. Representative Jar Jar Binks then volunteered to speak his mind to the senate, and his speech to the many senators was shocking, for they had believed him to be a total buffoon. The majority of the Senate instantly agreed with the Representative, and the power to make a military was finally given to Darth Sidious."}, {"tag": "h5", "text": "Arena Bloodbath"}, {"tag": "p", "text": "Chancellor Palpatine finally enlisted the Clones to be the Grand Army of the Republic. Jedi Master Yoda himself went to retrieve the clones, while a Jedi taskforce was sent to rescue Obi-Wan Kenobi."}, {"tag": "p", "text": "At the same time, Count Dooku decided to interrogate Kenobi himself. Dooku used Drain Knowledge on the captive Jedi, searching for areas for him to be turned to the Dark Side. The Sith Lord attempted to turn Obi-Wan by saying the Republic was corrupt and that Kenobi's old master, Qui-Gon Jinn would have joined him if he was still alive. Kenobi denied him, and said that Dooku was a traitor. Darth Tyranus finally gave up, and left the Jedi in his cell."}, {"tag": "p", "text": "Anakin Skywalker and Padmé Amidala arrived in an effort to rescue Obi-Wan, but were then captured themselves. Count Dooku offered the senator freedom if she supported the Separatists, but she refused. The two Jedi and Amidala were then sentenced to death in the arena."}, {"tag": "p", "text": "The Petranaki arena was packed with Geonosian spectators, and Count Dooku Jango Fett, and other Separatist leaders watched from a high balcony. Three monsters, an acklay, a reek, and a nexu were released to devour the victims."}, {"tag": "p", "text": "Finally, the Jedi Geonosis strike team arrived. Jedi Master Mace Windu confronted Darth Tyranus, but was chased off by Jango, who fought down in the arena."}, {"tag": "p", "text": "Dooku was not surprised by the Jedis' ambush, and revealed that the captives he had were just bait for a trap. 10,000 battledroids were waiting for the attack, including a large number of Geonosian warriors. The new Separatist Droid Army quickly overwhelmed the Jedi, and many of them would die while Lord Tyranus watched from the balcony."}, {"tag": "h5", "text": "The Clones Attack"}, {"tag": "p", "text": "Count Dooku did not join the battle, but Jedi master Coleman Trebor attempted to challenge the Sith Lord. He was unable to actually engage Dooku, for Jango managed to kill the Jedi before a duel commenced. After the Jedi had taken significant losses, Darth Tyranus ordered his droids to cease fire. He then asked Mace Windu to surrender, which was refused."}, {"tag": "p", "text": "Suddenly master Yoda arrived with the Clone Army in tow. The Jedi had taken control of the clones, without knowing that was exactly what Darth Sidious had wanted. The battle droids attacked again, but the reinforcements allowed the Jedi to escape from the arena."}, {"tag": "p", "text": "Outside of the arena, an even larger force of clones was engaging the Separatist army. The Battle of Geonosis was heavily tipped to the side of the Republic, and the Separatists were in full retreat. The Confederacy's leaders regrouped at the Geonosian command center, and decided to abandon the planet. Tyranus pretended he knew nothing of the Clone Army, and Poggle the Lesser ordered his Geonosian warriors to hide underneath the Stalgasin hive, but not before handing the plans to the DS-1 Orbital Battle Station to his master."}, {"tag": "p", "text": "Dooku was now free to leave the planet, and retreated to his hangar, where he prepared his solar sailor. He was then attacked by the Jedi Obi-Wan Kenobi and Anakin Skywalker, but managed to defeat both of them. Before he was able to either kill them or to fly away, a last Jedi confronted him…Yoda."}, {"tag": "p", "text": "Although Dooku used both his Force abilities and his dueling skills, he was unable to do more than hold off the Jedi Grandmaster's onslaught. In an attempt to distract Yoda, he tipped a massive column with the force, which fell towards Kenobi and Skywalker, who were still unable to move. Yoda broke off the battle to save the two, allowing the Sith Lord to escape in his Solar Sailor."}, {"tag": "p", "text": "Darth Tyranus then arrived on Coruscant, where he met with Darth Sidious himself at the Works. Dooku informed Palpatine that the Clone Wars had begun, and gave his master the Death Star plans to the DS-1 Orbital Battle Station."}, {"tag": "h4", "text": "Early Conflicts in the Clone Wars"}, {"tag": "p", "text": "After reporting to his master, Dooku traveled to his secret base on Bakura, hoping to regroup the Separatist forces. Unfortunately for him, this move was expected by Jedi Tholme and Sora Bulq. The pair confronted Dooku, hoping to defeat a Sith still tired from the attack on Geonosis."}, {"tag": "p", "text": "The trio began a vicious duel, in which Dooku used force lightning to defeat Bulq. He then attempted to bring Tholme over to the dark side, but the Jedi refused. Dooku then brought down the roof on Tholme, presuming him dead. The Sith Lord then left with the unconscious body of Sora."}, {"tag": "p", "text": "Dooku healed Bulq and persuaded him to turn to the Dark side of the force, becoming one of the first Dark Acolytes. Sora returned to Tholme and rescued him from the rubble. Both of them returned to Coruscant, allowing the Sith to have a spy within the Jedi order."}, {"tag": "p", "text": "Because of the Clone Wars, Palpatine was able to consolidate his power as Chancellor. Several amendments were made to the constitution that handed more power to Palpatine, including Statute 312b, which gave more weight to votes cast by Core and Inner Rim worlds, who were more dependable on supporting the Chancellor than those of Rim Worlds."}, {"tag": "p", "text": "Dooku had also begun the excavation of the Force Harvester on Raxus Prime, so he could recreate the Sith weapon the Dark Reaper. While on Raxus Prime, Dooku put a live bounty on Jango Fett's son Boba, who had escaped during the Battle of Geonosis. The bounty hunter Aurra Sing captured Fett and brought him to Dooku, who held him on Raxus Prime so that the Sith lord could find out how much Boba knew about his Sith identity."}, {"tag": "p", "text": "Fett ignored Dooku's instructions and instead investigated the excavation. Dooku became irritated at Boba's actions, and ordered the boy to be killed. But due to a sudden Jedi attack on Raxus Prime, Dooku left his new bodyguard Cydon Prax to kill Fett. Boba evaded Dooku's enforcers and escaped."}, {"tag": "p", "text": "During the Conquest of Raxus Prime, Dooku and Cydon Prax found the Force Harvester just as a Clone Army, led by Jedi Obi-Wan Kenobi and Anakin Skywalker, arrived to attack the Separatists. As the Clones overwhelmed the Separatists, Dooku and Prax boarded a cruiser with the Harvester on board, but Skywalker spotted them and boarded the cruiser. Dooku and Skywalker dueled in the cargo bay of the cruiser, but Prax ended it by shooting Skywalker with a tranquilizer dart."}, {"tag": "p", "text": "Dooku imprisoned Anakin on Alaris Prime, one of Kashyyyks moons. Dooku was going to test the harvester there, but Skywalker escaped and free the Wookiees, causing the Battle of Alaris Prime. Dooku fled the moon, taking the harvester with him. The Sith lord used the harvester to drain the life-force from inhabitants of Agamar, Bakura and Mon Calamari before retreating to Thule to prepare the rest of the Dark Reaper for use."}, {"tag": "h5", "text": "Battle of Thule"}, {"tag": "p", "text": "The Jedi attacked Thule to destroy the Dark Reaper, which Dooku soon tried using on the Republic forces. But Skywalker broke through the Separatist lines to reach the weapon, killing Prax in the process. Skywalker had learned from a hologram of Jedi Ulic Qel-Droma of how to resist the effects of the Dark Reaper, so he was able to destroy the weapon and its harvester. Dooku fled, and later made a public statement that Raxus Prime and other worlds were only temporary bases, while the important Separatist planets were secure."}, {"tag": "p", "text": "Dooku later ordered his Dark Acolyte Sevrance Tann to capture the Republic world Sarapin. She did, but the Republic soon took it back during the Battle of Krant, killing Tann."}, {"tag": "p", "text": "Two months after the Battle of Geonosis, Dooku traveled to The Cauldron, a gladiatorial arena on Rattatak. He was greeted by his host and taken to watch the contest. He soon realized that Asajj Ventress, a Dathomirian warlord, had assassinated Dooku's guide, seeking to impress the Sith. Dooku complimented her skills, but told the warlord that he was not looking for a spy."}, {"tag": "p", "text": "Ventress then jumped into the arena, killing all of the gladiators. Dooku congratulated her, but then Ventress claimed that she was a Sith. Dooku refuted that statement, and Asajj attacked him in anger. The Sith Lord easily incapacitated her with force lightning before she could reach him."}, {"tag": "p", "text": "Dooku brought the unconscious Ventress to a room on Rattatak, and attacked her when she woke up. They dueled, and Ventress was so skilled that so proved difficult for Dooku to defeat, but he managed to disarm her and destroy her lightsabers. But Dooku did not kill Asajj, and instead introduced her to his master, Darth Sidious, who sent her on a mission to find and kill Anakin Skywalker."}, {"tag": "p", "text": "Tyranus believed that Ventress would defeat Skywalker, but Sidious said that the outcome did not matter. Ventress did not succeed in killing Skywalker, but she continued to serve Dooku as a dark acolyte and commander."}, {"tag": "h5", "text": "The First Battle of Kamino"}, {"tag": "p", "text": "The two Sith lords soon developed a plan that would leave the Confederacy and the Republic locked in conflict. Commander Merai, a Mon Calamari and one of the Confederacy's best tacticians, planned the First Battle of Kamino to wipe out the Republic's cloning facilities. The Jedi Knight Aayla Secura discovered the planned attack, and warned the Republic, but when Dooku's agent Tookarti warned the Sith, Dooku said it did not matter."}, {"tag": "p", "text": "The battle went exactly as planned. The Republic ambushed the Confederacy's ships, and Merai was killed while his fleet routed. Dooku regretted Merai's death, but Sidious was pleased with how the battle had ended any quick ending to the war. Losses on both sides maintained the balance between the Republic and CIS."}, {"tag": "p", "text": "Dooku was prevented by the Rule of Two from having a Sith apprentice, but he still made his own group of Dark Acolytes. These included Asajj Ventress and Sora Bulq, and then Tol Skorr, Kadrian Sey, Trenox and Saato. He did train them, but taught them little of Sith teachings."}, {"tag": "p", "text": "Dooku also enlisted the Gen'Dai mercenary Durge to aide the Separatists, and used Sora Bulq to create strife in the Jedi Order. Bulq tried to convince some Jedi to join the Confederacy, but this was foiled by Mace Windu, who revealed Sora as a traitor."}, {"tag": "h4", "text": "Sidious' triumph"}, {"tag": "p", "text": "In 20 BBY, Darth Maul returned to the Known Galaxy, having survived his injuries on Naboo. He took his brother, Savage Opress, as an apprentice, and together they attempted to conquer Mandalore with the aid of the Death Watch. They came to the attention of Darth Sidious, who murdered Opress and imprisoned Maul for his own ends."}, {"tag": "p", "text": "In 19 BBY, with the Clone Wars approaching their conclusion and the Separatists besieged in the Outer Rim Territories, Darth Sidious was ready to make his final move. At the Battle of Coruscant, he betrayed Tyranus and goaded Anakin Skywalker into killing him, driving Anakin closer to the dark side. Separated from his master, Obi-Wan Kenobi, Anakin leaned heavily on the advice of Sidious' persona of Supreme Chancellor Palpatine, and was slowly convinced that turning to the dark side of the Force was the only way he could save his wife, Padmé Amidala, from death in childbirth. Proclaimed Darth Vader by Sidious, Anakin became his new apprentice, murdering much of the Jedi on Coruscant before assassinating the Separatist Council on Mustafar, ending the Clone Wars. Capitalizing on the threat of a \"Jedi rebellion\" and his emergency powers as Supreme Chancellor, Sidious dissolved the Republic and proclaimed a Galactic Empire, and was acclaimed as Emperor by the Galactic Senate. The Sith ruled the galaxy once more, from the Core Worlds to Wild Space."}, {"tag": "p", "text": "From 19 to 1 BBY, Darth Sidious eradicated most of the Jedi in the Great Jedi Purge, driving the few survivors, like Obi-Wan Kenobi and Yoda, into hiding. The galaxy was Imperialized and the Galactic Empire conducted numerous atrocities to solidify its rule. It was not until 2 BBY that an alliance of rebels and dissidents emerged to challenge the Galactic Empire, beginning the Galactic Civil War. In 0 BBY, on Tatooine, Obi-Wan Kenobi successfully convinced Darth Vader's son Luke Skywalker, whom Vader had thought dead with his wife, to train as a Jedi Knight and help overthrow the Empire. Luke was responsible for the destruction of the Death Star battlestation at the Battle of Yavin, dealing a stunning blow to the Empire but bringing the survival of Anakin Skywalker's children to the Sith's attention."}, {"tag": "h3", "text": "The end of the Banite Sith"}, {"tag": "p", "text": "Sidious plotted to turn Luke Skywalker to the dark side and replace Vader. Having learned of his parentage, Luke was determined to turn his father back to the light side of the Force. Allowing himself to be taken prisoner, Luke was brought before Sidious aboard the Empire's Second Death Star, where he engaged Vader in a ferocious duel while imploring him to turn back the light side. Enraged by Luke's refusal to turn to the dark side, Sidious attempted to murder him with Force lightning, but the sight of his son being tortured to death was enough to convince Vader to turn against his Sith master. Anakin Skywalker hurled Sidious down the Death Star's reactor shaft but suffered mortal injuries in the process. At the same time, the Alliance to Restore the Republic attacked and destroyed the Second Death Star at the Battle of Endor, dealing to the Galactic Empire a blow from which it would never recover. Luke escaped the Death Star with his father's body. Anakin's death and redemption and the death of Darth Sidious marked the presumed extinction of the Sith Order, thus fulfilling the Ancient Jedi Prophecy of the Chosen One."}, {"tag": "p", "text": "With its Emperor gone, Sidious' empire collapsed into warlordism and the Alliance proclaimed a New Republic. Sidious' spirit survived, however, and it made an agonizing journey to the Imperial redoubt of Byss in the Deep Core. Reborn in a cloned body, Sidious attempted to restore the Galactic Empire in 10 ABY with a massive military campaign launched out of the Deep Core. Sidious planned to establish a \"Dark Empire\", an avowedly-Sith magocracy governed and run by the Force influence of his Dark Side Elite. However, Sidious' clone bodies were poisoned by Carnor Jax, who hoped to proclaim himself Emperor in Sidious' place, and the dying Sith Lord desperately sought a healthy new vessel for his spirit. At the Battle of Onderon in 11 ABY, Sidious attempted to possess the infant Anakin Solo. However, he was shot in the back by Han Solo and his spirit was dragged into the Netherworld of the Force by the mortally-wounded Jedi Empatojayos Brand, ensuring that he could never be resurrected and destroying what little remained of Darth Bane's Sith."}, {"tag": "h3", "text": "Later history"}, {"tag": "h2", "text": "Organizations"}, {"tag": "p", "text": "The term Sith referred to numerous disparate dark side organizations that rose and fell over thousands of years of galactic history. No single entity long survived the vigilance of the Jedi Knights, but even in defeat the ancient Sith teachings proved difficult to suppress. Each time the Jedi Order grew complacent, a Sith cult, brotherhood, order, or empire would arise from the ashes to threaten the galaxy once more. New iterations of the Sith would be linked only tenuously to past traditions through a shared ideology."}, {"tag": "p", "text": "Sith (species)"}, {"tag": "p", "text": "The Sith were a species of red-skinned humanoids native to Ziost and Korriban that were enslaved by exiled Dark Jedi. Prior to their discovery, the Sith were divided into a meek and lowly slave class, a skilled and intelligent engineer class, and the warlike Massassi class. Over time, the Sith interbred with the Human Dark Jedi through the practice of Sith alchemy, and the two peoples became one."}, {"tag": "p", "text": "Massassi"}, {"tag": "p", "text": "The Massassi were a Sith subspecies. Under the rule of the exiled Dark Jedi, many Massassi captives were subject to Sith Alchemy, which resulted in them being more deadly and easier for their Sith masters to control. They were distinguished by bone spurs which erupted from their skin and by their abnormally giant size. They would serve as soldiers for the Sith Empire."}, {"tag": "p", "text": "Sith Empire"}, {"tag": "p", "text": "The Sith Empire was a rich and powerful empire that was established by Dark Jedi banished from the Galactic Republic after their defeat at the Battle of Corbos during the Hundred-Year Darkness. After developing in complete isolation for thousands of years, the Sith eventually rediscovered the Republic. The Dark Lord of the Sith Naga Sadow led the Empire in an invasion during the Great Hyperspace War, but he was defeated. The Sith Empire was believed to have been utterly destroyed by Republic forces in the aftermath of the second battle of Korriban. However, one Dark Lord to escaped in the Unknown Regions with a group of dark-siders and rebuilt the Empire. Using the dark secrets he managed to survive for many centuries and eventually attacked the Republic. After a Great Galactic War that lasted for many decades, the Sith and the Republic signed a treaty and from that moment existed as two separate governments."}, {"tag": "p", "text": "Lost Tribe of Sith"}, {"tag": "p", "text": "In 5000 BBY, a Sith starship, the Omen, crashed-landed on the planet of Kesh. The survivors of the crash eventually formed the Lost Tribe. Over thousands of years, this Lost Tribe had multiplied into a substantial force, and shortly after the Second Galactic Civil War they were ready to fulfill their destiny, and take on a weakened galaxy."}, {"tag": "p", "text": "Sith Empire"}, {"tag": "p", "text": "This Sith Empire was an obscure order of adherents to the dark side of the Force, who survived the\nGreat Hyperspace War and the eventual collapse of the Sith Empire. Darth Traya told the Meetra Surik that the order had been in existence for tens of thousands of years and were silently waiting in the Unknown Regions during the time of the Jedi Civil War."}, {"tag": "p", "text": "According to Darth Traya, a Sith Empire had existed for millennia prior to the rise of the ancient Sith Empire. She and Revan believed that it was they who had goaded the Mandalorians into attacking the Galactic Republic, starting the Mandalorian Wars. Kreia stated that both Malachor V and the graveyard planet, Korriban, had once been planets at the edges of that mysterious Empire, and that while these Sith had forgotten those ancient worlds of the dark side, they would remember. And they did remember. Under the leadership of their Sith Emperor, they restored the Sith Empire and invaded the Republic."}, {"tag": "p", "text": "Brotherhood of the Sith"}, {"tag": "p", "text": "The Brotherhood of the Sith was a group of Dark Jedi founded by Exar Kun who broke away from the Jedi Order to study Sith techniques. During the Great Sith War, the Brotherhood attempted to conquer the Republic with the aid of the Krath and the Mandalorian Crusaders. The Brotherhood was defeated and virtually exterminated during the Battle of Yavin 4."}, {"tag": "p", "text": "Krath"}, {"tag": "p", "text": "The Krath was a Sith secret society founded by Aleema and Satal Keto, the bored heirs to the Empress Teta system. Following a Krath attack on a Jedi conclave, Ulic Qel-Droma attempted to infiltrate the group, but he failed. He was seduced to the dark side and eventually became the leader of the sect. During the Great Sith War, the Krath became the military arm of Exar Kun's Sith Order and fell with it on Yavin 4."}, {"tag": "p", "text": "Darth Revan's Sith Empire"}, {"tag": "p", "text": "The Sith Empire was temporarily resurrected by the fallen Jedi Revan and Malak. Built upon a hardened core of veterans from the Mandalorian Wars and a host of Jedi converts, the fledgling new galactic power very nearly succeeded in conquering the Republic during the Jedi Civil War. After the redemption of Darth Revan and the death of Darth Malak, their Empire splintered into factions and eventually collapsed."}, {"tag": "p", "text": "Sith Triumvirate"}, {"tag": "p", "text": "The Sith Triumvirate was a brief but deadly Sith Order founded by the former Jedi Kreia, now known as Darth Traya, she took two apprentices of unknown origins and trained many new Sith at the Trayus Academy on Malachor V. After her exile from the Triumvirate the two remaining Sith Lords; Darth Nihilus, and Darth Sion executed the First Jedi Purge. The Sith Triumvirate was a loose alliance of what remained of Darth Revan's Sith Empire. It was solidified sometime after the Battle of Rakata Prime. This organization comprised several, if not hundreds of Sith apprentices, Sith Masters and most importantly, Sith Assassins. The members were eventually defeated by Meetra Surik."}, {"tag": "p", "text": "New Sith Empire"}, {"tag": "p", "text": "The New Sith Empire was founded by Darth Ruin, and was the vast area of galactic territory formed out of the Fourth Great Schism, which the Sith ruled over with an iron fist. Its capital was the planet Roon. At its height during the New Sith Wars, it was almost as good as the old Sith Empires of Naga Sadow and Darth Revan; following the Battle of Mizra and during the Republic Dark Age, it encompassed a great percentage of the known Galaxy."}, {"tag": "p", "text": "Sometime between 1010 and 1006 BBY the New Sith Empire collapsed in a civil war. From the ashes, Skere Kaan established the Brotherhood of Darkness."}, {"tag": "p", "text": "Brotherhood of Darkness"}, {"tag": "p", "text": "Founded by Lord Kaan, the Brotherhood of Darkness (sometimes referred to as the Dark Army) was the last mass gathering of the Sith for nearly 1200 years. An army of over twenty thousand Sith Lords and their followers, its destruction on Ruusan heralded the beginning of a new order."}, {"tag": "p", "text": "Order of the Sith Lords"}, {"tag": "p", "text": "Under the last surviving Sith Lord of that army, Darth Bane, a new Sith Order was created as a result of the devastating Seventh Battle of Ruusan, which saw the annihilation of the previous Sith Order. Bane's Sith Order, known formally as the Order of the Sith Lords, was founded upon the principles of Darth Revan's Holocron, where from he formed the Rule of Two, utilizing stealth tactics and treachery to achieve their means. The Rule of Two would allow his eventual successor, Darth Sidious, to finally triumph over the Jedi and the Galactic Republic nearly 1,000 years later."}, {"tag": "p", "text": "Disciples of Ragnos"}, {"tag": "p", "text": "The Disciples of Ragnos was a Sith Cult under the leadership of Tavion Axmis, who sought to resurrect the spirit of Marka Ragnos through ancient Sith sorcery and take control of the galaxy. The cult was closely related to the Empire Reborn movement of which Tavion had herself been part with the Dark Jedi Desann. The cult was ultimately defeated by Jaden Korr and the New Jedi Order."}, {"tag": "p", "text": "Lumiya's Sith"}, {"tag": "p", "text": "Lumiya's Sith were a loosely collected group of individuals associated with Lumiya, self-proclaimed Dark Lady of the Sith after the final death of Darth Sidious. Even with Palpatine's final death, the Sith continued to survive. Their next Sith Lord was an Emperor's Hand named Lumiya. Darth Vader had passed on to Lumiya some Sith teaching secretly from his master, and the woman adopted the title \"Dark Lady of the Sith\" upon her master's death at Endor. She trained two apprentices: Flint, who was redeemed by Vader's son Luke Skywalker, and Carnor Jax, who was killed by Palpatine loyalist Kir Kanos."}, {"tag": "p", "text": "Soon afterwards she succeeded in convincing Vader's grandson Jacen Solo to join the ranks of the Sith, thus calling himself Darth Caedus. Darth Caedus later corrupted the Jedi Tahiri Veila and took her as his apprentice. However, following the death of Caedus and the redemption of his apprentice, the war Lumiya had started was over; and Lumiya's Sith had perished."}, {"tag": "p", "text": "One Sith"}, {"tag": "p", "text": "By the year 130 ABY, a new Sith Order had risen to take the place of Darth Bane's order. A Sith known as Darth Krayt began the order on Korriban, the ancient Sith burial world, around\n30 ABY after studying the teachings of XoXaan. In this new Sith cult, many of the followers sported a red-and-black tattooed appearance and used lightsabers with an yorik coral-styled hilt design. This Sith Order was considered heretical by some Sith of the past such as Darth Bane, who disapproved of the training of larger numbers of Sith. Krayt spent over a century growing and strengthening the new order, planning to unify the galaxy once more under Sith rule. He and his new order made their presence known around 127-130 ABY by initiating the Sith–Imperial War, and then launching an attack on the Jedi on Ossus. In 138 ABY Darth Krayt fell and Darth Nihl claimed control of the Order, sending the One Sith into hiding. The One Sith, however, would end up wiped out by Darth Wredd, a believer in the Rule of Two. This action also led to the presumed extinction of the Sith Order as a whole with Wredd's death and failure to procure an apprentice shortly afterward."}, {"tag": "h2", "text": "Ranks"}, {"tag": "p", "text": "The Sith had a clearly defined hierarchy which divided the strong from the weak, but because the Sith order existed in numerous disparate incarnations, the Sith hierarchy did not maintain a single continuous ranking system throughout its history. The Sith hierarchy remained much the same for almost 6,000 years - through the ancient Sith Empire, Exar Kun's Brotherhood of the Sith, and Darth Revan's Sith Empire - until Lord Kaan declared that all of his highest ranking followers in the Brotherhood of Darkness were Dark Lords of the Sith. Like the Jedi and the Old Republic, the Sith underwent a great reformation after the apocalyptic final Battle of Ruusan. The Sith order's destruction inspired Darth Bane to reform the order and decree that there would be only two Sith at a time from that point forward: a Master and an apprentice. Both would bear the title \"Dark Lord of the Sith,\" which would become synonymous with the term \"Sith Lord.\""}, {"tag": "h3", "text": "Sith Empire"}, {"tag": "p", "text": "These were the ranks of the Sith Order before Darth Bane instituted the Rule of Two."}, {"tag": "p", "text": "Dark Lord of the Sith"}, {"tag": "p", "text": "Dark Lords of the Sith were the greatest and most powerful of the Sith Lords. Up until the reign of Kaan, it was a title that was only given to those that were acknowledged as the leaders of their order, but by the end of the New Sith Wars the title was held by many Sith Lords simultaneously."}, {"tag": "p", "text": "Sith Lord"}, {"tag": "p", "text": "Sith Lords were the leaders of the Sith. They commanded armies of Sith Minions, Acolytes and Warriors during wartime and ruled through a governing body known as the Sith Council. Sith Lords used the dark side of the Force to inflict misery, suffering, and corruption. They were also tasked with preserving the lore of the Sith by passing all their knowledge on to their acolytes. While they did not enter combat as often as lesser Sith (preferring to use pawns, servants, or proxies), they were the most fearsome of the Sith as they were the keepers of the Sith's greatest secrets and wielders of its most potent sorceries."}, {"tag": "p", "text": "Sith Marauder"}, {"tag": "p", "text": "Sith Marauders, a variant of the Sith Warriors, were often responsible for the most brutal acts carried out by the Sith. Their training emphasized the aggressive use of a lightsaber rather than the Force. A Sith Marauder's berserk physical prowess was a dark side technique fueled by hatred, rage, and cruelty. Thus, most Marauders could duel an average Jedi toe-to-toe and win easily. Caring little for the subtleties of manipulating others and lacking a deep understanding of the Force, Marauders were often burdened with carrying out the wishes of the Sith Lords."}, {"tag": "p", "text": "Sith Warrior"}, {"tag": "p", "text": "Sith Warrior was a rank of the Sith order before Darth Bane's reform of the Sith Order. They were mid-ranking Sith who generally focused their energies and skills towards battle, spending little time on actual dark side philosophy or other concerns of the \"purer\" Sith."}, {"tag": "p", "text": "Sith Acolyte"}, {"tag": "p", "text": "Sith Acolyte were Force-sensitive apprentices who had only just started down the dark path under the tutelage of a more experienced Sith."}, {"tag": "p", "text": "Sith adept"}, {"tag": "p", "text": "Sith Adept was a Sith rank during the New Sith Wars, similar to Sith acolyte. The Brotherhood of Darkness trained them in the Dathomir Academy and Iridonia Academy."}, {"tag": "p", "text": "Sith assassin"}, {"tag": "p", "text": "Specialized Sith minions included Sith assassins, who preferred to ambush targets from the shadows rather than engaging them in standard combat. Almost always working solo or in small groups, they utilized stealth field generators and the rare art of Force camouflage to launch surprise attacks on their Jedi victims. While some used a lightsaber, most fought with more conventional melee weapons such as force pikes. Darth Traya, Darth Sion, and Darth Nihilus commanded legions of Sith Assassins during the aftermath of the Jedi Civil War, causing the near-extermination of the Jedi Order. The Sith Assassins drew their powers from the Force power of their enemies."}, {"tag": "p", "text": "Sith Minion"}, {"tag": "p", "text": "Sith Minions were the lowliest members of the Sith. Some were not even Force-sensitive, and often worshiped the Sith Lords as gods. Sith Cultists, Sith assassins and Sith Marauders can be considered examples of Sith Minions. However, the Sith also used soldiers, mercenaries, and conscripts to work for them."}, {"tag": "h3", "text": "Post-Bane"}, {"tag": "p", "text": "To ensure the continued survival of the Sith, Bane was forced to put them on the brink of extinction. He instituted the Rule of Two. In Bane's order, both Sith held the title Dark Lord of the Sith. The rule of the two instituted that a master train an apprentice. Once the apprentice was fully trained, he would kill the master and take on the mantle himself and repeat the process. The death of the master is either a ceremonial killing or an assassination."}, {"tag": "p", "text": "Sith Master"}, {"tag": "p", "text": "Sith Masters were Sith Lords that had an apprentice serving beneath them. Other than Bane, notable Sith Masters include Darth Zannah, Darth Cognus, Darth Plagueis and his successor; Darth Sidious."}, {"tag": "p", "text": "Sith apprentice"}, {"tag": "p", "text": "Sith apprentices were Sith neophytes that were studying under the tutelage of a Sith Master. Notable Sith apprentices include Darth Millennial, Darth Maul, Darth Tyranus and Darth Vader."}, {"tag": "p", "text": "Dark Side Adepts"}, {"tag": "p", "text": "Dark Side Adepts were not technically Sith. These Force-sensitives were chosen and honed by the Sith apprentice. Essentially, adepts were candidates to replace Apprentices when they were killed or ascended to mastery. Notables included Darth Tyranus's Dark Acolytes, whose numbers included Sora Bulq and the infamous Asajj Ventress, and Darth Vader's secret apprentice Galen Marek."}, {"tag": "h3", "text": "Palpatine Era"}, {"tag": "p", "text": "When Palpatine declared himself Galactic Emperor, the Sith controlled the known galaxy, in a political sense, for the first time. With this new, far-reaching authority came a need for functionaries throughout the Empire who were, to one extent or another, supporters if not adherents of the dark side. Though not Sith in any strict sense, these quasi-Sith minions were known generally as Dark Side Adepts. As Force-sensitive individuals serving the Emperor, they supported his Sith rule by working in the roles of servants, agents, intelligence operatives, military officials, etc. Dark Side Adepts were particularly important when Palpatine was reborn into his clone bodies, six years after his death."}, {"tag": "p", "text": "Inquisitorius"}, {"tag": "p", "text": "The Inquisitorius was a secret division of Imperial Intelligence consisting of dark side Force-sensitive agents known as Inquisitors (sometimes also as Inquisitioners), or \"truth officers\"."}, {"tag": "p", "text": "Under the control of Darth Vader, these Inquisitors were considered the highest ranking of the Dark Side Adepts, outranking the Emperor's Hands, Prophets of the Dark Side, and lesser Dark Jedi. They reported directly to Emperor Palpatine."}, {"tag": "p", "text": "Prophets of the Dark Side"}, {"tag": "p", "text": "The Dark Side Prophets were an ancient Outer Rim renegade Sith order founded by Darth Millennial. Darth Sidious rediscovered the group and brought them once again under his control, renaming them the Emperor's Mages."}, {"tag": "p", "text": "Emperor's Hands"}, {"tag": "p", "text": "Emperor's Hands were top-secret special operatives trained in the Force by the Emperor himself. They were so secret they usually had no knowledge of each other. Mara Jade was one of the best-known Emperor's Hands."}, {"tag": "p", "text": "Together with the Emperor's Mages, the Emperor's Hands were called the Dark Side Elite."}, {"tag": "p", "text": "Emperor's Royal Guard"}, {"tag": "p", "text": "These were hand-picked elite stormtroopers assigned to protect and serve the Emperor directly. Force sensitivity was by no means a requirement. Those with advanced talents, however, were assigned as Sovereign Protectors, and those with even more advanced talents underwent Force training under Dark Jedi tutors. The Shadow Guards also possessed dark side training."}, {"tag": "p", "text": "Dark Jedi"}, {"tag": "p", "text": "Although the name might imply otherwise, Dark Jedi were not synonymous with Sith, although Darth Vader among others used techniques drawn from the traditions of both the Dark Jedi and the Sith. Dark Jedi were distinguished from the Sith in the fact that Dark Jedi just used the dark side, whereas the Sith abided by the religion and codes passed down through the holocrons. It was much more likely for Dark Jedi to return to the Light (e.g. Kam Solusar). Other notable Dark Jedi included Joruus C'baoth and Jerec."}, {"tag": "h3", "text": "Legacy Era"}, {"tag": "h4", "text": "Lost Tribe of Sith"}, {"tag": "p", "text": "In 5000 BBY, the Sith warship Omen who had a human crew, member of the Sith Empire, crash landed on Kesh. Spurred on by the ship's captain, Yaru Korsin, the Sith conquered the Keshiri indigenous population and became the undisputed rulers of the uncharted planet. But, the planet isolated and devoided of the materials needed to repair the ship, imprisoned these Sith for nearly five thousand years. Forgotten by the rest of the galaxy and by the Jedi Order, the Lost Tribe members developed their society, growing in number and deepening their knowledge over the dark side.\nAnd when a Sith Meditation Sphere seeking for new masters to serve, arrived on their adoptive homeworld in 41 ABY, they were ready to conquer the galaxy."}, {"tag": "p", "text": "Very many and very organized the Lost Tribe of Sith was a hierarchical society based on merit, not birth, which allowed all Force-sensitive inhabitants of Kesh, Human or Keshiri, climbing the rungs of the prevailing order of the Sith. This order included seven ranks, ranging from apprentice without master to the Supreme Head of the Order: Sith Tyro, Sith apprentice, Sith Saber, Sith Master, Sith Lord, High Lord and Grand Lord."}, {"tag": "p", "text": "Grand Lord"}, {"tag": "p", "text": "Grand Lord was the title of the ruler of the Circle of Lords, the ruling council of the Lost Tribe of Sith in the capital city of Tahv on the planet Kesh. The first Grand Lord was Yaru Korsin, who was appointed to the position in 5000 BBY by Izri Dazh. As of 43 ABY the Grand Lord was Darish Vol."}, {"tag": "p", "text": "High Lord"}, {"tag": "p", "text": "A High Lord was a presiding member on the Circle of Lords. There were seven High Lords on the Circle; they ranked above the thirteen Lords that sat on the Circle, but below the Grand Lord."}, {"tag": "p", "text": "Sith Saber"}, {"tag": "p", "text": "A Sith apprentice was promoted to the rank of Sith Saber after they had completed their formal training under a Master, making the rank equivalent to that of a Jedi Knight. When a member of the Tribe obtained the rank of Saber, they were allowed to customize their robes and acquire possessions."}, {"tag": "p", "text": "Sith Tyro"}, {"tag": "p", "text": "A Sith Tyro was an apprentice of the Lost Tribe, who had not yet been chosen to become a formal Sith apprentice. It can be considered roughly equivalent to the Jedi rank of Initiate."}, {"tag": "h4", "text": "One Sith"}, {"tag": "p", "text": "By the year 130 ABY a new Sith Order had risen to take the place of that of Darth Bane's order. Krayt abolished Darth Bane's Rule of Two. Instead, there would be the Rule of One—that One being the Sith Order itself as directed by the Dark Lord of the Sith, under which there would be many Sith who serve."}, {"tag": "p", "text": "Ruled by Krayt, the new Sith Order flourished and a chance for Galactic domination presented itself. The reverse Vong-forming of worlds was sabotaged and when the galaxy at large blamed and persecuted the Yuuzhan Vong, the GA and Jedi Order were split down the middle. In the midst of the New Galactic Civil War the Fel Empire joined forces with the Legacy Sith and brought the galaxy to its knees. The new Sith, however, betrayed the Empire and deposed the Emperor. Darth Krayt assumed the throne of the Empire. But the deposed Emperor, Roan Fel, set up a rival faction of the Empire that remained loyal to him. Each side tried to dominate the Galaxy in the years to come."}, {"tag": "p", "text": "It is known that a Sith known as Darth Krayt began the order on Korriban, the ancient Sith burial world, around 30 ABY. In this new Sith cult, many of the followers sported a red and black tattooed appearance."}, {"tag": "p", "text": "Fist"}, {"tag": "p", "text": "The Fist was a Sith Lord who served as the supreme military commander for the new Sith Order. The Fist was appointed to the position by Darth Krayt. As of 137 ABY Darth Stryfe served as Krayt's Fist. At the Massacre at Ossus, Darth Nihl was the Fist, but was made a Hand when his predecessor was killed during the battle."}, {"tag": "p", "text": "Hands"}, {"tag": "p", "text": "The Hands were Darth Krayt's most able servants, trained and existing to carry out his will. They took only his orders, and reported only to him."}, {"tag": "p", "text": "By 137 ABY, Krayt's only Hand was Darth Nihl, having been given the post when his predecessor died unexpectedly. That year, he made Darth Talon into his second Hand, a fact that displeased Nihl."}, {"tag": "p", "text": "Sith Intelligence and Assassination"}, {"tag": "p", "text": "Sith Intelligence and Assassination was an agency of the new Sith Order of Darth Krayt. It was in charge of spying, political murder, and torture. Around 130 ABY, it was headed by Darth Maladi. Jor Torlin was one of its ranking agents."}, {"tag": "p", "text": "Darth Maladi's laboratory, in the Temple of the Sith, was a location of Sith Intelligence and Assassination."}, {"tag": "p", "text": "Voice"}, {"tag": "p", "text": "The Sith Lord who held the ranks of Voice was the second in command of the One Sith, serving as advisor to the Dark Lord of the Sith and as his caretaker and mouthpiece during Lord Krayt's periods in stasis. This title was held by the line of Chagrian Sith Lords known as Darth Wyyrlok. By the time of the Second Imperial Civil War, there had been three Darth Wyyrloks, while the fourth in line, Saarai underwent Sith training in Korriban."}, {"tag": "p", "text": "After the disappearance of Darth Krayt's body, Darth Wyyrlok promoted Darth Nihl as the new Voice so as to keep his loyalty after his self-proclamation as Emperor."}, {"tag": "p", "text": "Loremaster"}, {"tag": "p", "text": "The Loremaster was a Sith Lord who kept the number of Sith artifacts and records attained by the Order. The third Darth Wyyrlok also held this position, and was an expert in the history of the Sith and the Order's many incarnations throughout the millennia."}, {"tag": "p", "text": "Inquisitor"}, {"tag": "p", "text": "Inquisitors were Sith Lords responsible for extracting information of enemy prisoners. They employed a number of techniques, ranging from imprisonment and interrogation to torture. Darth Havok was an Inquisitor within the order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sith (pronounced as [ʃiː]; Irish form: sidhe) in Scottish Gaelic mythology are supernatural race of semi-deities and fairies. They are variously believed to live their life concealed from human eyes. Junior Sith are merely brownies and household spirits, but elder Sith are powerful sorcerers and warriors. The fearful Unseelie Court of the Sith consists of the malicious and evilly-inclined Sith.[source?]"}, {"tag": "p", "text": "Sith was also originally used in the pulp novel The Warlord of Mars in reference to a wasp-like creature the size of a bull."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}