{"url": "Sith_Eternal", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Religious organizations", "Category:Sith Eternal", "Category:Unknown Regions organizations"], "nodes": [{"tag": "h1", "text": "Sith Eternal"}, {"tag": "p", "text": "The Sith Eternal was a secret Sith cult that followed the Sith religion, preserving it after the destruction of the final two Sith Lords, Galactic Emperor Darth Sidious and Darth Vader. As Sith cultists, they revered the power of the dark side of the Force and venerated Sidious, who cheated death by preserving his spirit in a cloned body. The Sith Eternal strove to prevent their master from dying again, and resorted to the science of gene splicing in hopes of building a more suitable vessel for his dark essence. Their experiments led to the creation of various artificial genetic constructs, known as strandcasts, such as Supreme Leader Snoke as well as the Emperor's cloned son, who sired a natural-born Force-sensitive daughter called Rey. None of their endeavors succeeded in producing a viable host for Sidious' soul, however, and he was forced to rely on life support machinery in order to survive."}, {"tag": "p", "text": "The Sith Eternal hid in the Unknown Regions, establishing their lair in the Sith Citadel of the lost world of Exegol, which was also Sidious' place of exile following his first demise and the fall of the Galactic Empire. While former Imperial officers built a movement that evolved into the First Order, the Sith Eternal constructed the Xyston-class Star Destroyers comprising the Final Order—the largest fleet in galactic history. Their new-generation Star Destroyers were outfitted with an axial superlaser cannon that was capable of obliterating an entire planet. In addition, the Sith Eternal raised a generation of children not only to embody the cult's values, but to serve as elite soldiers, officers and fleet technicians in their military. Although they were not strong with the Force, the new generation was just as devoted to the dark side as the one that preceded them, and believed that the galaxy was theirs to rule by cosmic right."}, {"tag": "p", "text": "The Sith Eternal's plans came to fruition by the time of the First Order/Resistance War. After many years, their fleet and army were ready for deployment when Sidious announced his return across the galaxy. By then Snoke had fulfilled his purpose by dying at the hand of his apprentice, Kylo Ren, who, as Vader's grandson, was heir to the powerful Skywalker bloodline. Using Snoke as a proxy, the Sith Eternal had groomed Ren to lead their forces as heir to the new Sith Empire. However, Ren renounced their cause by returning to the light side of the Force as Ben Solo; after the Sith Eternal destroyed Kijimi the Resistance invaded Exegol to prevent the Final Order's launch. The cult was ultimately destroyed along with their forces and the Emperor in the Battle of Exegol, preventing their goal to establish the eternal reign of the reborn Sith Order."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Organization"}, {"tag": "p", "text": "The Sith Eternal was a secretive sect of Sith cultists who worshiped the dark side of the Force. As Sith loyalists they were instrumental in the preservation of the Sith religion after the Sith Order was destroyed. The Sith Eternal were spread throughout the galaxy and within the First Order, while those on Exegol created a fleet of hundreds of new-generation Star Destroyers and amassed legions of well-trained soldiers. The existence of the Sith Eternal was a safeguarded secret, with even those in the upper echelons of the First Order unaware of their operation."}, {"tag": "p", "text": "The reach of the Sith Eternal was vast. Their operation extended beyond the veil of the Unknown Regions, with Sith loyalists serving on the executive boards of Sienar-Jaemus and Kuat-Entralla. This allowed the cult to secretly funnel supplies and designs to Exegol through various intermediaries. For years, Sith loyalists toiled in secret to achieve the final stage in the First Order's long-gestating plan of conquest. Among their ranks were engineers, shipwrights, and enslaved labor responsible for the creation of hundreds of warships and thousands of starfighters."}, {"tag": "p", "text": "As a cult, the Sith Eternal focused on spiritual matters in addition to their military goals. Steeped in rituals designed to mine the secrets of the Force, they delved into the nature of phenomena such as Force-bonds and dyads in the Force. Despite lacking in Force-sensitivity, they revered the power of the dark side and taught their children to do the same. The younger generation of Sith cultists embodied the principles of the Sith Eternal, and believed that the galaxy was theirs to rule by cosmic right. Ultimately, the Sith Eternal coupled technology and the occult to bring forth unnatural embodiments of the dark side, thus furthering their quest to resurrect the Sith tradition."}, {"tag": "p", "text": "While steeped in the Sith's ancient traditions, the Sith Eternal utilized modern science, specifically bioengineering and cloning, in their quest to help Darth Sidious achieve eternal life. To this end, the cultists frequently experimented with their master's genetic code, attempting to grow a stable clone modeled on the Emperor's template. They produced a number of strandcasts by resorting to gene splicing, but ultimately their experiments failed to achieve the desired results, leaving them with various unwanted specimens while Sidious remained trapped within an unstable, dying cloned body. Sith Eternal scientists were also familiar with the Kaminoan program of behavioral modification, which they improved upon in order to ensure the programmed loyalty of their Sith troopers."}, {"tag": "h3", "text": "Military"}, {"tag": "p", "text": "While the First Order was the military arm of Darth Sidious' secret Contingency, the Sith Eternal served as its hidden spiritual heart. The Sith Eternal maintained a vast array of military power and groups who acted as enforcers. The fleet—comprising more than a thousand Xyston-class Star Destroyers along with the requisite TIE/dg starfighters, fleet technicians, and Sith Eternal officers—that the cult created was officially called the Final Order."}, {"tag": "p", "text": "Sith troopers comprised the Sith Eternal's ground forces, which were divided into legions of five-thousand troopers based on the ancient standard of a legion. A Sith trooper squad consisted of ten troopers led by Sith trooper sergeant. The squads were configured in three triads, which consisted of a Sith trooper corporal leading two lance corporals. Legions were numerically identified, but also given the name of an ancient Sith Lord. Such examples included 3rd \"Revan\" Legion, the 5th \"Andeddu\" Legion, the 17th \"Tanis\" Legion, the 26th \"Tenebrous\" Legion, the 39th \"Phobos\" Legion, and the 44th \"Desolous\" Legion. Sith Jetpack Trooper squads also consisted of ten soldiers, and squad names were that of weapons. Several examples included Warblade Squad, Lanvorak Squad, and Parang Squad."}, {"tag": "p", "text": "Despite the potential alliance between the Sith Eternal and the First Order military, there was a degree of friction between the two groups. First Order officers were of a pragmatic nature which clashed with the fanaticism of the Sith cultists. General Domaric Quinn and Allegiant General Enric Pryde, both of whom served on the Supreme Council, held opposite views concerning their Sith allies. Whereas Quinn disdained the Sith Eternal as a cult of mystics, Pryde was more concerned with the practical advantages that the cult had to offer, their fleet in particular. Pryde calculated that the Sith Star Destroyers would increase the First Order's resources by ten-thousandfold, more than making up for the destruction of Starkiller Base which he held General Armitage Hux responsible. The alliance between both factions was cemented when Pryde pledged himself to Sidious."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "By the time of the Galactic Empire, the Sith Eternal had settled at the Sith Citadel on Exegol, from where they operated, and were in the service of Galactic Emperor Palpatine, who was secretly a Sith Lord called Darth Sidious. Sometime after the Duel on Cloud City, Sidious' Sith apprentice, Dark Lord of the Sith Darth Vader, discovered Exegol after he acquired a Sith wayfinder from the Eye of Webbish Bog on Mustafar and used it to travel to the hidden planet, where he sought to uncover his master's secrets. There, at Sidious' command, Vader was attacked by a guard and a group of Sith cultists, whom he killed, and witnessed Sith cultists harvesting a mountain of kyber crystals in order to power the planet-destroying cannons used by the Star Destroyers of the Final Order fleet."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "The deaths of Galactic Emperor Darth Sidious and Darth Vader fulfilled a Jedi prophecy that foretold the destruction of the Sith Order. In the impassable depths of the Unknown Regions, however, loyalists kept the Sith religion alive even after the destruction of the last two Sith Lords and sought to resurrect its tradition. Sith cultists gathered on the lost world of Exegol to venerate the Sith Order and swear fealty to the last Sith Lord, Darth Sidious, who cheated death by using the dark side of the Force to thrust his consciousness into a clone body previously prepared by the Sith Eternal using Clone Wars era technology sometime before the Battle of Endor. The cultists followed Sidious' plan to bring about a new Sith Empire after the Galactic Empire fell in the Galactic Civil War. Their shipyards on Exegol operated in secret for decades, building a vast fleet that the galaxy was unaware of. During this time period, Exegol's human population was indoctrinated with the values of the Sith Eternal, having been raised by the cultists as their children to become officers, technicians, and soldiers in a New Empire."}, {"tag": "p", "text": "During the era of the New Republic, the Emperor's family was hunted by Ochi of Bestoon. A hunter of Sith artifacts, Ochi was an associate of the Emperor's adviser, Yupe Tashu, and the self-styled Acolytes of the Beyond. Though he was not Force-sensitive, Ochi believed that the dark side propelled him and shaped his actions. He captured the Emperor's cloned son, but failed to locate his daughter, Rey, who was sold on Jakku for her own safety. After failing to coerce the parents into revealing the girl's location, Ochi used his dagger to kill Rey's father and her mother. Ochi later perished on Pasaana before he could find Rey and bring her to Exegol."}, {"tag": "h3", "text": "First Order/Resistance War"}, {"tag": "p", "text": "In their quest to restore the Sith, the cultists deemed Vader's grandson, the dark warrior Kylo Ren, a potential heir to the Sith legacy. Ren's own master, Supreme Leader Snoke, was a product of the Sith Eternal's machinations. Snoke was a strandcast—an artificial genetic construct—concocted by Sidious to lead the First Order as his proxy. He was also one of several identical clones which were stored in a vat on Exegol. The Sith Eternal designed Snoke to test Ren's worthiness to become the Sith's inheritor. Ren was subjected to trials that molded him into a master of attack and cunning. Despite having a will of his own, Snoke's role was to serve as a final crucible in Ren's descent into darkness. By outmaneuvering and assassinating his master, Ren passed the last test in his apprenticeship as designed by the Sith Eternal."}, {"tag": "p", "text": "Using Vader's wayfinder to locate Exegol, the new Supreme Leader discovered the secrets of the Sith Eternal, including their clandestine operation and the revived Darth Sidious, whose cloned body continued deteriorating in spite of his followers' efforts to keep him alive. Ren came to realize that he was heir to the vast Empire forged by the Sith Eternal. Bidden by Sidious to kill the Jedi apprentice Rey, Ren accepted the mantle but felt no indebtedness to the Sith cultists who groomed him to become the next Emperor. Although he resolved to restore the Sith to power and fulfill his grandfather's legacy, Ren was unwilling to return to a subservient state, having sacrificed much to gain power and independence."}, {"tag": "p", "text": "The Resistance learned about the Sith Eternal through a First Order spy, General Hux, who sought to undermine Ren by supplying information to his enemies. Commander Poe Dameron briefed the Resistance on Ajan Kloss where he confirmed the validity of Sidious' transmission, revealing that the Emperor was alive once more and that his followers were prepared to unleash an armada of planet-killing warships."}, {"tag": "p", "text": "After losing Ren, who reclaimed his identity as Ben Solo upon the sacrifice of his mother, General Leia Skywalker Organa Solo, Sidious cultivated Rey as his sole successor. Knowing the girl to be his granddaughter, Sidious not only offered the Throne of the Sith to Rey, but also urged her to kill him in anger, allowing his spirit to pass into her body. By then, the Xyston-class Star Destroyer Derriphan had destroyed the planet Kijimi as a show of force. As the Sith Eternal's fleet prepared to depart from Exegol, the Resistance fleet made a desperate attempt to prevent the cult from returning the galaxy to the rule of the Sith."}, {"tag": "p", "text": "During the Battle of Exegol, members of the Sith Eternal witnessed as Rey reluctantly participated in Sidious' ritual, hoping to save her allies from being destroyed by the Sith Eternal's forces. Her submission pleased Sidious, who declared to his followers that the Jedi Order was dead and a new Sith reign would commence with his granddaughter ascending to the throne as \"Empress Palpatine.\" Before the ceremony could conclude with Sidious' sacrificial death, however, Ben Solo charged into Sith Citadel to fight alongside Rey. The Sith Eternal tried to prevent Solo from reaching the throne room, in contrast to how they previously welcomed him when he was still Kylo Ren. Sensing Solo's presence through their bond, Rey stayed her hand rather than giving into the dark side. His plans thwarted, Sidious attacked both Jedi and discovered that the power of their bond was the key to restoring his strength. Sidious therefore discarded the notion of being succeeded and reclaimed his former title of Emperor, having successfully siphoned enough energy from the prophesied dyad in the Force, to become whole again."}, {"tag": "p", "text": "Once restored, Sidious reassured his followers that the Resistance and their allies were doomed to fail. However, as the reborn Emperor unleashed a chain of Force lightning into the sky, destroying or disabling his opponents' vessels, Rey called on the spirits of all the Jedi to help her vanquish the Dark Lord of the Sith. The resulting explosion of Force energy destroyed Sidious' body and caused the Citadel's ceiling to collapse, crushing the thousands of cultists who witnessed their master's destruction. Their demise, combined with the Final Order's decisive defeat, destroyed the Sith Eternal cult in the year 35 ABY. Without the promised reinforcements of the Final Order, the First Order's military rule crumbled under a pan-galactic uprising, ending with the First Order's defeat in the First Order/Resistance War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith Eternal first appeared in the final film of the Star Wars saga, Star Wars: Episode IX The Rise of Skywalker. It was first identified in Star Wars: The Rise of Skywalker: The Visual Dictionary, which was released on the same day as the film, December 20, 2019."}, {"tag": "p", "text": "In the Star Wars Legends continuity, a cult known as the Prophets of the Dark Side bears similarities with the Sith Eternal. Both cults date back generations before the events of the Skywalker Saga, were based on hidden worlds with ancient ties to the Sith, its members wore black robes and operated in secret, and served Darth Sidious as they helped further his dark side goals by manipulating the course of galactic events to ensure the outcome. The Prophets of the Dark Side role within the Galactic Empire is similar to the role of the Sith Eternal within the Final Order.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}