{"url": "Sith_Civil_War", "categories": ["Category:Legends articles", "Category:Battles of the Old Sith Wars", "Category:Civil wars", "Category:Conflicts involving the Sith Empire", "Category:Conflicts of the Outer Rim Territories", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Sith Civil War"}, {"tag": "p", "text": "The Sith Civil War was a conflict that wracked the remains of the Sith Empire in the wake of the Jedi Civil War. Following the death of Darth Malak during the Battle of Rakata Prime, several of the Sith Lords who had followed Darth Revan and Malak during the war attempted to take what scraps they could from the ruins of the Sith Empire. Declaring themselves sovereign warlords, they fractured the Empire into a number of small, hotly-contested kingdoms."}, {"tag": "p", "text": "During the height of the Sith Civil War, many of the Sith warlords united under Darth Sion and Darth Nihilus, but upon their deaths, the Civil War escalated once more. By 3950 BBY, the remnants of the Sith Empire disintegrated entirely due to the constant infighting. As a result, the Galactic Republic was able to conquer Sith space, and reclaim worlds that had been under Sith control since the Great Sith War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following Revan's attack on the Korriban Sith Academy during his search for the Star Forge, and the death of Darth Malak during the conclusion of the Jedi Civil War, the remaining Sith Lords battled amongst themselves as each sought to rule the remnants of the Sith Empire. The bloody civil war began on Korriban, centered around the Sith Academy there. As a result of the chaos, the Dreshdae settlement on Korriban was abandoned by Czerka Corporation."}, {"tag": "p", "text": "At the height of the civil war on Korriban, Revan led a host of Jedi in an invasion of the Sith homeworld, and his forces successfully drove the Sith Lords from the planet. When Republic forces arrived on Korriban approximately a year after the Jedi Civil War's conclusion, they found the planet to be barren and lifeless."}, {"tag": "p", "text": "After fleeing Korriban, the Sith survivors scattered across the breadth of the Sith space and the Sith Empire began to fracture in earnest. In the year 3955 BBY, the surviving Sith Lords tore the empire apart as they battled for supremacy, and the empire was eventually divided up between the most powerful of the feuding warlords."}, {"tag": "p", "text": "In the year 3954 BBY, Darth Nihilus and Darth Sion emerged as the heirs apparent of the Sith Empire. In time, they united most of the remaining Sith Lords beneath their banner. Following the deaths of the Sith Triumvirate on Malachor V, the destruction of the Trayus Academy, and the foiling of their plot to exterminate the Jedi and destabilize the Galactic Republic, the leaderless Sith descended into anarchy once again. They turned upon each other and eventually destroyed what little remained of their Empire."}, {"tag": "p", "text": "However, records indicate that at least one Sith Lord bearing the title of \"Darth\" survived, if for nothing else but to train a Sith apprentice."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Because the Sith Civil War served as the final destruction of Revan's Sith Empire, it provided yet another reason for Darth Bane to have established his Rule of Two many millennia later. With only two Sith in the galaxy at any one time, it would prevent a disaster such as the Sith Civil Wars from ever happening again."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith Civil War first appeared in the 2003 Obsidian Entertainment video game, Star Wars: Knights of the Old Republic II: The Sith Lords. The title of the conflict would only be stated by Bastila Shan if the player chooses Revan to be a dark side–aligned male in that game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}