{"url": "Sister_Six", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Alliance Intelligence members", "Category:Assassins", "Category:Chelli Lona Aphra's crew", "Category:Cyborgs", "Category:Females", "Category:Members of the Central Isopter", "Category:Xexto"], "nodes": [{"tag": "h1", "text": "Sister Six"}, {"tag": "p", "text": "Sister Six was a female Xexto assassin who came to join a crew of mercenaries led by Chelli Aphra. Tasked with recovering memories of Aphra's superior, they travelled to Skako Minor to search the workshop of Wat Tambor. There, they were ambushed by an Imperial squad led by Magna Tolvan, which awoke a large beast. After eventually killing the beast, they looted the workshop and Aphra led them out."}, {"tag": "p", "text": "The next destination for Six and the other mercenaries was the rebel flight school. There they were mistaken for recruits, before being imprisoned by General Hera Syndulla when she realized who they really were. They managed to break their prison shields, but did not try to escape, impressing Syndulla. When she came to listen to why the mercenaries were at the flight school, Syndulla was stunned by Sister Six, whom stunned the rest of the rebels in the room with her. The mercenaries then kidnapped Syndulla to use her as a bargaining chip to enter Hivebase-1."}, {"tag": "p", "text": "Aphra's plan to infiltrate Hivebase-1 was successful in the fact they managed to get in undetected. They then conversed a room of rejected prototypes and after consulting with Tolvan by accident, Aphra managed to get their presence revealed to the Imperials. The prototypes were unfrozen and Six and the others took cover. Aphra used Caysin Bog as cannon fodder in order to have Tam Posla fight the prototypes for them. Six then followed Aphra and Syndulla to the Hivebase-1 datacore. Although they were attacked by more Imperials, Aphra managed to use her bugs to have the datacore ripped out of Hivebase-1."}, {"tag": "p", "text": "Following the aforementioned events, Aphra, Six, Posla and Syndulla returned to the flight school and Syndulla congratulated them on stealing the datacore. Six decided to stay with the rebels while Aphra left with Posla."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A worshipper of death"}, {"tag": "p", "text": "At some point, Sister Six was a member of the Central Isopter, a death-worshipping cult that was found in areas of violence such as Jedha, until being kicked out for giggling during prayers."}, {"tag": "h3", "text": "Joining Aphra's team"}, {"tag": "p", "text": "Sometime later, Six was an assassin and came to join a crew of mercenaries, led by the rogue archaeologist Doctor Chelli Aphra, on Son-tuul. The rest of the team included: Rexa Go; Hallio Bas, their Skakoan guide; Tam Posla, a former lawman from Milvayne; Caysin Bog, a cyborg and Posla's love interest; Glahst Ombra, a passive aggressive Defel; The Violet Ghost, a mysterious stranger who made a name for his swordcraft; and Dek-Nil, a first generation droideka that Aphra had reprogrammed."}, {"tag": "p", "text": "The team was tasked with recovering the memories of Aphra's superior, who was unknown to the rest of them, excluding Rexa. Before they could depart Son-tuul, however, Aphra was ordered to leave one of the mercenaries behind. She chose the Violet Ghost, who was tricked into fending off incoming stormtroopers while they fled the Son-tuul Spaceport."}, {"tag": "h3", "text": "Mission to Skako Minor"}, {"tag": "p", "text": "The first destination for Six and the others was Skako Minor, more specifically the workshop of Wat Tambor. The group arrived and began trekking the terrain to reach the workshop, led by Bas. However, Bas led them into a squad of stormtroopers, blocking the entrance of the workshop. Bas revealed himself to be the traitor and demanded the Imperials leave Skako Minor, as they had promised him. The Imperial officer refused, but Aphra gave Bas her Tooka Flufto. Little did Bas know that Tooka was bio-engineered to explode when hearing Aphra's code-phrase. Aphra recited it as planned and Bas and the Imperials disappeared in a fireball."}, {"tag": "p", "text": "Following the explosion, Aphra had Rexa open the crate she had been lugging for the entire journey. Six assumed it was booze, but instead it was sixty more shrink frozen Tookas, all bio-engineered in the same way. Six then noticed a running stormtrooper and Rexa ordered them to stop it. As the trooper passed Posla and Bog, the two refused to get them as they had not broken any law. Ombra, however, killed the stormtrooper when it entered the treeline."}, {"tag": "p", "text": "The mercenaries entered the workshop, into a room of machines and artefacts. They began examining the objects when a Delta-class T-3c shuttle flew in through the roof. It landed a squad of stormtroopers, led by Lieutenant-Inspector Magna Tolvan. Unfortunately for both sides, though, the commotion awoke the large beast in the center of the room, the Chthonic worm god. It attacked them, killing a number of stormtroopers and forcing the rest of the combatants into hiding. Aphra tried to help with the Tooka she had on her, but the beast trapped her and Tolvan into a small space."}, {"tag": "p", "text": "With the beast distracted, Ombra deserted the group and Six told the other mercenaries that they should try to help Aphra. Posla objected, claiming the monster had broken no law. But Six pointed out to him that Bog was lying lifeless behind them. Furious of his soulmates demise, Posla mobilized his cybernetic missile launchers and fired at the monster. Bog then got up again and Posla calmed down and embraced him. Dek-Nil then fired a shot which caused one of the remaining stormtroopers to fire their rocket launcher at the ceiling, sending rubble down onto the beast, killing it. Aphra declared victory over it and congratulated the others, prompting them to continue looting. While Six and the others did that, Rexa went to investigate what Aphra was doing behind the rubble. The others eventually heard an abrupt gunshot, but Aphra reappeared and told them to keep looting."}, {"tag": "p", "text": "As they returned to their gunship, Six found Ombra returning to them. They left Skako Minor, and Aphra began reviewing the data she had recovered, concluding that the memories of her superior were stored in Hivebase-1, the R&D hub of the Tarkin Initiative."}, {"tag": "h3", "text": "Kidnapping Hera Syndulla"}, {"tag": "p", "text": "Aphra had a plan to infiltrate Hivebase-1, which involved first traveling to the Lucrehulk Prime, a Lucrehulk-class LH-3210 cargo freighter used as a flight school for the Alliance to Restore the Republic. The Alliance officer Bini thought they were recruits and took them to see their general, Hera Syndulla. During their walk, Six asked Aphra where Ombra had gone, which Aphra replied that she had ran off again after they landed. When they approached the control core, the Tooka Aphra was holding was attracted to it, and ran in. Aphra followed, but Syndulla shot the Tooka. Bini introduced the group, still sure that they were recruits. Posla, though, revealed that they were not and Syndulla realized they were mercenaries. As the rebels pointed their guns at them, Aphra asked Six their odds of taking them on and reaching their ship in time. Six claimed it was possible, but with sacrifices, so Aphra had them surrender."}, {"tag": "p", "text": "The mercenaries were put into the brig, detained behind energy shields. While Six sat around with Posla and Bog they heard a commotion in Aphra's cell. Indeed, Ombra had entered it through the vent. Aphra realized she was Magna Tolvan wearing the Defel's skin and Tolvan pointed a blaster at her. Dek-Nil, who sat at the other side of Aphra's cell, stunned Tolvan, who accidentally shot the shield generator and deactivated the energy shields. The mercenaries were now free and Aphra told them to help her stuff Tolvan back into the vents."}, {"tag": "p", "text": "When the rebels found Six and the others, they were still at their cells. Syndulla respected this and decided to listen to why they were at the flight school. Posla was about to explain his plan to get into Hivebase-1 when Bog opened his neck compartment and four blasters flew out. Six caught them and, in a matter of seconds, she stunned Syndulla, Bini, and every other rebel in the hanger. As the mercenaries carried Syndulla into their ship, Posla was furious that he did not know of their plan. Bog tried to ease his anger, but he pledged to quit. Aphra was about to leave him to the reinforcements when he changed his mind and climbed aboard the ship."}, {"tag": "h3", "text": "Infiltrating Hivebase-1"}, {"tag": "p", "text": "As they left the Lucehulk Prime, Aphra borrowed a transmitter from the others and contacted Hivebase-1, offering to trade Syndulla. Later on, Aphra was running tests on Bog's diagnostics when she asked Posla about the cyborgist he was obsessed with. Together, Bog and Posla told her about Doctor Cornelius Evazan and Posla's hunt for him. Six called him obsessive, but Bog corrected it as attached. As they finished explaining their intentions, their ship drew closer to Hivebase-1. The officer over the comms confirmed their deal and gave them a flight path to use. Aphra, though, was using Syndulla's general plaque, which had a tracker on it, to lure in the Lucrehulk Prime. With the rebels arrival, Aphra used the chaos to sneak their ship into one of Hivebase-1's hangers."}, {"tag": "p", "text": "The mercenaries departed their ship and began snooping around. They entered a room of frozen prototypes which had been rejected before they could be mass produced. Afraid of these suddenly defrosting, Six suggested giving Syndulla a gun, which Aphra denied. As they looked around, Aphra tapped into the Lucrehulk Prime's comm channel and discovered that Tolvan had commandeered the control core. Aphra contacted her and convinced her not to destroy the ship. However, it came with the cost of her revealing the mercenaries' presence in Hivebase-1."}, {"tag": "p", "text": "Commander Yewl, of Hivebase-1, ordered the prototypes to be defrosted, and In a matter of moments, the mercenaries found themselves surrounded by the rejects. They immediately attacked, gunning down Dek-Nil, and Syndulla demanded a gun from Six. Aphra stopped her again, saying Syndulla would shoot them the second she had a chance. Thus Six continued shooting at the prototypes until Aphra ordered the group to return to the ship. Bog, however, instead ran towards the rejects, being shredded apart by the blaster fire. Posla watch his partner die and, in a fit of rage, he revealed his cybernetic weapons and faced off with the prototypes. Six felt sorry for him, but Aphra pulled her away and they left the room, leaving Posla to fight the rejects alone."}, {"tag": "h3", "text": "Stealing the datacore"}, {"tag": "p", "text": "Aphra led Six and Syndulla to the datacore of Hivebase-1. There, she began searching for where her superior's memories in the archives. Syndulla asked Six again for a blaster, warning that Imperial reinforcements could arrive at any time. Posla then caught up with them, mourning Bog's death. As Syndulla and Aphra argued, the latter let Six give Syndulla a gun. Syndulla then tried to shoot Aphra when Commander Yewl arrived and intervened, zapping Syndulla. He ordered his forces to capture her and kill the others."}, {"tag": "p", "text": "Yewl's forces engaged the mercenaries but only Six fired back. Posla was still traumatized from his partner's death and Syndulla was using Aphra as a shield. Aphra picked up Syndulla's blaster and gave it back to her so she could cover her. Aphra then used her AJ^3 cyborg construct and the terminal to connect with a bug she had planted in the Lucrehulk Prime's control core during her visit there. She had the flight school latch onto Hivebase-1 and rip the datacore—with Aphra, Six, Syndulla and Posla inside—out with its tractor beam and X-wing starfighters."}, {"tag": "p", "text": "Simultaneously, the sixty shrink-frozen explosive Tookas escaped their crate and left Aphra's ship to roam the rest of Hivebase-1. To help with this, Aphra sliced the firing registry and renamed it with the code phrase that detonated the Tookas. When the complex attempted to fire on the Lucrehulk Prime, it was destroyed by the dozens of Tooka's detonating."}, {"tag": "h3", "text": "Joining the Alliance"}, {"tag": "p", "text": "With the datacore now in rebel hands. Syndulla complemented the effort of Aphra and the other mercenaries, but politely asked them to leave. Six, however, decided to stay with the rebels instead. She had been impressed by them and desired to fight with some people who believed in something. Aphra called it a happy ending and departed with Posla."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sister Six was a female Xexto with green skin, white eyes and red hair. Her obsession with death got her affiliated with the Central Isopter death cult and she came to find stun blasters to be no fun as they did not kill anyone. Despite having worshipped death before, Six thought herself to be saner than the mercenaries she worked with on Skako Minor. She was also very aware of her surroundings, running through possible scenarios on multiple occasions. However, despite working as an assassin and mercenary, Six eventually realized she needed to fight for something she believed in and joined the Alliance."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Sister Six wore a brown hat and a white shirt with a sand colored vest and mud green shorts. Her bottom left arm was robotic and she owned a number of blasters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sister Six first appeared in the canon comic Doctor Aphra 15, written by Simon Spurrier and penciled by Emilio Laiso."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}