{"url": "Sith_Cultist", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Sith cults"], "nodes": [{"tag": "h1", "text": "Sith Cultist"}, {"tag": "p", "text": "A Sith Cultist was a member of any Sith cult. More specifically, \"Sith Cultist\" was used with reference to the members of Tavion Axmis's Sith cult, the Disciples of Ragnos."}, {"tag": "h2", "text": "Background and Abilities"}, {"tag": "p", "text": "Members of the cult had been empowered with the Force by Tavion's Scepter of Ragnos and wore different color battle suits depending on their abilities. Some of Tavion's Sith cultists were Force-users, carrying no weapons and instead using offensive powers such as Force Grip and Force lightning as well as acrobatics and hand-to-hand combat techniques. Others were armed with a blaster rifle and had basic knowledge of several dark side powers. However, most were trained in the basics of lightsaber combat."}, {"tag": "p", "text": "These cultists wore an orange battle suit and were usually competent in one of the three styles of lightsaber combat in use at the time, although they generally lacked the skill and discipline needed to defeat an average Jedi from Luke Skywalker's Jedi Praxeum. These cultists had little skill in Force powers, but all were trained to use Force Jump and to employ Force push defensively. Some were also able to throw their lightsaber a short distance using telekinesis. In combat, the cultists made frequent use of Dun Möch to offset their lack of saber skills, taunting their opponents arrogantly."}, {"tag": "p", "text": "Lightsabers with slightly shorter blades, modeled on Tavion's, were mass produced using synthetic crystals for the lightsaber-wielding cultists. It was likely that the cultists were not skilled enough to create their own lightsabers. The difference in the blade length did not seem to have an effect on the weapon's performance."}, {"tag": "p", "text": "Generally, cultists operated in pairs or small groups, typically with one lightsaber cultist backed up by one or two Force-users to maximize their abilities. In combat against Jedi, the Force-users would typically employ their powers aggressively along with rapid acrobatics to distract the Jedi and create openings for their lightsaber-wielding partners."}, {"tag": "h2", "text": "Other Cult Members and Accomplishments"}, {"tag": "p", "text": "The more powerful of Tavion's cultists were called the New Reborn, as they were recruited among the surviving members of Desann's army of Reborn and their skills were superior to the cultists . The lower members of the Disciples of Ragnos were simply called \"Sith cultists\" or just \"cultists.\" They were mainly deployed in operations relating to Tavion's hunt for more Force energy, often working alongside Imperial Remnant or mercenaries. Whilst the cultists were often outmatched by the Jedi they faced on their missions, particularly the talented Jaden Korr, they fought to the death with a zealous fury."}, {"tag": "p", "text": "The cultists and New Reborn congregated in large numbers on Korriban and fought the Jedi in an attempt to prevent them from reaching Ragnos' tomb and halting Tavion's resurrection of the ancient Sith Lord. Due to the cultists' numerical advantage, they were able to stall the advance of the Jedi, allowing Tavion to complete the resurrection ritual. Nevertheless, Jaden Korr managed to penetrate their defenses and slew many of the defending cultists, thereby gaining access to Ragnos' tomb."}, {"tag": "p", "text": "Engaging Tavion and the empowered spirit of Ragnos, Korr defeated her and set the Sith Lord's spirit back to rest. With the destruction of the Scepter of Ragnos the cult members lost their powers, thus the fates of those who survived the fall of Tavion are unknown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Jedi Knight: Jedi Academy, the Cultists are the only enemies that wield slightly shorter lightsabers. All of the other enemies, such as the New Reborn, have normal length lightsabers. Also, all lightsaber-using enemies in the game, except Alora, Reborn Master and staff-wielding New Reborn have the same black, basic hilt. There are also two hidden cultist NPC, \"Cultistcommando\" is basically a green Cultist armed with dual DL-44 heavy blaster pistols with a surprisingly fast rate of fire and \"Cultist_Destroyer\", a red Cultist who run into the player performing a \"Force rage\" animation and self-destructs, killing everyone in the blast radius, though the self-destruct effect is missing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}