{"url": "Sith_fighter", "categories": ["Category:Legends articles", "Category:Sith starfighter classes"], "nodes": [{"tag": "h1", "text": "Sith fighter"}, {"tag": "p", "text": "The Sith fighter, also known as the Sith interceptor, was a starfighter that formed the bulk of Darth Revan and Darth Malak's space forces during the Jedi Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The design and manufacture of the Sith fighter was a hybrid of various technologies—untraceable to any products originating from known worlds—unique to the Rakatan space-based shipyard, the Star Forge. A single-seater fighter, with a cargo capacity of forty kilograms and provisions for one day, the craft had not been designed with the comfort or safety of the pilot in mind. Mass-produced to be small, lightweight, and agile, the integrity of the fighter's hull was minimal, as were the life support systems. The pilot did not need to wear a full spacesuit; however, many chose to do so since there was a significant chance that the pilot would need to eject from a damaged craft."}, {"tag": "p", "text": "The fighter was powered by a prototype twin ion drive system of Rakatan origin—seen only in this design—that allowed it to reach speeds of 1,250 km/h. The power generated by the dual engines and thrusters afforded the fighter maneuverability nearly to the point of instability, therefore requiring that much of the central chassis was given to managing the reactor core for optimal performance."}, {"tag": "p", "text": "The Sith fighter's design consisted of a short, stubby carriage that housed the cockpit and subsystems. A feature exclusive to this design was the fighter's ability to to fold its wings and power down its weapon systems when docked or traversing long distances in order to conserve energy. Engaging in combat, the wings unfolded—giving the craft a maximum length of 7 meters—and the laser cannons, one at each outward edge, were brought to bear. This allowed the fighter a broad attack arc, while its small forward and rear profiles made it difficult to target."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The manufacturing capabilities of the Star Forge allowed for the Sith fighter to be mass-produced, and the versatile design of the fighter ensured that craft were capable of being tightly packed in the cargo bays of their mothership, the Centurion-class battlecruiser, and launched moments after the carrier exited hyperspace."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sith fighter first appeared as Malak and Revan returned to the Republic as conquerors after the Mandalorian Wars. While many of their capital ships were turncoat Republic vessels, the majority of their forces were made of these fighters. Produced by the Star Forge, they could be easily stored in cargo bays, such that even a single mothership could deliver swarms of them into battle. Furthermore, they were quick to scramble, making them a deadly first strike."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}