{"url": "Sith_Master/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Sith Masters"], "nodes": [{"tag": "h1", "text": "Sith Master"}, {"tag": "p", "text": "Sith Master was the title of a Sith individual who instructed at least one apprentice in the ways of the dark side of the Force. Traditionally, the apprentice was required to kill his or her mentor before they could train their own apprentice and advance to the rank of Master."}, {"tag": "p", "text": "Throughout Sith history, the Master held the titles Sith Lord and Dark Lord of the Sith. In Darth Revan's Sith Empire, Sith Masters held the rank of Sith Lord, but only the strongest Master ruled as Dark Lord of the Sith. Under Darth Bane's Rule of Two, the guiding principle of the Order of the Sith Lords, the Master and his or her apprentice held both titles together."}, {"tag": "p", "text": "The Sith Master's role stood in contrast to the rank of Jedi Master, a title given to members of the Jedi Order—adherents to the light side of the Force. Like the Sith Rule of Two, the Jedi Code expressly forbade any master from training two or more apprentices simultaneously."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Throughout various incarnations of the Sith Order, the rank of Master was held by Force-sensitive adherents to the dark side who trained one or more apprentices in the ways of the Sith. During the reign of the Sith Lord Darth Revan, Sith Masters were barred from instructing multiple disciples at the same time—a decree influenced by Revan's belief that lesser Sith would form an alliance to overthrow their outnumbered Master. As an example of his own policy, Revan trained a single apprentice, Darth Malak, during his tenure as the ruling Dark Lord of the Sith."}, {"tag": "p", "text": "Roughly three thousand years after the civil war between the Jedi Order and Darth Revan's Sith Empire, Darth Bane brought about the deaths of thousands of Sith in the final days of the New Sith Wars. The Brotherhood of Darkness, an order of numerous Sith, had left Bane disillusioned with the way that the organization broke away from Sith traditions. After the entire Brotherhood was destroyed at the Seventh Battle of Ruusan, Bane formed the Order of the Sith Lords. Guided by the Rule of Two, only two Sith Lords were allowed to exist at any given time—a Master who embodied the power of the dark side; and an apprentice who coveted the power. Bane, who had grown inspired by Revan's views on the relationship between Master and apprentice, trained only one apprentice as his eventual successor, Darth Zannah. Throughout the following millennium, the mantle of Sith Master passed from mentor to apprentice, usually through single combat to the death as Bane had envisioned."}, {"tag": "p", "text": "The Rule of Two remained in effect during the last century of the Galactic Republic, although it was no longer strictly adhered to by modern Sith Lords. Darth Plagueis, like several Masters before him, was hesitant to train an apprentice, only to be replaced through eventual betrayal and murder. Plagueis's own Master, Darth Tenebrous, had secretly trained another student, Darth Venamis, without his apprentice's knowledge. Plagueis hoped to break the homicidal tradition of the Rule of Two with his apprentice, Darth Sidious, but was ultimately slain by the ambitious Sith Lord who sought to rule the galaxy as Emperor."}, {"tag": "p", "text": "Darth Sidious was a master of several apprentices at different points in his life. While still learning the ways of the dark side under Plagueis's guidance, Sidious trained a Dathomirian Zabrak, known as Darth Maul, as a Sith assassin. Maul was then followed by two former members of the Jedi Order, Darth Tyranus and Darth Vader respectively."}, {"tag": "p", "text": "Though Darth Vader never attained the rank of Sith Master, he secretly instructed his own Sith apprentice in a plot to overthrow the Emperor. Galen Marek, a prodigy of the Force, served the Dark Lord as his personal assassin for years under the codename \"Starkiller.\" Marek's redemption as a Jedi and untimely demise forced Vader to clone his former apprentice in the hopes of creating a stronger and more loyal version of the original Starkiller. Out of the numerous test subjects who failed to meet Vader's expectations, including a renegade clone, only one clone completed his trials and became Darth Vader's new apprentice."}, {"tag": "p", "text": "The Order of the Sith Lords ended with the demise of the last clone of Emperor Palpatine in 11 ABY, but the Rule of Two was preserved by a new Sith Master, the self-proclaimed Dark Lady of the Sith Lumiya. Having received partial Sith instruction under both Sidious and Vader, Lumiya rebuilt Bane's Order and instructed two apprentices in turn, the former stormtrooper Flint, and a Royal Guardsman named Carnor Jax. Her third and final apprentice, Darth Caedus, achieved Sith Mastery shortly before Lumiya's death in a duel against Luke Skywalker. the grandson of Darth Vader, Caedus anointed the Jedi Tahiri Veila as his apprentice, and thus continued the Rule of Two until his own death in 41 ABY."}, {"tag": "p", "text": "Even before the collapse of Lumiya's Sith Order, a new policy was established by a Sith Master called Darth Krayt. The Rule of One reopened the Sith ranks to more than two Sith Lords, and thus allowed Krayt's Order to expand with more than several hundred members by 130 ABY. The tradition of Master and apprentice remained, but the revived Sith Order was composed of many Masters, each with their own apprentice; and all ultimately answered directly to the one Dark Lord of the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}