{"url": "Sith_battlelord", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Sith ranks"], "nodes": [{"tag": "h1", "text": "Sith battlelord"}, {"tag": "p", "text": "The Sith battlelords, also known as Battlelords, were a class of warrior who served the Sith Lord Darth Rivan during the New Sith Wars. Sith battlelords were leaders within Rivan's armies and, through a series of complex rituals involving the application of Sith magic, were bonded to the troops they commanded via the Force. The use of Sith battlelords reduced desertion rates within the Sith armies and, for a time, seemed likely to turn the tide of the New Sith Wars in the favor of the Sith. However, Rivan's battlelord forces were annihilated by a Force storm generated by an artifact known as the Darkstaff, and the Sith ultimately abandoned the practice of creating battlelords."}, {"tag": "p", "text": "Over time, the precise details of how to create Sith battlelords was lost, and, during the Clone Wars, the slaver Phylus Mon and the Dark Jedi Karae Nalvas sought to rediscover the knowledge of battlelord creation. The pair traveled to Rivan's fortress on the planet Almas and discovered a secret chamber within the facility, where they found a tome that detailed the stages of the battlelord rituals. However, their attempts at carrying out the rituals were unsuccessful."}, {"tag": "h2", "text": "Organization and creation"}, {"tag": "p", "text": "Sith battlelords were a class of warriors who served within the armies of the Sith Lord Darth Rivan during the time of the New Sith Wars, a millennium-long conflict that began in 2000 BBY and was fought between the Galactic Republic and the resurgent Sith. Chosen from the ranks of Rivan's forces, battlelords served as the leaders of Sith regiments that were deployed against members of the Jedi Order."}, {"tag": "p", "text": "Individuals chosen to become Sith battlelords would undergo a series of complex rituals that bonded them to their troops via the Force. The rituals took place at sites strong in the dark side of the Force and, according to most reports, would take place within an altar room inside a temple. The rituals drew upon the dark side and used Sith magic, inflicting pain upon the prospective battlelord and bringing the being to the verge of death. Some did not survive the ceremony. According to the Jedi publication Speculations on Tactics of the Sith, some people claimed that aspiring battlelords were drained of all their blood, although the publication also noted that there was no exact consensus on how individuals were brought to a near-death condition."}, {"tag": "p", "text": "Following performance of the rituals, some form of interaction between the unconscious leader and their followers was required to complete the leader's transformation into a Sith battlelord. Followers normally paraded past the lifeless body of their leader for about an hour, walking through the leader's blood. The leader's condition had to then stabilize without an application of the Force or medical intervention, and, if the leader survived, the being was returned to full health. With the process complete, a Force bond was forged between the subordinates and their leader, which signified the leader's successful transformation into a Sith battlelord."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The creation of Sith battlelords was pioneered by Darth Rivan, a Zelosian Dark Lord who ruled the Sith during the New Sith Wars from a fortress on the planet Almas. The battlelords were developed in response to high desertion rates among the Sith armies, which had reduced the coordination of the Sith military forces and posed a threat to the success of their war effort, and Rivan eventually perfected the process of Sith battlelord creation. Rivan recorded the details of the battlelord ritual inside a secret chamber in his fortess on Almas, and information on the nature of the bond between the warrior leaders and their subordinates was also detailed in inscriptions on the walls of various Sith temples."}, {"tag": "p", "text": "The Sith were initially startled by the effects of Sith battlelords on the battlefield, because the bonded leaders brought a much greater degree of cohesion to the Sith armies than had been expected. A Sith warrior bonded to the Sith battlelord Farh j'Hien deserted the Sith forces and was captured by the Jedi Master Kei Loo Bross. The Jedi observed how the warrior was in pain due to his separation from j'Hien, as a result of the Force bond between j'Hien and the warrior. In a transcript, Bross noted how the battlelords proved to be an effective tool for the Sith. For a time, their usage threatened to turn the tide of the New Sith Wars in the favor of the Sith. However, Rivan was betrayed by his apprentice before he could build a full army of bonded leaders, and when Rivan gained possession of the Darkstaff, an ancient Sith artifact that fed on Force essences of individuals, it created a Force storm that wiped out his entire battlelord force and transported him into the future."}, {"tag": "p", "text": "The Jedi soon realized that killing a battlelord released the warriors bonded to the leader, who would often then flee, so the Jedi began specifically targeting Sith battlelords. As a result, Sith battlelords no longer met their required purpose, and the Sith discontinued their usage. Over time, the precise details on how to create the warrior leaders were lost and only vague references to the battlelords came to remain in historical records. At some point, a section devoted to the subject of Sith battlelords was included in the Jedi publication Speculations on Tactics of the Sith."}, {"tag": "p", "text": "Over a thousand years later, during the time of the Clone Wars, the Human Len Markus gave the Darkstaff to the Chevin slaver Phylus Mon so that Mon could repair the artifact, which had became damaged when Markus seized it from the Cularin system asteroid belt. To carry out his task, Mon traveled to the Cularin system, where Almas was located, and planned to recover knowledge on the creation of Sith battlelords from Rivan's fortress. Since the Darkstaff desired the Force essences of sentient beings, Mon believed that the performance of the battlelord rituals would repair the artifact, because the Force essences of the involved individuals were manipulated by the creation rituals. In addition, Mon hoped to be able to use the techniques to bond armies of slaves to himself or others."}, {"tag": "p", "text": "Mon allied himself with the Dark Jedi Karae Nalvas, who also wanted to learn the secrets of Sith battlelord creation. However, the Chevin secretly planned to murder Nalvas once the Dark Jedi had became a bonded leader, to find out what would happen when such a being was killed. Mon and Nalvas entered the Almas Sith fortress and accessed the facility's battlelord chamber, where they discovered a tome that described how to carry out the battlelord rituals. Using their newly discovered knowledge, the pair attempted to carry out the battlelord rituals, planning to bind the slaves Gorak, Kaarror, Nalz, and Yerj, and the captured Jedi Constanten and Valiri, to Mon. However, the ceremony was unsuccessful due to the presence of the Darkstaff, and instead resulted in the Force essences of Nalvas, the slaves, and the two Jedi being ripped from their bodies."}, {"tag": "p", "text": "At some point after that incident, a slicer posted a log on the subject of Sith battlelords on one of the planet Cularin's HoloNet nodes. In the log, the slicer detailed how battlelords were created, and speculated that Rivan might have specifically constructed the Almas Sith fortress to use as a facility for testing and refining the creation of battlelords. Len Markus regained possession of the Darkstaff following Mon's repair attempt, and, by 19 BBY, the Darkstaff had imbued Markus with some of the powers of a Sith battlelord, creating a Force bond between Markus and his Gamorrean bodyguard Kluuus."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Sith battlelords were tough, imposing individuals who sought to increase their own personal power by attempting to gain favor with their Sith leaders, and were willing to die in the process. They also possessed a maniacal blood-rage that drove them to push their troops to their limits. Battlelords gained thickened skin as a result of their bonding rituals, increasing their defensive capabilities. The majority of the warrior leaders were males."}, {"tag": "p", "text": "The battlelord rituals created a near-physical bond between the warrior leaders and their troops. Depending upon the strength of the ritual used to connect them together, bonded soldiers could go between five and fifteen kilometers from their battlelord and were compelled to do anything that their battlelord commanded, or else be left behind. Any troops who strayed too far from their Sith battlelord would experience intense abdominal pain and a throbbing headache for twelve hours, eventually dying unless they returned to close proximity of their bonded leader. Unless certain magics were undone, separation of any member from the rest of the regiment also led to intense physical pain being felt by all other members, and caused the warrior leader to have visions of his or her own destruction. As a result, bonded Sith armies dealt with deserters harshly, and captured deserters were presented to the battlelords for punishment."}, {"tag": "p", "text": "If bonded soldiers tried to assault the Sith battlelord to which they were linked, the attackers would become beset with pain and would eventually die. Furthermore, if warriors succeeded in drawing their battlelord master's blood, the battlelord would be unaffected by the damage and one of the bonded troopers would be hurt instead. In addition, if a Sith battlelord fell under attack from an opponent to which it was not bonded, the battlelord could sometimes transfer any physical wounds it received to any bonded soldiers that were located within thirty meters of the battlelord. A battlelord could also enhance its own attacks by summoning power from bonded soldiers within a thirty meter proximity, which had the effect of causing the bonded soldiers to become dazed. The death of a Sith battlelord released the warriors that were bonded to the lord. The bond between a battlelord and its followers could also be severed by an application of the light side power Force Light."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith battlelords were created by Morrie Mullins and were first mentioned in A Mon Alone, a role-playing adventure that formed part of the Living Force campaign. They later featured in the Wizards.com article Sith Battlelords which was also written by Mullins, and were mentioned in the role-playing scenarios The Eye—written by Mullins and Jae Walker—and Echoes of the Jedi, an adventure in the Dawn of Defiance role-playing campaign that was written by Jean-François Boivin and Abel G. Peña."}, {"tag": "p", "text": "A Mon Alone, Sith Battlelords, and Echoes of the Jedi all give differing reasons for why the Sith discontinued the use of Sith battlelords. A Mon Alone claims that it was because the Jedi began specifically targeting battlelords when in battle against the Sith, while Sith Battlelords claims that Rivan was betrayed by his apprentice before he could create an army of battlelords, and Echoes of the Jedi claims that Rivan's battlelord army was destroyed by a Force storm. This article tries to integrate the three above explanations. There is also disagreement among the sources regarding the appropriate capitalization of the Sith battlelords' name. A Mon Alone refers to them as \"Sith Battlelords,\" while the Sith Battlelords article and The Eye refer to them as \"Sith battlelords\" and Echoes of the Jedi merely calls them \"Battlelords\". This article uses the capitalization from Sith Battlelords and The Eye, as they were published after A Mon Alone."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}