{"url": "Sith_Training_Droid", "categories": ["Category:Legends articles", "Category:Holographic technology", "Category:Training droid models"], "nodes": [{"tag": "h1", "text": "Sith Training Droid"}, {"tag": "p", "text": "Sith Training Droids were a part of an advanced series of holodroids based on the design of the prototype unit known as PROXY. Constructed on the vast ocean-covered world of Kamino, the training droids were primarily used as instruments in a secret project conducted under the surveillance of the Sith Lord Darth Vader. Following the redemption and death of his former apprentice, Galen Marek, Vader was determined to create a \"new Starkiller\" by utilizing the experimental advanced cloning process."}, {"tag": "p", "text": "In order to ensure that the perfect clone would learn in a matter of months what took Marek years to learn as an apprentice, part of the overall process included using the training droids to help the clone in developing his inherent skills with a lightsaber. The other purpose for the droids was through their built-in holographic technology. By mimicking the appearances of several individuals who were close to Marek before his death, the clone would have to overcome the psychological side-effects of his genetic template's imprinted memories."}, {"tag": "p", "text": "But due to the initial imperfections in the cloning procedure, as well as the natural complications in cloning a Force-wielder at an over-accelerated rate, many clones resulted in abject failures. Thus, Vader was forced to repeat the procedure over and over again until the flaws could be eliminated, thereby enabling him to finally engineer a genetically perfect replica of the original Starkiller. As a result, the training droids were required to test many clones of Marek, all of which resulted as failures, save one that succeeded in rising above all of his precursors to reach the expectations and approval of Darth Vader."}, {"tag": "p", "text": "The training droids would later be used for a different purpose when a Rebel Fleet attacked Imperial forces in the conflict known as the Assault on Kamino. As a renegade clone of Marek followed the rebels in assaulting Kamino, the training droids became part of the Imperial defense on the Timira City Cloning Facility."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "In physical appearance, the Sith Training Droids slightly resembled their progenitor PROXY. Although they were designed in a thin-skeletal frame, unlike PROXY the training droids' wiring were concealed by metal platings. Another similar characteristic that the droids shared with their \"ancestor\" was the holographic technology that enabled them to mimic the appearance and voice of virtually any humanoid life form. Their combat programming included the knowledge of marksmanship with blasters and basic lightsaber combat techniques."}, {"tag": "h3", "text": "Combat Modules"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sith training droids were based on the design of a holodroid prototype known as PROXY, and thus they possessed the same holographic capabilities and advanced combat programming. Hence, they were able to convincingly imitate all manner of foes, from Rebel infantry to Jedi Knights, in both appearance and fighting style. The droids were located on the Imperial world of Kamino, and there they played an essential role in the cloning facility of Timira City where the Sith Lord Darth Vader conducted a top-secret experiment to create a perfect clone of his late apprentice Galen Marek."}, {"tag": "p", "text": "The various flaws in the cloning process, however, caused the Sith Lord to resort in creating multiple clones of Marek, thereby gradually eliminating the factors that resulted in the growth of highly unstable clones. As a result of constantly repeating the procedure, the droids were frequently sparring with the more stable versions that were deemed worthy enough for training. It was Vader's desire to ensure that the clone who ultimately replaced his original apprentice would not only be just as effective in battle as Marek ever was, but far greater as well. Through the imprinted memories of their genetic template, many of the clones not only learned Juyo, Soresu or Marek's unorthodox style of Shien, but also the fighting styles of Ataru and Niman. By having many of the clones wield dual-lightsabers in order to master the arts of Jar'Kai, Darth Vader intended that his new apprentice would be an even deadlier and more destructive combatant than Marek ever was in his lifetime. Thus, half of the purpose behind the Sith training droids was in the development of the clones' fighting styles and Force techniques."}, {"tag": "p", "text": "The other half of their purpose was through the droids' holographic abilities. To determine the mental stability of the clones and their readiness to detach from the imprinted emotions left behind by Marek, the droids would regularly assume numerous different forms, from average soldiers of the Rebel Alliance to the few individuals who deeply affected Marek prior to his passing. This part of the experiment proved to be the most troublesome with the more stabilized clones. Although Vader came increasingly closer to a fully stable version, he was forced to go through a series of clones that could not fulfill their training by striking down the droids disguised as those who Marek knew or cared about. Some clones refused to attack their progenitor's father while others could not bare to attack the young boy that Marek had been prior to his abduction by Vader from Kashyyyk."}, {"tag": "p", "text": "At least one of the more stable clones absolutely refused to strike down a droid that was not disguised at all. To the surprise of Timira City's lead cloning technician, the clone had no emotional-based difficulty at all when it came to destroying the droids that were disguised as Humans, but became distraught with emotion over a single droid that had short-circuited and was thus unable to utilize its holographic technology. The clone refused to attack the damaged droid, and then smiled and repeated the word \"proxy\" over and over again, thus clearly showing that he had become destabilized over the imprinted memories of Marek's friendship with the droid PROXY, whom he believed to be deactivated before his own death. Although its holographic abilities were inaccessible, the droid's combat programming was still operating efficiently and proceeded to brutally attack the mentally-unstable clone, who was too overcome by Marek's fondness for PROXY to defend himself."}, {"tag": "h3", "text": "Starkiller"}, {"tag": "p", "text": "Just as Darth Vader believed that he was finally on the verge of success, he had to make certain that he was not wrong first. Having been impressed enough by one clone in particular, he decided that another test was required to make sure that the clone would not fail like those that came before him due to the undermining factor of Marek's emotional sentimentality. He declared that Marek was weakened by his emotions and in order to succeed where the original apprentice failed, the clone would have to be strong enough to hate what Marek loved and to be willing to destroy what he created. Hence, several Sith training droids appeared and began disguising themselves as Rebel soldiers. presenting the clone with two red-bladed lightsabers, Vader commanded that the training session commence immediately."}, {"tag": "p", "text": "Like many of his failed brothers, Starkiller had no difficulty in destroying droids that attacked him. As he continued to effortlessly annihilate his opponents, he felt little to no sentiments over the droids that were disguised as soldiers of the Rebellion. As a clone, he understood that the Alliance was not his creation, but rather that of a man whom he was created from. The clone was also determined to serve Darth Vader by proving himself worthy to be the Dark Lord's Sith apprentice and was not about to let an obstacle like training droids prevent him from accomplishing his ultimate goal. But like many of the clones before him, he too was stopped by certain memories and emotions that one droid was able to bring to the surface."}, {"tag": "p", "text": "The clone recognized the droid in the form of a beautiful woman who seemed increasingly familiar to him. Staying his blades at the last possible moment, he finally recognized her as Captain Juno Eclipse, the former Imperial pilot that Marek fell in love with. As a result, the original apprentice's emotional attachment to Eclipse almost immediately seized control of the clone, thus preventing him from being able to strike her down. Although he knew that she was just a droid and not the real Juno, the clone understood that the test was purely symbolic: striking it down would mean severing himself completely from the feelings that belonged to his genetic template. Although he tried with great effort to follow his Master's order, Marek's love for Juno caused him to lower his head in defeat and deactivate his lightsabers in failure—much to Vader's disappointment."}, {"tag": "p", "text": "Having proven himself to be just another failure, the clone narrowly escaped death at Vader's hands. Overcome by Galen Marek's feelings for Juno, the clone succeeded in escaping from Kamino in order to set out on a journey to find the woman who had become the sole focus of his entire existence. Circumstances later forced the clone, by then known by Marek's former codename \"Starkiller\", to return to Kamino where the training droids would fight once more with the rogue clone."}, {"tag": "h3", "text": "The Dark Apprentice"}, {"tag": "p", "text": "Unknown to the clone who went rogue and escaped from Kamino, Darth Vader was well on the way to perfecting the cloning process. At some point between the creation of various failed clones (including Starkiller) and the Assault on Kamino, the Dark Lord had been occupied with personally overseeing the development of the only perfect clone of the original Starkiller. Early in the latest clone's training, he was tested against the Sith training droids. Although he succeeded in destroying them, he was nevertheless troubled by the imprinted memories that were used to train him in his inherited abilities. Vader, all too aware of the side-effects and the constant failures that they produced, complimented the clone on his skills but also warned that they came with Marek's weaknesses as well."}, {"tag": "p", "text": "Although Vader's approval of the clone steadily grew in a short amount of time, one disappointment after another taught him to be cautious as many clones progressed far, only to fail in the end. But as the clone pressed on with a determination to avoid the fate of his brothers, Vader came to see that his experiment was nearly reaching success at last. As a final test for the clone to prove once and for all that Galen Marek's memories and emotions no longer hindered him, the clone was ordered to strike down a training droid disguised as Juno Eclipse. Like his renegade brother, the clone was initially affected by his progenitor's memories of Juno, and thus Vader needed to know if the clone would also turn out to be a failure because of Marek's love for the former Imperial Captain."}, {"tag": "p", "text": "But unlike his imperfect counterpart, the latest and most perfected clone proved himself to be the only stable version who could not be controlled by the feelings of Vader's deceased apprentice. In striking down the disguised droid, he had severed what little emotional imprints remained within him and thus proved himself to be the worthy disciple that Vader painstakingly endeavored to create. In effect, the program of the Sith training droids was also fulfilled with the virtual completion of the Dark Apprentice's trials. But their usefulness to Vader would not end there, as seen in the conflict that would erupt on Kamino shortly after the success of the dark clone."}, {"tag": "h3", "text": "The Battle of Kamino"}, {"tag": "p", "text": "When Juno Eclipse was abducted and transported to Kamino, Starkiller returned to his homeworld and infiltrated Timira City while Alliance forces engaged the Imperials in battle. As the clone ascended further to the top of the cloning facility, he was confronted by Darth Vader and several Sith Training Droids. Declaring that the clone would either return to the Dark Lord's service or die in the very place where he was created, Starkiller made his choice and prepared to fight his former Master and the training droids. Relying more on evasive tactics to stall and tire out the clone rather than engage in a direct approach, Vader stood back while the training droids assumed the appearances of various individuals from Galen Marek's past."}, {"tag": "p", "text": "The distraction was not successful the second time around. Starkiller had centered his mind on rescuing Juno at any cost and did not hesitate to strike down the disguised droids. Dispatching the machines with little effort, Starkiller directly confronted Vader, only to discover that the \"Dark Lord\" was just another training droid in disguise. With the last of the droids destroyed, Starkiller ascended further up the facility to confront the \"real\" Darth Vader."}, {"tag": "p", "text": "During the fighting in Timira City, PROXY took notice of the scattered remains of the Sith Training Droids that had been destroyed in the wake of Starkiller's rampage in the cloning facility's spire. After the Alliance forces defeated the remaining Imperials and captured Darth Vader himself, PROXY approached Juno Eclipse and asked for permission to salvage the droids' components. He realized that they were modeled after his design and calculated that their pieces could be used to not only repair his heavily damaged body, but could also restore his primary programming as well. Though technically a droid devoid of Human emotion, Juno could see that PROXY was quite anxious to have the opportunity to rebuild himself back to his former state. Seeing no significant reason to reject the droid's request, Juno acquiesced to PROXY's request but urged him to do so with haste. Elated, PROXY wasted no time in hurrying to collect the components that he required from the training droids."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}