{"url": "Sith_amulet", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Sith amulets"], "nodes": [{"tag": "h1", "text": "Sith amulet"}, {"tag": "p", "text": "A Sith amulet, sometimes known as a Sith talisman, was a powerful Sith artifact used to amplify the effects of Sith magic. Sith amulets resembled jewelry, and were usually worn around the neck or hand in a medallion or gauntlet style respectively. These \"baubles\" were used by Sith Lords to channel immense dark side power."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Sith amulets could grant the wielder the ability to read and understand ancient Sith text, which was how Satal Keto learned to read the Sith magic book he stole. In combat, Sith amulets were capable of channeling dark side power into beams of lethal energy to be blasted outwards from the wielder's hand. Some amulets were protective, such as the Gauntlet of Kressh the Younger, or talismans which could repel weapons fire, Force effects, or even lightsabers depending on the focus and strength of the wearer. The Sith amulet of Lord Rin Shuuir could be used to heal grave wounds. Sith amulets could generate images like a holoprojector; Gav Daragon once used an amulet given to him by Dark Lord Naga Sadow to record a message with Force-projected images for his sister Jori, and Exar Kun applied this ability to show his group of Jedi defectors a Force-projected image of how Kun destroyed Freedon Nadd."}, {"tag": "p", "text": "An amulet belonging to the Dark Lord Kaan ended up being integrated into the glove of the later Dark Lord Darth Vader. The Amulet of Kalara was another Sith amulet, found by Jedi Knight Ben Skywalker, whose powers and abilities were unknown."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sith amulets were popular during the days of the Sith Empire. Karness Muur, a member of the Dark Jedi Exiles, was gifted his own unique amulet, the Muur Talisman, by his fellow Jen'jidai Sorzus Syn, an amulet in which his spirit resided after his physical death. Later Sith Lords of the Golden Age of the Sith such as Ludo Kressh and Naga Sadow also owned and wore Sith amulets to amplify their power."}, {"tag": "p", "text": "King Ommin of Onderon owned numerous Sith amulets, one of which he wore occasionally around his neck. In 3998 BBY, Ommin gifted another of his amulets to the future Krath leader Satal Keto, which was later acquired by the then- Dark Jedi Ulic Qel-Droma. Exar Kun also acquired Naga Sadow's ancient amulet from the spirit of Freedon Nadd. When he deemed his training complete under Nadd, Exar Kun used the amulet to vanquish the Dark Lord's spirit, as well as the ancient abominable dark side monsters inhabiting the Massassi temples on Yavin 4. It was later discovered that the amulet in the possession of Exar Kun was the mate of Ulic-Droma's. Thus, while the pair dueled in the Krath's Iron Citadel, their amulets recognized each other and sprang to life. Spirits of ancient Sith Lords suddenly appeared, among whom was the spectre of the Dark Lord Marka Ragnos, who declared Kun and Qel-Droma the harbingers of a new Sith-ruled empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}