{"url": "Sith_Warrior", "categories": ["Category:Legends articles", "Category:Sith ranks", "Category:Sith Warriors"], "nodes": [{"tag": "h1", "text": "Sith Warrior"}, {"tag": "p", "text": "Sith Warriors, described as \"an unstoppable force of darkness,\" were combat specialists of the reconstituted Sith Empire, and served as the champions of the battlefield, entrusted with the task of destroying the Empire's enemies and enforcing Sith domination across the galaxy. Trained to rely on the emotions of fear, anger, and hatred to improve their connection to the dark side of the Force, they channeled its power through their bodies and purged weakness from themselves."}, {"tag": "p", "text": "In contrast to the Sith Inquisitors, Warriors had little patience for careful planning, and wasted no time with such manipulations. Instead, they demanded absolute obedience from their followers, relying on power and intimidation to attain their ends. However, such blunt methods did not reduce them to single-mindedness, and Sith Warriors had been known to go renegade in order to pursue their own agendas. The Sith were known for their red lightsabers."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The combat specialists of the returned Sith Empire, Sith Warriors channeled their anger and hatred to purge their body and mind of weakness, and focused on becoming beings of pure and lethal efficiency. Determined to eradicate the Jedi Order and rule the galaxy through fear and intimidation, Warriors had little patience for the calculated and careful planning favored by many of their compatriots, preferring instead to simply crush their foes. They demanded absolute loyalty from their followers, and in turn demonstrated such traits towards their own Sith masters, often surprising enemies and allies alike with their self-discipline and strong sense of honor."}, {"tag": "p", "text": "Some Sith Warriors went renegade and pursued their own agenda, though all such Darksiders could be trusted to never be far from the action. Their fierce hatred of the Jedi ensured that they would be at the forefront of any conflict with the Galactic Republic, though this uncompromising bloodlust did not render them tactless and single-minded. Due to their passionate dedication to their goals, Sith Warriors were natural leaders, inspiring both fear and undying loyalty amongst their allies. While they had little patience for failure, Warriors understood the need for strength in numbers against their foes."}, {"tag": "h3", "text": "Armor and armaments"}, {"tag": "p", "text": "While Sith Warriors relied heavily on the strength of the Force for their power, their approach to combat was very pragmatic, and they had no compunction about heavy armor or cybernetic augmentations. In fact, Warriors often favored such dangerous and experimental technologies, with the goal of imbuing themselves with great physical strength and fortitude."}, {"tag": "p", "text": "For their armament, Sith Warriors typical wielded standard lightsabers. However, in keeping with their pragmatic mindset, their lightsabers often featured more technical, squared-off designs, especially compared to the more esoteric models favored by Sith Inquisitors, or the more rounded Jedi lightsabers. However, as their entire equipage was geared towards forcing opponents onto the defensive, Warriors had been known to favor more unorthodox lightsaber disciplines, such as dual-blades."}, {"tag": "p", "text": "All in all, a Sith Warrior's equipment and weaponry was designed to accentuate his/her combat prowess."}, {"tag": "h3", "text": "Combat tactics"}, {"tag": "p", "text": "Sith Warriors utilized bold lightsaber combat tactics and sudden bursts of Force powers, designed to force opponents onto the defensive before killing them. Considered unrivaled lightsaber duelists, Warriors utilized combat forms geared towards brute force, hammering their foes into submission with strong, crushing blows. Though their lightsaber was their prime method of attack, Sith Warriors did not neglect their skills in other areas of the Force, using it to paralyze, terrify, and kill. Protected by their heavy armor, Sith Warriors charged into the fray and released their anger and hatred against all who stood against them."}, {"tag": "h2", "text": "Specializations"}, {"tag": "h3", "text": "Sith Juggernaut"}, {"tag": "p", "text": "These Sith specialized in combat endurance and were known for wearing armor that provided them special protection in battle. Relying on the Force to boost their stamina, Juggernauts were capable of shrugging off damage that would destroy others. Charging into the thick of combat, Juggernauts take the brunt of the damage, all the while using the Force to cause terror and despair in enemy combatants. Juggernauts were even capable of draining the energy of their opponents to further strengthen themselves and their resolve."}, {"tag": "h3", "text": "Sith Marauder"}, {"tag": "p", "text": "The term \"Sith Marauder\" originally referred to all Sith combat specialists, though it eventually came to refer specifically to this specialized division of them."}, {"tag": "p", "text": "Whereas Juggernauts focused on stamina and brute force, Marauders focused on speed and efficiency. Relying on the Force to intuit how to maximize every attack, Marauders cut down their enemies in the blink of an eye. Gearing themselves towards seeing every weakness in their foes and exploiting it to the maximum, Marauders never hesitated nor faltered, and were considered the swiftest bringers of pain and damage in the galaxy."}, {"tag": "p", "text": "They specialized in dual-lightsaber combat, a fighting form they utilized with unmatched aggression."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A war-like organization, the Sith long made use of combat specialists, who focused on strength and power through rage, though at the cost of a more in-depth understanding of the Force. One of the early Sith Lords styled himself as a Sith Warrior. The Sith Triumvirate trained such warriors at the Trayus Academy on Malachor V, referring to them as \"Sith Marauders.\" This was one of the heights of their strength, though it was swiftly brought crashing down when Jedi Knight Meetra Surik stormed the Trayus Academy in search of Darth Traya."}, {"tag": "p", "text": "Under the reconstituted Sith Empire, Warriors were trained on Korriban, arriving on the planet at a young age as Sith Acolytes. Trained in the dark side of the Force, these fledgling Sith Warriors were taught to hate the Jedi, aspiring to destroy the Galactic Republic. As part of their training, they were eventually apprenticed to a Sith Lord, who tutored them individually. However, this training method was in fact quite common amongst the Sith, and not exclusive to Warriors. The Sith Warriors led the charge during the Great Galactic War, and notables such as Darth Malgus rose to prominence among them."}, {"tag": "p", "text": "Darth Malgus was something of an oddity among the Sith, as he lacked the speciesist bias that marked so many of his compatriots, and had little compunction over hiring mercenaries. While a dissenting voice within the Sith political circles, Malgus lacked a power base of his own, and could be counted on to take orders, tactics which protected him from other Sith Lords who would no doubt have otherwise moved against him. During the war, he led the Sith campaign on Alderaan, laying waste to most of the planet. He also led, with the help of his arch-rival Adraas, a contingent of fellow Sith Warriors during the Sacking of Coruscant, storming the Jedi Temple. During the Cold War, Malgus and other warriors led expeditions into the Unknown Regions, furthering the influence of the Sith Empire."}, {"tag": "p", "text": "Sith Warriors continued to see use amongst the various Sith regimes, with Lord Skere Kaan's Brotherhood of Darkness establishing specialized Sith academies for the training of such fighters. However, Sith Warriors were effectively abolished by the Rule of Two Sith, as the individualized teaching methods utilized by the covert group rendered wide-scale classifications obsolete."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the game Star Wars: Knights of the Old Republic II: The Sith Lords, the Jedi Exile sends a strike team of three to the tomb of Freedon Nadd at one point in the story. These three characters travel into the tomb, fighting Sith troopers and Dark Jedi alike. When they first enter the tomb, the player is shown a cutscene of two Sith fighting hand-to-hand, presumably Sith Warriors. Later, at the entrance to the tomb chamber, there are two Sith, wearing the same garb as the prestige-class Sith Lords, and carrying the name \"Sith Warrior.\" They attack the three characters with nothing but their fists."}, {"tag": "p", "text": "The Sith Warrior is a playable class in Star Wars: The Old Republic, and includes the Sith Juggernaut and Sith Marauder advanced classes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}