{"url": "Sith_artifact", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Sith artifacts"], "nodes": [{"tag": "h1", "text": "Sith artifact"}, {"tag": "p", "text": "Sith artifacts or relics were items, often ancient, created or used by the Sith, a sect of malevolent Force-sensitives. Close proximity to such items could affect people, and a large number of Sith artifacts gathered together could create a wellspring of evil energy. Darth Sidious, a Sith Master who ultimately became the supreme ruler of the Galactic Empire, collected such artifacts. During the Clone Wars, part of his collection was stored in the Grand Republic Medical Facility, though some items like the Sith Chalice were located in the office Sidious used as Supreme Chancellor Sheev Palpatine. After he became the Emperor, most of his artifacts were moved to the Imperial Palace, although many others were stored inside his luxury pleasure craft, the Imperialis. Notable Sith artifacts included the Sith Chalice, the Great Crystal of Aantonaii, various Sith scrolls, the mask of Viceroy Exim Panshard, Darth Sidious' spirit urns, and the mask of Lord Momin."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Before the Fall of the Republic, the Jedi Order took the Mask of Lord Momin following his demise[source?] and stored it in the Jedi Temple's secret vault within the Jedi Archives. During his time as Supreme Chancellor, Palpatine sent a Expedition to Malachor that retrieved a Sith Chalice. Palpatine kept the Chalice and several Spirit urns in his office in the Senate Office Building. Palaptine kept several artifacts such as the Great Crystal of Aantonaii and several Sith scrolls in the Grand Republic Medical Facility."}, {"tag": "p", "text": "Following Palpatine's ascension to Emperor, Lord Vader discovered the Jedi Archives vault. He had many of his artifacts move to his Palace. Other artifacts were kept aboard the Emperor's pleasure craft, the Imperialis. He also acquired the mask of Viceroy Exim Panshard. During the Galactic Civil War, the crossguard lightsabers of Darth Atrius were found by the smuggler Sana Starros on Hradreek."}, {"tag": "p", "text": "Following the death of Supreme Leader Snoke at the hands of Kylo Ren, his apprentice and master of the Knights of Ren, Ren assumed the title of Supreme Leader and tasked the First Order Raider stormtroopers with searching for ancient Sith artifacts. According to the Resistance spy Vi Moradi, Ren looked favorably upon any scouting party that returned with Jedi or Sith artifacts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}