{"url": "Sith_apprentice", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Sith acolytes and apprentices", "Category:Sith ranks"], "nodes": [{"tag": "h1", "text": "Sith apprentice"}, {"tag": "p", "text": "A Sith apprentice was a Force-sensitive individual trained by a Sith Master to use the dark side of the Force. The age at which a Sith apprentice began their training varied. Darth Maul became apprenticed to Darth Sidious while still a child. Darth Tyranus and Darth Vader, both former members of the Jedi Order, became Sidious' apprentice, in turn, as adults. Although Darth Bane's Rule of Two mandated that only two Sith could exist at any given time, Tyranus broke with the system by training his own apprentices (albeit at different times)—Asajj Ventress as an assassin, Savage Opress, and Quinlan Vos—while still apprenticed to Sidious."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Sith Masters demanded absolute loyalty from their apprentices, but would betray and replace them if they felt stronger potential in another. Younger apprentices made ideal candidates for masters to turn to the dark side of the Force, as they lacked the emotional control of a fully fledged Jedi Knight. Inexperienced youth were easier to taint and twist to the purposes of the Sith."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Always two there are"}, {"tag": "p", "text": "Following the infighting among the Sith, the surviving Sith Lord Darth Bane created the Rule of Two, stating that there shall only be two; a master to embody the power and an apprentice to crave it. Bane then took an apprentice, Darth Zannah, who was able to evade the Jedi Order when they apparently killed Bane, although it was rumored that Zannah killed Bane in a lightsaber duel on Ambria. The Sith carried out the tradition in secret from the Jedi for over a millennium. Over the centuries of secret actions against the Jedi, Sith apprentices had a tradition of using special starships known as Sith Infiltrators."}, {"tag": "p", "text": "Sometime before the Invasion of Naboo, the Sith Lord Darth Sidious was trained by Darth Plagueis. They sought to achieve immortality and control the galaxy as equal rulers of a new Sith Empire. However, Sidious killed Plagueis in his sleep after learning everything he needed from him. The Sith tradition continued through Sidious and his own apprentice, Darth Maul, son of the Nightsister Mother Talzin."}, {"tag": "p", "text": "During Maul's training, his master brought him to Malachor, a planet that had been scourged by the conflict between the ancient Jedi and Sith. While Sidious approved of Maul's hatred for the Jedi, sensing the power that Maul gained from it, he wanted to teach his apprentice to temper his bloodlust with patience, lest Maul's activities on Coruscant revealed the Sith's return to the Jedi Order. The resulting Force vision that Maul experienced taught him that rage alone was not be enough to defeat the Jedi, who held an advantage over the Sith in numbers as well as the trust of the Galactic Republic."}, {"tag": "h3", "text": "Darth Maul's replacement"}, {"tag": "p", "text": "Although Maul survived his battle with Padawan Obi-Wan Kenobi, Sidious replaced him by taking a new apprentice, Darth Tyranus who formed the Confederacy of Independent Systems. However, Sidious did not consider Tyranus as a true apprentice, but rather a placeholder and a tool for creating instability. To that end, Tyranus eliminated Jedi Master Sifo-Dyas and took control of his clone army. He also recruited the bounty hunter Jango Fett to be the clone template, and around this time he erased the data on Kamino from the Jedi Archives. Tyranus further ensured the success of his master's plans, allowing the Separatist Crisis to escalate into the Clone Wars before personally delivering the plans to the ultimate weapon to Sidious on Coruscant."}, {"tag": "p", "text": "For three years, Tyranus led the Confederacy against the Republic. During this time, Tyranus trained the Dathomirian assassin Asajj Ventress. Although Ventress endeavored to prove herself as a worthy apprentice, Tyranus was forced to discard her during the Battle of Sullust when Sidious grew suspicious of their relationship. He subsequently searched for a new apprentice on Dathomir, Ventress' homeworld, where he found the Nightbrother Savage Opress. With Opress at his side, Tyranus resumed his plan to overthrow his master until he discovered that the Zabrak was part of Ventress' plan to get revenge on him. He later tried to turn the Jedi Quinlan Vos to the dark side, believing they could overthrow Sidious together as master and apprentice. However, Vos would betray him after Tyranus killed his lover Ventress with Force lightning."}, {"tag": "h3", "text": "The Emperor's enforcer"}, {"tag": "p", "text": "Tyranus remained Sidious' apprentice while Opress' training was continued by his brother Maul. Their claim to the mantle of the Sith led Sidious to confront his former apprentice, resulting in Opress' death and Maul's capture. Sidious ultimately sacrificed and betrayed Tyranus in favor of a younger and stronger apprentice who had more potential, the Jedi Knight Anakin Skywalker who was also the Chosen One destined to bring balance to the Force by destroying the Sith. After manipulating Anakin with promises to grant him the power to save his wife and convincing him that the Jedi were holding him back, Sidious managed to turn Skywalker to the dark side. Skywalker pledged his allegiance to Sidious, becoming a Sith apprentice under the name of Darth Vader. However, Vader was unable to fulfil potential after he was severely injured in a duel with his former master Obi-Wan Kenobi. They ruled the Galactic Empire for a generation with Sidious as Galactic Emperor and Vader maintaining his status as a Sith apprentice."}, {"tag": "p", "text": "During the Galactic Civil War, Vader tried to convince his son, Luke Skywalker, to become his apprentice and rule the galaxy as a family. Sidious had similar plans, intending to replace Vader with Skywalker. He goaded Skywalker to kill his father in order to assume his place as a Sith apprentice, but Skywalker resisted the dark side and inspired Vader to destroy his master at the cost of his life."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After returning from death, Sidious conspired to train Vader's grandson, Kylo Ren, by using the strandcast Snoke as a proxy master. Although Ren was not a Sith, he was a product of Sith teachings as well as Jedi training."}, {"tag": "p", "text": "It was traditional for a dark side apprentice to kill his master in order to achieve his ascendancy. However, Sidious managed to bypass this custom by having Snoke die in his place. Ren sought to destroy Sidious, who considered himself to be Ren's true master, having sworn to never serve another master after Luke Skywalker and Snoke. By then, Ren aspired to rule the galaxy as the new Emperor and Dark Lord of the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}