{"url": "Sith_Intelligence", "categories": ["Category:Legends articles", "Category:Intelligence", "Category:Sith Empire organizations", "Category:Sith Intelligence personnel"], "nodes": [{"tag": "h1", "text": "Sith Intelligence"}, {"tag": "p", "text": "Sith Intelligence was the successor of the Imperial Intelligence of the Sith Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the near collapse of Imperial Intelligence at the hands of the Star Cabal during the Galactic War, the Dark Council took the opportunity to dissolve the weakened organization permanently. In place of the old department, they planned to form a new Sith Intelligence to operate as the Sith Empire's new intelligence arm. Unlike its predecessor, which maintained a degree of independence from its Sith overlords, Sith Intelligence was to be overseen directly by the Sith."}, {"tag": "p", "text": "Following a battle on the moon Yavin 4 against the Revanites, Darth Marr placed Lana Beniko in charge of Sith Intelligence."}, {"tag": "p", "text": "Sith Intelligence's operations moved to Ziost, where the former Sith Emperor, Vitiate, began possessing combatants on both sides during the Republic's invasion of the planet. The organization was later left in disarray following Vitiate consuming all life on the planet. Minister Beniko planned on restoring Sith Intelligence by making their operations mobile. However, whatever progress was being made was lost in the chaos that followed the hitherto-unknown Eternal Empire's assault on the galaxy at large. Five years later, the former Minister may have been heard to remark that most of its assets were lost in the fighting and that she was no longer part of the organization. She was unclear if any attempts at reconstructing it had been made or succeeded, adding that the new leader of the Empire, Darth Acina, seemed to prefer relying on technological surveillance rather than direct intervention."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Regardless of players choices, the former Minister of Intelligence tells Cipher Nine that the Dark Council is planning to form a new Sith Intelligence, rather than rebuild Imperial Intelligence."}, {"tag": "p", "text": "Should the player hand the Black Codex over to the Dark Council, the Minister explains that there will be a place in the new intelligence agency for Cipher Nine, likely headed by people like him/her. Should the player keep the Black Codex then the they are given the option to either use it to flee and work as an invisible agent of the Empire, or to remain in the Empire and \"make it a better place\". Finally, should the player choose to hand over the codex to Ardun Kothe, then the Minister tells Cipher Nine that the Empire will likely perceive him/her as a renegade."}, {"tag": "p", "text": "Additionally, if the player is an Imperial Agent in the Knights of the Fallen Empire expansion, shortly after landing in the Endless Swamp, Lana Beniko will reveal what she knows of the fate of Sith Intelligence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}