{"url": "Sith_civil_war_(Republic_Dark_Age)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Civil wars", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Sith civil war  (Republic Dark Age)"}, {"tag": "p", "text": "At some point during the final century of the New Sith Wars, a civil war erupted among the ranks of the New Sith, a resurgent Sith Empire of the Sith Order that originally emerged in 2000 BBY. By 1100 BBY, the Sith had achieved a long-lasting streak of domination in their crusades against the Galactic Republic and the Jedi Order, beginning an era known as the Republic Dark Age. Despite their impending conquest, the power-hungry Lords of the Sith were unwilling to unite under a single leader, becoming mired in a string of disagreement and treachery that ultimately left their empire fragmented."}, {"tag": "p", "text": "In the wake of their internal strife, a number of independent Sith warlords continued their bloody campaigns throughout entire star systems, collectively maintaining a dominant presence in the galaxy's Outer Rim. The relentless Sith aggression did not persist unopposed, however, and eventually provoked direct intervention by a Jedi Master known as Skere Kaan. In 1010 BBY, Kaan denounced the Republic and the Jedi for their inability to halt the decline of galactic civilization. Abandoning the Jedi Order, Kaan rallied a group of likeminded peers called the \"Brotherhood\", setting out to vanquish the Sith remnants on his own terms."}, {"tag": "p", "text": "Under the pretense of reforming the Republic, Kaan and his Brotherhood waged a months-long campaign against the scattered Sith enclaves. Within a year, the most powerful of the Sith warlords were either destroyed or intimidated into surrender, earning Kaan commendation from the Jedi Order. Unknown to the Jedi and the Republic, the Jedi Master had been plotting against his former allies the whole time, assuming the mantle of Dark Lord and uniting the surviving Sith factions to his doctrine of \"Rule by the Strong\". Setting his plans into motion, Kaan organized his twenty thousand followers into a new Sith faction called the Brotherhood of Darkness, initiating the final phase of the New Sith Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}