{"url": "Sith_Warrior_(Galen_Marek)", "categories": ["Category:Legends articles", "Category:Dark side", "Category:Force entities", "Category:Sith Warriors"], "nodes": [{"tag": "h1", "text": "Sith Warrior  (Galen Marek)"}, {"tag": "p", "text": "The Sith Warrior, also known as the Dark Apprentice, was the incarnation—created through the Force—of the darkness that resided within Starkiller, a young Human male who was secretly trained in the ways of the dark side by the Sith Lord Darth Vader. A Sith in all but name, Starkiller spent years honing his skills in lightsaber combat and Force techniques as Vader's secret apprentice and personal assassin. Aside from being the depiction of Starkiller's \"dark side,\" the Sith Warrior was essentially the culmination of what the Starkiller could have become; a Dark Lord of the Sith, encased in a suit of armor painfully grafted to his body, who succeeded Vader as the apprentice of Darth Sidious."}, {"tag": "p", "text": "When Starkiller infiltrated the Jedi Temple on Coruscant for a third and final time, his search for further information on his dead father consequently led to his completion of the Jedi Trials. Trapped in an unconscious state during the final phase of the test, Starkiller was confronted by the Sith Warrior. After a long and brutal duel, Starkiller ultimately emerged victorious. But as he regained consciousness, the specter declared that Starkiller would never escape him."}, {"tag": "p", "text": "The Sith Warrior later resurfaced on the planet Kashyyyk through another Force vision. But unlike the event in the Jedi Temple, he appeared through Starkiller, who saw himself garbed in the same armor that the warrior possessed. As the Sith Warrior, Starkiller fought and defeated a Jedi Knight in his vision, only to discover immediately afterward that the opponent was his own father."}, {"tag": "p", "text": "Starkiller ultimately avoided the future that the Sith Warrior represented. He reclaimed his birth name, \"Galen Marek,\" and re-embraced his Jedi lineage, just before he saved the Rebel Alliance from a premature end at the cost of his own life. Marek's sacrifice not only prevented the destruction of the Alliance, but also spared him from the fate that the Sith Warrior represented—a life as Darth Sidious' slave, trapped inside an armored suit for the purpose of life support."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Trial of the Spirit"}, {"tag": "p", "text": "In the year 2 BBY, Darth Vader's secret apprentice, codenamed Starkiller embarked on a personal journey to rediscover his origins. The years of training under the relentless tutelage of the Dark Lord of the Sith effectively suppressed the memories of his past and the death of his Jedi father. His search for answers brought him to the ruins of the Jedi Temple, the former headquarters of the fallen Jedi Order, located on the capital world of the Galactic Empire. When the apprentice discovered a holocron inside the Temple's Tower of First Knowledge, a gatekeeper appeared in the form of his father and implored him to complete the Jedi Trials."}, {"tag": "p", "text": "As a result, the apprentice slipped into a state of unconsciousness as his mind was overtaken by a vision in the Force. Within the depths of his own psyche, Starkiller was confronted by his connection to the dark side of the Force, personified in the form of an armored Sith Warrior. Though Starkiller was unaware of the true nature of his opponent, the Sith specter was also a vision of a future in which Starkiller succeeded Darth Vader as Emperor Palpatine's dark apprentice."}, {"tag": "p", "text": "As their duel escalated in ferocity, an attack from Starkiller caused the Sith Warrior's helmet to fall off. However, the revelation of his opponent's identity caused Starkiller to freeze from the shock of what he saw. Though extremely pale and scarred on the forehead, and with eyes that reflected a deep immersion in the dark side, the Sith Warrior possessed Starkiller's face."}, {"tag": "p", "text": "The Sith Warrior pressed his attack and forced Starkiller on the defensive. As the fight continued, he alternated between his own form and the appearance of Starkiller dressed in the ceremonial robes, posthumously awarded to Jedi Knights after death. Yet despite the warrior's combination of saber strikes and Force attacks, Starkiller ultimately emerged victorious after he stabbed the warrior with a lightsaber through the abdomen."}, {"tag": "p", "text": "As a result, the Sith Warrior's body was consumed in a blinding flash of light. Starkiller found himself back inside the chamber where he found the holocron just before his last trial commenced. But when he looked down at his left hand, he saw the pale skin and clawed fingers of the Sith Warrior, whose voice echoed with the declaration that the apprentice would never escape his dark fate. At that moment, the vision ended and left Starkiller uncertain about the exact meaning of what he had just witnessed."}, {"tag": "h3", "text": "Kashyyyk"}, {"tag": "p", "text": "During a mission on the Wookiee homeworld of Kashyyyk, Starkiller discovered a ruined and abandoned hut. Despite the feeling of a vague sense of familiarity, his repressed memories of the past prevented him from recognizing the ruin as the home of his father, Kento Marek. Upon inspecting the hut, Starkiller saw evidence of a lightsaber duel, and also discovered a blue crystal on the floor. But just as he collected the artifact, the apprentice fell into another Force-induced vision, in which he witnessed and relived a past battle on Kashyyyk through the eyes and actions of his own master, Darth Vader. Through the Dark Lord, the apprentice saw the defeat of the Wookiees, the murder of his father and his own abduction by Vader."}, {"tag": "p", "text": "The vision suddenly changed and Starkiller, much to his horror, found his appearance altered into the armored form of the Sith Warrior. Trapped within a body composed of both flesh and machine, the apprentice felt more mechanical than alive. Overall, his physical state felt eerily similar to what his master experienced as a cyborg. As Starkiller inspected his new form, he was confronted by another version of himself, one who embraced the light as a Jedi Knight."}, {"tag": "p", "text": "Embodied and overtaken by the Sith Warrior, Starkiller activated a red-bladed Sith lightsaber and adopted the Juyo stance because of its reputation as the most vicious form of lightsaber combat. Though the Jedi's eyes contained sorrow and pity in them, he activated his own lightsaber, which produced a blue blade, and took the defensive stance of Soresu. Starkiller lashed out in a barrage of offensive strikes, and though the Jedi's defensive strategy proved difficult to breech, he knew that Soresu could not indefinitely withstand the attacks of Juyo."}, {"tag": "p", "text": "As the duel dragged on, the dark side that the Sith Warrior embodied became increasingly stronger within Starkiller. When the Jedi seized the offensive, Starkiller relied on his Force abilities to counter his adversary's attacks. Utilizing telekinesis to hurl jagged planks from the walls of the hut at the Jedi, Starkiller took advantage of his opponent's distraction and attacked with Force lightning. The Jedi struggled to overcome the agonizingly painful effects of the Sith attack in order to use his lightsaber as a superconducting loop, which then redirected Starkiller's own attack back at himself. The resulting explosion of Force energy blasted both Sith and Jedi against opposite corners of the hut."}, {"tag": "p", "text": "The pain inflicted by his own attack, as well as the grizzly sight of his brunt flesh, fueled Starkiller's rage and connection to the dark side of the Force. Drawing on his anger, the apprentice willed himself upright and suspended above the floor. With one outstretched arm, he telekinetically lifted his Jedi counterpart in the air, just as Darth Vader had done to Kento Marek years before. The Jedi tried to reason with the apprentice, but to no avail. Starkiller's mind had been overtaken by the dark side, and he laughed gloatingly at his hapless opponent."}, {"tag": "p", "text": "With the Jedi at his mercy, the apprentice unhooked one of the lightsabers from his belted waist and impaled the Jedi's shoulder with it. He then used his lightsaber to finish off the Jedi. Despite this, the Jedi remained alive. Annoyed, Starkiller summoned the Jedi's own blade to his hand and stabbed him. When the Jedi's dead body collapsed on the floor, the apprentice felt the wave of the dark side wash over him. He reveled in the feeling, relished his victory, and saw himself as the living embodiment of power."}, {"tag": "p", "text": "Just then, however, someone else appeared in the hut and exclaimed his remorse over Starkiller's life as a Sith assassin. When the apprentice turned, his lightsaber retrieved and drawn in less time than it took to think about it, he recognized the figure as his late father, the former Jedi Kento Marek. He looked at the body of the fallen Jedi Knight whom Starkiller killed, and then stared once more at the dark side version of his son with grief and loss in his eyes. Before vanishing, he apologized to Starkiller, whom he addressed as \"Galen.\""}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "The death of Galen Marek"}, {"tag": "p", "text": "Starkiller never lived to become what the Sith Warrior represented as a vision through the Force; a cybernetic apprentice and Sith assassin of Emperor Palpatine. His master's second betrayal on Corellia, coupled with Starkiller's attachment to his allies, ultimately left the apprentice disillusioned with the Sith and the Galactic Empire. Hence, he reclaimed his birth name, Galen Marek, and immediately embarked on a mission to rescue the leaders of the newly-formed Alliance to Restore the Republic."}, {"tag": "p", "text": "His infiltration of the incomplete Death Star culminated in a final duel between Marek and his former master, and resulted in the near death of Darth Vader. Though he was tempted to execute Vader at the behest of Palpatine, Marek chose to reject the dark side of the Force. In the end, he sacrificed his life so that the Rebel leaders could be extracted from the battlestation by the Rogue Shadow, piloted by Juno Eclipse. Consequently, Marek's premature death prevented his future as a Dark Lord of the Sith."}, {"tag": "h4", "text": "The clones of Galen Marek"}, {"tag": "p", "text": "Although Galen Marek was dead, the life he could have lived, as reflected by the Sith Warrior, was not destroyed completely. In secret, Darth Vader endeavored to recreate his fallen apprentice. Thus, he brought Marek's corpse to Kamino and preserved it as a clone template. With the advanced technology of the Kaminoans at his disposal, the Dark Lord began a long and laborious task of cloning his former apprentice. The ultimate goal was to create a clone who possessed all of Marek's power and skills, but none of the emotions that Vader perceived as \"weaknesses.\" However, cloning of a Force-sensitive subject's DNA was regarded as a theoretically impossible achievement, and thus the process was full of trial-and-error steps. But after several months had seen the production of various genetic failures, including a renegade clone who escaped from Kamino, a single clone was successfully engineered without any of his precursors' flaws."}, {"tag": "p", "text": "Through the accelerated cloning process, the clone was bred to adulthood within a few standard weeks; memory flashes of his progenitor's life filled him with the knowledge and experience of Galen Marek. The same process had been used on the clones who came before him. The first subjects were physically deformed and far too mentally unbalanced. The more stable versions suffered from an identity crisis, due to the fact that they possessed another man's memories. The clone who proved to be \"perfect\" in Vader's eyes, however, compartmentalized Marek's memories and was successfully able to separate them from his own experiences. As Darth Vader's new apprentice and the only success in a long line of failures, the clone effectively became what the Sith Warrior reflected for Marek—a Sith assassin completely immersed within the dark side of the Force."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Like Starkiller, the Sith Warrior was a proficient practitioner of the dark side of the Force. His range of techniques included Sith lightning and various forms of telekinesis, such as Force push, Force repulse and Force throw. He was also, much like Galen Marek, extremely skilled in lightsaber combat. He was an expert Djiem So practitioner, but also utilised Dun Moch when required. He displayed incredible reflexes and durability, shown in his first duel with Starkiller, where he manages to remain standing against his opponent for a long time and comes close to defeating him. As a \"dark\" mirror version of the apprentice, the Sith Warrior also utilized the unorthodox reverse-grip form of Shien."}, {"tag": "h2", "text": "Armor"}, {"tag": "p", "text": "The Sith Warrior's body was encased within a suit of armor, painfully grafted to his flesh and bone, that was designed to inspire fear in both Jedi and Sith alike. The suit also incorporated cybernetic attachments as well. His fingers had been replaced with artificial claws with blades sharp enough to cut bone. His wrists and forearms were an amalgamation of flesh and machine, which continued up to his shoulders and disappeared under a high, metal collar that protected his neck. The skin that remained on his forearms was scorched and disfigured."}, {"tag": "p", "text": "The armor itself included a ribbed vest of flexible armor plates and a series of leather belts around the wearer's waist. Several lightsabers, ranging from Jedi to Sith design, adorned the belts like trophies. Beneath the armored suit, the Sith Warrior wore tight black garments. His face was fully concealed within a helmet that slightly resembled an Ubese mask, but with a Mandalorian-style visor in the center of the face-plate."}, {"tag": "p", "text": "The overall function of the suit was similar to the armor worn by Darth Vader. Like Vader's mask, the Sith Warrior's helmet included a breathing apparatus, though the mechanism appeared to be controlled by the wearer, as the breathing pattern was forced and eclectic. However, despite its role as a life-support asset, the Sith Warrior's armor excluded the limitations that Vader's armor possessed. Whereas Vader was physically hindered by his armor, which also limited his own ability to utilize the dark side of the Force, the Sith Warrior retained the same speed and agility that Starkiller wielded without the armor. Furthermore, the armor preserved the Sith Warrior's ability to generate Force lightning and did not appear to limit any of his other techniques either."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith Warrior wears the same armor that Galen Marek (codenamed \"Starkiller\") wore in the non-canonical dark side ending of Star Wars: The Force Unleashed. In this alternate conclusion to the video game, Marek turns back to the dark side of the Force and kills his former master, Darth Vader. However, he fails to assassinate Emperor Palpatine, and thus sustains severe injuries to his body. In order to preserve Marek's life, the Emperor encases him within a suit of armor. As the Emperor's new apprentice and personal assassin, Marek becomes Lord Starkiller, thus bringing about the \"dark future\" that the Sith Warrior represented during the Jedi Temple level in Star Wars: The Force Unleashed: Ultimate Sith Edition."}, {"tag": "p", "text": "During the fight between the apprentice and the Sith Warrior in the Jedi Temple level, the warrior occasionally shape-shifts into a Jedi version of Starkiller, dressed in the ceremonial robes that were posthumously awarded to deceased Jedi. Hence, the Sith Warrior's two different forms represented the two versions of the apprentice's fate. In the Sith stalker armor, the warrior mirrors Starkiller's life as Palpatine's apprentice. As the Jedi wearing the ceremonial robes, he reflects the canon ending of the video game—Starkiller's death through sacrifice."}, {"tag": "p", "text": "The Sith Warrior also appears in the novelization. On Kashyyyk, Starkiller experiences a vision in the Force, in which he finds his body altered into the Sith Warrior's armored appearance. As he duels with a Jedi Knight version of himself, Starkiller all but completely surrenders himself to the dark side and is thrilled by the power he gains through it."}, {"tag": "p", "text": "The Sith stalker armor's appearance in the Jedi Temple DLC (Downloadable Content) level in the Ultimate Sith Edition, as well as its inclusion (via a Force vision) in the novel, effectively brings it into the canon. The Sith Warrior's voice and appearance were provided by Sam Witwer, the actor who portrayed Galen Marek."}, {"tag": "p", "text": "There are six lightsabers and extra lightsaber hooks on the apprentice's leather belts in this costume. The first of these \"trophies\" is Starkiller's original lightsaber, lost in the vacuum of outer space after his master's first betrayal. The other weapons include Rahm Kota's lightsaber, retrieved from the defeated Jedi General during the Battle of the TIE Fighter Construction Facility above Nar Shaddaa; the end piece of a lightsaber pike, taken by Starkiller after his victory over Kazdan Paratus on Raxus Prime; one half of the double-bladed lightsaber that belonged to Darth Maul; and Darth Vader's lightsaber, taken from him after his death at the hands of his former disciple. Lord Starkiller's new weapon, a Sith lightsaber that features three spiked emitter guards, is included his belts as well. In the PS2/Wii version, the Sith lightsaber has four emitter guards."}, {"tag": "p", "text": "This battle between Marek and this vision was ranked number four on Game Informer's \"Top 10 video game shadowselves\" in April 2009. It came just behind the likes of Dark Link from The Legend of Zelda: Ocarina of Time, Cecil's duel with his Dark Knight form so he could become a paladin from Final Fantasy IV, and Dark Samus from the Metroid series' Metroid Prime Trilogy coming in at number one."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}