{"url": "Sith_cult/Legends", "categories": ["Category:Legends articles", "Category:Stub", "Category:Sith cults"], "nodes": [{"tag": "h1", "text": "Sith cult"}, {"tag": "p", "text": "A Sith cult or Sith sect was a cult that would praise, and often practice, the teachings of the Sith philosophy. Some Sith cults would also worship one or more specific ancient Sith Lords and practice his or her teachings, sometimes even with the goal of resurrecting the ancient Sith Lord. Some cults would also involve a degree of fetishism, as they were in possession of items that once belonged to the Sith Lord in question and treated them as relics and sometimes even instruments to gain power."}, {"tag": "p", "text": "As with many other types of cults around the galaxy, Sith cults were often led by one (sometimes more than one) charismatic individual that was strong in the dark side of the Force to inspire faith—often accompanied by fear—in his or her followers. However not all Sith cults were Force users, the Cult of Exar Kun being an example of Sith-worshiping non-Force-sensitives."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sith cults were usually secretive, and not many were known. One of the more influential and powerful was the Order of Revan, a secret society in the resurgent Sith Empire. The cult worshipped the Sith Lord Darth Revan and had members in high places in both the Galactic Republic and the Sith Empire. One of their number, Darth Arkous, was even a member of the Empire's Dark Council."}, {"tag": "p", "text": "Early on in Obi-Wan Kenobi's apprenticeship to Qui-Gon Jinn, he met and helped take down multiple Sith cults, usually ones in the possession of a Sith holocron."}, {"tag": "p", "text": "Tavion Axmis's Disciples of Ragnos wreaked havoc around the galaxy during the late Galactic Civil War until they were destroyed by Kyle Katarn's apprentice Jaden Korr and other Jedi from Luke Skywalker's Jedi Praxeum. The sinister Prophets of the Dark Side and the splinter Church of the Dark Side showed many Sith cult characteristics."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Sith Cult\" is a real life Star Wars Fan-Club. It was founded 1997 under the name \"Sith Raise\" and was renamed in 2005 to \"Sith Cult\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}