{"url": "Sith_cave", "categories": ["Category:Canon articles", "Category:Wookieepedia Featured articles", "Category:Caves", "Category:Locations of the Sith", "Category:Mustafar locations", "Category:Vergences"], "nodes": [{"tag": "h1", "text": "Sith cave"}, {"tag": "p", "text": "An ancient Sith cave located deep beneath the surface of the volcanic Outer Rim Territories planet Mustafar served as a locus for the dark side of the Force. Built by the ancient Sith as a Sith shrine to seek the secrets of eternal life, the cave resided in the course of one of the planet's lava rivers on the site of a former Sith temple in the Gahenn Plains, and was strong with dark side energies."}, {"tag": "p", "text": "Shortly after the rise of the Galactic Empire, the newly-christened Sith Lord Darth Vader traveled to the Sith cave to use its energy to bleed a kyber crystal in the construction of his own lightsaber. Vader later decided to build a fortress over the cave that could channel the power of the dark side in order to resurrect his deceased wife, Padmé Amidala. Using designs obtained from the ancient Sith Lord Darth Momin, whose spirit was trapped within an artifact, Vader constructed a massive obsidian castle over the cave that would serve as his personal residence."}, {"tag": "p", "text": "The castle's construction caused natural disasters across the planet, prompting the native Mustafarians to launch an attack on Vader. Although the attack failed, it gave Momin's spirit the opportunity to open a portal through the Force inside the Sith cave and summon his physical body while Vader was distracted with the Mustafarians. However, Momin's resurrection proved short-lived, as Vader killed the ancient Sith Lord and passed through the portal himself. Even though he was unable to save Amidala, the visions Vader experienced throughout his journey into the portal allowed him to accept his fate."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An ancient Sith cave was located among the Gahenn Plains on the volcanic Outer Rim Territories planet of Mustafar and served as a locus for the dark side of the Force. Situated deep beneath Mustafar's fiery surface and housing a Sith shrine, the cave resided in the course of a river of lava, which flowed through and dropped out of the cave as a lava fall. The cave's interior featured various markings on its walls, as well as a round rock table formed at its center."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Seeking immortality"}, {"tag": "p", "text": "The Sith cave resided on the site of a former Sith temple, as well as an ancient castle owned by Lady Corvax, a powerful Force-user obsessed with immortality long before the reign of the Galactic Republic. Corvax's quest eventually led to the devastation of Mustafar, turning the planet into a volcanic wasteland. The legends about Corvax's story later led the ancient Sith to the ruined world, who erected the Sith shrine in order to seek the same secrets of eternal life."}, {"tag": "h3", "text": "Bleeding the kyber crystal"}, {"tag": "p", "text": "Shortly after the formation of the Galactic Empire in the year 19 BBY, the Sith Lord Darth Sidious ordered his newly-christened apprentice, Darth Vader, to steal a Jedi's lightsaber in order to construct one of his own. After obtaining Jedi Master Kirak Infil'a's lightsaber, Vader, again following his Master's orders, traveled to Mustafar, where he had previously suffered severe burns all over his body as a result of his lightsaber duel against his old Jedi Master, Obi-Wan Kenobi."}, {"tag": "p", "text": "To complete the task of constructing his new lightsaber, Vader needed to draw upon the Sith cave's dark energy and bleed the stolen lightsaber's green kyber crystal, which entailed corrupting the crystal with the power of the dark side and turning its color to red in the process. After Vader placed the crystal on the cave's rock table, the markings on the walls began to glow as he experienced a Force vision in which he denounced the dark side, killed Darth Sidious, and returned to Kenobi's side. By re-embracing the darkness, Vader escaped the vision and finally bled the kyber crystal."}, {"tag": "h3", "text": "Building Darth Vader's castle"}, {"tag": "h4", "text": "Return to Mustafar"}, {"tag": "p", "text": "Impressed by the Sith cave's dark power and the possibilities that came with it, Vader later decided to build his own fortress over the dark side locus and make Mustafar his stronghold. The Sith Lord's request was approved by Sidious, who speculated that Vader would perhaps be able to resurrect his deceased wife, Padmé Amidala, by using the dark side energies there. Believing that it could prove useful for Vader's quest, the Sith Master also told his apprentice to take the ancient mask that once belonged to the Sith sculptor Darth Momin, who went against the Sith's legacy of destruction and instead preferred to create artworks that would evoke pain and fear in viewers. The ancient Sith artifact also contained Momin's spirit, trapped inside for many years."}, {"tag": "p", "text": "Vader traveled to Mustafar aboard his late wife's royal starship and was accompanied by Chief Imperial Architect Alva Brenne along with her assistant, Roggo. While Vader was meditating alone inside the cave, Roggo became possessed by Momin's mask and killed Brenne. When Vader returned to the starship parked near the cave's entrance, he found Roggo working on the fortress's design while wearing the ancient mask. The Sith Lord then killed the possessed assistant with his lightsaber and retrieved the hologram of the early design."}, {"tag": "p", "text": "Vader subsequently took the mask with him inside the cave and used the Force to activate it. While the mask's eyes glowed red, Momin's trapped spirit told Vader his story—his sculpting philosophy that he adopted as a youngling, how he was trained in the ways of the dark side by Sith Lady Darth Shaa, and his ultimate defeat by the Jedi before he could complete his \"masterpiece.\" By doing so, the spirit made Vader unconsciously wear Momin's mask instead of Vader's own helmet. Taking off the mask immediately when he came to himself, Vader found an alternate host for Momin by attacking a nearby Mustafarian patrol, capturing a Northern Mustafarian named Sssp, and forcing the captive to wear the mask."}, {"tag": "h4", "text": "Designs of Lord Momin"}, {"tag": "p", "text": "Vader and the possessed Mustafarian soon returned to the Sith cave, as Momin suggested that his design for the fortress would finally allow him to create the \"masterpiece\" that he had always wished to build, and that it would also be the key to unlocking the locus's dark power capable of resurrecting Vader's wife and breaking the boundary between life and death. Vader choked the possessed Mustafarian with the Force as a warning against betrayal but nevertheless allowed Momin to proceed with his design."}, {"tag": "p", "text": "An Imperial construction site was soon established around the Sith cave. Imperial magma troopers, AT-ACT and AT-ST walkers, and TIE fighters protected the area against lava fleas, which had been attacking the site since the first construction attempt—a magma trooper speculated it was because the location served as the creatures' breeding ground. After eight failed designs, each of which caused powerful lightning storms and lava overflows across the planet that destroyed the construction, the castle was finally completed by 12 BBY."}, {"tag": "p", "text": "In the final design, several rectangular, inclined stones were placed around the table at the center of the cave, which served as the focusing chamber for the local dark side energies. The massive obsidian tower, designed to channel the power of the dark side, was divided in the middle to resemble tuning forks, and it harnessed Mustafar's lava for energy."}, {"tag": "h4", "text": "Attack of the Mustafarians"}, {"tag": "p", "text": "Positioned in front of the table inside the cave, Vader used the Force to activate the castle, and a burst of light in various shapes shot from the top of the tower and up through the sky. Although he successfully opened a portal through the Force, Vader's effort was interrupted by Captain Junus, commander of the castle's Imperial garrison, who reported to the Sith Lord via comm that they were under assault by a large army of Mustafarians. When Vader left the cave to inquire about the situation, Momin activated the castle and used its power to provoke a lightning strike on Vader outside. Momin soon opened the portal for himself and summoned his physical body, which reclaimed his mask from its possessed host."}, {"tag": "p", "text": "Upon noticing that Vader had joined the battle, Father Kkkt and two other Force-sensitive Mustafarians combined their strength to flood the battlefield with lava, killing both Imperial and Mustafarian combatants alike. As the sole Imperial survivor, Vader retreated to the castle while the remaining natives launched their final attack to destroy the dark fortress. Back inside the Sith cave, the Sith Lord activated the castle in order to erupt the lava in the area surrounding the fortress, which decimated the rest of the Mustafarian army."}, {"tag": "h4", "text": "A portal through the Force and beyond"}, {"tag": "p", "text": "Momin subsequently revealed his resurrection to Vader, and the two Sith engaged in a lightsaber duel inside the cave. Although Momin claimed that the dark side would never allow Vader to reach the other side of the portal and seemingly held the advantage after cutting Vader's lightsaber hand, Vader eventually overpowered and killed Momin by smashing him against the wall with one of the rectangular stones around the table. Having defeated all his enemies, Vader finally reopened the portal to resurrect Amidala."}, {"tag": "p", "text": "While his body was left behind inside the cave, Vader's consciousness passed through the gateway. Inside, Vader faced various figures and events from his past, and he also experienced brief visions of the future, such as his confrontation with his former Jedi Padawan, Ahsoka Tano, at the Sith temple on the planet Malachor. Although he eventually reached a vision of his wife, he was not able to save her, as the apparition rejected him by claiming that Anakin Skywalker, Vader's former self, was dead."}, {"tag": "p", "text": "Vader's vision was ultimately interrupted by the appearance of a distant figure wielding a blue lightsaber—Vader's son, Luke Skywalker, whose existence was unknown to the Sith Lord. As Vader regained his consciousness, he destroyed the gateway by stabbing the rock table with his lightsaber. The portal's destruction caused the lower ground in front of the castle to collapse, revealing the buried castle that once served Lady Corvax."}, {"tag": "p", "text": "Decades later, the First Order's Supreme Leader Snoke wore a ring with obsidian carved from the Sith cave. The golden ring was also etched with glyphs of the Dwartii. Also around that time, Luke Skywalker, who had become the last Jedi Master in existence, included a mention of ancient cave in a book where he chronicled the history of the Jedi Order, titled The Secrets of the Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith cave was created as part of the backstory for Darth Vader's castle, which was designed for Rogue One: A Star Wars Story, the first film in the Star Wars Anthology Series. The cave was first mentioned in The Art of Rogue One: A Star Wars Story, published on December 16, 2016, the same day as the film itself. It made its first appearance in the comic book Darth Vader: Dark Lord of the Sith 5, written by Charles Soule with art by Giuseppe Camuncoli, and released by Marvel Comics on September 6, 2017. The final story arc of the Star Wars: Darth Vader: Dark Lord of the Sith comic-book series, Fortress Vader, further explored the creation of Vader's castle. The 2019 reference book Ultimate Star Wars, New Edition later identified the cave as a Sith shrine. Additionally, LEGO's Darth Vader's castle set features an ancient Sith shrine with a Sith holocron beneath the castle, as a reference to the Sith cave."}, {"tag": "p", "text": "According to Doug Chiang, co-production designer for Rogue One, the idea of a Sith cave beneath Darth Vader's castle originated from a piece of Ralph McQuarrie concept art of Emperor Palpatine's throne room created for the 1983 film Star Wars: Episode VI Return of the Jedi. Chiang found the image of the throne on a lava lake inside a cave compelling and decided that the castle would be built on the foundation of an ancient structure. He intended to give the castle's final design an element of purpose, which was to draw energy from the lava lake much like a dam. Furthermore, Chiang thought that the castle could have a more ancient part below it, in the form of a natural cave where Vader went to meditate."}, {"tag": "p", "text": "While the 2019 Star Wars: The Rise of Skywalker: The Visual Dictionary's timeline establishes that Darth Vader took up residence in \"a newly constructed castle\" on Mustafar twelve years before the first Death Star was readied, \"Darth Vader,\" a 2020 entry in the Star Wars Encyclopedia series of reference booklets, states that the castle was built about five years before the completion of the Death Star. This article assumes the former source, which features a comprehensive timeline of galactic events, is correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}