{"url": "Sith_armada_(Lost_Tribe_of_the_Sith)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Fleets", "Category:Sith military units", "Category:Starships of the Sith armada"], "nodes": [{"tag": "h1", "text": "Sith armada  (Lost Tribe of the Sith)"}, {"tag": "p", "text": "The Sith armada was a fleet of starships captured for use by the Lost Tribe of Sith—descendants of a group of Sith who survived the crash-landing of their warship, the Omen, on the remote planet Kesh in 5000 BBY—with the purpose of conquering the weakened galaxy and reviving the Sith Empire. In 41 ABY, a Sith Meditation Sphere known as Ship arrived on the planet. The Tribe began using Ship to attack vessels, at first to scavenge parts to repair the Omen and later to capture them and expand their fleet. By 43.5 ABY, their armada contained more than two dozen ships. Lady Rhea and her Sith apprentice, Vestara Khai, served in the armada aboard the Eternal Crusader, a starship used by the Sith strike team sent to recover Ship and eliminate Jedi Grand Master Luke Skywalker in 43 ABY. The strike team was decimated by the Jedi, however, with Khai the only survivor."}, {"tag": "p", "text": "Lord Viun Gaalan then led a group of shuttles to Dathomir to retrieve Khai and a group of Nightsisters that she helped to capture. However, after Jedi intervention, Khai was captured. As the Jedi flew into orbit, however, they were taken by surprise by a group of eleven ChaseMaster frigates led by High Lord Sarasu Taalon, who proposed they form an alliance in order to destroy Abeloth, a powerful dark side being. However, the Sith actually intended to force Abeloth to serve them. During the ensuing mission, one ship took part in an illegal raid and was apprehended with its crew condemned to death, and another was obliterated after colliding with debris of the remnants of the destroyed Sinkhole Station. The mission eventually ended in failure for the Sith, as Skywalker defeated Abeloth, and the entire flotilla was sent back to Kesh while the Skywalkers, Taalon, Khai, and Khai's father remained on Abeloth's planet to investigate more about Abeloth."}, {"tag": "p", "text": "Meanwhile, the Sith armada continued to grow with its continuous piracy of vessels, and the Sith prepared their fleet for war. Part of the fleet engaged a wing of Jedi StealthX fighters in battle over the moon Pydyr, but the Sith were forced to retreat. Soon afterward, a Sith flotilla engaged the Jedi over the planet Nam Chorios, but they were again defeated. Part of the armada later defected to join Abeloth. The Sith Tribe then traveled to infiltrate the capital planet Coruscant after the New Jedi Order vacated the world. A small force also attempted to ambush the Jedi academy on Ossus, but the majority of the Jedi forces, assisted by the Hapes Consortium, escaped. Soon afterward, the Sith received a crippling blow with the destruction of their forces on Coruscant."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Sith armada was a fleet in use by the Lost Tribe of Sith—a group of Sith stranded on the remote planet Kesh. The ships in the fleet were varied, ranging from large bulk freighters to warships to a Sith Meditation Sphere. The Sith worked together as a team to acquire vessels, often employing several starships together during an attack. After a vessel was captured by the Tribe, it was towed back to their homeworld of Kesh to be repaired, renamed, and integrated into the armada."}, {"tag": "p", "text": "The first vessel in the armada was Ship, the Sith Meditation Sphere. At first, it served as the leader of the armada; it knew where to take the Tribe to find a new target and was the Tribe's only means of transportation off-planet. Once the Tribe had acquired enough parts, they managed to repair the Omen, the dreadnaught in which the Tribe's ancestors had crashed onto Kesh more than five thousand years prior. With the Omen repaired, the Tribe began capturing vessels, rather than just foraging them for parts, and the fleet quickly grew. By 43.5 ABY, it numbered more than two dozen vessels."}, {"tag": "p", "text": "One of the first vessels to be commandeered was the Eternal Crusader, a warship larger and more powerful than the Omen. It served under the command of Lady Olaris Rhea and was used in the capture of several more vessels. Other capital ships in the armada included several Corporate Sector Authority frigates, two EE-104 Fisheye stealth vessels, and no fewer than twenty-seven ChaseMaster frigates, among them the Black Wave, which served under the command of High Lord Sarasu Taalon, the Starstalker, which was commanded by Captain Vyn Holpur, and the Winged Dagger, which was commanded first by Captain Syndor, then Leeha Faal, and then Syndor again, following Faal's death. The armada employed several Corporate Sector gunships, and among the starfighters used were at least six Javelins and a full wing of Skipray twelve-jays. By 44 ABY, the Sith had spread throughout the galaxy, refining their piracy techniques and preparing a war fleet consisting of hundreds of vessels."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 5,000 BBY, during the Great Hyperspace War, a Sith starship, the Omen, crash-landed on the remote planet of Kesh while attempting to transport Lignan crystals to Sith Lord Naga Sadow. The survivors of the crash eventually formed a group called the Lost Tribe of Sith."}, {"tag": "p", "text": "Ship, a Sith Meditation Sphere, arrived on Kesh in 41 ABY and made contact with the Tribe, revealing that the Sith had been driven from the galaxy, and only a small group remained. The Tribe decided that it was their destiny to restore the Sith Empire, and Ship then told them that it could help them repair the Omen by scavenging parts from other vessels. Ship took the Sith aboard, and for the first time in around 5,000 years, members of the Tribe left the planet's atmosphere and returned to space. Ship called for five Sith to join it in an attack on a Damorian s18 light freighter en route from the planet Eriadu. High Lord Sarasu Taalon, Lady Olaris Rhea, Rhea's apprentice Vestara Khai, Lord Ivaar Workan, and Sith Saber Ruku Myal were chosen for the mission. Ship opened fire on the freighter and forced it to crash on an uninhabited planet. The crew of the ship was then slaughtered by the Sith, and the defeated vessel's parts were scavenged to help begin the repairs on the Omen."}, {"tag": "p", "text": "With the help of Ship, the Sith constructed a simple spaceport for their new armada. Meanwhile, the Tribe began to attack more vessels, leaving no being left alive to reveal the location of their homeworld. Eventually, the Omen was completely repaired, and it became the first vessel to serve alongside Ship in the armada. The Tribe continued their attacks, now capturing vessels and pressing them into service in the fleet. The new lifestyle forced the spacefaring Tribe members to change their clothing and weaponry to be more efficient for their new duties. By 43.5 ABY, the armada numbered more than two dozen starships."}, {"tag": "h3", "text": "Strike team"}, {"tag": "p", "text": "In 43.5 ABY, Jedi Grand Master Luke Skywalker touched an Aing-Tii relic, the Codex, which amplified his presence and called out his name to the Tribe through the Force. Ship revealed to the Tribe the danger that Skywalker presented to them, and the Tribe's Grand Lord, Darish Vol, called an emergency meeting in the Circle Chambers in Kesh's capital city of Tahv. Vol and Rhea chose a strike team from the armada, commanded by Rhea, to be sent to hunt down Skywalker, but before they could depart, Ship abruptly left the planet to follow the call through the Force. The strike team was then tasked with finding and retrieving Ship before eliminating Skywalker."}, {"tag": "p", "text": "The strike team tracked Ship to a planet in the Maw, where they met a powerful being named Abeloth. They eventually recovered Ship, although many members of the team were killed by the planet's deadly plants and Abeloth managed to keep them there long enough to eliminate their supplies and damage all of the shuttles aboard the Eternal Crusader, as well as ground the Eternal Crusader itself. The Sith then traveled aboard Ship to Sinkhole Station, a space station in the Maw where Abeloth had located Skywalker and his son, Ben. They ambushed the Jedi, but in the ensuing skirmish the entire Sith team was eliminated except for Khai. Khai fled in a dilapidated SoroSuub StarTripper yacht, She's a Chancer, eventually landing on the planet Dathomir and sending out a hypercomm message to the Sith on Kesh to retrieve her."}, {"tag": "h3", "text": "Alliance"}, {"tag": "p", "text": "As the Sith organized a group of ships to travel to Dathomir to rescue Khai, Khai encountered the Nightsisters—a group of dark side-using Witches—and decided that they could be of use to the Sith, reporting their existence to the Tribe. Lord Viun Gaalan led a group of shuttles to Dathomir, where they captured the Nightsisters. However, before Gaalan could retrieve Khai, the Skywalkers—who had tracked Khai to Dathomir—intervened along with the Force-sensitive Dyon Stadd, and Gaalan was forced to flee without Khai. Taking Khai captive, the Jedi left Dathomir, but as they entered orbit they were ambushed by a group of eleven capital class ChaseMaster frigates under the command of High Lord Sarasu Taalon. Taalon lied to them that members of the Sith Tribe had been suffering from the same psychosis as several Jedi back on the planet Coruscant recently, and that he wished to form an alliance with the Jedi in order to eliminate Abeloth, who was causing the psychosis. In reality, the proposed alliance was simply a ploy by the Sith; their actual intention was to force Abeloth to cooperate with them."}, {"tag": "p", "text": "Skywalker agreed to the alliance, and suggested that they contact his friend, Lando Calrissian, to assist them in navigating the Maw with his Colossus I Beta Series asteroid tug, the Rockhound. The Sith agreed, and the fleet of ships waited in orbit over Klatooine, and while there, Taalon transferred command of the frigate Winged Dagger from Captain Syndor to his personal assistant, Leeha Faal. Eventually, however, the Sith and Jedi decided they could wait no longer, and left the planet, to wait for Calrissian just outside the Maw. Taalon convinced Skywalker to allow him to leave two frigates behind—the Starstalker, captained by Vyn Holpur, and the Winged Dagger—under the premise that they would await Calrissian's arrival. In reality, however, Taalon had given orders to Faal which she passed on to Holpur, commanding him to retrieve samples of wintrium from the sacred Fountain of the Ancients on Klatooine."}, {"tag": "h4", "text": "Mission to the Maw"}, {"tag": "p", "text": "The Sith were met with resistance from native Klatooinians, and soon several Hutts as well, who attacked the Starstalkker and surrounded the Winged Dagger, taking the Sith into custody. They were brought to trial in front of Calrissian and Jedi Knight Jaina Solo, who had just arrived on the planet. Faal claimed that Holpur and his crew had acted of their own accord, and so the entire crew of the Starstalker was condemned to death. Faal, Calrissian, and Solo then left to meet the rest of the fleet outside of the Maw."}, {"tag": "p", "text": "The fleet then entered the Maw under the protection of Calrissian's asteroid tug. However, upon their arrival at their first destination, Sinkhole Station, they found that the station had been destroyed by Abeloth. Two frigates, however, failed to slow down, entering the debris field at a great speed. The Rockhound used its tractor beams to slow them, and managed to stop and save one of the ships. The other, however, was traveling at too great a velocity, and was obliterated upon impact. The Jedi and Sith then agreed to travel to Abeloth's planet, where they noticed Ship, still under Abeloth's control, and also saw the remains of the Eternal Crusader. Once they had landed, the allies decided to search for Abeloth by Mind Walking beyond shadows. While beyond shadows, however, Faal was killed, and commission of the Winged Dagger was returned to Syndor."}, {"tag": "p", "text": "The Sith and Jedi eventually located Abeloth and fought her, and the Sith executed their betrayal by attempting to capture the dark side being. Meanwhile, Solo engaged Ship, who was still under Abeloth's influence, in combat in her StealthX. The Sith failed in their endeavor, however, and Skywalker defeated Abeloth; and immediately after Abeloth's apparent death, Ship fled the system. The Sith and Jedi then agreed to send all of their respective forces away except for Taalon, Khai, Khai's father, Gavar, the Skywalkers, and Stadd, who remained behind to investigate more about Abeloth."}, {"tag": "h3", "text": "War"}, {"tag": "p", "text": "Solo and Calrissian left, but when they exited hyperspace they found they had arrived at the incorrect location. After discovering that someone had slipped a sabotage mouse droid aboard the Rockhound at Klatooine, they began to suspect pirates. Solo went out in her StealthX to confront them, and found that they could feel her presence in the Force, and were thus Sith. She and Calrissian escaped and made it back to Coruscant, where they reported to the Jedi Council. Meanwhile, they detailed a map with the assistance of Jedi Knight Jaden Korr, showing that the Lost Tribe of Sith had been attacking vessels and taking them for use in their armada all over the galaxy. After further examination, Jedi Master Corran Horn realized that the Sith were preparing a war fleet."}, {"tag": "p", "text": "Meanwhile, after a falling out between the Skywalkers and the three remaining Sith, the Jedi—with Vestara Khai in tow—tracked Abeloth to the moon Pydyr. There, however, Khai relayed a message to an outpost of the fleet on Boonta, where the message was passed on to Kesh. In response, a Kondo-class assault shuttle was sent with Taalon and Gavar Khai. The Sith lost the shuttle, the Obuuri, during the search for Abeloth, but were soon joined by three more Kondo-class shuttles led by Sith Master Jestat Vhool. When they found Abeloth, however, she drove the members of the Sith fleet mad with visions. In the ensuing battle with Abeloth, Taalon—who had begun to change into another being like Abeloth—was killed by Vestara Khai, and Abeloth was forced to flee. As the Jedi made to leave with Vestara, they were stopped by Vhool. Before the Sith could harm them, however, a wing of StealthXs sent from Coruscant arrived and engaged the Sith, allowing Vestara and the Jedi to escape."}, {"tag": "p", "text": "In the meantime, Gavar Khai developed a plan to find and eliminate a Jedi queen of whom Taalon had had a vision. The Sith discovered that Hapan Queen Mother Tenel Ka Djo closely resembled the Jedi queen, and a team of Sith under Saber Querdan Dei aboard the EE-104 Fisheye Cryptic Warning was sent to assassinate her; but the plan was ultimately foiled. Gavar Khai meanwhile received a message from his daughter, informing him that she and the Jedi had tracked Abeloth to the planet Nam Chorios. Saber Khai was put in command of a flotilla led by several Corporate Sector Authority frigates to execute Operation Shieldfall—a mission to kill the Skywalkers and eliminate or capture Abeloth. He sent Sith agents ahead of the fleet to take control of the world's orbiting Golan III Space Defense NovaGun platforms, but when the Sith arrived in-system, they were ambushed by a fleet of Jedi StealthXs. Before long, two of the frigates had been destroyed, with an additional two severely damaged. As the flotilla suffered heavy losses, Gavar was forced to order a full retreat. While the Sith recovered from the failed mission, Abeloth contacted Gavar and began to negotiate on the point of their mutual enemy—the Jedi. Abeloth was brought to Tahv, where the alliance was accepted. However, she betrayed the Sith, attacking Vol and the city. As she fled, a portion of the Sith armada, led by Gavar Khai in the ChaseMaster Black Wave, defected to join Abeloth. They fired on the ships that remained loyal to the Lost Tribe and escaped with the dark side entity."}, {"tag": "p", "text": "While many Sith in the Tribe infiltrated Coruscant, which the New Jedi Order had vacated, a Sith wing of Skipray twelve-jays was sent to ambush the Jedi Academy on the planet Ossus. The local Jedi and Hapan forces were aware of the Sith plan, and the Hapes Consortium sent four wings of Miy'til starfighters to hold off the Sith while the academy was evacuated. The Sith still hoped to kill Djo, who was present for the evacuation; and they managed to board one of the Jedi's vessels and place baradium bombs inside. The Jedi and Hapans noticed that the vessel, Sharmok 718, was acting strangely, and came to believe the Sith had boarded. As such, the Hapans ordered their escorting Volgh Squadron to open fire; doing so resulted in setting off the baradium, destroying the entire vessel, the Jedi on board, and Volgh Squadron itself, but Djo was saved from the attack. Soon afterward, the Tribe was severely crippled when the Jedi succeeded in their mission to liberate Coruscant, eliminating the Sith forces on the world. Abeloth was also destroyed; nevertheless, Ship decided to ferry Vestara Khai to another Sith faction, the One Sith, rather than back to the Tribe on Kesh."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "At first, Ship served as the leader of the armada, as the Tribe relied on the Sith Meditation Sphere as their only means of space travel, as well as a source of knowing when and where to hit their next target. As the armada expanded, however, the Sith began to take over leadership, and vessels were placed under the command of high-ranking Tribe members, such as High Lords. One of the first vessels to be commandeered, the Eternal Crusader, was put under the command of Lady Rhea. Also serving on that starship was Rhea's apprentice, Vestara Khai."}, {"tag": "p", "text": "Lord Viun Gaalan later commanded a small group of shuttles to retrieve Khai from Dathomir, and eleven capital-class ChaseMaster frigates, including the Black Wave, were placed under the command of High Lord Taalon. Also among these frigates were the Starstalker, commanded by the Human Sith Vyn Holpur, and the Winged Dagger, commanded first by Syndor, later by the Keshiri Leeha Faal, and then by Syndor again following Faal's death while beyond shadows. Master Vhool commanded a trio of Kondo-class shuttles."}, {"tag": "p", "text": "During Operation Shieldfall, Gavar Khai led a flotilla of Corporate Sector frigates. After Abeloth turned against the Lost Tribe in Tahv, however, a number of Sith in the armada defected to join her, including Khai and fellow Saber Tola Annax."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The armada first appeared in author Christie Golden's 2009 debut Star Wars novel, Fate of the Jedi: Omen, the second novel in the Fate of the Jedi series. The armada went on to appear in each of the following Fate of the Jedi novels—Fate of the Jedi: Abyss, Fate of the Jedi: Backlash, Fate of the Jedi: Allies, Fate of the Jedi: Vortex, Fate of the Jedi: Conviction, Fate of the Jedi: Ascension, and Fate of the Jedi: Apocalypse. The first mission undertaken by Ship and the Sith was depicted in a short story by Golden, \"First Blood,\" published in 2011. The fleet was later mentioned in the 2012 reference book The Essential Guide to Warfare."}, {"tag": "p", "text": "At the end of Apocalypse, the Sith forces on Coruscant are eliminated. However, it was unspecified in both Ascension and Apocalypse exactly how many Sith of the Tribe stayed behind on their homeworld; nor was it specified whether or not the Tribe still possessed any ships capable of space flight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}