{"url": "Sith%E2%80%93Imperial_War", "categories": ["Category:Legends articles", "Category:Conflicts involving the Chiss Ascendancy", "Category:Conflicts involving the Fel Empire", "Category:Conflicts involving the New Jedi Order", "Category:Conflicts involving the One Sith", "Category:Conflicts involving the Yuuzhan Vong", "Category:Conflicts of the Outer Rim Territories", "Category:Fel Empire", "Category:Galactic Alliance", "Category:New Jedi Order", "Category:Sith-Imperial War", "Category:Sith", "Category:Yuuzhan Vong culture"], "nodes": [{"tag": "h1", "text": "Sith–Imperial War"}, {"tag": "p", "text": "The Sith–Imperial War (127–130 ABY) was a galactic conflict which saw the return of the Galactic Empire as the dominant galactic power for the first time since their defeat in the First Galactic Civil War over a century prior. Darth Krayt, Dark Lord of the One Sith, set out to destroy the New Jedi Order, sending his followers to commit acts of war in his name."}, {"tag": "p", "text": "Following the war, the Galactic Alliance surrendered, though surviving portions of its military reformed into the Galactic Alliance Remnant, intent on keeping up an opposition against the Empire and the One Sith. However, the Sith revealed their deception and took control of the Empire, causing Roan Fel and his followers to form the True Empire."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "The Ossus Project"}, {"tag": "p", "text": "The roots of the war could be traced back to the Ossus Project, during which the New Jedi Order convinced the Galactic Alliance to allow Yuuzhan Vong Shapers, headed by Master Shaper Nei Rin, to use a desolate portion of Ossus, one of the order's most ancient strongholds, as a test site."}, {"tag": "p", "text": "The intent of those who championed the project; such as Jedi Master Kol Skywalker, a leading member of the Jedi Council; was to see if Yuuzhan Vong terraforming methods, like those that decades before had transformed Coruscant into the Yuuzhan Vong's temporary homeworld of Yuuzhan'tar (27–29 ABY), could restore the barren and devastated world. Should they be successful, Skywalker expected that the process could be used to transform and restore ailing worlds, and at the same time transform the galaxy's perception of the Yuuzhan Vong. The experiment appeared to work, returning Ossus to vibrant life again, and when the Jedi revealed the results to the outside galaxy, other worlds vied for the chance to restore planets left devastated by the century prior Yuuzhan Vong War."}, {"tag": "p", "text": "Ultimately, one hundred planets were chosen for terraforming. Yuuzhan Vong Shapers, accompanied by Jedi, set to work, and at first the results were wondrous to behold. But no one had reckoned with interference by the One Sith. On the command of the cult's leader, Darth Krayt and the help of a renegade Yuuzhan Vong agent, Zenoc Quah, the One Sith secretly sabotaged the terraforming process on these worlds, including Wayland. Plants grew deformed, and painful bony growths, of a kind not seen since the Yuuzhan Vong forcibly took populations as slaves, sprouted from the skin of the inhabitants."}, {"tag": "p", "text": "The Yuuzhan Vong were shocked; none of the preliminary experiments on Ossus had shown any of the later mutations. Master Shaper Rin made it her mission to learn what had happened, and why. The Jedi suspected sabotage at once, but had no idea who was responsible. Across the galaxy, however, fingers were pointed at the Yuuzhan Vong; too many bad feelings existed against the authors of one of the most destructive wars the galaxy had ever seen for people not to suspect that the Yuuzhan Vong had resumed their crusade by other means (exactly what the Sith had intended). The Jedi were certain that the Yuuzhan Vong were innocent, however, and they convinced the Alliance to support the Yuuzhan Vong against domestic criticism. This provoked anger amongst Alliance member worlds and because of that, many left the Alliance or declared their neutrality."}, {"tag": "h3", "text": "The Empire declares war"}, {"tag": "p", "text": "This was too much for the Fel Empire, which took an opportunity opened by the loss of confidence in the Galactic Alliance. With the signing of the Pellaeon–Gavrisom Treaty in 19 ABY, the Imperial Remnant had stopped its war against the former Rebellion, and the Yuuzhan Vong invasion had brought them together as allies, or at least as friendly rivals. But its nominal government, the members of the Moff Council, still had many hard-line holdovers to the old ways who sought to return the Empire back to primacy as the dominant galactic power, peace treaty or not. Now they called for retribution and, invoking the Treaty of Anaxes, declared war on the Galactic Alliance. The peace that so many had fought and died for in decades past was undone due to the actions of the new Sith Order."}, {"tag": "p", "text": "Fearing what could ultimately happen, the Jedi High Council ordered the creation of the Hidden Temple at the start of hostilities, its location chosen by Nat Skywalker so the Jedi could have a refuge."}, {"tag": "h2", "text": "The war"}, {"tag": "h3", "text": "Early fighting"}, {"tag": "p", "text": "From the start, the Alliance was handicapped. Its defense of the Yuuzhan Vong had alienated numerous member worlds, whose populations still nursed bitter memories of the Vong invasion, and many of them refused to support the GA. Suddenly, the Alliance found itself facing a secession movement as well as general war. The Empire used this to its advantage, luring some of these disaffected worlds into the Imperial camp and weakening the GA government. Other worlds declared neutrality. Thus the war began with the Empire possessing all the advantages. But Emperor Roan Fel himself was less than enthusiastic; he'd only reluctantly declared war and never threw his full support behind it. He even prevented his Imperial Knights from participating. It was because of this move that during the early stages of the war, things were not as good for the Empire as they had thought. Examples like this included the Battle of Corulag where Oron Jaeger, an Imperial Army General of the 501st Legion received a head injury during the battle, requiring him to undergo cyborg augmentation."}, {"tag": "p", "text": "Meanwhile, the Mandalorians, now under the leadership of Mand'alor Chernan Ordo, had been contacted by the Galactic Alliance to hold the planet Botajef and it's shipyards against the Imperial Army until the Galactic Alliance Fleet arrived with reinforcements. However, during the Battle of Botajef, there was a traitor in their midst by the name of Yaga Auchs; Auchs served an unknown master and it was in his service that he sabotaged communication with the Alliance fleet and betrayed his comrades, leading to the Mand'alor's death. Usurping the title for himself, Auchs used his authority as the new Mand'alor to order a retreat, leaving Botajef to the Empire and taking his people out of the war. As Auchs pulled out, Hondo Karr and Vevec—the father of Karr's wife—were left stranded on Botajef. With Imperial soldiers closing in, Karr removed his Mandalorian armor and replaced it with the armor of a dead stormtrooper. Vevec refused to hide in the enemy's armor, and instead gave his life to help establish Karr's cover as the last survivor of his unit."}, {"tag": "h3", "text": "The entry of the Sith"}, {"tag": "p", "text": "In 128 ABY, one year into the war, things were not going well for the Fel Empire: despite the Alliance handicap, the Jedi were more than making up for that. Also, because Roan Fel refused to let the Imperial Knights enter the war, the Empire didn't have the strength necessary to counter the Jedi. But the Sith soon insinuated themselves into the conflict. Via the ruthless and ambitious Director of Imperial Intelligence, Grand Moff Nyna Calixte, the Sith approached the Empire and allied themselves with the Imperial cause. When the Sith then declared themselves openly, the Jedi knew that the Sith had been behind the sabotage of the Vong terraforming projects. The Jedi were unable to prove this, but as events progressed, eventually even members of the Imperial camp—including Emperor Fel himself—realized the truth of it, though far too late to halt the plans that the Sith had set in motion. Fel personally hated the Sith, but was overruled in his objections to allying with them by the Moff Council, as no Emperor had ruled absolutely since the days of Palpatine. The Council, eager to use whatever advantage at their disposal to once again bring about Imperial dominance of the galaxy, eagerly accepted an alliance with them. The Yuuzhan Vong, upon learning the truth, were at first relieved that it was not the work of their gods, then determined to reverse the damage the sabotage had caused. Shaper Nei Rin journeyed from Ossus to try to discover the Sith's method of sabotage, hoping that this knowledge could help discredit the Sith and end the war."}, {"tag": "h3", "text": "The Battle of Caamas"}, {"tag": "p", "text": "After three years of bloody warfare, the Galactic Alliance was a spent force, while the Sith only grew in power and strength, even independently manufacturing and fielding their own starfighters. Under the command of Grand Admiral Morlish Veed, Calixte's lover and a participant in the Sith conspiracy, the Imperial fleet dealt a crushing blow to the Alliance at the Battle of Caamas. Admiral Gar Stazi, one of the Alliance's task force commanders at Caamas, was forced to execute a fighting withdrawal from the system to save his ships."}, {"tag": "p", "text": "Veed's announcement of victory essentially signaled the end of the war altogether. With the Galactic Alliance Defense Force in tatters, there was nothing left to defend the capital, Coruscant. The Alliance had little choice but to surrender, and its territory was absorbed into the Empire, but the Galactic Alliance Core Fleet, under the command of Admiral Stazi remained active and continued to fight the Empire."}, {"tag": "h3", "text": "The Massacre at Ossus"}, {"tag": "p", "text": "Although knowing the Jedi would never comply, Emperor Fel called on the Jedi Order to surrender and subject itself to the will of the Empire. Some of them did so, joining the Imperial Knights. But the rest, remaining true to the will of the Force, refused to ally themselves with the Sith and withdrew from Coruscant to their temple on Ossus. The Sith eventually followed the Jedi there, where Darth Nihl led a brutal attack, aided by Imperial forces under Moff Rulf Yage. The Massacre at Ossus scattered the Jedi across the galaxy, though the Jedi Order was not yet entirely defeated. As the Sith attacked before the entire Order could gather at Ossus, about half of them survived and went into hiding throughout the galaxy. Nei Rin returned to Ossus the day after with proof that the Sith had been behind the projects sabotage, but unfortunately too late to stop either the war or the massacre."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Shortly after, the Sith, determined to rule the galaxy directly, launched a deadly palace coup against Emperor Roan Fel and his Imperial Knights. After killing what he later determined to have been a double of the Emperor, the Attack on Emperor Fel succeeded with Darth Krayt assuming the Imperial throne himself, restoring, for the first time in over a century, the rule of a Sith Lord over most of the galaxy. A new Sith Empire was born."}, {"tag": "p", "text": "However, some worlds and systems remained loyal to the deposed Emperor Fel, who managed to retake the heavily fortified world of Bastion. He used the planet as his acting capital, in effect creating a rival faction of the Sith Empire, with each one vying for dominance and plunging the Galaxy into civil war once again. Fel would later form an alliance against the Sith with the Galactic Alliance Remnant.. The Jedi would later join that coalition. An unanticipated event happened when Krayt himself was seemingly killed by his advisor after a duel with a female Jedi and an ancient Sith Lord."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}