{"url": "Barada/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Desilijic servants", "Category:Klatooinians", "Category:Males", "Category:Mechanics", "Category:Pilots", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Barada"}, {"tag": "p", "text": "Barada was a male Klatooinian slave and mechanic who worked as the head of Jabba Desilijic Tiure's pool of repulsor vehicles, as well as guard and captain of his own vehicles on the planet Tatooine. While Barada should have been able to buy his own freedom with the salary Jabba paid him, the Hutt had tricked his slave, charging him for room and food and precluding him from being free again. Despite this, Barada was believed to be a loyal servant, with Jabba giving him responsibilities, subordiates, droids, and a number of would-be luxuries. Barada was reasonably content with his lot in life, and became friends with Jabba's spy Ephant Mon, although other people at Jabba's Palace, including the Gran drunkard Ree-Yees, preyed on Barada."}, {"tag": "p", "text": "Not long before the Battle of the Great Pit of Carkoon, Barada conspired with Jabba's Quarren accountant Tessek and the bounty hunter Dengar to place a bomb on Jabba's Ubrikkian luxury sail barge, with the intent of killing the Hutt crime lord. His plot was discovered in advance, but Barada was not informed of this. Soon afterward, Barada drove a skiff of prisoners to their scheduled execution at the Great Pit of Carkoon. One of the convicted individuals, Jedi Knight Luke Skywalker, struggled with Barada and the other guards, and Barada was killed in the ensuing fight."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Barada was a male Klatooinian born on the planet Klatooine, in Hutt Space. Many Klatooinians were named Barada after the legendary and revered Klatooinian scholar and leader Barada M'Beg."}, {"tag": "p", "text": "As a young boy, Barada lived on the planet of Klatooine where he enjoyed feeling the local fresh wind on his face. During this time, he planned to leave his homeworld and travel to a different planet in the Galactic Empire where he intended to live and have various adventures. However, during his youth, Barada behaved disrespectfully to his parents, which went against Klatooinian custom and was a crime punishable with the sale of the disrespectful son as an indentured servant. As such, following tradition, Barada was sold by his parents to a garage owner."}, {"tag": "p", "text": "Barada served his new master for a time. The master in turn followed the letter of the contract and paid Barada a periodic amount as a salary. To earn his freedom, Barada was to pay his master the exact amount he had paid for Barada. Saving his salary, Barada was 2,000 credits from his freedom, and he was to obtain that amount in one year or less. At that point, the owner could contract Barada as a free being if he wished so."}, {"tag": "p", "text": "The garage owner played a rigged game of sabacc with a Hutt crime lord named Jabba Desilijic Tiure. Jabba gained the garage, and also Barada's servitude contract No one dared to accuse Jabba of cheating, and thus, Barada found himself indentured to Jabba. Jabba employed Barada as one of the guards in his palace on Tatooine and in several criminal activities. Jabba also ordered Barada to work in the Hutt's fleet of land vehicles, or repulsorpool, mostly including customized, armored skiffs for the arid local climate, vehicles used by Jabba and his workers including the big Ubrikkian luxury sail barge, and the repulsor sleds that Jabba used to move his massive person."}, {"tag": "p", "text": "Motivated, Barada advanced and became the head and captain of the pool. As the local mechanic, his responsibilities included obtaining, customizing, crewing, taking care of, maintaining, and supplying the vehicles. Should the skiff captain Ak-Buz be too inebriated to serve in this capacity—something not unheard of—then Barada would also serve as skiff captain, especially in combat or if Jabba was on board."}, {"tag": "p", "text": "Jabba noticed Barada's high skills and gave the Klatooinian a real responsability—something uncommon in the Hutt's entourage. Barada had several people under his command, including his main assistant, Klaatu the Nikto, charged with repairing the skiffs; Mal Hyb, a capable female Human assistant; and the Human accountant Gailid who enjoyed tending to skiffs with Barada. Many of the Weequays at the palace worked directly for Barada, even if the Klatooinian had trouble giving them orders or even communicating with them. Barada also had several droids under his command, including an AE-35 unit helping him at the sail barge. Commonly, Barada's droids kept the bay under surveillance."}, {"tag": "p", "text": "Barada was allowed to sleep at the motor pool to protect the vehicles, laying on a bed of sand over a corner of the floor full of stones. Barada also had his own bunk, and even a sink at his quarters, even if few of Jabba's minions were allowed such commodities."}, {"tag": "p", "text": "Jabba valued too much Barada's services to allow the mechanic to buy his freedom, and as such he developed a ruse to keep him indefinitely indentured. Barada earned the amount his contract specified, but Jabba charged him that exact amount for room and board. Barada had no other source of income, and as a consequence he remained indentured. The Klatooinian showed a surprising honesty and high loyalty to Jabba. As such, Barada became one of the few bond servants that Jabba trusted. This trust was not wisely placed, as Barada was not so fond of Jabba."}, {"tag": "p", "text": "Circa 1 ABY, Barada worked as mechanic of Jabba's swoop bikes and podracers. Knowing that Jabba's rival Lady Valarian's podracers cheated in the illegal races, Barada hired an independent spacer to spy the Valarian Pod Racers Bunker, to discover how they did so. He later hired the spacer to assassinate Valarian's podracer champion Doane Watki. In exchange for this service, Barada gave the spacer some money and a vehicle customization kit. At some point, Barada also befriended Ephant Mon, a Chevin staying at Jabba's palace for reasons Mon kept to himself.\nIn 4 ABY, Barada placed an order for vehicle parts, but it never reached the Palace and, after several weeks, Barada decided he could give it up for lost. Around that point, Barada joined Jabba's Quarren accountant Tessek and the bounty hunter Dengar in a conspiracy to kill Jabba. Some of the Weequay guards and Ree-Yees, the Gran drunkard, were also accomplices of Tessek's. Tessek feared that Barada or any other of his other partners-in-crime could be treacherous or sloppy; his worries were so intense that the B'omarr monks in the Palace discovered them by reading Tessek's mind. Dengar agreed to build a bomb and giving it to Barada; the trusted Klatooinian would then place the artifact in Jabba's barge."}, {"tag": "p", "text": "Three days later, Dengar finished the bomb and approached Barada. The bounty hunter was unaware of his rival, Boba Fett, having placed a microtransmitter in one of his holsters. Fett recorded the conversation between Barada and Dengar when the bomb changed hands, and obtained proofs of the assassination attempt involving Barada, Dengar, and Tessek. Barada then hid the bomb at the barge, arranging it to explode two days later."}, {"tag": "p", "text": "The following day, an Anzati assassinated barge captain Ak-Buz. The corpse was found by Jabba's chef Porcellus who, panicked, hid it in the machine yard when neither Barada or his Weequays were there. Meanwhile, Fett reported the conspiracy to Jabba. Jabba decided to secretly defuse the bomb and punish Tessek by forcing the Quarren to go with Jabba when the explosion was scheduled. Jabba, who found the situation to be funny, decided to procrastinate Barada's punishment for several weeks; and, admitting that Denger was dangerous, allowed Fett to punish his peer. Once Jabba had told Tessek he requested his presence on the barge, Tessek planned to escape on a speeder bike, but he needed one skilled operator to open the palace blast doors, and he could not ask Barada as Jabba would kill the Klatooinian for that, and Barada knew it."}, {"tag": "p", "text": "During that day, Princess Leia Organa of Alderaan sneaked in Jabba's Palace disguised as a Ubese along with her friend, Chewbacca the Wookiee, in an attempt to free her lover, Han Solo, who had been captured by Jabba. Jabba discovered and stopped the plot, and sent Solo and Chewbacca to his dungeons, keeping the Princess chained to him as a slave.\nBarada began the following day looking for six rocker-panel cotter pins for his AE-35 at the scrap heap next to the palace. He was joined in his walk by two Weequay guards who did not speak ther intentions. Barada found Ak-Buz's corpse in the heap and the Weequays, suddenly interested, took the body. Barada mentioned that there had been other unsolved murders in the palace; then, the Weequays signed Barada to not delve any more on that because it was the Weequay guards' business. Barada obeyed, and decided that he had been automatically promoted to permanent captain of the sail barge."}, {"tag": "p", "text": "Barada returned to his garage and buried his head in one engine compartment. Mon came for a pre-scheduled visit and asked Barada for a quick skiff. While Barada was initially reluctant to give away any but the more common vehicles, he accepted to lend his friend a quick XP-38A utility landspeeder, warning him about its steering. Mon used it to travel to the Lucky Despot hotel and back."}, {"tag": "p", "text": "Jabba and Barada also discovered the identity, and importance, of Jabba's new female slave; the Hutt laughed at the importance of his captive. Barada was then visited by Tessek, who wanted to confirm if the Klatooinian had hidden the bomb in the sail barge. Barada eased him discreetly, but he also explained that Jabba had chained the Princess of Alderaan, a high-ranking member of the Alliance to Restore the Republic, and Tessek assumed that the Rebels would probably stage a daring rescue. Barada added that Jabba feared not the Rebels. Tessek left Barada's garage just in time for the arrival of a Rebel agent, Jedi Knight Luke Skywalker."}, {"tag": "p", "text": "Skywalker offered to negotiate with Jabba for Solo's life and, when this failed, threatened Jabba. Jabba confronted Skywalker with his favorite monster, the rancor, but Skywalker killed it. Enraged, Jabba ordered to take Skywalker, Solo and Chewbacca to the Great Pit of Carkoon, where they were to be thrown into the sarlacc, and to be digested slowly for one thousand years. Barada was notified, as he had only hours to get the sail barge ready. Mon came back soon afterward, and Barada told his friend about all the events he had missed."}, {"tag": "p", "text": "Barada and his team spent hours painstakingly reviewing the barge's engine and many other details. The Klatooinian did not allow a traditional one-hour meal break until the AE-35 had been repaired and replaced, as he feared punishment should anything failed during the Hutt's pleasure trip."}, {"tag": "p", "text": "Ephant Mon came again to confide with Barada during this time: After a conversation with the Jedi prisoner, Mon believed that the Jedi could kill Jabba, and wanted to convince the Hutt to pardon the convicted people. Barada answered that Jabba would not believe that and probably would execute Mon too. Mon explained that he could simply leave, but he explained to Barada that Jabba had saved Mon's life on Glakka and, feeling morally in debt with the Hutt, Mon had protected his friend from conspiracies. Barada was aghast at Mon's secret, but nonetheless told Mon that, in his opinion, the debt had been repaid. The Jedi had also opened Mon's eyes and made him wish to return to a simpler life, but Barada was unable to understand Mon's explanation on this subject. The mechanic returned to work and wished to see Mon again as a free Chevin."}, {"tag": "p", "text": "Soon afterward, five Weequays concluded that Ak-Buz's assassin had hidden a bomb in Jabba's sail barge. They intended to board the vehicle to investigate, but Barada refused to let them in. The Weequays bribed him with food, specifically beignets cooked by Porcellus."}, {"tag": "p", "text": "Barada was not asked to captain the sail barge. Instead, he was to captain a gunskiff which would escort the skiff containing the prisoners through the desert. The Prisoner skiff was manned by several guards includding two Weequay guards and a third security agent—who was secretly Lando Calrissian, an undercover friend of Solo who was waiting for a chance to release him and throw the guards overboard. Barada took a vibro-ax and watched the prisoners menacingly, as if daring them to misbehave; the Weequays he traveled with gave the same impression."}, {"tag": "p", "text": "The skiffs and the barge reached the Great Pit of Carkoon. Barada stopped his skiff to hover over a hole in the sand where the sarlacc waited. A plank was released from the prisoners skiff, and Pagetti Rook, one of the Weequays, pushed Skywalker to it. Skywalker jumped from the plank, grabbed its edge with a hand while falling, and jumped back to the skiff in an athletic feat. Barada and the other guards were confused at this, and Skywalker used his initiative to catch a lightsaber that was timely ejected by the droid R2-D2. Skywalker activated the saber and attacked the guards. Barada and the guards on the second skiff then reacted by shooting at Skywalker, while Calrissian struggled with the helmsbeing."}, {"tag": "p", "text": "Skywalker and Calrissian quickly killed all of the guards on the first skiff and the Jedi leapt to the second attacking the guards there. Barada was slashed by Skywalker in the ensuing fight, his body falling into the gaping maw of the sarlacc under the watching eyes of Tessek. The battle went on, ending in a victory of the Alliance and the deaths of Jabba and, eventually, of many of his followers.\nBarada was survived by his co-conspirators Dengar and Tessek. The Quarren escaped the barge and went back to the Palace. Delirious for the lack of water, he assumed that trusted Barada was opening the Palace's blast doors for him, and went to the pool to ask him for water before realizing that Barada had died. Tessek then used Barada's sink to re-moisturize before leaving the pool."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Barada was a male Klatooinian with leathery green skin that had been described as brown; Tessek the Quarren found it similar to the deserts of Tatooine both in color and texture. The Klatooinian was hairless, having a skull crest that sometimes changed to bright red. Barada's red eyes gleamed dimly with a shade of yellow when the lights were low; he had to shade the eyes or skint to withstand very bright lights. His face also included a canine snout that allowed him to smell items. and a constant scowl. At some point after his youth, his face was heavilly scarred."}, {"tag": "p", "text": "At 1.7 meters of height, Barada was ten centimeters shorter than the average Klatooinian. His strong hands were nonetheless very big.\nA good-natured and earnest fellow, Barada was also a remorseless and violent minion, lacking any sophistication. Barada was also one of Jabba's most hard-working servants, having found a reason to live in his work and taking it to heart. He was demanding and strict especially with his subordinates, fearing a strong reprisal from Jabba should anything under his responsability go wrong."}, {"tag": "p", "text": "While he was mostly a slave, Barada was not completely unhappy with his lot, as he found most of his needs to be covered. He was also free to dream about his youth, something he did while sleeping topless. He was unable to obtain money, but he was sometimes bribed with food."}, {"tag": "p", "text": "Barada was quite intelligent and secretive, able to deduce that Ak-Buz had been murdered by an Anzat because the corpse had no marks. He could also blaspheme in several languages. However, he was perceived as dim-witted by the Weequays, and also by Ree-Yees, who was considered a fool himself but believed that Barada was even more foolish and thus a mark for his scams. Tessek was scared of Barada being too stupid to follow his scheme, and Ephant Mon found him unable to understand his Force-induced epiphany."}, {"tag": "p", "text": "Barada was good at reparing several kinds of technologies, including blasters, repulsorlift vehicles, armor, land vehicles, droids, and hover vehicles. He was also a capable repulsorlift pilot. Barada was a formidable melee fighter, but he was also good in a shootout using his weapon of choice, the heavy blaster pistol. He also carried with him a thermal detonator, a vibro-ax and a mechanic tool kit. His vehicles of choice were the Ubrikkian luxury sail barge and the desert skiff.\nBarada was mostly a loner, but he found a friend in the Chevin Ephant Mon. While Mon was unable to take Barada away from his responsabilities as a mechanic, he liked the young Klatooinian. Barada, in turn, was observant enough to read in the facial expressions of his friend. Mon trusted Barada and commonly asked for his advice and, as Mon was a traitor-seeking spy, this made Barada one of the best informed people in Jabba's entourage. However, Mon did not trust Barada with his secret past until the last time they met."}, {"tag": "p", "text": "Barada disliked the company of the Weequays. He believed they were inescrutable, ruthless fighters, and had never heard them speaking. However, Barada did his best to understand what they wanted, and only if he failed at doing so, he opted to ignore them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Barada first appeared in the novelization of Star Wars Episode VI: Return of the Jedi. He went on to appear in the homonymous movie, for which he was developed as one of the skiff guards. Concept sketches on him were drawn, and later maquettes were crafted. Barada was executed as a costume made of a slip-on mask and gloves representing hands. Several \"Barada-like\" aliens were crafted for the scene of the sarlacc. Barada himself was played by actor Dirk Yohan Beer, who was not credited. In 1997, Barada's mask was re-used for a new character, Umpass-stay, in Star Wars Episode VI: Return of the Jedi (Special Edition)."}, {"tag": "p", "text": "In the short story \"The Great God Quay: The Tale of Barada and the Weequays,\" Barada is mistakenly described as being in the place of Kithaba on the prisoner skiff and being the first guard to die after being sliced in half by Luke Skywalker. However, in the film he is clearly not aboard the prisoner skiff but on the second, where he is later pushed off into the mouth of the sarlacc. It is possible Barada in fact survived for some time in the stomach of the sarlacc as Boba Fett did."}, {"tag": "p", "text": "Barada's name comes from the line \"Klaatu barada nikto\" which is used in the classic science-fiction film The Day The Earth Stood Still (1951), along with the Nikto skiff guards species and Klaatu's name. In The Day The Earth Stood Still, the Human-looking alien Klaatu, played by Michael Rennie, is sent to jail but asks his friend Helen Benson, played by Patricia Neal, to go to his robot companion Gort should anything happen to him and utter the sentence—whose meaning is never specified—prompting Gort to revive Klaatu. The section on Barada at the Databank of StarWars.com mistakenly says the the mute Gort utters the sentence, while the section on Nikto says that it is Klaatu who utters it to control the giant robot Gort—but in the movie, Klaatu never says it to Gort directly. The sentence was re-used in several other unrelated movies as a homage, including Tron, Toys and Army of Darkness."}, {"tag": "p", "text": "Kenner and Hasbro released a Barada action figure several separate times. The first one came out in 1985 as part of the original 'Power of the Force' series, with an item called \"Skiff guard battle staff\", and was one of the 'Last 17' figures issued in the 'vintage' era. The color scheme and weapon used, though, actually come from another Klatooinian guard, Kithaba. A true rendering of Barada was released 14 years later, as part of the \"Jabba's Skiff Guards\" cinema scene (1999), in the revived 'Power of the Force' line, equipped with a blaster. The pack included the Nikto called Vizam and Klaatu—even if, during Return of the Jedi, Klaatu is seen in the sail barge, not on the skiff. A similar figure was rereleased in 2004 as part of a Battle of the Great Pit of Carkoon-themed multipack exclusive to Toys \"R\" Us, with figures of Han Solo, Klaatu, and Nikto. Except for Solo, the package confuses the names: Barada is called Klaatu, and Vizam the Nikto is called Barada. In 2006, the figure was re-released as \"Barada (Skiff Guard)\" for the initial wave of The Saga Collection, along with a blaster, a display stand, and a mock hologram. In 2007, a big-headed depiction of Barada was sold, along with a big-headed Weequay, for the collection Galactic Heroes, without weapons or accessories."}, {"tag": "p", "text": "Barada's name is mentioned in passing in the book Ultimate Alien Anthology, as one of the example names for Klatooinians, and indirectly when talking about the many Klatooinians named after Barada M'Beg in The New Essential Guide to Alien Species."}, {"tag": "p", "text": "The Star Wars Trading Card Game from Decipher, Inc. includes a card representing Barada. This character is fairly strong, having a bonus to be very strong if he is inside Jabba's Palace, but he loses almost all his advantage if he leaves Tatooine. In this game, Barada can also recover lost transport vehicles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}