{"url": "Sith_war_(Old_Republic)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Conflicts of the Core Worlds", "Category:Galactic Republic events", "Category:Jedi", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Sith war  (Old Republic)"}, {"tag": "p", "text": "Sometime following the Hundred-Year Darkness and the exile of a rogue Jedi to Moraband, a war broke out between the newly formed Sith Order and the Galactic Republic, during which Coruscant became a contested battleground between both factions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At least 5,000 years before the Clone Wars, a rogue Jedi rebelled against the Jedi Order, believing that following the way of the dark side of the Force was the key to unlocking their full potential. The Jedi was cast out during an event known as the Hundred-Year Darkness. As a result of this event, the Sith were born."}, {"tag": "p", "text": "Sometime later, the Sith returned in the form of an empire, prepared to wage war against both the Republic and the Jedi Order once more. During this war, both the Jedi and Sith built massive superweapons powered by kyber crystals."}, {"tag": "p", "text": "During a period in which the Sith dominated the galaxy, the Sith took control of Coruscant, the capital of the Republic. The Sith constructed an immense black shrine over a dark-side vergence on a mountain at the heart of the planet. The Jedi eventually laid siege to the shrine, burning it to its foundations and defeating the Sith. The Jedi would eventually construct a temple above the former site of the shrine to contain the dark energy emanating from the vergence and metaphorically bury the Sith legacy."}, {"tag": "p", "text": "Although the Jedi emerged victorious during the conflict, they would continue to do battle with the Sith over the ensuing millennia. While the Jedi falsely believed that the shrine had been destroyed, part of it remained deep underground; its insidious power would contribute to the near destruction of the Jedi Order around 5,000 years later."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars Legends, the first conflict between the Jedi and Sith following their initial split was known as the Great Hyperspace War. The war made its first appearance in Legends in Tales of the Jedi – Dark Lords of the Sith 1 which was released on October 1, 1994."}, {"tag": "p", "text": "The sourcebook Nexus of Power directly references a canon Great Hyperspace War. However, as it does so in the context of the contents of the in-universe mythical Qel-Droma Epics and no mention is made of an attack on Coruscant, it is not clear if they are the same conflict in canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}