{"url": "Sith_magic", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Sith magic"], "nodes": [{"tag": "h1", "text": "Sith magic"}, {"tag": "p", "text": "Traditionally, Sith magic, also known as Sith sorcery, was an arcane expression of Force ability first developed and practiced by the original Sith species through which they manipulated the power of the dark side. The very name of the Sith was adopted by the Dark Jedi Exiles of the Hundred-Year Darkness, who combined Sith mysticism with their own experiments into dark-side power to create even more strange rituals and alchemical sciences. Sith magic, while as much a part of the dark side as endowments like Force lightning, was accessible only to those Force-sensitives who possessed an intrinsic relationship with the dark side. Through the recitation of spells, execution of hand gestures, and/or the handling of various artifacts, darksiders were able to channel the raw power of the Force's malignant side to warp minds, alter the environment, and obliterate whatever obstacles stood in their way. Males who achieved mastery were known as Sith sorcerers, mages, magicians, or wizards, while females who practiced Sith sorcery were referred to as Sith sorceresses or witches."}, {"tag": "p", "text": "Sith magic was prevalent among the citizens of the ancient Sith Empire, and its disciplines were adhered to throughout the span of galactic history, predating even the inception of the longstanding Galactic Republic. Its effectiveness in battle was realized during the Great Hyperspace War of 5000 BBY, up to and beyond the Great Sith War a thousand years later. Lords and Inquisitors of the reconstituted Sith Empire were armed with Sith magic during the Great Galactic War of 3681 BBY. Proponents of Sith magic revived its practice briefly during the New Sith Wars, but it became something of an oddity following the reformation of the Republic in 1000 BBY. By then, a lone Sith apprentice was its only active student. Still, the allure of Sith magic survived through the fall of the Republic in 19 BBY and the subsequent Galactic Civil War, and curious Force-sensitives learned to harness its power from obscure temples on long-forgotten planets and moons. By 137 ABY, the magic of the Sith was studied by the foremost loremasters of Darth Krayt's One Sith Order."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Nature"}, {"tag": "p", "text": "By those against whom it was used, Sith magic, also called Sith sorcery, was described as the full destructive power of the dark side of the Force. Its strength was derived from negative emotions, and grew stronger and more corrupting with each expression. Sith magic was every bit a part of the dark side as conventional Force powers, and when the Dark Jedi Exiles of the Hundred-Year Darkness found Korriban and conquered the Sith people, they incorporated the magic of the Kissai priests into their own mastery of the dark side. Sith sorcerers of later generations learned to combine their exotic spells with traditional Sith talents while in the midst of battle, but when engaged in lightsaber combat, those who wielded said weapons were often forced to divide their concentration between casting spells and their bladework. The magic of the ancient Sith was a complex power that assaulted an individual's psyche in ways that were difficult to both comprehend and defend against. Only beings with considerable strength of will were able to resist its psychological effects. Conversely, a Sith sorcerer's concentration was able to be interrupted by Force users skilled in the art of Jedi battle meditation, and their magical creations could be undone by pure manifestations of the light side of the Force."}, {"tag": "p", "text": "Sith magic was perceived differently by those who were subjected to its power. Some Force-sensitive beings felt as though it consumed their life energy, while others became physically weaker and felt like all their strength was being siphoned. Some sensitives without any Force training suffered from headaches while in an atmosphere permeated with the residual energy of Sith magic. Its power was enticing, and sometimes manifested as a musical undercurrent—beautiful to some, hideous to others—to lure the unsuspecting. Sith magic tempted the curious with what was believed to be limitless dark-side power, and such an opportunity compelled many to explore further. Each interpreted their experience differently; Sullustan pilot Dllr Nep described visually seeing it as the ripple effect of disturbed water, while Beast-Lord Oron Kira saw the sky above him literally become overcast with the power of dark side."}, {"tag": "p", "text": "Those who practiced Sith magic found its power a viable means of bringing their goals to fruition. Members of the planet Onderon's Naddist Sith cult, many of whom were seasoned magicians, believed themselves to be indomitable so long as Sith magic was theirs to command. Its power was used for a variety of purposes through a number of techniques, ranging from mind- and reality-altering spells to powers that impacted the physical world directly. Some sorcerers applied Sith magic during their endeavors to control life and death. Despite the various reasons individuals aspired to learn the ways of the dark side, two common themes were found in all those who subscribed to the study of Sith magic: reaching their full Force potential and the pursuit of ever-greater power."}, {"tag": "p", "text": "Dark Lord of the Sith Darth Bane believed that beings with a true affinity for Sith magic were few and far between. To him, Sith magic allowed an individual to channel the dark side with maximum effect in ways that he, even as the prophesied \"Sith'ari,\" was unable to do. To King Ommin of Onderon, Sith magic was only attainable after breaching a barrier that resided deep within himself. At the behest of his Sith Master and forefather Freedon Nadd, Ommin was required to abandon his fears and doubts, lest through them he was consumed by the power he sought to control. According to Nadd, Ommin was only able to penetrate that barrier after he had fully embraced his hatred of everything—including the dark side of the Force. Once he accomplished that goal, Sith sorcery granted Ommin an amplified sense of his environment; he was able to influence the malevolent sensations of millions of beings and fill those unsuspecting individuals with a hatred that was not their own. Such an exertion of the dark side was not without its detriments, however. Mastery over Sith sorcery demanded that Ommin sacrifice motor control over his body in exchange for access to the unlimited power of the dark side."}, {"tag": "h3", "text": "Fear of Sith magic"}, {"tag": "p", "text": "Since the days of the Old Republic, Sith magic had elicited fear from the Jedi. Members of the Order actively pursued practitioners of Sith sorcery, and took painstaking measures to hide, destroy, or contain the objects that assisted Sith magicians in their conjurations. The Galactic Republic recognized the dangers posed by the Sith and their magics and so outlawed its practice by the time of 3998 BBY's Naddist Uprising. The Tomb of Freedon Nadd on Dxun was one such location where the Jedi hid a storehouse of magically imbued Sith artifacts, as was the Sanctum of the Exalted on the planet Odryn. At the end of the New Sith Wars, the Jedi Council of First Knowledge was tasked with the eradication of Sith magic, which included the protection, or, if necessary, destruction of sorcerous Sith artifacts. Nevertheless, the prohibition was ignored, and Sith magic was the weapon of choice on more than one occasion for many who entered into battle with the Jedi and the soldiers of the Republic's armed forces. By the time of the Jedi Civil War, which ended in 3956 BBY, the Galactic Senate had passed legislation that banned all things Sith. Prior to the end of the Clone Wars in 19 BBY, the anti-Sith bill had been rendered void, as the Senate had since introduced new laws that strictly forbade religious persecution of any sort, including adherence to the ways of the Sith. Fear of Sith magic again began to trouble the Jedi by that time, as they suspected that the powers of the dark side were on the verge of throwing the Force into complete disarray."}, {"tag": "p", "text": "In the waning years of their Golden Age, some Sith feared the power commanded by the more prominent sorcerers of the Empire. Sith Lord Naga Sadow's forages into previously unexplored avenues of Sith lore and ritual were looked upon with scorn by his detractors, who openly challenged his idealistic ambitions. King Ommin, a man in the lineage of Freedon Nadd, was at first fearful of the sheer scope of Sith magic in his early experiences with it. Darth Bane, a Dark Lord who succeeded Naga Sadow circa four thousand years later, was also wary of Sith magic because he lacked an affinity for it. He nonetheless allowed his apprentice, Darth Zannah, to indulge herself in its mysteries, but threatened to destroy the girl if she attempted to use her charms against him."}, {"tag": "p", "text": "Sith magic survived Darth Zannah and was practiced with much less exposure than previous generations by subsequent members of her Order, including the sovereign of the Sith-ruled Galactic Empire, Darth Sidious, whose continued adherence to its rituals was known only to very few individuals. By the time of the rise of Darth Krayt's One Sith Order, Sith magic was studied by the loremasters of Krayt's Order, showing familiarity with the names of past sorcerers like Karness Muur from having access to the works of sorcerers such as XoXaan. Darth Wyyrlok was particularly skilled with using Sith Magic to create illusions and was able to overcome the famed sorcerer Darth Andeddu in a duel with them."}, {"tag": "h2", "text": "Applications"}, {"tag": "h3", "text": "Acts of physical violence"}, {"tag": "p", "text": "Battle often required Sith sorcerers to unleash devastating spells to vanquish their enemies. Potent blasts of dark-side energy were capable of causing physical harm to sentients, non-sentients, and spirits alike. Sometimes the sorcerer's hand was burned, but the power of the dark side made them impervious to the pain. King Ommin used the Force to blast several Jedi during the Naddist Uprising, and the royal tutor Korus, after having his tongue transformed into a snake and lips grafted together, was finally burned alive upon receipt of an inadvertent blast of Force energy from newly trained Sith sorceress Aleema Keto. Then–Sith apprentice Exar Kun mastered the ability after acquiring a Sith amulet, one that augmented his already-increasing dark-side strength to new levels. He destroyed the spirit of Freedon Nadd in this manner, and later incapacitated Aleema Keto the same way, after the sorceress attempted to attack Kun with her own blast of Force energy. When Kun returned millennia later to harass the students of Luke Skywalker's Jedi Praxeum, a trainee named Gantoris was incinerated with the power still wielded by the Dark Lord's ghost."}, {"tag": "p", "text": "Several Sith sorcerers possessed the ability to form iridescent bolts of pure hatred. When hurled at their enemies, the victim suffered from extreme agony as the voices of a thousand wretched souls screamed within their minds. Others were able to weave lattices of dark energy to physically torture opponents, while simultaneously severing their connection to the Force. Both Darth Zannah and Sith initiate Kyp Durron exhibited an even more sinister demonstration of Sith magic with their dark side tendrils, mists of pure dark-side energy in the form of tentacles that were capable of causing immense mental and physical pain, and even the instant disintegration of flesh and bone."}, {"tag": "h3", "text": "Altering the perceptions of another"}, {"tag": "p", "text": "The domination of another being's mind and will was possible through Qâzoi Kyantuska, a spell that gave Sith sorcerers dominion over other beings and compelled those beings into actions they would have otherwise not performed. The more steeped in the dark side the sorcerer was, the easier it became to subdue the independent thought of another. Large-scale mind control was evidenced by Krath warlord Satal Keto's complete control over the pilots of his Chaos starfighters during the Battle of Koros Major, and Exar Kun's puppetry of the entire Senate assembly during the Trial of Ulic Qel-Droma. Many thousands of years later, an aspiring Devaronian Sith sorcerer named Cartariun enthralled the aboriginal Irrukiine species of Malrev IV. While searching for an apprentice of his own, Cartariun sensed and touched the minds of Rebel Alliance agents who had come to the planet, as well as those of the all-Bothan crew of the Starfaring."}, {"tag": "p", "text": "Besides direct control of another sentient's mind, Sith sorcerers were able to distort the Force perceptions of the Jedi by pretending to be followers of the light. This was done by creating a false light side aura, usually for the purpose of mingling with those who would have normally had a negative predisposition toward dark-side adherents. Both Freedon Nadd and Darth Zannah were skilled in projecting false light-side auras, the latter having learned the skill from the holocron of the former. Zannah displayed her cleverness with false auras of light while infiltrating the Jedi Temple on Coruscant in 990 BBY."}, {"tag": "p", "text": "Illusions borne of Sith magic were lifelike astral projections that touched all of an individual's sensory perceptions. Some Sith historians speculated that illusions disrupted the flow of the Force to the victim's mind, causing them to perceive their surroundings in ways that they otherwise would not. Illusions ranged from the transformation of one object into another, to the sudden materialization of beings seemingly from thin air, to the disappearance of objects that were in the victim's presence mere seconds before. Even computer systems were unable to discern the fallacy of the phantasmal images, which lent further to the dismay of those against whom the spell was directed. Only through intense concentration on the Force was an individual able to separate truth from falsehood. Naga Sadow was a consummate illusionist, as was the Krath sorceress Aleema Keto. Both made heavy use of illusions in their respective campaigns against the Jedi and Republic, but their projections were defeated differently. An interruption in Sadow's concentration caused him to lose control of his illusions, and the Jedi used the Force to pierce Aleema Keto's conjured deception. The Sorcerers of Tund, an ancient order of Sith sorcerers, also specialized in the creation of illusions."}, {"tag": "p", "text": "Aside from outwardly expressed illusions, Sith magicians possessed the ability to create hallucinations within the minds of specifically targeted individuals by summoning their worst fears. After performing a series of intricate hand gestures, a Sith sorcerer was able to reach into a sentient being's mind and call forth that which scared the victim the most. The potency of the spell varied as the sorcerer saw fit. The longer they poured the dark side into the spell, however, the more likely it was that the victim would be unable to recover. An individual was able to survive if they possessed significant strength of will, though if not, there was a great possibility that the victim would descend into utter hysteria. Freedon Nadd had the ability to summon the fears of his enemies, and it was from the study of his magic that Darth Zannah learned to do so as well. The victims of Darth Zannah's summon-fear spell were many, including her own Master, Darth Bane. Although Bane was able to overcome her trickery, others were less fortunate. On two separate occasions, those on the receiving end of Zannah's witchcraft were driven into an irreversible insanity. Rokur Gepta, a member of the Sorcerers of Tund, was also able to torture his enemies by creating terrifying illusions within their minds."}, {"tag": "p", "text": "Those who practiced Sith magic often believed themselves to be above reproach, and held no compunction about violating the sanctity of another sentient being's mind. With Sith magic, a sorcerer was able to tamper with the memories of another. \"Memory rubs,\" as they were called, erased or rewrote select recollections of any intended target. Sith initiate Kyp Durron learned to wipe memories from the spirit of Exar Kun, and with it violated scientist Qwi Xux so thoroughly that her mind had virtually become a blank slate."}, {"tag": "p", "text": "Sith magic also granted its masters with the ability to conceal themselves within the shroud of the dark side. When performed by a powerful sorcerer, the spell masked a person's strength in the dark side, preventing their presence or those of whomever they chose from being sensed in the Force even by Jedi Masters. Another of the spells learned through study of the transcript from Freedon Nadd's holocron, the spell of concealment, was mastered by Darth Zannah, who used it to great effect against the Jedi on multiple occasions. Such was the power of Zannah's concealment hex that ten years after fooling a team of Jedi on Ambria with it, the spell violently repelled the Force probe of a powerful darksider known as The Huntress into the healer Caleb's shack."}, {"tag": "h3", "text": "Artifacts, locations, and weapons"}, {"tag": "p", "text": "Holocrons were Force-activated teaching objects that held near-infinite amounts of information. Many sorcerers of the ancient Sith Empire fashioned their own holocrons to include the sum of their dark-side knowledge. Those who specialized in particular aspects of Sith magic included only that area of ritual within their holocrons. Because of this, no complete repository of Sith magic was included in any one source. Others recorded their knowledge in spellbooks and scrolls, hoping to ensure the continued availability of Sith magic's teachings throughout the generations."}, {"tag": "p", "text": "Magicians also imbued their weapons with the power of Sith sorcery. Amulets that facilitated concentration, healing, shielding, ensnarement, and understanding, all did so because a Sith sorcerer chose to bequeath a measure of his power unto them. A young man named Shas Dovos created a suit of battle armor based on the designs included in an instructional tome he found on his homeworld. Infused with the power of Sith magic, Dovos was bound to his creation after being approached by the spiritual guardian of the compendium, who then decided to rename him \"Warb Null.\" Kaox Krul, a Dark Lord allied to Lord Skere Kaan's Brotherhood of Darkness, combined Sith alchemy and magic to reinforce his battle armor with dark-side energy, which afterward offered nominal protection from Jedi attacks by emanating a defensive aura around its wearer."}, {"tag": "p", "text": "On planets and moons where the Force was strong, Sith sorcerers erected monumental edifices designed as focal points for their dark power. On the Inner Rim world of Ambria, a Sith sorceress built a massive obelisk imbued with the power of the dark side. The sorceress was killed, however, after failing to contain the released energies of an ill-conceived spell, resulting in the devastation of Ambria's landscape. Other examples of such structures include the temples on Yavin 4, engineered to be dark-side fulcrums by the Massassi servants of Naga Sadow, and later by Exar Kun's Massassi during the Great Sith War. In 14,000 BBY, pure-blooded Sith sorcerers built a Sith library-temple on the planet Krayiss Two where they meditated and performed experiments. Numerous Jedi were killed while trying to destroy the temple over the centuries, including Jedi Knight Vara Nreem, who visited the temple in 3997 BBY. She entered the building after reciting a Sith incantation to gain access, and was immediately descended upon and devoured by the spirits of many long-dead Sith. As the Beast Wars raged on the planet Onderon, members of the planet's royal family hollowed out a section beneath the royal palace of Iziz in which the remains of Freedon Nadd were kept. The tomb was the heart of Queen Amanoa's power, whereto she retreated to draw upon the dark energies that lingered around Nadd's sarcophagus. The subterranean fortress of her husband, Ommin, was where the king's sorcerous powers were the strongest. Millennia later, after the Republic had been reorganized into the Galactic Empire, its Emperor, a Dark Lord in the line of Darth Bane's Order called Sidious, discovered that the dark side suffused the atmosphere of the planet Malrev IV. He had a temple constructed there through which he intended to channel the power of Sith magic."}, {"tag": "h3", "text": "Disturbing the natural order"}, {"tag": "p", "text": "At times, the dark side was visibly manifested in a planet's atmosphere when summoned through Sith magic. By summoning their deepest and most potent negative emotions, a Sith sorcerer was able to create waves of darkness, energy that radiated outward from the sorcerer in a spherical aura and instantly demoralized anyone caught within its radius. Individuals noticed that the area around them—whether within the confines of a building or outside in the skies above—became visibly immersed in absolute darkness. Thunder boomed and was accompanied by a roaring sound as the darkness spread. Anyone caught in the vicinity immediately began suffering from feelings of intense horror, pain, and bewilderment. Victims were tormented by whispers of the dark side that left them in a state of total hopelessness, and prolonged exposure robbed them of the will to fight. Jedi and other followers of the light felt stifled, as though their connection to the Force was being smothered."}, {"tag": "p", "text": "Many Sith sorcerers cared little for preserving the natural order of the universe, and held no reservations about disrupting it as a means to an end. Such was the contention of Naga Sadow, who used Sith magic to ignite solar flares around the star Primus Goluud, effectively escaping capture or destruction at the hands of the Koros fleet. Sadow later decimated Galactic Republic pursuers by wrenching free the cores of the binary Denarii suns, causing them to go nova and annihilating the entire star system. During the Great Sith War, sorceress Aleema Keto was taught by Exar Kun to harness Sadow's supernova-inducing power. She made use of her new talent during the Battle of Kemplex IX, agitating all ten stars of the Cron Cluster into a stellar explosion. The result was the formation of the Cron Drift, the devastation of the Jedi planet Ossus, and the death of Keto herself, who had not been strong enough to control the power she had unleashed. Prior to his rise to power, the Emperor of the restored Sith Empire performed a ritual that resulted in the creation of The Void: an utter absence of all life, and of the Force. The Void subsumed light, sound, and even color, an effect which turned the world of Nathema brownish-gray in appearance. Even a thousand years after The Void was created, it threatened to discorporate Force sensitives who dared visit the abhorrent world. When he later established his Sith Empire, Lord Vitiate perfected and performed dark rituals that ravaged the atmosphere of Dromund Kaas and created frantic electrical storms."}, {"tag": "p", "text": "For thousands of years, the world of Ambria was suffused with the dark side, a side effect of a complex spell performed by the Sith sorceress who had once resided there. Unable to contain the vast quantities of energy her spell released, the sorceress was killed when it went awry, and the entire Ambrian landscape was ravaged as a result. It was only after the arrival of a Jedi Master named Thon and his subsequent battle with the residual spirits on Ambria that the planet's darkness was checked, having been trapped in a lake by the Tchuukthai Jedi."}, {"tag": "h3", "text": "Healing"}, {"tag": "p", "text": "Sith magic also allowed sorcerers to expedite the convalescence of an individual. Karness Muur, one of the original Dark Jedi Exiles of the Hundred Year Darkness, delved into and practiced dark-side healing. Rin Shuuir, a magician of the ancient Sith Empire, wielded a healing amulet with which he rejuvenated the wounded warrior Utris. Freedon Nadd used the dark side to mend Exar Kun's broken body after the latter had been pulverized by falling rubble within the Great Temple of Korriban. The injuries of Rogue Squadron pilot Wedge Antilles, and those of fellow pilot Dllr Nep, were repaired through Cartariun's use of Sith magic. Although healing through Sith magic was possible, returning the dead to life was not."}, {"tag": "h3", "text": "Incantations"}, {"tag": "p", "text": "Spellcasting was an essential quality of Sith magic, as its practitioners believed that giving voice to an incantation tapped the strength of countless Sith sorcerers long passed. Any that required vocalization were only scribed in the Sith language, and could only be recited in said tongue."}, {"tag": "h3", "text": "Necromancy"}, {"tag": "p", "text": "When a situation required a Sith sorcerer to utilize more of the dark side than they normally had access to, necromancy often granted them the power they sought. However, sorcerers ran the risk of becoming the puppets of the spirits they invoked. Queen Amanoa summoned the spirit of Freedon Nadd to assist her in battle against the Beast Riders of Onderon's wilderness, but his spirit abandoned her in the presence of the Jedi. To further his own Sith training, King Ommin also beseeched the spirit of Freedon Nadd, which came from the netherworld of the Force to complete Ommin's initiation into the ways of the Sith. Ommin also requested assistance from Nadd to combat the Jedi, but as it had been with his late wife, the Dark Lord's spirit forsook the king when Nadd realized that Ommin had failed him. Nearly fifty years after Ommin's death, four Sith Masters also attempted to resurrect the spirit of Freedon Nadd, but were thwarted by the efforts of Meetra Surik and her companions."}, {"tag": "h3", "text": "Protection"}, {"tag": "p", "text": "Sith magic was used for defense as well as for attack. Sorcerers, fledgling or seasoned, were able to conjure shadows of uneasiness around themselves that repelled any non-sentient creature within range. The vague sense of discomfort caused by an aura of unease also affected cognizant beings, stirring in them feelings of sudden sickness and debility. Sith sorcerers were also known to perform magical experiments on inanimate objects, imbuing them with dark-side power in attempts to ensure the safety and security of themselves or others. Sith Lord Ludo Kressh used magic in the creation of a device designed to protect his young son from harm. The gauntlet of Kressh the Younger was later obtained and wielded by a failed Jedi Padawan-turned-Sith acolyte named Haazen."}, {"tag": "p", "text": "The ancient Sith also used their wizardry to protect the things they deemed sacred. Such a spell guarded the entrance of the room within Freedon Nadd's sepulcher that hid his holocron. In the Valley of Golg on the Sith homeworld of Korriban, ancient magic in the form of wall inscriptions was utilized in the protection of the tombs of deceased Sith Lords. The magically created armor of Warb Null offered him greater protection in battle, as did that of the Sith Marauder Kaox Krul."}, {"tag": "h3", "text": "Twisting life"}, {"tag": "p", "text": "As Sith sorcerers sought to bend the Force to suit their purposes, they delved into bizarre experiments concerning the manipulation of both life and death. Before the Dark Jedi Exiles arrived on Korriban and sullied the bloodlines of the native Sith species, a king named Dathka Graush combined alchemical sciences with his mastery of Sith magic to create an army of undead monstrosities from the corpses of those fallen during one of Korriban's cyclical civil wars. Graush also worked Sith magic in tandem with the most advanced and available technologies to fashion a dark-side crystal, one imbued with more than a thousand Sith spirits, with which he replaced his own heart. When Graush was assassinated, the spirits of his Korriban zombie army joined those trapped within his crystalline heart."}, {"tag": "p", "text": "Among those who later arrived on Korriban and proclaimed themselves the first Lords of the Sith was a man named Karness Muur, whose magical endeavors surrounded the extension of life, and the preservation of a being's spiritual existence even after their corporeal death. Muur crafted a special talisman in which his essence was preserved, but allowed him to influence the physical realm when it was donned by a living Force-sensitive being. The Muur Talisman served another purpose as well: through Sith magic, it was able to transform non-Force-sensitive humanoids within its vicinity into Rakghoul mutants, Sithspawn whose bite infected its victims—Force-sensitive or not—with an incurable plague that slowly transformed them into rakghouls as well. Following his defeat in the Great Hyperspace War and subsequent exile on the Yavin moon, Naga Sadow used a combination of Sith magic and alchemy to mutate the descendants of the Massassi crew members of his starship, turning them into even more terrifying warriors."}, {"tag": "p", "text": "Darth Andeddu, an ancient Dark Lord of the Sith who ruled over the planet Prakith long before the New Sith Wars, based his studies on Karness Muur's life-altering experiments. Through Sith sorcery, he perfected the ability to transfer his essence into another vessel, thus achieving eternal life. On Yavin 4, Naga Sadow used technology along with Sith sorcery to enter into a state of suspended animation before it was disturbed by a Nautolan Jedi Knight named Eison Gynt, into whom Sadow transferred his spirit. Many more also discovered the ability to refit their spirits with new bodies, some organic, others into machines. The Sith Lord Vitiate used the strength of eight thousand Sith Lords to perform an incredibly complex ritual of Sith magic that stripped all life from the planet Nathema, granting him immense strength in the Force and immortality as a result."}, {"tag": "p", "text": "During the final battle of the Great Sith War, Dark Lord of the Sith Exar Kun combined Sith magic with perverted Jedi techniques to drain the essences of all of Yavin 4's indigenous Massassi. Kun's own spirit was sundered from his body during the ritual, but the combined might of the Jedi's wall of light succeeded in trapping Kun's wraith within the walls of his temple. He also used Sith sorcery to trap the spirits of the Massassi children within a Golden Globe for all eternity."}, {"tag": "p", "text": "In the early years of the New Sith Wars, a Zelosian Dark Lord of the Sith called Darth Rivan made use of Sith magic in the creation of his fearsome Sith battlelords. The spell was perceived in the Force as a strand of black energy that unwillingly and inextricably bound senior soldiers to their subordinates, and caused severe pain the further apart a subordinate was from his or her master. The Jedi discovered that the spell was able to be broken with a blast of Force Light."}, {"tag": "h2", "text": "Users"}, {"tag": "p", "text": "Sith magic predated the formation of the Galactic Republic, a democratic institution that served the galaxy for twenty-five millennia. Members of the indigenous Sith species pioneered and perfected these rituals by which they called on the power of the dark side, to a degree thought unreachable by ordinary sentient beings. A group of sorcerers who were exiled from the original Sith Empire relocated to the planet Tund, where they practiced their radical magics in total seclusion. Adas, an ancient Sith king who died circa 27,700 BBY, was a reputed master of Sith magic. Of the many Sith in Adas's entourage was Raspir, whom the King employed as a court magician. Dathka Graush, a tyrant who succeeded Adas more than twenty thousand years later, also had a flair for Sith enchantments. Roughly fifty years after Graush, Dark Jedi outcasts from the Jedi Order conquered the Sith species, and incorporated the species' magical practices into their own dark-side rituals. The Sith Lord Karness Muur was one such individual who, through Sith magic, developed ways to extend his lifespan far beyond what was natural. Around the time of the Great Hyperspace War, Sith sorcery was widely disseminated among the Lords of the Sith Empire. Ludo Kressh, Tritos Nal, Marka Ragnos, and Rin Shuuir were among them. One of the most famous of that era was Naga Sadow, whose studies into the nature of Sith magic were a cause for concern among his fellow Sith Lords. Prior to becoming Dark Lord, Sadow began to train another in Sith sorcery, a Human male named Gav Daragon."}, {"tag": "p", "text": "As Sadow engaged in the Great Hyperspace War against the Jedi and the Republic, a Sith dreadnaught under his command crash-landed on the planet Kesh. Stranded on the remote world, the leader of the all-Sith crew, Yaru Korsin, used Sith magic in his role as luminary of the Skyborn deities of Keshiri legend."}, {"tag": "p", "text": "Many sorcerers recorded their magical formulas in Sith tomes, scrolls, and holocrons, and many more learned to tap into that ancient power through intense study of those artifacts. Such was the case with Freedon Nadd who, prior to apprenticing himself to Naga Sadow, amassed a wealth of Sith knowledge from the holocrons of both Adas and Darth Andeddu. In the tradition of the Dark Lords who preceded him, Nadd recorded the sum of his sorcerous knowledge within the recesses of his own holocron. His descendants, King Ommin and Queen Amanoa, both practiced Sith magic, and dispersed its power throughout their Naddist cult. Among its most prominent wielders were the royal advisor Novar, and Warb Null, the guardian of Freedon Nadd's spirit. The Jedi attempted to prevent the spread of Sith magic by entombing Nadd's remains and his abundance of Sith relics in an impregnable tomb on Dxun, Onderon's fourth moon, but were unsuccessful. Despite the Jedi Order's best efforts, Nadd trained two aspiring Sith, Aleema Keto and her cousin Satal, in the ways of dark-side magic, and both became powerful magicians under Nadd's guidance. Sith magic was then spread throughout the Empress Teta star system by way of the Krath organization, whose knowledge came from ancient texts and antiquities gifted to the Ketos by the ghost of Freedon Nadd himself. Nadd also took another as his apprentice, the fallen Jedi Exar Kun, whose aptitude with Sith magic far exceeded Nadd's expectations. After inheriting Nadd's position as Dark Lord of the Sith, Kun joined forces with the Krath, and together they brought Sith magic to bear against both the Jedi and Republic in the Great Sith War."}, {"tag": "p", "text": "Exar Kun's Sith Brotherhood was ultimately defeated over Yavin 4. Sith magic had been temporarily defeated, but resurfaced more than three decades later in the form of Karness Muur's spirit and his Muur Talisman. The same year, Celeste Morne, a Shadow working undercover for the clandestine Jedi Covenant, acquired Muur's talisman and was given access to its magical ability to transform Force-sensitives into Rakghouls, a form of Sithspawn that transmitted their eponymous plague through their bites. Morne continued to wield Sith magic for nearly the next four thousand years, her lifespan greatly extended because of both the Muur Talisman and prolonged periods in stasis. Not long after Morne entered stasis for the first time, the Covenant's de facto leader, an undercover Sith acolyte named Haazen, revealed that several artifacts in his possession granted him the ability to command Sith magic. During the Jedi Civil War, the Sith Lord Darth Malak was known to have practiced Sith sorcery."}, {"tag": "p", "text": "During the New Sith Wars, the Sith Lord Darth Rivan made use of Sith magic in the creation of his fearsome battlelords. His servant, Darsin, also possessed the ability. Kaox Krul, another Sith Lord from the era of the New Sith Wars, practiced Sith magic and alchemy in tandem. Roughly four years after the war's end, a twelve-year old named Zannah built the foundations of her Sith training on the sorcery of Freedon Nadd, which her Master had transcribed from Nadd's holocron. She obtained other sources of knowledge over the years, and by 980 BBY, had achieved mastery over Sith magic. In the centuries that followed, a fallen Anzati Jedi Master abandoned his light-side path and became an accomplished Sith magician."}, {"tag": "p", "text": "By the time the Sith Order to which Darth Zannah belonged had succeeded in wiping out the Jedi and replacing the Republic with the first Galactic Empire, Sith magic had become something of a rarity. Some Force-sensitives, however, like the smuggler Len Markus, became enraptured with the Sith teachings. The Emperor, a Dark Lord in the line of Zannah's order called Darth Sidious, also studied Sith magic, and so did the Dark Side Adepts in his service. During the Galactic Civil War, Rokur Gepta practiced the magic of the Tund sorcerers. Several untrained Force-sensitives, like the Imperial technician Cartariun, chanced upon the Sith temple on Malrev IV, where he learned to harness the power of Sith sorcery. A Bothan named Girov Dza'tey learned to tap into that same power through the Jeswandi meditation techniques of his native people."}, {"tag": "p", "text": "Seven years after the death of Darth Sidious, the spirit of Exar Kun returned to terrorize the trainees of Luke Skywalker's Jedi Praxeum. He taught one student, Kyp Durron, how to control the Force through Sith magic. Kun was eventually defeated by Durron's classmates, his spirit was forever destroyed, and Sith magic again was left without any known practitioners. When the dark side was again on the ascendant more than a century later in the form of Darth Krayt's One Sith Order, the regime's foremost loremasters, Darths Maladi and Wyyrlok, studied Sith magic extensively. The spirit of Karness Muur and his thrall Celeste Morne reappeared during that time, where they reintroduced the galaxy to Rakghouls and their plague. The members of the One Sith recognized the beasts as the product of ancient sorcery, and all were destroyed along with their creators in battle on the world of Had Abbadon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The concept of Sith magic was first mentioned in author Tom Veitch's Dark Empire endnotes, a series of essays that explored backstories of characters included in the Star Wars: Dark Empire comic series, as well as those of several Tales of the Jedi mainstays. While the endnotes simply referred to it as \"primitive magic,\" Veitch's Ulic Qel-Droma and the Beast Wars of Onderon was first to associate said magic with the Sith and the dark side of the Force. 1996's Tales of the Jedi Companion explored further into the nature of Sith magic, explaining its relation to the eponymous species and subsequent adoption by the conquering Dark Jedi Exiles. Sith magic continued to be used as an underlying plot device extensively throughout several of the subsequent Tales of the Jedi story arcs. It was also featured in the cut Star Wars Adventure Journal story Light and Shadow, written by Paul Danner."}, {"tag": "p", "text": "Sith magic also served as a plot device in the Requiem for a Rogue story arc of the Star Wars: X-Wing Rogue Squadron comic series. Storyline developer Michael A. Stackpole noted in the X-wing Rogue Squadron handbook that he intended to revive a bit of Star Wars mysticism by reintroducing Sith magic in the Requiem for a Rogue series. It received recognition in the expansive Vector metaseries by way of the main antagonist Karness Muur, rakghouls, and the Rakghoul Plague, which were all associated with Sith magic."}, {"tag": "p", "text": "While they were never explicitly stated to be, several actions of the Sith Emperor of the resurgent Sith Empire fell well within the scope of Sith magic as described by sources such as the Tales of the Jedi Companion and The Dark Side Sourcebook. The same applies for the ritual employed by the four Sith Masters in Star Wars: Knights of the Old Republic II: The Sith Lords, whose actions are synonymous with the description given in the \"The Supernatural: Dark Spirits\" section of the The Dark Side Sourcebook."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}