{"url": "Sith_fleet_(New_Sith_Wars)", "categories": ["Category:Legends articles", "Category:Fleets", "Category:Sith military units"], "nodes": [{"tag": "h1", "text": "Sith fleet  (New Sith Wars)"}, {"tag": "p", "text": "The Sith fleet was the spacegoing arm of the Sith military which fought for the Brotherhood of Darkness in the closing stages of the New Sith Wars."}, {"tag": "h2", "text": "Ships"}, {"tag": "p", "text": "Typical capital ships were Sith Dreadnaughts and other cruisers, but Sith Destroyers like the flagship Nightfall were probably even more powerful, and smaller corsair battleships also served as attack ships."}, {"tag": "p", "text": "Alongside the larger ships, the Sith fleet made use of starfighters like the Buzzard and Sith interceptor, troop transports like the Interloper, and other small ships such as the T-class long-range personal cruiser."}, {"tag": "p", "text": "From their names, it appears that most of these types were unique to the Sith fleet, indicating that they were constructed in shipyards under Sith control, probably in the Outer Rim, where the Brotherhood of Darkness commanded most of their support."}, {"tag": "h2", "text": "Organization and tactics"}, {"tag": "p", "text": "The fleet was normally commanded by Lord Kaan in person from the Nightfall, but the ranking naval officer was Admiral Adrianna Nyras. Naval personnel appear to have been non-Force-sensitive, but, especially when driven by Kaan's battle meditation, the Sith fleet was capable of challenging the Republic Navy in combat."}, {"tag": "p", "text": "Operations were based around the control of planets. Attacks involved overwhelming the defending Republic forces in orbit and deploying Sith ground troops for surface combat, and defensive tactics were centered on preventing Republic forces from fighting their way through to place their own troops on Sith-controlled worlds."}, {"tag": "h2", "text": "Operational history"}, {"tag": "p", "text": "It is not known what sort of naval assets Kaan acquired from the feuding warlords who he united into the Brotherhood of Darkness, or what sort of fleet was available to the Brotherhood in the first years of their campaign—for instance, at the Battle of Korriban in 1006 BBY."}, {"tag": "p", "text": "By 1003 BBY, however, the Sith fleet was capable of leading the conquest of Kashyyyk to establish a foothold in the Mid Rim, and in 1002 BBY, they won the First and Second Battles of Ruusan, eliminating the Republic staging base being used to strike back at Kashyyyk."}, {"tag": "p", "text": "It was probably at around this time that the Sith fleet was involved in battles at Bespin and Sullust on the Outer Rim, and then at Taanab, near the Hapes Star Cluster. Kaan was surprised not to be opposed by a fleet led by Lord Hoth, the Jedi Master and General who was regarded as the Republic's greatest defender: but the Jedi seemed abruptly absent from the war."}, {"tag": "p", "text": "The clash at Taanab, located on the Perlemian Trade Route in the Inner Rim, may have marked the start of the fleet's push into the Core. Undeterred by the seeming disappearance of the Jedi, the fleet thrust forward with a campaign in Bormea sector, including the conquest of Corulag, Chandrila and Brentaal IV, and the wresting of both the Perlemian hyperlane and the Hydian Way from Republic control."}, {"tag": "p", "text": "But at this point, Lord Hoth revealed his hand: he had gathered the Jedi in a military force named the Army of Light, and they liberated Ruusan, defeating the defending naval squadron using a massive starfighter attack, and forcing Kaan to return to face them."}, {"tag": "p", "text": "By 1000 BBY, and the closing stages of the Ruusan campaign, most of the fleet had been withdrawn to guard Ruusan itself, entrenched in orbit and outnumbering the Jedi fleet in the outer system, in order to prevent them from providing reinforcements to the Army of Light."}, {"tag": "p", "text": "During the Seventh Battle of Ruusan, as part of his plot to destroy Kaan and the Brotherhood, Darth Bane ordered Admiral Nyras to break out from her defensive position and attack the Jedi fleet, allowing Lord Valenthyne Farfalla's gunships to fight their way through to the surface with reinforcements."}, {"tag": "p", "text": "The Sith were defeated during that battle, with Kaan and his Brotherhood wiped out."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}]}