{"url": "Skaak_Tippers", "categories": ["Category:Legends articles", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Skaak Tippers"}, {"tag": "p", "text": "The Skaak Tippers were a gang of renegade computer slicers active on Naboo during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Skaak Tippers, who dealt in illegal trade of information, ripping of bank account and other acts of computer network crime, had several inspirations for the name of their organization. The \"Tipper\" part obviously was derived from the monicker of their leader. The \"sk\" in \"Skaak\" was inspired by the SK unit of measure for computer data, while \"aak\" was inspired by the ferocious aak dogs of Haruun Kal. The name was meant to give the impression that the Skaak Tipers were a pack of vicious computer hackers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Skaak Tippers were formed by a mysterious Corellian known only as the \"Tipper.\" He took that monicker because he would \"tip\" the contents of other people's bank account into his own."}, {"tag": "p", "text": "By the time of the Battle of Yavin, the Skaak Tippers were considered by the RSF Intelligence Division as one of the four major criminal groups on Naboo, along with the Mummers, the Nal Raka Criminal Empire and the Darkwalkers. The Skaak Tippers had hostile relationships with Borvo's organization and the Darkwalkers."}, {"tag": "p", "text": "When the gang started to cut into the smuggling business of Radeld Siwar on Naboo, Siwar sent a young smuggler to deal with the problem. The smuggler ambushed and killed several gang members near Theed to send the gang a message."}, {"tag": "p", "text": "Circa 1 ABY, the Skaak Tippers invaded the Old war bunker near Kaadara, a research facility used by the Royal Naboo Security Forces to learn more about the Trade Federation droids by the time of the Invasion of Naboo. In the meantime, RSF Colonel Panaka started to investigate the Skaak Tippers. He dispatched Sergeant Willoc to the old war bunker and a spacer to confiscate Skaak Tipper weapons crates near the Skaak Tipper Compound. Royal Naboo Security Forces agents discovered that the Tippers were planning to steal all bank terminals from all over Kaadara. However, the Skaak Tippers suffered a major setback when RSF agents killed one of their leaders, Jonni Skaak, during the assault of the Skaak Tipper Hideout."}, {"tag": "p", "text": "In the meantime, the Skaak Tippers and Darkwalkers blackmailed Hugo Eckener, the father of the indebted Karl Eckener, to force him to hire spacers in order to attack Borvo Bunker. Skaak Tipper Toff Henrou later ordered the spacers to attack the Darkwalker Cave while the Darkwalker Jorgellansel ordered them to attack the Skaak Tipper Compound."}, {"tag": "p", "text": "Soon thereafter, the wanted murderer Hunnos Jarkey briefly took refuge in the Skaak Tipper Compound after he escaped the Royal Naboo Security Forces."}, {"tag": "p", "text": "Later, Tanoa Vills dispatched a spacer to the Skaak Tipper Cave, in the Gallo Mountains, in order to get octave regulators from Skaak Tipper machinists."}, {"tag": "p", "text": "A few time later, the Skaak Tippers operating from the Skaak Tipper Bunker in the Lasay Swamp stole a valuable Gungan artifact. Boss Rugor Nass thus sent a spacer to recover the artifact in the bunker. After killing Tomi Skaak, the leader of the bunker, the spacer discovered that the artifact had been moved to the Skaak Tipper Cave in the Gallo Mountains. The spacer went to the cave and finally killed Dee Skaak to recover the Gungan artifact."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}