{"url": "Sixtat/Legends", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Males", "Category:Sakiyans"], "nodes": [{"tag": "h1", "text": "Sixtat"}, {"tag": "p", "text": "Sixtat, also known as the Outlands Butcher, was a male Sakiyan bounty hunter in operation during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "As a Sakiyan, he was a natural hunter which served him well in his chosen profession. With his talents he gained much notoriety, as well as arrogance leading him to believe he was unstoppable. Eventually, his success as a bounty hunter caught the attention of Count Dooku who wanted him to compete with other bounty hunters in the Box, a death machine designed by Moralo Eval, on Serenno to win the honor of kidnapping Supreme Chancellor Palpatine. He witnessed Cad Bane murder another bounty hunter Bulduga to get his hat.\nSoon, Dooku briefed everyone on the challenge the bounty hunters had to face including telling them about The Box. They were all deprived of their weapons and soon they entered The Box."}, {"tag": "p", "text": "Their first challenge was to escape a room that was filling with dioxis gas. Platforms began to rise from the ground and all the bounty hunters, Sixtat being one of the first climbed on top of them. Seconds later, he was kicked off the platform by Embo, though he got on top of another one. Another bounty hunter, Rako Hardeen who was actually Jedi Master Obi-Wan Kenobi in disguise found a secret tunnel underneath the ground. Sixtat was doubtful of discovery but nevertheless followed him through the tunnel along with the other hunters, thus surviving the first round."}, {"tag": "p", "text": "In the second round, ledges began to slide out of the walls with a sword resembling a lightsaber swinging around on its front. Bulduga's brother Onca quickly fell prey to the blades. As before, Hardeen saw an open tunnel on the ceiling. Using the ledges, he and Bane hopped to the top towards the tunnel with the other bounty hunters following behind. Bounty hunters Kiera Swan and Sinrich were killed as well but Sixtat got out of the challenge along with the remaining bounty hunters."}, {"tag": "p", "text": "The third challenge involved the whole room being ray-shielded and the walls closing in. The switch to deactivate the shields was located in shaft in the wall behind a smaller ray-shield. Eval provided a special serum that, if injected can provide the person temporary immunity to the ray-shields."}, {"tag": "p", "text": "Platforms began to rise out of the center of the ground. Jakoli was instantly electrocuted as well when the floor he stood became ray-shielded. A hunter called Derrown was able to inject the serum due to his anatomy of being immune to such serums. During his attempt to get to the button, Mantu lost his balance and fell to his death. Derrown was eventually able to press the button and the surviving hunters made it to the next and final round."}, {"tag": "p", "text": "They found themselves on a platform with the ground below them doused in flames. This challenge involved sharpshooting which Sixtat preferred. A small yellow target zipped across the wall. Next to them, a sniper rifle appeared in a small machine. Sixtat took the rifle and aimed at the target. He shot the first two perfectly but missed the third. As a result, the platform he stood on disappeared into the ground and Sixtat fell into the flames which killed him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}