{"url": "Siward_Cass/Legends", "categories": ["Category:Legends articles", "Category:Death Star residents", "Category:Humans", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Siward Cass"}, {"tag": "p", "text": "Siward Cass was a Human male military officer who served the Galactic Empire aboard the first Death Star during the Galactic Civil War. By 0 BBY, he was a war veteran and had acted as an aide to Grand Moff Wilhuff Tarkin for many years."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Siward Cass was born in the Patriim system, within the Seswenna sector of the Outer Rim region of the galaxy. At some point during his life, he joined the ground forces of Palpatine's Galactic Empire. For many years, he served as an aide to Wilhuff Tarkin, Grand Moff of the Oversector Outer."}, {"tag": "p", "text": "By the time of the Galactic Civil War, a major galactic conflict fought between the Empire and the Rebel Alliance, he was considered a veteran. Cass acted as the chief communications officer aboard the first Death Star battlestation. He was entrusted with extremely sensitive information and communications between Tarkin and the Imperial government. Because of this, he was part of the Death Star command, and had a seat at its conference table. Cass' duties ranged from handling routine communications to delivering priority news to the Grand Moff."}, {"tag": "p", "text": "In 0 BBY, the Imperials managed to capture Princess Leia Organa of Alderaan, who had strong ties with the Rebel Alliance, and Tarkin tried to make her confess the location of the Rebels' headquarters. Organa ended up giving the name of Dantooine, after which that planet was checked for Rebel presence. Subsequently, Cass was committed with the delicate task of reporting to Tarkin that it no longer held any active base. Although he found the situation uncomfortable, Cass did his duty with no signs of nervousness. Having made his report, he immediately exited the room. Cass perished as the Death Star was destroyed during the Battle of Yavin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Around the Battle of Yavin, Siward Cass was a pale-skinned, older man who sported short gray hair. Within the Imperial military, he was considered a model adjutant. However, despite his reputation for being self-possessed and discreet, Cass still was wary of Tarkin's wrath, and he disliked being the one bearing bad news to the Moff."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Siward Cass made his first appearance in the 1977 Star Wars: Episode IV A New Hope, in which he was portrayed by English actor Patrick Jordan. Albeit unnamed in the movie itself, he was referred to as \"Cass\" in its novelization. Jordan got the part of Cass in A New Hope through his friendship with Alec Guinness, who portrayed Obi-Wan Kenobi and whom had worked with Jordan for The Old Vic company in the 1940s. However, Jordan shared Guinness' contempt for the film, dubious about the film's prospects."}, {"tag": "p", "text": "Although Cass was sometimes identified as a general by fan-created sources, he was initially only referred to in canon as \"Imperial Officer Cass\" or \"Officer Cass,\" and his exact rank long remained unknown. Unlike most characters whose names are known in the script, Officer Cass did not have an entry in the StarWars.com official Databank."}, {"tag": "p", "text": "In 2013, Cass was eventually given the first name \"Siward\" and the rank of \"Chief\" in both the Death Star Owner's Technical Manual and the article The Death Star Coup, written by Jason Fry for the Special Edition 2014 of the Star Wars Insider magazine. According to Chris Trevas, one of the co-authors of the Technical Manual, Cass was given that rank because his insignia plaque was the same one as Moradmin Bast's, who was first identified as \"Chief Bast\" in the Star Wars Customizable Card Game Premiere Limited expansion set. Fry chose the character's first name as a nod to William Shakespeare's play Macbeth, which featured the character of Siward, Earl of Northumberland, general of the English forces."}, {"tag": "p", "text": "The 2008 novel Death Star featured an unidentified colonel serving as Tarkin's aide, although it is not clear whether he was intended to be Cass or not."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}