{"url": "Sixth_Negative_Regions", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Sector Armies"], "nodes": [{"tag": "h1", "text": "Sixth Negative Regions"}, {"tag": "p", "text": "The Sixth Negative Regions, also known as Black Sword Command and simply the Sixth Army, was a Republic and later Imperial reserve Sector Army charged with the defense of Sector 6."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The Sixth Army, at the time of the Clone Wars, was a reserve command dominated by repair yards and training camps. The Sector Army's territory continued that of the First Army's half circle in the western quadrant. Besides this, it also had an extended theater of operations intended to guard against threats from the Unknown Regions. As with the Fifth Deep Core Army, many members of the 6th Sector Army were shifted to areas requiring greater need than their assigned sector, often leaving the oversector thinly defended."}, {"tag": "h3", "text": "Imperial Period"}, {"tag": "p", "text": "Given its location in what could be considered the Core Worlds, it apparently lay at an extreme latitude within the Galactic disk, or else on the edge of the Unknown Regions rather than in the geographical Outer Rim of the Galaxy. Black Sword Command extended through Praxlis and Corridan and enveloped the entirety of the Kokash and Farlax sectors, an area of authority implying that it represented an Oversector. The name \"Black Sword Command\" referred both to this area of space and to the military forces assigned here, although the latter were sometimes called simply the Black Fleet. Following standard Imperial operation procedure, at least five Type II Orbital Repair Yards were built throughout Black Sword Command to provide localized maintenance and shipbuilding facilities. Black Fifteen at N'zoth in the Koornacht Cluster had a reputation as the best yard in the sector, due to the efficiency of the native Yevethan workers."}, {"tag": "h3", "text": "Disappearance of the Black Fleet"}, {"tag": "p", "text": "Black Sword is most famous due to the disappearance of a sizable fraction of its fleet forces, which went unnoticed in the anarchy after the Battle of Endor in 4 ABY. Twelve years later, when the New Republic discovered a complete Imperial order of battle aboard the wreck of the Star Destroyer Gnisnal, they found that Black Sword Command constituted the most significant gap in their intelligence on the Imperial Fleet: they had lost track of five front-line capital ships and thirty-nine others undergoing construction and repair. None was smaller than a Victory-class Star Destroyer, and they included three Super Star Destroyers. To this total were later added five Type II shipyards. At least part of this disappearance was due to the Yevetha. Eight months after the Battle of Endor, the Imperial garrison at N'zoth received orders from Ysanne Isard to stand down and withdraw into Deep Core, after destroying any non-movable assets in order to prevent a New Republic move on Coruscant. Before Commander Jian Paret could complete the execution of his orders, however, Yevethan revolutionaries led by Nil Spaar seized the Black-15 shipyard, the Super Star Destroyer Intimidator, and the eight other ships under construction there. They ruthlessly wiped out most of the garrison and civilian colony, placed those Imperial citizens that survived in a labor camp on Pa'aal, and began to work on mastering hyperdrive and turbolaser technology. Due to faulty intelligence, Imperial Intelligence believed the fleet had actually been destroyed at Cal-Seti."}, {"tag": "p", "text": "Over the next decade and more, the Yevetha completed the Imperial warships they had captured, built many more to the same designs, and supplemented this fleet with modernized versions of their own traditional Aramadia-class thrustships. There is some uncertainty, however, about just how many ships and shipyards the Yevetha acquired. Most tellingly, at least twenty of the ships recorded in the information from Gnisnal were projected to have left the shipyards by the time the Imperials withdrew the Black Fleet from their Rimward posture, and even with the Intimidator in a spaceworthy condition, it is questionable whether the Yevetha would have been able to take her into combat against the five front-line Star Destroyers that remained unaccounted for. While it does appear that the Yevetha acquired at least one additional Type II shipyard, codenamed Black Nine, which they relocated to ILC-905 and Black Eleven which they relocated to the Doornik-1142 system, it is not clear if they seized Black Eight, which had been at Wakiza, and which they claimed the Imperials destroyed when they withdrew from that world. Although their comparable claims about Black-15 were false, the capture of the yard at N'zoth was made possible by the preponderance of Yevethan workers employed there, which the testimony of Davith Sconn suggests was a unique feature of that yard."}, {"tag": "p", "text": "Additionally, some confusion about the exact circumstances of the Imperial recall of the Black Fleet must be noted. Rebel historian Voren Na'al claimed that the entirety of Black Sword was withdrawn eight months after Endor by Ysanne Isard, to defend Coruscant and other Imperial holding in the Core Worlds, but his account errs in confining Black Sword's area of operation to the Koornacht Cluster. An addendum to an Imperial report on the Yevetha compiled by Imperial sentientologist Obo Rin (a section perhaps added by Zeven Mallat of the Imperial Security Bureau rather than Rin himself) states that the Black Sword Command leadership ordered the ships undergoing repairs in the yards in Koornacht to be pulled out and put into the front line in a bid to stem the New Republic advance, but that they never appeared. However, the orders given to Commander Paret, the garrison commander at N'zoth, were to destroy all Imperial assets that could not be immediately evacuated, and to move his personnel and spaceworthy ships—meaning essentially the Intimidator—not towards Coruscant or against the Rebels, but rather into the Deep Core. This must be seen as early groundwork for Operation Shadow Hand. There is likely some truth in the common claim of both accounts that ships from Black Sword were withdrawn from the Rim for use against the New Republic, but this need not have been directly linked with the decision to abandon N'zoth and Koornacht. It is known that at least some of the Command's spaceworthy ships had already been withdrawn, such as the Harridan, the guardship at N'zoth, which was recalled three weeks before the evacuation order, to fight in a rearguard action at Notak. Moreover, without the diversion of the Harridan, even the predominantly Yevethan workforce at Black-15 would have faced a far harder struggle to take the docks, and it is not known if the other yards in Koornacht had all been stripped of their defending ships in the same way."}, {"tag": "h3", "text": "The Koornacht Crisis"}, {"tag": "p", "text": "By 16 ABY, the Yevetha had constructed a fleet of around sixty Star Destroyers plus hundreds of thrustships, and with these forces, they initiated a genocidal expansion through Koornacht, known as the Great Purge. However, the surviving Black Sword captives in Camp Pa'aal, led by Major Sil Sorannan, had devised a plan to take back their fleet. As the New Republic intervened and confronted the Yevethan fleet, the Yevetha recalled the Imperials to assist them in supervising their ships systems and operating technologies that they still did not fully understand. At the climax of the Battle of N'zoth, Sorannan and his men executed a plan to simultaneously take control of every Imperial warship in Yevethan hands, echoing Nil Spaar's own plot thirteen years earlier. Using slave circuits to regain control of the remnants of Black Sword Command, Sorannan ordered the Imperial ships into hyperspace towards the Deep Core, completing their final order thirteen years after it had been issued."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}