{"url": "Sixth_Brother%27s_lightsaber", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Sixth Brother's lightsaber"}, {"tag": "p", "text": "The Sixth Brother utilized a double-bladed spinning lightsaber during his time as an Inquisitor of the Galactic Empire. The weapon would be destroyed slightly over a year after the formation of the Empire on the Outer Rim moon Raada, causing the Sixth Brother's death, when the Inquisitor fought the former Jedi Padawan Ahsoka Tano. Tano claimed the kyber crystals from the Sixth Brother's lightsaber for use in her own newly-constructed pair of lightsabers, after purifying them of the taint of the dark side."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "The Sixth Brother's lightsaber design was based on that of the Grand Inquisitor's.[source?] Its seemed to have some differences, such as the absence of the two spikes around the emitter. However, it did have protrusions around the handle guard during crescent and disc mode."}, {"tag": "p", "text": "One feature that set it apart from other Inquisitor lightsabers was that this one had the capability of being a split saber, being able to disconnect the hilt so the user was able to use two lightsabers instead of one."}, {"tag": "p", "text": "The weapon was powered by two kyber crystals, forcibly attuned to the dark side of the Force through the process known as bleeding. Ahsoka Tano believed that the crystals had been looted from the Jedi Temple following the Great Jedi Purge."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sixth Brother was trained in the use of this lightsaber alongside his fellow Inquisitors in The Works on Coruscant under the tutelage of the Grand Inquisitor, and later Darth Vader."}, {"tag": "p", "text": "In 18 BBY, the Sixth Brother travelled to the remote moon Raada after receiving a report of Jedi activity there. During his investigation, the Inquisitor tracked down a group of rebels hiding in the caves near the moon's only settlement, and used his lightsaber to kill most of them, except for sisters Kaeden and Miara Larte; the former being taken as a hostage to draw the mysterious Force-user back to Raada, the latter having been knocked unconscious prior to the fight so she would be kept safe."}, {"tag": "p", "text": "Taking Kaeden as a hostage did indeed draw her Force-using friend, former Jedi Padawan Ahsoka Tano, back to Raada. However, Tano had acquired allies in the form of Senator Bail Organa and his rebel group, so she was able to arrange for the evacuation of the moon's population. As the evacuation began, Tano confronted the Inquisitor unarmed, and the Sixth Brother was unprepared and underestimated her. Tano, having felt the kyber crystals in the Inquisitor's lightsaber calling to her, caused the weapon to explode when she pulled on them with the Force, which killed the Sixth Brother. Claiming the crystals and their specialized mountings from the lightsaber's wreckage, Tano took the time to close the visor of the Sixth Brother's helmet over his face. Tano then purified the crystals of the dark side's taint, before completing the construction of a pair of white-bladed lightsabers she immediately used against the Imperial forces on Raada."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sixth Brother's lightsaber first appeared in the novel Ahsoka. It was first pictured in the sixth issue of the comic book series Darth Vader: Dark Lord of the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}