{"url": "Sixth_Brother", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Cyborgs", "Category:Humanoids", "Category:Inquisitors", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sixth Brother"}, {"tag": "p", "text": "The Sixth Brother, formerly known as Bil Valen, was a male member of the Inquisitorius. In the year following the end of the Clone Wars, the Sixth Brother, and the rest of the Inquisitors, hunted for Force-sensitive children as well as Jedi who survived Order 66. He accompanied Darth Vader, the Ninth Sister and the Tenth Brother to the planet Mon Cala to hunt an enemy of the Empire. He was killed by Ahsoka Tano during the uprising on Raada."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Fallen Jedi"}, {"tag": "p", "text": "Bil Valen was originally a member of the Jedi Order. At some point after the Galactic Republic was reorganized into the Galactic Empire, he was inducted into an Imperial agency of fallen Jedi assassins called the Inquisitorius and became known as the Sixth Brother.[source?] The Inquisitorius was tasked with hunting down and eliminating any Jedi who survived Order 66. To accomplish this, he and his colleagues were trained by the Grand Inquisitor in the Inquisitorius Headquarters located in The Works."}, {"tag": "p", "text": "The Inquisitorius soon fell under the command of Darth Vader when Darth Sidious first demonstrated the Inquisitorius to Vader. Darth Vader continued their training in the ways of the dark side of the Force, training them to use more aggressive tactics and less defensive strategy than they learned in their time with the Jedi. The Sixth Brother faced off with Vader in a training session and the Sith Lord cut off his lower left arm to teach him the lesson of loss. The Grand Inquisitor asked Vader why he trained the Inquisitors like this, to which he revealed his intention to make their fighting techniques more aggressive."}, {"tag": "h3", "text": "Mission to Mon Cala"}, {"tag": "h4", "text": "Battle of Dac City"}, {"tag": "p", "text": "In 18 BBY, the Sixth Brother, Ninth Sister and Tenth Brother accompanied Vader and a squad of Purge Troopers to Mon Cala on a mission to search for a rumoured Jedi who had been advising the King of Mon Cala in negotiations with the Empire. Upon arrival, the Tenth Brother described the planet as smelling like fish and the Ninth Sister claimed it was merely Sixth Brother. Sixth Brother sarcastically complemented it and Ninth Sister stepped down to speak with the King's chief of security Gial Ackbar. Vader came down to take over from Ninth Sister and an Imperial shuttle exploded nearby. Vader took the three Inquisitors into Dac City to begin their search."}, {"tag": "p", "text": "After a large battle broke out between the Empire and the Mon Cala at Dac City, the Sixth Brother and his fellow Inquisitors participated in the fight as they pursued the King Lee-Char, to the Dac City palace in order to find the location of the Jedi who was advising him. They eventually made it into the palace after killing many Mon Calamari and Quarren defenders and Ninth Sister began interrogating Lee-Char. But before long, a swarm of large creatures arose to the surface and generated waves so large, it swept the surface of Imperials. Sixth Brother and the others attempted to hold off the waves but they weren't strong enough to do so, not even when Vader assisted them."}, {"tag": "h4", "text": "Pursuing the Jedi"}, {"tag": "p", "text": "Luckily, Sixth Brother and the other two Inquisitors survived and took an Imperial submarine to find Vader. After picking him up, Ninth Sister revealed to Vader that she'd found the Jedi's location and they took the submarine towards the location. The submarine took them to the location where the Jedi and his six acolytes were evacuating their refuge. The group of them immediately scattered except for one acolyte who attacked the submarine, only for Vader to crush his helmet. As the other ones swam away, the submarine made chase and another acolyte sacrificed himself to slow it down."}, {"tag": "p", "text": "The submarine arrived at Bel City where another two acolytes were waiting to ambush them. Vader took them through the hallways where he received an order from Moff Wilhuff Tarkin, redirecting him to capture Lee-Char. The other inquisitors continued the chase, back by the Purge Troopers. They found the Jedi and his last two acolytes and Sixth Brother cut one of them down with his lightsaber. He then asked the other two what Barr had said beforehand and Tenth Brother claimed his hearing was exceptional, saying that Barr had said there was no way out. Sixth Brother and the other two Inquisitors then surrounded the Jedi and his last acolyte, Verla, backed by their Purge Troopers."}, {"tag": "p", "text": "With no other choice, the Jedi confronted the inquisitors but then began stating their original names from when they were Jedi. The Ninth Sister knew who the Jedi was and revealed the his name, Ferren Barr, stating that he was still a mere Padawan who lacked the training he needed to take them on. Barr ignored her insults and continued, explaining the role of the clones in Order 66 and pointing out that the Purge Troopers had been mobilized after Order 66 was activated. After saying this Sixth Brother pointed his lightsaber at Barr but he claimed once again that they were still Jedi and used a mind trick on the Purge Troopers, telling them to \"execute Order 66.\""}, {"tag": "p", "text": "The troopers fell for Barr's trick and turned on the Inquisitors. Tenth Brother protested to them that they were not Jedi, but it was too late. The troopers opened fire at them and the Inquisitors were forced to deflect their shots. Tenth Brother was hit in the chest and killed. Barr and Verla then leaped over the battle and escaped. Keen to intercept them, Sixth Brother told Ninth Sister they should do the same. Ninth Sister recommended moving them out of the way instead and they both Force pushed the troopers to the side. However, in a bid to ensure his safety, Sixth Brother betrayed the Ninth Sister, and severed her leg, leaving her to fend off the last of the troopers. After his escape, Sixth Brother took a boat away with three stormtroopers and passed many creatures that had been killed by the fighting on Mon Cala."}, {"tag": "h3", "text": "Investigating Force-sensitives"}, {"tag": "p", "text": "Sometime later, the Sixth Brother intercepted surveillance holos and reports indicating that there was a Force-sensitive child on the planet Thabeska. He went to the Outer Rim world to investigate, but was unable to locate the child, Hedala Fardi. While on Thabeska, the Brother received a message from a low-level district commander on the moon of Raada. The report indicated that a Force-sensitive being, old enough to have received Jedi training, was active on the backwater moon. The Brother then proceeded to close his file on the child on Thabeska and head to Raada to investigate a possible Jedi."}, {"tag": "h3", "text": "Hunting Ahsoka Tano"}, {"tag": "p", "text": "The Sixth Brother traveled to Raada to hunt down the Jedi spotted on the small agricultural moon. He learned from Jenneth Pilar, an information broker working with the Empire on the moon, that a Jedi or Padawan had been involved in an uprising by the local farming community. During the uprising, teenage farm worker Kaeden Larte had been captured and tortured for information. The Brother scoffed at the techniques used on Larte, which proved ineffective. He learned that Kaeden was then broken out of the Imperial base by a Force-sensitive being."}, {"tag": "p", "text": "The Brother tracked down Kaeden and the other farm workers, who had hidden in a set of mountain caves not far the settlement. Kaeden surrendered herself to the Inquisitor, but her friends soon attacked him. The Brother deflected the blaster bolts shot by the farmers, killing them. As a show of strength and intimidation, the Brother threw his lightsaber at the Rodian farmer, Kolvin, who was instantly cut in half."}, {"tag": "p", "text": "To lure the Jedi back to Raada, the Brother had footage of himself holding Kaeden prisoner leaked. Upon seeing it, Ahsoka Tano returned to Raada, having arranged for the evacuation of the moon's population. She was in the process of building a new pair of lightsabers, and heard the kyber crystals in the Brother's double-bladed lightsaber sing to her. Despite her lack of lightsabers, Tano was able to fight the Sixth Brother on a relatively even footing and eventually used the Force to pull the crystals from within his lightsaber just as he tried to activate its spinning feature. The lightsaber became unstable and exploded in front of his face, killing the Sixth Brother instantly. Ahsoka then went on to purify the lightsaber crystals from his weapons, cleansing them of the dark side energy tainting them, and used them to complete her new lightsabers."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Sixth Brother was of a humanoid species which neither Kaeden Larte or Ahsoka Tano were able to identify. He was tall, slender and broad-shouldered, with unnatural-looking gray skin, piercing ice-blue eyes, and scar-like uniform markings on his cheeks, nose, and chin. Like his fellow Inquisitors, he wore black and grey body armor and carried a double-bladed spinning lightsaber. He also wore a helmet with a blast shield that could be lowered to protect his face."}, {"tag": "p", "text": "The Sixth Brother had an uncertain relationship with his fellow Inquisitors, from whom he feared competition. Upon arriving on Mon Cala, Ninth Sister and Tenth Brother insulted him to which he sarcastically complimented as a response. When picking up Darth Vader under Mon Cala's oceans, Sixth Brother assumed Vader would be thankful for it, but Vader only said that he could handle himself. During the fight in Bel City, Sixth Brother was keen to make pursue Ferren Barr and attempted to jump to conclusions with what he and Ninth Sister would do. After pushing away the Purge Troopers, Sixth Brother betrayed Ninth Sister and cut off her leg so she could hold off the rest of the troopers. When Ninth Sister threatened to kill him, he mockingly wished her good luck, telling her that she was always his favorite."}, {"tag": "p", "text": "The Sixth Brother was ruthless, being completely comfortable with the idea of killing innocent beings—even children—and detesting the aspects of his mission that prevented him from acting in such a matter. He was known to have relished the idea of facing more challenging prey, which was his primary motivation of abandoning his task of tracking a Force-sensitive child in favor of hunting Ahsoka Tano. He was also arrogant, claiming himself to be \"the future\" and displaying overconfidence during his fight with Tano, which ultimately led to his demise."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Sixth Brother was trained by the Dark Lord of the Sith Darth Vader. Vader trained him to discard the defensive tactics he had developed as a Jedi and rely primarily on offensive tactics. His training came successful for him as he killed many Mon Calamari during the occupation of Mon Cala. His life surpassed the Tenth Brother, who failed to hold off the Purge Troopers when they were turned against them. He showed very little in the way of his powers and abilities during his hunt for a Force-sensitive child on Thabeska, as well as his confrontation with Ahsoka Tano. Tano described him as \"lacking finesse\" and \"relying mostly on brute strength,\" as well as being apparently unable to fight with his helmet's blast shield down. Despite this, he was able to both deflect blaster bolts back at their firers and throw his saber in order to chop Kolvin in half, when on Mon Cala he also did this to a disciple named Daren."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The Sixth Brother's lightsaber was a double-bladed spinning lightsaber which could be thrown like a boomerang. He wore a blue helmet which had a neck guard drooping down the back and a silver and black face shield that was always down to cover most of his face. The Sixth Brother's suit was silver and over it he wore black armor on the shins, upper chest and shoulders, and the forearms. He wore a black kama around his waist and his armor had red attachments around it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sixth Brother first appeared as the primary antagonist of the novel Ahsoka. He was first pictured in Darth Vader: Dark Lord of the Sith 6, although it was not confirmed that Inquisitor was him until Darth Vader: Dark Lord of the Sith 7. In Darth Vader: Dark Lord of the Sith 16, the Sixth Brother and Ninth Sister's former names are revealed to be Bil Valen and Masana Tide, although the comic did not specify which character had which name. But, the Sixth Brother was confirmed to be Bil Valen in the 2018 reference book Star Wars: The Dark Side."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}