{"url": "Ska_Gora", "categories": ["Category:Legends articles", "Category:Arboreal planets", "Category:Infinite Empire planets", "Category:Swamp planets", "Category:Tython system planets"], "nodes": [{"tag": "h1", "text": "Ska Gora"}, {"tag": "p", "text": "Ska Gora was a verdant forest planet that was located within the Tython system of the galaxy's Deep Core region. More than thirty-six thousand years before the Battle of Yavin, the non–Force-sensitive settlers of the planet Tython colonized Ska Gora. Most of the planet's population lived in city-ships that floated above Ska Gora's surface, but when the Wookiee warlord Gharcanna led members of his species to illegally settle the surface, the matter ended in a conflict that saw the illegal settlers dead and swaths of the apex tree forests ablaze."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ska Gora was a planet with a single moon that was located within the Tython system of the galaxy's Deep Core region, at grid coordinates L-10. The planet occupied the eighth orbital position around its sun, Tythos. A temperate and verdant world home to enormous apex trees, Ska Gora had its surface covered with huge regions of forests, swamps, and wetlands. It also featured an atmosphere with white-colored clouds and at least one mountainous region. Nearly all of the planet's population, which numbered in at least the tens of thousands, lived in city-ships that floated above Ska Gora's surface in order to protect the world's wilderness. Vicious winds occasionally crossed the planet's surface, stirring the jungles, and many of the planet's trees were thousands of years old by 25,793 BBY. However, the planet also featured deep mines that produced precious stones."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "More than a millennium after the year 36,453 BBY, when the non–Force-sensitive settlers of Tython— the fifth planet of the Tython system— traveled to Tython's neighboring worlds, they colonized Ska Gora. In 25,800 BBY, the Je'daii Daegen Lok experienced a Force vision of an army of dark warriors wielding blades of fire, marching across the burning surface of Ska Gora as the city-ships fell to ground."}, {"tag": "p", "text": "Sometime between 25,797 BBY and 25,793 BBY, the Wookiee warlord Gharcanna led members of his species in illegally settling Ska Gora's surface, despite the restrictions against doing so. The Je'daii Ranger Lanoree Brock was dispatched by the Je'daii Council to Ska Gora, where she stayed with a family of Wookiees and tried all diplomatic methods available to get the Wookiees to depart the surface. However, Gharcanna refused to back down, and Brock was eventually forced to fire upon the forests and kill the Wookiees who were on the planet's surface. The attack destroyed swaths of the forests, but the Wookiee land wars, as they became known, were necessary to prevent a civil war between the Wookiees and the other settlers of Ska Gora."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ska Gora was first pictured in the entry for Tython in The Holonet feature of the official website for Star Wars: The Old Republic—a 2011 massively multiplayer online roleplaying game developed by BioWare. The planet was depicted in a schematic of the Tython system. Ska Gora's name and additional information on it were provided in Star Wars: Dawn of the Jedi 0, a preview issue of the Star Wars: Dawn of the Jedi series of comic books. The issue was published on February 1, 2012, and was written by John Ostrander and penciled by Jan Duursema."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}