{"url": "Skel", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Creatures of Hoth", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Skel"}, {"tag": "p", "text": "Skels were a sentient species that dwelled on Hoth. Hunting in packs, they were a primitive people, attacking whatever they could find without warning. They could burrow under the snow, and survive in extremely cold conditions. The Skels resided in caves, within the mountains of Hoth. The species' name originated as a nickname given to them by combatants during the Cold War between the Galactic Republic and the reconstituted Sith Empire."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Skels were a bipedal species, and could grow up to 1.2 meters in height. They were naturally agile, and featured protective tusks that grew out of their snouts. The hands of the Skels boasted tough, bony claws which could be used to burrow under snow and ice. Their fur was dense and thick, insulating them against extremely cold-weather environments, such as Hoth. Such was the effectiveness of the fur that they could survive without shelter in conditions far colder than Hoth's average atmospheric temperature."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Skels formed a primitive yet well-organized culture, and were aggressive by nature. They spent their time roaming the frozen wastelands of Hoth. Skels communicated through a series of snarls and grunts. They lived in caves, located within Hoth's mountain regions, where they were provided with shelter. The Skels hunted in packs, and were brazen in their work, due to the scarcity of food on Hoth. As such, they would attack anything without provocation, including Imperial Viper probe droids. Some Skels were able to fashion clubs from severed hands of other Skels."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Skels evolved on Hoth, a desolate, ice-covered planet located in the Anoat sector of the Outer Rim region of the galaxy. Being the only sentients on the planet, the well-organized Skels considered it their property. During the Cold War, Hoth became the arena of a three-way conflict between the Sith Empire, the Galactic Republic and a pirate organization known as the White Maw. The Skels did not pick sides, regarding all belligerents as unwelcome invaders who should be driven off."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"The Skels of Hoth\" were created by Brian Fraim, a 22-year-old Star Wars fan, through the \"Design An Alien\" competition held by Star Wars Galaxy magazine. The competition, which was launched in Star Wars Galaxy Magazine 3 (1995), called upon readers to create entirely new alien species' influenced by what had been seen in the original trilogy of Star Wars films. Fraim's entry was not published alongside the winners in Star Wars Galaxy Magazine 7 (1996), and was instead displayed in Star Wars Galaxy Magazine 10 (1997) as an \"honorable mention.\" Keeper of the Holocron continuity database Leland Chee later stated that successfully published \"Design an Alien\" materials were considered canon. The Skels were not referenced in any other Star Wars works until 2011 with the release of Star Wars: The Old Republic, however the word \"skel\" was used in Republic 65 (2004), as a derogatory term. It is unclear whether the expletive refers to this species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}