{"url": "Skakoan", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Core Worlds species", "Category:Enslaved species", "Category:Skakoans"], "nodes": [{"tag": "h1", "text": "Skakoan"}, {"tag": "p", "text": "Skakoans were a sentient species native to the planet Skako. In order to survive off of their homeworld, they were required to wear pressure suits to simulate its unique atmosphere and pressure, which were vastly different from the galactic standard. A male Skakoan known as Wat Tambor was the foreman of the Techno Union during the final years of the Galactic Republic."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Skakoans were a bipedal sentient species who generally had a thin build and pale, folded skin that could be green, blue or purple. The species possessed little facial and or body hair, and their faces consisted of a toothless mouth, two red eyes and a pair of nasal slits. The crown of a Skakoan's head consisted of raised ridges around the sides, with a wide depression in the center. They were physiologically very similar to humans in most matters, with roughly the same lifespan and biological issues relating to health, age, and reproduction."}, {"tag": "p", "text": "The key difference between Skakoans and most other species was the fact that they could sustain their metabolism with atmosphereic methane at the proper pressure. These conditions could be found on their homeworld Skako, but in other environments, Skakoans generally needed to wear a full pressure suit to provide methane at the correct pressure for them to survive. Due to the pressure requirements, rebreathers were not enough to sustain Skakoans. Without a suit, members of the species would explode in a standard oxygen-based atmosphere. As well as methane, Skakoans breathed hydrogen sulfide, and could consume liquid foodstuff."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "Technological xenophobes"}, {"tag": "p", "text": "Skakoan society was dominated by logic and mathematics, which added to outsiders' mistaken perception that Skakoans were a robotic species, mostly due to their pressure suits and translator units. In fact, Skakoans were highly emotional and passionate beings, seeing no contradiction between emotion and logic."}, {"tag": "p", "text": "The extreme difference between the atmospheric requirements of Skakoans and other species, plus how uncomfortable or deadly most other species found being on Skako, led to reinforcement of Skakoans' cultural tendencies toward xenophobia and isolationism. Skakoans saw the rest of the galaxy as hostile and dangerous, but did admit that this fear of the outside was partially irrational. Skakoans were unconcerned with what empire or government controlled the galaxy, as long as it left Skako alone."}, {"tag": "p", "text": "Because of the logistical difficulties of living on Skako, Skakoans viewed technology as a necessary and essential evolution of nature, rather than invasive or opposed to nature as many other species did. In their opinion, with the abundance of methane fuel and metallic resources on Skako, machines and industry were the natural and inevitable end result of their developed intelligence. Oxygen was produced as a flammable toxic byproduct of these processes, but was considered useful and controllable by the Skakoans."}, {"tag": "h3", "text": "Religion and language"}, {"tag": "p", "text": "The Elders of the Power Mounds were the group that controlled the mystery religion practiced in Skakoan society, which was based on belief in an alternate dimension inhabited by a mythical creature that the Elders could supposedly visit. Rising within the ranks of the religion granted a Skakoan access to holy sites and mystic artifacts, although only the Elders and a select few others knew if the creature and its dimension truly exists."}, {"tag": "p", "text": "Skakoans spoke a complex native language known as Skakoverbal that shared similarities with binary. Due to the fact that they rarely traveled offworld, few Skakoans learned Galactic Basic Standard, with those that did travel more frequently generally relying on language transition modules that could be attached to their pressure suits. The complexities of Skakoverbal meant that these modules often spat out junk noise when compressing dialogue down to a simpler language. This only added to the galactic perception that Skakoans were robots or cyborgs. The written element of Skakoverbal was known as Skakoform and by the time of the Galactic Civil War the symbol set it used greatly resembled circuitry due to the prominence of technology in Skakoan culture."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Methane origins"}, {"tag": "p", "text": "The Skakoans evolved on the planet Skako, which was rich in resources and provided the species plenty to build and experiment with. The world's upper atmosphere consisted of an alkaline haze that prevented the species from advances in astronomical science until they developed low orbital flight. As such, the Skakoans lacked any desire to explore the stars, focusing on their own world instead. Much earlier than most other civilizations, they covered their homeworld in industry, making the entire planet a single city that needed constant maintenance and improvement."}, {"tag": "p", "text": "Other nearby inhabited worlds mostly ignored Skako, believing it to be uninhabitable and dangerous and attributing any power signatures they saw to methane flares. This eventually changed when the Skakoans eventually developed the technology to travel offworld, although the species' secrecy and xenophobia resulted in outsiders still knowing very little about the world. The Skakoans also came to inhabit the nearby world of Skako Minor which contained some areas on its surface that allowed Skakoans to survive without the mask of their pressure suits."}, {"tag": "h3", "text": "Isolationist industrialists"}, {"tag": "p", "text": "Despite Skako being located within the Core Worlds, Skakoans remained disconnected from the Galactic Republic for millennia due to the differences in Skakoans' environmental needs compared to other species. As the rest of the galaxy advanced around them, the species developed their own sophisticated civilization which harnessed the power of their unusual atmosphere and advanced technology. Despite their difficulties in traveling away from home, they created galactic companies like Baktoid Armor Workshop, which they headquartered on Skako so that offworlders would have to come to them and they could avoid traveling offworld."}, {"tag": "p", "text": "Even when Skakoans did begin leaving Skako, they avoided Republic membership as they did not wish to deal with Galactic Senate representation or political shenanigans. This eventually changed when the Skakoan Wat Tambor became foreman of the Techno Union and began serving as its representative in the Senate, making him de facto representative of Skako as well. The headquarters of the Techno Union were moved to Skako Minor so that, as with Baktoid Armor Workshop, outsiders were forced to come to Skako and deal on the Skakoans' terms."}, {"tag": "h3", "text": "Galactic wars"}, {"tag": "p", "text": "During the Separatist Crisis and Clone Wars that followed, Tambor and other Skakoan business interests feared Republic overreach and sided with the Confederacy of Independent Systems, unaware that they were being manipulated by the Sith. While the Techno Union remained officially neutral, Tambor directly aided Separatist efforts, turning the Republic against Skako with his expansionist tendencies. Once Tambor was killed and the Confederacy defeated at the end of the war, the Republic quickly sanctioned Skako despite the fact that it had only indirectly aided the Separatists. The Galactic Empire, successor state to the Republic, inherited its predecessor's prejudice against the world, and Skakoans found themselves to be shunned as enemies of the Emperor. The Techno Union was dissolved, removing the species' major means of galactic influence."}, {"tag": "p", "text": "Skako suffered greatly under the Empire and was placed under emigration restriction, although many Skakoans preferred being cut off from the galaxy in this way or at least tolerated it. A few did oppose the Empire's control, believing that Skakoans, not the Empire, should decide the fate of Skako and its inhabitants. Believing that hiding on Skako would not save their species or homeworld from persecution, some members of the species joined up with the Alliance to Restore the Republic, although these Skakoans tended to become increasingly militaristic, as they felt isolated in their pressure suits among their non-Skakoan peers. Having willingly sacrificed breath, touch, and their xenophobia to work alongside the Rebels, they saw each moment of Imperial rule as a moment they were not able to return home."}, {"tag": "h2", "text": "Skakoans in the galaxy"}, {"tag": "p", "text": "Although Skakoans were diverse in their range of interests and professions, those that were most likely to leave Skako, even only to go as far as Skako Minor, generally tended to be technological industrialists. Believing that science and technology knew no borders, these individuals saw opportunity to trade for technologies and scientific advancements that they could bring back to Skako, and overcame their reluctance to deal with outsiders. This cemented the view among galactic society that the species was obsessed with technology, an idea that had a measure of truth to it."}, {"tag": "p", "text": "The industrialist Skakoans that did leave their home invested in various companies, organized limited trade between Skako and other worlds, and maneuvered themselves into executive positions at a variety of companies, the most notable being the Techno Union. It became common assumption that Skakoans had founded the union themselves, and although this was not true, to many non-Skakoans the species and the company became synonymous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}