{"url": "Skakoan/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Core Worlds species", "Category:Skakoans"], "nodes": [{"tag": "h1", "text": "Skakoan"}, {"tag": "p", "text": "The Skakoans were a sentient species of humanoid mammals distinguished by their dependence on a bulky pressurized suit to survive away from their homeworld, Skako. A highly xenophobic people, the Skakoans rarely departed their homeworld unless need drove them."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Native to the high-pressure atmosphere of the Core World Skako, the Skakoans breathed a methane-based air supply. Resembling gaunt Humans, Skakoans had grey-white skin which hung in folds over their skeletons, lacked hair and had sunken, beady eyes. Thin nasal slits allowed them to detect odor, while a thin, lipless mouth allowed them to speak. Because Skakoans did not ingest solid food, they lacked teeth in their gaping mouths. An average Skakoan maintained a life-span of 90-110 years. Due to the nature of their homeworld's above-average pressure, traveling offworld meant wearing a specialized protective suit which maintained internal pressure and fed methane through special piping. Fear of decompression or rupturing of their suits kept most Skakoans on their world; only those driven by a very compelling motive were ever seen far from Skako."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Because outsiders rarely visited Skako, few saw the species without their pressurized suits. This caused many non-Skakoans to believe the race was emotionless and machine-like. In spite of the misconception, the Skakoans were extremely emotional, harboring strong xenophobia for all non-Skakoans. As a society, Skakoans were severe and self-centered, focused on self-preservation above all else. They developed a deep logic which allowed them to solve nearly any problem and driving their society towards the mathematical, scientific and technological professions. Restricting construction of their pressure suits to Skako due to their mistrust of others, visitors were forced to don their own suits when landing on the world. The Skakoan government was run by a guild of highly efficient Skakoans who organized the world's collective progress over the years.[source?]"}, {"tag": "p", "text": "A deeply spiritual people, the Skakoans had developed a highly evolved religion based on the Book of the Boolmide. Led by the Elders of the Power Mounds, the religion was only found on Skako and centered around an omniscient mythic beast known as the Albino Cyclops."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Native to the planet Skako, the Skakoans were discovered during the blazing of the Brentaal–Denon Route of the Hydian Way before the formation of the Galactic Republic. Establishing a major ecumenopolis comparable in terms of population and scale to Coruscant, the planet-wide city lacked the Republic capital's charm and aesthetics. While Skakoans tended to stay out of galactic affairs, war was on their doorstep during the Second Alsakan Conflict which lasted from 16,200 BBY until 15,400 BBY."}, {"tag": "p", "text": "Attaining membership in the Galactic Republic Senate, the Skakoans also had a leading interest within the Techno Union by the time of the Separatist Crisis which plagued the Republic in its final days. The Skakoan representative Wat Tambor led the Techno Union away from the Republic and to the Confederacy of Independent Systems, for which Skako was expelled from the Republic. When the Clone Wars erupted, Skako was placed under the watchful eye of the 1st Sector Army of the Grand Army of the Republic. After Skako fell to the Republic and Foreman Tambor was murdered on Mustafar with the rest of the Separatist Council, the Confederacy collapsed and the Galactic Empire replaced the Republic. Heralding a new era of Human High Culture, the Empire crushed the Techno Union and persecuted the Skakoans for their involvement in the war. Retreating to Skako to resume their isolationist stance, the Skakoans avoided the destruction of the Yuuzhan Vong War by remaining distant from both the New Republic and the Galactic Alliance. By 127 ABY, Skako had been enveloped by the Empire of Darth Krayt."}, {"tag": "h2", "text": "Skakoans in the galaxy"}, {"tag": "p", "text": "A highly xenophobic species, the Skakoans rarely left their homeworld for fear of rupturing their pressure suits or suffocating in a non-methane atmosphere. Those Skakoans seen abroad were almost always driven by some important need to have thought it best to leave their home, and return was always in mind. The Skakoans were relatively unknown in the galaxy, except for their control over the Techno Union. No known Force-sensitive Skakoans existed, with no recorded representatives in either the Jedi Order or the Order of the Sith Lords."}, {"tag": "p", "text": "Wat Tambor, Foreman of the Techno Union, was a Skakoan. During the Clone Wars, Tambor pledged the support of the Techno Union to the Confederacy of Independent Systems and aided militarily in the conflict known as the Clone Wars; supporting the war effort by supplying droids, starships, and weapons. Skakoan control of the Techno Union came to an end with the death of Tambor on Mustafar and the rise of the Galactic Empire."}, {"tag": "p", "text": "Other members of the species included Clongor, Chief among the Elders and leader of the Skakoan religion during the Clone Wars; the bounty hunter Hrym Mawarr, Kul Teska, a cybernetically-enhanced mercenary and general during the Clone Wars, and Zona Dreon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}