{"url": "Skako/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Core Worlds planets", "Category:Ecumenopolises", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Hydian Way", "Category:New Republic planets", "Category:Skako locations", "Category:Techno Union planets", "Category:Type IV atmosphere planets"], "nodes": [{"tag": "h1", "text": "Skako"}, {"tag": "p", "text": "Skako was an ecumenopolis on the Hydian Way in the galactic core and homeworld to the Skakoan species. Though most of Skako was covered by urban sprawl, some examples of the planet's original ecosystem had been preserved in the form of vast fields of sprawling vines."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Skakoans rarely left the world due to their dependence on the methane-based atmosphere and heavy atmospheric pressures. Establishing a major ecumenopolis comparable in terms of population and scale to Coruscant, the planet-wide city lacked the Republic capital's charm and aesthetics."}, {"tag": "p", "text": "In addition to the Skakoan people, the planet was also home to the octuptarras— an eight-eyed creature with a gasbag-shaped head and multiple legs which inhabited the planet's vines. The harsh environment on the planet ensured that the world was rarely visited and left in isolation, much to the contentment of the natives. Developing a religion based on the Book of the Boolmide, the Skakoan people constructed a holy place called the Power Mounds from where the Elders presided over the world's religious affairs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Skako was discovered during the blazing of the Brentaal–Denon Route of the Hydian Way, before the formation of the Galactic Republic."}, {"tag": "p", "text": "While Skakoans tended to stay out of galactic affairs, war was on their doorstep during the Second Alsakan Conflict which lasted from 16,200 BBY until 15,400 BBY."}, {"tag": "p", "text": "Attaining membership in the Galactic Republic Senate, the Skakoans also had a leading interest within the Techno Union by the time of the Separatist Crisis which plagued the Republic in its final days. The Skakoan representative Wat Tambor led the Techno Union away from the Republic and to the Confederacy of Independent Systems, for which Skako was expelled from the Republic. When the Clone Wars erupted, Skako was a member world of the CIS, but was placed under the watchful eye of the 1st Sector Army of the Grand Army of the Republic. After Skako fell to the Republic and Foreman Tambor was murdered on Mustafar with the rest of the Separatist Council, the Confederacy collapsed and the Galactic Empire replaced the Republic. Heralding a new era of Human High Culture, the Empire crushed the Techno Union and persecuted the Skakoans for their involvement in the war. Retreating to Skako to resume their isolationist stance, the Skakoans avoided the destruction of the Yuuzhan Vong War by remaining distant from both the New Republic and the Galactic Alliance. By 130 ABY, Skako had been enveloped by the Empire of Darth Krayt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}