{"url": "Skere_Kaan", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Coruscanti", "Category:Dark Lords of the Sith of the New Sith Wars", "Category:Fallen Jedi", "Category:Force ghosts", "Category:Humans", "Category:Jedi Masters of the Jedi Order", "Category:Males", "Category:Members of the Brotherhood of Darkness", "Category:Sith Masters"], "nodes": [{"tag": "h1", "text": "Skere Kaan"}, {"tag": "p", "text": "Skere Kaan was a male Human Jedi Master who served the Jedi Order in the last years of the New Sith Wars before defecting to become a Dark Lord of the Sith and creating the Brotherhood of Darkness within the reorganized Sith Empire, earning him the nickname of the \"Dark One.\" Ruling the Sith for a decade, Kaan's reign was turbulent as the Brotherhood was rife with civil unrest, and conflict with the Jedi saw his numbers dwindle. A few Sith were starting to question his beliefs, including Darth Bane."}, {"tag": "p", "text": "At the end of the bloody Ruusan campaign, Kaan, his followers, and much of the Jedi Army of Light were destroyed by a thought bomb of his own creation during the Seventh Battle of Ruusan. In Kaan's place, Darth Bane, who tricked the entire Brotherhood into its destruction, set up a new Sith order with the Rule of Two: one master and one apprentice."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A Force-sensitive Human from Coruscant born during the Republic Dark Age, Skere Kaan was born a commoner before being discovered by the Jedi Order and training in the ways of the Force at the Jedi Temple. Sophisticated and knowledgeable of economic policy and fleet command, Kaan became a Jedi Knight and a beacon for hope among members of the Jedi High Council who hoped to finally destroy the reformed Sith Empire which had been plaguing the Galactic Republic for nearly a millennium."}, {"tag": "p", "text": "Having perfected the art of battle meditation, Jedi Kaan was considered a valuable asset by the High Council, despite his radical belief that the Republic and the Jedi were responsible for the anarchy which plagued the galaxy. In an effort to moderate Kaan's extremist views, the High Council awarded him the title of Jedi Master. Seeing the High Council as overbearing, Kaan led a group of loyal Knights away from Coruscant and formed the Brotherhood of Darkness in 1010 BBY. Declaring himself Dark Lord of the Sith, his supporters referred to him as the \"Dark One.\""}, {"tag": "p", "text": "At the time of Kaan's ascent, the Sith Empire had fractured, with dozens of Sith Lords claiming the title of Dark Lord and waging endless campaigns against each other, rather than uniting to bring down the ailing Republic. Sensing that their endless quest for supremacy and power would destroy the Sith, Kaan set about reuniting the various splinter states under his banner, destroying all those who refused to bend the knee until he was in control of the Sith Empire. The two most powerful Sith warlords—Kopecz and Qordis—pledged themselves to his cause, and they were followed by others, such as Kas'im, LaTor and Kaox Krul."}, {"tag": "p", "text": "Still unwilling to see what was growing to become an even worse threat, the Jedi High Council issued congratulatory thanks to Kaan for killing the worst of the Sith warlords during his campaign to amass power. However, Kaan had not been able to lull all Jedi into a state of ignorance; indeed Jedi Lord Hoth saw Kaan for the threat he was and left Coruscant to gather his own forces."}, {"tag": "p", "text": "His idea of cooperation and equality among the Sith Lords was unique in their history. Rather than challenge each of the self-proclaimed \"Dark Lords\" and threaten the war effort, Kaan acquiesced to their vanity, and named them all \"Dark Lord of the Sith\", and declared \"All are equal in the Brotherhood of Darkness.\" But he forbade any Sith to take the historic title of Darth, since he held that title as being solely responsible for the jealousy and infighting that had destroyed the Sith in the past."}, {"tag": "p", "text": "With his charisma and power, the Sith struck back at the Republic and the Jedi Order. However, the Republic and the Order were not without their defenders. Having seen Kaan for what he truly was, Lord Hoth of the Jedi Order rallied the banners of the Jedi Grand Council and formed the Army of Light through the support of all standing Jedi Lords. Once amassed, Hoth led his armies on a hunt for Sith, a decade-long war that would see great casualties on both sides. Although the conflict was widely regarded as an all-out war, the Republic claimed that it was simply fighting a series of engagements against an illegal organization."}, {"tag": "p", "text": "Despite Hoth's best efforts, a startling early victory at the Battle of Korriban enabled the Sith to retake their ancestral homeworld. Kaan authorized the reopening of the Sith Academy there, and placed Qordis in charge to begin training the next generation of warriors. The reinvigorated Sith pushed the Jedi back, winning great victories against the Army of Light. Kaan proved to be a brilliant strategist, and an excellent tactician, capable of winning victory after victory against the Jedi forces; all the while putting his charisma to good use by luring many Jedi to serve him."}, {"tag": "p", "text": "While Kaan was a charismatic and skilled general, his rule was more fragile than it seemed, a weakness that would be exploited as the war ground on. As long as the victories continued, however, the Sith would remain united behind him."}, {"tag": "h3", "text": "Nearing the end"}, {"tag": "p", "text": "Kaan tried to provoke Hoth into a confrontation, laying waste to worlds such as Bespin, Sullust, and Taanab, but his main strategy seemed to have already been to push towards the Core Worlds, with Sith armies seizing Kashyyyk as a staging-ground in the Mid Rim, and winning battles on Trandosha and Phaseera."}, {"tag": "p", "text": "Kaan's next target was Ruusan, a world near Kashyyyk, mostly insignificant except for its crucial role as a staging ground for attacks on Sith-held Kashyyyk. Striking without warning, the Sith fleet staged a devastating assault on the unprepared planet, completely overwhelming the planet's meager defenses. From his flagship Nightfall, Kaan directed the campaign, utilizing his skill in Battle meditation to confound the Republic defenders and bolster his own forces. The First Battle of Ruusan was an absolute victory for the Sith."}, {"tag": "p", "text": "Republic forces were repulsed again from Ruusan in the Second Battle of Ruusan, and Kaan launched an ambitious invasion of the Core with his fleet, thrusting into the Bormea sector to conquer Chandrila, Corulag, and Brentaal IV. The Sith seemed almost poised to conquer Coruscant, and the Jedi seemed not to be attempting to defend the Core."}, {"tag": "p", "text": "However, Lord Hoth had gathered a Jedi army, known as the Army of Light, and had arrived on Ruusan to defeat the remaining Sith forces in the Third Battle of Ruusan, and wipe out the Brotherhood, once and for all."}, {"tag": "p", "text": "By the Fourth Battle of Ruusan, the war had moved to the surface of the planet itself, and, though outnumbered and out-manned by the Army of Light, Kaan sensed victory—the Jedi had spread themselves far too thin in a vain attempt to protect the inhabitants of Ruusan. In addition, the defection of the Jedi Githany gave the Sith vital intelligence on the Jedi battle plan. Though the Sith were suffering high casualties, Kaan believed he would prevail, and sent for reinforcements."}, {"tag": "p", "text": "While most of his followers remained loyal, a few prominent Dark Lords within the Brotherhood began to question his leadership: Githany, Kopecz, and most notably, Darth Bane. With the attentions of the Sith Lords focused against the Jedi on Ruusan, the tide of the war seemed to be turning against the Sith, with the Republic reclaiming areas like the Stenness Node."}, {"tag": "p", "text": "Bane was opposed to Kaan's battle tactics against the Jedi, believing that Lord Kaan was acting more like an ordinary military commander than a Dark Lord of the Sith, and was not properly using the dark side of the Force. Lord Kaan tried to kill Bane—first, by sending Kas'im to murder him, then, when that failed, by having Githany poison him. Bane was too strong—and survived both assassination attempts."}, {"tag": "p", "text": "Bane returned and declared Kaan unworthy of his title, but not before sending to Kaan a peace offering—a scroll inscribed with an ancient Sith ritual—the thought bomb."}, {"tag": "p", "text": "While surprised at Bane's survival, Lord Kaan accepted Darth Bane's tactical advice. Using the Force and attacking as one, the members of the Brotherhood meditated and focused their dark energy into Bane. The combined power of the Sith devastated the Army of Light, and victory was in the Sith grasp."}, {"tag": "p", "text": "Even as the Jedi defeat was imminent, Lord Kaan and the other members of the brotherhood broke the meditation circle. Impatient and overconfident, Kaan believed that the Jedi could be quickly and easily defeated if the Sith took to the field. Secretly, Kaan and his followers were jealous of Bane and his power, and felt that Darth Bane was using their energy for his own benefit."}, {"tag": "h3", "text": "The thought bomb"}, {"tag": "p", "text": "When the Sith Masters broke their meditation and took the field, however, the Jedi counterattacked, and the Sith took severe losses. This was caused in part by Darth Bane's machinations, having signaled the Sith armada in orbit to break formation and attack the opposing Republic fleet, allowing Jedi reinforcements to land. Most of the Sith Masters died in the battle. Following one last discussion with Bane in his tent, Kaan took his defeated forces into a deep cave to wait for the Jedi's final strike. There he used his ultimate tactic: a \"thought bomb\"."}, {"tag": "p", "text": "Kaan believed that the thought bomb would destroy the Jedi, but that he and the rest of the Sith would be strong enough to survive. That belief would lead to not just his own doom, but that of every Force-user within the radius of the explosion. With the aid of LaTor, Kaan studied and refined the thought bomb ritual until he and the other Dark Lords were ready to unleash it. With Qordis dead, and Githany and Darth Bane having left the Brotherhood, it was left to Kopecz to defend against the approaching Jedi forces under Valenthyne Farfalla."}, {"tag": "p", "text": "When Lord Hoth and his retinue finally arrived and confronted the Sith, Lord Kaan detonated the thought bomb, killing himself, his Sith followers and Lord Hoth's Jedi. The New Sith Wars were over and the Sith presumed extinct."}, {"tag": "p", "text": "The caves where Kaan and his Brotherhood had died would eventually be known as the Valley of the Jedi. Darth Bane, his apprentice Darth Zannah, and her cousin Darovit were those that survived the bomb, being distant from its effects and suffering little damage. Bane's callous assessment of his rival and former leader was that Kaan's \"suicide\" was his \"smartest decision\"."}, {"tag": "p", "text": "Kaan's soul remained trapped along with the other souls for over a thousand years until a Jedi named Kyle Katarn traveled to the Valley of the Jedi and freed them."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Oddly, although the Force ghosts of all the Jedi and the Sith were thought to have been trapped in the Valley of the Jedi, Kaan's consciousness seemed to have escaped his own trap and communicated with Bane. Along with Qordis, who had died before the detonation of the thought bomb, he appeared to him after the battle. Former acrimony apparently forgotten, Kaan guided Bane on Dxun to a Sith holocron that would help him restore the Sith Order—and also tricked him into symbiosis with the orbalisks that would become his living armor."}, {"tag": "p", "text": "For most of the Sith that followed the Rule of Two, he was considered symbolic of the flawed Sith of old—his narcissistic, paranoid, and backstabbing cowardice representing the Brotherhood of Darkness as a whole. Not all of Bane's order dismissed Kaan, however—the apostate Darth Millennial considered Kaan's philosophy of \"Rule by the Strong\" as superior to Bane's \"Rule of Two\" and Millennial left his own master over such a disagreement."}, {"tag": "p", "text": "Centuries later Darth Vader, one of the last Dark Lords of Bane's order, used one of Kaan's indestructible Sith amulets in the construction of one of his own gloves."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Unlike many Sith Lords, Kaan was handsome, charming and charismatic, claiming that all were equal in the Brotherhood of Darkness. Nevertheless he was manipulative, frequently using mind tricks to ensure the loyalty of his followers. He chose those who were weak willed to ensure their loyalty, though certain members of his Brotherhood were strong willed enough to resist him, notably Bane and Kopecz. Bane regarded Kaan as both a coward and a fool and believed that he did not deserve the title of Dark Lord of the Sith."}, {"tag": "p", "text": "Ironically, despite his mastery of mind tricks, Kaan himself was weak willed and preached Rule by the Strong to hide his own weakness. It was this weakness that allowed his defeats in the last days of his life to drive him insane, which eventually led to his death."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Kaan was exceptionally skilled in the use of mind tricks which he used in an attempt to ensure the loyalty of his followers. Certain members of the Brotherhood of Darkness were able to resist him, notably Bane and Kopecz, though Kopecz had to use more effort than Bane. In addition to his mastery of mind tricks, Kaan was a master of battle meditation, a skilled military strategist, and a powerful warrior."}, {"tag": "p", "text": "It should be noted that although Darth Bane thought he was a fool, when asked by his newly acquired apprentice, Darth Zannah, if he was weak, he thought to himself that Kaan was many things, but weak was not one of them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although there are some differences characterization in Bane of the Sith, Kaan's appearance here after Ruusan presumably remains canonical."}, {"tag": "p", "text": "Kaan's birthdate is unknown, but author John Jackson Miller briefly joked that Kaan would be in \"high school\" during the events of Knight Errant. If this were true, Kaan would have been born around 1,045 BBY."}, {"tag": "p", "text": "Skere Kaan's given name was first revealed in the 2012 The Essential Guide to Warfare. It was chosen as a reference to Shere Khan, the tiger antagonist from Rudyard Kipling's The Jungle Book."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}