{"url": "Baraduk", "categories": ["Category:Legends articles", "Category:Barabel", "Category:Bounty hunters", "Category:Males", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Baraduk"}, {"tag": "p", "text": "Baraduk was a Barabel male from Barab I. Captured by slavers and sent to the Imperial settlement of the planet Herios IV, Baraduk raided the settler's armory and escaped. During several months, the Imperial governor vainly tried to capture Baraduk, and eventually pardoned the Barabel should he leave the planet."}, {"tag": "p", "text": "Baraduk began a life of bounty hunting, sometimes resorting to working as a bodyguard. He specialized in night attacks, making use of his species' natural infrared vision. He sent his income to Barab I, to help other Barabels wiping Imperial presence from his homeworld. The Kerestian bounty hunter Galasett tracked and fought Baraduk, but he was unable to capture him in their first match."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Baraduk was a male Barabel born in the Barabel homeworld, Barab I. During his time, some elements of the Galactic Empire exploited the Barabel sentient species, sometimes resorting to enslaving Barabels. Baraduk was captured by slavers and sent to the planet Herios IV, seat of an Imperial settlement."}, {"tag": "p", "text": "Once there, Baraduk decided to escape. He stole several weapons from the settlement's armory, including a portable missile launcher, and ran away. The Imperial governor swore to capture Baraduk and sent the Imperial Army after him. Six months after the claim, fifteen Army soldiers had died and Baraduk had not been apprehended. The governor then secretly offered Baraduk a pardon should the Barabel leave Herios IV and never come back. Baraduk agreed to this terms."}, {"tag": "p", "text": "As soon as Baraduk was offplanet, he began a career as a professional bounty hunter, honing his skills through experience for several years. Sometimes Baraduk also worked as bodyguard to criminals, which could give him the chance to access restricted areas and capture other criminals. Baraduk, worried about the Empire exploiting his fellow Barabels, sent most of his earnings to other Barabels with similar opinions in Barab I."}, {"tag": "p", "text": "Baraduk's past as a fugitive was discovered by Galasett, a Kerestian bounty hunter specialized in tracking other bounty hunters who had broken the law. Galasett swore to capture Baraduk. He first confronted the Barabel while Baraduk was working for criminals. They fight, and Baraduk, an expert in night attacks, managed to severely injure Galasett making use of darkness. Baraduk was also wounded, but he could leave the planet without Galasett on his trail."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An over-two-meter, red-eyed, reptilian humanoid with several rows of needle-sharp fangs and covered with protective black scales, Baraduk was a frightening sight to many of his enemies. The keratin, horny scales were not only deterrent, but practical: They protected him from physical damage and from most forms of radiation."}, {"tag": "p", "text": "As a Barabel, Baraduk could see in the infrared part of the spectrum, which allowed him to see heat in total darkness. Making the most of this advantage, Baraduk specialized in night attacks. Most of his enemies were unfamiliar with this Barabel trait and Baraduk could take them by surprise. He used this to defeat Galasett, and from that moment on both hunters developed a hatred for each other, believing that their next encounter would only end in the death of one of them."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "When fighting indoors, Baraduk used his force pike lethally, although he also carried a vibroblade as an alternate melee weapon. Outdoors, he resorted to the portable missile launcher he obtained on Herios IV, but he also carried a blaster pistol. Baraduk commonly carried a comlink and some money."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Baraduk was mentioned in the roleplaying book Galaxy Guide 10: Bounty Hunters (1994), by Rick D. Stuart, including an image of Baraduk by David Plunkett. His role-playing stats mentioned his physical prowess, particularly as a brawler. His gear list lacked the Imperial Peace Keeping Certificate (or \"bounty hunter permit\") that other bounty hunters of that book (except for Galasett, Reglis Taal and Dengar) had. The image illustrating Baraduk's section shows him heavily cladded in hiding clothes. A sequence of images on pages 39, 41 and 43 of Galaxy Guide 10 show a Barabel that matches Baraduk's description, physical and otherwise, but that Barabel has not been identified either as Baraduk or as a different individual. Nine years later, Baraduk was listed as one of the example names for Barabel characters in Ultimate Alien Anthology."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}