{"url": "Skikkesk", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Criminals", "Category:Males", "Category:Trandoshans"], "nodes": [{"tag": "h1", "text": "Skikkesk"}, {"tag": "p", "text": "Skikkesk was a Trandoshan male from the same clan as the promising young Trandoshan Nokk. He led a hunt for young Nokk's coming-of-age ceremony and out of jealousy ordered her to kill a baby Wookiee. After Nokk refused, Skikkesk oversaw the purge of her brood line and Nokk barely escaped. Skikkesk eventually left as well and became a wanted criminal in the Outer Rim. Later on, one of Skikkesk's allies, Shrem, revealed the Trandoshan's location to Nokk and attempted to warn Skikkesk. However, Skikkesk was captured by Nokk and brought before Jabba the Hutt, where he was dropped into a rancor pit with Shrem."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jealous decisions"}, {"tag": "p", "text": "Skikkesk lived in the same clan as the young Trandoshan female Nokk. He was the hunt leader for her coming-of-age ceremony but was jealous of Nokk, whose advanced skills had impressed the clan's elders. For Nokk's final trial, called \"the bloodletting,\" Skikkesk placed her in front of a newborn Wookiee and ordered her to kill it. Nokk was unable to and was expelled from the clan as a result. Skikkesk subsequently oversaw the purge of Nokk's brood line, which saw all of her sisters drowned. Nokk herself was able to flee with her life."}, {"tag": "p", "text": "Eventually, the elders learned the truth about Skikkesk, but he had fled into the Outer Rim Territories. At one point, the Trandoshan helped the human Shrem betray his accomplice, Doctor Chelli Lona Aphra, after they stole from Jawas. Skikkesk became one of the Outer Rim's most wanted criminals, including by the crime lord Jabba the Hutt, though it was to the knowledge of individuals like Shrem that those who came close to the Trandoshan did not survive."}, {"tag": "h3", "text": "Capture"}, {"tag": "p", "text": "Shortly after a plot to assassinate Emperor Sheev Palpatine, Nokk and her husband, Winloss, went to Chalmun's Spaceport Cantina, where Shrem worked as a barman. The pair tricked Shrem into revealing Skikkesk's location in exchange for a supposedly valuable scurrier, which in reality was a \"worthless\" spitscuttle. When Shrem contacted Skikkesk, claiming two mercenaries knew where he was, the Trandoshan asked if he had told them. Shrem then tried to ease Skikkesk's concern, but the latter and his fellow Trandoshan thugs were soon ambushed by Nokk and Winloss. Skikkesk's attempt to escape was stopped by a third bounty hunter, the Wookiee Black Krrsantan."}, {"tag": "p", "text": "After being beaten by Nokk and tied up, Skikkesk was taken by his three captors to Jabba's Palace and put before the Hutt. Shrem was also there, and Skikkesk told him to get out of the palace while he could. Out of greed, Shrem stayed and offered the spitscuttle to Jabba. The creature, though, spat at Jabba, causing the Hutt to open the trap door under Shrem and Skikkesk, releasing them into a rancor pit below."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Skikkesk was a Trandoshan with green skin and yellow eyes. He was the jealous type: When fellow clan member Nokk displayed a record-breaking performance in her hunt, he deliberately ordered her to kill a baby Wookiee and oversaw the purge of Nokk's brood line when she refused to do so. Chelli Aphra described him as one of the most wanted \"psycho villains\" in the Outer Rim. As a criminal, Skikkesk made a reputation for being wanted by everyone as well as killing all who came close to him."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Skikkesk wore a black-and-yellow short-sleeved jacket and similarly colored pants, which went down to the tops of his shins, along with a brown belt. He possessed a blaster pistol and a comlink."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Skikkesk appeared in the comic Doctor Aphra Annual 3, written by Simon \"Si\" Spurrier, illustrated by Elsa Charretier, and released by Marvel Comics on October 30, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}