{"url": "Skimboard/Legends", "categories": ["Category:Legends articles", "Category:Articles with non-canon elements", "Category:Repulsorlift technology"], "nodes": [{"tag": "h1", "text": "Skimboard"}, {"tag": "p", "text": "The skimboard was a form of personal transport which allowed the rider (usually a single being) to hover above the ground. The board utilized a series of repulsors and microengines to propel the device along at a flight ceiling of around one meter (though with questionable modifications, this could be more than doubled). Though balance was an important key to remaining on the board, the rider was also held in place by adhesive lines of goo called stick-strips. The board was operated via a series of foot controls at the rear, which could be used to regulate the power flow between the engines and repulsors for maximum maneuverability."}, {"tag": "p", "text": "The agility of the board made it popular among sporting enthusiasts, who were nicknamed \"slashers\" on planets such as Alderaan due to their practice of slashing through the air with flips and spins."}, {"tag": "p", "text": "Skimboarding could be a dangerous activity, with falls from the board resulting in injuries if the rider wasn't adequately protected with a crash helmet, elbow pads and knee pads. The device also had a built-in anti-collision system which attempted to automatically angle the board away from obstacles. However, this feature was often abused by slashers in the sport of \"going vertical\", a stunt which involved the slasher heading towards a wall at top speed. At the last possible minute, the rider would then bank straight up (aided by the anti-collision system) and shift power to the rear engines, riding up the wall with only the stick-strips to keep the rider from falling. Most slashers could go two-to three-meters up the wall before being overcome by gravity, though the record was five meters."}, {"tag": "p", "text": "Zak Arranda also owned a skimboard at one point, which had been repaired and rewired by Chewbacca to give it even greater power. The skimboard proved instrumental in escaping the dangerous planet of D'vouran, helping him to skim over the consuming surface. Zak even managed to break the vertical record of five-meters by climbing out of a six-meter-deep pit, even when overloaded by his sister Tash Arranda, their shapeshifted Uncle Hoole and his assistant droid DV-9."}, {"tag": "p", "text": "Darth Maul stole one such device from a bystander in the Mon Calamari Fish Market soon after he escaped from the Happy Nerf Herder home for young boys. He used the device to hover from the building he was on into a neighboring one before crashing into an unknown Hutt in RIB hutt."}, {"tag": "h2", "text": "Appearances"}]}