{"url": "Skirmish_at_the_Temple_of_the_Sith", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Jedi Temple", "Category:Battles of the Second Imperial Civil War", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Skirmish at the Temple of the Sith"}, {"tag": "p", "text": "The skirmish at the Temple of the Sith began when Darth Krayt ordered Cade Skywalker to execute Hosk Trey'lis, a Bothan Jedi Master who had been captured by Skywalker some time previously. Cade refused, and thus Krayt executed Trey'lis himself. This provoked the errant Jedi's anger, but his father then appeared before him as a Force ghost. He advised Cade to use the Force; Cade used his power to break into the case that held his father's lightsaber. He then used the weapon to stab Darth Talon in the stomach, immediately taking her out of the fight. He then was attacked by Darth Nihl. Krayt stayed back and tried to persuade Cade to kill Nihl in anger and become a Sith. Eventually, Cade cut Nihl's arm off, threw him against a wall, and used Force lightning on him. Krayt then told Cade to avenge his father's death by killing Nihl."}, {"tag": "p", "text": "Cade refused, stating that it was what the Dark Lord wanted him to do, and then engaged Krayt. During their duel, Cade said he saw through the Force just how sick Krayt really was and questioned whether the rest of the Sith would be willing to follow him if they knew his true condition. He taunted Krayt, saying that even if he died, he would die as himself. If Krayt killed him, then he'd condemn himself to death as a mindless Yuuzhan Vong growth. Meanwhile, the Mynock was attacked by Skull Squadron; however, Morlish Veed ordered Moff Rulf Yage to call off the attack, citing that the Sith ordered the Temple's aerial space to be left undisturbed."}, {"tag": "p", "text": "Just as the duel between Skywalker and Emperor Krayt was reaching its climax, Morrigan Corde blasted open the window behind them, showering Krayt with transparisteel shards. Cade then jumped out and was rescued by Jariah Syn aboard the Mynock, who pulled him inside. The Mynock then escaped the planet and jumped to Hyperspace, but not before Corde revealed herself to Cade over a comlink. Corde revealed herself to be his mother, but when Cade demanded some answers, she replied that he wouldn't be getting any."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Krayt ordered his Sith minions to find Cade again. He said that when he recaptured him, he would use his powers to heal himself and then kill him."}, {"tag": "p", "text": "Krayt was also furious at Nihl. He refused Darth Maladi's offer to reattach Nihl's arm, and prepared to kill him. Wyyrlok informed him that Nihl may still serve. Krayt stripped Nihl of his position as a Hand, to Nihl's dismay, and replaced him with Darth Stryfe. He then sent Talon and Nihl to be healed, and assigned Maladi to use Yuuzhan Vong bio-technology to grow Nihl a new arm."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}