{"url": "Skirmish_aboard_the_Leviathan", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Jedi Civil War", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Skirmish aboard the Leviathan"}, {"tag": "p", "text": "The skirmish that took place aboard the Interdictor-class cruiser Leviathan was one of the key events of the Jedi Civil War. Occurring not long before the end of that conflict, it saw the crew of the Ebon Hawk captured by the Sith Empire's flagship. In a daring bid for escape, the party arranged for one of their number to become separated from the rest, in an effort to break free of the Sith troopers holding them in order to rescue the rest of the crew. Once free of their cells, the party split up; Revan, Bastila Shan, and Carth Onasi made their way to the ship's bridge to activate and open the vessel's hangar deck, while the others went down to the hangar in order to secure the Ebon Hawk before the arrival of Darth Malak."}, {"tag": "p", "text": "Battling their way through the command deck to the bridge, Revan, Bastila and Carth encountered the former Galactic Republic Admiral Saul Karath, who was accompanied by a number of Dark Jedi and Sith troops. Declining the commander of the Sith fleet's offer to accept their surrender, the party fought Karath and his bodyguards, overcoming them and the admiral. Dying, he revealed to his former protégé, Carth, the true nature of his companion's identity; with Darth Malak approaching, however, there was no time to explain everything, and the party swiftly headed back for the Hawk, which by then had been secured and prepped for flight. However, they were not quick enough, and were intercepted by the Sith Lord, who confirmed Revan's identity as the former Dark Lord of the Sith before engaging his old master in a lightsaber duel. In an effort to ensure the successful escape of her companions, however, Bastila intervened, distracting Malak long enough for the rest of the crew to board their vessel and flee the Sith warship."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "The Star Maps"}, {"tag": "p", "text": "Having been retrained in the use of the Force earlier in 3956 BBY while taking refuge from the Sith Empire within the Jedi Enclave on Dantooine, the mind-wiped Revan, along with his companions who had escaped the destruction of Taris, were assigned by the Jedi Council there to locate a number of Star Maps that had been scattered around the galaxy. Located on the worlds of Kashyyyk, Tatooine, Manaan, and Korriban, as well as on Dantooine itself, each of these maps provided clues to finding the source of the seemingly infinite fleet that powered the Sith war effort: the Star Forge. Though each map was incomplete it was hoped that, by finding all of them and piecing together the data gathered from each artifact, the Jedi Order would be able to pinpoint the location of the ancient space station and weapons factory. After uncovering four of the five maps that were to be found, the Ebon Hawk was intercepted by the Sith, and dragged out of hyperspace by the Interdictor-class cruiser Leviathan, the flagship of Sith Admiral Saul Karath. Caught in the larger warship's powerful tractor beams, the crew was faced with certain capture."}, {"tag": "h3", "text": "Capture"}, {"tag": "p", "text": "While their ship was being dragged through space and into the interdictor's hangar bay, the party was briefed on the nature of their enemy by Carth Onasi, who had known Karath during their service together with the Galactic Republic's fleet during the Mandalorian Wars, and had regarded him as a mentor. Knowing Karath to be a formidable enemy, Revan, Carth, and Bastila Shan decided to choose which crew member had the better chance of ensuring that they were separated enough so as to be able to effect their own escape before coming for the others. After selecting a companion to fulfill this role, the rest of the crew braced for imminent boarding, offering no resistance to the overwhelming numbers of Sith troopers."}, {"tag": "h2", "text": "The initial escape"}, {"tag": "h3", "text": "Separation and interrogation"}, {"tag": "p", "text": "Once the Hawk had been secured within the Leviathan's hangar, a number of troops boarded the small freighter and accosted most of the crew, keeping alert for treachery, as instructed by Karath through their commander. While the rest of the party was stripped of their clothing and equipment and placed in a high-security cell, Revan, Carth, and Bastila were singled out for interrogation by the admiral himself. Similarly stripped and placed in force cages, the trio didn't have to wait long for Karath, who claimed to barely recognize Carth, his former subordinate, who sought revenge for the Sith bombing of his homeworld."}, {"tag": "p", "text": "Karath then began the interrogation, first attempting to find out what planet Revan had been retrained on, then the nature of the mission they had been sent on by the Jedi Council. Knowing that he was unlikely to gain cooperation by torturing Revan himself, the Sith officer instead directed the consequences of refusal at Bastila. Revan, however, did not cooperate; after informing the party of the sacking of Dantooine, he continued to press Revan for answers, but the Jedi was unrelenting, continuing to refuse to answer until Bastila was knocked unconscious by the intense pain delivered through her cage's torture field. Growing weary of dealing with his prisoners and achieving nothing, Karath ordered them all to be tortured into unconsciousness before leaving, with Revan receiving the lion's share of pain."}, {"tag": "h3", "text": "Breakout"}, {"tag": "p", "text": "Meanwhile, the party member who had been isolated made his or her own escape. Working his or her way through the sparsely-defended detention level of the Leviathan, the crew member encountered a Rodian prisoner who was being taken captive along with the rest of his crew in an earlier ambush. In exchange for helping him to escape, he gave the companion an ICE breaker, a specialized slicing device that enabled the user to easily bypass the lockouts on the detention level computer systems, enabling him or her to thin the number of Sith personnel on that level, as well as to unlock the detention area's secured doors and release the rest of the party. Once freed, the crew retrieved their equipment and made plans for their next move."}, {"tag": "p", "text": "While Revan, Carth and Bastila made their way to the bridge in an effort to open the doors to the hangar bay in which the Ebon Hawk was held in detention, the rest of the group, led by the Mandalorian warrior Canderous Ordo, went down to the hangar level itself in order to seize control of the freighter and prep it for launch. With their equipment gathered and their plans laid, the party broke up once again to fulfill their separate missions."}, {"tag": "h2", "text": "Assault on the Leviathan's bridge"}, {"tag": "p", "text": "After being successfully freed from the detention level of the Interdictor cruiser, Bastila, Carth and Revan fought their way through the command deck toward the bridge, facing large numbers of Sith troops and Dark Jedi along the way. They eventually made it to the bridge access corridor, only to find it sealed due to the intruder alert that had been triggered by their escape. Forced to seek other means to enter the bridge, the trio found space suits and accessed an airlock that led to an alternate route via the ship's exterior. Once back inside, they renewed their assault."}, {"tag": "p", "text": "The bridge itself, however, was far from empty. A phalanx of Sith troops and Dark Jedi stood guard alongside Admiral Karath, who offered the two Jedi and Carth one last chance to surrender. When they refused, the Admiral ordered his guards to dispose of them; in the intense firefight that followed, the entire Sith retinue was killed, and Karath lay dying of wounds suffered during the melee combat. Coughing and spluttering as he lay on the deck, he called Carth over to him and, before dying, revealed that the one he traveled with was in fact the former Dark Lord of the Sith who had initiated the war against the Republic, Revan. Enraged, Carth accused Bastila of knowing of this all along; despite his anger, the Jedi was able to convince him to wait until their successful escape before revealing the details—to both of them. Making haste, they quickly opened the hangar bay doors and left to meet up with the others at the Hawk."}, {"tag": "h2", "text": "Revelation and flight"}, {"tag": "p", "text": "As Bastila, Carth and Revan attempted to make good their escape, they were contacted once again by Canderous via comlink and informed that the Hawk, which had been placed under heavy guard, had been secured and was ready to go. The party continued to race through the hangar deck, encountering yet more Sith forces augmented by Dark Jedi. However, just as it seemed as though they had a clear run to their vessel and freedom, Darth Malak made his entrance."}, {"tag": "h3", "text": "Duel with Malak"}, {"tag": "p", "text": "As Malak appeared, Carth attempted to shoot him, but the Sith Lord easily deflected his blaster shots and unceremoniously dumped the Republic pilot onto the deck. With the three companions squared off against him, Malak taunted Revan, who had not yet realized who he in fact had been, and at last revealed the truth. In the conversation that followed, Bastila confirmed what the Dark Lord was saying; both attempted to explain to Revan, with each adding their own point of view, what had happened during the trap that had been laid for the two Sith Lords by the Jedi and Republic, and the choice that the Jedi Council had made regarding him in the aftermath of Malak's betrayal. Believing that she was acting out of a selfless desire to bring him to redemption for his past crimes, Revan forgave Bastila, and a furious Malak faced his former Master in lightsaber combat."}, {"tag": "p", "text": "The battle that followed was vicious, with both combatants drawing heavily upon the Force as they fought among the blast tunnels that separated the hangar bay from the rest of the warship. Though Malak held a slight advantage in physical power, Revan was able to keep pace with the Sith Lord, forcing him to flee deeper into the tunnels. However, when Carth and Bastila, who had been held firm by the Dark Lord prior to the fight, caught up with the two duelists, Malak came close to killing Revan, immobilizing him with the same technique he used on them. With an exclamation, Bastila took up her own blade and hurled it at the Dark Lord, distracting him temporarily, entering the fray despite being outmatched. In the resulting duel that followed between Malak and Bastila, the blast doors sealed around them, giving Carth and Revan time to make the final dash to the Ebon Hawk."}, {"tag": "h3", "text": "Flight of the Hawk"}, {"tag": "p", "text": "With the rest of the Sith forces aboard the flagship either dead or otherwise occupied, the crew of the Ebon Hawk was able to escape from the hangar bay itself despite a heavy fusillade of turbolaser fire from the Leviathan's main batteries. Before they could emerge from the mass shadow projected by the warship's interdiction field and make the jump to hyperspace, a half-squadron of Sith fighters bore down on them. Manning the quad laser turret as he always did in such situations, Revan was able to dispatch the enemy starfighters. With their tails clear and nothing but deep space ahead of them, they escaped."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In the relative safety of hyperspace, the crew of the Ebon Hawk met to discuss what had happened aboard the Leviathan. At this point, Revan admitted to the rest of his companions his true nature, seeking reactions from each of them in turn and hoping to allay any doubts that they might have had. Carth in particular was, at first, very distrustful, having been betrayed by others before, including the newly-deceased Admiral Karath. Mission Vao at first thought it was a joke, however both she and Zaalbar, who had sworn a life debt to Revan after having been rescued by him from slavers on Taris, agreed to trust him, stating that they owed him their lives."}, {"tag": "p", "text": "Carth was very reluctant to still trusting Revan, especially after what the Sith did to his homeworld, but Canderous said that everyone knows it was Malak, not Revan, who gave that order. The elderly ex-Jedi Jolee Bindo claimed to have already known who Revan was, stating that he didn't think it was his place to tell them, though it was for the best that the truth was out there. Canderous, who had been in awe of the Jedi, and Revan in particular, in the wake of his people's defeat at the Battle of Malachor V, stated that he was Revan's man to the end. Juhani was equally as surprised, but nevertheless agreed to follow Revan, as did T3-M4. HK-47, when asked, revealed the rest of his hidden past, informing the crew of the homing beacon that had been programmed into him, which activated his deleted memory core upon returning to his original master—Revan."}, {"tag": "p", "text": "With the rest of the crew dedicating themselves to a redeemed Revan, Carth reluctantly accepted his leadership, though he warned against the former Sith Lord slipping back into the dark side. Putting aside thoughts of going back for Bastila for the time being, the crew continued onward in the hopes of uncovering the fifth and final Star Map as quickly as possible, so that they could find the Star Forge and put a stop to the Sith and, in the process, find and rescue their friend."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though this incident does not have a canonical name, it is based on circumstances that occur in the course of the game's storyline that the player must complete as well as the canon light side ending. If the player takes the dark path throughout, a number of alternate possibilities are available to them. They can choose to give Admiral Karath correct answers to his questions, or answer falsely just to see their companions tortured. In addition, they can choose to blame the Jedi and Bastila in particular for Revan's amnesia, succumbing to anger and facing off against Malak as though to reclaim the title of Dark Lord of the Sith. Furthermore, once the party has made its escape, the player can threaten various party members, forcing them to accept his leadership. Alternatively, if the player is female, Karath will torture Carth instead of Bastila."}, {"tag": "p", "text": "Within cut content, an alternate option to complete the level came in the form of an injured Sith officer by the name of Major Hurka who could have been convinced to lead Revan, Carth, and Bastila through the Leviathan, skipping most of what the player would otherwise have to do."}, {"tag": "h3", "text": "Party choices"}, {"tag": "p", "text": "During the initial breakout from the prison complex, the player will take control of what is usually a NPC party member. There are a total of six potential party members that can be assigned to rescue the rest of the crew once the Leviathan captures the Ebon Hawk: Canderous, HK-47, Jolee, Juhani, Mission, and T3-M4. Each has different dialogue from when the crew are captured (however, only T3-M4 has a different conversation with the Rodian) as well as starting positions and circumstances while fulfilling this aspect of the story (noticeably Jolee and Mission do not regain their equipment until the end of the sequence). The notable exception is the Wookiee, Zaalbar, whom the player cannot select due to the need for subtlety when carrying out this phase."}, {"tag": "p", "text": "If the player has not visited Tatooine, or did not purchase HK-47 from Yuka Laka, he will not be available for use in the breakout phase of the mission and will not, therefore, be present aboard the Ebon Hawk to reveal his past association with Revan. Similarly, if the player did not visit Kashyyyk prior to this incident, Jolee will likewise be unavailable and absent from the debriefing session. In the Xbox version of the game, this can cause a bug to occur. Party selection options and circumstances are detailed as follows:"}, {"tag": "p", "text": "Canderous"}, {"tag": "p", "text": "If Canderous Ordo is selected, he will use his special healing implant to keep himself alive after administering a self-inflicted wound involving a grenade and designed to render him unconscious when the crew is taken prisoner. He will be taken to the medical bay and treated; the sidequest starts with him regaining consciousness in the vacant bay. The player will be able to grab his gear and weapons, arm him, and set him about the task at hand, dispatching the Sith troopers and technicians before freeing the Rodian smuggler and accessing the computer system."}, {"tag": "p", "text": "HK-47"}, {"tag": "p", "text": "If the combat droid HK-47 is selected to do the breakout, he will activate a dormancy program and power himself down. The Sith will take him to the droid bay, intending to administer a memory wipe and adding him to their own army. The scenario begins with him waking up; the player then can retrieve his upgrades, items and weapons and proceed to carry out the breakout as stated previously."}, {"tag": "p", "text": "Jolee Bindo"}, {"tag": "p", "text": "If selected, Jolee will use a series of mind tricks to baffle the troops who take the crew prisoner. They will put him in a separate holding cell, where he will further persuade, using the Force, his guard to open the cell and let him out, then step into the cell and lock himself in instead of Jolee. From there, the player will attempt the escape as stated above."}, {"tag": "p", "text": "Juhani"}, {"tag": "p", "text": "If Juhani is tasked with breaking the rest of the crew out of their cells, she will use her ability with Force Camouflage to hide on the Ebon Hawk while Sith troops search it after capture. The player will then start with her \"decloaking\" within the detention level just beside the elevator with all of her weapons and gear. From there it is possible to complete the mission as described."}, {"tag": "p", "text": "Mission"}, {"tag": "p", "text": "Mission Vao, if selected to rescue the rest of the party, will make a successful attempt to antagonize the Sith troopers who come to arrest her and the crew. One of the guards will make mention of this, suggesting that the Twi'lek be given over to Admiral Karath. The commander, however, orders that she be placed in solitary confinement until a torturer can be summoned. Once isolated, she will pick the pocket of the guard, relieving him of the key to her cell. The player will then take control of her in order to fulfill the task as stated."}, {"tag": "p", "text": "T3-M4"}, {"tag": "p", "text": "If chosen to save the party, T3-M4 will be given a backup memory chip set to a timer in case the Sith decide to perform a memory wipe on the astromech droid. Unlike with the rest of the party members, this scenario presents the player with a logic puzzle which involves choosing the correct answer to complete three sequences of integers according to different patterns. This is supposed to interfere with the processes of the droid that is attempting to perform the wipe, the failure of which represents the end of the game (the answers are 3, 10 and 11). If successful, T3-M4 will end up in the droid bay with all of his current gear, where he will be able to complete the rescue."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}