{"url": "Skirmish_above_Hoxim", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Battle stubs", "Category:Battles in the Unknown Regions", "Category:Plot to destroy the Chiss Ascendancy"], "nodes": [{"tag": "h1", "text": "Skirmish above Hoxim"}, {"tag": "p", "text": "A skirmish occurred above the planet Hoxim between Chiss forces as a result of the machinations by Jixtus of the Grysk Hegemony. The culmination of Jixtus' plot to destroy the Chiss Ascendancy was to draw rival Chiss Great Families, each allied with a different Ruling Family, into open conflict; which would spread to the Ruling Families and then the entire Ascendancy. The skirmish nearly accomplished this, but the actions of Chiss Expansionary Defense Fleet Senior Captains Mitth'raw'nuruodo and Xodlak'in'daro of Picket Force Six prevented such an outbreak."}, {"tag": "p", "text": "Agents of Jixtus manipulated ambitious officials from the three rival Great Families of Xodlak, Pommrio, and Erighal into gathering their family fleets in an open confrontation to lay claim to the supposedly nyix-rich mining world of Hoxim. Hostilities nearly broke out between the forces of the Great Families above the Agbui mining world, until Lakinda and Thrawn were able to convince the Great Families' fleets to work together against a supposed threat, which was in reality a force of remote-controlled gunboats controlled by Xodlak, Pommrio, and Erighal family members aboard Thrawn's Springhawk heavy cruiser. Thrawn had his warriors and officers put on a light show, targeting their families' vessels with \"maximum ferocity but minimal actual damage\"."}, {"tag": "p", "text": "At the end of the skirmish, Thrawn had his ozyly-esehembo Che'ri use her powers of Third Sight to guide the hands of weapons officer Afpriuh. Che'ri and Afpriuh aimed at the commandeered Watith freighter at the exact angle needed to destroy the Agbui nyix \"mine\" and make it look accidental. As a result, the Great Families could not fight over the fake nyix deposit, believing it destroyed."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the skirmish against the Watith, Senior Captain Thrawn captured the Saltbarrel, the freighter of the Watith captain Fsir, and the twenty remote-piloted Watith gunboats aboard. He would come to use these commandeered vessels during the skirmish above Hoxim."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "No civil war occurred as a result of the near battle between the family fleets. The official story told to the Ascendancy was that the Xodlak, Pommrio, and Erighal families heroically rescued the Springhawk and her crew. Those families were all commended by the Aristocra for their heroic rescue. No explanation was given for the three families' fleets' presence at Hoxim, and the Syndicure and the families involved were all eager to bury the incident. Thrawn and his officers all testified with the same account as the families. Nevertheless, both Supreme General Ba'kif and Syndic Prime Mitth'urf'ianico suspected that the official story was not complete."}, {"tag": "p", "text": "Lakinda was castigated by the Xodlak family Patriarch for failing to secure the nyix on Hoxim for their family, despite the supposed mining resources being a ploy by Haplif and the Jixtus to draw the Ascendancy into a civil war. However, Syndic Zistalmu offered her to move from a merit adoptive of the Xodlak to Trial-born of the Ruling Irizi family, without having to conduct the Trials."}, {"tag": "p", "text": "Ba'kif questioned the Springhawk's first officer Ufsa'mak'ro and other officers about the skirmish. Sky-walker Che'ri's involvement in the events allowed Samakro and other officers to invoke secrecy protocols to limit their testimonies. The secrecy protocols in question required all crew and officers aware of operations involving the Sky-walker corps to keep such operations confidential, even from others with the appropriate clearance. Only the commanding officer of those operations could disclose the events in question, and Ba'kif doubted that Thrawn would tell him in detail."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}