{"url": "Skirmish_at_Eos", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles in the Cadavine sector", "Category:Battles of the Naboo Crisis"], "nodes": [{"tag": "h1", "text": "Skirmish at Eos"}, {"tag": "p", "text": "A skirmish at Eos occurred when the Trade Federation attempted to terminate Vana Sage after she discovered incriminating evidence against the Federation. The Trade Federation found out that Vana Sage had heard a message tying them to a failed attempt to capture Queen Amidala of Naboo while Sage was working for them over Eos. Sage defended herself in her starfighter from Federation droids and mercenaries until only one damaged Hunter-Seeker droid remained. Sage followed the droid to the surface of Eos and discovered the Trade Federation's secret factory and mining facilities. A shield was activated that trapped Sage there, but she destroyed the shield projectors to escape Eos for good. This event was the first of a series of times Vana Sage would fight the Trade Federation."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 32 BBY, the Trade Federation hired a group of mercenaries to capture Queen Amidala of Naboo. With some help from the Federation, the group ambushed Amidala's starship, but the Queen ultimately escaped the trap. One mercenary sent a coded message to the Trade Federation give them the news. The Trade Federation had contracted the mercenary Vana Sage to perform tests on Scarab-class droid starfighters near Eos."}, {"tag": "h2", "text": "The fight"}, {"tag": "h3", "text": "Space"}, {"tag": "p", "text": "While performing the tests, Sage's droid, Mod-3 detected the coded message from the mercenary. Decoding it, Sage listened to a mercenary describe the recently failed attempt to kidnap Queen Amidala, until she was jammed by her Trade Federation supervisor. The Federation employee then sent numerous Hunter-Seeker droids after Sage and left the system. After managing to destroy all the droids, a wing of mercenary starfighters emerged from hyperspace."}, {"tag": "p", "text": "The mercenaries attacked Sage, but she managed to defeat all of them."}, {"tag": "p", "text": "After the fighting, Mod-3 scanned the wreckage and found a lone, damaged Hunter-Seeker droid heading toward Eos. Thinking the planet was uninhabited, Sage decided to follow the droid."}, {"tag": "h3", "text": "Planet surface"}, {"tag": "p", "text": "Sage followed the droid to a large mining facility. Moments after Sage arrived at the complex, a shield was activated over the area, trapping her inside. Staying calm, Sage determined that destroying seven of the eight shield generators would bring down the shield. Evading more Hunter-Seeker droids and other defensive weapons, Vana was able to destroy the generators and flee the planet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Vana Sage would later return to Eos with Nym, Rhys Dallows, and Reti to destroy the droid factory and prevent an invasion of Naboo. Thanks to Vana's earlier sabotage the Trade Federation was unable to use their defensive shield to protect their facilities, and the factory was destroyed in the ensuing battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This article was based on two consecutive missions in the 2001 video game Star Wars: Starfighter. For these two missions, \"Contract Infraction\" and \"Secrets on Eos,\" players take the role of Vana Sage, one of the game's three protagonists. Destroying all mercenary fighters, all droids dispensers and all mining droids are bonus objectives; this article assumes 100% completion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}