{"url": "Skirmish_at_Coruscant", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Articles with conflicting sources", "Category:Battles of Coruscant", "Category:Battles of the Naboo Crisis"], "nodes": [{"tag": "h1", "text": "Skirmish at Coruscant"}, {"tag": "p", "text": "The Skirmish at Coruscant was a small battle fought on Coruscant in 32 BBY. It began when Padmé Amidala, the Queen of Naboo, was captured by the Sun Guard, the Coruscant mercenaries, and a group of thugs from the Restricted Area."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "The skirmish started when Padmé Amidala, the Queen of Naboo, was captured by the Sun Guard, the Coruscant mercenaries, and a group of thugs from the Restricted Area. When the Queen's two Jedi protectors, Obi-Wan Kenobi and Qui-Gon Jinn, and their new friend Anakin Skywalker, intervened, the Sun Guard and its allies tried to assassinate them. Half of the Coruscant mercenaries, led by a Sun Guard, kidnapped the Queen, while the rest attacked the Jedi. The Queen was soon released by Captain Quarsh Panaka, and the mercenaries were all killed by Kenobi, Jinn, and Mace Windu, who had joined the fight. The leader of the thugs was killed in a duel with Panaka, resulting in the failure of the plot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The events in this article are from two distinct missions from the video games Star Wars: Episode I The Phantom Menace video game and Star Wars: Episode I Jedi Power Battles, both released in 1999. Both games have strategy guides which reveal the proper course of the missions."}, {"tag": "p", "text": "The portion from The Phantom Menace game contradicts the movie. In the movie, the Queen and her retinue arrive on Coruscant, meet Supreme Chancellor Valorum, and take air taxis to their destination. In the game, the Queen and company arrive and are met by a Senate Guard member, who is killed, and the Queen and Panaka must find their own way to the Galactic Senate chambers. The player takes the role of Captain Panaka."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}