{"url": "Skirmish_above_Nettehi", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Battles of Nettehi", "Category:Nikardun campaigns"], "nodes": [{"tag": "h1", "text": "Skirmish above Nettehi"}, {"tag": "p", "text": "During the Nikardun campaigns, a skirmish occurred above the planet Nettehi, the homeworld of the Paataatus species. It initially appeared that the native Paataatus would attack the inbound forces of the Chiss Expansionary Defense Fleet, but the skirmish actually saw the Paataatus military ally with the Chiss Ascendancy against the remnants of the forces of General Yiv's Nikardun Destiny. The Paataatus were subjugated by the Nikardun, and the skirmish above Nettehi freed them from Nikardun occupation."}, {"tag": "p", "text": "Senior Captain Mitth'raw'nuruodo of the Chiss Expansionary Defense Fleet successfully interpreted a Paataatus Prince Militaire's plea for assistance to liberate his people and homeworld from the yoke of the Nikardun. The Prince Militaire put up a false display of attack against the Chiss, mindful that he was being observed by Nikardun forces. Thrawn and his first officer Mid Captain Ufsa'mak'ro understood that this was not a real danger, and named the display a \"light show\". Thrawn made apparent threats against the Paataatus to \"demonstrate the full military might of the Chiss Ascendancy\", which were actually promises to act against the Nikardun occupying the system. Thrawn's forces, allied with the Paataatus military, successfully liberated Nettehi from the Nikardun."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Paataatus government had previously been subjugated to the forces of the Nikardun Destiny, who had demanded the Paataatus conduct an attack on Csilla to distract the Chiss Ascendancy from an attack conducted by the Nikardun at the edges of Chiss space two days prior. In retribution, the Chiss Defense Force mobilized a counterattack against the Paataatus. Ar'alani, Thrawn, Supreme General Ba'kif and other Chiss Defense Force officers were convinced that the Paataatus would not forget the strength of the Chiss after that attack."}, {"tag": "p", "text": "The predictions of those Chiss officers were correct; and indeed, the Hiveborn covertly requested Chiss assistance liberating their homeworld from the Nikardun."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Hiveborn, grateful for their rescue, thanked Thrawn for liberating the Paataatus from their Nikardun would-be enslavers. The Prince Militaire informed Thrawn that some Nikardun remained on the Hive home of Nettehi, but they would be dealt with quickly. He then allowed Thrawn to use their long-distance communications triad to send a message back to Csilla."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish above Nettehi served as chapter 13 of the 2021 novel Thrawn Ascendancy: Greater Good."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}