{"url": "Skirmish_aboard_a_Republic_medical_station", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles of the Great Jedi Purge", "Category:Duels", "Category:Missions of the Ghost"], "nodes": [{"tag": "h1", "text": "Skirmish aboard a Republic medical station"}, {"tag": "p", "text": "During the Galactic Civil War, members of the Lothal rebel cell engaged in a skirmish against two Imperial Inquisitors aboard an abandoned Galactic Republic Haven-class medical station. Following a protracted struggle, the Spectres managed to escape and warn their fellow rebels that the Empire had more Inquisitors."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Darth Vader learned that Anakin Skywalker's former Jedi Padawan Ahsoka Tano still lived and the Spectres narrowly escaped an Imperial trap, Darth Sidious counseled his Sith apprentice to send another Inquisitor to hunt down the rebels. While the Spectres believed that the Grand Inquisitor was the only one they had encountered, the Empire had several other Inquisitors. Several Inquisitors including the Fifth Brother and the Seventh Sister began scouring the galaxy for the Jedi Kanan Jarrus and his apprentice Ezra Bridger."}, {"tag": "p", "text": "With the help of Captain Rex, the Phoenix Cell gained access to a list of abandoned Republic bases and military installations scattered across the Outer Rim Territories and Mandalore. The Spectres' leader Hera Syndulla sent several of her crew members Sabine Wren, Garazeb Orrelios, and Chopper on a mission to salvage supplies from an abandoned Republic Haven-class medical station. Seeking a break from his Jedi routine, Ezra decided to accompany the other rebels on the salvaging mission."}, {"tag": "h2", "text": "Mission to the medical station"}, {"tag": "h3", "text": "The trap"}, {"tag": "p", "text": "The four Spectres traveled to the medical station in the auxiliary ship Phantom. Using Rex's military codes, they managed to dock in the abandoned space station. To aid their salvaging, the astromech droid Chopper activated the station's power. This power surge was detected by a nearby Imperial Star Destroyer that was commanded by the Fifth Brother. The Fifth Brother ventured to the station to investigate. While Chopper stayed in the command center to repair the files, the other rebels went to explore the space station."}, {"tag": "p", "text": "Unknown to the rebels, they were being watched by an ID9 seeker droid belonging to the Seventh Sister, who had set a trap for them. The seeker droid managed to lure Chopper into a trap and electrocute him. Despite being incapacitated, Chopper managed to send a distress transmission to the other three rebels. In an attempt to reach him, Ezra and Sabine climbed up a ventilation shaft. Zeb tried to follow but got stuck. Upon reaching upstairs, the two rebels encountered the Seventh Sister and one of her seeker droids. The Inquisitor quickly bested the two rebels and forced them to flee."}, {"tag": "p", "text": "While fleeing down a corridor, the two rebels bumped into the Fifth Brother. Ezra and Sabine managed to loosen a shut door. While Sabine managed to flee, Ezra stayed behind to shut the door and save his friend. He was quickly taken prisoner by the two Inquisitors and the seeker droids. The Fifth Brother attempted to execute Ezra but was restrained by the Seventh Sister, who pointed out that Ezra could lead them to the other rebels. While she interrogated Ezra, the Fifth Brother was tasked with hunting down Sabine."}, {"tag": "h3", "text": "Escaping the Inquisitors"}, {"tag": "p", "text": "Sabine later managed to find Zeb and pull him out of the ventilation shaft. When Zeb suggested contacting Kanan, Sabine counseled against it since this would compromise the rebel fleet to the Empire. While Ezra held out against the Seventh Sister who took an interest in Ahsoka Tano, Sabine and Zeb tried to stop the Fifth Brother. They lured him into a room and planted several thermal detonators on the floor. Sabine attempted to trigger the detonators but they refused to go off."}, {"tag": "p", "text": "Using the Force, the Fifth Brother hurled the thermal detonators at the two rebels. Both Sabine and Zeb survived the explosion but Sabine was knocked out by the blast. Zeb managed to flee but Sabine was taken prisoner by the Fifth Brother, who carried her back to join the Seventh Sister and Ezra. Zeb managed to outwit and destroy the seeker droids. After finding the medical supplies, Zeb encountered Chopper. Together the two of them headed back to the Phantom but Zeb refused to abandon his fellow rebels to the Inquisitors. Despite being unable to match the Inquisitor's Force powers, he came up with a plan to rescue Ezra and Sabine."}, {"tag": "p", "text": "Posing as \"Commander Meiloorun,\" Zeb contacted Ezra and Sabine; who had refused the Inquisitors' demands that they contact the rebel fleet. They only gave in once the Fifth Brother threatened Sabine. Claiming that they needed help, Ezra told Zeb that they would come out and meet in the hangar bay. Before ending communication, Zeb told the two rebels to \"keep their chins up\"; a coded message to look above. Seeking an opportunity to capture Ahsoka and Kanan Jarrus, the Inquisitors led their captives to Bay Six."}, {"tag": "p", "text": "Upon arriving there, they spotted Zeb and Chopper in the Phantom, which was hanging upside down on the ceiling. When the Inquisitors spotted the Phantom, Zeb brought the ship down and opened the rear hatch, allowing Ezra and Sabine to board. The rebels then attempted to flee into space but the two Inquisitors used their Force powers to grab the ship. With much difficulty, Zeb managed to break the ship away and flee through the blast door before it closed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The medical supplies that the Spectres recovered from the Republic medical station boosted the Phoenix Squadron's meager resources. Despite their escape, the rebels were troubled by the revelation that more Inquisitors existed. The Spectres would continue to encounter the Inquisitors on several occasions including a rescue mission on the planet Takobo, the Imperial assault on Garel, a duel on Oosalon, and a final encounter on the planet Malachor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish aboard a Republic medical station first appeared in the Star Wars Rebels episode \"Always Two There Are,\" which debuted on Disney XD on October 28, 2015. The episode also introduced a new antagonist in the form of the Inquisitor known as the Seventh Sister; who was voiced by Sarah Michelle Gellar, the wife of Freddie Prinze Jr. (the voice of Kanan Jarrus)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}