{"url": "Skirmish_at_Peragus_II", "categories": ["Category:Legends articles", "Category:Battles in the Xappyh sector", "Category:Battles of the First Jedi Purge"], "nodes": [{"tag": "h1", "text": "Skirmish at Peragus II"}, {"tag": "p", "text": "The Skirmish at Peragus II occurred during the Old Sith Wars as the Jedi Exile, Meetra Surik was pursued by Sith forces to a major mining colony in the Peragus II asteroid field. The colony was destroyed by Darth Sion as Meetra attempted to flee the facility."}, {"tag": "h2", "text": "Capture of Harbinger"}, {"tag": "p", "text": "The confrontation began on the Republic vessel Harbinger. One of Goto's HK-50 Jedi hunters was working undercover on board as a protocol droid assigned to Meetra Surik by the captain of the vessel, who had received instructions from Admiral Carth Onasi to see that she safely reached Telos IV with diplomatic-level priority."}, {"tag": "p", "text": "Sometime later, a distress signal was received from a freighter under attack by Sith forces and the course was diverted from Telos to investigate, both the freighter and the Sith warship were found empty though in fact they were just playing dead in the hopes of being picked up. The freighter's ID signature matched that of the Ebon Hawk from Republic databanks and was tractored by the Harbinger, the warship was boarded allowing stealthed Sith assassins on the Republic vessel. On board the Ebon Hawk was reported only Kreia's dead body and the badly damaged T3-M4."}, {"tag": "p", "text": "While HK-50 arranged for Meetra to be drugged in a medical appointment, Darth Sion was found unconscious on the warship and placed in a kolto tank, Kreia awoke from her hibernation trance and found Meetra sealed in one of the cargo holds, unknown to her however, the Sith were already on board busy in a series of murders which systematically crippled the Harbinger. As soon as Kreia and Meetra escaped on the Ebon Hawk, the Sith fired upon the freighter, nearly destroying it. T3-M4 was able to repair the damaged vessel, with the help of 3C-FD, while the two Jedi lay unconscious and guided it to the Peragus Mining Facility."}, {"tag": "h2", "text": "Mining Facility massacre"}, {"tag": "p", "text": "As soon as the Ebon Hawk had docked with the Peragus Mining Facility, HK-50 attacked T3-M4 and he was temporarily deactivated, the assassin droid had slipped himself quietly into the ship's storage compartment. Kreia was sent to the morgue and Meetra was placed in a kolto tank for recovery. There was much unrest among the miners as some saw their chance to collect the bounty posted on Jedi by the Exchange while others opposed this, accidents were occurring, and smuggling operations were giving the security officer a busy time. Meanwhile, HK-50 had learned by the maintenance officer all he needed to know about the facility. Posing as the maintenance officer, he made a deal with one of the miners, Coorta to help deliver Meetra to the Exchange."}, {"tag": "p", "text": "The assassin droid reprogrammed the mining droids,which caused many miners to be injured or killed, forcing many miners to join Meetra Surik in the medical bay. The maintenance officer assumed the droids were going under binary decay but couldn't get a good look at the droids to see what was wrong since malfunctioning ones damage themselves. Detonations occurred in isolated gas pockets in the lower levels of the facility, driving the miners into emergency sections of the station, forcing a lockdown and damaging specific sections of the facility's ventilation systems, causing a buildup of toxic fumes in the dormitory level in which the remaining miners, cut off from communications and facility control, were left to die. The last few to be killed were Coorta and his men, who were trying to escape the facility, but HK-50 reversed the turbolift codes, preventing Coorta from getting to the administration level and then had the droids kill Coorta and his men. As a final touch, HK-50 applied a heavy dose of sedatives to Meetra and the miners in the Medbay. This overdose of sedatives killed the miners, but rendered Meetra in an unconscious state, for easy transport to Goto once his transport arrived."}, {"tag": "h2", "text": "The skirmishes begin"}, {"tag": "p", "text": "After hearing Kreia's voice through the Force, Meetra snapped into consciousness and slipped out of her kolto tank, she gained access to the facility morgue and found the elderly woman who awoke and greeted her. With no time for explanations, Meetra was urged to find the Ebon Hawk so that they might flee the trouble Kreia had sensed during her sleep."}, {"tag": "p", "text": "Half naked and with nothing but a vibroblade and a mining laser, Meetra fought her way through hostile mining droids, slowly regaining Force-sensitivity with Kreia's help. She found Atton Rand in a force cage on the administration level and though he was elusive on what he had been charged with, they had a brief conversation about what had happened prior to his arrest, bring Meetra up to speed on the situation. Meetra freed Atton and accepted his help in finding a way out of there. Atton managed to get communications back but found the system severed from the main hub, still T3-M4 had been left in storage near the hangar bay in standby mode and Meetra was able to contact him using a communication terminal. T3 provided a route from the administration level to the hangar bay, passing through the mining tunnels and the fuel depot, where Meetra would eventually be thwarted by force fields and left to find other means in the dormitory level."}, {"tag": "p", "text": "During a spacewalk across the asteroid's surface, Meetra was contacted by Atton via comlink and informed her that the Harbinger was about to dock with the facility. Once Meetra made her way back to Atton, Kreia joined Atton and Meetra in confrontation with HK-50 prior to boarding the vessel after. Their plan was to go through the Harbinger in an attempt to reach the hangar passing through the fuel pipe by the engine room."}, {"tag": "h2", "text": "Skirmishes aboard the Harbinger"}, {"tag": "p", "text": "On the Harbinger, the three had to fight their way through stealthed Sith Assassins to get to the bridge and download the orbital drift charts necessary to clear the Peragus asteroid field. The three came across Meetra's quarters on the ship and she got her belongings that were kept in a footlocker there. On the engine deck Darth Sion confronted Kreia while Meetra and Atton escaped. Kreia who had just left the morgue and had only her crude vibrosword for defense, stood no chance against Sion's lightsaber, she Force cloaked herself to try a sneak attack but Sion severed her left hand. The pain echoed through the Force bond that had formed between her and Meetra during their long slumber, making Meetra thrash about in pain as she and Atton reached the engine room. Utterly defenseless, Kreia was spared by Sion."}, {"tag": "h2", "text": "The escape"}, {"tag": "p", "text": "Atton and Meetra were joined by T3-M4 in the fuel depot and the three made for the Ebon Hawk. While Atton powered up the engines, Sith troopers attempted to board, but Meetra repelled them with the Hawk's gun turrets. Kreia just barely made it to the ship before they took off."}, {"tag": "p", "text": "As the Hawk prepared to make a jump to hyperspace, Sion and the Harbinger pursued them through the asteroids. The Republic warship shot at the asteroids, detonating one of them, and setting off a chain-reaction explosion that completely destroyed every asteroid in the field, including the facility. Meetra then set course for Telos, where she would be put under house arrest pending the results of an investigation on the Peragus disaster, which had profound consequences for the planet and for the Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}