{"url": "Skirmish_at_Outpost_D-34", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Javin sector", "Category:Battles of the Mugaari Campaign"], "nodes": [{"tag": "h1", "text": "Skirmish at Outpost D-34"}, {"tag": "p", "text": "The skirmish at Outpost D-34 took place during the Galactic Civil War in 3 ABY. It resulted in the capture of Rebels stowed away aboard the Onece 3."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the recent Rebel defeat on the planet Hoth, freighter traffic began to increase in the Javin sector. Imperial Intelligence suspected a connection and believed that the Rebels would try to pass through this checkpoint. One of their pilots, Maarek Stele, who had been stationed there following Admiral Mordon's death would prove that hypothesis."}, {"tag": "h2", "text": "Battle"}, {"tag": "h3", "text": "Inspection"}, {"tag": "p", "text": "Two ship groups, freighter group Onece and stormtrooper transport group Dayta arrived and requested permission to pass through the sector. While attempting to pass through Maarek Stele began to inspect the ships starting with the transports, which he found had workers, he then inspected the freighters to discover that Rebels were hiding in freighter Onece 3, while the rest contained Foodstuffs, He alerted his senior officers, to which transports Sigma were then dispatched to disable and capture the freighter."}, {"tag": "h3", "text": "Shuttle intervention"}, {"tag": "p", "text": "While Sigma group and Stele attacked the freighter, Rebel Shuttles arrived in an attempt to intervene to save the Rebels from being captured. They were unsuccessful as by the time they arrived Stele managed to help drain the shields and slightly damaging the hull of Onece 3. Transport Sigma disabled Onece 3 forcing it to stop and Sigma 1 boarded it to capture the freighter while Sigma 2 returned to base. Stele engaged both shuttle groups Roe and Escro were all destroyed by him. The freighter was then boarded, captured and was sent to a Imperial shipyard, where the rebels would be interrogated. The rest of the freighter convoy, which carried cargo that matched their manifests claims were allowed to go and therefore entered Hyperspace bound for parts unknown. Another convoy that arrived was Container Transport group Taloos and YT-1300 group Yander. Both carried legal cargoes and were allowed to pass."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The captured freighter carried 10 individuals, some of them were Mugaari sympathisers. Imperial Intelligence hoped to learn more about the Rebel activity in the sector through the prisoners. Admiral Flanken and Major Thorbo were the ones who interrogated the prisoners for the desired base of operations and plans using an Interrogation droid to extract every detail they could get. To Stele it reminded him of being a Bordali prisoner, but figured that it served the Rebels right."}, {"tag": "p", "text": "Another thing was that Alliance forces in the area upon hearing the unsuccessful smuggle attempt believed that if they could not smuggle their forces out of this sector, they may have to force their way out. This would lead to the First Battle of Javin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Skirmish on Outpost D-34 first appears in the PC game 1994 Star Wars: TIE Fighter. This is Battle 1 mission 1 in the game. The details of Stele's specific actions are in TIE Fighter: The Official Strategy Guide."}, {"tag": "p", "text": "This is the storyline of the mission following \"medium\" difficulty. If the player tries hard difficulty then the first shuttle group is replaced with Ravtin and Escort shuttle group Tough there is also a stormtrooper transport called Glich which must be destroyed as a \"bonus\" objective. The strategy guide acknowledges the Transport Glich."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}