{"url": "Skirmish_in_Darth_Bane%27s_mansion", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Skirmish in Darth Bane's mansion"}, {"tag": "p", "text": "This skirmish took place in Darth Bane's mansion on Ciutric IV in 980 BBY. Princess Serra, the daughter of Caleb, discovered that her father had been killed ten years earlier after he had healed Darth Bane for a second time. Looking for revenge, she hired the Iktotchi assassin known as The Huntress to capture Bane and bring him to her, providing the Huntress with several mercenaries and a senior member of Serra's Royal Guard, Captain Jedder. They arrived at Bane's mansion shortly before the Dark Lord of the Sith returned from his mission to Prakith."}, {"tag": "p", "text": "As the Dark Lord entered his home, two sonic detonators set up on either side of his front door exploded, distracting him. He was then set upon by four mercenaries, whose stun shots he blocked with a Force barrier. Meanwhile, the Huntress began interfering with his ability to draw on the Force, causing one shot to get through and hit him. He quickly recovered, shooting Force lightning out at the four mercenaries. However, due to the interference, his bolts only killed three; the fourth was able to throw herself back over the balcony and escape from the lightning. Five soldiers then appeared and shot at him with tangle guns."}, {"tag": "p", "text": "Bane leaped up to the ceiling, grabbing onto the chandelier and and launching himself up onto the balcony. He then confronted the Huntress, whom he realized was the one interfering with his ability to touch the Force. She charged him, distracting him long enough to prevent him from noticing the flash grenades at his feet. They exploded, blinding him, and he stumbled back into the balcony railing. The Iktotchi kicked him in the chest, knocking him over the edge of the railing. He dropped his lightsaber as he hit the floor and was instantly hit by several tangle gun shots, pinning him down to the ground. Bane then managed to break through the tangle guns' webbing with a burst of electricity, before rolling aside to avoid being stabbed by the Huntress, who had jumped down after him."}, {"tag": "p", "text": "He called his lightsaber back to his hand, but the Huntress retreated, making way for the mercenaries to take over the fight again. Several flash grenades exploded around him, but Bane used his ability to see through the Force, rather than using his physical sight. More webbing was shot at him, but he destroyed them before they could reach him. Several concussion grenades were then launched at him and Bane threw up another protective barrier around himself. Jedder and another soldier then jumped out and shot at him, but Bane deflected the stun bolts and crushed them against the wall behind a couch. He then quickly cut two more soldiers in half before jumping up back on the balcony to face the Iktotchi once more. Bane attacked her with his lightsaber and the Huntress struck back with her twin knives; both missed, however, and Bane threw her back over the balcony. She managed to land on her feet, however, and dodge the Force lightning that he then sent at her. He jumped down, dodging the soldiers' stun bolts, trying to get after the Huntress. However, at some point during the fight, the Huntress had managed to strike his forearm with one of her knives—which had been tipped with senflax, a neurotoxin. As he landed, he instantly fell down, unconscious. Ordering the mercenaries to cease fire, the Huntress felt Darth Zannah's approach and arranged their escape. She took the Dark Lord's lightsaber and they returned to the shuttle that would take them to Doan."}, {"tag": "h2", "text": "Appearances"}]}