{"url": "Skirmish_at_Ithor", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War", "Category:Battles of Ithor"], "nodes": [{"tag": "h1", "text": "Skirmish at Ithor"}, {"tag": "p", "text": "The skirmish at Ithor was a brief battle between Han Solo in the Millennium Falcon and the Galactic Empire. Solo was able to save some Ithorians from the Empire, evade TIE Fighters, dodge asteroids, escape space slugs, and put them on the planet Bimmisaari for safety."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Han Solo, renowned pilot of the Rebel Alliance, became a skillful leader of the Rebel forces. After winning several battles, the Galactic Empire was planning to attack the jungle planet Ithor. Volunteering to save the helpless Ithorians, he decided to rescue the Ithorians and place them on the peaceful planet Bimmisaari."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "After entering the planet's atmosphere, Solo dodged the jungle trees, branches, and roots to rendezvous with the Ithorians. After calling them aboard his starship, the grateful Ithorians rushed aboard, knowing that this trip might save their lives. He then left the surface and headed for space, hoping the Empire had not arrived."}, {"tag": "h3", "text": "Space battle"}, {"tag": "p", "text": "However, much to Han's dismay, the Empire arrived quickly and immediately began to dispatch squadrons of TIE/LN starfighters. The TIE Fighters attacked from behind, firing their twin lasers at the Falcon, starting a vast space battle above the jungle planet. Twisting and turning, Han eventually was able to outmaneuver most of the fighters, and fled into deep space, hoping the Empire wouldn't follow him."}, {"tag": "p", "text": "However, the lasers from the TIE Fighters damaged the nav computer onboard the Falcon. Han did not have time to fix it, so the Falcon flew right into an asteroid field. The asteroids flew very closely together, so Han tried his best to dodge the drifting rocks. The Falcon headed toward three large asteroids. However, three space slugs were hiding in the asteroids and tried to eat the Falcon. Han bested the space-dwelling creatures and flew out of the asteroid field."}, {"tag": "h3", "text": "Bimmisaari"}, {"tag": "p", "text": "Spotting the planet Bimmisaari, Han flew towards it. However, the landing gear was damaged so Han was unable to land on the planet smoothly. Barely missing a large space freighter, Han dived towards the landing pad and crashed, but landed safely. The Ithorians were freed from the Imperial attack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}