{"url": "Skirmish_in_Dramath_the_Second%27s_tomb", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Chorlian sector"], "nodes": [{"tag": "h1", "text": "Skirmish in Dramath the Second's tomb"}, {"tag": "p", "text": "A skirmish took place in 3954 BBY inside Dramath the Second's tomb on the Outer Rim planet Rekkiad. Jedi Master Revan, accompanied by the Mandalorian Canderous Ordo, had been led to the tomb by Revan's memories—of him previously discovering the tomb—revealing the location of the Mask of Mandalore. While in the tomb, Canderous's wife, Veela, and five other Mandalorians ambushed Revan and Canderous, confronting them on Revan's identity and how Veela believed that her husband should lead Clan Ordo. When Canderous refused to join Veela, they engaged in a firefight that ended with the deaths of Veela and the five Mandalorians with her. The day after the skirmish, Revan told Canderous the truth about how the Mandalorian Wars really began, and how the hidden Sith Empire was behind the invasion of the Galactic Republic."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3954 BBY, those clans of the Mandalorian warrior culture that had survived the Mandalorian Wars against the Galactic Republic—a conflict that had ended with the death of their leader, Mandalore the Ultimate, at the hands of the Jedi Knight Revan—gathered on the Outer Rim planet Rekkiad in order to search for Mandalore's Mask, the symbolic ceremonial war mask of the Mandalore. That same year, Revan, now a Jedi Master, traveled to Rekkiad with the Mandalorian Canderous Ordo and helped Clan Ordo, Canderous's clan, to locate the Mask. Revan and his friend Malak had, six years earlier, previously hid the Mask in the tomb of the Sith Lord Dramath, which was located in one of the two ice pillars known as the Twin Spears on Rekkiad's surface. Revan, operating under the alias \"Avner,\" and Canderous joined Clan Ordo in its search, and Revan's memories led him to convince clan chief Veela Ordo, Canderous's wife, to move their camp closer to the Twin Spears. However, the Twin Spears sat within the territory of Clan Jendri, as each clan had chosen its own territory in which to search for the Mask."}, {"tag": "p", "text": "The morning after Clan Ordo set up camp, it was attacked by Clan Jendri in retaliation for its trespassing, and Clan Ordo emerged victorious with the aid of Revan—though he inadvertently revealed to Veela that he was a Jedi in the process. Clan Ordo celebrated its victory late into the night and the following day arrived at its destination. The clan broke into two teams—the first consisting of Revan, Canderous, and two pilots, while the second consisted of Veela and three pilots—before climbing the First Spear. During the seven-hour climb, a member of Veela's team lost his footing and forced her team to retrieve him, slowing them down enough to allow Revan's team to reach the summit first. Revan led Clan Ordo to locate the entrance to the tomb atop the Spear. He and Canderous entered the tomb first and managed to find the Mask inside Dramath's sarcophagus."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "After Revan and Canderous opened Dramath's sarcophagus and found Mandalore's Mask, they were ambushed by Canderous's wife and the five pilots. Veela revealed that she knew Revan's Jedi identity and pleaded to Canderous that he break his loyalty to Revan and reclaim his place in Clan Ordo as their leader, stating that his rightful place was at her side. Canderous responded that he could not break his loyalty to Revan and pleaded to Veela and the others to stand down. With neither side backing down, Veela and her Mandalorians opened fire on Revan and Canderous, and the two were forced to fight for their lives."}, {"tag": "p", "text": "Revan used his lightsaber to block and redirect the first volley of blaster shots back into the original two shooters and clipped Veela's shoulder with one shot. Veela and the surviving two Mandalorians took shelter and threw three grenades into the room, though Revan lifted the sarcophagus lid and positioned it as a barrier to protect Canderous and himself. The blast shattered the lid to pieces and stunned Revan, prompting Veela and the remaining Mandalorians to rush into the room and try to kill Revan while he was disoriented. However, Canderous shot Veela before she could kill Revan. The remaining soldiers were stunned by Veela's death, and Revan seized the opportunity by using the Force to throw his lightsaber at the distracted soldiers, killing them before they could move to safety."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The following day Revan told Canderous the truth about how the Mandalorian Wars began. He spoke of an emissary of the hidden Sith Empire who traveled to Mandalore—the Mandalorian homeworld—to seek help from the current Mandalore, Mandalore the Ultimate, in locating the remains of Dramath the Second, the enemy of the emissary's Master, the Sith Emperor. The emissary and Mandalore discovered Dramath's tomb on the planet Rekkiad, and the emissary took the remains to give back to his Master. The emissary told Mandalore of a vision his Master had of the Mandalorian warriors rising up and defeating the Republic, while casting a spell that only affected Mandalore the Ultimate, to ensure the Mandalorian invasion."}, {"tag": "p", "text": "After telling Canderous the truth, Revan asked him to stay behind and become the new Mandalore—to protect his people and the Republic. After listening to Revan, Canderous donned Mandalore's Mask and proclaimed himself Mandalore the Preserver, vowing to help restore the glory and honor of his people. Revan then traveled to Nathema, the planet recorded in Dramath's datacron, to find more answers about the Sith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish first appeared within Drew Karpyshyn's novel The Old Republic: Revan, which was published on November 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}