{"url": "Skirmish_aboard_the_Sorca_Retreat", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Skirmish aboard the Sorca Retreat"}, {"tag": "p", "text": "A skirmish broke out aboard the Sorca Retreat after Eternal Rur took control of a droid during an auction held by the archaeologist doctor Aphra."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After obtaining the Rur crystal, the rogue archaeologist Doctor Chelli Lona Aphra organized an auction at the Sorca Retreat for monetary gain. The Rur crystal contained an artificial intelligence known as Eternal Rur, who believed that he was the ancient Ordu Aspectu leader Rur. The auction was attended by Yonak of the Son-tuul Pride, Sutha of the Hutt Clan, the Cyban Front, the Shadow University, the Dominion of the Ezaraa, Thomas Toov, and Papa Toren, who was representing the Xonti Brothers."}, {"tag": "p", "text": "Though Eternal Rur was capable of possessing droids including a blue Cyban Front droid, Dr Aphra still insisted on continuing with the auction. Seeking emancipation from their human master, Dr Aphra's killer droids Triple Zero and Beetee sabotaged the auction by alerting Darth Vader to the sale of a rare Jedi artifact. They also installed the Rur crystal into the chassis of the blue Cyban droid."}, {"tag": "p", "text": "The auction was complicated by the arrival of the Xonti Brothers, whom Aphra's Wookiee companion Black Krrsantan wanted to settle scores with for brutally training him as a gladiator. They also bid for the Rur crystal, seeking to use it to power gladiatorial androids. Ultimately, the Shadow University won the bid with an offer to supply rare artifacts, grant Dr Aphra access to archives, and to let her keep her doctorate title. However, the reinvigorated Eternal Rur broke free from the containment cylinder and vowed revenge on those who had tried to buy him."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "h3", "text": "Bloodbath"}, {"tag": "p", "text": "The Dean from Shadow University initially thought that Eternal Rur's attack was a demonstration but Dr Aphra pushed her out of the way, saving her and her colleague from being mowed down by gun turrets, which had been activated by Triple Zero and Beetee. The Ezaraa charged at Eternal Rur but several were gunned down by the gun turrets and struck down by the vengeful artificial intelligence."}, {"tag": "p", "text": "Dr Aphra fled out the corridor where she encountered the red Cyban Front leader. Aphra regretted not installing technopathic controls in the blue droid. However, she noticed that the red Cyban leader had not been infected which meant that someone else was controlling the guns. Over the comlink, Triple Zero admitted that he had engineered Eternal Rur's rampage and sabotaged the gun controls as a means of exerting leverage from Dr Aphra. He told her to meet them back in her room."}, {"tag": "p", "text": "Yonak attempted to take out Eternal Rur but proved no match for the droid and was forced to flee through several blast doors. He managed struck a deal with Sutha and his underlings to defeat Rur and take the crystal for themselves. Meanwhile, Dr Aphra encountered Black Krrsantan, who got her to use an eye scanner to unlock the weapons safe. Dr Aphra also agreed to help the Wookiee to hunt down the Xonti Brothers, whom he wanted to honor his \"life debt\" to."}, {"tag": "h3", "text": "Altering a deal"}, {"tag": "p", "text": "Dr Aphra alerted the others to the presence of firearms but was tracked down by Eternal Rur. Before Rur could kill her, Triple Zero drove him away with a gun turret. Dr Aphra managed to rejoin the droids in her room just as Darth Vader arrived with stormtroopers and an Imperial Star Destroyer.  Shortly after arriving, Darth Vader used the Force to shatter the red Cyban leader into shards, terrifying Dr Aphra."}, {"tag": "p", "text": "Triple Zero admitted that he had informed Lord Vader abut the auction but reassured Dr Aphra that he had omitted to mention her role in organizing the auction. Dr Aphra agreed to emancipate Triple Zero and Beetee by deactivating the inhibitor program controlling them, allowing the droids to control their dangerous arsenal."}, {"tag": "h3", "text": "Helping Black Krrsantan"}, {"tag": "p", "text": "Dr Aphra then helped Black Krrsantan to trap the Xonti Brothers by sealing the door to their hangar bay, preventing their ship from fleeing into hyperspace. To reach the hangar, Dr Aphra and Krrsantan traveled through the domes. There, they encountered the mortally wounded Shadow University dean, who was being used as bait by Yonak and Sutha's forces. As the dean breathed her last breath, she convinced Dr Aphra to safeguard the priceless artifacts aboard the Shadow University's ship."}, {"tag": "p", "text": "Not trusting Yonak and Sutha, Aphra and Black Krrsantan continued their journey to the Xonti Brother's hangar bay. There, they found the Xonti Brothers and Kthoo-Ra trying to use explosives to breach the hangar doors. Since the hulking Khtoo-Ra was stronger than Black Krrsantan due to his cybernetic implants, Dr Aphra sent a servant droid. After the Xonti Brothers shot the droid, Dr Aphra pretended to parley with them, offering to betray Black Krrsantan."}, {"tag": "p", "text": "Just then, the servant droid activated an ion pulse, which knocked out Khtoo-Raa and the Xonti Brothers. Black Krrsantan then gunned down Khtoo Raa and took the unconscious Xonti Brothers into custody. As he climbed aboard their ship, Dr Aphra toyed with coming along for the ride but recalled her earlier promise to bring back the Shadow University's ship. Despite the danger out there, Dr Aphra decided to do something right for a change."}, {"tag": "h3", "text": "Escaping the carnage"}, {"tag": "p", "text": "Using her slicing skills, Dr Aphra diverted several stormtroopers from the lower decks to the dome, where the Son-Tuul Pride and Sutha's forces had congregated. Meanwhile, Eternal Rur killed the elderly Thomans Toovs, ending his quest for immortality. Rur then pursued Dr Aphra down a turbolift where they ran into the path of several stormtroopers. Nearby, Lord Vader slew a defiant Ezaraa. One of his stormtroopers informed him about the presence of a lightsaber–wielding droid in the dome."}, {"tag": "p", "text": "Lord Vader engaged Eternal Rur in a lightsaber duel.  Returning to the dome, Dr Aphra joined forces with Sutha in an attempt to escape the carnage but the Hutt was killed by a stray blaster bolt. Meanwhile, Yonak sacrificed the life of one of his men to reach a red freighter in the hangar. There, he agreed to travel with Triple Zero and Beetee into space."}, {"tag": "p", "text": "Lord Vader gained the upper hand over Eternal Rur, severing one of his host body's hands. Still defiant, the artificial intelligence used technopathy to seize control of the gun turrets, killing several stormtroopers and narrowly avoiding Dr Aphra. He attempted to gained control of Darth Vader's circuits but the cyborg used the Force to shatter Eternal Rur's droid body and recover the Rur crystal."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the defeat of Eternal Rur, Dr Aphra departed in the Shadow Academy ship. She evaded Lord Vader's Star Destroyer and managed to jump into hyperspace. Lord Vader allowed her to escape since he was satisfied with capturing the Rur crystal. She returned the artifacts to the Shadow University and Museum of Bar'leth but kept some of the artifacts for herself. Dr Aphra took a holiday on the planet Zeltros but was hunted down by Dukan's associates including Tukan, who wanted to exact revenge for the death of their comrade in the Cosmatanic Steppes."}, {"tag": "p", "text": "Lord Vader regarded the skirmish aboard the Sorca Retreat as a victory for the Galactic Empire since the deaths of several underworld figures disrupted the underworld, allowing the Empire to turn its attention to the Rebel Alliance. A pleased Emperor Palpatine added the Rur crystal to his collection of Jedi relics at the Imperial Palace in Coruscant."}, {"tag": "p", "text": "Meanwhile, Black Krrsantan honored his \"life debt\" to the Xonti Brothers by subjugating them to the same brutal training they had meted out to him. Elsewhere, Triple Zero and Beetee helped Yonak to settle scores with his rivals on Son-tuul."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Skirmish aboard the Sorca Retreat first appeared in the 2017 Marvel Comics Star Wars: Doctor Aphra Book III: The Enormous Profit story arc."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}