{"url": "Skirmish_by_a_signal_beacon", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles of the First Order–Resistance war"], "nodes": [{"tag": "h1", "text": "Skirmish by a signal beacon"}, {"tag": "p", "text": "During the First Order/Resistance War, forces of the Colossus space station fought a skirmish against the First Order forces pursuing them after the station's commander, Captain Imanuel Doza, set up a signal beacon in an attempt to rendezvous with his wife, Resistance pilot Venisa Doza, for their daughter Torra's birthday. The Colossus was eventually forced to flee when its deflector shields were nearly depleted, just missing Venisa's arrival at the rendezvous point. Venisa was subsequently captured by Agent Tierny's Star Destroyer, but she and her astromech droid Torch managed to escape the capital ship by themselves."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the events of the Amaxine warrior crisis in 28 ABY, former New Republic Senator and Princess Leia Organa founded the Resistance, a paramilitary organization dedicated to protecting the New Republic from external threats. The Resistance was joined by several former Rebel Alliance veterans who shared Leia's views that the First Order, a remnant of the \"Old Empire\", posed a threat to the New Republic and the galaxy. They believed that the Galactic Senate was not taking the First Order seriously."}, {"tag": "p", "text": "One former Rebellion veteran who joined the Resistance was Venisa Doza. Despite loving her husband Captain Imanuel Doza and their daughter Torra, Venisa left her home because she wanted to protect the galaxy and her family from the First Order. For the next six years, Venisa would rendezvous with her husband and daughter in space on Torra's birthday to spend time as a family together. During this time, Venisa had several adventures on Bakura and Lehon, and even escaped the rogue First Order Security Bureau Agent Terex."}, {"tag": "p", "text": "Following the Hosnian Cataclysm, Torra and Captain Doza joined the Colossus resistance led by Kazuda Xiono and Jarek Yeager, which expelled the First Order from the Colossus refueling platform. However, they were forced to take the refueling platform and its population into hyperspace, leaving the planet Castilon behind. Though the First Order was still hunting for the station, Imanuel and Torra resolved to continue their family tradition."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "To initiate contact with Venisa, Captain Doza activated a nearby signal beacon in deep space. However, their transmission were picked up by Commander Pyre and First Order Security Bureau Agent Tierny's Resurgent-class Star Destroyer, which tracked down the Colossus and launched several TIE fighters against the station."}, {"tag": "p", "text": "The Colossus' turbolaser cannons and Ace Squadron, including Xiono's Fireball, engaged in a dogfight with the First Order, shooting down several TIEs. Xiono was pursued by a TIE fighter which was shot down by Torra's Blue Ace. However, the space station's deflector shields began to take damage from the enemy attack. With the station and its inhabitants in danger, Yeager and Torra convinced a reluctant Captain Doza to order a retreat. After the Ace starfighters returned to their hangar, the Colossus fled into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Due to Captain Doza's difficult decision, the Colossus was able to escape into hyperspace. Though the First Order failed to capture the refueling platform, they managed to capture Venisa, her astromech droid Torch, and their X-wing starfighter when they arrived immediately after the station's departure. However, Torch successfully played dead and freed Venisa from her cell. During her brief imprisonment, Doza befriended Tamara Ryvora and managed to convince the young First Order TIE Fighter Pilot cadet to reappraise her motivations for joining the First Order. Venisa and Torch subsequently escaped after severely damaging a hangar bay and destroying several parked TIE fighters."}, {"tag": "p", "text": "Torra and Imanuel were despondent by the failed reunion. After learning about Venisa, Xiono managed to convince Torra to reconsider her plan to rescue her mother. To cheer Torra up, Xiono and the other Aces baked her a jelly cake with a gorg inside. Imanuel was heartened that his Aces were supporting his daughter in a difficult time. Father and daughter also spent quality time together while reflecting on Venisa's commitment to the Resistance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish by a signal beacon first appeared in the Star Wars Resistance Season Two epsiode \"Rendezvous Point\", which first premiered on Disney XD on November 24, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}