{"url": "Skirmish_above_Raydonia/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Battles in the Belsmuth sector", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Skirmish above Raydonia"}, {"tag": "p", "text": "The skirmish above Raydonia was a short duel above the planet of Raydonia that took place during the Clone Wars."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Obi-Wan Kenobi landed on Raydonia, to see horrid corpses and destroyed buildings, before seeing Darth Maul—the Sith Lord whom Kenobi thought he had killed—in person. Remembering when they dueled, long ago, Kenobi activated his lightsaber, only to have Savage Opress—Maul's brother—ambush him and deliver several punches and kicks against Kenobi, knocking him unconscious."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "Obi-Wan Kenobi was tortured by Darth Maul and Savage Opress aboard their ship. Asajj Ventress, meanwhile, snuck aboard their ship as it took off from the planet of Raydonia. After the ship was airborne, Ventress revealed herself to the two brothers before disappearing, confusing them before they knocked Kenobi out cold and began searching for Ventress, leaving Kenobi in the cargo hold. Moments later, Ventress managed to wake up the unconscious Jedi and temporarily handed over one of her lightsabers before the brothers returned, preparing to battle."}, {"tag": "p", "text": "With one of Ventress' lightsabers, Kenobi managed to use the Force to take his lightsaber from a furious Darth Maul, passing Ventress' lightsaber back to her, as he noticed that she was starting to lose from her battle with Savage Opress. Then, Maul and Obi-Wan climbed to a dark section of the cargo hold, and the two dueled furiously. Although Obi-Wan initially held the upper hand, Maul began to taunt Obi-Wan about Qui-Gon Jinn's death, infuriating and unbalancing him, causing him to use aggressive forms of lightsaber combat, but ended as Maul kicked Kenobi off the ramp. The duo switched places, with Kenobi battling Savage Opress and Darth Maul dueling with Asajj Ventress, ending with them retreating into the escape pod successfully, forcing Maul to use a ray shield to close the door, leaving him and his brother alone."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Maul, after witnessing the escape of his foes, vowed that after having waited over a decade to get revenge against the Jedi, he could wait a little longer. Meanwhile, Ventress and Kenobi concluded that it was not over, and that Maul and Opress would be after both of them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}