{"url": "Skirmish_at_the_Coruscant_Livestock_Exchange_and_Exhibition", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battle stubs", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Skirmish at the Coruscant Livestock Exchange and Exhibition"}, {"tag": "p", "text": "This skirmish took place in 43.5 ABY, during the Coruscant Livestock Exchange and Exhibition at the Grand Event Center on Coruscant. Han Solo and Leia Solo, their daughter, Jaina, granddaughter Allana, and Jedi Knights Natua Wan and Radd Minker attended the show a few days into its running. After ditching the journalist Javis Tyrr as they entered the Dangerous Animals level, the group was viewing the animals when the Solo women felt a disturbance in the Force."}, {"tag": "p", "text": "They found that Wan was missing, and the lights in the area suddenly went out. Wan, who had become afflicted with the same psychosis that had overcome Valin Horn, Seff Hellin, and Horn's sister Jysella—a psychosis that caused the affected being to believe that every un-afflicted being they knew had been replaced by an impostor—hoped to kill the \"impostors\" and cover her escape by releasing the animals present from their cages. Leia was forced to kill all five boarwolves to save a young boy who had fallen into their pen, before the mother nexu had clamped down on an Ithorian's leg. Organa Solo stabbed the beast just as the ramps stopped retracting."}, {"tag": "p", "text": "While pandemonium flooded the facility, Jaina Solo began a lightsaber duel with Wan, who was emptying a bordok cage. Organa Solo and Minker soon joined in the fight, with Minker ending it with a head-butt which left Wan unconscious. Wan was taken into custody in the Jedi Temple, but increased Galactic Alliance pressure on the Jedi to turn their captive psychotic Knights over to the government led to the Knights being evacuated from the Temple and taken off-world to Shedu Maad."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}