{"url": "Skirmish_in_the_Tingel_Arm", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Great Galactic War"], "nodes": [{"tag": "h1", "text": "Skirmish in the Tingel Arm"}, {"tag": "p", "text": "In 3681 BBY, a skirmish occurred between the ancient Sith Empire and the Galactic Republic upon the Empire's return to known space. After hiding in the Unknown Regions for centuries following their defeat in the Great Hyperspace War, the Sith rebuilt their Empire and readied for war against the Republic. Led by a Dark Lord known as the Sith Emperor, Imperial battlecruisers appeared on the fringes of the Tingel Arm. The Republic dispatched a diplomatic convoy to meet the warships and discern their intent, but the convoy was quickly destroyed by the Sith forces. This battle was the first in the devastating Great Galactic War, which dragged on for twenty-eight years and eventually enveloped the galaxy."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the end of the Great Hyperspace War between the Galactic Republic and the Sith Empire, the galaxy at large believed the Sith to be extinct. In truth, one of the Empire's few surviving Sith Lords had fled to Dromund Kaas in the Unknown Regions to build a new Sith dominion in secrecy, planning to one day return and destroy the Republic. The Republic, meanwhile, operated in ignorance of the surviving Sith Empire, enjoying peaceful expansion that was occasionally interrupted by various conflicts instigated by claimants to the Sith title."}, {"tag": "p", "text": "In 3681 BBY, the rebuilt Empire's leader, known as the Sith Emperor, believed his preparations for the return of the Sith Empire to the galaxy were complete. A number of Harrower-class dreadnaughts traveled to the fringes of the Tingel Arm, a far reach of Republic space. The Republic was informed of their appearance but was unaware that the vessels belonged to its ancient nemesis. To discern the intent of the mysterious fleet, a convoy of Republic diplomats, escorted by a small starfighter squadron, was sent to rendezvous with the battlecruisers."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "The diplomats arrived in the Tingel arm and were greeted by the fleet of battlecruisers. The diplomats' transport began transmitting images of the fleet back to the Republic, but the transmission was cut off when the battlecruisers opened fire. The entire Republic force was annihilated by the Imperial ships, resulting in the loss of hundreds of Republic lives."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The skirmish in the Tingel Arm ignited a galaxy-wide conflict known as the Great Galactic War. Public knowledge of the attack was not known until after the Battle of Korriban, but the video of the Empire's return incited fear and uncertainty when it was finally broadcast. With their Empire revealed to the galaxy, the Sith began a ruthless campaign of conquest throughout the rest of the Outer Rim Territories. The Emperor's forces immediately invaded the Aparo sector, seizing control of it and much of the remaining Tingel Arm. After a delayed response to the seizure of the Aparo sector, the Republic Military was pushed out from the Tingel Arm and forced to operate on the defensive for the remainder of the twenty-eight–year–long war. Following the end of the war with the signing of the Treaty of Coruscant, the Kel Dor Jedi Master Gnost-Dural made a holorecord of the events surrounding the beginning of the Great Galactic War, including the skirmish in the Tingel Arm. The journal of Master Gnost-Dural also contained a first-hand account of the Kel Dor's experiences upon learning of the skirmish; the work was one of the first added to the new Jedi Archives on Tython during the Cold War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish in the Tingel Arm was first introduced in Onslaught of the Sith Empire, the sixth installment of the Galactic Timeline. The timeline is a series of web videos presented as historical accounts on the history behind the BioWare computer game Star Wars: The Old Republic; the installments are made available on the game's official site and are narrated by Jedi Master Gnost-Dural, who is voiced by actor Lance Henriksen. The skirmish was later mentioned in The Journal of Master Gnost-Dural, which was released in December 2011 as part of the Star Wars: The Old Republic collector's edition."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}