{"url": "Skirmish_near_Ashteri%27s_Cloud", "categories": ["Category:Legends articles", "Category:Battles in the Outer Rim", "Category:Lost Tribe of Sith emergence"], "nodes": [{"tag": "h1", "text": "Skirmish near Ashteri's Cloud"}, {"tag": "p", "text": "In 44 ABY, a skirmish took place near Ashteri's Cloud. The Rockhound, carrying Jaina Solo and Lando Calrissian, was sabotaged by Sith pirates. Solo flew out in her StealthX and confronted the Sith; however, when she used the Force to guide her shadow bombs, the Sith were able to track her and fire on her, causing her to take heavy damage. She still managed to destroy the skiffs they sent after her while Calrissian found and destroyed the droid that had sabotaged the Rockhound, and they escaped into hyperspace."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the completion of their mission to assist Luke Skywalker in his dealings with the Lost Tribe of Sith and in confronting Abeloth in 44 ABY, Jaina Solo and Lando Calrissian left Abeloth's planet in Calrissian's Colossus I Beta Series asteroid tug, the Rockhound, to report to the Jedi on Coruscant. However, the Sith had managed to get an mouse droid on board, programmed to sabotage the vessel. As such, the Rockhound came out of hyperspace far off-course, near Ashteri's Cloud."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "After discovering the presence of the sabotage droid, Solo and Calrissian deduced that they were under attack by pirates. Solo flew out in her StealthX to confront the pirates, finding that their forces consisted of an S18 light freighter and BDY crew skiffs. She hailed them and warned them to turn away immediately, and when they neglected to comply, Solo fired a shadow bomb at one of the skiffs. The bomb destroyed the crew cabin, but her use of the Force to direct the bomb informed the attackers where she was, and they opened fire on her craft."}, {"tag": "p", "text": "Solo's shields overloaded, and her R9-series astromech droid, Rowdy, reported that the signal had come from the light freighter. As soon as she launched the next shadow bomb and began to guide it through the Force, however, the Sith found her again and opened fire on her once more, causing her to lose her grasp on the shadow bomb. Rowdy reported that the StealthX's maneuverability was limited and that their shields had not yet come back online, and Solo decided to launch the next shadow bomb. Again they opened fire on her, but she remained in control of the bomb, and at least twenty-four of the attackers died in the resulting explosion. Solo finally realized that the pirates were tracking her by her use of the Force"}, {"tag": "p", "text": "Still, Solo ordered decided to launch her final shadow bomb. As the targeted skiff rolled to try and bring its weapons to bear, Solo flew her StealthX right under the Rockhound's belly, staying in her target's efflux trail. The bomb hit its target, and Solo contacted Calrissian, who reported that he had found and destroyed the sabotage droid aboard the Rockhound. Solo requested that he have his protocol droid, Ornate, begin plotting a hyperspace jump course immediately, and to jump as soon as it was ready. She managed to land her StealthX in the Rockhound's hangar before the vessel jumped to safety."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Solo and Calrissian contacted Jedi Knight Jaden Korr, who had been investigating pirate activities, and drew up a map of ships that had been pirated in similar situations to theirs—a port call followed by the disappearance of the ship in question, with no survivors, bodies found, or wreckage. They found hundreds of such situations, and when they reported to the Jedi Council on Coruscant, the Jedi realized that the Lost Tribe of Sith was preparing a war fleet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}