{"url": "Baralou", "categories": ["Category:Legends articles", "Category:Baralou locations", "Category:Baralou system planets", "Category:Type I atmosphere planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Baralou"}, {"tag": "p", "text": "Baralou was the first planet of the Baralou system. It was a warm, wet world home to two native sentient species, the Krikthasi and the Multopos, along with many aquatic species and poisonous plants. The world was nearly completely covered by oceans with only several chains of small islands above water. The planet's four moons caused violent storms and had a tremendous influence on the tides, sometimes resulting in tidal shifts of over fifty meters."}, {"tag": "p", "text": "Baralou contained many mineral and natural resources. The internal pressures of the planet formed a tremendous amount and variety of gemstones. Rubies, sasho gems, kuggerags, diamonds, and jasse hearts were just a few of the gemstones that could be found on most of the islands. Most islands had a large amount of plant growth, most of which was special in two ways. First, the plants and trees had very deep reaching root systems to anchor against the tidal waves and tides. Second, most plants, including the native fruits and vegetables, bore at least traces of poison that affected most non-natives."}, {"tag": "p", "text": "Baralou's oceans teemed with aquatic life. Many primitive plants grew beneath the waters, including bestrum algae and various aquatic grasses. Brightly colored fish could be found everywhere. Some species of note were the treppok and grotseth."}, {"tag": "p", "text": "The two native populations, both stone age cultures, did not enjoy good relations. The amphibious Multopos, while friendly to traders, were traditional enemies of the undersea dwelling Krikthasi."}, {"tag": "p", "text": "The Alliance to Restore the Republic had a small presence on the Baralou in the form of Aqualis Base, which provided many foodstuffs for the Alliance."}, {"tag": "p", "text": "The Aqualis Food Conglomerate operated on the planet as well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}