{"url": "Skirmish_near_the_Sun_Palace", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Odra crisis"], "nodes": [{"tag": "h1", "text": "Skirmish near the Sun Palace"}, {"tag": "p", "text": "The skirmish near the Sun Palace was an altercation that occurred during the Odra crisis on the Forest Moon of Endor in 3 ABY. The fight pitted four Ewoks from Bright Tree Village against a small number of Iceheads from the Snow Palace. The Ewoks' objective was to reach the Sun King's palace, where they hoped to aid the Coalition of the Freezing. The Iceheads' goal, on the other hand, was to capture the Ewoks and bring them back to the Snow King."}, {"tag": "p", "text": "The skirmish took place aboard the Ewoks' flying leaf and on the ground. Due to a stratagem used by Wicket W. Warrick, two of the Iceheads fell from the leaf and were chased away by a snow monster. Nevertheless, Princess Kneesaa a Jari Kintaka also fell from the leaf and was captured by two other Icehead soldiers. They returned with her to the Snow Palace, and the remaining Ewok forces pursued them to rescue her."}, {"tag": "h2", "text": "Buildup"}, {"tag": "p", "text": "The skirmish occurred during the Odra crisis on the Forest Moon of Endor. Odra, a Frost Sprite noble, had seduced the Snow King, a wizard who controlled the moon's weather along with three other magic-users. At Odra's urging, the Snow King had stolen a force artifact called the season scepter from his brother, the Snow King. The victim of the robbery had formed a coalition with two other weather-altering wizards on the moon: the Flower Queen and the Leaf Queen. The four had sent for help from the Ewok Logray, shaman of Bright Tree Village. They got four young Ewoks instead: Princess Kneesaa a Jari Kintaka, Latara, Teebo, and Wicket Wystri Warrick. The four took the Leaf Queen's flying leaf in Logray's stead and headed to the coalition's base at the Sun King's palace."}, {"tag": "p", "text": "Meanwihle, Odra and the Snow King watched the Ewoks' progress via a magic mirror. Surmising that the Ewoks might be carrying Logray's powerful Sunstar, the pair seized the moment. The Snow King sent a troop of his Icehead soldiers to intercept the Ewoks and bring them to the Snow Palace."}, {"tag": "h2", "text": "Altercation"}, {"tag": "p", "text": "The Iceheads traveled to the vicinity of the Sun King's palace and hid behind snow-covered bluffs. As the Ewok leaf came within eyeshot of the palace, the Iceheads attacked."}, {"tag": "p", "text": "Two of the insurrection soldiers mounted the leaf and wrestled with the Ewoks, knocking Kneesaa from the conveyance and into the snow. Warrick attempted to throw off the attackers by pulling on the leaf's stem. This sent the conveyance zigging and zagging erratically and into a cavernous tunnel. As it emerged at the opposite end, a snow monster had joined the combatants on the leaf. Apparently enraged by the new company, the snow beast attacked the two leaf-riding Iceheads and wrestled them to the snows below. Nevertheless, the Ewoks lost control of the flying leaf, which careened dangerously above, atop, and into the snow fields. It finally crash landed into the snow."}, {"tag": "p", "text": "On the ground, the beast pursued the two Iceheads into the snow fields, removing them from the skirmish. Meanwhile, two other insurrection soldiers subdued the princess. They escaped the fracas and headed back to their base."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Iceheads returned to the Snow Palace with their captive, who refused to cooperate. Meanwhile, the other Ewoks traveled to the Sun King's palace for further orders. They were tasked with rescuing their friend and retrieving the season scepter. After infiltrating the enemy base, the Ewoks faced off against insurrection forces in the skirmish at the Snow Palace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}