{"url": "Skirmish_in_the_Ruby_Nebula", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Occupation of Karthakk"], "nodes": [{"tag": "h1", "text": "Skirmish in the Ruby Nebula"}, {"tag": "p", "text": "The Skirmish in the Ruby Nebula was an attempt by the Trade Federation to capture Reti, a member of the Lok Revenants who attempted to meet Jedi Master Adi Gallia. When Reti met Gallia, the Jedi realized that Reti had been followed, much to his surprise."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Worried about the approaching conflict, the Jedi Council sent Jedi Master Adi Gallia to investigate illegal Trade Federation activity in the Karthakk system. To that end, she set up a meeting with an informant from the Lok Revenants."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Reti and Gallia fought wave after wave of Vulture droid starfighters, soon followed by Scarab-class droid starfighters, all the while conversing about meeting Nym, the leader of the resistance. Soon a C-9979 landing craft arrived and threatened the two, ordering them to stand down and surrender themselves. Adi Gallia then picked up a spy ship on her sensors, much to Reti's shock; he was worried about how long it had been hiding inside the nebula. The two attacked and destroyed it before it could escape into hyperspace. They then attacked the C-9979 landing craft until its shields were drained. In an attempt to expose the two, the crew of the landing craft launched three data pods that would have information about both Gallia's and Reti's ship IDs. The two pilots destroyed all three data pods, then finished off the landing craft and any remaining starfighters."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Adi Gallia was a bit proud about her Delta-7 starfighter, as this skirmish helped it pass its first combat test. Reti on the other hand, didn't know it, but the fact that he was followed had saved him. Jango Fett was hiding in the Nebula waiting for a chance to capture Reti, who had a price on his head. With the Trade Federations interference, Jango decided to jump into hyperspace. He would get another opportunity to try to capture Reti at the Battle of Nod Kartha. Meanwhile, Reti would lead Master Gallia to Nym and the three would join forces to drive the Federation from the system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This article was created based on the first mission in the video game Star Wars: Jedi Starfighter. The bonus objectives are to destroy the spy ship and data pods, respectively."}, {"tag": "h2", "text": "Appearances"}]}