{"url": "Skirmish_in_Theed/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Naboo", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Skirmish in Theed"}, {"tag": "p", "text": "A skirmish in Theed occurred between the Galactic Republic and the Confederacy of Independent Systems during the Festival of Light on Naboo."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Phindian criminal Moralo Eval hatched up a plot to kidnap the Supreme Chancellor of the Galactic Republic Palpatine. Therefore, with Sith Lord Count Dooku's help, he recruited some of the deadliest bounty hunters in the galaxy including Cad Bane and Rako Hardeen who was actually Jedi Master Obi-Wan Kenobi in disguise attempting to stop the plot. The bounty hunters were tested in a machine known as the Box. Five bounty hunters survived the box: Cad Bane, \"Rako Hardeen\", Embo, Twazzi and Derrown. However, despite promising Eval the lead role, Dooku assigned Bane to be the leader of the team much to Eval's dismay."}, {"tag": "p", "text": "The team discreetly transferred to Naboo where they took control of a mechanics shop after eliminating all the personnel there. Over there, Bane briefed the team on their duties: Twazzi and Embo were to act as Senate Commandos for the chancellor as he will be attending the ceremony at a festival called the Festival of Light, Eval was the getaway driver, \"Hardeen\" would be the sniper that would be loaded with stun blasts to immobilize the chancellor, Derrown would pass through the ray shields due to his Parwan anatomy and Bane would be one of the spectators in the audience. He then brought out a holographic disguise matrix, disguising the rest of the four hunters (excluding Eval) as Senate Commandos. As the team departed, Dooku alerted Bane to \"Hardeen\", tasking him to keep a close on \"Hardeen\" as he suspected something wrong about him."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "h3", "text": "Bane's plan in action"}, {"tag": "p", "text": "Unknown to Kenobi, Dooku had bugged his briefcase that contained his sniper rifle. When Kenobi got to his position, a tower overlooking the plaza where Palpatine would give his speech, he contacted Jedi Master Mace Windu and alerted him to Bane's plan. As night fell and the festival started, Bane's plan was set in motion."}, {"tag": "p", "text": "Bane himself had disguised himself as a Neimoidian spectator and was seated in the platform where the chancellor gave his speech, the platform that was enveloped in a ray shield. While Palpatine gave his speech, Derrown, disguised as a Senate Commando secretly approached one of the speech generators. Kenobi spotted him and alerted Mace but it was too late. Before Skywalker could stop him, Derrown overloaded the generator and caused it to explode, dissipating the shield in the process. While Ahsoka led the audience to safety, Anakin engaged Derrown but was quickly knocked unconscious by the Parwan. However, Kenobi shot Derrown's jetpacks causing it to malfunction and sending Derrown spiraling towards the floor."}, {"tag": "p", "text": "Meanwhile, Twazzi used the disguise matrix and switched bodies with the chancellor whom Bane later grabbed. Anakin quickly regained consciousness and ran over to the speeder towards Embo and Twazzi, whom Skywalker believed was Palpatine. While Embo was arrested, Twazzi tried fighting her way out but Skywalker sliced her right arm off and demanded to know where the real Palpatine was. But by the time he found out, Cad Bane and Eval had already driven off with the chancellor."}, {"tag": "p", "text": "Kenobi spotted the hunters and chased them to a refinery, sending Mace and Skywalker the coordinates. However, Dooku didn't show up as planned so Bane decided to ransom Palpatine off themselves. Kenobi, however aimed a blaster at Bane, demanding he release the chancellor. Realizing \"Hardeen's\" betrayal, Bane attacked him but after a short struggle, Kenobi overpowered Bane and Republic forces, led by Windu and Skywalker arrived. Windu revealed \"Hardeen\" to be Kenobi, angering Bane. As the fugitives were led away, Windu congratulated Kenobi, believing it to be all over."}, {"tag": "h3", "text": "Dooku's plan in motion"}, {"tag": "p", "text": "Despite the apparent success of the mission, Anakin was furious that the Jedi Council kept it a secret from him, and became outraged when Kenobi revealed that the idea to do so had been his. Anakin then sarcastically asked if the Jedi present if they had truly foiled Dooku's plot before storming away. This remark troubled Kenobi, and made him reconsider the fact that Dooku hadn't shown up at the rendezvous point. Suspicious, he returned to the tower where he had shot Derrown and inspected his briefcase. After thorough inspection, he found an activated com link and realized that Dooku had been listening to his entire conversation. This meant that Dooku had known that Hardeen was Kenobi all along, and meant too that the mission had been compromised."}, {"tag": "p", "text": "That night, with the Republic security forces having been sent back to Coruscant, Palpatine and Anakin took a walk through the palace. Palpatine broached the subject of the council's scheme with Anakin, commenting that the brilliant plan had to have been Anakin's idea. However Anakin, still bitter over what he perceived to be a betrayal by Kenobi and the Council, stated that he had been kept completely in the dark. Palpatine used the opportunity subtly needle the Council's actions as they entered the stately hall where the banquet was supposedly taking place. Instead of a banquet however, they instead came face to face with Dooku himself, flanked by two MagnaGuards. Dooku revealed that he had never intended for the other bounty hunters to kidnap Palpatine; he had simply been using them as a diversion so he could launch his own kidnapping plot. With only Anakin left to protect Palpatine, Dooku asserted that he could easily kidnap the Chancellor, and had his MagnaGuards attack Anakin. With the Council's perceived betrayal still in the forefront of his mind, Anakin engaged the MagnaGuards, quickly and brutally destroying them both before instructing Palpatine to flee. However, the chancellor was intercepted by a third MagnaGuard as Anakin viciously attacked Dooku and rapidly drove him back. Overwhelmed by Anakin's strength, Dooku attempted to use the Force to stave the Jedi off, telekinetically blasting him back a short distance before using the Force to fling various bits of cutlery and a chair at his infuriated opponent. The small barrage of items did nothing but enrage Anakin further, and he attacked Dooku with renewed fury. Dooku managed to intercept a thrust from Anakin by telekinetically moving a chair in front of him, but could not hold his ground against Anakin's assault. As Anakin pressed his attack, Palpatine risked displaying a satisfied smirk at the power of his apprentice-to-be, though neither Dooku nor Anakin spotted it. Anakin pushed forward against the chair that had intercepted his attack, nearly driving his lightsaber through Dooku's skull before the Sith Lord managed to hit Anakin with another telekinetic blast. However the attack had virtually no effect on Anakin, and he quickly re-engaged the now visibly shaken Count."}, {"tag": "p", "text": "As the duelists began to ascend a flight of stairs, Anakin kicked Dooku in the abdomen, knocking him to the ground. Before the Count could regain his feet, Anakin fell upon him with a series of overhand power blows, pressing him into the stairs before reaching out to snag Dooku's throat with his mechanical hand. Holding off Dooku's lightsaber with his own, he began to throttle Dooku, drawing another delighted grin from Palpatine. However, Dooku managed to escape the choakhold by shocking Anakin with Force lightning and telekinetically blasting him backwards. With Anakin momentarily stunned, Dooku and the MagnaGuard that held Palpatine retreated. Kenobi, who had meanwhile caught wind of Dooku's plan, reached Anakin mere moments after the latter had been blasted away. The two of them caught up with Dooku just as he boarded his ship. As Anakin re-engaged Dooku, Kenobi quickly dealt with the remaining MagnaGuard before retrieving Palpatine. Thwarted, Dooku pushed Anakin off the boarding ramp of his ship and fled, but not before remarking that Kenobi had proven himself a 'worthy adversary'. Later, Palpatine commented on how the Jedi saved him twice and what the galaxy would be like without the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}