{"url": "Skirmish_in_the_Operations_Hangar", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Skirmish in the Operations Hangar"}, {"tag": "p", "text": "A skirmish took place in 44 ABY in the Operations Hangar of the Jedi Temple on Coruscant. After being relieved of his duty by the Jedi Council, former acting Grand Master Kenth Hamner attempted to prevent a wing of StealthXs from launching to assist Luke Skywalker in dealing with the Lost Tribe of Sith, in fear that it would start a war between the Jedi and the Galactic Alliance; the latter being unaware of the Sith threat and thus believing that the wing was aimed at the government. Hamner was confronted by Jedi Master Saba Sebatyne, who tried to stop him from preventing the launch. She defeated Hamner and sent him tumbling over a catwalk, catching him in the Force. However, he threw his lightsaber toward the hangar bay controls, and while she wrestled with him for control of the weapon, she lost her grip on Hamner. Sebatyne caught the lightsaber in the Force, allowing the StealthXs to launch, but Hamner fell to his death."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 43.5 ABY, several Jedi Knights began to succumb to a Force psychosis, causing strained relations between the New Jedi Order and the Galactic Federation of Free Alliances—the Jedi wanted their Knights available for study, while the Galactic Alliance demanded the Jedi to turn over all afflicted Knights into government custody to be encased in carbonite. Meanwhile, exiled Grand Master Luke Skywalker discovered a new Sith Tribe preparing to launch an invasion of the galaxy. The Jedi Order decided to mobilize a flight of StealthXs to help him, but were prevented from doing so by a Mandalorian raid on the Jedi Temple, the ensuing Galactic Alliance blockade of the Temple, and finally a Mandalorian siege—each ordered by Galactic Alliance Chief of State Natasi Daala in order to force the Jedi to hand over the psychotic Knights. Meanwhile, interim Grand Master Kenth Hamner secretly struck a deal with Alliance Admiral Nek Bwua'tu to ensure the Navy's cooperation with the Jedi launch, so long as Hamner waited until Bwua'tu told him he could launch."}, {"tag": "p", "text": "Meanwhile, the afflicted Jedi suddenly recovered, and Daala was forced to lift the siege. However she decided not to release Valin and Jysella Horn from carbonite until the order surrendered to her will. The Jedi Council argued over what to do next, with most of the Masters favoring the launch of the StealthXs, and attacking the GA prison for the Horns were kept, but Hamner shot down the proposals—after an assassination attempt on Bwua'tu, the Admiral had been in a coma, and Hamner feared launching the wing without Bwua'tu's word. However, Bwua'tu had not kept the deal a complete secret, and word eventually traveled to Han Solo and family from Senator Luewet Wuul. When Solo revealed to the Council that Hamner had struck a deal with Bwua'tu, the Council felt betrayed and relieved Hamner of his duties, confining him in his quarters. Hamner soon escaped and made his way to the Operations Hangar, where he found the Jedi preparing to launch the starfighters. Fearing the launch to be suicide with the Galactic Alliance Sixth Fleet waiting in orbit—as well as treason against the Galactic Alliance—Hamner decided that he needed to stop it no matter the cost. He incapacitated Yantahar Bwua'tu and Vaala Razelle, the two Jedi Knights guarding the hangar, then made his way inside and confronted Master Saba Sebatyne, who was directing the procedures."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "Hamner tried to convince the Jedi present that their actions constituted treason, and severed a tradition of the Jedi protecting the government that went back 25,000 years. The Masters remained against him, however—even the newest Council member, Barratk'l, who Hamner had not long ago believed was his strongest supporter, turned against him. Master Kyle Katarn offered him a chance to step aside, saying that he understood the pressure Hamner had been under, but Hamner used the Force to bring a staircase crashing to the hangar floor. He refused to let the Jedi launch the fighters, and Sebatyne ordered Kyp Durron and the other Masters to continue with the launch while she stopped the former Grand Master."}, {"tag": "p", "text": "Hamner, meanwhile, had sprinted along the catwalk to the mag-lev generators in an attempt to cut their power supplies and prevent the wing from launching. Sebatyne rushed after him and was ambushed by the former Grand Master. He pushed her with the Force over the side of the catwalk railing, but she caught herself with her tail. Again she ran after Hamner, convincing herself that he had not meant to almost kill her; and she sensed Master Cilghal in the Force, blocking out the balcony exit in an attempt to trap Hamner. Sebatyne found him not going after the generator power feeds, but rather the relay box controlling the magnetic seal between the doors which if tampered with would stall the launch indefinitely. She knocked him away with the Force, then caught him and pulled him back onto the catwalk."}, {"tag": "p", "text": "Hamner quickly ignited his lightsaber and attacked Sebatyne. The Barabel Jedi Master fended off his attacks and pinned him against a safety rail, but he continued his attack, and Sebatyne realized that although she was not prepared to kill him, he was willing to do whatever it took to stop the launch. Hamner managed to knock her away, and as she tumbled down the catwalk, he tried to push her over the edge, but she used the Force to counter his efforts. When Sebatyne stopped her roll, Hamner again attacked her with the Force, trying to shake her loose from the railing, but she steadied herself in an intersection. When Hamner realized that the launch was about to occur, he moved in quickly to finish her off. He Force-pushed her back, but she spun and knocked him down with her tail. As they both regained their balance, they began to duel for control of the intersection."}, {"tag": "p", "text": "Hamner at first kept her off balance, but Sebatyne refused to give ground, knowing that if she did so, he would simply hurl his lightsaber into the relay box and stop the launch. Hamner was suddenly distracted by Sebatyne's chronometer as it showed only thirty seconds to launch, and she took the opportunity to press the attack, pushing him backward. Hamner grew desperate and head-butted her armored throat, and as Sebatyne countered with a knee to the groin, he managed to stab her in the abdomen with his lightsaber. She tried to prevent Hamner from moving to the relay box, but he easily broke free from her grasp, so she decided to reinforce his own attempt to break away with an extra Force shove that sent him tumbling over the safety rail after his lightsaber cut through. Sebatyne managed to catch him with the Force. In the last seconds before the launch Saba again tried to persuade Hamner to give up but Hamner locked his lightsaber on and threw it at the relay box, directing it with the Force. She reached out and struggled for control of the weapon, fighting Hamner's grasp on it, but as she did so, she lost control of Hamner himself. Sebatyne stopped the lightsaber, sending it flying into one of the hangar's turadium blast doors, but Hamner dropped the remaining thirty meters to the deck to his death. Luke Skywalker also felt his death on Pydyr when hunting Abeloth."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The StealthX wing successfully launched, and due to the Jedi's plan with Booster Terrik in the Errant Venture and his Tendrando Arms Celebrity Sabacc Charity Challenge—which stalled Galactic Alliance units in orbit—managed to leave Coruscant unharmed. The StealthXs, along with the Errant Venture, reached Skywalker on Pydyr and helped him fight off the Sith there."}, {"tag": "p", "text": "While Sebatyne recovered from her wounds, she was very shaken over her failure to save Hamner's life. Daala contacted the temple and demanded to speak to Hamner but Saba made it clear that he was unavailible and that the jedi are no longer at her mercy. However, the Council still supported her, and they unanimously appointed her as interim Grand Master in Hamner's stead—a role which she very reluctant to accept, and only took on at their continued insistence, stating that when Master Skywalker returned, she would be judged for her actions. She then decided that their next move needed to be to remove Daala from the office of Alliance Chief of State. Hamner was later given a funeral by the Jedi, during which his former apprentice, Izal Waz, lighted his body on the funeral pyre."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish first appeared in Fate of the Jedi: Vortex, the sixth installment in the nine-part Fate of the Jedi series, written by Troy Denning and released November 30, 2010. The event served to kill the established character of Kenth Hamner, who had been first introduced ten years previously in James Luceno's second novel in The New Jedi Order series, The New Jedi Order: Agents of Chaos II: Jedi Eclipse."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}