{"url": "Skirmish_on_Aduba-3", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Outer Rim"], "nodes": [{"tag": "h1", "text": "Skirmish on Aduba-3"}, {"tag": "p", "text": "The Skirmish on Aduba-3 was a small incident between spacers and Han Solo and Chewbacca in the town of Tun Aduban on Aduba-3."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A member of the Sacred Way, Pera was attempting to bury a cyborg pilot on Spacer's Hill near the town of Tun Aduban, but the spacers in the town were suspicious of cyborgs and attempted to stop him. Han Solo and Chewbacca, who had recently arrived on the planet, intervened to save Pera, who asked them to bury the cyborg instead. The two partners refused until the priest told them it was a tradition to give those who buried a spacer their last possessions, in this case a sack of coins. Upon hearing that, the two smugglers agreed to conduct the burial in Pera's place."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Solo and Chewbacca then started traveling through the streets on the bantha, carrying the deceased cyborg on a sled behind them. The various spacers stood to the side watching. Several bolder spacers began to throw rocks at the two, and Han and Chewie were drawn into a brawl. Pera appeared suddenly and fought with the two against the mob. Despite his respect for the living, Pera was able to join the fight. Chewbacca was pulling his punches as long as the other spacers were not using lethal means. One spacer attempted to hit Solo with a Sikurdian battle-axe and Han was forced to blast him. Chewie took that as a sign and started to use his bowcaster on the crowd. Eventually, the spacers withdrew and the three continued on their mission to bury the cyborg. The bantha had taken a stray blaster bolt in the fray, so Chewbacca carried the cyborg on his back up to the hill, where Pera led the burial ceremony. Solo and his Wookiee stood by and watched."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After Solo and Chewbacca buried the cyborg, they went their separate ways from Pera. The two smugglers were then approached in the cantina with a job offer, which would change the course of the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish first appeared in the seventh issue of the Marvel Comic book series. It is not to be confused with the Battle of Aduba-3, which liberates the planet from the Cloud-Riders."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}