{"url": "Skirmish_on_Batuu", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Battles in the Outer Rim", "Category:Conflicts involving the Galactic Empire", "Category:Conflicts involving the Grysk Hegemony", "Category:Imperial–Grysk conflict"], "nodes": [{"tag": "h1", "text": "Skirmish on Batuu"}, {"tag": "p", "text": "During the reign of the Galactic Empire, a skirmish broke out in Oga's Cantina on the planet Batuu between Grand Admiral Thrawn, Darth Vader, and a group of Darshi. The Darshi were hired by the Grysk to distract Vader and Thrawn whilst the Grysk evacuated Force-sensitive Chiss children from a house in Black Spire Outpost."}, {"tag": "h2", "text": "Beginning"}, {"tag": "p", "text": "The Imperial capital ship, Chimaera traveled to Batuu in order to uncover the cause and meaning of a disturbance in the Force sensed by Emperor Palpatine. As the Chimaera was above Batuu, Sensor officer Commander Hammerly detected four small transports above the planet in loose formation, and together with the six starships already on Batuu's surface, made for ten. Commodore Karyn Faro spoke with Hammery as the crew of the Chimaera attempted to gather as much information as they could on the vessels, deducing that they could be either small freighters or small warships. As the information gathering continued, two more ships exited hyperspace straight ahead from the Chimaera at a distance of 400,000 kilometers, which Hammerly deduced where a type of long-range heavy freighter at the least, bearing straight for Batuu. Faro believed that all of the unidentified vessels were headed for Black Spire Outpost, where Grand Admiral Thrawn and Darth Vader were investigating."}, {"tag": "h2", "text": "Battle in orbit"}, {"tag": "p", "text": "Hammerly discovered that the two new starships had arrived from over the Chimaera's shoulder on the same hyperlane that the Chimaera had arrived from. Shortly prior to a skirmish on Batuu between Thrawn and Vader against a group of Darshi, one of the heavy freighters headed towards Thrawn and Vader's position while the remaining vessels maintained orbit above Batuu. Vader ordered Commander Kimmund and his unit to intercept, examine, and engage the other heavy freighter."}, {"tag": "p", "text": "Shortly after the skirmish, Kimmund and his stormtroopers approached the heavy freighter in the Darkhawk, although the Grysk vessel was able to detect the Darkhawk and broke orbit. Defender Squadron One arrived and was able to prevent its escape by disabling the starship, and later chased away the other smaller transports."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Kimmund and his legion were able to capture several Grysk, which led to a brief skirmish in the Chimaera."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}