{"url": "Skirmish_in_the_Ancient_Crystal_Cave", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Dantooine", "Category:Battles of the Cold War (Galactic Republic–Sith Empire)"], "nodes": [{"tag": "h1", "text": "Skirmish in the Ancient Crystal Cave"}, {"tag": "p", "text": "Shortly after the Treaty of Coruscant, a skirmish took place in the crystal cave on Dantooine between several Jedi and a pair of Sith Lords. The Jedi group, led by Master Dar'Nala, disagreed with the treaty, and were attempting to destroy it, going against the beliefs of their order. The Sith, meanwhile, were using the situation to try to turn a promising young Jedi to the dark side. Both groups met in the crystal cave and a fight ensued. However, Dar'Nala's madness was eventually revealed to her followers, and this resulted in her death. This ended the confrontation."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the year 3681 BBY, the True Sith Empire returned from deep space and attacked the Galactic Republic and Jedi Order, seeking revenge for its defeat in the Great Hyperspace War. After a decade of success, the Empire's advance was halted and the war became a stalemate."}, {"tag": "p", "text": "In 3653 BBY, the Dark Council of the Empire stunned the Galactic Senate with an offer of peace. Although the Jedi Council urged caution, in the end the Senate chose to accept the Sith's offer. Diplomats from both sides convened on Alderaan to discuss the terms of a cease-fire. But the Sith weren't finished yet: an elite Sith army under the command of Darth Angral attacked and captured the Galactic capital of Coruscant. With the Sith threatening to destroy Coruscant, the Republic diplomats on Alderaan had no choice but the sign the uneven Treaty of Coruscant."}, {"tag": "p", "text": "While the majority of the Sith were satisfied with the treaty, there were many in the Republic who were upset with the uneven terms. One of these dissidents was a Jedi Master named Dar'Nala. Working with other Jedi and Republic soldiers who agreed with her, Dar'Nala orchestrated a series of events to make it look like the Sith were still attacking the Republic, and setting up Sith Lord Darth Baras to take the blame for the treaty's disruption."}, {"tag": "h2", "text": "Conflict"}, {"tag": "p", "text": "Baras, meanwhile, found out about Dar'Nala's manipulations after Angral confronted him and accused him of sabotaging his own treaty, and decided to use this to further his own goals. Baras and Angral would later travel to Dantooine to meet Dar'Nala and her supporters in the crystal caves. Dar'Nala arrived with Jedi Knight Fortris Gall, Republic Soldier Harron Tavus, and a Wookiee bounty hunter named Dalborra (who was under Dar'Nala's control). Dar'Nala and her party then attacked the Sith Lords and their bodyguards."}, {"tag": "p", "text": "Sometime into the fight, Jedi Knight Satele Shan arrived and joined the Jedi fighting. Baras then put his plan to corrupt Satele into action. He revealed to her that Dar'Nala, her own master, had been behind the disruption of the treaty, and called on Satele to join the Sith to protect the peace. While Satele refused to join the Sith, the revelation of the truth caused her to withdraw her support of Dar'Nala. She then advised Tavus to do the same, and he did."}, {"tag": "p", "text": "This turn of events infuriated Dar'Nala so much that she completely gave into the dark side. She then attempted to punish Satele by murdering Tavus, as she sensed that he and Satele were falling in love. But this move turned Gall against her as well, and her attempt on Tavus' life was thwarted. Dar'Nala then called upon Dalborra to kill Gall, but Dalborra had managed to break free of the fallen Jedi's control and killed her."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After Dar'Nala's death, Satele led the Tavus and Gall back to the Republic base on Dantooine. Dar'Nala's death ended the attempts to disrupt the Treaty of Coruscant and the peace it had brought would hold through."}, {"tag": "h2", "text": "Appearances"}]}