{"url": "Skirmish_in_the_Crustai_system", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Chiss Ascendancy"], "nodes": [{"tag": "h1", "text": "Skirmish in the Crustai system"}, {"tag": "p", "text": "In 27 BBY, a skirmish occurred between the Springhawk, a vessel of the Chiss Expansionary Defense Force's Picket Force Two, and a Vagaari plunder ship, along with its two fighter escorts. The plunder ship made its way into the Crustai system on the edges of the Chiss Ascendancy, where a Chiss sentry disabled its hyperdrive. The Springhawk, under the command of Chiss Force Commander Mitth'raw'nuruodo, quickly destroyed the fighters and approached the plunder ship. The commander boarded the Vagaari ship with his crew, secured the vessel, and found a large storage area full of treasure from various worlds. The Chiss then transported the plunder ship to the Crustai base, where the smuggler Dubrak Qennto helped Mitth'raw'nuruodo take an inventory of the treasure on the ship."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 27 BBY, Chiss Force Commander Mitth'raw'nuruodo of the Chiss Expansionary Defense Force's Picket Force Two impounded a light freighter, the Bargain Hunter, which was captained by smuggler Dubrak Qennto and crewed by Jorj Car'das and Maris Ferasi. The smugglers were brought aboard the Springhawk, a cruiser under the command of Mitth'raw'nuruodo—known to the smugglers by his core name: Thrawn. The Springhawk began to travel back to the Crustai base, Thrawn's headquarters. However, before it arrived, Thrawn was alerted to the presence of strangers in Chiss space and the Springhawk preformed a micro-jump that lasted less than a minute to confront the intruders."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "As the Springhawk returned to realspace, two small Vagaari fighters flew past the viewport, shooting laserfire and missiles. The fighters were protecting a Vagaari plunder ship whose hyperdrive had earlier been disabled by a Chiss sentry. The Vagaari were pirates that Thrawn had only heard about before, as they had never previously entered Chiss space. The fighters quit firing as they flew out of their optimum range, but they soon came back around for another pass, this time one on each side of the Springhawk. However, Thrawn had noticed a pattern in the fighters' shooting and was able to predict their next move. He shot the Springhawk's weapons at the fighters, hitting the port from which their missiles were just about to launch, detonating the missiles before they were ejected and exploding the fighters."}, {"tag": "p", "text": "The Springhawk then turned to the plunder ship in the background. The Vagaari ship fired four salvos of missiles at the cruiser, but the Chiss vaporized the missiles in midflight. The Springhawk then approached the plunder ship while Qennto, Ferasi, and Car'das returned to their quarters. Thrawn boarded the enemy ship with his warriors and attacked the Vagaari. Even though the Springhawk's bridge crew did not board with the others, they helped the boarding party by tracking the Vagaari combatants aboard the plunder ship with the Springhawk's sensors and informing the boarders where their enemies were, resulting in many Vagaari deaths."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Chiss secured the vessel within an hour, and two hours after that, Qennto, Ferasi, and Car'das were brought aboard the ship. A Chiss warrior led them through the dead bodies and other carnage to Thrawn, who told them that the Vagaari were slavers and pirates. He led them into a storage room filled with bins, cabinets, and treasure of all kinds: ingots, coins, gems, artwork. Thrawn had the vessel towed back to the Crustai base for further study."}, {"tag": "p", "text": "Later, Chiss Admiral Ar'alani arrived at the Crustai base with Thrawn's brother, Mitth'ras'safis. Ar'alani believed that Thrawn should not have attacked the Vagaari, because they had not yet done any harm to the Chiss Ascendancy itself, although they had attacked and enslaved many other species. Thrawn transported her, his brother, Car'das, and Ferasi to the Vagaari plunder ship. When they arrived, Thrawn took them on a tour of the ship. The Admiral was surprised to see Qennto in the treasure room and demanded to know what he was doing there. Thrawn explained that he was taking an inventory of the treasure and was choosing what he would like to take with him as payment. Ar'alani chose to stay and take an inventory herself while Thrawn tended to a report he had received of more Vagaari nearby."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish in the Crustai system first appeared in 2006's Outbound Flight by Timothy Zahn, but it was not given a name in the novel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}