{"url": "Skirmish_near_Almaran", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Elrood sector", "Category:Battles of Spreading the Rebellion campaign"], "nodes": [{"tag": "h1", "text": "Skirmish near Almaran"}, {"tag": "p", "text": "The skirmish near Almaran was a short engagement intended to draw ships away from the Imperial Task Force Vengeance."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "The skirmish erupted when Calamari Cruiser Liberty dropped out of hyperspace amidst the Imperial fleet in the Almaran system and immediately opened fire at the nearby CR90 corvette 1138. Within seconds, the Liberty had destroyed the much smaller vessel."}, {"tag": "p", "text": "The Imperial reaction was to power up the gravity well projectors on the interdictor cruiser Compellor, but before they were operational, Liberty made a hyperjump to the Goff system. The Imperial-class Star Destroyers Nemesis and Conqueror (forming Battlegroup Orion) alongside the Compellor were ordered to pursue the fleeing ship."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The skirmish itself was only a ruse by the Rebel Alliance to attract Imperial attention, and lure some ships into a trap in the Goff system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish was only seen in the cutscene following the reconnaissance mission on the Imperial fleet massing at Almaran and preceding the mission \"Ambush at Goff\" from the Balance of Power campaign of Star Wars: X-Wing vs. TIE Fighter."}, {"tag": "p", "text": "It is unclear how long the Rebels took to set the trap after gauging the enemy strength at Almaran, and since the Imperial fleet was on the move from the Elrood sector into the Airam sector through the Almaran hyperspace transit point it is even possible that the skirmish in fact took place elsewhere. During the cutscene, the Liberty passes no less than eight Imperial class Star Destroyers and opens fire on the only other ship present, a Corellian corvette. The Vengeance is nowhere to be seen and it is unclear who was in command of this Imperial fleet, although it was undoubtedly part of Admiral Senn's Task Force Vengeance. However, the Imperial fleet previously reconnoitered at Almaran consisted (besides the Vengeance) of only four Imperial-class Star Destroyers, two Victory-class Star Destroyers, and a plethora of smaller warships and freighters, including several corvettes that had already left the system by the time the mission ended. These ships had all been inspected and identified; the corvette 1138 and the interdictor Compellor had not been among them, but both Conqueror and Nemesis had. By the time of the attack, the Imperial forces had obviously reshuffled their deployment. (Two other ISDs appear later on in the campaign, but that still leaves two of the eight ISD seen in the cutscene unaccounted for.)"}, {"tag": "p", "text": "Curiously, the Liberty here is depicted as a wingless MC80 Star Cruiser, unlike in Return of the Jedi, where the ship was a winged cruiser."}, {"tag": "p", "text": "The name of the corvette is only heard in the cutscene when it identifies itself as \"Corvette One-One-Three-Eight\" in its distress call; alternatively, it could be One-One-Three-A. A number of Imperial corvettes appear throughout the campaign. They are named with 3-digit numbers indicating their flight group, followed by a dash and another number or letter indicating their position within the group. Examples are the corvette groups 688, 124 and 337 seen at Almaran (where individual ships were named 688-1, 688-2, etc.) and the corvette group 327 seen during their attack in the Mobetta system (327-A, 327-B, 327-C); in the latter case, 327-A was actually a Assassin-class corvette while 327-B and327 -C were regular Corellian corvettes."}, {"tag": "h2", "text": "Appearances"}]}