{"url": "Skirmish_near_Farboon", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles"], "nodes": [{"tag": "h1", "text": "Skirmish near Farboon"}, {"tag": "p", "text": "The Skirmish near Farboon was a minor skirmish that paved the way for Maarek Stele to be initiated into the Imperial Navy as a TIE pilot."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Admiral Mordon arrived near the Farboon system in his flagship and secured the area. Admiral Mordon was personally inspecting the planet Farboon when his shuttle came under attack by two Y-wings. His TIE escorts were destroyed and he broadcast emergency transmissions. During this event Maarek Stele who was test piloting a TIE Interceptor decided to check other frequencies and picked up the distress signal. Stele arrived in time to see Mordon's shuttle being pursued by the Y-wings who were trying to disable the shuttle. With the help of his experience as a Swoop pilot, Stele began to pursue and engage the Y-wings causing them to break their attack run on the shuttle to engage Stele's Interceptor. Soon two X-wings arrived and pursued Stele who opted to get as much distance from the Rebel fighters as he was simply no match for them. The Vengeance arrived to bring reinforcements. During which, one of the X-wings managed to score a hit on Stele's Interceptor disabling his sensors, forcing Stele to dip near Farboon's upper atmosphere which filled his ship with mist. By the time Stele managed to get back out into space. The Rebels had been driven of and the shuttle was saved. Stele managed to be located by the Vengeance and was brought back into the Hanger."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Stele was unaware that the shuttle he saved was carrying Mordon on board until Mordon interviewed Stele. Impressed by his intuition and untrained skill, Mordon decided to nominate Stele for training as a pilot for the Empire."}, {"tag": "h2", "text": "Appearances"}]}