{"url": "Skirmish_on_Concordia/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Mandalore sector", "Category:Battles of the Clone Wars", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Skirmish on Concordia"}, {"tag": "p", "text": "A skirmish took place in early 21 BBY during the Clone Wars when the Jedi Master Obi-Wan Kenobi was ambushed by warriors of the Death Watch, a splinter group of the Mandalorian society. Kenobi was escorting the Duchess of Mandalore, Satine Kryze, on a diplomatic mission to Mandalore's moon Concordia to confer with the local governor, Pre Vizsla. The Duchess was unaware of Vizsla's position as the Overlord of the local Death Watch. Vizsla had been conspiring with Count Dooku of the Confederacy of Independent Systems, who had been backing the Death Watch in an attempt to destabilize the pacifist government of the New Mandalorians."}, {"tag": "p", "text": "Kenobi was ambushed by Vizsla's men at a mining facility used by the Death Watch as a base. The Duchess came to his assistance, and this culminated in a large firefight which left several Mandalorian warriors dead or wounded. As the fighting continued, Governor Vizsla decided to go public with his position as the leader of the Death Watch and confronted Kenobi using his Mandalorian battle armor and a lightsaber known as the 'Darksaber'. Kenobi was forced to flee after Vizsla ordered his men to intervene in the duel, although he successfully extracted the Duchess back to Mandalore, where they departed to Coruscant on Satine's personal ship, the Coronet."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Mandalore's proposed neutrality"}, {"tag": "p", "text": "In approximately 730 BBY, a conflict broke out between the Galactic Republic and the Mandalorians that brought devastation to the Mandalore sector. While many of the warrior clans scattered, out of the ashes rose the New Mandalorian faction. Doing away with many of the old warrior codes the Mandalorians had historically followed, the New Mandalorians put forward the idea that the best opportunity for Mandalorian survival and prosperity would come through being peaceful, neutral, and tolerant. This movement, led by Satine Kryze by the time of the Clone Wars, based its values on those of pacifism and nonviolence. Kryze was installed as the Duchess of the new government, and a man named Almec was named the Prime Minister. Under their rule, those within their society who refused to yield to these reforms were banished to Mandalore's moon, Concordia. Following the start of the Clone Wars during the First Battle of Geonosis, Kryze formed the Council of Neutral Systems, an alliance of at least 1,500 star systems who wished to remain neutral in the war."}, {"tag": "p", "text": "The Governor of Concordia, Pre Vizsla, in the meantime, rallied the surviving members of the Death Watch. The Death Watch, a Mandalorian splinter group based on brutal violence and dishonorable actions, in contrary to the honorable True Mandalorians and New Mandalorians, expressed their distaste at Kryze's rule over Mandalore by vandalizing public places and committing terrorist acts. When the Clone Wars began, the group received support from Count Dooku of the Confederacy of Independent Systems. Dooku encouraged Vizsla to give the Galactic Republic a reason to send a military presence to Mandalore, which would cause the citizens of Mandalore to rebel with the support of Death Watch. Taking Dooku's advice, Vizsla sent a lone Death Watch saboteur to attack a Republic cruiser. The saboteur was subdued by the Republic forces onboard the ship. However, unwilling to submit to interrogation, the man chose to take his own life."}, {"tag": "p", "text": "In response to the incident, Jedi Master Obi-Wan Kenobi was sent to Mandalore by the Jedi Council on a diplomatic mission to reconfirm Kryze's neutral stance. Kryze and Almec assured Kenobi that no member of the New Mandalorian faction would ever take up arms against the Republic. Kryze suspected that the Galactic Senate was trying to intervene in Mandalorian affairs, despite the fact that the investigation was under orders of the Jedi Council."}, {"tag": "h3", "text": "Diplomacy to Concordia"}, {"tag": "p", "text": "A loyal member Death Watch armed a bomb in the Memorial Shrine in the capital city of Sundari, which detonated while Kenobi and Kryze were taking a stroll through the area. Kryze coincidentally revealed to Kenobi her growing concern of the recent resurgence of the Death Watch group, which she believed was just a group of \"hooligans\" who vandalized public places, moments before the explosion. Upon finding the mark of the Death Watch at the site, Kenobi assured Kryze that the Death Watch was more then a mere group of \"hooligans\" and that the terrorist bombing was a demonstration against her government. Kenobi ordered the area be locked down, with no one allowed to leave without being questioned. The bomber, hiding in the crowd, fled the scene out of fear. Kenobi gave chase on foot, which would eventually lead to a dead end platform. The bomber opened fire on Kenobi with his pistol. Kenobi managed the deflect the shots and disarm the bomber, but was unable to prevent the bomber from jumping off the platform to his death."}, {"tag": "p", "text": "With his dying breath, the bomber told the Duchess his loyalty to Death Watch, in a dialect of Mando'a used on Concordia, confirming the Duchess's suspicions that the group was based on Mandalore's moon. Kenobi and the Duchess arranged a meeting with Pre Vizsla, the governor of Concordia and secretly the leader of the Death Watch. While the Duchess occupied Vizsla during dinner, Kenobi left to investigate a local mining facility that was believed abandoned."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "h3", "text": "Mining facility"}, {"tag": "p", "text": "Upon Kenobi's arrival at a local mining facility, which was in reality a Death Watch stronghold, Kenobi concluded that the facility was still operational. Upon further inspection, Kenobi found a rack of jetpacks and an accompanying rack of Mandalorian helmets. A Death Watch member, using Kenobi's curiosity with the helmet to his advantage, ambushed the Jedi from behind and opened fire with his blaster. Kenobi's reflexes were quick enough to allow him to block the incoming shots with the Mandalorian helmet, but the Mandalorian quickly lunged at Kenobi, knocking him to the floor. As Kenobi brought himself to his feet and brandished his blue lightsaber, the warrior seemingly disappeared."}, {"tag": "p", "text": "Kenobi assured to the Death Watch his protection under Duchess Satine of Mandalore. Another Death Watch member denounced Kenobi and Satine, asserting that the Death Watch did not recognize Satine's rule. The warrior lunged at Kenobi over a conveyor belt, firing two shots at the Jedi. Kenobi deflected the two shots with his lightsaber, and countered the Mandalorian with a kick, but the warrior fired a third shot at the Jedi which disarmed him. Kenobi quickly grabbed the Mandalorian and threw several punches at the warrior's face. However, the other Mandalorian reappeared and grabbed Kenobi's right arm, allowing both warriors to land a punch at Kenobi simultaneously, knocking him to the floor. As Kenobi attempted to regain himself, he was incapacitated by a kick to the face."}, {"tag": "p", "text": "The two Death Watch stole Kenobi's lightsaber and hooked him to a rock crusher machine. Under Pre Vizsla's orders, the two proceeded to survey the area for signs of other Jedi. Kenobi regained consciousness as the two left and contacted Satine, who at the time was having a dinner conversation with Pre Vizsla about the current political atmosphere surrounding Mandalore's neutrality. Satine left the dinner table under the guise of a sudden feeling of sickness, and used a speeder to travel to the mining facility, utilizing a tracker in her comlink to find her way."}, {"tag": "p", "text": "The two Death Watch activated the rock crusher machine, hoping to make Kenobi's death look like a fatal accident. However, they were distracted by a false alarm triggered by Satine, and left the room to investigate. In their absence, Satine managed to deactivate the rock crusher before it killed Kenobi. The two Death Watch members returned to the machine and restrained Satine, who managed to kick a metal canister into the rock crusher's gears, allowing Kenobi to detach himself. Kenobi used the metal canister to launch himself to the ceiling, using the ceiling to launch himself into a spring kick, incapacitating the Mandalorian restraining Satine. As the other Mandalorian attacked Kenobi, Kenobi grabbed him and threw him into the wall, incapacitating him as well. Kenobi and Satine proceeded to escape the mining facility in an elevator."}, {"tag": "h3", "text": "Firefight"}, {"tag": "p", "text": "As the elevator reached its destination at the surface of the planet, Kenobi quickly knocked out a Death Watch member guarding the elevator door with two swift punches to the head. A squad of Mandalorians nearby witnessed this and opened fire, causing the elevator to detach itself and fall. Kenobi then realized that his lightsaber had been stolen, and uncharacteristically instead utilized the blaster weapon of the Mandalorian he incapacitated. As three Death Watch members flew towards Satine and Kenobi using their jetpacks, Kenobi managed to land a shot on one of them."}, {"tag": "p", "text": "As the two remaining Mandalorians approached, Kenobi used the unconscious Mandalorian's jetpack as an improvised explosive. He threw the jetpack at the two Mandalorians and landed a blaster shot on it, causing the jetpack to explode, taking out one of the Mandalorians. However, the other survived the blast and lunged at Kenobi. As he approached Kenobi for the kill, Satine distracted the Death Watch member by throwing a rock at his head, giving Kenobi a few seconds to sweep the Mandalorian off his feet and knock him out with a kick to the stomach."}, {"tag": "h3", "text": "Duel with Pre Vizsla"}, {"tag": "p", "text": "As Vizsla monitered his men losing the battle to the Jedi, Vizsla ordered the rest of his men to retreat while he personally confronted Kenobi. Flanked by three of his Death Watch warriors, Vizsla displayed his ruthlessness by executing the Mandalorian who Kenobi had just knocked out with a single blaster shot. He then exposed his true identity to Kenobi and Kryze, explaining his bitter feelings towards the Duchess and the New Mandalorian culture. Vizsla returned Kenobi's lightsaber, asking Kenobi to defend the Duchess in an honorable duel. Vizsla's weapon of choice during the battle was a unique black lightsaber known as the \"Darksaber,\" which was passed down to Vizsla after it was stolen from the Jedi Temple during the fall of the Old Republic."}, {"tag": "p", "text": "Kenobi managed to disarm Vizsla, but Vizsla quickly countered and knocked Kenobi off his feet, giving him time to recover his weapon. Vizsla activated his jetpack and attempted to execute Kenobi with a jetpack enhanced jump, but Kenobi managed to gather himself off the floor and grabbed Vizsla, throwing him to the ground. Vizsla realized that Kenobi had the upper hand in the duel, and ordered his Death Watch warriors to finish him off. The three warriors fired their jetpack mounted rockets in unison, which initially missed Kenobi. However, when the rockets looped back around to track Kenobi, Kenobi was forced to escape with Satine down an elevator shaft. Vizsla ordered the warriors to not pursue."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Kenobi escorted the Duchess back to Sundari on Mandalore, meeting with the Jedi Anakin Skywalker, and the two clone troopers Rex and Cody. They were assigned to escort the Duchess to Coruscant in her starship, the Coronet, in order for her to assert her neutral views on the war to the Galactic Senate. However, the Senator representing Mandalore, Tal Merrik, was secretly in league with the Death Watch and smuggled crates of assassin probes into the cargo hold of the ship, resulting in a number of assassination attempts on the Duchess en route to Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Obi-Wan Kenobi's battle with the Death Watch on Concordia was first featured in a season two episode of Star Wars: The Clone Wars, \"The Mandalore Plot\". During the climactic duel between Kenobi and Vizsla, Vizsla was originally to use an vibroblade. However, George Lucas decided that only a lightsaber could stand against a lightsaber, and with that in mind, helped the show's crew conceive the idea for the Darksaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}