{"url": "Skirmish_on_Korriban", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Battles of the Jedi Civil War", "Category:Battles of Korriban"], "nodes": [{"tag": "h1", "text": "Skirmish on Korriban"}, {"tag": "p", "text": "The Skirmish on Korriban took place between the redeemed Jedi Apprentice Revan and the entire Sith Academy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Arrival on Korriban"}, {"tag": "p", "text": "Near the end of the Jedi Civil War, Revan and the crew of the Ebon Hawk were sent to Korriban to locate a Star Map. However, when they landed on Dreshdae, their way was blocked by the Sith Academy, and the only way for Revan to enter was if he talked to Yuthura Ban, and she let him join the Sith. Reports differ on how Revan persuaded Ban to let him in: it said he may have talked directly to the Twi'lek and got in; but it may be possible Revan killed a Sith student in self-defense, took his medallion, and showed it to Yuthura, who let him join the Academy."}, {"tag": "h3", "text": "Earning Prestige"}, {"tag": "p", "text": "Once inside the Academy, Revan was asked by the Headmaster of the Academy, Uthar Wynn if he was ready to learn the secrets of the dark side. It was immediate that Uthar sensed the \"Dark Kernel\" in Revan and commented whether or not it was ready to sprout. Soon, Revan was approached by Yuthura Ban, who told Revan that once he gained enough prestige, he would be given access to Naga Sadow's tomb, where Yuthura wanted Revan to help her kill Uthar and become the Headmaster herself. Revan began looking for ways to gain prestige within the Sith Academy and the Valley of the Dark Lords. He possibly aided Lashowe in retrieving a Sith holocron, but often had to lie to Uthar in order to receive prestige because many of his actions showed mercy and compassion. For example, he helped a rogue Sith named Thalia May escape the Shyrack caves by killing a terentatek, and claimed to have killed her. He possibly destroyed or deleted the assassination programming of a droid in Marka Ragnos' Tomb, allowing it to leave Korriban and tricked the Sith Academy Interrogator into releasing a Mandalorian prisoner. He redeemed two Sith students: Mekel, whom he saved from the mad hermit Jorak Uln who had captured him, and Dustil Onasi, son of Carth Onasi. He even redeemed the spirit of Ajunta Pall by allowing him to finally rest in peace by becoming one with the Force. Revan received enough prestige to enter the tomb of Naga Sadow for his final test."}, {"tag": "h3", "text": "Tomb of Naga Sadow"}, {"tag": "p", "text": "Once Revan entered the tomb, he was told that a Star Map was inside, and he had to find it. Inside the tomb, he recovered Naga Sadow's Poison Blade. He killed several wraids and two terentateks, found the remains of Shaela Nuur and took her Solari crystal. He found a pillar with a fire grenade and an ice grenade. Revan used the ice grenade to freeze an acid pool that blocked his way to the Star Map. After finding the Star Map, he was confronted by Yuthura Ban and Uthar Wynn, who turned on each other. Revan helped Yuthura kill Uthar, but then Yuthura attacked Revan, who quickly beat her. Broken and defeated, she pleaded for mercy, and Revan then convinced her to return to the light side, thus redeeming Yuthura. She departed Korriban for the Jedi Enclave on Dantooine."}, {"tag": "h3", "text": "Battle of Korriban"}, {"tag": "p", "text": "Revan was confronted by three Sith at the Academy's entrance. They realized that he wasn't a Sith, and tried to kill him. Revan killed them first, and entered the Academy. Once inside, he regrouped with his party and with his great strength in the Force. Revan managed to kill every Sith inside. Just outside Dreshdae, the lone Sith soldier guarding the entrance to the Academy attacked Revan, but was quickly slain. When Revan re-entered the Korriban colony, nobody there knew of the battle yet, and Revan drove the Sith from Korriban. Afterward the Jedi forces looted the Valley."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There are many possible outcomes to the Skirmish on Korriban depending on the player's skills and actions. The above is the optimal Light Side path that grants the most Light Side points upon completion; however, Revan can achieve enough prestige to enter Naga Sadow's tomb having completed less than half of the available quests on Korriban, and has many opportunities to choose the Dark Side over the Light."}, {"tag": "p", "text": "The ultimate ending of Revan's adventures on Korriban depends on his choices and his Persuade skill; if he chooses to side with Uthar or to kill both Uthar and Yuthura for being Sith, Yuthura may die on Korriban. On the other hand, if his Persuade skill is not high enough to convince Yuthura to join the Light Side or he simply chooses not to, Revan may choose to allow Yuthura to remain Master of the Academy and depart peacefully with the \"skirmish\" never having happened at all."}, {"tag": "p", "text": "Author Drew Karpyshyn comfirmed in an email that this battle is the same one mentioned in his novel Darth Bane: Path of Destruction that Revan led."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}