{"url": "Skirmish_on_Shantipole", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles in the Mid Rim"], "nodes": [{"tag": "h1", "text": "Skirmish on Shantipole"}, {"tag": "p", "text": "In 4 ABY, a skirmish between the Freemakers, Quarrie and the Imperial hunter droid M-OC took place on Shantipole. With M-OC seeking to destroy the Freemakers, Rowan convinced his family to lure the hunter droid into a trap on the stormy planet of Shantipole. Despite the destruction of both the StarScavenger and the Arrowhead, M-OC survived. Though Rowan managed to convince M-OC to stop hunting him, the hunter droid decided to save the second Death Star, believing there was a a flaw in his Imperial masters' decision-making."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Darth Vader captured Rowan Freemaker, his siblings Kordi, Zander and their droid Roger embarked on a mission to rescue Rowan from the Imperial Palace on Coruscant. Despite rescuing Rowan, the Freemakers lost the Arrowhead to the Imperial hunter droid M-OC. Having regained the Emperor Palpatine's favor, M-OC was sent to hunt down and destroy the Freemakers, a mission he accepted with glee."}, {"tag": "p", "text": "While traveling through the Coruscant system, the Freemaker's TIE fighter \"Ugly\" was pursued by M-OC. The Freemakers tried to surrender but M-OC was determined to destroy them and used the Arrowhead's Embersteel Blade to slice their fighter's solar collectors off. Before M-OC could finish them off, the Mon Calamari starship builder Quarrie arrived in the StarScavenger and rescued them."}, {"tag": "p", "text": "The StarScavenger fled into hyperspace but M-OC was able to track them through an XX-23 S-thread tracker. He pursued them through an asteroid field. In an effort to lose, Quarrie convinced the Freemakers to travel to the stormy world of Shantipole where he had a base. They managed to lose M-OC and the Arrowhead in Shantipole's stormy atmosphere and reach Quarrie's base, with the StarScavenger narrowly avoiding crashing into a nearby mountain."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "Though M-OC still circling Shantipole aboard the Arrowhead, the Freemakers were still determined to get offworld in order to warn the Rebel Alliance that the Empire now had an operational second Death Star due to the kyber crystals from Baird Kantoo's planet. After Roger noticed that M-OC was obsessed about Rowan, Rowan came up with a plan to lure M-OC into a trap."}, {"tag": "p", "text": "As part of their plan to trap M-OC, the Freemakers and Quarrie built a tractor beam projector onto the StarScavenger. The Freemakers then flew the StarScavenger to the upper atmosphere where M-OC was circling in the Arrowhead. They lured M-OC down into Shantipole's atmosphere and trapped the Arrowhead with the tractor beam projector. However, the tractor beam projector was knocked off by a lightning storm, which also disabled the StarScavenger and Arrowhead."}, {"tag": "p", "text": "Putting the second part of their plan into action, Rowan leapt from the Mini Scavenger onto the Arrowhead. He attempted to use the Force to remove the giant kyber crystal from the ship's core but was attacked by M-OC, who engaged him in a lightsaber duel. Rowan managed to remove the Arrowhead's kyber crystal and escaped aboard the Mini Scavenger with Roger."}, {"tag": "p", "text": "With the Arrowhead unshielded, Zander rammed the StarScavenger into the Arrowhead in an attempt to destroy M-OC. The resulting explosion destroyed both ships. The Freemakers and Quarrie managed to land safely on Shantipole's barren surface."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Despite the Freemaker's efforts, M-OC was able to rebuild himself and confronted Rowan. However, Rowan decided not to fight the droid and instead convinced him that his programming was flawed. While M-OC accepted Rowan's argument and decided to call off the hunt for Rowan, M-OC got the idea that the Emperor's plan to destroy the rebels with the second Death Star was flawed. Abandoning his hunt for Rowan, M-OC built an arachnid starship consisting of the Arrowhead's kyber crystal and departed to protected the second Death Star."}, {"tag": "p", "text": "Determined to stop the Empire's second Death Star, Rowan used the Force to rebuild the StarScavenger, incorporating elements from the derelict Arrowhead including its embersteel blades. The Freemakers then took part in the Battle of Endor with Rowan defeating M-OC in a duel at the core of the second Death Star, allowing the rebels to destroy the superweapon's reactor core."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Skirmish on Shantipole first appeared in the LEGO Star Wars: The Freemaker Adventures Season Two episode \"Free Fall\", which premiered on Disney XD on August 15, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}