{"url": "Baran_Do_temple", "categories": ["Category:Legends articles", "Category:Dorin locations", "Category:Temples"], "nodes": [{"tag": "h1", "text": "Baran Do temple"}, {"tag": "p", "text": "The Baran Do temple was a temple in Dor'shan, capital of the planet Dorin, where Baran Do Sages lived and trained in the Force. It was not too far from the Dor'shan spaceport."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The Temple was a large four level ziggurat that gradually darkened toward the summit. Surrounded by two-story outbuildings, the estate upon which it was built was surrounded by a polished, retractable fence that was covered in transparisteel. In the event of severe weather, the fence was lowered, so as to allow citizens to take shelter within the temple, and to prevent it from being blown away and potentially harming somebody."}, {"tag": "p", "text": "The entrance to the Temple was daunting to outsiders. The black stone of the walls to either side of the main door were inspired by the two black holes of the system, while the white columns that stretched to the ceiling represented the stability created by the Kel Dor, a species native to Dorin. The blue ceiling sparkled like the sky, while the brown tones of the permacrete floor was similar to Dorin's surface. Opposite the main doors was a raised dais, devoid of any furnishings. Doors from this chamber were hidden, but once opened, they led into corridors that branched into training halls, classrooms, meditation rooms, and dining halls."}, {"tag": "p", "text": "A lounge area existed with a large monitor on the wall. During a storm, it was often filled with pedestrians taking refuge and for a source of news coverage."}, {"tag": "p", "text": "The combat training hall of the Temple was small and very lightly equipped. Staves and padded body armor were hung on wall racks, while the padded mats on the floor would keep the two sets of sparring pairs the hall could accommodate from severe injury on the ground."}, {"tag": "p", "text": "Dying ceremonies occurred in a large paved area behind the Temple. A raised hearth rimmed in a bronze metal. On the hearth was a pyre, in front of which was a platform; both made from planks that contained a fuel enriched with oxygen, since normal wood didn't burn in Dorin's helium-rich atmosphere. However, the pyre was really a secret passageway into chambers underneath the Temple. There, were a number of storage areas and a system of conveyors leading to the Caverns of the Hidden One."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Jacen Solo visited the Temple during his five-year sojourn following the conclusion of the Yuuzhan Vong War and learned techniques from the Master of the Order, Koro Ziil. In 43.5 ABY, exiled Jedi Grand Master Luke Skywalker and his son, Ben, arrived on a quest to retrace the steps that Solo took on his journey, hoping to discover why he had fallen to the dark side of the Force. During their stay, they estimated that there were six masters and at least twenty students occupying the temple. The Skywalkers studied under Master of the Order Tila Mong and senior combat instructor Charsae Saal."}, {"tag": "h2", "text": "Appearances"}]}