{"url": "Skirmish_on_Florrum/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Florrum", "Category:Conflicts involving the Jedi Order", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Skirmish on Florrum"}, {"tag": "p", "text": "A skirmish on the Outer Rim planet of Florrum took place during the Clone Wars in 20 BBY. The battle was fought between the pirate forces of Hondo Ohnaka, backed by the Jedi Order, and the secessionist pirate forces swayed away from Ohnaka's leadership by the Nightbrothers Darth Maul and Savage Opress. Being self proclaimed crime lords determined to seize control of the criminal underworld, Maul and Opress traveled to Florrum with the intention of seizing Ohnaka's pirating empire by force. After an initial scuffle with pirate forces in orbit of Florrum led by Lieutenant Jiro, Maul successfully bribed Jiro and his men with a promise of great wealth, keeping them alive in exchange for unquestioned devotion to Maul's cause. After unsuccessfully ordering Ohnaka to stand down, Maul and Opress, along with their newly acquired pirate army, laid siege to the pirate headquarters to eliminate anyone still loyal to Ohnaka."}, {"tag": "p", "text": "The Jedi Masters Obi-Wan Kenobi and Adi Gallia soon arrived to arrest the two Nightbrothers. While the split pirate forces battled it out, Kenobi and Gallia fought Maul and Opress, respectively. Gallia eventually fell to Savage's sheer brute strength, being gored by his Zabrak horns before being finished off with his lightsaber. Outnumbered, Kenobi and Ohnaka's forces retreated indoors, with Maul and his men in pursuit. Ohnaka managed to lure the surviving pirate opposition into a trap and force them into a surrender, reunifying the pirate gang. Meanwhile, Kenobi fought both Nightbrothers by dual-wielding his and Adi Gallia's lightsabers, managing to sever Opress's left arm. Maul and Opress soon fled to their ship, being pursued by the newly reunified pirate forces; Maul lost a robotic leg in the process. After takeoff, the pirate forces destroyed one of their ship's engines, forcing the two to evacuate in an escape pod."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The recently resurfaced Darth Maul and his brother Savage Opress began making a name for themselves in the Outer Rim. Murdering and pillaging at every turn, the two Nightbrothers caught the attention of the Jedi Order, who thought they extinguished the threat of Maul during the Battle of Naboo a decade prior. Then, Maul had an army to back him, in the form of the droid armies of the Trade Federation. Now, Maul found himself displaced and on the run from an enemy that drastically outnumbered him and his brother. In order to survive, Maul deduced that they would need an army of followers. The Jedi Order soon dispatched Finn Ertay and a Nikto Jedi to deal with Maul and Opress. Confronting the brothers at an Outer Rim spaceport, the two Jedi engaged them but despite a valiant effort, Ertay was murdered by Maul when she attempted to save her comrade, who soon followed. During a raid on a space station owned by the InterGalactic Banking Clan, Maul and Opress came into possession of a large sum of Republic credits. With their newly acquired wealth, the two refashioned themselves as \"crime lords\" and planned to take control over the criminal underworld of the galaxy. They decided on taking their wealth to Florrum, home of the pirate gang of Hondo Ohnaka, in order to seize Ohnaka's pirate empire."}, {"tag": "p", "text": "Meanwhile, Jedi Masters Kenobi and Adi Gallia inspected the aftermath of the Cybloc station raid, where they questioned the Morlimur Snugg of the station about the assailants' description. The supervisor confirmed to the Jedi that the assailants were, much to Obi-Wan's suspicion, the Nightbrothers, and that they had stolen the supervisor's shuttle before making a jump to hyperspace; an employee thought he heard a reference to the Sertar sector. Obi-Wan immediately associated the sector with Florrum because of his repeated encounters with Ohnaka, and the Jedi set off for the pirate captain's base. Florrum itself recently suffered from a devastating attack by General Grievous of the Confederacy of Independent Systems, and Ohnaka was still reeling in the damage and losses."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "h3", "text": "Pirate turncoats"}, {"tag": "p", "text": "Upon entering Florrum's orbit, the Nightbrothers deactivated their transport's hyperdrive, main reactor, and communications systems in order to feign being stranded in space. Falling for the bait, Lieutenant Jiro of the pirate forces, who was commanding the planet's perimeter defenses set up in the wake of Grievous's previous attack, formed a boarding party with his men with the intention of boarding the ship, killing its crew, and looting it of whatever valuables it contained. Jiro set up a docking tunnel between his Corona-class frigate and the seemingly damaged transport, and boarded the ship with two other men. They discovered a wealth of supplies in the cargo hold, including a number of firearms and a large crate containing pure spice. Overjoyed, Jiro stated that they would drink tonight to their newfound wealth. However, the two Nightbrothers emerged from the shadows and ignited their lightsabers. Believing the two tattooed men to be Jedi, Jiro and his men opened fire. Maul and Opress deflected all of the pirate's shots, disarmed Jiro using the Force, and held the pirate lieutenant at bay using a force choke."}, {"tag": "p", "text": "Opress and Maul revealed the large fortune they acquired from their raid on InterGalactic Banking Clan territory, and offered to bestow it upon the pirates if they were to devote themselves to the Nightbrother cause. The two explained that they were not Jedi; however, they skirted the topic of their Sith and Dark Jedi training, instead referring to themselves as \"crime lords\". Jiro was initially reluctant to betray Hondo, but after the two Zabraks explained that money was of no issue, dedicated himself, as did two other lieutenants; however, one pirate was still on the fence, and he requested that they contact Ohnaka and give him the chance to turn himself over as well. Contacting the pirate captain via hologram, Maul explained that three of his lieutenants had betrayed him, and executed the indecisive pirate with his lightsaber to demonstrate the penalty for insubordination. Ohnaka refused to surrender himself, calling Maul a \"laser-sword wielding maniac\" and explaining that he has survived everything the galaxy had thrown at him. As such, Maul readied his newly acquired pirate army for a ground assault."}, {"tag": "p", "text": "Soon after, Kenobi and Gallia arrived in the system, and contacted Ohnaka via hologram. Ohnaka explained the situation to the Jedi Master; Kenobi offered to deal with the Nightbrothers while Ohnaka handled the traitors."}, {"tag": "h3", "text": "Ground battle"}, {"tag": "p", "text": "Three of the Ohnaka's starfighters landed on Florrum, launching an aerial assault. As the cargo ship and the transports landed, the traitorous pirates quickly ejected from the ships and began shooting at Ohnaka loyalists; Ohnaka's pirates immediately took defensive positions. Laser fire flew in all directions and pirates on both sides fell. As Darth Maul and Savage Oppress stepped out of the cargo ship to observe the battle, they spotted the Jedi shuttle landing down on Florrum. Realizing the Jedi had come too soon, Maul and Oppress dashed to their position to confront them. Obi-Wan briefly sarcastically spoke to Maul; lightsabers ignited and fury building, Maul charged at Kenobi with a few saber strikes. Savage then launched himself at Master Gallia with a furious array of saber strikes. After a quick flurry with both duels, Kenobi and Gallia jumped off the cliffside and separated."}, {"tag": "p", "text": "Savage then ramped up his assault on Gallia with aggression. Gallia stayed on the defensive as she lost footing and ducked. Kenobi dueled on top of a ruined engine with Maul, while Savage attacked with sundering strikes down below at Gallia. She threw a kick at Savage's left leg, which failed to affect the hulking Nightbrother, which caught her off-guard: using this opportunity, Savage barraged her with lightsaber strikes and threw a powerful Force push that catapulted Gallia into the side of the ruined engine. Savage then charged at Gallia and shoved his horned head into her body, mortally wounding her. As Kenobi watched in horror, Savage brought his blade down on Gallia's wounded form, killing her. Furious, Kenobi leapt down and kicked Savage to the ground. Maul parried a blow that would have killed his brother, and both Zabraks ganged up on the Jedi Master"}, {"tag": "p", "text": "Ohnaka, realizing that his men were slowly dying and outnumbered, called out to Kenobi to follow them back into the base. Kenobi complied, but not before collecting Gallia's lightsaber. Ohnaka ordered some of his men to carry a large turret deeper into the tunnel. As they set up the ambush, Kenobi rendezvoused with Hondo: the next part of the plan was Obi-Wan would draw the brothers away. As the Zabraks and the traitorous pirates met up with Hondo and Obi-Wan's position, Hondo ordered a retreat into the base. The brothers and the pirates followed. Obi-Wan turned left while Hondo turned right. Then, as Savage and Maul followed Obi-Wan, Hondo shot his blaster at the ceiling, sealing themselves in with the pirates. While Maul and Savage dueled Kenobi, the traitorous pirates were about to open fire on Hondo and his men, but as the big turret was about to open fire, Jiro and his people surrendered, openly admitting they were bribed and persuaded by the brothers. Hondo wouldn't kill them, knowing that Maul and Savage only bribed them for their interest in Kenobi. The pirates once again reunited, Hondo and his men decided to congratulate their reunification by going out to the cargo ship and taking the cargo."}, {"tag": "h3", "text": "Nightbrother retreat"}, {"tag": "p", "text": "As the Force-wielders came to a halt, Maul sneered at Obi-Wan to surrender, considering how outnumbered the Jedi Master was, but Kenobi ignited both his and Gallia's lightsaber. The Jedi Master used the Jar'Kai style against the brothers, leaping back and forth between the brothers, throwing kicks at Maul and Savage one by one. Afterwards, Maul Force-gripped Kenobi and threw him into a wall, leaving him vulnerable. As Maul and Savage were about to kill Obi-Wan, the Jedi Master barely blocked both killing strikes. During the saber lock, the Human glanced at Savage's front leg and landed a kick at his knee joint. As Savage yelled out in pain, Obi-Wan broke off the saber block by cutting Savage's left arm. Savage was left on the ground in pain. Maul then turned to Kenobi and fired a powerful Force push at Kenobi, throwing him to the end of the corridor and causing the ceiling to cave in. Maul, realizing his plan has failed, picked up his brother/apprentice as Savage's arm spilled out Magick."}, {"tag": "p", "text": "The Nightbrothers made a run for the cargo ship as the newly reunified pirates fired on Maul and Savage. They attempted to deflect all the lasers, but Hondo shot Maul in the leg, causing Maul to limp. Jiro then fired on Maul's leg again. As Maul howled in pain, his leg from the shin down was dismembered. Savage quickly lifted Maul over his shoulder and continued running, while Maul continued deflecting laser bolts. Then Maul looked over on the cliffside to the Jedi shuttle. He used the Force and pulled it off the cliffside, obstructing the pirates and Kenobi's pursuit. As the brothers boarded the ship, they attempted to fly, but a pirate fired on the ship with a rocket launcher, compromising the engines. The two Zabrak brothers limped over to the escape pod and fled Florrum, while the rest of the cargo ship landed down onto the surface, exploding."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Ohnaka, his pirates and Kenobi drove over to the wreckage of the cargo ship on speeders. Ohnaka and his pirates took the riches of the cargo ship for themselves. The pirate leader deduced that since the ship exploded, the brothers were dead. Kenobi disagreed, considering how Maul had survived his previous defeat."}, {"tag": "p", "text": "Later, back on Coruscant, Kenobi reported the events that took place to Chancellor Palpatine in a meeting with him, Anakin Skywalker, Mace Windu and Yoda. Palpatine merely ignored it and urged Kenobi to forget it ever happened, despite Maul and Opress being responsible for the murder of two Jedi Knights and a High Council member, and returned to his office. However, Yoda swore that if Maul was still alive, the Jedi would act as soon as he revealed himself again. After the Jedi left, Palpatine returned to his office with a sinister grin. Now that he was aware of Maul's survival (with this being the second time he had been made aware of such after Skywalker told him he'd have to miss the Senate War Rally to hunt for a Sith that wasn't Dooku), he knew the Nightbrothers would be a boon to the Rule of Two, considering Dooku was now Palpatine's apprentice."}, {"tag": "p", "text": "Maul and Opress were later found and nursed back to health by Pre Vizsla and Bo-Katan Kryze of the Death Watch. An alliance was forged between the brothers and the Death Watch, concluding with Maul killing Vizsla in a duel and becoming the Death Watch's new leader after they all took control of Mandalore. With his new minions, he and Opress captured Kenobi again, only for him to be rescued by Kryze, who refused to acknowledge Maul as Mandalore's ruler. As Kenobi escaped amidst a battle between the divided Death Watch forces, Palpatine, under the guise of Darth Sidious, personally traveled to the planet to tie up loose ends. He confronted the brothers in an intense duel and ultimately defeated them, killing Opress and subduing his former apprentice for \"other uses.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish on Florrum appeared in the first episode of the fifth season of The Clone Wars TV series. The battle depicts the death of Jedi Master Adi Gallia at the hands of Savage Opress; this directly conflicts with the previous depiction of her death in Star Wars: Obsession, in which she is killed by General Grievous during the Battle of Boz Pity. Leland Chee, the official Lucasfilm Ltd. keeper of Star Wars continuity, states that her death in The Clone Wars takes precedence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}