{"url": "Skirmish_on_Rodia", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Rodia"], "nodes": [{"tag": "h1", "text": "Skirmish on Rodia"}, {"tag": "p", "text": "A skirmish took place on the planet Rodia around 22 BBY during the Clone Wars. After aiding in the escape of the Hutt prisoner Ziro Desilijic Tiure from Republic custody on Coruscant, the bounty hunter Robonino went into hiding from the Republic and established headquarters on Rodia. Robonino set up an underwater generator to power his modified battle droids, and the surrounding wildlife soon began to suffer from the effects of the device. Rodia's senator, Onaconda Farr, requested a Jedi to investigate the disturbances, and High Jedi General Kit Fisto was sent in with a squad of clone troopers. While the clone commander and his forces fought and defeated the droids in the base, Fisto found the underwater generator. Instead of capturing Robonino, Fisto was forced to destroy the generator and allow the bounty hunter to escape. Nevertheless, a Kwazel Maw beast soon appeared and spat out the defeated Robonino right in front of the Republic forces, leading to the mercenary's arrest."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Around the first year of the Clone Wars, the bounty hunter Cad Bane formed a team of hunters to free Hutt crime lord Ziro Desilijic Tiure—who had been arrested for crimes against the Galactic Republic—from the Republic Judiciary Central Detention Center on the galactic capital of Coruscant. The hunters' mission was successful, and Bane and his team escaped with Ziro. Shortly thereafter, Bane transmitted the monetary reward for the mission into the accounts of his comrades and then ordered the bounty hunters to flee and hide from the Republic. One member of the team, the Patrolian slicer Robonino, traveled to Rodia and established headquarters at an abandoned station on the world."}, {"tag": "p", "text": "Robonino set up an underwater droid generator to power his modified battle droids, and wildlife in the area soon began to suffer from the generator's output. Fearing that the Confederacy of Independent Systems had returned to Rodia, the planet's Galactic Senate representative, Onaconda Farr, requested a Jedi to to investigate the disturbances on the planet. High Jedi General Kit Fisto arrived with a squad of clone troopers, and after being directed toward the abandoned station by Farr, Fisto entered the water with several troopers to find what was disrupting the planet's wildlife, while his clone SCUBA commander remained on the surface to search the outpost."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "Entering the abandoned station, the clone commander ordered his forces to spread out, warning his troops to be careful of battle droids that could be hiding in the station. A pair of B1-Series battle droids noticed the intruders, and the clones were ambushed by B1 and B2 battle droids, as well as BX-series droid commandos and droidekas, all hot-wired by Robonino from the remains of the droid deployment previously sent to Rodia by the Confederacy. The clones were able to cut their way through the base and defeat all of the droids."}, {"tag": "p", "text": "In the water, Fisto and his clone SCUBA troopers found the droid generator, which promptly targeted two of the troopers with its laser cannons and killed them. Fisto soon caught sight of a fleeing Robonino, and while opening fire with his blaster on the Jedi Master, the bounty hunter launched several thermal detonators toward the Jedi. Fisto was able to redirect the explosives into the droid generator with the Force, destroying the device and disabling the battle droids, but his actions cost him the apprehension of Robonino."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Fisto believed that he had made a willing trade in letting Robonino escape in exchange for eliminating the source of the wildlife disruptions. The Jedi Master reported to Farr that it had not been a Confederate outpost creating the disturbances, but rather that of a \"skilled vandal\" who had caused unintentional consequences on the Rodian wildlife. But then, a native Kwazel Maw creature appeared out of the water and spat out Robonino right in front of Fisto, Farr, and the remaining clone troopers, enabling them to take Robonino into custody."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Rodia skirmish first appeared in Hunting the Hunters (Part II), an issue of the online The Clone Wars webcomic series that transitioned between the first and second seasons of the 2008 Star Wars: The Clone Wars television series."}, {"tag": "p", "text": "The comic and Swamp Station Sweep, an online game released on StarWars.com that was based on the events of the comic, the game were somewhat inconsistent with one another. Specific continuity was not established between the comic and game, and it was also implied that Robonino was present both on land and underwater. This article assumes that Robonino was underwater per the events described in the webcomic."}, {"tag": "p", "text": "Although The Official Star Wars Fact File Part 28 states that all of Fisto's clone troopers were killed upon finding Robonino's droid generator, that conflicts with the events of the webcomic, in which only two troopers were killed. This article assumes that the webcomic's version of events is correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}