{"url": "Skirmish_on_Rekkiad", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Chorlian sector"], "nodes": [{"tag": "h1", "text": "Skirmish on Rekkiad"}, {"tag": "p", "text": "In 3954 BBY, a skirmish took place on the planet Rekkiad between the Mandalorian clans Ordo and Jendri. During the search for Mandalore's Mask, Clan Ordo invaded Clan Jendri's territory, and in retaliation some Jendri soldiers and four of their Basilisk war droid pilots attacked Ordo's campsite, attempting to keep Clan Ordo away from their Basilisks. The Jedi Master Revan—who joined Clan Ordo with Mandalorian mercenary Canderous Ordo during the search—created a distraction to cover six of Clan Ordo's pilots long enough so they could reach and mount their semi-sentient machines. Once in the air, Ordo's Basiliks outnumbered the remaining Jendri pilots, and the surviving Jendri troops fled the battlefield."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3954 BBY, the remaining Mandalorian clans leftover from the Mandalorian Wars with the Galactic Republic left their homeworld of Mandalore. They later gathered on the planet Rekkiad to search for the ancient ceremonial artifact known as Mandalore's Mask. Jedi Master Revan of the Jedi Order and Mandalorian mercenary Canderous Ordo journeyed to Rekkiad to help Clan Ordo, Canderous' clan, in the search for the mask. Each clan chose their own territory on the planet to hunt for the artifact. One night, Revan—led by a memory of his last visit to Rekkiad with his apprentice, Malak—convinced clan chief Veela Ordo, Canderous' wife, and her clan to move into Clan Jendri's territory in search of Mandalore's Mask."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "Early one morning, just before dawn, Clan Jendri attacked Clan Ordo in retaliation for the invasion of their territory. Jendri's soldiers, who outnumbered those of Clan Ordo two to one, targeted their campsite while four of their Basilisk war droid pilots razed the battlefield from above, pinning down the invaders from reaching their Basilisks. Veela Ordo led her clan into battle, while Revan, who had already taken out a sniper and soldier, realized Clan Jendri's strategy. He then created a distraction using his lightsaber to grab the attention of the Jendri pilots and proceeded to attack the nearest one. Revan ran underneath the machine, leaped high into the air, and damaged one of the tails stabilizing fins. The pilot flew back around to get a bead on the Jedi Master, only to have the Jedi jump onto his machine and kill him. His diversion allowed Canderous and five other Clan Ordo pilots—who previously couldn't make it to their machines without getting strafed—to safely reach their own Basilisk mounts, get their machines into the air, and proceed to attack the remaining Jendri pilots."}, {"tag": "p", "text": "Quickly realizing that they were outnumbered, some of the remaining Jendri troops abandoned the battlefield. The rest who chose to stay were slaughtered by Clan Ordo, and the battle ended in a rout for Clan Jendri."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the skirmish, Clan Ordo claimed the captured territory from Clan Jendri. Later that night, Veela had a funeral pyre built for the thirty warriors—consisting of one Clan Jendri pilot, one Jendri sniper, and twenty-two Jendri soldiers, as well as six members of Clan Ordo—granting those who had fallen a warrior's funeral. The pyre burned for hours as Clan Ordo honored their memories through songs and a feast. They grieved for the fallen but also celebrated their victory."}, {"tag": "p", "text": "The next day, Revan and the rest of Clan Ordo climbed the First Spear—the home of the Sith Lord Dramath the Second's tomb—of the Twin Spears, a pair of columns of ice several kilometers tall, with flat plateaus on top. After ascending to the top, Canderous and Revan rediscovered and investigated the tomb, finding Mandalore's Mask inside of Dramath's crypt. Shortly after finding the mask, they were ambushed by Veela and five Mandalorians, and in the ensuring firefight, they were forced to kill Veela and the others."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish first appeared within Drew Karpyshyn's novel The Old Republic: Revan, which was published on November 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}