{"url": "Skirmish_on_Lehon", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Events during the Jedi Civil War"], "nodes": [{"tag": "h1", "text": "Skirmish on Lehon"}, {"tag": "p", "text": "The skirmish on Lehon was a battle that doubled as a rescue operation on Lehon at the Black Rakata settlement. The Jedi Padawan (and former Sith Lord) Revan was told to liberate an Elder Rakatan from the One at their settlement and was warned that a diplomatic solution would be impossible. Revan and two companions did battle with the Black Rakata and slew the One in order to free the prisoner who returned to the elder settlement."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Sith Lord Darth Revan visited Lehon with his apprentice Darth Malak in 3659 BBY in order to find the Star Forge for their eventual war with the Galactic Republic. The two Sith ripped the Rakata language from the One and implanted Basic in his mind in order to communicate with the Black Rakata. The Sith requested their aid in entering the Temple of the Ancients but the One said that the Elders had an ancient tome that could help them enter the Temple; it was his wish that the Sith could recover the tome and defeat the Elders since he knew that the Sith could use the Force to take it from them. But Revan and Malak instead met with and received assistance from the Elders with the One unaware of what had happened."}, {"tag": "p", "text": "But Revan would return in 3956 BBY as a Jedi Padawan in order to seek out the Star Forge so that he could defeat his former apprentice Malak. He approached the One who once more requested Revan's help in exchange for getting him into the ancient Temple. But Revan once more decided to side with the Elders who convinced Revan to rescue one of their soldiers that the One was holding as a prisoner; he was forewarned that there could be no diplomatic solution due to the One's barbarism."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Revan and two companions left the Elder settlement in order to free the prisoner from the One and to that end headed to their compound in the opposite direction. But as the trio neared the settlement the Black Rakatans and their rancor beasts arrived to kill them for their transgressions against the One. The three were able to defeat their attackers before heading into the settlement to find the prisoner."}, {"tag": "p", "text": "But the team were attacked upon their entrance and killed the Black Rakatans such as Luo and Gjarshi who were positioned near the entrance. The One pulled a lever that released several rancors that he wished to unleash upon the invaders; these rancor beasts and the Black Rakatans were dispatched and the One himself was killed in the ensuing commotion."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The One's defeat left no Black Rakatan survivors since their members and their beasts were all slain in the skirmish. Revan was able to return the prisoner back to the Elders who decided to aid Revan to enter the Temple. The Jedi entered the Temple with Jolee Bindo and Juhani in tow and were able to go on later to defeat Malak and see to the Star Forge's destruction."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "Notes and references"}]}