{"url": "Skirmish_on_Kardoa", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Skirmish on Kardoa"}, {"tag": "p", "text": "A skirmish between the Galactic Republic and the Confederacy of Independent Systems took place on the planet Kardoa during the Clone Wars."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Jedi General Depa Billaba and her battalion were sent to Kardoa to recon the planet to confirm or deny a Separatist presence. The Separatist forces, under Generals Grievous, Kleeve, and Colonel Coburn Sear were also confirming a republic presence there. Kleeve saw no reason to attack Kardoa, since there was nothing at stake. Kleeve, at the orders of Count Dooku, then left to conquer Kaller. Grievous then went to Mygeeto, left Colonel Sear to deal with the Jedi."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "Billaba, along with her apprentice, Caleb Dume, and her battalion then moved out towards the canyons, splitting into five squads to recon the area. Billaba and her battalion then came under attack by battle droids. With the trail gone, Billaba's battalion was unable to retreat. She then called air support. Dume then attacked head on into the battle droids. Billaba then left Corporal Big-Mouth and Dume behind to keep the battle droids while she destroyed the jamming signal."}, {"tag": "p", "text": "Colonel Sears then watched as Dume fought. He then took a speeder to find Billaba before she could outflank his forces. Dume was then wounded by the battle droids blaster fire. However, he was saved by CT-1157. Despite, Billaba and her troops then targeted Sear's shuttles slowly. Sear, knowing that his forces could not risk being stranded there, ordered his troops to pull back and secure their shuttles. Thus the Separatist forces retreated."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the battle, CT-1157, calling himself \"Stance,\" won a commendation for Valor. Billaba and her battalion were then sent to Mygeeto."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}