{"url": "Skirmish_on_Dxun", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Japrael sector", "Category:Battles of the First Jedi Purge"], "nodes": [{"tag": "h1", "text": "Skirmish on Dxun"}, {"tag": "p", "text": "The Exile was also forced to deal with assassins that were sent after her and defeated them outside the Mandalorian camp. The team planned to leave for Onderon but were forced to do battle with Sith assassins that infiltrated the camp to ambush them before Surik could depart with her companions for Iziz."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The exiled Jedi Meetra Surik traveled with her allies to Onderon to find the Jedi Master Kavar who was in Iziz. But the blockade above the planet proved an obstacle before Colonel Tobin dispatched his ships to attack their ship that forced them to land on the Dxun moon to avoid destruction. Surik and her allies proceeded outside to explore the moon with the intention to still travel to Onderon for their mission."}, {"tag": "p", "text": "But the contract that the Exchange put out on Surik (and other Jedi who survived the purge) was still in place and still made her vulnerable to some assassins attempting to locate her. This included the Duros hunters under Dezanti Zhug who also traveled to Onderon to find her; their vessel was also shot and forced them to crash land on the surface."}, {"tag": "h2", "text": "The skirmishes"}, {"tag": "h3", "text": "Crash-landed hunters"}, {"tag": "p", "text": "Surik and her allies decided to leave the ship in order to explore the moon while Atton Rand set to repair the ship. But the Exile and her companions encountered Dezanti Zhug and his two Duros companions in a jungle clearing where their ship had crash landed. Surik was unable to negotiate a peaceful solution to their predicament and were forced to engage and eliminate Zhug and his allies in the ensuing confrontation."}, {"tag": "h3", "text": "Scout forces"}, {"tag": "p", "text": "The Exile encountered several Mandalorian Neo-Crusaders who took them to their leader Mandalore the Preserver. The two formed a tentative alliance and Mandalore promised to take Surik to Onderon if he aided the Mandalorian clan with several errands that could test her. Surik proceeded to leave the camp where she encountered the scout Kelborn who had just discovered a dead Onderonian scout."}, {"tag": "p", "text": "Kelborn said that he tracked two ships that came onto the moon and said that the Onderonian scouts that came to the planet were silent while the Duros ship that crash landed had its signature transmitting the entire descent. Kelborn explained that the scouts had to be killed to ensure that the Mandalorian camp was kept secret lest the Onderonians send soldiers to attack them at the base. Surik decided to aid Kelborn and encountered two units further along the jungle paths. Surik discovered that Colonel Tobin sent the scouts to hunt her down while Kelborn explained that Tobin served General Vaklu which meant that Surik had a powerful foe in Iziz."}, {"tag": "h3", "text": "Sith ambush"}, {"tag": "p", "text": "The tasks that Surik completed led for Mandalore to decide to take her to Onderon so that she could continue her mission. Kreia solicited Ordo's assistance further when she revealed what she knew about Revan whom Ordo once served in the previous war. But just as Kreia left Ordo to ponder her words, several Sith assassins ambushed the Mandalorians in the camp after having been cloaked throughout the base. Surik and Kreia joined their allies to help repel the invading force throughout the base."}, {"tag": "p", "text": "But Ordo decided to allow his people to finish dealing with the assassins while he and Surik would leave for Iziz at once."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The team arrived in Iziz where Mandalore put them in contact with the doctor (and his old friend) Dhagon Gent. Their meeting in his office in the Merchant Quarter took place after Surik and Ordo had to help clear Gent from murder charges against an Onderonian officer. Gent was able to arrange a meeting between Surik and Kavar but the meeting was short-lived with Tobin forcing them both to flee from the cantina."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}