{"url": "Skirmish_on_the_Minemoon", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles in the Circarpous sector", "Category:Events during the New Republic Era"], "nodes": [{"tag": "h1", "text": "Skirmish on the Minemoon"}, {"tag": "p", "text": "Seeking to obtain a relic known as the Mindsplinter, the Knights of Ren fought a skirmish with several Mimbanese miners who were guarding the relic. Ren wanted to use the skirmish as an opportunity to test Ben Solo's worthiness to join the Knights of Ren. The skirmish was complicated by the arrival of Ben's fellow Jedi trainees Tai and Voe, who had come to avenge the death of Hennix. Tai tried to reason with Ben but was killed by Ren. A grief-stricken Ben killed Ren in revenge, falling to the dark side in the process. After killing Voe, Ben gained leadership of the Knights of Ren, adopting the persona Kylo Ren."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the aftermath of both the error of his uncle Jedi Master Luke Skywalker and the destruction of Skywalker's Jedi Temple caused by a massive storm, a distraught Ben Solo sought out the enigmatic Force wielder Snoke. Snoke encouraged Solo to seek out the Knights of Ren, whom he had encountered years earlier on Elphrona with his uncle and Lor San Tekka."}, {"tag": "p", "text": "Traveling to the Jedi outpost on Elphrona, Ben used a discarded helmet to contact Ren, the leader of the Knights, through the Force. Ren told him to travel to Varnak. Before he could leave, he was confronted by his fellow Jedi trainees Tai, Hennix, and Voe, who wanted to question him about the destruction of the Jedi Temple. Ben fought his fellow Jedi and killed Hennix in the process."}, {"tag": "p", "text": "Traveling to Varnak, Ben recounted the duel on Elphrona to the Knights of Ren. While Ben had killed Hennix, Ren deemed it an unworthy death since Ben had acted in self defense. Seeking to test Ben's worthiness, Ren outfitted him with new clothes and took him on one of their hunts. Seeking the Mindsplinter, the Knights of Ren and Ben traveled to Minemoon which orbited the planet Mimban."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "h3", "text": "Seeking the Mindsplinter"}, {"tag": "p", "text": "Arriving in the mines of the Minemoon, the Knights of Ren subdued several Mimbanese miners. Ren wanted to kill them but Ben, who still had not committed to the dark side, convinced them to use a mind probe to find the location of the Mindsplinter. Ben discovered that the artifact was in a sealed chamber three levels down to the southwest and that the entrance was marked by a red mark. However, Ren and his Knights still killed the Mimbanese captives."}, {"tag": "p", "text": "Reaching the subterranean chamber, the group encountered more Mimbanese who were led by a female shaman who refused to surrender the Mindsplinter to the dark siders. Ren ordered his Knights to kill the Mimbanese, seeking an opportunity for Ben to prove his worthiness to the dark side. Before the fight could break out, Tai and Voe caught up with Ben."}, {"tag": "h3", "text": "Descent into darkness"}, {"tag": "p", "text": "While Voe went down to help the Mimbanese against the dark siders, Tai attempted to reason with Ben and convince him not to go down the path of the dark side. Ben was angry that Tai had followed him and the two parried with lightsabers. Meanwhile, Voe gained an edge over the Knights of Ren with her lightsaber and led the Mimbanese in combat against the dark siders."}, {"tag": "p", "text": "As the duel continue, Tai laid down his lightsaber and pleaded with Ben to choose between killing or sparing him. However, Ren used the Force to snap Tai's neck, killing him. The murder of Tai enraged Ben, who engaged Ren in a lightsaber duel. Giving in to the dark side, Ben summoned Force lightning, scattering both the Mimbanese and the Knights of Ren. With the dark side, Ben found the strength to kill Ren, piercing him through the chest with Tai's lightsaber."}, {"tag": "p", "text": "Ben's descent into darkness was sensed through the Force by several individuals across the galaxy including Darth Sidious, Snoke, Ben's mother Leia Organa, and Rey. Sidious and Snoke encouraged Ben to embrace the dark side, regarding him as a tool in the coming war. By contrast, Leia was horrified while Rey felt a sense of coldness."}, {"tag": "p", "text": "Following the defeat of Ren, Ben confronted his former classmate Voe, using the Force to summon her lightsaber. Having embraced the dark side, Ben told her that he was now a murderer and that she would never become a Jedi. He then killed her, rejecting the light side and his former Jedi path. Due to the fighting, the mine began to flood."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the death of Ren, the Knights of Ren submitted to Ben, who became their new leader. Departing with the Knights aboard their starship Night Buzzard, he took the blue kyber crystal out of his lightsaber, using the dark side to \"bleed\" it red. While bleeding the crystal, Ben was haunted by images of people from his past including Luke Skywalker, his mother Leia, father Han Solo, Chewbacca, Lando Calrissian, and Tai. Ben placed the crystal inside his blade but it overheated, prompting him to opt for a crossguard design. Ben then chose the name Kylo Ren."}, {"tag": "p", "text": "Having embraced the dark side, Kylo Ren apprenticed himself to Snoke, who revealed himself as the Supreme Leader of the First Order, an Imperial successor that wanted to rule the galaxy and destroy the New Republic. Kylo Ren later usurped Snoke, killing him and claiming the title of Supreme Leader. In truth, Snoke was a puppet of Darth Sidious, who was the puppet master behind the First Order and wanted to use Kylo Ren as part of his plot to restore Sith rule over the galaxy. Sidious tasked Ren with hunting down Rey, seeking to use her Force powers and to lure the Resistance into a trap. After Kylo Ren rejected the dark side and adopted his persona of Ben Solo once more, he and Rey joined forces to defeat and destroy Sidious, ending his second attempt at galactic dominance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Skirmish on the Minemoon first appeared in the Marvel Comics issue The Rise of Kylo Ren 4, which released on March 11, 2020. The comic was written by Charles Soule, drawn by Will Sliney, lettered by Travis Lanham, and colored by Guru-eFX."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}