{"url": "Skivvers", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Ho'Din", "Category:Males", "Category:Mantellians", "Category:Slicers"], "nodes": [{"tag": "h1", "text": "Skivvers"}, {"tag": "p", "text": "Skivvers was a male Ho'Din who operated out of Ord Mantell as a slicer. Due to a bounty placed on his head, he was forced to keep a low profile, yet this did not prevent him from keeping in contact with his underworld connections. These included the veteran Rebel recruiter Tay Vanis. In 0 BBY, Skivvers passed on a message from Vanis to Raleigh Dawn, enabling her to join the Rebel Alliance with three other recruits."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Skivvers was a male Ho'Din who worked as a slicer on the Mid Rim world Ord Mantell. His activity caused a bounty to be placed on his head, severely restricting his freedom of movement. The slicer had a number of contacts in the underworld, such as \"Kestrel\" and Tay Vanis, a recruiter for the Alliance to Restore the Republic working with the Reekeene's Roughnecks."}, {"tag": "p", "text": "On one occasion in 0 BBY, Kestrel approached the Ho'Din, requesting he slice a bounty posting placed on \"Raleigh Dawn\"—in actuality, \"Kestrel\" was an alias being used by Dawn herself—to determine who had placed the bounty. Encouraged by the gift of a Mordanthi bloomer Kestrel bought from a visiting Ithorian herdship, the Ho'Din investigated briefly; however, since the bounty was for hunters with Imperial Peace-Keeping Certificates only, he refused to do further work for free. He did, however, pass on a message from Vanis to Kestrel, advising her to retrieve a datapad from an alleyway near residence #21, which she did. As a result, Vanis contacted the woman in person to give her further instructions with regard to joining the Rebel Alliance."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Skivvers was a slicer, somewhat unusual for a Ho'Din since most of the species reviled technology, and its use was forbidden on their ancestral homeworld. For his work, Skivvers was forced to wear thick corrective lenses to compensate for his poor eyesight. The Ho'Din also had a love for plants, growing a number of pot-plants around his work bench and regretting that the bounty placed on his head prevented him from visiting an Ithorian herdship that visited Ord Mantell. While the Ho'Din could speak Basic, it was often riddled with grammatical errors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Skivvers was created by Pablo Hidalgo for the Hyperspace-exclusive webstrip Rookies: Rendezvous, where the Ho'Din appeared in strips #23–27. Hidalgo mentioned the Ho'Din in some of the webstrip annotations he posted on his blog; there, he suggested that Skivvers is slightly shorter than the average Ho'Din, listed in the Ultimate Alien Anthology as 2.75 meters. When prompted by a poster, he also indicated that in the scene where Skivvers is modifying a blaster pistol on his desk, it is \"very, very likely\" the Ho'Din is modifying it to carry data in accordance with the technique depicted in Cracken's Rebel Field Guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}