{"url": "Skirmish_over_Saleucami", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War", "Category:Battles of Saleucami"], "nodes": [{"tag": "h1", "text": "Skirmish over Saleucami"}, {"tag": "p", "text": "The Skirmish over Saleucami occurred when Boba Fett, out to collect the bounty on captured Rebels, ambushed a small Rebel Alliance scout party led by Admiral Ackbar over Saleucami."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Shortly after the Evacuation of Yavin, the Alliance recovered a holocron that was made by Bail Organa in case the Alliance were to ever lose their base on Yavin 4. The holocron contained locations for possible new bases for the Alliance. Admiral Ackbar led a scouting party to the Graveyard world of Boz Pity, one of the locations listed on the holocron. After concluding that Boz Pity would make an ideal spot for a new base, Ackbar took a GR-75 medium transport along with a small detachment of the scouting party. They never made it."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Somehow the bounty hunter Boba Fett had learned that Ackbar was traveling to Saleucami, so the Mandalorian set up an ambush for them. When the transport jumped in-system, the Slave I attacked the transport from behind and disabled its engines. The bounty hunter then boarded the transport and captured the Mon Calamari admiral along with all the surviving crew and droids. It is unknown what happened to the transport although it is possible that it was destroyed or left to drift."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Fett sold Ackbar to the Galactic Empire, but kept the rest of crew and droids. Fett traveled to Tatooine and sold the men as slaves to the Hutt Cartel. Ackbar would later be rescued by Renegade Squadron in the Battle of Kessel and the rebel prisoners would be set free in a Mission to Mos Eisley."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}