{"url": "Skirmish_on_Vyndal", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Battles of the Great Jedi Purge", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Skirmish on Vyndal"}, {"tag": "p", "text": "A skirmish occurred between a group of villagers and the Galactic Empire on the planet Vyndal around five years before the Battle of Yavin. The Imperials, led by the Grand Inquisitor, were searching for the Jedi Kanan Jarrus, who had been taken in by the villagers after landing on Vyndal. The Imperials first visited the villager's protector Yeleb, who lied and claimed that they had not seen Jarrus. Sensing the lie, the Inquisitor ordered his stormtroopers to burn down the village, drawing out Jarrus and causing both the Jedi and Yeleb to attack. Yeleb received a mortal wound during the battle, causing Jarrus to flee through the village, drawing the Imperials away from fighting villagers. Jarrus then boarded one of the Imperials' Gozanti-class cruisers and set it to leave the planet before exiting the vehicles. The Imperials chased the vehicle off world believing Jarrus was still aboard."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Around five years before the Battle of Yavin,[source?] the Jedi Kanan Jarrus was forced to land on the planet Vyndal in the attack shuttle Phantom after being attacked by TIE/ln space superiority starfighters serving the Galactic Empire. Jarrus passed out, and was found by a pair of local villagers, who took him back to their village and nursed him to health. Jarrus was then brought before the village's protector, Yeleb, who was pretending to be a Jedi as well. Jarrus called Keleb out on his lie, and the protector at first attacked him for the accusation. After Jarrus avoided the attacks and saved a villager from a falling branch, Yeleb revealed his past. The pair then heard two Gozanti-class cruisers landing on the planet, and using macrobinoculars they viewed the Grand Inquisitor and at least six stormtroopers dismount. Jarrus warned Yeleb that the Inquisitor was dangerous, but the protector chose to go ahead with a plan to deceive the Imperial."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "The Imperials were on the planet searching for Jarrus, so when the Inquisitor visited Yeleb he lied and claimed that Jarrus wasn't in the village in the hope that the Imperials would leave. The Inquisitor sensed the lie and ordered his troopers to begin ransacking the village, burning each house to draw out Jarrus. As the troopers moved out, Jarrus attacked the Inquisitor and was soon joined in the battle by Yeleb. Meanwhile outside the troopers were attacked by at least three of the villagers, who hurled rocks at them and defended their homes. The Inquisitor used the Force to hurl Jarrus out of the fight, allowing him to strike a mortal blow to Yeleb. Seeing Yeleb fall, Jarrus the drew the Inquisitor away from him by fleeing toward the Gozanti cruisers. On his way to the ships he passed the stormtroopers and deflected one of their bolts back into them. He then boarded a cruiser and set it to take off, before exiting the vehicle unseen through the front. Believing Jarrus was leaving the planet, the Inquisitor ordered his troops to board the remaining cruiser and give chase."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the Imperials gone, the villagers and Jarrus returned to Yeleb, who was dying from his injuries. The Jedi assured the protector that his people were safe and that what he had done with his life had been noble. Thankful of the kind words,Yeleb then died. The villagers asked Jarrus to replace Yeleb as their protector, but he refused claiming he needed to help others against the Empire elsewhere in the galaxy and that the villagers were strong enough to survive alone."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish first appeared in \"The fake Jedi,\" a comic strip published in the third issue of the Star Wars Rebels Magazine 3. The issue was written by Martin Fisher and illustrated by Bob Molesworth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}