{"url": "Skirmish_with_an_Imperial_Star_Destroyer", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Skirmish with an Imperial Star Destroyer"}, {"tag": "p", "text": "In 4 ABY, a space battle took place between the Alliance to Restore the Republic and the Galactic Empire. An Imperial Star Destroyer attacked the Rebel Alliance's command ship Home One. The B1-series battle droid Roger turned the tide of the battle in the rebels' favor by accidentally catapulting himself into space and taking out the Star Destroyer's deflector shield generator. This allowed the Home One to destroy the Star Destroyer."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After obtaining a Type A vector coil, Admiral Ackbar decided to hire the Freemakers, a family of scavengers. The Freemakers had earlier incurred the wrath of the Emperor after Rowan Freemaker stole and destroyed the Kyber Saber, the most powerful weapon in the galaxy. The Freemakers' job was to service the Alliance Fleet's starfighters. After Roger's initial attempt to befriend the Rebel Alliance droids fell apart, he decided to build a buffer to win them over."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "While Roger was building the buffer, an Imperial Star Destroyer and its complement of TIE fighters attacked the Alliance fleet. The Alliance deployed several starfighters under Lieutenant Valeria but they were unable to break through the Star Destroyer's deflector shield. In response, the Freemakers were called to help ready more starfighters. Oblivious to the battle, Roger borrowed several spare parts including power cells and engines. He also created a block-up when he accidentally tossed a piece of machinery into a B-wing, causing it to explode."}, {"tag": "p", "text": "Roger then tested the buffer but accidentally catapulted himself into space. He crashed into the Star Destroyer's deflector shield generator, turning the tide of the battle. As a result, Admiral Ackbar ordered his forces to concentrate fire on the Star Destroyer, destroying it."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the skirmish, Roger was rescued by the StarScavenger. He was then awarded a medal by Admiral Ackbar in the presence of the other Freemakers and rebels. Roger also convinced the C1-series astromech droid Chopper to keep the accident a secret. He and Chopper then tested the buffer a second but forgot to refine the machine and were flung out into space."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The skirmish with an Imperial Star Destroyer serves as the main conflict of the LEGO Star Wars: The Freemaker Adventures Season Two animated short \"Thrown Into Battle\", which was released on the LEGO Star Wars website on May 4, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}