{"url": "Skirmish_on_the_deserted_moon", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Skirmish on the deserted moon"}, {"tag": "p", "text": "During the Galactic Civil War, a skirmish took place in a warehouse located on a deserted moon. It involved a squad of stormtroopers of the Galactic Empire and the smuggler Han Solo, as well as his co-pilot Chewbacca. Thanks to a contingent of battle droids that had stood dormant in the warehouse since the time of the Clone Wars, Solo and Chewbacca were able to defeat the Imperials and left the moon aboard their starship, the Millennium Falcon."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "While transporting supplies for the Rebel Alliance on their light freighter, the Millennium Falcon, the Corellian smuggler Han Solo and his Wookiee co-pilot Chewbacca tried to shake off Imperial-class Star Destroyers of the Galactic Empire. After losing their main deflector shield under enemy fire, the Rebels were forced to land on a nearby abandoned moon in order to make repairs. Once on the moon's surface, Solo and Chewbacca discovered a warehouse that contained a contingent of Clone Wars-era battle droids, along with their Multi-Troop Transports. The two successfully scavenged the parts they needed to repair the Falcon's burnt out droid brain."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Before the Rebels could leave the deserted moon with their repaired vessel, a squad of six Imperial stormtroopers entered the warehouse aboard a Lambda-class T-4a shuttle. Although outnumbered, Solo and Chewbacca found a way to overcome the Imperials by re-activating a number of the battle droids they had found earlier. When the droids saw the stormtroopers, they mistook those armored soldiers for their predecessors, the clone troopers of the Grand Army of the Republic, against which they had fought the Clone Wars. While the Imperials were trying to fend off their mechanical opponents, Solo and Chewbacca managed to get back into their starship, the Millennium Falcon, and left the moon for good."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}