{"url": "Skrilling/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Mammalian sentient species", "Category:Mid Rim species", "Category:Skrillings", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Skrilling"}, {"tag": "p", "text": "Skrillings were a sentient species native to the M'shinni colony world designated Agriworld-2079. Originally nomadic herders on their native planet, they made contact with the rest of the galaxy when their homeworld was colonized by the M'shinni. The Skrilling soon integrated themselves into the M'shinni colonies, with many leaving the planet to join modern, space-faring society. Known for their natural skills as scavengers, Skrillings could be found all over the galaxy, working odd jobs or as criminals—especially on war-torn worlds with many unclaimed corpses. Many Skrillings worked as spies for the Rebel Alliance during the Galactic Civil War. At least two Skrillings, Peerce and Ord Enisence, became Masters of the Jedi Order."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Skrillings were stocky humanoids, standing 1.5 to 1.9 meters tall, with wrinkled gray skin, deep set eyes, and eight breather tubes in place of a nose. They had several rows of sharp teeth for tearing meat, a bony ridge on their skulls running from their forehead to the nape of their neck (used by Skrilling hatchlings to break out of their eggs), and three-fingered hands with a vice-like grip."}, {"tag": "p", "text": "Their eight breathing tubes were among their most versatile organs. To help digestion, Skrillings used a mild digestive acid produced in glands inside their breathing tubes. This acid could also be sprayed from their breathing tubes as a defense mechanism, though it was not very dangerous unless it ended up in the target's eyes. To make up for poor eyesight, Skrillings relied on their keen sense of smell to discover food, by inhaling deeply through their breathing tubes. This produced a high-pitched whistle which could be heard for kilometers."}, {"tag": "p", "text": "Skrillings evolved from egg-laying carnivorous mammals on Agriworld-2079, a planet on the spinward side of the Mid Rim. They were scavengers by nature, feeding on the decayed carcasses of grazing herd animals. Skrillings could not digest meat that had not rotted for less than a week. Primitive Skrillings quickly developed a complicated system to share carcasses with one another in order to avoid conflicts over the best pieces. Once they made contact with other species, this system of ritualized requests and appeasements translated into what seemed to non-Skrillings as constant begging and bargaining."}, {"tag": "p", "text": "Skrillings were intelligent enough to recognize that non-Skrillings could be angered by too much of this, however, and generally tried to avoid conflicts. They were also masters at finding a being's weak point in a bargaining situation, and managed to get what they wanted more often than not."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the M'shinni arrived on Agriworld-2079, the Skrillings were primitive nomads. When the M'shinni rootlines took control and fenced in the planet's herd, the Skrillings were forced to adapt as their homeworld transformed into a large agricultural site, with high-tech farming and droid labor. Some started working for the M'shinni on their homeworld, becoming low-level employees and servants of various M'shinni rootlines. The M'shinni completely overwhelmed the indigenous Skrilling culture. For example, if the primitive Skrillings had a name for their homeworld before the M'shinni arrived, it had long been lost to history. Even the original name of their species was unknown: \"Skrilling\" was originally a derogatory nickname (meaning \"Bone Picker\") applied to them by the M'shinni."}, {"tag": "p", "text": "Other Skrillings worked for the M'shinni on their other agriworlds, or spread out into the rest of the galaxy. These Skrillings were often scavengers or second-hand merchants. Some of them wandered the spaceways in starships constructed from second-hand or salvaged parts. Skrilling wanderers often arrived on a planet soon after a battle, where they salvaged damaged machines. Some were even ghoulish enough to eat the corpses left behind after a battle, leading to the expression \"Skrilling fodder\" for one about to be killed. Skrillings of this sort often ended up in the entourage of the galaxy's criminal element."}, {"tag": "p", "text": "Some Skrillings managed to make their way into positions of high status. There were Skrilling Jedi, including the Jedi Master Peerce, one of the Jedi murdered by Aurra Sing on Coruscant in 30 BBY. One of the most famous criminal Skrillings was Pote Snitkin, a weapons smuggler who worked for Jabba Desilijic Tiure on Tatooine. Some more honorable Skrillings were valuable spies for the Alliance to Restore the Republic, using their natural wheedling abilities to get valuable information. Other Skrillings of the Galactic Civil War era were part of a struggle to free their people from M'shinni domination, though true to the Skrillings' nature, this was not an open, violent conflict."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}