{"url": "Skull_Squadron", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Imperial starfighter squadrons", "Category:Mandalorian organizations"], "nodes": [{"tag": "h1", "text": "Skull Squadron"}, {"tag": "p", "text": "Skull Squadron was a squadron of Fang fighters flown by Mandalorian Protectors who assisted the Galactic Republic during the Clone Wars. In the final months of the war, Skull Squadron was led by Skull Leader Fenn Rau, who commanded the Mandalorian squadron in the Third Battle of Mygeeto. During the battle, Jedi General Depa Billaba and Padawan Caleb Dume had been trapped by Separatist battle droids, and Rau led Skull Squadron to save their lives. Over fifteen years later, Dume, under the name \"Kanan Jarrus,\" met Rau on the third moon of Concord Dawn, and he offered to return the favor."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "Skull Squadron was comprised of at least nine Mandalorian Protectors, ancient Mandalorian warriors who served the ruler of Mandalore. The pilots of Skull Squadron were trained by Fenn Rau, the squadron's commander who held the callsign of \"Skull Leader.\" During the Clone Wars, Skull Squadron assisted the Galactic Republic, and when the Clone Wars ended and the Galactic Empire occupied Mandalore, Skull Squadron and the Protectors became Imperial allies, establishing a camp on the third moon of Concord Dawn."}, {"tag": "h3", "text": "Equipment"}, {"tag": "p", "text": "Skull Squadron consisted of nine Fang fighters, starfighters crafted specifically for combat. The starfighters were armed with wing-mounted laser cannons and a hidden proton torpedo port, and the Fang fighters' pivoting wings allowed for more maneuverability than other starfighters. These traits gave the pilots of Skull Squadron a distinct advantage in battle. In addition to the nine Fang fighters, Skull Squadron had reserve starfighters. The Fang fighters of Skull Squadron were decorated with a white and blue pattern of forked stripes, and the pilots wore matching flight suits and helmets. As Skull Leader, Rau's Fang fighter was decorated with a unique chevron pattern, and his flight helmet featured a red, stylized skull on the brow."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In the final months of the Clone Wars, Skull Squadron assisted the Galactic Republic during the Third Battle of Mygeeto, a campaign to liberate the war-torn planet from the forces of the Confederacy of Independent Systems. Jedi General Depa Billaba and her battalion battalion of clone troopers were tasked with clearing the Southern Mesas of all battle droids, so she, along with Padawan Caleb Dume, Clone Captain \"Styles,\" and the young clone trooper CT-1157 made their way through the Separatist forces. However, the four became stranded when the bridges of the mesa they traversed were destroyed, and they could not be extracted for an estimated two minutes. As they were quickly overwhelmed by dozens of B1-series battle droids, Rau, leading three other members of Skull Squadron, eliminated the droid threat, repeatedly flying into the Separatist fire to cover the Jedi. After two minutes of fighting, the droids were defeated, and Skull Squadron left as Clone Commander CC-10/994 arrived with reinforcements. Dume wished to meet Rau in person to thank him, but he wouldn't receive the chance until many years had passed."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "At the end of the Clone Wars in 19 BBY, the proclamation of the New Order saw the Republic's reorganization into the Galactic Empire. With the Imperial occupation of Mandalore, Skull Squadron and the Mandalorian Protectors established a camp on the third moon of Concord Dawn, and they formed an alignment with the Empire. The war's end also saw the destruction of the Jedi Order, although Dume managed to escape the slaughter, assuming the name \"Kanan Jarrus.\" Over fifteen years later, in 3 BBY,[source?] the rebellion against the Empire underwent a mission to the Concord Dawn system, hoping to secure a hyperspace route and become allied with the Protectors. When a rebel group led by Hera Syndulla entered the star system, they were met by Rau and two of his fighters. Rau refused Syndulla's offer, and Skull Squadron began firing upon the rebel RZ-1 A-wing interceptors. In the battle, Rau and Skull Squadron suffered a single casualty, while they destroyed three of the five rebel starfighters, also critically damaging Syndulla's, before she jumped to hyperspace. The other rebel survivor, Mandalorian Sabine Wren, informed the rebellion that the Protectors were led by Rau."}, {"tag": "p", "text": "When Jarrus—who had joined the rebels—heard Rau's name, he suggested a plan to infiltrate the Protector's camp. Jarrus and Wren entered the camp, and while the former Jedi went to meet Rau, Wren planted explosives on the parked Fang fighters of Skull Squadron. When Jarrus finally met Rau, he recounted how Skull Squadron had saved his life on Mygeeto. Jarrus then repeated Syndulla's offer, but Rau stated that his actions with Skull Squadron had been reckless, again turning the deal down. Before Jarrus could leave, Wren's presence was announced, and she invoked the Mandalorian code, challenging Rau's authority."}, {"tag": "p", "text": "In the subsequent duel, Wren disarmed Rau, and she detonated the explosives, destroying several starfighters. Rau retreated to his still-intact Fang fighter, and he fled from the base as his men engaged the two rebels. Jarrus and Wren were able to escape the fight, and they pursued Rau. The rebels caught the Protector leader, and they took him as a prisoner. One of Rau's subordinates offered to assemble the reserve starfighters, but Rau stated that there was no need. Fearing an Imperial lock down on the system, Rau also ordered his men to not speak about the rebel presence and grant passage to rebel starships. Skull Squadron was destroyed when Viceroy Gar Saxon and his Imperial Super Commandos discovered that they were allowing the rebels of Phoenix Squadron to travel through the Concord Dawn system."}, {"tag": "h2", "text": "Members"}, {"tag": "p", "text": "A legendary and respected veteran of the Clone Wars, Rau trained the pilots of Skull Squadron, and he also served as a flight instructor for the Grand Army of the Republic. Rau believed that many Mandalorians, such as the members of Death Watch, and the Imperial Super Commandos had forgotten their honor and obligations, but he felt that the members of Skull Squadron still demonstrated those duties."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Skull Squadron first appeared in Kanan 10, a comic book written by Greg Weisman, penciled by Pepe Larraz, and published by Marvel Comics. The comic was released on January 27, 2016 in conjunction with \"The Protector of Concord Dawn,\" an episode in the second season of Star Wars Rebels which featured Kanan Jarrus meeting Fenn Rau. Although the Fang fighters seen in \"The Protector of Concord Dawn\" are not explicitly identified, Star Wars: The Visual Encyclopedia states that Rau was still operating as Skull Leader, implying that the starfighters are Skull Squadron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}