{"url": "Barb_Mentir/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Members of the Ohnaka Gang", "Category:Weequays"], "nodes": [{"tag": "h1", "text": "Barb Mentir"}, {"tag": "p", "text": "Barb Mentir was a male Weequay and a member of Hondo Ohnaka's Florrum–based pirate gang. In 22 BBY, Mentir cooperated with fellow gang member Turk Falso to betray Ohnaka, who had captured Count Dooku, the leader of the Confederacy of Independent Systems. Ohnaka planned to hand the Sith Lord over to the Republic in exchange for a ransom in the form of spice. Falso betrayed Ohnaka and ordered Mentir to shoot down the Republic Nu-class shuttle that was carrying the ransom over Florrum so that they could steal the spice. Mentir succeeded in shooting the shuttle down, but failed to kill its passengers or obtain the spice. After Falso fell short in his own endeavor to claim the ransom, he and Mentir attempted to escape in a Flarestar-class attack shuttle. However, Dooku used the Force to choke Falso and manipulated him to shoot Mentir in the chest, killing him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Weequay, Barb Mentir was a member of Hondo Ohnaka's pirate gang, based on the planet Florrum. Some five years prior to the Clone Wars, Mentir was involved in a knife fight, where he lost his right eye. Afterward, he wore an eye patch to cover the empty socket. In 22 BBY, the Separatist leader Count Dooku crash-landed on the planet Vanqor. After eluding capture by two pursuing Jedi, Dooku encountered some members of Ohnaka's gang. Ohnaka managed to take the Sith Lord captive and transported him to his pirates' base of operations on Florrum. Ohnaka then contacted Supreme Chancellor Palpatine of the Galactic Republic and agreed to release Dooku into Republic custody for a hefty ransom of spice."}, {"tag": "p", "text": "After discussing the ransom with Ohnaka, Turk Falso, the group's second-in-command, met with Mentir and told him that the spice was on the way. Falso ordered Mentir to shoot down the Republic shuttle—which was transporting the spice—with his ship, being careful to not damage the spice itself. Mentir felt the plan was too risky and asked him about Ohnaka, but Falso allayed his fears and claimed that they would be long gone before Ohnaka realized what had happened. Mentir then took a Flarestar-class attack shuttle and waited in Florrum's atmosphere for the arrival of the Republic shuttle. After sighting the vessel, he first opened fire on it with his laser cannons, and then fired a pair of missiles, forcing the craft down."}, {"tag": "p", "text": "Mentir returned to the pirate base, where he reported to Falso. Mentir informing Falso that the shuttle had crashed in the Doshar fields, but due to suspected survivors, he had failed to obtain the spice. The pirate balked at completing the mission, wanting instead to reveal to Ohnaka what they had done, but Falso threw him to the ground and ordered him not to do so. Falso then took a group of cohorts to recover the spice himself, but was repelled by the surviving Republic Representative Jar Jar Binks clone troopers. Falso lied to Ohnaka, telling him that the Republic had sent an army instead of a ransom. Hoping to escape the planet aboard a Flarestar-class vessel, Falso found Mentir, who questioned if they would leave without the spice. Falso replied that it would not be long until Ohnaka discovered their treachery. Not realizing that Dooku had sneaked up behind them, Falso was choked and manipulated into aiming his blaster at Mentir and shooting him in the chest, killing him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Mentir followed the orders given by Falso, but he also questioned him, especially when they lost the spice. He feared Ohnaka, going as far as to suggesting that they should tell him about their deception. Mentir was a pilot skilled enough to fly a Flarestar-class ship and shoot down a Nu-class shuttle piloted by experienced clone trooper pilots. Mentir had green eyes and brown skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Barb Mentir first appeared as an unidentified pirate in \"The Gungan General,\" the twelfth episode of The Clone Wars television series, which aired on January 9, 2009. The character was identified by name in the Decoded re-airing of the episode. Mentir was voiced by James Arnold Taylor, who also provides the voice of Obi-Wan Kenobi throughout the series. In the 2011 non-canon video game LEGO Star Wars III: The Clone Wars, in the level that adapts \"The Gungan General,\" the Republic shuttle is shot down by a Weequay pirate in the opening cutscene. However, the pilot is not identified as Mentir, and the game actually uses the model of Shahan Alama to represent the Weequay."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}