{"url": "SkyeWalkers:_A_Clone_Wars_Story", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Legends eNovellas"], "nodes": [{"tag": "h1", "text": "SkyeWalkers: A Clone Wars Story"}, {"tag": "p", "text": "SkyeWalkers: A Clone Wars Story is a Clone Wars–themed novella written by Abel G. Peña. Originally commissioned for Hyperspace: The Official Star Wars Fan Club in 2011, it served as a prequel to the 1979 story Star Wars Annual 1, written by Chris Claremont and illustrated by Mike Vosburg. The creation of SkyeWalkers: A Clone Wars Story lasted three years, which explains why Peña was absent from publishing between 2008 and 2011. That project, however, was put on hold for several years, and the novella was only released on StarWars.com in 2015, as part of \"The Other Lost Missions: Rare Clone Wars Comics and Literature, Part 2.\" The released version also included \"Lone Wolf: A Tale of Obi-Wan and Luke,\" a narrative centered on Obi-Wan Kenobi in the immediate aftermath of the Clone Wars."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In the year 22 BBY, the planet of Skye has been taken over by Zeta Magnus, a genetics terrorist whom the Galactic Republic suspects to  work hand in glove with the enemy Confederacy of Independent Systems and its leader Count Dooku. After Palpatine, Supreme Chancellor of the Republic, demands that Magnus be put on trial on the galactic capital of Coruscant, the Jedi Order decides to intervene. The Jedi Knight Obi-Wan Kenobi is dispatched to Skye with his Padawan learners Anakin Skywalker and Halagad Ventor. Using a relief mission as a smoke screen, the Jedi strike team is to apprehend Magnus with the help of a brand new clone commando unit. Upon landing on Skye and meeting the enslaved S'kytri people, the Jedi and the Tark Squad clone commandos plan to attack Magnus' citadel by traveling through the Entyrmion, a subterranean cavern complex. In the Entyrmion, however, they are attacked by several Oskan blood eaters planted there by Magnus."}, {"tag": "p", "text": "After overcoming the creatures, the Republic strike team manage to enter Magnus' fortress at the summit of mount Canaitith. In the mean time, the S'kytri of the Highland and Lowland clans launch into battle against the Outland Clanners. While searching the citadel, the Jedi are betrayed by the Tark Squad. It transpires that the so-called clones are in fact Sun Guards allied with Magnus, who have managed to take the place of the real commando. When the Jedi wake up in the midst of Magnus' laboratory, the terrorist himself stands before them and decides to expose his plans. He intends to scan the brains of his prisoners and implant them in clone bodies that have already started to grow. He is interrupted by Kharys, a young S'kytri warrior, who manages to free the Jedi. Magnus heads for his ship with his droid, Blue-Tark, as Halagad Ventor gives him chase. Still at the laboratory, Obi-Wan Kenobi and Anakin Skywalker confront the Sun Guards. In the citadel's hangar, Ventor loses several fingers and chunks of his flesh while fighting Magnus, but eventually manages to bissect the enemy with his lightsaber."}, {"tag": "h2", "text": "Main characters"}, {"tag": "h3", "text": "Anakin Skywalker"}, {"tag": "p", "text": "When Qui-Gon Jinn of the Jedi Order discovered him on Tatooine, Anakin Skywalker was a nine-year-old slave boy and a child prodigy. Born to Shmi Skywalker in 41.9 BBY, the boy was conceived by the midi-chlorians, symbiotic organisms that allow individuals to touch the Force. Under the tutelage of Obi-Wan Kenobi, former apprentice of the late Qui-Gon Jinn, Skywalker is becoming one of the most powerful Jedi Knights ever, and some even regard him as the Chosen One of an ancient Jedi prophecy. However, his brash, unruly attitude often get the better of him. Ten years after joining the Jedi Order, Skywalker returned to Tatooine, where he discovered that his mother had been abducted by a tribe of Tusken Raiders. When he found her dead at their camp, Skywalker massacred the whole tribe. He also broke the Jedi rule forbidding attachments when he fell in love with and secretly married Senator Padmé Amidala. With the outbreak of the Clone Wars, Skywalker has been made a Jedi Knight, and his skills are put to good use during the conflict. He now fights alongside his master, General Kenobi, and his best friend, Halagad Ventor."}, {"tag": "h3", "text": "Obi-Wan Kenobi"}, {"tag": "p", "text": "Born on Stewjon in 57 BBY, Obi-Wan Kenobi joined the Jedi Order as an infant. Shortly before his thirteenth birthday, he became the Padawan learner of the Jedi Master Qui-Gon Jinn. During the Invasion of Naboo, Kenobi lost his mentor at the hands of a mysterious Sith warrior named Darth Maul, whom the Padawan left for dead after cutting him in twain with his lightsaber. Heeding the dying words of Qui-Gon Jinn, Kenobi agreed to teach the ways of the Force to Anakin Skywalker, a slave boy from Tatooine. After a decade of mentoring, the Jedi Knight Obi-Wan Kenobi has become wise and cynical beyond his years, and his rebellious apprentice often gives him cause for concern. With the onset of the Clone Wars, Kenobi now serves as a general in the Galactic Republic's army, leading clone troopers on the battlefield. He has also taken Halagad Ventor, Padawan of the late Master Ettene, under his wing."}, {"tag": "h3", "text": "Halagad Ventor"}, {"tag": "p", "text": "Much like his friend Anakin Skywalker, the Alderaanian Halagad Ventor is one of a kind. Born in 47 BBY to Ean and Zollet Ventor, Ventor has always been strong in the Force. However, his telling midi-chlorian count was never tested in his childhood, due to some oversight by Jorus C'baoth, the Jedi Watchman of Alderaan. Until the age of seventeen, he lived a scholarly life, studying in the Royal Library of Alderaan, yet still aspiring to become a Jedi. After his parents died in a gruesome incident, he began to teach himself the ways of the Jedi. Eventually, he gained admittance to the Almas Jedi Academy, where he found himself a teacher, Master Everen Ettene. Since Ettene's untimely demise on Virgillia 7, Ventor has served under General Obi-Wan Kenobi. He has developed a bond of friendship and mutual understanding with Skywalker, and considers General Kenobi to be his new master. Sometimes, Ventor is envious of Kenobi's paternal attitude toward Skywalker."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The eNovella SkyeWalkers: A Clone Wars Story is the brainchild of Abel G. Peña, who notably authored dozens of Star Wars fiction and nonfiction articles for Star Wars Insider, Star Wars Gamer, and The Official Star Wars Fact File. It was written to serve as a prequel to the 1979 Marvel comic Star Wars Annual 1, written by Chris Claremont and illustrated by Mike Vosburg. A big Marvel fan, Abel G. Peña was fond of The Long Hunt. He also held a keen interest in the character of Halagad Ventor, who originated in Domain of Evil, a 1991 supplement for Star Wars: The Roleplaying Game published by West End Games. As early as 2006, Peña had a desire to involve Ventor in Obi-Wan Kenobi and Anakin Skywalker's mission on Skye, as it was alluded to in  The Long Hunt."}, {"tag": "p", "text": "Eventually, SkyeWalkers: A Clone Wars Story was commissioned for Hyperspace: The Official Star Wars Fan Club, where it would be released as an eNovella. Peña worked on that story for three years, from 2008 to 2011. However, the Hyperspace Fan Club was discontinued in late 2011, and SkyeWalkers was put on hold for several years. On March 6, 2015 the story was finally released in PDF format on StarWars.com, as part of the article series \"The Other Lost Missions: Rare Clone Wars Comics and Literature.\" The PDF also included \"Lone Wolf: A Tale of Obi-Wan and Luke,\" a 75-page narrative of Obi-Wan Kenobi facing the realities of a Jedi outcast in the immediate aftermath of the Clone Wars. The design of the PDF file was handled by Jason Yuo, and the cover illustration was created by David Rabbitte."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The narrative spine of SkyeWalkers: A Clone Wars Story was primarily built upon events that were only alluded to in Star Wars Annual 1: The Long Hunt. In that comic, Aragh informs Luke Skywalker that, during the Clone Wars, the Jedi Master Obi-Wan Kenobi and his two apprentices saved Skye from destruction. That basic premise was followed in SkyeWalkers."}, {"tag": "p", "text": "However, Aragh also says that the first of Kenobi's pupils came back years later as Darth Vader, and that the third Jedi carried the lightsaber inherited by Luke Skywalker, implying it was Luke's father. That statement became a continuity error in 1980, when Star Wars: Episode V The Empire Strikes Back revealed that Vader was none other than the Sith alter ego of Luke's father, Anakin Skywalker. Abel G. Peña and Rich Handley fixed the discrepancy in the 2007 article Aliens in the Empire, Part 2: To a Traitor Go the Spoils, explaining that Skywalker and Ventor were the two Jedi who accompanied Kenobi on Skye, and the two had temporarily switched lightsabers for the ancient Jedi ritual known as the Concordance of Fealty. That explanation allowed Anakin Skywalker and the wearer of Luke's weapon to be different people. That element was also retold in SkyeWalkers: A Clone Wars Story."}, {"tag": "p", "text": "Originally, the 2005 reference book The New Essential Chronology dated the Battle of Skye to 21 BBY, more precisely 1 year, 1–2 months after the Battle of Geonosis. During that battle, Anakin Skywalker was still supposed to be a Padawan. However, the new time line established by the animated TV series Star Wars: The Clone Wars made it clear that Skywalker was knighted near the start of the war, in 22 BBY. As a consequence, the majority of stories that assumed Skywalker was still a Padawan until later in the war had to be compressed into the early first year of the conflict. In keeping with that, a note at the beginning of SkyeWalkers: A Clone Wars Story states that the events in the story occur between the films Star Wars: Episode II Attack of the Clones and Star Wars: The Clone Wars, which both take place in 22 BBY."}, {"tag": "p", "text": "Peña regards SkyeWalkers as a \"celebration of continuity—the textural glory of the galaxy far, far away—that [he has] always loved and aimed for.\" As a consequence, the novella uses elements that originated in many Expanded Universe works. The fact that ancient Jedi researched cloning originated in Galaxy of Fear: Clones, the eleventh book in the young readers Star Wars: Galaxy of Fear series. The name of the Triplehorn mountains came from the third installment of the same series, Galaxy of Fear: Planet Plague."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}