{"url": "Skywalker_lightsaber", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles to be expanded", "Category:Personal lightsabers", "Category:Vergences"], "nodes": [{"tag": "h1", "text": "Skywalker lightsaber"}, {"tag": "p", "text": "The Skywalker lightsaber, also known at various times as Anakin's, Luke's, and Rey's lightsaber, was a blue-bladed Jedi lightsaber constructed by Anakin Skywalker—Jedi Knight and prophesied Chosen One of the Force—during the final years of the Republic Era. Built as a replacement for his first lightsaber, Anakin wielded his new weapon as a Jedi General of the Grand Army of the Republic, leading clone troopers against the Separatist Droid Army on numerous battlefronts across the galaxy-wide conflict known as the Clone Wars. He fought a variety of opponents from battle droids to Force-sensitive combatants such as Asajj Ventress, Savage Opress, Barriss Offee, and Count Dooku."}, {"tag": "p", "text": "Though an instrument of the Jedi Order, the Skywalker lightsaber was used to kill Jedi in the siege of the Jedi Temple during Order 66 and the Great Jedi Purge. Darth Vader, the dark side persona of Anakin Skywalker, slaughtered a group of Jedi younglings on Coruscant before journeying to Mustafar, where he executed the Separatist Council on behalf of his new Sith Master, the Galactic Emperor Darth Sidious. Vader subsequently lost his weapon as a result of his defeat by Jedi Master Obi-Wan Kenobi, who kept the Skywalker lightsaber for almost two decades during the Imperial Era. Kenobi ultimately gave the lightsaber to Anakin's son, Luke Skywalker, who wielded it while training as a Jedi apprentice. It was lost on Bespin where Luke confronted his father."}, {"tag": "p", "text": "The Skywalker lightsaber eventually fell into the possession of Maz Kanata, a friend of the Skywalker family who kept the Jedi weapon hidden in her castle on Takodana during the New Republic Era. Through the Force, the lightsaber called to a Force-sensitive scavenger from Jakku, Rey, who rejected it. During the Battle of Takodana, Kanata gave the lightsaber to Finn. After besting the rogue Stormtrooper, Kylo Ren—the grandson of Darth Vader—tried to claim the weapon that once belonged to his grandfather. Instead, it was taken by Rey. Despite her earlier rejection of it, the scavenger took up the Skywalker lightsaber and engaged Ren in their first lightsaber duel. Following the Battle of Starkiller Base, Rey tracked Luke Skywalker to Ahch-To, but the Jedi Master refused to take back his old lightsaber. It was later sheared in half by Ren and Rey, but the scavenger managed to repair the lightsaber. It remained in Rey's possession until her arrival on Exegol, where she relinquished it to a redeemed Ben Solo, placing the legendary blade back in the hands of a Skywalker. In the aftermath of the Battle of Exegol, Rey buried the famed lightsaber alongside Leia Organa's saber, on Tatooine, the desert homeworld of Anakin and Luke."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Like every lightsaber of the Jedi Order, Anakin Skywalker's lightsaber was powered by a kyber crystal in the core of the hilt. As with his previous lightsaber, the new one emitted a blue high-energy plasma blade due to the crystal's connection with its first owner. The blade was contained in a \"kyber-powered permeable suspension field.\""}, {"tag": "p", "text": "The hilt was twenty-eight centimeters long, cylindrical in shape, and made of alloy metal and carbon composites. In addition to the crystal, the Skywalker lightsaber possessed other components such as a power cell at the base of the hilt, an activation matrix, black rubberized grip ribbing, a ring tuning flange, a magnetic stabilizing ring and emitter, and a mechanism to adjust the length of the blade. Based on its design, the Skywalker lightsaber was wielded with the upper hand gripping the hilt for support while the lower hand directed the blade. It was also able to function underwater."}, {"tag": "p", "text": "Rey's efforts to reconstruct the Skywalker lightsaber altered its appearance. The two halves of the hilt were welded back together, creating weld marks on the weapon's middle area. Additionally, Rey fastened her leather wrist strap around the center of the hilt, including the refitted activation matrix, further binding the once broken pieces together. The once broken kyber crystal remained inside the hilt, having been repaired through a Jedi technique performed by Rey."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Carried by Anakin Skywalker"}, {"tag": "h4", "text": "Weapon of a Jedi"}, {"tag": "p", "text": "On Geonosis, Anakin Skywalker's first lightsaber was destroyed by a mechanical cutting arm when he was fighting his way through Poggle the Lesser's battle droid foundries. During the First Battle of Geonosis, Anakin made use of a green-bladed lightsaber lent to him by another Jedi, but it was destroyed during a duel with Count Dooku."}, {"tag": "p", "text": "At some point between his ordeal on Geonosis and the battle of Christophsis, Anakin Skywalker built himself a new lightsaber."}, {"tag": "p", "text": "When Count Dooku was forced to crash land on Vanqor, Skywalker and Obi-Wan Kenobi pursued him into a cave. However, Dooku then caused a cave in, which buried Skywalker and separated him from Kenobi. Dooku then took his lightsaber, hiding it alongside his and then arranged for transportation with Hondo Ohnaka and his pirate gang aboard their ship to Florrum. However, Dooku lost both his and Skywalker's lightsaber to the pirates. When Kenobi and Skywalker came to check on their claim, Skywalker tried to take his lightsaber back from Pilf Mukmuk to no avail. Skywalker was then able to retrieve his weapon from Mukmuk, free himself and Kenobi and hold Ohnaka hostage until Jar Jar Binks arrived."}, {"tag": "p", "text": "At one point, Anakin demonstrated his take on the fourth form of lightsaber combat by using his lightsaber to deflect several blaster bolts. He advised his students to heed his teachings as they practiced with his techniques, promising that it would serve them well in battle. The lesson was saved as a holographic recording, and stored within a Jedi holocron that came into the possession of former Padawan Kanan Jarrus. Ezra Bridger, who was Jarrus' apprentice, used the holocron's recording as a tool to refine his own lightsaber skills. In the process, Bridger became awed by the skills of Anakin, whom he considered to be an amazing swordsman."}, {"tag": "p", "text": "Skywalker later used this weapon to duel and defeat Dooku, also known as the Sith Lord Darth Tyranus, during the Battle of Coruscant. Alongside Dooku's own lightsaber, Anakin used it to kill the Sith Lord by cutting off his head. Anakin later lost the weapon while effecting the rescue of Supreme Chancellor Sheev Palpatine and it was retrieved by one of General Grievous's IG-100 MagnaGuards. The weapon was then given by the MagnaGuard to Grievous, who briefly wielded it, but Obi-Wan used a trick of the Force to recover it and returned it to Anakin. He would wield this weapon until he took the mantle of Vader."}, {"tag": "h4", "text": "Weapon of a Sith"}, {"tag": "p", "text": "As Darth Vader, he later used the weapon to murder many of his fellow Jedi during the implementation of Order 66 and his Siege of the Jedi Temple; among those who fell to his blade were Cin Drallig, Whie Malreaux, Shaak Ti and an entire clan of younglings. After this, he used the saber to assassinate the entire Separatist Council on his Mission to Mustafar. He would use the weapon to duel his former master on Mustafar. However, Vader lost the weapon when he was defeated and crippled, the lightsaber falling from his hand to the ashy shores. Reluctantly leaving his former apprentice to burn in the lava, Kenobi retrieved the lightsaber and took it with him."}, {"tag": "h3", "text": "Carried by Luke Skywalker"}, {"tag": "h4", "text": "From father to son"}, {"tag": "p", "text": "Anakin's lightsaber remained in Obi-Wan's possession for nineteen years until he was given an opportunity to give the weapon to Luke, Anakin's son, after rescuing the young Skywalker from a Tusken Raider attack. At his home, Kenobi presented Skywalker with his father's lightsaber stating that his father wanted him to have it when Skywalker was old enough but his uncle Owen Lars wouldn't allow it as he thought Skywalker would follow in his father's footsteps and join Kenobi on some \"damn fool idealistic crusade.\""}, {"tag": "p", "text": "Following the death of his aunt and uncle, Skywalker became Kenobi's apprentice and started to learn the ways of the Jedi. During his voyage to Alderaan, Skywalker began training with the weapon onboard the Millennium Falcon where he used the Jedi form of Form I, to deflect blaster bolts from a training remote."}, {"tag": "h4", "text": "Usage on Cymoon 1"}, {"tag": "p", "text": "Following Kenobi's untimely demise at the hands of Darth Vader and the subsequent Battle of Yavin, Skywalker began to teach himself how to wield his father's weapon. On the moon of Cymoon 1, Skywalker participated in an assault to infiltrate and destroy the Weapons Factory Alpha. After the Force guided Skywalker to a cage filled with Imperial slaves, he was confronted by a guard. Skywalker first attempted to use a Jedi mind trick to ward the guard off, but when that failed, Skywalker ignited his lightsaber and sliced the guard's hand off, allowing Skywalker to break the slaves out of their cage and lead them to the other Rebels."}, {"tag": "p", "text": "When he found out that Darth Vader had arrived on the moon, Skywalker searched for him in the facility, as he still believed that Vader was the man who killed his father. As Skywalker approached the Dark Lord, he had his lightsaber drawn and activated as he came face to face with his father's so-called killer."}, {"tag": "p", "text": "Vader mocked Luke for his lack of training in lightsaber combat, and he easily pulled the lightsaber out of Luke's grasp through the Force. However, before Vader could strike the unarmed Luke down, he suddenly recognized Luke's lightsaber as his own former weapon. Luke managed to escape from Vader after Han Solo and Leia Organa broke through the wall with a stolen AT-AT, while Vader used Luke's lightsaber to kill several escaped slaves. Luke was able to retrieve the weapon when Vader was shot at using the walker's guns, and continued to use it, but the encounter left Vader eager to convert Luke to his side."}, {"tag": "h4", "text": "Usage on Tatooine"}, {"tag": "p", "text": "When Skywalker returned to Tatooine to learn more about the ways of the Jedi, Skywalker used his lightsaber to defend himself against Tusken Raiders that were raiding Kenobi's home, managing to scare them off. He also used it against the bounty hunter Boba Fett, who was sent by Vader to capture and learn more about Skywalker. Though Luke managed to escape from Fett, the bounty hunter was still able to inform Vader of Luke's surname, which would make Vader even more obsessed with finding young Skywalker."}, {"tag": "h4", "text": "Stolen on Nar Shaddaa"}, {"tag": "p", "text": "After escaping Tatooine, Luke felt that he had to visit the Jedi Temple on Coruscant. To find someone that would take him safely to Coruscant, he traveled to Nar Shaddaa. After entering a bar, the Zabrak bartender ordered the bar's patrons to kill him. As he was about to be attacked by the mob of customers, Luke ignited his lightsaber in defense. The bartender stopped, and offered to sneak him onto Coruscant in return for the lightsaber. Skywalker declined the offer, so the bartender once again told his customers to kill him. Luke tried to defend himself, but the lightsaber was stolen by a thief, who ran off with it."}, {"tag": "p", "text": "Luke chased after the thief, who leapt off a roof and grabbed onto a passing ship. Luke leapt after him, knocking both the thief and his lightsaber to the ground. After landing, Luke retrieved his lightsaber, but turned around to find Grakkus the Hutt behind him, declaring the lightsaber his property. Luke refused, and Grakkus sent two IG-100 MagnaGuards after him. He tried to fight back, but one of the droids struck him with its electrostaff, knocking him to the ground. Grakkus knocked Skywalker out, taking both him and his lightsaber to his palace. Once at Grakkus' palace, Luke was sent to face off against a man known as \"the Gamemaster,\" who returned his lightsaber to him. At first, Luke was unsuccessful in defending himself against the Gamemaster, who managed to knock him down onto the ground. Luke continued to duel, both against the Gamemaster, and then against several more MagnaGuards. Grakkus then put Luke up against \"Kongo the Disembowler,\" but gave him a lightsaber that was not his own."}, {"tag": "p", "text": "While Luke was fighting against the roggwart, R2-D2 found his lightsaber, and returned it to Luke, who was being dragged away by several TIE fighter pilots. Luke retrieved his weapon and cut the pilots down, but was confronted by the Gamemaster, who revealed that he was an Imperial stormtrooper. Before he could take Luke prisoner, he was grabbed by Grakkus, and Luke, who had escaped him, was rescued by his friends."}, {"tag": "h4", "text": "Usage on Vrogas Vas"}, {"tag": "p", "text": "Still seeking knowledge of the Jedi, Skywalker visited Vrogas Vas, learning that a Jedi Temple existed on the planet. With the help of Doctor Aphra, Vader tracked Luke there, but Luke collided his X-wing into Vader's TIE Advanced, causing them to both crash on the planet. Aphra, who had followed Vader to Vrogas Vas, managed to locate and kidnap Luke with the help of the protocol droid 0-0-0. Han Solo and Chewbacca also arrived on the planet, and encountered Aphra. Chewbacca tore one of Triple-Zero's arms off, allowing Luke to escape. Luke activated his lightsaber, cutting the droid's second arm off, before stabbing his lightsaber through Triple-Zero's torso. Although Triple-Zero survived, the damage he sustained slowed him down, letting Luke, Han, Chewbacca, and R2-D2 escape."}, {"tag": "h4", "text": "Defending the Harbinger"}, {"tag": "p", "text": "During the Rebel Alliance's attempt to hijack the Imperial I-class Star Destroyer Harbinger, the Star Destroyer was boarded by SCAR Squadron, led by Sergeant Kreel, who Luke had encountered as the Gamemaster on Nar Shaddaa. Kreel and Luke met, and Luke defended himself with his lightsaber, dueling Kreel. As they fought, Darth Vader arrived above Tureen VII, and ordered Kreel to keep Luke alive. Kreel managed to knock Luke down while he was distracted by Vader's presence, but Luke pushed him back, trapping him under a pile of debris."}, {"tag": "h4", "text": "Mission to the Vagadarr system"}, {"tag": "p", "text": "After reading a journal entry written by Kenobi, Luke ventured to a planet in the Vagadarr system, where he met Garro, a former Rockhawker who had taught Yoda in the ways of the stonepower. Garro, who needed Luke's life force to kill what was left of the giants who once inhabited the planet, attacked him with several knives made of blue stone. Luke drew his lightsaber, telling Garro that he would rather let the creatures live. He deflected several knives that Garro aimed at him, and Garro realized what he had to do, sacrificing himself to bring life to the planet again. Luke then used his lightsaber as a source of light when entering the caves of the great mountain."}, {"tag": "h4", "text": "Usage on Ktath'atn"}, {"tag": "p", "text": "Doctor Aphra, wishing to get the Queen of Ktath'atn to activate her Rur crystal, went to Ktath'atn with Luke Skywalker, hoping that the Queen would trade him for the crystal's activation. However, the Queen did not intend to provide anything in return, setting Abersyn symbiotes loose on them. As Luke and Aphra escaped through the Citadel of Ktath'atn, Luke stopped, drawing his lightsaber to hold off a horde of possessed zombies. Before he could do so, Han Solo crashed Aphra's ship, the Ark Angel II, nearby. Sana Starros, who had been on the ship, shot at Aphra, but Luke blocked it with his lightsaber. They were then forced to run from the Queen's servants, and Luke continued to use his lightsaber to deflect the shots they were firing."}, {"tag": "p", "text": "After Luke was taken prisoner by the Queen, who wished to feed on his Jedi energy, his lightsaber was taken from him and placed on a table nearby. Luke managed to break free of the machine he was held in, and retrieved his weapon, brandishing it at the Queen. The Queen disappeared in front of him, reappearing nearby. Before the Queen could attack, Aphra triggered an explosion, breaking through the wall. One of the Abersyn symbiotes infected Luke, and he faced off against the Queen. With the help of Eternal Rur, Luke broke free from the parasite, and struck the Queen down with his lightsaber."}, {"tag": "h4", "text": "Stranded"}, {"tag": "p", "text": "After he and Leia crashed on an ocean planet, Luke was forced to use his lightsaber in combat against the native wildlife, such as the spikeshark. Three weeks after they had crashed, they discovered the existence of an aquatic species native to the planet. When first encountering the species, Luke ignited his lightsaber, but put it away when he realized the creatures were harmless. Knowing their presence on the planet endangered the species, they drew the Empire, who had been searching the planet for them, onto the island they were stranded on. The Imperials attacked the island with walkers and shoretroopers, and Luke used his lightsaber to kill several troopers. Luke and Leia managed to defeat the Imperial forces, and escaped the planet."}, {"tag": "h4", "text": "Usage on Jedha"}, {"tag": "p", "text": "On the moon of Jedha, Luke used his lightsaber to defend several members of the Partisans from a group of snowtroopers. As they escaped on a spamel, Luke deflected shots from a patrol transport, allowing them to reach the Millennium Falcon unharmed. While in the settlement of Ai-jed, Luke noticed several stormtroopers incinerating the residents. Before anyone could plan a counterattack, Luke drew his lightsaber and attacked the stormtroopers, killing the entire group. The incident made Luke understand what was at stake on Jedha, and he wished to do more to help."}, {"tag": "p", "text": "Benthic took him to destroy a drill citadel that the Empire had dropped onto the moon. Luke used his lightsaber to carve a hole in the drill, allowing them to enter. After the drill citadel had been destroyed, Luke went with Chulco Gi to visit the shrine of the Central Isopter. On their way to the shrine, they were attacked by a sand slug, and Luke killed it with his lightsaber. They were met by several cultists, who spoke to them. Gi was corrupted by the dark side of the Force, attacking Luke. With no other choice, Luke killed Gi with his lightsaber. Luke later used his lightsaber to break out of a storage crate on the Leviathan. Once aboard the crawler, he confronted Kanchar, and fought with him. Kanchar used his cybernetic arm to defend himself, knocking Luke back using a flamethrower. Luke disabled Kanchar's cybernetics with an ion torpedo, allowing him to knock the officer unconscious."}, {"tag": "h4", "text": "Mission on Mon Cala"}, {"tag": "p", "text": "As part of the Rebel Alliance's mission to recruit the Mon Cala Mercantile Fleet, Leia led a team to rescue the changeling Tunga Arpagion from the Dex Acquisitions Depot on Meor Ain. When R2-D2 was unable to open the door to the cell, Luke used his lightsaber to cut the panel out of the door so that Chewbacca could knock it down."}, {"tag": "p", "text": "Their mission later took them to Strokill Prime, where the Mon Calamari king, Lee-Char, had been imprisoned. Once they were under the surface of the planet's ocean, their submersible was attacked by an opee sea killer. Luke exited the craft, telling Han to disable its lights. After swimming away, Luke ignited his lightsaber, drawing the creature away from the craft. As the creature moved to attack Luke, he was saved by Chewbacca, who tried to tell him to turn his lightsaber off. Unable to understand him, Luke kept the lightsaber on, and Han had to interrupt and translate the words Chewbacca was saying. Luke switched off his lightsaber, causing the opee sea killer to crash into a rock wall nearby."}, {"tag": "h4", "text": "Usage on Crait"}, {"tag": "p", "text": "In an attempt to find a new base of operations for the Rebellion, Luke visited the planet of Crait with Leia, Han, Chewbacca, and several other rebels. Their guide, Trusk Berinato betrayed them, and had signaled the Empire, who sent Kreel's SCAR Squadron to fight the rebels. While fighting the stormtroopers on V-4X-D ski speeders, Luke was shot down, and his speeder crashed. Kreel confronted him, drawing his lightsaber. Luke ignited his own lightsaber, defending himself from Kreel. As they fought, several vicious worms emerged from below the ground. The worms grabbed onto Kreel, trapping him. While Kreel was distracted by the worms, Luke swung his lightsaber at Kreel's, destroying it. Kreel managed to survive the duel, however, and fled the planet."}, {"tag": "h4", "text": "Usage on Hoth"}, {"tag": "p", "text": "When Skywalker was captured by a wampa, a creature native to the ice planet of Hoth, he found himself hanging upside down from the ceiling of a cave that the wampa resided in. Seeing his lightsaber on the ground, he used the Force to call the weapon to him, cutting himself free and slicing off one of the wampa's arms allowing him to escape."}, {"tag": "p", "text": "When Solo found Skywalker nearly frozen to death, he used the lightsaber to cut open his dead tauntaun and keep Skywalker warm while he put up shelter."}, {"tag": "p", "text": "During the Battle of Hoth, Skywalker used the combined ability of a grappling device and his lightsaber to cut open a hatch on the bottom of an Imperial AT-AT walker prior to throwing in an explosive to destroy the enemy vehicle."}, {"tag": "h4", "text": "Usage on Dagobah"}, {"tag": "p", "text": "During his training with Jedi Master Yoda on the planet Dagobah, Skywalker entered a cave that was strong with the dark side as a test given by Yoda. In the hollow, Skywalker had a vision in which he faced Darth Vader, the Dark Lord of the Sith. As Skywalker used his lightsaber to decapitate Vader with a high lightsaber blow, the illusory Sith Lord's helmeted head rolled on the floor, and the face shield cracked open to reveal the young Jedi's own countenance behind the mask."}, {"tag": "h4", "text": "Usage on Bespin and loss"}, {"tag": "p", "text": "Following his duel in the dark side cave, Skywalker received a Force vision of his friends being in danger on the Cloud City on Bespin. There, he faced Darth Vader in a lightsaber duel, where Skywalker demonstrated his new found skills with the weapon that impressed even the former wielder. However, Vader ultimately won the duel when he sliced Skywalker's hand off that was holding his lightsaber and it fell, along with the lightsaber it carried, into the depths of Cloud City, leaving Luke defenseless."}, {"tag": "p", "text": "Shortly after recovering from his injuries and replacing his severed hand with a synthetic one, Luke returned to Cloud City in an attempt to retrieve his weapon. Journeying to one of the smelting chambers located at the station, Luke enlisted the help of the station's Ugnaught population in order to find his lost weapon in the vast amount of garbage the chamber had collected. In his first attempt, Luke gave a description to the Ugnaught workers, but ultimately resulted in failure as not one of them recognized his description. Not knowing what else to do, Luke reached out with the Force and received a vision of many events he had or would encounter, but ultimately realized that Leia was in trouble and rushed off to rescue her. The vision also helped him realize that a Jedi was more than one's weapon and that a lightsaber was simply a tool which a Jedi used, resulting in him ending his search for the lightsaber. However, shortly afterwards, one of the Ugnaught workers stumbled across the weapon."}, {"tag": "p", "text": "A year later, Skywalker built himself a new lightsaber to replace the one he lost, which he later used to win his rematch against Vader."}, {"tag": "h3", "text": "Carried by Finn"}, {"tag": "p", "text": "While thought to have been lost in Cloud City, the lightsaber was salvaged from the mining colony's industrial depths and eventually found its way to Maz Kanata. However, the old spacer was very secretive regarding exactly how she got it. The lightsaber resurfaced some thirty years later on the planet Takodana when Rey, Finn, BB-8, and Han Solo visited Takodana Castle, the lightsaber awoke and called out to Rey, who ventured into the castle's basement and found the lightsaber inside Maz's curio box. Upon touching it, she received a series of visions and recoiled in horror, rejecting Kanata's attempt to give her the lightsaber. Han, who had been a close friend of Luke's, asked Maz where she got the weapon, but she dismissed him, saying it was a story for another time. Finn later took it for safekeeping. Shortly after, the First Order attacked after having been informed of the presence of BB-8. Finn used the lightsaber in the battle, killing at least one trooper by running him through with the blade and then fought against the shock-baton wielding FN-2199, who nearly defeated him before getting blown away by Han Solo. After the attack on Takodana, the Resistance moved to attack Starkiller Base in an attempt to stop the First Order from firing its primary weapon at the Resistance base on D'Qar. Finn used the lightsaber again in a confrontation with Kylo Ren while on Starkiller Base, taunting the dark knight to \"Come get it\" after Ren demanded he handed the lightsaber over. Though Finn put up a decent fight despite his lack of lightsaber combat training and the inherent dangers of wielding a lightsaber, he was ultimately bested and struck across the back, but not before hitting Ren's shoulder."}, {"tag": "h3", "text": "Carried by Rey"}, {"tag": "h4", "text": "Starkiller Base"}, {"tag": "p", "text": "After dispatching Finn, Ren attempted to summon the lightsaber to him, regarding it as his own property due to its history. However, much to the surprise of both of them, it instead flew past him and into Rey's outstretched hand, the girl having instinctively used her powers to call it to her. Armed with the legendary lightsaber, Rey dueled and overpowered Ren with the help of the Force. Rey and Finn were then rescued by Chewbacca aboard the Millennium Falcon. After discovering the planet where Luke Skywalker was hiding, Rey, accompanied by Chewbacca and R2-D2, ventured to the planet aboard the Millennium Falcon, eventually finding Luke and presenting him with his father's lightsaber."}, {"tag": "h4", "text": "Ahch-To"}, {"tag": "p", "text": "Luke took the weapon from Rey and examined it for a moment, then discarded it with an offhand throw over his shoulder. The lightsaber was examined by some curious porgs, avians native to Ahch-To, who came dangerously close to switching it on but Rey shooed them away and retrieved it before they could and kept it with her for the duration of her stay on Ahch-To. She briefly used it to train and hone her skills while she was with Luke, with a porg even snatching it and attempting to escape with into the ocean with it before Rey used the Force to pull the fleeing bird back to her and retrieve the weapon. Her attacks became faster and more aggressive until she sliced apart a rock pillar with it. The pillar then rolled down the hill and smashed a wheelbarrow being pushed by native Lanai Caretakers, who were quite miffed."}, {"tag": "p", "text": "Rey attacked Luke with her quarterstaff, demanding to know the truth of what transpired between the Jedi Master and his apprentice, Ben Solo, on the night of the Jedi temple's destruction. When Luke disarmed Rey of her melee weapon, she summoned the Skywalker lightsaber through telekinesis. Luke gave ground when Rey moved into an attack position, and the scavenger lowered the lightsaber while still demanding to hear the truth. After his confession, Rey offered Luke his old lightsaber once more, entreating him for the last time to join the fight against the First Order."}, {"tag": "h4", "text": "Aboard the Supremacy"}, {"tag": "p", "text": "Disillusioned by Luke's inaction, Rey departed from Ahch-To without him. She kept the Skywalker lightsaber and brought it with her to the Supremacy, flagship of Supreme Leader Snoke, where she confronted Kylo Ren in person. He ordered Rey to surrender the lightsaber to him upon seeing it in her hands, stating that it belonged to him. Though she sniped at the dark warrior, recalling how the weapon called to her instead of him, she gave it to him before his stormtroopers secured her as a prisoner of the First Order."}, {"tag": "p", "text": "Ren carried the lightsaber while escorting Rey to Snoke's throne room. Following their arrival, the Supreme Leader willed it from Ren's grasp to his own and examined it briefly, admiring its craftsmanship, then rested the Jedi weapon on the arm of his throne. Failing to stop the dark side master from searching her mind for Luke's location, Rey tried to retake the lightsaber with the Force, but Snoke overrode her control over it, causing the weapon to smack Rey in the back of her head before returning to the Supreme Leader's side. Using his powers to incapacitate Rey, Snoke ordered his dark apprentice to execute the scavenger. But while he used the Force to sense Ren's intentions, he did not see the Skywalker lightsaber turning to his side due to Ren's subtle influence over it. Instead of killing Rey with his own lightsaber, Ren activated the lightsaber by Snoke's side, bisecting his body at the waist. Snoke lost his hold on Rey, and in his final moments he could only stare at the blue plasma blade cutting through him before taking a final look at his apprentice."}, {"tag": "p", "text": "Ren pulled the lightsaber forward with the Force; as it levitated into Rey's hand, the upper half of Snoke's body fell to the floor while the lower half remained seated on his throne. Armed with their lightsabers, they fought together to defeat the Elite Praetorian Guards. When all but one of the guards were slain, Rey threw the Skywalker lightsaber to Ren, who killed the final sentry by igniting the plasma blade through the Praetorian's face-plate."}, {"tag": "h4", "text": "Destruction"}, {"tag": "p", "text": "After the battle, Ren offered Rey a place at his side as the new Supreme Leader of the First Order, which she refused and attempted to take her lightsaber back by way of the Force. The two simultaneously pulled at the weapon, trapping it between them as they expended powerful Force energy to reclaim it. The strain eventually caused the kyber crystal within to crack and release a surge of energy that knocked the two combatants back, rendering Ren unconscious and sundering the lightsaber in half. Rey escaped with the pieces of the more than fifty-year-old relic and took them with her when she joined the Battle of Crait."}, {"tag": "p", "text": "During the battle, Luke Skywalker stepped onto the battlefield, appearing to wield his father's lightsaber against Kylo Ren, though this was actually an illusion brought about by a Force projection sent by Skywalker from Ahch-To through the power of the Force. The shards of the actual lightsaber remained on the Falcon with Rey. After Leia spoke with Rey telling her that \"They had all they needed,\" this inspired her as the last of the Jedi to repair the lightsaber."}, {"tag": "h4", "text": "Reconstruction"}, {"tag": "p", "text": "Eventually, Rey was able to repair the lightsaber sometime after the Battle of Crait. To do so, Rey bound the two broken halves together with a leather strap and used healing techniques she gleaned from the sacred Jedi texts to restore its broken kyber crystal."}, {"tag": "h4", "text": "The way of the Jedi"}, {"tag": "p", "text": "A typical training regime concocted by Organa involved Rey capturing colored ribbons tied to trees that were defended by a trio of color-coded remotes. These training remotes tested Rey's evasion and deflection skills by flying about her on repulsorfields, firing sting-beams to distract her. The red remote was the most persistent, and therefore the most challenging to Rey's temper."}, {"tag": "h4", "text": "Mission to Pasaana"}, {"tag": "p", "text": "Rey took the lightsaber with her to Pasaana to find the Sith wayfinder and used it when she was attacked by Kylo Ren in his TIE/wi modified interceptor, leaping up and over his fighter before using the lightsaber to slice off one of its wings in passing, causing it to crash."}, {"tag": "h4", "text": "Kijimi"}, {"tag": "p", "text": "Rey used her saber again on Kijimi to pin down Zorii Bliss by the throat. Later on the Resurgent-class Star Destroyer Steadfast, Rey used her lightsaber to duel Kylo Ren through their bond while Ren was on the planet's surface."}, {"tag": "h4", "text": "The Final Duel"}, {"tag": "p", "text": "Rey used the lightsaber on Kef Bir and battled against a dark side version of herself. She then used the weapon in battle against Kylo Ren for the last time amongst the ruins of the Death Star II."}, {"tag": "h4", "text": "Return to Ahch-To"}, {"tag": "p", "text": "Following her confrontation against Ren and the revelation that the resurrected Darth Sidious was her grandfather, fearing that she would fall to the dark side of the Force, Rey fled to Ahch-To and intended to live out the rest of her days there in self-imposed exile as Skywalker had previously done. During her exile, Rey destroyed Kylo Ren's TIE whisper, burning it on the shores of Ahch-To, where she also planned to throw her saber into, but was caught by the spirit Luke Skywalker, who gave it back to her, along with his sister's lightsaber, to take to Exegol in his old X-wing."}, {"tag": "h4", "text": "Exegol"}, {"tag": "p", "text": "Rey and Sidious confronted each other during the Battle of Exegol. His spirit confined to an imperfect clone of his original body, the fallen Emperor urged his granddaughter to kill him with her Jedi lightsaber, taking his place on the Throne of the Sith as \"Empress Palpatine.\" Striking him down in anger would allow Sidious' essence to pass into Rey, merging them into a single entity and completing Rey's path to the dark side of the Force. Rey rejected her grandfather's offer at first, holding fast to the Jedi way, until her resolve broke when Sidious threatened to annihilate the Resistance. The ritual commenced with Sidious proclaiming the death of the Jedi Order as Rey raised her saber at him. Instead of delivering the killing blow, however, the lightsaber disappeared from her hand and reappeared in that of Ben Solo."}, {"tag": "p", "text": "Rejecting the dark side, the former Kylo Ren returned to Exegol to fight the Emperor at Rey's side. Having discarded his Sith lightsaber on Kef Bir, he was armed with only a blaster and his strength with the Force. He charged into the depths of Sidious' lair, killing several Sovereign Protectors with haste until he found his path blocked by the Knights of Ren. They surrounded their former master, attacking him with their weapons until Solo unveiled the Skywalker lightsaber in his hand. Rey gave the lightsaber to Solo upon sensing his presence, which no longer reflected the dark side but only pure light. Solo spared a moment to relish the feel of the lightsaber in his palm, instantly recognizing it as his own weapon. Once more, a Skywalker wielded the lightsaber built by Anakin Skywalker."}, {"tag": "p", "text": "Solo struck down the Knights of Ren quickly; unlike Ren, who was merciless on the battlefield, Solo sought to show mercy to his former followers by giving each of them a quick death. After the last Knight fell to the Skywalker blade, Solo entered the Emperor's throne room where he reunited with Rey. They stood side-by-side against Sidious, their lightsabers raised in tandem as the Sith Lord proclaimed that they would die together. He overpowered both Jedi through his use of the dark side; disarmed of their weapons, Solo and Rey fell to their knees as Sidious began draining the life force of their bond to revitalize his body."}, {"tag": "p", "text": "The restored Emperor cast Solo into a chasm, intending for the last Skywalker to die in the manner as his first death. However, the spirits of the Jedi were able to raise Rey, re-energizing her weakened body long enough for her to make a final stand against her grandfather. using both Skywalker lightsabers as a shield against Sidious' Force lightning, Rey used all of her remaining strength to redirect the Emperor's attack towards him, destroying his body in the process. Although the effort killed Rey, Solo sacrificed his life to revive her, an act which ended in his own death as the last Skywalker. After Solo became one with the Force, Rey retrieved the Skywalker lightsabers before leaving Exegol."}, {"tag": "h4", "text": "Burial"}, {"tag": "p", "text": "Following the defeat of the Final Order, Rey constructed a yellow-bladed lightsaber of her own utilizing components from her quarterstaff. Rey then traveled to the Lars homestead on Tatooine where she laid the two Skywalker lightsabers to rest at the old homestead, wrapping them in cloth and burying them alongside the grave of Shmi Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Anakin Skywalker's lightsaber in Star Wars: Episode III Revenge of the Sith was machined to look like Luke Skywalker's lightsaber from Star Wars: Episode IV A New Hope and Star Wars: Episode V The Empire Strikes Back as they are canonically one and the same."}, {"tag": "p", "text": "The original hilt carried by Mark Hamill in A New Hope was made from the flash attachment of a Graflex 3 cell flash unit, a flash tube attachment used on forties-era press cameras, with the ridged grips made by gluing portions of hard plastic T-track used for cabinet sliding doors (often mistaken for wiper blades) onto the bare cylinder, and the switch plate fashioned from the LED display of an Exactra 19 or 20 calculator. A D-ring assembly was also added to the bottom. The lightsaber used in The Empire Strikes Back was again based on a Graflex, but the 'T' tracks were instead screwed on and were only 6 instead of 7, the switch plate was replaced with part of a circuit board, the Graflex logo was covered with mylar tape, and part of a Kobold camera flash was used to create the D-ring assembly."}, {"tag": "p", "text": "For Star Wars: Episode VII The Force Awakens, genuine Graflex flash units were used to make the lightsaber props. They were based on a hybrid of the A New Hope and The Empire Strikes Back versions, as they feature the \"glass eye\" and \"beer tab\" top half parts from A New Hope, and circuit boards and 'T' tracks attached via screws bottom half from The Empire Strikes Back. To hide the Graflex logo, a \"wrap\" was created that covers most of the flash unit's clamp. The clamp appears more golden colored in The Force Awakens."}, {"tag": "p", "text": "In the original script for The Force Awakens, it was originally intended to begin the film with the lightsaber falling through space, tracing the history of where the lightsaber had been and explained how Maz Kanata acquired it, but director J.J. Abrams discarded the idea, teasing that it was a story which could be told later on."}, {"tag": "p", "text": "On the bottom of the lightsaber the words \"Made by the Former Graflex Corp\" \"Rochester, New York, USA\" can be seen."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}