{"url": "Skytrooper", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Battle droid models", "Category:Eternal Alliance", "Category:Eternal Empire", "Category:Skytroopers"], "nodes": [{"tag": "h1", "text": "Skytrooper"}, {"tag": "p", "text": "Skytroopers were a model of battle droid produced and used by the Eternal Empire. Manufactured in factories on the planet Zakuul and aboard Star Fortresses, Skytroopers replaced the vast majority of organic soldiers in Zakuul's military. Each standard Skytrooper was equipped with a blaster rifle and rocket boosters built into the rear of its torso, though some elite Skytroopers were of a three-legged model with weapons mounted on the arms. Skytroopers were also equipped with flamethrowers, using them to attempt to burn down obstacles in their way."}, {"tag": "p", "text": "After the fall of the Eternal Empire and the rise of the Eternal Alliance in its place, Head of Science Dr.Juvard Illip Oggurobb would access the Overwatch control center on Zakuul and reprogram the entirety of the Skytrooper forces. While some stayed on Zakuul for rebuilding and such, most were immediately sent to Odessen, the Alliance capital. From here, the Eternal Alliance would rapidly grow, and the Skytroopers would be spread across its territory for law enforcement, military matters, and countless other tasks just as they did under the Eternal Empire. Several Alliance Skytroopers were reprogramed by the Order of Zildrog and used to defend the Order's operations on Nathema."}, {"tag": "h2", "text": "Variants"}, {"tag": "p", "text": "At least one variant of the Skytrooper, the Heavy Skytrooper, was created by the Eternal Empire for planetary assaults. This Skytrooper model was used extensively during the Invasion of Voss. Another variant was the Siege Skytrooper which was powerful and tall enough to face with a walker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}