{"url": "Skywalker_family/Legends", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Families", "Category:Force-sensitive bloodlines", "Category:Skywalker family"], "nodes": [{"tag": "h1", "text": "Skywalker family"}, {"tag": "p", "text": "The Skywalker family was a Force-sensitive Human bloodline whose first known member was Shmi Skywalker. The clan contributed members to both the Old and New Jedi Orders, as well as the ranks of Sith Lords. Through several generations, the Skywalker family remained extraordinarily prominent in galactic affairs, having a significant impact on major historical events for over 150 years."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shmi Skywalker's son, Anakin Skywalker, was conceived by the will of the Force and raised on Tatooine."}, {"tag": "p", "text": "As a Jedi Padawan, Anakin married Padmé Amidala in 22 BBY. Three years later, Amidala gave birth to twins, Luke and Leia, passing away soon after. Due to Anakin's fall to the dark side of the Force and transformation to Darth Vader, Luke was raised on Tatooine by his uncle and aunt, Owen and Beru Lars (Anakin's step-brother and step-sister-in-law), while Leia was raised by Bail and Breha Organa on Alderaan."}, {"tag": "p", "text": "Leia married Han Solo in 8 ABY and had three children: twins Jaina and Jacen in 9 ABY, and a younger son Anakin, who was named after his grandfather, in 10.5 ABY."}, {"tag": "p", "text": "In 19 ABY, Luke married Mara Jade. Their son, Ben, who was named after Luke's first mentor Obi-Wan \"Ben\" Kenobi, was born in 26.5 ABY. Ben would later become the ancestor of brothers Nat and Kol Skywalker, as well as Kol's son Cade. Cade lived during 130 ABY and was the last surviving Skywalker of his time, his uncle having abandoned the famous name and living as \"Bantha\" Rawk. Nat married the Kiffar Jedi Droo Rawk and adopted her biological daughter, Ahnah, and two other children Skeeto and Micah."}, {"tag": "p", "text": "The droids C-3PO and R2-D2 were both the creation or property of Anakin and Padmé respectively. Eventually the droids would later fall into the hands of their children. R2-D2 went under the possession of Luke Skywalker whereas C-3PO mostly remained with Leia Organa Solo and her family."}, {"tag": "p", "text": "The family was unaware that they were related to the Naberrie family of Naboo until 36 ABY, when Luke discovered a group of holograms within R2-D2 dealing with the final days of his mother's life. Soon after, Leia traveled to Naboo to meet with Pooja Naberrie and revealed their relationship."}, {"tag": "h2", "text": "Family tree"}, {"tag": "h2", "text": "The dark side"}, {"tag": "p", "text": "Since the miraculous conception of Anakin Skywalker, the majority of the Skywalker family fell to or struggled with the dark side. Anakin, whose very existence might have been influenced by the Sith, became Darth Vader, one of the most feared Sith Lords in history. His son Luke eventually took his father's place as the Emperor's apprentice as a hoax for a short while. Luke's sister Leia had three children. Her youngest son Anakin died at an early age, sending his sister Jaina temporarily over to the dark side. Leia's oldest son, Jacen, became Darth Caedus; unlike the other Skywalkers, Caedus did not want to be redeemed, having been led to believe that he could be a Sith and not be evil, only to end up doing \"wrong things for the right reasons.\" Luke married a former Emperor's Hand Mara Jade, and their son Ben was influenced by his cousin Jacen to commit an assassination and other questionable acts. Even 130 years after the time of Luke Skywalker, his descendant, Cade Skywalker, was still dealing with his family's attraction to the dark side. Cade became an apprentice to Darth Talon in service to Darth Krayt, the new Dark Lord of the Sith. However, he abandoned this position and escaped Krayt's grasp with the help of his friends."}, {"tag": "p", "text": "Perhaps the most fascinating thing about the Skywalker family was not how easily they tended to fall to the dark side, but how they eventually returned to the light. All known members of the Skywalker clan who fell to the dark side returned to the light and redeemed themselves. Darth Caedus returned to the light a moment before his death to save his lover and daughter. In the long history of the Jedi, this was known as a very uncommon feat. Usually their redemption relied on the support and determination of their family members and close friends. The belief in redemption, originating with Padmé Amidala, and continued on by Luke Skywalker, was a powerful weapon the Skywalkers used to battle the dark side from within and without."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Several roads and locations in the real world were influenced by Star Wars culture and named after the famous Skywalkers, most notably the Skywalker Drives."}, {"tag": "p", "text": "In the canceled novel Alien Exodus, the main character Cosmo Hender gets the ability to tap into the Force through a giant crystal, giving him telekinetic powers and the ability to levitate, causing the other slaves nickname him Skywalker because of his powers. This would have originated the founder of the Skywalker family."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}