{"url": "Slaves_of_the_Republic", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Slaves of the Republic"}, {"tag": "p", "text": "\"Slaves of the Republic\" is the twelfth episode of the Star Wars: The Clone Wars television series' fourth season. This is the second episode in a three-part storyline about the slavers of Zygerria and the missing people of Kiros, which began with the previous episode \"Kidnapped.\" It aired on December 2, 2011."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"To locate the missing colonists, Anakin, Obi-Wan, and Ahsoka go undercover to infiltrate the slavers on Zygerria. Anakin struggles with his emotions as a wily Zygerrian queen forces him to take questionable actions in order to carry out his mission.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Anakin Skywalker, Obi-Wan Kenobi, Ahsoka Tano, and Rex travel to Zygerria aboard the ship they have obtained from Darts D'Nar, only to find the orbit of the planet crawling with spaceships, a sign of an important event. Before they disembark, they disguise themselves and form two teams: Obi-Wan and Rex are to find out the location of the kidnapped Togruta colonists, while Anakin and Ahsoka, disguised as master and slave respectively, go to meet the Zygerrian queen."}, {"tag": "p", "text": "In the slave markets near the palace, Ahsoka draws unwelcome attention when she prevents a Zygerrian slaver from whipping one of his slaves. Anakin slyly drops a hint that he has news for the Queen regarding one Bruno Denturri, whereupon he and Ahsoka are invited to the palace by order of the queen herself. Posing as a slaver by the name of Lars Quell, Anakin is quick to win the queen's favor, and he claims that he killed Denturri and seized Ahsoka from his abode. While Anakin is conversing with the Queen, one of her slaves attempts to stab her. When Anakin prevents the slave girl from murdering the Queen, and facing reprocessing, the girl throws herself off the balcony to her death. Queen Miraj decides to take Ahsoka as her new slave, whereupon Anakin quickly grants Ahsoka as a gift, winning Miraj's trust even more. Enchanted by Anakin, she invites him to attend that night's slave auction by her side."}, {"tag": "p", "text": "In the meantime, Obi-Wan and Rex proceed to the slave pits where they find the Togruta governor of Kiros, Gupat Roshti, weak and broken from his ordeal. Unable to learn from him where the other colonists have gone, Obi-Wan decides to free him first. However, the alerted guards manage to stop and capture Obi-Wan and Roshti, while Rex escapes. The Zygerrians torture Obi-Wan, trying to find out who he is. However, Atai Molec recognizes Obi-Wan from his conversation with Darts D'Nar on Kiros."}, {"tag": "p", "text": "At the auction, Roshti is the first slave to be put on offer, as a sample of the Togrutan people. Suddenly, the Queen announces a special guest, Obi-Wan Kenobi. The Queen orders Anakin to whip Obi-Wan with a Electro-whip before the eyes of the assembled bidders, to prove his motivations. With the aid of Ahsoka, R2-D2 and Rex, who has managed to sneak his way into the auction, Anakin improvises an escape. However, in a short battle that followed, they were taken down, first Ahsoka, then Rex, Obi-Wan, and Anakin. Miraj has Anakin brought to her bedchamber and announces to him that he will serve her as her personal slave and bodyguard, in exchange for the lives of his friends. Ahsoka remains in the palace, locked in a cage as a slave while Obi-Wan, Rex, and Roshti are brought to the Zygerrian reprocessing center on Kadavo, where the other Togrutans are also being held. Obi-Wan is forced into submission by the center's warden, Keeper Agruss, who emphasizes his point by slaying several Togrutan prisoners and threatening to do worse to the others, should Obi-Wan ever think of rebellion. Miraj, trying to draw Anakin to her side, points out that as a Jedi and servant of the Republic, he is a virtual slave already. She offers to free his friends if he joins her willingly; an offer which leaves Anakin thinking."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "This was the second least-watched episode of the series with only 1.36 million views."}, {"tag": "p", "text": "The scene in which Anakin salutes to R2 to signal him to eject his lightsaber is a homage to Star Wars: Episode VI Return of the Jedi, with the characters taking place of the movie's lead characters. Obi-Wan is in Han's place, Rex is in Lando's place, Anakin is in Luke's, the Queen is in Jabba's, Ahsoka is in Leia's and R2 is consistent with his own movie placement."}, {"tag": "p", "text": "During the scene where Anakin, Ahsoka and Rex attempt to rescue Obi-Wan and Roshti, Ahsoka uses her lightsaber to threaten the queen into submission, however when she is knocked unconscious it is her shoto that drops to the ground."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}