{"url": "Slayers", "categories": ["Category:Legends articles", "Category:Soldiers", "Category:Yuuzhan Vong military units", "Category:Yuuzhan Vong religion"], "nodes": [{"tag": "h1", "text": "Slayers"}, {"tag": "p", "text": "Slayers were elite Yuuzhan Vong soldiers, created at the end of the Yuuzhan Vong War to protect Supreme Overlord Shimrra Jamaane and fight the Jedi Knights. Their creation was a violation of the Yuuzhan Vong Shaping protocols and caste system, associating them with the heresy secretly encouraged by the Supreme Overlord. In truth, the Slayers originated as Force-sensitive slaves that had been grown from tissue samples of Jedi and then transformed and altered by the shaper caste."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Slayers were muscular and dark-skinned males with stocky builds. Clad typically only in traditional waist-wraps, they bore the insignia of caste and elevation appropriate to both Yuuzhan Vong priests and warriors."}, {"tag": "p", "text": "Though bearing features generally identifying them with the Yuuzhan Vong, the Slayers were in fact human slaves, Force-sensitives grown from tissue samples taken from Jedi, and then transformed by the shaper\ncaste. They were equipped with a suite of combat biots and their skin—the black color of dried Yuuzhan Vong blood—was in fact supple, fast-healing armor bonded to their bodies, and they were equipped with the spiked close-combat implants known as Steng's Talons, as well as new variants of the amphistaff and coufee. They also flew a new type of coralskipper, heavy fighters that resembled voxyn in appearance and were equipped with new weapon systems, better defenses, and hyperspace capability; at least some of these ships were also outfitted with passenger compartments."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Slayers were created by Yuuzhan Vong Master Shaper Qelah Kwaad on Yuuzhan'tar—formerly the galactic capital world of Coruscant—near the end of the Yuuzhan Vong War in 29 ABY. Introduced as \"Shimrra's Jeedai\", they were designed to serve as bodyguards for the Supreme Overlord Shimrra Jamaane and as warriors who could match the Jedi in combat. The Slayers were so named in honor of Yun-Yammka, the Yuuzhan Vong god of war."}, {"tag": "p", "text": "When the Supreme Overlord presented the Slayers to the Yuuzhan Vong Elite on Yuuzhan'tar, their appearance caused a scandal. Some denounced their creation as heresy and a violation of the caste system, and Supreme Commander Chaan opined that the Slayers resembled the malformed outcasts known as Shamed Ones—but once a pair of Slayers managed to kill Chaan and his entire cadre of ten warriors, criticism was quickly silenced. As well as a practical means of securing their own position, this display of warrior skill also acted as a deterrent against challenges to Shimrra's authority within the Yuuzhan Vong, either from the Quorealist opposition, the Jeedai heresy, or any who were perturbed by decisions like the creation of the Slayers themselves."}, {"tag": "p", "text": "The Slayers' first operational deployment was on the Outer Rim world of Caluula, where they captured a Galactic Alliance team including the Jedi Kyp Durron and Leia Organa Solo, but most of the Slayers fell sick when the experimental Yuuzhan Vong-targeting pathogen Alpha Red caused them to reject their implants. When Luke Skywalker and Jacen and Jaina Solo faced Shimrra in his throne room, they encountered a second group of Slayers which Shimrra had kept close as bodyguards, and the three Jedi defeated them in a brief but vicious battle."}, {"tag": "p", "text": "One survivor of the Caluula team remained, however—a warrior on whom the effects of Alpha Red had been arrested by the efforts of the Shaper Adept attached to the mission. During the closing stages of the Alliance's retaking of Coruscant, he bravely mounted an attack run on the living world of Zonama Sekot in his coralskipper. However, Zonama Sekot used the Force to fling the ship out into deep space, preventing the attack."}, {"tag": "p", "text": "After the end of the war, one Slayer was captured by the Sith faction One Sith and was trained as a Sith apprentice, adopting the name Darth Vua."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Slayers first appeared in James Luceno's 2003 novel The New Jedi Order: The Unifying Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}