{"url": "Slave_circuit", "categories": ["Category:Legends articles", "Category:Slave circuits"], "nodes": [{"tag": "h1", "text": "Slave circuit"}, {"tag": "p", "text": "A slave circuit was a mechanism that allowed for remote control of a vehicle's systems while using a communications device. In technical vernacular, a vehicle that had a slave circuit installed was slave-rigged. For a vehicle that wasn't slave-rigged, the owner, with a computer and a little programming skill, could set up a temporary slave circuit."}, {"tag": "h2", "text": "Uses"}, {"tag": "p", "text": "The most common use of slave circuitry involved an owner using a beckon call or other handheld communications device to activate his or her ship's systems well before entering the vessel. Doing so would allow the owner to make more efficient use of his or her time."}, {"tag": "p", "text": "When attempting a landing at a spaceport, a ship's pilot could allow the control tower to assist him or her with landing by transmitting the vessel's slave circuit code. Slave circuit codes could also be used by multiple space vessels to make synchronized hyperspace jumps. Some businesses installed slave circuits on all of the craft that they own, attempting to make theft of company property harder to commit."}, {"tag": "p", "text": "The user of a beckon call could also use it to signal the craft to fly to his location. The slave circuit would receive the signal and then tell the ship's computer to proceed to the beckon call's location. The computer would then activate the ship's engines and bring the craft to the user. Some ships could also be programmed to fight their way to the user's location with a reasonable degree of skill."}, {"tag": "p", "text": "Especially advanced slave-rigs were used in the Katana fleet project. These full-rig slave circuits were used to highly automate 200 Dreadnaught-class heavy cruisers, reducing the need for an organic complement by a factor of seven - the resulting crew requirements being 2,200 instead of upward of 16,000. Due to colossal corporate embarrassment and economic loss following the fleet's disappearance into Hyperspace, this type of heavy automation was largely abandoned for fear of similar incidents happening again."}, {"tag": "h2", "text": "Drawbacks"}, {"tag": "p", "text": "Despite the convenience that a slave circuit afforded, many owners were averse to installing them aboard their ships. Much cited were fears that criminals could steal a ship, just by stealing a beckon call or discovering its slave circuit code. More vehement detractors cited the infamous Katana fleet incident as an example of what could go wrong with slave-rigged ships."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}