{"url": "Sleeper_agent", "categories": ["Category:Legends articles", "Category:Galactic Empire", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Sleeper agent"}, {"tag": "p", "text": "Imperial Intelligence often used torture and various methods of brainwashing to create sleeper agents: agents who were unconsciously conditioned to perform some task. Their \"patients\" would be allowed to reunite with the Rebellion after conditioning; they themselves would have no memory of what had happened to them or what they were conditioned to do. Then, at an opportune time, Imperial Intelligence would activate the agent's conditioning, causing him or her to commit murder, sabotage, theft, or other acts without the ability to control themselves."}, {"tag": "h2", "text": "Agents within the Rebellion"}, {"tag": "p", "text": "Commander Kupalo was a Rebel officer who became an Imperial sleeper agent. Kupalo had been captured after the Battle of Hoth, and during his time as a prisoner he was conditioned as an agent. Kupalo was later allowed to be rescued by the Alliance."}, {"tag": "p", "text": "After an Imperial defector joined the Rebellion, Kupalo's conditioning was activated and he was revealed as a sleeper agent. He fled in the shuttle AA-23. Three X-wings were initially sent after the shuttle, but it launched mines which targeted and destroyed the three X-wings. Another group of Alliance pilots were sent out to capture Kupalo before he could return to the Imperials. These pilots forced Kupalo to stand down, and Kupalo was captured."}, {"tag": "h2", "text": "The Lusankya"}, {"tag": "p", "text": "One facility used by Imperials for brainwashing was Lusankya, a Super Star Destroyer buried under the surface of Coruscant. Lusankya was for many years the private prison of Imperial Intelligence Director Ysanne Isard. Isard would use drugs, torture, and other psychological tools to turn people into sleeper agents. A number of people were brainwashed, conditioned as agents, and returned. After their conditioning had been activated they would often repeat the word \"Lusankya\" over and over again."}, {"tag": "p", "text": "Isard attempted to turn Tycho Celchu against the Alliance, but he was rendered catatonic by her brainwashing process. Isard deemed him unsuitable for conversion. She later attempted to do the same with Corran Horn, but he was also able to resist her, which may have been due in part to his Jedi heritage."}, {"tag": "p", "text": "Diric Wessiri was one victim of Lusankya Isard was able to turn. After he was broken by Isard, he was first placed in the lab of General Evir Derricote to spy on him. After the Alliance liberated Coruscant, he was then allowed to return home to his wife Iella. Over the next several weeks Isard used him as a spy. Diric was finally sent to kill a surprise witness in the murder and treason trial of Tycho Celchu. Although Diric succeeded in killing the witness, Kirtan Loor, he was shot in self-defense by his wife, and died of his injuries. Just before he died, Diric thanked Iella for freeing him from Isard."}, {"tag": "p", "text": "At about the same time, Corran Horn escaped from Lusankya. Knowing that the Alliance would capture the ship, Isard had the Lusankya break free of the surface of Coruscant - devastating over 100 square kilometers of land and killing millions in the process. After the ship left Coruscant it escaped into hyperspace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}