{"url": "Slave_I_Expansion_Pack", "categories": ["Category:Real-world articles", "Category:Star Wars: X-Wing Miniatures Game Wave II"], "nodes": [{"tag": "h1", "text": "Slave I Expansion Pack"}, {"tag": "p", "text": "The Slave I Expansion Pack is a supplement to the Star Wars: X-Wing Miniatures Game from Fantasy Flight Games. The expansion features a detailed miniature of Boba Fett's Slave I. It was released on February 28, 2013 as part of the game's second wave of expansions."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Just like the infamous bounty hunter, Boba Fett, the Slave I Expansion Pack for X-Wing is full of deadly surprises."}, {"tag": "p", "text": "Originally intended as a prisoner transport, the Firespray-31 gained notoriety through association with some of the galaxy's most fearsome pirates and bounty hunters, including the infamous Boba Fett. The Slave I Expansion Pack for X-Wing allows players to take advantage of the Firespray's versatile armament and heavy armor plating, as well as a host of deadly new upgrades. Slave I comes with a detailed miniature, four pilot cards, twelve upgrades, and all requisite tokens. New rules and a new mission further expand your games of X-Wing! (Not a Complete Game. X-Wing Core Set Required to Play.)"}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "The Slave I Expansion Pack contains one miniature, plus a maneuver dial and action tokens, as well as pilot, upgrade, and reference cards."}, {"tag": "h3", "text": "Mission scenario"}, {"tag": "h3", "text": "Ship components"}, {"tag": "h3", "text": "Note: While all 4 Firespray-31 Pilots have the Target Lock action, no Target Lock tokens are included."}, {"tag": "h3", "text": "Cards"}, {"tag": "h4", "text": "Pilot cards"}, {"tag": "h4", "text": "Upgrade cards"}, {"tag": "h4", "text": "Reference cards"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}