{"url": "Slavery/Legends", "categories": ["Category:Legends articles", "Category:Slavery"], "nodes": [{"tag": "h1", "text": "Slavery"}, {"tag": "p", "text": "Slavery was the practice wherein sentient beings were treated as property to be bought and sold, enforced by violence or other forms of coercion. It was typical for the owner of a slave to implant the slave with a device that would kill them if an escape attempt was made. In the more lawful portions of the galaxy where slavery was allowed, if a slave was injured in a manner that devalued the slave or prevented him from performing his job by a third party, the owner was entitled to compensation from that third party for the depreciated value or the loss of the slave."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In ancient times, the Infinite Empire of the Rakata captured huge numbers of slaves for the building of their Star Forge. Needing some Force-sensitive slaves, they captured Niktos, Duros, Hutts, Humans, Selkath and more. Slavery was used by groups as disparate as Xim the Despot's empire, the Hutts, the Galactic Empire, the Zann Consortium, the Yuuzhan Vong, and the Ssi-ruuvi Imperium. To chronicle the use of slavery by various civilizations over the history of the galaxy was considered by many to be a futile task."}, {"tag": "p", "text": "Slavery was made illegal by the Galactic Republic under the Rights of Sentience clause, but continued to exist, particularly in regions not under Republic control, primarily the Outer Rim Territories and the Senex sector. On Tatooine, some slaves were installed with chips in their craniums that killed them if they tried to escape. Anakin Skywalker and Shmi Skywalker had such chips installed within their bodies."}, {"tag": "p", "text": "For Anakin, who later trained as a Jedi, his history as a slave created some difficult emotional complications for his prospect of life in the Jedi Order. Because slavery naturally bred and intensified the dark side-inducing emotions of hatred and fear—anathema to the Jedi, as fostering these feelings was antithetical to the Jedi tenets and beliefs that strengthened their connection to the light side of the Force—Anakin faced peculiar challenges of the mind and spirit in his quest not only to become a Jedi Knight, but also to fulfill his destiny as \"the Chosen One\". Anakin's advanced age for Jedi initiation (at nearly 10 years old) combined with his native Tatooine background, compounded the emotional problems that arose as a result. Whenever Skywalker came into contact with anyone or anything that summoned to the present his or his mother Shmi's unsavory experience with slavery, the Jedi Padawan was ever challenged to first acknowledge those feelings of hatred, anger or fear, allowing them to be felt, but then, critically, to let them pass, or \"let them go,\" as was the Jedi way; Anakin was thus severely challenged on his early missions to Krayn's Nar Shaddaa, Haariden, Mawan, Typha-Dor, Romin, and Fondor. Young Skywalker felt acutely the sting of any injustice, as well, whenever he encountered it in his journeys throughout the galaxy. For example, when Anakin witnessed, in the Jedi mission to Romin in 24 BBY, the stark disparity between the wealthy and the poor, the 17-year-old Padawan struggled with the intense feelings of disgust he felt for the injustices seen—clearly manifest both in the poorer areas of the planet's predominantly rich capital city and in the overwhelmingly bleak countryside hovel areas outside of the city—the planet's citizenry was, in essence, enslaved to its tyrant-dictator. Seeing the same severe injustices that he'd grown up with, Anakin had to concentrate to keep his breathing even: \"He had tasted [the injustice] in his mouth like the sand that filled the air of Tatooine. The hatred he felt was bred in his bones.\""}, {"tag": "p", "text": "The following year, in 23 BBY, Skywalker continued to be vexed, but at greater intensities than ever before, by disturbing visions of darkness and distorted memories of his time as a slave. He wished he could wipe from his mind his experience as a slave, and he grew increasingly worried about the safety of his mother, Shmi. It had been nine years—and many intervening interstellar missions—since Anakin had promised her that he would become a Jedi Knight and return to Tatooine to free her, and he remained determined to keep that promise. Fate would, however, tragically lead the 19-year-old Jedi back to his homeworld in 22 BBY to find Shmi brutally held captive by Tusken Raiders. After Shmi died in his arms, young Skywalker suddenly found himself in the midst of his dark visions as he took revenge on those who had taken his mother's life."}, {"tag": "p", "text": "Unfortunately, after the rise of the Empire, slavery was once again given a degree of legitimacy with the issuance of Imperial Decree A-SL-4557.607.232. Citizens could now be enslaved as punishment for \"crimes against the civil order\". Non-Humans and Human critics of the New Order alike were rounded up and enslaved en-masse for work on such projects as the Death Star. In addition, early into the Empire's formation, the 501st Legion had been ordered by Emperor Palpatine to sell Nosaurian women and children into a slave market at Orvax IV. The Empire's enforcer, Darth Vader, learned of this during a debriefing for the Cleansing of New Plympto when Commander Vill let slip about the Emperor's order. Vader grew despondent enough at the revelation as a result that he abruptly ended his presence at the debriefing and could not fall asleep that night, due to remembering his own time as a slave. He later revealed what he had learned to the Emperor, and ultimately let it continue despite his misgivings after the Emperor told him the Imperial way was \"different.\" Agorffi, Wookiees, Yuzzem, and Talz were exploited for their strength while the Mon Calamari and the Givin were used for their famous ship-building skills. Also the Quarren, Chromans, Ugnaughts and Mustafarians were enslaved for their mining skills, the Gamorreans and Gungans were enslaved for military operations and the Kaminoans and Kallidahins for their cloning skills. Meanwhile, the Empire frequently ignored the trade of Twi'lek girls, who were enslaved for their beauty. Officially, however, regarding alien species such as Wookiees, those deemed to be non-sentient were not considered enslaved, but \"domesticated.\""}, {"tag": "p", "text": "The Alliance to Restore the Republic took a dim view of slavery and those worlds which fell under its sway tended to outlaw it. Vigo Lonay reported to Xizor a 53% decrease in slave revenues in his sector when several planets within it joined the Rebel Alliance and passed local laws forbidding the practice."}, {"tag": "p", "text": "When the New Republic became the dominant galactic power, slavery was once again made illegal by New Republic Senate Resolution 54.325. However, slavery still continued in remote areas of the galaxy particularly in the Outer Rim and on certain Imperial fortress worlds such as Byss. The former Imperial Procurator of Justice Hethrir was a major figure in the slave trade and sold undesirable captives into slavery at Crseih Station in the remote Crseih system. With his death, the slave trade suffered a major blow. Slavery re-emerged as a significant threat during the Yuuzhan Vong War as practiced by the extra-galactic Yuuzhan Vong empire. In particular, the Chazrach slave race were used in military operations. However, this was short-lived, once they had been defeated."}, {"tag": "p", "text": "Slaving was often handled by experienced slaving guilds; three of the most notable were the Thalassian slavers, the Zygerrian Slavers Guild, and the Karazak Slavers Cooperative. Other criminal groups such as the Exchange and the Black Sun also had slave trades. The Invisible Market dealt largely with selling slaves on behalf of the black market, especially since the black market was more out in the open."}, {"tag": "p", "text": "In 44 ABY, due to the efforts of Freedom Flight, The Perre Needmo Newshour, and other groups, as well as the actions of several Lost Tribe Sith to desecrate the Fountain of Ancients on Klatooine, public support dramatically turned away from slavery. Most notably, the Chev species was freed from bondage to the Chevin, and the Treaty of Vontor was overturned, freeing the Nikto, Vodran, and Klatooinians from Hutt bondage they had endured for the past 25,144 years. The galactic movement against slavery grew and soon, slaves all around the galaxy, from the Ssi-ruuk Star Cluster to the Corporate Sector, started to revolt against their masters. After the violent repression of the slave revolt on Blaudu Sextus, the Jedi Order decided to move in to support the movement against slavery, which led to all-out war between them and Galactic Alliance Chief of State Natasi Daala."}, {"tag": "p", "text": "Galactic Emperor Darth Krayt repealed many anti-slavery laws set in place after the fall of the Galactic Empire when he took control of the galaxy. He even enslaved the Mon Calamari species. Indentured servitude was also engaged in by crime lords who liked to appear more legitimate than their peers, but once Darth Krayt's Galactic Empire was defeated in 138 ABY, freedom had been restored to the Galaxy."}, {"tag": "h2", "text": "Droids and slavery"}, {"tag": "p", "text": "Another variation (at least to some) was ownership of droids. Some felt that this \"ownership\" was merely enslavement of their kind and fought to give them their freedom. An uprising of droids would later bring such ideas of their liberation into question."}, {"tag": "p", "text": "Droids, including artificially intelligent droids, were typically treated as property. More advanced droids sometimes received proportionally more respect. Some protested the status of droids as slavery. This was a contentious issue, owing in part to the difficulty of assessing levels of artificial intelligence, and determining which droids could be considered properly sentient. Although emancipation of droids was a radical concept, some opposed memory wipes except for very simple droids."}, {"tag": "p", "text": "Some droids enforced slavery alongside their organic companions."}, {"tag": "p", "text": "The Naboo considered higher level droids equal as fellow sentients. Under the Galactic Empire, no laws protected droids from abuse and those who showed them respect were looked upon as strange."}, {"tag": "h2", "text": "Methods"}, {"tag": "p", "text": "Slavers had ways of keeping their charges on their leashes, literally and figuratively. The more physical means was attaching a chain to collars around their necks. The collar would be held by the slave's master, or attached to an object such as a wall."}, {"tag": "p", "text": "Zygerrians used collars on their slaves which sent electric shocks through their bodies at the touch of a button. They also used Shock whips."}, {"tag": "p", "text": "Another method was placing transmitters inside their bodies. Any attempt to escape caused the transmitter to explode, killing the slave. However, this method had the drawback of resulting in the destruction of the slave and loss of property."}, {"tag": "p", "text": "The Sith used the dark side to enslave other beings, like Exar Kun who enslaved the Massassi."}, {"tag": "p", "text": "Despite all these possibilities, the most powerful method was likely psychological. Slaves would be made to feel that escape was impossible, and they would be forced to remain slaves. However, this method often failed, and slaves escaped fairly often."}, {"tag": "h2", "text": "Image"}, {"tag": "p", "text": "The most common of slaves were either workers or portrayed as entertainment. Worker slaves were forced to labor, while often receiving little food and water. They were the type more frequently seen, especially in governments and more legal slaving organizations."}, {"tag": "p", "text": "Entertainment slaves were forced typically to wear revealing outfits to please their masters (or their master's guests) and submit to them. These were usually slaves to criminals, rather than major organizations. Notable examples included the Twi'lek Oola and Leia Organa Solo, who were enslaved by Jabba Desilijic Tiure."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to The Essential Atlas, the Empire outlawed slavery. Later sections of the book indicate that the Empire instituted slavery as a judicial punishment for certain ill-defined crimes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}