{"url": "Slaying_Dragons", "categories": ["Category:Real-world articles", "Category:Star Wars Adventure Journal fiction", "Category:Tales from the Empire"], "nodes": [{"tag": "h1", "text": "Slaying Dragons"}, {"tag": "p", "text": "\"Slaying Dragons\" is a short story written by Angela Phillips. It was originally published in Star Wars Adventure Journal 9 by West End Games in February 1996 and reprinted in the short-story anthology Tales from the Empire, which was published in November 1997 by Bantam Spectra. It was later made available online at Hyperspace Fiction on March 17, 2006. It took place just after the Battle of Hoth in 3 ABY."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Shannon Voorson was living with her parents Nell and Johan. She was at a console slicing code in her apartment when she remarked at the names of the star destroyers in the Kuat-Entralla Drive Yards, considering them \"unimaginative\". A visitor arrives at the apartment, her cousin Deen, whom she invites to her room for a chat. Shannon and Deen catch each other up on the events since they last met years prior. The discussion turned to Shannon's interest in the story of Vici of Alderaan then to the  Destruction of Alderaan itself. Deen reveals his sympathy for the rebellion, which Shannon promises to not spill the fact. Shannon reveals her slicing of imperial files to discover the names of the star destroyers, much to Deen's worry of her getting into trouble."}, {"tag": "p", "text": "The family has dinner consisting of Bhillen. As they ate, they traded stories with Deen, whom told of his adventures offworld. Deen then mentions he needs a Colony Class 23669 power generator, much to Nell's surprise. Later that night, an argument ensued between Johan and Nell. The next morning Deen left, but not before leaving a Signaller which Nell ordered destroyed. Shannon secretly hid the signaller in a ploy to make it appear she obeyed her mother."}, {"tag": "p", "text": "The day passed and Nell and Johan acted like Deen had never visited them, much to Shannon's annoyance. That night, she got on her computer and resumed her slicing activities. She thought up a plan to help Deen and changed the time of shipment of one of the power generators he requested the day prior. The next morning she snuck out to the shipyards, persuading a security guard with the excuse of bringing lunch for her father."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}