{"url": "Slave_II", "categories": ["Category:Legends articles", "Category:Bounty hunter starships", "Category:Captured starships", "Category:Pursuer-class enforcement ships"], "nodes": [{"tag": "h1", "text": "Slave II"}, {"tag": "p", "text": "The Slave II was a starship owned by Boba Fett, which he used circa 10 ABY. It cost him 225,000 credits."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Slave II was a MandalMotors Pursuer-class enforcement ship, a patrol craft, which was popular with the Mandalorian police units since it was tough and good at dealing with pirates, as well as having the cargo space for the usual police needs. Once Fett bought the ship, he immediately went about modifying it so it would hold all the \"nasty surprises\" that victims of his other ship experienced."}, {"tag": "p", "text": "Two Tion Mil/Sci Industries Mil-StarIV engines propelled the heavy patrol craft, and three Corellian Engineering Corporation x41 maneuvering thrusters were mounted on the port-side stabilizer. Powerful Torplex military-grade shield generators provided protection, whereas the ship was armed with twin forward-firing blaster cannons and an ion cannon turret. There was also a \"surprise weapon,\" consisting of a rearward-firing proton torpedo launcher, which held a magazine of six torpedoes. The ship had a sophisticated sensor array system, such as in Slave I. Although it lacked Slave I's stealth systems, some might have eventually been installed."}, {"tag": "p", "text": "There were rumors of five force-field-enclosed prisoner cages on board. Since his prime target's companion was a Wookiee, it is not unlikely that the cells had molecularly reinforced walls and gravity restraints."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Years after Boba Fett's escape from Great Pit of Carkoon, with this new freedom he vowed revenge on Han Solo, and so set into motion a plan. Since his original ship, Slave I, was in impound, he obtained a new one. This would also help keep his profile low until he wanted to confront the smuggler."}, {"tag": "p", "text": "Han Solo did encounter Boba Fett in the end, on Nal Hutta's moon Nar Shaddaa. Fett explained to a stunned Solo that the Sarlacc had been unable to digest him, creating Fett's means of escape. After a tense escape for Solo, seeing the death of one Hutt who was flipped from his hover platform into the voids of Nar Shaddaa, Fett pursued the Millennium Falcon in his new ship. The Falcon at this time had been secretly hiding aboard the Starlight Intruder, a ship owned by Salla Zend. Fett managed to track the hyperspace vector of the Intruder, which eventually led him to the world of Byss."}, {"tag": "p", "text": "However, as the Falcon entered the atmosphere of the planet the planetary shield was activated, causing Fett to collide and rip off his stabilizer bar, disabling his ship. But since Fett's own shields were up, he escaped incineration and went on to continue his pursuit of the smuggler in his original ship. Slave II was put into drydock, from where it was stolen soon afterward."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}