{"url": "Bardan_Jusik", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Clan Skirata", "Category:Former Jedi", "Category:Healers and doctors", "Category:Humans", "Category:Jedi Commanders", "Category:Jedi Generals", "Category:Jedi Purge survivors", "Category:Males", "Category:Mandalorians", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Bardan Jusik"}, {"tag": "p", "text": "Bardan Jusik, later known as Bardan Skirata, and even later Gotab, was a Human male Jedi Padawan who served the Jedi Order as the apprentice of Master Arligan Zey during the Republic Classic era. He was also a Commander at the time of the Clone Wars and aided in briefing clone commandos before a mission. He was against the creation of the Grand Army of the Republic and even addressed his negative ideas to the Jedi Council. He was later promoted to Jedi Knight and became a General in the Grand Army of the Republic. He later resigned from the Order to join the Mandalorians, saying that he couldn't fight for a Council that approved the slave labor that was the Grand Army."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early years"}, {"tag": "p", "text": "As custom with Jedi initiates, Bardan Jusik was brought to the Jedi Temple on Coruscant when he was very young. Unable to remember his parents, he grew up amongst the Jedi, eventually coming under the training of Master Zey. He had once told Ordo Skirata that he remembered being taken from his parents, but not them."}, {"tag": "h3", "text": "Mission to Qiilura"}, {"tag": "p", "text": "Three months after the First Battle of Geonosis, Padawan Jusik helped brief and equip Omega Squad for their mission to Qiilura, where they were tasked to destroy a Separatist nano-virus facility and kidnap the scientist Ovolot Qail Uthan. At the time Jusik was very unfamiliar with clones looking all the same, and kept staring at them during the squads preparations. This was the first time Jusik had come in contact with Omega Squad. But after he briefed them for the mission, Jusik had little to no influence on the mission."}, {"tag": "h3", "text": "Mission to Coruscant"}, {"tag": "p", "text": "Jusik took a liking to a Null ARC Trooper named Ordo, and respected him as a soldier. Because of his rapport with Ordo, Kal Skirata selected him to be part of a black ops team whose mission was to neutralize CIS terrorist cells operating on Coruscant. For this mission, Bardan would work with Skirata himself, Ordo, Null ARC trooper Mereel, Delta Squad, Omega Squad, Mandalorian warrior Walon Vau, and fellow Jedi Etain Tur-Mukan."}, {"tag": "p", "text": "Throughout the course of the operation, Bardan grew steadily closer to the clones and Skirata, the former often referring to him as \"vod'ika\" (an affectionate form of the Mando'a word for \"little brother\"), and the latter often calling him \"Bard'ika\" (Mando'a for \"Little Bardan\", expressing fatherly affection). By the end of their mission, he had been accepted into the fold as a Mandalorian warrior, even donning borrowed Mandalorian armor from Kal Skirata for the final battle with the terrorists. The armor was Munin Skirata's green armor, with green meaning duty."}, {"tag": "p", "text": "Bardan fought the terrorists valiantly and he and his comrades won the day. Following the battle, he knew that his affinity for the Mandalorian culture would be viewed by the Jedi Council as attachment, but he did not see it in the same light. He decided that if he were asked to choose, he would be Mando."}, {"tag": "p", "text": "Bardan would continue to serve in the GAR, leading troops on several fronts until he was assigned to track Ko Sai with Delta. He mind-wiped a worker in the process of searching for Ko Sai, though he was forced to blow the mission in order to allow Skirata to get to Sai first. After being confronted with increasing amounts of evidence pointing to clone executions by the Republic, Bardan declared to Zey that he would follow his heart; that of a Jedi's, and protect innocents. By doing this he resigned from the Order, stating he couldn't betray his men to death. Zey was sorry to see him go, but allowed him to keep his lightsaber."}, {"tag": "h3", "text": "Order 66 and Beyond"}, {"tag": "p", "text": "Bardan donned Mandalorian Beskar'gam and joined Clan Skirata. After Order 66 was implemented, he moved to Kyrimorut with Kal Skirata. Three weeks after Order 66, Jusik and Ordo discovered that the Imperial Army were building their garrison in an abandoned theme park in the shape of a Mythosaur, believing it was an old Mandalorian temple of great power based on the word of the former owner's brother. Jusik showed great doubt about bringing Jedi to Mandalore, but Ordo agreed with Kal that the Jedi Kina Ha's genetic information on the clone troopers was far too valuable to pass up."}, {"tag": "p", "text": "While in a bar where they met the brother of the park's former owner, they were worried about taking off their helmets. However, the bar owner told them they looked after their own. They also saw Death Watch members Dred Priest and his girlfriend Isabet Reau in the bar, knowing that Mij Gilamar wouldn't be happy to learn Priest was on Mandalore."}, {"tag": "p", "text": "After Kina Ha and Tallisibeth Enwandung-Esterhazy arrived, Jusik asked Kina Ha about how she was born. Kina replied by saying she was engineered for deep-space missions and that her life was prolonged immensely, revealing she was over a thousand years old. She also said that she was naturally Force-sensitive; this amazed Jusik, as the Jedi had never heard of a Kaminoan Jedi before. A few days later, he showed Kad a picture of Darman, reminding him that his daddy would be home soon. He and Mij both agreed that Kad would have to keep his powers under wraps in order to not attract Imperial attention. During this time he also begins to wonder if he could heal Arla Fett's brain of mental problems, since he healed Fi's brain using the Force. They began by taking blood samples to discover exactly what drugs she was being pumped full of and whether they affect her mental stability or not."}, {"tag": "p", "text": "Attempting to get her to join them around the house, Kina Ha refused to go on a walk with them. Mandalore Fenn Shysa attempts to talk Kal into putting Jusik out to stud to help bolster their numbers with strong Force-sensitive Mandalorian soldiers. Kal refuses to allow him to, however. When later being told about this, Jusik simply laughed. When Wad'e Tay'haai came by and plays flute, he hands it to Jusik to see if he has any musical talent with it; he doesn't. During this time, Jusik came to a crossroads with his life, not knowing who he is anymore. Kal soon afterwards officially adopted Jusik as his son."}, {"tag": "p", "text": "Later in the night, Arla's head finally cleared of her drugs, and she attacked him in an attempt to escape. She gave him a broken nose and numerous bruises but he didn't complain. When Kal got a call from Alpha-26 asking for refuge, Jusik and Kal's daughter, Ruusaan Skirata, went to collect him. Maze shocked them by bringing Arligan Zey along with him, believed to be dead by Kal and the others. Jusik took him in without asking Kal, which hurt him greatly when they arrived back home and told him the news."}, {"tag": "p", "text": "Jusik was responsible for finding Jedi Master Djinn Altis and did so, arranging for the three Jedi to join him. He also decided to mindwipe them of Kal's location when the time came. When Arla came down from the drugs and remembers that she joined the Death Watch after they killed her family, Jusik took her memories away at her suggestion. It is mostly unknown that after Jusik took Arla memories she could not member just about anything. After that Arla and Jusik fell in love."}, {"tag": "h3", "text": "Life as Gotab"}, {"tag": "p", "text": "Bardan's activity during the Galactic Civil War is unknown, but he would change his name to Gotab, posing as a Kiffar healer with psychometric abilities. Bardan now appeared as thin-featured, with a beard turned white with age, although his hair still retained traces of its dirty-fair color; he still wore full Mandalorian armor."}, {"tag": "p", "text": "Bardan was an associate of Fett's genetic nephew Venku, the son of the clone commando Darman. Venku's protective, emotional attitude towards Gotab had once led the bartender of the Oyu'baat, a tapcafe in Keldabe, to think that the younger man could be Gotab's son."}, {"tag": "p", "text": "In 40 ABY, Bardan, pretending to be simply a random passerby, made a point of witnessing the first meeting of Boba Fett with Venku."}, {"tag": "p", "text": "Shortly afterwards, when Boba and his granddaughter Mirta Gev were looking for clues on how Sintas Vel had died, they decided to have the Heart of Fire read by a Kiffar, in the hope that the psychometric abilities of Sintas's people could give them some information. Venku then reintroduced them to Gotab in the Oyu'baat."}, {"tag": "p", "text": "Mirta gave him her half of the necklace for him to hold, and after saying some things to Boba to overturn the old bounty hunter's initial skepticism, he told both Boba and Mirta that Sintas went after a gangster on Phaeda. This led them to the discovery that Sintas had been frozen alive in carbonite by Hidu Rezodar."}, {"tag": "p", "text": "When Jaina Solo came to Keldabe to receive training from Boba Fett, she noticed Bardan and Venku's Force sensitivity. He also noticed hers, and, while she had not told anyone else of her status as a Jedi, he knew, and held a blaster to her face, saying \"Hello, Jedi\". He later revealed to Fett and Goran Beviin that he had been a Jedi. Beviin was very surprised that he had not found that out by himself, though Medrit Vasur cared not for his former dealings as a Jedi viewing the discussion over after learning he had willingly chosen to be a Mando'ad."}, {"tag": "p", "text": "He was later called upon by Jaina to help heal the recently freed Sintas Vel, who, after being frozen for thirty-odd years, was blind and had amnesia. The effort taxed the elderly man greatly, and after Sintas had regained some sight, Venku stepped in, and said that was enough for one day. Bardan would come back at regular intervals, healing more and more of Sintas's shattered mind."}, {"tag": "p", "text": "After the Second Battle of Fondor, in which the Mandalorians had taken part, Bardan and Jaina had a long discussion about the Jedi Order, compassion, and what Jaina should do about her Sith Lord brother. He revealed that he had twenty great-great-grandchildren, through the many sons and daughters he and his wife had adopted. He also shared an anecdote with Jaina about a pet strill that had gone mad, attacking its loved ones because of a tumor in its head. He said that the owner had to shoot the poor creature, ending its life for the good of itself, and the other. Jaina felt the strill was likened to her brother, and that she would have to kill him to save her family, and himself. During their discussion, he admitted that he would give away all his powers except for the ability to heal, that he believed Fett would still sell Venku to the Kaminoans and that he disliked Fett and believed him amoral as he cared nothing for what happened to Mandalore under the Galactic Empire. Bardan showed her that he still carried around his lightsaber, and that Venku carried around two blue ones, one belonging to his mother and the other belonging to her master. He also said that he had taught Venku how to use the weapon, but not for the reason Jaina believed. As Venku and Jaina squared off in a sparring match, Bardan watched on, signaling for them to begin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "With the release of Republic Commando: True Colors, Karen Traviss verified that Gotab is indeed the former Jedi Bardan Jusik.[source?] This was later confirmed beyond a shadow of a doubt with Jusik's own confession in the novel Legacy of the Force: Revelation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}