{"url": "Slicer_House", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Lok locations"], "nodes": [{"tag": "h1", "text": "Slicer House"}, {"tag": "p", "text": "The Slicer House was located in the barren wilderness near Nym's Stronghold on Lok and was used by a group of slicers as their base of operations at the time of the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The small building contained three floors: one above ground, two below. The top floor was made up of a single room that contained many terminals arranged in a classroom-like layout. Stairs led down to the first floor below ground which consisted of two rooms. One was a conference room with a large conference table and various wall-mounted viewscreens. The other room was larger and lavishly decorated. It contained desks used for studying, a dejarik table and various computer terminals."}, {"tag": "p", "text": "The lowest level consisted of three rooms. A small storage room was filled with crates and containers of all sorts while the second was a sparsely decorated dorm room with bunk-beds and footlockers. The third room was a maintenance room where all kinds of functioning and broken droids were stored, manipulated and repaired, including a RA-7 protocol droid, LE-series repair droids, various astromech droids and even a deactivated B1-Series battle droid."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lok slicers inhabited the house after the Battle of Yavin. Members of this group included Kelson Sharphorn, Skaelor Tay and Byd Chillings. The building was guarded by several IG-106 sentry droids."}, {"tag": "p", "text": "Around 1 ABY, the Corellian technology-hating Meatlump terrorists had expanded to Lok, establishing a small Meatlump camp near Nym's Stronghold. They planted an explosive device in this house, likely planning to destroy the building and the technology in it — which would also have killed the slicers. However, a spacer working for Corellia Times reporters Vani Korr and Halden Wes who had infiltrated the Meatlump gang discovered the plot. The spacer traveled to Lok, found the bomb in time and managed to defuse it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Slicer House was a location in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "p", "text": "The slicers and their house were added to the game with the update dubbed \"Chapter 10: The Search for the Meatlump King\", released on June 19, 2008. They were indirectly involved in the so-called \"Meatlumps Theme Park\". In the basement of the house, there was a bomb that the player had to defuse as part of the quest \"Muddle the Meatlumps\". While there were several slicer NPC enemies in the house, none of them had to be killed for the mission. \"Chronicle Relics\" could be looted from them. Such relics could be used by players in the Chronicle Quest system to create their own quests for other players. By using the relics related to the slicer NPCs, the quests would task the player with killing slicer in the house, or just traveling to the house."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}