{"url": "Sli%27Lon_Tahar", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Humans", "Category:Jedi Masters of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sli'Lon Tahar"}, {"tag": "p", "text": "Sli'Lon Tahar was a Human male Jedi Master who served the Jedi Order and the Galactic Republic during the Great Sith War. After the Battle of Deneba, he left the Jedi Order and joined the Galactic Circus, under the alias \"The Great Brotzman\"."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male of the Human species, Sli'Lon Tahar was born during the Post-Manderon period. After he was found to be Force-sensitive, Tahar was trained in the ways of the Force by the Jedi Order, eventually attaining the rank of Jedi Master. Around 4,038 BBY, Master Tahar took interest in the Sith, a powerful sect that wielded the dark side of the Force. Although the Sith were thought to have been destroyed in 5000 BBY following the defeat of Naga Sadow at the first battle of Korriban, Tahar was convinced they had survived somehow. For forty years, Tahar tracked down evidence the Sith had indeed survived in hiding. During his active period, he also took five apprentices under his wing."}, {"tag": "p", "text": "Circa 3998 BBY, the Jedi Master finally uncovered the evidence he had been looking for. On the planet of Nilrebmah XIII, Tahar discovered the mausoleum of Ku'ar Danar, a former Jedi who, according to legend, had once trained Naga Sadow. Disturbed by his discovery, Master Tahar wished to alert his peers, and he traveled to the world of Deneba, where ten thousand Jedi were holding a conclave at the center of Mount Meru. His disciples were among the summoned Jedi, as were many venerable Masters of the time such as Vodo-Siosk Baas, Arca Jeth and Thon."}, {"tag": "p", "text": "However, the assembled Jedi were attacked before Tahar could make his findings known. Hundred of lifeboats rained from the skies of Deneba, deploying an army of Krath war droids in the midst of the multitude. Taken by surprise, the Jedi were forced to enter a fierce battle. To make matters worse, the Jedi's service droids had been sabotaged by the enemy, and they turned against their masters, joining the Krath battle droids. The slaughter which followed shocked Master Tahar so much that he fled the battle, leaving his apprentices dead."}, {"tag": "p", "text": "Because he had left his friends and pupils to their fate, Tahar's own cowardice shamed him, and he forsook the Jedi way. The old man also started consuming large quantities of alcohol. Eventually, Tahar encountered the Galactic Circus, a traveling circus who notably showcased Sssiii, a male Slith who played chess with the patrons. The defrocked Jedi master joined their circus as an illusionist under the nickname \"The Great Brotzman\". With his new companions, he toured on a number of worlds, including the desert planet of Tatooine."}, {"tag": "p", "text": "One day, the old Jedi Master met strange, yet interesting visitors while the circus was performing on Tatooine. Unbeknownst to him, his new friends were in fact time travelers who came all the way from the future. They were members of the Alliance to Restore the Republic, a resistance group that fought in a Galactic Civil War four thousand years after Tahar's lifetime. Thanks to the visitors from the future, Tahar started to recover his fighting spirit. One month later, the Galactic Circus and their new friends arrived on the Foerost Shipyards."}, {"tag": "p", "text": "Sensing the darkness approaching, Tahar left the Circus and disappeared for a time, only to reappear once more as a Jedi, when a surprise attack hit the space station. The former Jedi Ulic Qel-Droma, with the help of Mandalore the Indomitable's Crusaders, sought to capture the starships under construction on Foerost so he could use them to conquer the galaxy. Master Tahar tried to stem the Mandalorian assault and managed to help the time travelers fleeing by using his battle meditation, a rare and powerful skill that helped bolster the friendly forces while reducing the opponent's conviction. Before bidding farewell to his friends, Tahar entrusted them with two messages—warn the Republic of the danger and inform the Jedi Council of the location of Ku'ar Danar tomb. Because the old Jedi's battle meditation kept weakening his attack, Ulic Qel-Droma decided to confront Tahar personally. The two engaged in a decisive lightsaber duel. The older Tahar, however, was no match for Qel-Droma, and he was ultimately struck down."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Following the massacre at Deneba, Tahar was devastated. He became cynical and pessimistic, even defeatist, and was beset by terrifying nightmares. His encounter with the Krath left deep psychic wounds and he started to hate droids. Toward the end of his life, Tahar was a bearded man with hort-cropped hair and a face marked by sorrow. As \"The Great Brotzman,\" he used to wear a heavy sleeveless vest and carried a stiped staff."}, {"tag": "h2", "text": "Power and abilities"}, {"tag": "p", "text": "Tahar, as the \"Great Brotzman\" and a former Jedi Master, was a very skilled illusionist. He was also proficient in Force healing, as he become the \"bonesetter\" of the Galactic Circus, and was able to teach Jedi meditation. Before his death, he also proved to be an adept of battle meditation and a good duelist, but not enough to stop Ulic Qel-Droma and his Mandalorian minions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sli'Lon Tahar was created by Philippe Rat and Mehdi Sahmi for the ambiguously canon roleplaying scenario \"Le Facteur X\" which appeared in the French magazine Casus Belli 115. He was illustrated by Stéphane Levallois."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}