{"url": "Sleeping_virus", "categories": ["Category:Legends articles", "Category:Viruses"], "nodes": [{"tag": "h1", "text": "Sleeping virus"}, {"tag": "p", "text": "The sleeping virus, also referred to as the talisman virus was a virus that only Humans could catch, and put its victims into a comatose state. A serum existed to cure the virus."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The sleeping virus was designed by the Galactic Empire and exclusively affected Humans, who would become comatose when infected. Victims could be hung upside-down to let blood rush to their heads to extend their chances of survival. A serum to cure the virus was commercially available, though patients were still groggy for some time after initial treatment"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The virus was created by the Empire for use against its enemies. The bounty hunter Boba Fett was familiar with the virus and that a remedy was available. The sleeping virus was planted on a talisman, which was rumoured to have the power to render objects invisible. Between 0.5 ABY and 1 ABY during the Galactic Civil War between the Empire and the Alliance to Restore the Republic, the talisman was sought by both factions for its alleged power. Han Solo and Chewbacca of the Alliance recovered it, having been allowed to do so by Fett, and the Human Solo quickly succumbed to its effects. His Wookiee companion tied Solo upside-down inside their starship, the Millennium Falcon, on their return to a Rebel base. The Falcon nearly crashed into the base, but Chewbacca steered away so it instead crash-landed on the moon Panna Prime."}, {"tag": "p", "text": "Solo and Chewbacca's friend Luke Skywalker, accompanied by the droids C-3PO and R2-D2, undertook a mission to Panna Prime. There, joined by Fett, who was on a secret mission to find the Rebel base for the Empire, they found the Falcon and discovered Chewbacca destroying the talisman. Skywalker shouted for him to stop, but was quickly infected by the virus and collapsed. C-3PO and R2-D2 realized that the talisman had spread the virus and explained its spread and Chewbacca's method of treatment to Fett. The bounty hunter revealed that he knew the serum to treat it could be found in Panna City, and Chewbacca joined him to go retrieve it. Fett quickly found the serum in a shop, but before acquiring it contacted the Sith Lord Darth Vader to inform him of his progress in gaining the Rebel's trust. Afterwards Fett gained the serum and returned to the Falcon with Chewbacca and revived Skywalker and Solo, who was so dazed from the virus that he did not recognize Fett desipte a previous encounter. After Skywalker offered for Fett to join the Rebels at their base, C-3PO and R2-D2 revealed their knowledge of Fett's true allegiance, and that the whole affair had been an Imperial plot. The events of the mission were later portrayed in a cartoon for the Rebel Alliance, narrated by Captain Kazan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The sleeping virus appeared in The Story of the Faithful Wookiee, a cartoon written by George Lucas and produced by Nelvana Studios. It originally aired on television in 1978 as part of The Star Wars Holiday Special."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}