{"url": "Sliven", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Males", "Category:Tusken Raiders"], "nodes": [{"tag": "h1", "text": "Sliven"}, {"tag": "p", "text": "Sliven was the adopted Tusken Raider father of the Human Jedi Knight Tahiri Veila. He was the leader of a Tusken tribe though he was opposed by many in the tribe since he adopted Tahiri, a Human and an outsider."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Little is known about his early life though he eventually became the leader of his tribe. In 16 ABY, Sliven was injured badly during a battle between his tribe and a group of smugglers. He was also separated from his tribe and lost his bantha. Sliven wandered for days across the deserts of Tatooine until he came across the moisture farm of Tahiri's parents Tryst and Cassa Veila. Despite him being a Tusken Raider, they took him in out of pity and treated his wounds."}, {"tag": "p", "text": "As a result of his injuries, it took two months for his wounds to heal. During his time with the Veilas, he befriended them particularly with the then three year old Tahiri and learned to both understand and speak Galactic Basic Standard. When Sliven recovered, he helped Cassa with light chores and even fashioned Tryst his own gaderffii and taught him how to wield it. Due to Tryst being Force-sensitive, he learned how to use a gaderffii quickly and became proficient with it. It wasn't long before Tryst was better at the gaderffii than Sliven."}, {"tag": "p", "text": "However, this was not to last since Sliven's tribe eventually found him. On that fateful morning, Sliven and Tryst were practicing their gaderffiis. Tryst was gaining the upper hand in the duel. However, the Sand people misunderstood the situation, seeing Tryst as an enemy. It was not long before Tryst and Cassa were dead. However, Sliven managed to save Tahiri. Despite the protests of his tribe, particularly Vexa, Sliven adopted Tahiri as his daughter though on the condition that she leave the tribe at the age of nine (when Tusken children were considered members of the tribe) and undergo a dangerous quest in the dangerous deserts of the Dune Sea for a week. If she survived, Sliven would remain the leader of the tribe. However if she failed, Sliven would die."}, {"tag": "p", "text": "Thus, Tahiri would spent much of her childhood fully bandaged in sand-colored rags, robes and head covers until she was discovered to be Force-sensitive in 22 ABY by Luke Skywalker and Tionne Solusar during a trip to Tatooine. Sliven allowed Tahiri to attend the Jedi Praxeum on Yavin 4 on the condition that she return after six months to make her decision whether she would return to join her tribe or would remain at the Praxeum and become a Jedi Knight."}, {"tag": "p", "text": "When she returned with her newly-found friend Anakin Solo, Sliven revealed the identity of her parents and how they died. He then sent the pair out into the Dune Sea where they survived by using their growing Force abilities including braving thirst and heat, befriending a Jawa clan, evading a sarlacc and defeating a Krayt dragon. They arrived at their destination on time, thus allowing Sliven to remain as the head of his tribe. However, he died shortly after the departure of Tahiri and Anakin.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}