{"url": "Slique_Brighteyes", "categories": ["Category:Legends articles", "Category:Gulmarids", "Category:Males", "Category:Refugees"], "nodes": [{"tag": "h1", "text": "Slique Brighteyes"}, {"tag": "p", "text": "Slique Brighteyes was a Gulmarid native of Gulma who survived the atrocities committed by the Imperial extermination ship Azgoghk."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Galactic Civil War, Slique Brighteyes and other Gulmarids lived peacefully on Gulma until the planet was invaded and subjugated by the Galactic Empire several months prior to the Battle of Endor in 4 ABY. The Empire harvested all available natural resources on Gulma, transformed the planet into a barren wasteland and proceeded to relocate the planet's Gulmarid population to the Imperial starship known as the Azgoghk. While the Gulmarids were under false belief that the ship was assigned to transport them offworld, Brighteyes and his companions soon realized the truth behind the Empire's motives for transferring their species to the Azgoghk. The Azgoghk was in fact one of the three Imperial extermination ships commissioned by the genocidal Grand Admiral Danetta Pitta to eradicate Non-huMan species through the Outer Rim Territories and establish all-Human governance over the galaxy in accordance with Human High Culture, and thus the Empire strove for the deliberate and systematic extermination of the Gulmarids."}, {"tag": "p", "text": "Aboard the Azgoghk the Gulmarids, like many other captive species, were frequently abused and tormented by the stormtroopers. Those Gulmarids who were considered weak, sick and feeble were killed by disintegrating them to base elements in the ship's ionization chambers. Brighteyes was separated from his unlucky family members, and they perished in the ionization chambers. Brighteyes and the survivors were used as forced labor assigned to dispose the deceased Gulmarids by incinerating their corpses in the Azgoghk's fusion reactors. While most of the surviving Gulmarid slaves were kept under abysmal living conditions by the Humanocentric Admiral Mir Tork, the rest were killed in the horrific experiments conducted by the science officer Leonis Murthé. However, Brighteyes and many others eventually escaped the Azgoghk and settled on the planet Basteel. He became the spokesman of the Gulmarid refugees, planning to end the Azgoghk's reign of terror once and for all."}, {"tag": "p", "text": "In 11 ABY, Brighteyes collected one hundred credits, the entire wealth of the last surviving Gulmarids, and put out a bounty notice on Tork and Murthé. However, all bounty hunters recruited by the Gulmarids were unsuccessful in boarding the massive, fortress-like extermination ship. Seeing the notorious bounty hunter Boba Fett as his only hope, Brighteyes hired him to eliminate the fanatical Admiral Tork and his sadistic second-in-command Murthé. Fett scoffed his contractor for presenting such a negligible offer, considering it as a sordid insult to his pride. Brighteyes told Fett how his name used to inspire fear and reverence until Fett was defeated by Luke Skywalker during the Battle of Carkoon. He succeeded in appealing Fett's code of honor and justice, and the Mandalorian bounty hunter was determined to redeem his failing career by accepting the Gulmarid's offer. Fett tracked down the Azgoghk in the Outer Rim Territories and took down the ship on Malicar 3. In the following skirmish, Fett liberated Non-huMan prisoners of the Azgoghk, caused a revolt against the Imperial troops and executed his targets. After the Azgoghk was incapacitated, Fett returned to Brighteyes on Basteel with the severed heads of Tork and Murthé. Fett fulfilled his mission and was awarded with his payment. Slique Brighteyes, having survived longer than his Imperial tormentors, was finally able to rest in peace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}