{"url": "Sliv_Jurek", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Criminals", "Category:Humans", "Category:Males", "Category:Slicers"], "nodes": [{"tag": "h1", "text": "Sliv Jurek"}, {"tag": "p", "text": "Sliv Jurek was a Human male who lived during the Galactic Civil War. Sometime after the Battle of Yavin he was on the planet Tatooine as an associate of Jabba Desilijic Tiure, a Hutt crime lord who controlled a criminal empire. During his time working for Jabba the Hutt, Jurek had an electronic key in his possession that would allow access to a warehouse that held a Rantok sword that Jabba wanted."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sliv Jurek was a male individual who was living in the galaxy during the Galactic Civil War. At some point after the Battle of Yavin he was working on the planet Tatooine for a Hutt crime lord named Jabba Desilijic Tiure. During his time working with Jabba's organization, Jurek possessed an electronic key that would allow entry to a warehouse that housed a Rantok sword, the traditional weapon of the Unfyr warriors. Jabba the Hutt wanted to display the sword on the wall in his palace, so he told his translator droid, G-5PO to hire someone to take a case containing a large amount of credits to Jurek in order to purchase the key."}, {"tag": "p", "text": "Sometime after Jabba found out about the key, G-5PO hired a spacer to take the credits to Jurek. Soon afterwards, Jurek gave the spacer the key in exchange for the credits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sliv Jurek first appeared as part of Star Wars Galaxies, a 2003 MMORPG online video game produced by Sony Online Entertainment. The quest he appeared in was part of Jabba's Theme Park and was given to players by Jabba the Hutt's translator droid, G-5PO. Before the players were able to receive the quest they had to complete quests for other employees of Jabba the Hutt, including Reelo Baruk, Ree-Yees, Ephant Mon, Porcellus, Barada, and Bib Fortuna, as well as other quests from G-5PO. The quest involving Jurek was removed from the game when the New Game Enhancements changed gameplay in the game during 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}