{"url": "Slith", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with elements from unlicensed sources", "Category:Extinct sentient species", "Category:Outer Rim Territories species", "Category:Reptilian sentient species", "Category:Slith"], "nodes": [{"tag": "h1", "text": "Slith"}, {"tag": "p", "text": "The Slith were a sentient serpentine species native to the moon Yavin 13. Nomadic creatures, they lived in patriarchal tribes of up to fifteen individuals and had little civilization and no permanent structures. The Slith were venomous, preferring to paralyze their prey before eating them alive. They communicated with each other via a rudimentary language consisting of noises produced by rubbing their scales on the ground. Slith had little contact with the wider galaxy, remaining largely undiscovered until the reign of the Galactic Empire. During the Yuuzhan Vong War, their moon was wiped of all life, leading to their extinction."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Slith were a limbless, serpentine sentient species, growing to a maximum of five meters. They were covered in jagged scales and were often patterned in stripes or spots. They had milky-white, translucent eyelids, through which they were able to see; this adaption protected their eyes from sand that was frequently whipped up by the strong winds on their desert moon. Slith were equipped with venomous fangs with which to hunt prey. Their venom paralyzed their victims, enabling the Slith hunters to return live spoils to their tribe; Slith preferred to consume their prey live. Slith locomotion involved skimming over sand using a twisting action. Alternatively, the Slith could move sideways (known as sidewinding), and in this manner could attain greater speeds. This was particularly useful while hunting, allowing for intense bursts of speed to catch prey. It worked equally well to avoid hazards. While lacking limbs, Slith were able to manipulate items using their coils and mouths, picking up rocks and spears. Slith also had forked tongues."}, {"tag": "p", "text": "The Slith were nocturnal creatures, hunting for small lizards and other reptiles during the cool nights. During the hot day, they sought refuge in the shade of giant cacti or other convenient locations. The moon was known to reach temperatures as high as fifteen Galactic Standard degrees, so in the hotter summer months, Slith burrowed deep into sand. This protected them from the worst of the heat while retaining heat for the nights, which could drop to near freezing."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Slith were a nomadic species, creating no permanent dwellings on their homeworld of Yavin 13. An alpha male led a small tribe of Slith, of no more than eight to fifteen individuals. In addition to the alpha male, tribes consisted of a \"lieutenant\" male, several mating females with their young, and a couple of juvenile males. When these males came of age, they were exiled from the tribe to form a new family or wander alone. These tribes followed a patriarchal model, with the male responsible for guarding the community's traditions while the females did most of the actual work hunting. Juvenile males were also assigned to protect the young during these hunts. Among the females a Slith known as the First Mate had authority."}, {"tag": "p", "text": "The Slith developed a grammatically simple language known as Slithese, the sounds of which were produced by rubbing their rough scales over the ground. A number of simple signals could be produced, which conveyed different meanings. The language could be learned by non-Slith also; a number of Gerb—the second sentient species on the moon—learned this skill as a self-defense mechanism. Slith lacked vocal cords, and so were unable to speak Galactic Basic Standard, and while they were able to produce some vocal noises, the unavoidable consequence of moisture evaporation discouraged this developing into an actual language."}, {"tag": "p", "text": "The Slith had a number of complex communal ceremonies, which provided confirmation to offworlders of their intelligence. These included praying for the spirits of dead ancestors and to desert gods worshiped by the Slith. This task was carried out by female shamans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Slith were still many centuries from developing industrialization at the time of the Galactic Civil War. They had little contact with the wider galaxy, and negligible contact with the Gerb; however, on occasion the two did cooperate. On such occasions, twilight lizards proved to be valuable commodities to trade with the Slith. The small reptiles were an excellent source of water and nourishment. Yavin 13 had long been thought to be devoid of intelligent life, until an Imperial scouting expedition discovered both the Slith and the Gerb. At this time, there were approximately nineteen million Slith on the moon."}, {"tag": "p", "text": "The Rebel Alliance also had some contact with the Slith, sending some negotiators to the moon to open relations with both species; however, the expedition was sidetracked when the Fernandin Scouting Expedition, which was also on the moon at the time, accidentally introduced a plague that threatened to wipe out the Gerb. When the plague threatened to transfer to Humans, the Imperial presence in the system considered bombarding the moon to prevent further spread. Preventing this massacre of the native lifeforms became the Rebels' priority over and against contact with the Slith."}, {"tag": "p", "text": "A tribe of Slith also came into contact with the renowned treasure hunter Suz Tanwa. The Rodian was searching for an old family heirloom left by her ancestor Suvam Tan. Traveling to Yavin 13 in her starship, the Reeko, she located the burial site of an ancient pod left by her ancestor as a clue. However, in the site she began to dig, four Slith were resting. They quickly surrounded her, one finally wrapping her in his coils and delivering her to the mouth of a nearby Gerb burrow. The Gerb were able to retrieve the pod from within their burrow without Tanwa digging through their roof."}, {"tag": "p", "text": "The Slith continued to live on the moon into the time of the New Republic, and their existence was known to the Jedi students on the neighboring moon of Yavin 4 in 22 ABY. However, this peaceful existence was brought to an end during the Yuuzhan Vong invasion. As part of their efforts to crush the New Jedi Order, the Yuuzhan Vong invaded and conquered the Yavin system. In addition to razing the Jedi temple on Yavin 4, they wiped Yavin 13 and Yavin 8 clean of life—causing the extinction of the Slith."}, {"tag": "h2", "text": "Slith in the galaxy"}, {"tag": "p", "text": "While the Slith were largely unknown to the galaxy until discovered by Imperial scouts, one Slith was known to have left the moon far earlier: during the Great Sith War, a red-skinned Slith known as Sssiii was part of the Galactic Circus. While possessing only limited intelligence, the Slith entertained by playing chess against spectators. Sssiii was present with the Galactic Circus when they toured the planet Tatooine."}, {"tag": "p", "text": "One notable Slith during the Galactic Civil War was Dresk Kist. Both shaman and First Mate of her tribe, Kist also excelled as a hunter. She frequently went on solo hunts while the rest of her tribe slept. It was on one such excursion that Kist encountered a Rebel scout team that was exploring the moon for a suitable location for a base of operations."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Slith first appeared in Galaxy Guide 2: Yavin and Bespin, published by West End Games in 1989. This information was later repeated in Alien Encounters in 1998, alongside an original illustration. Further information on the Slith was provided in Geonosis and the Outer Rim Worlds (2004) and Yavin: The Big Red One (2004), an installment in the Wizards of the Coast Planet Hoppers series. A Slith by the name of Sssiii also appeared in the article Le facteur X in the French roleplaying game magazine Casus Belli in 1998. It is unknown whether this article went through the Lucasfilm licensing process, and so its canonicity is uncertain."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Ambiguously canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}