{"url": "Sluissi", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Outer Rim Territories species", "Category:Reptilian sentient species", "Category:Sluissi", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Sluissi"}, {"tag": "p", "text": "The Sluissi were the indigenous sentient species of the planet Sluis Van, located in the Outer Rim Territories. While their bodies above the waist were humanoid, their lower halves were serpentine, long and heavily muscled. Sluissi were noted for their calm temperament, aversion to rushing and impatience, compliance to protocol, no matter how trivial, and their technical aptitude. Like many reptiles, Sluissi could use their forked tongues to sense heat."}, {"tag": "p", "text": "Renowned for their ability to repair and maintain starships, the Sluissi were active in galactic society almost since the beginning of the Republic. This was because the Sluissi's technology was almost on par with other space-faring races such as Duros and Humans."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Sluissi's upper torsos were similar to a human's, with two arms, each with four-fingered hands. Their fourth finger was an opposable digit. Their arms had almost winglike extensions of skin, which aided their movement while they were flat on the ground. The bottom half of their body was similar to a snake's, with a long, heavily muscled, singular tail. Their bodies were covered in fine scales which ranged in color from light brown to dark green. Other colored scales on Sluissi were not unheard of, however they were quite rare. Sluissi had round black eyes and a swooping, hoodlike fold of tough skin at the back of their heads. They had forked tongues that aided their sense of smell. The average member of the species weighed 60 kilograms."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Sluissi were patient, sociable, relaxed, and easy-going beings, famous for remaining calm under pressure. Their patient, calm nature—combined with their seeming inability to become genuinely upset or angry—often baffled, and sometimes even infuriated other species. Extremely industrious, Sluissi loved to tinker with technology and mechanical objects, and Sluissi technicians were able to improve the engine efficiency, power output and system response in even archaic, worn out ships."}, {"tag": "p", "text": "The Sluissi were extremely methodical, and worked extremely slowly. To them, starship construction was an art form. Although jobs done by Sluissi always took longer than expected, most clients were willing to be patient, because Sluissi technicians could make improvements upon or salvage vessels when no other mechanics could. Even the Empire realized that rushing a Sluissi operation was a bad idea."}, {"tag": "p", "text": "As well as Sluissese, their native language, Sluissi spoke Basic, though they tended to slur and lisp many words, due to the snakelike structures of their tongues and mouths."}, {"tag": "p", "text": "Common Sluissi names included Sirlahn Alsek, Vsil Ejahsa, Usahn L'sehl, Sekae N'sehnor and Mektiss Risohr."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sluissi joined the Old Republic when it was still relatively young. When Duros and Human scouts first discovered Sluis Van, the Sluissi had only just begun to explore nearby systems with their own lightspeed technology, and they eagerly embraced the concept of greater galactic union. An advanced people, they established a number of major space yards throughout the Sluis sector, including the high tech Sluis Van space facility, as well as on other colonies they had established to spur further interaction with offworld space travelers. They ran efficient operations, where ship crews could find all the service, expertise and upgrades necessary after long journeys. The Sluissi quickly became known as one of the best starship maintenance species in the known galaxy."}, {"tag": "p", "text": "However, shortly before the outbreak of the Clone Wars, they became disillusioned with the Republic, and were among the first to secede and join the Separatist cause. Nevertheless, some Sluissi were aligned with the Republic."}, {"tag": "p", "text": "After the end of the Clone Wars, the Sluissi lived under Imperial occupation. When this ended, they became valuable members of the New Republic. In 9 ABY, the Imperial Navy launched an attack on three of the planets in the Sluis Van Sector, in an attempt to steal warships from the Sluissi shipyards. The resulting Battle of Sluis Van almost ended in victory for the Empire. However, the Millennium Falcon was in the area at the time, captained by Han Solo, and aided both the New Republic military and the Sluissi people. During the New Republic's rule, Mammon Hoole included an entry on the Sluissi in his publication The Essential Guide to Alien Species."}, {"tag": "h2", "text": "Sluissi in the galaxy"}, {"tag": "p", "text": "Offworld Sluissi tended to work as tech-specialists, engineers or mechanics, although it was not uncommon to see a Sluissi working as something else. At least one Sluissi was Force-sensitive and served as a Jedi during the Mandalorian Wars. This individual was one of Lucien Draay's Covenant Shadows, a secret force of Jedi of whom all records had been erased to allow them to work undercover."}, {"tag": "p", "text": "Ten Dorne was a Sluissi who worked on Shantipole Project with Admiral Gial Ackbar. The project revolved around the development of the B-wing starfighter. Shortly before the Battle of Endor, Dorne was captured by Imperials. The experience made her doubt her devotion to the Rebel cause, so she decided to defect and later sold information about the Alliance to the Empire. She was later believed to be working at the Imperial Remnant shipyards on Vosteltig."}, {"tag": "p", "text": "Sere Lure was an attractive, green-skinned female Sluissi engineer, who worked for Hydrospeare Corporation. Dr. Lure was a rarity; she was one of very few aliens permitted and willing to work in the development of Imperial technology."}, {"tag": "p", "text": "Candobar Inglet was the ruler of Sluis Van and the Sluis Sector during the Clone Wars and for several year beforehand. Just before the start of the war, he and his sector defected to the Confederacy of Independent Systems."}, {"tag": "p", "text": "Other Sluissi included Hass Sonax, a female Sluissi slicer, Corlissi Ludar, the Sluissi senator who pledged Sluis Van's alliance with the CIS, Slith Skael, the chief communications technician of the Intergalactic Communications Center towards the end of the Clone Wars, and Secles Uslopos, a male Sluissi councilor to the Twi'lek crime lord Abdi-Badawzi on the planet Socorro."}, {"tag": "p", "text": "Alessi Quon was a male Sluissi scientist who worked for the Experi-Tech department of Imperial Intelligence shortly before the Battle of Yavin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Statue\" quo à Sluis Van, an issue of the French RPG magazine Casus Belli, contains additional material on the Sluissi. According to this article, the Sluissi were a calmly methodical species who compensated for physical frailty with technological skill and ingenuity. In contrast to mentions of a Khedive in Clone Wars material, this source says that Sluis Van was governed by an elected parliament of a hundred members, known as the Council, and throughout the New Order, their political consensus was that loyalty to the Empire had brought their world prosperity."}, {"tag": "p", "text": "According to this material, the Sluissi joined the New Republic in around 6 ABY thanks to a diplomatic mission led by Jonas Stern and Borsk Fey'lya."}, {"tag": "p", "text": "The novel Jedi Trial incorrectly depicts the Sluissi, Sluis Van, and the Sluis sector as aligned with the Republic rather than the Confederacy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Ambiguously canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}