{"url": "Slyyth", "categories": ["Category:Canon articles", "Category:Criminals", "Category:Males", "Category:Ruurians"], "nodes": [{"tag": "h1", "text": "Slyyth"}, {"tag": "p", "text": "Slyyth was a male Ruurian criminal who lived on the planet Lothal during the early years of the Galactic Empire's reign. He sometimes worked with the street urchin Ezra Bridger and on one occasion persuaded him to steal a shipment of Imperial helmets meant for the Imperial Academy on Lothal."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the early years of the Galactic Empire's reign, the male Ruurian Slyyth worked as a fence and pick-pocket on the planet Lothal. He often recruited orphan children to work for him, and on occasion convinced the street urchin Ezra Bridger to work with him on a snatch-and-run job which resulted in Bridger nearly being caught in an Imperial sting operation. Slyyth also offered the boy pickpocketing lessons, although Bridger was already experienced enough not to need them. Bridger drew and wrote about the Ruurian in his journal after working with him."}, {"tag": "p", "text": "The fence later met Bridger again in the spaceport of Lothal's Capital City and tried to convince him to take part in another snatch-and-run. Bridger refused, even when Slyyth claimed he needed the money for medication to stop his metamorphosis into a chroma-wing. When Slyyth revealed that the job would involved stealing cargo destined for the Academy for Young Imperials however, the urchin reconsidered, as he collected Imperial headgear. Bridger successfully stole the cargo Slyyth had specified from Supply Master Yogar Lyste, and left the Ruurian's cut of the loot in a refuse bin. The urchin later discovered however that the cargo he had stolen consisted of propaganda holopad, not helmets."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Slyyth had blue, yellow and red skin, with red eyes and blue and purple fur. He clacked his mandibles together instead of smiling and would sometimes brush his feathery antennae against other's faces when talking to them."}, {"tag": "p", "text": "Slyyth greatly feared the process of metamorphosis which all Ruurians underwent in order to become chroma-wings. Most of his species considered the adult life stage to be one of bliss, but the fence feared he would not be able to continue his criminal activity and become rich after the transformation and so used various treatments to prevent the change from taking place. Some of the medication he used caused negative side effects, such as coughing, yellow splotches and loss of hair, but the criminal was willing to endure them as long as he did not transform."}, {"tag": "p", "text": "Slyyth exaggerated his illness when trying to persuade Bridger to aid him, and also used flattery, claiming that Bridger was the best pickpocket he knew. Finally he considered offering the job to other pickpockets such as Kinsdaw or Tesba before Bridger agreed to help."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Slyyth first appeared in two books released on October 21 in 2014 as part of a tie in to the Star Wars Rebels television show. The first book was Rebel Journal by Ezra Bridger, a young readers book written as an in-universe journal of Bridger, including his drawing of and thoughts on various other characters including Slyyth."}, {"tag": "p", "text": "The second book, The Rebellion Begins, was a novelization of the Rebels TV movie Star Wars Rebels: Spark of Rebellion written by Michael Kogge, although Slyyth appeared in one of several scenes in the novel which did not appear in the film itself. Kogge later wrote about creating Slyyth in a blog entry titled \"Writing The Rebellion Begins\" on StarWars.com, in which he revealed the character had been created in order to explain the origin of the propaganda holopads that Bridger steals, which had appeared in an early draft for Spark of Rebellion. The characters that Kogge claimed inspired Slyyth were Faggin from Charles Dickens' Oliver Twist and the Caterpillar from Lewis Carroll's Alice in Wonderland. The blog also included an image of the Ruurian drawn by David Rabbitte."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}