{"url": "Slyther_Bushforb", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Coruscanti", "Category:Males", "Category:Nuknogs", "Category:Private investigators"], "nodes": [{"tag": "h1", "text": "Slyther Bushforb"}, {"tag": "p", "text": "Slyther Bushforb was a male Nuknog private investigator who worked on Coruscant, the galactic capital. Originally from Sump, Bushforb left that planet's swamps behind in order to live on Coruscant and work as a detective. He became quite skilled at his craft, accumulating resources and contacts, such as Dexter Jettster and Rednax. In 22 BBY, he was interviewed, briefly, by HoloNet News, on the subject of the \"Baby Ludi\" custody battle that was enthralling the populace."}, {"tag": "p", "text": "Two months later, he was hired by Vekka Lodik, agent of the actor Seboca, to discover the identity of someone who was trying to kill her charge. Taking to the case quickly, but not trusting Lodik at all, Bushforb followed a string of leads, helped by Jettster and a contact in the Bounty Hunters' Guild. His investigation eventually led him to a flat that Seboca owned under the name of \"Manoca.\" Entering, he was confronted by Lodik, who had been planning to kill Seboca all along and frame Bushforb for the deed. The detective was not easily defeated, though, and he was able to kill Lodik."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "From swamp to sleuth"}, {"tag": "p", "text": "Slyther Bushforb, a male Nuknog, was a native of Sump, and, unlike most of his fellow Nuknogs, he decided to leave the swamps of his homeworld behind. He took himself to the galactic capital of Coruscant and eked out an existence as a private investigator—or, as he liked to refer to himself, a \"private dack.\" He accumulated considerable experience during his tenure on Coruscant, and became familiar with the everyday goings-on of his profession. He made contacts such as diner owner Dexter Jettster, and friends such as the Dug Rednax. Dex's Diner, in particular, became a favorite of Bushforb's, for its ardees, although he once claimed that Biscuit Baron's ardees was superior."}, {"tag": "p", "text": "During the Separatist Crisis in 22 BBY, Bushforb was approached by HoloNet News to comment on the \"Baby Ludi\" case, in which a displaced mother, Jonava Billane, fought for custody over her child, Aris Del-Wari, against the Jedi Council. The Jedi had just refused to return the child to her mother, as they had already \"awakened\" her to the Force, and placing her amongst the general populace would be dangerous. The Nuknog reasoned that the Jedi had their own rules established in order to keep the galaxy safe, but he also commented on the state of the galaxy at the time, which he believed was less than stable or safe."}, {"tag": "h3", "text": "The lady in the plaza"}, {"tag": "p", "text": "In 22 BBY, a female Nuknog approached Bushforb with a case. The private investigator found her attractive, but did not trust her at all. She identified herself as Vekka Lodik, agent to the star of the recent play Airtaxi Driver, Seboca. Lodik claimed that someone was attempting to kill Seboca, and she wanted Bushforb to find out who. The private investigator accepted the task, and set about his work quickly. Along with Rednax, he set up a meeting with Seboca at Dex's Diner, and shortly before the meeting Bushforb conversed with the Triffian Ony Bobissia. During the meeting, Seboca was irritated by the presence of the Jedi Knight Obi-Wan Kenobi in a nearby booth, but Bushforb was able to talk the actor into calming down. The rest of the meeting passed without incident, and Bushforb began chasing up leads immediately."}, {"tag": "p", "text": "Kenobi had been talking to Jettster, but once the Jedi had left, Bushforb asked the Besalisk what he knew about the business with Seboca. Jettster imparted valuable intelligence to the Nuknog, and that in turn led him to a friend he had in the Bounty Hunters' Guild. That friend provided him with a solid lead, which then led him to a modest, unmaintained flat below Pom Plaza. The flat was registered to one \"Manoca,\" another Dug. Rapidly entering the structure, Bushforb was met with the sight of Lodik training a blaster on him, and he realized that it was she who had been trying to assassinate Seboca."}, {"tag": "p", "text": "Manoca was in fact merely an alias for Seboca, used to keep a low profile. It was Lodik's hope that he would return to his secret flat, in which event she would then kill him, and frame Bushforb for the murder. The Nuknog found the prospect considerably less attractive than the one offering it, and so he decided to turn the tables on the duplicitous agent. Making things easier for him was the fact that she was inexperienced with weapons, and so when she glanced away, he took the opportunity to draw his own weapon and shoot her dead on the spot."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "With his unusual career path and world of residence for a Nuknog, Slyther Bushforb was a perceptive being, and highly skilled at his job. By the time he had established himself in the business, he was world-weary, having accumulated a stockpile of sources and \"friends.\" He knew potential trouble when he saw it, and was able to talk his way out of a heightened situation. Bushforb worked quickly, sometimes segueing instantly from a meeting with a client to following up a lead. He was also skilled in the use of a blaster. In regards to the Jedi, Bushforb was respectful of their traditions, but believed that the state of the galaxy in light of the Separatist Crisis was not a happy one."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Slyther Bushforb was first shown in HoloNet News Vol. 531 46, published in 2002, where he was illustrated by Joe Corroney. The character later appeared, the same year, in George Lucas' Star Wars: Episode II Attack of the Clones, during the scene in Dex's Diner. The computer-generated model for the character was recycled and modified from the model of Ark Roose, a character in 1999's Star Wars: Episode I The Phantom Menace. This same process was used for several other characters in the same scene. Bushforb was featured, albeit in a nameless fashion, in David West Reynolds' Star Wars: Attack of the Clones: The Visual Dictionary, and was mentioned fleetingly in the sourcebook Coruscant and the Core Worlds."}, {"tag": "p", "text": "In 2008, the character's story was developed by John Hazlett, author of the Cane Adiss Databank entry, through StarWars.com's Hyperspace feature \"What's The Story?\" Upon realizing that \"What's The Story?\" writers were being given the opportunity to write about a private detective, Hazlett decided to push the envelope in terms of what could be achieved with a Databank entry, in terms of style, rather than storytelling or continuity. After researching Bushforb's existing canon material and re-watching his scene in Attack of the Clones, Hazlett began researching the hardboiled detective genre. His familiarity with the genre was limited, so he turned to the parodies of it in the Calvin and Hobbes comic strip, before looking into Mickey Spillane's Mike Hammer novels,  Twists, Slugs and Roscoes: A Glossary of Hardboiled Slang, and episodes of Dragnet on YouTube."}, {"tag": "p", "text": "Drawing inspirations from those sources, Hazlett populated Bushforb's story with both new characters, such as femme fatale Vekka Lodik, and existing ones, such as Seboca from Attack of the Clones. He also made a number of other references to disparate Expanded Universe elements in his entry, tying Bushforb to the Bounty Hunter's Guild from K. W. Jeter's The Mandalorian Armor, and Pom Plaza, from a fictional advertisement on the HoloNet News website. The StarWars.com staff considerably changed Hazlett's entry, but most edits retained the hardboiled tone of his original work."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}