{"url": "Small_Favors", "categories": ["Category:Real-world articles", "Category:Star Wars Adventure Journal fiction"], "nodes": [{"tag": "h1", "text": "Small Favors"}, {"tag": "p", "text": "Small Favors is a short story written by Paul Danner published in Star Wars Adventure Journal 12 by West End Games in February 1997. This story features the niece of Grand Moff Wilhuff Tarkin, Rivoche Tarkin."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "At Kuat, Darth Vader observes the arrival of the Executor as he prepares to take command of it. ISB officer Sollaine arrives after being summoned and is informed by Vader that the officer had been assigned the task of rooting out a deep-cover Rebel agent."}, {"tag": "p", "text": "General Airen Cracken is reviewing reports when he is visited by Cryle Cavv. Cracken reveals that an Imperial infiltrator was able to get an encrypted file that contained many of the Alliance's undercover agents and transmitted it to the Empire. While most of the operatives could disappear before being captured, one was unable to change her identity due to her being Rivoche Tarkin, the niece of Grand Moff Tarkin. Cracken requests that Cavv rescue her before the Empire can execute her. Cavv agrees, but asks for some assistance. The general introduces him to Quillin Arkell, a Velabri who will accompany the ex-Special Ops on his mission. On the way to Corulag in the G Cat, Cavv attempts to engage Arkell in conversation, but the warrior informs him that he finds the thief dishonorable. When Cavv tries to joke with the Velabri, Arkell stands up to intimidate Cavv, but knocks himself unconscious in the small confines of the spaceship. As Cavv applies medical aid, Arkell explains the concept of a Velabri Bloodvow and why he is assisting the Rebel Alliance."}, {"tag": "p", "text": "Onboard the Star Destroyer Devastator, Solliane receives the decrypted list of Rebel agents. While Captain Nevik wanted to head to the Alfestril system which was closest to their location, Solliane recognized Rivoche and determined she was a priority. He ordered the Star Destroyer to immediately head to Corulag and to shut down all communications to preserve the element of surprise. Nevik objected to that command and confronted the ISB officer. Solliance wrapped one of his prosthetic hands around the Captain's throat and started to strangle him. As he did, he unleased an electrical shock from the hand that electrocuted the man. He then seized command of the vessel and ordered it to Corulag."}, {"tag": "p", "text": "As the G Cat approached Corulag, Arkell looked around the ship and realized it was a Helix-class light interceptor. Cavv informed him that he had the proper paperwork to alleviate any suspicion and that the ship would help reinforce the thief's disguise as a flamboyant Imperial noble. He persuaded Arkell to act as a bodyguard. Upon their arrival, they were surprised by the armada of ships surrounding the planet. They came to find out that there was a large engagement party for the impending nuptials of Vastin Caglio and Rivoche Tarkin. Cavv had his droid R2-RC add them to the invitation list."}, {"tag": "p", "text": "The Devastator arrived at Corulag and nearly collided with a cargo frigate. Solliane was astonished about the large number of ships in orbit and demanded more information. Major Gistol, Solliane's adjutant, informed him about the engagement party and told him that no ships were allowed to land on the planet for security reasons. Solliane contacted the officer in command, Admiral Nyran, and demanded landing privileges. The admiral denied, and when Solliane tried to override the order, informed the ISB officer that the restrictions were put in place by Vader himself. Solliane asked what would happen if he tried to land ground forces on the planet, and the admiral told him he would open fire and destroy them. The ISB officer broke off communications and quickly devised a plan to have the Devastator open fire on a random independent ship, and then escape into hyperspace. During the confusion of the attack, Solliane and a squad of Storm Commandos would use a Beta-class shuttle to sneak onto the planet."}, {"tag": "p", "text": "Rivoche Tarkin was in her penthouse suite preparing for the party when her door chime rang. She was told there was a delivery of flowers for her and she had to sign for them. Exasperated, she opened the door to find Cavv and Arkell. Cavv gave her the code phrase to identify himself and told her that he was there to get her off-planet before the Imperials could get to her. As they prepared to leave, Solliane and the squad of Storm Commandos arrived at Tarkin's door. Cavv shoved a package he had brought into Solliane's hands, and closed the door. As the Imperials attempted to blast their way through the door, Cavv used a remote detonator to blow up the thermite in the package. The explosion damaged the building, and knocked the Imperials off Tarkin's doorstep so that the rebels could escape. Despite the explosion, Solliane survived but was blown outside of the building onto a roof. Injured, he managed to get up and resume his chase of the rebels."}, {"tag": "p", "text": "Cavv, Arkell, and Tarkin fled to the ground levels of Curamelle and attempted to make it back to their ship. Cavv was upset that the city was swarming with Imperial patrols. While thinking about their situation, Tarkin expressed her disdain for Vastin Caglio and his father, the Moff Caglio. Cavv was able to deduce that the Caglios thought that Tarkin was abducted by rebel agents, and Solliane was working on his own to capture Tarkin and expose her treason. Despite this realization, the group was still trapped on Corulag. Unable to get to the spaceport, Cavv decided to bring his ship to the group's location. He determined the best place to meet the ship was the roof of the Royal Galaxy Hotel. While the group made their way to the hotel, Solliane entered the headquarters of Coreguard Security Services and offered 200,000 credits to hire a group of bounty hunters to assist the ISB officer. As he left the building, he saw the Royal Galaxy Hotel and realized that the rebels would try to use the roof as an place to rendezvous with their ship and escape the planet."}, {"tag": "p", "text": "Cavv and his group snuck into the hotel and hid in an empty room. The thief had ordered his droid to tap into the hotel's security cameras and learned that Solliane and his group of hired bounty hunters were on the roof to prevent escape. Cavv arranged for some backup and proceeded to make himself comfortable on a bed while he waited. Arkell was certain the only way out was to fight, and started to leave the room. When he opened the door, he saw a female dressed in body armor who he thought was the imfamous bounty hunter known as Beylyssa. In reality, it was Finn Varatha in disguise. She was contacted by Cavv to provide assistance with their escape from Corulag. The group prepared themselves and headed to the roof. After a fierce battle, they managed to dispatch the bounty hunters from Coreguard and forced Solliane to flee the scene. R2-RC piloted the G Cat to the hotel and landed it on the roof."}, {"tag": "p", "text": "Once in space, Cavv and R2-RC tried to avoid a group of TIE fighters while weaving their way through the congestion in orbit around Corulag. Arkell manned the plasburst laser cannon and destroyed some of the pursuers. Solliane took his shuttle from the surface and met up with the Devastator. He ordered the Star Destroyer to chase down and capture the rebels. As Cavv maneuvered his way through the traffic, two Carrack-class cruisers attempted to box him in and seize his ship with their tractor beams. Cavv was able to avoid them, causing the two cruiser to lock onto each other and collide. The Devastator closed on the G Cat and attempted to snare it with its tractor beams, but was blocked when the Executor arrived. The distraction allowed Cavv to evade capture and escape into hyperspace to safety. Solliane was confronted on the bridge of his Star Destroyer by a hologram of Vader, who blamed the ISB officer for the failure."}, {"tag": "p", "text": "Cavv meets Cracken after returning to the Alliance base and received congratulations on a successful mission. Arkell informs Cracken that his Bloodvow has been paid. Cracken reveals to Arkell that he promised Cavv to re-instate his Special Ops Group and to transfer Arkell and Varatha to it immediately."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}