{"url": "Sluis_Van_Central_space_station", "categories": ["Category:Legends articles", "Category:Shipyards", "Category:Sluis sector space stations"], "nodes": [{"tag": "h1", "text": "Sluis Van Central space station"}, {"tag": "p", "text": "When the technologically-advanced Sluissi species joined the infantile Galactic Republic, they established several major shipyards throughout the Sluis sector. Once such space station was the high-tech Sluis Van Central space station. The station, also referred to as the Sluis Van space facility, performed duties similar to others operated by the Sluissi. It catered to starship pilots seeking maintenance to prepare for, or recover from, their various activities."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 9 ABY, following Grand Admiral Thrawn's raid of the Sluis Van Shipyards that was repelled by New Republic forces, the massive station was overwhelmed by repair orders. Sluissi defense craft were given top priority over the Republic fleet and civilian vessels, much to the chagrin of Jedi Master Luke Skywalker, who was in need of new Hyperdrive motivators for his X-wing so he could fly to Coruscant and prevent the political expulsion of Supreme Commander Ackbar. Enlisting the help of his friend, General Wedge Antilles, Skywalker tried to diplomatically have his priority raised, though Antilles's efforts were rebuffed by a data pusher in the system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sluis Van Central space station appeared in Timothy Zahn's 1992 novel entitled Dark Force Rising and was later mentioned in the Dark Force Rising Sourcebook, an adaptation of that book to the West End Games Star Wars roleplaying game. The section detailing the Sluissi species, which referenced the facility, was later collected in The Thrawn Trilogy Sourcebook, a summary of the sourcebooks made for each novel in Zahn's trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}