{"url": "Sluis_Van/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Eriadu Authority planets", "Category:Fortress worlds", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Planets with shipyards", "Category:Rimma Trade Route", "Category:Sluis sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Sluis Van"}, {"tag": "p", "text": "Sluis Van was the primary planet in the Sluis sector of the Outer Rim Territories. It was the homeworld of the Sluissi race and the location of the famous Sluis Van Shipyards."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Sluis Van was a world located along the Rimma Trade Route. It was the capital of the Sluis sector, in the Outer Rim Territories. It was the site of an extensive deep-space docking facility and shipyard, the largest and most impressive in the area. The docking station was defended by perimeter battle stations, while the shipyards were managed by an outer system defense network as well as the Sluis Control."}, {"tag": "p", "text": "The planet was ruled by the Sluis Van Congregate The leader of Sluis Van was called a khedive."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "Sluis Van was discovered by Human and Duros explorers, during the Subterra Period."}, {"tag": "p", "text": "The Sluissi were long supporters of the Galactic Republic, with Sluis Van being home to a vital network of Republic shipyards that were destroyed by the Sith during the Great Galactic War."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Millennia later, during the final years of the Republic, they became disgusted with the Galactic Senate whom they blamed as being massively corrupt and causing galaxy-wide injustice."}, {"tag": "p", "text": "The planet was represented in the Galactic Senate by Bor Gracus in 33 BBY and then Corlissi Ludar, until 22 BBY, when Sluis Van seceded during the Separatist Crisis. Candobar Inglet was the the Sluissi Khedive prior and during the Clone Wars."}, {"tag": "p", "text": "During the Clone Wars, Sluis Van was located in Separatist space and the Sluis Van shipyards produced starships for the Confederate forces. However, in 20 BBY, the system was blockaded by a massive Separatist fleet to block any Republic reinforcements in the area, particularly during the Battle of Praesitlyn. At the end of the Clone Wars, the Sluis Van system had become a Separatist stronghold. As well as many other Confederate worlds, it was besieged by Republic forces during the Outer Rim Sieges. Sluis Van held off the Republic. However, the civilians didn't fare well, as mass-starvation broke out on the planet as a result of the Outer Rim Sieges."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Imperial Period, Sluis Van was a major Imperial shipyard and was heavily guarded."}, {"tag": "p", "text": "By 4 ABY, the planet had become an Imperial fortress world under control of Superior General Sander Delvardus. Sluis Van was liberated by the New Republic in 5 ABY. Despite the Sluis Van Congregate not wanting to cut all connections to the Empire, being as it was one of their largest shipyard clients, the planet joined the New Republic several months after the death of Emperor Palpatine."}, {"tag": "p", "text": "During the Thrawn campaign, the Sluis Van Shipyards were one of the main shipyards of the New Republic. The planet was the site of a battle with Grand Admiral Thrawn during his campaign against the New Republic. He attacked 112 stripped-down warships docked over the planet, attempting to capture some of them. Although he failed, Thrawn's forces managed to leave over 40 of the vessels with inoperable control systems."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "During the Yuuzhan Vong War, the world and its shipyards were crucial to keeping the New Republic supplied with new warships. Following the loss of Fondor, additional units of the New Republic Navy, including several carriers, were deployed to the region for added protection, when Sluis Van took over Fondor's operations."}, {"tag": "p", "text": "Sluis Van went on to be a key world in the Galactic Alliance. During the Second Galactic Civil War, it was feared that its shipyards would be a target for the forces of the newly formed Confederation. By 137 ABY, the New Galactic Empire under the control of the One Sith had seized control of Sluis Van. Despite this, the Galactic Alliance Remnant stayed influent on the planet and in the region."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sluis Van was named by author Timothy Zahn after his friend Don Vandersluis."}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places the Sluis sector and, consequently, Sluis Van, in the Core Worlds."}, {"tag": "p", "text": "On page 227 in The Essential Atlas, the name of the planet is misspelled as \"Sluis Var\"."}, {"tag": "p", "text": "The planet and shipyards that Sith forces devastated, in the Great Galactic War, look very similar to Kuat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}