{"url": "Bardottan_Sphere/Legends", "categories": ["Category:Legends articles", "Category:Bardottan culture", "Category:Dathomir Magic", "Category:Force-sensitive objects"], "nodes": [{"tag": "h1", "text": "Bardottan Sphere"}, {"tag": "p", "text": "The Bardottan Sphere, also known as the living sphere, was an orb created by the Nightsisters of Dathomir and used by the Frangawl Cult to contain the living Force they siphoned using the Frangawl sacrificial ceremony."}, {"tag": "h2", "text": "Overview"}, {"tag": "h3", "text": "Description"}, {"tag": "p", "text": "A crystalline sphere of milky glass, the Bardottan Sphere could only be activated by Force-sensitives. Taking on a semblance of mineral life when activated, the sphere had its own internal light when triggered and would form a link with nearby creatures as directed by the Forceful individual wielding it. Once activated, the Sphere had the ability to close off a being's connection to the Force and then extracted the Living Force from the target, killing them. A Force vacuum, the sphere reflected the Force when inert and thus attracted the Force when activated and could be considered an anti-Force artifact. With the Force stored inside it, the Sphere worked like a type of battery, slowly losing charge if not used."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Created by the Nightsisters of Dathomir and used by the Frangawl cultists to attack the Bahk-tov Council and murder several Dagoyan Masters, the Sphere was largely destroyed by Mace Windu during the Clone Wars. The shards of the Sphere were collected by the Dagoyans and were kept within the Royal Palace under close guard. Scholars studied the Sphere, hoping to use it for benign purposes. Despite attempts to do so, the Bahk-tov Council has largely rejected attempts to study it before a clear, detailed plan of its use could be compiled and scrutinized."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}