{"url": "Smileredon-Verdont", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Character stubs", "Category:Males", "Category:Squibs", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Smileredon-Verdont"}, {"tag": "p", "text": "Smileredon-Verdont, better known as Smiley, was a male Squib with blue fur and yellow eyes."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Although he claimed to have been born on the flagship Wholesale of the Squib Reclamation Fleet, Smiley hailed from Metrobig City on Skor II. When he was only seven, his parents, both industrial traders, gave him to another family in exchange for a mining borelifter."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Smileredon-Verdont ended up as a companion to a trader from the Minos Cluster. During this time, Smiley claimed, the pair visited the planet of Yelsain and \"tamed the woods\" there. Smiley took to dressing in the style of a Yelsain tree-dweller at this time. A few years later, the trader lost his ship to impoundment, and Smiley took to wandering about the Outer Rim Territories."}, {"tag": "p", "text": "He claimed to be a practitioner of the Mystic Martial Arts of Squib Combats and Transactions, although whether there was any truth to his claim remains uncertain."}, {"tag": "p", "text": "Sometime before the Battle of Yavin, the Squib became an associate of Raal Yorta and Sammie Staable. While Raal and Sammie chased bounties, Smiley was a pickpocket, stealing credits and chronos."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Smiley was based on a character roleplayed by Orrin Marko, in the Rebel Breakout scenario of the Star Wars: The Roleplaying Game gamemastered by Pablo Hidalgo."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "In 1996, Hidalgo included the character in the West End Games sourcebook Heroes & Rogues as a worked example of the \"Annoying Squib\" character template."}, {"tag": "p", "text": "Hidalgo's original full name for Smiley was Smileredon-Verdonté. Unfortunately, West End Games format did not recognize the special character é, and published the name as Smileredon-Verdont."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}