{"url": "Smuggler/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Criminal occupations", "Category:Smuggler starships", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Smuggler"}, {"tag": "p", "text": "A smuggler, also known by the euphemism free trader, was someone who engaged in the clandestine shipment of goods or people to prevent taxation or some other impediment. The goods shipped were often highly illegal or banned in some sectors. Weapon smugglers were referred to as gun runners."}, {"tag": "h2", "text": "Profession"}, {"tag": "p", "text": "Smuggling, while a part of galactic trade for many years in the Galactic Republic, absolutely thrived under the Galactic Empire's strict control of goods. The nationalization of former Separatist companies' assets, including their vast merchant fleets, greatly increased smuggling's appeal—and demand. By 3 ABY, smuggling had become so common that Imperial officers often looked the other way if they found a smuggling outfit. For example, Admiral Kendal Ozzel, dismissed the Rebel outpost Echo Base on Hoth as a smuggling operation when reports of its location arrived from an Arakyd Viper probe droid. The fact that many smugglers operated in support of the Rebellion and channeled funds to them made such distinctions even more difficult."}, {"tag": "h2", "text": "Smuggled goods"}, {"tag": "p", "text": "By far the most commonly smuggled substances were varieties of spice. Although most kinds of spice were psychoactive drugs, and most forms were illegal under the Empire, the government's main concern was not to stem the flow of spice, but to collect taxes from its shipment and distribution through legitimate channels. Weapons were another commonly smuggled commodity within the Empire, whose bureaucracy strictly controlled weapons availability in order to prevent criminals and insurgents, in particular the Rebel Alliance, from becoming significant threats. Other cargo for smugglers included chak-root, stolen merchandise, and even clear water (smuggled to Rampa II). In extreme situations, smugglers delivered standard resources or food; for example, on Abregado-rae, smugglers supplied Separatists after a new regime stopped all food transports to the Separatists in the mountains in hopes of stamping out opposition. During his time as a smuggler, Jolee Bindo stole from the rich and smuggled in the stolen goods to the people of the Ukatis system, due to the blockade imposed by its own king. Some smugglers, such as Mirax Terrik, specialized in finding rare and sometimes illegal goods or artifacts and delivering them to their clients who hoped to avoid using \"official means.\" In addition, sometimes live droids were smuggled through areas such as transport terminals, including that of the space station belonging to the Star Tours interstellar travel agency, with success largely because of G2-9T, the security droid responsible for baggage checks, being incompetent at his job."}, {"tag": "h2", "text": "Stance"}, {"tag": "p", "text": "A common stereotype in the galaxy was that smugglers were usually Corellian, and indeed, there were no shortages of Corellian smugglers, but smuggling was carried out by various freight carriers and criminal organizations of all species and planetary origins. Even members of the Imperial bureaucracy and military establishment had their own smuggling organizations, while other smugglers (such as Prince Xizor of Black Sun) were important players in legitimate galactic business. Fringe elements like the Black Sun established large networks dedicated to evading Imperial forces within the galaxy. Another set of major players in illegal trade were the Hutt Kajidics, vast criminal organizations based around the clan structure of the Hutts. The Hutts controlled a region of the galaxy in the Mid and Outer Rim which maintained independence from the Galactic Republic, and later great autonomy within the Empire; this allowed them to recruit pilots and buy ships for use in smuggling with a minimum of scrutiny, while possessing safe locations for their pilots to use. Some planets were controlled by the Hutts but nominally within the Imperial sphere of influence, such as Tatooine, which provided excellent locations to secretly funnel shipments, pilots, and supplies into Imperial space without arousing suspicion."}, {"tag": "h2", "text": "Common problems for smugglers"}, {"tag": "p", "text": "Smugglers had to worry about attacks from pirates and opportunists who would attempt to steal their cargo, meaning that smugglers needed to avoid some of the most lawless star systems to remain safe. Also, because they were smuggling contraband, they had no hope of help from Imperial/Republic forces and could not seek the protection of the galactic authorities. Most smugglers developed keen skills to avoid trouble, and they modified their ships not only for better cargo capacity, but also for greater speed and defenses. In order to evade Imperial patrols, smugglers often used smaller and less well-known routes that skirted Imperial strong points within the galaxy. There were many of these smuggling routes, and every smuggler usually had his or her preferred ways of getting from place to place safely. Despite their precautions, many smugglers ended their career on prison worlds such as Kessel or Akrit'tar. Many smugglers were also killed during their runs—some even committed suicide to avoid being arrested and sentenced."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The smuggler is one of the classes in the video game Star Wars Galaxies and later used for the Galactic Republic in the video game Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}