{"url": "Sneevel", "categories": ["Category:Canon articles", "Category:Mid Rim species", "Category:Sneevels"], "nodes": [{"tag": "h1", "text": "Sneevel"}, {"tag": "p", "text": "Sneevels were a fur-covered sentient species. Boles Roor was a Sneevel Podracer pilot from the world of Sneeve who competed in at least three Boonta Eve Classic Podraces, two of which the pilot had won. A more infamous Sneevel was the Garel City crime lord Skraik, who operated in the years before the Galactic Civil War."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Sneevels were a sentient species that possessed fur covered bodies and partially fur covered heads. One Sneevel possessed fur that was beige and gray in color, and also had lightly colored skin in addition to yellow eyes. Sneevel's had pointy ears, and could be identified by their toothy underbites, spade-shaped noses, and hunched posture. Sneevel's also had long, skinny arms."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "At least one Sneevel, Boles Roor pursued the sport of Podracing. During the Age of the Empire, Skraik was a Sneevel crime lord who operated on the planet Garel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sneevel Boles Roor hailed from Sneeve, and the species had integrated into the large galaxy during the final decades of the Galactic Republic. As a Podracer pilot, Roor competed in at least three Boonta Eve Classic races on the planet Tatooine, two of which they had won. During a later Boonta race, which coincided with the Invasion of Naboo, the race announcer Fode Annodue mentioned Roor's victories as they introduced Roor to race's audience. Despite previous victories, Roor did not win the race, and instead placed sixth. Roor later took their beige-colored Podracer and raced on a snow-covered world ten years later."}, {"tag": "p", "text": "Much later during the Age of the Empire, a Sneevel crime lord named Skraik operated a gang out the planet Garel in Garel City. In attempt to force his cohorts to work for free, Skraik terrorized them with a pet gundark named Gigi. Despite his initial success with this tactic, his henchmen eventually turned against him with the help of the Lasat Garazeb Orrelios. The gang members overwhelmed Gigi, whom Skraik was using as a mount, and the gundark summarily turned against Skraik when the crime boss fell from her back. Skraik promptly fled the scene when Gigi took control of Skraik's electrostaff."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sneevels were created for the 1999 film Star Wars: Episode I The Phantom Menace. Although detailed conceptual art and full body maquettes for the species, at the time referred to only as \"Shaggy Podracer,\" the film's resident Sneevel, Boles Roor, only appeared as a low res digital model used for distance shots of the character's Podracer. The maquette of Roor was then used for a holoscreen display that appeared in the commentator box. Roor and their Podracer later appeared again in Star Wars: Episode II Attack of the Clones on a holoprojector."}, {"tag": "p", "text": "Although the film does not identify the species by name, the canon source book Star Wars: Absolutely Everything You Need to Know confirmed the name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}