{"url": "Bardron", "categories": ["Category:Legends articles", "Category:Businesspeople", "Category:Krish", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bardron"}, {"tag": "p", "text": "Bardron was a male Krish who ran the swoop-dueling Solo Aerials on Jervo's World above Pantolomin."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Bardron was a representative of Franchise, an organization who had completely control over the duels, including all rights to broadcasts and merchandise, and in some cases—even the duelists themselves. Bardron was in touch with both Jervo Thalien of the Lhosan Industries, who was Franchise money man, and Lady Chantique of The Crucible, the slaver guild that supplied duelists to the Franchise."}, {"tag": "p", "text": "In 3963 BBY Goethar Kleej tried to tell the public the truth about Franchise's dealings with slavers, but that move was anticipated and his was speech replaced with a pre-recorded one. Bardron himself threatened Goethar with a possible \"accident\" that would happen to his son, Aubin Kleej if Gotal refused to cooperate."}, {"tag": "p", "text": "Later, when Jervo Thalien arrived to watch the Finals of the Tandem Open and learned about the presence of his old rival, Marn Hierogryph on the station, Bardron comforted him by saying that he knew about everything that happened on the station and revealed that both Goethar Kleej and Zayne Carrick were about to meet with unfortunate accidents during the Finals, organized by the Franchise. However, despite all his efforts, both Carrick and Kleej managed to survive the race, while Hierogryph was able to broadcast the audio recording of Bardon and Thalien plotting against Kleej during the race, which thousands of viewers were able to hear. All Bardron could do to distract the audience was to announce the name of the winner. Even though Thalien had his people working the media after the disaster, he was later killed by Chantique for his incompetence."}, {"tag": "h2", "text": "Appearances"}]}