{"url": "Sneak_attack_on_Saponza%27s_homestead", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of Tatooine"], "nodes": [{"tag": "h1", "text": "Sneak attack on Saponza's homestead"}, {"tag": "p", "text": "A group of mercenaries attempted to carry out a sneak attack on the homestead occupied by the mercenary Saponza and his partner's gang. The gang were informed by their allies of the attack before it commenced, and so were able to defeat the attackers."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A gang of mercenaries led by the Human Saponza and his partner chose to side with the Alliance to Restore the Republic in the Galactic Civil War after the Battle of Yavin. A local faction of mercenaries opposed the presence of the rebellion on the planet Tatooine, where Saponza and his partner were based. Shortly after the gang completed a mission to combat a spike in womp rat attacks on locals, their Jennica Pierce contacted them to warn them that the mercenaries were planning a sneak attack on Saponza's homestead."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "Immediately after receiving the warning, Saponza and his partner's forces were attacked by blaster-wielding mercenaries. The homestead's defenses successfully killed seven attackers, although others managed to escape."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the attack, Saponza and his partner prepared for a counterattack by upgrading their troop transport facilities so that they could gather a larger army. While the gang built up their troops, their allies sent scouts to find the attacking mercenaries bases. Once they discovered the locations, Saponza and his forces counterattacked and destroyed the smaller of the two bases first and moved on to destroy the other."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The attack first appeared as a mission in Star Wars: Commander, a mobile strategy game released by Disney Interactive in 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}