{"url": "Snoke", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:We're Doomed!", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Dark side adepts", "Category:Humanoids", "Category:Males", "Category:Supreme Leaders of the First Order", "Category:Torturers and interrogators"], "nodes": [{"tag": "h1", "text": "Snoke"}, {"tag": "p", "text": "Snoke was a Force-sensitive humanoid strandcast male who ruled the First Order as Supreme Leader during the New Republic Era. Possibly unaware of his true nature, Snoke was an artificial genetic construct created on the planet Exegol by the resurrected Dark Lord of the Sith and former Galactic Emperor Darth Sidious. Though he was designed to be a proxy that the Sith Lord could manipulate, Snoke possessed an independent mind and a deep connection to the dark side of the Force, yet he himself was not a Sith. In time, Snoke became a master of the Force and seeker of ancient lore, steeping himself in the vast knowledge of the dark side."}, {"tag": "p", "text": "With his powerful abilities and immense foresight, Snoke eventually gained control of the First Order, a hermit state in the Unknown Regions that began as a remnant of the Galactic Empire. Despite holding absolute power as Supreme Leader, Snoke allowed General Armitage Hux to lead the First Order military in his name, preferring to concentrate on spiritual matters of the Force. With the turning of Padawan Ben Solo—grandson of the Chosen One Anakin Skywalker—to the dark side, Snoke gained the heir to the powerful Skywalker bloodline as his student. Solo than adopted the persona of Kylo Ren after renouncing and destroying the Jedi Order, becoming Snoke's most gifted apprentice."}, {"tag": "p", "text": "During the last days of the Cold War, Snoke directed his apprentice to hunt and destroy Jedi Master Luke Skywalker, Ren's uncle and former master, determined to complete the Great Jedi Purge with Skywalker's death as the last Jedi. Additionally, Snoke authorized a preemptive strike against the New Republic that resulted in the destruction of the Galactic Senate and the outbreak of the First Order/Resistance War in 34 ABY. While pursuing his objectives to destroy both the Resistance and Skywalker, Snoke was assassinated by Ren, who sought to rule all the galaxy as the new Supreme Leader. In the end, Snoke fulfilled his purpose of creation by serving as the last catalyst in Ren's training, thereby allowing Sidious to sidestep the Sith tradition that required an apprentice to kill the master to ascend to power."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "Snoke was an artificially created strandcast genetically engineered on the hidden Sith planet of Exegol by the Dark Lord of the Sith Darth Sidious and the Sith Eternal, a cult of Sith loyalists that served the Sith Lord, sometime after his first demise at the Battle of Endor in 4 ABY.[source?]"}, {"tag": "p", "text": "Prior to his death, Sidious' genetic experiments had already resulted in the creation of several specimens, including potential replacements for his Sith apprentice Darth Vader. They existed in a state of pain and were stored within vats in the Sith Citadel. Several genetic constructs who resembled Snoke had already been created, one of which groaned from inside its vat at Vader when he visited Exegol and discovered his Sith Master's creations. Although Vader destroyed all who were deployed against him, the Emperor proclaimed that he could create anything."}, {"tag": "p", "text": "In addition to the strandcast who adopted the identity of Snoke, there were three genetic copies of him—Snoke's clone \"brothers\"—that the cultists kept in a laboratory within the Sith Citadel, resting in vats of nutrient fluid with technological umbilicals pumping medicinal liquid within their frail bodies. Darth Sidious planned to have Snoke installed as his proxy for the First Order while he recovered. In such a capacity, Snoke would serve as a puppet, and oblivious pawn, of the former Galactic Emperor as a part of his plan to regain power, take revenge on the Skywalker family, and halt the restoration of the Jedi Order. Despite his origins, Snoke was not a Sith. Nevertheless, the dark side of the Force was powerful within Snoke."}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Installed into the galaxy by his creator, the humanoid adopted an identity of \"Snoke\" as the name of his truest self in the dark side. Developing into master of the Force and seeker of ancient lore, Snoke would gain hardened experience with the dark side of the Force and vast knowledge of its steep teachings. He rediscovered much of the galaxy's lost and forgotten secrets about the Force in the Unknown Regions, and he learned about the concept of a Force dyad through an ancient prophecy that featured prominently in the lore of the Sith Eternal. Snoke also became familiar with the Knights of Ren; likewise, their leader \"Ren\" was familiar with Snoke. Snoke possessed memories of a period when he was young and the galaxy was \"different.\" At that time, he realized a lesson that he came to regard as a truth about the Force: that Force visions were a dangerous endeavor to perceive, for the future was always in motion."}, {"tag": "p", "text": "Although he was created after the Battle of Endor, Snoke believed that he had lived during the rise and fall of the Galactic Empire. In his past, Snoke experienced a severe injury that split his head, and some other \"perpetual torment\" that slightly melted half his face and neck. Prior to his rise to power, Snoke even defeated and killed legions of many adversaries who underestimated him. At some point, Snoke journeyed to the planet Mustafar, where he acquired a black obsidian stone from the catacombs beneath Darth Vader's castle, Fortress Vader, and affixed it to an obscure golden ring engraved with glyphs of the Dwartii."}, {"tag": "p", "text": "Snoke for years searched for a worthy apprentice before becoming invested into the Skywalker bloodline, believing himself a sculptor trying to forge a masterpiece needing someone with promising origins as something strong to work with. He trained at least one individual. However, the student was not Snoke's most gifted. Eventually, Snoke took up residence on the High Republic Era location known as Amaxine station, and became familiar with its history. Snoke also kept his other knowledge and uncovered shards of archaic lore housed in several other established bases scattered across the galaxy."}, {"tag": "h3", "text": "Taming of the Unknown"}, {"tag": "p", "text": "Between the years of 5 and 15 ABY, many former Imperial officers, nobles, technologists, and warlords fled to the galaxy's Unknown Regions as part of a mass exodus facilitated by a secret contingency plan designed by the Emperor during the rise of the New Republic. Most of the former Imperial officers would have likely perished while crossing this uncharted realm if it had not been for the ancient hyperspace trails blazed by the Attendants, a group of mute alien navigators who served Snoke, along with some knowledge of the Unknown Regions provided by the Chiss Grand Admiral Thrawn, which helped the former Imperials settle there and reorganize themselves into the First Order. Eventually, they were met with secret reinforcements, and in time gave way for the rise of a new leader. Seen as the architect of the First Order, Snoke was instrumental in organising and saving the First Order from destruction."}, {"tag": "h3", "text": "Rise of a new leader"}, {"tag": "p", "text": "Snoke eventually achieved the status of the Supreme Leader over the First Order. The last of the old Imperial leadership, including Grand Admiral Rae Sloane, the political lunatic Ormes Apolin, and even General Brendol Hux did did not suspect Snoke's ascension and were quite surprised when it occurred. This came to be when Snoke had sidelined, co-opted, or killed off many of the formers, while others like Armitage Hux, Brendol's son, were spared by him in order to use as a tool in his rise to power. Some like Enric Pryde gave way for Snoke, because, though the Supreme Leader's abilities were alien to him, he knew not to question the religious beliefs behind them for he knew they held great power. In his own opinion, Snoke saw himself as an unlikely fulcrum to have been chosen to lead the faction, and knew that history would see him taking over as his master plan, rather than what he believed was improvisational on his part and not his endgame."}, {"tag": "p", "text": "Upon his rise to power, Snoke gave no indication to his origins, and to his subordinates' surprise, he made no design towards the old title of Emperor held by Darth Sidious under the Empire. Nevertheless, he possessed the knowledge and force ability that made him the undisputed heir to the fallen Emperor's crafted contingency, which single handedly saved the First Order from destruction. However, despite holding absolute power as Supreme Leader, Snoke mostly ceded control of the military to his generals and reputation of the First Order to propaganda maniacs, as he was more content to focus on spiritual matters. Though most in the First Order were oblivious to their new leader's origins, some like General Pryde suspected Snoke himself was subservient to a higher power, even though Snoke himself was possibly unaware of his true origins and purpose."}, {"tag": "p", "text": "As Supreme Leader, Snoke initiated a vast rearmament program, resulting in the creation of the First Order military as a technologically superior version of the Imperial Military that served the Galactic Empire. Keenly aware that it lacked the superior numbers and support of the former Empire, the First Order covertly undermined the New Republic instead of relying on military force. Ultimately, it was Snoke's desire to see the First Order reclaim the galaxy that the Empire lost in its war with the Alliance to Restore the Republic. The Supreme Leader would then build on that rebuilt foundation, taking the First Order beyond what the Empire achieved in its time. Until that goal was achieved, however, the Supreme Leader wanted to keep the First Order's capital mobile. He therefore chose to rule from his throne room in the Supremacy, the first in a line of gargantuan warships known as the Mega-class Star Dreadnought."}, {"tag": "p", "text": "Being an ambitious ruler, Snoke was not content to rule a handful of sectors claimed by the First Order in the Outer Rim Territories, nor was he satisfied by colonizing clusters of worlds beyond the frontier. In his view, ambitions limited in scope would have made the First Order no different than the various nonaligned states that emerged in the wake of the Empire's collapse, or the hermetic kingdoms in the Unknown Regions that had been dismantled or destroyed by the First Order."}, {"tag": "h3", "text": "The Skywalker family"}, {"tag": "h4", "text": "The last Jedi"}, {"tag": "p", "text": "At some point, Snoke had an encounter with Luke Skywalker, and was damaged by him to some degree. In addition, Snoke had been indirectly responsible for convincing Skywalker to rebuild the Jedi Order in an attempt to break his resolve. The Supreme Leader deemed the Jedi Master to be a threat to his plans, and was aware of his triumph over the latter's father Darth Vader at the Battle of Endor. Snoke knew that if the Jedi Order existed in the galaxy, then so did hope, and so had to destroy the last vestiges of its teachings to extinguish it permanently."}, {"tag": "p", "text": "He respected Luke Skywalker, for his power and strength as a formidable warrior, yet also feared him. He considered Skywalker to be wise compared to the Jedi of old, because he instead endeavored to learn the ways of the Jedi Order and sought out it's lore, rather than just restoring the religious faction outright. However, he also knew that the Jedi Master was a powerful instrument of the Cosmic Force, therefore deemed it essential to monitor him."}, {"tag": "p", "text": "Soon, Skywalker's plans threatened his designs, and so Snoke released his vast pool of knowledge out into the galaxy to confuse the Jedi Master and his family while ensnaring them, in an attempt to ensure his own triumph over Skywalker, while the latter met his demise."}, {"tag": "h4", "text": "The Skywalker heir"}, {"tag": "p", "text": "Snoke became invested in the Skywalker bloodline, believing that Ben Solo, the son of Han Solo and Princess Leia Organa, had the right balance of the dark side and the light side of the Force within him. As the grandson of the Chosen One Anakin Skywalker and the nephew of Jedi Master Luke Skywalker, Solo inherited the prodigious strength of his family bloodline, making him the ultimate prize to Snoke. The corruption of Solo was instrumental to his plan. Having known of Snoke's interest in her son's potential for power, Organa sought to protect Solo from the mysterious dark side adept. However, she did not inform her husband about Snoke's designs on their son, believing that, as a non-Force-sensitive, Han would not understand Organa's responsibility to shield Ben from the influence of the dark side."}, {"tag": "p", "text": "Organa trusted her twin brother, Luke Skywalker, to keep Ben Solo in the light by training him as a Jedi. Solo began his training at the age of ten, in 15 ABY, and at that time, without invitation, Snoke began visiting Solo in his mind, invading his innermost thoughts, but the young Padawan was eager to have a friend and grew to trust the creature. Snoke frequently whispered to young boy, warning him near the start of his Jedi training that his equal within the Force would one day match his power, and he could only reach his full potential by slaying the being who was his equivalent in the light side. With Snoke's piercing perception Solo's mind, his view of the latter's fears and insecurities allowed him to poison the Jedi apprentice with the dark side."}, {"tag": "p", "text": "In 19 ABY, when Solo and Skywalker were on a mission to Elphrona, Snoke connected with the young boy via telepathy. Sensing Solo's discomfort, Snoke used the opening to undermine his uncle and master and plant a seed of doubt within the young Solo about the Jedi Order. When he met \"Ren,\" the leader of the Knights of Ren, he saw a possible path that was different from the Jedi ways, allowing darkness to grow instead of being repressed. After the mission, Solo remained with Skywalker, but he still had many dark tendencies and believed Snoke possessed the knowledge that could help him understand the dark side and to start a new life if he chose."}, {"tag": "p", "text": "In 28 ABY, Leia Organa's political enemies revealed to the Galactic Senate the truth behind her and Luke Skywalker's heritage as the children of Darth Vader. Solo had yet to find out this for himself, and learned in such a public way rather than being told by his mother. Ben Solo was enraged by the revelation and felt betrayed by his family, which Snoke used to cap off his years of manipulations to turn the young man into a tool for the dark side. With Snoke's guidance and Solo's natural power in the Force, he would become even greater than his grandfather, Snoke promised him. This led Solo to believe he would not have to compete with the heroes of old anymore, and instead eclipse them. However, Snoke intentionally omitted that the Sith gained their power through great sacrifice."}, {"tag": "p", "text": "Soon, despite his nephew's promising future, Skywalker felt the darkness rising within Solo and believed that Snoke had already succeeded in corrupting his pupil. In a moment of pure instinct, Skywalker drew his lightsaber and prepared to strike the young Solo, but he quickly came to his senses—though not quick enough, as his nephew had woken up to his uncle standing over him with his lightsaber out. Solo struck back against his master, believing that his own uncle had intended to murder him."}, {"tag": "h4", "text": "The road to darkness"}, {"tag": "p", "text": "After destroying his uncle's Jedi temple, Solo journeyed to Amaxine station, where Snoke had been waiting for him. There, Snoke comforted the young Solo before proceeding to discuss the events that transpired between Solo and his uncle, knowing that Skywalker was still alive as it would take much more to kill him. Snoke was correct in assuming Skywalker's survival, for Skywalker had exiled himself to Ahch-To, and his nascent Jedi Order had been destroyed, though Snoke, like the rest of the galaxy, was unaware of Skywalker's location. Organa believed Snoke was to blame for Solo's fall to the dark side, but her brother felt personally responsible as a result of what transpired between master and apprentice."}, {"tag": "p", "text": "Snoke discussed his fondness of the space station they were on and how the people who built it tried to hold back the darkness by creating an oasis of life in the great shadow but failed to hold back the nature of what was there. He also listened as Solo expressed his frustrations with being his family legacy and being born to legends and how it was all lies and fake. In this conversation a droid alerted him to a message from General Brendol Hux, but Snoke ordered the droid to have him wait. From there, Solo expressed interest in joining the Knights of Ren, whom he had previously encountered, and Snoke encouraged Solo to do so in order to realize his truest self. Prior to Solo's departure, Snoke warned him he must impress the Knights to join their ranks or he would die."}, {"tag": "p", "text": "Snoke contacted the leader of the Knights, Ren, and expressed his belief that Solo was something special, \"vouching\" for him. He eventually sensed Solo taking his steps into the dark side when he dueled the Ren and felt pleasure in this. Solo killed Ren, and the Knights bowed to him as their new leader. Solo eventually swore his loyalty to Snoke and became his apprentice; the former Ben Solo renamed himself \"Kylo Ren,\" master of the Knights of Ren and warlord of the First Order."}, {"tag": "h3", "text": "Master of Kylo Ren"}, {"tag": "h4", "text": "A promising student"}, {"tag": "p", "text": "Now Kylo Ren's new master, Snoke gifted him a place of power within the First Order as one of his top enforcers, in a position similar to the latter's maternal grandfather under Sidious during the Imperial Era. Having passed his grueling trial, Snoke also gave his apprentice with his blessing to inherit the command of the Knights of Ren from his predecessor, gifting them to him out of a promise for powerful followers if he proved worthy, and allowed him to utilize them for his own use. To this end, Snoke would utilize his student and the Knights as a tool for the dark side within the First Order."}, {"tag": "p", "text": "The Supreme Leader found Ren to be his most promising student, and the Knight grew to become his most gifted acolyte. Snoke saw potential in his apprentice to become a new Darth Vader, sensing his ability for limitless power, a result of the strength inherent in Ren's bloodline. As a teacher, Snoke's methods were similar to those of many renowned Jedi and Sith masters of old, administering a series of tests to Ren to hone his abilities, but also ensure he obeyed him without question. Snoke instructed Ren to pursue his impulses as a shortcut for power within the dark side of the Force, and promised him a future where he would be \"heir of the Force\" and with no Jedi to challenge him. He would goad his disciple's conflicted soul to push the darkness within him to purge the light from his heart indefinitely, even decreeing that the former's true name was forbidden to ever be spoken, while making him believe that a chance for redemption was impossible, telling him his family would never take him back after all he had done, and that they cared more about themselves and the New Republic than him."}, {"tag": "p", "text": "Snoke encouraged his apprentice to use the teachings of both the light and dark side, while he conditioned him to believe the worst of people and that they would always reject him. Under him, Kylo Ren's view of his grandfather Anakin Skywalker as Darth Vader was warped, as Snoke twisted his student's understanding of his history, passing down his belief that the Dark Lord's sentiment and failure to kill his son Luke Skywalker as the true reason the Galactic Empire fell. To stoke jealousy in Ren, Snoke often pitted him against Armitage Hux, who got many victories, and hated Ren, to fuel his negative emotions. As Ren grew stronger, Snoke knew that his equal in the light side would rise to challenge him, and believed it was Luke Skywalker, so he trained Ren to be the one to kill Skywalker and end hope within the galaxy."}, {"tag": "h4", "text": "Pawn of the Sith"}, {"tag": "p", "text": "Unknown to all, both Snoke and Solo were being manipulated from afar without their knowledge. Snoke had been a pawn imposed with a singular focus, unwittingly controlled by a more powerful master of the dark side. Snoke's creator, Darth Sidious, had been utilizing him as a puppet to target Luke Skywalker and engineer the destruction of his fledgling Jedi Order, by ensnaring Ben Solo and luring him to the dark side of the Force."}, {"tag": "p", "text": "Sidious believed Snoke taught his apprentice well, fulfilling another purpose for his existence. Sidious' followers, the Sith Eternal, had designed Snoke's role to be the one to groom Kylo Ren, ultimately testing his capacity to inherit his grandfather's and legacy of the Sith, molding him into master of not only attack, but also cunning; an heir worthy of the Sith. Though he considered himself to be Ren's true master, Sidious had ultimately planned to utilize his genetic proxy to sidestep the Rule of Two tradition of a dark apprentice slaying their master to ascend to ultimate power."}, {"tag": "h4", "text": "Dark side teachings"}, {"tag": "p", "text": "At some point prior to the attack on Tuanul, Snoke, along with Ren, traveled to a rocky world in the Rarlech system. As they stood at the edge of a cliff, Snoke asked Ren if he was afraid. Ren replied by saying he was not. Snoke then used the Force to push Ren off the cliff and hold him in the air. Snoke said that he knew Ren was afraid, as he should be, because, Ren wasn't in control. No, he was confused and unsure of his convictions. He felt powerless. Snoke proceeded to say that feeling that way was good. Powerless men often turned to anger and lash out blindly, with rage. But powerful beings can harness their rage and use it to strike. For either, they strike or they fall. Snoke then let go of Ren and let him fall, advising him to use his fear, turn it into anger, and turn his anger into power. Ren followed that advice and was able to hold himself up and survive the fall. He then inquired whether Snoke would have caught him if he wasn't able to catch himself. The Supreme Leader replied by saying that Skywalker would have and in doing so, held Ren back. Snoke needed Ren to find his true power and potential if Ren wanted to rule alongside him."}, {"tag": "h4", "text": "Trial on Dagobah"}, {"tag": "p", "text": "After the training in the Rarlech system, Ren and Snoke traveled to Dagobah. As they stepped off their shuttle, Ren commented that he sensed Luke Skywalker from his time in Dagobah when training with Yoda. As Snoke spoke of Skywalker's training, Ren asked why he spoke of Skywalker with respect. Snoke said if he had Skywalker by his side instead of Ben, the galaxy would have been his a long time ago. Snoke then made Ren go into the Cave of Evil, where his uncle had gone into so many years before."}, {"tag": "p", "text": "Once inside, Ren experienced a vision of his uncle Luke, saying that he didn't want to fight him. Ren said he didn't care and ignited his lightsaber. Snoke sensed that decision and commended Ren for making it. After a short duel between the two, Ren was able to kill the vision of Luke, by letting the hate festering inside of him out. But the vision had only begun."}, {"tag": "p", "text": "Ren then experienced a vision of his parents, begging him to stop. He recoiled from the vision and rejected being addressed by his birth name. Organa insisted that he was still her son, Ben Solo, whom she and her husband loved. Despite his inner turmoil, Ren activated his lightsaber and acted as if he was striking down his parents, but only striking a tree with his lightsaber, showing that though he hated his uncle Luke, he still loved his parents. Ren then destroyed the cave, impressing his master with a display of raw Force power, although Snoke had also considered bringing other apprentices to the cave which had existed for millennia. Ren simply dismissed the notion that Snoke would ever need another apprentice."}, {"tag": "h3", "text": "Galactic conquest"}, {"tag": "h4", "text": "Cold War"}, {"tag": "p", "text": "In 28 ABY, Snoke gave Enric Pryde command of a Resurgent-class Star Destroyer, which he named the Steadfast in honor of his old vessel."}, {"tag": "p", "text": "In 29 ABY, the senatorial faction known as the Centrists, preferring power, withdrew from the New Republic and joined the First Order with Snoke at its head. This marked the public founding of the First Order. By the time of the Cold War, Snoke's reputation as Supreme Leader preceded him, as he had been rarely seen in the flesh, even by his own subordinates. When the First Order began the cold war against the New Republic, Snoke remained constantly mobile aboard the Supremacy, protected by his Elite Praetorian Guards, and hidden by the brightest stars within the Unknown Regions."}, {"tag": "h4", "text": "Patron of Armitage Hux"}, {"tag": "p", "text": "After a series of events which had seen Hux and Ren temporally stranded on a planet in the wake of an assassination attempt, both Hux and Ren reported back to Snoke on the almost complete Starkiller Base following their rescue by Captain Phasma. Hux declared to Snoke that he had identified the one responsible for the assassination attempt, and then rebuffed Ren's offer to deal with the sabatour, requesting the permission of Snoke to deal with the traitor himself. Snoke permitted this, which pleased Hux, who went to find the traitor. As he left, Ren told Snoke he didn't see Hux's worth in being kept around. Snoke merely stated that he didn't need to. Ren insisted that Hux was not to be trusted, and that he wanted to kill Snoke and take his place. Snoke replied that Hux wanted to kill a lot of people and chose not to take it personally. He instead told Ren that men like Hux were useful, be fueled by spite and after being abused, never forgive."}, {"tag": "p", "text": "When Hux and Phasma went to execute Admiral Brooks, the saboteurs superior, Hux cited Snoke, alongside Ren and his own father, Brendol Hux, as people who underestimated him. Gaining the Supreme Leader's favor meant that Hux effectively wielded greater authority than his rank as a general would indicate; nevertheless, Snoke refused to grant Hux his coveted title of Grand Marshal."}, {"tag": "h4", "text": "The road to war"}, {"tag": "p", "text": "Following Skywalker's disappearance, Snoke assigned Ren to hunt down the last Jedi, knowing that as long as Skywalker lived, the Jedi and thus hope lived. In 34 ABY, Ren's search led him to Jakku, where he learned that the final piece of the map to Skywalker was in the possession of the astromech droid BB-8. Snoke ordered the droid's capture or destruction, preferably the former. Despite the efforts of the First Order, BB-8 managed to escape Jakku aboard the Millennium Falcon."}, {"tag": "p", "text": "Ren and General Hux later returned to Starkiller Base to communicate with Snoke via hologram. Hux proposed using the Starkiller Base superweapon to destroy the New Republic government, which was backing the Resistance, an undertaking which Snoke authorized. He then spoke with Ren privately, asking if he had felt an awakening in the Force. He ordered Ren to kill his father to overcome his temptation by the light."}, {"tag": "p", "text": "Shortly after the destruction of the Hosnian system, resulting in the eradication of the New Republic government and a portion of its fleet, Ren invaded Takodana in search of BB-8. He later deemed the droid unnecessary as he captured a scavenger named Rey, who had seen the final piece of the map to Skywalker's location. Snoke was later upset to hear that the girl resisted Ren's interrogation. Ren defended himself by explaining that Rey was strong in the Force, albeit untrained. As the Resistance base had been discovered, Snoke ordered Hux to destroy the Resistance before they could find Skywalker, and for Ren to bring Rey to him. However, Ren never got the chance, as Rey managed to escape with the help of her new powers."}, {"tag": "p", "text": "Subsequently, Starkiller Base was infiltrated by Han Solo, Chewbacca, and Finn, who managed to lower the shields through the aid of a captured Captain Phasma to allow the Resistance fleet to attack the base. Solo then tried to bring Ren back to the light, only for his own son to murder him. In rage and grief, Chewbacca wounded Ren and blew a hole in the superweapon's thermal oscillator, allowing Resistance pilot Poe Dameron to fly in and destroy it, causing catastrophic damage, preventing the solar energy from being contained. When the destruction of Starkiller Base was inevitable, a frantic Hux reported this to Snoke who was remarkably blase about it, instead, ordering the general to bring Ren to him in order to complete his training."}, {"tag": "p", "text": "In spite of the loss of Starkiller Base, the First Order managed to gain enough victories in the conflict that Snoke decided to risk coming out of the shadows to personally lead the First Order to potential dominance over the Resistance."}, {"tag": "h3", "text": "Death of the Supreme Leader"}, {"tag": "p", "text": "Sometime after the destruction of Starkiller Base, Snoke began directing several maneuvers designed to eliminate any possibility of hope returning to the galaxy. He empowered General Hux to pursue and destroy the Resistance fleet, which initially failed when an assault on their base not only saw the Resistance slip away but the loss of a First Order dreadnought. Snoke immediately contacted Hux to make his anger clear, using the Force to painfully humiliate the general but was delighted when Hux revealed a way to track the fleet's movements through hyperspace, thereby allowing the First Order to immediately pinpoint their location."}, {"tag": "p", "text": "Immediately after his audience with Hux, Snoke turned his attention to his disgraced apprentice, remarking on how he had begun to lose faith in him after his failure at Starkiller Base and his further conflict over having murdered his father, having felt from afar Ren's struggle when he killed him. Snoke's taunts caused Ren to attempt to attack him, causing the Supreme Leader's guards to react aggressively, but Snoke effortlessly brushed aside the attack with a bolt of Force lightning and went back to his throne, reminding Ren that as long as the Jedi persisted in the galaxy, so too did the hope that could defeat them. He then chastised Ren out of the throne room by telling him that he was just a child with a mask rather than the successor of Darth Vader, and that Vader would be ashamed of him."}, {"tag": "p", "text": "But once Ren left the throne room, Snoke smiled to himself. He had used this reprimand to motivate his apprentice. If that was the case, then it worked: Ren destroyed his mask on the turbolift with all the pent-up rage he could muster before preparing for what appeared to be the First Order's final victory."}, {"tag": "p", "text": "Seeking to shift the tides in his favor, Snoke claimed to have used his own powers to link the minds of Rey and Ren through a Force-bond. For doing so, Snoke manipulated Ren's insecurity to his advantage, knowing his apprentice couldn't hide his conflict from Rey, who couldn't pass up the chance to redeem the former Ben Solo. Through the Force, both Rey and Ren could see each other and communicate from separate locations in the galaxy. Believing she could restore Ben Solo to the light, Rey sought Ren out, and was brought to Snoke aboard the Supreme Leader's flagship. Snoke took Rey's weapon, the legendary Skywalker lightsaber, admiring its craftsmanship, and placed it next to him on the arm of his throne. Using his own formidable powers, Snoke restrained Rey and tortuously probed her mind to discover Skywalker's whereabouts."}, {"tag": "p", "text": "After obtaining the knowledge he sought, he contemptuously dropped the girl, only for her to attempt to summon Anakin Skywalker's weapon into her grasp, which he effortlessly redirected to strike her in the head from behind with a sneer. In one instance, after dropping Rey to the floor, Snoke laughed and mused that Skywalker had been \"so wise\" as to hide from him. He decided that once the Resistance was destroyed, he would command his forces to Ahch-To and obliterate the entire Temple Island so Skywalker and the Jedi Order could be given the death he desired. As a final gesture of contempt, he forced Rey to watch the destruction of the Resistance's remaining ships via his oculus viewing scope operated and designed by the Attendants. Rather than breaking Rey's spirit, however, the sight prompted her to summon Kylo's sword to defy him once more, earning the Supreme Leader's respect as he complimented her for her courage."}, {"tag": "p", "text": "Acknowledging Rey now as a genuine threat to both himself and the First Order, Snoke commanded his apprentice to execute her, confident that Ren would not turn despite Rey's faith in his former persona, that of Ben Solo, and boasted that he could read his apprentice's mind and see his every thought and intention. Intending to torture the girl with every detail up to the moment of her death, he shut his eyes and described to Rey everything he saw in Ren's mind, turning the lightsaber to \"strike true\" and igniting it to kill his \"true enemy.\" However, Snoke's visions and Force senses betrayed him. Sensing Ren's connection to the girl, Snoke made a serious error of judgement, failing to sense his apprentice's resolve and hate was directed towards himself. Once he reopened his eyes and awaited the coming strike, his triumphant smile became one of pained surprise as he felt the blade of a lightsaber piercing through his withered and twisted body. At the same time, his telekinetic hold over Rey collapsed. The Supreme Leader looked down to find the Skywalker lightsaber having been turned, aimed, and activated in his direction. There was only one in this room who had the ability and cunning to pull off such a feat through the Force: Ren."}, {"tag": "p", "text": "Snoke tried to say something but couldn't. He remained alive long enough to glare at his former apprentice for his betrayal before Ren summoned the still active lightsaber to Rey's grasp and the blue blade cut through the Supreme Leader's waist and wrists, dismembering him. His upper torso then collapsed heavily to the floor at the base of his throne, leaving his hands on the armrests and his lower torso sitting on the throne."}, {"tag": "p", "text": "Ren killing Snoke to save Rey was an act of ascension worthy of Darth Bane's doctrine. With Snoke dead, Ren proved himself to be a worthy successor of Vader, as he achieved what his grandfather failed to do in the past and when he had the opportunity: overthrow his master in the Sith way, the ancient Rule of Two."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Immediately after his death, Snoke's bodyguards attempted to avenge him, but despite their efforts, the entire Elite Praetorian Guard was destroyed by Ren and Rey. After the Guards had all been killed, Ren stared at his master's body, before offering Rey a place at his side. Rey begged him to help save the fleet and tried to pull her lightsaber back from him. The combined opposite pulls of Rey and Ren destroyed the blade, knocking Ren unconscious when he hit the floor while Rey was able to escape the doomed starship. Hux later entered to find Ren alone on the ground, and the body of the Supreme Leader. The lower half of Snoke's body then slipped off the throne and on to the floor beside the torso, right before Hux's eyes."}, {"tag": "p", "text": "Snoke's death created an immediate power vacuum that Ren took advantage of by assuming his fallen master's role as the new Supreme Leader of the First Order, much to the displeasure of Hux. Although Ren desired to rule the galaxy with Rey as his equal, the aspiring Jedi rejected his offer, leading Ren to falsely implicate her in the assassination of Snoke."}, {"tag": "p", "text": "By the time of the battle of Grail City, some First Order officers, such as Colonel Barrut and her crew, weren't aware of Snoke's death and Ren's rise to power. When Wing Commander Poe Dameron informed them about Snoke's fate before destroying the Fortitude, the Maxima-A class heavy cruiser which they commanded, two of Barrut's crewmen believed that Hux had taken Snoke's role as Supreme Leader, only for Barrut to refuse to believe Dameron's claims, dismissing them as lies."}, {"tag": "p", "text": "During his campaign as Supreme Leader, Kylo Ren started to suffer from Force visions and found scraps of arcane lore uncovered in Snoke's old bases which led him to realize that Snoke was not the apex of the First Order's dark side pyramid. Upon tracking down and finding the revived Darth Sidious on Exegol, Kylo Ren learned that Sidious was not only responsible for impersonating Darth Vader's spirit but for the creation of Snoke as well as he observed several copies of Snoke being grown in vats while Sidious explained that he had been pulling the strings the whole time. Ren soon learned that Snoke had been a mere puppet, created and controlled by Sidious, a more powerful master of the dark side."}, {"tag": "p", "text": "The purpose of Snoke's entire existence was to serve as Ren's final test. His role had been designed by the Sith Eternal cultists to groom Ren as heir to the Sith legacy, and to mold him into a master of attack and cunning. Despite multiple bodies of him being stored on Exegol, Snoke had fulfilled his role and purpose and therefore Sidious had no further use for him. The creation of Snoke allowed Sidious to sidestep the tradition in dark side training where an apprentice killed the master; and while Sidious credited Snoke for training Ren well, he considered himself to be Ren's true master."}, {"tag": "p", "text": "Snoke's teachings and conditioning stuck with Kylo Ren, up to his redemption as Ben Solo and death, having a deep impact on his mindset and spirit. He recalled Snoke's teachings when he pursued Rey, recalling how he was instructed to pursue his impulses when chasing his desires, and additionally, the vestiges of Snoke's teachings held a strong influence on his former apprentice, as he remained committed to the dark side one year after his predecessor's death, and as Solo was later redeemed by his father's memory and mother's sacrifice, he realized that Snoke had deceived him about his chances for redemption, eventually still making him believe that Rey would reject him in the minutes before his death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A genetic creation of Emperor Palpatine, Snoke possessed free will, but his goals were still orchestrated for him and he was unaware he was secretly manipulated by the Emperor from afar, such as a singular focus imposed upon him by his creator. Additionally, Snoke possibly didn't know of his true origins, as he believed he lived through and witnessed the Galactic Empire's rise and fall, even though he had been created after the Battle of Endor, and possessed memories of a a forgotten period when the galaxy was different in terms regarding the Force."}, {"tag": "p", "text": "In terms of spiritual matters, Snoke adhered to the dark side and viewed the light as the weak and pathetic side of the Force. Additionally, Snoke denied any connection to the Sith lineage, but he still followed ancient Sith traditions when he chose Kylo Ren as his student."}, {"tag": "p", "text": "He was a secretive, enigmatic figure who coveted arcane lore. Rather than establish a permanent base of operations, he preferred governing the First Order in a mobile command post from where he could contact his subordinates, though his exact location was unknown. He was known for his unwillingness to meet in person with his underlings and often communicated solely through his holographic project transmitted from his throne aboard the Supremacy, only interacting personally with specific targets. He was both wise and cunning, having risen to power by undermining the First Order's leading officials through guile. A master at manipulation, he lured Kylo Ren to the dark side of the Force by using the young Jedi's desperate need for a teacher to his advantage. Although he regarded Armitage Hux as a \"rabid cur,\" Snoke recognized the general's usefulness and believed that even a person's weakness could serve a purpose if properly manipulated. Despite holding a low opinion of Hux's character, the Supreme Leader shared his underling's belief in the necessity of a powerful military force. In addition to overseeing a militarization program that violated treaties signed with the New Republic, Snoke often sanctioned Hux's military strategies and showed approval for his technological innovations."}, {"tag": "p", "text": "Snoke was fascinated with Ren, not only for his apprentice's inherent potential for limitless power but also because he regarded him as the embodiment of the dark side and the light, and encouraged Ren to use the teachings of both. It was Ren's raw, untamed strength in the Force that led Snoke to believe his student could achieve a level of power comparable to that of Ren's late grandfather, the Sith Lord Darth Vader. As such, Snoke believed that he had never had a student that showed more promise before Ren."}, {"tag": "p", "text": "Disappointed by Ren's defeat on Starkiller Base, the Supreme Leader berated him as a failed apprentice—a child in a mask—who was unworthy of Vader's legacy. In light of Ren's failure, Snoke began to doubt whether his disciple would ever overcome his conflict between the two sides of the Force. As such, he also began to consider the possibility of casting Ren aside for good, just as Han Solo warned his son moments before his death. Nevertheless, Snoke used his skills at manipulation to stoke Ren's conflicted soul, knowing that his apprentice would fail to hide his emotions from Rey after they became linked to each other through their Force-bond. It was through Ren that Snoke sought to manipulate Rey, convinced she would fall into his trap by believing that Ren could be turned from his dark path."}, {"tag": "p", "text": "Like his apprentice, whose mask provided him with a more imposing presence, Snoke relied on theatrics when interacting with his subordinates via holographic transmission. Although the Supreme Leader was around seven feet tall, his holographic form magnified his height several times over, allowing him to \"look down\" upon his followers. While he initially tolerated his apprentice's desire to emulate Vader by wearing a mask, Snoke thought it was absurd and later ridiculed Ren's affectation."}, {"tag": "p", "text": "Snoke's intelligent, sophisticated, and at times calm demeanor masked his more sinister qualities such as cruelty, arrogance, egotism, and narcissism. He was a terrifying, monstrous individual who possessed a dark nature that rivaled even that of the late Darth Sidious. Snoke's demeanor shifted from calmness to anger, depending on the situation. Upon learning of Starkiller's impending destruction, he simply told Hux to evacuate the base with Ren, only to later scold and physically reprimand his apprentice out of frustration. When presented with the chance to use the Starkiller superweapon against the New Republic, Snoke agreed with Hux's plan to lure the First Order's enemies out of hiding despite ending billions of lives in the process."}, {"tag": "p", "text": "Snoke was aware of the inner workings of the Knights and Ren and of their philosophy, and considered them doing as they pleased with the dark side of the Force granted them fluidity, as opposed to what he believed to be the Jedi Order's rigid code that limited them."}, {"tag": "p", "text": "Additionally, Snoke was a cruel master as well as a predator, who identified weakness and exploited it, as demonstrated by how Snoke dominated not just the First Order but specifically Ren and Hux, making him a brutal tyrant. He particularly enjoyed using his powers to penetrate the minds of his victims and subject them to agonizing scenes, picking apart their courage and resolve slowly over time."}, {"tag": "p", "text": "As powerful, cunning, and cruel as he was, Snoke was no different from other masters of the dark side in that he still felt fear, specifically a fear of Luke Skywalker and the return of the Jedi. He was convinced that if Skywalker, the last living Jedi at the time, ever returned from exile, he would herald the rise of a new generation of Jedi Knights. Despite his hatred for the Jedi, Snoke actually respected Skywalker while also fearing him, knowing that the legendary Jedi Master wasn't weak but misguided, even musing that had he taken Skywalker as his second-in-command instead of Ren, the galaxy would have been already his by the time of the Cold War. He regarded the Jedi Order as a threat to his designs and, therefore, plotted to destroy it entirely by killing the last Jedi. Upon meeting Skywalker's final apprentice, the Jakku scavenger Rey, Snoke remarked that she possessed the qualities of a true Jedi and, as such, was resolved to see her die before she could also become a threat to his plans. As noted by Rey, however, Snoke was prone to underestimating those around him, such as his own apprentice. He exulted when sensing Ren's newfound resolve, completely unaware that the dark warrior intended to save Rey by striking down his own master through subterfuge. Indeed, very much like his creator before him, Snoke failed to understand that Force visions are not absolute; he saw the truth, just not what he expected."}, {"tag": "p", "text": "Snoke was an artificially constructed humanoid genetic strand-cast, created by the science of bioengineering and genetic tampering. As a result of the crude experimentation which yielded his existence, Snoke's appearance was frail, with large hands and a mutilated appearance.[source?] He had a distinctive, idiosyncratic bone and facial structure. His hologram used on the Starkiller Base projected him several times larger (around twenty-five feet) than his natural appearance, towering over Kylo Ren and General Hux. Snoke had an elongated face with pale, heavily scarred skin, and pale blue eyes. Even in person, however, he was still exceptionally large, standing over seven foot two inches tall. Nevertheless, Snoke didn't need size to impose his will given that the mere sight of his appearance could terrify. He sported a large scar from the top of his head, all the way down to his brow. Snoke also had what appeared to be a scar or burn on his right cheek that caused his mouth to be contorted. Snoke's left zygoma was malformed. His twisted build and extensive scarring indeed confounded attempts to identify his species. He wore ornate golden khalat robes with a gray underdress, tied at the waist by an elegant golden belt, and on his finger he wore a ring of gold and obsidian engraved with runes from the Dwartii. The black obsidian stone was excavated from the catacombs and mines beneath Fortress Vader on the planet Mustafar. Because of his physical frailties, which left him past his prime in terms of physical strength, he relied on material comforts such as slippers to deal with his ailing body which was in a constant state of pain due to his advanced age and wounds, and he could not defend himself in a physical fight, instead relying on his Elite Praetorian Guards to deal with any threats to him."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Although Snoke was not trained as a Sith, he was Force-sensitive and highly attuned to the dark side, with Force powers equally as impressive and terrifying. While his abilities were not explicitly Sith in origin, like that of his creator, Darth Sidious, Snoke possessed the knowledge and power to rule the First Order. However, he was not as powerful as the Emperor. Despite this, Snoke still learned about the lost truths of the Force waiting within the Unknown Regions and made them serve his will. His teachings blended traditions of both the light and the dark side."}, {"tag": "p", "text": "His mastery of the Force was so great that Snoke was capable of exerting his power with the barest minimum of gestures to devastating effect even from great distances. His abilities included telepathy, Force choke, and telekinesis, which he was able to use on other beings even across great distances. Though having developed a great mastery over telepathy, Snoke's ability to communicate with an individual through the Force over great distances was not as strong compared to that of his creator. Like his apprentice, Snoke possessed the power of mind probe and his skills were far greater, easily successfully employing it on both Rey and Ren prior to his demise. As a master in the ways of the dark side, Snoke could conjure Force lightning from his fingertips—a power he perfected to the point where he could fire it down at a metal surface and let it ricochet right into the intended target. The effects of his lightning-based attacks were immensely painful, as noted by Ren, who backed down in deference to Snoke's superior knowledge of the dark side. While his physical strength atrophied along with his wounded body, Snoke remained tremendously strong in the Force until his death."}, {"tag": "p", "text": "Although both Rey and Ren possessed a raw connection to the Force, Snoke's abilities eclipsed their powers due to the greater knowledge and experience at the Supreme Leader's disposal. In addition to subduing Ren with a single attack, Snoke toyed with Rey by telekinetically tossing her across his throne room. He could even overpower her when both were using the Force at the same time, as he demonstrated by overriding her control of the Skywalker lightsaber, causing it to avoid Rey's grasp before turning around and smacking her in the back of the head. Despite his frail appearance, Snoke was strong enough to slap Ren in the face hard enough to draw blood, out of anger for ignoring his orders to leave his mask aboard their ship."}, {"tag": "p", "text": "Suspecting Rey and Ren shared a unique Force-bond, Snoke manipulated their connection in order to lure Rey to him. The two were able to see and hear each other despite the millions of light-years that separated them. As their bond deepened, they could even make physical contact with one another. Snoke used his powers to influence their Force connection, leading Rey into a trap. Through it all, both remained oblivious to Snoke's third-party influence until he outright revealed his manipulation of their connection. In the end, however, Snoke's visions and Force senses failed him. While exulting at the resolve he sensed in his often conflicted apprentice, he did not sense his own impending death by the son of Han Solo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Creation and development"}, {"tag": "p", "text": "Snoke was portrayed by Andy Serkis via motion capture in the films Star Wars: Episode VII The Force Awakens and Star Wars: Episode VIII The Last Jedi, the first two instalments of the Star Wars sequel trilogy, released in 2015 and 2017 respectively. His name was officially unveiled on May 28, 2015, and his voice was first heard in the initial teaser trailer for The Force Awakens. According to Serkis, Snoke's mannerisms, in particular his gold bathrobe in The Last Jedi, was derived in part from attire worn by Hugh Hefner, the late founder of the Playboy adult magazine."}, {"tag": "p", "text": "From the beginning of the production, the character who would ultimately fill the role as main antagonist of the film was nicknamed \"Uber\" though any specific ideas were clearly defined by that point. Snoke's appearance underwent many changes throughout the development of The Force Awakens, with the character's final appearance not being decided on until October 2015, two months before the film's release. J.J. Abrams and Neal Scanlan didn't want the character to look old and decrepit like Darth Sidious, and even considered making him female. Ivan Manzella sculpted at least two busts to try to hone the look of the character. Snoke's final appearance was based in part of the horror movies of Hammer Films, the concept being that Snoke was handsome in his younger days but was consumed and twisted by the dark side as he became more powerful. Manzella's concepts for Snoke were specifically inspired by the Hammer Films star Peter Cushing, who portrayed Grand Moff Wilhuff Tarkin in the 1977 film Star Wars: Episode IV A New Hope. He also designed Snoke as having a breathing tube coming out of his nose that kept him alive. Snoke's physical appearance in The Last Jedi was first shown in a leaked image of an upcoming LEGO set, and was later officially revealed with the teaser image of the Star Wars Force Link BB-8 2-in-1 Mega Playset that was unveiled at Force Friday 2017. Andy Serkis wore artificial facial hair for this film."}, {"tag": "p", "text": "In November 2015, Serkis stated in an interview with Entertainment Weekly that while Snoke was a newly-created character, he was \"aware of the past to a great degree.\""}, {"tag": "p", "text": "In another interview with Entertainment Weekly in November 2017, Andy Serkis said that Snoke's injuries were inspired by injuries sustained by soldiers in the trenches of World War I. In addition, in an interview with Empire magazine, Serkis claimed that the disfigurements Snoke possessed were caused in part by osteoporosis that was severe enough that he appeared \"as twisted as a corkscrew,\" and that this was part of what made Snoke in his opinion \"darker than Palpatine.\" Serkis has gone on to say that Snoke's malevolence comes out in reaction to the injuries that he has suffered which he blames on the Resistance, fuelling his hatred for them. Serkis explained that Snoke's desire for power is motivated by greed, bitterness, and fear.[source?]"}, {"tag": "p", "text": "The Last Jedi director Rian Johnson said he killed off Snoke to give Kylo Ren a compelling set-up for the 2019 sequel Star Wars: Episode IX The Rise of Skywalker. When asked if he had planned to elaborate on Snoke's back-story in Episode VIII, Johnson replied, \"It would have stopped any of these scenes dead cold if he had stopped and given a 30-second speech about how he's Darth Plagueis. It doesn't matter to Rey. If he had done that, Rey would have blinked and said, 'Who?' And the scene would have gone on. [pause] And I'm not saying he's Darth Plagueis!\""}, {"tag": "h3", "text": "Identity theories"}, {"tag": "p", "text": "Upon the release of The Force Awakens, multiple fan theories about Snoke's identity emerged online. The most famous was, however, was that he was Darth Plagueis, Darth Sidious' Sith Master, who was mentioned anecdotally in the 2005 film Star Wars: Episode III Revenge of the Sith. Plagueis possessed the power to prevent death. Another popular fan theory was that Snoke was Star Wars Rebels protagonist Ezra Bridger. Lucasfilm Story Group's Pablo Hidalgo dismissed the Darth Plagueis theory in May 2016. The Force Awakens sculptor Ivan Manzella noted that it were amusing theories about Snoke being Grand Moff Tarkin that inspired him to design Snoke after Peter Cushing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}