{"url": "Snow_King", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Ewok deities", "Category:Individuals of unspecified species", "Category:Kings"], "nodes": [{"tag": "h1", "text": "Snow King"}, {"tag": "p", "text": "The Snow King was a powerful being who ruled the winter season of the forest moon of Endor. He could only bring about winter with the season scepter. He was the brother of the Leaf Queen, the Sun King, and the Flower Queen. In 3 ABY, he was seduced by Odra, Duchess of Sleet, and engaged in an affair with her. During this time, she froze his heart, turning him into a merciless dictator."}, {"tag": "p", "text": "Taking power, he had his Iceheads confiscate the season scepter from the Sun King, and then used the scepter to cast an eternal winter over Endor. Only the efforts of the Ewok Wicket Wystri Warrick and his allies, who were working for a coalition of the other Endor season gods, were able to stop Odra and the Snow King, and in an altercation at the Snow Palace, the King's heart was thawed. Seeing the wrong he had done, the Snow King reversed his evil, and any damage he had caused was repaired."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rise to power"}, {"tag": "p", "text": "Along with his siblings—the Leaf Queen, Sun King, and Flower Queen—the Snow King was a being of local importance on the forest moon of Endor, who came across a powerful Force-imbued artifact, the season scepter. The scepter, a powerful device, granted the user power over a particular season of the weather. Prior to or during the Imperial era, the Snow King became the ruler of the season of winter. His siblings gained power over autumn, spring, and summer at the same time. A system was set up where the four siblings would rotate their seasons on a regulated basis. The Snow King took up residence in the Snow Palace, a massive structure, almost impervious to attackers. From there, the Snow King would host his season. It also housed the Iceheads, beings who were loyal to him. With the use of the Sun King's season scepter, the Snow King could bring about winter at any time he deemed worthy."}, {"tag": "h3", "text": "An affair to remember"}, {"tag": "p", "text": "In 3 ABY, the Snow King met Duchess Odra of Sleet. Against the wishes of his siblings, he fell in love with her, and entered into an affair. During their tempestuous romance, the Duchess literally froze the Snow King's heart. He was not killed, however; rather, it turned him into a cold, hard dictator. His appearance also changed to reveal what Odra had done; he became a hard-edged ice-like being, as opposed to his original snow-like state. In his frozen state, the Snow King was easily manipulated and Odra used the situation to her advantage.. Practically appointing herself head of the Iceheads, Odra launched a raid on the Sun King's palace."}, {"tag": "p", "text": "The raid was successful—the Iceheads had stolen the season scepter right from under the corpulent Sun King. Returning to the Snow Palace, Odra persuaded the King to cast an eternal blanket of snow over a large portion of Endor, most notably, the Ewok-inhabited Bright Tree Village, with the goal of stealing the powerful Sunstar from them. In response, the Snow King's siblings formed a coalition, in order to form a resistance against the winter. They tried to negotiate with the Snow King, but he hardened his heart, and would not speak to them."}, {"tag": "h3", "text": "Fatal attraction"}, {"tag": "p", "text": "The coalition retaliated by contacting Bright Tree Village, and in particular, Ewok shaman Logray. However, their transmission went awry, and was instead received by Wicket Wystri Warrick. Warrick and his companions—Princess Kneesaa a Jari Kintaka of Bright Tree Village, shaman-in-training Teebo, and amateur actress Latara— took it upon themselves to travel to the Sun King's palace, and to the coalition's aid. To prevent this, Odra dispatched the Iceheads to intercept the four Ewoks. Though the raid did not turn out to be a complete success, Kneesaa, was captured, and brought to the Snow Palace. There, the Snow King froze her in a block of ice, so that she could serve as an adequate incentive for the coalition and Bright Tree to surrender to his terms."}, {"tag": "p", "text": "Meanwhile, back at the Sun King's palace, the coalition planned a covert operation, in which Warrick, Teebo, and Latara would infiltrate the Snow Palace, and reclaim the season scepter for the Sun King. Warrick was able to successfully gain entry to the palace by disguising himself and his friends as Iceheads; however, in the throne room, Odra was able to identify them."}, {"tag": "p", "text": "After a failed attempt to take the season scepter by enticing the Snow King with ice-on-a-stick, a confrontation ensued, and Kneesaa was freed with a minimum of fuss. Warrick was able to wrest control of the scepter from the Snow King, and turned it against the tyrant. The scepter, in the hands of Warrick, melted the frozen heart of the King, restoring him to his former, jovial state. The scepter's power also struck Odra, who was forced to retreat. Despite losing his lover, the Snow King remained in a good mood, and asked for clemency for his past crimes, on the grounds of ignorance. The Sun King forgave his brother, and allowed him to retain his position of power."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Before his heart was frozen, the Snow King was well liked by his siblings. When Odra froze his heart, however, he turned into a violent, cruel, and unrelenting tyrant, who would not even stop to consider the repercussions of freezing an Ewok child in ice. His political tact even altered, with him publicly moving against his siblings. When defrosted, the Snow King acted as he had before, and suffered amnesia, not even realizing the extent of his previous atrocities."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Snow King was able to utilize the powerful, Force-imbued season scepter to bring about the season of winter. He was also able to use the scepter as a ranged weapon, and also possessed the ability to bring about his brother's season of summer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Snow King first appeared in Raymond Jafelice's \"The Season Scepter,\" an episode of the Star Wars: Ewoks television series. He was created by Bob Carrau."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}