{"url": "Barel_Ovair", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Humans", "Category:Jedi Masters of the Jedi Order", "Category:Lore Keepers", "Category:Males", "Category:Sith of the resurgent Sith Empire", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Barel Ovair"}, {"tag": "p", "text": "Barel Ovair was a prestigious Human male Jedi Master and scholar of the Old Republic. He was the scion of a respected line of Jedi Knights who were all secretly spies working for the Emperor of the reconstituted Sith Empire. Ovair took Eison Gynt, a highly skilled Nautolan Padawan and a fourth-generation Jedi, as his apprentice, but abandoned him during a mission to the tomb of the Sith Lord Naga Sadow on Yavin 4. When Ovair returned to Coruscant alone weeks afterward, he claimed that Gynt had been killed. However, Gynt resurfaced on Coruscant years later, possessed by Sadow's spirit and determined to kill Ovair. Ovair defeated Gynt in combat, slaying him, and was lauded as a hero for his triumph. It was not until many years later that the Jedi historian Gnost-Dural connected Ovair and his family line to the Sith Emperor."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Barel Ovair was a Human male Jedi Master from a respected family line of Jedi. Secretly, he and his family were spies working for the Sith Empire in the years prior to the outbreak of the Great Galactic War. In his role as a Jedi Master, Ovair took a talented young Nautolan named Eison Gynt, a fourth-generation Jedi Knight, as his Padawan. As fellow Jedi scholars, Ovair and Gynt traveled the galaxy, studying the Force and taking on increasingly daring tasks for the Jedi Order."}, {"tag": "p", "text": "Their career together culminated with an ambitious mission in 3756 BBY to explore the tomb of the Sith Lord Naga Sadow on Yavin 4. This was ostensibly to rid the temple of dark side energies for the good of the Order, but in truth Ovair was under orders to eliminate any remnant of Sadow's power, which the Sith Emperor viewed as a potential threat to his planned invasion. During the mission, Ovair and Gynt were attacked by Massassi warriors and were forced to go deep within the tomb. Ovair returned to Coruscant weeks later without his Padawan, incoherent and injured. After recovering from his ordeal, Ovair reported to the Galactic Senate that Gynt had been killed during the mission. However, Gynt was in fact still alive and had fallen under the influence of Naga Sadow's spirit."}, {"tag": "p", "text": "Gynt resurfaced on Coruscant several years after the failed mission to Yavin 4, dressed in Massassi warrior robes and possessed by the spirit of Sadow. After finding his former Master, Gynt attacked him in full view of the public eye. While Gynt's borrowed dark side abilities were formidable, the undercover Sith defeated and killed Gynt. Ovair was interviewed by the Jedi High Council after the duel, but his triumph was praised and he came under no suspicion. Indeed, he was hailed as a hero by the Galactic Republic for his actions. Over a century later, Jedi historian Gnost-Dural questioned why the spirit of Sadow would have sought vengeance against Ovair specifically, and made the connection between Ovair and the Sith. He realized that Ovair and his Jedi ancestors were in fact spies working on behalf of the Sith Emperor. The historian deduced that Ovair had used Gynt to draw out Sadow's spirit to eliminate it prior to the invasion of the Republic."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ovair operated simultaneously as a Jedi scholar and as a Sith infiltrator for decades without detection by the Jedi Order and the Galactic Republic. This role was one he inherited from his father and his grandfather. On behalf of the Sith Empire, and ostensibly the Jedi Order, he undertook many daunting missions, such as the one to Naga Sadow's tomb on Yavin 4. Ovair had fair skin with brown hair and eyes, although his eyes would turn orange-yellow when his corruption by the dark side of the Force was revealed."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "When the spirit of Naga Sadow possessed Gynt, who had been considered the most promising Padawan in the Jedi Order at the time of his selection, Ovair was still able to overcome the formidable dark powers of Sadow occupying the body of such a talented Jedi. Ovair's skills at subterfuge were sufficient to conceal his identity until years later when reviewed by Jedi historian Gnost-Dural; this would suggest a skill of Force stealth on a considerable scale, hiding his dark side signature as he resided within the walls of the Jedi Temple. Ovair wielded a purple double-bladed lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Barel Ovair was first introduced in a timeline entry for the Star Wars: The Old Republic video game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}