{"url": "Snogar", "categories": ["Category:Legends articles", "Category:Human and Near-Human species", "Category:Mammalian sentient species", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Snogar"}, {"tag": "p", "text": "Snogars were a tall, furry sentient species native to the ice-covered planet Ota in the Mid Rim. The Snogars were descended from a technologically advanced race referred to as the \"Old Ones,\" who built cities within Ota's ice canyons. Over time the Snogars forgot how to use their ancestors' technology, and reverted to primitive lifestyles inside their ancient cities. By 1 ABY, that had resulted in a major crisis, as the Snogars were unable to power the heating machines that kept their homes habitable, threatening their way of life on their frigid homeworld."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Snogars were a furry, apelike species of humanoids from the frozen Mid Rim planet of Ota. Physically imposing—adult Snogars averaged 2.5 meters tall—and of limited intelligence, Snogars struggled to survive in Ota's cold climate despite being native to the world, relying on heating machines in their cities to live with any comfort. Snogars had large manes of fur surrounding their heads, with simian, purple faces that they often kept hidden with masks meant to protect against Ota's cold."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Snogars were descended from a highly intelligent civilization later remembered as the \"Old Ones,\" who built cities within the ice canyons of Ota. However, they eventually forgot how to use their advanced technology and became the Snogars, who carved out primitive existence in the ruins of their forefathers. The Snogars still managed to effectively use some simple technologies, such as stun nets, and traversed the planet's snow drifts on snowboard-like conveyors called powersliders."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Civilization flourished on Ota in the millennia prior to the Galactic Civil War, but over the course of thousands of years, the intelligent and technologically savvy \"Old Ones\" devolved into the primitive Snogars, who struggled to maintain the devices that kept their society habitable. By 1 ABY, the situation had grown desperate, as the Snogars were no longer able to operate the hydroelectric generators that powered the heating machines that were vital to their survival. The Snogars thus began searching for offworlders who perhaps had the technical knowledge to aid them. Their prayers were seemingly answered when a group of Snogars captured Rebel pilot Luke Skywalker and Boba Fett and attempted to force them to fix their generators, but the encounter only resulted in a few dead Snogars and the natives fleeing their city from a vengeful Fett."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Snogars first appeared in The Frozen World of Ota, a comic strip arc written by Russ Manning, Rick Hoberg and Don Christensen and released in 1980."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}