{"url": "Snowtrooper", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:First Order stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Snowtrooper"}, {"tag": "p", "text": "Snowtroopers were a variant of the stormtrooper used by the First Order thirty years after the Battle of Endor. They wore insulated armor and helmets designed for cold weather. Snowtroopers saw action during the Battle of Starkiller Base and the Battle of Crait in 34 ABY, and by 35 ABY they took part in the First Order's occupation of the planet Kijimi."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The latest generation of cold weather assault stormtroopers, snowtroopers wore advanced insulated armor and helmets made from betaplast with flared neck shroud and a polarized slit visor to minimize ice glare, two breather tank inlets. They wore insulated gloves with adjustable heating units. Their body armor also had heating controls, and they wore an insulated belt kama."}, {"tag": "p", "text": "First Order Walker Drivers wore armor similar to that of both standard walker pilots and snowtroopers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Snowtroopers were deployed to Hays Minor during the First Order's occupation of the planet."}, {"tag": "p", "text": "Many snowtroopers were stationed on Starkiller Base when it was attacked by the Resistance in 34 ABY."}, {"tag": "p", "text": "Snowtroopers were also involved in the Battle of Crait shortly thereafter. Although Crait was only superficially a snowy planet due to the planet's white salt flats obscuring red crystals on the ground, it nonetheless had similar enough properties to necessitate their deployment in the battle."}, {"tag": "p", "text": "Under the order of General Armitage Hux, snowtroopers assisted in the destruction of the peaceful planet Tah'Nuhna for their aid toward the Resistance."}, {"tag": "p", "text": "In 35 ABY, snowtroopers occupied Kijimi City, enforcing the Supreme Leader's will before the planet was destroyed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Snowtroopers first appeared in Star Wars: Episode VII The Force Awakens. For the costumes used in the film, the snowtroopers' armor, helmet, and backpack were made of molded polyurethane, while their gloves were made of nylon with additional molded polyurethane elements. Their quilted tunics and collars were made from jersey-backed neoprene, with the tunics also incorporating polyester and cotton. The nylon boots they wear are \"Kamik White Men's Canuck Cold Weather Boots.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}