{"url": "Sochek", "categories": ["Category:Canon articles", "Category:Garnac's hunting guild members", "Category:Males", "Category:Trandoshans"], "nodes": [{"tag": "h1", "text": "Sochek"}, {"tag": "p", "text": "Sochek was a male Trandoshan hunter who was a member of Garnac's hunting guild. He was killed by Wookiees on the moon Wasskah."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Trandoshan Sochek was a hunter who lived during the final decades of the Galactic Republic's reign. During the Clone Wars, in which the Republic fought against the Confederacy of Independent Systems, Sochek was a member of a hunting guild lead by the Trandoshan Garnac. The group would capture sentients from around the galaxy and bring them to the moon of Wasskah to hunt. At one point during the war, Garnac and several other hunters returned to Wasskah with a ship full of captives including the Jedi Padawan Ahsoka Tano. They released the group onto part of the moon known as Island Four, and then returned to the guild's Ubrikkian Floating Fortress, leaving their captives to scatter across the island overnight."}, {"tag": "p", "text": "In the morning, Sochek was amongst the Trandoshans who waited with Garnac in his trophy room for the sun to rise. Once light from the sun shone into the chamber, Garnac declared that the hunt could begin. Sochek and the other Trandoshans cheered while arming themselves and then boarded a series of MSP80 Pteropter hover pods in order to travel through Island Four's forests and hunt their prey. Sochek rode in a pod with his fellow hunter Ratter, and the pair eventually found Lika and Katt Mol, two of the prisoners released the previous night, wandering together through the undergrowth. Ratter opened fire first, catching Mol unawares and killing him and causing Lika to try and flee. Taking his turn to shoot, Sochek aimed before firing and killed Lika in a single shot."}, {"tag": "p", "text": "The pair later returned to the lodge, and later that night Sochek and the other Trandoshans gathered in the trophy room and chanted the name of Garnac's son Dar who hoped to claim Tano as his first Jedi kill. The next day, Sochek piloted a pod down on his own, finding Tano and three Jedi younglings who had been previously captured. The hunter opened fire with his pod's rotary cannon, but the Jedi were able to dodge his shots and escape. Garnac, Dar and another hunter named Lagon then chased Tano and the youngling Kalifa in their pod, which resulted in both Kalifa and Dar's deaths."}, {"tag": "p", "text": "Following the death of their comrade, the Jedi managed to board and destroy one of the hunter's ships as it was dropping off more prisoners on Island Four. Sochek and the other hunters flew down to the crash site to inspect the damage, and discovered the two Trandoshans who had been piloting the vessel were dead, and the sole prisoner, a Wookiee named Chewbacca, was gone. The Wookiee had joined up with the younglings, and the next day the four managed to board the hunting lodge by hijacking one of the Trandoshans' hunting pods. Along with the other hunters, Sochek attacked the boarders, but fire from the captured pod forced him and Ratter to take cover."}, {"tag": "p", "text": "Garnac managed to shoot down the pod and knocked Tano and her companions to the ground, allowing Sochek and the others to gain the advantage, however before they could shoot their foes, the mercenary vessel Halo arrived and dropped off several Wookiees who had come to rescue Chewbacca. In the ensuing fight, Lo-Taren and Sochek took cover behind a pod, but Lo-Taren was hit by the Wookiee's blaster fire and killed. While Sochek was distracted, the younglings used the Force to move the pod, giving the Wookiees a clear shot at Sochek, who they shot and killed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sochek was heavyset compared to most other Trandoshans, and had green scales. He had no feathers on his head. Sochek was skilled with a sniper rifle, able to take out a fleeing target from a decent distance."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "When hunting, Sochek used a blaster rifle and wore a pair of yellow-tinted goggles. He wore a black shirt with a gray sleeveless jacket over it, and a pair of brown shorts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sochek first appeared in \"Padawan Lost,\" the 21st episode of the third season of Star Wars: The Clone Wars which aired in 2011. He was not named in the show, but was identified in the episode guide for Padawan Lost published on StarWars.com. Sochek's name and tinted goggles are a reference to the character Walter Sobchak from the Cohen Brothers film The Big Lebowski. He subsequently appeared in the following episode \"Wookiee Hunt,\" where he was killed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}