{"url": "Sol_Sixxa", "categories": ["Category:Legends articles", "Category:Males", "Category:Mere", "Category:Pirates", "Category:Resistance fighters"], "nodes": [{"tag": "h1", "text": "Sol Sixxa"}, {"tag": "p", "text": "Sol Sixxa was a male Mere from Maramere, and the leader of the Mere Resistance. He joined forces with the pirate captain Nym to battle the Trade Federation in the Karthakk system."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Eight years after the Invasion of Naboo, Sol Sixxa killed the Neimoidian Toat and recovered an experimental cloaking device from the Syren, for use aboard his own vessel, Revenant. Sixxa fed rumors that he himself was a spirit, using his ship's ability to cloak to bolster his infamy. The leaders of the Mere grew wary of him, however, fearing that if he ever defeated the Trade Federation, he would turn on the population of Maramere. Loreli Ro was sent to hire Nym, a local pirate, to defeat Sol Sixxa."}, {"tag": "p", "text": "Though Nym confronted the hulking Mere, he found that he and Sixxa shared a common goal in the overthrow of the Trade Federation. After Nym outwitted Sixxa, the two agreed to join forces under Nym's command. Sixxa would go on to become a valuable asset, defeating Harro Ruuk on Maramere, and later participating in the siege of Nod Kartha and the battle against Cavik Toth over Geonosis."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sixxa was cold-blooded and violent individual, willing to do anything to destroy the Trade Federation. He was also cunning, using rumors to his advantage. When Nym bested him in combat, he agreed to join forces under Nym's command, and would go on to win numerous battles against the Droid Army. Sixxa piloted a Scurrg H-6 prototype bomber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sol Sixxa was voiced by Jason London in Star Wars: Jedi Starfighter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}