{"url": "Sojourner_Transport", "categories": ["Category:Canon articles", "Category:Jedi Order starship classes", "Category:Kuat Systems Engineering products", "Category:Transport classes"], "nodes": [{"tag": "h1", "text": "Sojourner Transport"}, {"tag": "p", "text": "The Sojourner Transport, also known as the Jedi Sojourner, was a class of small transport that was used by the Jedi Order in the final years of the Old Republic and throughout the Order's history. They became very rare after the Great Jedi Purge and the Age of the Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Sojourner Transport, also known as the Jedi Sojourner, was manufactured by Kuat Systems Engineering. The Sojourner was equipped with a navigation computer, a class 1 primary hyperdrive and a class 12 secondary hyperdrive, as well as sensors that gave it long-range detective capabilities. It was crewed by one pilot and could accommodate six passengers, with enough consumables for three months. It was similar in size to a light freighter, and was armed with forward-mounted twin medium laser cannons and a dorsal turret-mounted light laser cannon. Sojourner Transports were often sent out with a holocron onboard to use in teaching or research."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Sojourner Transport was commissioned to provide the Jedi Order a starship to transport Jedi Knights and their padawans on long journeys of training and meditation. The Jedi went out into the galaxy and call on the Living Force to guide them to where they needed to travel. As such, the Sojourner Transport provided the Jedi with a versatile ship for meditative and training needs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sojourner Transport was commissioned by the Jedi Order in the final years of the Old Republic, and were used by the Order throughout its history. After the fall of the Jedi Order with the Great Jedi Purge, the Sojourner became extremely rare as it was believed that few survived the collapse of the Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sojourner Transport was first mentioned in the 2018 Fantasy Flight Games sourcebook, Unlimited Power."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}