{"url": "Sola_Naberrie/Legends", "categories": ["Category:Legends articles", "Category:Females", "Category:House Naberrie", "Category:Humans", "Category:Naboo"], "nodes": [{"tag": "h1", "text": "Sola Naberrie"}, {"tag": "p", "text": "Sola Naberrie was a Human female from the Mid Rim planet of Naboo. She was the elder daughter of Ruwee and Jobal Naberrie, the sister of Padmé Amidala, as well as the mother of Ryoo and Pooja Naberrie. She would later become the maternal aunt to twins Luke Skywalker and Leia Organa Solo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sola met her future husband Darred Janren, a young architect, while studying at a Naboo university. Shortly after her marriage, she had two daughters, Ryoo and Pooja. Sola and Darred recognized the fact that the Naberrie name was well-known within the social and political circles of Naboo, and therefore decided to keep it as the family name."}, {"tag": "p", "text": "Having settled happily into a domestic life, Sola worried about Padmé's choice of life, wondering if her \"little baby sister\" would ever settle down and have children of her own. She also greatly enjoyed teasing Padmé about men who would make likely suitors for her, much to her sister's exasperation. Sola even told Anakin Skywalker, her future brother-in-law, that he was \"the first boyfriend\" Padmé had ever brought home to the family."}, {"tag": "p", "text": "Shortly after the Clone Wars had ended, Sola, along with her family and thousands of other mourners, attended her sister's funeral."}, {"tag": "p", "text": "Her youngest daughter Pooja later became Naboo's representative in the Imperial Senate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sola Naberrie was portrayed by Claudia Karvan, an Australian actress perhaps most well-known for her work on TV programs The Secret Life of Us and Love My Way."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}