{"url": "Solenoid", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Droids of unspecified degree", "Category:Masculine programming", "Category:Techno Union members"], "nodes": [{"tag": "h1", "text": "Solenoid"}, {"tag": "p", "text": "Solenoid was a droid who served the Techno Union, a leading technology concern that was allied with the Confederacy of Independent Systems during the Clone Wars. In about 21 BBY, a Separatist corvette that Solenoid had been assigned to was attacked in the Ando system by a Galactic Republic task force. The ship was crippled in the engagement and was subsequently boarded by a team of Republic-allied freelance agents. Solenoid and the Thaereian military envoy Gura Tran attacked the agents in a corridor, planning to kill the boarders and steal the agents' starship. However, despite their efforts, Solenoid and Tran were eventually defeated by the agents."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Solenoid was a droid who served the Techno Union, a leading galactic technology concern. During the Clone Wars, a conflict fought between the Confederacy of Independent Systems and the Galactic Republic, the Techno Union allied itself with the Confederacy, and, in about 21 BBY, Solenoid was assigned to act as a Techno Union representative aboard a Separatist Corellian corvette. The ship was dispatched to a Separatist base on a planetoid in the Ando system, but, shortly after arriving in the system, the corvette was attacked by Strike Force Cularin, a Republic flotilla that had been sent to capture the Separatist base. The corvette was severely damaged during the engagement and most of the its crew killed, and the Heroes of Cularin—a group of Republic-allied freelance agents—boarded the remains of the Separatist ship to search for survivors. Soon afterward, Solenoid and Gura Tran, a Thaereian military envoy to the Confederacy who had been traveling aboard the corvette, spotted the agents in a corridor. Tran recognized the agents and immediately ordered Solenoid to kill them, so that he and Solenoid could steal the agents' starship. Solenoid immediately engaged the agents in combat, while Tran fired at the agents from behind the droid in an attempt to use Solenoid as partial cover. However, despite their efforts, Solenoid and Tran were eventually defeated by the agents."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Solenoid was an armored, box-shaped, clunky-looking droid who was similar in appearance to the Skakoan Wat Tambor, the leader of the Techno Union. He was equipped with an integrated comlink, a remote receiver, a blaster rifle, and also a vocabulator, which gave him a metallic-sounding voice. In addition, Solenoid was fitted with an implant, which caused his memory core to self-destruct if someone tried to shut him down or tamper with the memory core. Solenoid possessed good diplomatic skills and was also a formidable opponent when in combat. However, during his fight against the Heroes of Cularin, he was unable to use his fighting abilities to their fullest potential, due to the restrictions of the environment aboard the crippled corvette."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Solenoid was created by Ronald A. Heintz and appeared in Decision: Almas, a 2004 roleplaying adventure that formed part of the Decisions trilogy of the Living Force campaign. During the scenario, the player-characters roleplay as the Heroes of Cularin, and Solenoid's exact combat prowess and armament is dependent upon the players' roleplaying experience tier. If the players are in either the lower or medium tiers, Solenoid's roleplaying statistics are based upon those of a B1-Series battle droid, and he is equipped with a blaster rifle, a comlink, a remote receiver, and a vocabulator. If the players are in the higher roleplaying tier, Solenoid has the same equipment as he does for the two lower tiers, but his statistics are instead based upon those of a B2 super battle droid. Furthermore, if the players are in the upper tier, Solenoid's roleplaying statistics are based upon those of a droideka, and he is fitted with two antique, integrated repeating blasters and a set of deflector shields that are slightly less powerful than those of a droideka, but he has no vocabulator. The \"Characteristics\" section of this article reflects the armament and equipment that Solenoid possesses if he is faced by player-characters who are in either the lower, medium, or higher experience tiers. During their battle against Solenoid and Gura Tran, the players can either destroy or capture Solenoid, and, if they capture him, he refuses to say anything to them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}