{"url": "Soldier_(clone)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Dark Jedi", "Category:Human clones", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Soldier  (clone)"}, {"tag": "p", "text": "Soldier, also known as the Prime to the One Sith organization, was a Human male clone created around 9 ABY from the DNA of Jedi Knight Jaden Korr. He was spawned at an Imperial research facility on a frozen moon in the Unknown Regions as part of a cloning program that was initiated by Imperial Grand Admiral Thrawn with the purpose of producing powerful Force users to serve the Empire. The last of a batch of Force-sensitive clones—originally designated Subjects A through I—produced from combined Jedi and Sith DNA, Soldier, as he was called by his brethren, was the most stable of the clones, not suffering from the madness-inducing sickness that afflicted the other specimens. While Soldier was living at the research facility, fellow clone Seer received a call through the Force from an entity named Mother, who promised to provide the clones with a home and cure for their sickness. After years of planning, the clones—who referred to themselves as the Community—revolted against their creators, brutally murdering the scientists at the facility."}, {"tag": "p", "text": "The clones were subsequently stranded on the moon for decades, until 41 ABY, when Korr arrived there followed by the Anzat assassin Kell Douro. The clones escaped aboard Douro's CloakShape fighter, Predator, but were pursued by Korr, who was determined to stop them after witnessing the carnage they had orchestrated at the facility. Arriving on the planet Fhost, Soldier and the clones who had not yet succumbed to the sickness caused a fight at the medical center in the city of Farpoint. After an encounter with Korr there, the clones escaped aboard a medical supply ship, taking Korr's companion Khedryn Faal hostage. However, Nyss Nenn, an Umbaran agent of the One Sith, had also infiltrated the ship and took control of it, hoping to capture Soldier and trade Faal for Korr, as his masters needed both men for their own needs. With Faal's help, Soldier retook control of the ship from Nenn, after which he ordered the former to retreat via one of the escape pods. Soldier then chased the Umbaran through the ship, forcing him to flee aboard a second pod."}, {"tag": "p", "text": "The three surviving clones—Soldier, Seer, and the child Grace—eventually reached a remote star system, where they found Mother, an ancient and self-aware Rakatan space station, and were followed there by Korr and Nenn. However, instead of helping the clones, Mother killed Seer and possessed her body in an attempt to escape to the outside galaxy. Soldier and Grace then joined with Korr and his companions, Faal and Marr Idi-Shael, in an attempt to escape from the station. Procuring enough medicine for Grace from the medical supply ship to tend to her clone sickness, Soldier and Grace took Nenn's scout flyer and escaped before the station was destroyed, hoping to find someplace where they could live the rest of their days in peace."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Life on the frozen moon"}, {"tag": "p", "text": "In the year 9 ABY, Imperial Grand Admiral Thrawn discovered a cache of Spaarti cloning cylinders inside Mount Tantiss, the late Galactic Emperor Palpatine's secret storage facility on the planet Wayland. Around that time, the Chiss Grand Admiral established a research facility on the surface of a frozen moon orbiting a gas giant in a star system code-named UR-2212-GR in the Unknown Regions. Thrawn then sent at least one of the cylinders and DNA samples from various Jedi and Sith to the facility, tasking the scientists working there to combine the DNA to create hybrid Jedi–Sith clones who would serve the Empire as powerful Dark Jedi agents. However, the main goal of the project was to create a breakthrough Force user who could effectively wield both light side and dark side powers. Among those samples was one belonging to the Human male Jaden Korr, who would eventually become a Jedi but at that time was still a young boy living with his adoptive parents on the galactic capital of Coruscant, unaware of his Force-sensitivity."}, {"tag": "p", "text": "After a series of experiments on the DNA, one of the scientists, code-named Dr. Gray, was able to combine the samples in a usable form, and soon enough the scientists produced nine clones, designated Subjects A through I. Although the clones were created from combined Jedi and Sith DNA, each one of them was mostly based on a single template. The clones were not all born at the same time, and the eight early clones suffered from a sickness that affected them physically, causing their bodies to destabilize and driving them to madness. To fight the disease, those clones required constant injections of the metacycline drug. However, the later clones were increasingly more stable than the earlier ones, and the final clone—produced from the Korr sample—exhibited none of those symptoms and was considered to be a perfect specimen by the scientists, the pinnacle of the experiment envisioned by Thrawn. The One Sith organization, secretly operating from the Sith world of Korriban, also heard rumors of Thrawn's secret project and the creation of the perfect clone—whom they referred to as the \"Prime\"—and they sought to someday obtain him for study."}, {"tag": "p", "text": "Although the scientists attempted to slow down the clones' accelerated aging, they still grew to maturity rapidly and were all aware of their connection to the Force. Linked to each other telepathically and empathetically, the clones grew very attached to each other, forming a close Community and giving each other names to replace their original Subject designations. The Korr clone was given the name \"Soldier\" by his brethren. However, as Soldier did not exhibit the sickness inherent to the other clones, they considered him different from them and often demonstrated detachment and contempt when talking to him. Growing under the constant supervision of the Imperial scientists, who watched them through the transparisteel ceiling of their chambers, and enduring continuous tests and experiments, the clones grew to develop hatred for their creators. One night, years before 41 ABY, in a few moments of solitude granted to them by the scientists, Seer, a clone of the Dark Lady of the Sith Lumiya—approached her brothers and sisters, telling them that she had received a call through the Force from a being called Mother. Seer claimed that Mother would provide a home for the clones and would help them cure their sickness, and the clones started formulating plans to escape from the frozen moon. Soldier doubted the existence of Mother, but he kept his thoughts to himself. Howecer, another clone named Wry, who had shared Soldier's wavering faith, spoke his mind to the Community. Enraged by his defiance, the other clones tore apart Wry in an incident of collective rage, with Soldier watching from the side. He then decided to keep his doubt to himself and to follow the Community's plans."}, {"tag": "p", "text": "For years, the clones plotted their escape, as Seer became their prophet and the mastermind behind their plans. They managed to obtain various spare parts to construct lightsabers, with Seer smuggling lightsaber crystals inside the facility. Working during the nights in their cubicles when the scientists could not see them, Soldier and the others operated by touch and their connection to each other to construct crude but functional lightsabers. When Seer finally decided it was time to strike, she made the announcement to the other clones. Following her call, Soldier and the Community attacked their masters, slaughtering the scientists and the stormtrooper guards alike. The murders were brutal, with the clones dismembering the facility's staff and writing with their blood on the walls. They then filled the Spaarti cloning cylinder that had given birth to them with the remains of their victims, turning it into an altar to Mother. Running on limited supplies of food, energy, and medicine at the facility, the clones bade their time, waiting decades for a ship to arrive at the moon to take them away. During that time, some of the clones developed romantic relationships, giving birth to three children: Gift, Blessing, and Grace. Soldier grew attached to the children, developing affectionate feelings for them. As many years passed, the clones began to lose hope, but Seer kept up their spirits, promising that eventually someone would come to the moon and the clones would be able to escape."}, {"tag": "h3", "text": "Escape into peril"}, {"tag": "p", "text": "Indeed, in 41 ABY, someone finally came as Seer had predicted. Jaden Korr, now a Jedi Knight of the New Jedi Order, arrived on the frozen moon guided by a vision from the Force. While Korr explored the facility, the clones slipped out to the outside of the moon to steal the vessel he had arrived in, the Starhawk shuttle Flotsam, while one of them, Alpha, volunteered to stay behind to confront the Jedi. Korr killed Alpha, while the clones, taking the remaining medicine with them, found a vessel to escape from the moon—not Flotsam, but the larger CloakShape fighter Predator, which belonged to the Anzat One Sith assassin Kell Douro, who had followed Korr to the facility and had been killed as well. Soon enough, Korr and his companion, Khedryn Faal, emerged from the facility. Making their presence known, the clones landed the CloakShape beside them. Believing that the clones would not dare to kill them, Korr and Faal turned their backs to the Predator and walked away, with Korr sending mental warnings to the clones, promising to follow them should they escape. Soldier and the Community did not heed his warnings and took the CloakShape to leave the moon. As they passed the atmosphere, they flew through the remains of Lignan crystals that had been scattered there after the ship carrying them, the Sith dreadnaught Harbinger, had been destroyed by Jedi Master Relin Druur after time-traveling from the era of the Great Hyperspace War five thousand years before. The Lignan crystals, capable of amplifying dark side powers, influenced the escapees. Soldier and the other clones felt their powers greatly magnified, but the influence also rapidly accelerated their sickness, placing the clones—with the exception of Soldier—in a state of trance and making their skin ripple and bulge."}, {"tag": "p", "text": "As the only one unaffected, Soldier rushed to distribute the metacycline to his brothers and sisters, who were reluctant to accept it in their delirium as their hatred for Soldier intensified. One of the clones, Scar, died, while another, Two-Blade, attacked Soldier but was quickly beaten. As Soldier prepared to kill Two-Blade, the man experienced great pain from the sickness, and Soldier spared him. Soldier distributed the dwindling supplies of the medicine, but Scar's mate, Maker, provoked him into battle. Feeling the power of the dark side coursing in him, Soldier killed Maker with a blast of Force lightning. When Soldier tried to administer the medicine to Seer, she objected at first, believing that Mother would cure her, but she eventually agreed to take one final shot. Analyzing the CloakShape's computer records, Soldier then discovered that the ship's last known destination before the frozen moon had been the planet Fhost, which possessed a medical center in the sole city of Farpoint. Hoping to replenish their medical supplies there, Soldier informed Seer of his discovery, and she agreed to set course for Fhost."}, {"tag": "p", "text": "Upon reaching the planet, Soldier set the ship down at a large clearing in a forest fifty kilometers away from Farpoint. By that point, Blessing and Gift had succumbed to their illness; Soldier tried to give them an adrenaline shot to revive the children, but they had already died. Seer told Soldier to leave their bodies, as well as Two-Blade, who was nearly gone himself, aboard the ship. Soldier, Seer, and the clone Runner then took Grace and her mother, Hunter, both unconscious, and used a speeder they had found in the CloakShape's cargo hold to travel to the Farpoint Medical Center. On their way there, Soldier did not approve of Runner casually using the Force to orchestrate traffic accidents."}, {"tag": "p", "text": "At the facility, the clones were greeted by a female doctor and a male nurse, who offered to take care of Hunter. Using a mind trick on them instead, Soldier tried to force the two to escort them to the facility's dispensary to obtain the supplies with which he could mix more metacycline. However, the clones' suspicious behavior attracted the attention of the facility's guards, who tried to detain them. Growing impatient, Runner shoved Soldier aside and used the Force to wreak havoc at the facility, causing the guards to open fire and Soldier to kill them in self-defense. As a result of Runner's outburst, six innocent people were killed. Seer had sensed through the Force that a medical supply ship would soon be arriving at the facility's rooftop, and since Runner's actions had rendered all lifts non-operational, the clones then took the stairs to the medical center's roof."}, {"tag": "p", "text": "However, as they reached the third floor, Korr—who had been pursuing the clones from the frozen moon—dropped down and confronted them. Korr knocked Runner unconscious, and Soldier engaged him in a lightsaber duel. Seeing Soldier's face and realizing that he was a clone of himself, Korr momentarily lowered his defense, allowing Soldier to blast him with the Force. Runner came to his senses and, together with Soldier and Seer, assaulted Korr with the Force. The Jedi could not block the attack and was weakened, and Soldier, spurred on by Seer's orders to kill the Jedi, used Force lightning on him, inflicting heavy injuries. Runner then attempted to execute Korr, but the latter managed to block the clone's strike. Runner responded by kicking Korr down a flight of stairs; the Jedi was able to quickly stagger to his feet, only to stumble and fall further down the stairs. Not wanting to waste time, the clones then made their way to the roof but were attacked there by Korr's companion, Faal, before they quickly disarmed him. Runner wanted to kill Faal, but Soldier stopped him from doing so, believing that they could learn from him how Korr had tracked them."}, {"tag": "p", "text": "Taking Faal hostage, Soldier and the others boarded the parked medical supply ship—which carried enough reagents with which Soldier could mix up more medicine—and, following a course set by Seer, embarked on a journey to Mother. When Faal came to his senses, Soldier asked him how Korr had been able to track them, but Faal revealed that they had run into the clones on accident. Seer and Runner wanted to kill their hostage, but Soldier, who initially wanted to release Faal aboard an escape pod, was at least able to negotiate to have Faal executed by spacing, instead of Runner's lightsaber. As Runner left to escort Faal to the airlock to proceed with the execution, Soldier noticed that Grace had gone missing, and he instructed Hunter—who had just come to her senses—to go find her daughter. However, Soldier soon felt a strange presence aboard that attempted to cut him off from the Force, and he heard Grace screaming as the girl spotted an intruder. An Umbaran agent of the One Sith, Nyss Nenn, had been able to slip aboard the ship, had killed Runner and Hunter, and had taken Faal captive near the airlock. Nenn possessed a talent that allowed him to cut others from the Force, and he knocked Seer unconscious. Soldier, resisting the power, put up a fierce fight, but the Umbaran stunned him with a flash-bang grenade, hurt him with a vibroblade, disarmed him, and took him hostage, binding him and informing Soldier that the One Sith wanted him alive."}, {"tag": "p", "text": "Taking the medical supply ship out of hyperspace in a star system with two gas giants, Nenn contacted Korr, who was pursuing the clones aboard the freighter Junker. Nenn demanded Korr to trade himself in for Faal, or he would kill the spacer. However, Faal then sneaked into the cabin, having been freed by Grace. Willing to repay the girl's kindness, Faal set Soldier free and gave him Hunter's lightsaber, which he had found, and the clone told Faal to flee. Soldier attacked Nenn, causing the Umbaran to retreat to an escape pod. Soldier attempted to break the pod's glass window with his lightsaber, but the Umbaran used his talent at the last moment to influence the lightsaber's crystal, turning the blade off. Both the Umbaran and Faal escaped from the ship on separate escape pods, Faal headed toward Junker and Nenn trying to make his way to his scout flyer, flown into the area by his sister, Syll Nenn. In an ensuing skirmish in open space, Syll used the scout ship to attack Faal's escape pod, but she was killed by Korr, who had left Junker in a hardsuit and reflected her shots back at her with his lightsaber. Faal was recovered by his friends, while Nyss returned to the scout flyer to find his sister dead. Soldier, meanwhile, found Grace, unharmed and hiding in the medical ship's cargo bay, and set course back to Seer's coordinates."}, {"tag": "h3", "text": "Revelation of Mother"}, {"tag": "p", "text": "Seer came to her senses, and the three surviving clones soon emerged from hyperspace in a system that contained a pulsar, two tide-locked planets, and an asteroid belt of unnatural origin. The system was filled with radiation emanating from the pulsar and appeared uninhabited and unable to sustain any life. Believing that Seer was wrong and that Mother, whoever she was, could not possibly have been living there, Soldier was emotionally devastated. However, Seer directed him to fly the ship to the dark side of one of the planets, the one closest to the pulsar, where they discovered an ancient Rakatan space station, organic in nature and connected by a tether to the planet below. The station also emanated strong dark side power, and Seer stated that Mother was there. Soldier, his faith in Seer's visions restored, docked the medical supply ship with the station, and the three clones went aboard. Inside the station, they found decaying corpses of the people who had perished there earlier."}, {"tag": "p", "text": "Following Seer's guidance, Soldier and the others used organic tubes to descend through the tether to the planet-side portion of the station, where they found a large oval chamber with a large cylindrical mound in the center, covered with filaments of different colors. As the clones took in the beauty of the place, a realization struck Soldier: Mother was not a person; she was the consciousness of the space station itself, and they were in her heart. Soldier asked Mother to cure Seer and Grace, but the filaments took hold of Seer's body, strangling her to death. All that time, Mother had needed the clones with the sole purpose to possess one of them and escape to the outside galaxy. Witnessing what had happened, Soldier grabbed Grace and ran away, intent on protecting the girl at all costs. The two soon heard the sound of scuffle, and Soldier went ahead to investigate, finding Marr Idi-Shael, Korr's Jedi apprentice. Korr and Idi-Shael had followed the clones to the station but had been ambushed by Nenn. Korr had killed the Umbaran but had been killed in turn by the Iteration, another clone of himself created by the One Sith. Idi-Shael had then transferred his Master's consciousness into the Iteration's body using the mindspear device and was waiting for his Master to come to his senses."}, {"tag": "p", "text": "As Soldier watched, Korr regained consciousness in his new body and stumbled around unknowingly. Soldier took Idi-Shael hostage and told him to call over his Master. The sound of his apprentice's voice restored Korr's memories of past events, with the exception of his death, as Idi-Shael had hidden all evidence of it. Soldier spoke to Korr, telling him that he was not responsible for the deaths of innocents at the medical center on Fhost and asking him to help him and Grace escape, promising that they would never harm anyone. After some consideration, Korr agreed, and the four individuals tried to make their way out, only to run into Mother inhabiting Seer's body. Mother attacked the group, and Korr was barely able to wound her after a fierce fight. The men realized that they could not fight the entity, and they ran away from the fight."}, {"tag": "p", "text": "They were then contacted by Faal, whom Nenn had knocked unconscious at the upper portion of the station. Korr told Faal to go to the medical transport and set its systems on overload so that it would explode and destroy the station. Faal did so, and the ship was bound to explode shortly. Soldier and his companions used the organic lifts to meet Faal at the upper level of the station. Realizing that Grace would not survive without medicine, Soldier informed Korr that he would try to get some from the medical ship before it exploded, after which he would escape aboard Nenn's scout flyer, which was docked nearby. Korr agreed, and the group separated, with Idi-Shael, Korr, and Faal going their own way toward Junker. Soldier took Grace and ran into the medical ship, grabbing enough medicine to keep her symptom-free for years, and together they made their way to the scout flyer, escaping from the station right as it was destroyed, taking Mother with it. Soldier then jumped to hyperspace, hoping to find some planet where he and the girl could settle down, live the rest of their lives in peace, and try to find a permanent cure for Grace."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A clone of Jaden Korr, Soldier shared the same appearance as the Jedi, being a tall man with narrow, angled facial features; a hatchet nose; brown hair; fair skin and gray eyes. However, the decades spent in isolation at the facility on the frozen moon had led to Soldier having a more unkempt and haggard appearance than his genetic template, with Soldier wearing the old, poorly-fitting rags that had once belonged to the facility's staff. Soldier's hair was very long, and his facial hair had grown into a full beard. When he first met Korr, he recognized him as his progenitor, but he was not particularly fazed by the encounter and considered himself different from Korr. Although he was created years after Korr's birth, his accelerated aging had resulted in him being approximately the same age as the Jedi by 41 ABY. Like all other clones, he was aware of his Force-sensitivity from his creation and was telepathically and empathetically connected to his brothers and sisters. However, being the only clone not to experience the sickness, Soldier was considered different by the rest of the Community and was somewhat of an outcast. Although the other clones looked down on him, Soldier cared for them and felt protective of them, especially the children, who were the only ones to treat him as an equal. Although it pained and angered him to hear constant reminders from his brethren that he was not like them, over time Soldier learned to build figurative mental barriers and ignore their words."}, {"tag": "p", "text": "Soldier and Wry were the only two clones who doubted the existence of Mother, but after seeing the other clones murder Wry for voicing those doubts, Soldier kept his beliefs to himself, although Seer saw the truth in him. The other clones believed that the sickness was given to them as a test from Mother, and only those strong enough would survive the journey and live to see her. Soldier did not see things that way, believing that the children, Gift and Blessing, did not deserve to be tested so harshly, and he was devastated by their deaths. Although he hated his life at the facility on the frozen moon, Soldier found himself remembering the place as his home, and he even somewhat missed it. The clone struggled for his entire life with feelings of loneliness and lack of purpose in life. Craving certainty, he tried to find purpose in Seer's visions and thought that he had finally found it when the clones reached the Rakatan space station. However, his faith was soon shattered once again when Mother revealed her true intentions and killed Seer. Convinced that the quest for Mother had been a lie, the only thing that mattered to him from that point on was to protect Grace. Now having a purpose in life, Soldier shed away all his doubts and no longer felt lost."}, {"tag": "p", "text": "Although Soldier was less susceptible to feats of uncontrolled rage than the other clones, he still experienced it sometimes. He did not participate in Wry's murder, but he did partake in the carnage on the frozen moon, releasing the anger that had boiled in him toward the scientists who had constantly performed cruel experiments on him, including long periods of isolation in a sensory deprivation tank, surgeries without anesthesia, and hypospray injections. As a result, Soldier developed a hatred for doctors in general. Soldier did succumb to rage when he killed Maker, relishing in the clone's pain as he blasted him with Force lightning. He was unwilling to kill Khedryn Faal, stopping Runner from doing so on Fhost and having the man taken captive instead. Later, after interrogating Faal, Soldier was willing to let him go in an escape pod, but he gave in to pressure from Seer and Runner and agreed to kill him, although he did grant Faal's final wish to be given a death worthy of a spacer and be thrown out of the airlock instead of being cut down by a lightsaber. Later, when Faal released him from Nenn's binds and wanted to stay to help him fight the Umbaran, Soldier told the man to leave, saying that if Seer ordered him to kill Faal later, he would not hesitate to do so. When they arrived in the irradiated system, Soldier believed that Seer had led them on a false quest. He had an outburst of anger toward her, but the sight of the space station calmed and humbled him, and he felt ashamed for letting his emotions out in front of Grace."}, {"tag": "p", "text": "Finding Grace extremely vulnerable and fragile, Soldier was always trying to protect the girl from danger, falling into an uncontrolled frenzy at the thought of Nyss Nenn possibly harming her, and that anger amplified his powers. He wanted the girl to stop experiencing the sickness and hoped Mother would cure her. That did not work, but Soldier managed to stockpile medicine from the supply ship that would allow Grace to live carefree for several years. Soldier hoped that he would eventually find a cure that would heal her completely and would allow the girl to live a better life than him. Soldier was often irritated by Runner's arrogant attitude and his inclination for unprovoked murder and destruction, and he often barely held from harming Runner in response. He felt no remorse for leaving Two-Blade behind on the Predator after the man had nearly killed him. Soldier experienced romantic feelings toward Seer, finding her features very attractive and feeling stinging sensations whenever she touched him. He found the planet Fhost looking beautiful from space and envied the freedom of beasts that he saw on the way to Farpoint. Having never seen so many people in one place, Soldier wanted to take a walk around the city and wondered what would it be like to settle there."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Like all members of the Community, Soldier was created with a deeply innate connection to the Force. He had a high midi-chlorian count and was adept at many basic and moderately advanced applications of the Force. The clones had an especially strong affinity for Force powers traditionally affiliated with the dark side of the Force, but Soldier rejected such labels, simply viewing those talents as powers to be used and not thinking of himself and the clones as Sith. Throughout the clones' years of planning their escape from the facility on the frozen moon, Soldier honed his abilities and constructed a functional lightsaber, working only by touch in the confines of his cabin."}, {"tag": "p", "text": "After the CloakShape fighter passed through the remains of the Lignan crystals as the clones left the frozen moon, Soldier felt a great surge of power that filled him and amplified his dark side powers. The feeling was strengthened by the clones' empathetic connection with one another, causing Soldier to feel the pain and ecstasy of every single member of the Community as they experienced the power coursing through them. The power caused Soldier to discharge Force lightning uncontrollably for a few moments, before he managed to bring it under control. When he later used that lightning to kill Maker, Soldier found that he had never been able to produce such a powerful variation of it, and he tried to contain the newfound power within himself after that incident. However, he later used it again during the fight with Jaden Korr on Fhost. He could also channel Force blasts at his opponents and use the Force to amplify his hand-to-hand combat abilities, utilizing Force-augmented punches and kicks when fighting Maker and Nyss Nenn. He could use mind tricks, attempting it on the doctor and the nurse at the Farpoint Medical Center, and he could sense the dark side power of Mother."}, {"tag": "p", "text": "Soldier was skilled with his lightsaber, being able to deflect blaster shots square at the chests of the medical center's guards, killing them in self-defense, and he was a match for Korr in lightsaber combat during their duel on Fhost. Like all the clones' weapons, Soldier's lightsaber was crude in design, with an unstable, sizzling red blade. After being disarmed by Nenn, Soldier received Hunter's lightsaber from Khedryn Faal, and he used her weapon from that point on. To an extent, he resisted Nenn's ability to block one from the Force. Soldier was an adept pilot, having undergone training in flight simulators at the cloning facility. He had learned that staring at the swirls of hyperspace for long periods of time could drive one to madness, and he found the experience nauseating. He was a proficient chemist, being able to recreate metacycline from raw components: a genetic coherence sequencer, an antipsychotic, and a blood thinner."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Soldier was created by author Paul S. Kemp, first being mentioned in the 2010 novel Crosscurrent as one of the nine clones created at the facility on the frozen moon. He later became a central character in Kemp's sequel to Croscurrent, the 2011 novel Riptide. In the novels, Soldier's character was used to explore philosophical questions about the meaning of identity and the journey to find one's purpose in life."}, {"tag": "p", "text": "Crosscurrent established that the nine clones were originally designated Subjects A through I, but Riptide did not reveal which letter corresponded to Soldier. As the last of the clones created, Soldier would seem to be Subject I, while Seer, as the second-to-last clone produced, would seemingly be Subject H. However, according to the novels, Subject H was Wry's designation, leaving the other clones' designations unclear. At the end of Riptide, Soldier muses that he has met \"a clone of himself\" when referring to Jaden Korr. It is unclear if this is simply a terminology error by Kemp, meant to be interpreted that Soldier has met his genetic template, or if it is an implication that Soldier knows that Korr is a clone, a possibility alluded to throughout the novel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}