{"url": "Solar_Flare_(Barloz-class)", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Barloz-class medium freighters"], "nodes": [{"tag": "h1", "text": "Solar Flare (Barloz-class)"}, {"tag": "p", "text": "The Solar Flare was a modified Barloz-class medium freighter used by the Alliance to Restore the Republic during the Galactic Civil War. It saw heavy usage throughout the war, and was at one stage used by a group of Rebel spacers who attempted to set up a Rebel cell in the Tapani sector. Its modifications included changes to the weaponry, as well as reduced cargo capacity but increased passenger space."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Solar Flare' was owned by the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. The ship saw many years of use by the Rebels, with five different captains commanding the ship over a two year period at one stage, each pushing the vessel to its limits. Alliance High Command assigned the starship to a group of Rebel spacers trying to establish a cell in the Tapani sector shortly after the organization's battle against the Empire on the planet Hoth. By this time the freighter was heavily modified, but also tended to often break down due to years of wear."}, {"tag": "h2", "text": "Layout and modifications"}, {"tag": "p", "text": "The Solar Flare was Barloz-class medium freighter produced by the Corellian Engineering Corporation. The ship stood at forty-one meters in length, and required a skeleton crew of one, but would normally be crewed by four individuals, two of whom were gunners. By the time of its use in the Tapani sector, the vessel had been heavily modified, with its crew quarters expanded to take six passengers along with the four crew, and also including an entertainment area. The area included a hologame table with over fifty hologames, a holovid player and physical workout equipment, all for recreational use. The vessel was capable of carrying a reduced one hundred tonnes of cargo as well as two months worth of consumables, and was built to maintain three hundred and thirty to nine hundred and fifty atmospheres of pressure."}, {"tag": "p", "text": "The ships armaments and systems had also been modified, with its concussion missile launchers being reduced from the quad normal for the model down to only a dual unit. This was to allow for the addition of a tower-mounted quad turbolaser cannon. The launchers made use of PL-8 Piercer Missiles, of which it was carrying eight when it entered the Tapani sector. The power generators for both the missile launchers and the turbolaser both were added at the cost of space previously used for cargo, hence the reduced capacity. The vessel's systems included both a navigation computer, a hyperdrive, and a sophisticated countermeasures package."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Solar Flare was first mentioned in Lords of the Expanse, a supplement for Star Wars: The Roleplaying Game released in 1997 by West End Games. The supplement, which was written by Paul Sudlow and Chris Doyle, provided the Flare as a vessel for player characters with a Rebel alignement who started the campaign without a ship of their own."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}