{"url": "Barion_Raner", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Blue Squadron personnel", "Category:Humans", "Category:Males", "Category:Mantellians"], "nodes": [{"tag": "h1", "text": "Barion Raner"}, {"tag": "p", "text": "Barion Raner was a human male who was a Rebel pilot who used the callsign Blue Four during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Battle of Scarif, Raner was a member of Blue Squadron, and second-in-command to General Antoc Merrick, where they provided support to rebel forces on the surface of Scarif. While most members of the squadron made it past the defenses into the atmosphere, Raner was cut off from the rest of the squadron when the Empire reactivated its orbital gate, resulting in the deaths of two of his fellow pilots, one of them being Vangos Grek. Raner survived by pulling up at the last second, and continued to support the fight with two other members of Blue Squadron who had also been cut off."}, {"tag": "p", "text": "During the battle, he landed the first series of shots that, in the end, won the battle for the Alliance. While being chased by TIE fighters, he managed to destroy the shield generator of the Star Destroyer Persecutor, opening it up to a barrage of ion torpedoes from Jon Vander and his pilots that disabled the vessel. The crippled warship would later be rammed by the Lightmaker and used to destroy the Scarif Shield Gate and the Intimidator, securing the Death Star plans and a narrow victory for the Rebel Alliance."}, {"tag": "p", "text": "Raner wrote a combat basics manual on flying T-65 X-wing starfighters that was used by new Rebel pilots. It included a section that included several maneuvers for starfighter combat, including the Split S, which was used to disengage from a fight. The manual was later intentionally leaked on the HoloNet by Alliance Intelligence."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Raner was portrayed by Ariyon Bakare in Rogue One: A Star Wars Story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}