{"url": "Solla_Deremot", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Females", "Category:Galactic Empire science and engineering personnel", "Category:Humans", "Category:Personnel of Moff Sarne's forces"], "nodes": [{"tag": "h1", "text": "Solla Deremot"}, {"tag": "p", "text": "Solla Deremot was a Human female from the planet Kal'Shebbol in the Kathol sector of the Outer Rim Territories. She studied biology at an educational institution in the Colonies, but when she returned to her homeworld upon completion of her studies, she was co-opted into the service of Imperial warlord Moff Kentor Sarne, who ruled the region. In 8 ABY, Deremot was assigned to science team MS-133 as a research assistant and was part of an expedition to excavate the ruins on a planet called Aaris III. While on the planet, the team discovered the Plaque of Victory, a sentient inanimate artifact that fed off the life-force of those nearby and compelled them to act in paranoid and homicidal ways."}, {"tag": "p", "text": "As the Plaque's influence spread through the expedition team, the members began to experience feelings of paranoia. The team was attacked by the primitive descendants of the native Aaris, a species that was believed to be extinct, resulting in deaths and the destruction of the shuttle that had ferried them to the planet. Deremot, along with Doctor Lancer Brunou, the expedition leader, were the sole survivors, and they were rescued by the crew of the New Republic CR90 corvette FarStar. In the months that Deremot and the expedition team had been on Aaris III, Sarne's regime on Kal'Shebbol had been toppled, and the New Republic was searching for the Moff as he had fled his capital. Brunou brought the Plaque of Victory aboard the FarStar with him, however, and a repeat of the situation on the planet below threatened the crew. Managing to realize the danger that the Plaque possessed, the crew ejected the artifact from an airlock, ending its hold on those aboard."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and working for Moff Sarne"}, {"tag": "p", "text": "Born on Kal'Shebbol in the Kathol sector of the Outer Rim Territories, the Human female Solla Deremot was sent to be educated off-world in the Colonies region of the galaxy, where she specialized in biological research. Upon her return to her homeworld, her skills were recognized by Imperial Moff Kentor Sarne, the warlord who controlled the planet. He brought her into his service, making her part of his own forces. Several months before the Battle of Kal'Shebbol in 8 ABY, Sarne authorized an expedition to the planet Aaris III to study the ruins of a long-dead civilization. He placed Doctor Lancer Brunou—a respected archaeologist from the University of Byblos—in charge of the mission and suggested to him that Deremot be part of the team, acting as a research assistant. Despite feeling out of place, as most of the team was made up of the doctor's colleagues, Deremot agreed to go and joined science team MS-133."}, {"tag": "h3", "text": "Expedition to Aaris III"}, {"tag": "p", "text": "Arriving at Aaris III, Deremot and the rest of the expedition team established a base camp in a large field of ruins, beginning their excavations under Brunou's supervision. On day forty-nine of the expedition, one of the other scientists, Grigor Tansad, discovered a way into one of the metal structures within the ruins. The structure was away from the primary base camp, so a secondary base camp was established to better serve the discovery. Deremot assisted Tansad and another scientist, Jelok, in investigating the ruins. Tansad subsequently discovered a chamber covered with tiles, each with a pictograph raised from it in bas-relief that emitted sounds when pressed. During excavation work on the chamber, Deremot and Jelok discovered a strange metal ingot concealed within a small alcove in the floor. Subsequent examination of the artifact determined that it was constructed of no metal known to Imperial science and that there were faint traces of energy emanating from it. Deremot, like the rest of the team, was unaware that the artifact had been known to the long-extinct Aaris as the Plaque of Victory, an inanimate sentient that fed off the life-force of organic beings. The Plaque sought to destroy those around it, but not directly. Instead, the Plaque manipulated the feelings of nearby individuals, causing them to become paranoid, irrational, and homicidal. The Plaque's influence on the Aaris civilization was responsible for the outbreak of the civil war that had led to their downfall."}, {"tag": "h3", "text": "Rising tensions"}, {"tag": "p", "text": "One day after the artifact was discovered, it began to spread its influence; members of the expedition began to report feeling watched from the jungle despite a lack of indication of intelligent life on the planet. A small squad of soldiers from the team's security detachment, under the command of their Lieutenant, ventured into the jungle to investigate. After an hour, weapons fire was heard in the distance; the remaining troopers immediately issued weapons to the science team, Deremot included. Although based at the secondary camp, Deremot returned to the primary camp complaining of feeling faint and fatigued. The soldiers did not return, and that night the expedition's base camp was attacked by the primitive descendants of the Aaris using blaster weapons. In the ensuing firefight, Doctor Theda was injured. An investigation into the attack the following day found that the bodies of several troopers who had entered the jungle the previous day were in the area that the camp had been attacked from. Brunou ordered that the planet was to be evacuated, as Tansad had been reported missing, and two technicians had been shot by sniper fire from the jungle."}, {"tag": "p", "text": "As night fell, Deremot was at the primary base camp with Brunou, Theda, two soldiers, and a technician. The other members of the expedition had been sent to pack up the secondary base camp, which was located closer to the team's shuttle. An explosion lit up the jungle as the shuttle was destroyed, prompting Deremot and the others to begin building a defensive position, digging into one of the mounds in the ruins and erecting barricades and fortifications. An E-Web heavy repeating blaster was mounted to the ramparts, and Brunou began to send a distress call to Moff Sarne's forces on Kal'Shebbol requesting extraction. The group held their position for a day until they were attacked again the following night; the soldiers and technician entered the jungle to engage their attackers while Deremot manned the E-Web, firing at anything that attempted to get close to the camp. While Brunou worried about whether or not the distress call had been received, Deremot suggested that Sarne had betrayed them."}, {"tag": "h3", "text": "Rescue"}, {"tag": "p", "text": "Brunou's distress call had been received, but not by Sarne. During the team's stay on Aaris III, Kal'Shebbol had been liberated by New Republic forces, forcing Sarne to flee into the depths of the Kathol sector with the remains of his military. The New Republic had commissioned the CR90 corvette FarStar to track him down, and the ship had intercepted the distress call. The vessel diverted to Aaris III on the orders of Captain Kaiya Adrimetrum, who had been advised by Lieutenant Jessa Dajus—a former Imperial Intelligence officer who previously served under Sarne—that the team on the planet may have held information regarding Sarne's connection with \"DarkStryder,\" a mysterious entity that he was in league with. Adrimetrum dispatched a team to the surface."}, {"tag": "p", "text": "On the planet, Deremot continued to keep watch with the E-Web while Brunou tended to Theda's wounds. As the New Republic delegation approached, Deremot was wary of the new arrivals, initially believing them to be in league with the hostile force that had been attacking them. Eventually, the crew members managed to convince Deremot that they were there to help, and the research assistant implored them to get her off the planet before nightfall. She openly told her rescuers about the mission and its objectives to the best of her knowledge, and mentioned the discovery of the chamber where the Plaque of Victory had been found, although she did not mention the artifact itself."}, {"tag": "p", "text": "Once aboard the FarStar, Deremot began to calm down, and members of the crew began lightly questioning her over the team's activities on the planet. She answered their questions but refused to return to the planet when she learned that Adrimetrum had authorized a mission to the surface to scavenge for parts and supplies and to replenish their fresh food and water. Deremot continued to feel like she was being watched and felt strangely drawn to the Plaque of Victory, which Brunou had brought aboard and kept about his person. She confronted Brunou over the Plaque; the doctor was obsessed with the artifact, and an argument over who should possess it turned into a physical confrontation witnessed by several members of the crew. However, the pair were not the only ones to be experiencing antagonistic feelings. Members of the FarStar's crew were also beginning to feel paranoid, and they reported similar feelings of being watched. Eventually, the crew began to realize that something was adversely affecting their behavior. Realizing that the artifact was responsible, since the bizarre feelings had only started after it had been brought aboard the vessel, the crew rationalized that to free themselves of the influence of the artifact they needed to put as much distance as possible between it and them. They managed to get the artifact away from Brunou and jettison it out of one of the corvette's airlocks. Once free of its influence, the personnel aboard the FarStar started to return to their normal behavior."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A timid young woman, Solla Deremot held no true loyalty toward Moff Sarne or to the Empire but worked for them since it was useful and suited her purposes. Deremot's main goal was to expand her knowledge, and she was more interested in her biological research work. Because of this, she felt her skills and talents were being wasted on the archaeological mission to Aaris III. She did not believe the Imperial propaganda about the Rebel Alliance and New Republic and would have just as easily supported either if they had allowed her to continue her studies and personal research."}, {"tag": "p", "text": "Under the influence of the Plaque of Victory, Deremot suffered from paranoia and feelings of being watched. These feelings made her initially distrustful of the New Republic rescue party, believing them to be hostile, and it took some convincing to make her believe that they were there to help her. Deremot was also drawn to the artifact and wished to possess it."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Although she was primarily a biologist, Deremot had training in first aid and medicine, and was able to operate communications, sensor, and security equipment. She was able to fly a space transport, and could drive repulsorlift vehicles. Deremot had an understanding of alien species and planetary systems, and could program droids. She was also able to use a blaster."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the Aaris III expedition, Deremot wore a blast helmet and vest, and carried a comlink, datapad, medpac, and a satchel containing scientific samples."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Solla Deremot was one of the characters introduced in Artifact of Aaris, a roleplaying game adventure in The DarkStryder Campaign, published by West End Games in 1995. Her fate is decided by the gamemaster; she may die during the course of the adventure if it serves the story, but if she lives, she is either invited to stay or volunteers to join the crew of the FarStar, where her scientific skills and practical talents—including medical skills—are put to good use. Her loyalty to the Empire, tenuous at best, is easily replaced by loyalty to the crew of the FarStar."}, {"tag": "p", "text": "Artifact of Aaris implies that, under the Plaque of Victory's direction the members of MS-133 turned upon each other resulting in multiple deaths and the destruction of the shuttle. However, The Complete Star Wars Encyclopedia, published in 2008 confirmed that the team came under attack from the remnants of the Aaris civilization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}