{"url": "Solo:_A_Star_Wars_Story_Adaptation_(TPB)", "categories": ["Category:Real-world articles", "Category:Solo: A Star Wars Story Adaptation", "Category:Comic film adaptation Canon trade paperbacks"], "nodes": [{"tag": "h1", "text": "Solo: A Star Wars Story Adaptation (TPB)"}, {"tag": "p", "text": "Solo: A Star Wars Story Adaptation is a canon trade paperback that collects the seven-part comic-book adaptation of the film Solo: A Star Wars Story from author Robbie Thompson. It was published by Marvel Comics on June 18, 2019."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Learn the full story of the galaxy's most lovable scoundrel in this adaptation of the blockbuster Star Wars prequel! After leaving the Imperial Navy, a young Han Solo seeks adventure by joining a gang of galactic mercenaries - and soon meets notorious gambler Lando Calrissian and a 196-year-old Wookiee named Chewbacca! Witness Han's first flight in the Millennium Falcon - and join him on the legendary Kessel Run! But can even the fastest ship in the galaxy help Han accomplish an impossible heist for ruthless gangster Dryden Vos? There's more to this story than you saw in any theater!"}, {"tag": "p", "text": "COLLECTING:STAR WARS: SOLO ADAPTATION 1-7"}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Chewbacca is described as being 196 years old in the publisher's summary of Solo: A Star Wars Story Adaptation. However, as Chewbacca was born in 200 BBY according to other sources such as Smuggler's Run: A Han Solo & Chewbacca Adventure, Star Wars: Card Trader, and Star Wars: The Force Awakens: The Visual Dictionary and the events of the comic take place in 10 BBY according to Solo: A Star Wars Story The Official Guide, Chewbacca should actually be 190 years old at the time. Solo: A Star Wars Story The Official Guide also states Chewbacca was 190 years old in 10 BBY."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Collected issues"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}