{"url": "Solo_family", "categories": ["Category:Canon articles", "Category:Incomplete lists", "Category:Force-sensitive bloodlines", "Category:Solo family"], "nodes": [{"tag": "h1", "text": "Solo family"}, {"tag": "p", "text": "The Solo family was the family of Han Solo, the human smuggler who was born on the Core World Corellia around 32 BBY, served as captain of the Millennium Falcon, and became a general in the Alliance to Restore the Republic during the Galactic Civil War. Despite Han's alleged descent from Corellian royalty, his father was a shipyard worker for the Corellian Engineering Corporation. He was taken in by the White Worms after his father abandoned him and died, and raised among the scrumrats of Coronet City."}, {"tag": "p", "text": "Han longed to leave his homeworld, the Core World Corellia, and pursue his dream of becoming the best pilot in the galaxy. He therefore enlisted as a cadet of the Imperial Navy. An Imperial Recruitment Officer, Chief Drawd Munbrin, gave Han the surname \"Solo\" as the young orphan lacked a family name of his own. It was later rumored that Han was the descendant of either Prince-Admiral Jonashe Solo or the Corellian pirate Dalla Suul."}, {"tag": "p", "text": "Failing to conform to military protocol, Han was transferred to the Imperial Army as a mudtrooper. During the campaign on planet Mimban, he deserted the army and befriended the Wookiee Chewbacca. They acquired the Millennium Falcon, a YT-1300 light freighter, from Landonis Balthazar Calrissian following their stint as members of Tobias Beckett's gang, and relocated to the Outer Rim world of Tatooine."}, {"tag": "p", "text": "In 0 BBY, Han was hired by Jedi Master Obi-Wan Kenobi and Luke Skywalker to transport them to Alderaan along with their cargo, the droids C-3PO and R2-D2. A chain of events, from the destruction of Alderaan and the rescue of Princess Leia Organa, to the Battle of Yavin and the destruction of the DS-1 Death Star Mobile Battle Station, led Han to join the Rebellion against the Galactic Empire. However, he failed to repay his debt to the Hutt crime lord Jabba Desilijic Tiure, and as a result a bounty was posted for Han's capture."}, {"tag": "p", "text": "In the aftermath of the Battle of Hoth in 3 ABY, Han was frozen in carbonite and taken to Jabba's Palace by the bounty hunter Boba Fett. Han was ultimately rescued by his friends and he returned to the Alliance in time for the Battle of Endor in 4 ABY. It was Han who led the strike team that destroyed the shield generator protecting the DS-2 Death Star II Mobile Battle Station, which allowed the Alliance Fleet to destroy the second Death Star."}, {"tag": "p", "text": "Han married Organa, who gave birth to their son, Ben Solo, as the war ended with the signing of the Galactic Concordance in 5 ABY. Ben was Force-sensitive, having inherited the raw strength of the Skywalker family bloodline through his mother, whose biological father was the Chosen One Anakin Skywalker. Luke, who was Organa's twin brother, trained Ben in the ways of the Force while Han ran his own shipping company and Organa returned to politics as a senator of the New Republic."}, {"tag": "p", "text": "The Solo family fell apart as a result of Ben turning to the dark side of the Force like his maternal grandfather before him. Ben slaughtered his uncle's students, thereby preventing the restoration of the Jedi Order, and joined the Knights of Ren as their master, \"Kylo Ren.\" Ren also rose to power in the First Order by virtue of his status as the apprentice of Supreme Leader Snoke."}, {"tag": "p", "text": "Ren's actions drove his parents apart, as they sought to cope with what happened to him in their own way. Han returned to smuggling while Organa created the Resistance to fight the First Order. In 34 ABY Han confronted Ren at Organa's behest. Despite Han's attempt at reconciliation, Ren killed his father believing it would strengthen his connection to the dark side. Although Ren went on to become the new Supreme Leader after assassinating his master, the act of patricide failed to end his inner conflict. Ultimately, Ben's memory of his father helped him to return to the light side of the Force, reclaiming his Jedi heritage and his legacy as a Solo. The Skywalker and Solo lines ended with Ben, who sacrificed his life to resurrect his counterpart, the Jedi apprentice Rey, during the Battle of Exegol in 35 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "A human native of the planet Corellia, Han was born around 32 BBY to an employee of the Corellian Engineering Corporation. Han's father, who built YT-1300 light freighters for a living, had aspirations to leave Corellia but could not afford his own starship. His relationship with his son was strained and distant; as a result of his death, Han became an orphan and was forced to work for the White Worms in order to survive."}, {"tag": "p", "text": "Like his father, Han yearned to escape his life on Corellia and eventually started a relationship with Qi'ra, who shared his desire to travel across the stars. Although they attempted to leave their homeworld together, Qi'ra was captured by the White Worms with the help of Imperial authorities. Determined to return for Qi'ra one day, Han enlisted in the Imperial Navy in order to leave Corellia and become a trained pilot. Han, who was born without a surname, was listed in the recruitment log as \"Han Solo\" by Chief Drawd Munbrin, the Imperial Recruitment Officer who approved his application to the Imperial Academy."}, {"tag": "p", "text": "During his time in the Navy, the name marked Solo as someone without a family to his fellow cadets. It also drew the ire of those such as 404-913, who believed that Solo was unfit to serve in the Galactic Empire because of his past. Despite his aspirations to be a pilot, he was forced to become an Imperial Army mudtrooper in the 224th Imperial Armored Division for failing to adhere to the Empire's code of uniformity."}, {"tag": "h3", "text": "From smuggler to rebel"}, {"tag": "p", "text": "Solo deserted the Imperial Military in 10 BBY and, at the same time, freed Chewbacca from slavery, an act which marked the beginning of a lifelong friendship between the Corellian pilot and Wookiee warrior. After winning the ownership of a YT-1300f light freighter, the Millennium Falcon from Lando Calrissian, Solo and Chewbacca made a living on Tatooine as smugglers employed by the Hutt crime lord Jabba Desilijic Tiure. In 0 BBY they became involved with the Alliance to Restore the Republic, with Solo expecting financial compensation for his part in the rescue of Princess Leia Organa of Alderaan. Despite his mercenary pursuits, Solo ensured the Alliance's survival by saving Luke Skywalker, the Rebel pilot who destroyed the DS-1 Death Star Mobile Battle Station in the Battle of Yavin."}, {"tag": "p", "text": "Solo gradually became a committed member of the Alliance all the while growing closer romantically to Organa. She implored him to stay with the Rebels, believing he was integral to the Rebellion's cause, but Solo was convinced that Organa's motives were due to her personal attachment to him. Despite Organa's insistence to the contrary and her claim about preferring men who were not scoundrels, the two shared a kiss in the Millennium Falcon and continued to to grow close in the aftermath of the Battle of Hoth. Organa confessed her love to Solo while they were prisoners of the Sith Lord Darth Vader and was determined to rescue him after Vader gave the smuggler to the bounty hunter Boba Fett."}, {"tag": "p", "text": "Solo returned to the Rebel Alliance as a general. He was chosen to lead the strike team that infiltrated Endor in preparation for the Alliance Fleet's attack on the DS-2 Death Star II Mobile Battle Station. Organa volunteered to join General Solo's team, which included their friends Chewbacca and Skywalker. During the Battle of Endor, Solo admitted that he loved Organa after she was injured in a firefight with stormtroopers. However, he also suspected that Organa was close to Skywalker, whom she once kissed in front of Solo when they were stationed on Hoth. Although Solo tried to be respectful, resolving to not interfere in their relationship, Organa revealed that Skywalker was in fact her secret brother."}, {"tag": "p", "text": "The marriage of Solo and Organa began shortly after the Rebel victory on Endor in 4 ABY. They both continued to support the Alliance, re-branded as the New Republic, in the final year of the Galactic Civil War. Organa began her Jedi training with Skywalker, now a Jedi Knight, while carrying the child that she and Han conceived on Endor. She chose to end her apprenticeship after experiencing a premonition of her son's death at the end of her path as a Jedi. Organa's pregnancy compelled her to spend the last remaining days of the war on Chandrilla, the first New Republic capital, where Solo insisted that she do nothing to strain herself. Their son, Ben Solo, was born in the aftermath of the Battle of Jakku in 5 ABY. His birth coincided with the sigining of the Galactic Concordance, a formal peace treaty between the New Republic and the Galactic Empire. Organa decided to retain her adopted family name while her son inherited his father's invented surname."}, {"tag": "h3", "text": "A house divided"}, {"tag": "p", "text": "Although Solo was not Force-sensitive, his son Ben inherited the Skywalker family's prodigious strength with the Force through Organa, who was the daughter of the Chosen One Anakin Skywalker. Fearing that Ben could potentially fall prey to the dark side of the Force like his maternal grandfather before him, Solo and Organa turned their son over to the Jedi Master Luke Skywalker, Organa's twin brother, in the hope that a Jedi lifestyle would prevent Ben from becoming the next Darth Vader. Throughout his young life, Ben felt the pressures of living up to his heritage as a Skywalker. The fact that his given name was inspired by the legendary Jedi Master Obi-Wan Kenobi only added to Ben's insecurity, as did the name \"Solo\" which he knew to be an invented surname."}, {"tag": "p", "text": "Skywalker trained Ben along with a dozen students in the ways of the Force, but grew increasingly concerned by Ben's potential for darkness. Sensing the dark future that awaited Ben, Skywalker initially moved to kill his nephew while he slept but could not follow through with the act."}, {"tag": "p", "text": "As a result of Skywalker's hesitation, Ben awoke to see his uncle's lightsaber drawn. Convinced that his uncle meant to murder him, the apprentice reacted by destroying his master's training temple along with half of the students while the rest sided with him. Skywalker survived the massacre, but lost his nephew to the dark side along with the new generation of Jedi. His plans ruined, Skywalker disappeared into exile while Ben adopted the persona of Kylo Ren—master of the Knights of Ren, warlord of the First Order, and apprentice of Supreme Leader Snoke."}, {"tag": "p", "text": "Han Solo's family fell apart, a lasting consequence of Ben's transformation into Kylo Ren. He was unable to face his wife, believing his presence would only serve as a painful reminder of the son they lost to Snoke. Solo coped with the loss by returning to his former profession as a smuggler while Organa organized the Resistance as a force of opposition against the rising power of the First Order. Their separation ended when circumstances brought them together once more on Takodana; in the wake of the Hosnian Cataclysm, Solo agreed to aid the Resistance in their effort to destroy the First Order's superweapon on Starkiller Base."}, {"tag": "p", "text": "Organa also implored him to take the opportunity to reason with Ben, hoping that the father could succeed where Ben's uncle and Jedi Master failed. Despite his own belief that Ben was too far gone to return to the light side of the Force, Solo confronted his son as Organa requested, attempting to reach the side of Kylo Ren that was still Ben Solo. Although Ren confessed to his inner struggle between darkness and light, the dark warrior struck his father down with a crossguard lightsaber, not out of hatred but desperation to end the conflict within him. However, this act of patricide failed to strengthen Ren's allegiance to the dark side, leaving him more conflicted than before. In the aftermath of Starkiller's destruction, the Resistance held a funeral service in honor of the late Han Solo."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Alleged ancestry"}, {"tag": "p", "text": "Han Solo's legacy inspired rumors about his origins. Although he did not have the surname \"Solo\" before enlisting in the Imperial Military, he was believed to be the descendant of Prince-Admiral Jonashe Solo—a member of the ancient Corellian royalty—by a Snivvian bounty hunter. It was also suggested by a Crimson Dawn enforcer that Han was the grandson of Dalla Suul, a Corellian pirate, and his alleged surname \"Suul\" was misheard by the recruiter."}, {"tag": "p", "text": "Ben Solo knew that his father was not born with the family name that he inherited from Han. Although the name \"Solo\" achieved a legendary status by the time of the New Republic, Ben considered it a lie. He hated bearing the famous names of legends and sought his own identity. Supreme Leader Snoke encouraged Ben to discard his old identity as it was the way of the dark side to adopt a new name that reflected one's true self. Ben eventually renamed himself \"Kylo Ren,\" but the fallen Jedi apprentice struggled to fully sever his ties to the past despite rejecting his family. He killed people who knew about his former life as a Solo, such as Padawan Voe, Lor San Tekka, and his own father. As Ren he recoiled at the mention of his old name; after returning the light, he regretted rejecting the name of Solo."}, {"tag": "h4", "text": "Haunted by patricide"}, {"tag": "p", "text": "Although Ren regarded his father as weak and foolish, as well as a lowly smuggler, Han Solo was remembered as one of the greatest heroes of the Rebellion and New Republic. Returning to his master in defeat, Ren was derided as a sentimental, failed apprentice by Snoke, who saw too much of the elder Solo's compassion in the fallen Jedi. Ren resolved to prove his worth by destroying the last of the Resistance, including his own mother, yet he could not bring himself to kill Organa during the First Order Navy's attack on the Resistance fleet."}, {"tag": "p", "text": "Meanwhile, the Force-bond between Ren and Rey, an aspiring Jedi who defeated Ren in the forest of Starkiller Base, began connecting their minds across the galaxy, allowing them to see, hear and touch in spite of the light-years between them. Rey confronted Ren about the latter's patricidal actions, unable to comprehend how a son could murder his own father. Although Ren did not hate Solo, he believed that the only way to achieve his full potential was by destroying every connection to his past, and he implored Rey to do the same. Ultimately, the two began to find common ground through their shared sense of loneliness and abandonment by their families."}, {"tag": "p", "text": "With Rey's help, Ren overthrew his master and claimed the mantle of Supreme Leader for himself. Rey had hoped to rekindle the light within Ren, but Ren was convinced that, as the grandson of Darth Vader, it was his destiny to rule over the weaker beings of the galaxy. He entreated Rey to join him, offering to share the galaxy with her as joint rulers of a new galactic order. Rey chose to help her friends instead, and Ren vowed to destroy her along with the Resistance, the last Jedi, and everyone who opposed him."}, {"tag": "p", "text": "In the ensuing battle on Crait, Ren confronted his uncle who told him that he would always be with his nephew, just as the memory of Solo continued to haunt Ren. After their confrontation, Ren and his stormtroopers marched on the Resistance base only to find that the survivors had eluded the First Order. While searching the base, Ren found Han Solo's dice—the same dice that he once played with as a toddler, inspired to become a pilot just like his father. By the end of the battle, Ren had become the new Supreme Leader, all but wiped out his mother's organization, and Luke Skywalker was dead. However, he had lost Rey in spite of their ongoing Force connection. For all that he had accomplished, Ren did not feel victorious."}, {"tag": "h4", "text": "The widow"}, {"tag": "p", "text": "Leia Organa remembered her late husband, and thought about him and their time together. She once regarded him as a scoundrel, a description that Solo embraced, but eventually saw him as a man who wanted freedom not only for himself but everyone throughout the galaxy. Organa recalled how Solo never wanted to know the odds of survival in a fight because, in his mind, he always decided that they were in his favor. The fact that he often prevailed against the odds baffled Organa."}, {"tag": "p", "text": "Ren was surprised when he did not sense anger and hatred from his mother in the wake of Solo's death. Instead he felt her concern for him. When Organa sensed that her son had reached a crisis point, she decided to sacrifice her own life in a final effort to bring him back to the light side. She reached out to Ren, calling to him by his birth name across the galaxy with all her remaining strength to let him know that she loved and forgave him. It was her dying wish that Ben would reject the dark side and reclaim his family legacy as a Solo."}, {"tag": "h4", "text": "The prodigal son"}, {"tag": "p", "text": "The act of patricide continued to haunt Ren despite his complete submission to the dark side of the Force. He could not stop himself from thinking about how he killed his own father. Rey sensed that Ren was still emotionally affected by Han Solo's death. Nevertheless, the reborn Dark Lord of the Sith Darth Sidious lured Ren to Exegol and offered to help him become the Galactic Emperor of a new Sith Empire if he destroyed the last of the Jedi by killing Rey. He also revealed the Final Order, a vast armada of Xyston-class Star Destroyers that would fall under Ren's command provided that he succeed in carying out Sidious' bidding."}, {"tag": "p", "text": "Ren hunted Rey across the galaxy by tracking her through the bond that bridged their minds, though not to kill her as Sidious demanded. Knowing the combined strength of their bond as a dyad in the Force, he resumed his efforts to convert Rey to the dark side of the Force. While Rey's abilities had grown under the guidance of Ren's mother, General Organa, her commitment to the Jedi path was undermined by the revelation of her origins as the Emperor's granddaughter. Determined to avenge her mother and father, who were killed on Sidious' orders, Rey dueled with Ren in the Death Star ruins for hindering her efforts to find Exegol. During their fight, Ren became distracted by his mother's death, which he sensed occurring through the Force. Rey, who also felt Organa die, confessed that it was Ben Solo whose hand she wanted to take, not Kylo Ren's."}, {"tag": "p", "text": "Shaken by his mother's demise, Ben suddenly found himself face-to-face with Han Solo, the father he murdered at Starkiller Base. Though he knew it was a hallucination, a memory of their last encounter, his effort to resist the pull to the light increasingly wavered. His mind re-imagined certain details, causing Ben to hear his father tell him that Kylo Ren was dead, and his son was Ben Solo once more. Once again, Ben felt that he knew what had to be done but was unsure if he was strong enough to see it through. Han reached out to touch the face of his son, reassuring Ben that he was strong, and that it was not too late to fight for his late mother's cause. In his defining moment Ben cast the lightsaber that he used to kill his father into the ocean, renouncing the dark side and parting with the name of Kylo Ren once and for all."}, {"tag": "p", "text": "Redeemed by his parents' and Rey's love, Ben returned to Exegol while the Sith Eternal battled with the Resistance and their allies. He stormed the Sith Citadel and gunned down the Sovereign Protectors in his way, but was confronted by the Knights of Ren before he could reach Rey and Sidious. Sensing Ben through their bond, Rey used their connection to give the Skywalker lightsaber to Ben, who then defeated his former servants with the legacy weapon that once belonged to his grandfather."}, {"tag": "p", "text": "By coming together, however, they presented Sidious with the means to restore his body by draining the life force of their bond. Seizing Ben through the Force, the Emperor attempted to destroy the last Skywalker by casting him down, as the Emperor himself was once cast down by Ben's ancestor. Ben survived his fall, but by the time he returned Rey had sacrificed her life destroying the Emperor. Ben embraces Rey's lifeless body, devastated by her death. He then decided to use his life force to resurrect Rey, but the effort took its toll on his own body. After she awoke, Ben and Rey smiled at each other, and the two shared a kiss before he vanished in Rey's arms as the last of both Solo and Skywalker bloodlines."}, {"tag": "h2", "text": "Family tree"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Solo family first appeared through Han Solo in the 1977 film Star Wars: Episode IV A New Hope. The 2018 Star Wars Anthology film Solo: A Star Wars Story revealed that Han was not born with the surname \"Solo.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}