{"url": "Solo-class_combat_freighter", "categories": ["Category:Legends articles", "Category:Freighter classes", "Category:Republic Engineering Corporation products", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "Solo-class combat freighter"}, {"tag": "p", "text": "The Solo-class combat freighter was a medium sized cargo ship manufactured by the Republic Engineering Corporation and SoroSuub, working in conjunction with the Fondor Shipyards under contract from the Metalsmiths Guild of Vandelhelm."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Solo-class was a sleek and aerodynamic freighter with a prominent keel. Drawing heavily on Republic design elements and philosophy - a time when both function and aesthetics were equally important - the Solo-class was an completely original design that was envisioned as a complete overhaul and reinvention of what a standard freighter should be."}, {"tag": "p", "text": "The resulting design was a ship that was large enough to carry the cargo of a half-dozen drone barges, yet powerful enough to hold its own as a fleet support ship. The Solo-class accomplished this through an interior architecture made with high-quality lightweight plasteel, and a double layered hull and reinforced keel consisting of super-hardened titanium plating - protecting the ship and its contents exemplarily well in the event of total shield failure."}, {"tag": "p", "text": "Protecting the freighter were six dual turbolasers, offering 360 degrees of coverage, and two missile batteries - all of which more than capable of getting the Solo-class through combat zones. Fully capable of atmospheric flight, thanks to its lightweight architecture and aerodynamic shape, the Solo-class could be bought stock, or with an additional compliment of droid maintenance crews."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Vandelhelm Metalsmiths Guild sponsored the creation of the craft about 10 years after the Battle of Endor. Guildmistress Lillindri Nanimei Filda Vandelhelm XXXII in honor of her rescue by Han Solo. Vandelhelm was selling them at a discount to the New Republic, her long-term ally."}, {"tag": "p", "text": "Solo and Nien Nunb were invited to the launch ceremony, a two-day long event in celebration of the finishing of the first run of the class. On the second day, as they prepared to launch a dozen of them, Solo, Nunb, Vandelhelm and her brother Endro, and the protocol droid body guard were left alone. The droid then went rogue, but Nunb blasted it, and Solo fought Endro, subduing him, and preventing his coup."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Solo-class combat freighter was described in the Vandelhelm: Enemies and Alloys part of Wizards of the Coast web series Planet Hoppers."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}