{"url": "Sollima%27s_accounting_droid", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:3D-4X administrative droids"], "nodes": [{"tag": "h1", "text": "Sollima's accounting droid"}, {"tag": "p", "text": "Sollima's accounting droid was a 3D-4X administrative droid that performed multiple duties for an Aleena crime lord Sollima. It contained valuable information about Sollima's operation, both legal and illegal, which could be used against him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 1 BBY Billal Batross using his position inside Sollima's gambling network to skim money from Aleena's accounts. Sollima's accounting droid found out about the fact and to cover his tracks Batross secretly sold the droid to the representatives of Galactic Empire. The Imperials were planning to use the information inside droid's data core against Sollima in order to gain access to his casino world named the Hollow Moon. However, despite stealing a sum of money from the crime lord, Batross still owed him a debt which he could not repay. In a desperate move he offered the Aleena to retrieve the droid, which Sollima believed to be stolen by the Empire, in exchange for his debt. He also asked Sollima to let him be joined by his old friend Han Solo, who also owed Sollima a debt he could not return; the crime lord agreed."}, {"tag": "p", "text": "Together, Solo and Batross successfully infiltrated the Moog Mot VI Imperial garrison. After finding the laboratory where the droid was being kept, Solo incapacitated the sole technician present there and ordered Batross to take the droid and leave as soon as possible. Batross however had other plans and shot the droid's data core with his blaster pistol to cover the fact that he was stealing form Sollima."}, {"tag": "p", "text": "The droid's remains were later returned to Sollima, containing a hidden bomb, which was detonated by Billal Batross to help the Empire establish control over the Hollow Moon."}, {"tag": "h2", "text": "Appearances"}]}