{"url": "Sollag_Den", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Males", "Category:Tammuz-an"], "nodes": [{"tag": "h1", "text": "Sollag Den"}, {"tag": "p", "text": "Sollag Den, also spelled Zolag, was an alien from Tammuz-an. He was a loyal servant to Prince Mon Julpa and played an integral part in helping Julpa maintain control of the throne."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Several years prior to the Battle of Yavin, Sollag discovered that Zatec-Cha, the royal vizier of Tammuz-an, had used his magic to turn Prince Mon Julpa into an addle-brained amnesiac. He banished him from the planet and took measures to claim the Tammuz-an Royal Scepter for himself."}, {"tag": "p", "text": "Sollag looked everywhere for his lost prince. His search eventually led him to the mining world Tyne's Horky where he learned that a bounty had been placed on Mon Julpa's head. IG-88, an assassin droid, had accepted the bounty and was en route to Tyne's Horky to kill Mon Julpa. Sollag entered Doodnik's Café and found a bounty hunter/criminal named Kleb Zellock. Caring little for Zellock's unscrupulous nature, he offered him 40,000 keshels to find Mon Julpa before IG-88. Kleb, willing to do just about anything for such an exorbitant fee, quickly accepted the offer."}, {"tag": "p", "text": "Kleb later turned on Sollag, deciding that a royal prince of Tammuz-an could likely fetch a much larger price than a mere 40,000 keshels. Sollag was devastated at the betrayal. He soon learned that Kleb had indeed captured Mon Julpa and put him to work, laboring in his keschel mines. Sollag sneaked into Zellock's mines and helped rescue Mon Julpa, as well as several other slaves, namely Jann Tosh, C-3PO and R2-D2. Upon finding his prince, Sollag presented him with the Tammuza-an Royal Scepter. Contact with the scepter cured Julpa of Zatec-Cha's magic and he regained control of his faculties. After escaping from Kleb Zellock's mining camp, they returned to Tammuz-an, where they helped to overthrow Zatec-Cha and reinstate Mon Julpa as the rightful ruler of the planet."}, {"tag": "p", "text": "Sollag continued to serve as an advisor to Mon Julpa during the Battle of Tammuz-an. He later aided with the negotiations with Lord Toda, ruler of the Outer Territories on Tammuz-an. Although he verbally sparred with Toda in defense of his king, the two cooperated in the rescue of Toda's daughter, Princess Gerin, when she was kidnapped during an escape attempt by the pirate Gir Kybo Ren-Cha."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sollag's size and build were typical of that of a native of Tammuz-an. He had a purple complexion with a large mane of red hair. While traveling the Outer Rim, Sollag dressed in simple attire, but while he was on Tammuz-an, he wore the traditional, high-collared robes befitting one of his station."}, {"tag": "p", "text": "To all accounts, Sollag came across as a sniveling and weak-willed person, but he was fiercely loyal to Prince Mon Julpa and would go to great extremes to secure the prince's safety. Sollag was a kind-hearted individual and showed immense gratitude towards Jann Tosh, C-3PO, and R2-D2 for aiding him in rescuing the prince."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character was voiced by John Stocker."}, {"tag": "p", "text": "The English subtitles on the Star Wars Animated Adventures: Droids DVD spell Sollag's name as \"Zolag.\" Original production art and the Jann Tosh entry at the Databank spell his name as \"Sollag.\" Considering that both versions come from canonical Lucasfilm sources, it can be safely assumed that \"Zolag\" is just an in-universe variant spelling of \"Sollag.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}