{"url": "Son%27s_cathedral", "categories": ["Category:Canon articles", "Category:Incomplete lists", "Category:Mortis locations"], "nodes": [{"tag": "h1", "text": "Son's cathedral"}, {"tag": "p", "text": "On the ethereal realm of Mortis in Wild Space, the Son's cathedral acted as the personal residence of the Force wielder known as the Son, who was the child of the Father and the brother of the Daughter. During the Clone War, the family lived on Mortis as anchorites, as their power had been too much for the temporal realm."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The Cathedral was created by the Son as his personal fortress and residence. Made of a light-absorbing black rock, the base of the tower was circular and resembled the rib cage of a giant beast. The summit of the tower was crowned by a glowing green orb, while inside, cells and oubliettes were located at the end of maze-like hallways. Smaller towers were located around the central tower of the Cathedral, with a courtyard connecting them all. The Son maintained a throne room at the midway point of the central tower."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After passing a test to prove he was the Chosen One, the Jedi Knight Anakin Skywalker refused to stay behind on Mortis and take the place of the Father, who was dying, in keeping the balance in the Force on the planet. The Son, seeking a way off Mortis and desiring to wreak havoc on the galaxy, kidnapped Skywalker's Padawan, Ahsoka Tano, and brought her to his tower. There, he posed as a prison creature and dampened the Togruta's spirits, making her susceptible to his bite of the dark side of the Force, consuming and poisoning Tano's mind."}, {"tag": "p", "text": "In the meantime, the Jedi Master Obi-Wan Kenobi and the Daughter visited the Altar of Mortis and retrieved the Mortis Dagger, seeking to use it to kill the Son and stop him. When they arrived at the Son's cathedral, Kenobi attempted to aid Skywalker, who was dueling with a corrupted Tano. In the cathedral, the Son fought against his sister, using Force lightning and his gargoyle form in an attempt to overpower her. Before he could, however, the Father entered the Son's tower and overpowered both his children, before the Son regained the upper hand and weakened the Father."}, {"tag": "p", "text": "Before Kenobi could give the dagger to Skywalker to use against the Son, a corrupted Tano swiped the weapon and successfully gave it to the Son. With her usefulness outdone, the Son killed Tano, before attempting to use the dagger to kill the Father in his cathedral's courtyard. The Daughter intervened, however, and was killed instead. Distraught at his sister's death, who had been the only individual the Son truly loved, the Son fled from his cathedral in a rage. The Daughter gave her remaining life force to revive the fallen Ahsoka Tano, as the Father implored the Jedi to leave Mortis, which had become unbalanced with the Daughter's death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Son's cathedral first appeared in season three of the Star Wars: The Clone Wars television series. Its design pays homage to the black tower of Orthanc from the film The Lord of the Rings: The Two Towers, which resembled the staff of the wizard Saruman in the film. Incidentally, Saruman was portrayed by Christopher Lee, who also portrayed Count Dooku in the Star Wars film franchise, which inspired The Clone Wars supervising director Dave Filoni to pay homage to the actor's role."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}