{"url": "Sotorus_Ramda", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Humans", "Category:Imperial Army generals of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sotorus Ramda"}, {"tag": "p", "text": "Sotorus Ramda was a male human general from Rine-cathe 111 in service of the Galactic Empire. He commanded the Scarif Deployment during the Battle of Scarif. He was relaxed in his duties as commander of the Imperial garrison on Scarif. This lax attitude, however, would cost Ramda dearly as it allowed a small team of rebels to infiltrate the complex in an attempt to steal the plans for the Death Star, resulting in not only the first battle of the Galactic Civil War but Ramda's own death when the security complex was destroyed by the Death Star's superlaser in an attempt to stop the theft of the plans."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "General Sotorus Ramda commanded the Scarif Deployment garrisoned at the Imperial security complex on Scarif in 0 BBY, and was known to be relaxed in his duties there. The base was regarded as a place for long-serving officers to wait out the years until their retirement; with the Shield Gate considered to be an impenetrable defense, the garrison on the planet itself seemed almost ancillary. As a result of this lax leadership, Ramda was completely unprepared for the consequences of his hubris."}, {"tag": "p", "text": "In the days prior to the Battle of Yavin, Ramda received Director Orson Krennic, who traveled to Scarif to investigate any and all transmissions sent by the now deceased Imperial scientist Galen Erso, who was the source of information of the Death Star that was leaked and found its way to the Rebel Alliance. Ramda obeyed, though he voiced his surprise at the magnitude of the order, as there was an abundance of transmissions that had been sent by Erso."}, {"tag": "p", "text": "Not long after Krennic arrived on Scarif, Alliance special forces infiltrated the Shield Gate space station that guarded the planet, and landed on the surface, launching a surprise attack on the Imperial complex in a bid to steal the Death Star plans, and were later reinforced by an Alliance Fleet led by Admiral Raddus. The Imperial security complex would eventually be destroyed in the final stages of the battle by the Death Star itself, as Grand Moff Wilhuff Tarkin order the battle station to fire upon Scarif in order to prevent the theft of the plans, and to eliminate his rival Krennic who sought to command the Death Star himself, killing Ramda in the process. Although the Alliance sustained heavy casualties, they were able to transmit the Death Star plans to the Alliance flagship Profundity, and the plans were then by transported to the docked Tantive IV which escaped the battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ramda was played by Richard Cunningham in the 2016 Star Wars anthology film Rogue One: A Star Wars Story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}