{"url": "Sothais_Saar", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Chevs", "Category:Jedi Knights of the New Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Sothais Saar"}, {"tag": "p", "text": "Sothais Saar was a male Chev serving as a Jedi Knight in the New Jedi Order. He conducted a report on slavery in the galaxy following the Second Galactic Civil War, shortly before falling prey to a psychosis caused by the dark side entity Abeloth. Saar was apprehended and placed inside the Jedi Temple for study. In 44 ABY, Luke Skywalker successfully completed a mission to defeat Abeloth, instantly terminating Saar's psychosis."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sothais Saar was a male Chev who served the New Jedi Order as a Jedi Knight. Following the Second Galactic Civil War, he pursued an ongoing investigation on the continuing practices of slavery within the territories controlled by the Galactic Alliance and without. Saar reported to the Jedi High Council his belief that the Order was not doing its best to curtail the slave trade, especially in Hutt Space. To conclude his report, Saar recommended to the Council his full report, titled An Inquiry on Surviving Slavery Practices in the Aftermath of the Second Galactic Civil War, which was available in the Temple Archives. Interim Grand Master Kenth Hamner dismissed Saar after the report, allowing the Knight to report to the office of Galactic Alliance Chief of State Natasi Daala's aide Wynn Dorvan at the Senate Building."}, {"tag": "h3", "text": "Force psychosis"}, {"tag": "p", "text": "Once arriving at Dorvan's apartment, Saar began to restate what he had just spoke of to the High Council in hopes of garnering support from Chief Daala. Midway through the meeting, Dorvan had to excuse himself so that he could report to Daala's office for a brief meeting and returned shortly after to find a sleeping Saar. When Dorvan awakened the Jedi, Saar suddenly believed that Dorvan had been replaced by an impostor. Not wanting to alert the man that he knew of the deception, however, Saar simply remained quiet as they walked out to the main entrance to the building. Dorvan then realized that Saar had contracted the same enigmatic madness seen in other Jedi and quickly alerted Coruscant Security as Saar fled the Senate Building."}, {"tag": "p", "text": "Fleeing across the broad Senate Plaza, Saar attempted to escape into the under-levels to avoid what he though were impostors, but he was stopped short upon encountering Jedi Master and healer Cilghal. As he neared her, however, he found that she too had been replaced by an impostor. Recognizing Saar's condition, Cilghal was forced to incapacitate him in a brief duel. Rushing Saar back to the Temple, Cilghal checked him into the Temple infirmary and began studying him. With the assistance of Twi'lek healer Shul Vaal, Cilghal mended the wounds she had inflicted upon him. In her report, she noted that he showed no enhanced Force abilities, something that had been noted in the other infected Jedi, only the paranoia and hostility that had been common in all of them. While Jedi Knight Jaina Solo prepared to move Saar offworld to the Jedi academy in the Transitory Mists, the Jedi Temple civilian hangars were attacked by Mandalorians under the orders of Chief Daala. While Saar was not affected by the attack, he could not be moved offworld."}, {"tag": "p", "text": "When Daala appointed Han and Leia Solo as Alliance liaisons to the Order, she sent a request to Grand Master Hamner to turn over Saar. Hamner agreed on the terms that Saar would not be placed into carbonite as had Valin and Jysella Horn and would be able to be studied by the Order's healers. However, this exchange never took place."}, {"tag": "h3", "text": "Recovery"}, {"tag": "p", "text": "Later, when Luke Skywalker and his Sith allies defeated the dark side being Abeloth, who had been causing the psychosis, Saar's psychosis was immediately terminated. Cilghal entered his cell in the Jedi Temple Detention Center and he revealed that he was embarrassed about his actions and that—although he'd known the symptoms and had known what to watch out for, when the psychosis had struck it had still made sense to his mind at the time."}, {"tag": "p", "text": "Saar and fellow Jedi Turi Altamik were brought out to the front steps of the Jedi Temple, where her Daala's chosen doctor, Thalleus Tharn, inspected them. When Tharn declared the two Jedi to be cured, Daala lifted the Mandalorian siege of the Temple. However, she refused to release Valin and Jysella Horn from Galactic Alliance custody."}, {"tag": "p", "text": "Shortly thereafter, Saar was sent by the Jedi Council to Blaudu Sextus alongside Avinoam Arelis to help mediate the Octusi slave revolt. When the two Knights arrived, they found the Mandalorians massacring the Octusi at Arari and intervened. During the engagement, Saar and Arelis breached a building where reporter Madhi Vaandt and her crew had been hiding and relaying live images of the Mandalorian slaughter. While Saar was too late to save Vaandt from being killed, he was able to disable and detain her murderer, the Mandalorian commander Belok Rhal."}, {"tag": "p", "text": "Saar was later selected to be one of four Jedi assigned to Klatooine in order to guarantee the Galactic Alliance's and the Jedi Order's support for the Klatooinian uprising against the Hutts and the planets entry into the Galactic Alliance. He flew a trainer X-wing to the planet, with Raharra Lapti, a Klatooinian Jedi Youngling riding in the second seat. After landing on the planet, Saar joined Jedi Master Kyp Durron, Jedi apprentice Bandy Geffer, and Lapti in following Jedi Knight Leia Organa Solo, who had been helping with the negotiations of a peace settlement, to a formal ceremony to celebrate the arrival of the Jedi team and Klatooine's entry into the Galactic Alliance."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Saar was tall for a Chev, and he wore his black hair short, browning at the tips. He often sported stylish dark robes which contrasted with the more traditional garments preferred by most Jedi. A Jedi Knight possessive of a strong character and focused mind, Sothais Saar was known for his convictions, his drive to eliminate slavery, and his extremely dull personality. While highly versed in the subject matter that he studied, his reports bored even the Jedi Masters of the High Council."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}