{"url": "Soterios", "categories": ["Category:Legends articles", "Category:Desert planets", "Category:Tapani sector planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Soterios"}, {"tag": "p", "text": "Soterios was a dry planet in Tapani sector's Melantha Province. Most of the world was scoured by windswept canyons and vast expanses of wastelands. There were few settlements and the indigenous flora and fauna had been driven to extinction by species introduced from elsewhere in the galaxy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Soterios was an ash-colored planet in a tight orbit around a single star. It was a terrestrial world with a breathable atmosphere and a hot, arid climate. Most of the planet's surface was taken up by dry land dominated by vast desert wastelands and windswept canyons, with the remainder consisting of salty, shallow seas. In spite of a slight ammonia content, these seas supported a variety of unusual species."}, {"tag": "p", "text": "Soterios's economy was mostly based off-planet. House Melantha governed the world and generated income from companies based in the Core Worlds. In this capacity, Soterios put up credits in the form of loans and generated revenue on interest. Soterios also attracted some out-of-sector companies with attractive profit-sharing plans and cheap leasing on desert land."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Soterios's cities, including its capital of Melaana, were located in canyon basins that were the remnants of oceans. These were connected by dry riverbed canyons used as a highway system for landspeeders and airspeeders. The numerous loops and dead ends in this system made it nearly impossible for an off-worlder to navigate it without a guide. The topography was suitable for several speeder road rallies held annually. The cities had thriving theater districts, music halls, museums, and other cultural attractions. Soterios had an active professional sports circuit that was popular with House Melantha nobility and commoners alike."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Soterios had a population of 6.7 billion, including Humans and many other species from the Core Worlds. The planet's culture was also largely assimilated from the Core, especially Coruscant. The social scene was dominated by HoloNet media, which was viewed by natives as a source of information, a voice for the people, and an educational tool."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}