{"url": "SoroSuub_Corporation/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic organizations", "Category:Arms manufacturing companies", "Category:Commerce Guild corporations", "Category:Confederacy of Independent Systems organizations", "Category:Conglomerates", "Category:Corporate Sector Authority contributing sponsors", "Category:Galactic Republic organizations", "Category:Imperial organizations", "Category:New Republic organizations", "Category:Shipwrights", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "SoroSuub Corporation"}, {"tag": "p", "text": "The SoroSuub (sometimes also rendered as Soro Suub) Corporation was a massive Sullustan corporation that specialized in mineral processing, but due to it's ancient and wide success, it also became an industrial giant that produced a vast array of technological goods, even including the capability to produce larger ships like the Dauntless-class heavy cruiser, after their many years producing the highest quality Luxury Yachts, such as the Personal Luxury Yacht 3000 and Peregrine-class Star Yacht."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The main activity of the SoroSuub Corporation was mineral processing. However, the company had numerous divisions and subdivisions that handled everything from energy mining to food packaging. The technology divisions developed and produced weapons, droids, communication devices, vehicles, and starships."}, {"tag": "p", "text": "Based on Sullust, SoroSuub employed about half the population of the planet, and ninety percent of Sullust's workforce. The company was led by a Chief Executive Officer."}, {"tag": "p", "text": "Potential employees were trained at the SoroSuub Business Academy, on the planet Sullust, before being allowed into the company."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Old Republic era"}, {"tag": "p", "text": "The SoroSuub Corporation was a staggeringly ancient company. It existed as long as Sullustans had interstellar travel, dating it at over 5500 years old by the fall of the Empire, which is the year recorded for when Sullust first connected to the Rimma Trade Route and subsequently joined the Republic. SoroSuub had always have a great part in Sullust's economy and government and its power increased during the Old Republic era, with a particular role in the planet's diplomacy."}, {"tag": "p", "text": "By the time of the Invasion of Naboo, SoroSuub had a strong presence in the Cularin system. Their security was lax enough so that Dark Jedi Karae Nalvas stole one ship prototype from their facilities; but an independent party returned it during the Festival of 31 BBY. During that same party, SoroSuub's representative Miim Te'Suub annual speech was disturbed by an overimposed logo of another business organization, the Metatheran Cartel. Disgruntled, Te'Suub held a heated debate with Cartel's representative Thurm Loogg, with the mediation of diplomats and Jedi consuls. Later, after some independent pilots avoided a disaster in Tolea Biqua, SoroSuub gifted one of them with the Sivulliq, a SoroSuub RK-720 Light Freighter."}, {"tag": "p", "text": "During the last days of the Galactic Republic, SoroSuub strongly dominated and influenced the Commerce Guild, which later supported the Confederacy of Independent Systems. Beolars Bribbs was CEO at that time, as well as President of the Sullustan Council. During the Clone Wars, SoroSuub had ostensibly more power than the Sullustan Council. When Sullust eventually joined the Confederacy of Independent Systems, the Republic responded invading the planet in 21 BBY. The SoroSuub Corporation was forced to replace its CEO Beolars Bribbs with Siin Suub, a Republic supporter."}, {"tag": "h3", "text": "Imperial period"}, {"tag": "p", "text": "During the early days of the Galactic Civil War, SoroSuub allied itself with the Galactic Empire to protect its holdings, in spite of the the protests of the population."}, {"tag": "p", "text": "In the years following the reorganization of the Corporate Sector and the creation of the Corporate Sector Authority, the SoroSuub Corporation managed to become a contributing sponsor of the Authority. Contributing sponsors invested less than voting sponsors and were not guaranteed a voting position on the CSA Executive Directorship Board but the return of investment was so huge that numerous majors companies tried to enter the Authority."}, {"tag": "p", "text": "SoroSuub eventually took control of Sullust planetary government. In 2 BBY, Siin Suub promulgated the Corporate Proclamation 137d, which disbanded the Sullustan Council. The company became a strong supporter of the Empire, leading to an increase of Rebel sympathizers among the population. SoroSuub soon created the Sullustan Home Guard, initially to protect the company's and Imperial interests in the system, but later to fight Sian Tevv's Sullustan Resistance."}, {"tag": "p", "text": "In 0 ABY, Sian Tevv became SoroSuub's CEO but was forced to keep secret his Rebel allegiance. Due to Sullustan objections, the Alliance, aided by Nien Nunb, staged a coup of the company. SoroSuub eventually sided with the Rebel Alliance, providing Dauntless Cruisers to the Alliance, and later restored the Sullustan Council. SoroSuub remained a major producer well into the New Republic era."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}