{"url": "South_Anem_Spaceport", "categories": ["Category:Legends articles", "Category:Nyemari locations", "Category:Spaceports"], "nodes": [{"tag": "h1", "text": "South Anem Spaceport"}, {"tag": "p", "text": "The South Anem Spaceport was a docking facility for starships located on the edge of Anem, the capital of the planet of Nyemari. The Nyemarian mechanic Li Preni allowed the Millennium Falcon and its owner, Han Solo to dock there while Solo and his companions undertook a mission to the Nyemari Royal Palace for the Rebel Alliance. When they returned, Preni lied and told the Rebels he had not told anything to a Glymphid, but recanted when Solo's companion Chewbacca threatened him. The Rebels then set off to corner the Glymphid, who produced a hologram for Luke Skywalker before dying from a time-released poison."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The South Anem Spaceport was a docking facility for starships; it was located kilometers from the Nyemari capital city, Anem, where the city edged onto desert. The facility was little more than a large warehouse, and by 1 ABY none of the equipment and fixtures had been repaired in three decades. Only spacers, smugglers, and other unsavory types bothered to go there."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 1 ABY, the smuggling vessel Millennium Falcon owned by Han Solo docked at the Spaceport. He had used up a favor owed to him by the Nyemarian mechanic Li Preni, who had worked there for years. Solo and his companions were on Nyemari on a mission for the Rebel Alliance; they planned on infiltrating the Nyemari Royal Palace to steal the Duchess' access codes to the Imperial Military Installation on the planet. The Rebels secured the codes but had to flee through Anem, chased by Royal guards. After losing their pursuers, the Rebels returned to the Spaceport."}, {"tag": "p", "text": "When the Rebels arrived, they met Preni, who was surprised to see them back. Preni told them he had met a Glymphid offering a bounty to find the Rebels. Preni lied and said he did not know the Rebels; Solo's partner Chewbacca threatened the Nyemarian with a growl. Preni then recanted and stated he told the Glymphid the Rebels were in town. Thinking the Glymphid was another bounty hunter, Solo convinced his companions to find the Glymphid. When the Rebels cornered the alien in an Anem plaza, the Glymphid produced a hologram to give to Luke Skywalker from Rezi Soresh. Soresh threatened to kill a shipful of hostages if Skywalker did not present himself to Soresh. As a demonstration, Soresh had the Glymphid killed using some sort of time-released poison. Skywalker knew he had to go to Soresh's outpost, and his companions agreed to join him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The South Anem Spaceport appears in Alex Wheeler's 2010 book Rebel Force: Uprising."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}