{"url": "Soul_Tree", "categories": ["Category:Legends articles", "Category:Plants of Endor", "Category:Sacred Ewok items", "Category:Trees"], "nodes": [{"tag": "h1", "text": "Soul Tree"}, {"tag": "p", "text": "A Soul Tree was a sacred tree planted in the forest of the moon of Endor at the time of an Ewok's birth. The Ewok was thought to be spiritually connected to the tree, meaning that the condition of the tree hinted at the health or character of the Ewok to which it was bound. Upon the Ewok's death, his or her hood was attached to the Soul Tree's trunk, and the Ewok's spirit was thought to take up residence in the totem tree. At least one Ewok spirit is known to have stayed with its Soul Tree after death, protecting it from harm, that of Erpham Warrick."}, {"tag": "p", "text": "Due to their connection to the ancients, the Soul Trees as a whole were thought to be a source of power for Ewok shamans. These holy Ewoks often tried to make contact with the ancestors and to draw upon their power through the medium of the Soul Trees. Shamans could be very secretive about these rituals."}, {"tag": "p", "text": "Unfortunately, the enemies of Ewoks are well aware of the strategic value destroying the soul trees to deeply traumatize the species and make them easily conquerable. To that end to defeat the Ewoks of Bright Tree Village, Morag the Tulgah witch tried to destroy their Soul Trees by burning them with enslaved Wisties. The plan was thwarted when Wicket Wystri Warrick and his friends doused the trees in magical foam. . The second major chronicled attempt was when the Duloks captured Erpham Warrick's Ewok battle wagon rebuilt by Wicket to ram down the soul trees. The young Ewok again thwarted this attempt by collapsing the wagon before it could cause significant damage."}, {"tag": "p", "text": "Kaink was the guardian of Bright Tree Village's Soul Trees."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Soul Trees were created by Joe Johnston for his book The Adventures of Teebo: A Tale of Magic and Suspense. They weren't identified by name until the debut of Ewoks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}