{"url": "Soulcalibur_IV", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:2008 computer and video games", "Category:Non-canon computer and video games"], "nodes": [{"tag": "h1", "text": "Soulcalibur IV"}, {"tag": "p", "text": "Soulcalibur IV is a fighting game by Namco. This installment is unique to the series, as Namco and LucasArts came to an agreement to include Darth Vader (exclusive to PlayStation 3) and Yoda (Xbox 360) as playable fighters. Galen Marek, the secret apprentice of Darth Vader from The Force Unleashed, was also made an unlockable character under the name \"The Apprentice\" in both console versions; however, his endings are different in the two versions; the PS3 version is longer and features Darth Vader."}, {"tag": "p", "text": "On October 23rd, 2008 Yoda and Vader were both made downloadable content for the systems they were not natively on. Vader costing 400 MS points and Yoda costing $4.99. These changes allowed Vader to be in the second to last battle of Yoda's story mode, and Yoda in Vader's. It also extended the ending of The Apprentice's story mode on the 360 version to that of the PS3 version."}, {"tag": "p", "text": "An Infinities comic titled Star Wars: Visions of the Blade was later published on StarWars.com to provide a possible explanation as to how Darth Vader, Yoda, and The Apprentice (named Starkiller in the comic) ended up in the Soulcalibur IV universe."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "Players control one of many selectable characters at a time to battle others. Modes featured include standard Story, Arcade, and Training modes, as well as a create-a-character feature and the new Tower of Lost Souls mode, which offers players the chance to participate in special battles to gain rewards."}, {"tag": "p", "text": "Unique to the Star Wars characters are Force abilities. Each of the three characters has a special Force Meter, which drains and recharges based on the players' use of Force attacks, as well as different sets of abilities from the others. Darth Vader has been given Force push and choke; Yoda uses the Force to propel himself higher into the air than most characters to unleash more complex aerial combos; and The Apprentice utilizes various dark side attacks, such as Force lightning."}, {"tag": "p", "text": "One game level is Star Wars-themed and is called Star Destroyer Docking Bay; it displays a space loading platform. A Lambda-class T-4a shuttle is landed near the fighters. A Death Star can be seen in the background as well as a Star Destroyer and TIE Fighters flying in what seems to be a supposed space battle."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Since its release, reviews of SoulCalibur IV have been mostly positive."}, {"tag": "p", "text": "Certain criticisms were aimed towards the addition of the several aspects of the Star Wars franchise, some commenting on their 'unnatural' presence and that Yoda and The Apprentice were \"broken\" and \"absurd,\" respectively. Players were also disappointed that unlike the other characters in the game, whose outfits could be completely customized, the Star Wars characters were limited to one outfit that came with an alternate color scheme if two players picked the same character. In addition, while all the regular Soul Calibur characters had a variety of unique and visually distinct weapons to choose from, all of the Star Wars characters' weapons were identical lightsabers with different particle effects."}, {"tag": "p", "text": "The online multiplayer mode, on both platforms, has also been subject to criticism. Poor network programming causes the auto-match feature to assign players to already full rooms or on-going matches, resulting in errors. Some say the best way around the error is to hold matches of their own and wait for an opponent to come along manually, which usually takes no more than a minute.[source?]"}, {"tag": "p", "text": "A small amount of controversy resulted when it was revealed that the system-exclusive characters were not actually \"exclusive\": Both versions of the game shipped with the code for both Vader and Yoda on the discs, and the hidden character could be accessed by hacking the game. The file that is downloaded when a player pays for the other platform's character is actually just an \"unlock key\" which activates the code which they already possessed."}, {"tag": "h2", "text": "Notes"}, {"tag": "h2", "text": "Star Wars Character Images"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}