{"url": "Sound_slug", "categories": ["Category:Legends articles", "Category:Data storage mediums", "Category:Music"], "nodes": [{"tag": "h1", "text": "Sound slug"}, {"tag": "p", "text": "Sound slugs were data storage units storing musical recordings. The capacity of memory cells and the efficiency of data compression techniques meant that a single slug the size of a blaster power pack could contain the entire catalog of even the most prolific artist, with spare capacity filled with holovids, reviews of the music, interviews with band members, song lyrics, song remixes, technical analyses of the sound profiles, and more. These different file types were stored in standardized formats, meaning the contents of a sound slug were readable on conventional computer systems, datapads, holovid machines, and audio stacks. The cases containing them often featured decorative art, and ninety percent of sound slugs used writing in the High Galactic alphabet on their covers, an example of that alphabet's dominance in galactic marketing."}, {"tag": "p", "text": "Not all sound slugs held content beyond music, which meant a single slug had sufficient space to hold the entire music collection of its owner. The owner could expand their collection by buying a single musical track, typically for one to three credits, or purchase a compilation of tracks such as an album at a discounted price, typically six to ten credits. A shop selling these tracks could download them onto a sound slug in a matter of seconds each."}, {"tag": "p", "text": "As digital sound slugs grew in popularity, the ease with which they allowed the storage, selling, and trading of individual songs facilitated the exchange of popular music styles between worlds, a phenomenon officially charted by news periodicals like Holonet News."}, {"tag": "p", "text": "The infamous killer Kardue'sai'Malloc was an avid music collector, and when captured by the bounty hunter Boba Fett, he made Fett promise to retrieve his priceless collection of sound slugs and music chips and turn them over to the director of the Coruscant University School of Music, saving the work of hundreds of musicians who had been killed during the purges of the New Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}