{"url": "Southern_Jedi_Ruins", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Mustafar locations"], "nodes": [{"tag": "h1", "text": "Southern Jedi Ruins"}, {"tag": "p", "text": "The Southern Jedi Ruins were the ruins of a Jedi Enclave located on the planet Mustafar within the region known as the Smoking Forest. The enclave was originally run by the Jedi Order in some capacity, but was abandoned sometime prior to the Seventh Battle of Ruusan during the New Sith Wars. The Dark Jedi Vulta Daanat eventually found the abandoned temple after being forced to leave the Brotherhood of Darkness due to having different philosophies on the Force from the organization's leader, Skere Kaan. Having traveled the galaxy searching for Force-related artifacts, he settled down in the ruins and made them into the headquarters of his own Force-using organization, the Blackguard, becoming their first leader, a role titled Kursk."}, {"tag": "p", "text": "By 1 ABY the Blackguard were still using the ruins as their headquarters, rarely leaving them except to recruit or search for further Force artifacts. The group's leader at the time, Kursk San'sii, had begun recruiting non-Force-sensitive members into the Blackguard due to dwindling numbers, and these made up the bulk of the forces within the ruins. At this time a Sullustan archaeologist named Mi Fon Lu became interested in studying the ruins, but feared he would be attacked by the Blackguard inhabitants, and so hired several spacers to clear out the occupants. The spacers successfully killed all of the Blackguard within the ruins including San'sii and one of his strongest followers, Vansk, in what became known as the Blackguard purge. With the ruins clear, the Sullustan was able to move in and begin his research."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Southern Jedi Ruins first appeared in the MMORPG Star Wars Galaxies as part of the Trials of Obi-Wan expansion released in 2005. In the expansion it was a location on the newly added planet of Mustafar, which was home to the new Blackguard faction of enemies. Players took part in a chain of quests in which they were tasked with killing various Blackguard enemies within the ruins."}, {"tag": "p", "text": "The Jedi ruins were later mentioned in the Wizards of the Coast Saga Edition Roleplaying game supplement book the Jedi Academy Training Manual, released in 2009, where they were referenced as the home of the Blackguard in a section detailing alternate Force traditions."}, {"tag": "p", "text": "Star Wars Galaxies was shut down on December 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}