{"url": "Sovereign-class_Super_Star_Destroyer", "categories": ["Category:Legends articles", "Category:Galactic Empire starship classes", "Category:Interdictor starship classes", "Category:Sovereign-class Super Star Destroyers", "Category:Super Star Destroyer variants"], "nodes": [{"tag": "h1", "text": "Sovereign-class Super Star Destroyer"}, {"tag": "p", "text": "The Sovereign-class Super Star Destroyer, alternatively named the Sovereign-class Star Destroyer, was a planned class of Super Star Destroyer produced by the Galactic Empire at the behest of the Galactic Emperor Palpatine, who envisioned a fleet of the fifteen-thousand-meter-long vessels."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Super Star Destroyer variant measuring fifteen thousand meters long, the Sovereign-class was classified as a dreadnaught under the Anaxes War College system. The Sovereign-class hosted a crew of 601,670, with 4,075 gunners, and required a skeleton crew of at least 86,000. During development, it was estimated to require a crew of 600,000. It could carry up to 400,000 metric tons of cargo and hosted a complement of 35 TIE/IN interceptor squadrons, five TIE/sa bomber squadrons, and 75 All Terrain Armored Transports."}, {"tag": "p", "text": "A Sovereign-class Super Star Destroyer carried five years' worth of consumables and could carry 130,100 troops. Like the larger Eclipse-class Super Star Destroyer, the Sovereign-class featured an axial superlaser on par with the Death Star. The axial superlaser was also the reason why the ship's helm was designed to be 15,000 meters, as the size allowed for the minimum space required to house the generators powering the superlaser. It also hosted five hundred heavy laser cannons—200 to the front and 150 to the left and right—which each required two gunners, and five hundred turbolaser batteries—150 front, 100 to the rear, and 125 each on the left and right."}, {"tag": "p", "text": "In addition, the Sovereign-class possessed seventy-five ion cannons split equally between the front and sides, and 100 tractor beam emplacements, wth 55 to the front, 5 to the rear, and 20 each to the left and right. Five gravity well projectors rounded out the vessel's armament."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Along with the Eclipse-class, the Sovereign-class was still under development around 0 BBY, with both ships intended to strengthen the Imperial Navy into the next century. Information on both classes was included in the Imperial Handbook, an aide memoire for Imperial officers. Despite this, the Rebel Alliance was unaware of the existence of either class until they captured a copy of the Imperial Handbook just after the Battle of Endor, and General Carlist Rieekan believed that the Empire had not made progress on either Super Star Destroyer design."}, {"tag": "p", "text": "Since they were slightly smaller than the Eclipse-class, the Empire anticipated that the Sovereign-class would come into service first. Despite this, the first of the ships, the Sovereign, was still under construction at the shipyards of Byss by the time of Operation Shadow Hand, and the Reborn Emperor Palpatine launched his offensive aboard the lead ship of the Eclipse-class. Other planned ships in the class included the Autarch, the Despot, and the Heresiarch."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}