{"url": "Space_Battle_in_the_Kessel_Asteroid_Field", "categories": ["Category:Legends articles", "Category:Battles of the Fresian campaign", "Category:Battles of Kessel"], "nodes": [{"tag": "h1", "text": "Space Battle in the Kessel Asteroid Field"}, {"tag": "p", "text": "The Space Battle in the Kessel Asteroid Field was a rescue operation during the Galactic Civil War."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the Battle of Fresia, in which the Rebel Alliance extracted four X-wing starfighter prototypes from an Imperial depot on Fresia, the Galactic Empire retaliated by taking a number of Incom scientists hostage. The Imperial convoy transporting the hostages passed through The Maw and prepared to land on Kessel to deliver the scientists to the infamous prisons."}, {"tag": "p", "text": "The Rebel Alliance quickly learned of this. Led by Captain Raymus Antilles, the Alliance Fleet sent a task force to Kessel consisting of a number of Y-wings and the Sundered Heart. The bombers would prove invaluable during the operation to disable the Imperial Shuttles carrying the scientists, thus preventing them from descending into the planet's atmosphere."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "The Rebels ambushed the Imperial Navy in a narrow corridor through an asteroid field. While the corvettes and starfighters engaged the Imperial ships in combat, the Sundered Heart and a team of Y-wings disabled the shuttles."}, {"tag": "p", "text": "The Y-wings opened fire with their ion cannons, disabling the first transports. Moving quickly, the Sundered Heart docked with the shuttles. A small commando team boarded the shuttles and rescued the scientists. However, the Empire was determined to not allow the scientists to fall into Rebel hands, going so far as attempting to destroy the shuttles before they could be boarded. A call for reinforcements was issued by the Imperial commander, and two Victory-class Star Destroyers were detected entering the system."}, {"tag": "p", "text": "As the last shuttle was boarded, the Imperial reinforcements finally arrived in the system and began to overwhelm the small Rebel force. With not a moment to lose, the Rebels cleared the asteroid field and jumped to lightspeed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The freed Incom scientists would later prove to be invaluable to the Alliance. Their schematics allowed the Rebellion to launch the production of X-wings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle was the fourth mission of the Rebel campaign in the 2006 video game Star Wars: Empire at War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}