{"url": "Space_Battle_at_Yavin_4", "categories": ["Category:Legends articles", "Category:Battles of the Yavin blockade", "Category:Battles of Yavin", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Space Battle at Yavin 4"}, {"tag": "p", "text": "The Space Battle at Yavin 4 was an armed search mission organized by crime lord Tyber Zann in the wreckage of the first Death Star."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 0 ABY, Crime lord Tyber Zann heard of a rumor involving Emperor Palpatine's personal vaults which contained vast amounts of credits. While he knew nothing of the locations, Zann believed that the answer could be found in the remains of the Death Star which the Rebels had destroyed at Yavin."}, {"tag": "p", "text": "He believed that someone on the Death Star had followed standard procedures and ejected some data pods before the destruction of the battlestation, and ordered his Zann Consortium forces to make a pass around Yavin 4."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Consortium force encountered a Rebel patrol in orbit which they quickly destroyed. They then found the first data pod which contained top secret information about discussions between the Grand Moffs, which was of no use to Zann."}, {"tag": "p", "text": "The flotilla then discovered an Acclamator-class assault ship which was guarded by four Tartan-class patrol cruisers, however the Tartan cruisers abandoned the Acclamator and defected to the Consortium. The Acclamator's Captain protested, but his ship was subsequently destroyed."}, {"tag": "p", "text": "The Consortium then found another data pod which contained the designs for a brand new warship being constructed at Kuat. This warship was the Eclipse-class dreadnought known as Eclipse."}, {"tag": "p", "text": "After dealing with another Rebel confrontation and destroying several missile satellites, Tyber found another data pod. This contained the designs for a new warship called the Aggressor-class Star Destroyer. Zann still believed that at least one data pod could be found."}, {"tag": "p", "text": "Tyber's forces had to fight off not just another Rebel group, but also multiple pirate units as well, such as Rihkxyrk assault fighters and a Barloz-class medium freighter. These had found the data pod before him, but Tyber Zann managed to steal it just as four Star Destroyers arrived."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The fourth data pod contained the exact information that Zann was looking for, and he found that the locations of the vaults could be accessed from inside the Eclipse; He then moved to the next step of building his criminal empire, and eventually the Consortium constructed an Aggressor-class destroyer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The raid appears in the 2006 video game Star Wars: Empire at War: Forces of Corruption. It appears in the Consortium Campaign."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}