{"url": "Baron/Legends", "categories": ["Category:Legends articles", "Category:Titles of nobility"], "nodes": [{"tag": "h1", "text": "Baron"}, {"tag": "p", "text": "Baron or Baroness was a title of nobility. Chairman Notluwiski Papanoida of the moon of Pantora held the title of Baron, as did Senator Rush Clovis of Scipio."}, {"tag": "p", "text": "The head of the House of Tagge was a Baron. Sanya Tagge served as Baroness of the House during the Separatist Crisis and the beginning of the Clone Wars. She was succeeded in 20 BBY by her eldest son, Orman Tagge, until he died in 0 ABY and was replaced by his youngest brother, Ulric Tagge. In the case of the Tagges, the title of Baron was signified through a belt denoting title, which passed from Orman to his brother Ulric. The latter had no qualms about wearing the belt, adding it to his Imperial officer's uniform."}, {"tag": "p", "text": "In the time of the Galactic Empire, the title of Baron could be awarded to dedicated servants of the New Order. Ragez D'Asta, Soontir Fel and Merillion Tarko were all Barons in this way. The title of Baron of the Empire was granted to Fel by Emperor Palpatine himself."}, {"tag": "p", "text": "Mara Jade also claimed to be a Baroness while operating under the aliases of \"Paltonae\" and \"Muehling\"."}, {"tag": "h2", "text": "Barons of the Tapani Sector"}, {"tag": "p", "text": "Baron was one of the titles of nobility used by the ruling class in the Tapani sector. It was higher than the rank of Knight, but below that of a Lord. Barons generally came from a Noble House's \"better\" families, those with long histories and held in some measure of esteem. The title of Baron was inherited; as a result, no commoner could be raised to the title of Baron even if they had previously been raised to the position of Knight. However, a Knight's children could become Barons if they were also raised to the nobility."}, {"tag": "p", "text": "Barons were often found in control of House assets, such as important facilities like manufacturing plants and armories. Barons maintained a manor on the lands they controlled, as well as a home on the planet Procopia to use in capital season."}, {"tag": "h2", "text": "Known Barons and Baronesses"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}