{"url": "Spaceport_(Ataria_Island)", "categories": ["Category:Legends articles", "Category:Spaceports", "Category:Spira locations"], "nodes": [{"tag": "h1", "text": "Spaceport  (Ataria Island)"}, {"tag": "p", "text": "The spaceport on Ataria Island on the planet of Spira was the only spaceport authorized to receive passenger liners."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ataria Island's spaceport was a beautifully decorated installation, and was the only spaceport on the planet of Spira that was authorized to receive passenger liners. Unlike many of the galaxy's spaceports, it was not a drear mass of fuel-stained concrete and steel structures. The landing pads of Ataria Island's spaceport were coated in red marble, which were coated and super-sealed. Each landing cradle was surrounded by planters full of exotic plant life, which were protected from the downblasts and winds generated by passenger liners by invisible force fields."}, {"tag": "p", "text": "The main passenger terminal was as luxurious as the landing fields, with comfort and class being the primary concern. Arcing white walls dominated the structure, inlaid with mosaics of underwater scenes. A tropical theme pervaded the building, with fountains and potted palms on display, and ceiling fans throughout the facility. During the Spira Regatta, banners proclaiming the event were on display."}, {"tag": "p", "text": "A small compound off to the side of the spaceport housed the space vessels assigned to the Imperial contingent on the planet. While less impressive looking than the spaceport itself, it did contain gleaming TIE/LN starfighters, Skipray Blastboats, and shuttles."}, {"tag": "p", "text": "Customs was staffed by members of the Spira Security Police, and customs inspections were generally brief as long as no-one attempted to smuggle proscribed items through the checkpoint. Thousands of droids serviced the spaceport, maintaining the starships and landing cradles, and working as baggage attendants."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The spaceport was the only one on Spira authorized to received passenger liners. During the Galactic Civil War, the passenger liner Madallo landed on the planet just prior to the 345th annual Spira Regatta Open. A team of Rebel agents booked passage aboard the Madallo to infiltrate the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}