{"url": "Space%E2%80%93time-warping_gate", "categories": ["Category:Legends articles", "Category:Exotic technology", "Category:Force-sensitive objects"], "nodes": [{"tag": "h1", "text": "Space–time-warping gate"}, {"tag": "p", "text": "The space-time-warping gate was an energy field that protected the opening to an unidentified monolith. It was only able to be manipulated through the Force, requiring an individual to be Force-sensitive to enter the monolith."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 45 ABY, the Columi brothers, Craitheus and Marvid Qreph discovered the monolith and the space-time-warping gate that protected it. They built a Base Prime base above the gate to better study it. The Qrephs determined that only a Force user could access it, and they hired the mercenary Savara Raine to help them get past the gate. Raine was frightened of the monolith's power, but she agreed to enter it to test its powers. The Mandalorian Barduun came with Raine as backup, but he was unprepared for what he found there. Upon their return, Barduun had been driven insane and Raine refused to talk about what had happened beyond the gate. However, despite his insanity, Barduun had been granted access to the Force. The Qrephs were intrigued by this development, wishing to obtain Force abilities for themselves, but they delayed accessing the gate again until they could better understand why Barduun had lost his mind."}, {"tag": "p", "text": "However, the Qrephs experiments drew the attention of the Jedi, and they assaulted Base Prime, moving up the timetable to access the monolith. Raine refused to open the gate for the Qreph brothers, but they had thought ahead and made a biot of the Force-sensitive woman. Their biot, Savara Two, was able to open the gate for them, and they passed into the monolith. A short time later, the Jedi Leia Organa Solo and Luke Skywalker accessed the gate in pursuit of the Qrephs. After defeating the Qrephs and their clones, they returned through the gate to exit the monolith."}, {"tag": "h2", "text": "Appearances"}]}