{"url": "Sparks_(short_story)", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "Sparks  (short story)"}, {"tag": "p", "text": "\"Sparks\" is a short story in the anthology From a Certain Point of View. The story was written by Paul S. Kemp, and focuses on Dex Tiree and Gold Squadron."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Rebel Alliance starfighter pilot Dex Tiree sits in his bunk, contemplating the arrival of the Death Star in the lead-up to the Battle of Yavin. He reflects on the many lives obliterated by the Death Star on Alderaan. Despite the odds stacked against the Rebellion, Dex resolves not to run. Dex is aware of rumors among the flight crews that Princess Leia Organa had returned with some kind of secret intelligence about the Empire. Still, Dex thinks that the battle with the Death Star would come down to a test of flesh and metal."}, {"tag": "p", "text": "While reflecting on the upcoming showdown, Dex recalls his mother's saying that \"small sparks can start big fires\". Dex is stirred out of his day-dreaming by his R5 unit Sparks, whom he had first encountered on Corellia. Dex tells Sparks that he has not seen his parents and his sister on Onderon for years. He regales Sparks with the story of the fire that the droid had started on Utapau's moon. Dex tells the droid that they will be fine on their run and that they will hit what they can. As a rebel, Dex internalizes himself as a spark that will start the big fire."}, {"tag": "p", "text": "At that point, the station's comlink announces that the Death Star has entered the Yavin system. Dex and the other rebel pilots attend General Jan Dodonna's briefing. As they enter the flight deck, Dex encounters his fellow pilot Davish Krail, who asks if he is going to be a hero today. Dex and Sparks board their BTL Y-wing starfighter and fly with the rest of Gold Squadron towards the Death Star. After consulting with Davish, Dex joins his fellow pilots in attacking the Death Star's turbolasers. Dex manages to take out a turbolaser."}, {"tag": "p", "text": "Gold Leader then warns the squadron that they have fighters incoming. Dex and Davish are directed to accompany Gold Leader during their attack on the Death Star trench. The three Y-wings dive into the trench. With TIE fighters in pursuit, Gold Leader tells the pilots to raise their rear deflector shields at full. During the run, Dex's starfighter is hit by a laser bolt from a TIE fighter, causing the ship to lurch and explode. Sparks squeals before he is destroyed. In his final moments, Dex reflects on his mom, his dad, and his sister's giggle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}