{"url": "Specter_Squadron_(Rebel_Alliance)/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Specter Squadron  (Rebel Alliance)"}, {"tag": "p", "text": "Specter Squadron was a Rebel Y-wing starfighter squadron that fought against the Galactic Empire during the Galactic Civil War. Specter Squadron was stationed at Renforra Base during the time that it was led by Jon \"Dutch\" Vander before he was reassigned to Gold Squadron on Yavin 4."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Specter Squadron's BTL Y-wing starfighters were paint gray with white stripes and featured enhanced laser targeting computers. Although the squadron's Y-wings were modest in maneuverability and shield strength, they were able to deliver among the highest-rated armaments with greater accuracy than most other starfighter squadrons were capable of. In contrast to the red color of standard maneuvering jets, some of Specter Squadron's Y-wing exhaust flames were green."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Before leading Gold Squadron during the Battle of Yavin, Rebel pilot Jon Vander—nicknamed \"Dutch\"—led Renforran-based Specter Squadron against the Galactic Empire. Even after being transferred to Yavin 4, Vander preferred flying BTL Y-wings and flew Specter 1—renamed Gold 1—for Gold Squadron. Showing his affinity for his former squadron, Vander proudly wore the Specter emblem on his helmet—a yellow-eyed spectral black shape emerging from a gray cloud. Support Services pilot Grizz Frix also displayed the Specter Squadron emblem on his helmet when flying Red Five with Red Squadron in 4 ABY. Dutch was killed during against the Empire's Death Star during the Battle of Yavin. Frix died while engaging an Imperial Star Destroyer at point blank range during the Battle of Endor."}, {"tag": "h2", "text": "Notable members"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Star Wars Customizable Card Game featured both Dutch and Gold 1 with information concerning Specter Squadron. The flavor text on the Dutch card indicates that the black shape with the yellow eye emerging from a gray cloud shape is the emblem of Specter Squadron. This emblem is unique to Dutch at the time of the Battle of Yavin, while other symbols on his helmet are used by other pilots not associated with his former squadron—including Jek Porkins and Tiree. In Star Wars: Episode VI Return of the Jedi, the Specter emblem is visible on Grizz Frix's helmet, indicating his membership of Specter Squadron at some point."}, {"tag": "p", "text": "Specter Squadron was represented by a miniature in the initial release of the Star Wars PocketModel TCG."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}