{"url": "Spectral", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Interdictor-class Star Destroyers", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Spectral"}, {"tag": "p", "text": "The Spectral was an Interdictor-class Star Destroyer that was in service to the Galactic Empire during its reign of the galaxy. It was commanded by Admiral Ektol Traz. At some point, it crashed onto the starship graveyard on the planet Jakku after suffering damage from rebel pilot Lieutenant Bak Rychuk."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Spectral left the Imperial Drydock at Kuat's Drive Yards and was sent to Fondor's Shipyards. There, it provided cover for the star destroyers attempting to flee before the New Republic fleet arrived. The Spectral fought the New Republic's Shepherd Squadron until Admiral Rae Sloane ordered remaining Star Destroyers to Jakku. However, the Spectral's commander, Admiral Ektol Traz continued the battle and deployed his fighters."}, {"tag": "p", "text": "As Shepherd Squadron closed in to attack, Admiral Traz ordered the Spectral to jump to hyperspace. Unbeknowst to the Spectral's crew, Shepherd Two, Lt. Bak Rychuk was dragged into hyperspace with the Spectral. Admiral Traz was informed of this and attempted to open fire on Rychuk's Y-wing to no avail. The Spectral arrived at Jakku and tractored Rychuk's Y-wing into it's hangar. Unfortunately, Rychuk's Y-wing had breached the Spectral's focusing dome and forced to power down the Spectral."}, {"tag": "p", "text": "As Rychuk was confronted by the Spectral's stormtroopers, Zeetoo-Zeetoo was ordered to overload the Spectral's reactor coil or shut down it's life support. Zeetoo, instead, activated the Spectral's starboard maneuvering thrusters and pushed it out of Jakku's orbit. As the Spectral's orbit decayed, it's engine ignitors became unresponsive and the Spectral was falling fast. When the Rebel fleet arrived, Admiral Traz ordered all hands to abandon ship. As he made his way to his command shuttle, Traz's security droid, K-8Z8, held him back and told him he could not abandon ship. Traz named K-8Z8 as the Spectral's captain and made his way to an escape pod with Rychuk. Only K-8Z8 and Zeetoo were left aboard as the Spectral crash-landed on Jakku and was buried in the sand."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}