{"url": "Speciesism", "categories": ["Category:Legends articles", "Category:Society and culture"], "nodes": [{"tag": "h1", "text": "Speciesism"}, {"tag": "p", "text": "Speciesism, also known as xenocentrism and racism, was a belief that one species was inherently superior to another or all other species. Similarly, it manifested itself in xenophobia, an overwhelming fear of and hate against other species, regardless of circumstance."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Speciesism was found in cultures across the galaxy for various reasons, ranging from religious beliefs to a sense of biological superiority possessed by individuals or groups; indeed, the practice could range from single individuals to an entire species. Some species, like the Gran and the Givin, were mildly xenophobic, but strove to overcome this trait in order to work with different beings. Others, like the Hutts and the Chiss, considered themselves inherently superior, but still often managed to work alongside other species. Some believed Zabraks to be speciesist due to their extreme amount of determination and willpower, although this was not true. The Dug were also xenophobic, due to their experience with being mistreated by the Gran, the first off-worlders they ever encountered. Still others, like the Ssi-ruuk, the Yevetha, and the Yuuzhan Vong, considered all other species to be abominations."}, {"tag": "p", "text": "An especially prevalent type of speciesism was Humanocentrism. A notable Human speciesist was Count Dooku, who considered all non-pure Human lifeforms to be disgusting and inferior, yet he reserved a measure of respect towards the Geonosian Poggle the Lesser. In response to such sentiments, aliens sometimes formed anti-Human sentiments. Although the Galactic Emperor Palpatine himself was not speciesist, he nonetheless encouraged its use in the Empire implicitly due to viewing it as making his control over the Galaxy much easier. It was thanks to speciesism that Palpatine managed to appeal to Wilhuff Tarkin early on his career, given Tarkin's Humanocentrism tendencies."}, {"tag": "p", "text": "Indeed, at its height, the Galactic Empire was notable for its many speciesist policies and attitudes to certain worlds with Non-Human populations. On planets such as Eriadu, the homeworld of the Tarkin family, the Empire legitimized the enslavement of non-Humans. By the time of the reign of Emperor Roan Fel, however, such policies had ended, as evidenced by the presence of non-Human stormtroopers."}, {"tag": "p", "text": "Although the Empire was very notorious for its speciesist views, there were at least some traces of speciesism within the Alliance to Restore the Republic, such as Princess Leia Organa's referring to the Wookiee Chewbacca as \"a walking carpet\" during her rescue from the Death Star."}, {"tag": "p", "text": "In contrast, speciesism was a foreign concept to the Ebruchi, since they lacked roots and rejected mythology."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In The Secret Journal of Doctor Demagol, Demagol uses the word \"racist.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}