{"url": "Special_Unit_One", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Imperial starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Special Unit One"}, {"tag": "p", "text": "Special Unit One was an elite TIE fighter squadron that served in the Galactic Empire's Imperial Starfighter Corps during the Imperial Era. Commanded by Senior Lieutenant Yve, the unit was based on Commodore Thrawn's Imperial I-class Star Destroyer Chimaera. Shortly before a battle over the planet Botajef, Thrawn deployed Special Unit One alongside a number of TIEs to create a formation around the Star Destroyer."}, {"tag": "p", "text": "When the battle erupted, the unit broke off from the formation on Yve's orders and flew towards the Botajef governor's palace, where the pilots proceeded to destroy its turbolasers. After the battle ended in an Imperial victory, Special Unit One returned to the defensive perimeter around the Chimaera, where the unit was put on alert for further potential combat."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An elite squadron in the Galactic Empire's Imperial Starfighter Corps, Special Unit One consisted of six TIE fighters. The unit operated from Chiss Commodore Thrawn's Imperial I-class Star Destroyer Chimaera."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Imperial Era, the six pilots of Special Unit One received training from Senior Lieutenant Yve. At some point later, Special Unit One was aboard the Chimaera when the Star Destroyer arrived over the Outer Rim planet of Botajef. Upon arriving, two CR90 corvettes belonging to the Botajef Defense Force attempted to flank the Chimaera along with several V-19 Torrent starfighters. Commodore Thrawn ordered Senior Lieutenant Yve to deploy their complement of TIEs and have them perform close flybys around the corvettes, while another group of TIEs, which included Special Unit One, was to form a defensive perimeter around the Star Destroyer. When the TIEs were deployed, their pilots held fire on Thrawn's orders and awaited further instructions while the Chiss contacted Botajef's governor, Quesl, and demanded that he obey a treaty signed by the Jefies, Botajef's native species."}, {"tag": "p", "text": "Quesl, who was attempting to steal artwork and flee the planet aboard one of the corvettes, refused and prepared to attack the Chimaera, causing Thrawn to signal Yve, who then ordered Special Unit One to engage. The unit proceeded to break off from its defensive perimeter and penetrate through the formation of V-19s, making its way to Botajef's capital city. Upon arriving at the capital, the fighters came under fire from turbolaser emplacements on the governor's palace. However, the unit skillfully evaded the blasts and reached the palace, where the pilots then destroyed the turbolasers without losing a single fighter. Eventually, the battle ended in an Imperial victory, and the governor's corvette was captured and brought aboard the Chimaera. On Yve's orders, Special Unit One returned to the defensive perimeter with the other TIE fighters and remained alert in case of additional combat, per instructions from Thrawn."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Special Unit One featured six TIE fighter pilots. These pilots were under the direct command of Yve, a Starfighter Commander who had also trained them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Special Unit One appeared in Timothy Zahn's 2017 novel Thrawn, the first instalment of the Star Wars: Thrawn trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}