{"url": "Special_Operations_Brigade/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Galactic Republic intelligence organizations", "Category:Galactic Republic Special Forces units", "Category:Grand Army of the Republic brigades"], "nodes": [{"tag": "h1", "text": "Special Operations Brigade"}, {"tag": "p", "text": "The Special Operations Brigade (SO BDE) was the special operations division of the Grand Army of the Republic, made up of clone commandos, clone assassins, Advanced Recon Commandos, and clone shadow troopers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As the Clone Wars began, the Jedi Order formed the Special Operations Brigade to complete independent, specialized operations for the Galactic Senate, Supreme Chancellor Palpatine, and the Jedi High Council. Stationed with Arca Company Barracks, the Special Ops Brigade was led by Jedi General Iri Camas and later Jedi General Arligan Zey. When General Zey took command, the brigade consisted of 10,000 troops.[source?]"}, {"tag": "p", "text": "It was later reorganized as the Imperial Commando Special Unit."}, {"tag": "h2", "text": "Command structure"}, {"tag": "p", "text": "The Special Operations Brigades were commanded by Jedi General Arligan Zey. It consisted of ten Commando Groups, or battalions, by one year after the Battle of Geonosis."}, {"tag": "h2", "text": "Notable units"}, {"tag": "h2", "text": "Special ops variants"}, {"tag": "p", "text": "One notable exception was the Covert Ops clone troopers. They were elite clones of the GAR assigned to doing 'dirty work' that most clones would find questionable and unethical for the Republic. The Director of Special Forces ignored the existence of those clones for a long time and they were supposed to take orders from the Office of the Supreme Chancellor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}