{"url": "Baroosh_Pawk", "categories": ["Category:Canon articles", "Category:Cloud-Riders members", "Category:Humanoids", "Category:Males"], "nodes": [{"tag": "h1", "text": "Baroosh Pawk"}, {"tag": "p", "text": "Baroosh Pawk was a male member of the Cloud-Riders during the reign of the Galactic Empire. He hailed from a world that was brutalized by criminal syndicates and joined the Cloud-Riders, a group of pirates led by Enfys Nest whose own worlds had suffered the same. In 10 BBY, the Cloud-Riders learned of a shipment of the valuable hyperfuel coaxium that Tobias Beckett planned to steal for Crimson Dawn off an imperial 20-T Railcrawler conveyex transport on Vandor. Seeking to take the prize for themselves and use it to fuel an uprising against the Empire and criminals that terrorized the galaxy, the raiders attacked Beckett's team and the train aboard their signature swoop bikes. During the confrontation, Pawk boarded the Y-45 armored transport hauler piloted by Rio Durant and fatally shot Durant in the back. However, in the course of their fight, Durant shot and killed Pawk. The two groups of thieves continued to fight, and ultimately the coaxium was destroyed, forcing the Cloud-Riders to withdraw, leaving their deceased comrade behind."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Joining the Cloud-Riders"}, {"tag": "p", "text": "Baroosh Pawk was a male individual who was a member of Enfys Nest's Cloud-Riders. He came from a world that was brutalized by a collection of criminal syndicates that included Crimson Dawn known as the Five syndicates. The atrocities committed by the syndicates to his home world eventually led him to join the Cloud-Riders, a group of marauders whose own worlds had suffered similarly at the hands of the Five syndicates. Pawk and his fellow Cloud-Riders sought to resist the tyranny of the Galactic Empire and the criminal syndicates that were in league with them. While part of the pirate gang, Pawk led a nomadic lifestyle, travelling throughout the galaxy in a carrier ship called the Aerie. It was from the Aerie that the group launched raids to plunder cargo and valuables that they used to fund resistance against the criminal syndicates and Empire. On these raids, Pawk partnered with the swoop pilot Tayshin Maxa and would jump from their swoop onto the vehicles targeted by the Cloud-Riders."}, {"tag": "h3", "text": "Train heist and death"}, {"tag": "p", "text": "In 10 BBY, the Cloud-Riders caught wind of Imperial plans to transport a vulnerable shipment of the hyperfuel coaxium across the frontier world of Vandor and hoped to take the coaxium for themselves to fund uprising against the criminal gangs that tyrannized peaceful planets. Flying their signature swoop bikes, Pawk and the Cloud-Riders descended upon the Imperial 20-T Railcrawler conveyex transport ICC-5537 that carried the shipment across the Iridium Mountains to Crispin Imperial Depository. As they approached the train they found that a rival gang of thieves working for Crimson Dawn led by Tobias Beckett beat them to their mark."}, {"tag": "p", "text": "Undeterred by the competition, the marauders moved forward with their plan and exchanged fire with the other gang. Riding in the sidecar of a Caelli-Merced Halberd-441 swoop bike piloted by his partner Tayshin Maxa, Pawk leapt aboard a Y-45 armored transport hauler piloted by Rio Durant. As he approached the ship's cockpit, Durant took notice of the commotion and shot at him. Pawk returned fire and fatally wounded Durant in the shoulder and back. However in the midst of their clash, Durant managed to shoot Pawk as well, killing him."}, {"tag": "p", "text": "While Pawk was boarding the transport hauler, the Cloud-Riders fired grappling hooks onto the transport car carrying the coaxium. The opposing gang of criminals had lifted the car with the Y-45 armored transport hauler, and it hung between the two groups as they attempted to escape. When the transport car drew dangerously close to a mountain, the new pilot of the hauler, Han Solo, released the car to avoid a collision, forcing the Cloud-Riders to do the same and leaving their prize to tumble into the mountainside. To escape the ensuing explosion, the Cloud-Riders were then forced to withdraw from the planet empty-handed, leaving behind the deceased Pawk, whose body was still aboard the other gang's ship."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a member of the Cloud-Riders, Pawk served as a climber and skydiver. He had more daring than brains, leaping onto target vessels during raids from the sidecar of the swoop he shared with Tayshin Maxa in while in midair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Pawk wore a traditional Ubese tracking helmet crested with buphasian feathers to hide his identity, which he rarely removed. The sleeves of his jacket were decorated with narglatch teeth, and he wore a transponder on his lapel, used to signal his fellow Cloud-Riders for pickup. He carried a tibanna-jacked DH-17 blaster pistol equipped with a vibrobayonet. Pawk typically paired with the pilot Tayshin Maxa during missions, riding in the sidecar of a Caelli-Merced Halberd-441 swoop bike. Their swoop was heavily customized and decorated with special painted designs and flags."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Baroosh Pawk first appeared in the 2018 film Solo: A Star Wars Story, and was first identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo. He was portrayed in the film by an uncredited stuntman. According to costume designer Glyn Dillon, Pawk's mask was another iteration of the other Cloud Rider mask designed by Tonči Zonjić, wearing a horse hair headdress, noting too that the 1980s British band Sigue Sigue Sputnik were a big influence on Pawk's look."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}