{"url": "Spectacles", "categories": ["Category:Legends articles", "Category:Eyewear"], "nodes": [{"tag": "h1", "text": "Spectacles"}, {"tag": "p", "text": "Spectacles, also called  eyeglasses or simply glasses, were a primitive way of augmenting one's sight, consisting of two small discs made of visually corrective lenses which were placed in front of one's eyes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Spectacles were rare, as advanced surgery and cybernetic implants were more efficient in many ways. Yet a few individuals used spectacles. Noa Briqualon, who was stranded on Endor for many years, used spectacles, as did Saun Dann and unidentified patrons in bars on both Roon and Aduba-3. C-3PO stole the spectacles from the Roon bar patron and wore them as an attempt to disguise himself from Bisad Koong's henchmen. Nuvo Vindi, a scientist working for the Separatists, also possessed spectacles, although he used them only occasionally."}, {"tag": "p", "text": "Vago the Hutt used spectacles on occasion. Wald, the X-wing pilot, also wore spectacles. Orman Tagge, Korkeal Hai, Retter Lewis and Garindan used goggles. Tatooine's Prefect Eugene Talmont was nearsighted, but refused to wear spectacles due to vanity. The Dulok shaman Umwak created his special glasses to find a way through Arbo Maze; however, he didn't see a thing in them."}, {"tag": "p", "text": "Sullustan forger Magar Jaros corrected his defective vision with computerized magnifocals, which were similar to a pince-nez. The human forger Battz wore a pair of spectacles in which one eye had a special magnification lens."}, {"tag": "p", "text": "Darnada, a Dug Black Sun Vigo, wore a monocle. This was a corrective lens that was worn over only one eye, and was often more of a status symbol than a practical accessory. Gorga the Hutt wore a similar type of spectacles while he served on the Hutt Ruling Council."}, {"tag": "p", "text": "Captain Telettoh also wore spectacles, as early as 3963 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}