{"url": "Baros/Legends", "categories": ["Category:Legends articles", "Category:Planet stubs", "Category:Desert planets", "Category:Dominus sector planets", "Category:Galactic Empire planets", "Category:High-gravity planets", "Category:New Republic planets", "Category:Rocky planets"], "nodes": [{"tag": "h1", "text": "Baros"}, {"tag": "p", "text": "Baros was a planet located in the Baros system in the Dominus sector. An Outer Rim world on the farthest reaches of the Slice, the planet was home to the Brubb species. It had a high gravity, was frequented by windstorms, and possessed infertile growing soil. In 9 ABY, it was one of the New Republic worlds taken over by Grand Admiral Thrawn during his attempt to win the Galactic Civil War for the Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Baros was located within a star system of the same name in the Dominus sector of the Outer Rim Territories region of the galaxy. It was situated at the terminus of Prously's Rim Run, a hyperlane which connected it to Dornea. Baros itself was a large planet in orbit around the blue star Bari. It was a dry, arid, dusty, and windy world with rocky terrain and heavy gravity, equivalent to 2.9 times the galactic standard. Baros received plentiful solar radiation but had few organic nutrients, so its plant life, which included the prickly avabush, was sparse and meager. A Barosian year lasted 567 standard days."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Baros was originally inhabited by herbivorous lizards which evolved into the sentient Brubbs. Although the region of space around Baros was explored between 5000 BBY and 3000 BBY, Baros itself did not come to the attention of the greater galaxy until the time of the Galactic Empire, when a group of Brubb astronomers, postulating that their planet was not the only civilized world in the galaxy, began beaming coded messages into space, where they were intercepted by a cargo freighter and reported to the sector Moff, who then dispatched a light cruiser to investigate the message's origins. In 9 ABY, on 44:7:20, Baros was attacked by forces of Grand Admiral Thrawn during his campaign against the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}