{"url": "Spheres_of_Influence", "categories": ["Category:Legends articles", "Category:Spheres of Influence"], "nodes": [{"tag": "h1", "text": "Spheres of Influence"}, {"tag": "p", "text": "The Spheres of Influence were the twelve domains of politics and power in the reconstituted Sith Empire. Each of the twelve Spheres, also known as Pyramids, were headed by a member of the Dark Council, and between them they encompassed the entire Empire. Through the Spheres, the Dark Council controlled and oversaw the day-to-day operations of the Empire, and every individual and organization within the Empire ultimately answered to at least one of the Councilors through the hierarchy of the Spheres."}, {"tag": "h2", "text": "History and overview"}, {"tag": "p", "text": "In 4980 BBY, the Sith Emperor reestablished the Sith Empire on the planet Dromund Kaas, where they would be safe from the Galactic Republic. Not long afterwards, the Emperor created the Dark Council, a group of twelve Dark Lords of the Sith who would handle the day-to-day running of the Empire as the Emperor gradually retreated into seclusion. Each Dark Councilor took an aspect of the Empire as their own to rule, ranging from joint control of the Imperial Military to the judicial regulation of Imperial society to the ensuring that the Sith Order remained loyal to Sith philosophy. Every Councilor's successor assumed control of their respective Sphere of Influence, and every organization, group, and individual within the Empire—whether they were Sith or not—ultimately answered to one or more Dark Council member. The Spheres occasionally overlapped, causing conflict between the various Council members, but overall each Council member was responsible for overseeing their own Sphere and dealing with any problems that arose."}, {"tag": "h2", "text": "The Spheres"}, {"tag": "h4", "text": "Ancient Knowledge"}, {"tag": "p", "text": "The Sphere of Ancient Knowledge was charged with the protection and expansion of Sith knowledge. First led by Darth Zavakon, the Sphere oversaw the Imperial Reclamation Service and ensured that Sith artifacts and archaeological discoveries were handled correctly and benefited the Sith Order. Darth Arctis was replaced by Darth Thanaton as head of the Sphere near the end of the Cold War with the Republic, and Thanaton himself was succeeded by Darth Nox after the later defeated the former in a duel."}, {"tag": "h4", "text": "Biotic Science"}, {"tag": "p", "text": "The Sphere of Biotic Science was charged with the command of all aspects of the Empire that dealt with the organic body. The Imperial Medical Corps, cybernetic augmentation, disease control, Sith alchemy, and genetic manipulations and experiments all fell within the Sphere's control, and Darth Acharon himself had augmented his own body with cybernetics by the time he led the Sphere near the end of the Cold War."}, {"tag": "h4", "text": "Defense of the Empire"}, {"tag": "p", "text": "The Sphere of Defense of the Empire was concerned with the direction of the Imperial Military in order to preserve the Empire and its people from external and internal threats. As a result, the Sphere shared joint control of the Ministry of War and the Imperial Military with the heads of the Spheres of Military Offense and Military Strategy, and it often coordinated its efforts with the Sphere of Imperial Intelligence. Darth Marr, the head of the Sphere during the Great Galactic War, the Cold War, and the Galactic War with the Republic, felt that it was his duty to protect the Empire against both the Republic and the Empire's own self-destructive policies and infighting like that which plagued the Dark Council."}, {"tag": "h4", "text": "Expansion and Diplomacy"}, {"tag": "p", "text": "The Sphere of Expansion and Diplomacy oversaw the expansion of the Empire's borders and directed the Imperial Diplomatic Service in its efforts to secure new allies and maintain their allegiances. While the Sphere controlled both diplomacy and expansion, the Sphere's leader determined which of the two the Empire favored during the Councilor's tenure; Darth Ravage, the Sphere's leader by the time of the Cold War, preferred military expansion and conquests over diplomacy in order to further his own interests."}, {"tag": "h4", "text": "Imperial Intelligence"}, {"tag": "p", "text": "The Sphere of Imperial Intelligence oversaw the Ministry of Intelligence, with the Minister of Intelligence reporting directly to the head of the Sphere. All of Intelligence's many divisions, including Imperial Intelligence—the primary Intelligence gathering arm of the Ministry—and the propaganda-generating Outreach Bureau fell under the control of the Sphere's leader, and Darth Jadus involved himself directly in the workings of Operations Division of during his time at the head of the Sphere. Following his presumed death with the destruction of his flagship, the Dominator, Darth Jadus was replaced for a time by his daughter and heir, Darth Zhorrid, though it is unknown how long she lasted, given the enmity she received at the hands of the rest of the Dark Council, nor who, if anyone replaced her; the seat was empty at a meeting a few years later."}, {"tag": "h4", "text": "Laws and Justice"}, {"tag": "p", "text": "The Sphere of Laws and Justice directed the law enforcement and justice branches of the Empire, and under the Sphere's control the rigid order and efficiency of Imperial society remained intact and Imperial justice was maintained across the Empire. Darth Mortis, the head of the Sphere by the time of the Cold War, ensured that the Empire remained true to its values and traditions, but understood that relying too much on the traditions of the past could compromise the future."}, {"tag": "h4", "text": "Military Offense"}, {"tag": "p", "text": "The Sphere of Military Offense directed the Imperial Military and the Ministry of War in all offensive military operations, commanding the military's firepower and resources in order to destroy the Empire's enemies and ensure their territorial and military supremacy. Darth Vengean's elaborate plan to restart the Great Galactic War was usurped by his apprentice Darth Baras before Vengean's death, and Baras' machinations to become the de facto ruler of the Empire by declaring himself the Voice of the Emperor resulted in Baras' death as well. Baras' successor Darth Arho commanded the military on Ilum as Grand Moff Ilyan Regus's superior, but he was killed by the Republic forces on Ilum. His successor, Darth Arkous, took part in Revanites' coup and was killed on Rakata Prime."}, {"tag": "h4", "text": "Military Strategy"}, {"tag": "p", "text": "The Sphere of Military Strategy controlled the battle plans, strategies, and other military procedures in addition to the Imperial Conquest Consolidation Corps, and the Sphere worked directly with the Spheres of Defense and Military Offense to command the Ministry of War. Darth Decimus and the Sphere orchestrated the invasion of Corellia during the renewed war with the Republic, resulting in a near-perfect occupation that was only foiled by the unexpected reactions of many Corellians and the formation of a resistance to the Imperial presence."}, {"tag": "h4", "text": "Mysteries"}, {"tag": "p", "text": "The Sphere of Mysteries, also known as the Keeper of Mysteries sphere, was the Sphere that was the most secretive of the twelve. The rest of the Empire knew almost nothing about the Sphere's inner workings or purpose, and they only understood that the mysteries which the Sphere protected were important to the Empire. Darth Rictus was the head of the Sphere during the renewed war with the Republic."}, {"tag": "h4", "text": "Production and Logistics"}, {"tag": "p", "text": "The Sphere of Production and Logistics was charged with overseeing the Ministry of Logistics, with the Minister of Logistics reporting directly to the Dark Councilor in charge of the Sphere. Through the Ministry, the Sphere oversaw the Empire's trade routes, resources, economy, military supply lines, transportation systems, nationalized industries, slave populations, and other assets and programs essential to the continued functions of the Empire. Vowrawn headed the Sphere throughout the four decades of conflict with the Republic."}, {"tag": "h4", "text": "Sith Philosophy"}, {"tag": "p", "text": "The Sphere of Sith Philosophy was tasked with the protection of the Code of the Sith, ensuring that the acolytes and apprentices of the Sith Order remained loyal to the tenets of their Order, spreading anti-Jedi teachings and propaganda, and also ensuring that the Empire remained free of those who believed in the powers or advantages of the light side of the Force. Darth Aruk made it his personal mission to destroy the Order of Revan and the mysterious Light Sith during his time at the head of the Sphere."}, {"tag": "h4", "text": "Technology"}, {"tag": "p", "text": "The Sphere of Technology oversaw the creation of powerful new cybernetics, superweapons, military technology and other revolutionary machines for the good of the Empire. The Sith Lord Darth Mekhis helped design the Fury-class Imperial interceptor in the years before her ascension to the head of the Technology Sphere, and during her time at its head she developed the powerful Sun Razer and many new superweapons before her death during a Republic SIS operation. She was succeeded by her rival Darth Hadra, but after her death at Corellia the Falleen Darth Karrid—commander of the prototype warship Ascendant Spear took her seat for a short time before Karrid's own death. Karrid was succeeded by Darth Acina, who was chosen by the Emperor's Hand to oversee the Arcanum."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}