{"url": "Barpotomous_Drebble/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Pages needing citation", "Category:Alliance Military officers", "Category:Business owners and executives", "Category:Criminals", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Barpotomous Drebble"}, {"tag": "p", "text": "Barpotomous Drebble was a Human businessman who had a weakness for gambling and a furious temper. The owner of a tavern on the Hunter's World of Keyorin, Drebble accumulated enough wealth to live comfortably. At some point, Drebble came into contact with Lando Calrissian, an accomplished smuggler and skilled gambler. The encounter ended poorly for Drebble, and he swore vengeance on Calrissian. Drebble clashed with Calrissian several times over the following years, including an attempt to interfere in Calrissian's card game with the Baron Administrator of Cloud City, Dominic Raynor. Drebble's meddling indirectly resulted in Calrissian winning control of the Cloud City resort from Raynor. In another encounter, Drebble nearly captured Calrissian and his friend, Luke Skywalker, on the planet Stenos, but Drebble's employees were unable to prevent the two from escaping."}, {"tag": "p", "text": "Calrissian, for his part, decided to get back at Drebble by using his name as an alias whenever he was involved in a dangerous mission for the Rebellion. Calrissian hoped that this gesture would lead any potential enemies encountered on these missions directly back to his nemesis; however, Calrissian's actions while masquerading as \"Drebble\" had the opposite effect, causing the Alliance to seek out Calrissian's nemesis and commend him for his bravery. As a result, a short time after the Battle of Endor, a confused Drebble found himself promoted to captain and declared a hero of the Alliance to Restore the Republic. Drebble's newfound status as a hero led him to a leadership position on the planet Stenos. He controlled a substantial section of the Stenos capital and ruled it in the best interests of the Alliance of Free Planets, the interim government that preceded the New Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Card shark"}, {"tag": "p", "text": "The Human male Barpotomous Drebble's success as a businessman came from the large tavern on Keyorin, which he owned and operated. The planet was a haven for bounty hunters, and Drebble's place was a popular hangout on the Hunter's World. However, Drebble's success did not mean that he spent all his time on Keyorin. Drebble was known to frequent the popular Cloud City Casino in pursuit of entertainment and wealth."}, {"tag": "p", "text": "While still on his homeworld, Drebble became familiar with the gambler Lando Calrissian. During their first encounter, there was a dispute, and Drebble would later claim that Calrissian had cheated him. Sometime later, Drebble became reacquainted with Calrissian at the Cloud City Casino. Calrissian was an accomplished sabacc player, and Drebble found himself losing a great deal to Calrissian's skills. Drebble's pride could not accept that Calrissian was a better player, and thus Drebble was convinced that Calrissian had been cheating during their games. Drebble eventually found a chance to get back at Calrissian for all his humiliating defeats."}, {"tag": "p", "text": "Calrissian found himself in a high stakes game of sabacc against Baron Administrator Dominic Raynor, and Drebble seized his chance. He bribed the dealer into sneaking a skifter, a rigged sabacc card, into the deck, throwing the game and allowing Raynor a substantial victory; Raynor's earnings took the form of Calrissian's prized starship, the Cobra. However, Lobot, the chief administrative aide of the resort, discovered the skifter, and Drebble was subsequently kicked out of the casino. Drebble was therefore not around to see Calrissian's second game with Raynor in which he won the entire Cloud City resort."}, {"tag": "h3", "text": "Reunion"}, {"tag": "p", "text": "Over the years, Drebble's anger against Calrissian grew. Drebble enjoyed venting his frustration at his subordinates, giving speeches about how much of a cheat Calrissian was. Drebble's tavern continued to bring in customers, and around 3.5 ABY, Drebble's wealth had allowed him to hire the bounty hunters Bossk and IG-88C as part-time employees. Drebble still continued to travel off-world, and coincidentally, he was surprised to see Calrissian and his friend Luke Skywalker frequenting a tavern on Stenos."}, {"tag": "p", "text": "Excited at the possibility of capturing Calrissian, Drebble cried out to the denizens of the tavern, declaring that he would pay 10,000 to the one who captured the man who had cheated him. With the possibility of a small fortune on the line, the tavern erupted with blaster fire. However, Skywalker's skills with a lightsaber allowed the pair to escape. Drebble's frantic insistence for someone to chase after the rapidly departing Calrissian only resulted in a punch to the face from an irritated patron."}, {"tag": "p", "text": "However, an ambush by Bossk and IG-88C was able to stop Calrissian from escaping, and he was put under close watch by Drebble's men. Drebble paid a hefty sum so that Calrissian could be frozen in carbonite and brought back to his homeworld. This plan was eventually foiled; due to further interference from Skywalker, Calrissian escaped from the carbon-freezing chamber untouched and outside of Drebble's grasp once again."}, {"tag": "h3", "text": "Second chance"}, {"tag": "p", "text": "After Calrissian's escape, Drebble's desire for revenge continued. Drebble was still the wealthiest man on Keyorin, and the illustrious bounty hunters Bossk and a newly reprogrammed IG-88A, as well as two Stenax bodyguards, were kept on retainer. Drebble loved to use the hunters as an audience for his soliloquies about getting revenge on Calrissian. A short time following the Battle of Endor, Calrissian and his Rebel Alliance associates, Han Solo and Chewbacca, arrived on Keyorin to negotiate with the Head of State about attending the first meeting of the Alliance of Free Planets. After Han convinced the official to attend the meeting, Calrissian, Solo, and Chewbacca frequented Drebble's tavern for a drink. When the three went to pay for their drinks, Drebble had an abrupt reunion with his sworn enemy. Calrissian and company ran out the back door, and Drebble ordered his men, including Bossk and IG-88A, to capture Calrissian. The chase ended when Drebble and his Stenax employees cut the group off at Solo's ship, the Millennium Falcon."}, {"tag": "p", "text": "Drebble and his two Stenax bodyguards stunned the group and dragged Calrissian to the Rebel's personal ship, the Cobra, leaving Solo and Chewbacca to a group of thugs led by the criminals Lemo and Sanda. Drebble planned to commandeer Calrissian's ship and bring him back to the first place that Calrissian had cheated him—Drebble's homeworld. The wealthy businessman planned to use his Stenax servants to exact a very personal revenge on Calrissian. However, as Drebble attempted to work the controls of the Cobra, he inadvertently turned on the HoloNet, and a special report by Rebel leader Mon Mothma came over the network. The report announced that Drebble was to be declared a hero of the Rebellion, promoted to the rank of captain, and given a decoration for bravery."}, {"tag": "p", "text": "Unbeknownst to Drebble, during Calrissian's time in the Rebellion, Calrissian had often used Drebble's name as an alias in undercover missions to avoid attracting unwanted attention to himself. The Alliance snapped up the reports of \"Drebble's\" exploits and declared him a hero. Drebble was shocked by the announcement, but he took to his new position with fervor. Knowing Calrissian was a member of the Alliance, Drebble released the man after Calrissian lied that he had been sent to Keyorin to give Drebble his commendations."}, {"tag": "p", "text": "Immediately after this promotion, Lemo and Sanda's gang accosted Captain Drebble about the whereabouts of an expensive artifact, the Dancing Goddess. The gang had believed that Solo and Chewbacca possessed the statue, but after interviewing them, they learned that the artifact was still with Calrissian. Armed with this information, they double-crossed Drebble and demanded that he turn over Calrissian to them or suffer the consequences. Drebble, having fully bought into his role as an Alliance hero, decided to heroically battle the pirate gang and protect Calrissian. Before Drebble could attack the pirates, his former nemesis offered a plan of attack, which he immediately agreed to. On Calrissian's suggestion, he and Drebble gave themselves up to Lemo and Sanda's gang while his two Stenax bodyguards flew around behind the pirate group. At Drebble's signal, and with help from the intervention of Solo and Chewbacca, the Stenaxes attacked from the rear while IG-88A and Bossk began firing on the pirates from inside the ship. Surrounded and outgunned, Lemo and Sanda surrendered, but not before taking heavy casualties to their group. As a reward for Drebble's bravery and his newfound loyalty to the Rebellion, Calrissian presented him with the Dancing Goddess, much to Lemo and Sanda's dismay."}, {"tag": "h3", "text": "Hero of the Rebellion"}, {"tag": "p", "text": "Within a short period, Drebble used his influence as a Rebel hero to become the leader of an entire section of the Stenos capital. The people of Stenos greatly admired Drebble and did everything in their power to protect their beloved leader. By this time, Drebble had taken to wearing an elaborate military uniform complete with a cape, and his hair had become white."}, {"tag": "p", "text": "During the Nagai-Tof War, Calrissian found himself on a mission to Stenos to reclaim the Dancing Goddess. The statue had been revealed to be part of an elaborate machine on the planet Godo that kept the atmosphere of the planet fit to support the native Godoans. The absence of the Dancing Goddess had caused the machine to stop working, and the Godoans were slowly dying. Calrissian was hesitant to take Drebble's award away from him, but the lives of an entire species hung in the balance."}, {"tag": "p", "text": "When Calrissian and Chewbacca arrived on Stenos to see Drebble, Drebble's loyal citizens misinterpreted the situation, believing Calrissian had arrived to harm their leader. They opened fire on the pair, and Calrissian and Chewbacca were forced to flee, eventually coming face to face with Drebble. Drebble recognized Calrissian and Chewbacca and brought them into his headquarters. When Calrissian asked for the statue, Drebble's notorious temper almost got the better of him, but he recognized that if he insisted on keeping it, he would no longer deserve it. Drebble allowed Calrissian to take the statue back to Godo, where it helped repair the machine and save the Godoans."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Barpotomous Drebble was a large man who enjoyed a wealthy lifestyle that his profitable business provided him. He had a distinct sense of style and displayed a long mohawk throughout his career, even when his hair had finally turned white. As a business man on Keyorin, he was concerned with being as comfortable as possible, wearing simple sandals and a long purple robe adorned with a heavy gold chain. Additionally, Drebble claimed that his teeth were the most expensive that credits could buy, indicating that he had had some dental work done. Drebble was easily offended, and found it hard to forgive transgressions against him. He also had a furious temper and was often seen yelling when in a particularly foul mood. However, for all his character flaws, Drebble proved himself a shrewd businessman, using his tavern to set himself up as the wealthiest being on Keyorin."}, {"tag": "p", "text": "Drebble's attitude and his general feeling toward life and the people around him abruptly changed after his appointment to captain. He left his tavern on Keyorin and took to living up to his newfound status in his new home on Stenos. He found himself more in control of his temper and took responsibility for the citizens of the Stenos capital, eventually becoming leader of a large section of the city. With his optimistic outlook on life, Drebble's sense of style changed as well. He wore a full uniform complete with a cape, ammunition belt, and heavy boots."}, {"tag": "p", "text": "Although he possessed a sense of style, Drebble was not a very apt fighter in hand-to-hand combat and was unable to earn the respect of his subordinates. He was not familiar with the controls of starships, such as the Cobra, being fully incapable of working the controls when he attempted to commandeer Calrissian's ship. However, Drebble could handle a blaster pistol, and he was a capable leader when confronted with violence, as seen when he attacked Lemo and Sanda's gang. These characteristics were built upon after he became part of the Rebel Alliance, and those that he ruled over were fanatically loyal to him, willing to kill or capture anyone who might cause him harm."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Drebble was created by Mary Jo Duffy for use in the Marvel Star Wars comic Star Wars 71 as an adversary to Lando Calrissian. He appeared in the following issue, in which Calrissian was able to escape from Drebble's schemes. In two later issues in the Marvel comic series, Star Wars 75 and Star Wars 79, Calrissian used Drebble's name as an alias, in an effort to get Drebble into trouble. However, these efforts backfired, and in Star Wars 85, Drebble was declared a hero of the Rebel Alliance. This caused the character to ally himself with the Alliance of Free Planets, and during his last appearance in Star Wars 99, he proved himself to be a friend of Calrissian."}, {"tag": "p", "text": "After the end of the Marvel run, Drebble went unreferenced until the 1995 reference book, The Essential Guide to Characters, where he and his exploits in the Marvel comics were briefly mentioned in the entry for Lando Calrissian. Drebble did not make another appearance until 2000 in the short comic \"Lady Luck\", published in Star Wars Tales 3. At the time of publication, this comic was not fully within continuity, but references to the events of the comic in The New Essential Chronology, Star Wars: The Ultimate Visual Guide, and the short story Lando Calrissian: Idiot's Array indicate that the comic is at least partially canon. Within this comic, the authors, Rich Handley and Darko Macan, revealed Drebble's first name of Barpotomous. This name was also referenced in the Databank entry for IG-88, but is misspelled \"Barpotamus\" in the Databank entry for Bossk. During the short comic, Drebble is seen drinking what looks like Colt 45 (seen to the right), a beverage once advertised by Billy Dee Williams, the actor that played Lando Calrissian in two Star Wars films.[source?] Drebble was mentioned again in The New Essential Guide to Characters in the entries for Calrissian, IG-88, and Bossk, which referenced his appearances in the Marvel run, and in the Calrissian entry, which referenced his presence in Lady Luck."}, {"tag": "p", "text": "In 2008, Rich Handley once again referenced Drebble in his Hyperspace short story, Lando Calrissian: Idiot's Array. That same year, the character received an entry in The Complete Star Wars Encyclopedia, once again summarizing his presence in the Marvel comics."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}