{"url": "Spice/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Cooking spices", "Category:Slang", "Category:Spice variants"], "nodes": [{"tag": "h1", "text": "Spice"}, {"tag": "p", "text": "Spice, also known as narco-spice, was slang for various mind-altering drugs. Varieties included ryll and the strongest (and most expensive), glitterstim. The planet Kessel was rich with these spices, which were harvested from dangerous mines, at one point in history by slave labor. Sevarcos II, Rori, Ryloth, Troiken, and Mon Gazza were other sources of spice. The word could also refer to non-narcotic herbs and minerals used to give foods or drinks flavor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Spice was mined on Kessel by criminals. Since Kessel lay within the Maw Cluster, in the unlikely event a prisoner were to escape they would not likely go far because of the surrounding black holes. The spice found on Kessel was glitterstim, one of the most prized spices in the galaxy. This particular spice was created by a species of energy spiders that would spin the spice into webs. Any unlucky miner that came into contact with one of these creatures would have their life energy sucked out of them in seconds."}, {"tag": "p", "text": "Spice mining was a very dangerous job. Kessel had no natural atmosphere, and factories on the surface created air; however, the air was still too thin to breathe without an oxygen mask. Spice was activated by light, forcing workers to work in complete darkness or under dim, red lights that lacked photons energetic enough to trigger it. Along with the obvious dangers of energy spiders, glitterstim threads were very sharp, and could easily remove digits if the worker was not careful."}, {"tag": "p", "text": "The Galactic Empire attempted to keep a tight rein on the circulation of the various forms of spice, making it a frequent item for smuggling. It must be noted, though, that various forms of spice had medicinal uses—not every form of spice was addictive, or even illegal."}, {"tag": "p", "text": "Most forms of spice were collected raw, then processed and refined. Some forms of spice were produced completely synthetically, without the use of any kind of natural material. Many organizations, and planets, took on this enterprise, notably the Hutts."}, {"tag": "p", "text": "Spice was known to have gained widespread use since the days of the Galactic Republic, even before 4000 BBY. In 13 ABY, Lando Calrissian bought the spice mines of Kessel."}, {"tag": "p", "text": "The illegal spice market was virtually destroyed as a result of the Yuuzhan Vong War. With the Hutts attempting to fight off the Yuuzhan Vong, their contacts were stripped of their connection. Many people were forced to confront their addictions, and spice all but lost its worth. By at least 130 ABY, the spice trade had been rebuilt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "It has been posited that Frank Herbert's classic science fiction novel Dune (1965) had a heavy influence upon Star Wars. The drug known as \"the spice\" Melange plays a central role in the Duniverse."}, {"tag": "p", "text": "The concept of spice in the Star Wars universe appeared for the first time in Star Wars: Episode IV A New Hope and is only mentioned briefly by C-3PO and Luke."}, {"tag": "p", "text": "Since then spice has appeared in countless Expanded Universe works, and is even mentioned briefly in Star Wars: Episode II Attack of the Clones."}, {"tag": "p", "text": "Prior to the New Game Enhancements introduced to Star Wars Galaxies, spice was a consumable within the game that players who chose the smuggler profession could craft. Once ingested, it would improve a certain number of stats at the cost of decreasing others. After the effect wore off, you would experience spice withdrawal for several minutes, prompting your character to appear to vomit and lowering all of your stats."}, {"tag": "p", "text": "Author Kevin J. Anderson noted that some \"politically correct\" individuals at Lucasfilm almost forced him to characterize spice as a food additive in Jedi Search out of concern for characterizing Han as a drug dealer during his smuggling days. The matter was brought up to George Lucas, who confirmed that spice is a drug. Anderson compromised by adding positive qualities to the substance instead of categorizing it as a damaging substance like crystal meth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}