{"url": "Spice_mines_of_Kessel", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Galactic Empire locations", "Category:Industrial facilities", "Category:Kessel locations", "Category:Mining areas"], "nodes": [{"tag": "h1", "text": "Spice mines of Kessel"}, {"tag": "p", "text": "The spice mines of Kessel, known as the Dark to veteran miners, were a series of labor camps on the planet Kessel, where slaves from various species, Wookiees among them, were forced to mine a medicinal spice mineral into a dangerous drug. Spice mining was extremely dangerous, and slaves were thus used as expendable labor. Life expectancy for humanoid species was two to three years, while Wookiees had an expected survival time of three months. The Yaruba Family of Kessel turned a blind eye to the harvesting of spice on their world, living in luxurious sanctuaries in the southern hemisphere of the planet, while the spice mining took place in the northern hemisphere."}, {"tag": "p", "text": "Spice mining was accomplished via the use of deep pits, mine shafts, and massive refineries."}, {"tag": "p", "text": "Slaves in the mines used Bore-Drillers and Vibropicks."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Approximately 10 years before the Battle of Yavin, the Empire sent Nakari Kelen's mother to the spice mines of Kessel for writing the song \"Vader's Many Prosthetic Parts,\" along with the entire membership of the band Hakko Drazlip and the Tootle Froots for performing it. In 10 BBY, Qi'ra, Tobias Beckett, and his crew conducted a raid on the mines in order to steal unrefined coaxium in order to pay off Dryden Vos."}, {"tag": "p", "text": "Approximately fourteen years after the Galactic Republic was transformed into the Galactic Empire, a group of Wookiees, including Wullffwarro and his son Kitwarr, were sent to spice mine K76 by Agent Kallus. However, after a brief fracas involving a group of rebels from Lothal, the Wookiee slaves were rescued and brought aboard the heavily modified VCX-100 light freighter Ghost."}, {"tag": "p", "text": "When Imperial forces boarded the Tantive IV, C-3PO was worried that he and R2-D2 would probably be sent to the mines."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The spice mines of Kessel were first mentioned in the novelization of the original Star Wars film and also in the film itself. It later appeared in canon in Star Wars Rebels: Spark of Rebellion."}, {"tag": "p", "text": "For the 2018 Star Wars Anthology film Solo: A Star Wars Story, the open-cast copper mines of Spain and the sulfuric hot springs of the Dallol volcano in Ethiopia influenced the look of the spice mines of Kessel and were considered too as shooting locations. In addition, the Kessel mines control room was inspired by the mid-century control rooms in the Soviet Union, it draws more specifically from the control room of the Fawley Power Station in Hampshire, England."}, {"tag": "p", "text": "An idea proposed for Solo but not used in the finished version of the film was to have a Wookiee slave gang working at the mines and being supervised by stormtroopers. This idea was ultimately dropped as the film shows Quay Tolsite and the S1D6-SA-5 as the supervisors of the mines."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}