{"url": "Spirit_world", "categories": ["Category:Canon articles", "Category:Culture of Dathomir", "Category:Extradimensional locations"], "nodes": [{"tag": "h1", "text": "Spirit world"}, {"tag": "p", "text": "The spirit world was an alternate dimension to which Mother Talzin had the ability to travel using Nightsister magicks. While in the spirit world, she was immune to physical attacks and could appear in a mist anywhere in the galaxy. Talzin traveled to the spirit world to escape General Grievous on Dathomir, and later, Jedi Master Mace Windu on Zardossa Stix. She also appeared to Maul and Count Dooku from the spirit world several times."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The spirit world was dimension, alternative to that of either realspace or hyperspace. It could be accessed through Dathomirian Nightsister magicks. Talzin was the only known Nightsister able to access this dimension. When entering the spirit world, Talzin's physical form dissolved into a green mist. While in the spirit world, Talzin could use her other magick abilities, as well as appear as a misty figure anywhere in the galaxy. She was also immune to physical attacks, even while manifesting visually. She would often appear to individuals, giving them guidance or advice. Once in the spirit world, Talzin needed life energy in order to leave. This being the case, Talzin only accessed the world when she needed to escape physical harm and no other escape routes were available."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Battle of Dathomir in 20 BBY, Talzin attempted to torture Count Dooku to death with voodoo magicks. To prevent this, General Grievous was ordered to find and kill Talzin. He followed the green mist and discovered Talzin, as well as Old Daka. After killing Daka and disrupting the resurrection magick, he attempted to kill Talzin. To avoid death, Talzin was forced to abandon and dissolve her physical form, and seek refuge in the spirit world, where she later appeared to Count Dooku. Without Daka or Talzin's support, the Nightsisters were quickly overrun and exterminated. After this, she disappeared from Galactic affairs for a year."}, {"tag": "p", "text": "Later, in 19 BBY, with the help of the Frangawl Cult, Talzin captured the Dagoyan Masters, and attempted to drain the Living Force from them. The Living force of the Masters was then stored within the Living sphere. Talzin had planned to absorb the force within the orb in an attempt to gain powers far in excess of her previous abilities. The cult captured Queen Julia of Bardotta and took her to their secret stronghold on Zardossa Stix. There, Talzin used the planetary alignment, combined with her own magicks, in order the steal the Queen's Force energy. She was forced to once again abandon her plans after they were discovered and thwarted by Mace Windu and Jar Jar Binks. After battling Windu with a flaming sword, Talzin was again defeated, forcing her to escape back in to the spirit world."}, {"tag": "p", "text": "From the spirit world, Talzin appeared to her son, Maul, after he contacted her for guidance. She arranged a battle on Ord Mantell, where she hoped Maul would be able to capture Dooku and Grievous in order to lure Darth Sidious out. Maul defeated Grievous and convinced him to disable the droids on the surface, allowing the Shadow Collective to capture Dooku. When confronted by Obi-Wan Kenobi and Tiplee, she appeared to a captive Dooku and was able to convince him to aid Maul against the Jedi. Tiplee was killed, and Kenobi was incapacitated, allowing Maul and Dooku to escape. The battle also misguided Mace Windu into believing that Dooku was the Sith Master, which Sidious used to his advantage. Maul eventually made his way back to Dathomir, bringing with him a captive Dooku. Maul was followed by a Sith Infiltrator carrying both Grievous and Sidious. On Dathomir, Talzin stole Dooku's life energies so that she could escape the spirit world and return to the physical world, but when Sidious arrived, she was quickly killed by Grievous."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The spirit world first appeared in \"Massacre,\" a Season 4 episode of Star Wars: The Clone Wars, which aired on February 24, 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}