{"url": "Spirit_of_Rebellion", "categories": ["Category:Real-world articles", "Category:Game stubs", "Category:Star Wars: Destiny"], "nodes": [{"tag": "h1", "text": "Spirit of Rebellion"}, {"tag": "p", "text": "Spirit of Rebellion is a booster pack set within the card and dice game Star Wars: Destiny. It was released on May 4, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"This is a rebellion, isn't it?\"–Jyn Erso, Rogue One"}, {"tag": "p", "text": "The Star Wars saga has always centered on the timeless struggle between good and evil. At different points throughout the saga, evil may be lurking in the shadows or controlling an oppressive, galaxy-spanning Empire. Yet there must always be balance in the Force, and whenever the dark side rises, a spirit of rebellion begins to light the way forward."}, {"tag": "p", "text": "With the new Spirit of Rebellion Booster Packs for Star Wars: Destiny, 160 brand-new cards enter the game, incorporating elements from every movie in the saga, but with a special focus on the newest Star Wars movie: Rogue One. You'll find plenty of characters from Rogue One within this set, including Jyn Erso, Chirrut Îmwe, Mon Mothma, and Director Krennic, alongside other iconic characters from across the Star Wars story. The spirit of rebellion has ignited—prepare to bring the feverish battles and kinetic action of Rogue One to your games of Star Wars: Destiny!"}, {"tag": "p", "text": "Every booster pack includes five randomized cards and one premium die, broken down into three common cards, one uncommon card, and one rare or legendary card with a corresponding die. All cards that feature a corresponding die are either rare or legendary cards. With every booster pack, you'll find new characters, supports, upgrades, or events, along with new ways to enter the Star Wars galaxy and fight for your chosen side!"}, {"tag": "p", "text": "There are 36 booster packs included in a Spirit of Rebellion display case."}, {"tag": "h2", "text": "External links"}]}