{"url": "Spirit_(Nightsisters)", "categories": ["Category:Legends articles", "Category:Culture of Dathomir", "Category:Deities", "Category:The Force"], "nodes": [{"tag": "h1", "text": "Spirit  (Nightsisters)"}, {"tag": "p", "text": "The Spirits were supernatural beings which the Nightsisters of Dathomir thought to exist. It was a common opinion amongst both Jedi and Sith that the \"Spirits\" were based on an archaic and shamanistic interpretation of the Force. The witches believed the Spirits bestowed their blessings on Dathomir and allowed the practice of magicks by tapping into their energy."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "According to the beliefs of the Nightsisters, there was another realm, a parallel plane to the physical world that was inhabited by spirits. This spiritual realm was thought to be governed in balance by the Twin Deities, the Winged Goddess and the Fanged God, which were depictions of the Light and dark side of the Force."}, {"tag": "p", "text": "In her instructional treatise entitled Wild Power, Clan Mother Talzin implied there was a single representative spirit for each animal species in the spirit realm, something she calls the \"ur-spirit.\" These ur-spirits were the other inhabitants of the spiritual realm, under the rule of the Twin Deities. The ur-spirits of animals, according to Talzin, are \"red and raw,\" while that of plants \"pulses with a deep green\" and is \"quieter and more content.\" All spirits and their physical counterparts constituted Dathomir's \"life web.\""}, {"tag": "p", "text": "The Nightsisters also believed the two realms were so close on Dathomir that only their shamans could carry messages between them. The shamans of the Nightsisters were thought to have been \"chosen\" to encounter and interact with the spirit world. They were thought to act as a conduit for the Spirits themselves."}, {"tag": "h2", "text": "Powers"}, {"tag": "p", "text": "According to the lore, the Spirits bestowed fertility upon the clans and claimed the souls of the dead. Nightsisters talismans were thought to have been empowered by the spirits. Darth Sidious thought those artifacts were not very different from the ones made by the ancient Sith, but no alchemist had ever been known to duplicate the non-conventional effects of the Nightsisters' talismans, such as metamorphosis. Such a supernatural, alchemic-power deficiency among the Sith throughout their history Sidious thought \"curious\"."}, {"tag": "h2", "text": "Existence"}, {"tag": "p", "text": "Asajj Ventress, born a Nightsister and trained successively as as Jedi apprentice and a Sith Acolyte, once wrote that her former masters Ky Narec and Dooku did not believe in the Spirits. Indeed, the Jedi thought the work of the Spirits was a primitive name for the Unifying Force and the Living Force. The Twin Deities, however, were confirmed to exist during the Clone Wars, when Jedi Knight Anakin Skywalker was brought to Mortis, a mysterious planet enclosed in a octahedral monolith."}, {"tag": "p", "text": "There were many parallels between the Spirits and the Force. Mother Talzin would say a Nightsister had to serve the will of the Spirits, just like a Jedi would serve the will of the Force. Moreover, it was said that Allya foretold the rise of a perfect being \"brought into existence by the Spirits\", which was very reminiscent of the prophecy of the Chosen One."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Spirits worshipped by the Nightsisters were described in the 2012 reference book Book of Sith: Secrets from the Dark Side. As the part of the book in which they appear is written from a Nightsister's perspective, it is unclear if the spirits do exist or if they are just archaic manifestations of the Force. The book also directly links the spirits with the \"Mortis Trilogy\", a story-arc of the TV series Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}