{"url": "Spiral-class_Assault_Ship", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Boarding craft classes", "Category:Galactic Empire starship classes"], "nodes": [{"tag": "h1", "text": "Spiral-class Assault Ship"}, {"tag": "p", "text": "The Spiral-class Assault Ship was a needle-shaped, single-use boarding craft in use by the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "This small, unarmed vessel was a single-use craft designed to sneak up on an unsuspecting target and release a strike force directly onto the enemy vessel. Unlike other assault shuttles, the Spiral-class was completely unarmed, relying on its advanced stealth suite to allow the craft to achieve striking distance. Once the vessel reached its target's particle shields, a one-use proton charge would explode, causing the target's shields to weaken enough for the Spiral-class to pass through."}, {"tag": "p", "text": "Once through the shield, the Spiral smashed itself headlong into the target. The nose cone of the Spiral-class was composed of tekonite, which would vaporize upon collision, absorbing up to 92 percent of the damage. The resulting impact damage to the target ship allowed enemy forces to enter the vessel via hull breaches using vac-suits."}, {"tag": "p", "text": "The Spiral-class was severely limited in cargo space; it had room for at least six passengers while the rear cargo compartment could only hold a droid and rations for two weeks."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Two Spiral-class ships were captured by the Alliance to Restore the Republic, and were instrumental in the Rebel infiltration and capture of the Black Ice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Spiral-class assault ship is not pictured anywhere. A picture thought to be of it is almost certainly a H-60 Tempest Bomber from the same battle."}, {"tag": "h2", "text": "Appearances"}]}