{"url": "Spirakris_Zarem", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Diplomats", "Category:Females", "Category:Humans", "Category:Republic Army personnel"], "nodes": [{"tag": "h1", "text": "Spirakris Zarem"}, {"tag": "p", "text": "Spirakris Zarem was a female Human who worked as a Senate page. She represented a group of individuals who supported their ideal of the True Republic during Cold War with the reconstituted Sith Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human female, Spirakris Zarem was born to an Admiral father and a Senator mother, living on Coruscant and growing up in and around the Senate Building. Orphaned during the Great Galactic War between the Galactic Republic and the reconstituted Sith Empire, Zarem joined the Republic Army, eventually leaving that career to begin work as a diplomat. During the Cold War, Zarem began work independently, joining a group of individuals that supported an ideal they called the True Republic. Believing the Galactic Republic could only be strong when it was allied with the Jedi Order and resolutely opposed the Sith, Zarem worked on Coruscant to ensure that the group's goals were met."}, {"tag": "p", "text": "As the Cold War dragged on, some members of the Galactic Senate grew weary of the stalemate. While milling around the Senate Plaza's taxi pad, Zarem discovered a plot by Senator Glearius Parvil to introduce legislation that would break the Republic's ties with the Jedi Order and instead offer alliance to the Sith Empire. In order to prevent this, Zarem commissioned an independent agent to enter the Senate Building, sabotage the Senator's courier droid, and steal a particular parcel that would serve as evidence against him. Because she was on Senate Security's watch list, she could not enter the building herself. However, her agent was persuaded that stealing the package was undemocratic, and delivered a parcel of outdated agricultural documents to her instead."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Spirakris Zarem appears in the Star Wars: The Old Republic Coruscant quest called \"The Politics of Dissent\". The player can also choose to turn the real parcel over to Zarem. This article assumes the player made the light side choice."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}