{"url": "Spire_(Stygeon_Prime)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems military bases", "Category:Galactic Empire prisons", "Category:Imperial military bases"], "nodes": [{"tag": "h1", "text": "Spire  (Stygeon Prime)"}, {"tag": "p", "text": "The Spire, also known as the Stygeon Prison, was a secret, remote prison fortress located on the planet Stygeon Prime. The prison was operated by the Confederacy of Independent Systems during the Clone Wars. The Sith Lords Darth Sidious and Count Dooku held the renegade Sith Lord Maul in the prison before he escaped with the help of Death Watch."}, {"tag": "p", "text": "Years later, the prison was operated by the Galactic Empire. The Empire protected the prison with ray shields, blast-proof structures, anti-aircraft weapons, TIE fighters, and stormtroopers. The rebellious crew of the Ghost learned that the Empire was holding Jedi Master Luminara Unduli in the prison and attempted to save her. During the attempt, former Padawan Kanan Jarrus encountered the Grand Inquisitor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located on the planet Stygeon Prime, the Spire was a top-secret fortress built into the mountains of one of the planet's most inhospitable areas, its name befitting the structure's architectural formation. Although its builder and early history were shrouded in mystery, the facility was used extensively by the Dark Lord of the Sith Darth Sidious before the rise of the Galactic Empire, where it primarily served as a containment facility."}, {"tag": "p", "text": "Accessible only from the air, entry was gained by one of two docking ports. A small number of windows were built into the Spire's heavy walls, and were constructed with similarily thick transparisteel. The density of the material distorted the view of anyone hoping to peer out from within, and in turn only allowed thin, weak streaks of light to shine into the facility's interior. Its dingy, claustrophobic atmosphere compounded the already dungeon-like design of the Spire."}, {"tag": "p", "text": "Both blast-proof and ray-shielded, the Spire made scanning of any kind impossible. The facility was further protected by ground-to-air weapon systems, each tied in to a sophisticated sensor array, as well as ships that patrolled the surrounding area. During the Clone Wars, the facility's day-to-day operations were handled by the Confederacy of Independent Systems and later the Galactic Empire, whose garrisons of battle droids and stormtroopers patrolled the prison's labyrinth of passageways, corridors, tunnels and exterior balconies around the clock."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Confederacy of Independent Systems secretly operated the Spire. Following Darth Sidious' capture of Darth Maul on Mandalore, Maul was taken by Sidious and his apprentice Count Dooku to the Separatist's secret prison on Stygeon Prime. There, Maul was brutally interrogated by Sidious and Dooku. After Sidious left, Dooku continued interrogating Maul for information on his Shadow Collective and his underworld contacts. However, a pair of Mandalorian super commandos, Commander Saxon and Rook Kast, were sent by Mandalore's Prime Minister Almec to free Maul. They were able to liberate Maul, escape the prison and evade the prison's battle droid garrison."}, {"tag": "p", "text": "Following the end of the Clone Wars, the Spire came under the control of the newly formed Galactic Empire. After her capture, Jedi Master Luminara Unduli was imprisoned there and later executed. Her remains were kept in her former cell in order to lure out any survivors of Order 66. Five years before the Battle of Yavin, Imperial senator Gall Trayvis, posing as a dissident, leaked information on the Spire, claiming that Master Unduli was alive. The news was received by the Lothal rebel cell, who acted on the information, hoping to free her. Cell leader and Jedi Kanan Jarrus and his team were able to infiltrate the Spire, however Jarrus and his apprentice, Ezra Bridger, discovered that Unduli was in fact dead. The Grand Inquisitor revealed that Unduli had died with the Old Republic and that her bones were meant to lure the last of the Jedi out of hiding. Jarrus dueled the Inquisitor, but was outmatched. He and the other rebels were able to make their escape past the Spire's stormtrooper garrison and escape."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}