{"url": "Spoilt_Sport", "categories": ["Category:Legends articles", "Category:Yachts"], "nodes": [{"tag": "h1", "text": "Spoilt Sport"}, {"tag": "p", "text": "The Spoilt Sport was the personal yacht of Simon Greyshade, the administrator of the casino space station known as the Wheel. Flashy and expensive, the Spoilt Sport was kept aboard the station and was linked into the Wheel's communications array. In 0 ABY, Greyshade was killed during a battle between Wheel Security and Imperial stormtroopers, and control of the yacht fell to Rebel agents Luke Skywalker and Leia Organa, who used it to escape Imperial pursuit. They soon brought the ship to Centares, where they traded it for a more discreet craft."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A gleaming, golden yacht, the Spoilt Sport was the personal starship of former Imperial Senator Simon Greyshade during his years as the Administrator of the casino space station known as the Wheel. Greyshade went through lengths to make sure that he would be the only one able to use his prized yacht, configuring the ship's control locks to only respond to his hand-print. Greyshade kept the Spoilt Sport in Docking Bay 10 on the Wheel, where it was linked into the station's communication systems, allowing him to make holo-calls to individuals aboard the Wheel while he stayed on his ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Spoilt Sport belonged to Wheel Administrator Simon Greyshade during the Galactic Civil War, when the station became the center of intrigue concerning the Empire and the Rebel Alliance. In 0 ABY, Imperial Commander Zertik Strom, looking to justify a direct Imperial takeover of the Wheel, staged a Rebel attack on a merchant ship carrying profits off the station. Although the Strom and Greyshade had struck a deal to allow the Imperial plot to move forward, Greyshade sent a squad of Wheel Security officers to raid Strom's cruiser and stash the stolen profits aboard the Spoilt Sport. When Rebel prisoners Luke Skywalker and Leia Organa, hoping to expose their scheme, attempted to track the security team back to the yacht, it resulted in a heated firefight. Skywalker attempted to take on the officers singlehandedly, but his charge up the Spoilt Sport's loading ramp was halted when Greyshade surprised him with a blaster in hand."}, {"tag": "p", "text": "Greyshade brought Skywalker and Organa aboard the Spoilt Sport to commence negotiations, and the Wheel administrator offered generous terms. He would allow the Rebels to proceed in exposing Strom's scheme and allow Organa's friends to go free, asking only for one thing in return: for Organa, a former colleague in the Imperial Senate with whom he had long been infatuated, to take off with him in his yacht to parts unknown. After witnessing her close friend Han Solo seemingly perish in the Wheel's Big Game gladiatorial contest, Organa reluctantly agreed to the deal. Before Greyshade and Organa could take off in the Spoilt Sport, however, Strom declared the station under martial law and sent his stormtroopers after Greyshade—he had learned of the administrator's treachery. Greyshade immediately disembarked the ship and prepared for the Imperials to storm Docking Bay 10, allowing Skywalker and Organa to escape on the Spoilt Sport. Both Greyshade and Strom were killed in the ensuing firefight."}, {"tag": "p", "text": "Although the two Rebels had escaped the Wheel in Greyshade's yacht, they weren't home free: they were soon met by a Star Destroyer under the command of the Sith Lord Darth Vader, who had come to the Wheel in search of Skywalker. However, they were saved by the timely arrival of Solo and his Millennium Falcon, which attacked the battleship and allowed the Spoilt Sport to slip away. Skywalker and Organa promptly brought the yacht to Centares, where they traded it to local starship dealer Jorman Thoad for a less-flashy, more dependable scout craft. After Greyshade's death, the station was taken over by Imperial Captain Mulchive Wermis, who reigned as Administrator for several years until the Wheel was liberated by the Rebels. From there, control passed to Master-Com, an ambulatory supercomputer that had been Greyshade's right hand. Master-Com served as Administrator for 97 years, until one day the droid disappeared in 101 ABY. Rumors flew wildly regarding Master-Com's sudden departure, including one that one of its interchangeable droid bodies had been spotted piloting the  antique Spoilt Sport towards a supposed \"Droid World.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Spoilt Sport originally appeared in Star Wars 22, written by Archie Goodwin and released in 1979, During its comic appearances, the ship was illustrated by Carmine Infantino. Although the ship was originally unidentified, its name was finally given over 30 years later in Viva Space Vegas! The History of the Marvelous Wheel, a pair of 2013 StarWars.com reference articles written by Abel G. Peña and Rich Handley."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}