{"url": "Splinter_of_the_Mind%27s_Eye_3", "categories": ["Category:Real-world articles", "Category:Splinter of the Mind's Eye"], "nodes": [{"tag": "h1", "text": "Splinter of the Mind's Eye 3"}, {"tag": "p", "text": "Splinter of the Mind's Eye 3 is the third issue of Dark Horse Comics's adaptation of the novel Splinter of the Mind's Eye. It begins approximately halfway through chapter eight and ends about halfway through the tenth chapter."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Even as Darth Vader and his Imperial garrison approach Mimban from the air, Luke and Leia find that their biggest problems lie under the planet's crust. For deep in the soil lives Mimban's deadliest predator—perhaps the galaxy's deadliest predator—the gigantic, wormlike wandrella; and if the humongous wandrella can't catch them, the subterranean race of aboriginals—the Coway—just might!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Luke and Leia manage to simultaneously evade the wandrella and lure it to its death by hiding in a Thrella well. However, the monster's destruction of the ladder that they used to get into the well forces the pair to temporarily split up from Halla, Hin, Kee, R2-D2 and C-3PO. After agreeing to meet up with the rest, Luke and Leia venture into the planet's subterranean levels."}, {"tag": "p", "text": "Meanwhile, Darth Vader lands on Mimban, drawn by the report on the presence of Luke and Leia on the planet, as well as that of the legendary Kaiburr crystal. He takes charge of Grammel's troops and begins the search for the pair."}, {"tag": "p", "text": "Luke and Leia eventually find Halla and the others captured by a tribe of Coway. In order to free the others, Luke must prove himself in single combat with the tribe's greatest warrior or be killed by the tribe along with the others. The fight goes badly for Luke, and he ends up with his face held underwater by the Coway warrior."}, {"tag": "h2", "text": "Notable differences from the novel"}, {"tag": "p", "text": "The comic adaptation of Splinter of the Mind's Eye remained fairly faithful to its source material. Because of the requirements of the format and the limited space in which to tell the story, a number of elements were either altered or omitted. The departures from the book included:"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}