{"url": "Spotts_TradeChip_Company", "categories": ["Category:Legends articles", "Category:Companies"], "nodes": [{"tag": "h1", "text": "Spotts TradeChip Company"}, {"tag": "p", "text": "Spotts TradeChip Company was a manufacturer of collectible tradechips during the latter days of the Galactic Republic, headquartered in the Jrade District on Coruscant."}, {"tag": "p", "text": "While most of their tradechips depicted smashball, bolo-ball, and podracing stars, they produced one controversial line of Jedi TradeChips in 22 BBY depicting famous members of the Jedi Order. Much like their sports chips, this line of tradechips generated small holograms of the Jedi in question, and contained a short biography and statistics (such as planet of origin, midi-chlorian count, and number of confirmed kills.)"}, {"tag": "p", "text": "Jedi Master Coleman Trebor spoke out to HoloNet News against the tradechips, and attempted to stop their distribution. This was partly because the Order considered merchandising the Jedi to \"dishonor the nature of the Force\", and partly because the information on the tradechips was often wildly inaccurate (for example, misidentifying Yoda as a Lannik, and giving him an incorrect midi-chlorian count of four million.)"}, {"tag": "p", "text": "Wil Jhonems, Spotts' marketing manager, disagreed, pointing out that the Jedi were better role models for children during the troubled times of the Separatist Crisis than professional athletes. He also defended the inaccuracy of the tradechip statistics, pointing out that Spotts used the best information available without access to the library of the Jedi Archives."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Spotts is a near-anagram for Topps, a trading card company which has published several lines of Star Wars trading cards."}, {"tag": "p", "text": "The unreliable information given by the tradechips, especially the misidentification of Yoda's species and the number given for his midi-chlorian count, may be an oblique reference to the notoriously inaccurate fansite run by SuperShadow. SuperShadow also quoted four million as Yoda's midi-chlorian count, although he listed Yoda as a Whill and not a Lannik."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}