{"url": "Splinter_of_the_Mind%27s_Eye_4", "categories": ["Category:Real-world articles", "Category:Splinter of the Mind's Eye"], "nodes": [{"tag": "h1", "text": "Splinter of the Mind's Eye 4"}, {"tag": "p", "text": "Splinter of the Mind's Eye 4 is the fourth and final issue of Dark Horse Comics's adaptation of the novel Splinter of the Mind's Eye. It spans from the second half of the tenth chapter to the end of the novel."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Mimban is like a million other planets in the galaxy—a lot of trees, too much mud, and not much else. But one of Mimban's abandoned temples holds a powerful gem—the Kaiburr crystal—capable of magnifying and clarifying one's perception of the Force. Luke and Leia know it's there—somewhere—and so does Darth Vader. And that makes Mimban a whole lot livelier right now than those other planets!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Luke narrowly escapes drowning to death and wins the duel by using the Force to knock the Coway warrior unconscious. As a result, the Coway spare the lives of Leia, Halla, Hin, Kee, R2-D2 and C-3PO. However, there is little time for them to celebrate, as Luke has sensed the presence of Darth Vader growing closer. He helps to plan the defense of the Coway village against the impending Imperial attack."}, {"tag": "p", "text": "The attack, led by Vader and Grammel, is repelled. As Vader retreats, Luke notices that the Dark Lord is heading in the direction of the Temple of Pomojema, which is said to hold the legendary Kaiburr crystal. Luke, Leia, Halla, the Yuzzem, and the droids sneak out of Mimban's subterranean levels, steal an Imperial transport, and make their way with all haste to the temple."}, {"tag": "p", "text": "After beating Vader to the temple, Luke gets his leg pinned under a heavy block while subduing a giant lizard. While he and Leia struggle to move it, Darth Vader enters the temple. Leia picks up Luke's lightsaber and tries to defend Luke from the advancing Dark Lord. Leia is no match for Vader, who injures her to the brink of death."}, {"tag": "p", "text": "With the help of Hin, who is nearly dead, Luke finally frees himself from the heavy block and catches the lightsaber thrown to him by Leia. Luke puts up a good fight against Vader, eventually cutting off the Dark Lord's right arm, but he is exhausted."}, {"tag": "p", "text": "Vader calls his lightsaber to his left hand, and it seems that Luke's fate is sealed until Vader trips over his severed arm. With a scream of \"NOOOOOO!\" Vader falls into a dark pit."}, {"tag": "p", "text": "Having retrieved it from the statue of Pomojema, Halla gives Luke the Kaiburr crystal, and he uses it to heal himself and Leia. Luke, Leia, Halla, C-3PO and R2-D2 get into the crawler that they commandeered and leave the temple for a meeting on Circarpous IV."}, {"tag": "h2", "text": "Notable differences from the novel"}, {"tag": "p", "text": "The comic adaptation of Splinter of the Mind's Eye remained fairly faithful to its source material. Because of the requirements of the format and the limited space in which to tell the story, a number of elements were either altered or omitted. The departures from the book included:"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}