{"url": "Splinter_of_the_Mind%27s_Eye_1", "categories": ["Category:Real-world articles", "Category:Splinter of the Mind's Eye"], "nodes": [{"tag": "h1", "text": "Splinter of the Mind's Eye 1"}, {"tag": "p", "text": "Splinter of the Mind's Eye 1 is the first issue of Dark Horse Comics's adaptation of the novel Splinter of the Mind's Eye. It covered roughly the first three chapters of the book and the first few pages of the fourth chapter."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Deep in the swamplands of the planet Mimban lies a powerful crystal, capable of giving its possessor an invincible mastery of the Force. In the right hands, it could save the galaxy. But in the wrong hands, it could destroy it. While the explosion of the first Death Star still reverberates through the cosmos, Luke Skywalker finds that the war he thought he won was only a battle, and that the dark side of the Force still stalks the galaxy."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While on a diplomatic mission to the planet Circarpous IV, Luke Skywalker and Princess Leia Organa crash-land on Circarpous V, also known as Mimban. Following the signal of a beacon, they stumble upon an illegal Imperial energy mining operation, the emissions of which forced them to land in the first place."}, {"tag": "p", "text": "After stealing some miners' clothing from a shop, Luke and Leia enter a tavern so that they may eat some real food instead of cube concentrates. When they are nearly found out by the local authorities, Luke and Leia are approached by an old, Force-sensitive woman named Halla. After a bit of conversation with her, Luke and Leia try to get her to help them steal a ship so that they can get offplanet. Halla agrees to help them, but only if they help her find the legendary Kaiburr crystal first."}, {"tag": "p", "text": "Halla manages to get Luke and Leia to agree to the arrangement by allowing Luke to touch the shard of the crystal that she brought with her as proof. The deal is then sealed when Halla brings up the threat of a Force-sensitive in the Imperial government coming into possession of the crystal, attracted by the disturbance in the Force that was caused by Luke touching the shard."}, {"tag": "p", "text": "As they depart from the tavern in order to collect R2-D2 and C-3PO, Leia, angered by Luke's treatment of her in the tavern, gets her revenge by pushing him into the mud. Luke pulls her in with him and a mudfight ensues. They attract the attention of local ruffians who break up the fight but have intentions other than to \"apprehend law-breakers.\" Luke attacks the ringleader in order to free Leia from his grasp, but finds that he's in for more than he expected when the ringleader begins to fight him with a large number of knives…"}, {"tag": "h2", "text": "Notable differences from the novel"}, {"tag": "p", "text": "The comic adaptation of Splinter of the Mind's Eye remained fairly faithful to its source material. Because of the requirements of the format and the limited space in which to tell the story, a number of elements were either altered or omitted. The departures from the book included:"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}