{"url": "Spots_Podal/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Gotals", "Category:Males"], "nodes": [{"tag": "h1", "text": "Spots Podal"}, {"tag": "p", "text": "Spots Podal was a Gotal male who lived on the planet Coruscant during the Clone Wars. Around 20 BBY, Podal encountered the fugitive Jedi Padawan Ahsoka Tano, who was fleeing the combined forces of the Jedi Order and Coruscant Security Force. The Gotal gave Tano his cloak so that she could conceal herself in exchange for a ration bar."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Spots Podal, a Gotal male, lived on the galactic capital planet of Coruscant during the final years of the Galactic Republic. Podal stayed on the streets of Coruscant's underworld. Around 20 BBY, Podal was drinking a bottle of alcohol on one of the streets when he encountered the Togruta Jedi Padawan Ahsoka Tano. Tano was fleeing the forces of the Jedi Order and the Coruscant Security Force after being framed for the murder of Letta Turmond—who bombed the Jedi Temple's hangar bay—and for involvement in the Temple hangar's bombing. Tano gave Podal a ration bar, and in exchange he gave her his cloak, which she wanted in order to conceal herself. After the deal was made, Tano left Podal to eat his bar and enjoy his drink."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Podal had gray fur and yellow eyes, and wore a green cloak that had holes in its hood for his cranial horns. He spoke and comprehended Basic, although he bleated his words during conversation. The Gotal was initially reluctant when Tano offered him a ration bar but ultimately gave her his cloak when she explained that she needed it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Spots Podal first appeared in the episode \"To Catch a Jedi\" of the television series Star Wars: The Clone Wars, in the program's fifth season. The episode aired on February 23, 2013. Although he was not identified in the actual episode, Podal's name was revealed in the episode's accompanying guide on StarWars.com. He was voiced by Supervising Director Dave Filoni. Filoni—who had previously voiced the mercenaries Embo and Jakoli in the episodes \"Bounty Hunters\" and \"The Box\"—has noted that he is reluctant to provide voicework for various characters in the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}