{"url": "Sprax", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Males", "Category:Nalroni", "Category:Smugglers", "Category:Vigos"], "nodes": [{"tag": "h1", "text": "Sprax"}, {"tag": "p", "text": "Sprax was a Nalroni, a Vigo of Black Sun, and operator of various illegal trade groups."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sprax' networks of smugglers, pirates, and black market traders, stretched across the galaxy. During the Galactic Civil War, Sprax made a considerable fortune in trading weapons, medical supplies, and spare parts, often under Prince Xizor's orders, favoring the Alliance to Restore the Republic over the Galactic Empire when possible. Sprax's center of operations was located along the Sisar Run near Hutt Space."}, {"tag": "p", "text": "Sprax began his career as an executive within the Celanon-based Jatayus Trading Consortium, but left the organization before rising to its upper-leadership, choosing instead to take a secret position in Black Sun. Under the aegis of the cartel, he served as an apprentice to a guildmaster on Brentaal IV, and later became a division supervisor with Xizor Transport Systems. From XTS, he retired, wealthy and still youthful. It was then that he gained the rank of Vigo."}, {"tag": "p", "text": "By c.3 ABY, he'd grown out of his species' short-lived youth, retaining the rank despite its notoriously low survival rate. In that time, he became one of the foremost smuggler patrons and fences in the Outer Rim. In addition to his Black Sun rival, Vigo Durga, Sprax' main competition along the Sisar Run consisted of several Hutt Clans and the Antar Band, the latter led by Ujin Voli."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "By 3 ABY, Sprax was an aging male by Nalroni standards, so he concealed his graying fur with dye to give it the golden-brown hue of his youth. He wore the long tunic and tailed jackets typical of Brentaal merchants."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}