{"url": "Spurch_Goa", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Diollans", "Category:Imperial Navy personnel of the Galactic Empire", "Category:Males", "Category:Mercenaries", "Category:Nar Shaddaa residents", "Category:Naval Intelligence Agency personnel", "Category:Sector Rangers"], "nodes": [{"tag": "h1", "text": "Spurch Goa"}, {"tag": "p", "text": "Spurch \"Warhog\" Goa was a Diollan bounty hunter and former mercenary."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Spurch Goa operated as a mercenary before finding work as an investigator for Imperial Navy Intelligence. He was assigned to the inquest of a drill instructor named Thaffe, who had been accused of murder aboard a space station. Goa solved the crime and exonerated Thaffe, resulting in a strong friendship. Goa moved on to work as part of a Grand Moff's security detachment until Thaffe retired. The pair volunteered to become Sector Rangers, where, over a five year stretch, they made a name for themselves by stopping slavers and pirates."}, {"tag": "p", "text": "While working a case, Goa and Thaffe ran into fellow Sector Ranger Dyyz Nataz. Thaffe had trained Nataz in anti-terrorist operations two years previously, and the trio agreed to cooperate on the case. Nataz had discovered a credit counterfeiting operation based on an old ore freighter. While infiltrating the starship, they were ambushed by Ganks on the order of Jabba Desilijic Tiure, who had set a trap as revenge for being harassed by investigators. Goa and the other two were tortured for hours without revealing any information; eventually the Ganks made the trio play sabacc to determine which of them would die first. Thaffe intentionally lost, causing the Ganks to execute him immediately. Goa, enraged by Thaffe's death, and Nataz managed to free themselves and dispatch the Ganks before setting the freighter on a course to destroy a palace asteroid owned by Jabba."}, {"tag": "p", "text": "Goa and Nataz were relieved of duty, and a bounty was levied on them by Jabba. The pair fought off attempts on their lives by bounty hunters, eventually recycling their equipment and becoming bounty hunters themselves."}, {"tag": "p", "text": "Goa was saved from Gorm the Dissolver by young Greedo, whom he took as an apprentice. Greedo sold Spurch information detailing a covert Rebel Alliance munitions facility in the warehouse district on Nar Shaddaa. Spurch in turn sold this information to the Galactic Empire for 60,000 credits. He paid 200 credits worth to Greedo for the tip on the Rebel Base and split the rest with his current partner Dyyz Nataz."}, {"tag": "p", "text": "Darth Vader used this information to lay siege to the Corellian Sector district where the Rebels were hiding. Soon after this event, Spurch boarded his ship, the Nova Viper and traveled to the planet of Tatooine. He introduced Greedo to Jabba Desilijic Tiure and helped to secure him an exclusive contract to hunt down the Corellian smuggler, Han Solo."}, {"tag": "p", "text": "A short time later, Spurch met with two Rodian bounty hunters named Thuku and Neesh. They were of the Chattza Clan working for the warlord, Navik the Red. The Rodians wanted to assassinate Greedo, but didn't want to take the responsibility of doing the job themselves. Goa betrayed Greedo to the thugs of Navik, arranging for Greedo's fatal last encounter with Han Solo."}, {"tag": "h2", "text": "Notes"}, {"tag": "p", "text": "In the Diollan tongue, the name Spurch meant brave bug-catcher. Goa hated the name and adopted the nickname \"Warhog\" in order to make himself appear more fierce to his fellow bounty hunters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}