{"url": "Squad/Legends", "categories": ["Category:Legends articles", "Category:Organizational military units"], "nodes": [{"tag": "h1", "text": "Squad"}, {"tag": "p", "text": "A squad was the smallest military unit in many of the galaxy's army formations. The numbers of soldiers in a squad varied, but usually consisted of no more than a dozen personnel."}, {"tag": "h2", "text": "The Clone Wars"}, {"tag": "h3", "text": "Republic army"}, {"tag": "p", "text": "Under the Galactic Republic, squads of ten or twelve soldiers were common among the army forces, but in the Grand Army of the Republic created during the Clone Wars, a standard clone trooper squad consisted of nine soldiers, led by a commanding sergeant, with four squads forming a platoon. Although the GAR squads, and later stormtroopers squads, were smaller in amount than the Old Republic squads, they made up for the comparative lack of manpower by utilizing superior training as well as a more thorough usage of coordinated small-unit tactics."}, {"tag": "p", "text": "Otherwise, elite clone of the Special Operations Brigade, including clone commandos, clone assassins and ARC commandos operated in squads of four, such as Delta Squad. The four men squad included a sergeant and five such squads formed a troop."}, {"tag": "p", "text": "Republic Peace Officer squads were made of five men."}, {"tag": "h3", "text": "CIS army"}, {"tag": "p", "text": "In the Separatist Droid Army, the Order of Battle of its different members was maintained. Trade Federation infantry squads were made of eight battle droids, without squad leader, with seven squads forming a platoon. Geonosian warriors did not have any military organization. Commerce Guild infantry squads were made of six Gossam soldiers, including a squad leader, with six squads forming a troop. Corporate Alliance infantry squads were made of twelve Koorivar Fusiliers, led by a sergeant, with three squads forming a platoon. IBGC infantry squads were made of nine Muun Guards or nine battle droids, led by a sergeant, with five squads forming a troop."}, {"tag": "h2", "text": "Galactic Empire"}, {"tag": "h3", "text": "Imperial Army"}, {"tag": "p", "text": "When the Republic gave way to the New Order, the non-clone line forces of the Imperial Army retained the GAR's standard squad strength of a sergeant and eight other troopers. On the sergeant's recommendation, one soldier was normally appointed Corporal, also known as the \"one-man\", and a brevet list was created which numbered each trooper down to the \"eight-man\", denoting the order in which authority devolved to them if the squad's more senior soldiers were killed. This likewise led to the expressions \"Lower than the eight-man\" and \"Certain as the one-man's mind.\""}, {"tag": "p", "text": "As with larger units Imperial Army squads could be augmented, with two squads paired together. In these instances the sergeant of the first squad was given the brevit rank of \"lead sergeant\" and his corporal directed their squad during his absence. More commonly a squad was just augmented with a small detachment, typically a heavy weapons detail supporting a line squad."}, {"tag": "p", "text": "By the time of the aftermath of the Battle of Yavin, the Empire had been experimenting with the usage of smaller squads, although these were still rare, with the 8-man squad still acting as the backbone of the Imperial Army."}, {"tag": "h4", "text": "Line Squad"}, {"tag": "p", "text": "Infantry units were called “line” units in the Army, and the line squad was considered the backbone of the army. However, high losses against the Rebel Alliance caused the Empire to rethink how they could improve the line squad as cost-effectively as possible. This led to the process of equipping each squad with a Light repeating blaster to increase their short range firepower. However, only in three sectors were more than half of the squads equipped with these blasters by the time of the Battle of Yavin: the Shwuy sector, Harron and Nembus sector. On heavily populated worlds such as Uviuy Exen and Trammen, every line squad was equipped with a light repeating blaster."}, {"tag": "h4", "text": "Heavy Weapons Squad"}, {"tag": "p", "text": "These heavy weapon squads were armed with either two- to three-man Medium repeating blasters or three-man Heavy repeating blasters. Heavy weapons squads were usually attached to other platoons in order to provide additional firepower."}, {"tag": "h4", "text": "Sharpshooter Squad"}, {"tag": "p", "text": "These squads consisted of Special Missions troopers who had shown accuracy above standard with their weapons and could \"reach out and touch\" the enemy at a distance. Each trooper also received basic demolition and other training, and while not officially part of their Order of Battle practically every squad included a light repeating blaster. Due to their above average skill sets and training, the brevet corporal would be chosen prior to deployment based on the type of mission the squad was assigned, while each trooper was expected to improvise on the battlefield should both NCOs be incapacitated."}, {"tag": "h4", "text": "Engineering Squad"}, {"tag": "p", "text": "Engineering Squads were composed of Special Missions troopers trained in a variety of combat engineering skills. Engineering squads were expected to get into, get around or go over any obstacle through the creative use of explosives. As the only Imperial tech-squad directly involved in combat they were also expected to be able to operate, repair and dismantle nearly any equipment and gear found on a mission. One of the squad's members would also be a demolition expert with experience operating as part of the sharpshooter squad, making them doubly dangerous. These squads had no standard gear, and would use anything they could get their hands on, such as thermal detonators, medpacs or Portable Sensor Arrays."}, {"tag": "h4", "text": "Repulsorlift Squad"}, {"tag": "p", "text": "These mechanized squads had the same composition as line squads with the addition of two light repulsorlift transports. Each vehicle had a crew of four, consisting of a mechanic, a driver, a sensor/tech officer and a gunner/commander. The sergeant's vehicle was equipped with an additional DER and operator located in the transport compartment."}, {"tag": "h4", "text": "Heavy Weapons Repulsorlift Squad"}, {"tag": "p", "text": "Heavy Weapons Repulsorlift Squads had additional armaments built into their vehicles, such as a heavy repeating blaster, a 4.4 grenade launcher or light laser cannon. These weapons could be dismounted and used by the infantry for additional firepower."}, {"tag": "h4", "text": "Scout Squad (Lance)"}, {"tag": "p", "text": "A scout squad was also called a scout “lance”. Consisting of five personnel including the sergeant, they were generally equipped with speeder bikes with a few also using two-man vehicles. Scout troopers were trained to repair and maintain their bikes, which reduced the need for support personnel. In contrast to the more usual practice, the Empire emphasized unit heritage and pride in its scout squads, which were often recruited from worlds with a strong tradition of mounted warriors."}, {"tag": "h4", "text": "Armor Section"}, {"tag": "p", "text": "An armor section consisted of either two light or medium repulsortank (or their equivalent) or a single heavy repulsortank (or it's equivalent). These units existed only as part of the Order of Battle for an armor platoon and never deployed by themselves."}, {"tag": "h4", "text": "Artillery Section"}, {"tag": "p", "text": "Similar to an armor section the artillery section consisted of either two light artillery pieces or one medium or heavy artillery piece. However an artillery section could be deployed by itself to support another platoon, a process known as \"grafting,\" although this only took place if there was enough time before an attack to plan."}, {"tag": "h3", "text": "Stormtroopers and scout troopers"}, {"tag": "p", "text": "Just as the standard Army squad consisted of eight soldiers and a sergeant, Imperial Stormtrooper squads were said to have nine men as standard in 6 ABY; a nine-man squad would also fit with an implied stormtrooper platoon strength of 45 men, and the ten-man stormtrooper bodyguard assigned to a Moff was perhaps a nine-man squad plus an officer in command. However, Rebel sources believed that the Empire was also using smaller stormtrooper squads, and by 22 ABY, the standard squad of the 501st Legion apparently consisted of units of four troopers, such as Unit Aurek-Seven, one of ten such units in Aurek Company. According to Section 682.T.ST88 of the Imperial Stormtrooper Corps Field Manual, although the minimum unit allowed in the Stormtrooper Corps was a squad, the squad itself could be subdivided further into two fire teams and organized into wedge formations, with the fire team leader being at the tip of each wedge, in order to permit maximum firing range in every direction and allow ready communication between members, which was usually advised when the composition or position of enemy forces were uncertain."}, {"tag": "p", "text": "By 137 ABY, a squad in the 407th Stormtrooper Division consisted of four troopers led by a sergeant. One of the troopers was armed with a heavy support weapon, while the others used conventional blaster rifles. Their officer was a lieutenant, but so far the number of squads in a platoon or company is unknown."}, {"tag": "p", "text": "Imperial scout troopers were organized differently, drawing both recruits and traditions from worlds where cavalry combat had a prominent history. They were organized in five-man units known as lances, with each trooper being expected to care for his own mount—usually a one-seater speeder bike like the Aratech 74-Z, although some lances combined one bike with a pair of two-seat flyers. Additionally, although part of the Stormtrooper Corps, scout troopers were often integrated into the Imperial Army order-of-battle: two lances, together known as a scout squadron, were combined with two infantry squads in each platoon of a Repulsorlift Battalion's scout troop, while the scout platoon of a special missions company consisted entirely of biker scouts."}, {"tag": "h2", "text": "Other military forces"}, {"tag": "p", "text": "During the Galactic Civil War, squads comparable to those of Imperial forces served as the most basic component elements of Rebel Alliance SpecForces regiments, but for active duty, mission-specific units were formed with little regard for the nominal roster or formal organizational doctrine."}, {"tag": "p", "text": "In the Chiss Expansionary Defense Force, a standard squad apparently numbered six warriors, divided into two half-squads of three."}, {"tag": "p", "text": "Among the Mandalorians, squads (such as Viper Alpha, Vertigo, and Headhunter) were larger than in other armed forces; this may be due to the fact that the Mandalorians seemed to use \"squad\" and \"company\" interchangeably."}, {"tag": "p", "text": "For Yuuzhan Vong warriors, three squads composed a unit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}