{"url": "Squad_40", "categories": ["Category:Legends articles", "Category:Imperial Army squads", "Category:Imperial Special Forces units"], "nodes": [{"tag": "h1", "text": "Squad 40"}, {"tag": "p", "text": "Squad 40 was an Imperial commando squad belonging to the Imperial Commando Special Unit of the 501st Legion. It was formed shortly after the formation of the Galactic Empire, made up of surviving commandos from the Grand Army of the Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In their first mission, Squad 40 was tasked to capture the Antarian Ranger Jilam Kester, who was suspected of assisting the evacuation of Jedi. When Squad 40 stormed Kester's hideout, they were surprised when they came face to face with Jedi Master Iri Camas, the former director of Special Operations Brigade and their former superior. Following orders, they tried to take him down but the Camas distracted them long enough to allow Kester to escape. In the end, Camas sacrificed himself by igniting a gas pipe, taking Bry with him when Bry was killed by Camas's lightsaber. After Bry's death, Ennen refused to leave his comrade's body until Bry was given a proper Corellian cremation. Their new commanding officer, Roly Melusar, made good on that promise and gave him a proper cremation."}, {"tag": "p", "text": "They later went on a mission in Coruscant's undercity, tracking a man they believed to be a Jedi. Upon that man's death at the hands of Ennen, they were shocked to discover he was nothing more than a petty thief, having taken the lightsaber from a Jedi's corpse or off the street following Order 66. Ennen would later commit suicide due to both Bry's death and the guilt of having killed a civilian. Later on they were tasked with a mission of eliminating a Jedi named Borik Yelgo on the Coth Fuuras space station. After sorting through crowds of civilians Squad 40 found the Jedi who was issued a warning command and then ran and was cornered by the gate leading to the docking area. There Squad 40 surrounded the Jedi and opened fire, though this failed because Yelgo deflected most of the bolts and jumped off the gate behind Squad 40. Seeing as there was no where to go Yelgo force gripped and attempted to throw a heavy piece of transparisteel at Darman, which failed because Rede shot at the glass above Yelgo and distracted him giving Rede enough time to come face to face with Yelgo and then terminate him with two subsequent rounds from his DC-15 sidearm."}, {"tag": "h2", "text": "Appearances"}]}