{"url": "Sprint-class_rescue_craft/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Galactic Republic starship classes", "Category:Medical starship classes", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "Sprint-class rescue craft"}, {"tag": "p", "text": "The Sprint-class rescue craft, also known as a Med runner, was a medical rescue craft manufactured by SoroSuub Corporation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The SoroSuub Sprint-class medical rescue craft was a fast-response vessel for deep space emergencies. While similar in appearance to the Telgorn Gamma-class assault shuttle, having the same flat and wide profile, the Med Runner's design and mission profile was significantly different. A non-military craft, the Med Runner had civilian grade shielding and armor, with the craft carrying no weapons. A powerful hyperdrive and ion engine package, coupled with a military-grade sensor suite, allowed the ship to respond to distress calls and reach a disaster scene faster than even other rescue craft."}, {"tag": "p", "text": "The Med Runner was extremely fast and agile - ideal for navigating battle debris - while sophisticated and highly sensitive life form indicators could detect survivors even amidst the chaotic sensor environment of starship wreckage. The ship's interior had several small well-equipped medical bays, with a total capacity of forty patients. Emergency trauma suites, while lacking the capabilities of a bacta tank, could stabilize the critically injured; allowing the Med Runner to transport the patient to a more sophisticated medical facility."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Med runners were used by the Galactic Republic during the Clone Wars. Several med runners transported the dead and wounded to Coruscant following the Battle of Boz Pity. The med runner Bright Flight was hijacked by Asajj Ventress, who used it to escape into the Unknown Regions after her betrayal at the hands of Count Dooku."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}