{"url": "Spy_ray", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Emplacement sensors", "Category:Nasan Godera's projects", "Category:Republic Strategic Information Service", "Category:Surveillance equipment"], "nodes": [{"tag": "h1", "text": "Spy ray"}, {"tag": "p", "text": "A spy ray was a sophisticated surveillance device developed by Doctor Nasan Godera for the Galactic Republic during the Great Galactic War with the Sith Empire. By projecting beams of particles that would pass through or reflect off of matter depending on the object's density, the spy ray was able to generate high-resolution images of targets across an entire star system, and it saw great use in the hands of the Strategic Information Service, the Republic's primary intelligence agency."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The spy ray was built with a square base that supported a long, rectangular section that could pivot and rotate to focus on the target. It was controlled by a panel on the side of the base, which allowed the user to adjust the settings and view the ray's target through an apparatus similar in shape to electrobinoculars. When activated, the spy ray projected a beam of particles that would either reflect off the target or pass through it, depending on the intensity of the beam. The particles that were reflected would be translated into high-resolution images of the target by the spy ray's base, allowing the user to view objects as small as the mouth of a shyrack across an entire star system. While it was not designed as a weapon, the spy ray's beam could be adjusted to bring its frequency with ranges that weaponized it. Additionally, the spy ray had a minimum safe distance of 500 kilometers, as objects subjected to the beam at a distance less than were likely to disintegrate. The materials necessary to build a spy ray were enough for three humanoids and an astromech droid to carry in large backpacks, though it took at least two days for three people to build one."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The spy ray was originally created by Doctor Nasan Godera, a scientist who served as the chief designer for the Galactic Republic's Advanced Development Laboratories during the Great Galactic War with the Sith Empire. Godera finished the device sometime before the end of the war in 3653 BBY, when he resigned in disgust over the Republic's acceptance of the Treaty of Coruscant. The spy ray was considered to be the best reconnaissance technology of its time during the subsequent Cold War, where it saw use by the Republic's intelligence agency, the Republic Strategic Information Service. SIS agent Theron Shan was trained in the construction of the spy ray, and he kept the necessary materials aboard his ship, the Sojourner, in case he needed to use it."}, {"tag": "p", "text": "On a mission to the Imperial-held Vesla system to investigate what the Dark Councilor Darth Mekhis was doing there, Shan constructed a spy ray on an outlying planet with the help of the Twi'lek smuggler Teff'ith; the Jedi Master Ngani Zho; and his astromech, M-6. After two days of construction, Shan used it to examine the planets Vesla Two and Vesla Three—only to find that Mekhis had tested superweapons against the worlds, and that the Imperials were using a space station known as the Sun Razer to harvest the energy of the system's sun and construct superweapons. However, the spy ray was left behind when Shan realized the Empire was capable of seeing through the scanner interference caused by the Sun Razer, and the trio was captured aboard the Sojourner by the Harrower-class dreadnought Valor Prevails as they tried to leave the planet's atmosphere."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The spy ray first appeared in Part 3 of The Lost Suns, a story arc in the Star Wars: The Old Republic comic series, published in August 2011. In keeping with the rest of the arc, which introduced a number of characters and locations that would later appear in the video game Star Wars: The Old Republic, the issue used the spy ray to introduce Doctor Nasan Godera, the weapon's designer and a character who would play a major role in the game's Jedi Knight and Imperial Agent class storylines. A reference guide for the game released in 2012, Star Wars: The Old Republic Encyclopedia, included the spy ray in a list of Doctor Godera's projects in the entry on him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}