{"url": "Spy", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Criminal occupations", "Category:Government occupations", "Category:Intelligence", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Spy"}, {"tag": "p", "text": "A spy, or secret agent, was an individual who engaged in clandestine observation or acquisition of sensitive intelligence regarding a person or organization or other target of interest, usually for political, military or financial benefit."}, {"tag": "h2", "text": "History of espionage"}, {"tag": "h3", "text": "Era of the Galactic Republic"}, {"tag": "p", "text": "During the Battle of Christophsis, an investigation led by Clone Captain Rex and Clone Commander Cody revealed that troop movements had been relayed to Separatist forces, allowing the enemy to preemptively attack Republic strike teams. The traitor was identified as the clone trooper sergeant nicknamed \"Slick\" and was apprehended, though not before he significantly damaged the base's weapons depot."}, {"tag": "p", "text": "Following the loss of R2-D2 during the Battle of Bothawui, R3-S6 was assigned to Jedi General Anakin Skywalker as a replacement. Unbeknownst to Skywalker and his Padawan, Ahsoka Tano, R3-S6 was acting as a covert confederate agent, attempting to facilitate the sale of R2-D2 to General Grievous."}, {"tag": "p", "text": "Suspecting Senator Rush Clovis was aiding the Confederacy of Independent Systems, the Jedi Council recruited Senator Padmé Amidala to spy on him. Amidala accompanied Clovis to Cato Neimoidia where she recovered evidence of a large droid foundry on Geonosis. She was discovered and, following an attempted poisoning by Lott Dod, was extracted by Anakin Skywalker."}, {"tag": "p", "text": "Obi-Wan Kenobi undertook a secret operation disguised as Rako Hardeen, in an attempt to gain the trust of bounty hunters Cad Bane and Moralo Eval. Despite interference from Anakin Skywalker and Padawan Tano, Obi-Wan's mission was an eventual success, revealing a plot by Count Dooku to capture Supreme Chancellor Sheev Palpatine."}, {"tag": "p", "text": "Rush Clovis, now a defector from the Separatists, requested the help of Padmé Amidala to uncover the bankruptcy of the InterGalactic Banking Clan via the infiltration of the vault, a facility ordinarily off limits to outsiders."}, {"tag": "p", "text": "The Jedi Council granted Anakin Skywalker a seat on the Council, per the direction of Supreme Chancellor Palpatine, because they wanted Skywalker to spy on the Chancellor and his activities, something that Skywalker felt was both treason and a violation of the Jedi Code."}, {"tag": "h3", "text": "Era of the Galactic Empire"}, {"tag": "p", "text": "Ezra Bridger infiltrated the Academy for Young Imperials on the planet Lothal, disguised as an Imperial cadet, with the intention of acquiring an Imperial decoder containing the location of an exceptionally large kyber crystal. With the help of Zare Leonis, Bridger succeeded and escaped with another cadet, Jai Kell. Leonis opted to remain behind in order to learn more about the disappearance of his sister Dhara. With the aid of his girlfriend, Merei Spanjaf, and the rebel cell known as the spectres, Leonis's efforts eventually came to fruition with the rescue of his sister, who had been absorbed into Project Harvester. On several occasions, Bridger and the spectre cell dealt with an anonymous Rebel spy known by the codename \"Fulcrum\"—later revealed to be former Jedi Padawan Ahsoka Tano. When Tano was presumed dead, Imperial Security Bureau agent Alexsandr Kallus took on the name, passing information to the Rebels, eventually defecting when his treason was discovered by Grand Admiral Thrawn."}, {"tag": "p", "text": "Spies for the Rebel Alliance sent secret Death Star plans to Leia Organa on the Tantive IV following the Battle of Scarif. The squad known as Rogue One, led by Rebel Alliance Intelligence Service agent Cassian Andor, infiltrated the Imperial security complex on Scarif and retrieved the plans, transmitting them to the Rebel fleet. The Alliance became aware of the Death Star project from Andor's informant Tivik, and from the defecting Imperial pilot Bodhi Rook, who passed Galen Erso's information about the station's weakness to Saw Gerrera."}, {"tag": "p", "text": "Following the destruction of Alderaan, the Empire made use of a human female by the name of Tula, who, under duress, manipulated her sister, Tace, into unwittingly revealing the whereabouts of Alderaanian survivors."}, {"tag": "p", "text": "On Nar Shaddaa, Grakkus the Hutt was apprehended, along with his captive, Luke Skywalker, owing to the efforts Sergeant Kreel, also known as Imperial agent 5241, planted in the Hutt's Palace after Grakkus's collection of Jedi artifacts attracted the attention of the Empire."}, {"tag": "p", "text": "When the second Death Star was being constructed, the Alliance's Bothan spies discovered that the super weapon was being protected by a shield generator on a nearby forest moon called Endor. That valuable information came at the cost of many Bothan lives."}, {"tag": "h3", "text": "Era of the Resistance and First Order"}, {"tag": "p", "text": "Thirty years after the Battle of Endor, the spy Kazuda Xiono undertook a mission on the Colossus platform for the Resistance to find out who on Castilon was helping the First Order build up its military forces."}, {"tag": "p", "text": "Around the same time, the First Order used the junk boss Unkar Plutt to find BB-8. After Finn, Rey, and BB-8 escaped from Jakku, the First Order sent the Guavian Death Gang and the Kanjiklub as their spies to find the fugitives. Bala-Tik informed the Order that Han Solo had the droid on board the Millennium Falcon."}, {"tag": "p", "text": "The First Order then used mercenary Bazine Netal as one of its spies. When she was posing a girlfriend to Grummgar at Maz Kanata's castle on Takodana,[source?] Netal informed the Order that BB-8 was there.  The Resistance also maintained a spy droid network, and one of its agents, GA-97, alerted the Resistance that BB-8 was at the castle."}, {"tag": "p", "text": "During a mission to Sinta Glacier Colony, Boolio gave Poe Dameron information that came from a high-ranking spy inside the First Order. The spy was revealed to be General Armitage Hux when he saved Dameron, Finn and Chewbacca from execution. Hux explained that he did not want the Resistance to win, he just wanted Kylo Ren to lose. Allegiant General Pryde killed Hux for his treachery."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}