{"url": "Squalls", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Endor strike team personnel", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Squalls"}, {"tag": "p", "text": "Sergeant Squalls was a Rebel Alliance Special Forces trooper during the Galactic Civil War who participated in the defense of Echo Base during the Battle of Hoth and later fought to destroy the Galactic Empire's second Death Star battlestation during the Battle of Endor. He was one of two demolitions experts to join General Han Solo's strike team, whose mission was to infiltrate the Imperial defenses on the Forest Moon of Endor and blow up the shield generator protecting the Death Star. Along with Sergeant Junkin, Squalls selected and volunteered to carry the strike team's dangerous heavy explosives, which were successfully used to complete the Rebels' sabotage mission, leading to victory in the climactic Endor battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Battle of Hoth and Endor infiltration"}, {"tag": "p", "text": "Squalls served as a sergeant in the Alliance to Restore the Republic's Special Forces during the Galactic Civil War against the Galactic Empire. He was among the 1,000 SpecForce troopers who were assigned to protect Echo Base, the Alliance High Command headquarters on the ice planet Hoth, under the command of Major Bren Derlin. In 3 ABY, Squalls participated in the defense of the outpost against the Imperial assault in the Battle of Hoth, a major Rebel defeat. Following their evacuation from Hoth, Squalls and his fellow commandos remained stationed with the Alliance Fleet until 4 ABY, when they got their chance to strike back."}, {"tag": "p", "text": "The Alliance had discovered that the Empire was constructing a second Death Star battlestation above the Forest Moon of Endor. In order to destroy the station, the Alliance first had to deactivate the planetary shield generator protecting the Death Star from Endor's surface. Generals Crix Madine and Han Solo assembled a strike team for the Endor mission, selecting the best Rebel commandos from the elite troops who had defended Echo Base, which included Squalls. Madine trained these soldiers for the mission to come before turning them over to Solo, who placed his special tactics unit under the ground command of Major Derlin. Squalls and Sergeant Junkin, the squad's two demolition experts, selected the highly volatile explosives needed to destroy the shield generator—enough charges to take out their target in one big blast—which they also volunteered to carry."}, {"tag": "p", "text": "Squalls and the strike team infiltrated Endor aboard a stolen Imperial Lambda-class shuttle, the Tydirium. Posing as a technical group and using a secret Imperial code, they were allowed to pass through the heavy Star Destroyer blockade in Endor's orbit. Once on the moon's surface, the strike team proceeded to reconnoiter the area but soon encountered Imperial scout trooper patrols, which forced Solo to direct Derlin to lead the squad ahead and rendezvous with him at the shield generator bunker."}, {"tag": "h3", "text": "Victory on the Forest Moon"}, {"tag": "p", "text": "Making their way toward the shield generator later that afternoon, Squalls and the rest of the strike team bypassed several Imperial scouts without compromising their position. At nightfall, they camped in a well-covered shallow ravine, posting two sentries and setting up a blanket grid with their scanning equipment. They were barely into their first sleeping shift when they detected an All Terrain Scout Transport walker on patrol moving toward their position."}, {"tag": "p", "text": "Derlin ordered the squad to fan out without breaking camp, hoping that the AT-ST would simply pass their position, but the walker continued straight toward them. With no alternative but to act, the squad quickly jammed the walker's transmissions and disabled its spotlights, before circling around the machine to keep it blind as to the source of the attack. However, the AT-ST then opened fire at random, which greatly risked alerting other Imperials to the squad's presence. In response, the group's medic, Corporal Delevar, fired a smoke canister directly into one of the walker's cockpit viewports, which forced its two pilots to abandon the vehicle and surrender to the strike team. After forcing the walker pilot to make a few call-ins to explain the AT-ST's absence, the squad continued on the following morning and rendezvoused with Solo at the shield generator as planned."}, {"tag": "p", "text": "Solo and the strike team's command crew, which included Princess Leia Organa and the Wookiee Chewbacca, had formed an alliance with Endor's native Ewoks, who showed the Rebels a route to the shield bunker's rear entrance. Solo led the strike team into the bunker's interior, where they began placing the explosive charges in preparation for destroying the shield generator, but they were soon ambushed and captured by the Imperial forces stationed on the moon. Subsequently led back outside the bunker, the strike team's capture proved short-lived, as the Ewoks attacked the Imperials, which ultimately turned the tide of the battle in the Alliance's favor. The strike team eventually retook the bunker and successfully blew up the shield generator, leading to the destruction of the Death Star and victory in the climactic Battle of Endor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As veterans of the Battle of Hoth, Squalls and his fellow Rebel commandos had impressed General Han Solo with their loyalty and dedication in action, which prompted him to select their hardened unit for the highly dangerous Endor mission. The defeat at Hoth had left Squalls and his squadmates hungry for revenge against the Empire, so they all voluntarily and eagerly accepted the risks of joining the Endor strike team."}, {"tag": "p", "text": "The large amount of explosives necessary to blow up the Endor shield generator added an extra layer of danger to the strike team's mission. Nevertheless, Squalls and fellow commando Junkin volunteered to carry the highly volatile explosives."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Squalls was one of two demolitions experts to join the Endor strike team. He and the other strike team members were all masters at small-squad tactics, sabotage, and nighttime combat, and they were also trained in cold-climate combat from their service with the SpecForce complement on Hoth. Han Solo selected his strike team members based on their resourcefulness and ability to devise creative solutions."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Squalls and the rest of the Endor strike team were equipped with basic commando gear, which included a standard comlink, a low-feedback scanner, a sensor scrambler, a heavily muffled blaster, and full-forest-camouflage fatigues."}, {"tag": "p", "text": "Both Squalls and Junkin carried the strike team's explosives, which were sealed in ray-shielded cases and stored in thermal-resist packs for protection during a firefight. These explosives were mostly thermal detonators as well as 7-PrG proton grenades."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Squalls was created for the 1990 sourcebook Galaxy Guide 5: Return of the Jedi, written by Michael Stern as a supplement for West End Games' Star Wars: The Roleplaying Game. The character was introduced in a section detailing the Rebel commandos who comprised the Endor strike team."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}