{"url": "Squadrons_Over_Corellia", "categories": ["Category:Real-world articles", "Category:Star Wars Galaxies Trading Card Game"], "nodes": [{"tag": "h1", "text": "Squadrons Over Corellia"}, {"tag": "p", "text": "Squadrons over Corellia is the first expansion of Star Wars Galaxies Trading Card Game released on December 16, 2008. It includes more than 200 new cards, including more than 20 new Loot cards (i.e. special versions of normal cards), such as an all-new Alpha-3 Nimbus-class V-wing starfighter."}, {"tag": "p", "text": "This set introduces new item subtype, starships, from X-wings and TIE Fighters to a KSE Firespray and the Z-95 Dire Hound. New gameplay allows these cards to support ground units with heavy firepower, transport units from quest to quest, or shield your avatar from attacks. The set have also added to the game such iconic characters as Emperor Palpatine, Han Solo, Thrawn, Wedge Antilles and Jabba the Hutt."}, {"tag": "p", "text": "The story mode of this set, represented in Scenarios, revolves around a dogfight in Corellian system. With direct orders from the Emperor, Imperial Special Forces have established a Headhunter squadron on the planet of Corellia. Their mission is to seek out and destroy a secret Rebel base on the Corellian moon of Talus. Long rumored to be just a reconnaissance post, the Imperials have learned the base acts as a launching point for Rebel sabotage efforts in the Corellian system and is harboring one of the last known Jedi Knights, Rachi Sitra. The Rebels' only hope is to launch a counterattack on the Imperial squadron in hopes of buying enough time to evacuate Rachi and other key Rebel personnel."}, {"tag": "p", "text": "The Heroic encounter mode of this set recreates the Battle of Mos Espa, revolving around a group of spacers trying to defeat the Tusken King, whose Tusken Raiders are rampaging Mos Espa due to the theft of their relics."}, {"tag": "h2", "text": "Card List"}, {"tag": "h3", "text": "Fixed cards"}, {"tag": "h3", "text": "Premium cards"}, {"tag": "h3", "text": "Heroic Encounter Special Cards"}, {"tag": "h3", "text": "Loot Cards"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Artists"}, {"tag": "p", "text": "This is the list of notable artists who provided original art for the second game expansion."}, {"tag": "p", "text": "The complete list of artists can be found here."}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}