{"url": "Squadron_Three_(Shadow_Wing)", "categories": ["Category:Canon articles", "Category:Military stubs", "Category:Imperial starfighter squadrons", "Category:Squadron Three members"], "nodes": [{"tag": "h1", "text": "Squadron Three  (Shadow Wing)"}, {"tag": "p", "text": "Squadron Three was one of six squadrons that formed the 204th Imperial Fighter Wing, a fighter wing of the Galactic Empire during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Squadron Three was a TIE fighter squadron that was part six squadrons in the Galactic Empire's 204th Imperial Fighter Wing. The squadron was led by Captain Wisp, and one of its staff officers was Lieutenant Garmen Naadra. Other members included Duchas Cherroi and Gargovik."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pandem Nai"}, {"tag": "p", "text": "In 4 ABY, Wisp lost almost all of the squadron during the New Republic's attack on Pandem Nai."}, {"tag": "h3", "text": "Cerberon"}, {"tag": "p", "text": "Around 5 ABY, the squadron participated in an attack on Cerberon. After the attack, the squadron were tasked with searching for the New Republic remnant, and one its pilots, Lieutenant Garmen Naadra, was killed in the caverns beneath Troithe. Naadra was the first pilot lost since the battle against the Lodestar."}, {"tag": "h3", "text": "Hyperspace upgrades"}, {"tag": "p", "text": "Sometime after leaving Cerberon, before the smirmish in the Ciaox Verith system, the squadron's ships were retrofitted with hyperspace docking rings they'd found in a Clone Wars-era supply cache. This lightspeed capability allowed the squadron's TIEs to carry out rearguard patrol operations in remote systems away from its headquarters on the Yadeez."}, {"tag": "h3", "text": "Chadawa and Jakku"}, {"tag": "p", "text": "Later that year, the squadron fought in a battle at Chadawa, and then later at the Battle of Jakku, where the 204th were defeated by General Hera Syndulla's New Republic forces."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}