{"url": "Squeerie", "categories": ["Category:Legends articles", "Category:Males", "Category:Scavengers", "Category:Squibs"], "nodes": [{"tag": "h1", "text": "Squeerie"}, {"tag": "p", "text": "Squeerie was a Squib scavenger who operated on the planet Almas under an exclusive contract from Klis Joo, a former Jedi and the mayor of Forard. He led a salvage team made up of fellow Squibs and a Trandoshan named Korq."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Squeerie was either born on Almas or immigrated there. After the former Jedi Klis Joo became the mayor of Forard, Squeerie negotiated a contract to operate the only licensed salvage company on the world. He formed a team of fellow Squibs and hired a Trandoshan named Korq for his ability to tear apart found components."}, {"tag": "p", "text": "Around 20 BBY, Squeerie and his crew found a crashed airspeeder and started salvage operations. There was a body in the wreckage, so the team respectfully covered it with a tarp. Still, salvage was salvage, and Squeerie and his mates got to work."}, {"tag": "p", "text": "They were approached by a team working for Jedi Master Lanius Qel-Bertuk, to find some missing Jedi. Fearing unlicensed competitors, Squeerie tried to shoo them away, but the strangers bartered with the Squib for a chance to view the wreckage. There, they identified the body as that of a human Padawan named Alkin Saad. They also determined that the speeder crashed due to an explosion in its repulsor engine."}, {"tag": "p", "text": "Squeerie and his crew soon found themselves beset by another outsider, a crazed Duros whom the other strangers seemed to recognize. The salvagers stepped aside while the outsiders dealt with one another; eventually the agents subdued the Duros, who turned out to be a Jedi named Tantron Dow, master of the fallen Padawan. Squeerie was dismayed to learn that the Jedi was the owner of the crashed speeder, which negated his right to salvage the wreck. The Duros explained that the damage to his airspeeder came from someone firing on him with a cannon. Squeerie paid the agents some credits to thank them for saving him from the crazed Jedi. Then the Duros set them on their way and negotiated passage back to the Almas Academy in Forad. Squeerie was just happy to make some profit from the situation."}, {"tag": "p", "text": "Some years later, Almas Academy was destroyed by orbital bombardment during Order 66. Squeerie still held his license two years after the attack, and thus had the right to salvage the academy ruins. At one point, he sent a team there under the command of a Squib named Jiminaldo-mabbramsti (Jimi). The team encountered resistance from a rival group of Ugor salvagers, but agents of Jedi Master Denia intervened."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Squeerie was a typical member of his species and adhered to standard Squib haggling procedures. He had little command of Basic, so it was often hard to determine the meaning behind what he was saying."}, {"tag": "p", "text": "He abided by the law and insisted on the legitimacy of his operations, and he eschewed violence. Even his Trandoshan associate Korq was around for his brute strength at dismantling things rather than as a bruiser. Nevertheless, Squeerie and his team kept blasters at hand in case they needed to stun any aggressors. His teams sometimes met resistance from unlicensed rivals, such as Ugors, so such weapons were occasionally called for."}, {"tag": "p", "text": "He used an airspeeder to move about Almas and quickly reach salvage sites. Squeerie kept a datapad and his salvage license on him when he was at a recovery site."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Squeerie appears in Desert Cries, an adventure in the Living Force campaign for The Star Wars Roleplaying Game from Wizards of the Coast. The Squib is part of an encounter wherein the player characters meet the missing Jedi Tantron Dow. The characters must get past Squeerie to see the wreckage he is salvaging, which holds clues to advance their quest."}, {"tag": "p", "text": "According to the adventure's notes to gamemasters, Jedi characters can try to mind trick Squeerie, but making him give up his salvage (which is legally his) is a potentially evil action that moves the Jedi further toward the dark side, at the gamemaster's discretion. Physically assaulting Squeerie and his crew also counts as an evil action. This article assumes that players take the course of action that gives the best results for them."}, {"tag": "p", "text": "The amount of money Squeerie pays the player characters depends on their character level and the difficulty of the adventure, ranging from 500 credits per character to 1,500 credits per character."}, {"tag": "p", "text": "Squeerie's associate, Jiminaldo-mabbramsti, appears in a later RPG adventure, Echoes of the Jedi, but Squeerie himself makes no appearance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}