{"url": "Squib/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Canine sentient species", "Category:Outer Rim Territories species", "Category:Rodent sentient species", "Category:Spacefaring species", "Category:Squib culture", "Category:Squibs"], "nodes": [{"tag": "h1", "text": "Squib"}, {"tag": "p", "text": "Squibs were a sentient species from Skor II known for collecting, trading, and haggling. Adult Squibs had humanoid bodies that averaged a meter in height. They were covered in colorful fur and had pointed snouts, tufted ears, and large eyes. Squibs tasted objects by rubbing them over their fur. They were gregarious, insatiably curious, and obsessed with haggling and deal-making. It was said that the easiest way to get information from a Squib was to propose a trade."}, {"tag": "p", "text": "Skor II was rich in natural resources, but they were unevenly distributed. As the Squibs developed the compulsion to collect and stockpile baubles, some tribes settled down while others became nomadic traders. Over time, a complex system of trade and barter emerged. After their first contact with the galaxy at large, the Squibs established themselves as galactic scavengers and rivals to the Ugors, another species. King Ebareebaveebeedee, who vocally supported the Galactic Republic during the Separatist Crisis, struck agreements with galactic interests to place Squibs aboard capital spacecraft as laborers. The Galactic Empire considered such Squibs slaves, but they provided salvage vessels with the locations of Imperial dumpsites. The species later signed a pact of mutual support with the Alliance to Restore the Republic."}, {"tag": "p", "text": "Squib salvagers reclaimed, refurbished, and resold rubbish both planetside and deep in space. Many worked directly for a corporation known as the Squib Merchandising Consortium, while others operated independently. Although most stayed within the law, some found work as forgers, thieves, and even crime lords. The Solo family had several encounters with the Squibs Emala, Grees, and Sligh, a family unit who operated as black market art dealers and information brokers."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Squibs were small, sentient, humanoid mammals with both rodent and canine characteristics. They ranged from 0.8 to 1.2 meters in height and weighed twenty-two kilograms on average. Their pink skin was covered in fur that ranged from white, gray, black, and brown to blue, violet, and red. The coat offered some protection from cold weather, but, more importantly, it served as an olfactory organ, able to pick up scents at a distance and ascertain intrinsic details—such as penetrating through a disguise or identifying a forgery—when rubbed against. The species had both male and female sexes, although non-Squibs often had difficulty determining the sex of a Squib based on her or his appearance alone."}, {"tag": "p", "text": "Squib eyes were large in relation to the skull and located on the sides of the head. They came in shades of blue, yellow, red, and brown. Their large ears often sported tufts of fur whose color could differ from that of the main coat; the ears pointed upward and could pivot to zero in on specific sounds. The short Squib muzzle tapered to a bewhiskered black nose. Their mouths were full of forbidding, sharp, white teeth, and their flexible cheeks were capable of storing items. The species had nimble, five-fingered hands and five toes on each foot. Non-Squibs often considered the small beings humorous or cute in appearance."}, {"tag": "p", "text": "The Squibs had quick metabolisms and relatively short life spans. A Squib was considered a child—referred to as a fuzzling—until nine standard years of age. As he or she matured, the fur changed color, a phenomenon that caused a dappled appearance on the back; similarly, the eyes and ears grew more quickly than the rest of the body, causing the latter to flop until the rest of the fuzzling's body grew enough to catch up. Sexual maturity occurred at thirteen standard years. Beginning at around thirty-nine years, a Squib entered middle age, when the fur grayed and the face wrinkled. Squib life expectancy was about sixty-five standard years."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Squibs were cheerful, gregarious, and overconfident to the point of egotism. Their biology led to a common Squib greeting: rubbing a person's palm across the cheek fur. As Squibs often wore gloves, the gesture conveyed more information than a simple handshake. They were friendly and non-threatening, making them quite likable—at first. Over time, Squib acquaintances could grow to regard the beings as slightly annoying to downright obnoxious; over many encounters, the Human Leia Organa Solo came to strongly dislike the species, for instance. Furbag and furball were derisive terms for Squibs."}, {"tag": "p", "text": "Squibs were inherently curious. They handled anything that interested them, usually by rubbing it against their fur with little forethought as to whether doing so might be harmful. Squib curiosity and propensity for haggling made them unabashed pack rats. Although the species had no need for clothing to protect themselves from the elements, they wore clothes and footwear for reasons of appearance and extra storage; typical clothing included pockets and pouches to stuff with odds and ends that caught their eye, since a Squib could never tell when a particular item might be useful in making a deal. Still, individuals left fur exposed to facilitate olfaction. Their accumulative drives earned the species a reputation as thieves among some members of the galactic community."}, {"tag": "p", "text": "Cheerful overconfidence was a definitive trait. The typical Squib response to a threat was not to fight or flee, but to bluff and bluster. Such behavior was particularly evident when the Squibs were out of sight, as when communicating from a Squib spacecraft. However, their sharp teeth were a favored means of intimidation when they felt such a tactic was necessary."}, {"tag": "p", "text": "Squibs were known for resourcefulness and improvisation. The traits manifested themselves in both Squib technology and art. For example, many Squibs sported homemade ion blasters, cobbled together from spare parts, which they used to disable droids they wished to reclaim. Squib artists utilized found objects—i.e., garbage—which they organized into intricate and beautiful works. For example, the audience chamber on the Squib Momship Thrifty featured a mural of Squib craft, one of the collapse of the Paradise system, and another of the Rebel Alliance operatives who helped to bring it about."}, {"tag": "h3", "text": "Haggling"}, {"tag": "p", "text": "To Squibs, bargaining was an art form. The highest compliment one could pay a Squib was that he or she bargained well, and a Squib denied the chance to haggle for any length of time could grow withdrawn and melancholy. Some members of the species claimed to have trained in the Mystic Martial Arts of Squib Combats and Transactions, and the species celebrated a holiday called Haggleday. Haggling was superior to all other impulses, and the Squibs were experts at it."}, {"tag": "p", "text": "Squib bargaining followed three major rules: 1: If something was free, it was a good deal; 2: bargaining was the highest form of communication; 3: when dealing with the Squibs' nemeses, the Ugors, all bets were off. Still, a few other principles applied. First, Squibs preferred to bargain face to face. Such a scenario allowed them to play up their small, unassuming appearance and make their opponent feel overconfident. Next, by tradition, the party who wanted something—usually the Squib—had to make the first offer. The furry beings could be insistent on the point, refusing to talk or answer questions until a potential business partner made the first move. Persistence—to the point of pestering—was a favored tactic. Squibs continually asked for things that the owner had expressed no interest in parting with, hoping that the mark would eventually give in out of sheer annoyance."}, {"tag": "p", "text": "The haggling process itself was more valued than any spoils obtained. In Squib reckoning, a good bout of bargaining let both sides think they were getting the better deal at least once. A key to Squib success was to involve as much complexity and as many individuals as possible: the more intricate a deal, the better, and a confused customer was a good customer. Squibs preferred to trade for things whose values were not easily comparable, thus preventing anyone from really knowing who got the best bargain. By involving several partners, any losses were spread out, and the chances that any one party felt any more than mildly ripped off were minimized. Although the negotiations themselves could be quite intricate, the terms of the deal could preferably be completed quickly, without lengthy payments or interest—considered more the Ugors' style."}, {"tag": "p", "text": "Squib ideas of value differed from those of most other beings. Worth was determined by something called kRR value, a concept not easily translatable. Gaining a great quantity of something or obtaining something novel was highly desirable. Squibs preferred to trade things they could see and touch; abstract commodities, such as information, were less attractive. Anything could be brought to the bargaining table, including a Squib's own offspring. The species' legends told of a mythical, idyllic junk heap of the ancients."}, {"tag": "p", "text": "A deal was a binding oath. Squibs went to great lengths to ensure their arrangements went through, and members of the species were incredibly loyal to their business partners, even accompanying them—saving their lives if need be—to help them complete their end of a bargain. Nevertheless, Squib interpretations of business arrangements could be fluid and subjective; many of their partners later found themselves wondering whether the Squibs were still adhering to the terms at all. Nonetheless, the beings genuinely shunned deception and theft, so any apparent reneging was often perfectly justified in their own minds. For example, they believed that cheating was perfectly acceptable as long as they did not lie outright. The Squib crime lord Slythor, for instance, often threw in a droid designated R4-B11 with deals he made; what he kept secret was that the droid was programmed to kill the business partners and return with the goods Slythor had traded them. Despite such flightiness, many beings knew Squibs to be mostly honest; in fact, members of the Morseerian species often preferred dealing with Squibs to other species."}, {"tag": "h3", "text": "Language"}, {"tag": "p", "text": "Squibs read, wrote, and spoke a language called Squibbian or Squibbal. The language developed from Old High Squibbian, a tongue that remained in use as a secret form of communication for spies to convey the coordinates of trash dumps and for traders to avoid being understood by those with whom they were bartering. The species reckoned time using a measure known as the cergl-unit. Squib names tended to be rather long, although the beings usually adopted shorter forms for use with non-Squibs. For example, the names Galaneever-marmalios, Meelawindemort, and Sleerinwilpher-remalior shortened to Galan, Meela, and Wilpher, respectively. Other short Squib names included the masculine names Grees and Sligh, and the feminine names Emala, Muatisi, Pika, and Veeshu."}, {"tag": "p", "text": "Members of the species had high-pitched voices. Most spoke Basic, and, although some achieved fluency, most Squibs' command of the tongue was less than perfect. Few Squibs could read and write the language. They often had thick accents, and their knowledge of idiom could be quite limited. Determining what information Squibs were trying to convey could prove onerous: they might speak too quickly, combine seemingly incongruous subjects in a single breath, or mention things that seemed of no relevance to the discussion at hand. Squibs peppered their Basic with unusual expressions, such as koovy, and often ended sentences with \"you bet.\" When bargaining, Squibs were meticulous about explaining terms, however. Trading with Squibs was a sure method of getting information from them. Squib body language employed their unique physiology: their whiskers trembled to express indignation, their ears drooped to convey discomfort and went back when alarmed, and their hackles stood on end to show nervousness."}, {"tag": "h3", "text": "Institutions"}, {"tag": "p", "text": "Groups of related Squibs formed a family unit. Beyond the immediate kin network, their homeworld, Skor II, was governed by the Squib Polyanarchy, autonomous communities under the rule of a mostly hands-off king. In addition, all Squibs were employees of a species-wide corporation called the Squib Merchandising Consortium, which held important contracts with galactic and planetary governments to collect, refurbish, and resell refuse. The degree of involvement varied; at one extreme were individuals such as Squib diplomats, recognizable by the ceremonial Fizz-Pop Cap (with foil cluster); at the other were independent traders. The head of the Consortium was known as the Illustrious Chieftain of Junkyards. During the latter years of the Galactic Republic and early years of the Galactic Civil War, a Squib named Ebareebaveebeedee served as both the Illustrious Chieftain and the Squib king. All Squibs were beholden to High Squibbian Law, a system that, among other things, forbade the king from using the ceremonial items hanging from his robes and stipulated that possession was nine-hundred-and-ninety-nine one-thousandths of the law. The Polyanarchy was historically apolitical, although it supported the Galactic Republic during the Separatist Crisis and signed a pact of mutual support with the Alliance to Restore the Republic sometime between the battles of Yavin and Hoth."}, {"tag": "p", "text": "One major arm of the Consortium and a major Squib employer was the Squib Reclamation Fleet. Its vessels followed capital ships from one jump point to the next, collecting garbage jettisoned along the way. Squibs worked on the capital ships as garbage collectors and conveyed to the fleet the coordinates of dumps and any trade opportunities in the area. The Reclamation Fleet was shadowed by vessels of the Squibs' rivals, the Ugors, who regularly swept in, attacked any Squib craft, and grabbed as much salvage as possible."}, {"tag": "h3", "text": "Technology"}, {"tag": "p", "text": "The Squibs had access to all aspects of galactic technology, although it differed from the standard in that it was often created from salvaged components refitted in ways the original makers never intended. Companies such as Fegegrish Heavy Industrials sold personal gear specifically designed for the Squib species, such as the shoulder-mounted Squib battering ram, which weakened obstructions at the molecular level. The Squibs themselves refurbished scavenged items for resale on the galactic market; they could be quite successful at this endeavor when they returned such items to factory-like conditions. In contrast, Squib-designed inventions often proved a hard sell to other species. The C2-R4 multipurpose droid flopped due to its poor aesthetics and bafflingly over-abundant functionality. Squib inventors rarely lost heart, however; a failed product simply afforded the chance to bargain with the creditors."}, {"tag": "p", "text": "Squibs excelled at tractor beam technology. Their tractor beams rivaled the best in the galaxy, and Squib spacers became experts at using them. For example, Squib needle ships had no weaponry or shields, instead relying on ten tractor beams—rumored to be among the most powerful in the galaxy—for defense. If attacked, the crew used quick and precise manipulations to erect a wall of garbage around the ship and hurl pieces of refuse at the enemy. The popular garbage grabber was a personal tractor beam with a claw at the end for gathering salvage from hard-to-reach places. Squib engineers developed whole weapons based on tractor beam technology. Called tensor weapons, they attacked with invisible—but loud—compressed waves of tractor energy and disrupted the target's cells. Amberlandrax Armaments marketed a rifle of such design during the Galactic Civil War. Squibs sometimes took advantage of the noisiness of such weapons to convince dismissive beings to pay attention to them."}, {"tag": "p", "text": "Squib starshipwrights constructed spacecraft from second-hand materials. The main vessels of the Squib Reclamation Fleet were the tapered, fifty-meter needle ships, each crewed by twenty individuals. The fleet flagship was for many years the Wholesale. Other important vessels were the Momships, one of which was the personal vessel of the Squib king. Ebareebaveebeedee's vessel was the Thrifty. Others traveled in tramp freighters or Squib scout ships, small craft armed with but a single tractor beam. Some Squib craft were considered \"Uglies\" similar to those employed by pirate groups."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Evolution and early civilization"}, {"tag": "p", "text": "The Squibs evolved on Skor II, a small, dense world in the Squab system, just west of the Rimma Trade Route in the Outer Rim Territories. The planet possessed a diverse ecosystem, varied terrain, and vast resources spread far across its surface. Early tribes of Squibs thus were forced to travel from region to region to find necessities. Accumulating material goods became an ingrained part of the Squib psyche, leading some tribes to found small villages. Those who maintained their nomadic lifestyle took on the added role of merchants, trading foreign goods with their sedentary counterparts. Bargaining became a deep-seated part of Squib culture."}, {"tag": "p", "text": "The Squibs advanced to the point of mass production and developed a peaceful, species-wide government called the Polyanarchy. Sometime before 3640 BBY, a Dorcin trader discovered their world. After a spirited round of negotiations, the offworlder gained mineral rights to some frigid wastes, while the Squibs learned the intricacies of starship technology. Shortly after the Ruusan Reformation, the Squib species had become well enough integrated into the galaxy to merit an entry in a Jedi training manual, The Jedi Path, by the Jedi biologist Bowspritz. The researcher noted that Squibs had helped to get him out of trouble in the past, but that the experiences cost him a great deal of credits. Among marginalia added by other Jedi in one copy of the book, Obi-Wan Kenobi noted that he considered them thieves."}, {"tag": "p", "text": "The Squibs' natural curiosity and mastery of haggling helped them to carve out a niche as interstellar garbage collectors and scavengers. While Squib settlers colonized other planets, Squib companies signed contracts to haul rubbish from populous worlds while other corporations refurbished the junk for resale. Skor II became a prosperous trade world with a major population center at Metrobig City. Sometime before 20 BBY, the planet joined the Galactic Republic."}, {"tag": "p", "text": "Meanwhile, the Squibs' activities put them in direct competition with another scavenger species: the Ugors. Over time, the species developed a fraught antagonism, practically to the point of war. The Squibs came to regard the Ugors as their hereditary foes, and the Ugors made the Squibs de facto demons in their religion of trash worship."}, {"tag": "h3", "text": "Reign of Ebareebaveebeedee"}, {"tag": "p", "text": "Sometime before 40 BBY, Ebareebaveebeedee became king of the Polyanarchy. His reign proved something of a golden age. Under his initiative, the species struck deals with various galactic interests to place Squibs aboard capital ships as garbage laborers. To many observers, they were little better than slaves, although it was understood that they were allowed to keep any scrap that caught their eye. In the eyes of the Squib government, Squibs so employed were embedded spies, whose job was to communicate the coordinates of capital-ship garbage dumps to the Squib Reclamation Fleet."}, {"tag": "p", "text": "Despite overtures from the Confederacy of Independent Systems, Ebareebaveebeedee enthusiastically supported the Galactic Republic during the Separatist Crisis, declaring that his people were \"going nowhere\" and that the Jedi were \"koovy.\" In month 15 of 21 BBY, Metrobig Interplanetary Blastport was seized by the Separatists. Jedi Master Mace Windu and Commander Cody led Republic forces to drive away the battle droids and recapture the spaceport in the Battle of Skor II. Ebareebaveebeedee erected a bronzium statue in honor of Windu and named him \"Big Time Hero of Beyond-Squib Eliteness.\" The Squibs found their homeworld in uncontrolled territory for the remainder of the war. Still, during the conflict, Squib scavengers cleaned up after battles; the Jedi Padawan Ahsoka Tano thus considered Squibs to be good sources of intelligence on Separatist movements."}, {"tag": "p", "text": "After the rise of the Galactic Empire, the Squibs suffered a minor hiccup over the salvage of orbital wrecks. The incident was followed by an even graver threat: early in the New Order, the Squibs found themselves elbowed out by their rivals, the Ugors, as much of the galaxy came to rely upon Ugor waste disposal services. The Ugors even secured an exclusive Imperial license not only to collect Imperial garbage dumps in deep space but also to accept dumps from Imperial ships visiting the Ugors' home star system, Paradise. Ebareebaveebeedee countered by securing permission to allow Squib sanitation workers aboard Imperial vessels, a ploy that perpetuated his network of informants. The Squibs were forced to rely even more on their spy network; armed with its intelligence, their craft could swoop in and snap up as much garbage as possible before the Ugors arrived to chase them away."}, {"tag": "p", "text": "The Squib King largely kept his people out of the Galactic Civil War after its outbreak in 2 BBY, and the species traded and dealt with members of both the Galactic Empire and the Alliance to Restore the Republic. Alliance and Imperial Intelligence tried to track Squib vessels to the bases of their enemies, but the species made sure to secure the secrecy of their markets. The species profited from the galactic conflict by scavenging equipment from battle sites, repairing it, and reselling it; several military-issue Arakyd 74-Z speeder bikes made their way to the civilian market in this way."}, {"tag": "p", "text": "Sometime between 0 and 2 ABY, the Squibs hit their nadir. Their intelligence revealed that the Ugors had obtained a gravity well projector with which they were bringing order to the junk in their home system. The greater organization granted the Ugor salvage fleet greater efficiency and drew new customers to both dump their garbage and seek rare pieces of flotsam and jetsam. The king thus reneged on his earlier policy of neutrality: he made a deal with a group of Rebel operatives to provide information on the location of an Imperial ship they sought in exchange for the projector. When the Rebels and a Squib diplomat named Spilferithimus-narlamos removed the contraption, the Paradise system fell back into disarray. Ebareebaveebeedee then declared a pact of mutual support between the Squibs and the Alliance. By 137 ABY, Skor II had fallen within territory controlled by the Sith Lord Darth Krayt as part of his Galactic Empire."}, {"tag": "h2", "text": "Squibs in the galaxy"}, {"tag": "p", "text": "Although a few held mundane jobs, such as flying air taxis on Coruscant, garbage was everywhere, and Squibs were anywhere the garbage was. Capital ships contracted Squib sanitation workers to handle onboard refuse. A telltale sign that Squibs were aboard was that ejected trash had been stripped of potentially valuable parts. Many galactic citizens came to regard the diminutive beings as no more than laborers, an idea that persisted well into the days of the New Jedi Order. Especially during the days of the Empire, Squib garbage workers kept a low profile and avoided contact with their employers; others broke their contracts due to mistreatment. Rebel Alliance operatives cultivated disaffected Squibs to gain valuable logistical and operational intelligence about Imperial vessels. In 3 ABY, undercover Alliance operatives were subcontracted by the Squib Jeremos to work aboard the Star Destroyer Indomitable. They used their position to gain access to sensitive areas of the ship and further their mission. Squib salvagers occasionally hired non-Squibs to help them in their duties."}, {"tag": "p", "text": "Some Squibs were fringers, scavenging on a single planet. For instance, Squeerie led a team on Almas around 32 BBY and helped a group of agents working for the Human Jedi Master Lanius Qel-Bertuk to find his lost Wookiee counterpart, Kirlocca. Sometime after Order 66 at the end of the Clone Wars, members of Squeerie's group, led by Jiminaldo-mabbramsti, or Jimi, encountered agents of Jedi Master Denia while fighting with a group of Ugors over the salvage of a damaged droid in the ruins of Almas Academy."}, {"tag": "p", "text": "The offworlders mediated the dispute."}, {"tag": "p", "text": "However, immediately thereafter, a group of Dark Lizards attacked all parties. Maja was a Squib who purchased salvage rights to a waste field on the third moon of Kothlis around 4 ABY. He was trapped in a Plexus Droid Vessel and soon found himself facing a group of adventurers who needed information from the conveyance. As a good Squib trader, Maja gave up his would-be personal craft for the right price."}, {"tag": "p", "text": "Other Squibs took to a life as spacers. Some acted as scouts, passively scanning deep space for interesting junk, while others tracked vessels to reclaim their garbage dumps. Squib vessels joined the wreckage of the Hoth asteroid field while attempting to salvage the remains of the Mugaari pirate Icanis Tsur 's ship."}, {"tag": "p", "text": "During the Galactic Civil War, a Squib spacer was present at the bar called the Maze when a group of would-be Rebel Alliance operatives fled Imperial stormtroopers."}, {"tag": "p", "text": "In 13 ABY, the crew of a Squib prospector vessel was detained on the Quarantine Enforcement Cruiser Lycoming. A Squib tourist in Piringiisi on Sullust survived a dianoga attack, alerting the authorities to the presence of the predator in the mud pits there. Circa 24 ABY, a Squib salvage scow recovered artifacts from the ruins of the planet Byss, including a copy of the book The Jedi Path."}, {"tag": "p", "text": "Squib traders traveled to even the most remote and secretive locations to sell reconditioned goods, prompting many top-secret installations to completely rethink their security procedures upon the arrival of such unexpected company. They were one of the few species from the known galaxy to have established any significant presence in the Unknown Regions, and their language served as one of the many lingua franca used in that area of space. Indeed, one Squib scout made first contact for the galactic scavengers with a pair of explorers of the Chiss species. The species was so well established that Squibs were among the many targets presented by the holographic shooting range of Almas Academy. A Squib named Kwilper wandered from spaceport to spaceport selling pieces of art he had fashioned from salvaged junk, and in 3 ABY, a Squib named Veeter found himself stranded on Dalicron-4, desperate to repair his ship and return to his wandering lifestyle. Occasionally, roving Squib traders obtained goods whose value even they could not imagine. One found himself the center of a bidding war among parties interested in a data storage unit with an important decryption program."}, {"tag": "p", "text": "Squibs opened second-hand shops in spaceport towns. Around 0 BBY, Macemillian-winduarté helped run Jawa Traders, a droid shop on the planet Tatooine. The gray-furred Squib had to deal with thugs hired by Jabba the Hutt to collect protection money from him. At one point, a group of spacers helped him resist such a shakedown; Macemillian-winduarté loaned the offworlders a landspeeder in gratitude. In 9 ABY, Arrejis Mellaha operated Serooin's Gear on the smugglers' world Betha II. In 13 ABY, Sheebareevadee ran Sheebareevadee's Emporium of Interstellar Goods on the planet Gamorr. Other Squib traders included one on the planet Asation and another on the planet Kabal."}, {"tag": "p", "text": "Other Squibs took up the life of scoundrels. Their ranks included petty thieves, such as the pickpocket-turned-Rebel Smileredon-Verdont, forgers, like the two Squibs employed by the Sljee Jeseej on Coruscant, infochants, such as Burnout space station's Blasnic, and full-fledged crime lords, such as Slythor, who controlled salvage operations on the junk planet Korad. Four Squib thieves were tasked by the Human Rebel operative Quip Fargil on the planet Sriluur to steal components from an Interdictor cruiser to help upgrade the hyperdrive of the freighter Millennium Falcon."}, {"tag": "p", "text": "The family unit of Emala, Grees, and Sligh were a trio of scoundrels who had dealings with the Human Solo family over the years. In 8 ABY, they were working as information brokers, selling data to the New Republic. They teamed up with the Solos to obtain the painting Killik Twilight, which contained hidden data sensitive to the New Republic. They later worked with members of the criminal organization known as the Invisible Shell, but when their patsy, the Jenet Ludlo Lebauer, learned of their scheme, he froze Grees in carbonite. The Squibs manipulated the Solos into helping them rescue their companion on the casino planet Pavo Prime. Following the Yuuzhan Vong War, the three were still selling artwork, and their organization had grown to include Emala's children, Krafte and Seneki, as well as Squib assassins. By 44 ABY, the trio had found work with the Human Admiral Natasi Daala, the former Chief of State of the Galactic Alliance, who sent them to become test subjects for Moff Tol Getelles, who was conducting trials of a serum, derived from a creature known as the droch, that had the ability to restore youth to its taker. During their tenure with the Human officer, the information brokers became familiar with Getelles' hidden laboratory complex, which was masked as a mine called the Moon Maiden on the mining moon Hagamoor 3. There they discovered Daala's plot to oust Head of State Jagged Fel of the Imperial Remnant from power. The Squibs' involvement was revealed when they crossed paths with the Solos later that year. In return for information about the experiments, the Solos granted the Squibs safe passage to Coruscant. On the galactic capital, the Squibs turned over a stolen vial of the serum to Fel under threat of arrest. They next took a job for the Human Lydea Pagorski, an Imperial Lieutenant who served as Daala's campaign manager in a race against Fel. The Squibs led Pagorski to Getelles' abandoned Moon Maiden base, where she set up a campaign headquarters. Things turned sour when Pagorski revealed herself to be a monstrous dark side entity known as Abeloth, intent only on drawing a constant stream of victims into the base to feed off their fear and anguish. Meanwhile, the Mandalorian bounty hunter Boba Fett tracked the Squibs to the base in his hunt for a pair of scientists who had manufactured a nanokiller tailored to his genetic makeup. While three other Squibs remained with Pagorski and enslaved workers in a fire bulkhead, Sligh fled into hiding upon Fett's appearance. He was later discovered by the former Jedi Knight Tahiri Veila, who interrogated him through the Force and discovered the Squibs' dealings with Pagorski. Soon, the Squibs in the fire bulkhead came under attack from the Human Jedi and the Mandalorian bounty hunter, whom she had rescued. The pair of Humans then defeated Abeloth in the chamber beyond."}, {"tag": "p", "text": "A few Squibs had a talent for the Force. Some Force-sensitive members of the species had no knowledge of their gifts and remained on Skor II, but others were trained as Jedi. A popular series of children's stories from the time of the Republic focused on a roguish Squib Jedi who was rumored to be based on a real individual. The series went to several volumes; the third was titled Busteromuchmacho and the Vermillion Shadow. Years later, in 35 ABY, a Squib Jedi was training at the Jedi Academy of the planet Ossus. A small number of Squib nobles plied the spacelanes."}, {"tag": "p", "text": "More than 220 years before the Battle of Yavin, a Squib vessel crash landed on the planet Holador. The survivors broadcasted a distress signal and hunkered down to be rescued, to no avail. When their equipment failed, they were forced to revert to a primitive lifestyle. Over seven generations, the Squibs took to worshiping their comm relay as a Holy Icon and hoping for the day offworlders would once again return them to the stars. A Twi'lek bounty hunter named Kelyan tried to convince the village that a group of visiting adventurers was dangerous."}, {"tag": "p", "text": "Nevertheless, the village elder, Alexem, was convinced that she was manipulating the tribe."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Squibs were introduced by Brad Freeman in the West End Games adventure Scavenger Hunt, published in 1989. The story sends a group of Rebel characters after the Imperial ship Elusive, the location of which is known only to the Squib king, Ebareebaveebeedee, and his crew. Later that year, Troy Denning gave the species a more complete write-up in Galaxy Guide 4: Alien Races. The book indicates that they were intended as a sort of comic-relief species that, unlike Ewoks, could be encountered anywhere in the galaxy and interact with characters on a more technologically level playing field. West End's Squibs are more dexterous than the average species, but they are slightly restricted in intelligence, strength, and technical aptitude. The Wizards of the Coast version of the species, detailed in both Alien Anthology (2001) and Ultimate Alien Anthology (2003), also has high agility, now coupled with lower-than-average common sense and perceptive abilities. With the change to the Saga edition of the Wizards' system, Squibs suffer a penalty to strength, but a bonus to their agility. They gain the additional ability to retry any attempt to manipulate technology. Several sources summarize material from these books without adding new information on the species."}, {"tag": "p", "text": "The information above assumes that encounters with Squibs in various role-playing scenarios follow the most profitable course for the player characters. Nevertheless, several alternatives are possible. For instance, in the 1996 adventure New Recruits and Rebel Guns, the encounter between a Rebel Alliance player character and a Squib spacer in a bar called the Maze is offered only as a possibility and is not integral to the overall plot. In the 2005 adventure Strike III, the Squib leader Alexem and his tribe may decide to attack the player characters if they fail to convince him that they do not have hostile intentions. Finally, in 2008's Echoes of the Jedi, the player characters have the option of ignoring the dispute between Jiminaldo-mabbramsti and his Ugor rivals, but doing so nets them a smaller reward."}, {"tag": "p", "text": "Denning has featured the Squib characters Emala, Grees, and Sligh prominently in five novels and one short story, and the trio has appeared in Fate of the Jedi: Ascension, by Christie Golden, as well. Pablo Hidalgo, another Star Wars author, has expressed his affection for the Squibs in his blog. One of his players portrayed a Squib character named Smileredon-Verdonté in a campaign of Star Wars: The Roleplaying Game that Hidalgo refereed. The character—with a slightly modified name—later featured in Heroes & Rogues (1995) and as a regular in the Rookies webstrips. Hidalgo's chronicle of the Battle of Skor II explains why a Squib character in Galaxy Guide 7: Mos Eisley is named \"Mace Windu,\" the same as the Jedi character played by Samuel L. Jackson in the prequel films: the name—and variants—has appeared in George Lucas's notes and drafts for the Star Wars saga since 1973. According to Hidalgo's article, the Squib (whose full name is Macemillian-winduarté), was simply named for the Jedi hero who saved his home planet. Although Denning's Squib characters tend to speak standard Basic, Hidalgo's speak in what he describes as \"Squibberish,\" a babbling, imprecise version of Basic punctuated by Squibbian words like \"koovy.\""}, {"tag": "p", "text": "The species has caused some problems in Star Wars fiction. For example, the word is misspelled Squibb in the Star Wars Adventure Journal articles \"Murder in Slushtime\" and \"The Gree Enclave\". The novels Shield of Lies and Shatterpoint write the species' name in lowercase. The Official Star Wars Fact File 138 claims that the Squibs hail from the Paradise system along with their rivals, the Ugors. More recent sources, such as The Complete Star Wars Encyclopedia, contradict the notion, so the Fact File seems to be in error. \"HoloNet Waystation,\" a non-licensed roleplaying adventure in Challenge 74, suggests that Tatooine was too remote for Squibs to visit. The assertion contradicts the presence of Macemillian-winduarté living there as a trader, as established in Galaxy Guide 7: Mos Eisley and the short story \"Spare Parts.\" Sources are ambiguous as to the relationship between the Squib species and the Squib battering ram. Galladinium's Fantastic Technology describes the battering ram as part of its write-up for the Squib species as an example of something available to members of the species. However, in The Bounty Hunter Code: From the Files of Boba Fett, the in-universe narrator, bounty hunter Boba Fett, explains that the device was named for the Squibs—not designed by them—due to their penchant for getting into places they were not supposed to be."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}