{"url": "Barrow_Oicunn/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Humans", "Category:Imperial Navy admirals of the Galactic Empire", "Category:Males", "Category:Republic Navy officers"], "nodes": [{"tag": "h1", "text": "Barrow Oicunn"}, {"tag": "p", "text": "Barrow Oicunn was an officer in the Republic Navy and later, an admiral in the Imperial Navy. When the Clone Wars broke out and affected the galaxy at large, Oicunn joined the Humbarine sector defense forces, which had recently fallen under the jurisdiction of the Galactic Republic war council. Oicunn's homeworld, Humbarine, suffered repeated attacks from the Confederacy of Independent Systems, prompting the junior officer to adopt inspired tactics within the limitations of Republic protocol. As the war ground on, defense forces were siphoned from Humbarine by the Republic, resulting in a devastating strike from General Grievous. Oicunn's family perished in the decisive Battle of Humbarine, and the planet was abandoned, forcing Oicunn to both reassess his faith in the government, and serve with the mainstream Republic Navy."}, {"tag": "p", "text": "Serving with the Coruscant Home Fleet, Oicunn met his sector's representative, Bana Breemu, who declared him a hero of Humbarine. He served aboard the Mas Ramdar during the Battle of Coruscant, and continued to fight for the Republic, despite his disenchantment with their policies. Oicunn welcomed Palpatine's New Order, believing that a Galactic Empire would be able to maintain peace and justice throughout the galaxy. The lieutenant had the utmost respect for the rulers of the new regime, and swiftly rose through the ranks of the Imperial Navy, eventually reaching the rank of admiral."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The Human male Barrow Oicunn hailed from the planet Humbarine. In 22 BBY, the Clone Wars broke out between the Galactic Republic and the Confederacy of Independent Systems. The pan-galactic conflict would eventually find its way to Oicunn's homeworld. Seeking to play his part in the devastating war, Oicunn joined the Humbarine sector defense forces. The defense forces had been reorganized and assimilated by the Republic's war council, subjecting it to the protocol and standards of the galaxy's dominant government. As Humbarine fell under constant and consistent Confederate attack, Oicunn was given the chance to utilize inspired tactics to beat back the enemy, despite the fact that he was but a mere junior officer."}, {"tag": "p", "text": "As Humbarine continued to be contested ground over the years, the Republic was forced to draw forces away from the ecumenopolis, and divert them to more critical fronts. As a result, General Grievous chose to strike, launching an hour-long bombardment of the planet from the Invisible Hand, melting the planet's crust and utterly devastating its populace. Oicunn's family was wiped out in the chaos, leaving the junior officer's faith in the Republic greatly shaken. He no longer believed that the government could maintain peace and security throughout its member worlds. With Humbarine devastated and abandoned, its defensive forces were dispersed, with Oicunn transferred to the Coruscant Home Fleet."}, {"tag": "h3", "text": "Defending Coruscant"}, {"tag": "p", "text": "Stationed with the Home Fleet, Oicunn served aboard the Dreadnaught-class heavy cruiser Mas Ramdar as a gunnery officer. When he was given downtime, he stayed on Coruscant, and befriended the Humbarine Sector's senator, Bana Breemu. Oicunn discussed the unlucky fate of Humbarine with his senator, and Breemu, in turn, named him a hero of his homeworld. The commendation boosted Oicunn's spirits, but he would soon enough be given the chance to avenge his loved ones in the Battle of Coruscant."}, {"tag": "p", "text": "In 19 BBY, Grievous launched a devastating strike at Coruscant. In the process, he kidnapped Supreme Chancellor Palpatine, and attempted to flee the capital on the Invisible Hand. As he prepared to do so, however, the Mas Ramdar moved in to halt its retreat after critically damaging several Confederate warships. Oicunn relished the opportunity to destroy the hammer of Humbarine, as the Mas Ramdar exchanged heavy turbolaser fire with the Invisible Hand. The Mas Ramdar was later forced to retreat, however, as the Invisible Hand, being the larger ship, outmatched it in terms of firepower. Palpatine was eventually rescued by the Jedi, and the battle was won. As a result of his exemplary service, and his unswerving loyalty to the Republic despite the Humbarine atrocity, Oicunn was transferred to a far more exclusive post: he would serve aboard one of the Venator-class Star Destroyers guarding the construction of the top-secret Death Star superweapon."}, {"tag": "h3", "text": "The New Order"}, {"tag": "p", "text": "The Clone Wars ended shortly after the Battle of Coruscant, and Chancellor Palpatine, having locked himself in office, transformed the Republic into a Galactic Empire. Oicunn welcomed the new Emperor's policies, as he thought that a strong governing body would be able to prevent such tragedies as had befallen Humbarine. Rumors of a Jedi rebellion concerned him, but he did not totally believe them, as he was confident that the New Order would secure peace and justice throughout the galaxy. Soon after the declaration of the New Order, the Star Destroyer Oicunn served aboard played host to the Emperor himself, his new enforcer Darth Vader, and Governor Wilhuff Tarkin."}, {"tag": "p", "text": "Oicunn greatly admired these rulers of the Empire, and as the years progressed, he rose through the Imperial Navy's chain of command. At some point in his progression, he attained the rank of captain, and was a VT-49 Decimator pilot. He eventually ascended to the rank of admiral, and proudly became a new clone template for future stormtrooper ranks. Several years later, Admiral Oicunn suffered some sort of unexplained misfortune relevant to the Kessel Run, which would go onto be mentioned in a report to Grand Vizier Sate Pestage by Commander Maximillian Seerdon."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Loyal to a fault, Barrow Oicunn served his superiors faithfully, regardless of personal feelings. He adapted to restrictive doctrines while serving in the Humbarine Sector defense fleet, producing tactics that were seen as \"inspired.\" His faith in the Republic was shaken by the devastating loss of Humbarine, but he continued to fight the Confederates. Oicunn believed that the Republic, in its current incarnation, would not be able to defend its member worlds effectively, and so he welcomed the coming of the New Order, and the Galactic Empire. As he rose through the Imperial ranks, Oicunn was looked upon as a model soldier, who showed an ideal mix of loyalty towards his ruined homeworld, and fidelity to the Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Lieutenant Oicunn first appeared in George Lucas' Star Wars: Episode III Revenge of the Sith, as an extra in the closing montage of the film. Oicunn was later given a backstory by Daniele F., through the StarWars.com Hyperspace feature, \"What's The Story?\" Daniele F. decided to tie Oicunn into the deleted scenes of Revenge of the Sith, hence the character's ties to Bana Breemu and Humbarine. The first name of \"Barrow\" was provided by James Floyd. Oicunn was later featured in an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}