{"url": "Ssi-ruuvi_religion", "categories": ["Category:Legends articles", "Category:Religions", "Category:Ssi-ruuvi religion"], "nodes": [{"tag": "h1", "text": "Ssi-ruuvi religion"}, {"tag": "p", "text": "The Ssi-ruuk of the Ssi-ruuvi Imperium in the remote Ssi-ruuk Star Cluster had a very old and developed religion. It was controlled by the Conclave, one of the two highest governing bodies of the Imperium. Only gold-scaled Ssi-ruu could join the Priest caste. Ssi-ruuvi religion may have been a tool used by the Ssi-ruuvi elite as a way to control the Imperium."}, {"tag": "h2", "text": "Beliefs"}, {"tag": "h3", "text": "Concept of Consecration"}, {"tag": "p", "text": "Their sacred text was called the G'nnoch. The Ssi-ruuk placed great value on the souls of their own kind and believed that should a Ssi-ruuk die in an \"un-consecrated world\", his soul will forever wander the universe alone. This belief was one of the reasons why the Ssi-ruuk were isolationists and typically remained in their own star cluster."}, {"tag": "p", "text": "Only the priests, through an hour-long ceremony, could consecrate a world. After such a ceremony, it was given a Ssi-ruuvi name. In an effort to compensate for this disadvantage, the Ssi-ruuk used large numbers of droids and P'w'ecks - a smaller species enslaved by the Ssi-ruuk - to aid them in their fleets."}, {"tag": "h3", "text": "Ssi-Ruuvi Supremacy"}, {"tag": "p", "text": "The P'w'ecks shared the same homeworld as the Ssi-ruuk (Lwhekk). According to the G'nnoch, four eggs were formed at the creation of the universe. From the first hatched Ssi and P'w'itthki. Ssi's children hatched from the second egg, while P'w'itthki's children hatched from the third egg. The fourth egg was reserved for those Ssi-ruuk who earned a place in the afterlife."}, {"tag": "p", "text": "Eventually, Ssi fought with P'w'itthki and defeated him. After his defeat, Ssi allowed P'w'itthki's hatchlings to live on the condition of serving the children of Ssi for all eternity. This myth described the beginning of the relationship between the Ssi-ruuk (hatchlings of Ssi) and the P'w'ecks (hatchlings of P'w'itthki). The myth also described the Ssi-ruuk's supremacy over all other sentient species."}, {"tag": "h3", "text": "The Keeramak"}, {"tag": "p", "text": "The G'nnoch also contained the prophecy of the coming of a Ssi-ruu of many colors whose arrival would result in the overturning of Ssi-ruuvi society. This prophecy eventually came to pass with the birth of the Keeramak. However, the Keeramak was merely a tool of Yuuzhan Vong infiltrators who had infiltrated the weakened Imperium between 4 ABY and 28 ABY following its defeat by the Alliance of Free Planets and the Galactic Empire at Bakura during the Invasion of Bakura in 4 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}