{"url": "Ssi-ruuvi_ion_paddle_beamer", "categories": ["Category:Legends articles", "Category:Ssi-ruuvi technology"], "nodes": [{"tag": "h1", "text": "Ssi-ruuvi ion paddle beamer"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The ion paddle beamer was a paddle-shaped weapon carried by Ssi-ruuk which was used to stun targets. This weapon was originally used for medical purposes, but the Ssi-ruuk later found its usefulness as a weapon. Beings hit by such weapons were disabled and could not move for some time. Despite this though, blasts aiming at the head and at close range can kill the target. The long beam fired by the weapon could not be deflected by a lightsaber, as the beam would simply bend around the beam to strike the user. Although, with preparation, a lightsaber could be calibrated to bend the bolts away, though not reflect them."}, {"tag": "p", "text": "The Ssi-ruuk race that attacked the isolated planet of Bakura just days after the end of the Battle of Endor had a bizarre purpose; capture living specimens to power their battle fleet through the bizarre process of entechment. The entechment process required a target be taken alive; hence the primary weapon for the Ssi-ruuk ground forces was the paddle beamer."}, {"tag": "h2", "text": "Technical information"}, {"tag": "p", "text": "The weapon itself was shaped like a flat disc, and was designed for use by Ssi-ruuk hands. The weapon was fired by a simple control stick on the underside, and was light enough to be fired using only one hand. The beamer emitted a small, thread-like silver ion beam that interfered with the nervous system of its target. A glancing blow could render an extremity numb for hours, while a direct hit caused unconsciousness. The optimum range of the beamer was eight meters, and the maximum range was twelve. A particularly dangerous aspect of these weapons was their ability to pass through conventional shields and armor. While fighting the Ssi-ruuk, Luke Skywalker discovered he could alter the frequency of his lightsaber to deflect the beams, but then the blade becomes incapable of deflecting conventional blaster bolts."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Ssi-ruuk and their P'w'eck slaves used these weapons when they attempted to capture Bakura a few days after the Battle of Endor. Rebel forces captured some of these weapons when the Ssi-ruuk were repulsed, but they proved incompatible with conventional weaponry, and Luke Skywalker destroyed the samples to release the enteched spirits that powered them."}, {"tag": "p", "text": "Almost twenty-five years later, during the height of the Yuuzhan Vong War, the Ssi-ruuk again tried to take Bakura, however their technology had not seen radical improvement and the paddle beamer still operated on the same principles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}