{"url": "Ssi-ruuvi_Imperium", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Interplanetary governments", "Category:Ssi-ruuvi Imperium", "Category:Unknown Regions governments"], "nodes": [{"tag": "h1", "text": "Ssi-ruuvi Imperium"}, {"tag": "p", "text": "The Ssi-ruuvi Imperium was the government and holdings of the Ssi-ruuvi. The Shreeftut, leader of the Imperium, reigned over a large swath of the Unknown Regions known as the Ssi-ruuk Star Cluster from the capital of the Imperium, Lwhekk. The Imperium was also governed by the Conclave and the Elders' Council."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "When the Ssi-ruuk expanded into space, they conquered several worlds and enslaved their inhabitants, most of which were primitives. Eventually, the Ssi-Ruuk discovered the art of entechment and began entrenching subjugated species. The practice of entechment of lower life forms became common; even the P'w'eck, cousins of the Ssi-ruu were used. But gradually it was learned that containment of these \"souls\" for long periods would result in madness and it was decided that the Imperium needed to expand its realm once again. Another reason was the dwindling resources in their isolated region of space."}, {"tag": "h3", "text": "Exploration of the galaxy"}, {"tag": "p", "text": "Prior to that, the Imperium had never before dared to expand beyond its cluster, partly because of the large distances involved, partly due to the xenophobic nature of the Ssi-ruuk, and partly because of their religious fear of traveling to 'unconsecrated' worlds. In 2 BBY, the Ssi-ruuvi's supreme ruler—the Shreeftut—received visions through the Force of a hooded Human who revealed himself to be Emperor Palpatine, ruler of the galaxy. He offered the Ssi-ruuvi dozens of worlds and millions of Humans to entech, in exchange for the use of Ssi-ruuvi technology. Thus, they decided to venture into Wild Space, where they conquered the small Human colony of G'rho, capturing and enteching numerous members of the populace. Due to their secret agreement with the Ssi-ruuk, the Imperial leadership covered up the incident and blamed the Alliance to Restore the Republic for the attack."}, {"tag": "p", "text": "Among their captives was a Human boy named Dev Sibwarra, whom the Elder Bluescale brainwashed through mind manipulation techniques; what astounded them was the boy possessed strange powers to sense others. It was from this boy that Ssi-ruuk Admiral Ivpikkis discovered that Humans were the galaxy's dominant species. He also discovered that humanoids had longer containment time when enteched and could last longer than most other species. Due to Sibwarra's Force abilities and his ability to communicate with his fellow Humans, the Ssi-ruuk used Dev Sibwarra to calm the subjects being enteched."}, {"tag": "p", "text": "However, in 4 ABY, Emperor Palpatine was killed during the Battle of Endor onboard the Second Death Star. With the Emperor unable to fulfill his promise, the Ssi-ruuvi launched an invasion of the edge of the known Galaxy. Expeditionary forces were sent out against both the galaxy proper and the neighboring government in the Unknown Regions, the Chiss Ascendancy. However, neither expedition was very successful: the Ssi-ruuvi only narrowly succeeded in conquering the Human world of Cattamascar, and were utterly defeated at Bakura."}, {"tag": "p", "text": "Likewise, although several minor Chiss worlds were taken, the Chiss retaliation was massive and unexpected, and laid waste to the Ssi-ruuvi capital, Lwhekk. After the Chiss raid on the Imperium, a small Rebel Alliance task force appeared in Ssi-ruuvi Space. The Rebel force had come to stop the Imperium's expansion into the known galaxy. Seeing the Imperium in ruins, the Rebel Alliance believed that the threat from the Ssi-ruuk was over."}, {"tag": "h3", "text": "Resurgence and defeat"}, {"tag": "p", "text": "It was many years until the Ssi-ruuvi rebuilt enough to contemplate continuing their expansion. Two major events occurred at that time. One was the birth of the Keeramak, an event of major significance in the Ssi-ruuvi religion. The Keeramak himself, a mutant Ssi-ruu, was a master strategist and politician. The other event was the secret takeover of the Imperium by the Yuuzhan Vong, who secretly placed and made one of their own, E'thinaa, a ranking general. During these years, the Ssi-ruuk would discover new techniques of preserving enteched souls."}, {"tag": "p", "text": "Together, E'thinaa and the Keeramak devised a new strategy for continuing the invasion. They made a secret deal with the Prime Minister of Bakura, Molierre Cundertol, and engineered a faux P'w'eck slave uprising, positing the Keeramak as its leader. Together, they succeeded in consecrating Bakura and launching a second invasion of the planet, but when the P'w'eck's actually did revolt and managed to kill the Keeramak, all was lost."}, {"tag": "p", "text": "Meanwhile, the deceased Keeramak's body was returned on a P'w'eck shuttle bound for Lwhekk as a gesture of appeasing the Conclave while arousing its the Elder's Council. En route, the shuttle was hijacked by Cundertol. Upon arriving at a pre-scheduled asteroid location, Cundertol himself was slain by E'thinaa—who revealed himself to be a disguised Vong agent."}, {"tag": "p", "text": "The subsequent fate of the Ssi-ruuvi is unknown, although it was believed that the Yuuzhan Vong empire launched an actual invasion of their territory in 28 ABY in coordination with their attacks on the known galaxy. By doing this they put down the Ssi-ruuvi Imperium of the Ssi-ruuk Star Cluster and began a brief new reign of terror within the sector of the Unknown Regions. In any event, it is likely that the Imperium was too weakened to continue its invasion plans for the foreseeable future."}, {"tag": "h2", "text": "Government"}, {"tag": "p", "text": "The head of the Ssi-ruuvi Imperium was His Potency the Shreeftut who was an elective monarch that served with absolute authority for life. The Shreeftut was endowed with executive powers over the Imperium and was elected by both the Conclave and the Elders Council. The Conclave was in charge of religious affairs and was dominated by the gold-scaled priestly caste while the Elder's Council administrated the socio-economic aspects of the Imperium and was dominated by the blue-scaled aristocratic class."}, {"tag": "p", "text": "Both organizations possessed judicial and legislative powers and competed for control of the empire. Only the power of the Shreeftut could prevent civil war from happening. The punitive Chiss and New Republic attacks in 4 ABY not only devastated the infrastructure of the empire but reduced the bureaucracy to a rump of its former power. Around that time, the multi-colored Ssi-ruu known as the Keeramak was conceived; fulfilling an ancient prophecy that one born with many colors would free the oppressed lower castes—particularly the brown scaled Ssi-Ruuk, which were lead from a union between two Ssi-Ruuk from different castes, and the lowly P'w'ecks and would lead the lower masses against their upper-class oppressors."}, {"tag": "p", "text": "In 23 ABY, the Imperium engineered a faux coup by the P'w'eck Emancipation Movement led by the Keeramak who was then installed as a figurehead Shreeftut. However, he was manipulated by a disguised Yuuzhan Vong agent known as General E'thinaa who negotiated with the Bakuran Prime Minister Molierre Cundertol to turn over his people as entechment subjects and slaves in exchange for being installed in an Human replica droid body. In 28 ABY, the Imperium used a consecration ceremony as a smokescreen for an invasion but were thwarted by a genuine P'w'eck uprising and a Galactic Alliance counter-attack."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "The Ssi-ruuvi Imperium's military consisted of the red-hued warrior class which dominated both its fleets of starships and its ground forces. Due to their trichoid configuration and fervent religious beliefs, they were noted as fierce opponents when forced into a fight. However, due to their fear of dying away from their consecrated home space, the Ssi-ruuvi military rarely operated beyond their Star Cluster. In an effort to compensate for this disadvantage, the Ssi-ruuk used large numbers of droids and P'w'ecks - a smaller species enslaved by the Ssi-Ruuk - to aid them in their fleets.Thus, they were masters of quick strikes designed to achieve victory quickly and secure as many captives as possible from which they grew in strength by using entechment to bolster their numbers."}, {"tag": "p", "text": "Consequently, the Imperium's military was designed to operate against technologically-primitive foes as was the case during the Invasion of Bakura—where the Imperium fleet wiped out half of the Imperial garrison prior to the arrival of Rebel Alliance reinforcements.However, the Imperium's military fared poorly against technologically-advanced foes like the New Republic, Chiss Ascendancy and even the Yuuzhan Vong.Following an invasion of Chiss space, the Chiss launched a punitive attack which devastated much of the Imperium's military power.During the fighting, Ssi-ruuk-piloted V'sett-class fighters were encountered by Chiss pilots as noted by Jagged Fel."}, {"tag": "p", "text": "If the Imperium wanted to annex a planet outside their home space, Ssi-ruuk of the golden-hued priest caste would conduct an hour-long ceremony to consecrate another planet. According to their religious beliefs, if a Ssi-ruu died away from their \"consecrated\" their star cluster, his soul was destined to wander the universe for eternity and be denied access to the fourth egg that was the Ssi-ruuvi afterlife. At the end of the ceremony, the Ssi-Ruuk would dedicate the planet to the Ssi-ruuvi Imperium, and give it a Ssi-Ruuvi name. The only known example was the planet Bakura which was consecrated as Xwhee as a prelude to an invasion in 28 ABY."}, {"tag": "h2", "text": "Foreign relations"}, {"tag": "p", "text": "For millennia, the Imperium had never dared to expand beyond its cluster, partly because of the large distances involved, partly due to their xenophobic nature, and partly because of their religious fear of traveling to 'unconsecrated' worlds. Due to these factors, the Ssi-ruuvi Imperium had little in terms of relations with other civilizations within Unknown Regions and the greater galaxy . The Imperium only interacted with foreign powers as a means of using the other party to further their own priorities."}, {"tag": "p", "text": "Despite having access to the hyperdrive technology which allowed their starships to access hyperspace, the presence of gravitational anomalies in their region of space hindered navigation—making space travel outside their star cluster hazardous. Thus, for millennia, the Imperium had little knowledge of other powers in the galaxy. The only known Ssi-ruuvi expedition into the known galaxy before 4 ABY was when an experimental hyperdrive vessel crashed on the Mid Rim world of Garos IV circa. 25,000 BBY."}, {"tag": "p", "text": "Another factor in the limited development in foreign relations was the cultural xenophobia of the Ssi-ruuvi Imperium and the Ssi-ruuk themselves. The Ssi-ruuvi species viewed themselves as inherently superior to all other species (even their own relatives, the P'w'ecks). In the Imperium's mindset, all other species in the galaxy they encountered were fit only for slavery and entechment—which utilized the life energies of another sentient being as a source of energy for their mechanical technology."}, {"tag": "p", "text": "This xenophobia was evident in their treatment of a wide range of species ranging from their lowly saurian P'w'eck cousins to the advanced mammalian Human and Chiss civilizations.Consequently, the Ssi-ruuk sought to conquer and to subjugate other civilizations to utilize their labor and resources.As a result, relations between the Ssi-ruuk and the neighboring powers like the Chiss Ascendancy, Galactic Alliance and the Yuuzhan Vong were virtually non-existent as of 28 ABY ."}, {"tag": "p", "text": "More importantly, was their religious fear of dying on an 'unconsecrated' world away from their home space. According to their beliefs, if a Ssi-Ruu died away from Lwhekk, their soul was destined to wander the universe without end, and be denied access to the fourth egg that was the Ssi-ruuvi afterlife. Thus, the Imperium employed a large number of \"disposable\" P'w'eck slaves and droids on their starships to minimize Ssi-ruuvi losses during expeditions."}, {"tag": "p", "text": "To counter this, the Priests would conduct an hour-long consecration ceremony to consecrate another planet. At the end of the ceremony, the Ssi-Ruuk would dedicate the planet to the Imperium, and give it a Ssi-Ruuvi name. The only consecration ceremony viewed by non-Ssi-Ruuk was when Bakura was consecrated as Xwhee by the Keeramak, during the Ssi-Ruuvi attempt to re-conquer Bakura."}, {"tag": "h2", "text": "Territory"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}