{"url": "Staguu_Itincoovar", "categories": ["Category:Legends articles", "Category:ExplorCorps members", "Category:Givin", "Category:Males", "Category:Post-Ruusan Jedi"], "nodes": [{"tag": "h1", "text": "Staguu Itincoovar"}, {"tag": "p", "text": "Staguu Itincoovar was a Force-sensitive male Givin who lived in the last decades of the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Although he had been taken from infancy to be trained as a Jedi, Itincoovar failed his Initiate Trials, and no Jedi Master elected to take him as Padawan. However, he was integrated in the Order's Exploration Corps at the request of Master Ekim Ryelli. During the later stages of the Clone Wars, around 19 BBY, Itincoovar accompanied Ryelli and Telloti Cillmam'n to Nicht Ka, where an ancient structure had been discovered. While the Givin was sent back to the starship in order to compare some inscriptions with the ship's database, Cillmam'n discovered an ancient armor that once belonged to the Dark Jedi Warb Null. While researching the philology database, Itincoovar received a transmission from Palpatine, the Supreme Chancellor of the Republic, announcing that the Clone Wars had been won and that all Jedi were ordered to return to their main temple on Coruscant."}, {"tag": "p", "text": "When the Givin tried to communicate with Master Ryelli via comlink, no answer came. Unbeknownst to Itincoovar, Cillmam'n had put on Warb Null's armor, fallen to the dark side of the Force and beheaded Master Ryelli. The Givin himself was also killed when the murderous Cillmam'n—who now referred to himself as \"Malleus\"—returned to the ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Staguu Itincoovar fist appeared in Hammer, a short story written by Edward M. Erdelac for the 147th issue of the Star Wars Insider magazine. He was named after Erdelac's son, August Victoriano."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}