{"url": "Ssi-ruuvi_security_droid", "categories": ["Category:Legends articles", "Category:Security droid models", "Category:Ssi-ruuvi technology"], "nodes": [{"tag": "h1", "text": "Ssi-ruuvi security droid"}, {"tag": "p", "text": "Ssi-ruuvi security droids were a form of battle droid used by the reptilian Ssi-ruuk of the Ssi-ruuvi Imperium."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "These droids resembled a swollen R-series astromech droid. Like the vast majority of their technology, these security droids were powered by entechment, which involved a living organism's life-energy and consciousness being drained from its body to be used as a power source for a machine."}, {"tag": "p", "text": "These droids were spherical in shape and stood at only 0.8 meters in height. Security droids traveled on three wheeled legs and were colored in a dull metallic green. Due to entechment, they were faster and more agile than they appeared. Their main photoreceptor was linked to a Ssi-ruuk's visual range which included some of the ultraviolet spectrum. The droid also featured olfactory detectors since the sense of smell was an important sense to the Ssi-ruuvi species. The rear of the spherical droid's upper hemisphere also featured a cluster of hexagonal power conduits."}, {"tag": "p", "text": "The security droid's primary weapon was a mounted short-range blaster on a rotating apparatus near the main body. The beam fired from the blaster was strong enough to knock a P'w'eck (a slave species enslaved by the Ssi-ruuvi early in their history) unconscious though it could prove fatal for Humans. Despite this, such droids were not well-insulated against power surges and ionization, thus causing them to short-circuit when shot by another stun gun."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During their invasion of Bakura in 4 ABY, the Ssi-ruuvi expeditionary fleet brought several of these droids along. Following the Ssi-ruuvi defeat at the hands of the Alliance to Restore the Republic and the local Imperial garrison, the surviving droids were confiscated by the New Republic and sent to top-secret research facilities for study."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}