{"url": "Stan_Lee", "categories": ["Category:Real-world articles", "Category:Real-world people"], "nodes": [{"tag": "h1", "text": "Stan Lee"}, {"tag": "p", "text": "Stan Lee (December 28, 1922 – November 12, 2018), born Stanley Martin Lieber in New York City, New York, was a comic book writer, having co-created the Fantastic Four, the Incredible Hulk, Spider-Man, the X-Men, Thor, and thousands of other heroes, villains, and supporting cast members. He joined Marvel Comics in 1941 as a gofer, but soon was allowed to write (his first work was a two-page text story in Captain America Comics #3). The vast majority of his work has been for Marvel, though he has written a few stories for other companies (namely DC and their Stan Lee's Just Imagine... series, where Stan would reimagine iconic DC heroes such as Superman, Batman, Captain Marvel, and Wonder Woman)."}, {"tag": "p", "text": "From writer, Stan progressed to editor, then editor-in-chief before he was even 20. During World War II, he joined the U.S. Army and was sent to the Signal Corps, where he wrote and drew training manuals and cartoons; he was one of only nine men in the entire Army to be given the military classification of \"playwright.\""}, {"tag": "p", "text": "After the war, he returned to Marvel, where he would remain as editor-in-chief until 1972. Thereafter, he became publisher. For a brief period, he was president of the entire company, but found it boring as it was too much about numbers and not enough about creativity. He returned to being publisher, a title he would hold for many years. He held the lifetime title of \"Chairman Emeritus,\" lived in California with Joan, his wife of more than 65 years, and continued doing occasional stories for Marvel for the rest of his life. He also frequently wrote columns and introductions, always ending with his trademarked phrase \"Excelsior!\" Despite occasional disputes over royalties from the tie-in products based on his creations, he remained the public face of Marvel and, indeed, of comic books in general."}, {"tag": "p", "text": "His involvement with Marvel Star Wars is limited but significant. He originally planned to decline making a series on the movie, believing it to be just another science-fiction film; however, after learning Sir Alec Guinness was involved, he was intrigued. This allowed Roy Thomas to talk him into it, a decision credited by many with saving Marvel Comics from financial bankruptcy. He later wrote the introduction to The Marvel Comics Illustrated Version of Star Wars."}, {"tag": "p", "text": "Lee passed away following severe illness on November 12, 2018."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}