{"url": "Star_Defender", "categories": ["Category:Legends articles", "Category:Capital ship classifications"], "nodes": [{"tag": "h1", "text": "Star Defender"}, {"tag": "p", "text": "Star Defenders were heavy warships created for the New Republic. They took Republic ship-construction in a new direction, towards larger and more intimidating classes than previously built."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Black Fleet Crisis pointed out the weakness of relying only on smaller, compact warships. Following the conflict, design teams at Mon Calamari went to work on a concept that would become the largest battleship ever constructed at the Mon Calamari Shipyards, the Viscount-class Star Defender."}, {"tag": "p", "text": "It was envisioned that ships of this kind would help safeguard the New Republic, defend it against larger threats like the Imperial Remnant's Star Destroyers. Because of the more benign purpose of the class, the ship-type was designated \"Star Defender\", to contrast the use of historically burdened terms like \"Star Destroyer\"."}, {"tag": "p", "text": "The first vessel commissioned was the lead ship of the class, Viscount. During its construction, the face of galactic politics changed, with the formal end of the Galactic Civil War in 19 ABY and a gradual return to Galactic Republic-style infighting. Finally completed and commissioned in 25 ABY, Viscount went on its maiden voyage only weeks before the start of a galactic conflict that would see it put to good use, the Yuuzhan Vong War."}, {"tag": "p", "text": "As the war progressed, other Star Defenders joined the fleet, like the Corellian-designed Strident-class. Following the war, many Stridents were gathered for Corellia's personal defense and would see action again, during the Second Galactic Civil War."}, {"tag": "p", "text": "At some point following the Second Galactic Civil War, heavy warships like the Star Defenders and Star Dreadnoughts were phased out of service, citing the expenses in operating the various designs."}, {"tag": "h2", "text": "Known Star Defender classes"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}