{"url": "Star_Destroyer", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Capital ship classifications", "Category:Star Destroyer classes", "Category:Star Destroyers"], "nodes": [{"tag": "h1", "text": "Star Destroyer"}, {"tag": "p", "text": "A Star Destroyer was a dagger-shaped type of capital ship that were used by  the Galactic Republic, the Galactic Empire, the First Order, and the Sith Eternal."}, {"tag": "p", "text": "Notable examples of Star Destroyers include the Imperial-class Star Destroyer and its predecessor the Venator-class Star Destroyer."}, {"tag": "p", "text": "According to Everi Chalis, Star Destroyers were the most resource-intensive ships the galaxy had ever seen, and only Kuat possessed shipyards that were capable of supporting and maintaining more than a handful at a time."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Galactic Republic Navy fielded a fleet of Venator-class Star Destroyers. The Venator-class saw action in numerous battles against the Confederacy navy including the Battle of Coruscant. Following the transformation of the Republic into the Galactic Empire, the Republic's Star Destroyers were incorporated into the new Imperial Navy. Aside from the Venator and Imperial-class Star Destroyers, other known models in Imperial service included the Victory and Secutor-class Star Destroyers."}, {"tag": "p", "text": "During the rebellion and the Galactic Civil War, Imperial Star Destroyers took part in numerous engagements against the various rebel forces that eventually coalesced into the Alliance to Restore the Republic. Star Destroyers were deployed during the secret mission to Tatooine, Battle of Hoth, and the Battle of Endor."}, {"tag": "p", "text": "Following the events at Endor, the Rebel Alliance's successor government, the New Republic, captured and destroyed numerous Star Destroyers in several engagements including the Battle of Theed, the Rebellion on Akiva, the Battle for Kuat Drive Yards, and the Liberation of Kashyyyk. By 5 ABY, Grand Admiral Rae Sloane estimated that 75% of the Imperial Star Destroyers before Endor had either been destroyed, captured, or lost in \"confirmable if curious ways.\" While trawling through the archives at the Hall of Imperial Register on Coruscant, Sloane discovered that the remaining 25% had mysteriously disappeared and their purported destruction had been falsified."}, {"tag": "p", "text": "Later, Sloane learned that Fleet Admiral Gallius Rax secretly commanded Imperial fleets in the Almagest, the Recluse's Nebula, the Queluhan Nebula, the Ro-Loo Triangle, and the Inamorata. These fleets consisted of hundreds of Star Destroyers and thousands of smaller ships. Following the Attack on Chandrila, Rax ordered the Imperial fleets to assemble above the planet Jakku. Numerous Star Destroyers, including Captain Ciena Ree's starship Inflictor, saw action during the Battle of Jakku, the cataclysmic battle that ended the Galactic Civil War in favor of the New Republic."}, {"tag": "p", "text": "Thirty years after the Battle of Endor, the barren surface of Jakku was still littered with the wreckage of countless Star Destroyers. These derelict starships were regularly targeted by scavengers such as Rey. The First Order, a remnant of the Old Empire, was also known to utilize Star Destroyers as part of its fleet, such as the First Order's Resurgent-class Star Destroyers, which were inspired by the dagger-shaped design of the Old Empire's vessels."}, {"tag": "h2", "text": "Designs"}, {"tag": "h3", "text": "Battlecruisers"}, {"tag": "h4", "text": "Maelstrom-class battle cruiser"}, {"tag": "p", "text": "The Maelstrom-class battle cruiser was a class of proto-Star Destroyer that served the Galactic Republic, and was one of the largest Republic warships at the start of the Clone Wars."}, {"tag": "h4", "text": "Resurgent-class Star Destroyer"}, {"tag": "p", "text": "The Resurgent-class Star Destroyer was a model of Star Destroyer used in the First Order Navy, inspired by the Star Destroyers of the Empire."}, {"tag": "h4", "text": "Secutor-class Star Destroyer"}, {"tag": "p", "text": "The Secutor-class Star Destroyer was a model of Star Destroyer used by the Galactic Empire sometime after the end of the Galactic Republic."}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Cruisers"}, {"tag": "h4", "text": "Acclamator-class Planetary Assault Ship"}, {"tag": "p", "text": "The Acclamator-class Planetary Assault Ship was a cruiser class used by the Republic Navy, and was considered a proto-Star Destroyer."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Interdictor-class Star Destroyer"}, {"tag": "p", "text": "The Interdictor-class Star Destroyer was an Interdictor vessel that could pull ships out of hyperspace using its gravity well projectors."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Onager-class Star Destroyer"}, {"tag": "p", "text": "The Onager-class Star Destroyer, also known as the \"Siege Breaker\" was a model of Star Destroyer utilized by the Galactic Empire for large-scale planetary bombardments."}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Dreadnoughts"}, {"tag": "h4", "text": "Executor-class Star Dreadnought"}, {"tag": "p", "text": "The Executor-class Star Dreadnought, also known as the Super-class Star Destroyer, was the largest model of Star Destroyer ever built by the Galactic Empire."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Mega-class Star Dreadnought"}, {"tag": "p", "text": "The Mega-class Star Destroyer, more commonly known as Mega-class Star Dreadnought, was a massive vessel used by the First Order. There was only one Mega-class Star Destroyer in the entire First Order Navy, the Supremacy, which served as the flagship of Supreme Leader Snoke, and as the mobile capital of the First Order."}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Other classification"}, {"tag": "h4", "text": "Gladiator-class Star Destroyer"}, {"tag": "p", "text": "The Gladiator-class Star Destroyer was used as a long-range patrol craft. At 600 meters, it was the smallest of Imperial Star Destroyers, but still packed heavy firepower."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Imperial-class Star Destroyer"}, {"tag": "p", "text": "The Imperial-class Star Destroyer (ISD) was a Star Destroyer line employed by the Galactic Empire after the fall of the Galactic Republic as a replacement to the smaller Venator-class Star Destroyer. The Imperial-class consisted of two variants; Imperial I-class and Imperial II-class."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "qaz-class Star Destroyer"}, {"tag": "p", "text": "The qaz-class Star Destroyer was a warship in use after the Clone Wars, equipped with powerful laser batteries."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Tector-class Star Destroyer"}, {"tag": "p", "text": "The Tector-class Star Destroyer was utilized by the Galactic Empire during the Battle of Endor."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Venator-class Star Destroyer"}, {"tag": "p", "text": "The Venator-class Star Destroyer was a capital ship used by the Galactic Republic during the Clone Wars, a hybrid serving as a capital ship in combat and which doubled as a starfighter carrier. It was eventually phased out by the Galactic Empire, in favor of the larger Imperial-class Star Destroyer."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Victory-class Star Destroyer"}, {"tag": "p", "text": "The Victory-class Star Destroyer was a model of Star Destroyer used by the Galactic Republic and later the Galactic Empire."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Xyston-class Star Destroyer"}, {"tag": "p", "text": "The Xyston-class Star Destroyer was a model of Star Destroyer used by the Sith Eternal as part of the Final Order. It was equipped with an Axial superlaser which could destroy planets."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}