{"url": "Star_Cruiser", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Ship stubs", "Category:Capital ship classifications"], "nodes": [{"tag": "h1", "text": "Star Cruiser"}, {"tag": "p", "text": "A Star Cruiser was a type of cruiser. The term was frequently used to refer to Mon Calamari cruisers, such as the MC75 modified star cruiser, MC80 Star Cruiser, and the MC85 Star Cruiser used by the militaries of the Alliance to Restore the Republic, the New Republic, and the Resistance."}, {"tag": "h2", "text": "Mon Calamari Star Cruisers"}, {"tag": "h3", "text": "MC75 Star Cruiser"}, {"tag": "p", "text": "The MC75 Star Cruiser was a type of star cruiser made by the Mon Calamari. They were originally manufactured as city-ships, and were converted into warships when the Mon Calamari joined the Alliance to Restore the Republic. There were at multiple types of MC75 cruisers including; the MC75 Armored Cruiser, the MC75 Ordnance Cruiser, the MC75B Star Cruiser and the MC75C Star Cruiser."}, {"tag": "h3", "text": "MC80 Star Cruiser"}, {"tag": "p", "text": "The MC80 Star Cruiser was another type of star cruiser manufactured by the Mon Calamari. Like the MC75, they were designed as city-ships and reconfigured for combat after the Mon Calamari joined the Rebel Alliance.[source?] The MC80 Liberty Type Heavy Star Cruiser and the MC80A Home One Type Heavy Star Cruiser were variants of the MC80."}, {"tag": "h3", "text": "MC85 Star Cruiser"}, {"tag": "p", "text": "The MC85 Star Cruiser was the first starship type commissioned by the New Republic after the Galactic Civil War."}, {"tag": "h3", "text": "MC95 Star Cruiser"}, {"tag": "p", "text": "The MC95 Star Cruiser was a model of starship made by the Mon Calamari. There were multiple variants including the MC95A Star Cruiser, the MC95B Star Cruiser, the MC95C Star Cruiser, the MC95D Star Cruiser, and the MC95E Star Cruiser."}, {"tag": "h3", "text": "Unidentified Star Cruisers"}, {"tag": "p", "text": "The Mon Calamari also made a star cruiser with blunted fins."}, {"tag": "h2", "text": "Other Star Cruisers"}, {"tag": "h3", "text": "MPO-1400 Star Cruiser"}, {"tag": "p", "text": "The MPO-1400 Star Cruiser was a model of star cruiser that was used by Chandrila Star Line."}, {"tag": "h3", "text": "Hynestian Star Cruiser"}, {"tag": "p", "text": "The Hynestian Star Cruiser was in use by the Citizens' fleet at Exegol."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}