{"url": "StarSpeeder_3000/Legends", "categories": ["Category:Legends articles", "Category:StarSpeeder 3000s"], "nodes": [{"tag": "h1", "text": "StarSpeeder 3000"}, {"tag": "p", "text": "The StarSpeeder 3000 was a transport spacecraft used by the Star Tours travel agency. It had room to carry up to 40 passengers. The craft were produced sometime around 4 ABY, when Star Tours referred to them as \"new.\""}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The StarSpeeder 3000s were very similar in to their predecessors, the StarSpeeder 1000s, both in shape and equipment. The craft was still boxy, with a downwardly angled front side, and still featured the usual five automated doors on both starboard and portside. With its five seating rows, the 3000 could still be boarded by no more than forty passengers at a time. Like with the StarSpeeder 1000, an astromech droid was loaded in a socket at the bow of the ship."}, {"tag": "p", "text": "Those transports were normally piloted by an RX-Series pilot droid, assisted by its astromech droid navigator. The ship was considered fast and maneuverable for a transport. Given the lowered risk usually involved in interplanetary tourism, the StarSpeeder 3000 was equipped only with minimal deflector shields and two simple laser cannons. However, the tour brochure indicated that the hyperdrive, or \"warp drive,\" was fairly advanced. Despite the agency's claim that the ships themselves were highly advanced, they were often in need of repair."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The StarSpeeders were used by Star Tours starting around 4 ABY, and eventually used during their push to capitalize on the new found notoriety of Endor at the time with the Endor Express route. After a series of mishaps in the months following, including a StarSpeeder's accidental involvement in a space battle, the tour company shut down."}, {"tag": "p", "text": "The vessels were used for years afterward by other entities, including Corellian Translines in 17 ABY. Some remained in service as late 19 ABY, when many could be seen operating around the planet Di'wor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Warp drive\" is the primary means of propulsion for vehicles in Star Trek. Many early Star Wars tie-in media products mistakenly used this term for the faster-than-light drives of Star Wars ships, which are properly known as \"hyperdrives.\""}, {"tag": "p", "text": "With the launch of the new Star Tours: The Adventures Continue attraction at three Disney Parks, passengers ride a new starship. The new ship, called the StarSpeeder 1000, is white with an orange pinstripe, while the StarSpeeder 3000 is white with a blue pinstripe. While sources state the 1000 was manufactured by Sacul Aerospace, there is no such information about the similarly designed 3000."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}