{"url": "StarScavenger", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Articles with an excess of redlinks", "Category:Freighters"], "nodes": [{"tag": "h1", "text": "StarScavenger"}, {"tag": "p", "text": "The StarScavenger was a starship owned by the Freemakers, a family of scavengers. They used the ship to collect and transport scrap and travel across the galaxy. The StarScavenger saw many adventures after Rowan Freemaker, the youngest in the family, discovered he was Force-sensitive and became involved in a quest to find the Kyber Saber crystals. This brought the StarScavenger and her owners into conflict with the Galactic Empire, the Sith agent Naare, the Hutt crime lord Graballa, the gangster Hondo Ohnaka, and the Imperial hunter droid M-OC."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The StarScavenger was a CT-900 freighter with a configurable design. It was fitted with modular wings, three engines, blasters, two spring-loaded shooters, and a detachable cargo section. The ship could house at least four crew and was used for collecting and transport scrap and starship parts. The StarScavenger also carried a smaller salvage vessel known as the Mini Scavenger, the submarine Bubbly Snubbly, and Zander's Blazemaker Mark II starfighter. The ship was equipped with a hyperdrive, a rear deflector shield, and a quantum regulator. It could also transport passengers and be reconfigured into different forms."}, {"tag": "p", "text": "Following the Skirmish on Shantipole, Rowan used his Force Building powers to build a larger and more elongated version of the StarScavenger. The new ship had a wider charging station for Roger and was equipped with a set of embersteel blades which could be powered by the Kyber Saber. This allowed the ship to breach the DS-2 Death Star II Mobile Battle Station's deflector shields during the Battle of Endor."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Making ends meet"}, {"tag": "p", "text": "The StarScavenger dated back to before the Clone Wars. She was the personal starship of the Freemakers, a scavenging family who owned a salvage and repair business at the Wheel space station in the Abrion system. They used the ship to collect scrap and starship parts across the galaxy. Following the Battle of Hoth, the Freemakers used the StarScavenger to salvage scrap in the midst of a dogfight between an Imperial assault cruiser, its TIE fighter escorts, and Rebel Alliance X-wing starfighters. Zander and Kordi Freemaker picked up the wreckage using the ship's tractor beam while their younger brother Rowan Freemaker manned the ship's main twin turret. After Rowan accidentally blew up the assault cruiser, the Freemakers fled into hyperspace."}, {"tag": "p", "text": "The Freemakers then returned to their garage only to discover that their Aqualish landlord had blocked the entrance with a flood droid as retaliation for defaulting on their rent. Kordi managed to convince Furlac to give them one more day to pay their rent. After unloading scrap, the Freemakers discovered that a rebel pilot and a TIE fighter pilot had survived. Kordi ushered them out after the two belligerents began fighting. Zander and Kordi attempted to construct a Z-wing out of scrap components salvaged from the battle. However, Rowan accidentally blew it up by knocking a pole into the head of an AT-ST walker."}, {"tag": "h3", "text": "Rowan's new destiny"}, {"tag": "p", "text": "To build a starship in order to pay their rent, the Freemakers and their B1-series battle droid Roger traveled on the StarScavenger to the Clone Wars battle site of Nal Kapok. While Zander and Kordi searched for salvage, Roger was tasked with babysitting Rowan. However, Rowan left the ship to warn his siblings about the presence of stormtroopers. As a result, Rowan and Roger found the hilt of the Kyber Saber and encountered the undercover Sith agent Naare. Posing as a Jedi, Naare convinced Rowan to embark on a quest to collect the pieces of the Kyber Saber. The Freemakers then returned to the Wheel in the StarScavenger with Naare following in the Eclipse Fighter."}, {"tag": "p", "text": "Later, Zander and Kordi traveled on the StarScavenger into the Belgaroth asteroid field to find Rowan and Roger, who had embarked on a quest to find the second Kyber Saber crystal. After parking their ship at the Hutt crime lord Graballa's ore mine, the Freemakers and Naare traveled aboard Graballa's starship Rancor's Fist and rescued Rowan and Roger. After escaping back to their ship, Rowan apologized to his siblings for his reckless actions and to Naare for losing the second crystal. Naare almost destroyed the StarScavenger with a laser blast but it narrowly missed the ship. She abandoned her attempt when Rowan managed to find the Kyber Saber crystal in space."}, {"tag": "p", "text": "The StarScavenger remained at the Freemaker Garage while Kordi and Rowan went to rescue Zander, who had been captured by the Imperial Star Destroyer Vendetta after taking Wick Cooper's N-1 starfighter for a joyride. Later, the Freemakers used the StarScavenger to travel to Cloud City on the planet Bespin to retrieve the rebel Lando Calrissian's \"lost treasure\", which turned out to be a cape. For the mission, they left their cargo bay behind since they were not going on a salvage run."}, {"tag": "h3", "text": "Entanglements"}, {"tag": "p", "text": "The Freemakers later flew the StarScavenger to the Wookiee homeworld of Kashyyyk to retrieve a piece of wroshyr wood for the Twi'lek captain Ignacio Wortan. While Roger stayed aboard the ship, the Freemakers at the request of the Wookiee chief Attabura infiltrated a Trandoshan island fortress and rescued his son Tantarra. At Zander's request, Roger flew the StarScavenger to pick up the Freemakers and Tantarra. However, the Freemakers and Tantarra became involved in a quest to obtain the third Kyber Saber crystal from a Trandoshan statue. Roger parked the ship in a blaze and waited for his family. The Freemakers were confronted by the Imperial officers Durpin and Plumestriker but managed to escape back to the Wheel thanks to Kordi."}, {"tag": "p", "text": "Later, the rebels Princess Leia Organa and Luke Skywalker visited the Freemaker Garage to seek repairs for their Y-wing starfighter. While Rowan and Luke were searching for an ion stabilizer aboard the StarScavenger, Roger accidentally started the ship's engines and hyperdrive, causing it to jump into hyperspace. Using the Force, Luke managed to regain control of the ship's hyperdrive lever just as the StarScavenger emerged on hyperspace and crashlanded on the planet Felucia. Rowan and Luke used their Force powers to repair the ship. With the help of the Force and Roger, they also recovered the ship's hyperdrive motivator from a pit inhabited by an acklay. Together, the Freemakers and Luke returned to the Wheel."}, {"tag": "p", "text": "After receiving a job offer from the podracing pilot Ben Quadinaros to service his podracer on Tatooine, the Freemakers traveled on the StraScavenger there. After narrowly escaping a trap by Graballa and participating in the 29th Annual Bricklayers' Classic, the Freemakers fled into the Dune Sea. Unable to reach their ship, they called Naare for help. After Naare rescued them, they returned to the StarScavenger."}, {"tag": "h3", "text": "Race for the Kyber Saber"}, {"tag": "p", "text": "Following the events on Tatooine, the Freemakers discovered Naare was a Sith and made preparations to flee aboard the StarScavenger. Following a struggle in the Freemaker Garage, the Freemakers fled on their ship into space. Naare pursued them in the Eclipse Fighter and damaged their rear deflector shield. After clipping off the Eclipse Fighter's wings, Zander took the StarScavenger into hyperspace. After losing their quantum regulator, they were forced to land at Maz Kanata's castle on Takodana. While landing, Zander accidentally scratched the Weequay pirate Hondo Ohnaka's ship."}, {"tag": "p", "text": "To pay for the damage, Kordi and her siblings agreed to leave the StarScavenger as collateral while they traveled on the Mini Scavenger to the Third moon of Takodana to obtain three golden orbs. There, they discovered that the orbs were varactyl eggs. After confronting Hondo, an impressed Max Kanata gave them a quantum regulator. She also gave Rowan the fourth Kyber Saber crystal and told him to turn to the Maker of Zoh for help. Before they could leave, Naare arrived with Graballa and stole the fourth crystal. The StarScavenger pursued Naare's ship but came under attack from Graballa's Rancor's Fist. The Freemakers managed to flee into hyperspace."}, {"tag": "p", "text": "At the urging of Rowan, the Freemakers traveled to the planets Ningoth and Naboo to obtain the fifth and sixth Kyber Saber crystals from Naare. However, Naare stole those crystals well. After leavin Naboo, the Freemakers discovered that the seventh crystal was on the planet Hoth and that Naare had been using Roger's transmission pack to track them down. The Freemakers then landed the StarScavenger on the junkyard planet of Zoh. There, they encountered Jek-14, who taught Rowan in the ways of the Force. After Roger and the Freemakers contended with several mutinous droids led by N-3RO, they fled Zoh on their starship just as Graballa and Naare atttacked the planet. Rowan then challenged Naare and Graballa to race their ship to Hoth for the last Kyber crystal."}, {"tag": "p", "text": "Despite the stormy atmosphere, Rowan managed to use the Force to guide the Freemakers through the snow storm. The StarScavenger narrowly avoided colliding with a mountain but their pursuers were not so lucky. While the Freemakers went to search for the seventh Kyber Saber crystal in a cave, Roger stayed behind to guard the ship. While trying to warm the ship, he overheated the StarScavenger's engines. This caused the ship and Roger to fall into an ice lake. Roger managed to escape but the ship was trapped beneath the ice lake. The StarScavenger was only hit when the Freemakers shot down Graballa's Rancor's Fist; causing it to crash into the lake and free the StarScavenger. After Rowan tricked Naare by offering an ice shard, the Freemakers fled with the real crystal into hyperspace. Unwilling to endanger his family, Rowan departed with Roger and the seventh crystal for an uncharted world."}, {"tag": "h3", "text": "Showdown with Naare"}, {"tag": "p", "text": "Worried about their younger brother, Zander and Kordi traveled to Naboo, Cloud City, Kashyyyk and Tatooine in an attempt to find him. After having their tools stolen by Jawas on Tatooine, the Freemakers decided to return to the Freemaker Garage. After landing the StarScavenger, they were confronted by Furlac who demanded payment for their rent. Naare, Graballa, and his henchmen then ambushed the Freemakers. In an attempt to draw Rowan out of hiding, Naare tortured Kordi and Zander psychologically. She damaged the StarScavenger and ripped its cannons off to break him. This had the desired effect and Rowan returned within Roger to fight Naare. Despite a fierce resistance by the Freemakers, Naare discovered that Roger knew where the seventh Kyber Saber crystal was hidden and stole his head."}, {"tag": "p", "text": "Using his Force powers, Rowan repaired the damaged StarScavenger. The Freemakers then traveled to the galactic capital Coruscant as part of Rowan's plan to steal the Kyber Saber from Naare by posing as Emperor Palpatine. After infiltrating the Imperial Palace and recovering Roger's head, Kordi and Zander returned to the StarScavenger. When Naare threw several civilians from a platform, Kordi and Zander used the StarScavenger to rescue them. Later, the two siblings used the StarScavenger to pick up Rowan and the stolen Kyber Saber from the Imperial Palace."}, {"tag": "p", "text": "The Freemakers then raced their ship through the skylanes of Coruscant with TIE fighters in pursuit. While Zander used the Blazemaker Mark II to distract the Imperials, Rowan used the Force to reconfigure the StarScavenger's shape and escape into space. Once in space, the Freemakers traveled to Sullust where Rowan plunged the Kyber Saber into a volcano, destroying it. The Freemakers then decided not to return to the Wheel and to instead travel through the galaxy. Later, the StarScavenger encountered the Alliance Fleet and accepted an invitation by Admiral Acbkar to join the Rebel Alliance."}, {"tag": "h3", "text": "Joining the Rebellion"}, {"tag": "p", "text": "After establishing contact with Admiral Ackbar, the Freemakers fly the StarScavenger aboard the MC80A Home One Type Heavy Star Cruiser Home One, which serves as Admiral Ackbar's command ship. The Freemakers later use the StarScavenger to travel on a mission to obtain a Type A vector coil for Lieutenant Valeria's U-wing. During the course of the mission, the Freemakers travel to several planets including Bespin, Kashyyyk, and Tatooine. Kordi manages to barter several objects until they obtain a Type A vector coil from a band of Jawas. After returning to the Home One, Admiral Ackbar hires the Freemakers to service the Alliance Fleet's starfighters."}, {"tag": "p", "text": "Following a Skirmish with an Imperial Star Destroyer, the StarScavenger traveled into space to pick up Roger. While building a buffer, Roger had accidentally turned the tide of the battle by catapulting himself into space and destroying the Star Destroyer's deflector shield generator."}, {"tag": "p", "text": "Later, the Freemakers travel on the StarScavenger on a mission to rescue Lando Calrissian and Chewbacca, whose ship the Millennium Falcon is stranded on a planet because their fuel intermixer has broken down. The StarScavenger is boarded by Durpin and Plumestriker's Gozanti-class cruiser. The Freemakers try to fool the Imperials by feigning symptoms of Gamorrean flu but Plumestriker is not fooled. With the help of Roger, the Freemakers escape the brig, steal the Imperial cruiser's fuel intermixer, and depart on the StarScavenger. They then rendezvoused with Lando and Chewbacca and return on their ships to the Home One."}, {"tag": "p", "text": "The Freemakers later traveled on the StarScavenger with the Mon Calamari starship builder Quarrie to Tibalt on a mission to salvage supplies for the Rebel Alliance. Quarrie marveled that the CT-900 freighter was still operating but was displeased with Zander's modifications. The StarScavenger sustained damage to one of its engines during a skirmish with the Imperial hunter droid M-OC. Following a duel between Rowan and M-OC, the Freemakers and Quarrie managed to escape back to Home One in the StarScavenger."}, {"tag": "h3", "text": "Quest to build the Arrowhead"}, {"tag": "p", "text": "During the quest to build the Arrowhead, Rowan along with Roger and Quarrie once took the StarScavenger on an errant trip to visit the ancient Force Builders city of Alistan Nor. Rowan was a clumsy pilot during the expedition and crashed into several starships during takeoff and upon returning to the Home One. The Freemakers later used the StarScavenger to travel to Mygeeto during an mission to obtain embersteel wings from an Imperial auction. Rowan and Roger later flew the StarScavenger in pursuit of Graballa's Rancor's Fist after the Hutt crime lord kidnapped their sister Kordi. After rescuing Kordi, Rowan, Roger, and Zander returned to the Home One on the StarScavenger while Kordi flew their newly-acquired Theta-class H-2 executive star shuttle. The shuttle's embersteel wings were used to help build the Arrowhead's embersteel blade."}, {"tag": "p", "text": "Later, the Freemakers flew the StarScavenger during a mission to rescue the Alliance agent Bren Derlin from a junk field near the acidic world of Taul. On the way, the Freemakers visited Maz Kanata's castle on Takodana to seek information on how to obtain a proton suspension housing for the Arrowhead's Kyber crystal. The Freemakers were joined by the pirate Hondo Ohnaka, who convinced them to give him passage offworld in return for leading them to a Corellian Defender on Taul. The StarScavenger's hull suffered some damage from the acidic rain but Kordi managed to activate the ship's deflector shield. The Freemakers managed to recover the proton suspension housing but Hondo stole the ship. Hondo was disarmed by Roger, who tossed him inside a box. Roger then picked up the Freemakers, who had escaped the Imperial hunter droid M-OC again. After rescuing Bren from his escape pod, the Freemakers handed Hondo to the bounty hunter Awan Zek."}, {"tag": "p", "text": "The Freemakers used the StarScavenger to travel to the Wheel in order to obtain an energy matrix activator from their former home. Following the mission, the Freemakers returned to the Alliance fleet on the StarScavenger."}, {"tag": "p", "text": "Later, the Freemakers used the StarScavenger to traveled to the planet Qalydon seeking a kyber crystal for the Arrowhead. When the Imperial officers Durpin and Plumestriker attacked the local Lurmen villagers and stole their kyber crystal necklaces, Rowan and the Lurmen Chief Biz's daughter Maynar used the StarScavenger's guns to drive away the Imperials. When the Imperials escaped offworld with the crystals, the Freemakers used the StarScavenger to pursue them to the Marriten system where they recovered them at lightsaber point."}, {"tag": "p", "text": "While traveling through space, the StarScavenger was attacked by the Imperial hunter droid M-OC. Rowan managed to use his Force powers to guide the starship to a planet that was full of kyber crystals. After exiting hyperspace, the StarScavenger crashlanded on the planet. While Rowan and Kordi went to search for a large kyber crystals, Zander and Roger tried to repair the ship. They were harassed by mynocks until Roger managed to distract them by flying with a jetpack. Zander managed to repair the ship's systems. After Rowan and Kordi returned with the ship's stabilizer fin and a large kyber crystal, they picked up Roger and went to rejoin the rebel fleet."}, {"tag": "p", "text": "The Freemakers traveled back to the rebel fleet aboard the StarScavenger. They found the rebel fleet under attack from Imperial forces. The StarScavenger managed to dodge enemy fire and return to the Home One but was forced to unload its cargo of salvage. While Rowan traveled with Valeria and Quarrie aboard the Arrowhead, Zander flew the StarScavenger with Zander and Roger. Together, they traveled to the planet Jakku where Rowan and Quarrie managed to assemble Arrowhead despite running into trouble from Durpin and Plumestriker. The StarScavenger and the fully operational Arrowhead returned to the rebel fleet where the Arrowhead forced the Imperial fleet into retreat. Kordi also managed to use the StarScavenger to gather salvage following the battle."}, {"tag": "h3", "text": "Trap on Qalydon"}, {"tag": "p", "text": "After receiving a distress transmission from \"Maynar\", Rowan and Roger traveled to Qalydon on the StarScavenger. The two discovered an Imperial facility. While Roger overpowered the stormtroopers and stayed guard, Rowan entered the facility only to encounter M-OC, who was impersonating Maynar. Rowan was subsequently captured by M-OC's rival Darth Vader, the Emperor's second in command. A damaged Roger brought the StarScavenger back to the Home One. Roger crash-landed the ship in the Home One's hangar, destroying an A-wing. However, the ship was not seriously damaged and Roger managed to warn Zander and Kordi that Rowan had been kidnapped by Lord Vader."}, {"tag": "h3", "text": "Stopping M-OC"}, {"tag": "p", "text": "Quarrie used the StarScavenger to rescue the Freemakers from M-OC, who was flying the hijacked Arrowhead, in the Coruscant system. However, M-OC managed to plant an XX-23 S-thread tracker on the StarScavenger, allowing him to track them through hyperspace into an asteroid field. The Freemakers and Quarrie then fled to Shantipole where they lured M-OC into a trap on the stormy planet."}, {"tag": "p", "text": "The StarScavenger was destroyed when Zander sent the ship on a collision course with the Arrowhead. Though both ships were destroyed, M-OC survived. After Rowan accidentally convinced him that the second Death Star had a design flaw, the hunter droid\nused the StarScavenger's main engines and other assorted parts from both ships, including the Arrowhead's proton suspension housing and kyber crystal, to build a hyperspace ring to escape Shantipole."}, {"tag": "p", "text": "However, Rowan, undeterred and remembering Jek-14's teaching about envisioning what he was building, used the remaining pieces from both ships to rebuild the StarScavenger. They first took the new ship to Sullust to rendevous with the Alliance fleet only to find they had left. The Freemakers then traveled to Mustafar when Rowan retrieved the shards of the Kyber Saber. Finally, the Freemakers traveled on the StarScavenger to Endor where they assisted rebel forces. During the Battle of Endor, the Freemakers used the StarScavenger's new embersteel blade to cut through the second Death Star's shield and board the station."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Starscavenger appears in the 2016–2017 Disney XD animated television series LEGO Star Wars: The Freemaker Adventures. LEGO also released a promotional LEGO box set of the starship to coincide with the television series. The ship was first identified as a CT-900 freighter in the Season Two episode \"Trouble on Tibalt\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}