{"url": "Star/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Articles needing additional sources", "Category:Stars"], "nodes": [{"tag": "h1", "text": "Star"}, {"tag": "p", "text": "A star was an enormous sphere of immensely hot hydrogen and helium that underwent nuclear fusion[source?] to produce heat and light (in essence, it was a giant ball of plasma). Systems of planets would usually form around stars when the gas and dust around them became stable enough. Stars could come in all sorts of sizes, colors, and temperatures. Most planets were seen orbiting medium mass orange-yellow stars, often called suns."}, {"tag": "p", "text": "Stars visibility was measured in magnitudes. An Imperial Class Star Destroyer was undetectable against the background of a first-magnitude star, even with the best instruments."}, {"tag": "p", "text": "It was estimated that there were four hundred billion stars in the galaxy. There were 7.1 billion habitable stars in the known galaxy, which made up about 3.2 billion habitable star systems. This means that many systems contained two or more stars. Red dwarfs accounted for approximately 70 percent of the galaxy's stars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The parts of a star located above its surface were collectively referred to as the atmosphere. They comprised two principal zones: the chromosphere and the corona. The chromosphere was a gaseous, relatively cool layer located immediately above the surface, and the corona was the tenuous, rarefied gaseous outermost part of the atmosphere."}, {"tag": "h2", "text": "Types of stars"}, {"tag": "p", "text": "There were seven types of main sequence stars in the galaxy:"}, {"tag": "p", "text": "With O stars being the biggest in the sequence, the size decreased gradually to the smallest M stars."}, {"tag": "p", "text": "In addition to the main sequence stars, 10 percent of all stars in the galaxy were non-main sequence, of which five hundred million were habitable.\nThe non-main sequence stars include:"}, {"tag": "p", "text": "Pre-main sequence (smaller than M stars):"}, {"tag": "p", "text": "Post main-sequence (bigger than O stars):"}, {"tag": "p", "text": "Compact stars:"}, {"tag": "p", "text": "Other exotic star types existed that did not fit precisely into this system of classification. These included the star of the Verde system, considered a blue dwarf, and Ka'Dedus, classified as an ultraviolet supergiant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The OBAFGKM sequence is the same classification system used for identifying stars from Earth. However, in terms of Earth astrophysics, certain descriptions of stars in the Galaxy Far Far Away are shaky. Scientific bloopers abound such as blue supergiants that exist for long enough for a sentient species to evolve, inexplicably large brown dwarfs or red giants that are stable enough to house a habitable planet. The existence of black dwarfs is also impossible, as the universe is only about thirteen billion years old, and those take trillions of years to form."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": "Because space travel is a central part of Star Wars, stars appear in many Star Wars works. This a list of media in which stars and suns are specifically mentioned (not including common compounds like \"star system\", \"starship\", \"starfighter\" or \"Star Destroyer\", or names like \"Death Star\" or \"Black Sun\")."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}