{"url": "StarSpeeder_1000", "categories": ["Category:Legends articles", "Category:StarSpeeder 1000s"], "nodes": [{"tag": "h1", "text": "StarSpeeder 1000"}, {"tag": "p", "text": "The StarSpeeder 1000 was a model of transport starship once operated by the interstellar spaceline Star Tours and the five other travel agencies that made up the Galactic Tourist Bureau. They could accommodate forty seated passengers and required a crew of only three to operate effectively. While all StarSpeeder 1000s bore the Star Tours logo, the color and markings of an individual craft varied according to its destination.\nThe StarSpeeder 1000s were the predecessors of the mostly identical StarSpeeder 3000 that were seen shortly after the Battle of Endor."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Sturdy and trapezoidal, the Starspeeder 1000 could accommodate up to forty passengers at a time. Both sides of the Starspeeder 1000 featured five automatic doors that provided access to the rows of seats. The cabin was also height-rated specifically for Wookiee passengers. While the Star Tours travel agency advertised its transport as \"the most sophisticated and luxurious spaceliner in its class,\" the cabin of the Starspeeder 1000 was rather spartan. It featured little more than a passenger seating area and a small piloting deck with a front transparisteel viewport—occupied by a pilot droid and a systems analyst. There was also a small monitor next to the cockpit screen. It could be used to either see what the IC-360 camera was seeing or show the astromech copiloting the ship, along with other pilots in their ships. An astromech droid was also loaded into a proper slot outside of the ship. Additionally, each StarSpeeder 1000 was equipped with its own IC-360 camera droid, which would venture out of the transport and deliver close-up images of dangerous creatures or exotic locales to passengers in the cabin. The viewport also had its own automatic cleaning system."}, {"tag": "p", "text": "However, despite its shortcomings, the transport was equipped with advanced hyperdrive and deflector shields, and all the seats had personal safety belts, called gravitic harnesses. The cabin was also equipped with ray shielding, and the front of the vehicle was furbished with two flash cannons, heavy-duty plasma cannons, and two concealed laser cannons, a defensive armament to be used in case of safety-threatening encounters; the concealed cannons were abnormally powerful for a passenger liner, as one was observed dealing heavy damage to the bridge of an Imperial-class Star Destroyer, engulfing it in flames, and could also destroy a TIE/LN starfighter in one shot. The StarSpeeder 1000 was also designed to operate in aquatic environments. Its front side was even equipped with a pair of headlamps, which allowed the shuttle to navigate in dark, murky waters such as the ones of Lake Paonga on the planet Naboo. It also possessed suborbital thrusters and multi-terrain skids, as well as shielding and protection against dark matter and temporal disturbances."}, {"tag": "p", "text": "The starspeeder also had a holographic projector placed on the roof near the cockpit window. It could be activated by an astromech droid and was used to send urgent messages to the crew of the ship."}, {"tag": "p", "text": "The most basic design model had colors of red, white and blue on the hull, with the red being most prevalent on the dorsal area, the white in the middle area, and the blue in the ventral area. However, there were five different hull designs besides the regular design, depending on the model's primary destination."}, {"tag": "h3", "text": "StarSpeeder 1000 hyperdrive"}, {"tag": "p", "text": "The StarSpeeder 1000's hyperdrive was a Nubian-compatible T-14 hyperdrive generator. It was composed of Null Quantum Field chargeplates, 14 pairs of plasma focusers, alluvial dampers of the VGL KKC type, coolant arrays, antimatter transpactors, two cabin coolant arrays, tandem control dampers magnetic stabilizers, inertial dampers, a chargeplate with overflow safeties, a tri-valent array, an induction assembly, a class 4 shielding, a fusion injector array, and a gravic recorder."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The StarSpeeder 1000s were designed by Sacul Aerospace on the Core planet of Corellia, the inhabitants of which had a long-established reputation of crafting fast star cruisers. The ship was certified by Hutt Space, its tech was wavied by Coruscant, and its security was rated by Mandalore."}, {"tag": "p", "text": "Those sturdy transports were used by Star Tours in the time span from 1 to 0 BBY. During that period, five other spacelines affiliated with Star Tours through the Galactic Tourist Bureau also made use of the StarSpeeder 1000. The Star Tours travel agency, however, advertised those ships as its trademark, stating that it enjoyed exclusive use of them."}, {"tag": "p", "text": "At some point after the rise of the Rebel Alliance and its installation on Yavin 4 in 1 BBY, the Star Tours Flight 1401 bound to Coruscant was ambushed by agents of the Galactic Empire, who had detected the presence of a Rebel spy in the craft. In an unfortunate turn of events, the StarSpeeder of the Flight 1401 was piloted by the protocol droid C-3PO, who did his best to escape the Imperials and finally deliver the spy to safety."}, {"tag": "p", "text": "In 4 ABY, shortly after the Battle of Endor, the StarSpeeder 1000 had been superseded by the largely identical StarSpeeder 3000. However, the new 3000s did not remain in service for too long, since the Star Tours company was driven out of business a few months later, after a series of accidents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The StarSpeeder 1000s first appeared in Star Tours: The Adventures Continue, a Disney simulator ride theme-park attraction located at Disneyland in California and Disney's Hollywood Studios at Walt Disney World in Florida. The Adventures Continue was a 2011 update of the Star Tours attraction, which was originally launched in 1987."}, {"tag": "p", "text": "Early teaser footage for Star Tours: The Adventures Continue revealed that part of the ride would include the StarSpeeder 1000, bursting into the Boonta Eve Classic pod race. In a high-resolution image of the scene provided to various media outlets, the 1000 designation on the speeder could be seen."}, {"tag": "p", "text": "The computer model of the StarSpeeder 1000 was later used in The Force Awakens, in the background of Niima Outpost on the planet Jakku."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}