{"url": "Star_Fortress", "categories": ["Category:Legends articles", "Category:Battlestations", "Category:Star Fortresses"], "nodes": [{"tag": "h1", "text": "Star Fortress"}, {"tag": "p", "text": "A Star Fortress was a class of battlestation created by the Eternal Empire of Zakuul after their conquest of the galaxy. Massive space stations powered by Sun Generators, Star Fortresses were placed in orbit of conquered planets to ensure that the world remained subservient. Excess plasma from the generator could be vented down onto the surface as a weapon, and each fortress contained numerous hangars, skytrooper production facilities, and Zakuulan military forces. Each Star Fortress was under the command of an Exarch, a powerful Knight of Zakuul who had been augmented with cybernetic and biological enhancements. A majority of the computerized functions required to run the station or at very least use the sun generator's plasma on a planet's surface comes from the use of an EPHEMERIS AI system, which could transfer its functions into a mobile droid form. Destruction of the EPHEMERIS datacores and the droid causes a multitude of systems to go down, rendering the station less of a threat for a time."}, {"tag": "p", "text": "Following his successful war of conquest, Arcann, the Emperor of Zakuul, deployed Star Fortresses in orbit of dozens, possibly hundreds, of worlds. The power of these battle stations, as well as the threat of destruction, essentially held the planets hostage without any need for an occupation army, and discouraged any effort to form an organized resistance to the Eternal Throne. When one such rebellion occurred, on the Bothan homeworld of Bothawui, the Star Fortress fired on the surface, nearly destroying the world."}, {"tag": "p", "text": "Despite this threat, a secret Alliance was formed in 3631 BBY on the remote planet of Odessen, led by an individual known as \"the Commander\", a known enemy of Arcann. Former Republic SIS agent Theron Shan would join this Alliance; despite the atrocity on Bothawui, Theron worked with hidden resistance forces on occupied worlds to find a way to counter, and ultimately destroy, the Star Fortresses."}, {"tag": "h2", "text": "Appearances"}]}