{"url": "Star_Herald", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Scout starships", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Star Herald"}, {"tag": "p", "text": "The Star Herald was a top-of-the-line prototype scout ship that was developed by the Galactic Empire around 18 BBY. It had a long, arrow-like hull supporting a tractor beam projector, and it housed at least one probe that could go underwater."}, {"tag": "p", "text": "The Star Herald was stolen by Visler Korda, a former Imperial officer who had been stripped of his rank and put to forced work in the spice mines of Kessel. With the help of RX-48, a manumitted pilot droid, Korda used the stolen ship to journey to the Xala system, where he intended to exact revenge on those responsible for his disgrace, Milo and Lina Graf. The Imperial High Command was most displeased with the theft of the prototype. The ship was shot down on the planet Agaris, but was repaired by the Graf family after Lina and Milo and their droid CR-8R rescued their parents, Auric and Rhyssa, from imprisonment in the Imperial compound on the planet. Wilhuff Tarkin ordered it shot down on its departure from Agaris, but it managed to get away by activating its hyperdrive and traveling to the Lothal system before it could be destroyed."}, {"tag": "p", "text": "In the hands of Milo and Lina Graf, the Star Herald saw much action in the days of the Galactic Civil War. It later went to Milo's grandson, Emil Graf, who used it to catalogue Wild Space. Emil Graf's crew included CR-8R, the BB-series astromech droid BB-00, and Kowakian Monkey-Lizard Noni."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Star Herald appears in the Star Wars: Adventures in Wild Space series."}, {"tag": "p", "text": "The crew's interactions aboard the ship serve as the framing devices for the Tales from Wild Space comics in Star Wars Adventures."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}