{"url": "Star_Map", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Wookieepedia Featured articles under probation", "Category:Articles with gameplay alternatives", "Category:Dark side artifacts", "Category:Force-sensitive objects", "Category:Holographic technology", "Category:Infinite Empire technology", "Category:Navigational technology", "Category:Rakata culture"], "nodes": [{"tag": "h1", "text": "Star Map"}, {"tag": "p", "text": "Star Maps were artifacts left behind by the ancient Rakatan Infinite Empire. Constructed of a self-sustaining technology that was imbued with and drew upon the dark side of the Force, these Star Maps were fabricated to be monuments to the glory of the Rakatan Empire. Originally, each Map indicated the precise location of the Infinite Empire's greatest achievement: the Star Forge, a factory of immense proportions. Through intentional sabotage from the retreating Rakata as their empire fell, much of the information contained within the Star Maps was lost. Over time, however, the Maps repaired themselves as designed, allowing those who sought the information contained within to piece together their full contents from multiple Maps. The most complete known example, as of the Mandalorian Wars, was located on Dantooine. This Map was housed in an ancient temple built by Rakatan slaves and protected by a set of droids, including one designed for informational purposes."}, {"tag": "p", "text": "During the close of the Mandalorian Wars, the fallen Jedi Revan sought out the Maps, traveling to at least five planets in order to fully uncover their secrets. After piecing together all the information, Revan and his apprentice Malak found and took control of the Star Forge. With the massive space station and factory under their command, the newly proclaimed Sith Lords created an immense fleet with which to conquer a Galactic Republic that was still recovering from the Mandalorian onslaught. During the Jedi Civil War, Revan was captured and nearly killed. After being retrained at the Jedi Enclave on Dantooine, the mindwiped Revan was charged with once again completing the quest of accessing each Star Map to combat the continued expansion of the Sith Empire. After piecing together the fragmented information, he and his companions set out for the Lehon system to finally destroy the Star Forge."}, {"tag": "h2", "text": "Function"}, {"tag": "p", "text": "The Star Maps were constructed as monuments dedicated to honoring the expanse and might of the Rakatan Infinite Empire. As a result, the Maps contained information regarding planets and other key locations under the control of the Empire. Most notably, the Maps pointed to the location of the Star Forge, a titanic space station that also served as a high-capacity manufacturing facility capable of turning out war matériel at an astonishing rate. The Maps were also equipped with technology that allowed them to repair themselves if damaged. Even though the ancient Rakata attempted to destroy the information stored in the Maps, in order to prevent their former slaves from finding their homeworld and exacting revenge, these built-in repair mechanisms eventually repaired the structures and restored the data they held."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Star Map was a type of holographic image-based database that was stored inside a free-standing structure supported by three legs. Even though the Map itself was free-standing, it could be connected to another device, such as a computer terminal. Extending from the base were three \"arms\" engraved with runes; when the Map was activated, these armatures unfolded. As the arms locked into place, the base of the structure opened, allowing a projector orb to be released; the orb would then ascend from inside the base and project a holographic image of the galaxy. This image marked important locations within the Infinite Empire, highlighted to show the true extent of Rakatan influence and dominance."}, {"tag": "p", "text": "As with other Rakatan technology, the Star Maps were imbued with the power of the dark side of the Force. Each Map had different means of activation, though all of them were only able to be activated by those who were strong in the Force. Even those so empowered were forced to overcome the protective measures assigned to some of the Maps. For example, the Maps on Dantooine and Kashyyyk were protected by defense droids and computer systems, which mentally and physically tested those who sought their secrets. Those who were deemed unworthy would be purged as \"false,\" and overpowered by these defense systems, with the end result often being death."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Infinite Empire"}, {"tag": "p", "text": "As the Infinite Empire expanded and conquered other worlds, the demand increased for more military supplies. Ships and weapons were needed to supply soldiers for battle and to lord over the captured slaves. In response to this need, the Rakata built the Star Forge. The vast space station and production facility was considered the greatest achievement of the Rakata, but its use came at a great price, as it corrupted those who used it. The Star Forge was fueled by the primary star in the Lehon system, but because it was used as a tool of conquest and subjugation, it became steeped in the dark side of the Force."}, {"tag": "p", "text": "As the Infinite Empire conquered more worlds, Star Maps were developed as tribute to the Star Forge. Star Maps were placed on at least five planets, though it is possible that more may have existed. The Star Maps illustrated the extent of the Infinite Empire and offered the location of its greatest achievement. Some of the Maps, such as the one on Dantooine, were placed inside temples dedicated to the Star Forge. Others, such as the Map on Kashyyyk, were attached to computer systems, but not placed inside a temple or monument."}, {"tag": "p", "text": "The Infinite Empire, however, eventually began to fall, and gradually more and more worlds began to revolt. To protect and keep secret their achievement, the retreating Rakata sabotaged the Star Maps and accompanying information droids, attempting to remove all vital information. The Star Maps were temporarily rendered obsolete, and the location of both the Star Forge and the Lehon system were hidden. The technology, however, began to self-repair, causing some of the deleted information to be restored over time. Other information, such as data concerning the Rakata, was still corrupted and inaccessible upon the rediscovery of the Maps."}, {"tag": "p", "text": "By around 4000 BBY, the Rakata and their Empire had been forgotten by citizens of the Galactic Republic. Some planets, such as the Rakatan homeworld of Lehon, had faded from the memory of the galactic community by that time. The ruins of various monuments and temples dotted the galaxy as the only surviving legacy of the Infinite Empire."}, {"tag": "h3", "text": "Mandalorian Wars"}, {"tag": "p", "text": "Sometime toward the close of the Mandalorian Wars, two Jedi Knights, Revan and Malak, discovered evidence about the existence of the Star Maps and the Star Forge. As Revan and Malak fell to the dark side, they continued to lead the Republic fleet against the Mandalorian Neo-Crusaders. During the preparations for a battle near Malachor V, it was believed that Revan visited the Trayus Academy and learned of the Maps. Following the Battle of Malachor V, Revan took his fleet and disappeared into the Unknown Regions under the guise of eliminating the remaining Mandalorians. During this time, however, Revan and Malak encountered the reborn Sith Empire on Dromund Kaas. Championing their cause to retake Republic space, the Sith Lords amassed resources and sought out the Star Maps in order to find the Star Forge."}, {"tag": "p", "text": "Even though the Star Maps were sabotaged by the Rakata during the decline of their Empire, the Maps had begun to restore themselves due to the technology with which they were constructed. The data which had been restored consisted of only a limited amount of accessible information. As a result, Darth Revan had to travel to multiple systems, visiting the Star Maps on Dantooine, Kashyyyk, Korriban on at least two occasions, Manaan and Tatooine. At the time of their rediscovery, enough data could be compiled that, when combined, the Star Forge's coordinates were revealed."}, {"tag": "p", "text": "Upon their visit to each planet, Revan and Malak had to face different challenges to acquire the Map information. On some planets, computers or droids fought their efforts. On others, such as Korriban, the Map was found in the Tomb of Naga Sadow and protected by the tomb's ancient defenses. The pair, nevertheless, were successful in gathering enough information to trace the Star Forge to the Lehon system. After gaining favor with the Rakatan Elders, Revan and Malak were given access to the Temple of the Ancients and the Star Forge. With the Star Forge under their command, the Sith Empire, founded by Revan and Malak, was able to amass large quantities of starships, battle cruisers, battle droids and other weapons in order to conquer the weakened Republic."}, {"tag": "p", "text": "At this time, however, the Maps would remain relatively unknown to the broader galaxy. The ruins on Dantooine were investigated by the Jedi Nemo in 3956 BBY. Nemo was killed, however, by the ancient security measures before he was able to access the room which housed the Map. The Map on the planet Manaan was discovered by kolto harvesters, but it too remained unopened. Similarly, the Star Map on Kashyyyk had not been accessed, though it had been discovered by the exiled Jedi Jolee Bindo and other explorers in the Shadowlands who were either hunters or employees of the Czerka Corporation."}, {"tag": "h3", "text": "Jedi Civil War"}, {"tag": "p", "text": "The new might created by the Star Forge was coupled with Jedi who had fallen due to the Battle of Malachor V, and soldiers and officers of the Republic fleet who defected to serve under Revan. In 3959 BBY, the first major victory for the Sith Empire was the surprise attack on the drydocks and shipyards of Foerost, dealing a substantial blow to the remaining Republic Navy. Initially, the Republic, which had been weakened by the Mandalorian Wars, was overwhelmed by the advancing Sith Empire. Under the command of Darth Revan, the advancing fleet quickly swept through the galaxy unchecked."}, {"tag": "p", "text": "About two years after the devastation of Telos IV, the Republic assigned a small team of Jedi to board Darth Revan's command ship and capture the Dark Lord. During the battle aboard the ship, Darth Malak saw the opportunity to usurp the mantle of Sith Master. He ordered his vessel to fire upon Revan's ship, leaving him unconscious and on the brink of death. One of the Jedi, Bastila Shan, used the Force to keep Revan from dying and brought him before the Jedi Council."}, {"tag": "p", "text": "Eventually, the amnesiac Revan, whose mind had been reprogrammed by the Council began to be trained once again as a Jedi. Not remembering the secrets of how the Sith Empire had amassed such power, Revan was asked to investigate the ancient ruins near the Jedi Enclave. In 3956 BBY, Revan scouted the ruins, finding the Star Map as he had years earlier. Armed with this new information, and at the edict of the Council on Dantooine, the redeemed Revan once again set out in the quest for the Star Maps. Being joined by Bastila Shan and Carth Onasi, among others, Revan sought to retrace his earlier steps. Finally, after visiting Kashyyyk, Korriban, Manaan, and Tatooine, Revan was able to trace the Star Forge to the Lehon system and set out to destroy it."}, {"tag": "h2", "text": "Known Map locations"}, {"tag": "h3", "text": "Dantooine"}, {"tag": "p", "text": "One of the first Star Maps to be discovered by Darth Revan and his apprentice, Darth Malak, was found on Dantooine in the ancient ruins located not far from the Jedi Enclave. Following the Mandalorian Wars, the duo visited these ruins to track down the Star Map. Before their initial entry into the depths of the ruins, Malak questioned whether Revan was certain this was the path they should follow. After a moment of deliberation, Revan unsealed the doors. At the time of Revan's arrival during the Mandalorian Wars, this Map was the most complete in terms of the data it contained."}, {"tag": "p", "text": "Several years later, when the amnesiac Revan, along with Bastila, re-entered the ruins, an information droid stationed in the main room instructed them on how to reach the Star Map. Access to the main chamber, which lay straight ahead, was only granted by completing the puzzles found in the two rooms situated to the right and left. In these two rooms were ancient computer terminals that were protected by security droids; the ancient droids immediately attacked the party, but they were able to complete the puzzles in these rooms and enter the main chamber that housed the Star Map."}, {"tag": "h3", "text": "Kashyyyk"}, {"tag": "p", "text": "Attached to an ancient computer terminal, this Star Map was located on the surface of Kashyyyk. Due to a malfunction in the computer system in the preceding years, the native wroshyr trees grew to an immense size, causing the surface of the planet to become a wilderness of wild beasts and other creatures known as the Shadowlands. During his exile in the Shadowlands, Jedi Knight Jolee Bindo encountered the Star Map, but was unable to access it despite his numerous attempts. Wookiee Chieftain Freyyr was also unable to access the device. After traveling deep into the Shadowlands on a mission for Chuundar, the amnesiac Revan encountered knowledge of the device's existence. Revan, who had accessed the device years earlier in his search with Darth Malak, was able to access the device in 3956 BBY. During the encounter with the computer terminal, Jolee Bindo replied with great surprise that the computer recognized Revan and that he was able to access the attached Map."}, {"tag": "h3", "text": "Korriban"}, {"tag": "p", "text": "Located in the Valley of the Dark Lords on Korriban, this Star Map was located within the unused tomb constructed for the ancient Dark Lord of the Sith Naga Sadow. Even though Sadow lived millennia after the fall of the Infinite Empire, the Map was located in a room of the burial construct whose access was obstructed by a pool of acid. While it was said that Revan and Malak visited Korriban twice, it was unknown if the Map had been accessed both times. Nevertheless, once the Star Forge was under their command, reaching the Star Map—along with withstanding the other challenges of the tomb—became part of an important initiation rite for the promising students of the Sith Academy on Korriban."}, {"tag": "p", "text": "To access the Map again, Revan, having been redeemed, had to temporarily join the Academy and perform various tasks to receive prestige with Sith Master Uthar Wynn. After completing these tasks, Wynn believed Revan to be quite the promising pupil and a potential candidate for further Dark Jedi training. Once he was given access to the tomb, Revan had to overcome the obstacles of the tomb's defenses as well as fauna that had taken the lair. Among the creatures in the tomb were two terentateks. After using special grenades to negate the effects of the acid pool, Revan crossed and accessed the Map."}, {"tag": "h3", "text": "Manaan"}, {"tag": "p", "text": "The Star Map on Manaan, a water world, was located beneath the watery surface along the Hrakert Rift. It is unknown how Revan and Malak discovered or reached the ancient artifact initially, but it was rediscovered by kolto harvesters working for the Republic during the Jedi Civil War. After the harvesters hit the \"obstruction\" in their efforts to tap into the kolto, the redeemed Revan arrived on Manaan with the crew of the Ebon Hawk. After performing some tasks for Roland Wann, head diplomat of the Republic Embassy, he was allowed access to the harvesting station via submersible. Blocking the route to the Map, however, was the Progenitor, a giant firaxan shark responsible for a recent insurrection by the Selkath at the harvesting station. In order to appease the beast, the portion of the harvesting station that reached into the rift had to be destroyed. With the station no longer interfering with the natural cycle of the kolto, the Progenitor permitted Revan to cross the rift and access the Map. At this point in time, however, the Map was not protected by ancient droids or visibly near an ancient building."}, {"tag": "h3", "text": "Tatooine"}, {"tag": "p", "text": "On Tatooine, the Star Map was placed inside an ancient Rakatan temple that had been reduced to ruins by the time of Revan and Malak. The ruins were located in the Eastern Dune Sea, a great open expanse of hostile desert. By the time the redeemed Revan visited the ruins in 3956 BBY, a krayt dragon had made its lair there, making access to the Star Map difficult. The krayt dragon may have been attracted by the dark side energies from the Map. The dragon was eventually killed by Revan, with the assistance of Komad Fortuna, allowing the Map to be accessed. The Map was not attached to any computer systems or security droids at the time of this visit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first appearance of the Star Maps is in the game Star Wars: Knights of the Old Republic. They serve as a plot device; the player must acquire the coordinates contained in the Maps to reach the Lehon system and find the Star Forge."}, {"tag": "p", "text": "In the gameplay of Star Wars: Knights of the Old Republic, the Star Maps—other than the Map on Dantooine—can be acquired in any order. The order of Maps listed in this article is alphabetical and does not imply the canon order the Maps were acquired."}, {"tag": "p", "text": "The player has the option of turning to the dark side during the course of the game. In doing so, the player uses the Star Maps to reacquire and retake the Star Forge from Darth Malak. As a result, Revan is crowned the true Dark Lord of the Sith during a ceremony at the Temple of the Ancients. Following the dark-side path throughout the game has no effect on the ability to access the Maps other than player interaction with the computer terminal on Kashyyyk, because correctly answering the questions posed by the AI guarding the Star Map will merit Dark Side points."}, {"tag": "p", "text": "When the player finds the fifth and final Star Map, its animation will be different. The map will at first open normally, but then the outlines and most of the schematics disappear and six hovering points with various pre-Aurebesh letters flickering above them stay. Red triangles flicker between these points until two triangles on opposite ends of the Map turn green. and a blue line consisting of small separated rectangles connects the two green triangles. These triangles, points and the line disappear after a couple seconds, then a large star appears in the center. It is surrounded by a transparent sphere divided into grids, which is surrounded by four dotted lines forming circles arranged to look like a solar system. Another large blue line of divided rectangles starts at the edge of the hologram and works its way around the star and ending at a small object in the line closest to the star, which is shaped like a steep upside-down pyramid pointing down at the star it orbits and has more small dotted lines forming circles around it. This is probably a map of the Lehon system, with the star representing the system's sun, Abo, and the outer three rings representing the orbits of the 3 closest planets from the sun (Iwar, Meldina, and Taxiode, in order from first to third from the sun). The closest ring around the star contains the pyramid-shaped object, which probably represents the Star Forge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}