{"url": "Star_Saber_XC-01_starfighter", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Galactic Republic starfighter classes", "Category:Republic Fleet Systems products"], "nodes": [{"tag": "h1", "text": "Star Saber XC-01 starfighter"}, {"tag": "p", "text": "The Star Saber XC-01 starfighter was an experimental fighter produced by Republic Fleet Systems, and tested by Jedi pilots during the Great Sith War. Long, sleek craft, the single-seat starfighters nonetheless were equipped with hyperdrives. Although the ships were capable of swift acceleration, their low maneuverability-to-speed ratio and slow control stick reaction gained them a reputation as dangerous and unwieldy craft. Heavy blaster cannons and deflector shields gave the Star Saber more offensive and defensive capabilities than contemporary fighters, however, and the Galactic Republic pressed the craft into service despite their design flaws. From their initial combat mission against the Krath stronghold of Cinnagar until the retirement of their line with the advent of the Aurek-class tactical strikefighter, the Star Saber was largely flown by Jedi, who could compensate by using the Force for the fighter's design flaws, which were never corrected."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "At 13 meters in length, the Republic Fleet Systems Star Saber XC-01 starfighter was long, low, and sleek. Protruding from the narrow hull were two wings fitted with weapons outriggers; two fins emerged from the tail of the craft, above the two engines. A military snubfighter available to civilians only through regulated sales, the Star Saber was equipped with deflector shields and two heavy blaster cannons—weapons that were significant improvements over those of the fighter's contemporaries. A single-seat craft, with 45 kilograms of cargo capacity, the fighter nonetheless was equipped with a Class 2.0 hyperdrive and a week's worth of consumables. While the Star Saber was quite fast at sublight speeds, capable of attaining 1,100 kilometers per hour in atmosphere, and accelerating to such speeds in only seconds, the craft was ungainly and not nearly as maneuverable as other fighters of its period—Krath CX-133 Chaos fighters could outmaneuver them with ease. However, due to the needs of the time, the Galactic Republic pressed the fighters into service, despite knowing their flaws."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Star Saber XC-01, from its development during the Krath Holy Crusade, was considered an inefficient but necessary tool to combat the threat posed by the Sith. Considered an experimental vessel during its testing phase on Ossus in 3997 BBY, the Star Saber was nonetheless pressed into service against Krath forces, which it was designed to combat. In an assault on the Krath throneworld of Empress Teta, Jedi Knight Dace Diath used the Star Saber in both aerial dogfighting and surface assaults. Although the production of the fighters was almost halted after initial test runs, and the design of the fighter was never perfected due to its inefficiency against Chaos fighters, the Star Saber was nevertheless brought into full-scale production and authorized for limited sale to civilians in order to recoup losses associated with its design. Pilots willing to utilize the Star Saber during its two-decade production run included Jedi, who were capable of compensating for the craft's shortcomings by using their abilities with the Force. However, once Republic Fleet Systems developed the Aurek-class tactical strikefighter shortly before 3976 BBY, the Star Saber design was abandoned."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3997 BBY, the Republic faced a crisis in the form of the Krath, a Sith cult from the Empress Teta system. After taking control of the system by means of a coup, the Krath turned their attention on the larger galaxy. During their attacks on Republic capital ships, swarms of Krath Chaos fighters were willing to sacrifice themselves by crashing into enemy vessels. The Star Saber XC-01 was developed by Republic Fleet Systems to answer the threat posed by such attacks, creating a craft capable of attaining high velocity in seconds, with more advanced weaponry than its contemporaries."}, {"tag": "p", "text": "In their experimental phase, Star Sabers were tested on the Jedi library world of Ossus, by Jedi pilots such as Dace Diath and Cay Qel-Droma. Both Jedi pursued Robotic drones created to simulate the flight of the highly evasive dragon-birds of Onderon during the tests, with each pilot attempting to destroy the targets at high atmospheric speeds. It was in these tests that the Jedi pilots discovered a major design flaw: the Star Sabers were not nearly as maneuverable as other fighters of the time, and had slow reaction to control stick manipulation. Although he managed to score at least one kill against the drones in his fighter, Diath crashed into a mountainside, discovering that the Star Saber was not proportionately maneuverable for its speed. Although Diath survived the crash through his skill with the Force, the flaw was exposed to all potential pilots of the new craft."}, {"tag": "p", "text": "Nevertheless, for lack of other available craft on Ossus for an upcoming Jedi mission to extract the undercover Jedi Knight Ulic Qel-Droma from the Krath throneworld, the Star Saber XC-01 was pressed into immediate service. Diath himself volunteered to fly the vessel, reassuring his companions that with some adjustment and the guidance of the Force, he'd be able to handle the craft. Diath traveled to Empress Teta in his Star Saber, along with Jedi pilots Oss Wilum, Tott Doneeta, and Shoaneb Culu in other fighters. The entire group escorted an Onderonian transport containing the assault force of Jedi and Beast Riders from Onderon on their drexl war mounts. As the raid on the Krath citadel took place, Diath and the others flew cover for the strike team. Although the mission was an overall failure, with Qel-Droma choosing to join the Krath and become Dark Lord of the Sith, Diath managed to take out a Krath anti-air emplacement in his Star Saber."}, {"tag": "p", "text": "Despite its obvious design flaw, the Star Saber XC-01 was nonetheless mass-produced by Republic Fleet Systems and saw common usage during the Great Sith War that ultimately encompassed the Krath Holy Crusade and saw the Republic at war with the forces of the Sith under the command of Ulic Qel-Droma and another Jedi-turned-Sith, Exar Kun. Although the Chaos fighters used by the Krath were capable of flying circles around Star Sabers, the Star Sabers' flaws were never corrected. The need for more firepower simply outweighed the desire to work out the kinks in the ships' design. In the war and the era that followed, the pilots who chose to fly the fighters included Jedi who could compensate for their shortcomings with the Force. The Galactic Republic eventually made the Star Saber available for civilian purchase in order to recoup losses associated with their development, and the craft continued to be manufactured until the release of the Aurek tactical strikefighter much later."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Star Saber XC-01 first appeared in the issue Tales of the Jedi – Dark Lords of the Sith 6, part of the Dark Lords of the Sith story arc of the Tales of the Jedi comics. The comic depicts the Star Saber as an experimental starfighter undergoing testing by the Jedi, who find it lacking, only to use it in later battles out of necessity. Tales of the Jedi penciller Art Wetherell originally drew the craft in the issue. The Star Saber XC-01 is also featured in the Dark Lords of the Sith audio drama, where it is flown by Jedi Tott Doneeta instead of Dace Diath."}, {"tag": "p", "text": "The Star Saber received more history and statistics from Wizards of the Coast's Star Wars Roleplaying Game in their 2002 supplement Power of the Jedi Sourcebook and 2008 Knights of the Old Republic Campaign Guide, the latter of which included an updated image of the craft."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "A number of statistical discrepancies exist between the Star Saber's depictions in Power of the Jedi Sourcebook and Knights of the Old Republic Campaign Guide. While Power of the Jedi describes the fighter as being 6.75 meters in length, with 25 kilograms of cargo space, the newer KotOR CG provides figures of 13 meters and 45 kilograms. The latter statistics more accurately reflect the Star Saber as depicted in Tales of the Jedi, and are used in this article for that purpose. Furthermore, Power of the Jedi gives the craft as having a Class 1.5 hyperdrive, while KotOR CG denotes Class 2. As well, KotOR CG gives the Star Saber a faster atmospheric speed of 1,280 kilometers per hour than Power of the Jedi's 1,100 km/h. For consistency, the updated statistics from the KotOR CG are provided."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}