{"url": "Bartender", "categories": ["Category:Canon articles", "Category:Stub", "Category:Bartenders", "Category:Hospitality occupations"], "nodes": [{"tag": "h1", "text": "Bartender"}, {"tag": "p", "text": "A bartender, also known as a tavern-keeper or barman, was an individual who ran or owned a cantina or a bar in some other kind of establishment."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Imperial Era on Lothal, the Ithorian Jho ran Old Jho's Pit Stop, a cantina and repair shop. Jho worked the bar, and some of his frequent guests were the Spectres, a rebel cell made up of Kanan Jarrus, Hera Syndulla, Garazeb Orrelios, Sabine Wren, Ezra Bridger, and the droid C1-10P. Jho ran the bar until his execution, upon which it was given to Valen Rudor. While under Rudor's management, the bar was popular among Imperials."}, {"tag": "p", "text": "Also during the Imperial Era, the Wookiee Chalmun owned a cantina in the Tatooine spaceport Mos Eisley named Chalmun's Spaceport Cantina. He employed three bartenders, Wuher, Ackmena, and Husklf. The human male Wuher, who ran the bar during the day, had a gruff personality and a strong dislike for droids. The night-shift bartender was the human female Ackmena, whose friendly manner made her more popular than Wuher with the patrons. Husklf was a Nimbanel, and unlike Wuher and Ackmena, who worked the public bar, Husklf was staffed in Chalmun's private bar."}, {"tag": "p", "text": "Around the time of the Cold War between the Resistance and the First Order, the female Blutopian Oga Garra owned and operated Oga's Cantina in Black Spire Outpost on Batuu. Oga's Cantina sold a wide array of alcoholic and non-alcoholic drinks."}, {"tag": "p", "text": "Z'Vk'Thkrkza, also known as Aunt Z, was a female Gilliand who lived on the refueling platform Colossus on the planet Castilon. She owned a tavern called Aunt Z's on the Colossus during the time of the Cold War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}