{"url": "Star_Wars:_Assault_Team", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Legends mobile games"], "nodes": [{"tag": "h1", "text": "Star Wars: Assault Team"}, {"tag": "p", "text": "Star Wars: Assault Team is a mobile game developed by Disney Mobile in collaboration with LucasArts. It was first announced on January 28, 2014 through the official Star Wars twitter account, with one screenshot attached. It is a turn-based combat game with strategy and card-battle elements. The mobile game was released on March 26, 2014. The game features characters from the classic films such as Luke Skywalker, and Princess Leia."}, {"tag": "p", "text": "In October 2014, less than a year after its launch, the game was removed from the Apple and Google stores by Disney \"to focus on priority titles like Star Wars: Commander\"."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Collect classic characters from the Rebel Alliance and more to defeat enemies and players across the galaxy. Strategically deploy the team's special tactics to battle through new graphically enhanced missions set throughout Star Wars™ planets and locations from the original trilogy."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The game features a storyline which takes place between the Star Wars episodes A New Hope and The Empire Strikes Back."}, {"tag": "h3", "text": "Escape The Devastator (training)"}, {"tag": "p", "text": "Han Solo and members of Renegade Squadron are captured by the Devastator and risk becoming test subjects. They escape their cells, and steal plans before leaving the ship."}, {"tag": "h3", "text": "Kashyyyk"}, {"tag": "h3", "text": "Ord Mantell"}, {"tag": "h3", "text": "Tatooine"}, {"tag": "h3", "text": "Coruscant"}, {"tag": "h3", "text": "Death Squadron"}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "Star Wars: Assault Team is a turn-based combat game involving card-battling elements, and takes players to locations from the Star Wars Trilogy. Players must build a team of four individual \"heroes\" using cards they acquire. The team follows a preset path and encounter enemy forces which they must defeat. Each card has a passive ability (usually an attack or defense bonus) while some have a \"charged over time\" Special Ability. The game features a Tiered ranking system, and the attributes may be improved though Training Cards that are acquired while playing missions. Players must strategically assemble a four-man team for the missions, and use cunning strategy in combat to defeat their enemies."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Star Wars: Assault Team was announced on January 28, 2014. It is offered as limited early access in selected markets, Australia, with a complete release in spring 2014. It is available for mobile devices and was released on March 26, 2014."}, {"tag": "p", "text": "On September 29, 2014 a message appeared during game startup announcing that the game would be no longer available for download, and would playable until October 29th, 2014.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}