{"url": "Star_Wars:_Absolutely_Everything_You_Need_to_Know", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Absolutely Everything You Need to Know"], "nodes": [{"tag": "h1", "text": "Star Wars: Absolutely Everything You Need to Know"}, {"tag": "p", "text": "Star Wars: Absolutely Everything You Need to Know is a Dorling Kindersley reference title and part of the Journey to Star Wars: The Force Awakens initiative. The 200-page title was published on September 4, 2015 and provides facts about the Star Wars universe such as the oldest Jedi and a list of all owners of the Millennium Falcon."}, {"tag": "p", "text": "While the title was written in part by one of the same writers as Ultimate Star Wars, Adam Bray, the two projects are described as being \"very different.\" Readers will find \"very little common information between the two\" as \"Absolutely Everything highlights anecdotal, quirky and obscure facts.\" On October 3, 2017, the title was followed by Star Wars: Absolutely Everything You Need to Know, Updated and Expanded."}, {"tag": "h2", "text": "Publisher summary"}, {"tag": "p", "text": "Star Wars®: Absolutely Everything You Need to Know explores the world of Star Wars through lively lists, interesting facts, and questions and answers via a highly engaging infographic design. Whether it's a chart of who is the oldest Jedi, a list of all the owners of the Millennium Falcon, or a diagram showing all the Jedi Yoda has trained, this guide will excite readers of all ages and provide facts they never knew about the Star Wars Galaxy."}, {"tag": "h2", "text": "Canonicity"}, {"tag": "p", "text": "While information from this reference is treated as canon for Holocron purposes, the book also contains the following disclaimer in the back:"}, {"tag": "p", "text": "For example, page 186 refers to Palpatine's execution and cloning of Bevel Lemelisk, confirmed to be non-canon by Pablo Hidalgo of the Lucasfilm Story Group."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}