{"url": "Star_Wars:_ABC-3PO", "categories": ["Category:Real-world articles", "Category:Galactic Basic Edition storybooks"], "nodes": [{"tag": "h1", "text": "Star Wars: ABC-3PO"}, {"tag": "p", "text": "Star Wars: ABC-3PO is a Star Wars young readers book. It was released by Disney–Lucasfilm Press on June 14, 2016 and is written by Calliope Glass and Caitlin Kennedy with art by Katie Cook. The cover art is a shimmery foil, and it bills the book as the \"Galactic Basic Standard Edition.\" The subject names at the tops of the pages are presented in both High Galactic and Aurebesh."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Experience the ABC's like never before\nWith galactic friends who are hardly a bore.\nFrom Akbar [sic] to Zeb, this nice little primer\nWill teach you and make you an excellent rhymer.\nSo, Padawans, prepare, get ready, get set\nTo learn the ways of the Force--and the alphabet!"}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "The ABCs of Star Wars canon are presented in humorous rhyming verse, with two-page or occasionally single-page spreads for every letter of the alphabet. Each letter focuses on a single subject, such as \"E\" for \"Ewoks\" or \"K\" for \"Kylo Ren.\" While each letter only focuses on a single specific subject, with the lone exception of \"L\" for \"Luke and Leia,\" sometimes these can encompass more than one item; for example, Rey's spread also features BB-8, and R2-D2 is seen in the spreads for both C-3PO and droids. The pages for \"G\" (Greedo) and \"H\" (Han Solo) depict the two facing off from their respective pages."}, {"tag": "p", "text": "While most material is from the films, Chopper, Ezra Bridger and Zeb of Star Wars Rebels all make appearances. The illustration style ranges from a look similar to that of the films or television series to a more cartoonish look for characters such as the Ewoks."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The spread for \"Luke & Leia\" depicts Leia Organa standing on a balcony on what appears to be the palace on Alderaan under a crescent moon. However, A New Hope: The Princess, the Scoundrel, and the Farm Boy establishes that Alderaan had no moons."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}