{"url": "Star_Wars:_Andor", "categories": ["Category:Real-world articles", "Category:Future television episodes", "Category:Canon live-action television series"], "nodes": [{"tag": "h1", "text": "Star Wars: Andor"}, {"tag": "p", "text": "Star Wars: Andor is an upcoming television series currently being developed by Lucasfilm. It is set to air on Disney's online streaming service, Disney+. The series is a spy thriller starring Diego Luna, reprising his role as Cassian Andor from the film Rogue One: A Star Wars Story."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Talks for a television series focused on Cassian Jeron Andor, Diego Luna's character from the 2016 Star Wars Anthology film Rogue One: A Star Wars Story, began before the Anthology film was released, though Luna had doubts that it would happen. In February 2018, Disney CEO Bob Iger revealed that \"a few\" Star Wars live-action series were in development for Disney's streaming service. The series was officially announced by Iger during a Disney quarterly earnings call on November 8, 2018."}, {"tag": "p", "text": "On November 30, it was reported that The Americans executive producer Stephen Schiff was tapped to serve as showrunner while Moana writer Jared Bush was revealed to have originated the project by writing a pilot script and a series bible. According to Production Weekly, the series was scheduled to begin production in October 2019. On July 11, 2019, Rick Famuyiwa was reported to be in talks to direct an undisclosed amount of episodes for the series, with filming scheduled to begin on October 7. On October 15, 2019, Variety reported that Rogue One co-writer Tony Gilroy would be writing the pilot for the series in addition to directing multiple episodes."}, {"tag": "p", "text": "On December 3, 2020, Diego Luna confirmed that the series had started filming in London. The title of Andor, as well as behind the scenes footage of the filming of the series, were unveiled on December 10, 2020 at a Disney investors meeting. Filming began in late November of 2020. Although Alan Tudyk was initially announced to play K-2SO in the series, he later clarified in January of 2021 that while production was underway, he was not going to appear in the first season. He did, however, expect to be brought into the fold in later seasons."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}