{"url": "Star_Wars:_Blood_Ties:_Boba_Fett_is_Dead", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Star Wars: Blood Ties", "Category:Story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Blood Ties: Boba Fett is Dead"}, {"tag": "p", "text": "Star Wars: Blood Ties: Boba Fett is Dead is the second story arc of the Star Wars: Blood Ties series of comics."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "A hit squad of mercenaries and stormtroopers was assembled to hunt down and kill notorious bounty hunter Boba Fett. When surrounded, he was in a burrow after chasing down Bendak, who he killed and switched clothes with, activating the jetpack so the corpse was shot multiple times, faking his death."}, {"tag": "p", "text": "Fett tracked Sibar, one of his \"killers\", to Iridonia, who told him all he knew - that he was brought into the hit squad by a stormtrooper commander on Sathiemon. Fett then killed Sibar after he was of no more use. Fett then went to Sathiemon, using the stolen identi-tabs of Connor Freeman to get around. He extracted the name Mac Ewevs from the stormtrooper commander, who he also killed, then took his armor."}, {"tag": "p", "text": "Wearing the armor of a Stormtrooper commander he'd hunted down, Fett then went to Freeman's cantina in Atzerri and dragged Freeman out, knowing people would be after Freeman now. The cantina was blown up by a low-orbit warship, but the pair, along with Quinny, who followed them and was saved by Fett after the explosion."}, {"tag": "p", "text": "Freeman was sedated and placed in a bacta tank, where Cornelius Evazan was paid to operate on him by giving him a cybernetic arm. Fett then explained the situation and sent Freeman to Concord Dawn, to protect Sintas and Ailyn, Fett's family."}, {"tag": "p", "text": "Fett then staged a crash landing at Blackfel, impersonating a stormtrooper commando and destroying the control tower so he needed no clearance to leave, bailing out before the explosion. He then came across Darth Vader, who was fooled by his disguise, and he managed to escape the crash site quickly. He then found Captain Mac Ewevs, who saw through his disguise. They were in a training room at the time, so when the stormtroopers took formation ready to fire, they were unwittingly in front of a weapons rack containing many grenades. Fett shot one of the grenades, causing an explosion that set off alarms and killed/knocked unconscious the squad."}, {"tag": "p", "text": "The medical response team was then neutralised by Fett, and he used their stretcher to pull Ewevs away. When the base went into lockdown, he abandoned all stealthiness and used his jetpack to quickly get to a shuttle, escaping with Ewevs."}, {"tag": "p", "text": "Freeman met an initially suspicious Sintas and Ailyn at their homestead, but they soon grew close after fighting off a group of attacking bounty hunters, and Sintas kissed Freeman after noticing his resemblance to Fett. Freeman soon after found a hologram of Sintas and Fett, and realized his mistake, while Fett returned to Concord Dawn, having found out that the man trying to have him killed was actually Purton, whose son he'd killed in cold blood after his rape of Sintas."}, {"tag": "p", "text": "Sintas explained the situation to Freeman, and soon after Purton launched an all out attack on Sintas' homestead. In the following firefight, all of Purton's men were killed, aside from Teychenne, who Fett made his own and charged with the responsibility of keeping his family a secret, and Purton was captured by Sintas and Freeman in full mandalorian armor. After Purton spoke of how he sought revenge for his son's death, Sintas told him how his son raped her, and in disbelief in anger, Purton began strangling her, but Freeman shot him, saving Sintas."}, {"tag": "p", "text": "After a goodbye kiss from Sintas, Freeman left the building with one of Purton's teeth, which he gave to Boba, a call back to Boba collecting the \"teeth of monsters\" to make a dead Jango proud. The pair then discussed Fett's family, leaving the corpse-ridden street."}, {"tag": "h2", "text": "Continuity issues"}, {"tag": "p", "text": "Blood Ties: Boba Fett is Dead 2 incorrectly places Concord Dawn in the Mid Rim. Also, the first issue places the story arc in 10 BBY however later issues placed it in 1 BBY. This has introduced a continuity error regarding Ailyn Vel's age. Her appearance and personality does not match that of a supposed 14-year-old leading to the assumption that this tale was indeed initially intended to take place in 10 BBY not 1 BBY."}, {"tag": "h2", "text": "Issues"}]}