{"url": "Star_Wars:_Battlefront_II", "categories": ["Category:Real-world articles", "Category:Semi-protected articles", "Category:Cleanup", "Category:Incomplete lists", "Category:2005 computer and video games", "Category:Battlefront series", "Category:First-person shooters", "Category:Legends computer games", "Category:Legends console video games", "Category:LucasArts games"], "nodes": [{"tag": "h1", "text": "Star Wars: Battlefront II"}, {"tag": "p", "text": "Star Wars: Battlefront II is the sequel to Star Wars: Battlefront. It is a high-selling Star Wars video game following the many adventures of several characters. The two games are very similar, as both revolve around troopers from various factions fighting in different locales. Battlefront II, however, includes elements and missions from Star Wars: Episode III Revenge of the Sith, as well as enhanced aspects of gameplay including space combat and the ability to play as Jedi characters or other heroes."}, {"tag": "p", "text": "The game's campaign mode is entitled Rise of the Empire. The story takes the player on different missions throughout the galaxy as part of the Galactic Empire's 501st Legion known as Vader's Fist."}, {"tag": "p", "text": "Other game modes include \"Instant Action\" where the player can fight on any battleground, land or space, and \"Galactic Conquest\" where the player fights as a certain faction for control of the galaxy."}, {"tag": "p", "text": "The game was released on November 1, 2005, for the PC, Mobile phone, Xbox, PlayStation Portable, and PlayStation 2, the same day that Revenge of the Sith was released on DVD."}, {"tag": "h2", "text": "New Features"}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "The game contains an optional training mission on Geonosis. This mission takes the player around a battlefield and teaches him/her all of the various methods of fighting a battle. The mission consists of the following tasks:"}, {"tag": "p", "text": "The 501st Legion was not created until after the Battle of Geonosis, but a clone trooper who would later become a member of the 501st compiled this journal entry:"}, {"tag": "h2", "text": "Campaign mode"}, {"tag": "p", "text": "In Campaign Mode, the player follows the campaigns of the 501st Legion as told through the 501st Journal. As players progress through the game, they play as a clone trooper during the reign of the Republic and as a stormtrooper during the reign of the Empire."}, {"tag": "p", "text": "The action brings players to multiple planets through a story arc that stretches from the dawn of the Clone Wars to the formation of the Empire and later, bridging the gap between Episodes III and IV."}, {"tag": "p", "text": "Unlike the first Battlefront, Battlefront II's campaign gives players certain objectives with a given number of reinforcements with the enemy's reinforcements unlimited and an occasional time limit rather than playing an ordinary conquest match. The game also gives the option to skip space missions."}, {"tag": "h3", "text": "Republic Missions"}, {"tag": "p", "text": "(22 – 19 BBY - The Clone Wars)"}, {"tag": "h3", "text": "Empire Missions"}, {"tag": "p", "text": "(18 BBY – 3 ABY - Imperial Era/Galactic Civil War)"}, {"tag": "h3", "text": "Cross-era story missions"}, {"tag": "p", "text": "See also: Operation: Knightfall"}, {"tag": "h3", "text": "Bosses"}, {"tag": "p", "text": "Certain levels of the campaign require the elimination of an important person or persons in order to win the battle."}, {"tag": "h2", "text": "Galactic Conquest"}, {"tag": "p", "text": "The Galactic Conquest mode in Star Wars: Battlefront II has been completely revamped. In this new mode, players build and maintain fleets and try to achieve galactic dominance by conquering enemy worlds. A map of the galaxy shows planets controlled by the player, enemy-controlled planets, and pockets of empty space. Since there is only one map per planet (except Tatooine, even though Jabba's Palace is not in this mode) Planets can only be controlled by one side or the other, unlike the first game, where planets could be neutral."}, {"tag": "h3", "text": "Play"}, {"tag": "p", "text": "To attack a hostile planet, the player moves his/her fleet to the enemy planet. If an enemy capital ship is in orbit around the planet, the battle begins in space; otherwise a skirmish begins on the surface. A space battle also ensues if two enemy fleets meet in empty space."}, {"tag": "p", "text": "In space battles, the losing faction loses their fleet. If the victor is attacking a hostile planet, a ground battle begins directly after the victory."}, {"tag": "p", "text": "At the end of the battle, a summary shows what has occurred and displays how many credits were earned in the battle. The credit values for winning and losing vary based on the planet conquered as well as the number of planets already controlled by the faction."}, {"tag": "p", "text": "Each faction begins with one fleet. The cost to build more fleets depends on the number of fleets already in play. For example, Team 1 owns one fleet and wants to purchase another for 1000 credits. Team 1 then wishes to buy another fleet, which costs 2000 credits."}, {"tag": "p", "text": "The game ends when one side loses all of their planets and fleets."}, {"tag": "h3", "text": "Class Purchases"}, {"tag": "p", "text": "Each faction begins with the basic trooper for land battles and the pilot for space battles. They also begin with 1000 credits. At the beginning of any turn, the player has the option to purchase another class. The costs vary based on the class."}, {"tag": "h4", "text": "List of Classes and their Cost"}, {"tag": "h3", "text": "Bonuses"}, {"tag": "p", "text": "The bonuses return from the first game, although more strategy is involved. Instead of controlling the planets to gain these bonuses, the player must purchase them at the beginning of his/her turn. These bonuses can be used to aid their forces, protect command posts, or harm enemy units. However, once the bonus has been used it will need to be bought again. A player can have a maximum of 3 bonuses at a time."}, {"tag": "h4", "text": "List of Bonuses"}, {"tag": "h3", "text": "Scenarios"}, {"tag": "p", "text": "There are four different starting scenarios. If the player takes the enemy's base planet (bolded in the following list), he/she obtains twice the number of credits than normal, and that planet is permanently removed from gameplay."}, {"tag": "h4", "text": "Endings"}, {"tag": "h5", "text": "Birth of the Rebellion"}, {"tag": "p", "text": "States that the Rebellion has liberated the galaxy, ends with Darth Sidious being thrown into the Death Star II reactor and the liberation of planets as Luke Skywalker rebuilds the Jedi Order on Coruscant. A celebration with fireworks is held on Endor, Naboo, and Tatooine. Heroes of Yavin are seen reunited. \"A New Hope and End Credits\" is played. (Note: This is the only canon ending to a scenario due to the events of the Original Trilogy.)"}, {"tag": "h5", "text": "Republic Sovereignty"}, {"tag": "p", "text": "States that the Republic has reclaimed the galaxy, ends with the defeat of General Grievous at Utapau, and Darth Sidious is killed by Mace Windu. Anakin Skywalker becomes a Jedi Master. Ki-Adi-Mundi, Aayla Secura, Plo Koon and Stass Allie are not killed by their troops, as Order 66 never occurred. The clones remain loyal to the Republic and the Jedi Order. Galactic Civil War never occurs, and Anakin does not become Darth Vader. \"Battle of the Heroes\" is played."}, {"tag": "h5", "text": "Dark Reign of the Empire"}, {"tag": "p", "text": "States that the Empire has conquered the galaxy, Boba Fett captures Han Solo and leaves him encased in carbonite at Jabba's Palace. Darth Vader captures Princess Leia and is seen Force choking her on the Tantive IV. The Imperials push back the Rebel forces on Endor and defeat them in a space battle as well. Luke surrenders, and is shown bowing down to Palpatine on the Death Star II. The Emperor and Darth Vader rule the Galaxy. \"The Imperial March\" plays."}, {"tag": "h5", "text": "The Confederate Uprising"}, {"tag": "p", "text": "States that the CIS has conquered the galaxy, ends with the Droid Army annihilating Republic forces. Then they lead an attack on the Jedi Temple with Darth Sidious as their leader. Anakin and Count Dooku are shown dueling on Mustafar. Dooku kills Anakin on a bridge above a lava reservoir. Darth Maul and Jango Fett are show to be alive and well, battling the Republic on various planets. General Grievous hunts down and kills the remaining Jedi. \"Duel of the Fates\" plays."}, {"tag": "h2", "text": "New modes"}, {"tag": "p", "text": "In addition to the single player storyline, Galactic Conquest, and both single- and multiplayer Instant Action, Battlefront II has several new game modes – Hunt, Capture the Flag, Hero Assault, and XL, a PC-only single player mode. There is also a glitch on the PS2 and PC versions of the game: when zooming in between Mustafar and Endor and pressing pause, two extra modes appear: Team Deathmach and Team CP. However, both are unplayable without modding the game."}, {"tag": "h3", "text": "Hunt Mode"}, {"tag": "p", "text": "Hunt mode operates much like Assault mode. An army of indigenous forces (e.g., Wampas) and a faction (e.g., Rebel Alliance), fight each other to reach a set number of points first. This mode is somewhat unbalanced, as some forces are stronger than others; for example, the Endor scenario pits rock-wielding Ewoks against the scout trooper. The Ewoks are technically more powerful due to the scout trooper's role in the game as sniper infantry."}, {"tag": "h4", "text": "Hunt Mode Scenarios"}, {"tag": "h3", "text": "Capture the Flag"}, {"tag": "p", "text": "Capture the Flag, or CTF for short, is another mode available for play on all maps (including space maps). In CTF, two factions try to capture a flag and return it to a base. Points are awarded to the team for the number of flags recovered. Winners are determined by the number of flags captured, either by a set number of captures or a time limit. When a Jet or Dark Trooper picks up the flag they can't fly. When Jedi pick up the flag they will not be able to use Force Jump or Force Hover. Droidekas cannot pick up the flag while in ball mode. Some rules vary depending on the variations present in the game, 1-flag and 2-flag."}, {"tag": "h4", "text": "1-flag CTF"}, {"tag": "p", "text": "In 1-flag CTF, a neutral flag is placed approximately halfway between each faction's bases. The objective is to capture the flag and bring it to the opposite faction's base. This is the only CTF mode available for Space maps and some close to big maps like Yavin 4 or Hoth."}, {"tag": "h4", "text": "2-flag CTF"}, {"tag": "p", "text": "2-flag CTF resembles traditional Capture the Flag. It involves two factions which both hold a flag at their respective bases. The player must steal the flag from the enemy's base and return it to their own base."}, {"tag": "h3", "text": "Hero Assault Mode"}, {"tag": "p", "text": "This mode, taking place only on the Mos Eisley map, pits multiple copies of the game's playable Heroes against multiple copies of the playable Villains."}, {"tag": "p", "text": "The game plays out much like a Space Assault mode battle: the two teams battle each other to gain a set amount of points. The team to reach that number first wins.\nIn the Xbox Live download players are able to play Hero Assault mode at Kashyyyk. It plays out with the Heroes controlling the sea wall and Villains attacking from the island."}, {"tag": "h3", "text": "XL"}, {"tag": "p", "text": "This mode is only available on the PC in single player mode on the Kashyyyk, Hoth, and Geonosis maps. The idea is similar to Assault mode. When the player's team is the first to reach a certain number of points, victory is declared. The mode also limits the command posts, so that none can be captured or lost. The difference between XL and Assault is that in Assault there are always 180 obtainable points for each team, while in XL there can be more than 300 soldiers on each side. This mode is only available in the PC version because the PC is the only system able to calculate the huge numbers of entities."}, {"tag": "h2", "text": "Troop classes"}, {"tag": "p", "text": "A total of eight classes are available to play – six for land, two for space. Each offers a different battlefield function. Almost all classes are identical for each faction, keeping the game balanced. The \"Unique\" class is different for each side and varies with the map. In the instant action mode you can add units if points increase like wookiee warrior or CIS Magna Guard."}, {"tag": "h3", "text": "Land Classes/Infantry"}, {"tag": "h4", "text": "Soldier Class"}, {"tag": "p", "text": "The Trooper, or Soldier Class is a well-rounded class that serves as the keystone of the armies. They have a notable weakness against Vehicles, but can destroy one in groups, and are effective in nearly every situation, from close combat firefights to long range suppressive fire. They carry blaster rifles which are effective at short, medium, as well as long ranges. These soldiers also carry 4 thermal detonators, while other classes can only carry 2. Because of their rapid-fire blaster rifles, troopers are often the frontline troops and are best at taking out enemy infantry head-on. They are fairly well-balanced in terms of speed, firepower, and endurance."}, {"tag": "p", "text": "The soldiers of each faction are:"}, {"tag": "h4", "text": "Heavy Weapons Class"}, {"tag": "p", "text": "The Heavy Weapons Class is a common division in most armies. It consists of soldiers armed with missile launchers that are able to lock-on and home in on vehicles, primarily used to destroy vehicles and turrets. They also carry two thermal detonators, mines, and a light blaster pistol for short-range protection. As one of the heaviest units, they have one of the highest endurance and defense and can sustain a lot more damage than units from other classes. They are, however, one of the slowest units in the game, and as their launchers cannot lock on to non-vehicle targets and require reloading after each shot, they are not well suited for dealing with groups of enemy infantry. In addition to their missile launchers, heavy troopers are equipped with a standard blaster pistol as a side-arm, thermal detonators, and proximity mines. These mines emit an obvious red-glow and will not be set off by a teammate, although it can still kill them if they are caught in the blast radius."}, {"tag": "p", "text": "The heavy weapon specialists of each faction are:"}, {"tag": "h4", "text": "Sniper Class"}, {"tag": "p", "text": "The Sniper Class consists of snipers who are equipped with extremely high powered long-range rifles. It takes a single headshot to kill every unit except Heroes and droidekas. Often, snipers operate in elevated positions, away from the center of battle, where they can quietly eliminate an entire team without being noticed. They are the ultimate unit for long-range fighting and also work well at medium ranges and can also deploy auto-turrets for extra defense. While their long-range sniper rifles make them effective units in dealing with infantry, they also make them the weakest units in taking out vehicles and enclosed turrets, being able to deal practically no damage to artillery. Moreover, their rifles are light and quick at aiming even at close ranges, but the slow rate-of-fire and light armor make them nevertheless inefficient at directly facing groups of soldier units. Being the lightest troops in the game, they have the fastest speed at the cost of having the least endurance."}, {"tag": "p", "text": "The snipers of each faction are:"}, {"tag": "h4", "text": "Engineer Class"}, {"tag": "p", "text": "The Engineer Class are the troopers called to provide battlefield repairs and act as medics and ammo suppliers. It consists of engineers (or technicians) who carry handheld shotguns and explosive detpacks, which, unlike the proximity mines of heavy weapon specialists, can be detonated remotely. They also carry fusioncutters, which can repair allied vehicles, construct and repair turrets, or slice into enemy vehicles. Their shotguns are extremely deadly at close-range, but nevertheless the cost of rate-of-fire usually makes them inferior to the faster firing soldiers. Because of this, engineers mainly serve as support units for the main-line assault units. Their speed is secondary compared to that of snipers and are also second to them in terms of weakest endurance and defense."}, {"tag": "p", "text": "The engineers of each faction are:"}, {"tag": "h4", "text": "Special Class 1"}, {"tag": "p", "text": "Star Wars: Battlefront II introduces an extra special unit class. Each unit within this class have their own unique set of weapons and equipment. Each unit of this class has their own ability to affect those around them, either increasing stats of their teammates or decreasing health of enemies. In contrast to the other previous classes, a player must unlock 8 points in a battle before being able to use a unit from the first special class."}, {"tag": "p", "text": "The special units of each faction are:"}, {"tag": "p", "text": "The clone commander's signature weapon, the rapid-firing chaingun, is most effective in more enclosed areas against a small number of enemies. The chaingun is, arguably, the best gun in the game, as it can quickly eliminate multiple enemies under its incredible rate of fire. However, it has a short delay before firing as its barrels spin up and is ineffective against vehicles and turrets, being comparable to that of the sniper rifle's power on vehicles. Commanders carry a blaster pistol for short range protection and emergency use if their chaingun is overheated or did not have time to spin up. They can also use Rally to temporarily boost all nearby friendly troops' morale and increase their resistance to damage, thus a team is at its most effective when traveling with a Clone Commander. In addition, they have a recon droid to serve as short-range reconnaissance. The recon droid, although is has a limited period of time before exploding, can defend itself with a weak blaster or a self-destruct mechanism. Unfortunately, deploying a recon droid renders the user immobile and completely vulnerable to enemy fire while the droid itself is often destroyed while preparing to self-destruct, at which point it must remain immobile before detonating."}, {"tag": "p", "text": "Magnaguards are advanced droids that carry an arsenal of explosive weapons. Their Bulldog RLR's missiles can lock onto an enemy (even infantry) and kill in one to two shots, or they could be launched rapidly without locking on. Their radiation launchers are ballistic weapons that dispense projectiles similar to grenades, and is itself a type of grenade launcher, but with almost no splash damage. Like the clone commanders they carry with them recon droids for reconnaissance. However, the Magnaguards' weapons have limited ammunition and a slower rate of fire, meaning that they are best used to provide supporting fire to supplement its allies. Moreover, they are equipped with one-use neuro poison dispenser, which slowly reduces the health of all nearby units (except droids) once activated, thereby eventually causing inevitable death."}, {"tag": "p", "text": "Imperial officers have an arsenal similar to the Magnaguard's. Their primary weapon is a sonic blaster, quick-firing blasters with a wide-range but very low power, as is typical of sonic weapons in Battlefront. Alongside this sonic gun is a mortar launcher, which fires grenades that can either explode on impact or delayed with a charged setting to allow ricochet. Just like the previous two units, Imperial officers are also each equipped with a recon droid. Their Rage bonus temporarily augments the firepower of nearby allies, thus serving most effectively when traveling in a group with friendly troops. Like the Magnaguard, the Imperial officer's weapons have limited ammo and a slow rate of fire, making them more of a support class to allies."}, {"tag": "p", "text": "Bothan spies are units equipped for mostly stealth and strategic purposes. Their primary weapon is a short-range incinerator rifle that can quickly take out groups of enemies with increasing firepower. Despite its high rate-of-fire, however, the incinerator nevertheless takes more time to kill than a standard blaster rifle would in some cases. Because of this, it is usually used in conjunction with their stealth field generator, which allows them to become invisible. While invisible, a Bothan spy can utilize ambush tactics on their unaware enemy or capture command posts unseen. However, the user would be immediately forced out of stealth the moment they fire a wave of incinerating blasts, and if timed incorrectly, they can easily be taken out by a group of soldiers. Unlike the previous three special units, the recon droid is replaced with a sticky time bomb that detonates with a large concussive blast after 5 seconds. These bombs can be planted on an unsuspecting enemy turret. Finally, Bothans have the ability to gradually regenerate the health of all nearby comrades."}, {"tag": "h4", "text": "Special Class 2"}, {"tag": "p", "text": "Like the previous class, the second group of special units also defy categorization in terms of weapons and abilities. Therefore, each unit has their own strengths and weaknesses but cannot be used until a player earns a total of 12 points in a battle."}, {"tag": "p", "text": "The advanced special units of each faction are:"}, {"tag": "p", "text": "Clone jet troopers' main advantage is their agility, granted to them by their jetpacks, which allows them to quickly traverse great distances and gives them advantageous position over the enemy. Their EMP launchers fire devastating blasts of electromagnetism which, though slow-moving, can kill an enemy in one shot and eliminate a droideka's shield in two. They are equipped with a rapid-firing commando pistol as a sidearm, which is stronger than the regular blaster pistol. These units can be used to sneak up behind enemies using their jetpacks and ambush them from behind, then spring away to safety while they reload. They are the Republic's answer to the CIS droideka due to their agility in dodging the devastating laser bolts from destroyer droids and their EMP launcher's effectiveness in taking down their shields. However, they have gone down in defense and endurance since the previous game, and the electromagnetic blast radius of their EMP launchers also have a smaller splash damage radius than before. To accommodate their jetpack, they are impervious to fall damage."}, {"tag": "p", "text": "Droidekas are arguably one of the most powerful special units in the game. Their twin repeating blasters are one of the most devastating in-game, and their personal shield emitters give them one of the strongest defense. Using their shield in conjunction with their blasters, they can easily mow down multiple troops. Because of this, they are well-suited to massive firefights. Their shields can also be used to protect allies behind the shield and allow them to reload weapons. The droideka is not without flaws, however. It can not enter vehicles, as the manual states that the droideka itself is considered a vehicle. Its shield lasts for twenty to thirty seconds and can quickly be dissipated under fire from large groups of enemies. Additionally, they must be rolled up into a ball in order to travel quickly from place to place. Although fast, they are completely vulnerable when in this mode, as they are unable to raise their shield or fire their weapons. To attack, they must be deployed into their open configuration, at which point they would be one of the slowest units in the game, only being able to move at a very slow speed and also having a limited horizontal rotation rate."}, {"tag": "p", "text": "The dark trooper is the Imperial counterpart to the jet trooper. Their jump-packs can boost them off the ground very quickly, but unlike the jet trooper's jetpack, it sacrifices accuracy for speed and height. Their powerful arc casters fire a mid-ranged, wide bolt of electricity, which, when charged, can \"arc\" from one unit to up to four other units. They also carry a fast-firing commando pistol as a sidearm and, like the jet trooper, they can be used to gain an advantageous position over an enemy or ambush them from behind. As a result of their jump pack ability, they do not sustain fall damage."}, {"tag": "p", "text": "The Wookiee warrior has the most stamina of all units, about twice of that of a normal soldier, which makes up for their lack of speed and slow-firing arsenal. Their high endurance makes them able to withstand far more damage, sometimes being able to survive even a grenade. They are heavy hitters, with a unique bowcaster that can fire a spread of deadly shots, or fire a large, powerful bolt when charged up. The hand-made bowcaster features a scope with two zoom capabilities and can be used as an effective sniper rifle when charged and zoomed. They carry grenade launchers that fire ballistic grenades, which explode after a few seconds when making contact with the ground. They also carry 4 thermal detonators to clear up large groups of enemies, and a recon droid to scout an area."}, {"tag": "h3", "text": "Space Classes/Naval Force"}, {"tag": "h4", "text": "Pilot Class"}, {"tag": "p", "text": "The Pilot Class is used to launch assaults in space. Pilots are most useful in the cockpit of a starfighter, being able to automatically repair any ship they occupy. On the ground, they are each equipped with a commando pistol, time bombs, and fusion cutters. Although much more practical piloting a starfighter than fighting on-ground, their time bombs are the most effective at taking out critical systems from the interior of a capital ship. Their stamina, defense, and speed are roughly equivalent to that of an engineer."}, {"tag": "p", "text": "The pilot class included:"}, {"tag": "h4", "text": "Marine class"}, {"tag": "p", "text": "The marine class is a standard division of troops in most armies. They are trained to defend their capital ship in the event that it is boarded by enemy troops or to do vice versa. Marines are armed with portable rocket launchers for demolishing enemy ships, as well as regular blaster rifles and thermal detonators. Because they lack the ability to automatically repair any starfighter they occupy, they are not recommended to be used as bombers or dogfighters. Instead, they are most useful in raiding the enemy cruiser."}, {"tag": "p", "text": "The marine class included:"}, {"tag": "h3", "text": "Trooper Variants"}, {"tag": "p", "text": "On certain levels, certain characters have outfit changes to match the environment or as seen in the Star Wars Movies. The following lists the levels where the classes have a special outfit instead of the standard that is used on all other maps."}, {"tag": "h4", "text": "Galactic Republic"}, {"tag": "h4", "text": "Confederacy of Independent Systems"}, {"tag": "h4", "text": "Galactic Empire"}, {"tag": "h4", "text": "Rebel Alliance"}, {"tag": "h3", "text": "Award Weapons"}, {"tag": "p", "text": "Players can earn weapon upgrades, depending on the soldier type. All reward weapons (excluding the Guidable Rockets) replace an existing weapon. It should be noted that some of the weapons can be either situationally weaker and/or more limited than the one it replaces. A prime example is the AWARD sniper rifle-the beam is ineffective in some situation where the regular sniper rifle is fine. In the event of trying to snipe a target from the top of a turret for example, where a head shot would be required, the AWARD rifle disregards headshots, but delivers an almost always instant kill body shot instead."}, {"tag": "h2", "text": "Weapons and Gear"}, {"tag": "h3", "text": "Blaster and Projectile Weapons"}, {"tag": "h3", "text": "Explosive Weapons"}, {"tag": "h3", "text": "Support Gear"}, {"tag": "h3", "text": "Hero Weapons and Gear"}, {"tag": "h3", "text": "Jedi and Sith Abilities"}, {"tag": "p", "text": "Jedi and Sith have unique abilities which drain their stamina bar. Using the Force, these abilities extended the powers of the user beyond normal limits."}, {"tag": "p", "text": "Light Side Abilities"}, {"tag": "p", "text": "Dark Side Abilities"}, {"tag": "p", "text": "Neutral Abilities"}, {"tag": "h2", "text": "Heroes"}, {"tag": "p", "text": "After fulfilling the goals set in the Hero Options screen (e.g. earn 10 points), players are able to obtain the services of one of these Heroes to aid them. Each has a different ability and will last a limited amount of time. The time, represented by a lightsaber bar, will decrease faster if the player does negative things such as spawn-camping or killing teammates. The bar will increase if the player kills numerous enemy units or vehicles. Each team gets one Hero at a time, but there can be more than one Hero for each team per match if the Heroes are unlocked more than once. Each Jedi has the ability to use Force Jump and Force speed. The Force-sensitive characters also each get two of five special techniques. They are Force Pull (Jedi only), Force Push (both), Force Choke (Sith only), Force lightning (Sith only), Saber Throw (both). Most Jedi and Sith use a three attack combo, the last being the most powerful."}, {"tag": "p", "text": "Each faction has a hero that is primarily used more than others. Obi-Wan Kenobi can be used more than any hero in the Republic, Han Solo for the Rebellion, Darth Maul for the Confederacy, and Boba Fett for the Empire"}, {"tag": "p", "text": "In Hero Assault Mode, multiple heroes occupy the map. The lightsaber health bar is replaced by the standard non-hero health bar."}, {"tag": "p", "text": "The characters Asajj Ventress and Kit Fisto are only available through the Xbox Live downloadable content."}, {"tag": "h3", "text": "Light Side Heroes"}, {"tag": "h4", "text": "Galactic Republic"}, {"tag": "h4", "text": "Rebel Alliance"}, {"tag": "h3", "text": "Dark Side Villains"}, {"tag": "h4", "text": "Confederacy of Independent Systems (CIS)"}, {"tag": "h4", "text": "Galactic Empire"}, {"tag": "h2", "text": "Neutral sides/creatures"}, {"tag": "p", "text": "On certain levels, there are three way battles between the two normal sides and a neutral side, and on others, the natives join a certain side (except for the Empire, which has no native creatures). In addition, there are native creatures that will attack anything that comes across their path. The Jawas on Mos Eisley are an exception, they can create turrets and rebuild ammo and health droids, but mostly will wander around the map to keep doing these things, and despite seeing one with the occasional rifle, they are completely non-aggressive."}, {"tag": "h2", "text": "Capital ships"}, {"tag": "p", "text": "In space combat, each faction will have capital ships. The capital ships (battleships) contain all starfighters and rooms, while the others attack nearby enemies and provide defense/fire support. With the exception of the hangar, the rooms in the battleships have auto-turrets in them that will fire on intruders, though they are not as powerful as the turrets used by the auto-turret bonus. The battleships have a few powerful rapid firing auto-turrets on the outside which can make short work of any type of ship, which a player can also manually control like other turrets, and the shields on the ship make destroying the turrets very difficult. The external turrets will cease firing if the auto-turret defense mainframe inside the ship is destroyed, though the internal turrets will still operate. The shield generator's destruction, also inside the ship, results in the shields outside the battleship being lowered, though sometimes a glitch in the game causes that to not happen, and although just shooting at the battleship will lower the shields, doing so takes considerable time and destroying the shield generator on the inside is much faster. However, the shield generator can be repaired, but it takes some time unless multiple players, playing as the Pilot class, chip in with their Fusioncutters to repair it faster, protecting the external targets for an additional amount of time. Battleships can't be destroyed, but they do have internal and external systems that can be. Outside of the previously mentioned shield generator and auto-turret defense mainframe, there is an externally mounted bridge, life-support systems, communications relay, short-range sensors, and engines. Internally the engine cooling tanks and the life support systems can also be destroyed on the inside. Destroying these, unlike the shields and defense mainframes, does not affect gameplay, but does award whoever destroys them a large sum of points, except in CTF. Internal systems take roughly 2-4 time bombs to destroy. External ones take dozens of bombs at the very least. The other ships are frigates, which cannot be boarded. The number of them that each side has varies from map to map. Unlike battleships, they can be destroyed, but are very durable so it takes time. The frigates have several turrets mounted on them that can make short work of incoming ships, but they won't always fire on a ship depending on how close or how far away they are. Despite their strong weapons, the frigates are very vulnerable to bombers and even a single one can take out a frigate with little difficulty if no fighters intervene. Destroying a frigate gives the same number of points to a side as destroying a system on a ship, except in a CTF match, but even in there it's likely a good idea to have a player destroy the enemy frigates to keep them from shooting their fighters down."}, {"tag": "p", "text": "If the player plays as an interceptor in the Kashyyyk space level then it's possible to fly up to the Droid control ships, Venator class star destroyers and Trade Federation Cruisers in the distance, which are in fact smaller, less realistic models which cause damage when flown into."}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "h3", "text": "Confederacy of Independent Systems"}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "h3", "text": "Rebel Alliance"}, {"tag": "h2", "text": "Functions of Different Starfighters"}, {"tag": "p", "text": "Each faction (Republic, CIS, Rebel, Empire) features four different types of ships:"}, {"tag": "p", "text": "Bombers are used to take out transports, shields, and ship main systems outside the capital ships. These ships carry high-yield proton bombs. They cannot lock bombs to enemy fighters and have significantly more armor than fighters and interceptors but not more than transports."}, {"tag": "p", "text": "Fighters are all-purpose ships useful for any situation. These starfighters cannot perform specific functions as well as specialized craft. These ships have lock-on torpedoes, and have significantly more armor than interceptors, but not more than bombers and transports."}, {"tag": "p", "text": "Interceptors are high-speed fighters used to dogfight other starfighters. Although these ships can take out starfighters with ease, these are low in power and armor. These ships generally hold cluster missiles and can lock onto targets very quickly."}, {"tag": "p", "text": "Transports are extremely high in defense, are the slowest and least maneuverable space units. These ships also have multiple positions, up to six, including a main gunner, second gunner, and passengers. Secondary weapons on the ship vary from faction to faction. The troop transports act as spawn points when landed: as long as a transport is manned by at least one pilot, infantry will continue to spawn from the transport. However, they cannot perform evasive maneuvers."}, {"tag": "h2", "text": "Planetary vehicles"}, {"tag": "p", "text": "Each faction uses three distinct types of vehicles. These vary in terms of speed, armor, and firepower. These types are :"}, {"tag": "p", "text": "Such vehicles are very fast but have little firepower and armor. The Tauntaun does not have any weapons."}, {"tag": "p", "text": "This type of vehicles feature medium characteristics, having firepower."}, {"tag": "p", "text": "Heavy transports are massive vehicles that serve as mobile command posts. They possess amazing firepower and armor, but are very slow. They also cannot be sliced by enemy engineers and cannot be destroyed with a single landmine and function as mobile spawning points. These are the AT-TE for the Republic on Geonosis and Felucia and the AT-AT for the Empire on Hoth."}, {"tag": "p", "text": "The vehicles of the factions are ( not all vehicles available at every map ) :"}, {"tag": "p", "text": "Confederacy of Independent Systems:"}, {"tag": "p", "text": "Galactic Republic:"}, {"tag": "p", "text": "Galactic Empire:"}, {"tag": "p", "text": "Rebel Alliance:"}, {"tag": "h3", "text": "Critical hit locations"}, {"tag": "p", "text": "All vehicles have a critical hit point that, when struck with an explosive round, depletes, at the most, 70% of their health. The critical hit point is hard to see and even harder to hit."}, {"tag": "p", "text": "If players were to hit close to the critical hit location on a vehicle, they would do twice as much damage as a rocket launcher would regularly do (about 25-30%). Locking on to some of these vehicles at a adequate range and radius might lead the rocket to the critical point."}, {"tag": "h2", "text": "Battlefronts"}, {"tag": "p", "text": "In Battlefront II, there are no two maps that take place on the same planet excluding Tatooine and space levels, as this adds more variety to the missions."}, {"tag": "p", "text": "There are 18 land maps and six space maps in instant action (Space Coruscant and Space Mustafar are not in instant action). This means that Battlefront II has over five times as much variety as its predecessor had. Some space maps such as Space Coruscant and Space Mustafar are only available in Campaign mode, however all space maps are available in Galactic Conquest."}, {"tag": "h3", "text": "All-use maps"}, {"tag": "h3", "text": "Faction and era-specific maps"}, {"tag": "p", "text": "Some maps are only available to one era. Every faction has a \"Homeworld\""}, {"tag": "h3", "text": "Space Maps"}, {"tag": "p", "text": "Space Coruscant"}, {"tag": "p", "text": "Space Hoth"}, {"tag": "p", "text": "Space Yavin 4"}, {"tag": "p", "text": "Space Mygeeto"}, {"tag": "p", "text": "Space Kashyyyk"}, {"tag": "p", "text": "Space Felucia"}, {"tag": "p", "text": "Space Tatooine"}, {"tag": "p", "text": "Space Mustafar"}, {"tag": "p", "text": "Space Endor"}, {"tag": "p", "text": "Space Polis Massa"}, {"tag": "p", "text": "Space Naboo"}, {"tag": "p", "text": "Space Geonosis"}, {"tag": "p", "text": "Space Dagobah"}, {"tag": "p", "text": "Space Kamino"}, {"tag": "p", "text": "Space"}, {"tag": "h3", "text": "Xbox Live Downloadable Maps"}, {"tag": "p", "text": "LucasArts released maps from the first game, bundled together for a $4.99 download for Xbox."}, {"tag": "p", "text": "Rhen Var"}, {"tag": "p", "text": "Rhen Var"}, {"tag": "p", "text": "Bespin"}, {"tag": "p", "text": "Yavin IV"}, {"tag": "h3", "text": "PSP Version"}, {"tag": "p", "text": "The Geonosis, Utapau, Jedi Temple on Coruscant, Death Star, Kamino, and Felucia land missions and all but three of the space maps (Kashyyyk, Yavin 4 and open space) are not present in the PSP version of the game (although they can be found on the UMD and edited back into the game, only Geonosis, Coruscant and Utapau are complete and playable). Also missing but present on the UMD is an incomplete Rhen Var Citadel map, suggesting that Rhen Var Citadel would have been a PSP exclusive map prior to the Xbox update. Mustafar is also scaled back slightly (it does not include the Control Room or the conference room), although the PSP game's successor, Renegade Squadron, uses most of the original Mustafar map."}, {"tag": "p", "text": "Also present in the game is a unique feature during solo Conquest matches, where AI will become a certain map's hero if the player chooses to spawn as a hero."}, {"tag": "p", "text": "The ability to damage capital ships' critical systems from the inside, as well as self-manned turrets, is also missing from the game (although internal critical systems can be seen by running alongside a hangar wall while directing the camera against it). Also, the Training, Space Overview, and Rise of the Empire modes are not available. Instead of the campaign mode there is an alternative challenge mode with three different scenarios."}, {"tag": "p", "text": "Imperial enforcer – Players will travel to several planets, in which they must hunt down a set number of natives within a time limit. Locations include Naboo – Gungans, Mos Eisley – Jawas, Endor – Ewoks and their final destination will be Kashyyyk, where they must hunt down fifty Wookiees, they are however allowed one IFT-T. Players begin as a sniper, and their class choices will grow as they venture. Players are aided by Boba Fett."}, {"tag": "p", "text": "Rogue Assassin – Players are a Phase I Jet Trooper, carrying a clone's blaster rifle instead of an EMP launcher. Rogue Assassins must hunt down and kill specific targets, high ranking officers or deserters, in a time limit, on different planets. Planets include Dagobah – Three Imperial officers, Mygeeto – Three Imperial officers, Yavin 4 – Six Clone Commanders (two sets of three), Polis Massa – Six MagnaGuards (Two sets of three). Players only have one class choice, and the heroes are the Fetts(Jango and Boba)."}, {"tag": "p", "text": "Rebel Raider – Players are a Rebel smuggler. They must acquire certain parts within a time limit. Players will travel to Mygeeto to collect three shield generator parts, then to Naboo to receive weaponry plans, then to Hoth to seek out Imperial probe droids, then in space they must land in the imperial hangar and transport goods back. Players are aided by Han Solo."}, {"tag": "h2", "text": "Medals"}, {"tag": "p", "text": "Medals can be acquired for achieving special requirements in one life, however, players must achieve veteran status (Four medals) of that medal before they can use the award that comes with it. Players lose the medal once they die, but if they die within thirty seconds of acquiring the medal, then the award is available to them in the next life. When Elite status (32 medals) is achieved in a certain area, the requirements to earn a medal in that area are lowered (usually by one-fourth), allowing players to gain legendary status more easily. Once legendary status (sixty-four medals) of that medal is achieved players will automatically get the medal once you start the game."}, {"tag": "p", "text": "The Endurance medal is acquired after twelve points are earned in one life (nine with Elite status). Energy regeneration is awarded, this increases the speed of which the energy bar used for strenuous actions regenerates."}, {"tag": "p", "text": "The Guardian medal is awarded after twenty-four points are earned in one life (eighteen with Elite status). Damage Reduction is awarded, which makes enemy fire less damaging to the players."}, {"tag": "p", "text": "The War Hero medal is awarded after thirty-six points are earned in one life (twenty-seven with Elite status). Increased Damage is awarded, which increases the damage players' weapons do."}, {"tag": "p", "text": "The Frenzy medal is awarded after twelve kills with a Blaster Rifle in one life (nine with Elite status). The Elite Rifle is the award, which offers a more accurate three round burst firing rifle like Boba Fett's with less ammo."}, {"tag": "p", "text": "The Demolition medal is awarded after four critical hits on vehicle with a Rocket Launcher are gained in one life (three with Elite status). Remote Rockets are the award, these are guided rockets which home in on the target. This is the only award that does not replace the previous weapon."}, {"tag": "p", "text": "The Gunslinger medal is awarded after six kills with a Pistol in one life (four with Elite status). A Precision Pistol with greater damage, accuracy, faster rate of fire, and limited ammo is awarded."}, {"tag": "p", "text": "The Marksman medal is awarded after six head shots with sniper rifle are gained in one life (four with Elite status). The Beam Rifle is the award, which offers a beam that can pass through multiple enemies."}, {"tag": "p", "text": "The Regulator medal is awarded after eight kills with a Blast Cannon/Shotgun are gained in one life (six with Elite status). The award is a Flechette Shotgun, which is a more powerful shotgun, with more ammo than the regular shotgun."}, {"tag": "p", "text": "The Technician medal is awarded to players who manage to slice into a vehicle. The Vehicle Regeneration award is given which slowly regenerates the health of the vehicle the player drives next."}, {"tag": "p", "text": "The more medals they player has earned, the more men can be lead: If twenty medals are earned, players obtain the rank of sergeant and can lead two men; if one hundred are earned, players obtain the rank of captain and can lead three men; and if three hundred medals are earned, players obtain the rank of general and can lead four men."}, {"tag": "h2", "text": "Voice cast"}, {"tag": "h2", "text": "Xbox Live Downloadable Content"}, {"tag": "p", "text": "On January 31st 2006, downloable content was released allowing Xbox Live users for $4.99 to add multiple levels and two new Clone Wars heroes to their gaming experience. The download includes:"}, {"tag": "h3", "text": "New heroes"}, {"tag": "h3", "text": "New levels"}, {"tag": "p", "text": "NOTE: These maps are from the first game and, along with the Kashyyyk: Beachhead map, can be played in Hero Assault mode."}, {"tag": "h3", "text": "New modes"}, {"tag": "p", "text": "Wampas (claws) vs. Rebels (All Types)"}, {"tag": "h2", "text": "Mod tools"}, {"tag": "p", "text": "On February 15, 2006 a 1.1 patch was released for the PC version, which included support for additional maps. The modding tools were subsequently released by LucasArts and Pandemic Studios on February 22, and shipped with nearly everything used to make the game, including the mission files, special effects, fonts, and localizations, unlike its predecessor, BFBuilder, for the original Battlefront game. Sound effects and music used to make the game were not included because of copyright issues, although it is possible to import original music and sound effects into the game."}, {"tag": "p", "text": "Map editing in BFBuilder is handled by a program called ZeroEdit, which is used to mold the landscapes, place objects, command posts and vehicle spawn points. Additional scripting is done through LUA files for maps, and ODF (Object Definition Files) files for objects. User-created levels and mods then go through a process called munging, which compiles assets and maps into formats readable by the game, which are then compiled into container files for in-game use. Although the Battlefront II mod tools are subtly different from BFBuilder, assets can be imported from the first into the second, and vice versa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Differences between the trailer and final game"}, {"tag": "h3", "text": "Cut content"}, {"tag": "p", "text": "The game has content that was cut but included either with the mod tools or indicated in the game's files:"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}