{"url": "Star_Wars:_Battlefront_III", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Canceled video games"], "nodes": [{"tag": "h1", "text": "Star Wars: Battlefront III"}, {"tag": "p", "text": "Star Wars: Battlefront III was a video game in development at Free Radical Design since 2006, and was to be the third installment in the original Battlefront series. It was eventually cancelled in 2008."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "Building up on the legacy of the two previous games, Battlefront III would have made possible for players to seamlessly transition from ground battle to space battle, by taking off in or landing a spaceship."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The vast majority of what is known about Battlefront III can be tracked down to a few online articles published in 2012 by specialized outlets, based on statements from parties directly involved. Free Radical Design developers, in particular three of its co-founders: Steve Ellis, David Doak, and Graeme Norgate, would be featured in articles by Gameindustry.biz and Eurogamer. while contradicting statements from a former LucasArts employee, who wished to remain anonymous, along with a retort by Steve Ellis (who acknowledged that according to the level of details, he might know who that employee was), were published on GameSpot."}, {"tag": "h3", "text": "A new partnership"}, {"tag": "p", "text": "In 2006, LucasArts President Jim Ward wanted to publish a third Battlefront game as part of the company's ongoing strategy. To do this, LucasArts reached out to Free Radical Design (who was already working on Haze), and the two companies made a deal during summer 2006, with development starting soon after. The game was to be much more ambitious than the previous Battlefront games, both in regard of its scope and supporting technologies. It was to be released in October 2008. While Battlefront III would not be officially announced, or even acknowledged, by LucasArts, the deal between them and Free Radical was the subject of a press release at the beginning of August 2006."}, {"tag": "p", "text": "In December 2007, LucasArts and Free Radical signed a new contract for a sequel, Star Wars: Battlefront IV, requiring Free Radical to further increase its staff. One of Free Radical's co-directors, Steve Ellis, would later describe this a \"vote of confidence in us\". By January 2008, Ellis told LucasArts that Free Radical wouldn't be able to meet the originally planned released date for Battlefront III. It was pushed to April 2009, with LucasArts consenting to pay for seven months of work. Among difficulties, the technological transition to a new generation of video game consoles, the growing need for a bigger work force (it reached around 200 employees in 2008), and changes in design (decided with LucasArts), hindered the development."}, {"tag": "h3", "text": "Change of course"}, {"tag": "p", "text": "In 2008, things turned for the worse as LucasArts saw major changes in its management, first with the departure of Jim Ward in February, and later with the arrival of his successor in April, Darrell Rodriguez, whose new strategy saw a large portion of the staff (including nearly all managers) being fired. At the time, Free Radical was concerned about not being able to reach its deadlines, while still making good progress. From there, publisher-developer relationship only deteriorated. In May, the release of Haze, which got delayed by one year and was receiving poor reviews (with a Metacritic score of 55) was alarming for LucasArts."}, {"tag": "p", "text": "Free Radical composer Graeme Norgate spoke later of \"stalling tactics\" used by LucasArts, as the publisher refused to validate milestone after milestone, and was six months late to pay Free Radical. David Doak, Free Radical co-director, would describe the situation as LucasArts trying to cut costs and ditch the project altogether, and while Free Radical was protected by a contract, the balance of power wasn't on their side. The ex-LucasArts employee (from the GameSpot article) would retort that Free Radical had missed dates and deliveries, even before the departure of Jim Ward, and both Presidents of LucasArts made \"many good will whole or partial milestones payements\". While he admitted that some milestones missed were about subjective quality issues, others were missing functionality altogether, including missing AI working in levels by December 2007, the absence of a working build for the Xbox 360 during the entirety of 2007, and the absence of every game mode besides team free-for-all."}, {"tag": "h3", "text": "Cancellation"}, {"tag": "p", "text": "The cancellation eventually occurred in October 2008. According to the ex-LucasArts employee, LucasArts judged that Free Radical was unable to deliver on its August and September milestones. He would summarise the failing of Battlefront III in three points. First, Haze siphoned resources during the first half of Battlefront III development. Second, Free Radical overestimated its ability to meet milestones. And lastly, because Free Radical kept missing assigned dates. He concluded that Free Radical wasn't upfront with LucasArts about their problems. While agreeing that Free Radical had some trouble with its estimation to reach certain milestones, Steve Ellis rebutted the first point, saying that Free Radical considered that to move resources (money or employees) from one project to another ongoing project was bad practice, and had never done it for Haze or any other project. He would add, as David Doak had already told the same thing to Eurogamer, that LucasArts (under Jim Ward) was the best publisher relationship they had had. Also, Ellis revealed that LucasArts negotiated for the cancellation of both Battlefront games in development at Free Radical, and added to further his defense of the company, that the contract was not terminated for breach, and thus the company was less to blame that it was led to be believed."}, {"tag": "p", "text": "The ex-LucasArts employee would go as far as suspecting Free Radical to have funneled funds from LucasArts for Battlefront III to help the development of Haze, and later TimeSplitters 4, which was in pre-production since at least mid-2007, calling it \"akin to a Ponzi scheme where time and budget from the next game was being used to finish the previous, late, title\". This was strongly refuted by Steve Ellis, who pointed out that Haze delay was fully financially supported by its publisher, Ubisoft."}, {"tag": "p", "text": "Steve Ellis would also claim that the game was almost finished: \"We had a 99% finished game that just needed bug fixing for release.\" This statement in particular is what pushed the ex-LucasArts employee to reach out to GameSpot in the first place, calling it \"bullshit\", and giving his own \"generous estimate\" of \"75 percent of a mediocre game\". Ellis would respond that leaked video showed that the game was content complete, and all that was left to do was fix bugs. He stated that the completion rate of the game would be calculated based on the number of open bugs in database, with a possible release date being predicted based on the rate of bug fixing versus the rate of bug discovery. At the time of cancellation, the major bugs (known as \"must fix bugs\") would have been handled under three to four weeks. Ellis recognized 99% was an exaggeration, and that it was closer to 97-98%."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Assets created during the development of the game were later reused by Rebellion Developments on Star Wars Battlefront: Elite Squadron. Artworks, screenshots and gameplay videos have since leaked online from former Free Radical employees. One video published on Youtube was removed following a Lucasfilm copyright claim."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}