{"url": "%27Ndranth_Poussan", "categories": ["Category:Legends articles", "Category:Wookieepedia Good article nominations", "Category:Agamar Resistance members", "Category:Agamari", "Category:Alliance Starfighter Corps personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "'Ndranth Poussan"}, {"tag": "p", "text": "'Ndranth Poussan was a Human male starfighter pilot in the Rebel Alliance during the Galactic Civil War. A native of the planet Agamar, Poussan joined the Alliance after a speech on his homeworld by Chief of State Mon Mothma. Poussan was still undergoing training aboard the Mon Calamari Star Cruiser Independence when a shortage of pilots saw him called up for his first combat mission, providing cover for the evacuation of the Rebel base on Brigia. He was killed during the battle when his X-wing collided with a TIE fighter."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "'Ndranth Poussan was a native of the planet Agamar, located in the Lahara sector of the Outer Rim Territories, during the Imperial era. By 1 BBY, a resistance had begun on Agamar in opposition to the rule of the Galactic Empire. Following an Imperial attack on the Agamarian town of Tondatha, Mon Mothma, Chief of State of the Alliance to Restore the Republic, traveled to Agamar in the hopes of bringing the resistance into the growing Rebel Alliance. After Mothma gave a speech to members of the resistance at a rally in the Agamarian capital of Calna Muun, Poussan was one of four Agamarians who decided to enlist as a pilot in the Alliance Starfighter Corps."}, {"tag": "p", "text": "Poussan traveled to the waiting Mon Calamari Star Cruiser Independence aboard a Rebel shuttle along with the other new recruits, Keyan Farlander, Sunnar Jan-lo, and Breth Gart. Upon arrival, the recruits were shown to their quarters and assigned liaison officers for the duration of their training. After learning the basics of starfighter operations in the pilot proving grounds, the group proceeded to simulated combat scenarios. When Farlander became the first to complete his training and enter active duty, Poussan's training was behind that of Jan-lo."}, {"tag": "p", "text": "The Alliance soon learned of a major Imperial offensive code named Operation Strike Fear, which was to begin with an assault on the main Rebel base on the planet Brigia. Alliance High Command decided to launch a complete evacuation of all equipment and personnel, dispatching starfighters from the Independence to provide cover for the senior staff shuttles and equipment transports. Although Poussan had not yet completed his training, an extra pilot was needed for the mission, and he was selected to fly an X-wing starfighter. Not long after the Rebel forces arrived in the system, the Imperial-class Star Destroyer Invincible dropped out of hyperspace and began launching fighters. Poussan was killed in the ensuing melee when he collided with a TIE fighter while his shields were low."}, {"tag": "p", "text": "Jan-lo took part in her first assignment the following day and informed Farlander of Poussan's death when the two pilots attended the mission briefing. Angry over the death of his fellow Agamarian, Farlander took out his frustration on enemy TIE fighters."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A tall, thin Human male with reddish hair and small, slit-like eyes, 'Ndranth Poussan was still a young man when he joined the Rebel Alliance. He found it difficult to stay calm on the shuttle ride from his homeworld of Agamar to the Independence, noticeably fidgeting throughout. During his training as a pilot aboard the Independence, Poussan lagged behind Farlander and Jan-lo, both of whom had joined the Alliance at the same time as him, and he was killed during his first mission."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "'Ndranth Poussan was created by Rusel DeMaria for the 1993 book X-Wing: The Official Strategy Guide, which presented the story of Keyan Farlander, the player character in the game Star Wars: X-Wing. In the narrative sections of X-Wing: The Official Strategy Guide, Poussan's name is spelled \"'Ndranth,\" but it is spelled \"Ndranth\" in the book's glossary. X-Wing Collector's CD-ROM: The Official Strategy Guide, which was published in 1995, altered the spelling in the glossary to \"N'dranth,\" still differing from the narrative sections. Poussan's name is mistakenly spelled \"'Ndrath\" in the character's entry in 2008's The Complete Star Wars Encyclopedia. This article uses the spelling from the narrative sections, as it is the most commonly used."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}