{"url": "Star_Wars:_Clone_Wars_Adventures_(video_game)", "categories": ["Category:Real-world articles", "Category:Cleanup", "Category:Articles with an excess of redlinks", "Category:2010 computer and video games", "Category:MMORPGs"], "nodes": [{"tag": "h1", "text": "Star Wars: Clone Wars Adventures (video game)"}, {"tag": "p", "text": "Star Wars: Clone Wars Adventures was a Star Wars–themed massively multiplayer online game developed by Sony Online Entertainment. First announced on June 1, 2010, the game was part of the Star Wars: The Clone Wars multimedia project. Although the basic game was free to play, premium content, including lightsaber and character customization, could be unlocked through a monthly subscription-based \"Jedi\" membership. In addition, in-game items could be purchased using Sony Online Entertainment's virtual currency system, Station Cash."}, {"tag": "p", "text": "In August 2010, Clone Wars Adventures entered open beta testing. Three playable species were available: Human, Clone, and Twi'lek. The game was released on September 15, 2010. On the game's release, the Zabrak species was made available to accounts with Jedi membership. Due to the success of the game, Topps released a trading-card game based on the game Card Commander. On January 24, 2014, Sony announced that Clone Wars Adventures would be shut down on March 31 of that year. Before the end, all players were made Jedi Members, and most Station Cash items in the store were reduced to the price of 1 Station Cash."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "The game was a social/minigame hub for players to interact with their favorite characters from the Star Wars: The Clone Wars TV series. A new player first starting the game began on the starter planet of Ryloth. The player was tasked to defeat a group of droids and then would meet many of the iconic characters from the series to learn how to play a few of the many minigames in this game. Trophies were awarded depending on the requirements that the player met. Players were allowed to customize their own houses, purchase creatures and droids as pets, purchase and change into clothes, and change their character's face or species with a Jedi membership. Many outfits for characters were available for Jedi Members only, or cost Station Cash, which was currency spent on in-game items, as in other Sony games. New content was usually released weekly."}, {"tag": "h2", "text": "Combat Zones"}, {"tag": "p", "text": "A December 15, 2011 update featured a new combat zone based on the Star Wars: The Clone Wars Umbara arc. The Battle of Umbara was based on open world PvE combat with two abilities, a standard blast and for Jedi Members only, a Force push ability. It had four challenges, an airfield mission, and three bunkers. On August 24, a new combat zone was added in an update called \"Skirmish on Carlac.\" Like the Battle of Umbara combat zone, this featured three camps and a captured village to battle in. On April 5, 2013, the game was updated to have the planet Felucia as a combat zone. Unlike other combat zones, Felucia had no challenges. It introduced mission tokens, a special form of currency for buying certain items. This currency could only be obtained by completing missions on Felucia. Since Felucia had no challenges, there was a Separatist base, Yorn Nuro and his gang of pirates, a sarlacc pit, and the rancor, Scratch's cave. A mission terminal, clone commando Boss, and Captain Carg offered players missions. Completion of missions gave players mission tokens and Republic Credits."}, {"tag": "h2", "text": "Battle Classes"}, {"tag": "p", "text": "On September 28, 2012, a new Battle Classes feature was added in the game, where the player could play games and more to rank up and gain experience points. There were four Battle classes: Trooper, Mercenary, Sith, and Jedi. Trooper was available for free to all players to start with, and players who were Jedi Members could get the Jedi Battle Class for free. The other two Battle classes, Sith and Mercenary, could be purchased from the in-game store with Station Cash, though Jedi Members could purchase the two battle classes at a discount. Later, specialty classes were introduced in the game. These included Scoundrel, which was leveled up by playing Card Commander and Card Assault; Technician, which was leveled up at Technician Workstation; and Exile, like the original battle classes you had to kill enemies to rank up."}, {"tag": "h2", "text": "Playable species"}, {"tag": "p", "text": "The following species were available as playable characters:"}, {"tag": "h2", "text": "Closure"}, {"tag": "p", "text": "On January 24, 2014, Sony Online Entertainment announced that they were shutting down four MMORPGs including this one on March 31. The other three were Free Realms, Vanguard: Saga of Heroes and Wizardry Online."}, {"tag": "p", "text": "On March 31, 2014, the games shut down, making them unplayable."}, {"tag": "h2", "text": "Minigames"}, {"tag": "h2", "text": "Credits[5]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}