{"url": "Star_Wars:_Commander", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:2014 computer and video games", "Category:Canon mobile games"], "nodes": [{"tag": "h1", "text": "Star Wars: Commander"}, {"tag": "p", "text": "Star Wars: Commander was a mobile strategy game produced by Disney Interactive that featured characters, locations, and technology from the Star Wars saga. The game was released on August 21, 2014 for iOS devices, with a limited early release for select international markets. The game was officially shut down on June 12, 2020."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Chapter I"}, {"tag": "p", "text": "The game features a storyline which takes place between the Star Wars episodes A New Hope and The Empire Strikes Back. A band of mercenaries has arrived on Tatooine to build a new base of operations. The group is led by Saponza and his partner. The mercenaries settle in at Saponza's homestead as their new base."}, {"tag": "p", "text": "Shortly after settling in, a band of thugs attack the base. After defeating the thugs, the group discovers that they worked for Jabba the Hutt, who has been angered by the defeat."}, {"tag": "p", "text": "In search of allies to protect themselves against Jabba, the mercenaries seek out contract jobs for both the Galactic Empire and the Rebel Alliance."}, {"tag": "p", "text": "Upon returning from their contract jobs, the mercenaries find their base destroyed by Jabba's forces. In order to get it rebuilt, the mercenaries must fully align with either the Empire or the Rebels."}, {"tag": "h3", "text": "Chapter II"}, {"tag": "p", "text": "After Saponza's partner helped win the battle for Tatooine, the agent was cleared to move his forces to other planets to continue fighting in the war against enemy forces."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "Star Wars: Commander is a strategy game that is available for Android, iOS, and Windows devices. Players use the touchscreen as their input and receive orders from the characters using holograms. They build up their base by acquiring credits and alloy and deploying various buildings. Troops and vehicles can be upgraded through the Research Lab. Special hero units can be created in the game. These heroes are unique to each side. For example, players on the side of the Rebel Alliance can recruit Han Solo, Chewbacca, Princess Leia, Luke Skywalker and R2-D2. The Empire can recruit Darth Vader, Elite AT-AT, Royal Guard and Veteran AT-ST."}, {"tag": "h2", "text": "Campaign"}, {"tag": "h2", "text": "Buildings"}, {"tag": "h2", "text": "Starships"}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The game was announced on the Tumblr page of its publisher, Disney Interactive, on June 24, 2014. It had a limited release in certain markets, including Australia, followed by a general release on the iOS platform on August 21, 2014 and a subsequent release on the Android and Windows 8 platforms on September 18, 2014. However, the Windows servers and Apple/Android servers are separate from each other, preventing players from interacting across servers."}, {"tag": "p", "text": "A \"hackathon\" was held in mid-October 2014 in which developers of the game brainstormed ideas for new features. The best-in-show feature was \"faction flipping,\" which would allow players to create a secondary account through which they could play for the side they had not chosen previously, either the Empire or the Rebellion, without having to restart the game, retaining all progress on the current account. The people's-choice winner was traps, such as a sarlacc pit that would swallow troops that came too close."}, {"tag": "p", "text": "On August 21, 2018, it was announced that Disney was handing over operations of Star Wars: Commander to editor Zynga and that its subsidiaries NaturalMotion will assume the continuity of live services."}, {"tag": "p", "text": "On March 13, 2020, it was announced in-game that the game was to close on June 12 2020, 11 am GST, with all in-app purchases disabled and the game removed from the app stores."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}