{"url": "Star_Wars:_Darth_Vader_(2015)", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader (Marvel)"], "nodes": [{"tag": "h1", "text": "Star Wars: Darth Vader (2015)"}, {"tag": "p", "text": "Star Wars: Darth Vader is a Star Wars comic book series written by Kieron Gillen, with art by Salvador Larroca. Marvel Comics began publishing the comics on February 11, 2015, and the series concluded with its twenty-fifth issue in October 2016. The story centers on the character Darth Vader between the events of Star Wars: Episode IV A New Hope and Star Wars: Episode V The Empire Strikes Back."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Editor Jordan D. White offered Kieron Gillen a chance to write a Star Wars comic. Feeling apprehensive, Gillen almost turned it down, but decided to accept it, even dropping out of writing Iron Man to take the assignment. Gillen acknowledged out of Marvel's current stable of writers, he was the most experienced in exploring the nature of evil and villainy, and therefore a suitable choice for Darth Vader."}, {"tag": "p", "text": "Furthermore, The Empire Strikes Back was the first film he saw in the cinema, and now \"I get to do the story of Darth Vader from the end of the first Star Wars film to the start of The Empire Strikes Back! It's a big story too. It's not just that I want to write Darth Vader. It's that I get to write this story of Darth Vader and it's all in canon. As far as Lucasfilm is concerned, this is what happened.\""}, {"tag": "p", "text": "He rewatched the films and noted small details he found pivotal, like the fact viewers do not see Vader discovering he has a son and that the Emperor lied to him, or that he begins The Empire Strikes Back in a stronger position despite being partly responsible for the destruction of the Death Star."}, {"tag": "p", "text": "Gillen cited inspiration from I, Claudius, The Godfather, and the TV series House of Cards in portraying the internal machinations of the Empire. If Jason Aaron's concurrent Star Wars comic depicts Vader on \"a Tuesday,\" then Gillen's series shows the relatively mundane politics he must grapple with during the rest of the week. He mentioned Vader's antagonists include the military officials who do not believe in the Force."}, {"tag": "p", "text": "To overcome having a potentially monochromatic comic set in the Empire's corridors of power, Gillen has decided to emphasize the galaxy's underworld, explaining Vader's summoning of the bounty hunters in The Empire Strikes Back demonstrated the character is a \"micro-manager\" who knows these individuals personally."}, {"tag": "p", "text": "Gillen explained writing Vader was challenging because giving him an internal monologue would undermine his \"looming, threatening monolith[ic]\" presence, but the comic was also about his emotional journey, so it had to be \"[sold] visually.\" He likened writing Vader to writing a Punisher comic, where there can be humor with a terrifying protagonist as the straight man."}, {"tag": "p", "text": "Gillen also wanted to remind the reader that Vader was adept at building droids in the prequel trilogy, thereby showing \"the passion of Anakin shining through.\" He acknowledged both Salvador Larroca and Adi Granov are Iron Man veterans, explaining \"They're both people who really know their hardware. They both come from a photo realist tradition, but at the same time they're entirely capable of drawing convincing machines. Those are useful talents when you're doing a book that is A) cinematic and B) technical.\""}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}