{"url": "Star_Wars:_Empire_at_War", "categories": ["Category:Real-world articles", "Category:2006 computer and video games", "Category:Legends computer games", "Category:RTS games"], "nodes": [{"tag": "h1", "text": "Star Wars: Empire at War"}, {"tag": "p", "text": "Star Wars: Empire at War (sometimes abbreviated EaW) is a real-time strategy (RTS) game that takes place in the Star Wars universe. Promising to end the perceived mediocrity of past Star Wars RTS games (like Star Wars: Force Commander and Star Wars: Galactic Battlegrounds), Empire at War started from the ground up."}, {"tag": "p", "text": "The game was developed by Petroglyph, comprising many former members of Westwood Studios (known for the Command & Conquer series). Petroglyph developed a completely new engine specifically for EaW known as Alamo. It uses several higher-end shader effects such as soft shadows, specular lighting, and particle effects for dust clouds and explosions."}, {"tag": "p", "text": "The game spawned an impressive mod community, and was followed up by an expansion pack, Star Wars: Empire at War: Forces of Corruption, taking place between the aftermath of the Battle of Yavin and the Battle of Endor."}, {"tag": "h2", "text": "Opening Crawls"}, {"tag": "h3", "text": "Rebel Alliance Campaign"}, {"tag": "h3", "text": "Galactic Empire Campaign"}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "The game features a brand new style of play to make things a bit more realistic. Instead of building workers, gathering resources, and recruiting individual units, players are granted resources based on how many planets the player controls. Controlling worlds increases a player's cash flow and provides unique bonuses depending on the planet (e.g., Armor increases, discounted prices, special unit production)."}, {"tag": "p", "text": "Battles are carried out both on a planet's surface and in orbit. Whoever controls the planet's surface, controls the planet itself. There are different factors to keep in mind depending on your status as an attacker or defender. Attackers must secure Reinforcement Points to increase the number of units they deploy, while Defenders may deploy up to 10 \"units\" on a planet immediately. Attackers have their advantages, though. They may call in bombing runs if they have Bombers in orbit. Likewise, ground-based installations (like the Ion cannon and Hypervelocity gun) can fire upon units in orbit during space tactical battles. Unlike in Star Wars: Galactic Battlegrounds, shields will form an actual physical barrier that must be penetrated and protect bases from artillery and bombing runs. Assorted building pads litter the playing field in both space and land battles. These pads allow the player to build useful structures (e.g., turrets which can easily destroy enemy units, bacta healing stations)"}, {"tag": "p", "text": "Empire at War takes place between Episode III and Episode IV, concluding with the construction and possible destruction of the Death Star. Empire at War features three factions, although only two are playable. These factions are the Rebel Alliance, the Galactic Empire, and the Black Sun (playable with XML modding; see below). Units in this game are a mix of Clone Wars–era and New Order–era. The Empire's advantages include powerful ships and swarms of TIE Fighters, while the Rebels, on the other hand, must rely on swifter ships and Raid Fleets (small ground troop fleets that can bypass space defenses). Like many RTS games, Empire at War features a \"Rock-Paper-Scissors\" unit usage style—for every unit there is a counter-unit. Brett Tosti, the LucasArts producer, has stated that this encourages players to create diverse armies and fleets with units that counter other units, as opposed to building a bunch of \"super units.\""}, {"tag": "p", "text": "Players are also able to call on reinforcements during battle, including heroes like Darth Vader and Obi-Wan Kenobi. Players can also construct planet-borne ion cannons, factories, and space stations. Over forty locales are featured including Yavin 4, Tatooine, Dagobah, and others from the movies and Expanded Universe."}, {"tag": "p", "text": "The destruction of Alderaan cannot be prevented regardless of the player's actions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Hidden Items"}, {"tag": "p", "text": "The following are units and planets that were removed for the final version and are hidden or mentioned in the internal game files. Some have been unlocked via XML and MEG editing. A few of these planets (such as Kamino) & units (such as Luke Skywalker) were included in the expansion pack."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Missions"}, {"tag": "h3", "text": "Rebel"}, {"tag": "h3", "text": "Imperial"}, {"tag": "h2", "text": "Endings"}, {"tag": "p", "text": "There are two different endings to Empire at War's campaign mode depending on the side the player chooses to fight for. The end of the Rebel campaign closely follows the canonical ending of Episode IV. A cutscene shows Luke Skywalker's X-Wing destroying the Death Star and the award ceremony that follows afterwards. However, this ending should not necessarily be treated as canonical, as the final battle with the Death Star can take place over any planet in the game. Moreover, it is still possible for the Rebellion to \"win,\" even if the Empire destroys other planets besides Alderaan, including Yavin 4."}, {"tag": "p", "text": "The end of the Imperial campaign is non-canonical, as it is intended to be more of an \"alternate history\" in the vein of the Infinities universe. The ending cutscene depicts Darth Vader leading a ground assault on what is presumed to be the main Rebel base, the Rebel defenders are quickly crushed as Vader orders his troops to move in. If the player uses the Death Star in the final battle, the game plays a different cutscene where Moff Tarkin successfully fires the superlaser against the last Rebel world. Afterwards, a shuttle is seen flying to the Death Star, flanked by six TIE Fighters. In a scene reminiscent of the Emperor's arrival in Episode VI, an assembly of Imperial troops is shown waiting in one of the battlestation's hangars for the shuttle to land. As the shuttle deposits its contingent of Royal Guards, the Emperor disembarks, greeted by a kneeling Lord Vader. Palpatine congratulates Vader, claiming that the last Jedi and the Rebellion are defeated, and that it is all as he had foreseen."}, {"tag": "p", "text": "Two other non-canon endings can be seen in Galactic Conquest mode. If the Rebels defeat the Empire without destroying the Death Star, or the player loses the game as the Empire, the ending cutscene depicts a pitched space battle over an ecumenopolis, presumably Coruscant. A Rebel fleet closes in on an Imperial Star Destroyer with Darth Vader aboard. As the Imperial defense crumbles, Vader chokes the Star Destroyer's captain for his apparent incompetence and escapes in his TIE Advanced x1 moments before the ship is destroyed. From there, the same award ceremony cutscene follows that was in the campaign ending. Also, if the Empire destroys the last Rebel planet/one with Mon Mothma on it, the battle will be replaced by the Death Star destroying a planet, followed by the Death Star cutscene."}, {"tag": "h2", "text": "Modding"}, {"tag": "p", "text": "As revealed in early press releases and interviews, EaW is marginally open source—with much of the game being controlled through text files (*.txt), XML files (*.xml), DAT files (*.dat), and Lua (*.lua). Anyone with the knowledge and software needed to alter these files can do so."}, {"tag": "p", "text": "The text files are easily edited in most text-editing programs and control the unique ship names that appear on many of the capital ships as well as a fair amount of the stories used throughout the Galactic Conquest mode. The XML files control much of the data responsible for the appearance and behavior of units and buildings. These files are often, by default, launched in a web browser which allows for viewing only. WYSIWYG web editors (e.g., Microsoft Expression Web or Adobe Dreamweaver), text editors such as Notepad, or proprietary XML editors can edit XML (though the latter two are most common due to their relative ease of use)."}, {"tag": "p", "text": "DAT files require software capable of reading the information embedded within. In Empire at War, DAT files store almost all of the text found within the game. Lastly, the Lua files are used primarily for high-level scripting and AI. The decompiled files come with the Map Editor, and can replace the scripts in the EAW directory without having to compile them."}, {"tag": "p", "text": "It is now possible to create new ground and space maps with the map editor released by Petroglyph. Included in the map-editor download is a plug-in for 3ds Max 6 that can export models into .alo format used by the Alamo engine. However, 3ds Max 8 users who patch their software to the Service Pack 3 version are able to use the separately released 3ds Max 8 exporter in conjunction with the shaders provided with the map editor. Modified shaders created by EaW modder Mike.nl fixes an issue where the models in the viewports using Rskn shaders are invisible. 3ds Max 8 SP 3 is also necessary in order to use the exporter included with the Forces of Corruption map editor."}, {"tag": "p", "text": "The community has been pressing forward in terms of modding, going so far as to implement diplomacy, create new particles, and even have detachments of transports assigned to a specific fleet in Galactic Conquest mode. There exist some fan-made programs to assist with the editing of what can be edited, such as an .alo file viewer and importer."}, {"tag": "h2", "text": "Demo"}, {"tag": "p", "text": "Before the full game, a demo version was released. It consists of one Galactic Conquest mode not featured in the full version. In this mode only three planets and a few units are available. The story is set some time after the establishment of Echo Base on Hoth as the Rebel Alliance learns about an Imperial base in the Vergesso asteroid belt. Fearing that it may detect their presence, the Rebels send Han Solo to deal with it. After the base is destroyed, Han is sent on a mission to liberate Tatooine. There he finds out that the Imperial forces are commanded by Boba Fett. The demo ends after the player captured the planet. This may contradict other sources as Tatooine appears under Imperial control until after the Battle of Endor, though it is possible that the planet was contested or recaptured at a later date."}, {"tag": "h2", "text": "Expansion pack"}, {"tag": "p", "text": "An expansion pack was announced at E3 May 9, 2006. It adds 40 new units, 13 planets, a new faction and new warfare and features. It was released October 24 in the U.S. and October 27 in Europe."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The game has several inconsistencies with established canon. Some of those in the following list may be an issue of game balance or mechanics."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Empire at War was well received by fans, and many considered it the best of the Star Wars RTS games. Gamespot called the game \"the RTS fans had been waiting for.\" Others were disappointed that a sequel to Rebellion had not been made. Some critics, at the worst, claimed the game to be shallow and repetitive, while others considered it fun but basic."}, {"tag": "p", "text": "The game holds an overall rating of 79 on Metacritic. Individual websites such as Gamespot praised the game's \"epic-looking battles,\" \"spot-on sound effects,\" and contrasting gameplay styles between the two factions, the Rebellion and the Empire. However, the game was not without fault, as Gamespot found the battles somewhat repetitive and the land battles lacking compared to other facets of gameplay. Another popular gaming website, IGN, reviewed the game, giving it a 7.6/10. They said that it provided \"an authentic Star Wars experience,\" relating the experience to playing with Star Wars action figures as a child. IGN also complained of the game's repetitiveness and relative lack of variety, although recognized that the game's creators were somewhat hampered by the setting."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}