{"url": "Star_Wars:_Droid_Factory_(toy_line)", "categories": ["Category:Real-world articles", "Category:Disney toy lines", "Category:Hasbro toy lines"], "nodes": [{"tag": "h1", "text": "Star Wars: Droid Factory (toy line)"}, {"tag": "p", "text": "Star Wars: Droid Factory was a toy line that started out as part of Hasbro's The Legacy Collection in 2008, and was later revived in 2012 as a separate toy line exclusive to Disney Parks."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The original version of Droid Factory was a \"Build-A-Droid\" system, in which each figure featured a piece to collect and create a unique astromech or protocol droid. The concept was launched with a series of Wal-Mart exclusive two-packs where pieces from all six packs combined to build C-3PX, and a later 2009 release that built a Phase III dark trooper. Hasbro planned to release another Droid Factory line that was initially cancelled, and then released those unused figures later in one set exclusive to Amazon in 2013, and another available at retail in 2015. Those sets' parts built TC-70."}, {"tag": "p", "text": "In 2012 Disney revived the concept at their theme parks, this time allowing visitors to buy their own customized astromech droid action figures by choosing from varied interchangeable parts, including some Disney-themed hats. The line was separate from The Legacy Collection and made no mention of Hasbro on the packaging. The initial 2012 assortment included the Star Tours logo on the packaging, but those that followed did not. Many characters already existing in Star Wars fiction could be created with the available parts. The introduction coincided with the opening of Star Tours: The Adventures Continue, and new part assortments were added in 2013 and 2015. At the 2017 Star Wars Celebration in Orlando, Florida, a new series of Build-A-Droid protocol droids debuted."}, {"tag": "p", "text": "The line also added already-assembled exclusive figures with holiday- and event-themed astromech droids. Four-figure sets based on current films and the Star Wars: The Clone Wars television series were released from 2015 to 2019."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The original Droid Factory toys were notable for including a number of Legends droids and other characters, for the first time represented in action figure form."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}