{"url": "Star_Wars:_Dawn_of_the_Jedi:_The_Prisoner_of_Bogan", "categories": ["Category:Real-world articles", "Category:Star Wars: Dawn of the Jedi story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Dawn of the Jedi: The Prisoner of Bogan"}, {"tag": "p", "text": "Star Wars: Dawn of the Jedi: The Prisoner of Bogan is a five-issue comic book miniseries, the second arc in the Star Wars: Dawn of the Jedi comic series that is set in the Pre-Republic era and focuses on the Je'daii Order, the Jedi Order's predecessors. Published by Dark Horse Comics through winter 2012 and spring 2013, Dawn of the Jedi: The Prisoner of Bogan is written by John Ostrander and pencilled by Jan Duursema, the creative team behind the critically-acclaimed Star Wars: Legacy series. The Prisoner of Bogan is primarily set in the year 25,793 BBY, in a time before the polarization of the light and dark sides of the Force, and it picks up several weeks after the events of the previous arc, Force Storm. The miniseries centers on Xesh and his uneasy alliance with the mad former Je'daii Daegen Lok—the titular prisoner of the moon Bogan—who enlists Xesh's aid in escaping Bogan and constructing Forcesabers in an attempt to prove the vision he had years earlier to be true. The two are then pursued by a number of Je'daii across the Tython system. The arc was collected in the trade paperback Star Wars: Dawn of the Jedi Book Two—Prisoner of Bogan, which was released on July 24, 2013, and was followed by the Force War arc in late 2013."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Several weeks after his arrival on Tython, Xesh is assaulted by Daegen Lok on the moon of Bogan as a way of testing Xesh's abilities, and Lok then disables Xesh's manacles and tracker before telling of him the vision that had driven him insane many years earlier: an army of dark warriors carrying blades of fire. When Xesh identifies that weapon as a Forcesaber, Lok convinces him to build more Forcesabers so that he can prove his vision to the Je'daii, and the two use a Pho-V fighter that Lok has hidden to escape Bogan after Xesh restores the ship's power with his Force lightning. Temple Master Tem Madog of Vur Tepe, the Je'daii Forge, tests the Forcesaber, but gives it to Hawk Ryo when the Ranger proves himself capable of wielding the blade. When Xesh's absence from his compound on Bogan is detected, a team of Je'daii—Temple Master Jake Fenn, Rangers Bel Zana, Ryo, and Rori Fenn, and Shae Koda and Sek'nos Rath—are sent to the moon to locate him."}, {"tag": "p", "text": "Xesh and Lok arrive at the crystal planet of Krev Coeur in their failing starship, which forces them to parachute to the surface and begin their search for the proper crystals. On Bogan, the Je'daii search for Xesh, and they discover evidence of Lok's starfighter and carvings he drew of his vision. Hawk Ryo admits to the fact that he shared the vision with Lok when the two friends were exploring the Chasm, and the Je'daii realize that Lok is seeking to construct Forcesabers, so half of the Je'daii pursue the two fugitives to Krev Coeur while the others head to the factory world of Nox. At the same time, the Force Hound Trill arrives in the system, having followed Xesh. Ranger Bel Zana attempts to capture Xesh and Lok when she locates them, but Lok manipulates her mind to incapitate her by preying on her fear of fire. Master Fenn and Sek'nos Rath arrive to aid Zana, but their fight goes sideways when Lok, sensing Fenn's feelings for Zana, casts her off of the nearby cliff, and Rath seemingly falls to his death saving her as Xesh and Lok escape."}, {"tag": "p", "text": "On Nox, Xesh completes the two Forcesabers and Lok attempts to recruit Hadiya's former generals in his effort to conquer the Je'daii. Shae Koda helps track down Xesh, but he captures her after rescuing her from a dianoga that interrupted their fight. Xesh and Lok then escape with their new prisoner and head to the planet Shikaakwa to try and gather an army there. Rath is saved from death by Trill, who claims to be a ship thief, and Trill helps him head to Shikaakwa to meet up with the other Je'daii. Meanwhile, Tasha Ryo attempts to identify the remains of a Rakata who died in the Devourer crash, but her efforts in the Je'daii Library in Kaleth yield no results until Master Ters Sendon shows her the Kwa Holocron—an ancient holocron left on Tython by the Kwa species that activates in Ryo's presence. The holocron's gatekeeper, A'nang, identifies the mysterious skull as that of a Rakata, and with the help of Master Rajivari, the Je'daii convince A'nang to tell them more about the Rakata. The Kwa explains that long ago, his species traveled the galaxy with their Infinity Gates and taught species about the Force, but the Rakata used the Kwa's knowledge to forge an Infinite Empire based on the dark side."}, {"tag": "p", "text": "On Shikaakwa, Lok, Xesh, and a captive Shae Koda meet with Baron Volnos Ryo, Hawk's brother and Tasha's father, who helped Lok infiltrate the Despot Army and kill Hadiya during the Despot War after Hadiya killed Ryo's father. Lok's attempts to enlist Ryo's aid turn sour quickly, and the arrival of the Je'daii turn the encounter into an all-out battle. Sek'nos Rath attacks Xesh and attempts to free Koda, but he fails, and Trill is pleased to see that the memory blocks Predor Skal'nas placed in Xesh's mind are working—the Force Hound does not recognize his former brood mate when the two see each other during the fighting. Hawk Ryo and Lok begin their own fighting, but with the arrival of Xesh, Lok gains the upper hand just as Shae Koda frees herself from her restraints and rushes to Ryo's aid. Koda's pleas for Xesh to choose his own path and not be a slave to Lok reach the Force Hound, who turns on the power-hungry Lok and helps the Je'daii capture him. With the news that the Rakata are likely coming to the Tython system, the Je'daii begin to manufacture Forcesabers despite the weapon's reliance on the dark side, and the Je'daii prepare for war as Xesh is trained as a Je'daii and Lok is imprisoned on Bogan once more. Unbeknownst to the Je'daii, Trill sends a message to her master, who prepares the forces of the Infinite Empire for war."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "While creating each arc of Dawn of the Jedi, John Ostrander and Jan Duursema work on the entirety of each arc together instead of one at a time. John Ostrander and Jan Duursema write the story for the series, while Ostrander pens the script and Duursema pencils the artwork. Dan Parsons was the inker for the series, Michael Heisler the letterer, and Wes Dzioba handles coloring duties. The series' cover art was drawn by David Michael Beck."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "When developing the ships, characters, and environments for the series, Jan Duursema was forced to virtually work from scratch, as very little of the Before the Republic era had been depicted previously. Duursema purposely differentiated the Je'daii from the Jedi in their appearance, exchanging lightsabers for the swords they were known to use at the time and replacing the traditional robes with more individualized armor and clothing. Unlike her work on Star Wars: Legacy, Duursema was unable to build on existing designs for ships and technology, and instead she worked from a \"retrofitting\" mindset, developing ships and technology that would eventually give rise to the technology of the modern Star Wars era. Duursema and Ostrander also created the worlds of the Tython system from scratch, choosing to focus only on the Tython system instead of using pre-existing locations from across the galaxy."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}