{"url": "Star_Wars:_Doctor_Aphra_(2016)", "categories": ["Category:Real-world articles", "Category:Star Wars: Doctor Aphra"], "nodes": [{"tag": "h1", "text": "Star Wars: Doctor Aphra (2016)"}, {"tag": "p", "text": "Star Wars: Doctor Aphra is a comic book series that began publication on December 7, 2016. It was originally written by Star Wars: Darth Vader scribe Kieron Gillen. It was then briefly co-written by him and Simon Spurrier before writing duties were transferred fully to Spurrier after Remastered. The series was first teased on September 19, 2016, before being officially announced on October 12, 2016."}, {"tag": "p", "text": "The series takes place between Star Wars: Episode IV A New Hope and Star Wars: Episode V The Empire Strikes Back — mainly on the galactic frontier—and follows from the conclusion of Star Wars: Darth Vader. It focuses on the titular character, \"rogue archaeologist\" Doctor Chelli Lona Aphra, her droid duo, the \"murderbots\" Triple-Zero and Beetee-One, Wookiee bounty hunter Black Krrsantan, and Vulaada Klam, Aphra's side-kick later in the series."}, {"tag": "p", "text": "Designed to be the moral inverse of Indiana Jones, the misadventures of her and her eponymous crew are a dark reflection of the adventures of the mainline series' heroes."}, {"tag": "p", "text": "The current run concluded in its fortieth issue on December 11, 2019. A relaunch is planned for April 2020 under the same title—written by Alyssa Wong and with art by Marika Cresta—the events of that series will continue Aphra's story between Star Wars: Episode V The Empire Strikes Back and Star Wars: Episode VI Return of the Jedi."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "In 2019, Star Wars: Doctor Aphra was nominated for the GLAAD Media Award for Outstanding Comic Book. The series was again nominated for the Outstanding Comic Book award in 2020 and won. The award was accepted by Si Spurrier at the 31st GLAAD Media Awards presentation, which took place on July 30, 2020."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}