{"url": "Star_Wars:_Empire_and_Rebellion", "categories": ["Category:Real-world articles", "Category:Book stubs", "Category:Star Wars: Empire and Rebellion"], "nodes": [{"tag": "h1", "text": "Star Wars: Empire and Rebellion"}, {"tag": "p", "text": "Star Wars: Empire and Rebellion is a novel duology in the Star Wars Legends continuity. The series includes the stories Razor's Edge and Honor Among Thieves, written by Martha Wells and James S. A. Corey, respectively. Empire and Rebellion was originally set to include the Kevin Hearne novel Heir to the Jedi as well, but following the Lucasfilm declaration of April 25, 2014 that established the Expanded Universe as non-canon, Heir to the Jedi was designated as being separate from Empire and Rebellion, relegating the series to a duology. The series storyline focuses on Rebel Alliance figures Leia Organa and Han Solo during the Galactic Civil War, with the novels serving as independent adventures for each character."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Empire and Rebellion stands as a duology—the novels Razor's Edge (September 2013) and Honor Among Thieves (March 2014). On April 25, 2014, Lucasfilm declared the Expanded Universe to be non-canon, organized under the new Legends banner, in preparation for the Star Wars sequel trilogy. This decision relegated the Empire and Rebellion series to Legends status."}, {"tag": "p", "text": "Originally, Empire and Rebellion was to be a trilogy of stories focusing on the characters Luke Skywalker, Han Solo, and Leia Organa, with each novel of the series centering on a specific character. The 2015 novel Heir to the Jedi, by Kevin Hearne, was to be the series' third volume. However, in light of Lucasfilm declaring the Expanded Universe non-canon, Del Rey announced that Heir to the Jedi would be released outside of the Empire and Rebellion series, making it one of the first novels in the new Star Wars canon."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}