{"url": "Base_Delta_Zero/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Imperial Codes", "Category:Naval tactics"], "nodes": [{"tag": "h1", "text": "Base Delta Zero"}, {"tag": "p", "text": "Base Delta Zero was the naval code used by the Galactic Republic and Galactic Empire to order the complete surface destruction of a planetary target, eliminating all life, industry, and natural resources on the surface. Similar actions were known to have been carried out by the reconstituted Sith Empire and the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Defined as \"the systematic complete destruction of all 'assets' of production, including factories, arable land, mines, fisheries, and all sentient beings and droids\", Base Delta Zero denoted the most severe of several levels of destruction that could be directed against a center of resistance, and involved laying waste to an entire planet by orbital bombardment, reducing the upper crust of a planet to molten slag or in some cases, atomizing the planet's top-soil."}, {"tag": "p", "text": "A Base Delta Zero fleet bombardment was regarded as one of the most devastating operations that the Imperial Military was capable of, and unlike other Imperial military codes, the designation was not subject to change, so that there was never any confusion when it was issued. Due to its effects, BDZs were considered a last resort."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Devastating planetary bombardments were recorded from the earliest millennia of galactic history. For instance, the Infinite Empire laid waste to Tatooine before the dawn of the Old Republic, and around 4000 BBY, Yavin 4 was devastated by firestorms created by Force energy, while the Sith forces in the Jedi Civil War obliterated the surfaces of Telos IV in 3958 BBY and Taris in 3956 BBY. But these atrocities paled before the power of a Base Delta Zero operation. Even hardened Imperial officers who were well versed in invasion operations found the tactic unsettling. Some saw it worse than destroying the planet outright."}, {"tag": "p", "text": "It is not known when the Republic Navy introduced the Base Delta Zero code, but during the Clone Wars, the order gained new notoriety when Republic fleets were used to destroy Separatist armies entrenched deep underground."}, {"tag": "p", "text": "Under the New Order, Base Delta Zero operations continued to be mounted primarily against targets that the Imperial Army had failed to gain control of by direct assault, but such missions acquired increasingly punitive overtones, being used against rebellious planets where the Empire judged a ground assault would incur too many Imperial casualties, or simply where forces were not available to mount a direct attack. As few as three Imperial-class Star Destroyers could execute such operations in a \"matter of hours.\""}, {"tag": "p", "text": "In 19 BBY, Imperial warships used the BDZ tactic on the planet Caamas. However, Imperial involvement was suspected only and could not be proven until the Caamas Document was discovered in 19 ABY. In 4 BBY, Moff Sarn Shild gave a Base Delta Zero command targeting the smugglers' haven of Nar Shaddaa. This order was not carried out because of the Imperial defeat at the Battle of Nar Shaddaa.\nAnother notorious Imperial-era atrocity, the bombardment of Emberlene, was often blamed on the Empire by the locals despite having nothing to do with it. At one point, the Assertor-class Star Dreadnought Wrath led a Base Delta Zero operation, which involved various TIE/D Defender squadrons, some Imperial-class Star Destroyers, and at least one Interdictor-class Star Destroyer. Storm Commandos were known to assist in these operations, usually to destroy a specific target, such as a shield generator.[source?]"}, {"tag": "p", "text": "In addition to naval bombardment, army missions with the same objective as a Base Delta Zero command were undertaken to combat the enemies of the Empire. The mercenary unit First Sun Mobile Regiment was often hired by the Galactic Empire to destroy all enemy assets similarly to a BDZ bombardment."}, {"tag": "p", "text": "The Empire continued to use devastating bombardment tactics, for instance at Milagro, and some of these may have been Base Delta Zeroes; but the New Republic rejected planetary bombardment missions outright, until Operation Emperor's Hammer during the Battle of Borleias in 28 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}