{"url": "Star_Wars:_Episode_II_Attack_of_the_Clones_(novelization)", "categories": ["Category:Real-world articles", "Category:Clone Wars novels", "Category:Film novelizations"], "nodes": [{"tag": "h1", "text": "Star Wars: Episode II Attack of the Clones (novelization)"}, {"tag": "p", "text": "The Star Wars: Episode II Attack of the Clones novelization by R. A. Salvatore, published by Del Rey on April 23, 2002, is the official novel adaptation of the film Star Wars: Episode II Attack of the Clones. It includes expansion of scenes from the movie, many scenes cut from the movie, and several original scenes. The paperback edition includes 32 pages of storyboard art from the First Battle of Geonosis, an introduction by Rick McCallum, and a preview of Matthew Stover's novel Shatterpoint. Narration for the audio version was performed by Jonathan Davis."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Hardcover"}, {"tag": "p", "text": "There is a great disturbance in the Force…. From the sleek ships of the glimmering Coruscant skyscape to the lush gardens of pastoral Naboo, dissent is roiling. The Republic is failing, even under the leadership of Supreme Chancellor Palpatine, elected ten years earlier to save the crumbling government. Separatists threate war, and the Senate is hopelessly divided, unable to determine whether to raise an army for battle or keep the fragile peace. It is a stalemate that, once broken, could lead to galactic chaos."}, {"tag": "p", "text": "Mischievous and resolved, courageous to the point of recklessness, Anakin Skywalker has come of age in a time of great upheaval. The nineteen-year-old apprentice to Obi-Wan Kenobi is an enigma to the Jedi Council, and a challenge to his Jedi Master. Time has not dulled Anakin's ambition, nor has his Jedi training tamed his independent streak. When an attempt on Senator Padmé Amidala's life brings them together for the first time in ten years, it is clear that time also has not dulled Anakin's intense feelings for the beautiful diplomat."}, {"tag": "p", "text": "The attack on Senator Amidala just before a crucial vote thrusts the Republic even closer to the edge of disaster. Masters Yoda and Mace Windu sense enormous unease. The dark side is growing, clouding the Jedi's perception of the events. Unbeknownst to the Jedi, a slow rumble is building into the roar of thousands of soldiers readying for battle. But even as the Republic falters around them, Anakin and Padmé find a connection so intense that all else begins to fall away. Anakin will lose himself—and his way—in emotions a Jedi, sworn to hold allegiance only to the Order, is forbidden to have."}, {"tag": "h3", "text": "Paperback"}, {"tag": "p", "text": "Courageous to the point of recklessness, and possessing a wild independent streak, twenty-year-old Anakin Skywalker, apprentice to Obi-Wan Kenobi, is coming of age in a time of great upheaval. The attempted assassination of Senator Padmé Amidala before a crucial vote thrusts the Republic even closer to the edge of disaster. Unbeknownst to the Jedi, a low rumble of discontent is building into the roar of thousands of clone soldiers readying for the ultimate fight. The dark side is growing. Masters Yoda and Mace Windu sense enormous unease…for the fiercest battle of dark versus light is fast approaching, threatening to consume them all in a tidal wave of war."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h3", "text": "Differences between the movie and the novel"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "International"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}