{"url": "3B3-1204", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:B1 battle droids", "Category:Trade Federation military members"], "nodes": [{"tag": "h1", "text": "3B3-1204"}, {"tag": "p", "text": "3B3-1204 was a Trade Federation B1-Series battle droid in the service of Viceroy Nute Gunray's Droid Army. In 32 BBY, 3B3-1204 was a part of the force that invaded and later occupied the world of Naboo, at Gunray's behest. The droid and his unit were stationed in the Theed Hangar to guard the personal starship of the planet's queen, Amidala. 3B3-1204 and the rest of his unit were soon after destroyed by Jedi Master Qui-Gon Jinn."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "3B3-1204 was a B1-Series battle droid serving in the Trade Federation Droid Army. He was a part of the force brought by Viceroy Nute Gunray to the planet of Naboo in 32 BBY as a protest against the Galactic Senate's new taxation of trade routes. When Gunray had the planet invaded, he installed an occupation force, of which 3B3-1204 was a part. 3B3-1204's unit occupied the Theed Hangar, where they guarded Naboo Queen Amidala's J-type 327 Nubian royal starship. Several of the Naboo Royal Space Fighter Corps pilots had been captured, and were being held in the hangar as well."}, {"tag": "p", "text": "Shortly after the occupation took place, a group, including Amidala, led by Jedi Master Qui-Gon Jinn, entered the hangar. Jinn spoke directly with 3B3-1204's OOM command battle droid 2163, stating that he was taking the party to Coruscant. Meanwhile, 3B3-1204 had anti-Jedi tactics programmed into him remotely by the Federation's flagship, Saak'ak. He then began uploading the program to the rest of the unit, but Jinn had already drawn his lightsaber, which he used to attack the droids. 3B3-1204 was beheaded by Jinn's first stroke, before he could finish his upload. Jinn and his party, among them Amidala, were then able to seize the royal starship and depart the planet."}, {"tag": "h2", "text": "Features and functions"}, {"tag": "p", "text": "3B3-1204 had white plating, black photoreceptors, masculine programming, and, like all B1 battle droids, stood 1.91 meters tall. 3B3-1204 had the ability to receive programming from the Trade Federation flagship remotely while in the middle of a situation. He also had the ability to remotely upload his programming to his fellow battle droids himself. 3B3-1204 was also equipped with an E-5 blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "3B3-1204 first appeared in George Lucas' 1999 film Star Wars: Episode I The Phantom Menace as an unnamed battle droid. The character was later identified in the Theed Palace Limited expansion set of the Star Wars Customizable Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}