{"url": "Star_Wars:_Episode_IV_A_New_Hope", "categories": ["Category:Real-world articles", "Category:Semi-protected articles", "Category:Move protected articles", "Category:Articles with an excess of redlinks", "Category:Pages needing citation", "Category:Saga films", "Category:1977 releases"], "nodes": [{"tag": "h1", "text": "Star Wars: Episode IV A New Hope"}, {"tag": "p", "text": "Star Wars: Episode IV A New Hope, originally released as Star Wars, and currently marketed as simply Star Wars: A New Hope is a 1977 film written and directed by George Lucas. It is the first film in the Star Wars original trilogy."}, {"tag": "p", "text": "The film is set nineteen years after the formation of the Galactic Empire; construction has finished on the Death Star, a weapon capable of destroying a planet. After Princess Leia Organa, a leader of the Rebel Alliance, receives the weapon's plans in the hope of finding a weakness, she is captured and taken to the Death Star. Meanwhile, a young farmer named Luke Skywalker meets Obi-Wan Kenobi, who has lived in seclusion for years on the desert planet of Tatooine. When Luke's home is burned and his aunt and uncle killed, Obi-Wan begins Luke's Jedi training as they—along with Han Solo, Chewbacca, C-3PO, and R2-D2—attempt to rescue the princess from the Empire."}, {"tag": "p", "text": "Inspired by films like the Flash Gordon serials and the samurai films of Akira Kurosawa, as well as such critical works as Joseph Campbell's The Hero with a Thousand Faces and Frank Herbert's Dune books, Lucas began work on Star Wars in 1974. Ground-breaking in its use of special effects, this is considered to be among the most successful—and most influential—films of all time. Produced with a budget of US$11,000,000 and released on May 25, 1977, the film became one of the most successful of all time, earning $215 million in the United States and $337 million overseas during its original theatrical release, as well as winning several film awards, including 10 Academy Award nominations. It was re-released several times, sometimes with significant changes; the most notable versions were the 1997 Special Edition and the 2004 DVD, which were modified with CGI effects and recreated scenes. It was re-released in the Blu-ray format in September of 2011. The film was selected to be preserved by the Library of Congress as part of its National Film Registry. The film was selected in 1989, the program's first year in existence."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Synopsis"}, {"tag": "h3", "text": "Assault on Tantive IV"}, {"tag": "p", "text": "Nineteen years after the formation of the Galactic Empire, the galaxy is in a state of civil war. The Rebel Alliance has won their first major victory by stealing plans to the Galactic Empire's secret weapon, the Death Star. Hoping that the stolen plans can save her people and restore freedom to the galaxy, Princess Leia Organa, who is in custody of the stolen plans attempts to race home aboard the Tantive IV. However, her ship is intercepted by the Imperial I-class Star Destroyer Devastator over the desert planet of Tatooine."}, {"tag": "p", "text": "Imperial stormtroopers manage to board the ship, and after defeating the small number of guards defending the ship, the Sith Lord Darth Vader arrives to assess the damage. Vader is outraged and questions Captain Antilles, whom he eventually strangles and kills. Hiding on the ship, Princess Leia is spotted by stormtroopers. They shoot her with a stun blast and bring her before Vader. However, before being detained, Leia was able to record a holographic message with the help of R2-D2, and assigned the droid the responsibility of taking the message to a Jedi-in-hiding on Tatooine. Vader orders a message be sent to the Imperial Senate, informing them that the ship was destroyed, with everyone on board killed. R2-D2 and C-3PO use an escape pod in order to escape the ship and reach the planet of Tatooine below."}, {"tag": "h3", "text": "Luke's destiny"}, {"tag": "p", "text": "The droids are bought by moisture farmer Owen Lars and his nephew, Luke Skywalker. R2-D2 escapes from the Lars' homestead in search of an Obi-Wan Kenobi, whom the droid claims to be the property of. Luke and C-3PO find R2 the next day just before they are attacked by Sand people. Luke and his droids are rescued by Obi-Wan Kenobi or, as Luke knows him, Ben Kenobi. Obi-Wan takes Luke to his home."}, {"tag": "p", "text": "Luke receives his father's lightsaber, as Obi-Wan recalls his own friendship with Luke's father. Luke is told that a Jedi named Darth Vader betrayed and murdered his father. After discovering Princess Leia's message carried by R2-D2, Obi-Wan attempts to persuade Luke to accompany him to Alderaan. Luke refuses to go until he discovers that his aunt and uncle were brutally murdered by stormtroopers searching for the droids. Luke, Obi-Wan, and the two droids travel to Mos Eisley to find passage to Alderaan, Princess Leia's home planet."}, {"tag": "p", "text": "For 17,000 credits, 2,000 in advance and 15,000 upon arrival, smuggler Han Solo and his First Mate, a Wookiee named Chewbacca, agree to take the four of them to Alderaan aboard their ship, the Millennium Falcon. After brief scuffles with the Empire and henchmen sent by Jabba the Hutt, the Falcon escapes the Imperial Blockade at Mos Eisley and Han sets a course for Alderaan, unaware that the planet was about to be mercilessly destroyed by the Empire."}, {"tag": "h3", "text": "Rescue of the princess"}, {"tag": "p", "text": "In Alderaan's place, they find what seems to be an asteroid field. The planet was destroyed by the dreaded Death Star, on the orders of Grand Moff Tarkin, to set an example of the power of the Empire. The Millennium Falcon is pulled aboard the Death Star by its powerful tractor beam."}, {"tag": "p", "text": "From hidden smuggling compartments, Solo ambushes two stormtroopers of the Imperial scanning crew. With Han and Luke now disguised as the two stormtroopers, the group begins to figure out how to escape. Obi-Wan separates from the group to disable the tractor beam, leaving the others alone. While connected to the Imperial Network, R2-D2 discovers Princess Leia is aboard the station. Luke convinces Han and Chewbacca to rescue her with the vague promise of a grand reward. Han and Chewbacca reluctantly agree. Luke plans to march into Detention Block AA-23, claiming that Chewbacca is part of a prisoner transfer. C-3PO and R2-D2 are instructed to remain behind, and the trio sets off on their rescue attempt. Luke's plan works flawlessly in that they are quick to subdue the officers and guards in the princess's cell block. Unfortunately, no one thought to plan for their escape, and Leia takes charge, blasting a hole in a nearby grate and jumping through while Han and Luke hold off a squad of stormtroopers. Chewbacca, Luke and Han all dive after the princess into the unknown."}, {"tag": "p", "text": "Unfortunately, the grate covers a chute that leads to a garbage compactor that is also home to a resident dianoga. Soon after landing, the creature pulls Luke under the surface, but releases him and is scared away when the Imperials realize where the heroes escaped to and activate the compactor. As the walls close in on the foursome, Luke desperately calls to C-3PO over his comlink asking for the compactor to be shut down. Leia struggles to get to the top and Chewbacca tries to unlock the door. R2-D2 manages to shut down the compactor just in time, although, amidst the muffled cries of joy over the comlink, C-3PO is briefly convinced that his master and friends have been crushed."}, {"tag": "p", "text": "After escaping from the trash compactor, the group hurries back to the Millennium Falcon, hoping that Obi-Wan has successfully shut down the tractor beam. They encounter stormtroopers on their way to the ship, evading and blasting their way past them."}, {"tag": "h3", "text": "Sacrifice and victory"}, {"tag": "p", "text": "Obi-Wan, on the other hand, was destined to meet with Darth Vader. After a short duel with his former Padawan, Obi-Wan sacrifices himself, thus becoming one with the Force and allowing Luke and the others to escape. Horrified and angered having witnessed Obi-Wan's demise at the hands of Vader, Luke takes his final blasts at the stormtroopers and dashes onto the Millennium Falcon."}, {"tag": "p", "text": "After fighting a squadron of TIE fighters, the Millennium Falcon meets the Rebel Alliance on Yavin 4, and the information in R2-D2 is turned over. General Dodonna plans the attack on the Death Star, an attack so audacious as to receive an unenthusiastic reaction from the pilots. To add to Luke's dismay, Han leaves after receiving his reward."}, {"tag": "p", "text": "The Rebel strike force begins its attack on the Death Star, as the space station approaches the Rebel base on Yavin 4. A group of starfighters assaults a trench on the Death Star's surface to hit the station's vulnerable spot before it can destroy the Alliance's base. During this, most of the Rebel craft, including Luke's friend Biggs Darklighter, are picked off by Imperial fighters led by Darth Vader. Just as Vader opens fire on Luke from his personal TIE Advanced fighter, Han returns in the Millennium Falcon and attacks the Imperials, resulting in Vader's ship getting knocked out of the trench. Luke, aided by the voice of Kenobi and guided by the Force, accurately fires two proton torpedoes into a small exhaust port leading to the Death Star's reactor, and the battle station explodes."}, {"tag": "p", "text": "The few remaining ships (those of Wedge Antilles, Luke, Han, and a Y-wing Pilot) return to Yavin 4 and a victory celebration commences, complete with medals for the heroes, Han Solo and Luke Skywalker, presented by Princess Leia."}, {"tag": "h2", "text": "Development"}, {"tag": "h3", "text": "Conception"}, {"tag": "p", "text": "During post-production on his previous film, American Graffiti, Lucas repeatedly discussed the concept of a \"space opera\" with producer Gary Kurtz. In January 1973 Lucas began work on this, and by May had prepared a 14-page story outline for distribution among film studios. He had originally envisioned the film as being a continuation of both American Graffiti and Apocalypse Now (the latter of which he helped make before Warner Bros. Studios shut down his studio of American Zoetrope and thus forced him to hand over development to his compatriot, Francis Ford Coppola). His note for the basic plotline for the film, which was intended to be a response to the Vietnam War era, was that it involved \"a technological empire going after a small band of freedom fighters.\" According to Walter Murch, a former associate of Lucas when the latter was filming Apocalypse Now, the space opera setting was conceived in large part because, due to the Vietnam War still going on, the audiences would not have been receptive to a direct attack on American involvement in Vietnam. Because of its outer space setting, the story was viewed as science fiction, an unpopular genre at the box office. Lucas later proposed that terms like \"space fantasy\" or \"science fantasy\" better fit the story. He brought the outline to Universal Studios and United Artists; both rejected the project (the former refused directly, while the latter withheld their answer until after the 10 day wait period ended). He also turned to Walt Disney Studios Motion Pictures, though they also turned him down. Lucas disliked the studio system because his previous two films, American Graffiti and THX 1138, had been re-edited without his consent. Still, aware that studios were unavoidable, he pursued Alan Ladd, Jr., the head of 20th Century Fox. Although Ladd did not grasp the technical side of the project, he believed that Lucas was talented. Lucas later stated that Ladd \"invested in me, [but] he did not invest in the movie.\""}, {"tag": "h3", "text": "Production"}, {"tag": "p", "text": "Lucas finished a draft of the screenplay in May 1974. As the draft developed, the characters evolved significantly. Early in development, Luke Skywalker's character changed from a 60-year-old general to a member of a family of dwarfs; the Corellian smuggler, Han Solo, was envisioned as a large, green-skinned monster with gills. Chewbacca was inspired by Lucas' Alaskan malamute dog, Indiana, who often acted as the director's \"co-pilot\" by sitting in the passenger seat of his car. The Force, a mysterious energy field, was initially conceived as the Kyber crystal, a \"galactic holy grail.\" The completed script was too long for one movie; however, Lucas refused to condense it. Instead, he expanded the first third of it into one movie and left the rest for two future films, effectively creating the original Star Wars trilogy."}, {"tag": "p", "text": "Lucas hired conceptual artist Ralph McQuarrie to create paintings of certain scenes during screenwriting. When Lucas delivered his screenplay to the studio, he included several of McQuarrie's paintings. 20th Century Fox approved a budget of $8,250,000; American Graffiti's positive reviews allowed Lucas to renegotiate his deal with Alan Ladd, Jr. and request the sequel rights to the film. For Lucas, this deal protected Star Wars' unwritten segments and most of the merchandising profits."}, {"tag": "p", "text": "In 1975, Lucas founded the visual effects company Industrial Light & Magic (ILM) after discovering that 20th Century Fox's visual effects department had been disbanded. ILM began its work on Star Wars in a warehouse in Van Nuys, California. Most of the visual effects used motion control photography, which creates the illusion of size by employing small models and slowly moving cameras. Model spaceships were constructed on the basis of drawings by Joe Johnston, input from Lucas, and paintings by McQuarrie. Lucas opted to abandon the traditional sleekness of science fiction by creating a \"used universe\" in which all devices, ships, and buildings looked aged and dirty."}, {"tag": "p", "text": "When filming began on March 22, 1976 in the Tunisian desert for the scenes on the planet Tatooine, the project faced several problems.[source?] Lucas fell behind schedule in the first week of shooting due to a rare Tunisian rainstorm, malfunctioning props, and electronic breakdowns. When actor Anthony Daniels wore the C-3PO outfit for the first time, the left leg piece shattered down through the plastic covering his left foot, stabbing him. After completing filming in Tunisia, production moved into the more controlled environment of Elstree Studios, near London. However, significant problems, such as a crew that had little interest in the film, still arose. Most of the crew considered the project a \"children's film,\" rarely took their work seriously, and often found it unintentionally humorous. Actor Kenny Baker later confessed that he thought the film would be a failure. Harrison Ford found the film \"weird,\" in that there was a princess with buns for hair and what he called a \"giant in a monkey suit\" named Chewbacca.[source?] Ford also found the dialogue difficult, saying, \"You can type this shit, George, but you sure can't say it.\""}, {"tag": "p", "text": "Lucas clashed with Director of Photography Gilbert Taylor, whom producer Gary Kurtz called \"old-school\" and \"crotchety.\" Moreover, with a background in independent filmmaking, Lucas was accustomed to creating most of the elements of the film himself. His camera suggestions were rejected by an offended Taylor, who felt that Lucas was over-stepping his boundaries by giving specific instructions. Lucas eventually became frustrated that the costumes, sets and other elements were not living up to his original vision of Star Wars. He rarely spoke to the actors, who felt that he expected too much of them while providing little direction. His directions to the actors usually consisted of the words \"faster\" and \"more intense.\""}, {"tag": "p", "text": "Ladd offered Lucas some of the only support from the studio; he dealt with scrutiny from board members over the rising budget and complex screenplay drafts. After production fell two weeks behind schedule, Ladd told Lucas that he had to finish production within a week or he would be forced to shut down production. The crew split into three units, led by Lucas, Kurtz, and production supervisor Robert Watts, respectively. Under the new system, the project met the studio's deadline. ILM concluded shooting on April 22, 1977 with shot 110P, that of a Star Destroyer."}, {"tag": "p", "text": "Star Wars was originally slated for release in Christmas 1976; however, delays pushed the film's release to summer 1977. Already anxious about meeting his deadline, Lucas was shocked when his editor's first cut of the film was a \"complete disaster.\" After attempting to persuade the original editor to cut the film his way, Lucas replaced the editor with Paul Hirsch and Richard Chew. He also allowed his then-wife Marcia Lucas to aid the editing process while she was cutting the film New York, New York with Lucas' friend Martin Scorsese. Richard Chew found the film had an non-energetic pace; it had been cut in a by-the-book manner: scenes were played out in master shots that flowed into close-up coverage. He found that the pace was dictated by the actors instead of the cuts. Hirsch and Chew worked on two reels simultaneously; whoever finished first moved on to the next."}, {"tag": "p", "text": "During production, the cast attempted to make Lucas laugh or smile as he often appeared depressed. At one point, the project became so demanding that Lucas was diagnosed with hypertension and exhaustion and was warned to reduce his stress level. Post-production was equally stressful due to increasing pressure from 20th Century Fox. Moreover, Mark Hamill's face was injured in a car accident, which made reshoots impossible."}, {"tag": "p", "text": "Meanwhile, ILM was struggling to achieve unprecedented special effects. The company had spent half of its budget on four shots that Lucas deemed unacceptable. Moreover, theories surfaced that the workers at ILM lacked discipline, forcing Lucas to intervene frequently to ensure that they were on schedule. With hundreds of uncompleted shots remaining, ILM was forced to finish a year's work in six months. Lucas inspired ILM by editing together aerial dogfights from old war films, which enhanced the pacing of the scenes."}, {"tag": "p", "text": "During the chaos of production and post-production, the team made decisions about character voicing and sound effects. Sound designer Ben Burtt had created a library of sounds that Lucas referred to as an \"organic soundtrack.\" For Chewbacca's growls, Burtt recorded and combined sounds made by dogs, bears, lions, tigers, and walruses to create phrases and sentences. Burtt created the robotic voice of R2-D2 by filtering his voice through an electronic synthesizer. Darth Vader's breathing was achieved by Burtt breathing through the mask of a scuba tank implanted with a microphone. Lucas never intended to use the voice of David Prowse, who portrayed Darth Vader in costume, because of Prowse's thick English West Country accent. He originally wanted Orson Welles to speak for Darth Vader. However, he felt that Welles' voice would be too recognizable, so he cast the lesser-known James Earl Jones. Nor did Lucas intend to use Anthony Daniels' voice for C-3PO. Thirty well-established voice actors, such as Stan Freberg, read for the voice of the droid. According to Daniels, one of the major voice actors recommended Daniels' voice for the role."}, {"tag": "p", "text": "When Lucas screened an early cut of the film for his friends, among them directors Brian De Palma, John Milius and Steven Spielberg, their reactions were disappointing. Spielberg, who claimed to have been the only person in the audience to have enjoyed the film, believed that the lack of enthusiasm was due to the absence of finished special effects. Lucas later said that the group was honest and seemed bemused by the film. In contrast, Alan Ladd, Jr. and the rest of 20th Century Fox loved the film; one of the executives, Gareth Wigan, told Lucas, \"This is the greatest film I've ever seen,\" and cried during the screening. Lucas found the experience shocking and rewarding, having never gained any approval from studio executives before. Although the delays increased the budget from $8 million to $11 million, the film was still the least expensive of the Star Wars saga."}, {"tag": "h3", "text": "Music"}, {"tag": "p", "text": "Lucas's intentions for Star Wars involved a grand musical sound, with leitmotifs for different characters and important objects, an approach used to great effect, for instance, in the operas of Richard Wagner. Toward this end, Lucas put together a collection of classical pieces for the composer John Williams to review, as an idea of what effects Lucas desired for the films. The music Williams composed was often distinctly reminiscent of the original classical pieces. In particular:"}, {"tag": "p", "text": "Major musical themes include:"}, {"tag": "h3", "text": "Sound"}, {"tag": "p", "text": "A New Hope was originally presented in monaural sound in many theaters, though the first-run 70mm prints were some of the earliest wide-release examples of surround sound—something not seen in the commercial cinema since the Cinerama and Cinemascope experiments of the early 1950s."}, {"tag": "h3", "text": "Sources and inspirations"}, {"tag": "p", "text": "The film drew inspiration from a number of sources. This was conscious and has been acknowledged by George Lucas in interviews. It is characteristic of much myth-building."}, {"tag": "p", "text": "Lucas has stated that Akira Kurosawa's 1958 film The Hidden Fortress (USA release 1962) was a strong influence. The resemblance between the two buffoon farmers in The Hidden Fortress and the two talkative droids in A New Hope is apparent. Indeed, when the droids find themselves alone on Tatooine, even the music and the style of \"wipe\" cuts are a clear homage to Hidden Fortress. When Motti is criticizing Darth Vader, he is about to mention the Rebels' \"hidden fortress\" before Vader cuts him off in the middle of the last word."}, {"tag": "p", "text": "The climactic scene in which the Death Star is assaulted was modeled after (including some of the same dialogue) the 1950s film The Dam Busters, in which RAF Lancaster bombers fly along heavily defended reservoirs and aim \"bouncing bombs\" at German man-made dams in a bid to cripple the heavy industry of the Ruhr. (A New Hope cinematographer Gilbert Taylor had previously worked on the special-effects sequences for that film.)"}, {"tag": "p", "text": "Lucas has made mention of the film \"633 Squadron\" directed by Walter Grauman when citing movies that inspired themes or elements in A New Hope. The \"trench run\" in A New Hope wherein Luke flies his X-wing through a \"trench\" on the Death Star and destroys the ship was inspired, at least in small part, by the finale of 633 Squadron, which involves several Royal Air Force planes flying at low level up a fjord against heavy, ground-based anti-aircraft fire, to attack a factory located at the base of a cliff at the canyon's end."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "Wary that Star Wars would be beaten out by other summer films, such as Smokey and the Bandit, 20th Century Fox moved the release date to Wednesday before Memorial Day: May 25, 1977. However, few theaters ordered the film to be shown. In response, 20th Century Fox demanded that theaters order Star Wars if they wanted an eagerly anticipated film based on a best-selling novel titled The Other Side of Midnight. The New York Times published the first advertisements for the film on May 15, only ten days before its premiere."}, {"tag": "p", "text": "Star Wars became an instant success upon release; within three weeks, 20th Century Fox's stock price doubled to a record high. Before 1977, 20th Century Fox's greatest annual profits were $37,000,000; in 1977, the company earned $79,000,000. Although the film's cultural neutrality helped it to gain international success, Ladd became anxious during the premiere in Japan. After the screening, the audience was silent, leading Ladd, Jr. to fear that the film would be unsuccessful. He was later told that, in Japan, silence was the greatest honor to a film. Meanwhile, thousands attended a ceremony at Grauman's Chinese Theater, where C-3PO, R2-D2 and Darth Vader placed their footprints in the theater's forecourt."}, {"tag": "p", "text": "During the film's original theatrical run, there were a number of now-iconic television promotions:"}, {"tag": "h3", "text": "Merchandise"}, {"tag": "p", "text": "Charles Lippincott was hired by Lucas' production company, Lucasfilm Ltd., as marketing director for Star Wars. Because 20th Century Fox gave little support for marketing beyond licensing T-shirts and posters, Lippincott was forced to look elsewhere. He secured deals with Stan Lee, Roy Thomas and Marvel Comics for a comic book adaptation and with Del Rey Books for a novelization. Although Star Wars merchandise was available to enthusiastic children upon release, only Kenner Toys—who believed that the film would be unsuccessful—had accepted Lippincott's licensing offers. Kenner responded to the sudden demand for toys by selling boxed vouchers in its \"empty box\" Christmas campaign; these vouchers could be redeemed for the toys in March 1978."}, {"tag": "p", "text": "The novelization of the film was published in December 1976, six months before the film was released. The credited author was George Lucas, but the book was revealed to have been ghostwritten by Alan Dean Foster, who later wrote the first Expanded Universe novel, Splinter of the Mind's Eye. The book was first published as Star Wars: From the Adventures of Luke Skywalker; later editions were titled simply Star Wars and, later, Star Wars Episode IV: A New Hope, to reflect the retitling of the film. Certain scenes deleted from the film (and later restored or archived in DVD bonus features) were present in the novel, such as Luke at Tosche Station with Biggs and the encounter between Han and Jabba in Docking Bay 94. Other deleted scenes from the movie, such as a close-up of a stormtrooper riding on a Dewback, were included in a photo insert added to later printings of the book. Smaller details were also changed; for example, in the Death Star assault, Luke's callsign is Blue Five instead of Red Five as in the film. Lippincott secured the deal with Del Rey Books to publish the novelization in November 1976. By February 1977, a half million copies had been sold."}, {"tag": "p", "text": "A radio drama adaptation of the film was written by Brian Daley, directed by John Madden, and produced for and broadcast on the American National Public Radio network in 1981. The adaptation received cooperation from George Lucas, who donated the rights to NPR. John Williams' music and Ben Burtt's sound design were retained for the show; Mark Hamill (Luke Skywalker) and Anthony Daniels (C-3PO) reprised their roles as well. The radio drama featured scenes not seen in the final cut of the film, such as Luke Skywalker's observation of the space battle above Tatooine through binoculars, a skyhopper race, and Darth Vader's interrogation of Princess Leia. In terms of Star Wars canon, the radio drama is given the highest designation, G-canon."}, {"tag": "p", "text": "Over the years, several comic adaptations of the film have been produced:"}, {"tag": "h3", "text": "Re-releases"}, {"tag": "p", "text": "The film was originally released as—and consequently often called—Star Wars, without Episode IV or the subtitle A New Hope. The 1980 sequel, Star Wars: Episode V The Empire Strikes Back, featured the episode number and subtitle in the opening crawl. When the original film was re-released on April 10, 1981, Episode IV: A New Hope was added above the original opening crawl. Although Lucas claims that only six films were ever planned, representatives of Lucasfilm discussed plans for nine or 12 possible films in early interviews. The film was re-released theatrically in 1978, 1979, 1981, 1982, and 1997."}, {"tag": "p", "text": "After ILM used computer generated effects for Steven Spielberg's Jurassic Park, Lucas concluded that digital technology had caught up to his original vision for Star Wars. As part of Star Wars' 20th anniversary celebration in 1997, A New Hope was digitally remastered and re-released to theaters, along with The Empire Strikes Back and Return of the Jedi, under the campaign title The Star Wars Trilogy: Special Edition. The Special Edition versions contained visual shots and scenes that were unachievable in the original release due to financial, technological, and time restraints; one such scene involved a meeting between Han Solo and Jabba the Hutt. Although most changes were minor or cosmetic in nature, some fans believe that Lucas degraded the movie with the additions. For instance, a controversial change in which Greedo shoots first when confronting Han Solo has inspired T-shirts brandishing the phrase \"Han shot first.\""}, {"tag": "h3", "text": "Home video"}, {"tag": "p", "text": "A New Hope was released on DVD on September 21, 2004 in a box set with The Empire Strikes Back, Return of the Jedi, and a bonus disc of supplemental material. The movies were digitally restored and remastered, and more changes were made by George Lucas."}, {"tag": "p", "text": "The DVD features a commentary track from George Lucas, Ben Burtt, Dennis Muren, and Carrie Fisher. The bonus disc contains the documentary Empire of Dreams: The Story of the Star Wars Trilogy, three featurettes, teaser and theatrical trailers, TV spots, still galleries, an exclusive preview of Star Wars: Episode III Revenge of the Sith, a playable Xbox demo of the LucasArts game Star Wars: Battlefront, and a \"Making Of\" documentary on the Episode III video game. The set was reissued in December 2005 as part of a three-disc \"limited edition\" boxed set without the bonus disc."}, {"tag": "p", "text": "The trilogy was re-released on separate two-disc Limited Edition DVD sets from September 12, 2006 to December 31, 2006; the original versions of the films were added as bonus material. Controversy surrounded the release (often referred to as \"George's original unaltered trilogy\", or \"GOUT\" for short) because the so-called \"unaltered\" versions were from the 1993 non-anamorphic laserdisc masters, and were not re-transferred to modern DVD standards."}, {"tag": "p", "text": "It was re-released in the Blu-ray format on September 16, 2011."}, {"tag": "p", "text": "On April 7, 2015, the Walt Disney Studios, 20th Century Fox, and Lucasfilm jointly announced the digital releases of the six released Star Wars films. Fox released A New Hope for digital download on April 10, 2015 (while Disney released the other five films)."}, {"tag": "p", "text": "Despite the Walt Disney Company's 2012 purchase of Lucasfilm Ltd. and the release rights to all future Star Wars films, Fox was to retain original distribution rights to A New Hope, which they co-produced and co-financed, in perpetuity in all media worldwide. Fox was also to retain theatrical, nontheatrical, and home video rights worldwide for the franchise's five subsequent films, which Lucasfilm produced and financed independently, through May 2020, at which time ownership was to transfer to Disney. This complex relationship between Fox and Disney, particularly in regards to Fox's perpetual rights to Episode IV, was to create an obstacle for any future boxed set comprising all nine films. On December 14, 2017, The Walt Disney Company announced that it was acquiring most of Fox's parent company, 21st Century Fox, including the film studio and all distribution rights to A New Hope. On March 20, 2019, the deal was officially completed. On April 12, 2019, a Blu-ray box set containing the nine main installments of the Star Wars saga remastered in 4K was reportedly announced to be in development for a 2020 release."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Star Wars debuted on May 25, 1977 in 32 theaters, and proceeded to break house records, effectively becoming one of the first blockbuster films. It remains one of the most financially successful films of all time. Some of the cast and crew noted lines of people stretching around theaters as they drove by. Even technical crew members, such as model makers, were asked for autographs, and cast members became instant household names. The film's original total U.S. gross came to $307,263,857, and it earned $6,806,951 during its first weekend in wide release. Lucas claimed that he had spent most of the release day in a sound studio in Los Angeles. When he went out for lunch with his then-wife Marcia, they encountered a long queue of people along the sidewalks leading to Mann's Chinese Theater, waiting to see Star Wars. The film became the highest-grossing film of 1977 and the highest-grossing film of all time until E.T. The Extra-Terrestrial broke that record in 1982. (With subsequent re-releases, Star Wars reclaimed the title, but lost it again to James Cameron's 1997 blockbuster Titanic.) The film earned $797,900,000 worldwide, making it the first film to reach the $300 million mark. Adjusted for inflation it is the second highest grossing movie of all time in the United States, behind Gone with the Wind."}, {"tag": "p", "text": "The New York Times described Star Wars: Episode IV A New Hope as \"the most beautiful movie serial ever made.\" Roger Ebert called the film \"an out-of-body experience,\" compared its special effects to those of 2001: A Space Odyssey, and opined that the true strength of the film was its \"pure narrative.\" Vincent Canby called the film \"the movie that's going to entertain a lot of contemporary folk who have a soft spot for the virtually ritualized manners of comic-book adventure.\"\nPauline Kael of The New Yorker criticized the film, stating that \"there's no breather in the picture, no lyricism,\" and that it had no \"emotional grip.\" Jonathon Rosenbaum of the Chicago Reader stated, \"None of these characters has any depth, and they're all treated like the fanciful props and settings!\" Peter Keough of the Boston Phoenix said, \"Star Wars is a junkyard of cinematic gimcracks not unlike the Jawas' heap of purloined, discarded, barely functioning droids.\" Stanley Kauffmann of The New Republic also responded negatively, noting, \"His work here seems less inventive than in THX 1138.\" According to rottentomatoes.com, of the 54 critical reviews of the film provided on that site, 51 responded favorably (95% of the reviewers), stating in consensus that \"the action and special effects are first rate.\""}, {"tag": "p", "text": "In 1989, the U.S. National Film Registry of the Library of Congress selected the film as a \"culturally, historically, or aesthetically important\" film. In 2006, Lucas' original screenplay was selected by the Writers Guild of America as the 68th greatest of all time. The American Film Institute (or AFI) listed it 15th on a list of the top 100 films of the 20th century; in the UK, a poll created by Channel Four named A New Hope (together with its successor, The Empire Strikes Back) the greatest film of all time. The American Film Institute has named Star Wars and specific elements of it to several of its \"top 100 lists\" of American cinema, compiled as a part of the Institute's 100th anniversary celebration. These include the 27th most thrilling American film of all time; the thirty-ninth most inspirational American film of all-time; Han Solo as the fourteenth greatest American film hero of all time and Obi-Wan Kenobi thirty-seventh on the same list. The often repeated line \"May the Force be with you\" was ranked as the eighth greatest quote in American film history. John Williams' score was ranked as the greatest American film score of all time."}, {"tag": "p", "text": "Star Wars won multiple awards at the 1978 Academy Awards, including Best Art Direction-Set Decoration, which went to John Barry, Norman Reynolds, Leslie Dilley and Roger Christian. Best Costume Design was awarded to John Mollo; Best Film Editing went to Paul Hirsch, Marcia Lucas and Richard Chew; John Stears, John Dykstra, Richard Edlund, Grant McCune and Robert Blalack all received awards for Best Effects, Visual Effects. John Williams was awarded his third Oscar for Best Music, Original Score; the Best Sound went to Don MacDougall, Ray West, Bob Minkler and Derek Ball; and a Special Achievement for sound effects went to Ben Burtt. Additional nominations included Alec Guinness for Best Actor in a Supporting Role, George Lucas for Best Screenplay and Best Director, and Gary Kurtz was nominated for his producing duties in Best Picture. At the Golden Globe awards, the film was nominated for Best Motion Picture - Drama, Best Director, Best Supporting Actor (Alec Guinness), and Best Score. It only won the award for Best Score. It received six BAFTA nominations: Best Film, Best Editing, Best Costume, Best Production/Art Design, Best Sound, and Best Score; the film won in the latter two categories. John Williams' soundtrack album won the Grammy award for Best Album of an original score for a motion picture or television program,and the film was awarded the Hugo Award for Best Dramatic Presentation. In 1997, the MTV Movie Awards awarded Chewbacca the lifetime achievement award for his work in the Star Wars trilogy.[source?]"}, {"tag": "p", "text": "Originally, if the film did poorly at the box office, Lucas planned to turn the novel Splinter of the Mind's Eye into a low-budget sequel to the movie. According to an interview with Alan Dean Foster in Empire magazine, the book was written to be filmed as a low-budget sequel if Star Wars was not a huge success. Harrison Ford was not signed for the sequel as of the writing of the book, which is why Han Solo does not appear in the novel. However, with the success of A New Hope, Lucas was free to make The Empire Strikes Back.[source?]"}, {"tag": "h2", "text": "Deleted scenes"}, {"tag": "p", "text": "There are many short alternate takes throughout Star Wars where Luke appears in his poncho: Luke in the desert, in the Tusken Raiders' canyon, Luke finding the destroyed homestead, and in the hangar on Yavin 4. The only poncho scenes that made the final cut were in Docking Bay 94, on the Millennium Falcon flight from the Death Star, and on arrival on Yavin 4."}, {"tag": "h3", "text": "Aunt Beru's Blue Milk"}, {"tag": "p", "text": "Beru is in the homestead, pouring a blue liquid into a jug."}, {"tag": "h3", "text": "Luke in the Desert"}, {"tag": "p", "text": "Luke Skywalker is in the Tatooine desert repairing a moisture vaporator, assisted by a Treadwell droid, when he notices shining objects in the sky. With his macrobinoculars Luke sees two ships engaged in combat beyond the atmosphere. He jumps into his landspeeder. The malfunctioning Treadwell blows a fuse and is unable to follow. Luke speeds off into the desert to find his friends. The scene originally occurred after the Tantive IV is boarded, just before Darth Vader's first appearance in the film. It is thought that there is no longer any clear footage of this scene available. Existing footage has been degraded by poor film storage conditions over the years. Before the film was cut, this was the audience's first sight of the young Luke Skywalker, much earlier than in the final cut. It was removed along with subsequent scenes of Luke and his friends in Anchorhead. George Lucas had originally written the scenes and shot them at the suggestion of his industry friends who thought that audiences wouldn't understand the story strictly being told from a droid's point of view. Upon realizing that the story was really about the droids' adventures and it was them leading things to Luke and Obi-Wan, etc. Lucas took the footage out."}, {"tag": "h3", "text": "Tosche Station"}, {"tag": "p", "text": "Luke's landspeeder races into the town of Anchorhead, nearly running over an old woman. Luke rushes into Tosche Station excitedly telling his friends about the battle above their planet. He is overjoyed to be reunited with his friend Biggs Darklighter who is on planet leave from the Academy. Deak, Windy, Camie, Fixer and Biggs all follow Luke outside to see the battle with Luke's macrobinoculars. The battle appears to have ended and Luke's friends ridicule him for making it all up. This scene was to come just after R2-D2 and C-3PO eject from the Tantive IV in an escape pod, and before the scene where Princess Leia is led captive before Darth Vader. This scene establishes Luke's difficult relationships with his peers, and gives a picture of life on Tatooine. Storyline pacing may have been the deciding factor, but it should also be borne in mind that after Lucas's first screening of the rough cut of Star Wars in 1977, a fellow filmmaker jokingly accused him of producing \"American Graffiti in space.\" This jibe probably influenced Lucas to cut the scenes set in Anchorhead. The sequence where Luke nearly runs down an old woman was an effects shot that was never completed."}, {"tag": "h3", "text": "Luke and Biggs"}, {"tag": "p", "text": "This scene is a conversation between Luke and his oldest friend, Biggs Darklighter. Biggs has left Tatooine and is on planet leave from the Imperial Academy where he is training to be a space pilot. Luke's envy of Biggs's success conflicts with his duty to his uncle and his reasons for remaining on Tatooine. Biggs quietly tells Luke that he has decided to join the Rebellion against the Empire. In a tense and emotional conversation, the two young men say their final farewells. This scene was to come in between the scene where C-3PO spots a distant Jawa sandcrawler in the desert, and the capture of R2-D2 by the Jawas in the canyon. The Luke and Biggs sequence was part of the whole Anchorhead backstory on Tatooine, and was cut along with the other early scenes on Tatooine, probably for reasons of story pacing."}, {"tag": "h3", "text": "Vader and Chief Bast"}, {"tag": "p", "text": "In this short scene, Darth Vader and Chief Bast walk along a corridor on the Death Star. Bast reports that the search for the missing droids has extended to Mos Eisley spaceport. Vader observes that Princess Leia is resisting interrogation, and Bast boldly criticizes Tarkin's plan to break her as \"foolish.\" The scene would have appeared between the scene where Han Solo encounters Jabba the Hutt in Docking Bay 94 (also cut), and the scene where Luke and Ben find the Millennium Falcon in Docking Bay 94."}, {"tag": "h3", "text": "The Search for R2"}, {"tag": "p", "text": "R2-D2 has absconded from his new master, Luke Skywalker. Early in the morning, Luke and Threepio rush off in the landspeeder to search for R2, with Threepio driving the landspeeder. They talk about Artoo, Ben Kenobi, and how angry Uncle Owen is going to be. The scene belongs at the start of the sequence where Luke and 3PO search for R2, before the attack of the Tusken Raiders. The moment was scored with a light version of Luke's theme; the music can be heard at the beginning of the cue \"Land of the Sand People\" on the original LP and CD configurations, or \"Landspeeder Search\" in the Special Edition album. Before the days of CGI, scenes like this landspeeder cockpit sequence had to be filmed against a rear-projection screen. The scene was dropped due to poor quality."}, {"tag": "h3", "text": "Stormtrooper Search"}, {"tag": "p", "text": "Various alien creatures are seen walking around a narrow street in Mos Eisley, and some Stormtroopers walk past."}, {"tag": "h3", "text": "Darth Vader widens the Search"}, {"tag": "p", "text": "This is a scene with Darth Vader and another Imperial officer on the Death Star."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}