{"url": "Star_Wars:_Imperial_Assault_(Fantasy_Flight_Games)", "categories": ["Category:Real-world articles", "Category:Fantasy Flight Games", "Category:Star Wars: Imperial Assault"], "nodes": [{"tag": "h1", "text": "Star Wars: Imperial Assault (Fantasy Flight Games)"}, {"tag": "p", "text": "Star Wars: Imperial Assault is a strategy board game produced by Fantasy Flight Games and released on December 15, 2014. The campaign game can be played by two-to-five players and features one player as the Imperial force, while up to four other players control unique Rebel heroes. Both sides will progress over the course of many missions and play sessions. Skirmish mode is playable for two players, typically with one playing as the Imperial forces and one as the Rebel forces, but same-team matchups are possible. Teams for skirmish are constructed ahead of time, similar to the Star Wars: X-Wing Miniatures Game, and each session is self-contained."}, {"tag": "p", "text": "In addition to the core game, two expansion packs are included in the main box: the Luke Skywalker and Darth Vader Ally and Villain Packs. Each of these expansion pack adds skirmish and/or campaign missions, as well as new 28mm miniatures and cards. More ally expansion packs are available as separate purchases. Many online board game reviewers, such as Tom Vasel of the Dice Tower series, have described the game mechanics as being \"very similar to Descent\" and praised the Star Wars flavor."}, {"tag": "h2", "text": "Campaign game"}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "The campaign game is an asymmetrical experience for 2 to 5 players. One player takes on the role of the Empire, summoning in troops and deploying disposable forces to take on the rebels. Any other players control a Rebel character, unique to this game. Over the course of many missions, both sides will be able to upgrade themselves. This style of play is similar to many roleplaying games, where one player takes on the role of a Game Master (the Empire). However, there is no self-created storytelling in Imperial Assault so it is more of a tactical skirmish game with a sense of progression."}, {"tag": "h3", "text": "Rebel Gameplay"}, {"tag": "p", "text": "Rebels take turns having activations. During an activation, a Rebel gets to take two actions. Actions can be moves, attacks, rests, or other special interactions. Rebels are given a goal to accomplish at the start of each mission, such as destroy terminals, escape with information, or defend for a time limit. The knowledge available to Rebels is limited to create a sense of story for the players and provide the Empire with some advantage."}, {"tag": "h3", "text": "Empire Gameplay"}, {"tag": "p", "text": "The round to round gameplay of the Empire is very similar to the Rebels, with the player deploying sets of figures and each figure receiving two actions. However, the Imperial player is allowed more behind the scenes knowledge. When Rebels trigger certain events such as opening doors or interacting with terminals, the Imperial player gets to reinforce with new troops or in some cases decide what negative effect hinders the Rebels. At the end of each round of gameplay, the Imperial player gets to summon in new troops by spending an accumulating resource known as \"threat.\" The goal for the Empire is most often to defeat heroes, or to stall the heroes for a certain number of rounds."}, {"tag": "h3", "text": "Progression"}, {"tag": "p", "text": "Three resources contribute to the sense of progression between missions. Both the Empire and Rebel players will receive XP for completing missions. Beyond that, Rebel players will receive Credits and the Imperial player will receive Influence. While all three are awarded after every mission, the rewards for the side that reached their goal in the mission will receive more numerous rewards. Players may also receive Reward cards for specific mission victories."}, {"tag": "h4", "text": "XP"}, {"tag": "p", "text": "Each Rebel hero has a class deck, with skill cards ranging in cost from 1 XP to 4 XP. After each mission, the Rebel player may pay to permanently purchase as many of these skill cards as he would like and can afford."}, {"tag": "p", "text": "The Imperial player chooses a set of Class cards before any mission begins. After each mission, he can use his XP to purchase from this set of cards in the same way that Rebels can purchase cards for their heroes."}, {"tag": "h4", "text": "Credits"}, {"tag": "p", "text": "Each Rebel hero will earn the team 100 credits for each mission, and possibly more depending on their actions in the mission. This money goes to a group pool. The Rebels then draw items from the Tier the mission is (1 to 3) and decide together what to purchase. These are generally new weapons and items."}, {"tag": "h4", "text": "Influence"}, {"tag": "p", "text": "After a mission, the Imperial player draws four cards from an Agenda deck that was constructed before the Campaign began. The Imperial player can then choose to purchase any of these he would like. Many of these cards are secret, and many provide only one time abilities. These add to the sense of overwhelming power and secrecy that is unique to the Imperial side."}, {"tag": "h2", "text": "Products"}, {"tag": "h3", "text": "Expansions"}, {"tag": "h3", "text": "Ally and Villain Packs"}, {"tag": "p", "text": "Fantasy Flight has designed expansions with content which can be used in both the campaign and skirmish game modes of the base set. Ally and Villain Packs are each designed with either the rebel players or Imperial player in mind. Each Ally and Villain Pack includes plastic figures to replace the printed tokens which were included in the Core Set, new missions, and new cards. Larger expansions are also planned and will include several new figures, new map tiles, new missions, and more."}, {"tag": "p", "text": "Wave 1"}, {"tag": "p", "text": "Wave 2"}, {"tag": "p", "text": "Wave 3"}, {"tag": "p", "text": "Wave 4"}, {"tag": "p", "text": "Wave 5"}, {"tag": "p", "text": "Wave 6"}, {"tag": "p", "text": "Wave 7"}, {"tag": "p", "text": "Wave 8"}, {"tag": "p", "text": "Wave 9"}, {"tag": "p", "text": "Wave 10"}, {"tag": "p", "text": "Wave 11"}, {"tag": "h3", "text": "Game Maps"}, {"tag": "h3", "text": "Companion app"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}