{"url": "Star_Wars:_Galaxy_of_Heroes", "categories": ["Category:Real-world articles", "Category:Articles in need of major additions", "Category:Incomplete lists", "Category:2015 computer and video games", "Category:Canon mobile games"], "nodes": [{"tag": "h1", "text": "Star Wars: Galaxy of Heroes"}, {"tag": "p", "text": "Star Wars: Galaxy of Heroes (SW:GoH) is a mobile game by Electronic Arts released on November 24, 2015. The game was first announced on June 15, 2015, in EA's press conference during the 2015 Electronic Entertainment Expo."}, {"tag": "p", "text": "The game allows players to collect characters from the prequel trilogy, Star Wars: The Clone Wars, Star Wars: The Bad Batch, Solo: A Star Wars Story, Star Wars Rebels, Rogue One: A Star Wars Story, the original trilogy,  The Mandalorian, the sequel trilogy, and put those characters into battle. Due to the nature of the game, it is not considered to be canon."}, {"tag": "p", "text": "The game also features characters from Legends such as the characters from both Knights of the Old Republic games, Revan, Bastila Shan, Sith trooper, Sith Marauder, and Sith Assassin. However, due to the sandbox nature of the game, this does not canonize the characters in the current story acknowledged by Lucasfilm."}, {"tag": "h2", "text": "Game tutorial"}, {"tag": "h3", "text": "Main Game"}, {"tag": "p", "text": "The game's tutorial starts you off with the Cantina's bartender speaking to you about Holotables. Garudda The Hutt appears, and he brags about how skilled he is at the Holotables."}, {"tag": "p", "text": "When redeeming your first data cards (purchased or occasionally free packages holding gear, currency, etc.) you get a Clone Sergeant - Phase 1 and a Jedi Consular. You are sent to Kashyyyk, where you fight B1 Droids and one B2 Droid. once you have finished the battle, you obtain Clone Wars Chewbacca. However, In a recent update it has been changed to start you out with Jedi Knight Anakin, Ahsoka Tano, and Ben Kenobi."}, {"tag": "p", "text": "After that point the game lets you pick what you want to do next and the tutorial is ended."}, {"tag": "h3", "text": "Fleet Battles"}, {"tag": "p", "text": "With the expansion of Starfighters, players are introduced to how it works with help from the Cantina's Bartender and the Hutt you meet at the beginning. You must be level 60 or higher in order to be able to use Starfighters and must have completed all fleet commander training. After a brief battle, you get to battle for character shards and Starship Blueprints for the Jedi Consular and his starfighter, the Clone Sergeant and his ARC-170, the Resistance pilot and their X-Wing, the Geonosian Soldier and its Starfighter, both TIE fighter pilots from the Original Trilogy and Episode VII and their TIEs, Ackbar and Home One, Mace Windu and the Endurance, Tarkin and the Executrix. Then you have another brief battle before the tutorial ends."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "h3", "text": "Light and Dark Side Battles"}, {"tag": "p", "text": "Players choose 5 light/dark side characters (with one ally of the same side) to form a team and clear three stages of battles against computer characters from the opposing side. Battles are divided into normal and hard modes. Normal battles give gear, training droids, experience, and credits. Hard battles give the same things, with the addition of blueprints and/or shards for specific ships and characters. Credits and crystals earned can be used to purchase items and character shards. The more the player progresses in the game, the more energy the levels require the player to use to play it. Each hard battle can only be played five times a day (can be refreshed at a cost of crystals). Light Side Battles are one of the very first unlock in the game, while Dark Side Battles unlock when the player reaches three dark side characters and reaches level 12."}, {"tag": "h3", "text": "Squad Arena"}, {"tag": "p", "text": "Players choose five characters (including both light and dark side characters) to form a team and fight in matches against other real-life players' characters (AI-controlled) to improve their global ranking. Players can participate a maximum of 5 times in Squad Arena Battles each day (unless they choose to refresh by using crystals). At their payout time, the player will receive in the inbox a reward that consists of Squad Arena Tokens, credits, and Crystals based on their global ranking. Squad Arena Tokens earned can be used to purchase items and character shards."}, {"tag": "h3", "text": "Cantina Battles"}, {"tag": "p", "text": "Players choose five characters to form a team and clear three stages of battles against AI characters per level, but there are no hard mode levels. Cantina Battles have their energy system that takes longer to recharge. Players can get character shards, ship blueprints, training droids, credits, ability material, and Cantina battle tokens. Cantina tokens earned can be used to purchase items and character shards. Unlike Hard battles, Cantina Battles can be played as long as the player has the energy to play them."}, {"tag": "h3", "text": "Mod Battles"}, {"tag": "p", "text": "Like Cantina Battles, Players choose 5 characters to form a team. However, instead of the usual 3 stages, players must go through 5 stages to complete it. Players can get credits, ability material, Cantina battle points, and mods which can be used to enhance characters that are level 50 and over. Mod Battles use their own system of energy."}, {"tag": "h3", "text": "Galactic War"}, {"tag": "p", "text": "Players choose 5 out of any of their characters to clear 12 battle stages against computer characters, but with the characters being set from another real-life player's team. Teams are selected according to players' individual galactic power. Once a character is killed, they cannot be used again in subsequent stages until the game allows the player to reset it, which can be reset once per day. Every stage gives credits, Starship building material, a random rank training droid, ability material. Every two stages won in Galactic War earns war points (second and forth give 100, the rest (except the last, which gives 400) give 200 which can be used to purchase items, Starship blueprints, and character shards, and every three stages earn crystals."}, {"tag": "h3", "text": "Galactic Conquest"}, {"tag": "p", "text": "Players take their teams to fight in multi-week challenges which gives players rare shards that sometimes can only be obtainable in conquest. E.G. Razor Crest"}, {"tag": "h3", "text": "Challenges"}, {"tag": "p", "text": "Players choose 5 characters to form a team and participate in six different challenges. Certain challenges are available on two certain days of each week, followed by all challenges being available on Sunday. Challenges refresh every ten minutes with five or three battles max per challenge in a day. In certain challenges, only characters of a certain class (e.g. healer, support, tank, attacker) are allowed. Players can earn credits, training droids, ability mats, and gear pieces. As the player levels up over time, different levels of challenges will be unlocked, with higher amounts of reward and better reward per different level. Here is a list of the different challenges."}, {"tag": "h3", "text": "Events"}, {"tag": "p", "text": "Players use 5 characters that are required to form a team and participate in special challenges that are available only during specific times and for a limited duration of time. Most of them require you to use specific types of characters like Scoundrels, Jedi, Rebels, Droids, etc. Some even let the player use a character or starship that's about to be released into the game. Items, credits, training droids, ability materials, character shards, blueprints, etc. can be earned."}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Allies and Guilds"}, {"tag": "p", "text": "Players can form alliances with other real-life players and call upon their characters to assist in Light/Dark Side Battles, Cantina Battles, and Challenges. Players can also form Guilds and team up to carry out raids and fight either a team of Gamorreans and a Rancor, battle against Grievous and a Separatist AAT or face off against the Sith Triumvirate to earn rare items and Han Solo, General Kenobi or Darth Traya character shards. Players can also get Guild Points from doing certain objectives (Doing Light/Dark side battles, Hard mode battles, PvP battles, Cantina Battles, etc.) and at the end of the raids, which can be used to acquire Character Shards, Starship blueprints and items."}, {"tag": "h3", "text": "Data Cards and Shipments"}, {"tag": "p", "text": "Players can purchase data cards and shipments containing different packages of items to promote existing characters, upgrade existing characters' equipment, unlock new characters, etc. Players can purchase them with Crystals, real-world money, credits, or ally tokens, which can be acquired via battles or other methods."}, {"tag": "h3", "text": "Fleet Arena"}, {"tag": "p", "text": "Players can use one of eight Capital ships, Home One, Endurance, Executrix, Chimera, Finalizer, Raddus, Malevolence, or Negotiator, three starfighters and up to four reinforcements to fight in matches against other real-life players to and improve their global ranking. At a certain time of day, the player will receive in the inbox a reward that consists of Fleet arena tokens, building materials, and Training droids, sim tickets, and Crystals based on their global ranking. Fleet arena tokens can be used to purchase items, Starship blueprints, and character shards."}, {"tag": "h3", "text": "Fleet Battles"}, {"tag": "p", "text": "Players can use one of eight Capital ships, Chimaera, Home One, Endurance, Executrix, Negotiator, Raddus, Finalizer, or Malevolence  and up to seven starfighters (based on the rarity of the capital ship) to fight in matches against computer characters, just like in Cantina Battles. Just like Cantina Battles, Fleet Battles have their own energy system that takes about as long to recharge as Cantina Battles. However, Each stage is divided into normal and hard modes, just like Light and Dark side battles. Normal Battles give gear for units, Training droids for both units and ships, Experience, credits, and building materials. Hard battles give the same rewards plus blueprints and/or shards for specific ships and characters, the blueprints and shards received depends on what level is played, and just like hard mode Light and Dark side battles, Hard mode Fleet battles can only be played five times a day, the same as Hard mode light and dark side battles."}, {"tag": "h3", "text": "Fleet Challenges"}, {"tag": "p", "text": "They are similar to normal Challenges, Players can use one Capital ship and up to seven starfighters to form a team and participate in six different challenges. Certain challenges are available only on certain days of the week; Monday is an exception because all the challenges are available. All of the challenges require the player to either use Home One, Endurance, or Executrix as the capital ship to do the challenge. Players can earn building materials, training droids, ability material, and Starship Blueprints for Home One, Endurance, and Executrix."}, {"tag": "h3", "text": "Daily Activities"}, {"tag": "p", "text": "Players are encouraged to complete their Daily Activities everyday. They include completing battles, purchasing shipments, going through challenges, finishing squad and fleet arena battles etc. Completing Daily Activities reward the player with Ally points, credits, crystals, squad and fleet arena tokens, sim tickets etc. Daily Activities reset at midnight unless the player changes their time settings."}, {"tag": "h3", "text": "Achievements"}, {"tag": "p", "text": "Players can get achievements based on a number of battles they've played, level progression, etc. These will reward the player with credits, crystals, and characters shards etc. Achievements are the primary way to obtain shards for Darth Vader, asides from occasional drops in the shop."}, {"tag": "h3", "text": "Free Energy"}, {"tag": "p", "text": "Players can claim free energy throughout 3 parts of each day. Energy is needed to enter battles, be it Light Side or Dark Side battles, Mod battles, Cantina battles or Fleet battles. The free energy is given out at 4 a.m. GMT, 10 a.m. GMT and 1 p.m. GMT (for normal energy) but only at 4 a.m. GMT for the other types of energy. The free energy expires after 2 hours the energy is given."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}