{"url": "Star_Wars:_Imperial_Handbook:_A_Commander%27s_Guide", "categories": ["Category:Real-world articles", "Category:Guidebooks"], "nodes": [{"tag": "h1", "text": "Star Wars: Imperial Handbook: A Commander's Guide"}, {"tag": "p", "text": "Star Wars: Imperial Handbook: A Commander's Guide is a reference book on the procedures and tactical guidelines for the Imperial Military by Daniel Wallace. It is bundled with a motorized case with lights and sounds, an introductory note from Luke Skywalker, and a specially designed die-cast Imperial military medal. The book is also available by itself."}, {"tag": "p", "text": "Pre-orders were supposed to start on July 1, 2014. However, a customer-service message from becker&mayer! later implied that the book would be available for pre-order on their website around September 1. It was released on October 14, 2014."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "As the Galactic Empire expands, high-ranking officials from each branch of the Imperial Military have set down tactical guidelines and procedures for all newly ascending commanders. Set in-universe, this compendium of ordinance, mission reports, and Imperial philosophy was intercepted by members of the Rebel Alliance, some of whom also left commentary scribbled in the margins. Housed in a deluxe case that opens with lights and sounds, this never-before-seen Imperial Handbook is perfect for Star Wars fans—no matter which side of the Civil War they're on."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 2019, 3D artist Ansel Hsiao, known for his work in The Essential Guide to Warfare, complained that some of the artworks published on his website were reused without his consent by the illustrator Joe Corroney in Star Wars: Imperial Handbook: A Commander's Guide."}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "Although it was released after April 2014's split of the canon/Legends continuities and creation of the rule that any works released after that date are to be designated canon, publisher becker&mayer! has confirmed that the Imperial Handbook is branded as Star Wars Legends, meaning it is not part of the Star Wars canon. Despite this, it does have references to canon material, such as the Lasan Suppression, the AT-DP, the TIE Advanced v1 (referred to as the TIE Advanced prototype), and the propaganda posters Strength & Obedience, COMPNOR Recruitment, and Expose, Pursue, Destroy (although the last one was slightly modified when it later appeared in canon)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}