{"url": "Bashrar", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Fa'athra gang members", "Category:Males", "Category:Smugglers", "Category:Sullustans"], "nodes": [{"tag": "h1", "text": "Bashrar"}, {"tag": "p", "text": "Bashrar was a Sullustan male criminal who worked as a smuggler for the Hutt crime lord Voontara Fa'athra on the planet Nal Hutta. He had a sizeable bounty on his head and, in 3643 BBY, was killed by a bounty hunter on the grounds of Fa'athra's Palace."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Bashrar was a Sullustan male smuggler in the employ of the Hutt crime lord Voontara Fa'athra during the Cold War between the Galactic Republic and the reconstituted Sith Empire. He was a criminal and had a significant bounty on his head. In 3643 BBY, Bashrar spent time in the grounds of Fa'athra's Palace on the planet Nal Hutta, where he and a Human commando also serving in the Hutt's forces stood by a pair of speeder bikes."}, {"tag": "p", "text": "A bounty hunter aiming to participate in the Great Hunt infiltrated Fa'athra's Palace while trying to gain the sponsorship of Fa'athra's rival, Suudaa Nem'ro. Knowing they needed more credits to fund their efforts in the Great Hunt, the hunter's companion, Mako, identified several of Fa'athra's men who had bounties on them for the bounty hunter, who then located Bashrar by the speeder bikes and killed him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bashrar had light skin and black eyes. He spoke Sullustese."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Bashrar donned a black shirt and pants with a gray and purple tunic. He also wore brown boots, black gloves, a brown bandolier and belt, and a pair of brown pauldrons. In combat, he used two blaster pistols and thermal grenades."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bashrar appeared in the 2011 BioWare massively multiplayer online role-playing game, Star Wars: The Old Republic, as a target of the optional bonus mission \"Additional Bounties Available,\" which is only available to players of the Bounty Hunter class."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}