{"url": "Star_Wars:_Galactic_Baking", "categories": ["Category:Real-world articles", "Category:Real world cookbooks"], "nodes": [{"tag": "h1", "text": "Star Wars: Galactic Baking"}, {"tag": "p", "text": "Star Wars: Galactic Baking (formerly titled Star Wars: The Official Baking Cookbook) is a cookbook of Star Wars-inspired baking recipes. It was published by Insight Editions on May 4, 2021."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Embark on a baking journey through the Star Wars galaxy, and craft scrumptious treats inspired by fan-favorite planets."}, {"tag": "p", "text": "Get ready to tour the galaxy with this baking cookbook inspired by the snowdrifts of Hoth, the wastelands of Tatooine, and beyond. Star Wars: The Official Baking Cookbook is the most delicious way to experience the planets, flora, and fauna of the Star Wars galaxy. Whether you're throwing a watch party or hosting members of the Galactic Senate, this cookbook is a must-have for fans of all ages."}, {"tag": "p", "text": "• Over thirty mouthwatering recipes: Star Wars: The Official Baking Cookbook features recipes such as Mustafarian Molten Lava Cakes, Cloud City Marshmallows, Life Day Cake, Loth-Cat Kibble, Keshian Spice Bread, Dagobah Bog Pie, and more."}, {"tag": "p", "text": "• Bake your way through the galaxy: Packed with stunning food photography that's sure to inspire your inner chef, this cookbook will transport you to planets such as Kashyyyk, Jakku, Endor, Bespin, Coruscant, and everywhere in between."}, {"tag": "p", "text": "• For all skill levels: All types of bakers—from Padawans to Jedi Masters—will be able to enjoy recipes based on the Star Wars galaxy, from the Skywalker Saga to Star Wars Rebels."}, {"tag": "p", "text": "• Own the official Star Wars baking cookbook: This officially licensed guide to the galaxy's best sweets and treats will be a delectable addition to your Star Wars collection."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}