{"url": "Star_Wars:_Galactic_Atlas", "categories": ["Category:Real-world articles", "Category:Canon reference books"], "nodes": [{"tag": "h1", "text": "Star Wars: Galactic Atlas"}, {"tag": "p", "text": "Star Wars: Galactic Atlas is a reference book that was published by Egmont UK Ltd on November 3, 2016. An atlas with full-color illustrations by Tim McDonagh, it covers the first seven Star Wars films, as well as Star Wars Rebels, Star Wars: The Clone Wars, novels, and comics. The American edition was published by Disney–Lucasfilm Press on December 20, 2016. It is titled Star Wars Galactic Maps: An Illustrated Atlas of the Star Wars Universe and includes a spread relating to the then-upcoming film Rogue One: A Star Wars Story."}, {"tag": "p", "text": "While working on the video game Star Wars Battlefront II, the development team notably consulted the Galactic Atlas."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Explore the worlds and stories of a galaxy far, far away with this lavishly illustrated Galactic Atlas! Follow the beasts, battles, heroes and villains of the Star Wars saga all the way from the deserts of Tatooine to the ice plains of Hoth."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The December 2016 Polish edition of Star Wars: Galactic Atlas includes an entry for the Empire of Zakuul, placing it in the far west of the galaxy and in the Unknown Regions. The Zakuulan empire is a Star Wars Legends subject that was first mentioned in 2015 on swtor.com for the expansion Knights of the Fallen Empire of the BioWare video game Star Wars: The Old Republic. The author of Galactic Atlas, Emil Fortune, stated that he did not know why or how Zakuul crept into the Polish translation."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}