{"url": "Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Canon reference books"], "nodes": [{"tag": "h1", "text": "Star Wars: How Not to Get Eaten by Ewoks and Other Galactic Survival Skills"}, {"tag": "p", "text": "Star Wars: How Not to Get Eaten by Ewoks and Other Galactic Survival Skills is a canon reference book written by Christian Blauvelt. It was published by Dorling Kindersley on September 5, 2019 for the United Kingdom and September 24, 2019 for the United States."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Star Wars galaxy is a dangerous place. From ruthless bounty hunters, ferocious beasts, and extreme weather, to hostile landscapes, social minefields, and backstabbing allies, perils and hazards are never far away! How do you flee an exploding Death Star? What's the best way to source a starship at a spaceport? How would you escape being kidnapped by Tusken Raiders on Tatooine? Survival means keeping your wits about you. This fun, practical Star Wars book teaches you how to recognize threats and learn what to do to stay alive in a galaxy far, far away."}, {"tag": "p", "text": "Explore the methods used by your favorite Star Wars movie characters to escape sticky situations with this handy manual. DK's How Not to Get Eaten by Ewoks will help you navigate galactic pitfalls, whether you're learning how to avoid offending aliens of other species, or trying to find food and shelter in emergency situations. From survival kits and disguises to tips on diplomacy and etiquette, this book's step-by-step instructions, illuminating graphics, and beautiful illustrations will ensure your survival in a galaxy where anything can happen!"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}