{"url": "Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Canon reference books", "Category:Star Wars: Galaxy's Edge"], "nodes": [{"tag": "h1", "text": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu"}, {"tag": "p", "text": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu is a reference book written by Cole Horton and published by becker&mayer!. The book was released digitally on June 23, 2020, and the physical hardcover version was released on July 21, 2020."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Welcome to Batuu, a trading post at the edge of the galaxy where smugglers, bounty hunters, and rogue adventurers swap stories, food, and goods. Like any good tourist, you're going to need a guide book to lead you through your visit. Here is your official guide."}, {"tag": "p", "text": "In 2019, Disney opened a new Star Wars addition to their parks: The planet Batuu. Star Wars fans now have access to an authentic, in-world experience unlike anything they have ever seen before! This official guide to Batuu is written completely in-world, as if you are a visitor from another part of the galaxy, looking for recommendations on where to eat, sleep, and what to do during your trip to this planet. The guide also provides itineraries and descriptions of weekend trips \"Beyond Batuu\"; getaways to nearby planets and environs."}, {"tag": "p", "text": "The guide features:"}, {"tag": "p", "text": "Whether strolling in The Galaxy's Edge 15-acre park or simply being an armchair traveler, this immersive guide will delight any Star Wars fan."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}