{"url": "Star_Wars:_Jedi_Temple_Challenge_-_Episode_1", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Star Wars: Jedi Temple Challenge"], "nodes": [{"tag": "h1", "text": "Star Wars: Jedi Temple Challenge - \"Episode 1\""}, {"tag": "p", "text": "\"Episode 1\" is the first episode of Star Wars: Jedi Temple Challenge, a children's game show set in the Star Wars universe. The episode premiered on June 10, 2020 on the Star Wars Kids Youtube channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Join Jedi Master Kelleran Beq (Ahmed Best), wise-cracking protocol droid AD-3 (Mary Holland), and astromech LX-R5 in Star Wars: Jedi Temple Challenge, as they guide Padawans Drake and Grace (Blue Team), Griffin and Brayden (Orange Team), and Tommy and Geniah (Purple Team) in their quest to become Jedi Knights! #StayHome #WithMe"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Commencement"}, {"tag": "p", "text": "The video opens with Jedi Master Kelleran Beq telling the audience that the Jedi Knights have been the defenders of peace and justice in the galaxy for over a thousand generations. Three Jedi teams must prove their knowledge, strength and bravery to become Jedi Knights. We are introduced to the three teams: Grace and Drake of the Blue Team, Brayden and Griffin of the Orange Team, and sisters Geniah and Tommy of the Purple Team. Beq explains that the Jedi teams have to endure three trials: a strength trial on a distant world, a knowledge trial on a Jedi star cruiser, and a Jedi Temple trial."}, {"tag": "p", "text": "Beq introduces himself and his trusty droids AD-3 and LX-R5 to the Jedi Padawans. AD-3 reviews the data files. 13-year old Drake and 12-year old Grace say they are best friends but warn people about messing with them. 10-year old best friends Brayden and Griffin talk about blowing this competition away. 12-year old Tommy and 14-year old Geniah say that they have each other's backs because they are siblings. AD-3 reminds the children of the three attributes of a Jedi: strength, knowledge and bravery; which the children chant in unison."}, {"tag": "h3", "text": "Strength trials"}, {"tag": "p", "text": "Beq and AD-3 introduce the children to the strength trial, which consists of several obstacle courses including the \"Leap and Lift\" which tests their jumping, the \"Power Pull\" which tests their might, the \"Saber Stability\" which tests their balance, and the \"Swing of Strength,\" which tests their swinging. AD-3 explains that each obstacle course unlocks a piece of their lightsaber hilt. The first two teams to complete their obstacle courses will move on to the knowledge trial."}, {"tag": "p", "text": "Beq activates the floating rocks before sending the children off on their obstacle courses. The Purple Team starts with the \"Power Pull,\" which involves riding a pulley platform to the other side and unlocking their hilts with a token inside their weighted backpacks. The Orange Team undertakes the \"Swing of strength\" where participants have to swing across a rope and retrieve their hilt pieces from a box. The Blue Team starts on the \"Leap and Lift\" which involves jumping on a trampoline to reach two meiloorun fruits in order to retrieve a hilt piece from a tree set."}, {"tag": "p", "text": "Griffin and Brayden obtain their lightsaber hilts from the box as do Drake and Grace. However, Purple Team encounters a setback when Tommy falls off the pulley. Master Beq encourages them to start again, telling them that they can do it. The Orange Team catches up with the Blue Team, who are on \"Saber Stability,\" which involves navigating locks and knocking over a rock and retrieving a hilt piece form a basket."}, {"tag": "p", "text": "Meanwhile, Geniah helps lift Tommy up and they complete the Power Pull course. The two retrieve their hilt pieces. Meanwhile, Brayden has trouble retrieving his hilt piece from the log due to his height. Griffin manages to retrieve their hilts. Drake and Grace retrieve their second piece while Geniah and Tommy complete the Power Pull course."}, {"tag": "p", "text": "AD-3 reports that the score is two for the Blue Team and one each for the Orange and Purple Teams. The Purple Team obtains a hexagon while the Orange Team retrieves their second object. AD-3 updates the score to two for Blue and Orange, and one for Purple."}, {"tag": "p", "text": "Tommy helps his sister Geniah navigate the \"Swing of Strength\" course. Grace and Drake take the lead with three hilt pieces while Orange Team navigates the \"Saber Stability\" course and obtains their third piece. Purple Team obtain their second hilt piece while AD-3 gives Beq a high five. Grace completes the \"Swing of Strength.\""}, {"tag": "p", "text": "Blue and Orange are on to their fourth piece while Purple still has two more to go. Orange unlocks their last hilt piece while Drake hits a rock in the \"Swing of Strength.\" Geniah struggles to obtain her piece from the log and Tommy comes to her aid. Orange Team achieve their objectives and assemble their lightsabers. Beq congratulates them, telling them that they are ready to move to their next trial."}, {"tag": "p", "text": "The Blue team follows behind with Grace obtaining her hilt piece. Blue Team assembles their lightsaber hilts, qualifying them for the second trial. Beq tells the Padawans that their trials are complete. He congratulates Blue and Orange teams for their team work. Beq sends Purple Team back to the Jedi Order for further training. Geniah says that they learned to work together as a team while Tommy says that he had fun because he never experienced anything like that."}, {"tag": "h3", "text": "Knowledge trial"}, {"tag": "h4", "text": "Story time"}, {"tag": "p", "text": "Beq and AD-3 bring the Blue and Orange Teams aboard the Jedi cruiser Athylia, which leaves the forested planet. Beq welcomes Grace and Drake, and Brayden and Griffin aboard the Athylia. LX-R5 is also also present. The trial of knowledge involves listening to a tale and answering questions to locate items hidden within the Athylia. All of their answers will be stored inside a holocron, which is part of their third trial at the Jedi Temple."}, {"tag": "p", "text": "AD-3 tells them that Jedi Master Jabe Rann was not an artist but love watching Master Wishan sculpt earth red clay using the Force. Wishan was a Duros with red eyes who could make anything including dragons, towers, a Jedi Temple and evening a statue of Rann, complete with a lightsaber the size of a tooth pick. These statues were a 72nd birthday present for the Jedi Temple's librarian."}, {"tag": "p", "text": "Wishan used the Force to gently lay down the pieces while Jabe Rann sculpted a dry. Wishan encouraged Rann to try. Rann tried sculpting with the Force but every sculpture looked like frog-dogs with bones in their mouth. He was dismayed by his work, thinking them to be ugly. Just then, a young Padawan peeked behind the corner, trying to seal one of Wishan's pieces."}, {"tag": "p", "text": "Rann closes hid eyes and used his Force powers to create a terrifying dragon skeleton which drove the Padawan away. Rann lost his concentration and the clay splattered into twelve pieces. Wishan laughed and smiled, remarking that Rann was not a great artist but someone who could keep his sculptures safe. The two headed out for a celebratory dinner. LX-R5 beeps."}, {"tag": "h4", "text": "Knowledge quiz"}, {"tag": "p", "text": "As part of the next trial, the two teams have to split with one member searching for clues in the cockpit and the other in the engine room. After the team members go to their stations, AD-3 tells the engineers to return to their consoles once they have found the object and the pilots to click a button on the cockpit once they have found their object. Beq tells them to communicate using their headsets."}, {"tag": "p", "text": "Beq asks the engineers what creature did Rann make with the Force. After retrieving their objects, Brayden tells Beq that he retrieved a skeleton but Beq says that is incorrect. Grace replies correctly that it was a dragon, earning a point. Beq asks the pilots how many legs could Master Wishan make a dragon. Griffin correctly replies that it was ten, earning a point."}, {"tag": "p", "text": "With the two teams evenly matched, Beq asks the engineers what did every one of Rann's sculptures look like. AD-3 asks the children to have a look for her diary but Beq says this is not the time for that. Grace answers correctly that it was a frog-dog."}, {"tag": "p", "text": "Beq then asks the pilots what color was the clay that Master Wishan used. Griffin correctly answers that it was red, making the two teams even. For their fifth question, he tells them to choose a tile and asks what the statue of Rann was complete with. Grace says that it was a lightsaber the color of a toothpick."}, {"tag": "p", "text": "For the sixth question, Beq asks the pilots and engineers who were Master Wishan's statues a present for. Grace says that it was a present for his apprentice but Beq says that is incorrect. Griffin replies correctly that it was a gift for the Jedi Temple librarian."}, {"tag": "p", "text": "For the seventh question, Beq asked them what color is Master Wishan's skin. Griffin answers correctly that it was green. For the final question, Beq asks the engineers what product Master Wishan was using to sculpt. Brayden is the first to retrieve the clay, earning Master Bee's praise."}, {"tag": "p", "text": "Beq tells Griffin and Brayden that they completed the knowledge trial and will be moving on to the Jedi Temple. Brayden says that they have caught up. Master Beq sends Blue Team back to complete their training at the Jedi Temple. Drake says that the physical trial was challenging but fun while Grace says that she would look back on Jedi Temple Challenge with fond memories. AD-3 quips about gas while Beq awards the Padawans with holocrons. Under Beq and AD-3's instructions, the Orange Team takes the Jedi cruiser into hyperspace."}, {"tag": "h3", "text": "Jedi Temple trial"}, {"tag": "p", "text": "Exiting hyperspace, they approach a rocky world. Beq briefs the Orange Team about the Jedi Temple trial, which involves obtaining a kyber crystal to power up their lightsabers. He tells them to take their holocrons inside the temple and adds that he will be monitoring their progress from outside. He warns them that the dark side will be tempt them with a supposedly easy path but that it will affect the next stage of their trial."}, {"tag": "p", "text": "Griffin and Brayden enter the temple and match the colors on an orb to find the patterns. Working together, they overcome that challenge and slide into the garbage chute. There, Team Orange had to find objects to match the glyph triangles on a table to move on to their next course. The dark side manifests itself in a voice and tries to tempt the boys into touching the triangle, claiming it would make things easier."}, {"tag": "p", "text": "Brayden recalls Beq's instructions not to give in to temptation. Griffin and Brayden managed to obtain two of the objects but have to find a hexagon. The dark side voice tries to tempt them again but the two boys find the hexagon and activate the table, allowing them to move deeper into the temple."}, {"tag": "p", "text": "For the next challenger, Brayden and Griffin have to match all the power cables to their power connectors, using the shapes at the bottom as a guide. The boys work together to match the cables and connectors. They manage to complete the challenge in time and then abseil up a plastic rock face which leads to the bridge of balance. The two have to step on light discs in order to cross. Working together, Brayden and Griffin complete that challenge."}, {"tag": "h3", "text": "Knighthood"}, {"tag": "p", "text": "They then slide down a stone slide and place their kyber crystals in the pedestal of power, which releases the Kyber crystals. The two then escape the Jedi Temple and reunite with AD-3 and Beq. LX-R5 also beeps. Master Bey praises the Padawans for their connection to the Force and instructs them to place their crystals in the hilts. He tells them to place their hilts on the shrine before presenting them with their Jedi robes."}, {"tag": "p", "text": "AD-3 says she took five hours to press those robes. LX-R5 beeps but AD-3 says that the astromech droid did not help. Brayden and Griffin activate their green lightsabers in the presence of Master Beq and the droids. Master Beq pronounces them as Jedi Knights who have completed the rite of the Council by the will of the Force. The voice of Yoda congratulates Brayden and Griffin, telling them to bring hope to the galaxy."}, {"tag": "p", "text": "Griffin and Brayden expressed surprise and delight that they did well. Their advice is to keep going even though you don't think you can do it. Master Beq, the droids and Yoda wish that the Force will be with the boys always."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}