{"url": "Star_Wars:_Knight_Errant", "categories": ["Category:Real-world articles", "Category:Star Wars: Knight Errant"], "nodes": [{"tag": "h1", "text": "Star Wars: Knight Errant"}, {"tag": "p", "text": "Star Wars: Knight Errant was a series of comics set in the Old Republic era. This comic series is set during the Republic Dark Age, the last century of the New Sith Wars. Knight Errant focuses on the adventures of Kerra Holt, a young Jedi woman, in the Sith-controlled Grumani sector. The comic series also devotes a large part of its plot to examining the multiple Sith warlords that established princedoms throughout the Galaxy during the Republic Dark Age. This plot element was first introduced in Daniel Wallace's 2005 reference book The New Essential Chronology."}, {"tag": "p", "text": "In July 2012, Randy Stradley announced on the Dark Horse message boards that the series would end after the third story arc."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Coming off the heels of penning the breakout hit Mass Effect: Redemption and the gripping finale of Knights of the Old Republic, writer John Jackson Miller introduces us to Kerra Holt, a young Jedi who's about to realize that her role in the galaxy is far more important, and vastly different, than she could have ever imagined."}, {"tag": "p", "text": "Set one thousand years before Episode I, in a time referred to as the \"Dark Age of the Republic,\" this story takes place in an era when the Sith were legion and the Republic was strained to the breaking point, leaving large swaths of the galaxy with no one to turn to. This pivotal time in the history of Star Wars has been largely unexplored, until now."}, {"tag": "p", "text": "Additionally, for the first time ever, the writer of this new comics series will also be authoring a novel for Del Rey Books, set in the same era and involving the same cast of characters in an all-new adventure. It's going to be a unique event for Star Wars, and one that will give fans a whole new perspective on the galaxy."}, {"tag": "p", "text": "\"There's such wonderful chaos going on in the galaxy in this period,” said writer John Jackson Miller. \"More than a generation before Darth Bane introduced the Rule of Two, Sith Lords are colliding not just with the Republic, but with each other. Kerra's going to find that good intentions just may not be enough in a galaxy gone mad! This is a wide-open area to explore, and I'm thrilled that Dark Horse and Del Rey have given me this opportunity to do so.\""}, {"tag": "p", "text": "\"With John writing both the comics and the novel, Knight Errant will be a Star Wars story on a scale we've never undertaken before,\" said comic-series editor Dave Marshall. \"This will be a first-of-its-kind opportunity to introduce the Expanded Universe of the Dark Horse comics to the fans of the Del Rey novels and vice versa!\""}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}