{"url": "Star_Wars:_Incredible_Cross-Sections", "categories": ["Category:Real-world articles", "Category:Incredible Cross Sections", "Category:Legends reference books"], "nodes": [{"tag": "h1", "text": "Star Wars: Incredible Cross-Sections"}, {"tag": "p", "text": "Star Wars: Incredible Cross-Sections, is the first installment of DK's \"definitive\" Star Wars Incredible Cross-Sections series. It is written by David West Reynolds and illustrated by Hans Jenssen and Richard Chasemore."}, {"tag": "h2", "text": "Introduction"}, {"tag": "p", "text": "The dazzling spacecraft and exotic vehicles of Star Wars soar across our movie screens, almost becoming characters themselves with their intricate detail and fascinating designs. The richness of their conception invites curiosisty: what's inside a Jawa sandcrawler, and how does a Star Destroyer deploy its TIE Fighters? Where was Ben Kenobi when he deactivated the Death Star's tractor beam? Here at last are revealed the interior layouts and components of these amazing vessels, answering all these questions and more, showing where all the action takes place and how their systems function. The most meticulously detailed research and design work was undertaken to make the extraordinary illustrations of this book definitive. You can spot Chewbacca's bowcaster in the main hold of the Millennium Falcon, and you can see in Boba Fett's Slave I bunk the data book in which he has finally registered Han Solo as \"captured.\" Many of these craft have been mysteries; their secrets are now unveiled. Explore them for yourself, and revel in the depth of one of the greatest stories of our age."}, {"tag": "h2", "text": "Contents"}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "For the image of the TIE Advanced X1, Aurebesh letters can be seen, spelling out the name \"Jenssen.\""}, {"tag": "p", "text": "The book incorrectly identifies the BTL-A4 Y-Wing as a \"BLT-A4 Y-Wing\". This was corrected in 2007's Star Wars: Complete Cross-Sections."}, {"tag": "p", "text": "On the Death Star page, it says 'Docking Day 3207' when it is Docking Bay 327. This was also corrected in Star Wars: Complete Cross-Sections."}, {"tag": "p", "text": "While working on the Imperial-class Star Destroyers of Rogue One: A Star Wars Story, model maker John Knoll consulted Incredible Cross-Sections to make sure that the interior of the ship matched what was known about Star Destroyers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}