{"url": "Star_Wars:_Jango_Fett", "categories": ["Category:Real-world articles", "Category:Legends one-shot comics"], "nodes": [{"tag": "h1", "text": "Star Wars: Jango Fett"}, {"tag": "p", "text": "Jango Fett was a one-shot Prestige Trade paperback published in 2002. The story was continued in Star Wars: Zam Wesell."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A solitary figure, clad in the distinctive armor of a Mandalorian Warrior, cuts through a throng of soldiers, bounty hunters, and cutthroats, unleashing a barrage of blaster fire with graceful, cold-blooded dexterity. This could only be the most notorious assassin in the galaxy: Jango Fett! This Christmas, Dark Horse Comics is giving you something you've always wanted, a glimpse of Boba Fett, the most mysterious and beloved of all the Star Wars rogues. First you'll meet Jango Fett, a bounty hunter and killer for hire who is looking for a lucrative job. When Jango is hired to recover a rare and extremely valuable artifact, he thinks this could be his biggest score. Only one obstacle stands between him and his prize: a beautiful and deadly rival!"}, {"tag": "h2", "text": "Back cover summary"}, {"tag": "p", "text": "Jango Fett...the heir to armor of an infamous Mandalorian Warrior, the most feared bounty hunter in the galaxy, and the loving father to a very special son."}, {"tag": "p", "text": "When he is hired by a mysterious unseen employer to retrieve an ancient alien artifact, Jango Fett has no idea that his path will cross with that of a woman from his past—the beautiful, deadly Zam Wessel [sic]—the only other bounty hunter worthy of being called Fett's equal, and who is seeking the same prize. Somebody is playing them against one another, and their survival will depend on whether they decide to be allies or adversaries…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Jango Fett covertly entered the estate of Black Sun Vigo Antonin. He found Antonin enjoying a bottle of wine, his last bottle of wine. He quickly disposed of the Vigo and then returned to his employer for payment. When he returned to Dreddon, his employer, Fett found Dreddon dead. Shortly after this a voice called out to him to turn around slowly. When he did so he came face to face with the blaster of Zam Wesell, another bounty hunter. He instinctively drew his own weapon. Locked in a stalemate, Fett expressed his displeasure with finding his employer dead before he could collect the bounty on the Vigo. Upon hearing this, Wesell became very upset. Her contract on Dreddon was issued by Antonin; now she, too, was not going to be paid for her latest job. Seeing as neither of them was going to get paid, they parted company."}, {"tag": "p", "text": "Fett headed back to Kamino. He was looking forward to spending some time with Boba. When he entered his quarters, MU-12 informed him that a message about a job had come in while he was on his last mission. He listen to the message from a Dug named Fernooda. The message didn't go into detail about what the job was but it did ask Fett to meet him at the Twirling Twi'lek on Coruscant to discuss the details of the job. Not wanting to leave his son so soon after returning form a job, Fett reluctantly went to the meeting with Fernooda."}, {"tag": "p", "text": "Once Fett and Fernooda met, Fett was informed that the this job was to recover a piece of art work from Seylott. Fernooda explained that the piece had been part of his employer's extensive primitive art collection, and that it had recently been stolen from that collection by a native of Seylott. Fernooda informed Fett that the bounty for bringing the idol would be 50,000 Republic Credits. When Fett was informed that his employer wish to remain anonymous he demanded double the price, Fernooda agreed and Fett left to find the idol."}, {"tag": "p", "text": "The bounty hunter followed his quarry back to its home planet of Seylott. Once on the planet Fett had little problem finding the thief and the idol. The thief had placed the idol on an altar and was chanting to it. When Fett tried to take the idol, the thief attacked him and Fett mortally wounded the thief. With his dying breath, the thief beseeched Fett to leave the idol where it was saying \"...must not take away the infant again ... it must rest with the mother ... return the infant to the womb ... for it is the destroyer of worlds...\" Fett walked away with the idol. Before he had gone far, someone put a blaster to his back and told him to turn around. He found himself staring down a blaster at Zam Wesell. She informed Fett that she, too, had been hired by Fernooda, but she had decided to let Fett do all of the hard work and she would simply take the idol from him. As she was finishing her explanation, she was attacked by a giant arthropod. During the attack Wesell dropped the idol, which Fett quickly recovered. Fett then helped Wesell escape from the arthropod. Seeing that Fett had recovered the idol, as well as saved her life, she let Fett take idol back to Fernooda with out any problems."}, {"tag": "p", "text": "Fett returned to Coruscant to collect his bounty. Upon receiving his payment Fett expressed his displeasure with Fernooda for not telling him about Zam Wesell and strongly stated that he was never going to work for Fernooda again."}, {"tag": "p", "text": "After Fett left, Fernooda took the idol to his employer, Ashaar Khorda. Khorda was very pleased to have the idol back in his possession. With the idol secure, he was free to put his plan in motion. The end result would have seen the idol being used to destroy the heart of the Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "When the Twi'lek pole dancer talks to Jango Fett, the planet Coruscant is misspelled \"Corsucant\"."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}