{"url": "Star_Wars:_Jedi_Knight_II:_Jedi_Outcast", "categories": ["Category:Real-world articles", "Category:2002 computer and video games", "Category:First-person shooters", "Category:Jedi Knight games"], "nodes": [{"tag": "h1", "text": "Star Wars: Jedi Knight II: Jedi Outcast"}, {"tag": "p", "text": "Star Wars: Jedi Knight II: Jedi Outcast (aka JK2, JKO, or JO) is a Star Wars computer game released in 2002. It was developed by Raven Software and published, distributed and marketed by LucasArts in North America and by Activision in the rest of the world. It was released for Microsoft Windows, Apple Macintosh, Nintendo GameCube and Microsoft Xbox, and was released for Nintendo Switch and PlayStation 4 on September 24th, 2019. It is powered by the Quake III Arena engine. This game was followed by the very similar sequel Star Wars: Jedi Knight: Jedi Academy. The game was generally well received and is praised for its advanced lightsaber dueling."}, {"tag": "p", "text": "On September 4, 2019, it was announced Jedi Academy would also be released in \"early 2020\" for the Nintendo Switch and Playstation 4."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The game takes place in 12 ABY, two years after the end of Star Wars: Jedi Knight: Mysteries of the Sith. Like its predecessors, the game has Kyle Katarn as the protagonist. Since nearly falling to the dark side, Katarn had given up his lightsaber and the Force. He now works as a mercenary for the New Republic alongside his partner and lover, Jan Ors."}, {"tag": "h3", "text": "Mission to Kejim"}, {"tag": "p", "text": "Mon Mothma contacted Katarn and Ors to investigate an Imperial Remnant base on Kejim after the New Republic intercepted a suspicious transmission coming from the base containing keywords such as \"Reborn\" and \"Valley of the Jedi.\" After infiltrating the base and fighting off Remnant forces, Katarn and Ors discovered that the Remnant was conducting experiments on crystals capable of storing the power of the Force."}, {"tag": "h3", "text": "Mission to Artus Prime"}, {"tag": "p", "text": "Tracing the crystals' origin to Artus Prime in the Outer Rim, Katarn and Ors found that the Imperial Remnant had turned the remote world into a mining facility and imprisoned its inhabitants for experimentation. Katarn infiltrated the facility and freed the prisoners. After fending off Remnant forces and evacuating the prisoners, Katarn went to the rendezvous point to meet Ors. He saw that Ors had been captured by Desann, a Dark Jedi, and his apprentice, Tavion. Having renounced the ways of the Force, Katarn was powerless against Desann, who threw him around and choked him with the Force. Desann taunted him before ordering Tavion to execute Ors. The two Dark Jedi then fled."}, {"tag": "h3", "text": "Returning to the Valley of the Jedi and retrieving his lightsaber"}, {"tag": "p", "text": "Enraged by his lover's death, Katarn returned to the Valley of the Jedi to regain his Force powers quickly, and then headed off to the Jedi Academy on Yavin 4 to retrieve his lightsaber. Katarn, however, did not realize that Desann and Tavion had secretly followed him to the Valley, having theorized that he would go there to seek the power of the Force in his quest for vengeance. Desann used the Valley's power to create an army of Reborn."}, {"tag": "h3", "text": "Trials on Yavin 4"}, {"tag": "p", "text": "Upon arriving at the Jedi Academy, Katarn met Luke Skywalker and asked for his lightsaber and information on Desann. The Jedi Master told him about Desann's background and said that he had to pass a series of trials to get his lightsaber back. Katarn passed the trials easily. Skywalker realized that Katarn had been to the Valley and cautioned him on the recklessness of his actions. He then directed Katarn to Nar Shaddaa, where he could find Reelo Baruk, a Rodian crime lord who would have information on Desann's whereabouts."}, {"tag": "h3", "text": "Mission to Nar Shaddaa"}, {"tag": "p", "text": "In Nar Shaddaa, Katarn visited Baruk's bar and tried to ask the Chiss bartender where Baruk was. A fight broke out after Katarn revealed himself as a Jedi. While fending off attacks by Baruk's thugs, Katarn made his way to Baruk's hideout. He encountered Lando Calrissian, who was imprisoned in the dungeon. Calrissian had sought out Baruk after learning that he was linked to a smuggling ring on Bespin, but was captured before he could find out more. Katarn freed Calrissian and they tried to leave Nar Shaddaa on Calrissian's ship, the Lady Luck, but ran into trouble with Baruk and his thugs. Katarn shot down Baruk with the ship's guns and they moved on to Bespin."}, {"tag": "h3", "text": "Mission to Bespin"}, {"tag": "p", "text": "On Bespin, Calrissian let Katarn alight at the lower levels of Cloud City while he headed to the upper levels to gather security forces to deal with Baruk's thugs and Remnant forces. Their goal was to trap Desann in the middle levels before he could escape. While making his way upward through the Bespin undercity, Katarn encountered Reborn for the first time and defeated them. He tracked down and confronted Tavion, who told him that Ors's death was part of their plan to trick him into revealing the location of the Valley of the Jedi. An enraged Katarn defeated Tavion and started Force choking her. Pleading for mercy, she told him that Ors was actually still alive on board the Doomgiver. Katarn spared her and she fled in shame. He then boarded an automated hauler, which brought him to a Remnant base in the Lenico Belt."}, {"tag": "h3", "text": "Mission to the Cairn Installation"}, {"tag": "p", "text": "While searching for the Doomgiver in the Cairn Installation, Katarn had an unexpected encounter with Skywalker. After teaming up to defeat a group of Reborn, they shared information on what they had found and came to the conclusion that Desann not only wanted to create a Reborn army, but also equip them with armor made from cortosis, a rare mineral that can resist lightsabers. Despite the odds, Skywalker believed that the Jedi's training and discipline would ultimately give them an advantage over the Reborn. They then parted ways. Making his way stealthily across the Cairn Installation, Katarn saw the Remnant assembling AT-RDPs, AT-STs, and other assault craft in preparation for a full-scale planetary invasion. He also encountered and defeated some Shadowtroopers (Reborn in cortosis armor). After sneaking on board the Doomgiver, Katarn saw Desann and Skywalker locked in a lightsaber duel; Desann used the Force to push back Skywalker and boarded the Doomgiver."}, {"tag": "h3", "text": "On board the Doomgiver"}, {"tag": "p", "text": "Aboard the ship, Katarn learned that Desann and Galak Fyyar were planning to send their army to invade the Jedi Temple on Yavin IV, destroy the Jedi and restore the Galactic Empire. Katarn managed to send a warning to Rogue Squadron about the impending invasion. By the time the ship exited hyperspace, Katarn had found and saved Ors. He defeated Fyyar and sabotaged the Doomgiver's shields, rendering the ship and its cargo of assault craft vulnerable to attack by Rogue Squadron. Along with Ors, Katarn narrowly escaped the destruction of the Doomgiver in an escape pod. Despite the timely appearance of Rogue Squadron, enough Remnant forces survived to mount a large-scale invasion of the moon."}, {"tag": "h3", "text": "Defending the Jedi Academy"}, {"tag": "p", "text": "Upon landing on Yavin IV, Ors left to link up with Republic forces to counter the Remnant, while Katarn made his way to the Jedi Academy. After passing through swamps and canyons, and fighting off Remnant forces and AT-STs along the way, Katarn finally reached the Jedi Academy, where he joined his fellow Jedi in fighting the Reborn and Shadowtroopers. He tracked down Desann to the catacombs below the Jedi Academy, and confronted the Dark Jedi face-to-face."}, {"tag": "p", "text": "Despite learning of the Doomgiver's destruction, Desann refused to acknowledge defeat and engaged Katarn in a lightsaber duel. Katarn ultimately defeated and slew Desann. Upon learning of Desann's defeat, the remaining Remnant forces, Reborn and Shadowtroopers surrendered to the Jedi and New Republic, thus ending the conflict."}, {"tag": "p", "text": "After everything was over, Skywalker asked Katarn what he would like to do next. Katarn replied that he would keep his lightsaber, and that he and Ors had earned a long vacation on the beaches of Spira."}, {"tag": "h3", "text": "Levels"}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Following The Walt Disney Company decision to close LucasArts on April 3rd, 2013, the developers at Raven Software released the source code for the game on SourceForge under GNU GPLv2 licensing. However, the source code for both games disappeared from SourceForge without an explanation. SourceForge later explained that Raven had requested the removal of the code, and it is believed that this was due to the presence of proprietary code that was not intended to be made public. Later, based on the source code released by Raven, a group of coders by the name of JACoders created OpenJK, an effort to maintain and  improve the game engine, without any modification to gameplay, for both Star Wars: Jedi Knight II: Jedi Outcast (singleplayer) and Star Wars: Jedi Knight: Jedi Academy (single and multiplayer), maintaining full backwards compatibility with the existing games."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}