{"url": "Star_Wars:_Knights_of_the_Old_Republic:_Days_of_Fear", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Knights of the Old Republic: Days of Fear"}, {"tag": "p", "text": "Star Wars: Knights of the Old Republic: Days of Fear is the fourth story arc in the Star Wars: Knights of the Old Republic comic book series and the first in the four-part Days/Nights cycle of story arcs. A three-part story arc, Days of Fear breaks up the core cast of the series, and also introduced the characters of Saul Karath and Carth Onasi, who had previously appeared in the Star Wars: Knights of the Old Republic video game."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Last Resort leaves Zayne and Gryph on Ralltiir, where Gryph contracts Slyssk, a Trandoshan ship thief, in order to secure another ship. Unfortunately for them, the vessel that Slyssk steals, the Little Bivoli, turns out to be a provisioning ship for the Republic Navy, and as such is noticed by the Republic fleet above Ralltiir. Zayne, Gryph and Slyssk are forced to join the fleet, as it moves to the planet Serroco, and pose as fringers, so as to avoid suspicion."}, {"tag": "p", "text": "Meanwhile, having parted with Zayne and Gryph, the Last Resort heads for the Arkanian homeworld, Arkania, where Jarael hopes to find a cure for Camper's illness. They are engaged by an HK-24 series assassin droid sent after Camper, hidden inside a shipment crate. After attempting to help Jarael (whom the invader does not care about) and Camper, T1-LB proves to be no match for the HK-24; however, Rohlan Dyre, hiding aboard the ship, reveals himself and destroys the droid."}, {"tag": "p", "text": "At Camp Three on Serroco, Zayne has a Force vision of the Mandalorians devastating the planet and tries to alert Gryph, but the latter dismisses his warnings, being too concerned about his own profit from the Little Bivoli fringer business. Desperate to alert Saul Karath, now a Rear Admiral, Zayne stows away on Lieutenant Carth Onasi's ship when it heads for Karath's flagship, the Courageous; however, he is not believed and is detained on the Courageous as a suspected Mandalorian spy. Shortly thereafter, the Mandalorian fleet seen in Zayne's vision appears out of hyperspace. Strangely, though, the Mandalorian fleet does not engage the Courageous, instead launching missiles around it toward the planet's surface."}, {"tag": "p", "text": "While Carth manages to get seventeen of the Stereb cities evacuated underground, the Battle of Serroco results in a major disaster for the Republic. The Little Bivoli is destroyed among most of the Republic fleet; Gryph's and Slyssk's respective fates were unknown after the battle."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "As Knights of the Old Republic became successful in early 2006, Miller began looking forward at 2007, and he developed an expansive storyline which would bring in multiple characters but could be broken down into smaller chunks so that the series' artists could alternate. This plan led to the development of four interlocking arcs: Days of Fear, Nights of Anger, Daze of Hate, and Knights of Suffering—the names of which stem from Jedi Master Yoda's warning from Star Wars: Episode I The Phantom Menace: \"Fear leads to anger; anger leads to hate; hate leads to suffering.\" The names of the arcs were first announced officially in the Drawn By The Force department of Star Wars Insider 91, which discussed the upcoming arcs. While planning out the plots of the arcs, Miller was at one point forced to put every character's story path on a dry-erase board so that he could keep track of them all. Taking inspiration from Roy Thomas's decision to split up the main characters of the Marvel Star Wars comics in Star Wars 7, Miller decided to break up the crew of The Last Resort in the opening pages of Knights of the Old Republic 13. The four arc titles came to be referred to collectively as Days/Knights first unofficially by Miller himself and later officially, as part of the publisher's summary for issue #23. Miller later confirmed that the look that Carrick gives the \"camera\" in a scene in Weaver's Days of Fear, Part 1 was inspired by the look that Jim, a character from the US version of the television show The Office, often gives the camera."}, {"tag": "p", "text": "Also in issue #13, the creative team introduced Zayne Carrick's phrikite vambraces, the character's first unique piece of equipment and an element that had been a part of Brian Ching's design for the character since his inception. Dustin Weaver handled artwork duties for issues #13 and #15, while Brian Ching drew issue #14, the second part of Days of Fear. Days of Fear also saw the return of the backup news organs, with The Admiral's List: Jimas Veltraa Memorial Edition, The Adjudicator Special Report: The Outer Rim, and The Taris Holofeed: Siege Edition accompanying the three issues of the arc respectively. The character of Slyssk was partially inspired by Miller's childhood action figure of the Trandoshan bounty hunter Bossk, which had wider eyes than in The Empire Strikes Back, and the name of the Little Bivoli —a ship designed by Dustin Weaver—is a reference to a foodstuff in the MMORPG Star Wars Galaxies. The Reliance's name comes from the same source as that of the Courageous: a ship in the British Navy of the Napoleonic era of the same class as the Courageaux. Miller's grandfather served aboard a large vessel known as a Landing Ship-Tank in World War II, and the LSTs—which were used to deploy smaller vehicles and machinery onto battlefields—inspired the scenes on Serroco's surface, particularly those that dealt with the logistics of the Republic Navy. The Deadweight was also inspired by the LSTs; the Knights of the Old Republic Campaign Guide identified the ship's original designation as CBX-560, a reference to USS LST-560, the ship that Miller's grandfather served on."}, {"tag": "p", "text": "Days of Fear, Part 2 introduces the character of Carth Onasi, a companion character in the original Knights of the Old Republic game, and the creative team worked hard to ensure that he was consistent with his game portrayal and yet also present surprises. Looking back at the issue, Miller acknowledged the fact that he unknowingly staged the dialogue similar to that of the game, in that Carrick—like the player character—receives long expositions from Onasi in response to single-line observations and questions. Miller and Ching plotted out a vision of Serroco's destruction that was relatively similar to how the actual event would appear, and in the production notes for the issue, Miller acknowledged the questions of fans as to whether a bearded crew member on the Courageous from issue #8 was Onasi. Miller had intended Onasi to be present at Vanquo on the Courageous, but he did not specifically direct Dustin Weaver to draw the character, and Miller himself assumed that Weaver had drawn Onasi—only to later learn from Weaver that the crewmember was actually a rendition of Miller himself. Zayne Carrick's reaction to the death of the Sterebs in Days of Fear, Part 3 was inspired Miller's personal reaction to the events of September 11, 2001. Ching and Atiyeh drew the cover artwork for Days of Fear, and the cover for Part 3 was directly suggested by Miller: he noted to Brian Ching how he liked one of Frank Miller's covers for Daredevil that featured Daredevil cowering on a white background. Ching took one of Carrick's postures in the previous issue and added Mandalore's mask and the flames. An earlier promotional image featured a redder mask, though the mask was ultimately changed to a brighter gold by the time of the release. Issue #15 was delayed for two weeks from its original scheduled release date of March 28, and was instead published on April 11."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}