{"url": "Star_Wars:_Jedi_Temple_Challenge_-_Episode_5", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Jedi Temple Challenge"], "nodes": [{"tag": "h1", "text": "Star Wars: Jedi Temple Challenge - \"Episode 5\""}, {"tag": "p", "text": "\"Episode 5\" is the fifth episode of Star Wars: Jedi Temple Challenge, a children's game show set in the Star Wars universe. The episode premiered on July 1, 2020 on the Star Wars Kids YouTube channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Join Jedi Master Kelleran Beq (Ahmed Best), wise-cracking protocol droid AD-3 (Mary Holland), and astromech LX-R5 in Star Wars: Jedi Temple Challenge, as they guide Padawans Miguel and Kaylie (Blue Team), Gigi and Skyla (Orange Team), and Giovanni and Jayden (Purple Team) in their quest to become Jedi Knights!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Commencement"}, {"tag": "p", "text": "The episode opens with an introduction by Jedi Master Kelleran Beq that the Jedi Knights have been the guardians of peace and justice in the galaxy for over a thousand generations. Three Padawan teams must prove that they have the strength, knowledge and bravery to become Jedi Knights."}, {"tag": "p", "text": "We are introduced to 10-year olds Miguel and Kaylie of the Blue Team, who says that they do everything together. They are followed by 12-year old Gigi and 13-year old Skyla of the Orange Team, who say they are not afraid of anything. We are then introduced to 10-year olds Giovanni and Jayden of the Purple Team, who say they are best friends."}, {"tag": "p", "text": "Master Beq explains that the contestants have to endure three trials: the strength trials on a distant world, the knowledge trials aboard a Jedi star cruiser, and a trial of bravery inside the Jedi Temple to become Jedi Knights. He asks if the Jedi Padawans will be tempted by the dark side or if they will keep their minds focused on the light side of the Force."}, {"tag": "h3", "text": "Trials of strengths"}, {"tag": "p", "text": "On the forested world, Master Beq introduces himself and his trusty droids AD-3 and LX-R5 to the contestants. Beq asks the children if they are ready to become Jedi Knights and they all shout yes in unison. AD-3 greets the Padawans and brings up their data files. In a video, best friends Miguel and Kaylie say that the Blue Team is the best team because they are going to crush the other teams and boast that they have confidence. For the Orange Team, best friends Gigi and Skyla say that they want the other teams to know that they came here to win and that losing is not an option. For the Purple Team, Jayden says that some people have brains and others have brawn. Jayden says that he is the brains and that his best friend Giovanne has brawn."}, {"tag": "p", "text": "AD-3 reminds the contestants about the attributes of a Jedi and the contestants repeat strength, knowledge, and bravery. Master Beq agrees and explains that they will face a series of trials. The first set of trials is the Strength Trials, a Jedi obstacle course which they must complete in order to build their lightsaber. AD-3 explains that the Leap and Lift tests their jumping, the Power Pull tests their tests their might, Saber Stability tests their balance, and the Swing of Strength tests their swinging and strength. She explains that every obstacle they complete unlocks a piece of their lightsaber hilt. The first two teams to finish every obstacle will move on to the Knowledge Trial and be one step closer to entering the Jedi Temple."}, {"tag": "p", "text": "Master Beq tells the Padawans to place their foot on the platform before sending them off. Blue Team heads to the Swing of Strength where they need to figure out which key to bring with them in order to unlock their hilt piece. Kaylie picks up her first piece. Skyla and Gigi attempt the Power Pull, working together to pull their sled to the other side so that they can open their bag packs to reveal their hilt piece. Purple Team sweep through the rocks in Saber Stability and navigate over the logs to access their hilt piece. Master Beq praised Jayden and encourages him to maintain his balance, saying that it reminds him of his days as a Padawan. Beq reminds AD-3 that they called him the \"Sabered Hand\" but the droid begs him to stop repeating it everyday."}, {"tag": "p", "text": "Blue Team complete the Swing of Strength and unlock their piece while Orange Team obtain their piece from the Power Pull trial. Purple Team also obtains their hilt piece. AD-3 reports that every team has obtained their first hilt piece and reminds them to head back to the assembly table. Blue Team is the first to return and gets their first score. Orange Team are next and hand in their hilt piece before heading to the Swing of Strength. Meanwhile, Purple Team carefully make their way back across the logs with their first hilt piece."}, {"tag": "p", "text": "Blue Team heads to Leap and Lift where they have to collect two Meiloorun fruits to retrieve their hilt pieces. Master Beq longs to be a Padawan again and wishes he could cook. AD-3 responds that she has not seen him cook once and LX agrees."}, {"tag": "p", "text": "Kaylie struggles to reach her hilt piece while Miguel tells her to hang in there. Master Beq reports that Orange Team is racing through the Swing of Strength. Purple Team returns with their first hilt piece to the assembly table, tying the teams one to one."}, {"tag": "p", "text": "Purple Team then rushes over to Power Pull while Orange Team scrambles back down to the assembly table with their second hilt piece, putting them in the lead. Orange Team races off to Saber Stability while the Blue Team continues to struggle with Leap and Lift. AD-3 tells them to use their legs before correcting herself to say use the Force."}, {"tag": "p", "text": "Orange Team navigates their way across the logs and knock down rocks, earning the praise of Master Beq and AD-3. Beq quips about being the \"Sabered Hand,\" annoying AD-3. Jaden and Giovanni pull themselves across the trench in their sled and reach the box. They unlock their second hilt piece."}, {"tag": "p", "text": "Meanwhile, Orange Team members Gigi and Skyla unlock their third hilt piece. Master Beq encourages Blue Team to use the Force and Miguel manages to grab hold of their second hilt piece. LX beeps while AD-3 reports as Orange Team returns to the assembly table with their third hilt piece, furthering their lead. Orange Team passes Blue Team as they make it to the Pull and Life."}, {"tag": "p", "text": "Blue Team returns with their second hilt piece, placing them second place. Master Beq encourages Jaden to help Giovanni as they return across the sled. Blue Team head to their third obstacle called Saber Stability. Master Beq praises Miguel for his hit but Kaylie falls down the logs. Kaylie has to return to the start before she can continue."}, {"tag": "p", "text": "Meanwhile, Skyla manages to obtain Orange Team's fourth hilt piece, earning the praise of AD-3. Master Beq tells them to make their way back to the assembly table and assembles their lightsaber. Blue Team wades through Saber Stability and obtain their third hilt piece. Purple Team finally returns with their second hilt piece and Master Beq reminds Jaden to help Giovanni with his bagpack."}, {"tag": "p", "text": "Orange Team finishes assembling their hilt pieces while Purple Team returns with their second hilt piece. AD-3 announces that Orange Team is ready to head to the Knowledge Trial while Master Beq tells them to return to their spots. He reassures Blue and Purple Team that they are still in the races. Gigi And Skyla encourage the other contestants."}, {"tag": "p", "text": "Blue Team returns with their third hilt piece, placing them second in the lead. Meanwhile, Giovanni obtains Purple Team's third hilt piece. Master Beq encourages the Purple Team while the Blue Team embarks on the Power Pull course. Purple Team returns to the table with their third piece. As Blue Team obtain their peace from the box, Jaden attempts Swing of Strength but falls down. While Jaden makes a second attempt, the Blue Team navigate back on the sled with their fourth hilt piece."}, {"tag": "p", "text": "AD-3 warns the Purple Team that they are running out of time. The Blue Team returns to the assembly table with their hilt piece and assemble their lightsabers. Giovanni makes an attempt with the swing but falls down as well. After Blue Team finishes assembling their lightsabers, AD-4 announces that the Orange and Blue will be moving on to the Knowledge Trial."}, {"tag": "p", "text": "Master Beq congratulates the Orange and Blue teams while encouraging the Purple Team to keep their chins up, telling the boys that their effort was strong but that they must return to the Jedi Order to continue their training. He wishes that the Force will be with them. In a follow-up video, Jade says that he though that the Trials of Strengths would be very easy but realized that it was very hard. His advice is to believe yourself and that if you lose it is okay."}, {"tag": "p", "text": "Master Bey asks Teams Orange and Blue if they are ready. The children shout yes. AD-3 says no but adds that she was joking. LX-R5 rolls along after beeping."}, {"tag": "h3", "text": "Knowledge Trial"}, {"tag": "h4", "text": "Story time"}, {"tag": "p", "text": "In space, Master Beq welcomes Padawans Kaylie, Miguel, Gigi and Skyla aboard the Jedi star cruiser Athylia, asking them if they are ready for the next trial. The Padawans shout yes. Master Beq explains that AD-3 will tell them a tale and to remember as much as they can. He explains that they will have to find items hidden throughout the ship and that each correct item they find will be stored as information inside their holocrons, which they will need inside the Temple. The first team to answer five answers correctly will receive their holocron and move on to the Jedi Temple. Beq asks if they are ready to hear their tale."}, {"tag": "p", "text": "AD-3 says this is her favorite part because it is all about her. LX-R5 shakes his head and beeps. AD-3 explains that Reen and her six-armed partner Kreven were hired to fly the Trustworthy to transport cargo for the Guild of Technicians. Suddenly disaster struck, two of their six thrusters exploded, forcing them to make an emergency landing on a nearby forested moon. It turns out that Trustworthy is a poor name for a ship with exploding thrusters."}, {"tag": "p", "text": "While making their repairs, they were attacked by a band of furry Ewoks. Valiantly fending them off, they quickly finished their work and were about to jump into hyperspace when they heard a noise in the corridor of the Trustworthy. Reen and Kreven found a stowaway Ewok rummaging through their green toolbox. Reen shouted at the creature as it lobbed its spear at the pair before scampering. Luckily, it missed."}, {"tag": "p", "text": "They chased the creature to the power core where they found it pushing all 16 buttons and pulling all eight levers. The Ewok flipped a red switch and everything including Reen, Kreven, and the Ewok floated to the ceiling, bumping into each other in all the worst places. Reen yelled that he has shut off the artificial gravity and that Ewok and I just kissed by accident. A comlink floated up from the floor and the curious Ewok grabbed it, pressing buttons and accidentally opening a channel."}, {"tag": "p", "text": "\"Kreven, you blue herd pile of wampa bait, did you sabotage the thrusters so that we could steal the cargo,\" the pirate shouted."}, {"tag": "p", "text": "Reen was shocked. Kreven had double-crossed her. She grabbed three pairs of binding cuffs and slapped on Kreven's six hands but she wouldn't have known that Kreven was the traitor had it not been for the inquisitive stowaway. Maybe the Ewok would make a good partner. After all, things could only improve after their awkward encounter. LX-R5 beeps."}, {"tag": "h4", "text": "Question time"}, {"tag": "p", "text": "Master Beq asks the children to pick who wants to be the pilot and who wants to be the engineer. Gigi asks Skyla if she wants to be the engineer while Kaylie tells Miguel that he should be the pilot After the children pick their roles, AD-3 sends the Padawans to their stations. AD-3 reminds the engineers to obtain items from the cabin and place them on the console while pilots have to press the correct button on the cockpit. Beq reminds them to use their headsets and that communications will be vital. He asks the Padawans if they are ready and they shout yes."}, {"tag": "p", "text": "Master Beq asks the engineers the first question, telling them that they have to find a tile and to find a picture of a stowaway. Over their headsets, Kaylie asks Miguel was is a stowaway. AD-3 reminds them that they can communicate over their headsets. Miguel says that it is the furry one. Kaylie correctly picks an Ewok."}, {"tag": "p", "text": "For the second question, Master Beq then asks the pilots how many arms did Kreven have. Gigi correctly responds that Kreven had six arms. The two teams are tied."}, {"tag": "p", "text": "For the third question, Beq asks both the pilots and engineers the name of the ship. Gigi responds that the ship was called the Trustworthy. This places Orange team in the lead by two points."}, {"tag": "p", "text": "For the fourth question, Beq asks the engineers to pick a tile representing the object that the Ewok grabbed which floated up from the floor. Gigi advises Skyla over the headset. Skyla picks a comlink, placing Orange team in the lead by three points."}, {"tag": "p", "text": "For the fifth question, Beq asks the pilots what color switch did the Ewok flip. Miguel correctly picks red, gaining the Blue Team two points."}, {"tag": "p", "text": "For the sixth question, Beq asks the engineers what item did Reen slap on Kreven's hands, telling them to choose their items. Kaylie obtains a pair of binding cuffs, gaining the Blue Team three points. The two teams are tied by three to three. AD-3 remarks that they are all tied up while LX-R5 squeals."}, {"tag": "p", "text": "For the seventh question, Beq asks the pilots how many of the ship's thrusters exploded. Gigi picks six but Master Beq points out that is incorrect. Miguel correctly picks two, giving Blue Team a lead of four points over Orange Team's three."}, {"tag": "p", "text": "For the eighth question, Beq asks the teams a verbal question: what did the Ewok shut off? Miguel correctly picks the artificial gravity."}, {"tag": "p", "text": "Master Beq announces that the trial is complete and that Blue Team will be progressing to the Jedi Temple trial. In a follow-up video, Kaylie recalls that the Knowledge Trial was a close race and that the two teams were neck in neck but then they accumulated enough points to win. Miguel says that he learnt to communicate with his partner because it will make it easier for them."}, {"tag": "p", "text": "Master Beq reassures Skyla and Gigi that their path to becoming a Jedi is not over but that they must return to the Jedi Order to continue their training. In a follow-up video, Skyla opines that she and Gigi did very well, their communication was great but that the Blue Team was a little bit faster and listened a little bit more. She thinks that they could have listened a little bit more. Beq wishes that the Force will be with them before sending them out on their way."}, {"tag": "p", "text": "As they leave, AD-3 tells LX-R5 that he must get his exhaust under control. The astromech droid beeps. After the doors shut, Master Beq thanks Kaylie for completing the Knowledge Trial and presents them with the holocrons. LX-R5 remarks there is the Force again. Beq tells the Padawans to take their holocrons and to take their seats in the cockpit, adding that the coordinates have already been set into the hyperdrive. The two raise the levers, taking the Ayhlia to a rocky planet circled by two moons."}, {"tag": "h3", "text": "Trial of Bravery"}, {"tag": "p", "text": "After landing, Master Beq congratulates Jedi Padawans Kaylie and Miguel for making it to the Trial of Bravery in the Jedi Temple. AD-3 mumbles about the Temple. Master Beq tells the Padawans that they have both proven to have a deep connection to the Force and that the time has come to put all they have learned into practice. He tells them to keep their minds focused on the Force and to ignore the temptations of the dark side that may trick you into taking the easier path only to make the next challenge more difficult."}, {"tag": "p", "text": "AD-3 adds that they have to leave their lightsaber hilts back here on the shrine. Master Beq adds because the kyber crystals that power their lightsabers are inside the Temple. He says that will be waiting outside using his connection to the Force to keep an eye on them. Beq asks the Padawans if they are ready and they both say yes. Beq says that time is of the essence while AD-3 tells them to run."}, {"tag": "p", "text": "Kaylie and Miguel climb up the Summit Scramble to reach the Galaxy Globe. They have to work to work together to match the correct color combination of the flashing orbs on the control panel before moving on to the next challenge. The work together to match the colors, activating the globe."}, {"tag": "p", "text": "They then split up and slide down the garbage masher where they have to work together to assemble the correct color code to unlock the doors. Kaylie and Miguel work together to assemble the color codes on a panel with Miguel giving instructions to Kaylie. As they are working, the dark side voice tempts them by asking them to connect with the dark side, claiming that he will release them from this challenge."}, {"tag": "p", "text": "While Kaylie matches the colors, the dark side tries to sow discord between the Padawans by asking Kaylie to touch the button. The two work together to match the color tiles but fail in that attempt. The dark side voice tries to discourage but the friends find the right tiles, allowing them to unlock the doors."}, {"tag": "p", "text": "They then enter the Power Connectors chamber where they have to connect all power cables to matching power connectors in order to move on. The two work together to match the various cables, using the shapes as guides. In a follow-up video, Kaylie recalled that they were so close and that they needed to be strong and have bravery. Miguel adds agility and strength. After connecting all the cables, the door opens and the Padawans scale the frigid ridge using ropes."}, {"tag": "p", "text": "They then reach the Bridge of Balance where the Padawans must balance on discs to allow them to cross. Miguel takes the lead and encourages Kaylie to cross the bridge, racing against time. The two slide down a slide but run out of time."}, {"tag": "h3", "text": "Taking a step back"}, {"tag": "p", "text": "Master Beq says that their time has run out and asks them to return to him at the entrance to the Temple. Miguel grumbles that they were so close. Master Beq tells the Padawans they were seconds away while AD-3 reassures them that it was a great effort. Master Beq encourages the Padawans by telling them that while they may not have completed their trial today, their determination allowed them to overcome the dark side. He tells them that they are on the right path and that he can see them becoming great Jedi in the future."}, {"tag": "p", "text": "LX-R5 beeps while Yoda tells the Padawans to trust in the Force and that they will become great Jedi one day. In a follow-up video, Kaylie opines that they did well but that they were a few seconds away from the finish. She adds that they were so close. Miguel says that his favorite part was the rope swinging while Kaylie says that her personal favorite is the engineering one where they had to whisper the answers to each other through the microphone. She says that the frozen part was so crazy because she kept on slipping. Yoda, Beq and AD-3 wish the Padawans that the Force will be with them always."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}