{"url": "Star_Wars:_Knights_of_the_Old_Republic:_Knights_of_Suffering", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Knights of the Old Republic: Knights of Suffering"}, {"tag": "p", "text": "Knights of Suffering is the seventh story-arc of the Star Wars: Knights of the Old Republic series of comics."}, {"tag": "h2", "text": "Opening Crawl"}, {"tag": "p", "text": "Much has changed since Zayne Carrick fled from the border world of Taris. Falsely accused of killing his fellow Jedi students, the hunted Padawan has traveled far to escape his murderous former Masters."}, {"tag": "p", "text": "But Zayne's thoughts have never strayed from the world he left behind - or from Shel Jelavan, the young woman who befriended him there. His concerns only grow when the crusading Mandalorians lay siege to the planet."}, {"tag": "p", "text": "It is a message from another friend, one thought dead, that finally draws him back to the war-torn world. Hearing that Gryph is alive and well - and also working with the Taris resistance - Zayne makes a return. But forces are in motion to assure his homecoming will not be a welcome one..."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "After hearing Gryph is alive and well on Taris, the group, along with Alek and Dob Moomo, return to the planet, now under Cassus Fett's control. Using the Mandalorian armor that was given to him by Rohlan, Zayne dives into the Lower city from above. Once there, he manages to find the Hidden Beks in one of the alleys, and reunites with Gryph. After returning to the Beks' base, Zayne learns of the peculiar situation on the lower city: the Constable refuses to cooperate with the Beks, believing they've kidnapped her children. Moreover, Gryph is involved with Jervo Thalien, the head of Lhosan Industries, who hired Gryph to find the Tarisian senator Haydel Goravvus in the Lower City. In return, the bounties on Gryph and Zayne's heads will be removed."}, {"tag": "p", "text": "During their stay in the Beks' base, Constable Noana Sowrs's children are found, and it's decided that they should return them to the Constable and become a part of the official resistance. In the Constable's base, Zayne meets Shel Jelavan, sister of the murdered Padawan Shad Jelavan and a onetime friend of him. Unfortunately for Zayne, Shel believes that Zayne was responsible for Shad's death; Raana Tey, Shel's mentor and influencer, encourages her to kill Zayne. A fight ensues between Raana and Del Moomo, who distracts her with blaster shots as Gryph disarms Shel. At this point, Senator Goravvus steps in, stopping the fight and ordering Raana to suspend her pursuit of Zayne—while at the same time relieving the tension between the Beks and the Taris Civil Authority officers by pointing the Constable to her children."}, {"tag": "p", "text": "After the encounter, Gryph tells the Senator about Jervo searching for him. Using Gryph's briefcase communicator, they contact Jervo on Coruscant—but at the same moment, Del Moomo captures Goravvus. It is revealed that, after the Senator threatened to expose Lhosan Industries' illegal practices following the company's decision to abandon Taris, Jervo decided to dispose of him by placing a bounty on him for the Moomo Brothers to pursue. Raana appears and orders Del to release his hostage, which he does; Jervo, presuming that she was sent by the Chancellor to find Goravvus, and proceeds with a backup plan by activating a bomb in Gryph's briefcase. However, the bomb does not detonate due to the briefcase having previously taken a blaster shot. Using the situation to his advantage, Goravvus blackmails Jervo—and Lhosan Industries—into offering military aid for the Tarisian Resistance."}, {"tag": "p", "text": "Meanwhile, Zayne has a heated argument with Shel, during which he unsuccessfully tries to convince her that he did not murder her brother, while Raana tries to convince her that Zayne has fallen to the dark side. Goravvus interrupts the debate, informing them that Cassus Fett has come to Taris and is residing in the former Jedi Tower. When the Resistance members—including the Beks and Constable Sowrs's officers—gather in their headquarters, devise a plan to destroy the Tower, using parts recovered from Jervo's bomb in conjunction with the Resistance's own stockpiles of explosives. Zayne, Raana and Shel volunteer for this mission, the latter treating it as little more than an opportunity to fulfill her revenge against Zayne. Raana discreetly provides her with her brother's lightsaber crystal, which she wants her to install in the lightsaber itself—which is locked in the Jedi Tower—and then use it against Zayne."}, {"tag": "p", "text": "Still meanwhile, on the orbit aboard the Moomo Williwaw, Jarael, Rohlan and Alek wait for a signal from below. Noticing that Jarael is distraught over Camper's loss, Rohlan offers to \"occupy her mind\" by putting her in a sparring duel against Alek, which Jarael wins. However, afterwards, Alek's pursuit for a more romantic relationship, which Rohlan secretly observes, makes Jarael even more troubled, prompting her to leave."}, {"tag": "p", "text": "Back on Taris, Zayne and Shel infiltrate the Jedi Tower. After seeing him shed a tear over her brother's death, Shel can't bring herself to kill Zayne. After Zayne leaves to see if Cassus Fett is in the building, Raana enters. Enraged that Shel didn't kill Zayne, she runs after him, determined to end the threat he posed. Meanwhile in the tower's council chamber, Zayne finds out Fett moved out to attack the Taris Resistance, but his way out is blocked by Raana, who intends to kill him where no one can see them. Despite Zayne's improved lightsaber skills, he was no match for the Jedi Master's wild swordplay and Raana ultimately disarmed him. As Raana is about to deliver the killing blow, Shel uses her brother's lightsaber to stab her in the back. Shel then tells Zayne she no longer believes he killed her brother. As the resistance arrives to rescue Zayne and Shel, Zayne offers Raana help to get back to a medic. Raana, amazed that Zayne would try to help her, tries to cut herself free. But Gryph, seeing Raana's raised weapon as an attack on Zayne, blows the bombs set at the Tower's base. Raana is able to ask Zayne to tell her master, Krynda Draay, that she is sorry before plummeting to her death. Somewhere else, both Lucien and Q'Anilia sense Raana's death, but Q'Anilia was more concerned that Zayne now knows who leads the Covenant."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}