{"url": "Star_Wars:_Jedi_Academy", "categories": ["Category:Real-world articles", "Category:Non-canon Legends articles", "Category:Star Wars: Jedi Academy"], "nodes": [{"tag": "h1", "text": "Star Wars: Jedi Academy"}, {"tag": "p", "text": "Star Wars: Jedi Academy is a non-canon series of Star Wars young-reader novels by Jeffrey Brown and later Jarrett J. Krosoczka and Amy Ignatow, published by Scholastic, targeted at grade-school audiences."}, {"tag": "p", "text": "The original series focuses on the adventures of Roan Novachez, a young boy from Tatooine who learns to his surprise that he is sensitive in the Force and has been invited to attend Jedi Academy at the Jedi Temple of Coruscant. The second series, beginning with Jedi Academy: A New Class, focuses on the adventures of a new Padawan named Victor Starspeeder. A third story arc, Jedi Academy: Revenge of the Sis, features Christina Starspeeder."}, {"tag": "p", "text": "The original series featured three titles and concluded with Jedi Academy: The Phantom Bully on June 30, 2015. There was also a supplementary book titled Jedi Academy: Attack of the Journal, and a box set of the three main titles was issued on September 29, 2015."}, {"tag": "p", "text": "A second series features three more titles. It begins with Jedi Academy: A New Class, released on July 26, 2016. The series features a new author and illustrator, Jarrett J. Krosoczka, and a new cast of characters headlined by a boy named Victor Starspeeder whose youthful energies often land him in detention, supervised by Yoda."}, {"tag": "p", "text": "A third story arc debuted in 2019."}, {"tag": "p", "text": "Though the series has continued into 2019, the titles have been set within the continuity of Star Wars Legends, with clear references to locations and concepts from the Expanded Universe. The titles are set in a time period well before that of the prequel trilogy in order to avoid the grand events and political drama of that era and instead focus on a middle-school experience. However, the arc beginning with Jedi Academy: Revenge of the Sis references elements within the new canon continuity."}, {"tag": "h2", "text": "Titles"}, {"tag": "p", "text": "Jedi Academy, the first title in the series, sees Novachez leave his family on Tatooine to attend Jedi Academy. There, he makes several friends and begins his fledgling training in the Force. Placed in the midst of a group of already experienced students, he worries at first that he is out of his depth, but slowly begins to get the hang of things."}, {"tag": "p", "text": "Jedi Academy: Return of the Padawan features Roan returning for another term of classes after a summer break. He finds himself struggling at starfighter pilot training under the tutelage of the strict Mr. Garfield and is also drawn into a world of cyberbullying when he signs up for the academy's Holobook social media service. As he struggles to balance classes and personal life, he worries that he may have blown matters with his crush, Gaiana."}, {"tag": "p", "text": "Jedi Academy: The Phantom Bully covers Roan's final year at Jedi Academy. In this title, Novachez trains as Mr. Garfield's personal Jedi Padawan. While trying to avoid the problems of the previous year, he also finds himself facing a crisis of cloned Voorpaks and a plot to get in him trouble with the entire school."}, {"tag": "p", "text": "Jedi Academy: A New Class focuses on a new crop of Padawans, with a focus on an energetic newcomer named Victor Starspeeder. He makes friends with Zach, a boy older than him, but things start to go downhill. The next two books are Jedi Academy: The Force Oversleeps, released in summer 2017, and Jedi Academy: The Principal Strikes Back, released on July 31, 2018. These three books had a new author and illustrator, Jarrett J. Krosoczka. Kroscozka was asked if he wanted to continue the series following Brown's decision to step down to focus on other projects. Krosockza describes Brown as \"a graphic artist who I admire immensely.\""}, {"tag": "p", "text": "A new story arc began with Jedi Academy: Revenge of the Sis, released on March 26, 2019. This book was written by Amy Ignatow, with Krosockza returning as illustrator. Jedi Academy: Attack of the Furball was released on September 3, 2019. The final title in the arc, Jedi Academy: At Last, Jedi  was released on April 21, 2020."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}