{"url": "Star_Wars:_Jedi_Temple_Challenge_-_Episode_4", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Star Wars: Jedi Temple Challenge"], "nodes": [{"tag": "h1", "text": "Star Wars: Jedi Temple Challenge - \"Episode 4\""}, {"tag": "p", "text": "\"Episode 4\" is the fourth episode of Star Wars: Jedi Temple Challenge, a children's game show set in the Star Wars universe. The episode premiered on June 24, 2020 on the Star Wars Kids YouTube channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Join Jedi Master Kelleran Beq (Ahmed Best), wise-cracking protocol droid AD-3 (Mary Holland), and astromech LX-R5 in Star Wars: Jedi Temple Challenge, as they guide Padawans Max and Oz (Blue Team), Aalaya and Brooke (Orange Team), and Joey and Joanna (Purple Team) in their quest to become Jedi Knights! #StayHome #WithMe"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Commencement"}, {"tag": "p", "text": "The episode opens with an introduction by Jedi Master Kelleran Beq that the Jedi Knights have been the guardians of peace and justice in the galaxy for over a thousand generations. Three Jedi teams must prove that they have the strength, knowledge and bravery to become Jedi Knights."}, {"tag": "p", "text": "We are introduced to 14-year old Max and 10-year old Oz of the Blue Team, who are brothers. Next are 12-year old best friends Aalaya and Brooke on the Orange Team. The third team are 14-year old Joey and 12-year old Joanna of the Purple Team, who are siblings. Master Beq explains that the contestants have to endure three trials: the strength trials on a distant world, the knowledge trials aboard a Jedi star cruiser, and a trial of bravery inside the Jedi Temple to become Jedi Knights. He asks if the Jedi Padawans will be tempted by the dark side or if they will keep their focus on the light side of the Force."}, {"tag": "p", "text": "On the forested world, Master Beq introduces himself and his trusty droids AD-3 and LX-R5 to the contestants. AD-3 greets the Padawans and brings up their data files. Oz says that he and his older brother Max grew up together while Max adds that they do stunts, which gives them an edge. They vow to win this challenge. Aalaya says that they are a good team because of the height difference. Brooke says that Aalaya can reach high things while she can crouch onto low things, so that they can get the job done together. Joanna says that teamwork is important because it is the foundation and that working together they are both able to do different tasks. AD-3 reminds the contestants about the attributes of a Jedi and the contestants repeat strength, knowledge, and bravery."}, {"tag": "h3", "text": "Strength Trials"}, {"tag": "p", "text": "Master Beq agrees and explains that they will face a series of trials. The first set of trials is the Strength Trials, a Jedi obstacle course which they must complete in order to build their lightsaber. AD-3 explains that the Leap and Lift tests their jumping, the Power Pull tests their tests their might, Saber Stability tests their balance, and the Swing of Strength tests their swinging and strength. She explains that every obstacle they complete unlocks a piece of their lightsaber hilt. The first two teams to finish every obstacle will move on to the knowledge trial and be one step closer to entering the Jedi Temple."}, {"tag": "p", "text": "Master Beq asks if the Padawans are ready while AD-3 gets him to lift rocks with the Force. Beq tells the contestants to step on the platform before sending them off on their tasks. The Blue Team starts with the Swing of Strength with Oz and Max working together to find a square. The Orange Team navigates Saber Stability where they have to navigate logs and knock over rocks with their training sabers and grab their hilt pieces. The Purple Team starts with the Leap and Lift where they need to collect two meiloorun fruits to reveal their hilt pieces."}, {"tag": "p", "text": "Working together, Oz and Max obtain their first hilt piece from Swing of Strength while Aalaya and Brooke obtain their first hilt piece from Saber Stability. Joey and Joanna also obtain their piece from Leap and Lift, earning the praise of both Master Beq and AD-3. The three teams are tied with one a piece."}, {"tag": "p", "text": "Joey and Joanna work together to pull themselves to the other side on the Power Pull. Max and Oz attempt the Leap and Lift, with Oz grabbing a two meiloorun fruit. AD-3 takes the opportunity to tease LX-R5 about being as fast as the boys. Aalaya and Brooke work together to obtain their second piece from Leap and Lift while Joey and Joanna obtain their second piece from the Power Pull challenge. LX-R5 beeps about calling them “Team Jojo” but AD-3 prefers to call them by their actual names."}, {"tag": "p", "text": "Orange Team navigates the Swing of Strength and unlock their box. Max completes the Leap and Lift. Blue Team takes the lead with two pieces with Purple Team catching up. Orange Team is third place with one hilt piece."}, {"tag": "p", "text": "Blue Team then attempts the Saber Stability trial. AD-3 quips that balance is not her strength with Master Beq responding that he is here to catch her. Aalaya obtains her hilt piece in the Swing of Strength and swings it back to Brooke. Orange Team delivers their second piece to the table and races to catch up with the other two teams. This puts them neck in neck with the others."}, {"tag": "p", "text": "Max and Oz attempt the Power Pull while Aalaya and Brooke head to the Leap and Lift. Purple Team attempts Saber Stability with Beq adding that saber stability is key to Jedi training. He tells AD-3 that he was really good with lightsabers and that he had the nickname \"Sabered Hand.\" AD-3 jokingly asks if they called him \"Light Saber.\" The Blue and Purple Teams obtain their third hilt pieces, placing them in the leap."}, {"tag": "p", "text": "Master Beq encourages the Purple Team to proceed to the Swing of Strength where there last hilt piece is waiting. Brooke struggles on the Leap and Lift and Aalaya volunteers to go in her place. Meanwhile, Joey finds his piece. Blue Team is the first to obtain their fourth piece while Aalaya and Brooke successfully obtain their third hilt piece. Blue Team assembles their hilts, making them the first team to advance to the next trial."}, {"tag": "p", "text": "Purple Team is the second team to obtain their fourth piece and assembles their hilt. Orange Team work together to navigate the Power Pull trial. Joanna completes her lightsaber hilt, leading Master Beq to proclaim that the challenge is complete."}, {"tag": "p", "text": "In a show of good sportsmanship, Orange Team members Aalaya and Brooke congratulate the other contestants, giving them a high five each. Master Beq addresses Orange Team, telling them not to let today feel like a defeat. He explains that becoming a Jedi is a long path but from what he has seen, he thinks that they have what it takes. He sends them back to complete their training with the Jedi Order. Beq reminds them that the strength of the Jedi flows from the Force. AD-3 wishes that the Force be with them."}, {"tag": "p", "text": "In a later video, Brooke says that she found the whole thing really fun because she got to go on an adventure with her friend and got to skip school. Aalaya laughs."}, {"tag": "h3", "text": "Knowledge trial"}, {"tag": "h4", "text": "Story time"}, {"tag": "p", "text": "Master Beq tells the remaining Padawans that they need to strap in for a little adventure and asks if they are ready. Before leaving, AD-3 asks LX-R5 if she can droid evaporator to the ship."}, {"tag": "p", "text": "Aboard the Jedi star cruiser Athylia, Master Beq addresses Padawans Max, Oz, Joanna, and Joey, welcoming them aboard the ship and asking if they are ready for the next Jedi trial. They all answer yes. Beq explains that AD-3 will tell them a tale and to remember as much as they can. He explains that they will have to find items hidden throughout the ship and that each correct item they find will be stored as information inside their holocrons. The first team to answer five answers correctly will receive their holocron and move on to the Jedi Temple. Beq asks if they are ready to hear their tale."}, {"tag": "p", "text": "AD-3 begins by telling the story of the Arcona spy Faddey, who complains about having to wear a broach on his collar. His Chadra-Fan boss Vosa tells him that he has to learn how to adapt, jabbing him with her tiny cane. Vosa tells him that jewellery can be hidden among rubbish."}, {"tag": "p", "text": "Faddey looked around the Day Star Hotel and saw a Wookiee ordering three purple moogan tea glasses. Vosa tells Faddey that this is the Wookiee who is carrying the secret plans. The Wookiee paid and left, leaving behind the secret plans disguised as a fake sabacc card. Nasty Wookiee hair still stuck to it. Faddey slipped the card into his jacket pocket and promptly slammed into a serving droid carrying sabacc decks. Cards flew everywhere."}, {"tag": "p", "text": "Faddey checked his pocket and the fake card fell out onto the floor and landed on his feet alongside nine identical sabacc cards. A cleaning droid barged in, sucking up all the cards. Panicking, Faddey grabbed twenty filthy napkins from the garbage bin, leaving a trail of garbage in his wake. The droid beeped twice and followed Faddey."}, {"tag": "p", "text": "When the coast was clear, Faddey snatched the droid, jumped in his landspeeder and fled. He had adapted to his surroundings after all. Now he had to open the droid, dig through the dirty napkins and wash his hands half a dozen time and take off that ridiculous broach. Faddey settled to a good night sleep."}, {"tag": "h4", "text": "Knowledge quiz"}, {"tag": "p", "text": "Returning to the trial, Master Beq asks the Padawans who wants to be the pilot and engineer. Max volunteers to be the pilot while Oz takes up the role of engineer for the Blue Team.  Joanna volunteers to be the pilot and Joey the engineer for the Purple Team. After the teams pick their roles, AD-3 sends them to their stations. AD-3 reminds the engineers to obtain items from the cabin and place them on the console while pilots have to press the correct button on the cockpit. Beq tells the team members that communications will be key and that is why they have headsets."}, {"tag": "p", "text": "Master Beq decides to ask the engineers the first question, telling them to pick the tile on the back wall for their answer. He asks the engineers what was the shape of the broach that Faddey was wearing."}, {"tag": "p", "text": "Max speaks to Oz over the headset. Oz correctly picks a diamond, placing Blue Team in the lead. Beq then asks the pilot the second question, telling them to press the color bar on their cockpit. He asks them what was the color of the milk shake Faddey was sipping. Oz answers correctly that the milk shake was blue, placing Blue Team in the lead; two to zero."}, {"tag": "p", "text": "Master Beq encourages Purple Team to use teamwork. He asks both the pilots and engineers what type of drink did the Wookiee order. Joanna correctly answers that it was moogan ice tea, bringing them two to one."}, {"tag": "p", "text": "Master Beq asks the engineers what the secret plans were disguised as. AD-3 reminds them that this is for Padawans Oz and Joey. Working together, Oz and Max identify the object as a sabacc card, complete with Wookiee hair. This places them in the lead with a score of three to one."}, {"tag": "p", "text": "Master Beq then asks the pilots how many times the droids beeped when he followed Faddey following the dirty napkin incident. Blue Team is the first to respond with Max correctly answering two. This places Blue Team in the lead with a score of four to one. Master Beq tells Blue Team that they are close to completing the Knowledge Trial. He tells Purple Team to use the Force while AD-3 tells Joey and Joanna to use their headsets."}, {"tag": "p", "text": "Master Beq asks the engineers what Faddey's boss jabbed him with. Oz is the first to log in and correctly answers that it was a tiny crane. Master Beq tells Blue Team that they are headed into the Jedi Temple. Later, Max says that the Trial of Knowledge was a competition that was really fun and got the brain juices working."}, {"tag": "p", "text": "Master Beq tells Padawans Joanna and Joey to set aside any feelings of disappointment because they had fun today. He reassures them that he is proud of them for putting all their efforts into this trial. He adds that their path to becoming a Jedi is not yet over but that they must return to the Jedi Order to complete their training."}, {"tag": "p", "text": "Later, Joey says he enjoyed the obstacle trials. Joanna thinks that they did very well but that there is room for improvement. Master Beq send Joanna and Joey away through the door through the Force. AD-3 quips that Beq is being a \"show-off.\""}, {"tag": "h3", "text": "Temple trials"}, {"tag": "p", "text": "Master Beq congratulates Oz and Max, telling them that the holocrons are theirs. He tells them that they will need it because he has programmed the coordinates into the Athylia's navigation system. The two brothers raise the hyperspace lever and the ship jumps into lightspeed."}, {"tag": "p", "text": "Exiting the tunnel, the Athylia approaches a planet with two moons. At the Jedi Temple, Master Beq and the droids welcome Padawans Max and Oz to their final trial, the Jedi Temple. He tells them that their focus will determine whether they become Jedi Knights or have to continue their training. As Padawans, the time has come to use all they have learned and to put it into practice. While they have obtained their lightsaber hilts, AD-3 explains that without their kyber crystals the lightsabers are useless chunks of metal. She tells them that they will have to get their crystal."}, {"tag": "p", "text": "Master Beq says that their hilts will remain on the shrine for now. He tells them to take their holocrons because they will need them inside the temple. Master Beq says that he will be out here using his connection to the Force to keep an eye on them. He warns them that some of the challenges will test their patience and that the dark side will feed on their frustrations, tempting them to take an easy path forward. If you choose this shorter path, it will make the temple path more difficult. Master Beq asks if they are ready and warns them that time is on the challenge."}, {"tag": "p", "text": "Max and Oz scale the summit and reach the Galaxy Globe. The two brothers work together to match the flashing orbs with the colors on the control panel. The two brothers ten slide down the garbage masher. There, they have to work together to assemble the correct color code to unlock the doors."}, {"tag": "p", "text": "Max reads out the colors to Oz. Just then, a dark side voice laughs and their surroundings turn dark. While the two brothers work together to match the tiles, the dark side entity claims that he can offer them an easy way out and asks the brothers to touch the triangle at the center."}, {"tag": "p", "text": "As Oz places the tiles on a panel, the dark side voice says that he can sense his frustration. Max reads out the colors and Oz searches for the peace. The dark side claims they are running out of time. Oz is unable to find a tile and the dark side voice tempts him, telling him to press the button to escape. Oz continues searching for the tiles but is unable to find them. Fearing that they are running out time, Max presses the button, giving in to the dark side. Oz also presses his button."}, {"tag": "p", "text": "In a later video, Max justifies his decision by saying that time was running out and that they were not going to get it if they tried again. Max says that if there is a dark side, there has to be a balance in the Force. He says that he guess it makes sense."}, {"tag": "p", "text": "The dark side taunts the Padawans for falling into his trap as the two of them enter the power core chamber, where the team must correctly assemble power core pieces and lock it into place. The dark side taunts them that they will have to do this task in the dark. The two brothers work to match the pieces together but find that it is wrong."}, {"tag": "p", "text": "The dark side voice claims that their frustrations are pulling them closer to the dark side. Max and Oz find the right piece much to the dismay of the dark side voice, who disappears."}, {"tag": "p", "text": "Master Beq compliments the two Padawans for overcoming the trials of the dark side. Max and Oz climb the frigid ridge and head to the Bridge of Balance where one Padawan must balance on discs to light the path across. The two brothers take turns standing on discs as they navigate their way across the bridge."}, {"tag": "p", "text": "Oz takes the lead with Max following. The two slide down the slide and head to the table where they plant their holocrons into the consoles to obtain their kyber crystals. Having obtained their lightsaber crystals, the two Padawans go and meet Master Beq and the droids at the entrance to the Jedi Temple."}, {"tag": "h3", "text": "Jedi Knighthood"}, {"tag": "p", "text": "Master Beq congratulates the brothers for completing their trials. He says that he sensed the dark side tempting them and feared that all was lost. He is grateful that he is able to overcome their frustrations and prove that their connection to the light is strong their connection to the dark side. AD-3 says based on what Master Beq said, it sounded amazing in there. LX-R5 beeps."}, {"tag": "p", "text": "Master Beq tells the Padawans to place their kyber crystals into their lightsabers but not to point them at her and LX. She tells them to place the hilts on the lightsaber shrine while she goes and gets their robes. She hands them their robes, which fit the brothers."}, {"tag": "p", "text": "As Master Beq's prompting, the two brothers ignite their lightsabers. He proclaims them Jedi Knights by the rite of the Council and the will of the Force. Max and Oz raise their blue and green lightsabers while Yoda's voice can be heard praising the brothers for completing their trial."}, {"tag": "p", "text": "In a later video, Max and Oz say it was a fun but tiring and challenging experience working together during the trials."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}