{"url": "Star_Wars:_Jedi_Quest_(comic_series)", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Jedi Quest comics"], "nodes": [{"tag": "h1", "text": "Star Wars: Jedi Quest (comic series)"}, {"tag": "p", "text": "Star Wars: Jedi Quest was a four-issue series of comics published by Dark Horse Comics between September 12, 2001 and December 12, 2001. The same story was also told in the Jedi Quest series of young adult novels, in the Jedi Quest: Path to Truth special edition. This series has not been collected as a trade paperback, but was eventually collected in Star Wars Omnibus: Menace Revealed."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "If young Anakin Skywalker is to become a Jedi he must follow the teachings of his Master, Obi-Wan Kenobi. He must also find a way to overcome his fears, including the memory of the man who killed his brief companion, but remarkably influential individual, Qui-Gon Jinn — the vicious Darth Maul."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Although the 2001 young reader novel Jedi Quest: Path to Truth depicts Rashtah with a scar running through his eye and wearing an eye patch, in the comic series he is depicted with both eyes intact."}, {"tag": "p", "text": "Another contradicting detail is the Colicoid diplomatic ship, which is depicted in the comics as a standard Consular-class cruiser, yet in Path to Truth is stated to be a typical Colicoid-designed starship."}, {"tag": "p", "text": "At the end of the last issue of the series, when Palpatine's transport arrives on Nar Shaddaa, Siri Tachi is still in her \"Zora\" outfit along with the facial markings and the greased hair, although in the same scene depicted in Path to Truth she wears a simple tunic instead and has her face and hair cleaned."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "p", "text": "\"Comics Link\"—Star Wars Insider 57"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}