{"url": "Star_Wars:_Jedi_Quest_(novel_series)", "categories": ["Category:Legends articles", "Category:Book stubs", "Category:Star Wars: Jedi Quest (novel series)"], "nodes": [{"tag": "h1", "text": "Star Wars: Jedi Quest (novel series)"}, {"tag": "p", "text": "Star Wars: Jedi Quest is a series of young-reader novels written by Jude Watson and published by Scholastic. The series follows Anakin Skywalker and his master Obi-Wan Kenobi between Star Wars: Episode I The Phantom Menace and Star Wars: Episode II Attack of the Clones and on the back of the book, above each story's synopsis, it says \"Obi-Wan Kenobi & Anakin Skywalker. Master and Apprentice. Chosen by fate. Destined for Conflict.\""}, {"tag": "p", "text": "While originally scheduled to be a full line of toys and a multimedia event like Star Wars: Shadows of the Empire and Clone Wars, Jedi Quest was reduced to a series of novels and comics along with a couple of leftover action figures released from 2000 to 2001."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jedi mission adventures experienced by Kenobi and Skywalker in the ten-year gap between Episodes I and II (32-22 BBY) are alluded to in the Episode II novelization by R. A. Salvatore, Attack of the Clones, when Jedi protector Anakin Skywalker has escorted Senator Padmé Amidala back to Naboo after two assassination attempts on her life in the galactic capital of Coruscant."}, {"tag": "p", "text": "Retiring to the seclusion of the Naberrie family's island retreat of Varykino in the remote Lake Country of Naboo, Anakin and Padmé, after an enjoyable meadow excursion, meet at dusk on the lodge's dining terrace that looks out over the lake for their evening meal. It is then, after the pair has settled in at the table, that Skywalker begins \"recounting some of the adventures he had known over the last ten years, training and flying with Obi-Wan.\""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}