{"url": "Star_Wars:_Knight_Errant:_Escape", "categories": ["Category:Real-world articles", "Category:Star Wars: Knight Errant story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Knight Errant: Escape"}, {"tag": "p", "text": "Star Wars: Knight Errant: Escape is the third and final story arc in the Star Wars: Knight Errant comic series. It occurs in 1032 BBY in the Republic Dark Age during the last century of the New Sith Wars and is large narrated from the point of view of the Jedi Knight Kerra Holt, a knight errant Jedi who operated in Sith territory. Escape deals with Kerra's personal quest to find her long-lost parents who were separated during the Sith invasion of Aquilaris in 1042 BBY. This journey leads here to infiltrate Sith Lord Odion's realm known as the Odionate, where she becomes embroiled in a Sith expedition to locate the Helm of Ieldis, an ancient Sith artifact. While Kerra's journey brings her closer to learning the fate of her parents, she also had to contend with Odion's nihilistic agenda of galactic domination."}, {"tag": "p", "text": "Escape was first released on June 13, 2012 and ran through to October 10, 2012. It consisted of five issues and its script was developed by John Jackson Miller. Escape was subsequently collected as a trade paperback comic by Dark Horse Comics and released on April 10, 2013."}, {"tag": "h2", "text": "Plot outline"}, {"tag": "h3", "text": "Behind Enemy Lines"}, {"tag": "p", "text": "Following the Aquilaris campaign and the Battle of Darkknell, the Jedi Knight Kerra Holt established contact with the Sith Lord Daiman. Earlier, she had saved the planet Darkknell from the Hutt crimelord Zodoh. In return for her help, Daiman agreed to helped her infiltrate the Odionate, a region in the Grumani sector ruled by his estranged older brother Lord Odion. Kerra sought to destroy Lord Odion and also wanted to discover the fate of her lost parents Aron and Mercia Holt following their separation during the invasion of Aquilaris Minor in 1042 BBY. Disguised as a slave worker trying to escape Daiman's war forges on Tergamenion named \"Mercy\", Kerra succeeded in making contact with the Claimer Wayman, an Odionate recruiter. He provided her with a signalling device which he instructed her to activate when she arrived in the Odionate. Despite being mutual enemies, Daiman was willing to help the Jedi woman due to his long-entrenched sibling rivalry and because he had foreseen a great tribulation in the future, emanating in Odon's domain."}, {"tag": "p", "text": "Kerra subsequently infiltrated the Odionate and joined the Novitiates, Odion's elite corps of Dark Side Adepts. Kerra was part of a detachment of Novitiates deployed during an invasion of Skarpos, a planet within Lord Malakite's realm known as the Menagerie. During the fighting, Odion's forces sustained heavy casualties due to General Beld Yulan's suicide wave tactics. \"Mercy\" attracted Yulan's ire when she attempted to hold back Yulan's forces from charging into burning tar pits filled with starfighter fuel. Mercy's self-preservation was at odds with Odion's nihilistic philosophy of embracing death through combat. Following the battle, Mercy's forces were reassigned by Wayman for a new assignment and ordered to reconvene with Odion for a debriefing at Jubalene, Odion's newly acquired capital in the former Bactranate."}, {"tag": "p", "text": "On Jubalene, \"Mercy\" and other Novitiates witnessed the violent deaths of three Jubalene Duros bankers who had been tricked into fighting an enraged rancor at an arena. For Odion, he could not tolerate the bright energy created by life through the Force due to his hypersensitive Force abilities and thus sought to snuff out. Thus, the death of another living being for him was a relief from this irritant. During the briefing session, Odion outlined his interests in procuring the Helm of Ieldis, an ancient Sith artifact created prior to the Great Hyperspace War that was capable of driving sentient beings into a homicidal frenzy. Years earlier, Odion had commissioned a mission known as Project Pandemonium to find the Helm but it had stopped at Sarrassia, then ruled by rival Sith Lord Ayanos Bactra. With the collapse of the Bactranate, Odion was now able to continue his quest."}, {"tag": "p", "text": "He assigned \"Mercy\" and her team of Novitiates with the task of continuing Project Pandemonium. General Yulan prepared his fleet for an invasion of Sarrassia. While Odion and the other Novitiates left to watch more entertainment at the Sith arena, Kerra took the opportunity to access information about her parents on the data center in the chamber. She found out that they had been conscripted into Project Pandemonium following the invasion of Aquilaris."}, {"tag": "h3", "text": "Kerra's Quest"}, {"tag": "p", "text": "While en route to Sarrassia, Kerra had a flashback to her childhood during the invasion of Aquilaris. Her parents had told her to flee to Capital Cay's harbor where they would escape on a Seacropper Submersible with Joad Kreel's family. However, her parents never turned up and Kerra returned to their family home only to discover they were gone. During the invasion of Sarrassia, Odionate forces quickly wiped out all resistance and rounded up the population as slaves. Children were forcibly separated from their parents. Kerra's commander Doyan assigned the Novitiates on a mopping-up operation against Grumani Hierophants on Mount Diligence."}, {"tag": "p", "text": "During the fighting, the Sith forces experienced significant losses when friendly fire unleashed by Yulan's artillery shelled the trenches. Having wiped out opposition, the Novitiates explored the underground caves beneath Mount Diligence. Kerra was separated from her fellow Novitiates and stumbled upon the Great Temple beneath the mountain. There, she encountered her old childhood friend Aunt Zoojoo who provided her with more information on the Helm of Ieldis and her missing parents. Kerra learnt that her parents had visited Sarrassia seven years ago under Project Pandemonium to find the Helm. However, they were secretly working to hide the Helm from Odion. In the end, the Hierophants agreed to protect Mount Diligence at all costs from the Sith while Kerra's parents would prevent Odion from acquiring the Helm. Her parents had traveled to Skarpos, the last known location of the Helm, and had never returned since."}, {"tag": "p", "text": "Kerra also knew that her mother Mercia was pregnant during the time of their separation. She deduced that she had given birth to a younger sibling in Sith captivity but Zoojoo was unable to confirm those details. When Kerra learned that the Helm was on Skarpos, she told Zoojoo she had to stop Odion and find her parents. Zoojoo disagreed and tried to talk Kerra out of her plans, arguing that doing so would only lead Odion to the Helm. Their conversation was interrupted by the arrival of Yulan and several Sith Novitiates. During the ensuing scuffle, Zoojoo killed herself by detonating a remote-rigged bomb which buried the temple under tons of rubble and rocks. \"Mercy\" survived the explosion and told Yulan that the Helm was located on Skarpos, feigning devotion to Odion's cause while secretly desiring to find a lead to her parents."}, {"tag": "h3", "text": "The Helm of Ieldis"}, {"tag": "p", "text": "The Sith Lord Odion has a flashback to his troubled childhood. His mother Xelian openly favored and pampered his infant brother Daiman while neglecting and ostracizing him. From young, Odion also had ambitions of carving up a large empire since his grandmother and family matriarch Vilia Calimondra had promised to bequeath her extensive interstellar empire to the heir that conquered the most. Since the birth of Daiman, Odion experienced severe and debilitating headaches which stemmed from his hypersensitivity to the existence of other sentient beings. This coupled by the hatred of his family led Odion to embrace inflicting death as a means of finding relief from the pain of other sentient beings' existence. In retrospect, these sentiments had led Odion to establish a death cult which embraced destruction. In the present, Odion had not heard from his hunters seeking the Helm of Ieldis. When an aide asked him if she could dispatch a courier to check on them, Odion replied that he would go and check on them himself."}, {"tag": "p", "text": "General Yulan's fleet did a brief stop-over at the moon base of Vanahame to replenish supplies and refuel his flagship Gravedigger. Feigning enthusiasm and boredom, Kerra attempted to commandeer a shuttle. This led her superior Doyan to reiterate that the team of Novitiates were going to find the Helm together. The Kubaz Novitiate Glenk had also disappeared on Sarrassia, leading the others to surmise that he had gone to claim the glory for himself. With the Gravedigger refueled, Kerra was sent beneath the spaceport to inform General Yulan. While exploring the basement, Kerra stumbled into a massive cloister which housed all the children within the Odionate. Due to Odion's unhappy childhood experiences and because they burned very brightly through the Force which irritated him, he kept them confined in a series of planet-sized orphanages. Yulan also explained his reasons for joining Odion's cause, citing his grief stemming from the deaths of his children. For Yulan, the only escape was to embrace nothingness and death since life was meaningless."}, {"tag": "p", "text": "Following the stop-over at Vanahame, the Odionate fleet arrived at Skarpos where the Sith had set up a garrison under the Morbollon Mesa. As the Novitiates made preparations to explore the cave, the Odionate garrison came under attack from rival Menagerie and Daimanate forces. Lord Malakite sought to reclaim Skarpos for himself while Lord Daiman sought to capture the Helm for himself. Daiman was accompanied by his double agent Glenk, who had infiltrated the Novitiates and was assigned with monitoring Kerra's whereabouts. During the fighting, Kerra saved Yulan's life which led him to view her more favorably. While Yulan's forces held back the invaders, the Novitiates headed for the cave opening near the top of the mesa. Amidst the fighting and upheaval, Lord Odion himself arrived on a shuttle."}, {"tag": "p", "text": "Kerra and the Novitiates managed to reach the Helm but Kerra sabotaged their skiff. Kerra managed to enter the Grumani temple chamber and found her mother's satchel. She discovered that the chamber was buried beneath a mound of rubble and rocks. Kerra was then struck with Force lightning by Odion, who had already acquired the Helm for himself. Kerra had merely led Odion to the ancient Sith artifact and he intended to use it for a test demonstration."}, {"tag": "h3", "text": "Bloodbath on Skarpos"}, {"tag": "p", "text": "Odion donned the Helm while Kerra was taken captive and brought to the top of the Morbollon Mesa where General Yulan's men had begun exploring the collapsed Grumani temple chamber. Dispute acquiring Ieldis' vaunted artifact, Odion was unable to activate it which led Kerra to taunt him. During their subsequent conversation, Odion revealed that he had been fully aware of Kerra's presence since she had entered the Odionate. However, he left her alone because he believed that Kerra and her family were predestined to lead him to the Helm. Odion revealed that he had acquired information about her parents' research on the Helm during a raid on the University of Sanbra. The invasion of Aquilaris Minor in 1042 BBY was merely a cover to capture her parents and the other researchers involved in the Ieldis study for Project Pandemonium."}, {"tag": "p", "text": "By then, Yulan and his team of soldiers had finished their excavation of the temple chamber. They had recovered some camping remains and two human skeletons; one of which had a locket containing an image of Kerra's parents. Realizing that her parents had died, Kerra descended into a state of grief which immediately activated the dark side powers of the Helm. Odion immediately unleashed the Helm's powers on two of Malakite's Mutate soldiers and their dragon steeds, who had stumbled on Odion's entourage. Odion used the Helm's powers to drive them into a homicidal frenzy. Satisfied with this test demonstration, Odion unleashed the Helm on the three massed armies beneath the mesa. Malakite and Daiman's forces quickly collapsed as all the combatants began killing each other. In the ensuing massacre, Daiman and Malakite barely escaped with their lives. Meanwhile, Odion's entourage evacuated Skarpos on an Odionate planetary gunship."}, {"tag": "p", "text": "Despite Odion's victory, the Helm also wiped out his entire garrison on Skarpos, leading General Yulan to raise concerns about the high losses. Odion dismissed Yulan's concerns, arguing that their deaths were inevitable and that the Helm saved them a lot of work. Kerra was subsequently taken to a detention cell while Odion set the warship Gravedigger for an unknown course. Despite his initial hostility towards Kerra, Beld Yulan had come to grudgingly respect Kerra for risking her life to find her parents. During the meeting Kerra also revealed that she was also looking for her lost younger brother or sister, whom she believed was incarcerated in one of the Odionate cloisters. Yulan then explained the main reason for his visit; a holorecorder had been recovered from the wrecked mesa chamber. Odion had viewed it privately and had ordered Yulan to bring it to Kerra in person."}, {"tag": "p", "text": "It turned that the holorecording was a message from Kerra's late parents to Vannar Treece or any other Jedi involved in the University of Sanbra on the Ieldis study. Four years after the Massacre of Aquilaris, her parents had finally recovered the Helm of Ieldis on Skarpos. The Holts had intended to bring the Helm to the Jedi and the Galactic Republic for safekeeping but were unable to since the planet was besieged by warring Sith factions. By that stage, the Holts had run out of food and there was a permanent Sith presence outside the Morbollon Mesa. To prevent the Sith from finding the Helm, the couple made the fateful decision to blow themselves and the chamber up, in a last ditched attempt to deny the Sith access to the Helm."}, {"tag": "p", "text": "Following the end of the transmission, Yulan expressed his inability to understand why Kerra's parents had willingly sacrificed their lives for everyone else. Kerra disagreed but without showing any malice, argued that her parents' sacrifice had made perfect sense. For her, their sacrifice signified that if death could have a meaning, then life must have a meaning as well. Shortly after their meeting, the Gravedigger landed on Vanahame. Kerra asked if Odion had wanted more anguish to feed on, adding that Yulan could tell Odion it did not work. Yulan replied that Odion may have just wanted her to understand the Helm's potential. Upon realizing they had landed on Vanahame, Kerra reached the conclusion that he come to the Cloister to harness the misery and sadness of the thousands of inmates within the planet-sized orphanage. By using the Helm to tap into these negative emotions, Odion's powers would be unlimited."}, {"tag": "h3", "text": "Showdown on Vanahame"}, {"tag": "p", "text": "Following the events on Skarpos, the Calimondra family matriarch Vilia Calimondra successfully convinces her family to temporarily put aside their differences to stop the threat posed by Odion's nihilistic ambitions. In response, his rivals including Daiman and Arkadia Calimondra assembled their fleets, in an effort to prevent Odion from destroying the galaxy. Savoring his successful demonstration on Skarpos, Odion now intended to launch the Helm of Ieldis on a massive scale by drawing dark side energy from the negative emotions of his child captives on Vanahame to cause the entire Grumani sector to collapse into a homicidal frenzy. Odion also planned to eliminate his other Sith family members, ending the stalemated Second Charge Matrica and then become ruler of the galaxy. By killing all other sentient beings with the Helm, Odion aimed to be the sole living being in the entire universe. For the first time, Odion ordered his staff to plunge the planet-sized orphanage into darkness, causing the inmates much fear and panic. Odion then used the Helm to convert their negative emotions into pure dark side energy which was then unleashed on the entire sector."}, {"tag": "p", "text": "While unleashing his Helm on the galaxy, Odion had his enemy Kerra chained and also used the Helm to drive his Novitiates into a killing frenzy. However, Kerra managed to convince Odion's second-in-command Yulan that life had a meaning and that the lives of the children on Vanahame mattered. Disillusioned with Odion's nihilistic doctrine and outlook, Yulan entered the Cloister's control room where he forced the crew to restore the light within the Cloister and release the children from their bubble prisons. Yulan's actions had the immediate effects of ending the children's anguish, which ended the Helm's homicidal killing-spree immediately. Meanwhile, Kerra managed to break free from her bonds and fight Wayman. Initially, Wayman held the upper hand and was about to inflict a death blow on Kerra when he master was overwhelmed by the sudden surge of positive feelings emanating from the relieved children. While Wayman was distracted, Kerra impales him with a lightsaber."}, {"tag": "p", "text": "The surge of positive emotions caused the Helm to overload, causing Odion to burn to death. In his last moments, Odion attempted to get Kerra to spare his life by claiming that he could help her find her lost younger sibling. However, Kerra had come to the view that all the captive children were her true brothers and sisters and allowed Odion to die. With Odion's death, his realm descended into anarchy as his rivals including Daiman quickly carved up large chunks of territory from the former Odionate. With his humanity and love restored, a redeemed Yulan departed for Republic space with thousands of the former child inmates aboard a fleet of transports. Meanwhile, Kerra vowed to continue her fight to liberate the sector and the children's parents themselves from the Sith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pablo Hidalgo's The Essential Reader's Companion, which was released on October 2 2012, mistakenly mentions that Daiman was the leader of the death cult, seeking to recover the Sith artifact known as the Helm of Ieldis."}, {"tag": "h2", "text": "Issues"}, {"tag": "p", "text": ""}]}