{"url": "Basic_(dance)", "categories": ["Category:Legends articles", "Category:Dance"], "nodes": [{"tag": "h1", "text": "Basic  (dance)"}, {"tag": "p", "text": "Basic dancing was a simple style of dancing performed by entertainers and unskilled performers. Professional dancers could enhance the style of dancing by including miming motions, and popping moves in which which the dancer moved backwards while seemingly walking forwards."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Basic dancing was included as a dance style in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Two types of the dance (Basic and Basic2) were available as dance abilities for players of the entertainer profession. Following the release of Publish 25's New Game Enhancements on November 15, 2005, the first of the two Basic dance abilities was made available to all players, but only the newly revamped entertainer profession could perform the slightly more complicated Basic2 dance, or any of the eight associated \"flourishes,\" special dance moves that added variety to the dance routine."}, {"tag": "p", "text": "Motion-capture performer Sabrina Fox provided many of the dance moves and flourishes for Star Wars Galaxies, including those associated with the Basic dance style. Although not specifically named in the game, a couple of the flourishes for the Basic dance style included the moonwalk and a dance move nicknamed \"The Elaine.\" Damon Lane Waldrip, Senior Artist for Star Wars Galaxies, explained that the inspiration behind \"The Elaine\" dance flourish was an episode of Seinfeld named \"The Little Kicks,\" in which the character Elaine Benes dances terribly. Indeed, the game's files include the animation file titled \"all_b_dnc_goofy_sp_elaine.ans.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}