{"url": "Star_Wars:_Jedi_Temple_Challenge_-_Episode_7", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Jedi Temple Challenge"], "nodes": [{"tag": "h1", "text": "Star Wars: Jedi Temple Challenge - \"Episode 7\""}, {"tag": "p", "text": "\"Episode 7\" is the seventh episode of Star Wars: Jedi Temple Challenge, a children's game show set in the Star Wars universe. The episode premiered on July 15, 2020 on the Star Wars Kids YouTube channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Join Jedi Master Kelleran Beq (Ahmed Best), wise-cracking protocol droid AD-3 (Mary Holland), and astromech LX-R5 in Star Wars: Jedi Temple Challenge, as they guide Padawans Taeho and Hana (Blue Team), Kyan and Benji (Orange Team), and Clementine and Oliver (Purple Team) in their quest to become Jedi Knights!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Commencement"}, {"tag": "p", "text": "The episode opens with an introduction by Jedi Master Kelleran Beq that the Jedi Knights have been the guardians of peace and justice in the galaxy for over a thousand generations. Three Padawan teams must prove that they have the strength, knowledge and bravery to become Jedi Knights."}, {"tag": "p", "text": "We are introduced to siblings Taeho and Hana of the Blue Team. Next are best friends Kyan and Benji of the Orange Team. The third team are Oliver and Clementine of the Purple Team, who have known each other since kindergarten."}, {"tag": "p", "text": "Master Beq explains that the contestants have to endure three trials: the strength trials on a distant world, the knowledge trials aboard a Jedi star cruiser, and a trial of bravery inside the Jedi Temple to become Jedi Knights. He asks if the Jedi Padawans will be tempted by the dark side or if they will keep their minds focused on the light side of the Force."}, {"tag": "p", "text": "On the forested world, Master Beq introduces himself and his trusty droids AD-3 and LX-R5 to the contestants.  AD-3 greets the Padawans, quipping that she is the only droid that matters. LX-R5 beeps, prompting Master Beq to introduce him. Master Beq tells the Padawans that now is their time and asks if they are ready to become Jedi Knights and they all shout yes in unison."}, {"tag": "p", "text": "AD-3 tells the Padawans that it is time to check their data files. 13-year old Taeho of the Blue Team says that he is really fast and that his 10-year old sister Hana is really smart and that she can strategize really well. Hana says that they are going to win this. 10-year old Kyan of the Orange Team says that he is really good with the upper body strength while  10-year old Benji says that the he is good with the rim and that they are going to win. 12-year old Clementine says that they are very athletic and that they are going to win. 12-year old Oliver adds that they are very competitive and tells the others not to underestimate them. AD-3 reminds the contestants about the attributes of a Jedi and the contestants repeat strength, knowledge, and bravery."}, {"tag": "h3", "text": "Strength Trials"}, {"tag": "p", "text": "Master Beq agrees and explains that they will face a series of trials. The first set of trials is the Strength Trials, a Jedi obstacle course which they must complete in order to build their lightsaber. AD-3 explains that the Leap and Lift tests their jumping, the Power Pull tests their tests their might, Saber Stability tests their balance, and the Swing of Strength tests their swinging and strength. She explains that every obstacle they complete unlocks a piece of their lightsaber hilt. The first two teams to finish every obstacle and collect their hilt pieces will move on to the Knowledge Trial and be one step closer to entering the Jedi Temple."}, {"tag": "p", "text": "Master Beq asks the Padawans if they are ready to put their training to use. The Padawans shout yes. Master Beq tells the children to place their feet on the Jedi platform. AD-3 quips about Master Beq showing off as he uses the Force to raise floating rocks. Master Beq then orders the three teams to go."}, {"tag": "p", "text": "The Purple Team starts on the Leap and Lift where they need to grab two meiloorun fruits before grabbing their hilt pieces. Clementine and Oliver quickly collect their first hilt pieces. Meanwhile, the Blue Team tries the Swing of Strength where one partner needs to bring a token with them to unlock their hilt pieces. Master Beq reminds Blue Team not to forget to communicate. Taeho tells his sister that they need a square. Hana finds the key."}, {"tag": "p", "text": "Orange Team attempts the Saber Stability where they have to knock over the floating rocks with their training sabers before unlocking their hilt pieces. Master Beq and AD-3 praise them for their good stability. Meanwhile, Hana takes her turn on the Swing of Strength with the help of her brother Taeho. Master Beq praises Blue Team for their show of strength. Elsewhere, Kyan and Benji obtain their first hilt pieces as does Purple Team."}, {"tag": "p", "text": "Purple and Orange Team are the first two teams to deliver their hilt pieces to the assembly table. Meanwhile, Taeho helps his sister Hana back across the Swing of Strength challenge, earning the praise of Master Beq and AD-3. They soon return with their first hilt pieces."}, {"tag": "p", "text": "Purple Team then embarks on the Saber Stability challenge while Orange Team works together on the Power Pull challenge. Kyan and Benji reach the other and use the token in their bagpack to unlock the box containing their second hilt pieces. This earns them the praise of Master Beq."}, {"tag": "p", "text": "Meanwhile, Taeho grabs a meiloorun fruit while Master Beq praises Oliver and Clementine for doing well on the Saber Stability challenge. Purple Team returns with their second piece, placing them in the lead. Orange Team returns to the start of the Power Pull obstacle course with their second hilt piece. Meanwhile, Hana struggles with the Leap and Lift challenge."}, {"tag": "p", "text": "Purple Team sweeps through the Swing of Strength challenge, earning the praise of AD-3. Purple Team returns with their second hilt piece, placing them second place. Meanwhile, Taeho obtains the second meiloorun piece for his sister, earning the praise of AD-3. Oliver and Clementine take turns to swing back on the Swing of Strength challenge, bringing back their third piece and placing them in the lead. Blue Team returns with their second piece."}, {"tag": "p", "text": "Orange Team enters the Swing of Strength while the Purple Team enters the Power Pull and the Blue Team enters the Saber Stability challenge. AD-3 praises the Blue Team for their training saber skills while Orange Team unlocks the box to their third hilt pieces. Elsewhere, Purple Team reaches the other side of the Power Pull, obtaining their fourth hilt pieces. AD-3 encourages the Blue and Orange Teams, telling them that they are still in it."}, {"tag": "p", "text": "Master Beq praises the Purple Team. Orange returns to the assembly table with their third hilt pieces while the Purple Team returns with their fourth hilt pieces. Oliver and Clementine begin assembling their lightsabers. Blue Team returns with their third hilt pieces, putting them neck to neck with Orange. Oliver and Clementine assemble their lightsabers, earning the praise of Master Beq who tells them that they will be the first to move on to the next trial."}, {"tag": "p", "text": "The Blue Team attempts the Power Pull challenge while the Orange Team tries the Leap and Lift. Kyan tells Benji to hurry while AD-3 wonders who will finish first. LX beeps. Blue Team reaches the other side of the Power Pull challenge and obtains their hilt pieces. Clementine encourages the other teams. Blue Team makes their way back but Hana falls of the sled, alarming AD-3. Meanwhile, Orange Team obtains their last set of hilt pieces from the Power Pull challenge and head back. Orange Team races back to the assembly table and cheers."}, {"tag": "p", "text": "Master Beq tells them to assemble their pieces. Blue Team also returns and the two teams race to build their lightsabers. Blue Team is the first to assemble all their lightsabers. Master Beq announces that the Blue Team will be the second team to enter the next challenge."}, {"tag": "p", "text": "Master Beq informs the Purple and Orange Teams that they will be moving on to the next challenge. Beq tells Kyan and Benji that they were so close and that they only missed going to the next trial by a few seconds. He reassures them that their effort was strong and that they should both be very proud, prompting Benji to smile. Master Beq tells them to return to the Jedi Order to continue their training and wishes that the Force will be with them. Kyan says that it was a lot of fun while Benji says that it was hard but fun at the same time. Kyan opines that they did really good because they kept going and didn't fail any obstacles."}, {"tag": "p", "text": "Master Beq tells the Blue and Purple Teams that the journey continues for the rest of them. Master Beq tells AD-3 that the Force is telling him something and that she is \"it\" but he doesn't know what that means. AD-3 grumbles that he knows that she is bad at this game."}, {"tag": "h3", "text": "Knowledge Trial"}, {"tag": "h4", "text": "Story time"}, {"tag": "p", "text": "In space, Master Beq welcomes Padawans Taeho, Hana, Oliver and Clementine aboard the Jedi star cruiser Athylia. He asks if they are ready for their second trial. Beq explains that this will be a trial of knowledge and tells them to listen carefully because AD-3 will tell them a tale after which they must work together with their team mate to locate items from the story that they have heard, which will be located throughout the Athylia. The first team to answer five answers correctly will be awarded their holocron, which will be needed inside the Jedi Temple. Beq asks if they are ready to hear their tale."}, {"tag": "p", "text": "AD-3 says that she needs to retrieve the story from her memory banks. The trouble with two-headed Troigs is that the heads do not always get along together. Take Durl and Dekk for example. Durl was on the left and Dekk was on the right. They were both in charge of the vault at the Golden Rocket Bank on Rook Minor. But only Durl's voice could unlock the bank vault."}, {"tag": "p", "text": "Durl annoyed Dekk with his singing, burping, chewing, and smelly lunches consisting of four servings of purple crunch bugs. Not to mention Durl's constant chattering even with his mouth full. Durl was the worst room mate in the galaxy."}, {"tag": "p", "text": "One morning, Dekk offered Durl a stick of yellow goo-goo-gum, a gum that was so chewy that it could silence a tauntaun. Six seconds later, Durl's mouth was glued completely shut. When they got to work, their boss asked them to grab from the vault a tray of eight precious green info crystals. Durl couldn't say the password to the data storage unit."}, {"tag": "p", "text": "Dekk screamed every possible password in his best impression of Durl: \"Bill the 79th,\" \"Tatooine 3”, “one-two-three-four.” Their Gozzo boss was getting impatient, smacking his cane against Dekk's head for every mistake and there were many, many mistakes. He threatened to fire them if they did not open the vault by the count of three. He threatened to fire them twice even if they shared one body."}, {"tag": "p", "text": "Durl quietly mumbled \"purple mines.\" Dekk quietly stared and breathed a sigh of relief as the vault opened. Durl says that he was just pretending that his mouth was stuck to prove that Dekk still needed him. From that day on, Dekk let Durl sing and eat whatever he wanted even if he rather than drank mirkwater."}, {"tag": "h4", "text": "Question time"}, {"tag": "p", "text": "Master Beq tells the Padawans that each team must choose which one of them wants to take the pilot seat while the other will take the engineer position searching for clues in the cabin. Beq asks who wants to be the pilot and who wants to be the engineer. Taeho volunteers to be Blue Team's engineer and assigns Hana to be the pilot. Clementine volunteers to be the pilot while Oliver takes the engineering role. AD-3 sends them to their stations. She reminds the engineers to obtain items from the cabin and place them on the console while pilots have to press the correct button on the cockpit. Beq reminds them that they can use their headsets to communicate at any time to get the right answers."}, {"tag": "p", "text": "Master Beq asks the engineers the first question, telling them to find a tile of a troig with the correct number of heads. Oliver correctly picks a tile showing a two-headed troig, giving Purple Team one point."}, {"tag": "p", "text": "Master Beq asks the pilots how many seconds it took for Durl's mouth to glue shut after he ate goo-goo gum. Hana correctly answers six, tying the two teams at one point each."}, {"tag": "p", "text": "Master Beq announces that the next question is a verbal question that anyone can answer. He asks the Padawans what was the smelly lunch  that Durl like to chew. Oliver correctly picks purple crunch bugs, giving Purple Team two points with Blue Team having one."}, {"tag": "p", "text": "Master Beq then asks the engineers the fourth question, telling them to choose a tile representing the objects that Durl's boss told them to find. Taeho correctly picks a tile showing crystals, tying the two teams at two points each."}, {"tag": "p", "text": "Master Beq then asks the pilots the color of the stick of goo-goo gum. Clementine correctly answers yellow, placing the Purple Team in the lead by three points with Blue Team having two points."}, {"tag": "p", "text": "Master Beq then asks the engineers to pick a tile showing the object that Durl's boss was smacking against the head of Dekk. Oliver correctly obtains a cane, giving Purple Team four points. Master Beq reassures Blue Team that they are still in this game."}, {"tag": "p", "text": "Master Beq then issues a verbal question, asking whether Durl was on the left or the right. Hana correctly answers that Durl was on the left side, giving Blue Team three points."}, {"tag": "p", "text": "Master Beq then asks the pilots what color were the curried crunch bugs. Clementine correctly answers that they were purple, giving Purple Team five points."}, {"tag": "p", "text": "Master Beq announces that the Trial of Knowledge is complete and that Clementine and Oliver will be going to the Jedi Temple. In a follow-up video, Clementine says that she thinks that they did very well and did better than she expects. Oliver adds that it feels great to be one step closer and says that the previous two steps have been a thrill of a ride. Even if they don't win, it will be amazing."}, {"tag": "p", "text": "Master Beq tells Taeho and Hana that he is proud of them, saying that they came so close to completing the Knowledge Trial. After more training at the Jedi Order, he believes that they will both become noble Jedi Knights. He wishes that the Force will be with them. Master Beq beats AD-3 to opening the door, much to her annoyance."}, {"tag": "p", "text": "In a follow-up video, Hana says that the questions were easy but thinks that the other team busted in first. Taeho says that they weren't really hard but that they weren't paying attention to the right stuff. Hana says it was fun overall and that she will do it again."}, {"tag": "p", "text": "AD-3 grumbles about Master Beq beating her to closing the door with the button. Master Beq congratulates Clementine and Oliver for completing the Trial of Knowledge. He awards them two holocrons, which rise from their compartment. AD-3 grumbles that she was going to raise a button for that. He tells them that they will need these holocrons because they are going to the Jedi  Temple. He tells them to put the holocrons in their satchels before telling them to head to their seats. Master Beq explains that he has programmed the coordinates of the Jedi Temple into the Athylia's navigation system. Beq and AD-3 tell the Padawans to punch it and the two raise the hyperspace levers, taking the ship into hyperspace."}, {"tag": "h3", "text": "Temple Trial"}, {"tag": "p", "text": "The Athylia approaches a rocky world, orbited by two moons. Master Beq welcomes Clementine and Oliver for making it to the Jedi Temple. AD-3 says that she is proud they could do it while LX-R5 beeps. Beq praises the Padawans for their understanding of the Force and that the time has come to put all that they have learnt into practice. AD-3 tells them to leave their lightsaber hilts on the Temple Shrine, adding that until they collect their crystals they are not much more than shiny pieces of metal."}, {"tag": "p", "text": "Beq says AD-3 is correct and explains that the kyber crystals are what powers their blade. He tells them to bring their holocrons inside the Temple. Master Beq says the he will be using the Force to follow their progress. He tells them to beware of the dark side because it will tempt them to take an easier path forward. He tells them to choose wisely as it may clear one path only to make the other more difficult. Beq tells them to trust in the Force and says that it will guide them. He asks if they are ready to trust in the Force. The Padawans say yes and he announces that their final trials begin now."}, {"tag": "p", "text": "As the Padawans run inside, AD-3 encourages them. Clementine and Oliver navigate up the Summit Scramble to the Galaxy Globe, where they will need to work together to match the correct color combination of the flashing orbs on the control panel. The two quickly match the colors and then slide down the chute into the garbage masher where they have to work together to assemble the correct color code to unlock the doors."}, {"tag": "p", "text": "Clementine goes to the console and guides Oliver as he selects the tiles. The two work together to find the tiles. As they go about their task, the dark side voice tries to tempt Oliver into giving into the dark side so that he can move to the next challenge. However, the Padawans manage to find the tiles in time and unlock the door, defeating the dark side."}, {"tag": "p", "text": "The Padawans then unlock the next chamber where they have to match all the power cables to their corresponding power connectors. The two work together to match the cables and connectors based on their shapes. As they struggle, Master Beq counsels them to focus and to get their bearings and try again. He counsels them to trust in the Force, saying that it will guide them. Racing against the clock, the two manage to complete the power cable challenge."}, {"tag": "h3", "text": "Taking a step back"}, {"tag": "p", "text": "Clementine and Oliver scale the frigid ridge but run out of time. Master Beq informs the two Padawans that they have run out of time and instructs them to return to the entrance of the Temple. AD-3 tries to reassure the Padawans that they were so close."}, {"tag": "p", "text": "Master Beq says that the power connector chamber is extremely challenging while AD-3 says that she couldn't have done it. LX-R5 beeps. While they may not have succeeded in their trial today, Master Beq reassures them that they are on the right path and that he can foresee them becoming great Jedi Knights in the future. Yoda reassures the Padawans that they will have to go through trials but that they will becoming Jedi Knights one day."}, {"tag": "p", "text": "In a follow-up video, Clementine says that they underestimated the difficulty of the course and that they were going pretty fast up until they were connecting the blocks. She says that if they worked together a little bit better, they could have done it. Clementine things that they did their best and that they did well. Oliver says that his experience here was an amazing experience even though they did not make it to the end. Clementine agrees and says that it was an amazing challenge."}, {"tag": "p", "text": "Master Beq, AD-3, and Yoda wishes Clementine and Oliver that the Force will be with them always."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}