{"url": "Star_Wars:_Inner_Jedi", "categories": ["Category:Real-world articles", "Category:Future books", "Category:Canon reference books", "Category:Replica journals"], "nodes": [{"tag": "h1", "text": "Star Wars: Inner Jedi"}, {"tag": "p", "text": "Star Wars: Inner Jedi is a forthcoming canon reference book and guided journal focusing on the teachings and philosophy of the Jedi Order. The book is scheduled to be published by Insight Editions on January 4, 2022."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Discover your inner Jedi and learn the ways of the Force with this yearlong guided journal inspired by the Star Wars galaxy!"}, {"tag": "p", "text": "Embark on your own Jedi path, with this deluxe guided journal filled with the teachings and philosophy of the Jedi Order."}, {"tag": "p", "text": "• BEGIN YOUR JEDI TRAINING: The Jedi Knights of the Star Wars saga are selfless peacekeepers who master the light side of the Force, defending the helpless and striving for justice all across the galaxy. With this guided journal, you can develop the key Jedi traits of peacefulness and selflessness."}, {"tag": "p", "text": "• YEARLONG JOURNALING INSPIRED BY THE JEDI PATH: Through a combination of daily journaling, free-writing prompts, list-making, coloring meditations, and other activities, this journal show you the ways of the Force."}, {"tag": "p", "text": "• GREAT FOR ANY STAR WARS FAN: The perfect gift for any Star Wars fan, this journal will serve as a reminder that the Force is with you, always."}, {"tag": "p", "text": "• FAN-FAVORITE STAR WARS BOOKS: Star Wars: Inner Jedi is the latest book in Insight Editions' fan favorite Star Wars lineup, which includes Star Wars: The Secrets of the Sith, Star Wars: The Lightsaber Collection, Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook, and many more."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}