{"url": "Star_Wars:_Knights_of_the_Old_Republic:_Dueling_Ambitions", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Knights of the Old Republic: Dueling Ambitions"}, {"tag": "p", "text": "Dueling Ambitions is the twelfth story-arc in the Star Wars: Knights of the Old Republic series of comics."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "Goethar Kleej was a male Gotal who, around the time of a war fought between the Galactic Republic and Mandalorian Neo-Crusaders, was abducted by The Crucible slaving organization and was forced to train as a competitor for swoopdueling matches run by the Franchise entertainment firm. Early on during his stay in The Crucible's training pits, Kleej's slaver, Chantique, became angry with him and ordered his cones to be severed. The removal of the sensory organs, unique to Gotals, that picked up electromagnetic signals was a heinous act in Gotal culture. Kleej later had false cones implanted to disguise the fact but still had to rely on his other senses to live. While in the slave pits, Kleej had a son, Aubin, with another Gotal. Aubin's mother was able to help him filter out the electromagnetic signals he received, but she was later killed, leaving Aubin helpless. Kleej performed well in training and was put through to the top swoopdueling events, participating in the Solo Aerials at Jervo's World—a massive space station run by the Franchise over the planet Pantolomin—and, as of 3963 BBY, he had won it four times consecutively. Kleej's popularity was such that he did advertisements and endorsements, had a toy line, and was used as a mascot for the events. Kleej won his fourth Solo Aerials by defeating one of the D'qell Sisters and, at the end of the match, attempted to inform the crowds of spectators about the hidden slaving practices that provided duelists for the Franchise. However, a pre-recorded speech was played over his pleas for help to the spectators in which he instead announced his retirement. The crew of the Hot Prospect soon met up with Gryph on Jervo's World, which was known for its large network of swoop-dueling arenas and as the location of the Hall of Champions. Gryph's planned to scam Jervo Thalien by taking advantage of a delay between the holofeed in the arena and the betting area. Since the Franchise allowed betting during the match, Gryph's plan was to call down the results of the match to Jarael who would quickly place a bet for the winner before the feed could reach the bettors. The plan was soon thrown in flux thanks to Jarael and Zayne. Jarael had moral concerns over swindling legitimate bettors, and also disapproved of the duels' savagery. Zayne on the other hand was entranced by the Hall of Champions as well as being in such close proximity to the swoop dueling arenas. He had been such a huge swoop racing fan while a Padawan on Taris that his hero was not a Jedi, but rather, famed duelist Goethar Kleej. When a replica of Kleej's swoop bike was offered as a prize to the amateur placing highest in the Tandem Open, Zayne quickly signed up, which antagonized both Gryph who was counting on him, as well as Jarael who was upset by his selfishness. In return for threatening to reveal the slavery behind the game, Kleej was physically beaten by two underlings of Bardron—the Krish in charge of the actual games themselves—and was threatened with being sent back to the training pits. Kleej noted that, if sent back to the pits, he would at least be able to see his son, not having done so since the start of the season. Expecting the emotional attachment to Aubin, Bardron revealed that the Gotal's son had been put in the upcoming Tandem Open and that the other competitors had been told to avoid him. Bardron made Kleej the offer that if both he and Aubin won the Open, they would both be able to retire fully. However, the two Gotals would not be in the same round unless they both advanced to the finals. In Zayne's absence, Hierogryph entrusted Jarael to place bets while he sent her the information. However, she found herself unable to place the bets due to her being uncomfortable making wagers on brawls—for reasons even she didn't understand. While Gryph vented over his frustration with Zayne, Demagol had been spotted, thanks to his wearing of Rohlan Dyre's armor, and apprehended by security forces under the suspicions of him being one of the supposed saboteurs from the Vindication-cover up. Gryph protested and explained how Demagol's appearance was for show. Going on to explain that he was Jarael's client and she wished to sign him up for the duels. Meanwhile, former Jedi Padawan Zayne Carrick had entered the same Tandem Open round as Aubin and also managed to advance to the next round. Kleej approached the Human after the round and ordered him to protect Aubin so that he would make it through to the finals, threatening Carrick with death if he failed to do so. In the semi-finals, Carrick successfully got himself and Aubin through to the next round, though the Gotal struggled throughout the match. Kleej had meanwhile returned to the sport in the same semi-final round and fought with another contender, \"Spikes,\" the \"Mandalorian miscreant.\" The two exchanged blaster fire before Kleej leaped at \"Spikes\" from his bike, proceeding to engage him in unarmed combat. The pair then quickly turned and simultaneously shot a Night-Soarer competitor, leaving them as the last two standing and putting them through to the final round. Later, while resting aboard Hot Prospect, Jarael experienced aForce vision. In this vision she was back on Taris in the Jedi Tower, wearing the red spacesuit and wielding Carrick's yellow lightsaber. But instead of Zayne's Masters she saw the men who played significant role in her life over the past few months: Malak, Rohlan Dyre, Demagol and Arkoh Adasca. The four men who expressed interest in Jarael in reality, told her that the reason for that was hidden within herself, pointing to her clouded past and mysterious destiny. A moment later Zayne Carrick appeared in the vision as well, bound in chains and blaming Jarael for betraying him. A mysterious woman who held Carrick's chains told Jarael that he now belonged to her and left her at the mercy of the four men. At that moment Jarael woke up and unwillingly overheard Zayne Carrick speaking to, what appeared to be, T1-LB. Realizing that Zayne was concerned about Goethar Kleej, Jarael showed him the non-edited version of his \"retirement speech\" which Hierogryph had lifted from the broadcast center. Zayne spoke to his childhood hero after this, where he taught Aubin a Force technique to block out the discordant signals that he was picking up. Zayne later became visibly agitated after Rohlan criticized him for teaching a Force technique to Aubin and not to Jarael. Little did the two know that Jervo Thalien was planning to sabotage them and the Kleejs in the final. Shortly before the start of the finals of the swoop-dueling event called the Tandem Open, the security on Jervo's World received an order to stop every Snivvian and Arkanian offshoot they saw, in order to capture Hierogryph and Jarael. This, however, proved to be unsuccessful, as the Snivvian already had himself and Jarael disguised in preparation for the next part of his confidence trick. Jarael, disguised as a blue-skinned species, flirted with the composer for the games and managed to switch his data cube containing a score for the finals with a cube that contained the full version of Goethar's speech as well as the conversation of Bardron and Thalien, which exposed the Franchise's slave dealings. Later, when Jervo Thalien arrived to watch the Finals of the Tandem Open and learned about the presence of his old rival, Marn Hierogryph on the station, Bardron comforted him by saying that he knew about everything that happened on the station and revealed that both Goethar Kleej and Zayne Carrick were about to meet with unfortunate accidents during the Finals, organized by the Franchise. The Tandem Final featured Zayne, Rohlan, the Kleejs, two Togorian sisters, a Tyluun Night-Soarer and a Mandallian Giant. However, Jervo's saboteurs had done their work; they had soaked the Night-Soarer's claws in venom, and removed the safeties from the Togorians' weapons. Most insidious of all, they had sabotaged the Kleejs' bike and Zayne's blaster. Despite Zayne's misgivings, Gryph was able to communicate a plan to Zayne through a comlink to get Goether and his son to safety. The plan involved replacing the official musician's score with Goethar's warning about the slave system and Jervo's plans to kill the Kleejs and their friends. The effects of the sabotage were soon apparent as Rohlan was temporarily disabled by a shot from the Togorians. When Goethar's accelerator jammed and brakes failed, he asked Zayne to grab Aubin. As they flew through a swamp, Zayne and Aubin fell off the bikes when the Mandallian Giant tried to ram them. Zayne tried to shoot him, but realized that his blaster had been tampered with as well. He jumped at the Giant with a long pole but was quickly knocked aside. Fortunately, Goethar defeated the Mandallian with a couple of well placed punches. Meanwhile, Rohlan was able to defeat the Togorian sisters by causing them to shoot each other. As the Night-Soarer attacked Zayne's speederbike, Goether crashed it through a weak section in the protective glass separating the duel area from the audience, which Gryph had also communicated to them. The Kleejs were finally able to escape, and Rohlan became the winner by default as he was the only undefeated participant who had not gone off of the course. During the escape, Goethar's and Jervo's speeches were played to the audience, causing the crowd to throw debris at Jervo. Rohlan received the \"Goethar Special\" bike to which Zayne requested he share with him. As the Hot Prospect was about to leave, Zayne asked Jarael to consider training with him in the Force. While they were talking, Goethar noticed Jarael's facial tattoos and immediately attacked her, warning her to stay away from him and his son. He then told Zayne that he never wanted to see his face again, and accused him of being a liar for associating with Jarael. As Jarael marched off to her room, Zayne ran after her, asking to speak to her. He asked if she had been a slave before she had linked up with Camper, but Jarael replied that instead of being a slave, she had been a slaver and closed the door in his face. Although Jervo had his people out trying to contain the public relations disaster, he told Chantique, a member of The Crucible slaving ring, that he wanted to sever ties with them. In response, Chantique strangled him to death with a long whip."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}]}