{"url": "Star_Wars:_Jedi_Temple_Challenge_-_Episode_8", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Jedi Temple Challenge"], "nodes": [{"tag": "h1", "text": "Star Wars: Jedi Temple Challenge - \"Episode 8\""}, {"tag": "p", "text": "\"Episode 8\" is the eighth episode of Star Wars: Jedi Temple Challenge, a children's game show set in the Star Wars universe. The episode premiered on July 22, 2020 on the Star Wars Kids YouTube channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Join Jedi Master Kelleran Beq (Ahmed Best), wise-cracking protocol droid AD-3 (Mary Holland), and astromech LX-R5 in Star Wars: Jedi Temple Challenge, as they guide Padawans Julia and Daniel (Blue Team), Mariezl and Tullan (Orange Team), and Arthur and Grant (Purple Team) in their quest to become Jedi Knights!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Commencement"}, {"tag": "p", "text": "The episode opens with an introduction by Jedi Master Kelleran Beq that the Jedi Knights have been the guardians of peace and justice in the galaxy for over a thousand generations. Three Padawan teams must prove that they have the strength, knowledge and bravery to become Jedi Knights."}, {"tag": "p", "text": "We are introduced to twins Daniel and Julia of the Blue Team. We are introduced to best friends Arthur and Grant of Purple Team, who describe themselves as the best team ever. We are introduced to siblings Mariezl and Tullan of the Orange Team."}, {"tag": "p", "text": "Master Beq explains that the contestants have to endure three trials: the strength trials on a distant world, the knowledge trials aboard a Jedi star cruiser, and a trial of bravery inside the Jedi Temple to become Jedi Knights. He asks if the Jedi Padawans will be tempted by the dark side or if they will keep their minds focused on the light side of the Force."}, {"tag": "p", "text": "On the forested world, Master Beq introduces himself and his trusty droids AD-3 and LX-R5 to the contestants.  AD-3 interjects that she is trusty not rusty. LX-R5 beeps, prompting AD-3 to interject that he is a bit sensitive about his rust and tells the Padawans to try not to bring it up."}, {"tag": "p", "text": "AD-3 brings up the Padawans' data files. 13-year-old Daniel says that he is the strength while his 13-year old sister Julia says that her brother is the smart one. Daniel says that they know each other's strengths and weaknesses while Julia vows to demolish their competition. 10-year Arthur says that their competition should be scared of them because they are smart while 11-year old Grant says that we are going to get \"it.\" 13-year old Mariezl says that her 11-year old brother Tullan has the ideas and strengths but that together they are going to full \"combo.\" Tullan adds that they are going to win and not give up. AD-3 is impressed but reminds the Padawans about the attributes of a Jedi. The contestants repeat strength, knowledge, and bravery."}, {"tag": "h3", "text": "Strength Trials"}, {"tag": "p", "text": "AD-3 says that they nailed it. A pleased Master Beq introduces them to the first challenge of the day, a Jedi obstacle trial called the Strength Trials, which they must complete in order to build their lightsaber. AD-3 explains that the Leap and Lift tests their jumping, the Power Pull tests their tests their might, Saber Stability tests their balance, and the Swing of Strength tests their swinging and strength. She explains that every obstacle they complete unlocks a piece of their lightsaber hilt. The first two teams to finish every obstacle and collect their hilt pieces will move on to the Knowledge Trial and be one step closer to entering the Jedi Temple."}, {"tag": "p", "text": "Master Beq asks the Padawans if they are ready to put their training to use. The Padawans shout yes. As Master Beq uses the Force to raise rocks, AD-3 marvels at the Force. Master Beq tells the Padawans to put their foot on the platform before sending them off on the obstacle course."}, {"tag": "p", "text": "Arthur and Grant rush into the Leap and Lift where they have to catch two meiloorun fruits in order to unlock their first pieces. Tullan and Mariezl try the Power Pull challenge, using a sled to pull themselves to the other side where they have to use a token in their bagpacks to unlock a hilt piece. The two quickly obtain their hilt pieces."}, {"tag": "p", "text": "Daniel and Julia enter the Saber Stability course where they have to use training circles to knock over floating rocks. Meanwhile, Arthur obtains his first hilt pieces while Orange Team make their way back on the Power Pull sled with their first hilt pieces. Blue Team also obtain their first hilt piece. Orange Team reach solid ground and place their first hilt pieces on the table, becoming the first team to return. Julia and Daniel also navigate back across the Saber Stability challenge with their first hilt pieces. Master Beq quips that if that training saber was real, Daniel would need a hand. AD-3 remarks that was clever while LX-R5 beeps. Blue Team becomes the second team to return with their first pieces, tying the Orange and Blue Teams."}, {"tag": "p", "text": "Meanwhile, Grant struggles to obtain his lightsaber hilt with Master Beq encouraging him to trust in the Force. Elsewhere, Tullan starts on the Swing of Strength, where one Padawan has to figure out what token is needed to unlock their hilt pieces. Tullan says its a circle and Mariezl rushes over to join her brother. Meanwhile, Grant manages to climb to the top of the wooden stockade and obtain his hilt piece, earning the praise of Master Beq and AD-3. Purple Team deliver their pieces, tying the three teams at one point each."}, {"tag": "p", "text": "Elsewhere, Orange Team obtain their second hilt pieces with Mariezl swinging back. Meanwhile, Blue Team attempts the Power Pull while Purple Team navigates through the Saber Stability course. Tullan and Mariezl take the lead and return with their second set of hilt pieces. Elsewhere, Julia and Daniel unlock their second set of hilt pieces."}, {"tag": "p", "text": "Grant encourages Arthur across the Saber Stability obstacle course and they unlock their second set of hilt pieces. Orange Team enters the Leap and Lift course with Mariezl obtaining her hilt piece. As Blue Team heads back, Orange Team returns to the table with their third set of pieces placing them in the lead. Purple and Blue Teams soon return with their second hilt pieces."}, {"tag": "p", "text": "Tullan and Mariezl enter the Saber Stability course while Purple Team enters the Swing of Strength. Arthur obtains his piece. Meanwhile, Julia grabs her meiloorun fruit, earning the praise of AD-3 while LX-R5 beeps. Orange Team obtain their fourth hilt pieces and head back to the table to assemble their hilt pieces. Grant and Arthur swing across the Saber Stability set, earning the praise of AD-3 while LX-R5 beeps. The two friends obtain their third hilt pieces."}, {"tag": "p", "text": "Meanwhile, Julia and Daniel obtain their third hilt pieces and return to the assembly table before heading to their final challenge. At the assembly table, Tullan and Mariezl assemble their hilt pieces. Arthur and Grant return to the assembly table with their third set of hilt pieces while Orange Team finishes assembling their lightsaber hilts, becoming the first team to complete the Strength Trials and move on to the next challenge."}, {"tag": "p", "text": "Elsewhere, Daniel waits for Julia to return with the key to unlock their last hilt piece.  Meanwhile, Grant and Arthur enter the Power Pull, with AD-3 remarking that she \"has a bad feeling about this.\" The Blue Team unlock their fourth hilt pieces and start to head back while the Purple Team reaches the other side and obtain their fourth hilt pieces."}, {"tag": "p", "text": "Blue Team returns to the pedestal while Purple Team begin making their way back across the Power Pull obstacle course. On the way back, Grant falls off and the two make a second attempt to return. Back at the assembly area, Blue Team completes their lightsaber hilts, becoming the second team to complete the Strengths Trials. AD-3 announces that the Blue Team will be moving on to the next challenge."}, {"tag": "p", "text": "Master Beq announces that the challenge is complete. He congratulates the Orange and Blue teams. Master Beq congratulates the Purple Team for their great work and reassures them that they will be back in no time. He tells Grant and Arthur to head back to the Jedi Order for more training. In a follow-up video, Grant says that it is the kind of thing you can do once in a lifetime. Arthur says that he had a great time even though they lost. He adds that it is good to have fun and that they at least tried their best."}, {"tag": "h3", "text": "Knowledge Trial"}, {"tag": "h4", "text": "Story time"}, {"tag": "p", "text": "Master Beq tells the Orange and Blue Teams that they have much to do. AD-3 is also excited while LX-R5 beeps. In space, Master Beq welcomes Padawans Daniel, Julia, Tullan and Mariezl aboard the Jedi star cruiser Athylia. He asks if they are ready for their second trial."}, {"tag": "p", "text": "Master Beq explains that this will be a trial of knowledge where they will have to listen to a tale. He will ask them questions about the story and every correct answer will be stored as data in their holocrons. Holocrons will be awarded to the first team to answer all five questions correctly. Beq reiterates that they will need those to enter the Jedi Temple and asks if they are ready to hear their tale. AD-3 says great and that she can't wait to hear it either. Master Beq points out that it is her job and AD-3 remembers."}, {"tag": "p", "text": "Jedi Chareg Yim didn't like heights but that didn't stop him from answering a distress call from the short, pig-faced Ugnaughts on their lightning mining platform above the stormy clouds of the planet Tish. Leathery-winged, long-neck monsters were attacking, gliding their bodies in the air while the Ugnaughts squealed in frustration."}, {"tag": "p", "text": "Chareg tried not to look down as he rushed onto the platform where the remaining Ugnaughts were hurling hand lamps at one beast in particular. They cheered when it turned all four of its tails and flew away. But the Force told Chareg to follow the beast. Borrowing a jetpack from an Ugnaught, a conveniently small Youngling-sized jetpack, he blasted through the crowds towards the snow-capped mountains."}, {"tag": "p", "text": "Using his macrobinoculars, he saw a nest made of nine big boulders where the creature landed, sparking energy into the maws of three hungry baby monsters. Chareg realized that the lightning is their food. The mother's eyes snapped up onto Chareg as he rocketed back towards the platform. The beast and his babies now followed closely behind him."}, {"tag": "p", "text": "\"Reverse your energy scoops. Send your lightning back into the clouds,\" Chareg shouted to the Ugnaughts as he approached the platform."}, {"tag": "p", "text": "The hungry beasts, focusing all six rows of their razor-sharped teeth on the lightly miners. Closing their eyes, the Ugnaughts blasted their energy stores back into the clouds. The creatures changed course, excitedly swooping to lap up the lightning, burping up bursts of electricity in the sky. Chareg didn't want to stick around to see the lightning coming out of their \" other ends.\""}, {"tag": "p", "text": "\"Make sure that you leave some for our flying friends from now on,\" Chareg said to the Ugnaughts. \"There is enough for everyone.\""}, {"tag": "p", "text": "AD-3 wraps up the story while Master Beq tells the Padawans that each team must choose which one of them wants to take the pilot seat while the other will take the engineer position searching for clues in the cabin. Both positions have a button to log in their answers, either on the cockpit or a console which the camera focuses on."}, {"tag": "h4", "text": "Question time"}, {"tag": "p", "text": "Beq asks who wants to be the pilot and who wants to be the engineer. Daniel volunteers to be the pilot wile Julia volunteers to be the engineer. Mariezl volunteers to be the engineer while Tullan volunteers to be the pilot. AD-3 sends them to their stations. She tells them to wait for the question to be asked. She tells the engineers to find the right object and to return to the console. She tells the pilots to press the correct button on the cockpit once they have the answer. She reminds them that communication is vital and to use their headsets to communicate."}, {"tag": "p", "text": "Master Beq asks the engineers to find a tile depicting what Chareg borrowed to follow the creature. Julia is the first to find her tile and says that it was a mini jetpack. Master Beq says correct and awards Blue Team their first point."}, {"tag": "p", "text": "Master Beq asks the pilots how many baby monsters were inside the nest. Daniel correctly answers that it was three, gaining Blue Team their second point."}, {"tag": "p", "text": "Master Beq then asks both the engineers and pilots a verbal question. He tells them to log in their answers first. He asks them the name of the planet. Mariezl correctly answers Tish, gaining Orange Team their first point. Master Beq compliments the teams for their teamwork before updating the tally. Blue Team still leads by two to Orange Team's one."}, {"tag": "p", "text": "Master Beq then asks the engineers to pick a tile showing the object that the Ugnaughts were hurling at the creature. AD-3 warns the engineers to be careful while looking in the box because LX mistook it for a refresher. LX beeps grumpily."}, {"tag": "p", "text": "Mariezl correctly fishes out a hand lamp, earning the praise of Master Beq who awards Orange Team a second point. The two teams are tied at two: two."}, {"tag": "p", "text": "Master Beq asks the pilots the color of the stormy clouds. Daniel locks in first and correctly selects pink. Blue Team leads at three points with the Orange Team at two. AD-3 says that she can't handle the suspense."}, {"tag": "p", "text": "In a follow-up video, Julia says that she is intelligent but that her brother Daniel is the knowledge. That's his thing. I get it right by being his twin."}, {"tag": "p", "text": "Master Beq tells the engineers to choose a tile showing what the creatures' nest was made from. Julia correctly picks a rock, placing Blue Team at a lead of four to Orange Team's two."}, {"tag": "p", "text": "Master Beq tells Blue Team if they get one more right, they can move on to the Jedi Temple. AD-3 reassures Orange Team that they are still in this game."}, {"tag": "p", "text": "Master Beq then asks the pilots the number of tails that the mother creature had. Tullan correctly answers that it was four. Master Beq announces that they are at four to three."}, {"tag": "p", "text": "Master Beq then asks the engineers to choose a tile showing what Chareg used to spot the creature's nest. Mariezl picks a pair of binders, which are incorrect. Julia correctly picks a pair of binoculars, giving Blue Team the five points needed to move on to the Jedi Temple challenge."}, {"tag": "p", "text": "The Orange and Blue teams shake hands. In a follow-up video, Julia says that she is pretty stoked that she and Daniel won. Daniel says that it was pretty easy since they were synchronized for that one. They say that they were really in tune, which was great."}, {"tag": "p", "text": "Master Beq reassures Orange Team that their path today may have ended but that their journey to becoming a Jedi Knight is not over. However, he tells them that they need to continue their training with the Jedi Order. He wishes that the Force will be with them while AD-3 tells them to have fun at the Jedi Order and to tell everyone that they should still miss me."}, {"tag": "p", "text": "In a follow-up video, Mariezl says that had a lot of fun today and that it was a great experience. She advises other Padawans to stay calm and says that if she had stayed a little bit more calm, she would have been able to get the binoculars rather than the binder cuffs. Tullan advises other Padawans to have fun and that it is so much better to just have fun."}, {"tag": "p", "text": "Master Beq congratulates Padawans Julia and Daniel for completing the Trial of Knowledge. He awards them the holocrons, with AD-3 saying that it should be up in no time as soon as the Force speeds it up. The holocrons rise out of the machines. Master Beq tells the Padawans to each grab one and to put it in their pouches because they will need it on their next trial. LX-R5 beeps, with Master Beq explaining that it is time to get into the cockpit. Master Beq explains that he has programmed the coordinates of the Jedi Temple into the Athylia's navigation system. Beq and AD-3 tell the Padawans to punch it and the two raise the hyperspace levers, taking the ship into hyperspace."}, {"tag": "h3", "text": "Temple Trial"}, {"tag": "p", "text": "The Athylia approaches a rocky world, orbited by two moons. Master Beq welcome Padawans Julia and Daniel to their final trial. He tells them this is what all of their training has led them to. AD-3 adds that they are so close to accomplishing their goals and that it is more important than ever to stay focused and work together. Beq tells them that they will both attempt the Trial of Bravery inside the Jedi Temple. AD-3 tells them to leave their lightsaber hilts on the Temple Shrine, adding that until they collect their crystals they are not much more than shiny pieces of metal."}, {"tag": "p", "text": "Master Beq adds that the kyber crystals that power their blades are inside the Temple.  He tells them that they will need their holocrons and to keep them nearby. He tells them that he will be using the Force to follow their progress from outside the Jedi Temple. He tells them to beware of the dark side because it will tempt them to take an easier path forward. He tells them to choose wisely as it may clear one path only to make the other more difficult. Beq tells them to trust in the Force and says that it will guide them. He asks if they are ready to begin the Trial of the Temple. The Padawans say yes and Beq warns them that time is of the essence. He tells them to go."}, {"tag": "p", "text": "Julia and Daniel scale the Summit Scramble and enter the Galaxy Globe. There, they have to work together to match the correct color combination of the flashing orbs on the control panel. The twins work together to match the colors with Daniel giving Julia instructions. The two siblings then slide into the Garbage Masher where they will find a set of glyph triangles. Even though they are separated, they must work together to match the glyph triangles in the correct sequence in order to unlock the doors to the next sequence."}, {"tag": "p", "text": "Daniel guides Julia through the challenge, explaining the shape of the objects. The dark side voice tries to tempt them into pressing the triangle in order to open the door. He tempts Julia while Daniel asks his sister if she put the square in as he had told her. Julia says yes and they move on to the next object. The dark side voice claims that he can help Julia and her brother escape this room."}, {"tag": "p", "text": "Julia goes onto the plus object while Daniel tells her to look for a rectangle with two lines and another hexagon-shaped object. Daniel guides Julia but they get the wrong object. Running out of time, they decide to give into the dark side and press the dark side triangle, which opens the door."}, {"tag": "p", "text": "In the follow-up video, Daniel says that was something a Jedi shouldn't have done. But that it is a time-saver and what can he say. Julia said that if they did not have the option to go to the dark side, they would still have been stuck on that puzzle."}, {"tag": "p", "text": "Daniel and Julia open another set of doors and enter the Slide Switch where the Padawans must stand at opposite ends of the table and slide tiles to their matching color positions. The dark side voice taunts them about not being able to complete the challenge since they have to do it in darkness. As the twins try to match the tiles, the dark side voice tempts them for falling right into his trap and tells them to give in to their frustration. Julia guides Daniel as they sort through the tiles while the dark side voice taunts them. Despite the dark side's taunts, the two complete their challenge."}, {"tag": "p", "text": "Master Beq praises the Padawans for overcoming the strong pull of the dark side as they scale the frigid ridge. Julia and Daniel get their ropes entangled while in the middle of that obstacle but managed to overcome that and reach the summit."}, {"tag": "p", "text": "The two Padawans then head to the Bridge of Balance. AD-3 asks about the Bridge of Balance. Master Beq explains that one Padawan will need to balance on a disc to light the path across the bridge. Julia and Daniel take turns to move across the bridge. In a follow-up video, Julia recalls that the Bridge of Balance challenge was fun and that there was a lot of shaking and tilting. The two siblings complete that challenge and slide down the Stone Slide. Daniel and Julia place their holocrons inside the Pedestal of Power, which causes the crystals to emerge from the machine. Master Beq tells the Padawans to meet him at the Temple entrance."}, {"tag": "h3", "text": "Jedi Knighthood"}, {"tag": "p", "text": "As Daniel and Julia run out, AD-3 and Master Beq congratulate them for passing the Trial of Bravery. Master Beq praises them for overcoming the temptation of the dark side and proving that their connection to the light side is strong. He tells them to place their kyber crystals into their hilts. Master Beq then tells them to place their hilts on the shrine."}, {"tag": "p", "text": "As AD-3 passes their Jedi robes, she asks if she can keep one of these. Master Beq promises to get her one but AD-3 responds that he has been promising her that for years. Master Beq tells the Padawans to ignite their lightsabers and to take their sabers from the shrine. Daniel wields a blue lightsaber while Julia wields a green one."}, {"tag": "p", "text": "Master Beq knights them as Jedi Knights by the rite of the Jedi Council and the will of the Force. The voice of Yoda addresses Daniel and Julia, commending them for showing strength, knowledge and bravery. He tells them that they are no longer Padawans but young Jedi Knights."}, {"tag": "p", "text": "In a follow-up video, Julia says that it was pretty awesome that the Force is with her now. Julia says she was expecting them to win but wasn't expecting it to happen like this. Daniel says that combining their abilities gave them an edge during the competition. Julia advises future Padawans not to over-think the challenge while Daniel advises future Padawans to just have fun. He says that they both had fun."}, {"tag": "p", "text": "Master Beq, AD-3 and Yoda wish the young Jedi Knights may the Force be with them always."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}