{"url": "Star_Wars:_Jedi_Temple_Challenge_-_Episode_3", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Incomplete lists", "Category:Star Wars: Jedi Temple Challenge"], "nodes": [{"tag": "h1", "text": "Star Wars: Jedi Temple Challenge - \"Episode 3\""}, {"tag": "p", "text": "\"Episode 3\" is the third episode of Star Wars: Jedi Temple Challenge, a children's game show set in the Star Wars universe. The episode premiered on June 17, 2020 on the Star Wars Kids Youtube channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Join Jedi Master Kelleran Beq (Ahmed Best), wise-cracking protocol droid AD-3 (Mary Holland), and astromech LX-R5 in Star Wars: Jedi Temple Challenge, as they guide Padawans Sean and Hailey (Blue Team), Evan and Tobin (Orange Team), and Dodge and Tate (Purple Team) in their quest to become Jedi Knights! #StayHome #WithMe"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Commencement"}, {"tag": "p", "text": "The episode opens with an introduction by Jedi Master Kelleran Beq that the Jedi Knights have been the guardians of peace in the galaxy for over a thousand generations. Three Jedi teams must prove that they have the strength, knowledge and bravery to become Jedi Knights."}, {"tag": "p", "text": "We are introduced to Sean and Hailey of the Blue Team, who are best friends. They are followed by Tate and Dodge of the Purple Team, who are siblings. We are then introduced to Evan and Tobin of the Orange Team, who are best friends. Master Beq explains that the contestants have to endure three trials: the strength trials on a distant world, the knowledge trials aboard a Jedi star cruiser, and a trial of bravery inside the Jedi Temple. He asks if the Jedi Padawans will be tempted by the dark side or if they will keep their focus on the light side of the Force."}, {"tag": "h3", "text": "Strength trials"}, {"tag": "p", "text": "On the forested world, Master Beq introduces himself and his trusty droids AD-3 and LX-R5 to the contestants. AD-3 looks at the data files. 11-year old Sean says he is strong and deadly while 12-year old Hailey says that she is creative and think outside the box. They say that they will beat the other teams because they have known each other for a long time. 12-year old Evan and 11-year old Tobin of the Orange Team say that they have been training a long time together and are going to win. 11-year old Dodge and 12-year old Tate say that they are brothers and sisters and are very competitive. AD-3 reminds the contestants about the attributes that a Jedi must possess. The Padawans chant strength, knowledge and bravery."}, {"tag": "p", "text": "Master Beq is impressed by their enthusiasm and briefs them about the strength trials, which he describes as Jedi obstacle course that they must complete in order to build their lightsabers. AD-3 explains that the Leap and Lift tests their jumping, the Power Pull tests their tests their might, Saber Stability tests their balance, and the Swing of Strength tests their swinging and strength. She explains that every obstacle they complete unlocks a piece of their lightsaber hilt. The first two teams to complete the strengths course will move on to the knowledge trial and be one step closer to entering the Jedi Temple."}, {"tag": "p", "text": "Master Beq uses the Force to lift rocks before telling the contestants to place their foot on the Jedi platform before sending them off. AD-3 quips about Beq's voice before reporting that the Purple Team have entered the Leap and Lift trial. Tate and Dodge work together to jump up and reach two meiloorun fruits in order to retrieve their hilts. Tate retrieves her lightsaber."}, {"tag": "p", "text": "AD-3 reports that the Blue Team are attempting the Swing of Strength. Sean encourages Hailey with AD-3 explaining that one Padawan must swing across to reveal their piece. Hailey manages to find their peace. The Orange Team work together to navigate the Power Pull trial where they have to pull themselves to the other side to unlock a token in their backpack that would reveal their piece."}, {"tag": "p", "text": "The Purple Team takes the lead in obtaining one hilt piece, earning Beq's praise. Hailey takes her turn to swing over the Swing of Strength, obtaining their first pieces. The Purple Team then attempts the Saber Stability trial which involves navigating logs to knock over floating stones to reveal their hilt pieces."}, {"tag": "p", "text": "Meanwhile, Tobin and Evan of the Orange Team unlock their first hilt piece in the Power Pull trial. Elsewhere, Sean completes the Swing of Strength. Blue Team then deliver their first hilt piece to the table, earning the praise of Master Beq and the droids."}, {"tag": "p", "text": "Tate and Doge retrieve their second hilt pieces from the Saber Stability trial, earning the praise of Master Beq and AD-3. Sean pulls down a meiloorun fruit vine with Master Beq reassuring him that it is acceptable. AD-3 reports that the Purple Team have delivered their second hilt piece, making the score two to one with Orange Team still lagging behind. Blue Team also pick up their piece while Orange Team delivers their third piece to the table. Blue Team delivers their piece, placing them head to head with the Purple Team."}, {"tag": "p", "text": "The Purple Team attempts the Swing of Strength with Tate helping Dodge to retrieve a piece. Orange Team navigates the Saber Stability trial with Tobin scoring a hit, earning Beq's praise. Meanwhile, Tate catches Dodge on the Swing of Strength. Blue Team attempts the Power Pull challenge, with Master Beq and AD-3 describing it as difficult due to their weighted packs. Beq admits that this was his idea, much to AD-3's alarm."}, {"tag": "p", "text": "Tate and Dodge deliver their third piece, placing Purple Team in the lead with Blue second and Orange trailing behind with one piece. While Evan and Tobin navigate Saber Stability, Sean and Hailey return with their third piece, placing them neck to neck with the Purple Team. Purple Team attempts the Power Pull. Evan and Tobin return with their second piece with AD-3 urging them to hurry up because they are in a race."}, {"tag": "p", "text": "Purple Team crosses to the other side, earning the praise of Master Beq and AD-3 for not being bogged down by the challenge. Purple Team return with their fourth lightsaber piece and assemble their hilt. Master Beq congratulates them while AD-3 praises Tate for being a natural at saber construction. As Evan struggles with the Swing of Strength, AD-3 remarks that he is embracing the swing part of that trial."}, {"tag": "p", "text": "Tate and Dodge work to finish their hilt, with AD-3 encouraging them. Beq praises Blue Team for their balance. Tate and Dodge hug after fixing their lightsabers. AD-3 announces that they will be moving to the next trial. Blue Team arrives with their last hilt pieces. Hailey assembles her lightsaber and helps Sean assemble his hilt. While AD-3 tells Tobin to pass the rope Evan, Master Beq announces that trial is complete."}, {"tag": "p", "text": "Following the Strengths trial, Master Beq congratulates Tate and Dodge, and Hailey and Sean. He tells them that they will be moving to the next trial. Beq reassures Evan and Tobin that their efforts were strong but that they must return to the Jedi Order to continue their training, wishing that the Force will be with them. In a later video, Evan says that they probably should have communicated a little bit more which would have allowed them to make it further."}, {"tag": "h3", "text": "Knowledge trial"}, {"tag": "h4", "text": "Story time"}, {"tag": "p", "text": "Master Beq leads the Padawans to their next trial, much to their joy. AD-3 asks Master Beq if LX-R3 can pilot for a change but Beq responds that he will think about it. AD-3 complains this is what he said last time."}, {"tag": "p", "text": "Aboard the Jedi star cruiser Athylia, Master Beq addresses Padawans Tate, Dodge, Hailey, and Sean, welcoming them aboard the ship and inviting them to take part in the Knowledge trial. He explains that AD-3 will tell them a tale and that he will ask them a question. Every right answer will be stored as data on their team's holocron. AD-3 says that the first team to answer all five questions will move on to the Temple trial, which will be store inside their holocron."}, {"tag": "p", "text": "Beq asks if the Padawans are ready and they answer in the affirmative. LX-R3 begins her story. Yates, her best friend Oota and their astromech droid Snooze were all working on Yates's Podracer in the pits of the Mos Zabu racetrack on Tatooine. The Yuzzum Pako mocked their podracer for being as junky as their droid. Oota advises her friend Yates to ignore Pako, describing him as a bully."}, {"tag": "p", "text": "Oota finds that her fuel can has been filled with a foul green liquid, which she accidentally pours onto one of the engines. Pako taunts them that he replaced their fuel with bantha sludge stew and that they will be cleaning it up for three days. Pako later boasted about his prank at a local cantina when he overheard the crew hatching a plan."}, {"tag": "p", "text": "Yates and Oota discuss their plans to buy a new racer with Rokey the Hutt's treasure, which is buried near a wrecked sandcrawler in the Dune Sea. Yates tells Oota that she is headed out at sunrise, pointing to the red sandcrawler model on the table."}, {"tag": "p", "text": "The next morning, Yates and her crew traveled to the sandcrawler to find Pako waiting for them. Pako taunted them that he had beaten them to the treasure again. Pako cut through the lock only to be splattered with stinky bantha sludge stew. Pako is upset, saying that it will take him two weeks to get this out of his fur. Yates responded that this is what he gets for pranking them. Yates and her crew raced back to Mos Zabu. AD-3 ends the story by saying that next time Pako will think twice before hatching a nasty plan. LX-R5 beeps."}, {"tag": "p", "text": "Master Beq tells the Padawans that they will have to decide who will serve as pilot and engineer for the next challenge. After the teams pick their roles, AD-3 sends them to their stations. AD-3 reminds the engineers to obtain items from the cabin and place them on the console while pilots have to press the correct button on the cockpit. Master Beq tells the team members that they can speak to each other on their headsets anytime."}, {"tag": "h4", "text": "Knowledge quiz"}, {"tag": "p", "text": "Master Beq tells the engineers Hailey and Tate to choose a tile matching the picture of what the Hutt's treasure was buried under. Hailey picks a wrecked sandcrawler, earning Beq and AD-3's praise. Master Beq asks the pilots Sean and Dodge how tall was Pako. Dodge correctly answers that Pako was five feet tall, earning Beq's praise and bringing the two teams to a tie."}, {"tag": "p", "text": "Master Beq then asks both the pilots and engineers the name of Yates and Oota's droid. Sean picks Snoozey, which Beq accepts as being close to Snooze. Master Beq then asks the pilots about the color of the bantha sludge stew. Dodge correctly picks green, bringing the two teams to a tie of two: two."}, {"tag": "p", "text": "Master Beq then asks both the pilots and engineers the color of Yates and Oota's droid. Dodge correctly picks blue, bringing the Purple Team to a lead of three. Master Beq reassures Blue Team they are not out of this. He asks the engineers where is the Mos Zabu race track. Hailey correctly answers that it is located on Tatooine, giving the Blue Team three scores Beq quips that Tatooine has two suns while AD-3 adds that it is very hot there. LX-RX beeps."}, {"tag": "p", "text": "Master Beq then asks the pilots how many days it would take Bates to clean the bantha sludge stew off her engine. Sean locks in three first, which is correct. Purple Team takes the lead with four with Blue Team at three. AD-3 reassures Blue Team that the game is not over. Master Beq then asks the engineers whose treasure was buried near the wrecked sandcrawler. Dodge correctly answers that it was Rokey the Hutt's treasure, bringing the teams to four: four."}, {"tag": "p", "text": "Master Beq then tells the two teams that the team that answers the next question correctly will move on to the final trial. He asks the engineers what did Pako open and tells them to retrieve their tiles. Hailey of Blue Team picks a treasure chest, which turns out to be the wrong answer. Tate correctly picks the lock and Master Beq announces that the Purple Team will be progressing to the Temple trial."}, {"tag": "p", "text": "In a later video, Tate remarks that Hailey is small but very quick while Dodge compliments the Blue Team's teamwork. Master Beq thanks Purple Team for their efforts but says that they have to return to the Jedi Order to complete their training. In a later video, Hailey says that the best part of the Jedi Temple trials was that even though they struggled, they could still get through it because they worked as a team and didn't give up."}, {"tag": "p", "text": "Master Beq allows the Blue Team to leave the ship. AD-3 quips that the Padawans can use the Force to open the door instead of using the buttons. Master Beq tells the Purple Team that they have earned their holocrons which they will need in the Jedi Temple trial. He asks them to take their seats, explaining that he has programmed the Jedi Temple's destination into the ship's navigation system. He tells them to punch it and they raise the hyperspace levers."}, {"tag": "h3", "text": "Temple trials"}, {"tag": "p", "text": "The Athylia approaches a planet with two moons. At the Jedi Temple, Master Beq welcomes them and says that he can remember every detail. AD-3 is surprised that he can remember that far with Beq adding that he is not that old. AD-3 points out that he is halfway through his lifespan. LX-R5 beeps."}, {"tag": "p", "text": "Master Beq tells Tate and Dodge to leave their lightsaber hilts behind and that they have to go inside the temple to retrieve the Kyber crystals, which AD-3 explains are needed to power them up. AD-3 adds that their hilts are useless metal tubes without the Kyber crystals. Beq says that he will be keeping in touch using the Force while AD-3 tells them to be positive and that they will be back in \"no time.\" Beq warns them that the dark side will tempt them with an easier path but that it will affect the rest of their trial. He tells them to trust in the Force and adds that time is of the essence."}, {"tag": "p", "text": "Inside the temple, Tate and Dodge scale the Summit Scramble to reach the Galaxy Globe where they have to work together to match the flashing orbs in order to move on. They try to match the colors a first time but are incorrect. The two make a second attempt and slide down the garbage masher. There they have to work together to assemble the correct color code to unlock the doors."}, {"tag": "p", "text": "As the two work together to match the colored tiles, the dark side voice taunts them that they are running out of time. He tells them to give in to the dark side, claiming that he can offer them an easy way out. As Dodge guides his sister, the dark side voice claims that his instincts are wrong and tells him to press the button in the center. Tate picks the right set of tiles, unlocking the door much to the dismay of the dark side."}, {"tag": "p", "text": "They then proceed down a chute to the power circuit chamber. Beq praises them for ignoring the dark side and urges them to move on. Together, the two open the doors to the power circuit chamber where they must attach circuit connectors in the right order in order to complete the power circuit and open the door to the next challenge. The two work together to match the pieces to the power circuit."}, {"tag": "p", "text": "After completing that challenge, they scale the frigid ridge and reach the Bridge of Balance where Padawans must stand on discs to illuminate the way across. One Padawan has to cross and light the bridge for their partner. Tate and Dodge work together to navigate the bridge and slide down a slide. They place their holocrons inside a console which brings out the kyber crystals. A pleased Master Beq tells the brother and sister to meet them outside the Jedi Temple."}, {"tag": "h3", "text": "Jedi Knighthood"}, {"tag": "p", "text": "AD-3 and Master Beq congratulate the Padawans for completing the trials of knowledge, strength, and bravery successfully in quite an impressive manner. As Tate and Dodge attach the crystals to their lightsabers, AD-3 reveals that she and LX-R5 have been betting on the color of their lightsabers. AD-3 has betted on blue but says that she is kidding."}, {"tag": "p", "text": "AD-3 passes the Padawans their robes. Tate and Dodge power their lightsabers. Tate has a blue lightsaber while Dodge has a green lightsaber. Master Beq anoints them as Jedi Knights by the rite of the Jedi Council and will of the Force. The voice of Yoda praises them for becoming luminous Jedi Knights and wishes them all the best for their future."}, {"tag": "p", "text": "In a later video, Tate says that they worked really hard as a team. Dodge says that he feels really great and that it is an honor and amazing. Master Beq, Master Yoda, and  AD-3 wish the young Knights that the Force will be with them."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}