{"url": "Star_Wars:_Knights_of_the_Old_Republic:_Vector", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic story arcs", "Category:Star Wars: Vector Story Arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Knights of the Old Republic: Vector"}, {"tag": "p", "text": "Vector is the eighth story-arc in the Star Wars: Knights of the Old Republic series of comics. It is the first part of the cross-series arc Star Wars: Vector."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A month after the events of Knights of Suffering at the memorial for Raana Tey the member of the First WatchCircle have a vision of Karness Muur conquering the galaxy using an army of rakghouls, created by Muur Talisman. Fearing that Zayne Carrick might use the dangerous artifact located somewhere on Taris, they decide to send a Jedi Shadow - a secret agent of the Jedi Covenant - named Celeste Morne to intercept him."}, {"tag": "p", "text": "In the Undercity of Taris constable Noana Sowrs is chased by the rakghouls. When she is about to be overwhelmed, Celeste Morne appears and quickly gets rid of all the monsters. Constable reveals that Cassus Fett's plan to ambush and scatter the resistance has succeeded and the remaining members had been driven into the Undercity. Celeste notices that Noana is biten and kills her moments after she transforms into a rakghoul. After a huge explosion Zayne Carrick and Marn Hierogryph appear, chased by a swarm of rakghouls. When Celeste saves them, they decide to follow her, despite her reluctance. Shortly after they come up on the group of Mandalorian Neo-Crusaders, led by Pulsipher, who had just found the Muur Talisman. Celeste follows them, with Zayne and Gryph keeping behind her."}, {"tag": "p", "text": "The trio hides on the ship taking Pulsipher's team to Jebble. Shortly before the landing Pulsipher manages to activate Muur Talisman which attaches itself to his arm and infects the Mandalorians around him. When the ship lands, Pulsipher goes to his lab and Celeste follows him, while Zayne and Gryph are spotted by a Mandalorian Sergeant, who mistakes them for new recruits and directs them back into \"their group\". The group consists of all kind of scum and villainy from Outer Rim worlds, including Wargo and Frazznik, whom Zayne and Gryph previously encountered on Taris. The Rally Master declares that every recruit who follows the Resol'nare will be considered Mandalorian and announces that the army is going to invade Alderaan. Reuniting with Celeste, Zayne and Gryph, who is now wearing Mandalorian armor, decide to infiltrate the Ice Citadel. Gryph pretends to lead Tarisian slicers to assist Pulsipher, which is convincing enough for the guard to let them inside the War Forge. Once inside Gryph is separated from Zayne and Celeste, who encounter a group of Mandalorian Neo-Crusaders. Suddenly the warriors transform into rakghouls and Zayne and Celeste have no choice but to run. However they realize soon that they have nowhere to run, because there are millions of recruits outside the Citadel and with forthcoming invasion the Rakghoul plague is about to become intergalactic."}, {"tag": "p", "text": "With incredible luck Zayne and Celeste are able to lose their pursuit. In the following conversation Zayne reveals to Celeste that his masters, not him, are responsible for the Padawan Massacre of Taris, as well as some knowledge about the Jedi Covenant and its leader Krynda Draay. Celeste is shocked by hearing this and tries to justify Covenant's action, without revealing to Zayne thay she's itself a part of it. Meanwhile in the Data Center Gryph finds Lucien's record about the history of Muur Talisman and its creator Karness Muur, as well as the mention of Celeste Morne as one of the Covenant's agents. In the communication dome Celeste contacts Lucien Draay, who orders her to retrieve Talisman and to kill Zayne Carrick. Celeste, however, is unsure about that and when she has the chance to strike him down, she does not. Meanwhile Zayne contacts Cassus Fett and warns him not to land because of the plague. Fett is suspicious of him, but decides to check if his report was true."}, {"tag": "p", "text": "Zayne heads back to the citadel to find Gryph, but is ambushed by rakghouls and taken to Pulsipher's laboratory, where the latter demands any knowledge of the talisman Carrick possesses. Zayne tries to persuade Pulsipher to get rid of the artifact and Pulsipher threatens to put Zayne into another Sith artifact in his possession - Dreypa's Oubliette – for any living being put inside it will remain there, enduring an eternal life that is worse than death for ages, until the galaxy collapses on itself. Suddenly the Talisman detaches itself from Pulsipher and heads towards Zayne. Losing control on the rakghouls, Pulsipher is immediately torn apart by them, but Celeste appears and slays them afterward. Zayne hopes that by controlling the Talisman he could stop rakghoul plague from spreading, but Celeste demands that he is not supposed to do that and struggles to stop talisman from attaching itself to Zayne. Gryph comes in and demands that both stay away from the talisman, and in that moment Celeste calls talisman to herself. The artifact immediately attaches itself to her and after a moment of shock and pain Celeste is able to see the spirit of Karness Muur. More rakghouls arrive, but at the moment they are no danger to Zayne and Gryph, because they are now controlled by Celeste."}, {"tag": "p", "text": "Now, under command by Celeste Morne the rakghouls dispose of remaining Mandalorians using their own vehicles and weapons. Celeste has got through a radical metamorphose – she now sees the destruction of the Mandalorian army as a right thing and even justifies the killing of a person by saying that the rakghouls have to eat sometimes. Meanwhile Gryph tells Zayne that Celeste is working for Lucien and the Covenant. Zayne is shocked and angered by that and asks how Celeste could work for them after so many wrongs they have done. This pushes Celeste even further to the Dark Side, so she decides to kill Carrick, but he finally manages to get her to sense by indicating that she is now commanding the Sith army she was devoted to stop. Celeste becomes herself again – she now feels Karness Muur struggling to use rakghouls to do unthinkable damage to the galaxy and, weeping, asks Zayne to kill her and run. Zayne however has a different idea – he decides to put Celeste into Dreypa's Oubliette, so the power of the talisman could not penetrate it. Before getting inside Celeste gives Zayne the key of the Sanctum of the Exalted on Odryn and asks him to get her there and to contact Krynda afterward. Zayne closes the Oubliette, promising that he'll see her again later."}, {"tag": "p", "text": "The again mindless rakghouls are chasing Zayne and Gryph, who escape from them to the top of the citadel, where they are picked up by timely arriving Moomo Williwaw. Zayne asks Alek to go back for Celeste, but there is no time – the Mandalorians have arrived. It becomes clear that Fett took Carrick's warning seriously – the fleet executes nuclear bombardment of Jebble, wiping out all life on its surface.Cassus Fett thanks Zayne and says that he is in his debt, but Zayne is crushed by the repetition of Serroco. While Alek is amazed by what a single talisman could do, Shel asks Zayne what he plans to do next. Zayne decides to honor Celeste by doing exactly what she told him to do – expose the crimes of the Jedi Covenant and clear his name in process. The crew takes Moomo Williwaw to Odryn, unknowing that the Oubliette with Celeste Morne and Muur Talisman inside it is perfectly intact."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}