{"url": "Star_Wars:_Knights_of_the_Old_Republic:_Vindication", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Knights of the Old Republic: Vindication"}, {"tag": "p", "text": "Vindication is the tenth story-arc in the Star Wars: Knights of the Old Republic series of comics."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "Xamar agrees to expose the Covenant to the Council, but only after he receives promises from Tokare and Lamar that Krynda Draay will receive full immunity for her role in the Circle's wrongdoings. The Council organizes a raid on the Draay Estate, which is guarded by Covenant-loyal Jedi, and the Order sends in Xamar, Carrick, and Hierogryph prior to the attack so that Xamar can ferry Krynda to safety. Carrick dresses up as a Sith and conceals his lightsaber in a replica of the Muur Talisman, and Xamar ferries his \"prisoners\" into the Draay Estate—but when Xamar demands to see Krynda, Haazen refuses to grant him an audience and decides to inspect Carrick himself. Carrick stages a distraction and allows Xamar to slip away and deactivate the Estate's defenses so that the Order can attack, but Haazen exposes Carrick's deception, and when the alarm goes off, Haazen begins \"Vindication\"—a pre-planned insurrection by Covenant Jedi against the Order. At Haazen's directive, Covenant Jedi disable the Jedi Temple's communications, steal the Temple's store of Sith artifacts and take them to the Draay Estate, and rally to the defense of the compound against the Council's forces."}, {"tag": "p", "text": "As Draay watches in horror, Haazen gloats about how Draay's seat on the Council had allowed the Covenant the access they needed, and Haazen reveals that he has been manipulating Draay the entire time. Haazen also seizes control of the Swiftsure's computer systems, taking control of the Vanjervalis Chain, and he directs the Republic fleet to fire on the bridge to the Draay Estate—killing Xamar and fulfilling the Khil Jedi Master's part of the Rogue Moon Prophecy. As fire rains down on the compound, Haazen casts aside his robes to reveal his ruined body and the numerous Sith artifacts that he has incorporated into his form, and he proclaims that the Prophecy of the Five has come to pass. Amid the destruction, Haazen recalls his past: how he, a servant of Barrison Draay, trained alongside Barrison and Krynda Hulis, and was heartbroken when Krynda fell in love with Barrison and married him. Haazen failed to become a Jedi Knight, and he was convinced by the Sith to betray Barrison during the Sith War, but in doing so Haazen was severely mutilated. The Sith rebuilt him, and he later helped Krynda Draay establish the Jedi Covenant, though he manipulated the organization from behind the scenes to pursue his own goals."}, {"tag": "p", "text": "Lucien Draay attempts to attack Haazen, but his attacks are rendered useless by Haazen's possession of the Gauntlet of Kressh the Younger, which prevents anyone and anything from touching its wearer unless they allow it. Haazen explains his interpretation of the Prophecy of the Five: Q'Anilia is the one of the light in the darkness, Hierogryph is the one from the darkness who stands in the light, Carrick is the one for the light, and while Haazen is the one who stands apart from all, Draay is the one for the darkness. With Carrick and Draay as his subordinates, Haazen intends to command parallel armies of Jedi and Sith. Q'Anilia rushes off to protect Krynda and Hierogryph follows her, but Lucien uses the red-bladed lightsaber given to him by Haazen to block Carrick from following, and an enraged Lucien begins to pursue Carrick through the compound. When he finally reaches Krynda's chambers, he finds Q'Anilia despondent over her teacher's apparent death, and the Miraluka has drank poisoned wine to commit suicide, just as she foresaw. In her final moments, Q'Anilia is astonished to learn that Hierogryph was in fact that one foretold by the Rogue Moon Prophecy: he killed Raana Tey and stole Feln's lightsaber, and he has worn the red space suit from the vision. Just as Q'Anilia dies, Hierogryph realizes that Krynda is not in fact dead—she is encased in an oubliette, just like the one Morne was placed in on Jebble."}, {"tag": "p", "text": "Lucien and Carrick's fight is interrupted when Hierogryph arrives with the dying Krynda, who he released from the oubliette; Krynda is horrified that her son killed the Padawans. She foresaw the Massacre almost immediately after Lucien reported the Rogue Moon Prophecy, but she suffered a stroke and Haazen locked her in the oubliette, where she was forced to relive her vision of the massacre over and over. Lucien tries to justify his actions by explaining that he was trying to protect her, but as she dies, Krynda acknowledges that her teachings were wrong and begs her son to face the future with humility. Enraged by his mother's death, Draay embraces the dark side and charges after Hierogryph, who he blames for Krynda's death. Carrick holds off Draay as Hierogryph flees, but as they battle, Carrick begs his former teacher to break free of Haazen's influence—and he is able to get through to the distraught Jedi Master, who finally decides to help Carrick. Meanwhile, Haazen kills the Covenant Jedi who bring him the Temple's Sith artifacts, and he witnesses Hierogryph enter the courtyard pursued by a furious Draay. Draay and Carrick battle once more over Hierogryph, but Carrick seemingly kills Draay after the Jedi Master is pinned under a falling statue of Barrison Draay."}, {"tag": "p", "text": "To Hierogryph's disbelief, Carrick bows before Haazen and promises his loyalty in return his halting the bombardment of Coruscant. However, Carrick suddenly grabs Haazen's arm and proclaims that he is having a vision of the future—and as Haazen pauses in interest, Carrick slices off Haazen's prosthetic arm that bears the Gauntlet of Kressh the Younger. Haazen blasts Carrick with Force lightning and throws him toward Hierogryph, but to Haazen's surprise, both Carrick and the Snivvian go flying into the sky away from the compound. Draay emerges from the rubble and reveals that the fight had been a ploy to get close to Haazen, and using Haazen's arm—which also has the controls for the Republic fleet—Draay causes the fleet to fire upon the Draay Estate and destroys the entire compound, killing the now unprotected Haazen. Carrick and Hierogryph, meanwhile, land safely in a vat of sludge far away from the Draay Estate. In the days that follow, the Republic and the Jedi Order cover up Vindication by describing it as a terror plot by the Mandalorians, and only the families of the slain Padawans are told the truth of what happened. The Order pays off the bounties on Carrick and Hierogryph, officially clearing their names, and Malak is sent back to the Revanchists with a warning that the Council will not tolerate further involvement in the war."}, {"tag": "p", "text": "Hierogryph decides to leave Coruscant with Slyssk after her gives Jarael Carrick's Padawan braid, as he assumes that Carrick is being Knighted, but Carrick surprises his friend by refusing the Order's offer: he intends to go into business with Hierogryph and Jarael a partnership that the Snivvian terms Cargryph Capital Management. Unbeknownst to the Republic and the Jedi, Draay survives the destruction of the Draay Estate thanks to the Gauntlet of Kressh, and he retreats to a moon that he had purchased some time ago as a private sanctum. Draay is greatly shaken by his brush with the dark side, and though the Gauntlet kept him alive, he was blinded in the compound's destruction. On the moon of Draay 2, Draay decides to merge the philosophies of his parents and forms a true Covenant of Jedi, a covenant that will dedicate itself to surviving the prophesied doom rather than trying to stop it."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}