{"url": "Star_Wars:_Legacy:_Prisoner_of_the_Floating_World", "categories": ["Category:Real-world articles", "Category:Comic stubs", "Category:Star Wars: Legacy Volume 2"], "nodes": [{"tag": "h1", "text": "Star Wars: Legacy: Prisoner of the Floating World"}, {"tag": "p", "text": "Star Wars: Legacy: Prisoner of the Floating World is the first story arc of the Star Wars: Legacy Volume 2 comic book series."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "h3", "text": "Exposition"}, {"tag": "p", "text": "Following the defeat of the One Sith in 138 ABY, a new Galactic Federation Triumvirate was created, consisted of the Jedi Council, the Fel Empire, and the Galactic Alliance. The new Galactic Empress Marasiah Fel had commissioned the construction of a galactic-wide communications array system in order to speed up communications throughout the galaxy. The Imperial Knight Yalta Val was assigned to lead an Imperial mission to the Carreras system to supervise the construction of the communications array there. En route, Val's starship crash-landed on an uncharted floating world in the Surd Nebula called Mala. There, Val's crew were killed by a Sith master and his apprentice. Val himself was taken captive by Darth Wredd, who first killed his own master and then stole Val's identity. However, an Imperial communications droid managed to survive the crash-landing and retrieve Val's lightsaber. This droid collided with an unidentified object and was left floating in the Carreras system."}, {"tag": "h3", "text": "Rising Action"}, {"tag": "p", "text": "A week later, the damaged Imperial communications droid and its special cargo were recovered by two junk dealers, the Human Ania Solo and the Mon Calamari Sauk, the latter a refugee from the poisoned world of Dac. The two junk dealers are migrants who run a junkyard on Carreras Minor's moon. Seeking an escape from their impoverished lifestyles, the two try unsuccessfully to sell the lightsaber but ran into trouble with the local Shifala authorities. When a Shifala officer demanded that they hand over their \"laser sword\" and labeled them \"immigrant scum\", Ania Solo killed him. Meanwhile, the \"false\" Yalta Val is recovered by the Shifala authorities. Alleging that there is a Sith presence in the Carreras system, Val bullied the Governor Biala into giving him personal control of all the Carreras security forces. Wredd also seeks to recover his \"stolen\" lightsaber. On Mala, the real Yalta Val is imprisoned behind Wredd's mask."}, {"tag": "p", "text": "In the Ottega system, Val's Imperial Knight colleague Jao Assam, who is supervising the construction of the Ithorian communications link, decides to check on Val's whereabouts after receiving no word from him. Back on Carreras Major, Ania and Sauk managed to escape a pursuit by Carreras security forces and return to their junkyard, where they are joined by their friend AG-37, a compassionate assassin droid. Before Ania can get rid of the lightsaber, the junkyard is visited by the \"false\" Yalta Val and his Carreras security forces. Before that, Darth Wredd had contacted his prisoner Yalta Val and offered him with the choice of embracing the dark side of the Force. After learning of the encounter between his security forces and Ania's companions, Wredd decided to confront them."}, {"tag": "p", "text": "The \"false\" Yalta Val demanded that Ania return his lightsaber and offered to grant her amnesty for killing the pursuing security officers. However, Ania refused to back down and hand over the lightsaber on the grounds that it was hers by right of salvage. Angered by her defiance, Darth Wredd attacks them with his Force powers and orders his security forces to eliminate them. With the help of AG-37, Ania and Sauk managed to escape on his freighter. Darth Wredd then takes advantage of the incident to mobilize Governor Biala's security forces, further straining relations between the two. After repairing the damaged Imperial communications droid, Ania and her companions discovered a holographic recording of an Imperial Knight fighting a Sith. They quickly realized that the real Yalta Val had been replaced by an impostor."}, {"tag": "h3", "text": "Forging an Alliance"}, {"tag": "p", "text": "Meanwhile, Jao Assam shares his concerns about Yalta Val's disappearance with his superiors Empress Fel and the Imperial Knight Antares Draco. However, they brushed aside his concerns and ordered him to continue his job of overseeing work on the Ithorian link in the array. Undeterred by his superiors' unwillingness to help, Jao decided to travel to the Carreras system and find Val himself. Upon exiting hyperspace, Assam encounters a Shifala naval blockade and narrowly escaped arrest. Darth Wredd, still maintaining his Yalta Val persona, had learnt of his presence and ordered his arrest. Meanwhile, Ania and her companions managed to outrun several pursuing Carreras starfighters by flying into the rings around Carreras Minor. They land on that planet and their freighter is attacked by a giant tentacled creature. Jao Assam assists them and helps them escape the creature's clutches."}, {"tag": "p", "text": "Following a tense first encounter, Jao Assam gains the trust of Ania, AG-37, and Sauk after recognizing that Yalta Val has been replaced by an impostor. The four companions make an agreement to rescue Yalta Val and to thwart the impostor's scheme. Meanwhile, at the Carreras communication array, Darth Wredd further alienates his host by almost strangling a Shifala worker following a delay with activating the communication systems. Tracing the coordinates stored inside the Imperial communications droid, Jao, Ania, and her companions travel into the Surd Nebula. Upon arriving at the Imperial communication droid's coordinates, they cannot find the planet Mala. Shortly later, their ship is intercepted by a Carreras warship and they are taken captive by the Carreras security forces and brought to the Carreras communications array. Having captured the Imperial Knight and his companions, the false Yalta Val orders that the former be brought before him and that the latter be killed. When Governor Biala objects to his orders, he almost Force-chokes her but chooses to spare her life."}, {"tag": "p", "text": "With Jao Assam in custody, Darth Wredd reveals his true identity to the captive Imperial Knight and discusses his plan to restore the Rule of Two. Unknown to Wredd, Biala is watching and deduces that Yalta Val has been replaced by an impostor. Meanwhile, Ania and Sauk, who are in prison cells, theorize that Mala is a floating world since the Imperial communication droid's coordinates were wrong. Their suspicions are proven correct as the Carreras communications array is entering into Mala's orbit. Governor Biala frees Jao along with Ania and her associates and assigns them with the task of eliminating the false Yalta Val. Jao, Ania, and her companions confront the Sith in the space station's hangar bay and shoot down his shuttle. However, the Sith fights back and slices AG-37 in half. While Jao succeeds in wounding Wredd, the latter uses the Force to impale him with metal poles before making a get-away in a second shuttle."}, {"tag": "h3", "text": "A Fiery Climax"}, {"tag": "p", "text": "With Jao Assam presumed dead and her companions Sauk and AG-37 incapacitated, Ania decides to put a stop to Darth Wredd. Meanwhile, Biala orders her men to shut down the Carreras communications array only to discover that Darth Wredd is controlling the station remotely. On Mala, Darth Wredd and his henchman Dieben remove the real Yalta Val's mask and begin transmitting a holographic broadcast using the Carreras communications array. Their broadcast is seen by countless sentients across the galaxy including Governor Biala, Empress Fel, and Antares Draco. In his broadcast, Darth Wredd mocks the \"impotence\" of the Galactic Federation Triumvirate and attempts to execute the captive Val before a galactic-wide audience. Before he can do so, Wredd is interrupted by Ania who attacks the Sith. This distraction enables the real Yalta Val to free himself and retrieve his lightsaber."}, {"tag": "p", "text": "As Wredd and Yalta Val duel with their lightsabers, Biala orders an evacuation of the Carreras communications array since the station is on a collision course with Mala. Meanwhile Ania returns to the communications array and evacuates her companions Sauk and AG-37 in AG-37's ship. Back on Mala, Yalta Val gains the advantage over his Sith opponent but Wredd manages to escape in a get-away vessel. Before the communication array collides with Mala, Ania succeeds in rescuing Yalta Val. Against all odds, a seriously wounded Jao Assam is rescued in zero-gravity space by the Imperial communications droid. After rescuing Jao, AG-37's ship makes a jump into hyperspace. Once safely aboard, Jao's wounds are tended by a specialized medical droid. During a conversation with Val, AG-37 reasoned that the Imperial communications droid had rescued Jao out of gratitude for the younger Imperial Knight traveling to the Carreras system to \"rescue\" it. While Ania blames herself for getting Jao hurt, Sauk comforts her by assuring Ania that she had saved them all."}, {"tag": "p", "text": "On Coruscant, Empress Fel receives a report from Governor Biala detailing the recent destruction of the Carreras communications array. While the Governor is unclear about the specifics of that event, she informs her superiors that a girl named Ania Solo was involved in its destruction."}, {"tag": "h2", "text": "Issues"}]}