{"url": "Star_Wars:_Masters_of_Ter%C3%A4s_K%C3%A4si", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:1997 computer and video games", "Category:Legends console video games", "Category:LucasArts games"], "nodes": [{"tag": "h1", "text": "Star Wars: Masters of Teräs Käsi"}, {"tag": "p", "text": "Star Wars: Masters of Teräs Käsi is a fighting game released for PlayStation in October 1997."}, {"tag": "h2", "text": "LucasArts' short description"}, {"tag": "p", "text": "The 3D fighting genre fulfills its ultimate destiny with Star Wars Masters of Teräs Käsi, an intense one-on-one combat experience for the Sony PlayStation. The story revolves around the mysterious Arden Lyn, a master of the ancient art of Teräs Käsi, as she leads a group of the most feared champions of the Galactic Empire to eliminate the leaders of the Rebel Alliance. Join Luke Skywalker, Han Solo, Boba Fett, Princess Leia, Chewbacca, plus a few surprise characters in a Star Wars environment like you've never experienced."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Characters"}, {"tag": "h3", "text": "Secret characters"}, {"tag": "h2", "text": "Stages"}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "During the time of its conception, the game was a joint project of Lucasarts with fighting game giant developer Capcom. The project was eventually dropped; Capcom's work with them would result in them creating their first 3D game inspired by the series, Star Gladiator."}, {"tag": "h2", "text": "Critical reception"}, {"tag": "p", "text": "The game, while a welcome concept at the time of its release, was not well received. Some complaints include an inferior fighting engine, an improper usage of lightsabers and unbalanced characters. Despite this however, the game introduced new concepts to the Expanded Universe such as Teräs Käsi and Arden Lyn herself."}, {"tag": "p", "text": "Screwattack rated the game the 10th worst fighting game in their top ten worst fighting games."}, {"tag": "p", "text": "Eventually the concept would have been revisited in a now-cancelled untitled fighting game but finally was with the inclusion of Darth Vader, Yoda and Galen Marek in Soulcalibur IV."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}