{"url": "Star_Wars:_Lost_Tribe_of_the_Sith:_The_Collected_Stories", "categories": ["Category:Real-world articles", "Category:Lost Tribe of the Sith series"], "nodes": [{"tag": "h1", "text": "Star Wars: Lost Tribe of the Sith: The Collected Stories"}, {"tag": "p", "text": "Star Wars: Lost Tribe of the Sith: The Collected Stories is a compendium of all of the eBooks of the Lost Tribe of the Sith series by John Jackson Miller. It was published by Del Rey in paperback and eBook formats on July 24, 2012. The book includes maps of Kesh and also contains an excerpt of the novel X-Wing: Mercy Kill by Aaron Allston."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "At last in one volume the eight original installments of the epic Lost Tribe of the Sith eBook series . . . along with the explosive, never-before-published finale, Pandemonium—more than one hundred pages of new material!"}, {"tag": "p", "text": "Five thousand years ago. After a Jedi ambush, the Sith mining ship Omen lies wrecked on a remote, unknown planet. Its commander, Yaru Korsin, battles the bloodshed of a mutinous faction led by his own brother. Marooned and facing death, the Sith crew have no choice but to venture into their desolate surroundings. They face any number of brutal challenges—vicious predators, lethal plagues, tribal people who worship vengeful gods—and like true Sith warriors, counter them with the dark side of the Force."}, {"tag": "p", "text": "The struggles are just beginning for the proud, uncompromising Sith, driven as they are to rule at all costs. They will vanquish the primitive natives, and they will find their way back to their true destiny as rulers of the galaxy. But as their legacy grows over thousands of years, the Sith ultimately find themselves tested by the most dangerous threat of all: the enemy within."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Around 5000 BBY, during the Great Hyperspace War, a Sith mining vessel named Omen crashes into the planet Kesh, a world yet undiscovered by the Galactic Republic or the Sith Empire. The ship's captain, a slave Human named Yaru Korsin, attempts to keep his scared crew in line. Kesh was a relatively primitive world with a superstitious population, the Keshiri, contained within the continent Keshtah. The Keshiri worshipped the Skyborn, the gods from above, who the natives believe to have incarnated as the Sith newcomers."}, {"tag": "p", "text": "During the next fifteen years, the latecomers rule unchallenged over the Keshiri people, with Yaru Korsin becoming the Grand Lord of the Skyborn. Years later, an underground movement of Keshiri rebels conspires to rid their world of the Sith intruders. The wicked machinations of Seelah, Yaru Korsin's late brother's wife, wipe out the pureblood Sith from among the Omen survivors, leaving the Humans alone to survive. Seelah's son, Jariad, mortally wounds the Grand Lord in a coup. Although Yaru dies, he is survived by his daughter, Nida, who punishes Seelah, her own aunt-in-law, for her treachery."}, {"tag": "p", "text": "More than a thousand years later, the Omen's crash site becomes sacred ground to the Keshiri, concealed by a Temple in the mountains. The Sith dynasty continues, no longer propagated by bloodline, but rather as a meritocracy shaped by bold examples of power and skillful political maneuvering. A botched assassination attempt targets the reigning Grand Lord, a doddering crone named Lillia Venn. Culpability is laid on High Lord Candra Kitai. She and her daughter, Orielle Kitai, are then stripped of status and enslaved. Afterwards, Ori flees to the countryside, finding some peace with a lowly gardener named Jelph. Jelph, in truth, is a secret Jedi agent who has recently and accidentally arrived on the Keshiri's world. Ori eventually discovers this, finding his Republic starfighter hidden in his shed. Venn and a retinue of Sith Lords arrive at Jelph's, also discovering the spacecraft. When Venn boards the starfighter, she unwittingly trips an antitheft device rigged by Jelph that destroys the ship and Venn in an explosion, leaving Jelph and Ori together as exiles, in the wilderness, where they begin a new life together."}, {"tag": "p", "text": "After another thousand years of stagnation, the Sith dynasty has now splintered into squabbling factions that only unite to honor the traditions of Yaru Korsin, the first Grand Lord of Kesh. Varner Hilts, a caretaker of Sith customs, plays a traditional holographic recording made by Korsin at the end of his reign and intended for his daughter, Nida. Before the assembled Sith factions, Hilts allows the recording to play past its conclusion, revealing fragments of an earlier transmission never meant for public display–an image of the Dark Lord Naga Sadow identifying the crew of the Omen as mere slaves. This sends the Sith factions into disarray as their view of their ancestors as godly conquerors had now been turned upside down. As the disillusioned Sith factions begin to self-destruct, Hilts realizes there is more to Korsin's recording. He left a hidden a message to Nida, with the cryptic words that \"the true power lies behind the throne\". Hilts finds Korsin's old command chair that he used as a throne in a secret chamber within the Omen Temple. Inside it, he finds a hidden map of the entire world of Kesh, revealing an unexplored continent on the far side of the planet, a landmass recorded by the Omen's sensors during the crash but left unrevealed to Korsin's crew.\nRealizing the key to unifying the disintegrating Sith factions, Hilts gives them a target of conquest and after twenty-five years of planning and advancements, the Sith have constructed a fleet of airships to travel across the ocean and invade the new continent."}, {"tag": "p", "text": "A gifted engineer, Edell Vrai, leads a scouting fleet to the recently-named Alanciar. The Keshiri of Alanciar are prepared, though, for they have remained vigilant since being warned centuries earlier by Adari Vaal, a Keshiri who first greeted the Sith and fled their rule during the reign of Yaru Korsin. Enormous ballistae shoot down the Sith airships, and Edell crashes onto the coast. He takes a pair of opponent Keshiri watchers, Quarra Thayn and Jogan Halder, prisoner. While Edell has his Sith lieutenants take Halder back to the Keshtar homeland, forcing Quarra to bring him into the Alanciar civilization. Edell admires the advanced architecture and engineering exhibited by these Keshiri, advancements made necessary by their long-held fear of Sith invasion from afar. Edell is shocked to see a Sith invasion force,\nimpulsively launched from Keshtar before his scouting expedition could return, attempting conquest of Alanciar. Its leader, the Sith Lord Bentado, seeks to betray his tribe and destroy any remaining airships so he can rule the new land unchallenged. Quarra and Edell work together and succeed in defeating Lord Bentado."}, {"tag": "p", "text": "Hilts, now Grand Lord of the Lost Tribe of Sith, arrives as a benevolent contrast to Bentado's force, bringing with him Jogan, who sings the praises of the distant Sith, alleviating the concerns of the Alanciar. Hilts, a far more pragmatic and even-minded ruler than the Grand Lords past, sees the unification of Kesh as the key to the continued survival of the Lost Tribe, even welcoming Keshiri blood into their ranks to ensure their future. A new era begins in Kesh."}, {"tag": "h2", "text": "Collected works"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}