{"url": "Star_Wars:_Legacy:_Indomitable", "categories": ["Category:Real-world articles", "Category:Star Wars: Legacy story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Legacy: Indomitable"}, {"tag": "p", "text": "Star Wars: Legacy: Indomitable is the fifth story arc in the Star Wars: Legacy comics."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "h3", "text": "Part One"}, {"tag": "p", "text": "On board the Pellaeon-class Star Destroyer Relentless of the Outer Rim Third Fleet, Darth Azard is informing Admiral Sha Dun that Darth Krayt is not pleased with his lack of progress to destroy Gar Stazi and the Galactic Alliance Remnant. Sha Dun says that they have captured or destroyed several of Stazi's ships, but Azard uses Force Grip on him and uses his lightsaber to execute him for his failure. Azard then places Admiral Dru Valan in charge of the fleet. Valan says he will not allow Stazi to escape him like he did at the Battle of Caamas. As Azard leaves, Valan tells Captain Hoge to replace all 'alien' personnel in his fleet replaced with human personnel, saying he wants a 'superior' crew to deal with Stazi. He then informs Hoge of his intentions to trap Stazi with bait that he can't afford to pass up."}, {"tag": "p", "text": "Meanwhile, at the planet Dac, an Advanced Star Destroyer called the Imperious has nearly been completed. Former Triumvirate member Gial Gahan and his niece Monia Gahan are gathering intelligence about the new Star Destroyer. Monia, who serves under Admiral Stazi as a member of Rogue Squadron, mentions that the Mon Calamari have secretly supported Stazi for the last seven years by supplying him with supplies and recruits. But Gial says they can't help Stazi steal the new Star Destroyer because the Sith will seek retribution. But Gial has all the codes needed to help Stazi, therefore the retribution for the theft will fall on him. After this, they return to one of the shipyards hangars and Monia has her fellow Rogue pilot Anj Dahl take her back to the Alliance Remnant fleet. Once there, they report their findings to Admiral Stazi and his second in command, Captain Jaius Yorub."}, {"tag": "p", "text": "Once they are alone, Stazi and Yorub say this situation sounds exactly like the trap at Caamas. They remember that Rear Admiral Piers Petan had gathered evidence saying that Emperor Roan Fel would be at Caamas under light escort, and recommended sending all available Alliance ships to Caamas to capture or kill him. Stazi, Kol Skywalker and Gial Gahan disagreed with the plan because they (correctly) suspected the Empire had fed them the information. But Petan argued that decisive action was necessary to win the war, persuading Nu Toreena and Bail Antilles to approve of the plan."}, {"tag": "p", "text": "Back in the present, Stazi and Yorub conclude that the Imperious is the bait for a trap set by Dru Valan. Yorub suggests ignoring the Star Destroyer, but Stazi says they can't pass the opportunity to steal the Imperious up, on the grounds that they need to make military strikes. Stazi also comments that if they know its a trap, then they might be able to make it work in their favor."}, {"tag": "p", "text": "Two days later, Gial Gahan disables the Shipyard's automated guns from the command center on the planet's surface while Alliance troops take over the Imperious. The Alliance task force, under Stazi's command, then enters the system. But on the planet's surface, Gial is captured and the automated guns are turned back on line while stormtroopers retake the Imperious. At that moment, Admiral Valan's fleet enters the system. Valan sends a message telling Stazi that he is trapped and that there are only two choices for him to make: surrender or die. Stazi's reply is simply \"Caamas.\""}, {"tag": "h3", "text": "Part Two"}, {"tag": "p", "text": "Gar Stazi remembers what happened at Caamas: during the battle, Jaius Yorub informed him that the Jedi couldn't come to their aid because of a Sith feint on Coruscant. At that moment, Piers Petan told all Alliance personnel at Caamas that he had agreed to Admiral Morlish Veed's terms of surrender. Stazi refuses, and orders all Alliance personnel willing to continue to fight to follow him. Stazi, along with a handful of Alliance ships, escape using a spacer hyperspace route that the Empire had failed to mine."}, {"tag": "p", "text": "Back in the present, Admiral Dru Valan asks Stazi if he intends to surrender or die. Stazi says he will fight. He orders his fleet to fire on the Outer Rim Third Fleet. The Imperials are taken by surprise by this sudden barrage, and Valan orders a return fire as well as fire from the Mon Calamari Shipyards. But the shipyards fire on the Imperial fleet instead of Stazi's, having been hacked by Monia Gahan."}, {"tag": "p", "text": "Meanwhile, on board the Imperious, the stormtroopers that re-seized the ship are revealed to be Galactic Alliance troops under the command of Hondo Karr. They successfully steal the ship and get it out of the system. When Captain Hoge tells Valan this, he orders his fleet to ignore everything else and destroy Stazi at all costs."}, {"tag": "p", "text": "Stazi's fleet falls back behind the shipyards while Rogue Squadron provides cover from Imperial fighters. Stazi orders the rest of his fleet to evacuate the system. As the rest of the fleet escapes, a shot from the Imperial fleet does terrible damage to the Indomitable. Valan once again asks Stazi to surrender, but Stazi says he is going to pilot his ship into the shipyards to destroy them. But as he orders the evacuation of his ship, Rogue Leader Jhoram Bey arrives on the bridge to take the admiral to safety. Stazi refuses, saying he is just one of many who serve. But Captain Yorub says that Stazi is a symbol of the Alliance. Stazi still refuses to leave, so Yorub tells Jhoram Bey to \"do his duty.\" Bey knocks Stazi out and takes him from the ship."}, {"tag": "p", "text": "Once Stazi is safe, Yorub opens a channel for all to hear, saying that the Alliance still lives and that one day, they will triumph over the Sith. He pilots the Indomitable into the shipyards, destroying a third of them. On board his ship, a shocked Admiral Valan tells Captain Hoge to report whatever he wishes to Darth Azard. He retires to his quarters with a laser pistol, and we are left to believe he is considering suicide."}, {"tag": "p", "text": "Meanwhile, at the Alliance fleet, attempts to bring the weapons systems on board the Imperious online have begun. Stazi promotes Jhoram Bey to his second in command to \"punish\" him for knocking him out, and tells him to ready the fleet for further action. He knows the theft of the Imperious will bring about a Sith reprisal, and they need to find out where that will be."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}]}