{"url": "Star_Wars:_Lost_Tribe_of_the_Sith%E2%80%94Spiral", "categories": ["Category:Real-world articles", "Category:Star Wars: Lost Tribe of the Sith"], "nodes": [{"tag": "h1", "text": "Star Wars: Lost Tribe of the Sith—Spiral"}, {"tag": "p", "text": "Star Wars: Lost Tribe of the Sith—Spiral is a five-part Star Wars Legends comic-book series written by John Jackson Miller and published by Dark Horse Comics. It ties in with Miller's Star Wars: Lost Tribe of the Sith eBook series."}, {"tag": "p", "text": "The story occurs around 2974 BBY, approximately one year after the events of the ebook Lost Tribe of the Sith: Pandemonium. Spiral is set on the remote planet Kesh, which was home to a stranded group of Human Sith known as the Lost Tribe of Sith. The story arc focuses on the adventures and experiences of the young Tribal outcast Parlan Spinner and his former enemy–turned–companion Takara Hilts, a Sith princess and the daughter of Grand Lord Varner Hilts. A large element on the plot deals with the threat posed to the Lost Tribe by the ancient Dark Jedi Baron Remulus Dreypa, who had been freed from his oubliette by Parlan."}, {"tag": "p", "text": "Spiral was first released on August 8, 2012 and ran until December 12, 2012. It consists of five issues and its script was developed by Miller, who had also co-authored the Lost Tribe of the Sith short story series. Randy Stradley has also announced on the Dark Horse message boards that the series would end after the fifth comic issue."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Spiral occurred a few months following the events of John Jackson Miller's novella Pandemonium which ended with the Lost Tribe of Sith's annexation of Alanciar, another continent on the planet Kesh. During the festivities commemorating the arrival of the Lost Tribe's ancestors nearly three thousand years ago, the Human Sith outcast Parlan Spinner and his gang known as Spinner's Web disrupted the parade. Spinner also tried to assassinate Grand Lord Varner Hilts but was thwarted by his daughter Sith princess Takara Hilts who apprehended him. While Spinner faced the death penalty, Grand Lord Hilts decided to spare the life of the youth and gave him a second chance, sensing the youth's Force talents. Spinner was put to work as a sailor aboard the Keshiri captain Chegg's mariner Southern Star."}, {"tag": "p", "text": "Takara also stowed aboard the Southern Star, intending to hitch a ride to Alanciar where she had hope to start afresh in new frontiers. However, the ship was actually heading to Eshkrene, the planet's South Pole, for an exploratory and surveying mission. Spinner and Takara are put to work by Chegg manning sails. After the ship lands on Eshkrene, the pair attempt to desert Chegg's crew but are pursued by Chegg and his crew, who are intent on killing them. They were however saved by a group of cloaked strangers known as the Doomed, who promptly killed Chegg and the other pursuers with arrows. Spinner and Takara, along with the surviving crew, were taken captive and brough to the Doomed's settlement."}, {"tag": "p", "text": "The S'kytri Kaliska, leader of the Doomed, related the history of the Doomed to their Sith captives Spinner and Takara. The Doomed were the descendants of ancient Jedi and Dark Jedi who became stranded on Kesh following the Hundred-Year Darkness. After fighting, the two Force orders made peace with the Dark Jedi agreeing to seal away their \"greatest weapon\" within an oubliette. The Force-users then migrated to Kesh's South Pole where they maintained a protective vigil over the Keshiri and sought to find a balance in the Force. Takara develops a friendship with Kaliska, who taught the Sith princess about the Force ability animal friendship."}, {"tag": "p", "text": "Meanwhile, Spinner was imprisoned for expressing his interest in the \"Great Weapon.\" However, he and the Keshiri crew stole the oubliette and escaped Eshkrene aboard the Southern Star. Kaliska and Takara pursue Spinner and his followers. However, Spinner breaks open the casket and releases the Sith Lord Remulus Dreypa, one of the survivors of the Battle of Corbos who was subsequently exiled to the Stygian Caldera. Spinner and his crew quickly aligned themselves with Dreypa while Takara and Kaliska are imprisoned below deck. The Southern Star sailed back to the main continent of Keshtah Minor and lands at the port of Eorm, Spinner's hometown. Dreypa used his dark side powers to kill the tyrannical Lord Galathos and the local Sith garrison."}, {"tag": "p", "text": "Dreypa's display of Dark Side powers awes the local inhabitants who rally around the Sith Lord. Despite his goals of reaching the stars again, Dreypa reluctantly agreed to lead a rebellion against the Lost Tribe with Spinner acting as his lieutenant. Meanwhile, Takara and Kaliska managed to escape from their captors and return to Eshkrene, bringing the entire town's herd of uvaks, winged reptilian beasts, with them. Dreypa's rebel army marched into the Marisota Floodplain and fought with the Lost Tribe's forces, under the command of Lord Hilt's wife Grand Consort Iliana Hilts. The Lost Tribe's forces inflict heavy losses on Dreypa's forces, who retreated to Sessal Spire, a volcanic caldera overlooking the Southern Ocean."}, {"tag": "p", "text": "Iliana's Sith forces caught up with Dreypa and Spinner, and attempted to execute them. However, Dreypa uses his talisman to summon up Leviathans from beneath the crater. Leviathans were massive Sithspawn created during the Hundred-Year Darkness that were capable of draining the life energies of sentient beings. Dreypa's Leviathans devour friend and foe alike. At that point, Kaliska and the Doomed attack Dreypa and his Leviathans, who fight back against the newcomers. Spinner also fought with Takara. However, their duel was interrupted when Takara's mother Iliana was attacked by one of the Leviathans. Spinner killed the beast and saved Iliana's life, thus gaining his former enemy's trust."}, {"tag": "p", "text": "Spinner and Takara escape the fighting with the debilitated Iliana, riding on an uvak. They are rejoined by Kaliska who revealed that the Jedi ancestors of the Doomed had hidden a starship beneath the Sith capital Tahv. Aware of Dreypa's ambitions of reaching the stars, Kaliska convinced Spinner and Takara to destroy the ship. However, Dreypa and his Leviathans caught up with them, having devoured all of their opponents including the Doomed forces. Spinner and Iliana managed to escape but Kaliska was captured and killed by one of Dreypa's Leviathans. In an attempt to delay Dreypa, Takara took the Dark Jedi on a duel but was unable to match his Force powers, and was taken captive."}, {"tag": "p", "text": "Meanwhile, Spinner and Iliana arrived back at Tahv. A debilitated Iliana was reunited with her elderly husband Varner. However, Spinner reneged on his promise to destroy the Last Hope and instead took it on a joyride above Kesh's atmosphere. Before Spinner could explore the wider galaxy, he was contacted by Dreypa who issued the young man with an ultimatum. Aware of Spinner's new-found love for Takara, he threatened to kill Takara unless Spinner handed the Last Hope over to him. Dreypa and his leviathans then laid waste to Tahv while Iliana's forces prepared to make a final stand. Spinner used the Last Hope's turbolaser cannons to kill most of the Leviathans."}, {"tag": "p", "text": "Meanwhile, Takara managed to break free of the last remaining Leviathan and kill the creature with Force lightning. In the ensuing chaos, she and Dreypa ended on up the hull of the Last Hope. Spinner flew the starship to the shores of the Southern Ocean where he \"handed\" the vessel to Dreypa, before jumping into the sea with Takara. Dreypa claimed ownership of the vessel only to discover that Spinner had set its engines for a one-way journey into Sessal Spire. Dreypa was killed in the ensuing explosion, which deprived Kesh of its last known remaining hyperspace-capable vessel and prevented any information about Kesh and the Lost Tribe from leaking into the galaxy until centuries later."}, {"tag": "p", "text": "Following the defeat of Dreypa, the Sith begin rebuilding Tahv and the former outcast Spinner became a hero of the Tribe. Grand Lord Varner Hilts appointed the young man as one of his Hands and Spinner also developed a romantic relationship with his former enemy Takara."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}