{"url": "Basiliskan", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Core Worlds species", "Category:Dragons", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Basiliskan"}, {"tag": "p", "text": "Basiliskans were an intelligent lizard species native to the planet Basilisk in the Core Worlds region of the galaxy. They were the creators of the Basilisk war droids, that were rumored to be modeled after themselves. During their war with the Mandalorians, the Basiliskans chemically poisoned their own planet, in a last ditch effort to defeat their conquerors."}, {"tag": "p", "text": "After the war the Mandalorians found a new use for the Basiliskans. With their tough hides, large claws and intelligence, the Mandalorians used them as mounts for aerial and ground fighting during later wars including the New Sith Wars. Because of this, the Basiliskans degenerated, losing their intelligence and becoming mere beasts. As such, since the Battle of Basilisk in 4017 BBY, they were re-named the Lagartoz War Dragons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Basiliskans were mentioned in the article Supernatural Encounters: The Trial and Transformation of Arhul Hextrophon, however the article was never officially published. The related information that was to be published in the article is outlined below."}, {"tag": "p", "text": "In the primordial galaxy, the Basiliskans first emerged as offspring of the Firstborn Duinuogwuin species, benevolent dragons of immense power. The being Cold Danda Sine manipulated the Basiliskans by promoting the fear that Humans were taking over the galaxy and needed to be stopped, encouraging them to adopt a militaristic creed and defend the galaxy. When the power of the Duinuogwuin began to alarm the being Tilotny, she recruited Cold Danda Sine to assist her in a plot to ruin the Duinuogwuins. Using the Basiliskans allied to him, Cold Danda Sine manipulated their form in the realm of Illathurion so that their Duinuogwuin progenitors would no longer recognize them. These new, enormous Basiliskans arrived in the realms of the Duinuogwuins, and were seen as a beautiful new form in the galaxy. In a move to intertwine this new beauty with their own, a large group of Duinuogwuin began mating with these Basiliskans. The result was not what they intended. Monstrous, violent creatures spilled forth, including the Krayt, Kell, Chiaki Dragonsnake, Mythosaur, Mantigrue, Condor, Spine, Menagerie, Thorn-Backs, and Howlers. While most of there creatures were hyper-aggressive, some were adaptable to the Duinuogwuin culture of benevolence. These dragon species included the Kadri'Ra, the Sea-dragons, the Panna and the Arkanian dragons. As the offspring of the Basiliskans and the Duinuogwuin spread out across the galaxy and the Empryean Wars consumed all of civilization, the Basiliskans allied themselves with the Architects and the unnatural horde drawn out from Illathurion. The Duinuogwuin viciously and violent attacked the Basiliskans during the War of the Temporal Planes, with the Basiliskans losing to the older race."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}