{"url": "Star_Wars:_Knights_of_the_Old_Republic_(comics)", "categories": ["Category:Real-world articles", "Category:Wookieepedia former Featured articles", "Category:Star Wars: Knights of the Old Republic (comics)"], "nodes": [{"tag": "h1", "text": "Star Wars: Knights of the Old Republic (comics)"}, {"tag": "p", "text": "Star Wars: Knights of the Old Republic, also known as simply Knights of the Old Republic or KotOR, is a monthly comic book series published by Dark Horse Comics that ran for five years, beginning January 25, 2006 and ending with its fiftieth issue on February 17, 2010. Written by John Jackson Miller, Knights of the Old Republic saw a variety of different artists and cover artists draw various issues of the series, and KotOR serves as a sequel to the earlier Star Wars: Tales of the Jedi comic series and a prequel to the popular Star Wars: Knights of the Old Republic video game. Set in 3964 BBY and later 3963 BBY, Knights of the Old Republic focuses on Zayne Carrick, a Padawan of the Jedi Order who is framed for the Padawan Massacre—the murder of Zayne's fellow Padawans—by the true perpetrators, Zayne's teachers, who are members of a mysterious Jedi Covenant. Banding together with the con man Marn Hierogryph, the fiery Jarael, and the eccentric Camper, Carrick goes on the run and works to clear his name by exposing the existence of the Covenant. When he finally manages to clear his name, Carrick takes up work with Hierogryph and Jarael, but the trio and their friends soon tangle with the slaving organization known as the Crucible."}, {"tag": "p", "text": "As the flagship series of Dark Horse Comics' 2005 relaunch of their Star Wars line in celebration of their 20th anniversary, Knights of the Old Republic soon became one of Dark Horse's best-selling titles. In 2008, Knights of the Old Republic hosted the first four issues of the Vector crossover, an event that crossed into all four of Dark Horse's ongoing Star Wars series at the time. Knights of the Old Republic featured numerous references to both Tales of the Jedi and the Knights of the Old Republic games, and the series expanded greatly on the Mandalorian Wars introduced in the video games. The series was preceded by a zero issue, and also received a Handbook issue as well. At the Baltimore Comic-Con in 2009, Dark Horse announced that the series would end with its fiftieth issue, Demon, Part 4, in February 2010. In 2012, the series received a sequel miniseries also penned by Miller that was set one year after the original series, Star Wars: Knights of the Old Republic: War, and elements of Knights of the Old Republic have made their way into later Star Wars products such as the video game Star Wars: The Old Republic."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Commencement"}, {"tag": "p", "text": "In the year 3964 BBY, on the city-planet Taris, the Jedi Padawan Zayne Carrick tries to capture the Snivvian criminal Marn Hierogryph for the eighth time, but Carrick's clumsiness allows Hierogryph to escape and sends the Padawan flying off a building. Carrick is rescued by \"Squint\", a Jedi Knight who had been sent by Carrick's Jedi Master Lucien Draay to look for him, and Carrick learns that Squint is one of several Jedi visiting Taris's Jedi Tower in hopes of recruiting allies for their fight in the Mandalorian Wars between the Galactic Republic and the Mandalorian warrior culture. Squint takes Carrick back to the Jedi Tower, and he tells the Padawan how sometimes one has to enter the darkness to save the light—and as Squint's group departs, Master Q'Anilia senses a disturbance in the Force that Lucien Draay and the other Masters at the Jedi Tower decide to investigate. A few days later, Carrick attempts to capture Hierogryph again, only to crash-land in a banquet celebrating the forthcoming Knighting ceremony that the Jedi Masters will perform. While the Jedi Masters—Lucien Draay, Feln, Q'Anilia, Raana Tey, and Xamar—retreat to their chambers, Carrick is tasked with cleaning up the mess he made, but he spots Hierogryph and pursues him, finally managing to capture the con man. When he returns to the Jedi Tower, Carrick realizes he is late for the ceremony and rushes in—only to find his fellow Padawans Oojoh, Shad Jelavan, Kamlin, and Gharn dead at their Masters' feet."}, {"tag": "p", "text": "Horrified, Carrick flees the Jedi Tower with Hierogryph and manages to escape to the Lower City of Taris, where the two realize that the Masters have placed bounties on their heads, as the \"Padawan Massacre\" has been blamed on Carrick. With Hierogryph's reluctant help, Carrick evades the Masters, tricking them into searching Taris's Undercity while the duo approach a refugee camp in the region known as Machineville. There, Hierogryph seeks out the aging Arkanian Offshoot engineer Camper and his fierce protector Jarael in hopes of acquiring a route offworld, but when the Jedi and Taris's police arrive, the group is forced to launch into space aboard the junk hauler The Last Resort—which promptly loses power once in orbit."}, {"tag": "p", "text": "When power is restored, The Last Resort hides among the asteroid belt in the Taris system, and Carrick attempts to contact Master Vandar Tokare and the Jedi Council at the Jedi Enclave on the planet Dantooine and seek help, only to learn that Tokare does not believe his story. Realizing how unusual it is for four Jedi Consulars to be assigned to a single planet like Taris, Carrick recalls the recent training mission they undertook to Taris's rogue moon, and he decides to investigate the moon in hopes of learning why the Masters killed the Padawans. He and Jarael—who still resents Carrick for uprooting and exposing her and Camper—discover the Jedi's damaged droid T1-LB, or Elbee, before they escape Master Draay and the police on the rogue moon. Back on The Last Resort, Carrick and the others examine T1-LB's memory: the droid witnessed the Jedi Masters experience a Force vision that predicts their deaths at the hand of a red-armored figure. Believing the figure to be one of their Padawans, who had been wearing red space suits on the rogue moon identical to the foreseen Sith Lord, the Masters agree to execute their apprentices to prevent the vision, and Draay destroyed the droid to eliminate a witness, a betrayal that severely damaged T1-LB's programming and logic processors. The crew's discussion is interrupted by the ship of the bounty hunter and pirate Valius Ying, who captures them and plans to return Carrick to Draay. Hierogryph negotiates his own release and that of Camper and Jarael, but when Carrick tries to steal The Last Resort and escape, he is caught by Jarael. Realizing that he could not leave the others in danger to save himself, Carrick decides to surrender to the Masters."}, {"tag": "p", "text": "Ying's arrival on Taris with Carrick is greeted by mobs of celebrating citizens, as the public's loss of faith in the Jedi had led to rioting and mass panic in the face of the advancing Mandalorian threat from the Outer Rim Territories. When Carrick is delivered to the Jedi Tower, Draay and the Masters reveal that they did in fact kill the Padawans after the apprentices became suspicious, as they had refused to believe that Carrick would be Knighted alongside them. Draay explains that the five of them are members of a Jedi Covenant sworn to prevent the return of the Sith, and he executes Ying to eliminate the only witness before preparing to kill Carrick. However, Jarael, Camper, and Hierogryph have other plans: unwilling to let Carrick sacrifice himself to save them, the trio attack the Jedi Tower with The Last Resort. Jarael rescues Carrick in a red space suit, using the Masters' fear of the figure to buy them time to escape, and Carrick takes on a position as Hierogryph's \"henchman\" as the four of them escape Taris with Elbee in The Last Resort. Three weeks later, rioting has enveloped much of Taris, and the Masters are recalled to the Republic capital of Coruscant, as the public has lost faith in the Jedi's ability to protect and police them. Before they depart Taris, however, the five receive a message from Carrick in which he promises to seek justice for the other Padawans, and he tells them that he has \"foreseen\" that the first Master to confess will survive."}, {"tag": "h3", "text": "Flashpoint"}, {"tag": "p", "text": "On the mining colony of Vanquo, Carrick, Hierogryph, Camper, and Jarael run a con on one of the mining stations, convincing the workers to evacuate under the belief that the planet is under attack by Mandalorians. However, as the crew of The Last Resort is loading the mining stations' supplies, they are presented with a surprise: the Mandalorians actually are invading Vanquo, which leads to Jarael's capture, as she was masquerading as a Jedi for the group's scam. The remaining members of the crew flee through the forest back to The Last Resort, but the Mandalorian commander Rohlan Dyre, seeing an opportunity to escape, steals The Last Resort himself. With Elbee's help, Camper, Hierogryph, and Carrick barely manage to board The Last Resort as it takes off amid blaster fire from Dyre's own troops. Camper quickly attacks Dyre with Jarael's shockstaff, and with Elbee's help the group is able to subdue the Mandalorian and lock him in a storage compartment known as a Camper Special. Meanwhile, Jarael is imprisoned aboard a Mandalorian ship that enters the ongoing naval battle between the forces of Mandalore the Ultimate and the Republic Navy."}, {"tag": "p", "text": "As The Last Resort pursues the ship that has Jarael, it is identified by Captain Saul Karath's Courageous, and Karath assumes that Carrick is a Mandalorian operative when The Last Resort is detected jumping towards Mandalorian space. Camper is tracking Jarael via a homing device in her bracelet, and Dyre convinces Hierogryph and Carrick to let him out so that he can help them rescue Jarael—for as he explains, he is known as Rohlan the Questioner, a Mandalorian who is determined to discover Mandalore's reasons for starting the war. Dyre explains that Jarael is being taken to the stellar research station Flashpoint, which was converted into a laboratory for the Mandalorian scientist Demagol's research into Jedi. Dyre also explains that the Mandalorians invaded Vanquo because of the Padawan Massacre, as Mandalore took the recall of the Jedi from Taris to be an opportunity for attack. Upon learning that other Jedi are imprisoned on Flashpoint, Carrick becomes determined to rescue them, and he develops a plan to do so as they approach Flashpoint."}, {"tag": "p", "text": "Meanwhile, Jarael is taken to Flashpoint and imprisoned with the other captives, many of whom had been captured on the planet Suurja three weeks earlier. Jarael encounters Squint, who realizes that Jarael is not a Jedi and offers himself in place of Jarael for Demagol's torture and experiments. On approach to Flashpoint, Dyre claims to have captured a Jedi and demands immediate clearance to land as Hierogryph and Camper hide in The Last Resort's concealed storage compartment, and Dyre arrives just in time with a \"captive\" Carrick to rescue Jarael from Demagol's attentions. In Demagol's lab, Dyre and Carrick overpower Demagol and Carrick dons the scientist's armor, and the two head out to the surface, where Dyre distracts the sentries as Carrick uses the Force to plant Hierogryph's demolition charges on the various Mandalorian vessels nearby. Hierogryph then contacts Flashpoint as \"Admiral Hierogryph\" of the Republic vessel \"Glomkettle\" and triggers the charges, tricking the sentries into believing that the Republic had begun booby-trapping their equipment and ships to prevent the Mandalorians from using them."}, {"tag": "p", "text": "Dyre and Carrick complete the con by convincing the other Mandalorians at Flashpoint to flee on one of the last remaining ships while Dyre stays behind to evacuate Demagol. With the Mandalorians gone, the Jedi are able to escape Flashpoint, taking Demagol with them and seemingly accompanied by Rohlan Dyre. However, Dyre actually sneaks aboard The Last Resort. The same day as Carrick and crew are on Flashpoint, Draay and the other members of the Covenant return to Coruscant, where Draay is refused entry to his family's house, the Draay Estate, and the five are split up by the Jedi High Council. Amid these events, Draay recalls his childhood and how his mother Krynda focused more on training the four seers than raising her own son, as she was obsessed with preventing the rise of another Sith like Exar Kun. The five Masters go their separate ways as ordered, but continue their efforts to locate Carrick despite the Council's refusal to allow them to be involved in the search for the missing Padawan. Draay tries again to visit his mother, the Covenant's leader, but his mother's retainer Haazen refuses him and reprimands Draay for killing the Padawans against Haazen's instructions."}, {"tag": "h3", "text": "Reunion"}, {"tag": "p", "text": "Following the mission to Flashpoint, the crew of The Last Resort heads to the banking planet of Telerath, where Hierogryph has an account that is frozen due to his involvement in the Padawan Massacre. To gain access to the money, Camper and Jarael go undercover as \"Baron Hyro Margryph\" and his assistant \"Chantique\" and visit a banker named Arvan while Carrick and Hierogryph remain aboard The Last Resort. The two claim that the account actually belongs to Baron Margryph, who had been confused with Marn Hierogryph, and despite the fact that they left the account's access code aboard The Last Resort, Camper is able to recite the access code perfectly to the surprise of the rest of the crew. As Arvan leads Jarael and Camper to the banquet pavilions, they are watched by the Moomo Brothers—a pair of bounty hunters named Dob and Del who have been hired to keep watch on Arvan. The Moomo Brothers decide to kidnap the banker and then watch him, and Hierogryph and Carrick rush to rescue their banker—only for Zayne to recognize the banker as his father, Arvan Carrick, just before the brothers escape."}, {"tag": "p", "text": "Raana Tey is furious to learn that the brothers kidnapped Arvan, and she orders them to stand by while she consults with the rest of the Covenant. Dob and Del soon end up fighting, and the victorious Dob goes out for a drink as Zayne's friends realize that the Covenant hired the brothers to watch Arvan as a trap for Zayne. Hierogryph soon locates Dob at a nearby bar, and, plying him with quite a few drinks, convinces the Ithorian to trade Arvan for the far more valuable Zayne. Falling for Hierogryph's play, Dob gives the Snivvian the location of the brothers' ship, the Moomo Williwaw and Carrick tails the drunken bounty hunter back to the Williwaw where he overhears Raana Tey tell Del that she will arrive soon to kill Arvan. Freeing his father, Zayne learns that Arvan's bank had been purchased by the Draay Trust, and his father reassures Zayne that his family did not believe Zayne committed the Massacre. Using Hierogryph's arrival as a distraction, Zayne hits one of the brothers with a Force-propelled crate, sparking a fight between the two and allowing the Carricks to escape. Arvan accesses Hierogryph's account for the crew before Zayne sends him and the rest of his family to Dantooine, where Master Tokare takes Arvan on as the Enclave's banker."}, {"tag": "h3", "text": "Days of Fear"}, {"tag": "p", "text": "Not long after The Last Resort departs Telerath, the Duros Eejee Vamm—who is employed scanning holofootage from across the galaxy—notices a recording of \"Baron Hyrogryph\" at Telerath and contacts Lord Adasca with news of his findings. On the planet Ralltiir, Camper, Jarael, and Elbee part ways with Hierogryph and Carrick, though not before Camper gives Zayne a set of phrik-alloy vambraces that block lightsaber strikes—something that Jarael demonstrates in a sparring match between the two. Jarael wishes Carrick good luck before she departs with Camper to find a new place to hide, though Carrick is saddened that they are leaving. Hierogryph hires a Trandoshan ship thief named Slyssk to secure them a new ship, though Carrick is amused when the timid Slyssk attempts to force Hierogryph to pay more than their agreed price. Carrick and Hierogryph con Slyssk into swearing a life debt to Hierogryph, though Slyssk takes it more seriously than Hierogryph expects, and the three are forced to flee in the stolen ship—the Little Bivoli—when the ship's real crew arrives. However, Hierogryph and Carrick quickly realize that the Little Bivoli is a military mess ship, and the ship is forced to join Admiral Karath's fleet as it departs Ralltiir."}, {"tag": "p", "text": "Aboard The Last Resort, Camper is subdued by a HK-24 series assassin droid that has slipped aboard, and the assassin droid attacks Jarael when she investigates noises from the hold. Jarael fights the droid briefly before she is rescued by Rohlan Dyre, who explains that he had been trying to leave The Last Resort for some time but had not yet found an opportunity to do so unnoticed. The Little Bivoli, meanwhile, sets up shop on the surface of Serroco, where Hierogryph has employed Slyssk as a cook as they cater to the crew of the Republic fleet stationed above the planet. Carrick meets a pilot by the name of Carth Onasi, and amid the two's discussion of the war, Carrick sees one of the native Stereb who is foraging through the dumpster. He pays for the Stereb's meal at the Little Bivoli, and Onasi mentions how he used to call down fake emergency notices to the Stereb population. That night, Carrick becomes fed up with Hierogryph and storms outside to get some air—but he is overcome by a vision of an orbital bombardment that devastates the surface of Serroco. Realizing that the Mandalorians will bomb Serroco when they arrive the next day, Carrick becomes determined to warn Admiral Karath."}, {"tag": "p", "text": "Despite Carrick's warning for the Little Bivoli to depart, Hierogryph decides to stay open a little while longer the next morning. Carrick, meanwhile, sneaks aboard the Deadweight, Onasi's ship, and identifies himself as a Jedi, explaining his vision of the Mandalorian attack. However, Karath recognizes Carrick as the purported Jedi-killer and accuses him of being a Mandalorian spy when the two arrive aboard the Courageous's bridge. Carrick's claims of helping \"Squint\" at Flashpoint are laughed down by Karath, though the admiral allows Onasi to try and contact \"Squint\" while Carrick remains on the bridge, and Mandalorian ships arrive in the system moments later. Hierogryph learns of their arrival, but a last-minute rush on the Little Bivoli leads him to forestall departure. Just as Carrick predicted, the Mandalorians launch dozens of nuclear warheads at the Republic fleet, and just before collision the missiles swerve around the ships to slam into the planet's surface—and as Onasi returns to the bridge, Carrick cries out as he feels the deaths of thousands. The sensation is felt by Jedi across the galaxy, including Squint, the Jedi known as the Revanchist, Q'Anilia, and Lucien Draay. Only eight ships managed to escape the bombardment, and the Little Bivoli was not one of them; a despondent Carrick is imprisoned in the Courageous's brig by a furious Karath. However, Onasi visits Carrick later that night and tells him that he managed to call emergencies down to seventeen of the twenty-seven Stereb cities that were hit by the bombardment, calls that led the Stereb to take shelter in underground bunkers."}, {"tag": "h3", "text": "Nights of Anger"}, {"tag": "p", "text": "On her way to Taris on a mission for the Supreme Chancellor, Raana Tey is tormented by nightmares, particularly one where she relives the Padawan Massacre from Zayne Carrick's perspective—and where the Padawans are the ones who kill the Masters. To rid herself the night visions, Tey believes that she must kill Carrick. On The Last Resort, Jarael and Dyre are struggling to heal Camper—who has been plagued by illness for years but whose illness is growing steadily worse—and Jarael decides to visit the planet Arkania in hopes of acquiring medical aid. Jarael attempts to visit a medical center in Adascopolis, but she is forced by the guards onto a shuttle out to the mining camps because she is an Arkanian Offshoot, and aboard the shuttle, Jarael meets another Offshoot named Zadawi who takes Jarael to her house. From Zadawi and her grandmother, Jarael learns of how the Offshoots are discriminated against by the \"pure\" Arkanians, and Zadawi helps Jarael disguise herself as a pure Arkanian so she can sneak into the city. However, Jarael's visit to the medical center draws the attention of Arkanian guards, and Jarael's fight with them is ended by the arrival of Lord Arkoh Adasca, who calls off his guards and offers to help cure Camper. The Arkanian Legacy, Adasca's flagship and the mobile headquarters of Adascorp, brings The Last Resort aboard it, though Camper collapses in one of his spells when he learns that Jarael is working with Adasca."}, {"tag": "p", "text": "Camper is rushed into quarantine by the Arkanian Legacy's medical staff, and Jarael stops Adasca's guards from attacking Dyre when they see he is a Mandalorian. Lord Adasca proceeds to give Jarael a tour of the Legacy, during which he explains that Camper—whose real name is Gorman Vandrayk—used to work for Adascorp years ago before he was exposed to Balinquar's Virus, a pathogen that affects elderly Offshoots. Adasca offers Jarael free reign aboard the Legacy as Camper undergoes treatment. Meanwhile, the Republic defensive line at Serroco is failing rapidly, and as the Courageous is boarded, Admiral Karath, Onasi, and Captain Dallan Morvis are forced to retreat towards the brig. Karath reluctantly seeks help from Carrick, who, after Karath promises to take the Jedi with him, reveals that he has removed the screws from the bulkhead in his cell—exposing an access passage straight to the hangar and Onasi's Deadweight."}, {"tag": "p", "text": "Unbeknownst to Jarael, Dyre has been imprisoned by Adasca, who makes a deal with the Mandalorian: in return for his help, Dyre is given access to the ship's foredeck and research facilities. Furthermore, Eejee Vamm contacts Jarael and informs her that Camper is in recovery for the next few days—a conversation that he uses to show a perfectly healthy Camper that Jarael is safe, for now. Vamm reveals that Camper's illness were caused by pollutants and spores in The Last Resort's vents, and Camper is forced to resume the research he abandoned years earlier to ensure that Jarael is not harmed. Lucien Draay arrives on Telerath in order to pick up Carrick from Karath, but the news that the Courageous has fallen incites mass panic and ends Draay's hopes of acquiring Carrick, so he contacts Haazen. Haazen informs Draay that WatchCircle Vodo has foreseen a faceless evil rising in the future, and in order to investigate its source, Haazen dispatches Draay to meet with Arkoh Adasca, who has been contacting the leaders of various groups such as the Jedi Revanchists and the Republic Navy."}, {"tag": "p", "text": "Aboard the Arkanian Legacy, Adasca continues his attempts to grow close with Jarael, inviting her to dinner, and he is pleased to learn that Camper's research has met with success. Adasca later approaches Dyre, who is engrossed in research, and makes a new deal with the Mandalorian: in exchange for contacting Mandalore the Ultimate and requesting that he attend a meeting with Adasca, Dyre will be allowed to go free with Jarael once Adasca's business is concluded. The Deadweight also receives an invitation from Adasca, asking Admiral Karath to rendezvous with the Arkanian Legacy. At dinner, Adasca surprises Jarael by discussing her unique genome, and he reveals what Camper has been working on—the weaponization of the space slugs known as exogorths—before he unveils the dozens of hibernating exogorths that they have located in the remote Omonoth system."}, {"tag": "h3", "text": "Daze of Hate"}, {"tag": "p", "text": "The Deadweight answers Adasca's message and rendezvouses with the Arkanian Legacy in the Omonoth system, aboard which Adasca has decided to keep Jarael as his companion for the time being—and when she overpowers his HK-24 droids and levels a blaster rifle at him, Adasca forces her submission by threatening Camper's life. Jarael is overjoyed to see Carrick among Admiral Karath's party, and she kisses him passionately in order to get close and explain the situation in a whisper. At Karath's request, Adasca imprisons Carrick, and the Arkanian adds a threat against Carrick's life to Jarael's motivations before he greets Squint, who has answered Adasca's summons for the Revanchist leader. Squint, or rather Alek, informs \"Dyre\" and Jarael that \"Demagol\" fell into a sedative-induced coma almost immediately after the Jedi departed Flashpoint, and Adasca is called away by Eejee Vamm to meet another visitor—one who Adasca is surprised to recognize as Lucien Draay. Draay and Adasca exchange pleasantries and wine, but Draay collapses after he drinks drugged wine, as Adasca did not want Draay involved in his upcoming meeting."}, {"tag": "p", "text": "In the Arkanian Legacy's observation dome, Adasca explains the exogorths and how they operate to Karath's party and Squint, and Karath is angered to learn that the Republic must purchase the exogorths—and Karath and Squint are both shocked when Adasca's third guest arrives: Mandalore the Ultimate. Adasca then reveals that he intends to use the exogorths as a bargaining chip to secure the allegiance of either the Mandalorians, the Republic, or the Jedi, and elsewhere on the ship, Draay awakens to find himself tied to Carrick and guarded by HK-24 droids. Squint attacks Mandalore when he enters the observation dome, and Karath levels a blaster at Mandalore when Squint is batted aside. Adasca ends the hostilities and orders a demonstration of the exogorths' potential, and Camper manages to slip away to the spacesuit storage chamber aboard the exogorth command platform. As they wait, Mandalore requests a moment with Dyre; Mandalore explains that he has turned the Questioner into a martyr, and Dyre's \"sacrifice\" has been used by Mandalore and his lieutenant Cassus Fett to help spread the Neo-Crusader philosophy and armor throughout the Mandalorian ranks. In exchange for allowing him to depart safely with a new set of armor, Mandalore makes Dyre promise to remain \"dead\" for the cause."}, {"tag": "p", "text": "Camper manages to contact Jarael through her bracelet, and she manages to slip away as Dyre approaches Adasca and demands that he be allowed to leave with Jarael. She apologizes frantically to Camper and explains that Carrick and Squint are on the Legacy, and Camper refuses to risk Jarael's life by trying to sabotage the exogorths, revealing that Adascorp was responsible for the diseases that now afflicted the Offshoot population—something that is overheard by Adasca, who attacks Jarael. Squint levels his lightsaber at Adasca's throat when he strikes Jarael, preventing him from killing her, but Adasca threatens Camper through Jarael's bracelet and orders him to continue his work. Meanwhile, Draay and Carrick begin to argue about the Covenant's desire to kill him, but the two ally with each other in order to escape and overcome their captors; Draay promptly turns on Carrick once they are free, but Carrick's vambraces save his life and deactivate Draay's lightsaber, and the two resume their uneasy alliance in an effort to deal with Adasca. Onasi slips away as the exogorths become active, and Adasca begins to discuss terms with the interested parties. Karath offers a seat in the Galactic Senate, but Mandalore counters with immunity from Mandalorian attack and the promise to make Adascorp his armies' sole supplier of weapons. At the same time, Eejee Vamm and Adasca's scientists discover something about Jarael's blood, but Dyre brutally kills them to \"protect the truth.\""}, {"tag": "p", "text": "However, Adasca quickly becomes power-hungry and demands the allegiance of both the Jedi Order and the Mandalorians, believing his control over the exogorths make him a galactic power. Onasi locates Draay and Carrick and the three discuss how to eliminate the threat of the exogorths, but when Draay suggests killing Jarael to remove Adasca's leverage, Dyre arrives and threatens Draay for suggesting it. The four develop a plan to set Adasca's \"guests\" against each other, and Carrick dons Dyre's Neo-Crusader armor in order to stage a fight between himself and Onasi in the observation dome. As chaos erupts, Carrick frees Jarael before joining the newly arrived Draay in addressing Lord Adasca, claiming that Adasca had arranged the entire meeting as a Jedi trap for Mandalore. Full-scale battle ensues and Carrick manages to contact Camper with the news that Jarael is safe, leading Camper to remote start The Last Resort and have it fly to his location as he hotwires the exogorth control system into a portable platform. Camper takes control of the HK-24 guarding him and causes it to break through the station's bulkhead, allowing him to spacewalk to The Last Resort. Using the exogorth control box, Camper instructs the exogorths to attack Adasca's fighters and the Arkanian Legacy's observation dome, killing Adasca as the Arkanian's guests escape the doomed ship."}, {"tag": "p", "text": "Amid the chaos, Onasi lets Carrick \"escape,\" but when Jarael and Dyre reach the hangar, they find only Elbee, despondent that The Last Resort has left him. As he leads the exogorths away in The Last Resort, Camper contacts Jarael and explains that he intends to lead the bioweapons into the unknown and remove their hyperdrives, and Carrick reaches the hangar just in time to see The Last Resort jump to hyperspace and Jarael burst into tears. Draay offers to rescue Squint, Carrick, and Carrick's friends in exchange for Carrick's surrender, but just as he agrees, the Moomo Williwaw crashes into the hangar—carrying Dob Moomo and Slyssk. Slyssk reveals that Hierogryph is alive on Taris, and he needs Carrick's help, but as Carrick's group escapes aboard the ship, Draay overhears their destination and escapes the doomed Legacy as well."}, {"tag": "h3", "text": "Knights of Suffering"}, {"tag": "p", "text": "The group heads to Taris, which is undergoing Mandalorian occupation, and Dyre pilots the Williwaw down towards the surface so that Carrick—wearing Dyre's discarded Neo-Crusader armor—can free-fall down into the Lower City. Carrick locates Hierogryph and Del Moomo with the Hidden Beks swoop gang, and Hierogryph reports Carrick's arrival to his client on Coruscant before Gadon Thek is forced to pull the Hidden Beks back to their base known as the Pit. Thek explains to Carrick that he intends to join up with the Taris Resistance, and also tells him that he intends to take Carrick to the constable in order to join them. Speaking with Gryph, Carrick learns that the Snivvian is on a \"Republic-ish\" mission for Jervo Thalien, the head of Lhosan Industries, to locate Taris's Senator Goravvus. The Twi'lek girl Mission Vao takes Carrick to show him a secret that her brother Griff is hiding, though the Hidden Bek Brejik attacks Carrick when he thinks that Carrick is escaping. Mission then shows Griff's \"secret\" to Hierogryph and Carrick: the constable's missing children, who Brejik and Griff had kidnapped and hidden weeks ago. Meanwhile, Raana Tey is on Taris, and she can sense Carrick's arrival—and she has joined forces with Shel Jelavan, Shad's sister and Carrick's romantic interest before the Massacre."}, {"tag": "p", "text": "Gadon Thek turns the discovery into an opportunity, however, using the constable's children to secure a meeting with the resistance; but when they arrive at the resistance's base, Shel Jelavan shoots at Carrick in revenge for killing her brother. Jelavan's shot is absorbed by Hierogryph's heavy briefcase that Carrick is carrying, but Raana Tey encourages her to finish off the stunned Carrick and avenge her brother. Upon recognizing Del Moomo, Tey attacks the Ithorian in a fury, giving Hierogryph time to disarm Jelavan, and a standoff between Tey and the Hidden Beks develops that is ended by the arrival of Constable Noana Sowrs and Senator Haydel Goravvus. Goravvus forces Tey to stand down and allows the Hidden Beks to join the resistance, and Hierogryph informs the Senator that Thalien is looking for him. Hierogryph opens his case to display a holocommunicator to Thalien, but is surprised when Del Moomo seizes the Senator as a hostage—Thalien's actual intention is to eliminate Goravvus, who knew that Lhosan Industries had helped bribe Taris's way into the Republic. Fortunately for the Senator, Raana Tey frees him from Moomo, and Thalien's attempt to detonate a bomb in Hierogryph's case is rendered ineffective, as Shel Jelavan's blaster shot overloaded the circuits."}, {"tag": "p", "text": "The Moomo Williwaw, meanwhile, remains in orbit among the massed Mandalorian ships, and Dyre convinces Jarael to spar with Alek in order to take her mind off of Camper and to hone her skills. To Jarael's surprise, Alek attempts to start a relationship with her, though Jarael refuses for the time being. Carrick finally corners Shel and tries to explain that he didn't kill Shad, but her revelation that she set a bounty on Carrick's head and the arrival of Raana Tey seemingly ends any hope of reconciliation. The resistance plans to infiltrate Cassus Fett's command post in the Jedi Tower and destroy it with explosives, and Carrick volunteers to accompany Raana Tey on the mission to destroy the Tower, a mission that Jelavan also volunteers for. After the meeting, Tey urges Jelavan to retrieve her brother's lightsaber when they are in the Tower and use it to kill Carrick. As the mission begins, Tey recalls a time in her childhood when she overheard Krynda Draay make a prophecy about five people: one for the darkness, one for the light, one from the darkness who stands in the light, one from the light who stands in darkness, and a fifth who stands apart from the others."}, {"tag": "p", "text": "Donning his Neo-Crusader armor, Carrick escorts Jelavan as his prisoner to the Jedi Tower, though the two argue most of the way, and Jelavan kisses Carrick to maintain their cover when they are overheard by other Mandalorians—though she promptly knees him between the legs when they leave. Once in the Tower, Jelavan acquires her brother's lightsaber, though Carrick's clear sadness over Shad's death and his insistence that he is innocent leaves Shel confused as to whether she should try and kill him. Tey is furious to find Carrick still alive when Jelavan lets her into the Tower, and she pursues Carrick as he heads to the upper levels to complete the mission—only to discover that Cassus Fett has abandoned the building and has headed into the Lower City. Raana Tey attacks Carrick, realizing that her vision of Mandalorians and Sith on Taris is coming true, and in her madness, she refuses to listen to Carrick's warnings that Fett is going to attack the resistance. The Hidden Beks retreat to the Pit once they learn that the resistance has been attacked, and Hierogryph keeps hold of the detonator to the Tower explosives as they flee. Meanwhile, Carrick and Tey duel in the Tower, and she brings down the glass ceiling on Carrick when he tries to escape via jetpack."}, {"tag": "p", "text": "The crazed Togruta Jedi Master explains about the Prophecy of the Five to Carrick before she prepares to execute him, but Carrick is saved by Jelavan, who stabs Tey with her brother's lightsaber after she hears the Jedi Master admit to the Massacre. Jelavan and Carrick escape the Tower thanks to Hierogryph and Gadon Thek's arrival on a swoop bike, but Raana Tey—still alive despite her fatal wound—leaps after Carrick in a desperate attempt to stop him. When she lands on the roof, Carrick is unable to leave her to die and offers her rescue; his offer brings her to her senses and she accepts. However, Tey's hand is stuck in the glass window, and when she raises her lightsaber to cut it off, Hierogryph thinks she is attacking Carrick and detonates the explosives. As the Jedi Tower begins to collapse, Tey asks Carrick to tell Krynda that she is sorry, and as Q'Anilia and Lucien—who have undertaken a romantic relationship—sense Tey's death, Carrick realizes that he now has a name for the Covenant's leader."}, {"tag": "h3", "text": "Vector"}, {"tag": "p", "text": "Not long afterwards, while having a memorial service for Raana Tey on Coruscant, Xamar, Q'Anilia, and Feln experience a horrifying vision: an apocalyptic future overrun by rakghouls led by an ancient Sith, and four individuals: Carrick, a dark-armored figure, and two sandy-haired Humans. Around the Sith's neck, the three Jedi recognize the Muur Talisman—an ancient Sith artifact that was believed to have been lost on Taris. Lucien Draay decides to send Celeste Morne, one of the Covenant's Shadow agents, to Taris to locate the artifact. On Taris, Morne rescues Constable Sowrs from a rakghoul attack, but she is forced to execute the constable when Sowrs is infected, and Morne encounters Hierogryph and Carrick fleeing from rakghouls. The pair follow Morne on her mission despite her dislike of them, but the floor collapses underneath them due to explosions from Mandalorian excavations nearby. The three find themselves right next to the Mandalorian excavation, where Morne witnesses a Mandalorian named Pulsipher—Demagol's former assistant—discover the Muur Talisman. Morne pursues Pulsipher, with Carrick and Hierogryph tagging along, and the three sneak aboard Pulsipher's ship before it departs for the ice planet of Jebble."}, {"tag": "p", "text": "As they approach Jebble, the Talisman electrocutes Pulsipher and \"bites\" one of the other Mandalorians, and when Carrick and Hierogryph depart Pulsipher's ship, they are pressed into service with a large group of forced Mandalorian conscripts who have been gathered for an attack on the Core World of Alderaan. Carrick slips away and finds Morne, who is trying to locate the talisman, and tries to get her help in warning the Republic. Hierogryph, meanwhile, is determined to gain access to the Jedi financial records that he overheard Pulsipher mention, and he uses his new Mandalorian armor as a disguise to get the three of them into the Mandalorians' Ice Citadel—but Hierogryph's clumsiness with weaponry causes his blaster rifle to bring down part of the fortress on him. Carrick and Morne are cut off from Hierogryph and pinned down by a group of Mandalorians, but the one that has been \"bitten\" by the Talisman suddenly mutates into a rakghoul and starts infecting the others. The rakghoul plague begins to spread rapidly, and the two Jedi realize that the plague—which is evolving the rakghouls beyond the normal version for some reason—will infect the entire Mandalorian army stationed on Jebble. Carrick and Morne escape from the Citadel, and Carrick tells the Jedi the truth of the Massacre, unaware that Morne is an agent of the Covenant herself. The two quickly find a relay station so they can warn the galaxy, and at the same time, Hierogryph locates the Jedi records, only to find that they are records about the Muur Talisman and Covenant agents such as Morne."}, {"tag": "p", "text": "Unbeknownst to Carrick, Morne contacts Lucien Draay and informs him of recent developments, though she questions Draay's order to kill Carrick and finds herself unable to do so when his back is turned. Carrick then uses the station to contact Cassus Fett, who he tries to warn about the rakghoul plague. To Morne's surprise, Carrick then makes his way back to the citadel in search of Hierogryph, though he is soon captured by rakghouls and brought before Pulsipher. The crazed Mandalorian interrogates Carrick as to how the Talisman works, and threatens him with imprisonment inside an oubliette built by the ancient Sith Lord Remulus Dreypa, but the Talisman, sensing that Carrick is Force-sensitive, attempts to take him as its new host. When Pulsipher knocks it aside, the rakghouls turn on Pulsipher and kill him, and Morne arrives just in time to see the Talisman on top of Carrick. Hierogryph arrives as Morne is struggling to pull the Talisman away from Carrick, who is tempted by the artifact's power, and Morne offers herself to the Talisman to save Carrick. As the Talisman takes her as its host, Morne meets the spirit of its owner Karness Muur, and the rakghouls around them bow to their new master."}, {"tag": "p", "text": "Struggling with Muur to maintain control over herself, Morne experiments with her newfound control over the rakghouls, and she explains to Carrick that the Talisman induces the rakghoul plague in order to carve out the minds of victims while leaving behind the skills they have learned, creating the perfect soldiers. However, when Hierogryph tells Carrick about Morne's connection to the Covenant, Carrick learns that Krynda is Lucien Draay's mother, and the two argue over the Covenant's goals and methods—an argument that sees Morne attack Carrick in a rage and prepare to execute him. Before she does, however, Carrick forces her to realize what the Talisman has created: an ever-expanding army that serves the Sith. Horrified, Morne begs Carrick to end her life, but he finds another way: Dreypa's Oubliette can keep her safe and contained. Thanking Carrick, Morne gives him her key to the Sanctum of the Exalted, the Covenant's storehouse of Sith artifacts on the planet Odryn. Without Morne's influence, the rakghouls begin to pursue Hierogryph and Carrick, but the pair are saved by the arrival of the Moomo Williwaw, and as they depart Jebble, the group witnesses Cassus Fett bombard Jebble's surface with nuclear warheads to wipe out the rakghoul plague. With the support of his friends, Carrick decides to go to Odryn and use the Covenant's storehouse to expose them."}, {"tag": "h3", "text": "Exalted"}, {"tag": "p", "text": "On Coruscant, Lucien Draay has been elevated to a seat on the Jedi High Council thanks to Haazen's manipulations, and he convinces the Council to order the recall and even possibly the detention of the Revanchists, particularly Alek for his role in the Adasca affair. Master Vrook Lamar is suspicious of Draay's recent ascent to power despite the Padawan Massacre, but Master Tokare reminds him that the two agreed to Draay's appointment so that they could uncover the truth behind the Massacre. Haazen contacts Draay and demands that he return to the Draay Estate immediately, as Celeste Morne has reported in with success. Meanwhile, the Moomo Williwaw arrives on Odryn, and Jarael—disguised as Morne—is taken to the Sanctum of the Exalted by the Feeorin Borjak, who Jarael forces to allow the Moomo Brothers to carry a large case supposedly containing an artifact into the Sanctum. Odryn is wracked by storms and strange phenomena of nature, all of which have occurred ever since Feln, as the Exalted, or leader of his tribe, allowed the Covenant to store artifacts in the Sanctum. Once inside the Sanctum, the Moomo Brothers release Carrick and Hierogryph from the case that they are carrying, and Carrick uses Morne's key to access the Sanctum, which contains hundreds of dormant Sith artifacts."}, {"tag": "p", "text": "After the Moomo Brothers are warned not to take any of the artifacts, Carrick and Hierogryph set to work photographing the artifacts as evidence to use against the Covenant, and the two also discover that the Covenant's researchers are testing artifacts such as the Helm of Dathka Graush. The pair sneak out of the Sanctum, but they are captured by Borjak and the rest of the tribe. Borjak questions Carrick as to why he would try to sneak out of the Sanctum, and explains that Feln has broken the tribe's traditions such as the Rime Feeorin ever since he became a Jedi. However, Carrick's attempts to convince Borjak to stop following Feln end when the Feeorin Jedi Master himself arrives. Feln contacts Draay and informs him of Carrick's presence on Odryn, leading them to believe Carrick killed Morne and took her key, and Draay orders Feln to destroy the Sanctum in order to prevent Carrick from gaining access to the Sith artifacts—but Haazen countermands the order. Feln decides to kill Carrick himself, but Borjak reminds him that according to Feeorin tradition, because Carrick has been in the Sanctum of the Exalted, he cannot be harmed by weapons. Carrick quickly attacks Feln and catches him by surprise before he flees into the Feeorin village. However, Feln catches up to Carrick and pins him down, and when Borjak tells Feln that the Moomo Williwaw has returned to the star system, Feln detonates the explosives beneath the Sanctum to ensure that Carrick's group cannot raid it."}, {"tag": "p", "text": "To Feln's horror, the Sith artifacts magnify the explosion as they are destroyed, devastating the village. Enraged, Feln reaches for his lightsaber to kill Carrick, but finds only a stick—just as he foresaw in the Rogue Moon Prophecy—just before Borjak stabs him in the back with a knife. The tribe attacks Feln for destroying the Sanctum and kills him, and Hierogryph reveals that he stole Feln's lightsaber. The rain helps put out the fires among the village, and fortunately for Carrick and his crew, the Moomo Brothers had filled their case full of Sith artifacts from the Sanctum before its destruction, giving the group the evidence they needed in place of the recordings that Feln destroyed. At the Draay Estate, Draay grows angry with Xamar for questioning him in the wake of Feln's death, and Q'Anilia sinks further into despair as Draay sends Xamar to meet with the Republic fleet: Draay has told Admiral Karath that Carrick is planning on raiding Coruscant for the Mandalorians, and Karath has established a blockade around the capital to ensure Carrick does not get by. Q'Anilia urges Xamar not to go, as the Rogue Moon Prophecy foretold his death with the Republic Navy, but Xamar goes anyway, though he begins to consider confessing to the Council."}, {"tag": "h3", "text": "Turnabout"}, {"tag": "p", "text": "As he moves into his new quarters, Lucien reflects on the absence of his father Barrison, who was killed in the Sith War. Meanwhile, Masters Tokare and Lamar respond to a summons from a \"Captain Malak\" and visit a Coruscant cantina, where they meet Shel Jelavan and Alek, who has adopted the identity of Malak to avoid Draay's arrest warrant. Tokare has also received a recording of the events on Jebble, which Jelavan and Malak explain were caused by an agent of the Covenant, and the two inform the Jedi Masters that Carrick wants to turn himself in and present further evidence. However, Admiral Karath has set up a blockade with the Swiftsure, utilizing a tactic known as the Vanjervalis Chain to link together the entire blockade's targeting computers. The Moomo Williwaw prepares to fight its way through, but Lieutenant Onasi and his Lance Squadron order him to turn back, and the Williwaw takes heavy fire from the linked weapons systems of the blockade."}, {"tag": "p", "text": "On the Swiftsure, Xamar warns Karath that Carrick uses misdirection, not force, and despite his trepidation, Xamar takes Karath's advice and goes to the hangar to acquire a starfighter. Realizing that they cannot make it through, Carrick and Jarael come up with another idea: they crash the Williwaw into the Swiftsure's hangar, allowing Hierogryph, Carrick, and Slyssk to steal the shuttle Deadweight and slip down to Coruscant's surface with their artifacts. However, Xamar foresaw their plan and stowed away aboard the Deadweight, and he captures Hierogryph and Carrick. Tokare and Lamar inform Jelavan and Malak that Carrick's evidence is not enough; for the Covenant to be truly exposed, one of their own must confess, and to their surprise, Xamar arrived offering to do just that."}, {"tag": "h3", "text": "Vindication"}, {"tag": "p", "text": "Xamar agrees to expose the Covenant to the Council, but only after he receives promises from Tokare and Lamar that Krynda Draay will receive full immunity for her role in the Circle's wrongdoings. The Council organizes a raid on the Draay Estate, which is guarded by Covenant-loyal Jedi, and the Order sends in Xamar, Carrick, and Hierogryph prior to the attack so that Xamar can ferry Krynda to safety. Carrick dresses up as a Sith and conceals his lightsaber in a replica of the Muur Talisman, and Xamar ferries his \"prisoners\" into the Draay Estate—but when Xamar demands to see Krynda, Haazen refuses to grant him an audience and decides to inspect Carrick himself. Carrick stages a distraction and allows Xamar to slip away and deactivate the Estate's defenses so that the Order can attack, but Haazen exposes Carrick's deception, and when the alarm goes off, Haazen begins \"Vindication\"—a pre-planned insurrection by Covenant Jedi against the Order. At Haazen's directive, Covenant Jedi disable the Jedi Temple's communications, steal the Temple's store of Sith artifacts and take them to the Draay Estate, and rally to the defense of the compound against the Council's forces."}, {"tag": "p", "text": "As Draay watches in horror, Haazen gloats about how Draay's seat on the Council had allowed the Covenant the access they needed, and Haazen reveals that he has been manipulating Draay the entire time. Haazen also seizes control of the Swiftsure's computer systems, taking control of the Vanjervalis Chain, and he directs the Republic fleet to fire on the bridge to the Draay Estate—killing Xamar and fulfilling the Khil Jedi Master's part of the Rogue Moon Prophecy. As fire rains down on the compound, Haazen casts aside his robes to reveal his ruined body and the numerous Sith artifacts that he has incorporated into his form, and he proclaims that the Prophecy of the Five has come to pass. Amid the destruction, Haazen recalls his past: how he, a servant of Barrison Draay, trained alongside Barrison and Krynda Hulis, and was heartbroken when Krynda fell in love with Barrison and married him. Haazen failed to become a Jedi Knight, and he was convinced by the Sith to betray Barrison during the Sith War, but in doing so Haazen was severely mutilated. The Sith rebuilt him, and he later helped Krynda Draay establish the Jedi Covenant, though he manipulated the organization from behind the scenes to pursue his own goals."}, {"tag": "p", "text": "Lucien Draay attempts to attack Haazen, but his attacks are rendered useless by Haazen's possession of the Gauntlet of Kressh the Younger, which prevents anyone and anything from touching its wearer unless they allow it. Haazen explains his interpretation of the Prophecy of the Five: Q'Anilia is the one of the light in the darkness, Hierogryph is the one from the darkness who stands in the light, Carrick is the one for the light, and while Haazen is the one who stands apart from all, Draay is the one for the darkness. With Carrick and Draay as his subordinates, Haazen intends to command parallel armies of Jedi and Sith. Q'Anilia rushes off to protect Krynda and Hierogryph follows her, but Lucien uses the red-bladed lightsaber given to him by Haazen to block Carrick from following, and an enraged Lucien begins to pursue Carrick through the compound. When he finally reaches Krynda's chambers, he finds Q'Anilia despondent over her teacher's apparent death, and the Miraluka has drank poisoned wine to commit suicide, just as she foresaw. In her final moments, Q'Anilia is astonished to learn that Hierogryph was in fact that one foretold by the Rogue Moon Prophecy: he killed Raana Tey and stole Feln's lightsaber, and he has worn the red space suit from the vision. Just as Q'Anilia dies, having drank poison to commit suicide out of despair, Hierogryph realizes that Krynda is not in fact dead—she is encased in an oubliette, just like the one Morne was placed in on Jebble."}, {"tag": "p", "text": "Lucien and Carrick's fight is interrupted when Hierogryph arrives with the dying Krynda, who he released from the oubliette; Krynda is horrified that her son killed the Padawans. She foresaw the Massacre almost immediately after Lucien reported the Rogue Moon Prophecy, but she suffered a stroke and Haazen locked her in the oubliette, where she was forced to relive her vision of the massacre over and over. Lucien tries to justify his actions by explaining that he was trying to protect her, but as she dies, Krynda acknowledges that her teachings were wrong and begs her son to face the future with humility. Enraged by his mother's death, Draay embraces the dark side and charges after Hierogryph, who he blames for Krynda's death. Carrick holds off Draay as Hierogryph flees, but as they battle, Carrick begs his former teacher to break free of Haazen's influence—and he is able to get through to the distraught Jedi Master, who finally decides to help Carrick. Meanwhile, Haazen kills the Covenant Jedi who bring him the Temple's Sith artifacts, and he witnesses Hierogryph enter the courtyard pursued by a furious Draay. Draay and Carrick battle once more over Hierogryph, but Carrick seemingly kills Draay after the Jedi Master is pinned under a falling statue of Barrison Draay."}, {"tag": "p", "text": "To Hierogryph's disbelief, Carrick bows before Haazen and promises his loyalty in return his halting the bombardment of Coruscant. However, Carrick suddenly grabs Haazen's arm and proclaims that he is having a vision of the future—and as Haazen pauses in interest, Carrick slices off Haazen's prosthetic arm that bears the Gauntlet of Kressh the Younger. Haazen blasts Carrick with Force lightning and throws him toward Hierogryph, but to Haazen's surprise, both Carrick and the Snivvian go flying into the sky away from the compound. Draay emerges from the rubble and reveals that the fight had been a ploy to get close to Haazen, and using Haazen's arm—which also has the controls for the Republic fleet—Draay causes the fleet to fire upon the Draay Estate and destroys the entire compound, killing the now unprotected Haazen. Carrick and Hierogryph, meanwhile, land safely in a vat of sludge far away from the Draay Estate. In the days that follow, the Republic and the Jedi Order cover up Vindication by describing it as a terror plot by the Mandalorians, and only the families of the slain Padawans are told the truth of what happened. The Order pays off the bounties on Carrick and Hierogryph, officially clearing their names, and Malak is sent back to the Revanchists with a warning that the Council will not tolerate further involvement in the war."}, {"tag": "p", "text": "Hierogryph decides to leave Coruscant with Slyssk after he gives Jarael Carrick's Padawan braid, as he assumes that Carrick is being Knighted, but Carrick surprises his friend by refusing the Order's offer: he intends to go into business with Hierogryph and Jarael: a partnership that the Snivvian terms Cargryph Capital Management. Unbeknownst to the Republic and the Jedi, Draay survives the destruction of the Draay Estate thanks to the Gauntlet of Kressh, and he retreats to a moon that he had purchased some time ago as a private sanctum. Draay is greatly shaken by his brush with the dark side, and though the Gauntlet kept him alive, he was blinded in the compound's destruction. On the moon of Draay 2, Draay decides to merge the philosophies of his parents and forms a true Covenant of Jedi, a covenant that will dedicate itself to surviving the prophesied doom rather than trying to stop it."}, {"tag": "h3", "text": "Prophet Motive"}, {"tag": "p", "text": "Carrick goes on a brief vacation, and Hierogryph sends Slyssk to Coruscant to buy a ship, but the Trandoshan is tricked into buying the gem miner Hot Prospect. A month after Vindication, Hierogryph, Jarael, and Dyre proceed to run a scam on the trading hub of Metellos 3, which hosts an auction where interested parties can buy the rights to entire planets. Hierogryph poses as \"Professor Gryphomarn\" and arrives at the auction, which Jarael and Dyre—disguised as an armored alien that uses a lightsaber-like weapon—proceed to crash. The group convinces the buyers at the auction that Dyre is from the planet Italbos, which was recently sold at the auction, and Hierogryph helps con the auction guests into bidding on Italbos again, as they claim that the planet is even richer in mineral deposits than previously believed. However, when the Chev auctioneer Cipiter reports to his Chevin master Nunk Plaarvin, Plaarvin deduces Hierogryph's identity and calls for the security team. Jarael and Dyre hold their own against the Chev guards sent to capture them for a time, but they are ultimately defeated; Hierogryph flees the scene and is pursued by security droids, but the arrival of Carrick saves the Snivvian from death."}, {"tag": "p", "text": "Plaarvin is a crime lord in the Raff Syndicate, and he imprisons Jarael and Dyre in the old solar observatory of the lunar station that his auction now occupies on Metellos 3. The observatory lens will burn the two to a crisp when the sun rises, and they are chained together and hung from the filter so they cannot escape. Meanwhile, Hierogryph and Carrick return to the Hot Prospect, where they come up with a plan to rescue their friends by having Slyssk pose as an enforcer of the Raff Syndicate. In the observatory, Dyre pressures Jarael to use the Force, as he believes she is Force-sensitive, and the chain holding them breaks mere moments before they are incinerated by the sun. With Hierogryph and Carrick as his enforcers, Slyssk convinces Plaarvin that Hierogryph's con was a Raff Syndicate operation, and the Chevin falls for their ploy and departs Metellos 3 to visit with the organization's leaders on Jebble. With Plaarvin out of the way, Carrick and the group leaves the auction in the hands of Cipiter and the rest of Plaarvin's Chev slaves, and Dyre orders Carrick to begin teaching Jarael about the Force."}, {"tag": "h3", "text": "Faithful Execution"}, {"tag": "p", "text": "Carrick attempts to reach out to Elbee, who has remained silent and unmoving for weeks, but his efforts are met with no response. The Hot Prospect discovers the passenger liner Chancellor Fillorean adrift in space with all systems offline, and when they board the ship, the group is shocked to discover that every passenger has been apparently asphyxiated. The only survivors are the droid K-OB7 and his master, the Bimm Toki Tollivar. Tollivar explains that passengers had begun to show up dead while the Fillorean was in hyperspace, and he and K-OB7 had remained in their cabin as instructed until they emerged days later and found everyone dead. The crew begins to explore the ship, and Carrick is shocked to discover that K-OB7 has convinced Elbee to help move the bodies; Dyre examines the corpses to discover that they have all been strangled, and the discovery is immediately followed by another: Slyssk has been attacked in galley."}, {"tag": "p", "text": "Dyre manages to save the Trandoshan's life, and when suspicion falls upon K-OB7, Dyre and Carrick leave Jarael behind with Tollivar and Slyssk while they pursue the droid. However, Elbee defends his fellow droid, and K-OB7 finally reveals that he is not the one responsible for the passengers' deaths—his master, Tollivar, is. Tollivar is a former Sith adept from the Sith War, and he has been using his Force powers to kill the Republic one citizen at a time. Carrick and Dyre reach Jarael just in time to stop him from choking the life out of her, and in the fight that follows, K-OB7 attacks his master and electrocutes him to stop him from harming anyone else. Dyre shoots both of them to end the threat that Tollivar poses, and he warns Carrick that if he cannot protect Jarael, then he is of no use to the Mandalorian. A little while later, Carrick continues to reach out to Elbee, and informs the droid that he will be Elbee's friend if he wants."}, {"tag": "h3", "text": "Dueling Ambitions"}, {"tag": "p", "text": "The Gotal Goethar Kleej wins the solo championships in the swoopdueling arena for the fourth consecutive time, but when he tries to expose the Franchise entertainment firm's dealings with the slaving organization known as the Crucible, his speech is overwritten and he is brutally beaten by the underlings of the event's coordinator, the Krish (species)Krish Bardron. Bardron makes a deal with Kleej: if Goethar and his young son Aubin survived the upcoming Tandem Open, they will be allowed to retire from swoopdueling. Not long afterwards, Carrick and his group arrive on the space station Jervo's World, where Carrick is ecstatic to be finally able to visit the swoopdueling arenas. Hierogryph, meanwhile, has spent the last few weeks setting up a con that will allow him to steal from the Franchise, but his plans are interrupted when Carrick decides to enter the swoopdueling league in order to win a rare swoop bike. Carrick does well in the trials, but Jarael and Hierogryph are forced to invent a new persona for Dyre when he is accosted by security forces on account of his Mandalorian armor. Dyre is reinvented as the swoopduelist \"Spikes,\" and Carrick is surprised when Goethar Kleej threatens and coerces Carrick into protecting his son Aubin in the Tandem Open."}, {"tag": "p", "text": "Goethar Kleej and \"Spikes\" are the two finalists for their round, but Carrick is barely able to survive with Aubin as a partner, as Aubin can barely function—the young Gotal has never been trained how to deal with the overwhelming sensory input from his horns like most members of his species are. Jarael, meanwhile, is tormented by the secrets that she has been keeping from Carrick, but she manages to steal the real recording of Kleej's speech; Carrick confronts Kleej over the speech, and though Goethar is unable to fight back against the Franchise, Carrick helps Aubin deal with his horns thanks to his Jedi training. Lhosan Industries' Jervo Thalien, owner of Jervo's World, is enraged to learn that Carrick and Hierogryph are aboard his station, and he decides to eliminate Kleej in order to preserve his relationship with the Crucible—though unbeknownst to Thalien, Hierogryph overhears his plans. He enlists Elbee and Jarael's help in foiling Thalien's plans, while Carrick, Dyre, and the Kleejs compete in the final of the Tandem Open. However, Spikes is soon taken out of the fight by one of their competitors' use of enervation coils, revealing that the match has been rigged, and the Kleejs' accelerator has been jammed, causing them to crash."}, {"tag": "p", "text": "After rescuing his son from another competitor, Kleej agrees to work with Carrick, and the three break out of the arena as the recording of Goethar Kleej's speech about the Crucible is played for everyone to hear, thanks to the efforts of Hierogryph and Jarael. Amid the chaos, \"Spikes\" emerges victorious in what's left of the swoopdueling final, and the group is able to smuggle the Kleejs off Jervo's World to freedom. However, Goethar Kleej recognizes Jarael's tattoos as those used by the Crucible, and he storms off in anger, believing that Carrick is working with the Crucible. Confused, Carrick manages to pry the truth out of Jarael: she used to be part of the Crucible before she met Camper. On Jervo's World, Thalien is executed by the Crucible's Magister Impressor Chantique for his failure to contain the Kleej incident, and she is intrigued to learn that Jarael was part of the group who sabotaged the Franchise's operations."}, {"tag": "h3", "text": "Masks"}, {"tag": "p", "text": "Her secret exposed, Jarael grows distant from Carrick as they stop to rest on the planet Wor Tandell, though she does tell him that she was kidnapped as a child, and that she managed to defeat her overseer and take her place; the position allowed Jarael to try and make the lives of other slaves less harsh. Carrick tries to get her to open up to her friends, offering to help her take down the Crucible, but Jarael flatly refuses. To her surprise, when she returns to the Hot Prospect, Jarael runs into Malak, and Carrick encounters the Cathar Jedi Ferroh—one of the prisoners from Flashpoint—along with a Republic Navy vessel in the nearby capital of Gantra Lea. Ferroh reveals that the Revanchists have been allowed to join the Mandalorian Wars and that he is working with Captain Telettoh of the Testament; when Carrick questions him as to why the Council changed their minds, Ferroh explains the story to Carrick at the same time that Malak retells it to Hierogryph, Jarael, and Slyssk. Ferroh returned to his homeworld of Cathar several years earlier to find that his species had entirely vanished, and the Revanchist leader, believing it to be the work of the Mandalorians, began investigating with the rest of the Revanchists. They were confronted by the Jedi Council, who demanded that the Revanchists stand down, but the Revanchist leader discovered a Mandalorian mask underfoot that induced a shared vision of the past among all of the Jedi present."}, {"tag": "p", "text": "The vision showed how the Mandalorians, led by Cassus Fett, had herded the Cathar into the ocean and executed them all; the one Mandalorian who spoke up against the atrocity was killed along with them, and it was her mask that the Revanchist had found. Taking the name of Revan, the Revanchist leader donned the Mandalorian mask and swore not to remove it until the Mandalorians had been defeated. In light of the Cathar atrocity, the Council agreed to allow the Revanchists to join the war. His story concluded, Malak reveals that he has come for Jarael, who he wants to join the Revanchists and begin a relationship with—but an enraged Dyre attacks Malak and swears that the Jedi will never have her. Their fight is ended by Telettoh and Ferroh, and to the surprise of both Malak and Jarael, Carrick kisses her in front of Malak. Carrick claims that he and Jarael are in a relationship, and tells Jarael that he will go wherever she wants to. After Malak departs, Jarael thanks Carrick for saving her from him, and she decides to ask Carrick for help in breaking the Crucible."}, {"tag": "h3", "text": "The Reaping"}, {"tag": "p", "text": "In the Koornacht Cluster, the crew of the Hot Prospect make their first strike at the Crucible's operations by attempting to sabotage the Sungrazer cooperative, an asteroid mining operation there that purchases slaves from the Crucible. Posing as Crucible agents, Carrick and Jarael claim that they have arrived to take a larger share of the cooperative's profits, though the rest of the Hot Prospect crew is unaware that the two intend to liberate the slaves from the cooperative—but Jarael and Carrick underestimated the number of slaves: instead of eight, there are eighty working for the cooperative. When Jarael and Carrick's covers are exposed, Carrick comes up with a new plan: they join the slaves in dustdiving, the process of mining minerals while on the surface of comets. Carrick then summons the Hot Prospect and uses the Force to push all of the slaves onto the gem miner's hull, where Hierogryph reluctantly allows them entry into the ship despite his anger at being conned. However, the slaves are soon attacked by skyreaper drones, droids used by the Crucible, and the far larger Crucible ship Gladiator forces the Hot Prospect to surrender."}, {"tag": "p", "text": "Jarael recognizes the ship as that of Captain Dace Golliard, the Crucible agent who brought her into the organization, and Dyre rescues Carrick and Jarael from the skyreapers, though the Hot Prospect is unable to move because it is engaged in mining crystals from the comet. The Hot Prospect disengages and uses its harpoon drill against the Gladiator before releasing tanks of xenoboric acid from its hull, and despite Hierogryph's protests, Carrick uses the ship's mining centrifuge to spin the Hot Prospect and free it from the clutches of the Gladiator. After the Hot Prospect lets the slaves out at a transit hub, Jarael explains her past to the others, and Hierogryph reluctantly agrees to help her and Carrick in their efforts against the Crucible. Meanwhile, Chantique tortures Golliard for his failure and prepares to execute him, but the Magister Protector of the Crucible, Bar'injar, stops her from doing so. On Coruscant, Demogal finally awakes from his month-long coma, and the Defense Ministry is immediately contacted."}, {"tag": "h3", "text": "Destroyer"}, {"tag": "p", "text": "As she oversees the fighting pits on the planet Volgax, Chantique recalls how her own father gave her to the Crucible as part of a bargain with the organization. Zayne Carrick, meanwhile, has gone undercover: he allows himself to be captured by the Crucible in a Navy fighter as \"Carth Kamlin,\" and he is delivered to Volgax and placed in the pits. Despite his unwillingness to do so, Carrick is forced to fight other slaves in order to survive, including the Caamasi Snout, and Chantique takes a particular interest in him. Carrick tries to reach out to Snout, who he learns has inherited the memnii, or collective memories, of many other Caamasi who have been in the Crucible. Identifying Carrick as a Jedi, Snout later shares his memnii with Carrick, forcing the young man to relive lifetimes of pain and suffering as he explains that the Crucible was created by the ancient Sith Ieldis as a way to produce armies. Despite Ieldis's death centuries ago, the Crucible has continued their operations, and a shell-shocked Carrick is taken to Chantique's private chambers. The Zeltron woman manipulates Carrick, trying to turn him against Jarael by claiming that she enjoyed her position in the Crucible and that Jarael's name meant \"Destroyer.\""}, {"tag": "p", "text": "On the Hot Prospect, Jarael is worried that they have not received any communications from Carrick or the tracking beacon he carries, and she decides to talk with Elbee, as she overheard Carrick talking to the droid earlier. However, Elbee reveals that Carrick was in fact speaking through Elbee's holoprojector, and he connects Jarael to who he was talking to: Shel Jelavan. On Volgax, Chantique tells Carrick about how Jarael literally stabbed her in the back and took her position as overseer, and how she sought out the Crucible after she escaped from slavery and became the organization's leader; however Carrick realizes that Chantique is manipulating him through the Force. Carrick is thrown back in the pits, where he is pitted against Snout in a death match. To Carrick's horror, Snout kills himself by purposefully falling on Carrick's knife, and a delighted Chantique orders the Crucible to depart Volgax. The Hot Prospect arrives not long afterwards, but Jarael finds Carrick sitting out in the rain and he confronts her with Chantique's stories. Carrick asks to be given time to deal with what he has learned, but Jarael—furious that he believed Chantique's lies—storms off after revealing that the name \"Jarael\" actually means \"Protector.\""}, {"tag": "h3", "text": "Demon"}, {"tag": "p", "text": "Upon learning of Demagol's return to consciousness, Defense Minister Koa Delko arranges a public trial for the Mandalorian, and Rohlan Dyre urges Carrick, Slyssk, and Hierogryph to go to Coruscant and testify at the trial, where they are joined by Malak. During a conversation with Carrick, Malak mentions that when they salvaged the wreck of the Arkanian Legacy, they found Eejee Vamm's mutilated corpse, and Carrick refrains from telling Malak that \"Dyre\" is with Jarael. Hierogryph accuses Carrick of stealing from the money that his father was managing for the two, and Carrick admits to having borrowed it for a \"special project\" before he counters with a demand to hear how Hierogryph and Slyssk escaped Serroco. Coincidentally, their walking argument has led them straight to enormous statues of the Snivvian and the Trandoshan, and Hierogryph explains that they're part of his restaurant. On Serroco, Slyssk saved Hierogryph's life by taking command of a troop transport that was slow to depart the planet, and in doing so he managed to save half a battalion. The Defense Ministry decided to turn the two into propaganda figures: Hierogryph became Captain Benegryph Goodvalor, and Slyssk his Trandoshan sidekick, and the Republic developed a wide variety of licensed propaganda and merchandise, such as the restaurant chain, from the two."}, {"tag": "p", "text": "However, when Carrick makes a throwaway comment to Elbee about how Dyre broke his hand back at Vanquo, Elbee shocks them all by informing the trio that the Mandalorian they have been traveling with is not the same one they met at Vanquo: he had carried them both at separate times when they were in Camper Specials, and the two weighed differently. Hierogryph, Carrick, and Slyssk consider their past experiences with \"Rohlan Dyre\" and notice several oddities, such as his interest and experience in medicine and science, and upon remembering how Dyre once referred to Carrick as \"Human,\" Carrick recalls that Demagol was not Human—the group has been traveling with Demagol all along. Realizing what they have done, Carrick and Hierogryph become determined to save Jarael from Demagol, and they decide to rescue the wrongly-accused Rohlan Dyre. At the trial, Dyre breaks free of his restraints and Malak responds by throwing the Mandalorian across the Senate Chamber with the Force, but Carrick—disguised as a security guard—is able to smuggle Dyre out of the building as the crowd begins to riot. Dyre is ferried into a speeder piloted by Hierogryph, and he and Carrick apologize to Dyre as they fly to safety and ask him for his help in saving Jarael once again. Meanwhile, Jarael and Demagol depart Wor Tandell, and Demagol reveals himself to Jarael as Antos Wyrick, the man who oversaw the Osadia School where Jarael grew up."}, {"tag": "p", "text": "Jarael is overjoyed to see Wyrick, who lies to his former student and claims that he has been Rohlan Dyre ever since the Crucible attacked the Osadia School and took his students, and he reveals that he has taken them to the planet Osadia in hopes of rescuing Jarael's fellows. On Coruscant, Hierogryph and Carrick hide Dyre in an abandoned warehouse, where Dyre explains that Demagol had drugged him and switched armors on Flashpoint. Dyre then explains what he knows about Demagol's past: how he was raised by the cyborg Iskalloni, how he was adopted into the Mandalorian clans and was taught by Mandalore the Ultimate himself, and how, after finding one of the Jedi Master Arca Jeth's hair on a robe that the Jedi Ulic Qel-Droma owned, Wyrick dedicated his life to creating Jedi for the Mandalorians. Jarael was one of the children born as part of the project, and after Crucible attacked and destroyed the project, Wyrick became Demagol and dedicated himself to unlocking the secrets of the Force through science. The group realizes that Chantique is Wyrick's daughter just as Shel Jelavan and Slyssk arrive, and Carrick shows Hierogryph and Dyre that the warehouse is actually the base of the Rogue Moon Project: an organization founded by Carrick with the help of the families of the fallen Padawans whose goal is to help refugees, wrongly accused fugitives, and other people in the same situation that Carrick himself was once in."}, {"tag": "p", "text": "On Osadia, Wyrick and Jarael prepare to raid the Osadia School, which is now occupied by Chantique's forces, and Wyrick gives Jarael the double-bladed lightsaber of Exar Kun. Carrick and the others realize that Demagol has the weapon when Slyssk finds the saber's tag from the Sanctum of the Exalted, and Carrick develops a plan to locate Jarael and rescue her: a plan that involves Cassus Fett, the Republic Navy, and the Crucible's Dace Golliard. At Carrick's instruction, Dyre contacts Cassus Fett and calls in the favor that Carrick owes him, and Jelavan pulls strings in the Republic Military and Senate to get Admiral Karath to follow an anonymous tip to an asteroid field near the Ithor system, where Cassus Fett's forces have massed. Just as Carrick expected, Dace Golliard and the Gladiator arrive and hide in the asteroids in order to pick any escape pods; however, when Cassus Fett's ships swarm the Republic forces, they jump to hyperspace just before a collision, and Carrick contacts the admiral and informs him of Golliard's presence. Karath's forces capture the Gladiator, and Cassus Fett declares him and Carrick even while also thanking the former Jedi for dealing with Demagol. Golliard is interrogated as to Chantique's location by Carrick and Karath, and Carrick learns that Chantique went to Osadia after a Force vision."}, {"tag": "p", "text": "On Osadia, Jarael defeats the Dashade guards around the school while Wyrick infiltrates the building and interrogates Bar'injar as to the location of his students; when he fails to gain any useful information, he returns to Jarael, and she is shocked to witness him execute the fallen Crucible agents in cold blood before resuming the search. Meanwhile, Carrick calls in another favor—Captain Telettoh of the Testament gives him, Hierogryph, and Dyre a lift to Osadia. Hierogryph also confronts Carrick about his relationship with the Force, as the Snivvian has become highly suspicious of Carrick's luck, and Carrick explains what he has come to realize: his control of the Force causes fate to \"rock back and forth\" between good and bad, causing good events to spiral out of bad events and vice-versa, and he has developed a better control over the ability since Vindication. While searching the training hall on Osadia, Jarael encounters Chantique and the two begin to battle, and as Jarael gains the upper hand she prepares to execute the Zeltron. However, the Testament has arrived by that time, and Dyre carries Carrick by jetpack over the school and drops him into the training hall just in time for Carrick to land on top of Jarael. Chantique seizes Exar Kun's lightsaber and attacks Carrick, and she demands to know why he continues to defend Jarael despite what she had told him on Volgax."}, {"tag": "p", "text": "Carrick refuses to believe Chantique's lies and informs her that her father is at the school; at the same time, Dyre attacks Demagol in another part of the school, but the scientist is astonished when he is able to throw Dyre off of him with simply a flick of the hand. Carrick quickly explains to Jarael that Demagol is Wyrick and warns her about the dark power of Kun's weapon, but he is surprised when she is unable to sense anything from the lightsaber—though the same cannot be said for Chantique, whose powers are bolstered by the weapon. However, Chantique is surprised by a knife to the back from Wyrick, who ignores his daughter's pleas and demands to see his students. Wyrick rushes out into the schoolyard, but Chantique explains that they were actually in the schoolyard: she had buried them alive one by one over the years. Wyrick rouses himself from his despair when he realizes that he could continue his project using Jarael, but Carrick reveals that Jarael is completely lacking the Force—and Dyre emerges from the school to explain the truth: Wyrick and his daughter had been Force-sensitive all along. Wyrick has little time to process this revelation, however; Chantique attacks him with a knife, prompting him to reach for Carrick and Kun's lightsabers nearby. To both their surprise, Kun's lightsaber is the one that reaches Wyrick first, and the double-bladed lightsaber impales both father and daughter."}, {"tag": "p", "text": "Days later, Carrick has returned Kun's saber to the Jedi, and in celebration of the anniversary of the day that he and Jarael met, he introduces Jarael to her long-lost parents, who he and Dyre had managed to locate. However, Dyre disappears moments afterwards, and Carrick and Jarael assume that he has returned to his quest for answers. The next night, Carrick is called to Goodvalor's Little Bivoli by Hierogryph, who explains that he and Slyssk will take up the management of their new restaurant chain, while Carrick decides to continue work with the Rogue Moon Project. Before Carrick leaves, though, Hierogryph directs him to table seventeen, where Jarael is waiting to have dinner with him. After thanking him for locating her parents, Jarael kisses him, and the two begin to dance as they start an official relationship."}, {"tag": "h2", "text": "Main characters"}, {"tag": "h3", "text": "Crew of The Last Resort, the Moomo Williwaw, and the Hot Prospect"}, {"tag": "p", "text": "The Jedi Padawan Zayne Carrick and the criminal Marn Hierogryph are accused of the Padawan Massacre on Taris, and in their efforts to clear their name, the two gain a number of allies from all walks of life. Hierogryph, Carrick, the warrior Jarael, the mechanic Camper, and the loading droid T1-LB make up the crew of the junk-hauler The Last Resort, and the group has a number of adventures together. In the process, they gain allies in the Trandoshan ship thief and cook Slyssk, who steals the mess ship Little Bivoli for Carrick and Hierogryph, the Jedi Knight Alek, the Mandalorian Rohlan Dyre, Carrick's friend Shel Jelavan, and the Ithorian bounty hunters Dob and Del Moomo. Camper takes The Last Resort off into space along with the exogorths, and the group uses the Moomo Brothers' ship, the Moomo Williwaw, as their base for a time. After Carrick and Hierogryphs' names are cleared following Vindication, the crew acquires the Calipsan 560 mining ship Hot Prospect, which served as the headquarters of Carrick and Hierogryph's joint venture Cargryph Capital Management."}, {"tag": "h4", "text": "Zayne Carrick"}, {"tag": "p", "text": "One of five children and the only son of Arvan and Reiva Carrick, Zayne Carrick is a young Jedi Padawan who is known for his awkward grasp of the Force and all-around clumsiness, though he later realizes that his ability allows him to manipulate the progression of events in his favor. The Padawan of Jedi Master Lucien Draay, Carrick finally managed to capture the criminal Marn Hierogryph on the day that he and the five other Padawans on Taris were to be Knighted, but when he arrived at the Jedi Tower, he found the Masters standing over the bodies of his best friend Shad Jelavan and the other three apprentices. Going on the run with the Snivvian Hierogryph, Carrick is framed for the murders of the Padawans, and the duo enlist the help of the Arkanian Offshoots Camper and Jarael in their efforts to get off-planet. Carrick learns of the Rogue Moon Prophecy from the damaged droid Elbee and decides to turn himself in to the Masters, but Jarael and the others rescue him from the Tower and go on the run with him in Camper's ship, The Last Resort. At Hierogryph's suggestion, Carrick also warns the Masters that the first to confess will live. As Hierogryph's \"henchman,\" Carrick works with the rest of the group to pull off cons, though they are caught up in the Mandalorian Wars when Jarael is captured on Vanquo, and with the help of Rohlan Dyre Carrick and the others rescue Jarael and a number of Jedi from Flashpoint. After the group frees Zayne's father Arvan from the Moomo Brothers on Telerath, they go their separate ways, and Carrick ends up working for Hierogryph at the Little Bivoli on Serroco—but he foresees the bombardment of the planet by the Mandalorians, and his attempt to warn Admiral Karath fails when Karath ignores and then imprisons him."}, {"tag": "p", "text": "Carrick helps Karath and Carth Onasi escape from Karath's doomed Courageous, and becomes caught up in Lord Arkoh Adasca's power grab. Imprisoned with Lucien Draay aboard the Arkanian Legacy, Carrick works with his former teacher to escape and bring down Adasca's auction of the weaponized exogorths. Carrick is then called to Taris, where he infiltrates the Mandalorian occupation and meets up with Hierogryph—and, to his surprise, Raana Tey and Shel Jelavan. Carrick is able to reconcile with Jelavan as they work together with Raana Tey to destroy the Mandalorian command post in the Jedi Tower; however, a crazed Tey attacks Carrick and tries to kill him in the Tower. Carrick tries to save Tey, and though he fails, he learns the name of the Covenant's leader. Not long afterwards, Hierogryph and Carrick become caught up in the Covenant Shadow's mission to retrieve the Muur Talisman, and when the Talisman takes control of Morne, Carrick works to save the lives of everyone he can, including Morne and the Mandalorians. Carrick seals Morne in Dreypa's Oubliette to save her from the Talisman, though not before she gives Carrick her key to the Sanctum of the Exalted. His efforts to acquire proof of the Covenant's wrongdoings results in the death of Feln, and Carrick's friends join together to help him get to Coruscant. With the help of the Covenant Jedi Xamar, Carrick tries to evacuate Krynda Draay from the Draay Estate, but is caught up in Haazen's grab for power during Vindication. Carrick helps his former master defeat Haazen, and the Jedi Council clears Hierogryph's and Carrick's names, but Carrick refuses their offer of Knighthood to go into business with the Snivvian."}, {"tag": "p", "text": "Carrick spends the next month setting up the Rogue Moon Project with the families of the other Padawans, and he returns just in time to save his friends from the vengeful Nunk Plaarvin after a con goes wrong on Metellos 3. After an encounter with the \"Corellian Strangler\" Toki Tollivar, Carrick is excited to visit Jervo's World and see the swoopdueling arenas. He enters the Tandem Open in order to win a limited edition swoop, but he is forced by Goether Kleej into helping his son Aubin survive the swoopdueling championship. Carrick convinces Kleej to accept the help of he and his friends, but when they free the Kleejs and bring down the Franchise entertainment firm, Carrick learns of Jarael's secret past as a slaver. Carrick eventually convinces Jarael that their group could do damage to the operations of the Crucible; their first effort sees the group rescue a group of slaves from a comet-mining operation in the Deep Core, and Carrick then allowed himself to be captured by the Crucible in an effort to locate their operations. However, Carrick greatly underestimates the Crucible: the Crucible's overseer Chantique takes pleasure in torturing Carrick and destroying his perceptions of Jarael. At the trial of Demagol, Carrick and his friends realize that the real scientist has switched places with Rohlan Dyre, and Carrick enlists the aid of the Rogue Moon Project and calls in every favor he is owed in order to locate Jarael and the real Demagol. Tracking them to Osadia, Carrick rescues Jarael, and in the aftermath of Demagol and Chantique's deaths, he begins a relationship with Jarael."}, {"tag": "h4", "text": "Marn Hierogryph"}, {"tag": "p", "text": "Marn \"Gryph\" Hierogryph, also known by various aliases such as Baron Hieromarn and Professor Gryphomarn, is a Snivvian conman who is active on Taris before he is caught up with Carrick in the Padawan Massacre. Carrick and Hierogryph try to make their way off planet and uncover the truth behind the Massacre, and though Carrick surrenders to the Masters, Hierogryph returns to save Carrick and enlists him as his henchman. After a plan to access Hierogryph's frozen accounts on Telerath is complicated by the Moomo Brothers' kidnapping of Carrick's father, Carrick and Hierogryph hire the ship thief Slyssk to steal them a new ship—and when Slyssk tries to force the Snivvian into paying more, the duo trick the Trandoshan thief into swearing a life debt to Hierogryph. With Slyssk as a cook, Hierogryph operates the Little Bivoli on Serroco until Slyssk saves their lives and half a battalion by commandeering a ship just before Mandalore the Ultimate's bombarmdent of the world. To Hierogryph's surprise, the Republic turns him into the propaganda figure Captain Benegryph Goodvalor, and he is later hired by Jervo Thalien to locate Senator Goravvus on Taris—but he is horrified to learn that the case that he has been carrying for Thalien is in fact a bomb meant for Goravvus that ultimately fails to activate."}, {"tag": "p", "text": "Hierogryph kills the Jedi Master Raana Tey by detonating explosives on the Jedi Tower when he mistakenly believes the Togruta Jedi is trying to kill Carrick; the duo later find themselves tagging along with Celeste Morne on her quest to recover the Muur Talisman, and Hierogryph helps Carrick acquire evidence against the Covenant on Odryn. While there, Hierogryph also accidentally ensures the death of the Covenant member Feln, unknowingly continuing the Rogue Moon Prophecy. During Vindication, Hierogryph releases Krynda Draay from her torturous imprisonment in an oubliette, though her death not long afterwards causes Lucien Draay to target the Snivvian in revenge. To his surprise, Carrick and Draay manage to con even him and stage a fight that sees the death of Haazen and the madman's plans for domination; he is again surprised when Carrick forgoes readmission to the Jedi Order so that he can go into business with Hierogryph. Hierogryph pulls off a number of cons with the aid of Jarael, Carrick, and Rohlan Dyre, though he is furious when Carrick and Jarael trick him into aiding their efforts to sabotage the operations of the Crucible. Hierogryph and Carrick later realize that \"Dyre\" is in fact the Mandalorian scientist Demagol, and Hierogryph helps Carrick locate and rescue Jarael from Demagol's clutches. He acquires the licensing rights to Benegryph Goodvalor not long afterwards, and goes into business with Slyssk as the owners of the Goodvalor's Little Bivoli restaurant chain."}, {"tag": "h4", "text": "Jarael"}, {"tag": "p", "text": "Jarael is an Arkanian Offshoot who was born Edessa, the daughter of two of the researchers on Antos Wyrick's New Generation Project on Osadia. Edessa was captured by the Crucible, and she earned the name Jarael—\"Protector\" in the language of the Crucible—when she overthrew Chantique as overseer and worked to make the lives of her fellow slaves easier. Jarael eventually escaped the Crucible with the help of the elderly Offshoot Gorman \"Camper\" Vandrayk, who himself was on the run from Adascorp. Perero, as Jarael called him, settled with Jarael on the planet Taris, where they lived until they are uprooted by the arrival of the fugitives Zayne Carrick and Marn Hierogryph. Jarael initially dislikes Carrick, who she blames for the rioting that erupts after the Massacre, but she eventually comes to like him and, with the help of Camper and Hierogryph, Jarael rescues Carrick from the Jedi Tower and goes on the run with him. Jarael is captured by Mandalorians while masquerading as a Jedi on Vanquo, leading the others to ally with Rohlan Dyre to rescue her from the Mandalorian scientist Demagol on Flashpoint. A capable warrior, Jarael defends Camper from the Moomo Brothers while the group is on Telerath, though she and Camper part ways with Hierogryph and Carrick not long afterwards—and she and Camper are joined by Dyre, who rescues the two from an HK-24 assassin droid aboard The Last Resort. Jarael attracts the attention of Adascorp while searching for a cure for the increasingly ill Camper, but unbeknownst to her, Camper is quickly healed by the company and force to resume his work for them as Lord Adasca threatens Jarael's life. Jarael is horrified when Adasca reveals the exogorths to her, but she is freed from Adasca's clutches thanks to Carrick and his allies—only to watch as Camper disappears into the unknown with the exogorths, leaving her behind."}, {"tag": "p", "text": "Dyre takes an interest in Jarael's skills in the coming weeks, as does Alek, who attempts to pursue a romantic relationship with her. Jarael masquerades as Celeste Morne on Odryn, and after Vindication, she continues to work alongside Hierogryph and Carrick as they pull off cons. During an adventure on Metellos 3, Jarael seemingly exhibits Force powers, though she is reluctant to accept training from Carrick despite Dyre's insistence. Jarael's past as a slaver comes back to haunt her not long after Vindication, and she confesses the truth to Carrick after Goethar Kleej recognizes her tattoos as those of the Crucible. After Carrick rescues her from Malak's advances, she agrees to work with him to take down the Crucible, and they rescue a group of slaves in the Koornacht Cluster—but their actions attract the attention of Chantique. After Carrick goes undercover, Jarael is hurt and angry that he would believe Chantique's lies about her past. However, she is ecstatic when \"Dyre\" reveals himself as Antos Wyrick, her former teacher, and she joins Wyrick in his mission to rescue the other students from the ruined Osadia School. Wielding the lightsaber of Exar Kun, Jarael battles Chantique before the arrival of Carrick, who reveals that Jarael is not Force-sensitive at all—Wyrick was the one with the Force all along. Chantique and her father Wyrick are killed by Wyrick's attempt to kill his daughter with Kun's saber, and in the days that follow, Jarael is overjoyed when Carrick manages to track down her missing parents. On the first anniversary of the day they met, Jarael and Carrick finally acknowledge their mutual feelings for each other and begin dating."}, {"tag": "h4", "text": "Camper"}, {"tag": "p", "text": "Gorman Vandrayk, better known as Camper, is an eccentric and elderly Arkanian Offshoot who is a technological genius on the run from his former employers at Adascorp. Together with the young Offshoot Jarael, Camper settled in the Lower City of Taris on the junk hauler Last Resort, but Camper's mind slowly slipped away over the years. Camper and Jarael's life of seclusion ends when they are caught up in the wanted fugitives Marn Hierogryph and Zayne Carrick's attempt to get offworld; Hierogryph comes to Camper for help, and the four are forced to take off in The Last Resort when the authorities locate the two fugitives. Camper and Jarael remains fiercely protective of each other, with Jarael calling Camper \"Perero,\" or \"honored elder,\" and Camper helps the group in their efforts to gain access to Hierogryph's account on Telerath —but by doing so, Camper exposes himself to Adascorp. Camper continues to suffer from dizzy spells and a mysterious illness until Jarael takes him to Adascorp, which soon heals him of the problem: spores and other particles in the vents of The Last Resort. With Jarael's life in the balance, Camper is pressed into service by Lord Arkoh Adasca to complete his work weaponizing exogorths, but when Carrick and his friends manage to rescue Jarael, Camper promptly turns the tables on Adasca. Seizing control of the exogorths, he kills Adasca by destroying the Arkanian Legacy, and despite Jarael's protests, he departs for unknown space aboard The Last Resort with the exogorths following him, as he intends to remove their hyperdrives and then ensure they will not be found again."}, {"tag": "h4", "text": "T1-LB"}, {"tag": "p", "text": "T1-LB, better known as Elbee, is a LB-series bulk-loading droid who is in the employ of the Jedi on Taris until the Jedi Masters experience the Rogue Moon Prophecy. Upon realizing that Elbee overheard them, Draay destroys the droid with the Force, and the experience severely damages Elbee's brain. When Carrick recovers him from the Rogue Moon, Camper installs a holographic memory and a higher processor, but Elbee deletes the memory of his own death after he plays it back for Carrick and the others. The bulk loader droid remains with the group aboard The Last Resort, though the only way that he can be motivated to action is through the mention of Lucien Draay. Elbee is saddened by the departure of The Last Resort, and he remains silent and unmoving on both the Moomo Williwaw and the Hot Prospect during most of the group's travels. Carrick tries to reach out to Elbee, and the droid finds a friend in K-OB7, who he defends when K-OB7 is accused of being the Corellian Strangler. At Demagol's trial, Elbee shocks the others by revealing that the \"Rohlan Dyre\" they have been traveling with is not the same Rohlan Dyre that they first met; when asked why he never said anything, the droid simply responds by saying that he was never asked."}, {"tag": "h4", "text": "Slyssk"}, {"tag": "p", "text": "Slyssk is a Trandoshan ship thief who, unlike most of his species, is neurotic and takes no pleasure in hunting. He failed as a pirate and became a ship thief, and when he tried to muscle Marn Hierogryph into paying more for the Little Bivoli then they originally agreed, Carrick and Hierogryph trick Slyssk into swearing a life debt to the Snivvian conman. Slyssk's cooking skills are put to use as the cook for the Little Bivoli, but when Serroco is attacked by the Mandalorians, the panicking Trandoshan seizes Hierogryph and commandeers a Republic ship. In doing so, Slyssk manages to save half a Republic battalion, and he and Hierogryph are made into propaganda figures by the Republic as a result. After the loss of the Moomo Williwaw prior to Vindication, Slyssk is sent to buy a new ship for the group, but he is scammed into buying the aging gem miner Hot Prospect. Hierogryph decides to task Slyssk with cleaning the ship as punishment for his mistake, though the Trandoshan proves vital in Carrick and Hierogryph's ploy to free Jarael and Rohlan Dyre from Nunk Plaarvin. After Carrick rescues Jarael from Demagol on Osadia, Slyssk goes into business with Hierogryph as the owners of Goodvalor's Little Bivoli."}, {"tag": "h4", "text": "Rohlan Dyre"}, {"tag": "p", "text": "Rohlan Dyre, also known as Rohlan the Questioner, is a Mandalorian Crusader who fought in the early skirmishes of the Mandalorian Wars. A skilled warrior and leader, Dyre grew suspicious of Mandalore the Ultimate's motives in instigating the Mandalorian Wars, and when his questions went unanswered, Dyre refused to fight. He was placed on the front lines repeatedly, and each of the five times he tried to escape, he was captured and sent back into battle. On Vanquo, \"the Questioner\" successfully manages to escape with The Last Resort, and after being captured by the ship's crew, he offers himself as a guide and allies with Carrick and the others in their efforts to rescue Jarael from Flashpoint. Dyre proves essential in her rescue, but unbeknownst to the others, Dyre is later overpowered and drugged by the Mandalorian scientist Demagol, who exchanges armors with Dyre and takes his place. Still in a drug-induced coma, Dyre is taken to Coruscant, where he finally stands trial once he awakens several months later. \"Demagol\" is rescued from his trial by Carrick and Hierogryph, who recruit Dyre in their efforts to once again rescue Jarael—this time from Demagol. After Demagol's death on Osadia, Dyre later vanishes, leading his friends to believe that the Mandalorian has returned to his quests for answers."}, {"tag": "h4", "text": "Squint"}, {"tag": "p", "text": "Alek, known by his friends as Squint, is a headstrong young Jedi who is one of the Revanchists, a group of Jedi who seek to involve the Order in the Mandalorian Wars. Squint's best friend is the Jedi known as the Revanchist, the leader of their movement, and Squint first meets Zayne Carrick when he saves Carrick's life on Taris shortly before the Massacre. Carrick does not learn Squint's real name, and Squint is captured on the planet Suurja not long afterwards, leading to Squint's imprisonment on Flashpoint. Squint and the other Jedi are rescued by Carrick and his friends when they come to rescue Jarael, and Alek returns to Coruscant with who he believes is Demagol. Because Carrick does not know Alek's real name, his attempts to use Squint as a reference when accused of being a spy by Admiral Karath are laughed down. Alek is sent as the Revanchists' representative to Arkoh Adasca's auction, and he proves essential in rescuing Jarael from Adasca's clutches, though Alek has begun to stray from Jedi teachings—he attempts to pursue a relationship with Jarael, and is fascinated by the power of the Muur Talisman. Squint adopts the name Malak in order to avoid an arrest warrant issued by Lucien Draay, and he and the Revanchists are later given permission to join the Mandalorian Wars after the massacre of the Cathar species is discovered. He visits Jarael and tries to woo her, but Carrick rebuffs his advances on Jarael's behalf by claiming that they are in a relationship; a disappointed Malak returns to the front without her."}, {"tag": "h4", "text": "Shel Jelavan"}, {"tag": "p", "text": "Shel Jelavan is the sister of Shad Jelavan, Zayne Carrick's best friend and one of the Padawans who were slain in the Massacre. Jelavan, with whom Carrick had a burgeoning relationship before the Massacre, believes that Carrick was responsible for her brother's death, and she wears Shad's lightsaber crystal around her neck as a reminder. Raana Tey manipulates Jelavan on Taris; she shoots Carrick upon first encountering him when the failed Jedi arrives at the Taris Resistance base, and she later informs him that she used the money he sent her to put out a bounty on him. Tey tries to get Jelavan to kill Carrick with her brother's lightsaber during their mission to destroy the Jedi Tower, but Carrick's clear regret about Shad's death and his insistence that he is innocent leaves Shel unable to cut him down. When she overhears Raana Tey admit to the Massacre, Jelavan stabs the Togruta Jedi with her brother's lightsaber, and she escapes with Carrick as the Jedi Tower is destroyed. Jelavan joins Carrick's crew for a time, but after Vindication, she starts working for Senator Goravvus and helps Carrick found the Rogue Moon Project; Jelavan's influence is later instrumental in Carrick's plan to rescue Jarael from Demagol."}, {"tag": "h4", "text": "Moomo Brothers"}, {"tag": "p", "text": "The Moomo Brothers are a pair of Ithorian bounty hunters, Dob and Del Moomo, who are known for their stupidity and violent natures. The brothers were hired by Raana Tey to keep watch on Arvan Carrick, Zayne's father, but the brothers decided to kidnap the banker and keep him in their ship so they could watch him. When he locates their ship, Zayne sets the Moomo Brothers against each other, and he escapes with his father while the two Ithorians are fighting each other. The Moomo Brothers team up with Hierogryph and Slyssk after the Battle of Serroco, and Dob and Slyssk rescue Carrick and his friends from the Arkanian Legacy in the Moomo Williwaw. The Moomo Brothers remain largely loyal to Hierogryph and Carrick's gang, though Del does try to claim a bounty on Senator Goravvus, and the Moomo Williwaw serves as the group's base for a time, with the brothers and the rest of the group using the ship to rescue Hierogryph and Carrick from Jebble. The two help Carrick's friends recover Sith artifacts from Odryn, and when Feln destroys the artifacts that Carrick has gathered, the brothers' greed saves the day: they had stolen a caseful of artifacts before the Sanctum's destruction. The Moomo Brothers, along with Jarael and several of Carrick's friends, then sacrifice the Moomo Williwaw as a distraction so that Carrick can bypass Admiral Karath's blockade."}, {"tag": "h3", "text": "The Jedi Covenant"}, {"tag": "h4", "text": "Lucien Draay"}, {"tag": "p", "text": "Lucien Draay is the son of two Jedi: the warrior Barrison Draay, who was slain during the Great Sith War, and the half-Miraluka seer Krynda Hulis. When Lucien failed to inherit his mother's foresight abilities, instead developing into a warrior like his father, Krynda lost interest in her son and devoted her time to the Jedi Covenant, though Haazen was able to convince Krynda to allow Lucien to serve as the Covenant's head of security and the Executor of the First WatchCircle. Draay is the Jedi Master of the bumbling Zayne Carrick, and after the WatchCircle experiences the Rogue Moon Prophecy, Draay promises to contact Coruscant; Haazen tells Draay to bring the Padawans to Coruscant, but because the prophecy foretold his mother's death, Draay lies to the others and they go ahead with the Massacre. After Carrick escapes Taris, Draay oversees the Covenant's search for the rogue Padawan despite the Circle's separate postings, and as Carrick continues to elude them, Draay begins a relationship with Q'Anilia. Unbeknownst to Draay, he is being manipulated by Haazen for the failed Padawan's own ends. In his pursuit of Carrick, Draay becomes caught up in the Adasca affair and is forced to work with his former student to put an end to Arkoh Adasca's plans. Thanks to Haazen's manipulations, Draay is elevated to the High Council, but he is horrified when Haazen instigates Vindication—using Draay's access to the High Council in order to make it possible. Despite his anguish, Draay refuses to allow Carrick or Hierogryph near his mother, and Lucien is horrified and anguished when Krynda dies in his arms—but Carrick is finally able to reach his former Master and convinces him to work together against Haazen. With Carrick's help, Draay is able to acquire Haazen's controls for the Republic fleet above Coruscant, and he uses them to destroy the Draay Estate with both him and Draay still in the compound. Draay survives thanks to the Gauntlet of Kressh the Younger, but he is blinded and scarred, and he chooses to establish a new Covenant based on the teachings of both of his parents on a remote moon."}, {"tag": "h4", "text": "Q'Anilia"}, {"tag": "p", "text": "Q'Anilia is a Miraluka who was brought to Krynda Draay as a child, and she had foreseen that Draay would ask to see her despite having turned away all others before her. A talented seer, Q'Anilia became a kind of surrogate daughter to Krynda Draay, who neglected her own son Lucien in order to focus her attentions on Q'Anilia and three other young seers: Feln, Raana Tey, and Xamar. Q'Anilia and Lucien had a tense relationship during their youth and early careers as part of the First WatchCircle, and Q'Anilia taught the promising young Human Shad Jelavan as her Padawan on Taris before she foresaw a storm approaching in the Force. Q'Anilia's premonition led Draay to arrange for the WatchCircle's visit to the rogue moon, where the four seers experienced the Rogue Moon Prophecy in which Q'Anilia witnessed her own death after discovering Krynda Draay dead in the Draay Estate. Q'Anilia reluctantly agreed to the Massacre, which the Covenant intended to blame on Jelavan, and joined the rest of the WatchCircle in pursuing the fugitive Carrick. In the weeks that followed Carrick's escape from Taris, Krynda Draay's aide Haazen manipulates Lucien into beginning a relationship with Q'Anilia for his own amusement, and Q'Anilia's sanity gradually degrades as a result of their relationship and guilt. As Raana Tey and Feln meet their ends as the prophecy foretold, Q'Anilia becomes more and more unstable, and her condition is a major factor in motivating Xamar to turn against the Covenant. Amid the chaos of Vindication, Haazen proclaims the blind Miraluka to be the one for the light who stands in the darkness, and Q'Anilia rushes to locate her beloved Krynda as the Draay Estate is under assault. Upon discovering Draay seemingly dead in an oubliette, Q'Anilia drinks poisoned wine just as she foresaw in order to be with her mentor; however, as she dies, Q'Anilia is astonished to learn that the Rogue Moon Prophecy in fact applied to Carrick's Snivvian criminal ally, Marn Hierogryph—who discovers mere moments after the Miraluka's death that Draay is still alive."}, {"tag": "h4", "text": "Xamar"}, {"tag": "p", "text": "The Khil Xamar is a Jedi Master and seer, and member of the Covenant's First WatchCircle who also served for a time with the Republic Navy. In addition to teaching his Padawan Oojoh on Taris, Xamar also searched for the Muur Talisman before the Rogue Moon Prophecy, which foretold his death by friendly fire at the hands of the Republic Navy. Xamar is initially reluctant to execute the Padawans, but he carries out the Massacre alongside his fellow Jedi, and he joins the rest of the Circle in their pursuit of Carrick when he escapes. Xamar grows more and more uncomfortable with their actions as the weeks pass and both Raana Tey and Feln are killed; he witnesses Q'Anilia grow mentally unstable as a result of her relationship with Lucien Draay, and despite his misgivings, he agrees to oversee Admiral Karath's blockade of Coruscant to halt Carrick's arrival. When he tries to warn Karath that Carrick achieves his goals through misdirection, the admiral suggests that Xamar take a fighter out and join the battle, but the Khil foresees Carrick's plan to crash his ship into the Swiftsure and steal another ship—so Xamar stows away on that ship and captures Hierogryph and Carrick when they reach Coruscant. However, he agrees to confess to the Jedi Council in return for immunity for Kyrnda Draay, and he helps Carrick and Hierogryph infiltrate the Draay Estate so that they can lower its defenses and evacuate Krynda. During the battle, Haazen turns Karath's blockade against the Jedi attackers, targeting the bridge to the Draay Estate, and Xamar is slain by friendly fire from the Republic ships."}, {"tag": "h4", "text": "Feln"}, {"tag": "p", "text": "Feln is a Feeorin Jedi Master, one of the few members of his species to become a Jedi at the time, and he is a Jedi Consular and seer like Xamar, Raana Tey, and Q'Anilia. On his homeworld of Odryn, Feln held the rank of Exalted, or leader and elder, of his tribe; he retained his position even after the Jedi Order visited Odryn and recognized Feln's \"magic\" as Force-sensitivity. As a member of the Jedi Covenant, Feln flouts his people's sacred code, the Rime Feeorin, by allowing the Covenant to store Sith artifacts in the sacred building known as the Sanctum of the Exalted. Feln foresees his death on Odryn holding a stick instead of his lightsaber during the Rogue Moon Prophecy, and he kills his apprentice Oojoh as part of the Massacre. Feln heads to Odryn to meet with Celeste Morne, but instead finds Carrick and Hierogryph captured by his tribe, and Draay urges Feln to destroy the Sanctum in order to prevent Carrick from acquiring the artifacts. Feln is forced to fight Carrick in unarmed combat due to the Rime Feeorin, but when he learns of the return of Carrick's friends, he detonates the explosives under the Sanctum—only to watch in horror as the Sith artifacts magnify the explosion, wiping out his village. Feln finds only a stick in place of his lightsaber when he tries to kill Carrick, and Feln's tribe turns on their Exalted and kill him for destroying their village."}, {"tag": "h4", "text": "Raana Tey"}, {"tag": "p", "text": "Raana Tey is a Togruta Jedi Master who is a member of the Jedi Covenant's First WatchCircle, having been recruited as a child when she began experiencing terrifying Force visions while sleeping. Tey had a reputation for being particularly intense and wild in combat, but despite this, she is fiercely loyal to the Covenant and felt a tremendous amount of guilt over the murder of her apprentice Kamlin. In the weeks that follow the Massacre, Tey's nightmares grow steadily worse and push her to the brink of insanity; she becomes determined to kill Carrick in the belief that it will end her visions. Tey hires the Moomo Brothers to keep watch on Zayne's father Arvan Carrick, though the two foul up the mission, and she is sent by the Supreme Chancellor to protect Senator Goravvus while Taris is under occupation by the Mandalorians. Tey's part of the Rogue Moon Prophecy foresaw her death in the Jedi Tower at the hands of Mandalorians and Sith—and despite her efforts to manipulate Shel Jelavan into killing Carrick, the Togruta is unable to eliminate the failed Padawan when she attacks him in the Tower. Carrick's offer to save her rouses Tey from her madness, but when she tries to slice off her hand that is trapped in the Tower's glass roof and thus escape with Carrick, Hierogryph thinks she is attacking Carrick and detonates the explosives set on the building. With her last words, Tey gives Carrick the name of the Covenant's leader, Krynda."}, {"tag": "h4", "text": "Haazen"}, {"tag": "p", "text": "Haazen is a failed Padawan whose family has been the servants of the Draay family for decades. Haazen grew up with Barrison Draay and was permitted to study along with Barrison under Arca Jeth, though Haazen's control over the Force was awkward and his attempts to capture the Nautolan pirate Dossa continually met with failure. Haazen had feelings for Krynda Hulis, but she began a relationship with Draay, and Haazen was furious when Arca Jeth Knighted Draay and Hulis but not him. Draay and Hulis were married, and Haazen continued to serve as Draay's page as the Jedi served in the Great Sith War, but Haazen was convinced by Dossa—now an agent of the Sith—to lure Draay's Jedi into a trap. However, Haazen was caught in the explosion that killed Draay, and Dossa and the Sith doctor Uburluh reconstructed his body with crude prosthetics and Sith artifacts such as the Yoke of Seeming. After killing Dosa, Haazen became Krynda Draay's servant and helped her construct the Jedi Covenant, though he manipulates the organization for his own ends, and he also convinced Krynda to allow her son Lucien to serve as the Executor for the First WatchCircle."}, {"tag": "p", "text": "When Lucien contacts him about the Rogue Moon Prophecy, Haazen orders him to bring the Padawans to Coruscant, but Lucien ignores the order, and Krynda has a stroke after foreseeing the Massacre. It is then that Haazen makes his move—instead of getting medical aid, he seals Krynda in an oubliette and assumes leadership of the Covenant in her name. Continuing his manipulations, Haazen ensures Lucien Draay's ascension to the High Council, and he also strives to preserve the Covenant's store of artifacts for his own benefit. When the Jedi Order launches their attack on the Draay Estate, Haazen initiates Vindication: a pre-planned insurrection against the Jedi. Revealing his intentions to Q'Anilia, Draay, Hierogryph, and Carrick, Haazen believes that he is fulfilling the Prophecy of the Five, and that Carrick and Draay will lead his armies of Jedi and Sith. With the Gauntlet of Kressh the Younger protecting him from harm and control over the Vanjervalis Chain-linked ships above Coruscant, Haazen acquires more Sith artifacts, but he is ultimately defeated by Carrick and Draay, who run a con on their opponent that sees Carrick cut off the Gauntlet. Haazen is then killed by Draay when the Jedi uses the controls for the Vanjervalis Chain in the Gauntlet to target the Draay Estate with the blockade's firepower."}, {"tag": "h4", "text": "Krynda Draay"}, {"tag": "p", "text": "The daughter of a Human woman and the Miraluka Jedi Master Noab Hulis, the Jedi seer Krynda Draay was born Krynda Hulis, and she studied under Master Arca Jeth in the years before the Great Sith War alongside Barrison Draay and Haazen. Krynda did not reciprocate Haazen's feelings for her, instead pursuing a relationship with Barrison, who she later married. Krynda was later Knighted and studied under Master Vodo-Siosk Baas, but when Baas and her husband were both killed in the Great Sith War, she fell into depression that saw her neglect her son Lucien. Draay later founded the Covenant after she foretells the Prophecy of Five and discovers four Jedi seers: Q'Anilia, Raana Tey, Xamar, and Feln. She reluctantly allowed her son Lucien to join the four as the fifth member of the First WatchCircle at the advice of her attendant Haazen. However, when Draay foresees the Padawan Massacre, she suffered a stroke before she could contact her son, and Haazen locks her in a Sith oubliette as he took control of the Covenant. Draay is released from the oubliette by Hierogryph during Vindication, and when she dies shortly afterwards, her death enrages her son Lucien."}, {"tag": "h4", "text": "Celeste Morne"}, {"tag": "p", "text": "Celeste Morne is a Jedi Shadow of the Covenant, one of the Covenant's elite secret operatives who is tasked with the retrieval of Sith artifacts across the galaxy. When the First WatchCircle has a vision of the Muur Talisman, Lucien Draay dispatches the talented Morne to Taris, where she encounters Zayne Carrick and Marn Hierogryph. The two become caught up in Morne's mission to retrieve the Muur Talisman, a mission that takes them to the planet Jebble, where Carrick tries to enlist Morne's aid in warning the Republic about a planned Mandalorian attack on Alderaan. When the rakghoul plague begins to spread, the two escape from the Jebble citadel and Morne learns Carrick's side of the story about the Padawan Massacre. The Jedi Shadow comes to doubt whether Carrick is truly capable of doing what the Covenant accuses him of, and she finds herself unable to carry out Draay's orders to kill Carrick when she witnesses him contact Cassus Fett in an effort to save Mandalorian lives and also risk his own to rescue his friend Hierogryph. Morne saves Carrick from the Muur Talisman by sacrificing herself to become its host, but the spirit of Karness Muur overwhelms her and she becomes intoxicated with the power of the artifact. When Carrick brings her to her senses, she begs him to kill her, but Carrick opts to seal her in Dreypa's Oubliette to save her life and contain the power of the talisman. Morne gives him her key to the Sanctum of the Exalted, and he hopes to take the oubliette to the Covenant's researchers on Odryn to free her, but Cassus Fett's bombardment of Jebble sees the oubliette lost beneath the surface of Jebble's oceans. Jarael later masquerades as Morne in order to gain entry to the Sanctum for Carrick and the rest of their group, though Morne and the oubliette remain undiscovered for almost four thousand years."}, {"tag": "h3", "text": "The Republic"}, {"tag": "h4", "text": "Saul Karath"}, {"tag": "p", "text": "Captain Saul Karath of the Republic Navy is One of the ranking officers of the Republic fleet at Vanquo, and upon identifying the fleeing Last Resort as the ship of Zayne Carrick, Karath wrongfully assumes that Carrick is a Mandalorian spy when The Last Resort heads into Mandalorian space. Promoted to admiral, Karath later ignores Carrick's warnings about the Mandalorian attack on Serroco, arresting him as a Mandalorian spy, and when Carrick's warning proves true, Karath is unable to prevent the bombardment of the planet. The furious admiral locks Carrick in the brig anyway and contacts Lucien Draay to arrange a transfer, but the Mandalorian attack on Karath's flagship Courageous sees Karath forced to accept Carrick's help in escaping the doomed ship. Karath is called to Arkoh Adasca's auction of the exogorths as the Republic's representative, though Karath's offers are outclassed by Mandalore the Ultimate's proposals. The negotiations are disrupted by Carrick and Lucien Draay, and Karath manages to escape the dying Arkanian Legacy and return to Coruscant, but his resignation over the loss of the Courageous is refused by the Republic Navy and he is eventually given command of the Swiftsure. Lucien Draay commands Karath to oversee a blockade of Coruscant to prevent Carrick from reaching the capital, though the blockade ultimately fails. Karath's blockade is subsequently commandeered by Haazen, who overrides the Vanjervalis Chain programming and takes control of the ships. Several months later, Karath follows an anonymous tip given by Carrick, and despite his anger at being used, he is pleased to be able to capture Dace Golliard of the Crucible."}, {"tag": "h4", "text": "Carth Onasi"}, {"tag": "p", "text": "Carth Onasi is an officer in the Republic Navy from the planet Telos IV who is the protege of Saul Karath. One of his earliest postings was on an orbital watch station above the planet Serroco, where for a time he and his co-workers called down false emergecy alerts to trick the native Stereb into hiding in their underground catacombs—but Onasi lost interest in doing so after meeting some of the Stereb himself. By 3964 BBY, he pilots the cargo-hauler Deadweight and holds a bridge posting as part of the Serroco fleet, having been promoted to Lieutenant after serving as a helmsman aboard the Courageous at the Battle of Vanquo. Nicknamed \"Fleet,\" Onasi befriends a fringer named Shad Camper on Serroco, who later reveals himself as a Jedi after stowing aboard the Deadweight in order to talk to Admiral Karath—but the admiral recognizes him as Zayne Carrick and refuses to heed the Jedi's warnings about the forthcoming Mandalorian attack. Onasi, however, heeds Carrick's warnings mere minutes before the Mandalorians arrive and manages to call down emergency warnings to seventeen Stereb cities, prompting their inhabitants to take shelter from the Mandalorians' nuclear bombardment in the catacombs. Karath, Dallan Morvis, and Onasi later escape the doomed Courageous with Carrick's help aboard the Deadweight, but they are caught up in Arkoh Adasca's auction of the exogorths. Horrified by the bioweapons, Onasi works with Carrick and his allies to disrupt the auction, and allows the fugitive to escape in the resultant chaos—but he loses his bridge posting as a result and is demoted to leading the Coruscant-based Lance Squadron. When Carrick attempts to breach Karath's blockade in the Moomo Williwaw, Onasi follows his duty and attempts to take out the Williwaw, but when he witnesses Carrick slipping through the blockade in the Deadweight—which Carrick had hijacked from the hangar of Karath's Swiftsure—the pilot turns a blind eye and lets his friend escape to the surface."}, {"tag": "h3", "text": "Other antagonists"}, {"tag": "h4", "text": "Demagol"}, {"tag": "p", "text": "Demagol, born Antos Wyrick, was a Zeltron who was captured as a child by slavers of the Iskalloni species, a race of cyborgs. Wyrick was raised by the emotionless Iskalloni, robbing him of his social skills and his natural Zeltron empathic abilities; as a result, he survived by learning his captors' surgical techniques and adapting to their lifestyle. Liberated by the Mandalorians, Wyrick became Mandalore the Indomitable's personal student, but he was stunned by Mandalore's defeat at the hands of Ulic Qel-Droma, and in his search for answers about Jedi powers Wyrick discovered a robe that Qel-Droma carried around with him. Studying at a university at Arkania, Wyrick discovered a hair belonging to the Jedi Arca Jeth on the robe, and he founded the New Generation Project—a Mandalorian research program to create Force-sensitives—on the planet Osadia. Wyrick gave his own daughter Kessarah to the Crucible in order to acquire more Arkanian Offshoot parents, but not long after he achieved success in the young girl Edessa, the Crucible attacked Osadia and kidnapped all of his students. Taking on the name \"Demagol\", a contraction of the Mando'a words demar agol which mean \"to carve flesh,\" Wyrick became one of Mandalore the Ultimate's lieutenants and experimented on captured Jedi during the Mandalorian Wars in hopes of discovering the genetic source of their powers. Demagol's experiments at Flashpoint were interrupted by Zayne Carrick's efforts to free his friend Jarael, and Demagol was knocked unconscious by Rohlan Dyre. However, Demagol switches armors with Dyre and poses as him, sneaking aboard Carrick's ship The Last Resort after recognizing Jarael as Edessa, his prize student from Osadia. Demagol eventually emerges from the Camper Special in which he was hiding and saves Jarael from an HK-24 droid, and he becomes her companion and protector as they are caught up in Arkoh Adasca's machinations."}, {"tag": "p", "text": "Adasca allows \"Dyre\" access to his medical facilities aboard the Arkanian Legacy and promises him freedom in exchange for contacting Mandalore, and Mandalore makes a deal with \"Rohlan the Questioner\" in order to ensure that the warrior remains \"dead\" for the cause. Demagol escapes the Legacy with Jarael and Carrick's friends, and he continues to study Jarael as they wait in the Moomo Williwaw above Taris. After Vindication, Demagol and Jarael are captured during a scam on Metellos 3, and Demagol is pleased when Jarael seemingly demonstrates Force powers to free the pair from certain death. On Jervo's World, Demagol is forced to adopt the persona of the sports hero \"Spikes,\" and he helps Carrick free the Kleejs from the swoopdueling championships after being forced into the competition. However, Demagol attacks Malak when he attempted to woo Jarael and take her with him on Wor Tandell, and he urges Carrick's friends to attend \"Demagol\"'s trial on Coruscant, leaving the real scientist behind with Jarael. Revealing himself to Jarael, he convinces his former student to aid him in an assault on the Crucible-held Osadia School in order to rescue his students—but Demagol is horrified to learn that his daughter, now known as Chantique, has killed all of his students. When Carrick and the real Rohlan Dyre come to Jarael's rescue, they reveal the truth to the Zeltron: Wyrick has been Force-sensitive all along, and Jarael is not the Force-savant he believes she is. When Chantique attacks her father with a knife, Wyrick reaches out towards the two lightsabers lying nearby—Carrick's and Exar Kun's—but is fatally surprised when he summons the wrong blade: Exar Kun's lightsaber ignites in his hand, impaling both father and daughter and killing them both."}, {"tag": "h4", "text": "Arkoh Adasca"}, {"tag": "p", "text": "Arkoh, eighth lord of the House of Adasca, known informally as Arkoh Adasca, is an Arkanian who is the eighth member of the House of Adasca to hold the title of Lord and ownership of the Adasca BioMechanical Corporation of Arkania. Arkoh's grandfather Argaloh Adasca sought to weaponize exogorths using the research of the Offshoot Gorman Vandrayk, and when Vandrayk fled the company, both Alok Adasca and Alok's son Arkoh spent much of their careers searching for Vandrayk. When Vandrayk is identified on Telerath, Adasca purchases the entire production line of HK-24 assassin droids and sends them after Vandrayk, but it is not until Jarael's attempts to access medical records is detected that Adasca gets his hands on the scientist. Vandrayk is quickly healed of his illness and forced to resume work, as Adasca threatens Jarael's life, and Adasca plays the gracious host to Jarael as he works to investigate why she has pointed ears like the legendary Arca Jeth. Adasca also enlists Rohlan Dyre's help in contacting Mandalore the Ultimate in order to arrange an auction for the exogorths, which Adasca holds aboard the Arkanian Legacy in the Omonoth system. Adasca also greets his old friend Lucien Draay when he arrives aboard the Legacy, but drugs the Jedi and imprisons him to prevent his involvement in the auction. Adasca quickly becomes power-hungry and attempts to assert himself as a galactic power to the Mandalorians, Republic, and Jedi, but Zayne Carrick and Draay disrupt the auction and make it appear to be a Jedi trap for Mandalore the Ultimate. As the auction dissolves into chaos, Vandrayk seizes control of the exogorths and directs them to attack the observation dome of the Legacy, killing Adasca."}, {"tag": "h4", "text": "Mandalore the Ultimate"}, {"tag": "p", "text": "The supreme leader of the Mandalorian clans, Mandalore the Ultimate is a Taung warrior who rose to power after the death of Mandalore the Indomitable in the Great Sith War. Mandalore the Ultimate instigates the Mandalorian Wars, though his reasons for doing so are unclear and suspicious to some Mandalorians like Rohlan Dyre, and he is present at the Battle of Vanquo in 3964 BBY. When he observes how the Republic fleet at Serroco has set up bases next to occupied cities, he is disgusted by their use of a \"defense without honor,\" and he orders a nuclear bombardment of the planet's surface. When Mandalore learns of Rohlan Dyre's apparent death at Flashpoint, he turns the fallen warrior's death into propaganda, encouraging adoption of the Neo-Crusader armor among the Mandalorians. Dyre later contacted Mandalore at Arkoh Adasca's request and summoned him to a meeting in the Omonoth system to bid on the weaponized exogorths, and Mandalore expressed great interest in them—going so far as to offer Adascorp immunity and the chance to be the Mandalorians' sole weapons manufacturer. Mandalore also gives Dyre a new set of armor in exchange for his agreement that the name of the Questioner would stay dead, allowing Mandalore to continue to use Dyre's name in his propaganda. However, Adasca rebuffs Mandalore's offer, believing himself in a position to barter for Mandalore's loyalty and the effective leadership of the Mandalorians. The meeting dissolves into chaos when the Jedi Lucien Draay and Zayne Carrick arrive, and Mandalore retreats to his ship, falling for the Jedi's claims that the entire meeting was a ruse to capture Mandalore; he is later satisfied to learn that the exogorths are destroyed, as they are no longer under anyone's control."}, {"tag": "h4", "text": "Chantique"}, {"tag": "p", "text": "Chantique is a Force-sensitive Zeltron who is the daughter of Antos Wyrick, the master of the Osadia School; born Kessarah, she was one of Wyrick's first test subjects in his efforts to genetically-engineer Force users. Because of her violent nature, Wyrick considered her to be a failure and gave her to the Crucible slaving organization as part of a deal to secure more Arkanian Offshoots for Wyrick. Kessarah proved to be a vicious and skilled fighter, rising to become the overseer of younger slaves by the age of fifteen—her brutal methods earned the girl the name \"Chantique,\" which meant \"destroyer\" in the language of the Crucible. However, Chantique was bested by a young girl named Edessa, who took Chantique's place after stabbing the Zeltron in the back and leaving her to die. Discovering herself to be Force-sensitive, she healed herself and made her way back to the Crucible, where she became Magister Impressor: the one in charge of \"recruitment\" and the Crucible's fighting pits. As an act of revenge against her father and Edessa, Chantique executed the remaining students of the Osadia School one by one every year, and in 3963 BBY she finally rediscovered Edessa—now known as Jarael, or \"protector\" in the language of the Crucible. Manipulating Jarael's friend Zayne Carrick against Jarael when he attempted to infiltrate the Crucible, Chantique took pleasure in breaking the former Jedi, and she returned to Osadia after foreseeing that Jarael would return there. During their battle in the ruins of the Osadia School, Chantique learned that her long-lost father was also there, and she attacked her father in a fury—but Wyrick, using his newly discovered Force talents, summoned Exar Kun's lightsaber to his hands to kill her. To Wyrick's surprise, the weapon impaled both father and daughter on its twin blades, killing them both."}, {"tag": "h2", "text": "Development"}, {"tag": "h3", "text": "Conception"}, {"tag": "p", "text": "Dark Horse Comics's involvement in the Old Republic era began with the Tales of the Jedi series of the 1990s, the first trade paperback of which was published as Tales of the Jedi: Knights of the Old Republic. In 2003, BioWare released the Star Wars: Knights of the Old Republic video game, which was set thirty years after Star Wars: Tales of the Jedi - Redemption, the last Tales of the Jedi story arc. From 1999 onward, Dark Horse did not produce any Old Republic era stories until the anthologies Star Wars Tales 23 and Star Wars Tales 24, which featured two stories—\"Shadows and Light\" and \"Unseen, Unheard\"—that tied into Knights of the Old Republic and its sequel The Sith Lords. By 2005, Dark Horse was eager to return to the Old Republic era. In early 2005, John Jackson Miller was just finishing a story arc of the then-ongoing series Star Wars: Empire with artist Brian Ching when Miller was approached by Dark Horse editors Randy Stradley and Jeremy Barlow, who were looking at the upcoming 20th anniversary of Dark Horse Comics in 2006."}, {"tag": "p", "text": "Miller and Stradley began discussing some of the elements they liked seeing in Star Wars comics, such as drama, camaraderie, and humanity, and Miller started putting together thoughts on a series that would be launched during Dark Horse's 20th anniversary in 2006. Miller, Barlow, and Stradley studied the parts of the original Star Wars movies that they wished to recapture in print, and one of the main things that Miller found himself centering on was a quote by Princess Leia Organa in the Star Wars Episode IV: A New Hope novel: \"They were in the wrong place at the wrong time. Naturally, they became heroes.\" The group also discussed the recurring theme in the prequel trilogy of the Jedi's failure to see what was going on around them, and that idea was focused on a single character and how that failure affected them. Miller reversed the theme of an apprentice betraying a master and considered what might make a Jedi Master betray a student, and that idea gave rise to the series' first arc, Commencement—an arc that was originally titled Renegade. The series was originally developed without a specific era or time period in mind; the main focus of the series was intended to the character of Zayne Carrick, not the ongoing conflict of the Mandalorian Wars. Once the Old Republic era was decided on, Miller took a closer look at the Knights of the Old Republic games, and decided that his stories would work best if they were set series several years before the games; by doing so the series could draw on elements from both Tales of the Jedi and the video games. The Jedi Covenant arose from the idea of how a Jedi would respond to history's habit of repeating itself, and Miller made a pledge to himself that he would not introduce any mysteries in the series that he didn't know the answers to. Miller's pitch for the series received great feedback from both the developers for Knights of the Old Republic and LucasFilm. Miller changed little from the original pitch other than Hierogryph, who was originally an Ortolan—a race known for their clever criminals. After the story was approved, Miller and artist Brian Ching began work on the series with colorist Michael Atiyeh. Michael Heisler was the series' only letterer, handling all fifty issues of Knights of the Old Republic."}, {"tag": "p", "text": "For the character of Zayne Carrick, Miller took inspiration from the scene where Han Solo invites Luke Skywalker to become a smuggler. Carrick was also partially a result of Miller's desire to capture the feeling of the early levels of the Knights of the Old Republic video game: namely, the early stages where a player is still learning the controls. However, Ching soon realized that it would be hard to convey expressions on an Ortolan's mouthless face, so Miller suggested a Snivvian instead. Atiyeh and Ching developed detailed visuals for each of the series' characters, and by August 2005 at Comic-Con International in San Diego, most of the first issue was done, and Miller had scripted several issues onward. The script for the first issue had already been completed and turned in by May 2005. While designing Jarael, Brian Ching felt it was important to not have the character's appearance be overtly sexual. Ching's design for the character, particularly her tattoos and the way that her appearance was different than typical Arkanians, was a large part of Miller's inspiration for Jarael's backstory, and he filled in most of the details during the early years of the series. The series was officially announced in July 2005 at Comic-Con 2005 as part of Dark Horse's 20th anniversary celebration, and the series was set eight years before the events of the first Knights of the Old Republic game. Around November 2005, an ad for the series mistakenly claimed that the series was set eight thousand years before the Battle of Yavin, though Miller refuted the error and reaffirmed the date of 3964 BBY."}, {"tag": "h3", "text": "Production"}, {"tag": "h4", "text": "Commencement, Flashpoint, and Reunion"}, {"tag": "p", "text": "Each issue of the series received a full plot which was then approved by the editors, and then Miller would script the issue. The artist would then draw the issue, and then the issue is colored and lettered simultaneously. Printing was the final stage, and took several weeks; overall, an issue took about one month to complete, but that month could be spread over an entire year depending on the issue and the creative team's work at the time. Miller made a conscious effort to make every detail in the series matter, and he developed broad plans on how the series would fit into overall Star Wars continuity. The first issue was released on January 25, 2006, 363 days after Miller and Stradley had had their initial conversation about the series. Miller deleted Ching's preliminary drawing of the double-page scene in Commencement, Part 1 from his hard drive to prevent himself from accidentally emailing it to fans, as he wanted to keep it secret until the issue's release. Ching and Miller also worked especially hard to create Carrick's and Lucien Draay's expressions for the final page of the issue. When the series was first launched, Dark Horse was disappointed by the initial sales of #1; however, the issue soon sold out and went to a second printing. By June, orders for Knights of the Old Republic had risen in numbers and was beating out Star Wars: Rebellion."}, {"tag": "p", "text": "Miller chose to forgo an omniscient narrator and thought balloons that describe the action in the issues. The covers for the fist arc of the series were drawn by Travis Charest, and the cover for issue #1—Carrick holding the slain Padawan Kamlin in his arms—was designed well in advance based on general plot information. The inside cover to issue #2 incorrectly credited Brian Ching with the cover art instead of Travis Charest, and the dialogue balloons in that issue's garbage can scene were accidentally reversed. For the banquet scene in issue #1, Brian Ching originally depicted the banquet as a particularly busy scene with numerous details, but he scrapped it in favor of a set of panels that focused more on the five Masters and was less \"boring.\" Early on during the development of the first major \"meta-story\" for the series, Miller expressed to his editors a desire to explore the tensions between the Unifying Force and the Living Force, the two major schools of though on the Force. As a result, the Covenant Jedi in Commencement are dedicated to the Unifying Force to the point where it affects how they value the living. Carrick's speech at the end of Commencement was also one of Miller's earliest ideas for the series, and the fact that Hierogryph was responsible for Carrick's \"prophecy\" was an element that was presented in the series pitch. As Miller progressed with the development of Commencement, he realized that he had material for a prologue story that would help fans gain their bearings in the new era. Miller suggested the possibility of doing a prologue as a promotional comic for Free Comic Book Day, but editor Jeremy Barlow came up with the idea of a 25-cent special earlier in the year. Late in the process, Miller suggested the Taris Holofeed, basing the idea and format on the Star Wars Insider magazine. The production team paused in the development of Commencement, Part 3 to create the Knights of the Old Republic/Rebellion Special, lengthening the third issue's production time somewhat, and Knights of the Old Republic/Rebellion #0—which contained Knights of the Old Republic 0—was released on March 1, 2006, only a week after Commencement, Part 2."}, {"tag": "p", "text": "While drawing the scene of the Covenant members fighting rakghouls and Gamorreans in the Undercity—a callback to the presence of Gamorrean enemies in the Undercity sewers in the original video game—Ching found the sequence to be shorter than he would have wanted, a problem that he found to come up several times in the early stages of the series' development. The Taris police officers that appeared in issue #3 had been developed by Ching and Atiyeh, who viewed the officers as analogous to the clone troopers from Star Wars: Episode III Revenge of the Sith—there were numerous variations on the troopers' uniforms depending on which planet they were on. Atiyeh came up with the idea to give the officers different colors, and Ching developed new helmets and gear, but when the script for issue #3 was written, there was not enough room to feature the officers to the degree that the artists intended."}, {"tag": "p", "text": "Miller considered the heart of Commencement, Part 4 to be the conversation between Zayne Carrick and Master Tokare, and he particularly enjoyed using the conversation to introduce the possibility that Carrick was actually responsible for the murders of his fellow students. For Taris's Rogue Moon, Miller provided Ching with his own visual reference of the moon that he created by piecing together fragments of an image of a planet's surface. Miller also dedicated several pages to establish the working relationships between the crew of The Last Resort, as he felt that it was important to introduce their dynamics. Issue #5 saw guest artist Travel Foreman fill in for Brian Ching in order to keep the series on schedule, as the development of Crossroads had necessitated Foreman to fill for Ching. Travel Foreman took Miller's advice on the sequence depicting the Rogue Moon Prophecy, using a style reminiscent of the Doctor Strange artist Steve Ditko to create a vision experienced by several minds at the same time. Miller debated whether to depict Elbee's point of view during the vision, but he ultimately left it out. For the droid Elbee, Miller suggested that he be small enough to move around in The Last Resort, but large enough to resemble the loaders that appeared in the movie Aliens."}, {"tag": "p", "text": "In his production notes for issue #6, Miller admitted that the chapters of Commencement that follow the Padawan Massacre mirror the five stages of grief: denial in #2, anger in #3, bargaining in #4, depression in #5, and acceptance in the last pages of #5 and in issue #6. Miller devoted a lot of attention to finding the tone for the scenes in Commencement, Part 6, particularly Carrick's final speech to the Masters. For Valius Ying, Miller suggested to Travel Foreman and Brian Ching that he be based on an alien Tony Soprano—a gang leader who is full of himself and later realizes he's out of his depth. For Commencement, Part 6, Miller and Ching originally had Jarael plummeting towards the Jedi Tower's skylight in a background shot before she crashed into the Tower, but they ultimately removed her from the scene to preserve the mechanics of the scene. The mob scene at the beginning of the issue was one of Ching's favorite pages to draw, something that allowed him to include both new and familiar characters, and he added in several characters that were based on his own friends. The Commencement arc was later collected along with Crossroads in Star Wars: Knights of the Old Republic Volume 1: Commencement, which was released on November 15, 2006. The trade paperback also identified the Senator from issue #1 as Senator Goravvus, who had gone unnamed in the original printing; however, The Taris Holofeed was not included."}, {"tag": "p", "text": "Dustin Weaver joined the creative team for the series with issue #7 as a joint artist for the series, alternating story arcs with Brian Ching. Flashpoint, Part 1 shifts gears to focus on the Mandalorian Wars, showcasing the influx of new recruits of many different species among the Mandalorians and hinting at the conflict between their culture's typically loose command structure and their status as an invading force. Miller was pleased to give more time devoted to Elbee, who he had hoped to develop further in Commencement before he decided to focus more on the Master's vision. In the production notes for the issue, Miller revealed that Elbee's name was derived from the character Bartleby the Scrivener in a story by Herman Melville. Because the series begins before the Knights of the Old Republic game, Miller was able to delve into the early stages of the Mandalorian Wars, and he compared the conflict depicted in the Flashpoint arc to the kind of military action in remote theaters that preceded all-out war. The Courageous, the flagship of Admiral Saul Karath, earned its name through an obscure connection to Karath's flagship Leviathan in the video game: the Leviathan was a reference to the real-life British Royal Navy class of the same name, and the real-world class was based on the design for the French vessel Courageaux. Rohlan Dyre's first name was partially inspired by the name of Roland, a paladin of Charlemagne. The Flashpoint arc and the Battle of Vanquo was something that had been in planning since the early stages of the series' creation; Vanquo was meant as \"the Mandalorian equivalent of Pearl Harbor\" in that it disrupts the lives and plans of the characters in the series with sudden conflict."}, {"tag": "p", "text": "The ninth issue of the series, Knights of the Old Republic 9, was developed as a stand-alone tenth issue that focused on Lucien Draay. Miller had wanted to do a single issue focusing on the Covenant in the first year of the series, modeling it after stories such as the Marvel comic Star Wars 29 and Neil Gaiman's Hob Gadling story. However, Miller lost half of the script for the issue due to a hard drive problem, and both the file and its backup became corrupted after a power failure. Miller ultimately gave up trying to recover the script and rewrote it instead, but another problem came up with art scheduling. Dustin Weaver was originally scheduled to work on issues #7-9, the Flashpoint arc, while Brian Ching was to work ahead on #10, but when Ching finished his work first, the standalone issue was published prior to the unfinished final issue of Flashpoint. The events of the two issues took place simultaneously, and marked the transition from the year 3964 BBY to 3963 BBY, seven years before the Knights of the Old Republic game. The cover art for Flashpoint and Homecoming was handled by Brian Ching and Michael Atiyeh. While working on Flashpoint, Miller collaborated with Star Wars writer Karen Traviss for information about the Mandalorian culture and their language, Mando'a. In Homecoming, the creative team designed the flashback sparring scene between the Covenant Jedi so that it could show Lucien Draay assert his dominance and leadership over the others, and the Draay Estate's architecture was inspired by Moorish buildings in Spain."}, {"tag": "p", "text": "For the issues following Commencement, the next six issues were originally planned to be broken up into three smaller stories: a three-part story, a standalone, and a two-part arc. Doing so would allow Dustin Weaver to join in as the series' second artist, but the scheduling issues saw a third artist—Harvey Tolibao—take over for the sixth issue, Knights of the Old Republic 12, which was also colored by guest colorist Jay David Ramos. The two-part Reunion arc was intended as a comical departure from the heavier tone of the preceding arcs and the storylines to come in 2007. The storyline, which was originally titled Target of Opportunity until Miller suggested renaming it to fit with the single-word titles of Commencement and Homecoming, was intended to showcase the working relationship between Hierogryph and Carrick. Reunion's title was also a hint to the identity of Arvan Carrick, and Miller described the bank on the planet Telerath as having a central tower with spidery veins spreading across a beautiful countryside; Ching expanded on the design, adding a sea, islands, and airships. The illustrator HOON drew the cover art for the two Reunion issues."}, {"tag": "p", "text": "For issue #11, Ching used the issue as an opportunity to completely reinvent the appearances of Camper and Jarael, and he based Camper's \"Baron Margryph\" appearance on that of Mr. Peanut, giving him a monocle and a handlebar mustache. Having different artists for the two issues presented some art problems: the Moomo Brothers are identifiable by the colors of their scarves, though issue #12 reversed the colors of the scarves and created confusion as to which was which. Flashpoint, Homecoming, and Reunion were all collected in Star Wars: Knights of the Old Republic Volume 2: Flashpoint, which was released on May 16, 2007. Volume 2 restored the order of Flashpoint, moving Homecoming to after the end of Flashpoint, but the creative team chose not to remedy the Moomo Brothers' scarf issue, opting instead to use one of the brothers' scars as the differentiating factor. The creative team also took time to go back into issue #11 and added sound effects and dialogue for the chase scene that had been excluded in the original release due to the scheduling rush."}, {"tag": "h4", "text": "Days of Fear, Nights of Anger"}, {"tag": "p", "text": "As Knights of the Old Republic became successful in early 2006, Miller began looking forward at 2007, and he developed an expansive storyline which would bring in multiple characters but could be broken down into smaller chunks so that the series' artists could alternate. This plan led to the development of four interlocking arcs: Days of Fear, Nights of Anger, Daze of Hate, and Knights of Suffering—the names of which stem from Jedi Master Yoda's warning from Star Wars: Episode I The Phantom Menace: \"Fear leads to anger; anger leads to hate; hate leads to suffering.\" The names of the arcs were first announced officially in the Drawn By The Force department of Star Wars Insider 91, which discussed the upcoming arcs. While planning out the plots of the arcs, Miller was at one point forced to put every character's story path on a dry-erase board so that he could keep track of them all. Taking inspiration from Roy Thomas's decision to split up the main characters of the Marvel Star Wars comics in Star Wars 7, Miller decided to break up the crew of The Last Resort in the opening pages of Knights of the Old Republic 13. The four arc titles came to be referred to collectively as Days/Knights first unofficially by Miller himself and later officially, as part of the publisher's summary for issue #23. Miller later confirmed that the look that Carrick gives the \"camera\" in a scene in Weaver's Days of Fear, Part 1 was inspired by the look that Jim, a character from the US version of the television show The Office, often gives the camera."}, {"tag": "p", "text": "Also in issue #13, the creative team introduced Zayne Carrick's phrikite vambraces, the character's first unique piece of equipment and an element that had been a part of Brian Ching's design for the character since his inception. Dustin Weaver handled artwork duties for issues #13 and #15, while Brian Ching drew issue #14, the second part of Days of Fear. Days of Fear also saw the return of the backup news organs, with The Admiral's List: Jimas Veltraa Memorial Edition, The Adjudicator Special Report: The Outer Rim, and The Taris Holofeed: Siege Edition accompanying the three issues of the arc respectively. The character of Slyssk was partially inspired by Miller's childhood action figure of the Trandoshan bounty hunter Bossk, which had wider eyes than in The Empire Strikes Back, and the name of the Little Bivoli—a ship designed by Dustin Weaver—is a reference to a foodstuff in the MMORPG Star Wars Galaxies. The Reliance's name comes from the same source as that of the Courageous: a ship in the British Navy of the Napoleonic era of the same class as the Courageaux. Miller's grandfather served aboard a large vessel known as a Landing Ship-Tank in World War II, and the LSTs—which were used to deploy smaller vehicles and machinery onto battlefields—inspired the scenes on Serroco's surface, particularly those that dealt with the logistics of the Republic Navy. The Deadweight was also inspired by the LSTs; the Knights of the Old Republic Campaign Guide identified the ship's original designation as CBX-560, a reference to USS LST-560, the ship that Miller's grandfather served on."}, {"tag": "p", "text": "Days of Fear, Part 2 introduces the character of Carth Onasi, a companion character in the original Knights of the Old Republic game, and the creative team worked hard to ensure that he was consistent with his game portrayal yet also presented surprises. Looking back at the issue, Miller acknowledged the fact that he unknowingly staged the dialogue similar to that of the game, in that Carrick—like the player character—receives long expositions from Onasi in response to single-line observations and questions. Miller and Ching plotted out a vision of Serroco's destruction that was relatively similar to how the actual event would appear, and in the production notes for the issue, Miller acknowledged the questions of fans as to whether a bearded crew member on the Courageous from issue #8 was Onasi. Miller had intended Onasi to be present at Vanquo on the Courageous, but he did not specifically direct Dustin Weaver to draw the character, and Miller himself assumed that Weaver had drawn Onasi—only to later learn from Weaver that the crewmember was actually a rendition of Miller himself. Zayne Carrick's reaction to the death of the Sterebs in Days of Fear, Part 3 was inspired Miller's personal reaction to the events of September 11, 2001. Ching and Atiyeh drew the cover artwork for Days of Fear, and the cover for Part 3 was directly suggested by Miller: he noted to Brian Ching how he liked one of Frank Miller's covers for Daredevil that featured Daredevil cowering on a white background. Ching took one of Carrick's postures in the previous issue and added Mandalore's mask and the flames. An earlier promotional image featured a redder mask, though the mask was ultimately changed to a brighter gold by the time of the release. Issue #15 was delayed for two weeks from its original scheduled release date of March 28, and was instead published on April 11."}, {"tag": "p", "text": "In Knights of the Old Republic 16, Miller was particularly pleased with Ching's ability to recreate the panel layout from issues #1 and #2—the depiction of Carrick's discovery of the Padawan Massacre. The sequence also allowed Miller to return to Raana Tey and give insight into her motivations, something that he had wanted to do for a while. Nights of Anger, Part 1 saw the appearance of Arkania from Tales of the Jedi, and the fact that Brian Ching's designs for Camper and Jarael were divergent from that of typical Arkanians allowed Miller to deal with the subject of segregation. The broad strokes of Arkanian society stemmed from Miller's experience with student protesters against companies that did business with apartheid-era South Africa, and he brought in elements of the Russian communes from the 19th century. Colin Wilson handled the cover art for Nights of Anger, and his addition of word balloons on the covers of the issues was the idea of editor Jeremy Barlow: Barlow looked at the year's military storylines and saw an opportunity to pay tribute to the war comics covers by Joe Kubert. For the character of Zadawi, Miller asked Brian Ching to create a character who would hold a mirror up to Jarael, a way to show what Jarael's life would have been like if she had grown up on Arkania. The Tremendous battle group is also another reference to the British Royal Navy, as the Tremendous was a ship of the same class as the Courageaux."}, {"tag": "p", "text": "Starting with Knights of the Old Republic 17, Miller began a storyline that was inspired by Archie Goodwin's work on the Marvel Star Wars comics that involved the Wheel space station: a high-stakes political game set in a visually interesting location. Miller also used the issue to involve the corporate life of the Republic and its relationship with military and political issues, as Goodwin did with the Galactic Empire and the House of Tagge, by linking Lord Adasca and Adascorp to Camper's past. Miller also found an opportunity to shed light on Jarael's past, and he used the character of Eejee Vamm to further the themes of class and racial division that appeared in issue #16. Harvey Tolibao drew issues #17 and #18, and Miller was pleased with how Harvey's art was reminiscent of Jim Starlin's work on the comic series Dreadstar, one of Miller's inspirations for writing Knights of the Old Republic. Miller originally had Vamm's first line addressing an \"Emergency Station,\" which he intended to mean a hospital receiving room aboard the Legacy, but Tolibao took the dialogue to mean an actual space station and drew the Legacy docked at a large space station. Rather than alter the artwork, the creative team chose to alter the dialogue: Vamm's comment was changed to \"receiving room,\" and a dialogue box was added that referred to the station as a refueling station."}, {"tag": "p", "text": "Adasca's mention of \"the Offshoot question\" was intended by Miller to be reminiscent of real-world \"questions\" involving ethnic groups, and Carrick's escape passage through the back of his cell is a reference to the writer's favorite scene in the movie The Shawshank Redemption. In his production notes for the issue, Miller noted that he had not seen any correct predictions on what was afflicting Camper, though he pointed out that the mechanic had not had a \"spell\" before The Last Resort launched in issue #4. The writer was also particularly pleased with issue #17's backup, the Adascorp Fiscal Period Financial Report and Outlook: Message from the Chief Executive, as he was able to mimic the style of real-life quarterly reports and adapt it to the Star Wars galaxy. The Taris Holofeed edition that accompanied issue #18 was inspired by Edward R. Murrow's \"This is London\" broadcasts from Britain during the blitz in World War II, and the reporter's sense of betrayal in regards to the Republic was also inspired by the real-life resentment of the Allies when they failed to protect places in World War II. Issue #16 was also accompanied by a news organ: The Admiral's List: Remember Serroco! Edition. Days of Fear and Nights of Anger were collected in Star Wars: Knights of the Old Republic Volume 3: Days of Fear, Nights of Anger, which was released on January 16, 2008. The Knights of Suffering and Daze of Hate arcs were collected in Star Wars: Knights of the Old Republic Volume 4: Daze of Hate, Knights of Suffering, which was released on August 27, and Miller was pleased that the paperbacks were able to include the names of their component arcs in the titles."}, {"tag": "p", "text": "Even in his initial 2005 pitch for the series, Miller planned for the centerpiece of the series' second year to be the revelation of what Camper was hiding, and he outlined the basic design for what Camper had created as something biological, spaceborne, and enormous, a departure from a typical superweapon. However, as he approached the Nights of Anger arc, Miller grew wary of introducing anything drastically new to the Star Wars universe such as the living starship from Michael Golden's Star Wars 38. It was not until he watched a repeat of The Empire Strikes Back that Miller though of the exogorths, and he found that very little had been established about the creatures in the Expanded Universe, though what had been written fit with Miller's plans. He was still hesitant when he pitched the idea to Dark Horse, though his editors loved the idea, and the only challenge—how to depict them—was solved by Brian Ching at the same time that he designed the Arkanian Legacy. Harvey Tolibao took Ching's initial design and expanded on it to create the nest of stellar sea serpent-esque creatures that appear in issue #18. The issue also focused on Adasca and Jarael, using Jarael's presence to expand on Adasca's personality and motivations. The tour of the Arkanian Legacy was also partially inspired by Goodwin's stories about the Wheel and Lando Calrissian's greeting Han Solo on Cloud City in The Empire Strikes Back—a kind of double game that forced Miller to work in order to keep the issue's script at a manageable size."}, {"tag": "h4", "text": "Daze of Hate, Knights of Suffering"}, {"tag": "p", "text": "Knights of the Old Republic 19 saw Miller bring together the various characters that he had been following over the last year, and the writer worked with galactic maps to ensure that all of the characters were in logical proximity to Adasca's auction; he also worked out timelines for almost a dozen of the characters in order to keep track of where they were and what they knew of each other's agendas. Miller originally spelled the name of the space slugs as \"exorgoth,\" but it was spelled \"exogorth\" during the lettering stage of the issue's production, and it was too late to change when it was noticed; the creative team decided to go with the spelling \"exogorth\" from that point on. Miller originally intended for Adasca to make a derogatory comment about Camper's Human-like hands when he ordered them to be removed, but the comment was ultimately removed due to space constraints. The Daze of Hate arc was drawn by Bong Dazo, an artist from Glass House Graphics, and the cover art was drawn by Chris Warner with two different colorists: Michael Atiyeh for issues #19 and #21, and Kelsey Shannon for issue #20."}, {"tag": "p", "text": "When originally developing the Arkanian Legacy sequence, Miller did not include Lucien Draay at all: Carrick's prison break would have happened differently, and Draay would have simply missed Carrick on Telerath when the Courageous was destroyed. However, he decided to include Draay when he realized that the character had not appeared in almost a year, and he came up with the idea of the two working together to escape like the chained-together convicts in the movie The Defiant Ones. The addition proved logistically difficult, though Miller was ultimately able to fit in Draay's involvement and thereby remind readers of Carrick's status as a fugitive wanted by the Covenant. Miller chose to keep the design of Mandalore the Ultimate's axeblade consistent with that of Mandalore the Indomitable's mythosaur axe from the Tales of the Jedi, and he used the Daze of Hate arc to further illustrate the Mandalorians' transition from the chaotically individualistic armors of Tales of the Jedi to the color-coded uniformity of the Neo-Crusaders that appear in the Knights of the Old Republic video game. The food tray that splits a HK-24 droid's head in Carrick and Draay's escape was intended as a callback to the Bullseye comics by Frank Miller, the protagonist of which made use of a variety of mundane items as projectiles, though the panel evolved from Miller's original idea of just a debilitating strike to the eyes."}, {"tag": "p", "text": "In Daze of Hate, Part 3, Miller worked to combine the various introductions between characters into as few scenes as possible, and when the creative team was discussing how to allow Draay and Carrick to view what was going on in the Observatory, they hit upon Eejee Vamm's \"crow's nest\" as a better setting than that of the towers on the hull of the Legacy, as Vamm had been killed in issue #20. While working on Cassus Fett's speech, Miller found inspiration for Fett's tone in the American Southwest: while Miller was traveling in the region, he was directed by a guide to the presidio, or fortified base, in Las Vegas. At the presidio in 1846, General Kearny claimed New Mexico for the United States, and the starkness of Kearny's speech served as the model for the tone of Fett's. Each of the Daze of Hate issues were accompanied by a news organ: Adascorp Fiscal Period Financial Report and Outlook: Field Report: Project Black Harvest—a reference to the \"Blue Harvest\" production codename for Star Wars: Episode VI Return of the Jedi—The Adjudicator Special Report: Tools of the Trade, and The Taris Holofeed Special Proclamation."}, {"tag": "p", "text": "The Knights of Suffering arc, the basic plot of which had been discussed by Miller and Ching as early as March 2006, saw Miller return to another major element that he had planned from the series' inception: a return to Taris while it is under siege. Miller used the arc to pick up the few threads that he had left on Taris in Commencement—Shel Jelavan, Senator Goravvus, and the disappearance of Constable Sowrs' children—and also to introduce the Hidden Beks, a swoop gang from the video game. Miller brought in a number of characters from the game, such as Gadon Thek, Brejik, and the Vao siblings, though his personal goal was to avoid cameos just for their own sake and bring in characters that would do something important. The four arcs of the Days/Knights cycle was originally planned to be alternated between artists, but several issues caused that plan to fall through early on; despite this, Dustin Weaver was able to draw Knights of Suffering at the same time Bong Dazo was drawing Daze of Hate, and Dan Parsons provided inks for Weaver's work on the arc. Weaver also took the opportunity to include several background characters who resembled characters from the Metabarons comic series, one of his favorite series, and Carrick's fall from the Moomo Williwaw was inspired by the first issue of the comic series The Incal. Miller had planned since the beginning to bring back Hierogryph in Knights of Suffering and also planned out how he and Slyssk escaped from Serroco, but found that the story did not fit well into the pacing of the current story, and he decided to save the segment for a later issue. The news organ The Admiral's List: Karath Home Safely accompanied issue #22, showing the repercussions of Daze of Hate, and Colin Wilson's cover artwork for issue #23 was included in the letters section for issue #22 due to the fact that issue #23 was already completed by that time. Miller initially considered naming Constable Noana Sowrs' children after his own children, but as he began working on Vector and realized that Sowrs would be turned into a rakghoul, he discarded the notion."}, {"tag": "p", "text": "Miller suggested the idea of a comic-sized handbook for the series in late 2006, believing that there would be enough information for one by the time it was released. Miller found the process of writing the handbook similar to writing the text page for a comic that he would typically send to an artist. The Star Wars: Knights of the Old Republic Handbook was released on November 7, 2007, the same day as Knights of Suffering, Part 1, and covered the events of the series up until that issue while also including a significant amount of new information such as backstory on the Moomo Brothers and Hierogryph, The Handbook's entries were crafted with the forthcoming Vector crossover in mind, and the Handbook included original character and ship designs by Brian Chin, while Miller also suggested including Dustin Weaver's \"just for fun\" cross-sections of The Last Resort and the Moomo Williwaw. A miscommunication resulted in some confusion over the \"The Onslaught\": some entries in the Handbook refer to the Onslaught as involving Serroco, though that battle occurred several weeks later."}, {"tag": "p", "text": "While working on Knights of Suffering, Part 2, Miller encountered issues with the pacing of the arc, and was forced to cut down on certain plot elements such as Carrick's encounter with Shel Jelavan—an element that was one of Miller's favorites in the issue. Carrick's interaction with Raana Tey was one of Miller's favorite panels in the entire series, though the writer was wary of the Resistance's mission to destroy the Jedi Tower: Miller felt that the destruction of a skyscraper was similar to the events of September 11, 2001, and Carrick's concern for the innocents in the neighborhood around the tower was something that Miller felt was an appropriate reaction to the situation. Miller made use of Karen Traviss's dictionary of Mando'a in order to name the Mandalorian ships mentioned by Cassus Fett, and he decided to make the Moomo Brothers more humorous characters by introducing their passion for explosives. The issue's news organ, The Adjudicator Special Report: The Colonies, reflects the events of the issue in relation to Lhosan Industries and Hierogryph, and also includes additional charges for Carrick that are the result of Admiral Karath's testimony on Carrick."}, {"tag": "p", "text": "Dustin Weaver especially enjoyed drawing the duel sequence between Raana Tey and Carrick in Knights of the Old Republic 24, the first time Carrick has dueled another lightsaber-wielder in the series. Before Miller turned in the final version of the issue, he learned that his editor Jeremy Barlow was moving to Dark Horse's Indiana Jones office, and Barlow was succeeded by Randy Stradley, who Miller had worked with in developing the original pitch for the series. Knights of Suffering, Part 3 was the final issue whose cover was drawn by Chris Wilson, ending the appearance of word balloons on the series' covers. The issue did not continue The Taris Holofeed, instead concluding with Galactic Republic Defense Ministry Daily Brief KD0092, which was intended to read like a real-world governmental \"daily brief.\" Miller had been thinking about the Republic's inner workings in preparation for the Knights of the Old Republic Campaign Guide, and the page takes inspiration from a variety of different organizations in different governments. The Volume 4 paperback, which collects the Daze of Hate and Knights of Suffering arcs, breaks the Arkanian Legacy events in half; when the arc was in development, it was not originally planned that Nights of Anger and Daze of Hate arcs would be so intricately related with each other. Volume 4 also corrected a visual continuity error in #20 which had Rohlan Dyre given a gold set of Mandalorian armor, when the armor was in fact originally intended to be red like how it appears in Knights of Suffering."}, {"tag": "h4", "text": "Vector, Exalted and Vindication"}, {"tag": "p", "text": "The idea for the Vector crossover originated in 2006, when Randy Stradley and Chris Warner visited a comic shop as the shop's staff unloaded the latest shipments of Marvel Comics' Civil War and DC Comics' 52 crossovers. Stradley contacted Miller shortly afterwards along with John Ostrander and Jan Duursema, the creative team of the Star Wars: Legacy comic series. In response to Civil War and 52, Stradley wanted to develop a crossover that would link together the four ongoing Star Wars series: Knights of the Old Republic, Dark Times, Rebellion, and Legacy. Miller immediately agreed, and the creative teams of the four series—Miller, Randy Stradley under the pen-name \"Mick Harrison\" for Dark Times, Rebellion's Rob Williams, and Ostrander and Duursema for Legacy—entered into a lengthy series of discussions as to how to bridge the chronological gaps between their series. The writers soon decided to have a sequential crossover that would transition through each other series, and Stradley first came up with the name Vector for the event. Miller had already finished the outlines for the Days/Knights cycle and knew that it would conclude with issue #24, and Vector would run through 2008 beginning with issue #25. The inclusion of rakghouls was an element that came up early on in the discussions of Vector, with Jan Duursema first mentioning their possible involvement, and the writers took inspiration from the flashes of light that heralded a transformation to introduce a supernatural element to the creatures related to the Sith. Duursema was also responsible for the initial character designs for Celeste Morne and Karness Muur; however, Duursema's original design for Morne had her as an Arkanian named Aurora. Upon learning of this, Miller intended to tie \"Aurora\" back to Days/Knights by establishing her as the niece of Arkoh Adasca, who had been mentioned earlier as Aurora by Adasca. This was ultimately discarded, as Vector was meant to introduce new readers to the Star Wars comics without excessive \"baggage.\" To resolve the fact that Aurora had already been mentioned, Miller decided to include information on her in the edition of The Admiral's List that appeared in issue #22."}, {"tag": "p", "text": "Because Vector was intended for readers of all series, Miller was forced to cut back on the elaboration he wanted to do for a number of events from the Days/Knights cycle; some events that were cut included the aftermath of the attack on Cassus Fett, the fate of the resistance, and the fates of Jelavan, Thek, and Del Moomo. In each successive draft for the crossover, Miller decided to shed more and more characters from the KOTOR segment, and ultimately the only characters the writers decided on using were Hierogryph, Carrick, and Lucien Draay. Miller's solution to the problem was to add a gap between issues #24 and #25, and while at a summit in Portland, Oregon, in late summer 2007, the creative team decided to add several weeks between the end of Knights of Suffering and Vector that allowed for all of the characters to be moved to their proper positions and also let Miller address the status of characters who did not appear in Vector without adding too much exposition. Randy Stradley's two \"missions\" for Vector was that the event had to be easily accessible to both new and long-time readers, and it also had to change the course of each series it touched; the second goal was easier for Miller, as he had always intended for 2008 to feature a shift in gears back towards the issue of the Covenant. The four issues of Vector were drawn by Scott Hepburn, and he was supported by the inker Joe Pimentel, while Travis Charest drew the cover for #25. Randy Stradley joined the team as editor starting that issue as well. The in-continuity news organs were discontinued in 2008, as it was hard to keep them in the correct places when reprinting them."}, {"tag": "p", "text": "Knights of the Old Republic 26 allowed Miller to continue his work on the evolution of the Mandalorian forces by depicting their operations on Jebble, which was a planet that was first mentioned in the edition of The Taris Holofeed that accompanied issue #0. The character of Celeste Morne mirrored Miller's early ideas for Jarael, whom he originally intended to have a far more acidic personality, and the creative team developed a specific set of rules for how the rakghoul plague was transmitted. The character of Frazznik, who first appeared in issue #3, was originally intended to reappear in one of the early Adjudicator columns, but he was cut for space, and the arrival of transports from Taris was inspired by Great Britain's lack of available landing ships in World War II. Dan Parsons inked part of issue #26 alongside Pimentel, and he took over inking duties for the rest of the arc. Vector, Part 2 was the first in a series of covers that were drawn and colored by Dustin Weaver, and he was asked to make some changes to the cover upon completing it the first time. In issue #27, Miller took an opportunity through Lucien's description of Xamar's research on the Talisman to explain why the First WatchCircle was stationed so far away from the Core Worlds: they were searching for the Talisman. Randy Stradley came up with the term \"Mando-Raks,\" which was used in favor of Miller's \"Mando-Ghouls,\" and the two came up with the name for Dreypa's Oubliette with inspiration from the card game Magic: The Gathering."}, {"tag": "p", "text": "Issue #28, which concluded the Vector arc for the series, changed very little during the development of the story, as the writers had already determined where the characters in Knights of the Old Republic would be going and how Celest Morne would transition between series. Miller particularly enjoyed having the opportunity to give the rakghouls a backstory and reason for existing. Bong Dazo, who would take over as artist for the forthcoming Exalted arc, designed Celeste Morne's pendant-key, while Miller developed a diagram of suggested panels for the nuclear destruction scene that would allow events on Jebble's surface to proceed vertically while Carrick's reaction moved diagonally. When Dark Horse Comics collected the Vector storyline in a trade paperback, they were initially unsure as to how to do so without splitting up Vector. Dark Horse's solution was to combine the first six issues of Vector—Knights of the Old Republic #25-28 and Dark Times #11-12—in a single trade paperback, Star Wars: Vector Volume 1, Chapters 1 & 2. Vector Volume 1 was also labeled as Knights of the Old Republic Volume 5 and Dark Times Volume 3, continuing both series' trade paperback numbering, and the era icons for all four publishing eras involved in Vector were displayed on the spine."}, {"tag": "p", "text": "Exalted was considered to be a key chapter in the series by Miller and the series' editors, and one of the major goals was to show the impact that Vector had on the storyline in order to demonstrate the event's importance in other series. Miller developed the story for the two-part Exalted arc while also writing the adaption for the movie Indiana Jones and the Kingdom of the Crystal Skull, though it was not Miller's intention to purposely echo the Indiana Jones franchise or write an environmentalist story, as some suggested based on the Covenant's experimentation with artifacts on Odryn. The planet was Miller's invention, but he built upon pre-existing material for the Feeorin species, and Dustin Weaver's cover for issue #29—which featured Jarael disguised as Celeste Morne—allowed the creative team to hint that Morne might be staying in the Old Republic era. By the time Miller began writing Star Wars, he had stopped adding characters whose names were taken from people in real life. Miller's one actual case of \"tributing\" others in a name in Knights of the Old Republic was the name of Feln, which hides an easter egg that contains the name of his sister's four children. By shifting two letters backwards along the alphabet, \"FELN\" gives DCJL, the initials of Miller's nephews and niece Daniel, Christopher, Joey, and Laurie, some of whom helped Miller play through the Knights of the Old Republic video games."}, {"tag": "p", "text": "In issue #30, Miller expanded upon the role of the Exalted in order to explain how Feln retained his status as leader even after becoming a Jedi, and it fit well with the pre-established idea that Feeorins grew stronger as they aged. Miller visualized the Feeorin village as being on an incline, allowing Carrick to leap the short distances up to the rooftops, but Bong Dazo perceived the village on a steeper incline, a decision that allowed for the inclusion of elements that Miller had suggested such as a rotten rooftop and carts drawn by the beasts of burden known as khadaroks. Bong Dazo also created the bone knives used by the Feeorins. Dustin Weaver drew the cover for issue #30, and Bong Dazo drew both issues of Exalted. Knights of the Old Republic 31, which was drawn by guest artist Alan Robinson and had a cover by Brian Ching and Michael Atiyeh, was the fulfilment of Miller's desire to have a story where everyone Carrick has helped turned around and helped him in return, and the time jump before Vector helped give time to move the characters to where they could do just that. Turnabout was also the first issue where Miller openly acknowledged that the characters of Alek and Darth Malak were the same character; the issue sees Alek adopt the alias of Malak to avoid an arrest warrant. The recording discussed by Vandar Tokare is the same recording that appears in Dark Times 11, a recording that helped bridge the gap between Dark Times and Knights of the Old Republic. Malak's experience with Republic immigration is a direct reference to the character of Vito Andolini Corleone in the novel The Godfather, who was assigned the name of a Sicilian town as his surname during the immigration process. Issue #31 was the first issue after the departure of Randy Stradley as editor, who was succeeded by Dave Marshall. In his production notes for issue #32, Miller stated that the titular \"Turnabout\" in issue #31 was intended to be Xamar's change from aiding the Covenant to working against them."}, {"tag": "p", "text": "Knights of the Old Republic 32: Vindication, Part 1 was released on August 20, 2008, and it was preceded a day earlier by the release of the Knights of the Old Republic Campaign Guide, a supplemental guide to the Wizards of the Coast Star Wars Roleplaying Game. The Campaign Guide, which covers much of and builds off the two Knights of the Old Republic games and the comic series, was co-written by Rodney Thompson, Sterling Hershey, Abel G. Peña, and Miller. The guide was first thought of by Miller in early 2007, when Miller learned from his colleague James Mishler that Wizards of the Coast was relaunching the Star Wars Roleplaying Guide, though he had no idea how to pursue the idea. Later that spring, one of Miller's friends at Celebration IV suggested the same idea and pointed out the Roleplaying Game's head designer, Rodney Thompson. Miller became sidetracked before he could speak with him, but a LucasFilm representative introduced Miller to Thompson after Miller's panel: Thompson wanted Miller to help create an already-scheduled campaign guide for the Knights of the Old Republic series. Miller was originally only tasked with continuity oversight, but as Miller had some background in roleplaying games, Thompson asked Miller to write some of the sections. Miller's wife Meredith helped him develop many of the stats and information needed for the game, and Miller ended up writing the guide's chapters on Mandalorians and the Republic; he used the guide as an opportunity to advance some of the stories that he had not yet had an opportunity to do so with in the comics, such as Haydel Goravvus. However, when it came to the subject of Squint and Malak—whom the comics' creative team had always intended to eventually link together—Miller suggested that they stay away from Malak's previous identity and early days."}, {"tag": "p", "text": "This resulted in a later problem: Alek's \"surname\" of Squinquargesimus, which was assigned by Republic immigration but not used by Alek, made its way into the Campaign Guide despite the fact that Miller had not yet explained in the comics that it wasn't really the character's last name. Another error resulted when a late-minute addition to the guide included a segment on the planet Bespin, the discovery of which Miller intended to use in Knights of the Old Republic 36. Miller had been unaware of the addition while working on issue #36, but he discovered the segment on Bespin shortly before issue #36 was completed. As a result, the \"Bespin\" that appeared in issue #36 was recolored and given a different diameter to differentiate it from Bespin. For Xamar, who is a member of the Khil species, Miller decided early on in the series to reflect the Khil's sibilant speech patterns by tripling Xamar's \"s\" sounds. However, as Xamar had more and more lines, Miller ultimately lessened the number of times he did so, as he felt that the verbal tic was becoming distracting; he reworked Xamar's dialogue to include fewer occurrences of the letter s. The Vanjervalis Chain was explained in the Knights of the Old Republic Campaign Guide and the Handbook, but as the creative team strove to ensure that key story elements were not introduced outside of the comics, they chose to show the Vanjervalis Chain in action in issue #31 so that it would appear in the comics before the Campaign Guide. Brian Ching returned for Vindication, which meant that the creative team was mostly the same as the one from Commencement. For the ending of issue #32, the creative team initially considered ending on the cliffhanger of Carrick's ruse being exposed, but they decided to end with the issuing of Vindication instead."}, {"tag": "p", "text": "Vindication, Part 2 was drawn by Bong Dazo and inked by Joe Pimentel, though Brian Ching and Michael Atiyeh created the covers for the first three issues of Vindication. Miller had already developed Haazen's backstory as early as 2006 when he submitted the script for Homecoming, as well as histories for Barrison and Krynda Draay, though Barrison's name was not decided on until issue #12. Miller kept the story in reserve, as he did not know when exactly they would show the story beyond around the time of Vindication and he also did not know whether it would be actually depicted in a flashback or just covered in dialogue and short flashbacks. Following the development of Exalted, the creative team found that Vindication was turning out to be only a three-issue arc, and they decided to repeat the Flashpoint/Homecoming method of having a second artist draw a fourth standalone issue the story of which they would plan in advance. The team's next problem was determining how much of the setting from Tales of the Jedi to show, and Miller preferred to keep it at a balance between the settings of the two series. Looking at settings from the Tales of the Jedi era, they also decided to differentiate the two time periods by highlighting the more formal mindset in Tales of the Jedi and the importance of tradition and old money. The crystal oubliette that Krynda Draay was imprisoned in was originally simply a medical stasis casket, but when Dreypa's Oubliette was developed for Vector, the creative team decided to make it a prototype oubliette instead."}, {"tag": "p", "text": "From the very beginning, the Covenant meta-arc was designed to have an elastic timeframe, allowing for various other storylines to be slotted in between the arc's major plot points. Miller's personal preference for slow-playing certain subplots and having sudden and quick resolutions for them also played a role in planning, as he always intended for the major mileposts of the Covenant storyline to be unevenly spaced throughout the series, and Vector served as the \"big break\" that sparked the beginning of the rapid conclusion to the Covenant storyline. Vector also introduced a minor pause in the advance of the Mandalorians, allowing the creative team to return to the issue of the Covenant. While planning the resolution to Vindication, the creative team never considered the possibility of Lucien Draay becoming a fugitive like Carrick had been, as it felt contrary to Draay's personality. Miller considered depicting the Council meeting in which Carrick refused the Order's offer to rejoin them, but he ultimately decided not to. Brian Ching worked particularly hard on the scene that depicted the destruction of the Draay Estate, and a sound effect was foregone as the team felt it would be distracting. Carrick's line about the Force while in the vat came from his wife, who used a similar line when she read the scripts for the series, and Miller saved the line for an appropriate place to use it. Artist Dan Scott drew the cover art for Vindication, Part 4. Exalted, Turnabout, and Vindication later collected in Star Wars: Knights of the Old Republic Volume 6: Vindication on April 29, 2009; the size of the trade paperback was expanded from six to seven in order to include the flashback issue #32, and the trade paperback was labeled Volume 6 because Vector Volume 1 already included Volume 5 for the series."}, {"tag": "h4", "text": "Prophet Motive and Dueling Ambitions"}, {"tag": "p", "text": "Coming out of Vindication, the creative team wanted to immediately start the series in a new direction, choosing not to spend further time on Coruscant dealing the aftermath of the arc; they made use of the time-jump that was used before Vector to bring the main characters together again in a new adventure. While in the early stages of developing the arcs past Vindication, Miller spent time contemplating the subject of slavery in Star Wars, and when he was driving Maggie Thompson—a longtime magazine editor and one of the primary founders of comics fandom—to a convention, the subject of living slaves in a universe with artificial beings arose. When asked why slaves would be needed, Thompson responded with \"Entertainment value.\" Miller's thoughts on the subject eventually evolved into the Dueling Ambitions arc. The planetary auction in issue #36 was inspired by Miller's desire to introduce readers to new locations in the Star Wars universe as well as his experiences with financial markets. Issue #36 was the first time that Miller brought in an omniscient narrator for the series, as he felt that introducing such a narrator in the limited role of tour guide would be useful. The scene where Dyre and Demagol switch weapons in the middle of combat was Miller's idea; he imagined a midair exchange of weapons with some acrobatics, and the issue's artist Bong Dazo developed a page that depicted the exchange through multiple panels and multiple appearances of both characters in a kind of slow-motion animation. Nunk Plaarvin uses the line \"Fortunately, I am Nunk. I have the wisdom and the knowledge of the ages;\" the line was inspired by Miller's professor in his first newswriting class in college."}, {"tag": "p", "text": "The Hot Prospect was designed by Bong Dazo, though it was Miller's idea to have the exterior of the ship be as chaotic as its inside. Miller designed the command deck, which is situated as a crow's nest above the ship; when Miller began doing sketches, his son helped model the bridge with LEGO, and the resultant design was a fusion of a command bridge, mess hall, meeting room, and crow's nest. Miller was unable to draw or describe the idea, so he simply sent images of the LEGO model to Dazo. The Hot Prospect was born primarily from Miller's dissatisfaction with the Deadweight, which he felt was too sleek for a vehicle that was supposed to be ungainly. Like the Deadweight, the Hot Propsect was directly inspired by the real-world LSTs that served in World War II, and its class designation, a Calispan 560, is yet another callback to the USS LST-560. The departure lounge was designed so that there would be both a suspended flooring and a suspended ceiling, while the observatory was a more difficult design: the interior of the dome needed to be visible from the exterior, but there also needed to be beam across so that Jarael and Dyre could be hung from it. The final design featured a circular object suspended by three bars, and the creative team imagined that the observatory's original equipment had hung from those bars before it was removed. Dan Scott continued as cover artist for both issues of the Prophet Motive arc."}, {"tag": "p", "text": "Knights of the Old Republic 38 was a story that Miller had been planning for several years; the \"Corellian Strangler\" first appeared in several of the backup news organs during 2007, and the frequent mentions of the Strangler as possibly being of various species led to a \"haunted ship\" concept set aboard a vessel like the real-world Titanic. Michael Golden's art for the living spaceship in Star Wars 38 also played a role inspiring the story, and—though Miller did not intentionally plan it—like how Star Wars 38 immediately preceded the Marvel series' adaption of The Empire Strikes Back, issue #38 of Knights of the Old Republic also served as a stand-alone story preceding the main story of 2009. The story also allowed Miller to revisit the character of Elbee, as well as the subject of droids not understanding the motivations of their masters. Originally, the creative team planned for there to be no gravity on the Fillorean at the beginning and then for there to be a humorous scene where everyone and everything aboard the ship crashes to the floor when gravity is restored. The idea was ultimately discarded, as it felt out of place with the seriousness of the issue. The guest artist Dean Zachary drew issue #38, while the cover was the last to be drawn by Brian Ching. The character of Toki Tollivar went through a number of species changes, as Miller wanted a dimunitive species that was not an Ewok, before the writer ultimately settled on a Bimm."}, {"tag": "p", "text": "The Dueling Ambitions gave the creative team a chance to address confusion about the subject of dueling stemming from the first video game: Knights of the Old Republic claimed that death matches had been outlawed during the Sith rule of Taris, but also stated that they had been outlawed many years before. In the Campaign Guide, the issue was addressed to a degree—it established that the Sith had reinstated the Republic's ban, which ended after the Mandalorian invasion years earlier, so that they could prevent dueling legends from gaining popularity and reputations that would distract from the Sith's rule of the planet. Dueling Ambitions, therefore, allowed the creative team to deal with the original Republic ban. Jervo's World was intended to be different from similar stations in Star Wars such as the Wheel; the creative team wanted the station to be a kind of mecca for sports fan, similar to the real-world Cowboys Stadium in Arlington, Texas. The playing fields were imagined as a series of arenas connected by tubes, as Miller's original idea for an icosahedral structure was abandoned because it would have been difficult to render consistently. The swoopdueling competition's organization was partially inspired by the bracket system of the 2009 NCAA men's basketball tournament, which started a day after issue #39 was released on March 18."}, {"tag": "p", "text": "The character of Goethar Kleej allowed Miller to remind readers of how Carrick had made himself at home on Taris, taking an interest in the local sports and sports heroes despite being an offworlder, and issue #39 in particular emphasized that Carrick was still a typical teenager. Goethar Kleej went through a number of iterations in the planning stages of Dueling Ambitions before Miller learned about how Gotals sensed the world around them through their cones, and it was that information that resulted in the subplot with Aubin Kleej. Brian Ching returned to drawing the series with issue #39, and the issue was the first to have its cover drawn by Daryl Mandryk. Mandryk also drew the cover for issue #40, and Brian Ching continued his work as artist through the remainder of the arc; his presence helped the team recreate the scene in the Jedi Tower from issue #6 where Jarael rescues Carrick. For the sound effect resulting from Jarael's crashing through the glass ceiling, Michael Heisler went back and reused exactly the same sound effect from issue #6, and the panel with Jarael's reflection in Dyre's facemask is a recreation of an identical panel in issue #10. Hierogryph's line about a \"tub of goo\" was inspired by David Letterman, the host of the Late Night with David Letterman talk show; in 1985 Letterman referred to baseball player Terry Foster as a \"fat tub of goo\" for several days."}, {"tag": "p", "text": "Knights of the Old Republic 41 allowed Miller to do something he had been meaning to do for quite same time: ruin a happy ending. The reveal that Jarael was a former slaver was an element that had been in the work for most of the series' run and had been hinted at several times in various issues. The creative team originally considered revealing her past at the end of Vindication, but ultimately decided to delay it in order to bring other pieces into play; the delay also allowed the team to contrast how Carrick's group operated with and without the Covenant chasing them. The team placed particular importance on the establishment of Jarael's accuser as a sympathetic and credible figure, though Miller's original plans had the accuser as less formidable victim-like character. The reveal of Chantique and Jarael's past were both closely guarded secrets at Dark Horse—solicitations for later issues of the series purposely excluded mentions of either element for the sake of the reveal. Issue #41 was also intended as a partial tribute to Archie Goodwin, as the first non-movie adaption issue of the Marvel series that Miller bought as a child was Star Wars 23, the final issue of the Wheel arc. The Mandallian Giant on the cover, which was drawn by Dan Scott, was one of the more obvious references, as a Mandellian Giant was one of the alien gladiators on the Wheel. Prophet Motive and Dueling Ambitions were collected together into the series' seventh trade paperback, Star Wars: Knights of the Old Republic Volume 7: Dueling Ambitions, on October 21, 2009."}, {"tag": "p", "text": "Knights of the Old Republic 42, which was drawn by guest artist Ron Chan and featured a cover by Benjamin Carré, allowed the creative team to depict a pivotal moment in the Mandalorian Wars and the history of Revan. The creative team knew from the start of the series that \"Malak\" and \"Revan\" were not the birth names of the characters, and they were able to address Malak's transition to that name in issue #31—Miller personally felt that it was important to show that the two Sith had in fact adopted names other than their originals when they became Darth Malak and Darth Revan. As the creative team began looking forward after completing Commencement, they decided to use the Revanchists as a countervailing force against the Covenant beyond the Jedi Council's neutrality, as the crusaders were also trying to pull the Council into action but in an opposite direction. As a result, Revan and Malak appeared in issue #0, and their storylines entered what Miller described as a helix, intersecting with Carrick's own story at important points. The creative team intended for readers who had played the video games to know or learn that Revan and Malak were the Revanchist and Alek, but Miller had always planned for the massacre of the Cathar species to be the moment in which Revan and the Revanchist were firmly linked together. The massacre is described by the video game character Juhani as happening many years in the past, creating a question as to how it would have an effect in the present—but Miller came up with the solution to show the massacre in a vision of the past fairly early on, and chose to wait to use it until the time when the Revanchists were working officially the Republic. Miller originally suggested that the issue end with Malak standing on the ground watching Carrick and Jarael depart, but Ron Chan came up with the reserve idea of showing Malak looking down at the Hot Prospect as his ship departs. Issue #42 also features the first appearance of Captain Telettoh, a character who is a direct reference to Pete Hottelet, the winner of the Penny Arcade Child's Play Charity Auction. Hottelet won the right to appear in a Star Wars comic book, and Telettoh's appearance is based on that of Hottelet."}, {"tag": "h4", "text": "The Reaping, Destroyer, and Demon"}, {"tag": "p", "text": "For The Reaping arc, the dust-divers were inspired by Miller's high-school interest in pursuing a space-related career, the real-world Halley's Comet, and the movie Deep Impact, and he used the situation to illustrate a circumstance where living slaves were seen as superior to droids. The arc, which Miller originally intended to be called \"Cold Harvest\" before he realized that Dark Times was running a Blue Harvest arc, was drawn by Bong Dazo and featured covers by Benjamin Carré on both issue #43 and issue #44. Miller originally planned for the deep-space combat sequence that appears in issue #44 to appear in Dueling Ambitions, but the sequence was shifted to The Reaping; the Hot Propsect was in fact created for this scene, which allowed the creative team to make use of the variety of unorthodox weapons at the ship's disposal. The Prospect's centrifuge was inspired by Miller's science-fair project on rotational and angular momentum in high school, which was in turn inspired by the movies 2001: A Space Odyssey and 2010, and the winch attack was inspired by the LST which Miller's grandfather served on. Dace Golliard was imagined by Miler as a sort of rumpled and ruined figure who had destroyed his career but refused to give up, while the sky-reaper droids were Bong Dazo's creations. Several notes to the colorist, Michael Atiyeh, accidentally made it to the printed pages of issue #44, and Chantique's tattoos were missing from some panels."}, {"tag": "p", "text": "For the Destroyer arc, which saw the return of Brian Ching as artist, Miller originally considered a longer story arc that showed the capture of Carrick's starfighter by the Crucible and his first moments in their hands, but it was soon decided to simply cut straight into the action because Dace Golliard would already tell Chantique what had happen. The arc was originally considered to be three issues, with additional scenes about the muscle who Hierogryph hires to free the Crucible—Valius Ying's former gang—slaves and Jarael's conversations with Malak and Shel Jelavan. Knights of the Old Republic 45 saw the culmination of the multiple scenes with agents of the Crucible in the past few issues—Chantique and Bar'injar's investigations about Jarael's actions, which have been shown in past issues, resulted in their recognition of Carrick. Miller chose to make Snout a Caamasi after reading about their memnii, or collective memories."}, {"tag": "p", "text": "Knights of the Old Republic 46, which featured a cover by Jim Pavelec, was released on October 21; however, at the Baltimore Comic-Con, Dark Horse announced that Knights of the Old Republic would be ending with its 50th issue. By that time, Miller had already turned in the last script and the creative team had been working for a while to wrap up all of the loose ends left in the series over the course of the remaining arcs. Miller would move on to a new ongoing series, Star Wars: Knight Errant, set during the New Sith Wars. The decision to end the series did not bring about too many changes; Miller had already envisioned Jarael's storyline ending around the same time and both the Destroyer and Demon arcs were always planned to end the Crucible storyline. By cutting down Destroyer to two issues, the creative team was able to make Demon a four-part arc. In issue #46, Jarael's age was revealed, which was something that had been planned for some time and illustrated how little Carrick knew about Jarael. In his production notes for the issue, Miller revealed that the name of Bar'injar, the Magister Protector, was intended as a subtle clue to the real meaning of Jarael's name, as it shared the syllable \"jar\" and the same meaning. Masks, The Reaping, and Destroyer were collected in the trade paperback Star Wars: Knights of the Old Republic Volume 8: Destroyer, which was released on January 13, 2010."}, {"tag": "p", "text": "Knights of the Old Republic 47 centers on three major revelations, all of which had been planned for quite some time in order to follow up on various clues in other issues. The issue, which like the rest of the arc featured a cover by Benjamin Carré, revealed that Rohlan Dyre had in fact been replaced by Demagol, a subject which had received significant discussion in fandom and one which Miller was relieved to be able to reveal. Issue #47 also allowed Miller to reveal the \"Goodvalor affair,\" a story which he had been saving since Knights of Suffering. Miller's original idea was to show the meeting with the Defense Ministry early in Daze of Hate, but around that time, Miller quit his day job to begin freelancing, and during that time he developed a number of concepts including the Handbook. Hierogryph and Slyssk's escape was envisioned as a potential humorous one-shot, but Miller acquired other work at the time and was forced to shelve the idea; while the story was forestalled over the rest of the series, the creative team made several references to it, and in the short story Interference, Miller included material originally created for the in-universe text pages that never made their way into Vector. Miller initially considered Valediction as the title for Demon, in keeping with Commencement, but ultimately went with the title of Demon. The scene where \"Demagol\" is escorted to his trial was intended to mimic the mob scene back in issue #6, which was also drawn by Brian Ching. In the initial script for the scene on Wor Tandell, \"Rohlan\" emerged from the tall weeds near Jarael saying that he had \"concluded his business,\" but after realizing the unintentional humor of the statement, the script was altered."}, {"tag": "p", "text": "In summer 2005, as Miller was completing the pitch for Flashpoint, he planned for Rohlan Dyre to slip aboard The Last Resort and then join the cast in Days of Fear, and Demagol would start his pursuit of Jarael in custody. Looking back at the story after making a note about the stowaway, Miller added another line: \"He might be Rohlan; he might be Demagol. Heh, heh, heh…,\" and the ruse took off from there as it fit well into the story. Knights of the Old Republic 48 was accompanied by an essay in the letter column written by Miller that discussed how they handled the masquerade; in the column, he explained how the scripts for the series had included parenthetical art instructions about how to pose the character as a disguised Demagol. While the real Dyre was a brawler, Demagol had a more precise and elegant posture similar to a martial artist. As Demagol was unaware as to whether the real Dyre had ever removed his helmet, the character had to remain masked at all times, and the creative team made an effort to present Demagol's dialogue and actions hint at ulterior motives. Demagol's dialogue was tailored to include intentional slip-ups where Demagol would revert to his meticulous and intellectual manner of speaking, and the creative team even went back into the Flashpoint trade paperback to remove some of the contractions that \"Dyre\" used."}, {"tag": "p", "text": "For issue #48, the creative team decided almost immediately to keep the narrative's impact focused on the present, as they needed to preserve space, and they ultimately abandoned an idea where Demagol's personal history would be interlaced with Rohlan's history of Demagol, as it complicated the flow of the issue and would result in Demagol's untrustworthy account conflicting with visuals. Through issue #48, the creative team linked together elements from virtually every story in the entire series, and allowed Miller to reveal that there had in fact been connections to Tales of the Jedi all along—Jarael was genetically related to Arca Jeth. Demagol's appearances throughout the series were designed specifically to first and foremost show his devotion and interest in Jarael, and how he became ultimately obsessed with her. Miller discussed Jarael's origin with a geneticist friend of his, Cathe Smith, in order to help him understand the biology aspects of the story. The garage in which the Rogue Moon Project is headquartered was an extension of what Miller termed as an Infinities storyline for the series—if the Covenant had not killed the Padawans and Carrick had washed out of the Order, Miller imagined that Carrick would have found work in a garage. That storyline, which involved Shel Jelavan, was something Miller considered from the beginning of the series."}, {"tag": "p", "text": "For the space and combat sequences in Knights of the Old Republic 49, Miller originally visualized the sequence in space involving Dace Golliard's capture as lasting a page or so longer, while the combat sequence on Osadia would run shorter. However, Brian Ching developed the space sequence in a way that took up less space, allowing for more action sequences and an interior splash page. Issue #49 finally resolved the subject of Carrick's special relationship with the Force: Miller's experience as a parent led him to thinking about how children learn and adapt to physics, which in turn led to thoughts on how the Force affects probabilities. Even in his initial proposal, Miller suggested that Carrick existed at a \"right angle to the Force\" to the point where he couldn't manipulate outcomes easily like other Jedi; his reaching into the Force for a particular result might cause probabilities to wobble, creating an unlikely result in an undesirable direction and then further negative or positive effects as the Force re-established equilibrium. Miller's idea was built into the series throughout its run: for example, in the first issue, Carrick survives an improbable fall through the Force, but lands improbably at the feet of his teachers. This was partially reflected in the Star Wars Miniatures game, which had Carrick possess the abilities of Karmic Luck and Karmic Mettle. For the character of Saul Karath, Miller had always personally considered the dock worker at the Foerost Shipyards who was killed by Ulic Qel-Droma and Mandalore the Ultimate in Tales of the Jedi – The Sith War 1 to be Craddock Karath, Saul's father. He expanded on this theory in issue #49, linking Dace Golliard and Saul Karath by establishing that Golliard's cowardice at Foerost led to Craddock's death. In his production notes for issue #49, Miller finally revealed who he \"heard\" when writing dialogue for Carrick: the actor Eric Stoltz from around the time of the 1987 film Some Kind of Wonderful."}, {"tag": "p", "text": "Knights of the Old Republic 50 was released on February 17, 2010 as the series' final issue. Prior to its release, Miller ran a \"Countdown to KOTOR\" series on his blog where he answered questions from fans and gave further information on the series' production and development. For issue #50, Miller resorted to a magnetic storyboard to keep track of the events happening, using magnets created by his son. The magnets allowed Miller to remember which pages were which and also let him move around each page's card to link together events; Miller used the method for particularly eventful issues. Miller was not always sure whether or not he would go with the final twist of Demagol being Force-sensitive and Jarael lacking Force-sensitivity—a hesitancy which caused every scene with Jarael's \"capabilities\" leave it open-ended as to whether she had powers. The Campaign Guide listed Jarael as \"Strong in the Force,\" as Miller decided to include a mention of the possibility because Jarael's \"powers\" would be mentioned in Prophet Motive, and while she is not immensely strong in the Force, the character does possess some ability. When considering the relationship between Carrick and Jarael, the creative team always felt that Carrick believed that he and Jarael could never happen given who they were, and even before Jarael's age was established, Miller had realized that Carrick was too young for her in both age and in terms of hardship experienced. As a result, the post-Vindication issues, which were designed around the concept that Carrick would be looking for trouble, addressed this gap—Carrick looks into Jarael's past trouble and tries to prove himself, failing multiple times, but he earns Jarael's trust while doing so, and his apology before restoring her parents to her was viewed as an important example of the evolution of their relationship."}, {"tag": "p", "text": "In his production notes for issue #50, Miller revealed that the source of Carrick's name was North Carrick Hall, his dormitory as an undergraduate at the University of Tenneessee at Knoxville. The sound effect from Carrick's impact when he crashes into the Osadia School is spelled the same as the effect used when Jarael crashed through the skylight of the Jedi Tower, a callback to that scene which had appeared several times in the series. For the final scene with Chantique and Demagol, Brian Ching was careful to establish the location of Carrick and Kun's lightsabers on the ground, and the entire page, which is Demagol's first active attempt at telekinesis, took less than a second in terms of the story. The ending for Rohlan Dyre, where the Mandalorian resumes his quest for answers, was one that Miller had always imagined for the character. Hierogryph was one of Miller's favorite characters to write in the entire series, and the writer managed to also get in closing moments with some of the series' main characters such as Elbee and Slyssk. Demon was collected in the ninth and final trade paperback of the original series, Star Wars: Knights of the Old Republic Volume 9: Demon, on October 21, 2009. Miller always intended to follow up the first two overarching arcs of the series—what he dubbed the \"Fugitive\" and \"Freelancer\" story arcs—with a \"Footsoldier\" arc, though the series ended before he could continue. The writer would continue the planned storyline in the miniseries Star Wars: Knights of the Old Republic: War, which picked up some of the story elements and characters from the original series that Miller had intended to expand on in future storylines, such as Dallan Morvis."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h3", "text": "References to the Knights of the Old Republic video games"}, {"tag": "p", "text": "The planet Taris is one of the primary settings of the Knights of the Old Republic comics, and the series expands upon the planet, which was first introduced in the Knights of the Old Republic game. The rakghouls and Gamorreans that the Covenant fight in the Undercity is a direct reference to the Knights of the Old Republic game, which features both as enemies in the Undercity. The Hidden Beks and Black Vulkars, two swoop gangs that are featured in the comics, originated in the video game, and several characters from those groups—Gadon Thek, Zaerdra, Mission and Griff Vao, and Brejik—are characters who appear in the comics, several in-universe years before their appearances in the video game. Kebla Yurt's Equipment Emporium, a shop visited by players in the game, is mentioned in The Taris Holofeed: Invasion Edition, and in issue #25 Hierogryph and Carrick explain to Celeste Morne that they were kicked out of the Outcasts—the primary denizens of the Undercity in the game."}, {"tag": "p", "text": "The design of the Jedi Enclave on Dantooine and the composition of both the Dantooine Jedi Council and the Jedi High Council are taken directly from the Knights of the Old Republic games—the characters of Vandar Tokare, Zhar Lestin, Atris, Vrook Lamar, and Zez-Kai Ell all appear in various issues and originated in the video game. The one exception is Master Dorak, who does not appear in the series because he is not yet a member of the Dantooine Council, and his seat is occupied by Bala Nisi, a character who first appeared in Shadows and Light in Star Wars Tales 23. Another character from Shadows and Light is the Jedi Cale Berkona, who appears in several issues as a member of the Revanchists. The character of Cassus Fett was first mentioned in the first game, and he was greatly expanded on as a recurring character over the course of the series. The naming of the droid T1-LB was intended as a reference to the T3-series of droids from the video games, and the T3-series makes a number of appearances throughout the comic series; the Handbook established a link between the names by stating that Duwani Mechanical Products acquired the T1 trademark and repurposed it for their T1-series utility droid."}, {"tag": "p", "text": "The Republic's Hammerhead-class cruiser and Ministry-class orbital shuttles, which make appearances in various issues, both originated in the video games, as did the S-250 Chela-class starfighter that appeared in Days of Fear. The Days of Fear arc, in particular, referenced numerous elements of previous continuity. The HK-24 assassin droids employed by Adasca are early models of the HK-series, the same type of droid as the companion character HK-47 from the first KotOR video game, and their speech patterns is reminiscent of HK-47's. Carth Onasi is a companion character in Knights of the Old Republic, and his tendency to give long responses to short questions is repeated in Days of Fear. The Battle of Serroco was first mentioned in The Sith Lords, and was expanded upon and depicted in Days of Fear, Part 3. The Admiral's List: Jimas Veltraa Memorial Edition featured the first mention in chronological terms of the Interdictor-class cruiser, which first appeared in the form of the Leviathan in the first Knights of the Old Republic game."}, {"tag": "p", "text": "It was widely speculated by fans that the characters of Squint and the Revanchist were in fact the future Darth Malak and Revan, two of the major characters from the Knights of the Old Republic game, but the link between the characters was not confirmed until the release of Jedi vs. Sith: The Essential Guide to the Force, a reference guide published on November 27, 2007. The comic series first openly acknowledged the connection between Malak and Squint in issue #31, and issue #42 depicted the Revanchist's adoption of the name \"Revan\" and his acquisition of his trademark mask. Fans of the series also speculated that Lucien Draay would become Darth Sion, one of the primary antagonists of The Sith Lords, though Miller never intended for the characters to be the same. In Vindication, Haazen suggests that Lucien adopt a name like Darth Luzion or Darth Sion, and in issue #35 Draay acknowledges that he would have become the Lord of Pain if he had embraced the dark side—but the Knights of the Old Republic Campaign Guide confirmed that the two were separate individuals, stating that Darth Sion had fought in the Sith War."}, {"tag": "h3", "text": "References to the Tales of the Jedi"}, {"tag": "p", "text": "A number of Mandalorian ships that appeared in Tales of the Jedi reappear in Knights of the Old Republic, and their appearances, like those of the Mandalorians themselves, has evolved in the decades since the Great Sith War. The Shaadlar-type troopship and Kyramud-type battleship both first appeared in Tales of the Jedi: The Sith War 1: Edge of the Whirlwind, and they also appear in slightly modified forms in several of the scenes depicting the Mandalorian Wars. The Basilisk war droid, another vehicle used by the Mandalorians in Tales of the Jedi, is a frequent sight in Knights of the Old Republic. Similarly, the Crucible's Gladiator is a ship design picked up from the background of the Foerost Shipyards in Edge of the Whirlwind. Issue #33 features an extended flashback to several points in Haazen's life, and those flashbacks deal with elements and characters introduced in Tales of the Jedi and West End Games' Tales of the Jedi Companion. The creative team chose not to depict the Sunrider family, who was at that time intended to be the focus of the upcoming novel Mandorla, but tied the two comic series together by featuring Arca Jeth and the Sith War. Krynda Draay's Miraluka father is shown to be Noab Hulis, the Jedi who rehabilitated the fallen Jedi Chamma; Chamma is Andur Sunrider's eventual teacher, and Noab Hulis was first mentioned in the Tales of the Jedi Companion."}, {"tag": "p", "text": "The Krevaaki Vodo-Siosk Baas is depicted in a statue in issue #32, as he had been established earlier as Krynda Draay's teacher in issue #9, and issue #47 features a flashback to the duel between Exar Kun and Baas in Tales of the Jedi – The Sith War 3. Issue #48 also features flashbacks to events of the Great Sith War, such as Ulic Qel-Droma's duel with Mandalore the Indomitable. Exar Kun's double-bladed lightsaber is a major part of the Demon arc as a Sith artifact, and the weapon is the one that ultimately kills Demagol and his daughter Chantique when Demagol summons the wrong lightsaber and impales himself as well as Chantique. The Covenant's term for the failsafe method of destroying the Sanctum of the Exalted, Option Ossus, is a reference to the Cron Cluster, the star cluster that contained Ossus; the Cron Cluster was devastated by the Cron Supernova during the Sith War."}, {"tag": "p", "text": "The Vector and Vindication arcs introduce a number of artifacts whose names and original owners are references to characters in Tales of the Jedi: the Eye of Horak-mul, Jori Daragon's amulet, the Epistle of Marka Ragnos, the Helm of Dathka Graush, and the Gauntlet of Kressh the Younger. The Helm of Dathka Graush is almost identical to a helmet that appears on a Sith during a flashback in Tales of the Jedi – The Golden Age of the Sith 2; however, the 2012 reference guide Book of Sith: Secrets from the Dark Side established the character in that image as Hakagram Graush, the last Sith king of the planet Korriban before the arrival of the Exiles. While Hakagram and Dathka share the same last name, no official connection has been made as of yet between the two characters or the Helm of Dathka Graush and Hakagram's helmet."}, {"tag": "h3", "text": "References to other works"}, {"tag": "p", "text": "The Knights of the Old Republic series depicts the Mandalorians in a transitional state between the relatively diverse armor styles of Mandalorians in Tales of the Jedi and the uniform, color-coded Neo-Crusader armor from the video games; John Jackson Miller purposely evolved the appearances of Mandalorian armor over the course of the series, and also provided a reason for the changes—Mandalore the Ultimate desired to shape his forces into a more regimented fighting force as they received more and more recruits from different backgrounds. The passenger liner Chancellor Fillorean is named after Fillorean, a Supreme Chancellor who first mentioned in the 2003 Coruscant and the Core Worlds sourcebook by Wizards of the Coast. The Resol'nare, or Six Actions, of Mandalorian culture that appear in issue #26 were first created by author Karin Traviss for her work on Mandalorian culture, and Mando'a—the language developed by Traviss—appears in many issues of the comic series."}, {"tag": "p", "text": "The creative team invented the debris field in the Taris system along with the Rogue Moon, and other locales unique to the series include Vanquo, Flashpoint, the banking planet Telerath, the Feeorin homeworld Odryn, Osadia, Metellos 3, Omonoth, and Volgax. The magnetic suction tubes used in issue #5 first appeared on the Jawa sandcrawler in A New Hope, and The Last Resort's leaving an asteroid field to make a clear transmission was a callback to the asteroid scene in The Empire Strikes Back. The exogorths, or space slugs, first appeared in The Empire Strikes Back, and their scientific name is first identified in issue #18 of Knights of the Old Republic. Knights of the Old Republic has also featured members of a number of lesser-known species; these include Hamadryas, Skrillings, Ho'Din, Nagai, Besalisks, Khil, Ishi Tib, Drovians, Arkanians, Dashade, Sanyassans, Caamasi, and Zeltrons. Many of these species originated in the early Marvel comics or as patrons of Chalmun's Spaceport Cantina in A New Hope, and have appeared infrequently since their introductions."}, {"tag": "p", "text": "The concept of a Jedi Shadow originated in the roleplaying games produced by West End Games, as did many other elements in the series. The planet of Wor Tandell was first mentioned in the first edition of the Galaxy Guide 3: The Empire Strikes Back, and the Iskalloni species that raised Antos Wyrick were introduced in the West End story The Iskallon Factor. Miller drew from West End's Player's Guide to Tapani to develop the backstory of the Moomo Williwaw, and the name of the Hot Prospect's ship class, a Calipsan 560 mining ship, originates from the planet Calipsa, another West End creation. The Krish species' obsession with gaming had been established in previous West End sources, and the name of the Little Bivoli is derived from that of Bivoli Tempari, a foodstuff found in Star Wars Galaxies that originated in the 1989 roleplaying game book Riders of the Maelstrom by West End."}, {"tag": "h3", "text": "Contradictions and continuity errors"}, {"tag": "p", "text": "The Knights of the Old Republic comic series has had relatively few elements that contradict with previous continuity. In Commencement, Part 3, Marn Hierogryph mentions the substance bacta, which according to previous continuity did not exist at the time of the series, as kolto filled the role of bacta at the time. The error went unchanged in the Commencement trade paperback, and Miller suggested a number of possible remedies for the problem. However, the 2009 reference guide The Essential Atlas retconned the date of bacta's first availability in the galaxy to be around 4100 BBY. When the characters of Jarael and Camper were introduced, some fans expressed confusion as to the fact that they had pupils, five-fingered hands, and white skin. Previous appearances of Arkanians showed the species as having golden skin, three-fingered clawed hands, and a lack of pupils. The discrepancies were later revealed to be a plot device when the series identified them as Arkanian Offshoots, a genetically modified subspecies of Arkanians, and Jarael's pointed ears were revealed in issue #50 to be caused by the Sephi blood she inherited from Jeth's genetic material."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Knights of the Old Republic sold an average of 21,043 copies in comic book shops worldwide when each issue was released; 2006 yielded an average of 23,256 while 2007 had an average of 22,603 copies. An average of 22,080 copies were sold in 2008, and the remainder of the series had an average of 16,968 copies sold. The series' sales and rankings compared to other issues declined along with the rest of the comics industries over the years, starting around 24,000 and ending around 16,000, but the series in particular began a decline following the Vector arc. The four issues of Vector sold particularly well with an average of 24,565 copies sold; the issues of the series directly preceding and following the arc only sold 20,383 and 22,036 copies respectively. Knights of the Old Republic has an average rank of 107 in terms of comics sales for each month that a new issue was released, and the series was Dark Horse's fifth-highest selling series on average during the course of its run. Early on during the series' run, it was Dark Horse's third or fourth series on average, but the premiere of Star Wars: Legacy and Buffy the Vampire Slayer pushed Knights of the Old Republic down in the rankings. Conan was another series that sold higher than Knights most of the series' run, and it was Dark Horse's highest-selling series in 2006 before Buffy and Legacy. Up until the end of the Vector arc, Knights of the Old Republic ranged from 80 to 120 in terms of sales ranking per month, but as the series continued into 2008 and 2009, it dropped lower to ranging between 100 and 130 in the rankings."}, {"tag": "p", "text": "Knights of the Old Republic 25: Vector, Part 1 and Knights of the Old Republic 28: Vector, Part 4 are the series' highest-selling issues, with 25,015 and 25,101 copies sold when they were released, and the Flashpoint, Reunion, and Days of Fear arcs sold particularly well, ranging from 23,000 to 25,000 copies sold. The Knights of Suffering arc was the lowest-selling of the series before Vector, and Knights of the Old Republic 40: Dueling Ambitions, Part 2 and Knights of the Old Republic 49: Demon, Part 3 were two of the lowest-ranked issues in terms of sales in the remainder of the series. The first issue of the series, particularly Brian Ching's art, was well received by fans on the Dark Horse Message Boards as well as those on the Jedi Council Forums, though many fans on the forums expressed a desire for more references to Tales of the Jedi and the video games. The entertainment site IGN gave the series' first issue a \"Check It\" rating, indicating that the issue was good but not a necessity, but expressed the opinion that the series was a \"pale shadow\" to Tales of the Jedi. IGN reviewed several issues of the series, but primarily gave those issues ratings around 7/10, citing the series' lack of compelling conflicts between Sith and Jedi and the relatively inconsequential feeling of the series' events as major factors in Knights of the Old Republic's inferiority to the more highly rated Star Wars: Legacy. The comic review site ComicCritique.com gave the first issue 2 out of 5 stars, expressing the opinion that the issue contained \"a lot of stereotypical fiction and dialogue that will work for most fans of the series, but not for comic book readers looking for their money's worth.\" Fans on the Jedi Council Forums praised the Commencement arc, with most rating it between 4.5 and 5, but several fans criticized the drastic art change and quality of Travel Foreman's work on issue #5. Overall, the series received consistently positive reviews from fans on the Dark Horse Message Boards and the Jedi Council Forums."}, {"tag": "p", "text": "In terms of trade paperback sales, Knights of the Old Republic sold an average of 3,248 copies for its nine trade paperbacks, excluding the tenth volume which collected the War miniseries. The paperbacks were the 18th highest-selling in their respective months on average, and they were Dark Horse's first, second, or third highest selling paperbacks in their respective months excluding Volume 3; that volume was released in January 2008, a month that saw Dark Horse release almost a dozen trade paperbacks. Similar to its individual sales, the Vector arc was the highest-selling paperpback for the series, with just under 4,000 copies sold when it was released in January 2009. Volume 1: Commencement has a rating of 4.6 out of 5 after 30 customer reviews on Amazon.com, while on the book review site Goodreads it holds a rating of 3.94 out of 5 after 699 customer ratings. Volume 2: Flashpoint holds a rating of 4.5 out of 5 after 17 reviews on Amazon, while it holds a 3.90 out of 5 rating on Goodreads after 510 ratings. Fans on the Jedi Council Forums gave the Flashpoint arc ratings of around 4/5, while Homecoming mostly received ratings of either 4.5 or 5 out of 5, though Reunion was less well-received with ratings between 3.5 and 4. Volume 3: Days of Fear, Nights of Anger holds a rating of 4.4 after 13 reviews on Amazon, though it has a score of 3.84/5 after 354 ratings on Goodreads. The second part of the Days/Knights cycle was received similarly to the first; Volume 4: Daze of Hate, Knights of Suffering holds a 4.5 rating after 13 reviews on Amazon and a 3.83 rating after 302 reviews on Goodreads."}, {"tag": "p", "text": "Vector Volume 1 was not as well received by reviewers of the trade paperback: it holds a 3.65/5 rating after 313 ratings on Goodreads and a 3.7/5 after 18 customer reviews on Amazon, and IGN gave the four KOTOR issues of the crossover ratings of 7.3, 5.7, 6.7, and 7.0 respectively. Volume 6: Vindication holds a 4.9 out of 5 rating after 11 reviews on Amazon, and a 3.95 out of 5 after 257 ratings on Goodreads. Volume 7: Dueling Ambitions was less popular—it holds a 3.9/5 after 7 reviews on Amazon and a 3.65 rating after 202 ratings on Goodreads. Volume 8: Destroyer holds a 3.81 out of 5 score after 197 ratings on Goodreads and a 5 out of 5 rating after 4 reviews on Amazon, and it was the ninth best-selling graphic novel of January 2010 and Dark Horse's second best-selling after Blade of the Immortal Volume 22. The final volume of the series, Volume 9: Demon, was the shortest paperback of the series, and it has a score of 4.2 out of 5 after 6 reviews on Amazon and a 3.99 on Goodreads after 188 ratings. The first Omnibus volume holds a 5/5 rating after 2 customer reviews on Amazon and a 4.00/5 rating after 11 reviews on Goodreads, and has been reviewed by other sites as well: the Star Wars fansite Jedi News praised the Omnibus, and the comic review site Den of Geek gave it a 9/10. The Comics Crux review site gave it a 3.5/5, criticizing the inconsistent art of the Commencement arc while praising the art of the rest of the paperback, particularly the backgrounds and ship designs. Knights of the Old Republic was featured in a number of issues of the Star Wars Insider magazine during its run; departments such as Jawa's Corner and Blaster occasionally ran segments about upcoming issues and arcs during their discussion of future Star Wars products."}, {"tag": "h2", "text": "Legacy"}, {"tag": "h3", "text": "Metaseries material"}, {"tag": "p", "text": "A part of the Knights of the Old Republic metaseries, the Knights of the Old Republic comic series has also spawned its own related material, including three short stories, a sequel miniseries, a handbook, and a role-playing campaign guide. The Star Wars: Knights of the Old Republic Handbook was a one-shot handbook issue, in the same vein as Dark Horse's earlier Star Wars Handbook 1: X-Wing Rogue Squadron and Star Wars: Legacy's preview issue #0. The Handbook was released on November 7, 2007, the same day as issue #22 of Knights of the Old Republic, and it summarizes and expands on information about the characters, locations, and ships in the comic series. The Handbook featured art from the series and additional art by the series' artists, and also included backstories that John Jackson Miller had been unable to fit into the main series by that time as well as information relating to upcoming arcs, such as the Muur Talisman from Vector and Nunk Plaarvin from Prophet Motive. The Knights of the Old Republic Campaign Guide is a supplementary reference book to Wizards of the Coast's Star Wars Roleplaying Game, and includes elements from both video games, the comic series, and even Tales of the Jedi. John Jackson Miller wrote sections of the guide, and the guide features several of the main characters from the comics; the Campaign Guide also gives names to a number of ship classes that have appeared in the comics but had not yet been named. In August 2008, Wizards of the Coast released a Knights of the Old Republic expansion for their Star Wars Miniatures game, which featured a number of characters from the video games and the comic series."}, {"tag": "p", "text": "\"Labor Pains\" is a short story by John Jackson Miller that is set between issue #12 and issue #13 of the comics and was originally released exclusivy to the Hyperspace fan club on April 9, 2008. Originally thought of as a promotional short story for Star Wars Insider, the story was finished by Miller when he learned that StarWars.com was planning to present original fiction in 2007. \"Labor Pains\" is told in first-person from the perspective of Marn Hierogryph, and focuses on his and Carrick's attempt to scam an art gallery on Ralltiir. The second Knights of the Old Republic short story by Miller, \"Interference,\" was also published on Hyperspace on September 29, 2008, and allowed Miller to elaborate on an idea he had originally planned for the in-universe text pages of the series: a propaganda broadcast by a Captain Goodvalor. \"Interference\" follows a series of broadcasts made by Captain Goodvalor, a Republic propaganda figure, and the Mandalorian Koblus Sornell's reactions to his broadcasts, and is set between the Daze of Hate/Knights of Suffering arcs and the Vector arc. Sornell later appeared as a main character in the War miniseries, and the backstory for the Goodvalor character was finally revealed in issue #47. The Secret Journal of Doctor Demagol, which was released on April 29, 2010, was first thought of by Miller as a way to show what Demagol had been thinking over the entire course of the comics. Miller approached StarWars.com's editor Pablo Hidalgo about doing the story, and it was later published on Hyperspace. The story follows Demagol throughout the entire Knights of the Old Republic series, starting with Commencement and ending with Demon, and allowed Miller to also flesh out Demagol's plans for Jarael and his relationship with Chantique's mother."}, {"tag": "p", "text": "On October 13, 2011, Dark Horse announced that Knights of the Old Republic would receive a sequel miniseries: Knights of the Old Republic: War, also styled Knights of the Old Republic—War. War was written by John Jackson Miller, who suggested the return to the Old Republic era in 2011, and the miniseries was drawn by Andrea Mutti; the series took its name from the similarly titled Star Wars: Legacy—War miniseries, which was a sequel to Star Wars: Legacy. Essentially a continuation of the original series, War includes numerous references and elements from the previous series, and uses Miller's original plans for future storylines in Knights of the Old Republic. War is set in 3962 BBY, the year after the original series, and is primarily a solo title focusing on Zayne Carrick as he is drafted by his homeworld Phaeda into serving in the Mandalorian Wars. War is the fulfilment of Miller's plan to have a \"Footsoldier\" arc of the original series, and picks up on a number of elements and plot points that were left incomplete with the original series' cancellation, such as the characters of Dallan Morvis, who Miller had developed over the course of the original series for his role, and Koblus Sornell, who appeared in Interference. War was collected in a trade paperback entitled Star Wars: Knights of the Old Republic Volume 10: War, continuing the numbering from the original series' paperbacks. The series' entire 51 issues were later collected in three Star Wars Omnibus volumes, released in August 2013, December 2013, and April 2014 respectively. Star Wars Omnibus: Knights of the Old Republic Volume 1 was reprinted as Star Wars Legends Epic Collection: The Old Republic Vol. 1 by Marvel Comics in June 2015."}, {"tag": "h3", "text": "Continuity impacts and references"}, {"tag": "p", "text": "John Jackson Miller's other comic series, Star Wars: Knight Errant and Star Wars: Lost Tribe of the Sith—Spiral, have referenced and expanded on elements created by Miller for Knights of the Old Republic. An artifact created by Ieldis, the Helm of Ieldis, is the focus of the Escape story arc of Knight Errant. The primary antagonist of the Lost Tribe series is Remulus Dreypa, the creator of the oubliette in which Celeste Morne was sealed at the end of Vector, Part 4. Spiral is in itself a follow-up to Miller's Lost Tribe of the Sith series of short stories, in which Miller makes additional references to Knights of the Old Republic: the Jedi Shadow Jelph Marrian was first mentioned in issue #25, and Miller used Marrian to address the question of what other members of the Covenant would think after the events of Vindication. Ludo Kressh's pedicure set, which first appeared in issue #29, is also referenced by the character Seelah Korsin, who was tasked with tending to Ludo Kressh's feet. The Vector crossover saw elements from Knights of the Old Republic appear in the other series involved in the event—Hierogryph appears in a holorecording with Carrick in Dark Times 11: Vector, Part 1, and while Carrick is only mentioned in Rebellion 16, he appears in a flashback and then a vision to Celeste Morne in Legacy 28 and Legacy 31. As the \"main characters\" of the Vector crossover, Celeste Morne, Karness Muur, and the Muur Talisman appear in all twelve issues of the event, and are mentioned in several later issues of Legacy."}, {"tag": "p", "text": "Miller's novel Knight Errant, a tie-in to the comic series of the same name, includes a variety of references to elements from the Knights of the Old Republic comic series: Dallan Morvis, Ieldis, Telettoh, and Jimas Veltraa all receive mentions in the novel, and the book identifies the Adasca affair as the \"First Battle of Omonoth.\" The Sith Lord Odion commands a ship named the Sword of Ieldis, while the Sith Arkadia Calimondra commands the New Crucible; both names were intended as in-universe references to the elements from comics series. Similarly, the cannon \"Bitsy\" is mentioned as having been salvaged from an old derelict, and Miller confirmed in his production notes for the novel that \"Bitsy\" was the Moomo Williwaw's cannon, though the novel does not identify the derelict as the Williwaw. Knight Errant introduces Telettoh's Maxim—\"Never let Malak aboard\"—as a precautionary tale about allowing Sith Lords aboard vessels, and the book also gives the name for the sixth and final ship of the Inexpugnable-class: the Diligence. The Kedorzhan species, which was first introduced in issue #2. have gone on to appear in a number of issues of Knights of the Old Republic, as well as other material by Miller such as the Knights of the Old Republic Campaign Guide and the short story Incognito. The planet Telerath was the primary setting of Blue Harvest, the story arc of Dark Times that directly followed Vector."}, {"tag": "p", "text": "The 2011 video game Star Wars: The Old Republic is set three hundred years after the Knights of the Old Republic games and comics, and features numerous references to the games, comic series, and Tales of the Jedi. The game's Codex includes a series of entries in the Galactic History section that recap the Mandalorian Wars and the general events of the comic series, particularly Commencement, Vector, and Vindication. Forty-seven of The Old Republic's servers at the time of its release were named after elements from the comics. All of the main characters of the comic series, excluding Shel Jelavan, lend their names to servers, and the names of almost twenty items and locations are used as server names, such as \"Jebble War Forge\" and \"Vanjervalis Chain.\" Even some minor characters, such as Dace Golliard, Lord Ieldis, Karness Muur, Senator Goravvus, and Goethar Kleej are the basis of server names, as are the eight main ships that appear in the series—the Courageous, Deadweight, Chancellor Fillorean, Arkanian Legacy, Swiftsure, The Last Resort, Hot Prospect, and the Moomo Williwaw. The Republic hub in The Old Republic, Carrick Station, is named after Zayne Carrick, and two of the Republic bases on the planet Taris are also named after characters from the comics: Waypoint Station Draay and Waypoint Station Morne. The game's crewskill system includes several missions that reference the comics; for example, the mission \"The Butcher's Lab\" involves one of Demagol's laboratories. The Rogue Moon, Odyrn, the bombardment of Serroco and the underground shelters, exogorths, and Remulus Dreypa are also involved in other crewskill missions."}, {"tag": "p", "text": "Gorman Vandrayk also receives several mentions—conversations with the Jedi Consular companion Tharan Cedrax involve Cedrax's attempts to build a Vandrayk Generator, a machine that Vandrayk theorized which runs on a form of energy that doesn't exist. During the Grand Acquisitions Race World Event, one of the items that players needed to locate was a Vandrayk's Tuning Apparatus. Adascorp plays a major role in the Bounty Hunter class storyline on the planet Quesh, a storyline that also mentions that Adascorp is partners with the Draay Trust. Trandoshani flatcakes with fruit, a dish discovered by Slyssk in issue #15, are sold by Brassk's Trandoshani Flatcakes, a company that sponsors the Huttball sport and markets itself as the only company that served them with authentic fruit from the planet Kashyyyk. A Codex entry on the history of the planet Makeb The Old Republic's Digital Expansion Rise of the Hutt Cartel mentions Semako Thalien, a business magnate during the Mandalorian Wars; he shares the same surname as the Skrilling Jervo Thalien who appeared in the comics, but no connection has been made between the two as of yet. A sarcophagus created by Karness Muur appears in Rise of the Hutt Cartel, containing the rakghoul designated Patient Zero. The ruins of the Jedi Tower is the subject of a Republic mission on Taris, and a Jedi Knight class mision involves interrupting the sale of scavenged Jedi Covenant artifacts by a pirate."}, {"tag": "p", "text": "The 2013 comic The Clone Wars: Defenders of the Lost Temple is a \"sequel\" to the end of Vindication, following up on Lucien Draay's fate almost four thousand years after Knights of the Old Republic. Set during the Clone Wars between the Republic and the Confederacy of Independent Systems, Defenders of the Lost Temple takes place on the moon where Lucien Draay established his \"true Covenant\" millennia ago, a moon identified as Draay 2, and deals with a mission led by Jedi Master B'ink Utrila to retrieve the Gauntlet of Kressh the Younger. Within the temple, there is a large statue of Lucien Draay holding aloft Haazen's severed arm—a statue that turns out to be a guard droid. Haazen and Draay's battle is depicted in a carving on the walls of the temple, and the Gauntlet itself is hidden within the structure—but when Utrila touches the Gauntlet, she is overwhelmed by the dark side power within and withdraws. The temple is later attacked by the Mandalorian Death Watch and a clone trooper seemingly sacrifices himself to bring down the entire temple. Unbeknownst to the other clone troopers and the Mandalorians, the trooper survives thanks to the Gauntlet, and he later tosses it into a nearby river. Haazen, Lucien Draay, and Vindication are never identified by name in the comic."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "News organs"}, {"tag": "p", "text": "Various issues of Star Wars: Knights of the Old Republic have been accompanied by single-page in-universe news organs. They first appeared in issue #0 and reappeared throughout the Days/Knights cycle, but the feature was discontinued in 2008. They included:"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}