{"url": "Star_Wars:_Legacy_Volume_II_Book_4%E2%80%94Empire_of_One", "categories": ["Category:Real-world articles", "Category:Star Wars: Legacy Volume 2 trade paperbacks"], "nodes": [{"tag": "h1", "text": "Star Wars: Legacy Volume II Book 4—Empire of One"}, {"tag": "p", "text": "Star Wars: Legacy Volume II Book 4—Empire of One is a Star Wars Legends trade paperback that collects issues 16–18 of the comic-book series Star Wars: Legacy Volume 2 from authors Corinna Bechko and Gabriel Hardman, as well as issue 0½ from the original Star Wars: Legacy series. It was published by Dark Horse Books on October 28, 2014."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "When Ania Solo and her companions embark on a covert rescue mission, they have no idea they're headed into a showdown with the Sith that could alter the balance of power in the galaxy! Collects Star Wars: Legacy #16–#18 and #0½."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Following Ania Solo's kidnapping, the Imperial Knight companion Jao Assam was forced to adjourn his quest to hunt down the rogue Sith Darth Wredd, who wanted to assassinate the Galactic Empress Marasiah Fel, the head of the Imperial Knights. After a grueling rescue mission, Ania was arrested for the alleged murder of the Imperial Knight Teemen Alton. However, Jao succeeded in clearing Ania's name by presenting evidence that the real murderer was a deceased bounty hunter who had tried to frame her for the crime. While Ania was acquitted and released by the Galactic Federation Triumvirate, Jao Assam was subsequently arrested and imprisoned for deserting the Imperial Knights, a crime which carried the death penalty. In prison, he was visited by his quarry Darth Wredd who wanted to recruit him as his Sith apprentice and offered him a way out of his predicament—a Sith lightsaber."}, {"tag": "h3", "text": "Rescuing Jao Assam"}, {"tag": "p", "text": "Following Jao Assam's imprisonment, Ania Solo attempted to seek an audience with Galactic Empress Marasiah Fel in an effort to gain clemency for the Imperial Knight. Her efforts were rebuffed by the senior Imperial Knight Antares Draco who was adamant that the Empress would not change her decision. Unsuccessful, Ania returned to AG-37's freighter, which was berthing at a Coruscant spaceport. Meanwhile, Darth Wredd and Jao escaped in a starship, killing several stormtroopers and wrecking a hole in the prison wall in the process. Following Jao's escape, Ania was detained by several stormtroopers and brought before Empress Fel, who had decided to grant the junk dealer an audience."}, {"tag": "p", "text": "During their meeting, Empress Fel confided to Ania that she was certain that Jao Assam had not fallen to the dark side of the Force but was rather following his vows as he saw fit. However, the Empress was unwilling to break the law by showing favoritism to Jao, who had disobeyed his orders to hunt down Darth Wredd. Despite this predicament, the Empress saw a solution to Jao's legal situation. If Ania were to find Jao and bring him back, she would be willing to consider finding a loophole around the desertion charges. Empress Fel assigned Ania and her companions with a platoon of Trandoshan stormtroopers and sent them to rescue Jao. The rescue mission departed on AG-37's freighter."}, {"tag": "p", "text": "Meanwhile, Darth Wredd and Jao landed on the floating world of Mala. There, Wredd revealed his life story and origins to the captive Jao. Growing up on Mala, Wredd had discovered that he was Force-sensitive in his youth. Unable to join the Jedi Order since it had been driven underground following the Massacre at Ossus, Wredd instead became a skilled swordsman and the champion of his village. Towards the end of the Second Imperial Civil War, Wredd's world was destroyed by the One Sith who tested a bioweapon on it, which destroyed all life and knocked the planet off its orbit, causing it float in space. While Wredd was allowed to live, he was forcibly apprenticed to a Sith master."}, {"tag": "p", "text": "Due to the destruction of his homeworld and his family, Wredd harbored a deep hatred towards the One Sith. He then elaborated how he had killed his master and impersonated the Imperial Knight Yalta Val during the Carreras Incident. With the death of his master, Wredd was now free to destabilize the galaxy. When Jao expressed skepticism, Wredd presented a broken blade from his sword, confirming that he was indeed telling the truth. Wredd then arranged for Jao to escape his cell and to send the coordinates of their planet to Ania Solo. As planned, Ania and her companions received the coordinates to Mala and quickly recognized that this was the same elusive floating world which they had encountered during the Carreras Incident."}, {"tag": "h3", "text": "The Mala Trap"}, {"tag": "p", "text": "AG-37's freighter landed near the wrecked Carreras G51 communications array, which had been destroyed in a collision with Mala during the Carreras Incident. After instructing her stormtroopers not to send any outgoing transmissions, Ania's rescue party explored a cave. Unknown to Ania, one of the stormtroopers held back and sent a transmission to an unknown party, later revealed to be the Fel Empire. Inside the cave, they found a captive Jao, who was being held suspended by several restraints. After freeing him, Jao revealed that Darth Wredd had intended to lure the Imperials to Mala. Shortly later, a fleet of civilian starships landed near the Carreras communications array."}, {"tag": "p", "text": "It turned out that these new visitors was a large army of One Sith, who had learnt about Darth Wredd's whereabouts and were out to hunt and kill him. Believing that Ania and the Imperials were sheltering the rogue Sith, the Sith leader Fanoste, whose cover job was a diplomat, ordered his followers to attack the Imperials. During the fighting, Darth Wredd resurfaced and came to the aid of Ania's party by killing several Sith with his lightsaber. He also handed Jao a Sith lightsaber, allowing the Imperial Knight to joint the fighting. Despite their valiant resistance, Ania's party was quickly overwhelmed by the One Sith horde and were forced to retreat into the Carreras communications array."}, {"tag": "p", "text": "Wredd and Jao temporarily succeeded in slowing down the One Sith advance by pushing a wrecked portion of the communications array onto the One Sith horde, crushing many Sith. This enabled Ania, Sauk, AG-37, and the stormtroopers to retreat to a trench position within the communications array. Sauk confronted the stormtrooper who had sent the transmissions and accused him of working for the Sith. However, the stormtrooper protested his innocence and stressed his loyalty to Empress Fel. At that point, Wredd arrived and stated that he was the real quarry of the Sith."}, {"tag": "p", "text": "Darth Wredd also tried to rationalize his actions by claiming that he was aiding the Galactic Federation Triumvirate by rooting out the Sith. He also shared with Jao about his ambitions of restoring the Rule of Two. Wredd viewed the disaffected Jao as a prospective apprentice. While acknowledging they were temporary allies, Jao reiterated that he was loyal to the Empress and that he would never join the dark side. As their argument became heated, the One Sith army caught up with Ania's party and Wredd. In the midst of the fighting, Imperial reinforcements under Empress Fel herself arrived at the communications array. A flight of Predator-class fighters flew over the trench and strafed several Sith. After the One Sith rejected an ultimatum by the Imperial authorities to lay down their arms, the Empress deployed her Imperial Knights and stormtroopers onto the battlefield, thus beginning the second stage of the Battle of the Floating World."}, {"tag": "h3", "text": "Destroying the Sith"}, {"tag": "p", "text": "A bitter and fierce battle ensued between the Sith and the Imperial Knights, with neither side yielding an inch. Within hours, the battlefield was piled with the corpses of countless Sith and Imperial Knights. During the fighting, Antares Draco, the commander of the Imperial forces, was wounded by a One Sith fighter. However, he was rescued by Ania and Sauk who attended to his wounds. Following the incapacitation of her lover Draco, Empress Fel entered the battlefield. Ania and Sauk also aided the Imperial forces by blowing up a Chadra-Fan Lander that was being used by the Sith. Darth Wredd also aided the Imperial Knights by killing many Sith, avenging the destruction of his homeworld and family."}, {"tag": "p", "text": "Empress Fel was reunited with Jao during the battle and cautions the latter not to trust their Sith ally. Both Knights agreed that a Sith was only motivated by hatred. By the end of the day, the Imperial Knights had succeeded in wiping out all Sith resistance with the exception of Darth Wredd. AG-37 theorized that all of the Sith infiltrators in the galaxy had been killed in the fighting. Marasiah Fel ordered the Imperial shuttle Neuer to evacuated the wounded Imperials and ordered her Knights to search for the surviving Sith. While attending to the wounded Antares Draco, Empress Fel was stabbed in the chest by Darth Wredd, who had resurfaced out of hiding."}, {"tag": "p", "text": "Before the rogue Sith could finish his work, Jao intervened and chased Wredd up a cliff. A fierce lightsaber duel ensued and Jao succeeded in slicing both of Darth Wredd's hands with his lightsaber. Wredd then pleaded with Jao Assam to finish him off, hoping that Jao would kill him in anger and fall to the dark side. He insisted that the Sith had to be destroyed for the sake of the galaxy and for the memory of his family. However, Jao refused to kill Wredd, having realized his plan. In the end, Wredd was killed by Ania Solo, who fired a blaster bolt to his chest. Following the battle, the wounded Empress Fel was evacuated and Jao reconciled with Master Yalta Val. Jao reasoned that Darth Wredd had engineered the entire battle to punish and destroy the One Sith for the harm they had done to his homeworld."}, {"tag": "h3", "text": "Dénouement"}, {"tag": "p", "text": "Following the events of Mala, Ania Solo and her companions returned to Coruscant. Ania secured an audience with the Empress Marasiah Fel, who was bedridden and recovering from her injuries. Out of gratitude for Ania's help and bravery, Fel offered to make her the captain of her personal guard. Ania declined the offer but managed to convince the Empress to drop Jao Assam's desertion charges. Jao was also allowed to leave the Imperial Knights and to join Ania and her companions on their travels throughout the galaxy."}, {"tag": "p", "text": "Prior to their departure, Jao Assam had a final meeting with his mentor Master Yalta Val. With the apparent demise of the Sith, Empress Fel had announced plans to reform the Order by removing the rule that the Knights had to pledge complete loyalty to the Empress. Jao also promised his Master never to stray from the light side of the Force. Jao's Imperial comm droid was also allowed to join Ania's party. After embracing Val for the final time, Jao departed with Ania's companions into space."}, {"tag": "p", "text": "By the following year, Ania and her companions were traveling throughout the galaxy. While visiting a cantina, Sauk succeeded in purchasing a retrofitted stabilizing coil from Jariah Syn and his companions Cade Skywalker and Deliah Blue. Sauk's purchase of the starship part came at an opportune moment. Shortly later, Sauk, Ania, Jao and AG-37 were attacked."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Collected issues"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}