{"url": "Star_Wars:_Republic:_Outlander", "categories": ["Category:Real-world articles", "Category:Star Wars: Republic story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Republic: Outlander"}, {"tag": "p", "text": "Outlander was a comic book subseries of Star Wars: Republic that comprised issues 7-12. It tells the story of Jedi-turned-Tusken Raider Sharad Hett and his son A'Sharad Hett. It was collected in the Outlander trade paperback."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Rumors are flying around the Tatooine desert of Tusken uprisings, led by a single, uniting warchief. Everyone is on alert and buying a weapon, and the Jawas are unloading their antique \"slug-throwers\" quickly. Back on Coruscant, the Jedi Council studies surveillance of a Tusken attack, identifying the Tusken warchief as wayward Jedi Master Sharad Hett. The council decides to send newly appointed Master Ki-Adi-Mundi to appraise the situation on Tatooine. Meanwhile, the Dark Jedi bounty hunter Aurra Sing has been hired by local authorities to eliminate Hett."}, {"tag": "p", "text": "As Ki-Adi-Mundi prepares to leave Coruscant for Tatooine, he is greeted by an old friend with a a word of warning: the dark side is growing, and whatever happens out in the desert will change Ki forever. Once on Tatooine, Ki meets with Jabba the Hutt, who grants him safe passage in the desert and gives him access to a speeder. Too late, Ki realizes that Jabba has set him up, sending him into a sandstorm with a gang of killers."}, {"tag": "p", "text": "As the crew of the speeder Jabba lent him slowly advance on Ki-Adi-Mundi, he strikes back, killing them all, but wrecking the speeder in the process. Stranded in the desert with a broken arm, Ki begins his seemingly fruitless search for the missing Jedi Master. Meanwhile, elsewhere in the desert, Aurra Sing tracks both Jedi."}, {"tag": "p", "text": "While trying to escape a group of furtive womp rats, Ki-Adi-Mundi stumbles into the middle of a Krayt Dragon den, and, in to the middle of a Krayt Dragon hunt led by former Jedi Master Sharad Hett. Ki is relegated to watching, as Master Hett's son, A'Sharad Hett, ritually kills the giant beast. As the two Jedi talk, Hett reveals his suspicion about a certain Hutt crimelord, being the possible cause of the confrontations between the Tusken and the settlers."}, {"tag": "p", "text": "As Aurra Sing gets closer and closer to her Jedi targets, they seem to be coming no closer to an understanding. Hett tells Ki of his service as a Jedi, his master Eeth Koth, his time as a galactic peacekeeper, and the tragic death of his parents. Hett goes on to explain his subsequent crash landing on Tatooine, and how he rose to a position of power within the Tusken tribe. Per his mission, Ki then requests that Hett return to Coruscant to assist in the coming struggle against the Sith. Just then, Aurra Sing arrives with Gardulla the Hutt's army."}, {"tag": "p", "text": "As Aurra Sing dispatches a Tusken scout party, Jabba the Hutt's plot to incite war comes to light. Just as he had hoped, the Tusken warriors begin their clash with Gardulla's mercenaries. Sharad Hett begins strategically deploying his Tusken warriors, just as Sing attacks Ki-Adi-Mundi and the younger Hett, sending them scattered onto the battlefield. Overwhelmed, Gardulla sounds a retreat. Unbeknownst to her, Sing has been working as a double agent for Jabba, who arrives just in time to reinforce her troops. Finally, Sing finds her target, and a lightsaber duel ensues, leaving Sharad Hett near death. Ki-Adi-Mundi arrives in time to chase off the assassin, and to hear Hett's last request, that he complete his son's training on Coruscant."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}