{"url": "Star_Wars:_Princess_Leia", "categories": ["Category:Real-world articles", "Category:Star Wars: Princess Leia"], "nodes": [{"tag": "h1", "text": "Star Wars: Princess Leia"}, {"tag": "p", "text": "Star Wars: Princess Leia is a Star Wars comic miniseries written by Mark Waid and penciled by Terry Dodson. The five-issue series, published by Marvel Comics from March to July 2015, centers on the character Leia Organa between the events of Star Wars: Episode IV A New Hope and Star Wars: Episode V The Empire Strikes Back. The series addresses how Leia deals with the destruction of Alderaan, her homeworld, as she tries to find survivors of the attack that are scattered across the galaxy."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Marvel editor-in-chief Axel Alonso commented the company's commitment to diversity was why they settled on a Leia miniseries. Editor Jordan D. White offered Waid the series as he had been looking to write something with a female lead."}, {"tag": "p", "text": "Waid loved the character of Princess Leia because, despite being set up as a damsel in distress, she wasn't, and proved to be more adept in a firefight than the heroes. \"That was so unique at the time, and sadly, it's still a little unique,\" he said. He claimed she would have been his first choice for writing a Star Wars comic even if he hadn't been offered the job."}, {"tag": "p", "text": "He opted to explore Leia's feelings about the destruction of Alderaan because \"a character is really defined by how they react in the lowest moment of their life,\" and decided she would still feel a responsibility to her people, something other members of the Rebellion may not agree with. He decided to avoid using other primary characters from the films so Leia would not feel like a guest star in her own book."}, {"tag": "p", "text": "Dodson said that he would establish a \"working likeness\" for Leia that would make her recognizable to the reader, without making the artwork slavishly loyal to photographic reference of Carrie Fisher. He also noted Leia's varied wardrobe in the films, \"a great tradition\" which he would try to honor when designing new costumes for her in the series."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}