{"url": "Star_Wars:_Republic:_Into_the_Unknown", "categories": ["Category:Real-world articles", "Category:Star Wars: Republic story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Republic: Into the Unknown"}, {"tag": "p", "text": "Star Wars: Republic: Into the Unknown was the nineteenth story arc in the Star Wars: Republic series of comic books. It consisted of issues 79 and 80."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Clone Wars are over, but instead of triumph, it is a time of tragedy. Events have come to pass so terrible that none foresaw them until it was too late. Now, the galaxy lies in the unmitigated grip of a new Emperor, and its former protectors are forced to hide in the shadows..."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Approximately two days after the end of the Clone Wars, Order 66 has been issued. Before this turn of events, Jedi Master Simms, her Padawan Noirah Na, and Master Kai Hudorra had been fighting Separatist forces on the planet Toola. When their clone troopers turned on them, Master Simms created a diversion, and paid for it with her life, to let Hudorra and Na escape. When the two had made it to a town, they were forced to dive into the frigid harbor and under the platforms to hide from the clones. Making their way into an abandoned warehouse, Master Hudorra left Noirah to find necessary items for their flight away from the planet."}, {"tag": "p", "text": "Meanwhile, Jedi Master Dass Jennir flees his troops on the planet New Plympto. Stumbling off his path, he encounters a Nosaurian, an intelligent alien with the ability to \"flash\" phosphorescence through its mouth, alerting all to their presence over many miles. The Nosuarians had been fighting the Republic which had forced them into an economic recession. Jennir grabs the being's snout and commands that he not flash his mouth, and the being obliges. But, the being also takes out his weapon, points it at Jennir, and calls him a Jedi. Jennir asks if it is true that the clones had turned against their Jedi generals, and the answer was yes. The alien fell onto the ground in a laughing fit, telling Jennir he is out of touch. He tells the Jedi his name, Bomo Greenbark. Greenbark leads Jennir to his fellow Nosaurians, who proceed to capture him. General Rootrock interferes. He talks with Jennir, who more or less allies with them."}, {"tag": "p", "text": "Hudorra steals credits on a market, and uses them to buy supplies for him and Noirah Na. After a riot in a bar, where he learns that the war is over, he arranges passage to Coruscant, to see for himself what has happened.\nThere he sees the burning Jedi Temple. A Jedi appears in the surrounding crowd, he senses others and calls to them, telling them to join him in his stand against the clone troopers. He is shot and killed soon after.\nJennir is in the crowd as well. He finds Hudorra and talks to him, saying that he isn't done fighting for the principals of the Republic. Hudorra plans to live a quiet life, maybe as a gambler. They part.\nHudorra throws his and Na's lightsabers in a random chute, and tells Na to say farewell to being a Jedi. They leave each other."}, {"tag": "p", "text": "On New Plympto, Jennir has sided with the Nosaurians and leads them in an attack on Imperial vehicles. This feels right for him."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}