{"url": "Bask_Modl", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Republic Navy captains"], "nodes": [{"tag": "h1", "text": "Bask Modl"}, {"tag": "p", "text": "Bask Modl was a male native of Bestine IV and an officer of the Republic Navy. Following the surprise assaults against the Galactic Republic by Mandalorian forces in 3963 BBY, he was promoted to the rank of captain for his heroics."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Bask Modl was a male native of Bestine IV, a high-gravity world of rocky islands, located in the Inner Rim. He served the Galactic Republic as an officer in the Republic Navy during the Mandalorian Wars. This war, between the Republic and the resurgent forces of the Mandalorians, began in the Outer Rim Territories, where the Mandalorians made a three-pronged assault against the Republic in 3963 BBY. In the aftermath of this assault, known by the Republic media as the \"Onslaught,\" Modl received a promotion to the rank of captain for his heroic efforts during the fighting. This promotion, reported in the Jimas Veltraa Memorial Edition of The Admiral's List, an official publication of the Republic Navy, occurred alongside that of notable officer Saul Karath to Rear Admiral."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Modl was a courageous soldier, and consequently recognized by the Republic Navy for his heroic efforts during the Onslaught."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bask Modl was created by John Jackson Miller, the author of the Knights of the Old Republic comics, and was mentioned in The Admiral's List: Jimas Veltraa Memorial Edition, appended to Knights of the Old Republic 13. This in-universe news source is designed as \"an official communique for the Republic providing news from the 'regular navy' point of view,\" inspired by the \"Napoleonic-era Britain's Naval Chronicle.\" Given that Bask Modl is only mentioned in passing, there is no indication of his species; however, Bestine has elsewhere been described as having Human colonists, albeit in a period 4,000 years after these events."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}