{"url": "Star_Wars:_Rebellion_(board_game)", "categories": ["Category:Real-world articles", "Category:Fantasy Flight Games", "Category:Legends miniatures games", "Category:Star Wars: Rebellion (board game)"], "nodes": [{"tag": "h1", "text": "Star Wars: Rebellion (board game)"}, {"tag": "p", "text": "Star Wars: Rebellion is a Star Wars Legends board game that reenacts the Galactic Civil War between the Galactic Empire and the Rebel Alliance. It was designed by Corey Konieczka and published by Fantasy Flight Games on March 31, 2016."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Star Wars™: Rebellion is a board game of epic conflict between the Galactic Empire and Rebel Alliance for two to four players!"}, {"tag": "p", "text": "Experience the Galactic Civil War like never before. In Star Wars™: Rebellion, you control the entire Galactic Empire or the fledgling Rebel Alliance. You must command starships, account for troop movements, and rally systems to your cause. Featuring more than 150 plastic miniatures and two game boards that account for thirty-two of the Star Wars™ galaxy's most notable systems, Star Wars™: Rebellion features a scope that is as large and sweeping as any Star Wars™ game before it."}, {"tag": "p", "text": "Yet for all its grandiosity, Star Wars™: Rebellion remains intensely personal, cinematic, and heroic. As much as your success depends upon the strength of your starships, vehicles, and troops, it depends upon the individual efforts of such notable characters as Leia Organa™, Mon Mothma™, Grand Moff Tarkin™, and Emperor Palpatine™. As civil war spreads throughout the galaxy, these leaders are invaluable to your efforts, and the secret missions they attempt will evoke many of the most inspiring moments from the classic trilogy. You might send Luke Skywalker™ to receive Jedi training on Dagobah™ or have Darth Vader™ spring a trap that freezes Han Solo™ in carbonite!"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Components"}, {"tag": "h3", "text": "Characters"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Starships"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Ground forces"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Gameplay Overview"}, {"tag": "p", "text": "Play of Star Wars: Rebellion takes place in the same time-span as the movies of the Original Trilogy, with the Rise of the Empire expansion expanding this timeline to include Rogue One: A Star Wars Story. The game creates an alternate history or timeline, with players getting to make their own choices with how they will carry out the Galactic Civil War, including control over details like where the Rebel Base is hidden and who is frozen in carbonite."}, {"tag": "p", "text": "The goal for the Imperial side is to discover the location of the Rebel Base and destroy the Rebel units that are present at it. The goal of the Rebel side is to earn victory points to advance the end of the game before Imperials have time to discover or destroy their base."}, {"tag": "p", "text": "Play is primarily centered around \"Mission cards.\" Are the start of each round of the game, both sides will select Mission cards from their hand, and assign a set of \"Leaders\" - famous Star Wars characters - to them. The next phase of the game constitutes the majority of gameplay, and players take it in turns to activate their Missions and move their units across the galaxy (passing from Rebel player to Imperial player after each action)."}, {"tag": "p", "text": "When a Mission is activated, players follow the directions on its card. Missions tend to introduce specific story elements and tactical advantages, allowing things as varied as training a character with Yoda, to relocating the Rebel base. A simple dice system controls the success of each mission, and the opposing player is allowed to assign their leftover Leaders to worsen the active player's odds of success."}, {"tag": "p", "text": "A player may also decide to use their turn to choose one of their Leaders they did not commit to a Mission to move units, in which case they place them on the intended space of the board, and are able to move friendly units from surrounding areas into it."}, {"tag": "p", "text": "The game ends when either side has met their specific victory condition."}, {"tag": "h2", "text": "Expansions"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}