{"url": "Star_Wars:_Purge", "categories": ["Category:Real-world articles", "Category:Star Wars: Purge"], "nodes": [{"tag": "h1", "text": "Star Wars: Purge"}, {"tag": "p", "text": "Star Wars: Purge is a comic book that was published by Dark Horse Comics in December 2005. It was written by John Ostrander and illustrated by Douglas Wheatley. It is the first in a series of one-shot comics set after the fall of the Galactic Republic."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "After Order 66, few Jedi dare to venture outside the shadows—rumors of the dark and terrible Darth Vader haunting even their waking moments. Yet, some Jedi find this life of fear unbearable. Now, a small band of Jedi have agreed to meet and discuss what should be done to oppose the Empire and its Sith Lords. However, the Empire is always watching, and Vader himself is eager to confront any Jedi that might bring him closer to the whereabouts of his betrayer, Obi-Wan Kenobi. Prepare for Jedi versus Sith action unlike any seen since the Old Republic in this special one-shot follow-up to Revenge of the Sith!"}, {"tag": "h2", "text": "Story summary"}, {"tag": "p", "text": "The story begins on Eriadu, a planet in the Outer Rim Territories. There, Imperial stormtroopers are searching for Jedi Master Tsui Choi. After Choi surprises them and defeats them, he is surprised by another Jedi survivor, Bultar Swan. Swan tells Choi of the imminent rendezvous of a selection of Jedi survivors of Order 66. The two head off to the notorious planet Kessel under Bultar's guidance."}, {"tag": "p", "text": "Meanwhile on Coruscant, Darth Vader completes his torture of Jedi Dama Montalvo by killing him, his reason being that Dama refused to give up the location of Obi-Wan Kenobi. Just then his master Darth Sidious arrives, and berates him for his lack of patience in his search for surviving Jedi and especially for his old master. Afterwards, a trooper informs Lord Vader that Imperial spies have information of the Jedi gathering."}, {"tag": "p", "text": "The person who has called this gathering is Shadday Potkin. Bultar and Tsui arrive, bringing the total number of Jedi in attendance to eight. The Jedi began to debate what should be done about the Empire and the purge of their order, and Koffi Arana proposes going to the dark side to stop Vader. As the Jedi ponder this, a dark presence is sensed arriving. It is none other than Lord Vader. Secretly, Shadday has \"invited\" the Sith Lord, by spreading rumors saying that Obi-Wan would be there, in hopes of the Jedi group being able to trap and overwhelm Vader. To help her do this, she also employs the use of a cortosis weaved blade."}, {"tag": "p", "text": "Vader quickly dispatches one of the Jedi, Sia-Lan Wezz, and while fighting the other Jedi, promptly disposes of another, Ma'kis'shaalas. Shadday is able to corner Vader and dispose of his lightsaber blade with the cortosis weapon, but then Vader uses the Force to grab Shadday. He conquers her weapon, then snaps her neck. Using the cortosis blade, Vader disables the lightsabers of Roblio Darté and Arana. The Aleena Choi manages to sever Vader's hand and, with help from the others, bring him to \"surrender\". Arana does not believe that Vader is sincere, and when Bultar protests and points out the Jedi do not take the lives of unarmed opponents, Arana takes Bultar's saber, kills her, and heads after Vader. However, he underestimates him and Vader sends the cortosis blade still held by his hand through Arana with a wave of the hand, and grabs a spare lightsaber dropped by one of the dead Jedi. The three remaining Jedi rally together, and use the Force to send debris hurling at Vader. Almost incapacitated, Tsui Choi finally decides that it is necessary to finish Vader off, when a contingent of stormtroopers show up, and begin firing. Jastus Farr is fired upon and falls to his death, while Choi distracts the troopers for a chance for Darté to escape. But due to unexpected interference from Vader it is useless, and the two remaining Jedi succumb to the barrage of blaster fire. Vader returns to Coruscant, where his purge of the Jedi conclave has been forged into a legendary rumor that states Vader tracked down a nest of fifty Jedi and destroyed them all."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There are a number of coloring inconsistencies insofar as lightsabers are concerned. For instance, Sia-Lan Wezz is depicted as wielding a green lightsaber when she initially charges Vader, but the color of the blade turns from green to pink in the panel that depicts Vader slicing off her hand."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "External links"}]}