{"url": "3C-FD", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Duwani Mechanical Products products", "Category:Utility droids"], "nodes": [{"tag": "h1", "text": "3C-FD"}, {"tag": "p", "text": "3C-FD was a 3C-series utility droid that operated during the Dark Wars. The droid was on the light freighter Ebon Hawk when it was coming back from the Unknown Regions carrying Meetra Surik—an ex–Jedi Knight also known as the Jedi Exile—returning to the Galactic Republic after her exile. 3C-FD helped the utility droid T3-M4, who was on a mission to find the woman, to repair the ship to adequate flying condition after a disastrous escape from the Sith. Together, the droids were able to pilot the ship close to the Peragus Mining Facility; 3C-FD, however, was destroyed by an HK-50 series assassin droid before the severely damaged ship and its unconscious passengers reached the docks of the facility."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "3C-FD was a 3C-series utility droid created by Duwani Mechanical Products during the time period of the Jedi Civil War and the Dark Wars. In 3951 BBY, 3C-FD was on board the light freighter Ebon Hawk when it escaped from the Sith-infiltrated Republic cruiser Harbinger by jumping to hyperspace, after taking a severe amount of damage. The unconscious former Jedi Knight Meetra Surik—known as the Jedi Exile, now returning to the Galactic Republic after her exile, was brought on board from the Harbinger by the utility droid T3-M4 and ex–Jedi Master Kreia, who were both attempting to find the Jedi and bring her to safety. When the ship emerged from hyperspace near the Peragus asteroid field around the planet Peragus II, it was drifting in space without functioning\nengines."}, {"tag": "p", "text": "The Ebon Hawk seemed lifeless, except for T3-M4, who began his attempt to fix the ship to flying condition. Within the cargo hold, he found a damaged 3C-FD and repaired the droid, inviting it to accompany him. The duo gathered components from a proton torpedo and parts that were scattered around the ship, and they used these for the required repairs. After repairing the hyperdrive, they restored power to the port engine. The starboard engine remained inoperative, but one engine was enough to make the ship spaceworthy, and T3-M4, with 3C-FD, was able to pilot the Ebon Hawk into the Peragus Mining Facility."}, {"tag": "p", "text": "Prior to the Ebon Hawk's arrival on Peragus Station, 3C-FD was shot several times and irreparably damaged by a stowaway HK-50 series assassin droid hiding aboard the Ebon Hawk. The Peragus officials placed the droid's remains into a quarantine locker, and were later found in there by T3-M4. Soon after these events, the facility was destroyed and 3C-FD with it."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "3C-FD was a typical Duwani-made utility droid. It had four wheeled legs, two of which were long and jointed toward the front. Including the droid's flat rotating head, 3C-FD was a bit under one meter high. The droid's equipment included a multi-functional arm, an auditory and sonar scanner, a radar eye, and visual sensors capable handling all base colors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "3C-FD was first introduced in Star Wars: Knights of the Old Republic II: The Sith Lords, a video game developed by Obsidian Entertainment that was first released in December 2004. The droid initially appears as a playable character in an option tutorial section called \"Prelude\" where the player learns how to interact with the world in the game while repairing the Ebon Hawk with T3-M4, and later in the Peragus Mining Station."}, {"tag": "p", "text": "There are at least two options for the player to use 3C-FD in Peragus: it can be issued a self-destruct code by T3-M4 in order to blast open the door to the locker from the inside, allowing T3 access to the ship's other gear. Alternatively, the door can be blasted open from the outside and 3C-FD merely abandoned in its broken state. Sometimes, when returning into the quarantine area, the game's program forgets to render 3C-FD as destroyed due to a scripting error. Therefore, the droid looks around, bounces, and beeps. When the player clicks on the droid, the text states that 3C-FD is destroyed beyond repair."}, {"tag": "p", "text": "The New Essential Guide to Droids, a 2006 Essential Guide written by Daniel Wallace, has an entry for 3C-FD, containing its technical data and a summary of the events that led to its destruction."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}