{"url": "Star_Wars:_Pit_Droids", "categories": ["Category:Real-world articles", "Category:1999 computer and video games", "Category:2012 computer and video games", "Category:Legends computer games", "Category:Legends mobile games"], "nodes": [{"tag": "h1", "text": "Star Wars: Pit Droids"}, {"tag": "p", "text": "Star Wars: Pit Droids is a game released by Lucas Learning in 1999. It is intended for users age 9 and up. You have to guide a number of pit droids to the Mos Espa Grand Arena from the droids' freighter. The game was re-released for iOS on February 9, 2012, but it was later removed from the app store."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "The pit droids go through 300 different puzzles, each randomly selected for eight levels. The droids proceed from their freighter before finally reaching the Mos Espa Grand Arena. In each puzzle, you need to get 48 droids into the portal; if you get only a few number of droids, you advance with only that number. With each puzzle you complete, you gain points. Each level you unlock, you get a humorous pit droids clip. The levels are located in Tatooine."}, {"tag": "p", "text": "There are many different numbers of different types of obstacles and restriction. With different types of arrows, you can also make your own puzzles."}, {"tag": "p", "text": "Depending on the puzzles, there are certain factors:"}, {"tag": "p", "text": "You must complete each puzzle with logic, problem solving, critical thinking, and visual thinking."}, {"tag": "p", "text": "Other game modes include creating a puzzle, or playing a scenario that has already been installed into the game."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Re-release"}, {"tag": "p", "text": "A version of the game was released for the iTunes App Store in 2012, but it was later removed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Credits"}, {"tag": "h3", "text": "Cast"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}