{"url": "Star_Wars:_Rebellion:_My_Brother,_My_Enemy", "categories": ["Category:Real-world articles", "Category:Star Wars: Rebellion story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Rebellion: My Brother, My Enemy"}, {"tag": "p", "text": "My Brother, My Enemy was the first story arc in the Star Wars: Rebellion series of comics."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "Mathematician Jorin Sol has been recovered from the clutches of the Galactic Empire and taken to the Rebel Fleet. Lt. Janek Sunber was horrified to see his childhood friend, Luke Skywalker leading the rescue attempt, but quickly moves on to another battlefield. During the battle, several close encounters with death leads him to believe he has a special destiny. He approaches Darth Vader to hatch a plan to ensnare the young Rebel."}, {"tag": "p", "text": "Meanwhile, Skywalker himself is caught up in the politics of war. He is forced to dodge the drunken advances of Deena Shan and receives a message from Sunber, who says he has been captured by the Empire and wants to defect. Disobeying orders, Skywalker and Shan liberate an assault shuttle and race to the station where Sunber is held. They board it and rescue Sunber, narrowly avoiding stormtroopers and Shan's former Imperial lover, Kale Roshuir."}, {"tag": "p", "text": "Back at the Rebel Fleet, they find that the brainwashed Jorin Sol has betrayed the location of the Rebel Fleet to the Imperial forces, and Darth Vader himself is leading the attack. The Rebel flagship is damaged in the attack, and Princess Leia was injured. Sunber holds her and Skywalker at gunpoint, but Skywalker pleads for Leia's life. Sunber relents and helps him, but a blast knocks him down into the bowels of the ship. Sol overcomes his brainwashing and launches the ship into hyperspace, only to die moments later in the fire. After the Rebel Fleet flees, the remaining Imperial ships recover an escape pod."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}]}