{"url": "Star_Wars:_Poe_Dameron", "categories": ["Category:Real-world articles", "Category:Star Wars: Poe Dameron"], "nodes": [{"tag": "h1", "text": "Star Wars: Poe Dameron"}, {"tag": "p", "text": "Star Wars: Poe Dameron is a comic book series written by Charles Soule and drawn by Phil Noto that focuses on the Resistance pilot Poe Dameron. Published by Marvel Comics, the series focuses on the events prior to the film Star Wars: Episode VII The Force Awakens; it also features the astromech droid BB-8 and centers around the Resistance's struggle against the First Order. The series was first announced on January 14, 2016 in advance of Marvel's regular April 2016 solicitations. The first issue was published on April 6, 2016, and it concluded with its thirty-first issue in September 26, 2018."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Star Wars: Poe Dameron was announced in a USA Today exclusive on January 14, 2016. It was announced as an ongoing title written by Charles Soule, with art by Phil Noto. The comic, set before the events of Star Wars: Episode VII The Force Awakens, focuses on the character of Poe Dameron during the events preceding his mission to Jakku as depicted in The Force Awakens. Because of Dameron's status as one of the breakout characters of the film, Soule said that Marvel Comics was well-positioned to tell a story about a character that people responded so well to—which does, of course, bring with it a pressure for him and Noto to ensure that they deliver a story worthy of the fan hype."}, {"tag": "p", "text": "The story itself would explore Dameron's status as the best pilot in the Resistance while serving under the command of General Leia Organa. His personality will also be fleshed out more, while the comic will explore locations that are both new and familiar, as well as bring in legacy characters and new characters alike—BB-8 included. Writing Dameron proved to be an interesting challenge for Soule, who also worked on the comic miniseries Star Wars: Lando. Unlike Lando Calrissian, who Soule had been familiar with for thirty years, Dameron was someone new and someone he had only thought of for a few months, so writing about Dameron was not \"as instinctive in some ways as writing a story about\" Calrissian. Soule likened the comic to a Dameron-centric Mission: Impossible film."}, {"tag": "p", "text": "Noto's approach to the art for the series included looking at X-wing reference material in order to develop the series' space battles, as well as looking at the films of Oscar Isaac, who plays Dameron. By studying how Isaac acts in The Force Awakens and in other films, Noto is able to better \"act that part out\" in his head while drawing. He would ask himself, \"How would Oscar Isaac act in this situation as Poe Dameron?\""}, {"tag": "p", "text": "During the events of the comic, Dameron leads a squadron with an important mission and must contend with the threat of the First Order, along with a new nemesis who intends to stop Dameron and find the missing Jedi Master Luke Skywalker. For Soule, the new era represented in The Force Awakens offered an opportunity for new archetypes and allowed him to create a villain who \"is going to feel fresh and cool.\" Soule did not anticipate there being a lot of flashback scenes, such as to Dameron's childhood with his parents, Shara Bey and Kes Dameron, who were introduced in the comic miniseries Star Wars: Shattered Empire. Instead, Soule's goal was to explore the story of Poe Dameron, who grew up with the legacy of the Rebel Alliance and the Old Republic, through Dameron's approach to situations and his interactions with other characters."}, {"tag": "p", "text": "After penciling issue 7, Angel Unzueta later took over as series artist with issue 14. Phil Noto continued to provide cover art for every issue of the series. The series was originally intended to conclude with the 25th issue, the end of the Legend Found story arc, however it was extended due to strong sales and reader support."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}