{"url": "Star_Wars:_Rebel_Assault", "categories": ["Category:Real-world articles", "Category:1993 computer and video games", "Category:Legends console video games", "Category:LucasArts games", "Category:PC games", "Category:Sega CD games", "Category:3DO games"], "nodes": [{"tag": "h1", "text": "Star Wars: Rebel Assault"}, {"tag": "p", "text": "Star Wars: Rebel Assault is the first CD-ROM-only game published by LucasArts, set in the Star Wars universe during the early Galactic Civil War. The game was followed by Star Wars: Rebel Assault II: The Hidden Empire."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The game follows the adventures of an unnamed young person known under the handle of Rookie One. Who like Luke Skywalker, is a farmboy or farmgirl from Tatooine (the player can choose the gender) who decides to join the Rebel Alliance. The whole game happens during the events of A New Hope and begins with his/her flight training in the Beggar's Canyon, some hours before the Devastator captures Tantive IV above Tatooine."}, {"tag": "p", "text": "Rookie then joins a squadron to intercept the Devastator and after the mission is over they descend back to the planet in order to stop an Imperial assault on Tatooine. The Rebel base is destroyed and Mos Eisley receives an attack with AT-ST's which the player has to wipe out."}, {"tag": "p", "text": "The story then leads the player to the ice planet Hoth, where Rookie will have to stop the AT-AT walkers with a snowspeeder and then escape the Gamma Base (which resembles Echo Base) firing his/her way through the Stormtroopers in a sequence that reminds of the Battle of Hoth, escaping from the planet just before it is destroyed by the Death Star."}, {"tag": "p", "text": "The player eventually guides Rookie through the training on Yavin 4 preparing the attack on the trench run prior to the Battle of Yavin. The final missions follow the actions of the Blue Squadron (Ironically Blue Squadron was the original script Red Squadron of ANH fame), simultaneously to the Red Squadron shown in the movie. They take place near and on the Death Star where the player has to destroy turrets, stop a gigantic laser gun and finally destroy it in place of Luke Skywalker."}, {"tag": "h3", "text": "Chapters"}, {"tag": "h2", "text": "Canonicity"}, {"tag": "p", "text": "Star Wars: Rebel Assault was produced at a time when there was less strict attention paid to ensuring games were in continuity with the rest of canon. This has led to confusion for some over its canonicity; for instance, with regard to Rookie One making a trench run against the Death Star, or a battle occurring on Hoth prior to the Death Star Assault. However, the only portion of the game that has been declared non-canon is the trench run by Rookie One. Indeed, many elements from Star Wars: Rebel Assault have been involved in later continuity, such as Anchorhead Base in Star Wars Galaxies and Jake Farrell in The Complete Star Wars Encyclopedia, as well as many elements were also used in the sequel to Rebel Assault, Star Wars: Rebel Assault II: The Hidden Empire."}, {"tag": "p", "text": "In reference to certain other LucasArts video games, Leland Chee, known as the Keeper of the Holocron, has stated that the \"Story is S [canon], but locations, characters, and technology are C [canon].\" This policy has never been stated to apply to Rebel Assault."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "Although the scenario, the plot and the variety of missions were neither original or rich, the game's value consisted mainly on the technical part, since it featured digitized footage and music from the original movies, full speech and high quality 3D-rendered graphics. The \"chapters\" of the game were meant to be reminiscent of events and battles of the movies."}, {"tag": "p", "text": "In fact, the game hinted mainly on impression giving us an alternative storyline of the Original trilogy by recreating famous scenes, rather than being accurate to Star Wars canon: it follows the events of Star Wars: Episode IV A New Hope, but it erroneously contains elements from the Battle of Hoth. The Battle of Yavin is significantly different while the Death Star is destroyed by a character other than Luke Skywalker."}, {"tag": "p", "text": "The gameplay consists of various spaceflight missions, mainly confined in a certain video looping. The course of the ship is predetermined and the player has to hit the targets (usually TIE Fighters) that show up and partially control and steer the ship so that it won't collide to some obstacles and lose hit points."}, {"tag": "p", "text": "In some cases, original footage was filmed for the game with actors, and in a case, a Star Destroyer model was digitized (a mini camera \"flew\" around it) for the needs of a certain mission. Most of the graphics were rendered in 3D. The cockpits were borrowed from the earlier Star Wars: X-Wing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "See also"}, {"tag": "h2", "text": "External links"}]}