{"url": "Star_Wars:_Shadows_of_the_Empire_(Galoob)", "categories": ["Category:Real-world articles", "Category:Star Wars: Shadows of the Empire (comics)"], "nodes": [{"tag": "h1", "text": "Star Wars: Shadows of the Empire (Galoob)"}, {"tag": "p", "text": "Star Wars: Shadows of the Empire is a mini comic book included in some of the Galoob Micro-Machines. For the most part it's a reprint of some parts of original comic, but includes some original scenes by Ryder Windham and illustrator Bill Hughes. Each of these three mini-issues have different covers, but the same interior story."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The comic starts with the scene of Luke getting his cybernetic hand as seen at the ending sequence of Star Wars: Episode V The Empire Strikes Back. The story then switches to the battle between Boba Fett and IG-88D, already depicted in the original comic, Kenner special and Battle of the Bounty Hunters pop-up comic. Another scene shows Darth Vader testing his lightsaber skills on an ASP-series droid. After destroying it, Vader remarks that he \"has almost recovered after his fight with Skywalker\". He is then contacted by the Emperor, who orders his servant to forget Skywalker and to go oversee the construction of the Second Death Star. Xizor overhears Vader's intent to deliver Skywalker alive. He orders Guri to contact every bounty hunter in the galaxy and order them to kill Skywalker. The next scene shows Dash Rendar arriving on Gall and seeing Boba Fett's ship, Slave I. Remembering that Lando Calrissian was willing to pay for Fett's location, Rendar contacts him. Meanwhile on Tatooine, Luke Skywalker is sitting in Ben Kenobi's hut, building his new lightsaber. R2-D2, C-3PO and Princess Leia worry about Luke, who \"has changed\" since his duel with Darth Vader. Suddenly, Lando appears, informing of Rendar's discovery. The group then sets off to Gall. The final scene shows Guri telling Xizor that all bounty hunters has been alerted, to which he replies that \"the future promises to be most...interesting\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Other cover versions"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}