{"url": "Star_Wars:_Secrets_of_the_Empire", "categories": ["Category:Canon articles", "Category:Incomplete lists", "Category:Virtual reality attractions"], "nodes": [{"tag": "h1", "text": "Star Wars: Secrets of the Empire"}, {"tag": "p", "text": "Star Wars: Secrets of the Empire is a virtual reality experience created by ILMxLAB and written by David S. Goyer for location-based VR company The Void. It opened on December 16, 2017 in Orlando and January 5, 2018 in Anaheim. It was also given a limited 12-week release in London on the same day as its Orlando release. It is currently open in multiple locations across the globe."}, {"tag": "p", "text": "The experience puts guests in the boots of Rebel operatives who must infiltrate an Imperial facility on Mustafar while disguised as Stormtroopers."}, {"tag": "h2", "text": "Story"}, {"tag": "p", "text": "An urgent message from Captain Cassian Andor informs four Rebel operatives that they need to take his place on a mission to Mustafar to steal a powerful weapon from the Galactic Empire. Disguising themselves as Stormtroopers, the operatives land on the planet's surface with the help of K-2SO."}, {"tag": "p", "text": "The experience lasts over the duration of the mission as they infiltrate an Imperial facility in search of the weapon."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "When guests first enter the briefing room, they meet Captain Cassian Andor via a video transmission. He informs them that he has discovered that a weapon of great power is being held by the Empire on a base on Mustafar. He cannot personally go in search of it because his position has been compromised, so he sends the four guests — taking on the role of Rebel operatives — in his place."}, {"tag": "p", "text": "Guests then enter an Imperial transport, joined by K-2SO and the ship's pilot, Athex. The team proceeds to Mustafar through hyperspace. The Imperial base is not happy to learn of the ship's arrival, and demands the ship land for inspection."}, {"tag": "p", "text": "After infiltrating the base with the aid of a hover platform, the four Rebels find a rack of blasters, only to have their presence detected. After escaping the facility, the Rebels are trapped outside, where they have to contend with attacking Stormtroopers and hostile beasts from the planet's surface."}, {"tag": "p", "text": "Eventually they're able to find their way back into the facility, and discover the weapon mentioned by Captain Andor: an ancient lightsaber of unknown origin. The Rebels are then ambushed by even more Imperial troops, but thanks to some quick action taken by K-2SO they are able to escape with their lives, and make the jump to hyperspace."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "The players are first met in a small room which holds a screen and provides the mission briefing. Then are then directed to a bay where they strap on a VR headset and backpack."}, {"tag": "p", "text": "Guests all appear as Stormtroopers, with individually colored Pauldrons and hand armor. The experience tracks guests' individual fingers without the need for external controllers. The blasters that guests interact with have two triggers, but only the main trigger is used during the experience."}, {"tag": "p", "text": "The Void platform utilizes physical sets, locations, and objects that map directly to the digital environments that guests see in their headsets — so if there is a wall, guests can touch it, and if they see a chair, they can actually sit down in it. In addition, The Void incorporates sensory feedback like haptic vibrations, smell, and heat to bring the virtual environments and characters to life."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}