{"url": "Star_Wars:_Shadows_of_the_Empire", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Star Wars: Shadows of the Empire"], "nodes": [{"tag": "h1", "text": "Star Wars: Shadows of the Empire"}, {"tag": "p", "text": "Star Wars: Shadows of the Empire was a multimedia project release by Lucasfilm Ltd. in 1996. A multitude of products were released, including a novel, comic series, video game, trading cards, soundtrack, and toy line. The story is an interquel between the films Star Wars: Episode V The Empire Strikes Back and Star Wars: Episode VI Return of the Jedi."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "The following is a summary of all sources of the Shadows of the Empire saga, including some information from the tie-ins:"}, {"tag": "h3", "text": "Battle of Hoth"}, {"tag": "p", "text": "Hotshot smuggler and mercenary Dash Rendar with his droid co-pilot Leebo arrive at Hoth to deliver the usual food supplies to the secret Rebel base there; along with some assault blasters for Princess Leia Organa. When he docks in the hangar, he is surprised to run into Han Solo, who had become involved with the Rebellion since their last meeting. Their meeting is cut short because of an advancing Imperial force. Dash instructs Leebo to load their cargo into the evacuating transports and to retrieve their payment as he joins Rogue Squadron for the upcoming battle. On Solo's recommendation, Commander Luke Skywalker agrees to give Rendar an unused T-47 snowspeeder into combat."}, {"tag": "p", "text": "In the ensuing battle, Dash flies against the approaching walkers, AT-ST and Viper probe droids, succeeding in destroying some of the AT-AT walkers before the Imperials destroy the Base's deflector shield generator and the Rebels are forced to withdraw. Dash is left behind as the base is overrun by snowtroopers who have destroyed the main generators; Leebo warns Rendar that the hangar doors of Bay 3 could not be opened to allow the Outrider to leave until power was restored. Fighting his way through the Imperial forces, Rendar proceeds to the base's lower level and activates the emergency generators, restoring power to the hangar door. As he makes his way back to Bay 3, he ends up before an AT-ST, which he manages to destroy with a rocket launcher. Leebo takes control of the Outrider, leading it through the Hoth asteroid belt while Rendar uses the ship's gun turret to fend off the TIE Fighter and TIE bomber attackers. After clearing the asteroids, the Outrider jumps to safety and Rendar rejoins the Rebels."}, {"tag": "h3", "text": "Search for Boba Fett"}, {"tag": "p", "text": "Aboard the Redemption, Leia is informed that an Imperial Strike Cruiser has spotted the fleet; Wedge Antilles leads the Rogues into a space battle so that their rendezvous point remains secret. Leia meanwhile understands that Luke is different after his encounter with Darth Vader and wonders what happened between them."}, {"tag": "p", "text": "On the Executor, Vader is contacted by Palpatine who chastises him for his failure to capture Luke on Bespin. He then orders Vader to conclude shipping arrangements of the Death Star II plans with the Black Sun crimelord Prince Xizor; a discussion which Xizor oversees being a guest to the Imperial Palace. Xizor realizes that this young Skywalker who is hunted by the two Lords of the Sith, might be related to Vader. On his way out, Xizor explains to his servant Guri, that he intends to kill Luke and discredit Vader, while improving his prestige before the Emperor. Guri has made her arrangements with bounty hunters and Xizor is ready to meet Jabba Desilijic Tiure."}, {"tag": "p", "text": "The Slave I carrying Han Solo in carbonite block, exits hyperspace above Tatooine and Boba Fett hopes to deliver it to Jabba; but discovers that a signal beacon -installed when he was on Cloud City- was activated. The IG-2000 arrives and he has a dangerous encounter with IG-88D, who intends to claim the bounty of Solo. Slave I sustains some damage but Fett outwits the droid. Thinking that it is destroyed, Fett retreats to planet Gall for repairs; but the droid also managed to survive and limps off to Ord Mantell to search for spare parts for the ship in the planet's scrapyard."}, {"tag": "p", "text": "Luke and Leia end up on Tatooine. Luke had performed a Jedi mind trick to the guard of a circus tent, and practices his abilities on the acrobat string, while contemplating his training with Yoda, the Force, and meeting with Vader. Leia sleeps inside Ben Kenobi's hut and has a nightmare, remembering the capture of Han and their last kiss."}, {"tag": "p", "text": "Xizor in his palace ponders on his plans to overthrow Vader and his other underground business, such as hiring the Pike Sisters and meeting his lieutenant Mayth Duvel who gives him a precious rare ruby from Nezriti Organization; it does not impress Xizor the least."}, {"tag": "p", "text": "In his castle, Vader tests his injured shoulder by battling an ASP droid with a lightsaber, while briefing his agent, Wrenga \"Jix\" Jixton about his foresight that Luke will approach Jabba to rescue Han. Jix is sent to Tatooine to join Jabba's gang both to capture Luke, and ensure his survival."}, {"tag": "p", "text": "Meanwhile, Lando wanted to redeem himself of his treachery and had sent Rendar to discover traces of Han Solo. Having tracked IG-88 on Ord Mantell, he is sent there to learn Fett's whereabouts. IG-88D hid in a salvage plant which, as Leebo scans show, is connected with a hover train. Rendar rides one whose tracks run parallel to those of the train that lead to his destination. As the two trains move alongside each other, Rendar leaps across the gap and makes his way to the front. Leebo then manages remotely to jam the hovertrain's auto-brakes, causing it to crash and break the door of the salvage plant. Inside, Rendar finds IG-88D who reveals that he had indeed tracked Fett to the Zhar system. Unwilling to let Rendar stop him from taking Solo from Fett, the droid opens fire. Rendar fights back and defeats the droid."}, {"tag": "p", "text": "Back on Tatooine, Leia and Chewie are waiting in Chalmun's Spaceport Cantina for Lando, as Chewie defends Leia who is being harassed by suspicious figures. Finally Lando shows up with Threepio and Artoo and narrates Rendar's information that Han has been found."}, {"tag": "p", "text": "On Coruscant, Vader finishes his diplomatic debate with Xizor, during which he attempted to look superior and more polite than Vader. Finally, the two arrange 300 ships from Xizor Transport Systems (XTS) for the construction of the Death Star II on Endor. Xizor walks in a luxury hall while a man, Hoff, makes an assassination attempt against him; Xizor kills him single-handedly. The event is watched by Palpatine and Vader, who suspects that Palpatine orchestrated the attempt, only to test Xizor."}, {"tag": "p", "text": "Luke, in Kenobi's hut, attempts to construct a new lightsaber following a book left for him by Ben. He ponders his memories of him and the adventures in Cloud City when he sees his Rebel friends coming. They tell him about Fett's whereabouts; while thinking on how to get there and approach the bounty hunter, Chewie proposed to ask help from the Rebellion."}, {"tag": "p", "text": "On Coruscant, Xizor is in a meeting of Black Sun \"Vigos\". Several agents are present: Durga, Kreet'ah, Clezo, Wumdi, Perit, and Green. Knowing Green's ambitions and network of double agents, Guri strangles him in order to intimidate other ambitious Vigos and make a point that Xizor does not tolerate such cooperatives. When the meeting is concluded, Xizor summons Jabba to meet him."}, {"tag": "p", "text": "Vader is naked in his medical chamber and ponder his meeting with Luke. He attempts to Force heal a part of his body and succeeds, but the satisfaction cuts his tie with the dark side and the healing collapses."}, {"tag": "p", "text": "Rendar has headed to the Imperial moon base on Gall in the Zhar system to confirm Fett's presence. Having landed in Smuggler's Gorge he makes his way through Imperial patrols along the cliffside before reaching the entrance to the base through which he fights his way to the observation tower. Once there, he accesses the computer and learns that Fett was docked in the second tower, on the other side of the nearby canyon. Stealing a jetpack, Rendar crosses the canyon and arrives to a large hangar containing an AT-ST. After disabling it, he opens and follows the facility's ventilation system near a waiting hoversled with which he reaches the Slave I. But Fett is also there; the two mercenaries open fire until Fett flees into his ship. Slave I takes off and Fett tries to aim its weapons against Rendar, who is able to damage the ship with his rocket launchers."}, {"tag": "p", "text": "As Luke continues tampering the lightsaber jewel in the company of his friends, Lando arrives bringing confirmation by Rendar that Slave I is on Gall."}, {"tag": "p", "text": "Meanwhile, Xizor welcomes Jabba who came from Tatooine. During their conversation Jabba gives out that the smuggler Solo was an affiliate to Skywalker, and that his delivery was delayed. When Jabba leaves, Guri puts out the information that the bounty hunters after Skywalker would be advised to locate Boba Fett."}, {"tag": "p", "text": "Meanwhile, the rebels are on board the Millennium Falcon on their way to Gall's moon, Kile. Chewie plays a game with Threepio (probably dejarik), and Lando makes a failed attempt to prepare \"Giju stew\" for dinner."}, {"tag": "h3", "text": "Battle of Gall"}, {"tag": "p", "text": "Luke, Leia, Lando, and Chewie meet Wedge and the Rogues on Kile and are reintroduced to Dash Rendar. Wedge briefs the new arrivals on the layout of the Imperial base and two Star Destroyers, each with a wing of starfighters. Skywalker proposes to attack, drawing off the defending TIE fighters, while Rendar leads the Falcon and its crew to Fett's coordinates."}, {"tag": "p", "text": "After his defeat by Rendar, Fett meets Bossk and Zuckuss in a cantina, who negotiate with him to share the bounty of Han. He firmly refuses and takes out a sniper placed to ambush him. Then his system warns him that Slave I has been breached."}, {"tag": "p", "text": "Vader is in his castle, doing lightsaber training with an ASP droid. The slight ache in his shoulder where Luke had cut through his armor during their fight feels better to him."}, {"tag": "p", "text": "Meanwhile the Rogue Squadron attacks the Star Destroyers above Gall, and Luke hones his Force skills. Dix Rivan is killed, and the second Star Destroyer starts to approach. As the Falcon follows the Outrider on the planet, Rendar dares Lando's piloting skill, as Lando tells Leia about Rendar's past. To avoid Imperial sensors, they fly few meters above the trees and then into the Grand Trench. After they pass the sensor station and lift out of the canyon, they come to the shipyard where Slave I is. Less than a minute away from the target, however, Rendar leaves, being hired to lead, not fight. Cursing, Leia and Lando man the turrets to fend of the TIEs as they approach Fett."}, {"tag": "p", "text": "Above the planet, as the Rogues retreat in a mock hyperspace jump, Wes Janson's malprogrammed R2 seizes control of his X-wing and attempts to shoot Luke down. After avoiding it, Luke manages to shoot Wes' R2. The Rogues land on Kile and examine Wes' Artoo. It was malprogrammed by an agent. Rendar arrives on the base explaining to Luke and Wedge why he was forced to withdraw."}, {"tag": "p", "text": "Meanwhile, Fett arrives at Slave I to find 4-LOM with other bounty hunters attempting to steal Solo's slab and shoots them down, before seeing the Falcon approaching and takes off. The Falcon has sustained too much damage and Fett's departure marks the failure of the mission."}, {"tag": "p", "text": "Luke and Wedge find that Janson's droid had been programmed by their technician Viera Cheran, who attempts to shoot Luke, before being shot by Wedge. As Luke welcomes Leia, Lando, and Wedge investigate her account and discover 10,000 credits paid by dummy corporations, tracing to Saber Enterprises. Being a front organization for the Empire's anti-espionage operations, they believe that she was paid by Vader."}, {"tag": "p", "text": "On Coruscant, having just ended the relationship with his mistress, and dined at Menarai, he sends Guri to Ororo Transportation, a rival to Black Sun, and arranges a second meeting with Vader."}, {"tag": "p", "text": "Leia decides to contact an underground organization and find out who who wants Luke dead. Unfortunately she decides to ask Black Sun, unaware that this is the very organization they are looking for. Luke is sent to follow Fett on Tatooine, again not knowing that Xizor already expects him to do so so. However, she also secretly hires Rendar to follow and protect him."}, {"tag": "p", "text": "Xizor visits the Emperor's skyhook and meets Vader. Presented as a faithful servant to the Empire, he gives the largest Vergesso asteroid in the Lybeya system, as a secret Rebel shipyard. In reality the Vergesso Base belongs to Ororo Transportation. Palpatine sends Vader and Admiral Okins to destroy the \"Rebel\" base, an order which is a setback to Vader's plans to watch over Xizor."}, {"tag": "h3", "text": "Hunting the Assassins"}, {"tag": "p", "text": "Lando and Leia travel to Rodia, where they meet Avaro (Greedo's uncle), who promises them to bring a contact of Black Sun."}, {"tag": "p", "text": "Back on Tatooine, Luke is in Ben's hut finishing his lightsaber. Meanwhile Jixton has arrived in Mos Eisley, and manages to challenge and impress Big Gizz and his gang by stealing Spiker's swoop bike and thus gains a job for Jabba. He is puzzled to learn that Jabba got a transmission that Vader (actually Xizor) wants Luke dead, which interferes with Vader's instructions to ensure Luke's survival. After a discussion in Chalmun's cantina that Dash overhears, Jix and the gang race over to kill Luke. Dash steals a swoop and runs after them."}, {"tag": "p", "text": "Luke is testing his lightsaber with Artoo when he sees the bikers arriving. He takes out one of the riders, kick one off and take his swoop to flee towards Beggar's Canyon. During the frail, Luke is unknowingly aided by Jix who sabotages his fellows' attempts to hit Luke. The pursuers are halved and Luke loses them by passing through the Stone Needle when Rendar arrives, drops into the canyon and opens fire causing them to scatter and flee. Big Gizz remains hidden and attempts to shoot Luke, but Jix hit his head with a stone."}, {"tag": "p", "text": "While Vader is en route to the Vergesso asteroid, Xizor visits Palpatine and reveals that he was the \"generous\" informant of the secret \"Rebel base\". Vader concludes the battle in his Interceptor, and on his way back he contacts the Emperor. Enraged, he sees Xizor in the hologram beside him."}, {"tag": "p", "text": "Back in his Palace, Xizor is informed that Leia attempts to contact Black Sun. Charmed by her beauty, he sends Guri to bring her. He then watches a recording of Guri's earlier meeting with the heads of Ororo Transportation, Z. Limmer, Tuyay, and Dellis Yuls; killing them after denying to cooperate with Black Sun."}, {"tag": "p", "text": "Having Dash explained that he was sent by Leia, and the gang belonged to Jabba, Artoo detects the approach of a courier droid. It is carrying a message from Koth Melan to Leia, claiming to have vital information for the Alliance and requesting a meeting as soon as possible on Bothawui. Skywalker decides to go, followed by Rendar."}, {"tag": "p", "text": "On Coruscant, as Vader expresses his concerns on giving the Death Star plans to the Rebels, Palpatine says that he knows best. Leia gets tired waiting for Black Sun and Avaro explains that it's not up to him, not knowing that Guri is already coming for her. Before that, she sends the route of Suprosa to their Bothan double agent."}, {"tag": "p", "text": "Meanwhile Fett hides in an asteroid field when 4-LOM resumes operation. Before Fett disables him once more, Bossk's ship picks up his signal and attacks a stranded Slave I. Zuckuss and his team board the ship and apprehend Fett. As Furlag leads him to the force cages, Fett opens a trapdoor under his feet and gets his weapon. He kills everyone but keeps Zuckuss alive to communicate with Bossk. He sends Bossk's shuttle back to him; when Bossk's colleague looks inside he sees his fellows dead, along with a detonation device, when Fett jumps to hyperspace."}, {"tag": "p", "text": "Luke and Dash make their way to the Intergalactic Trade Mission on Bothawui. Rendar bribes a guard but on the 16th floor, the protocol droid R0-4 refuses to let them in without an appointment until Rendar pulls his blaster. The Bothan accepted the pair as Leia's representatives, explaining about a new unknown Imperial military project. A secured supercomputer containing the plans is being transported from Coruscant to Bothawui aboard the Suprosa, a Mobquet Medium Transport masquerading as a fertilizer freighter. Melan plans to capture it and had put together a team for the mission, joined by Skywalker and Rendar, who looked forward to an extra reward. In a hidden base outside the city, they meet the Blue Squadron."}, {"tag": "p", "text": "On Coruscant, as Vader expresses his concerns on giving the Death Star plans to the Rebels, Palpatine says that he knows best."}, {"tag": "p", "text": "Lando, Chewie and Leia pass a long time in Avaro's casino. Lando gambled and played and won most of his games while Leia was fed up waiting. Eventually Avaro tells her that Guri would meet them shortly."}, {"tag": "h3", "text": "Capturing the supercomputer"}, {"tag": "p", "text": "Guri's Bothan agent brings the route plans of the Suprosa to the Bothan Spynet, and Blue Squadron, joined by Ace Azzameen of the Rebel Alliance, move to the coordinates."}, {"tag": "p", "text": "The vessel doesn't surrender as Luke demands and the Y-wings start disabling the engines. The Suprosa opens fire, destroying a ship and the Bothans break off to regroup. As they pull back, the freighter fires a Diamond Boron Missile. Rendar fails to shoot it down and it destroys a group of four Y-wings, killing eight Bothans and another two. Despite the losses, the Rebels soon disable the freighter and Rendar takes the Outrider in to conduct the boarding operation. He docks the Outrider and boarded the freighter to look for the supercomputer."}, {"tag": "p", "text": "Following Leebo's directions, Rendar works his way towards the main cargo hangar, encountering heavy resistance from the crew and Stormtroopers. Upon reaching the hangar, Rendar destroys a loader droid which attacked him with spring-loaded arms. After Rendar located the supercomputer and disabled the hangar force field, Leebo brings the Outrider into the hangar to collect the smuggler and the supercomputer."}, {"tag": "p", "text": "On Rodia, Guri inspects the Rebels at the Next Chance casino. After a brief meeting she cuts it short claiming that she has business to attend, leaving the Rebels with the distinct impression that there was something unusual about her."}, {"tag": "p", "text": "On the Outrider, Koth and Luke discuss about the supercomputer's significance while Dash blames himself for missing the missile. Luke sends Dash to Rodia to find Leia. Himself and Koth moves to Kothlis with Koth. En route to Kothlis, the party is attacked by Claw and Hunter which are driven off by Blue Squadron, and a special Bothan encryption team arrives at Kothlis to attempt to bypass the self destruct device of the supercomputer."}, {"tag": "p", "text": "Guri reports to Xizor that Leia is dangerous and advocates killing the Rebels. However, Xizor has other plans and asks her to be brought to Coruscant. He then meets Palpatine showing recordings of how successfully the plans entered Rebels' hands. With securing the plans, the Alliance gains trust in Xizor. The plans are in truth, outdated, and the second Death Star is fully operational, unlike what the schematics read."}, {"tag": "p", "text": "Lando installs a doppraymagno scanner in their hotel room waiting for Guri, before notified that Dash arrived on Rodia and welcome him. Guri then returns to Rodia and during their meeting, the scanner quickly confirms Leia's suspicions: Guri is not Human. C-3PO puts a sleeping potion in her tea, so that they can conduct a closer examination but it fails; the two continue to trade diplomatic small-talk until Guri, tired of proceedings, attempts to abduct Leia only to be restrained by Lando, Chewbacca, and Dash."}, {"tag": "p", "text": "Luke and Koth and a Bothan special decryption team work on the supercomputer in the safehouse until bounty hunters break in. During the skirmish, a Bothan takes the supercomputer and hides it. Koth is killed, and Luke is captured, learning there there are two rewards on his head, both alive and dead. Unknown to him, it is Vader who wants him alive and Xizor who wants him dead."}, {"tag": "p", "text": "After much discussion between Leia, Guri, and Xizor, Leia and Chewie follow Guri to the Stinger and move to Coruscant. To allow the two to make it safely, Guri provides for them the disguises of of the Ubese bounty hunter Boushh, and Snoova. Meanwhile Lando is told by Dash that Luke remains on Kothlis and moves there."}, {"tag": "p", "text": "Palpatine sends Vader to Kothlis, both to take Luke, and also pretend that he is there to reclaim the supercomputer. Once more, this order foils Vader's plans to watch over Xizor. Meanwhile Luke in his cell manages to control the mind of his guard who is get to lock himself in the cell and take a nap. Luke exits and takes his lightsaber and comlink."}, {"tag": "p", "text": "On Coruscant, after \"Boushh\" and \"Snoova\" had made it through the customs of Coruscant, Leia meets Spero, a Ho'Din who owed her a favor, and gives some information about Black Sun."}, {"tag": "p", "text": "On Kothlis, bounty hunters discover Luke who wards them off. Then Lando shows up in an explosion and escapes with Luke on a stolen landspeeder. They depart on the Falcon for Tatooine, as the Executor has just arrived. Meanwhile the Death Star plans managed to reach the Razor over the planet."}, {"tag": "p", "text": "Skywalker is gone and Vader learns from Skahtul that someone wants Luke dead, with suspicions that this bounty comes from Black Sun."}, {"tag": "p", "text": "Leia and Chewie meet Guri again. They follow Howzmin and enter a maglev car that will bring them to Xizor's palace. Xizor hosts the visitors and provides them each with appropriate commodities."}, {"tag": "p", "text": "Meanwhile, Fett fixes Slave I's lasers and tells Zuckuss his plans on delivering Solo to Jabba."}, {"tag": "p", "text": "The Falcon's hyperdrive has failed to start and Vader feels Luke somewhere near an asteroid and sends pilots to investigate as Lando tries to repair the problem. However, Luke feels him approaching. The Falcon manages to leave the field and is ready for hyperspace, three dozens of TIEs come in. The ship enters hyperspace in the nick of time for Tatooine. Angered that his prey was lost, Vader orders to bomb a \"suspected Rebel base\" on one of the Kothlisian moons."}, {"tag": "p", "text": "In Jabba's Palace, Jix gets past security and makes contact with Vader on the Executor in order to inform him of the swoop bike incident with Luke. Vader learns that Jabba, too, had a bounty for Luke dead, put by someone who used Vader's name."}, {"tag": "p", "text": "Howzmin brings Chewie to Leia's room. Chewie looks strangely at Leia who prepares for him, and she excuses herself, claiming she is on a diplomatic mission. All that while Xizor was preparing his pheromones for meeting her in meditation. While the Falcon is en route to Tatooine, Luke feels Leia is in danger, despite Lando's reassurance."}, {"tag": "p", "text": "Leia attempts to negotiate with Xizor about business between the Alliance and the Black Sun, and then reveals that she is there for Luke, as Xizor kisses her. After an intense seductive experience, Leia is interrupted by Chewbacca who shows her microphones and cameras; she then instructs him to escape and notify Luke. Meanwhile Vader's returns to Coruscant and reports to the Emperor about the loss of Skywalker. He mentions that Xizor might be the one who wants him dead. Palpatine gives him a leave to look for Skywalker."}, {"tag": "p", "text": "Leia eventually retakes control of herself, and after she buys some time to let Chewie escape, she knees Xizor between the legs. He is outraged, and sends her back to her room. Chewie is intentionally allowed to \"escape\" (although not so easy) hoping that he would lead Luke to rescue Leia, and into Xizor's hands. He is not worried at all that Luke escaped Kothlis or Vader's bidding."}, {"tag": "p", "text": "Luke insists contacting Leia and receives a message from Chewie who tells that she is in danger. They change course for Coruscant. With some flying tricks they evade sensors, hide in \"sensor shadow\" and land on the planet uneventfully."}, {"tag": "h3", "text": "Lair of the Dark Prince"}, {"tag": "p", "text": "Luke, Dash, Lando receive a message from Chewie and head for Coruscant where they meet; they stealthily make their way through the sewers of Black Sun in order to enter Xizor's palace. Using the Force, Luke and his thoughts inform Leia that he and the group are close by and will soon rescue her from Xizor. After much blasterfire with security guards with Luke integrating his increasingly advanced lightsaber skills, the group finds Leia and begins to lead her out of the palace."}, {"tag": "p", "text": "They enter a hallway with Xizor, Guri, and several more of his aides, and a battle soon commences wherein Xizor and Guri are impressed with Luke's skills as a Jedi. Luke and Lando soon threaten Xizor with thermal detonators that they send down the garbage chute, causing everyone to panic and scatter out of Xizor's palace."}, {"tag": "p", "text": "The Millennium Falcon, piloted by R2-D2 and C-3PO, wildly careens toward Luke and company, allowing them to escape onto the vessel above Coruscant."}, {"tag": "p", "text": "Xizor boards his skyhook, then sends four of his own starfighters at the Rebels, with Dash defending them with flak from the laser turrets of the Outrider. Rogue Squadron arrives in X-wings, and a fierce fight is already underway when TIE fighters show up, but the TIEs attack only Xizor's fighters. During the fight, Guri, Xizor's assassin human replica droid, manages to escape using a paraglider."}, {"tag": "p", "text": "When an angry Xizor demands that Vader tell him why Imperial forces are also attacking him, Vader confronts him via hologram on board the Executor over Coruscant. He tells Xizor that he warned him to stay away from Luke, but Xizor willfully disobeyed those orders. When Xizor does not comply with his ultimatum to stand down, Vader orders the Executor to destroy the Skyhook."}, {"tag": "p", "text": "There is a great explosion wherein the Outrider is thought to be destroyed when Dash actually makes a jump to hyperspace at the last moment, as he is convinced that his experiences with the Rebels have been too dangerous while there is too much money to be made elsewhere."}, {"tag": "p", "text": "On Tatooine, Fett fools the stalking bounty hunters with a disguised Zuckuss and a covered up 4-LOM that would seem to be himself and a carbonite block speeding away from the Slave I. The real Fett gives the actual carbonite block of Han to Jabba, and he receives his payment. Meanwhile, Luke, Leia, Lando, Chewbacca, R2-D2, and C-3PO prepare to rescue Han from Jabba the Hutt."}, {"tag": "p", "text": "Luke prepares his holographic message to Jabba and puts his lightsaber into R2."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Shadows of the Empire had its origins in a dinner conversation between Bantam Spectra's Lou Aronica and LucasBooks' Lucy Autrey Wilson. Aronica suggested that Lucasfilm's multiple licensing deals would make it easy for them to create a multimedia project that could tell an over-arching story throughout multiple mediums. The company then conceived of the project as being \"a movie project without the movie.\" Lucasfilm first intended to set the project between A New Hope and The Empire Strikes Back, but Jon Knoles convinced them that the period between The Empire Strikes Back and Return of the Jedi would be a more fertile period for storytelling. After George Lucas approved the concept, Wilson and Howard Roffman wrote a brief outline of the premise. Then in November 1994, licensing representatives and Lucasfilm executives met at Skywalker Ranch to begin serious work on the project. Author Steve Perry, who had been hired to write the novel, took detailed notes of the discussion, and used this to create an outline for his book. This outline would serve as the basis for all other aspects of the overall project."}, {"tag": "p", "text": "According to Roffman, Lucas originally planned to release the Special Editions in 1996, and the first film of his prequel trilogy in 1997 (for the 20th anniversary of Star Wars). When plans changed, and those projects moved to 1997 and 1999 respectively, the company decided that 1996 would be an opportune time to release their multimedia project. (The success of the project later served as a model for 2007's Star Wars: The Force Unleashed multimedia endeavor.)"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Books"}, {"tag": "h4", "text": "Novel"}, {"tag": "p", "text": "The main plotline is told in Steve Perry's novel, Shadows of the Empire, published by Bantam Books. It introduces Prince Xizor a Falleen, the overlord of the largest criminal organization in the galaxy, known as Black Sun. His goal is to take Darth Vader's place at Emperor Palpatine's side. Xizor is also seeking vengeance against Vader for the extermination of his family. Xizor makes his move against Vader upon learning of the identity of Luke Skywalker and his relationship to Vader. To exact his revenge, Xizor plots to kill Luke, thinking that will win favor with Palpatine and serve as retribution against Vader. Meanwhile, Vader is still seeking out Luke to convert him to the dark side after their encounter on Bespin. Luke finds himself the target of the two most powerful beings in the galaxy, other than Palpatine himself."}, {"tag": "p", "text": "Meanwhile, Han Solo is still frozen in carbonite and is being taken to Jabba the Hutt by the bounty hunter Boba Fett. Leia Organa, along with Lando Calrissian and Chewbacca, enlists the aid of Dash Rendar, a smuggler and acquaintance of Han's. Events transpire that cross the paths of Leia and the Rebels with Xizor and Black Sun that culminate in a battle over Coruscant among Xizor, Vader, and Rogue Squadron. Also revealed are how Leia and Lando developed Han's rescue and the construction of Luke's new lightsaber. Thus, the stage is soon set for Return of the Jedi."}, {"tag": "p", "text": "A prequel novel was planned to the original Shadows of the Empire story. The book was to be written by author Charles Grant. The novel was canceled apparently due to a Lucasfilm Licensing move from Bantam to Del Rey."}, {"tag": "h4", "text": "Junior novelization"}, {"tag": "p", "text": "The junior novelization of Star Wars: Shadows of the Empire was written by Christopher Golden and published by Bantam Doubleday Dell in October 1996. It is based on the story and novel by Steve Perry. The target audience of the junior novelization is kids 8–12."}, {"tag": "h4", "text": "Comics"}, {"tag": "p", "text": "While many elements of the novel are also depicted in the comics, there is much greater emphasis on the intrigue between Boba Fett and his fellow bounty hunters, primarily Bossk, Zuckuss, and 4-LOM. It also tells the story of Jix, Darth Vader's special agent assigned to ensuring Luke's protection from Xizor. Upon learning that Luke was on Tatooine, Xizor hired Jabba to kill him. The job was given to his swoop gang, which had been infiltrated by Jix as part of Vader's assignment. The series was written by John Wagner and illustrated by Kilian Plunkett."}, {"tag": "p", "text": "Steve Perry, author of the Shadows novel, was a consultant of the comics. While the stories in the book and comics seldom intersected, it was necessary that characters, scenes, and dialogue match when they did come together. There were also a few tie-in comics and a sequel comic, Shadows of the Empire: Evolution."}, {"tag": "p", "text": "The first tie-in was Battle of the Bounty Hunters, the first-ever Star Wars pop-up comic. It was simply a reprint of the battle between Boba Fett and IG-88 shown in the first issue of the primary series."}, {"tag": "p", "text": "A tie-in comic book series was released from writer Ryder Windham in January 2000. The comic book series was known as Star Wars: Shadow Stalker, and was a prelude to the original Shadows of the Empire story. The new comic expanded on the adventures of the character Jix, from the original story. The series also incorporated characters from the Archie Goodwin Star Wars newspaper strip story \"Iceworld\" reprinted by Dark Horse comics in Classic Star Wars."}, {"tag": "p", "text": "Additionally, The Jabba Tape continues the adventures of Big Gizz and Spiker—members of Jabba's swoop gang—after Jabba's death. Both Shadow Stalker and The Jabba Tape were originally serialized in Star Wars Galaxy. This led to a further adventure in Sand Blasted."}, {"tag": "p", "text": "Some comics were also released by toy companies. Kenner released a two-part special which was a reprint of some scenes from the original comic like Battle of Gall. Some of the Lewis Galoob Toys included a Galoob Micro-Machines Mini-Comic and a Shadows of the Empire AMT/ERTL Model Kit Mini-Comic was distributed in ERTL model kits. These mini-comics like the Kenner version were mainly a reprint but they also included some original scenes."}, {"tag": "p", "text": "A sequel was written to the original story by Steve Perry, the author of the Shadows of the Empire novel. The project is known as Shadows of the Empire: Evolution, and was created in the form of a series of five comic books. The story is set around the time of Return of the Jedi. Xizor, the leader of the Black Sun criminal organization, has been destroyed, and Guri, a beautiful human-replica droid and Xizor's personal assassin, is left wondering what her future will hold now that she no longer has anyone to answer to. Throughout the ongoing struggle for underworld supremacy, Guri endeavors to uncover hints of her human side—if it even exists. But in her quest to alter her programming and gain humanity, Guri becomes the quarry of both bounty hunters and Rebels (led by a Jedi-to-be named Luke). Secrets lay buried in her android mind that make her such valuable prey. Shadows of the Empire: Evolution was Perry's first foray into comics. These books were later combined to create a graphic novel."}, {"tag": "h4", "text": "Making-of"}, {"tag": "p", "text": "The entire history and analysis of the project was recorded in The Secrets of Star Wars: Shadows of the Empire, by Mark Cotta Vaz."}, {"tag": "h3", "text": "Video game"}, {"tag": "p", "text": "LucasArts' Shadows of the Empire video game was one of the first available for Nintendo's 64-bit system, Nintendo 64. The most commercial product in the Shadows of the Empire line was the Nintendo 64 game that was released on December 3, 1996, which was shortly after the release of the console itself (September 29, 1996). The computer version came almost a year later (September 17, 1997), featuring improved graphics and fully 3D CGI rendered cutscenes with dialogue (as opposed to the picture/text cutscenes of the N64 version). In the game, the player controls Dash Rendar in his efforts to help Luke Skywalker and rescue Princess Leia from Prince Xizor's hands."}, {"tag": "p", "text": "The game is divided in four parts (or chapters). The first one takes place during the beginning of The Empire Strikes Back, with Dash assisting in the Battle of Hoth in a snowspeeder, and eventually fleeing Echo Base. In the second part, Dash confronts some of the bounty hunters found in the movies, like IG-88 on Ord Mantell and Boba Fett. In the third chapter, Boba Fett has escaped and the player's mission changes: you must now save Luke Skywalker's life by fighting a deadly gang of bikers in Mos Eisley—this is vividly depicted in the comics as well—and then recover Imperial secret plans of the second Death Star, with Skywalker's help. Finally, in the last chapter takes Dash, Luke, and Lando to Coruscant to rescue Princess Leia from Xizor's stronghold. Certain parts of the game contradict elements from the book and comic book, but the overall story remains the same."}, {"tag": "h3", "text": "Soundtrack"}, {"tag": "p", "text": "Film and TV composer Joel McNeely wrote and recorded a soundtrack for the project which was performed by the Royal Scottish National Orchestra and Chorus. It was published by Varèse Sarabande. Familiar themes from the movies can only be heard in tracks one (\"Star Wars Main Title\" and part of \"Carbon Freeze\"), eight (\"The Imperial March\" and \"The Force theme\"), and ten (\"The Imperial March\"). The disc also includes an interactive track for personal computers, containing concept art and additional information about the project."}, {"tag": "h3", "text": "Toys"}, {"tag": "p", "text": "Kenner was one of the companies that made the toy line for the Shadows of the Empire project. Kenner's Shadows of the Empire line contains action figures, vehicles, and \"two-pack\" pairings of new and classic characters."}, {"tag": "p", "text": "Lewis Galoob Toys, famous for their line of \"Micro Machine\" miniature toys and playsets, also developed a full Shadows of the Empire toy line. It included three sets of miniatures and a boxed Action Fleet set with two swoop bikes and riders and four miniature articulated figures. Also included in the sets are the classic Star Wars characters (Luke, Vader, the Emperor) as well as the new characters (Xizor, Dash Rendar, Guri, and Leebo)."}, {"tag": "h3", "text": "Trading cards"}, {"tag": "p", "text": "The trading card company Topps developed the Shadows of the Empire trading card line. The 100-piece Shadows of the Empire card set from Topps represents all three platforms that tells the story—the book, the comic series and the game, making it a unique storytelling medium and a highly anticipated collectible. The cards are the work of Greg and Tim Hildebrandt, the twin artists who painted the most recognizable Star Wars art of all time—the world-famous poster that is still an icon of the trilogy. The 100 card set featured double UV-coating and an extra-thick 20 pt. card stock for everlasting collectibility, all with full-bleed painted images on a 2 1/2\" x 3 1/2\" card. The Shadows of the Empire card series is highlighted by 72 cards that virtually storyboard the events in Steve Perry's novel. Besides that, there are six cards dedicated to vehicles, other six to the comics and another six keyed to the video game. Each pack came with nine cards."}, {"tag": "h2", "text": "Tie-ins"}, {"tag": "h3", "text": "Video games"}, {"tag": "p", "text": "Star Wars: X-Wing Alliance, although not officially part of the project, has a campaign of seven missions that takes place during the period covered by Shadows, with the player having to recreate events mentioned in the novel and the game. This includes the missions to acquire the design schematics of the Death Star II. The game depicts Ace Azzameen assisting Dash Rendar in the capture of the Imperial freighter Suprosa, which was carrying the Death Star II plans and later flying to the Vergesso Asteroids during the Battle of the Bajic Shipyards (mentioned in the novel) for a concurrent rescue mission. The player will also witness the Imperial assault to Kothlis from space. The events around the Battle of Kothlis and the schematics of the Death Star also appear in Star Wars: Rogue Squadron II: Rogue Leader. The Outrider can also be seen very briefly in Star Wars: Bounty Hunter, in the sequence after the opening crawl and after The Dooku/Palpatine conversation. Once the space arena comes into view, the Outrider flies from the bottom middle of the screen towards the lower right side. It may be a bit hard to spot, but it is there.[source?]"}, {"tag": "h3", "text": "Radio drama"}, {"tag": "p", "text": "The 1996 Return of the Jedi radio drama, Brian Daley makes several references to events from Shadows. For instance, in the radio drama, after Han is rescued, he criticises Lando for allowing C-3PO to fly the Millennium Falcon—an event that is portrayed in Shadows of the Empire."}, {"tag": "h3", "text": "Film"}, {"tag": "p", "text": "The 1997 Special Edition re-release of Star Wars: Episode IV A New Hope includes swoop bikes, ASP labor droids and the Outrider. Though originally developed for the Special Edition of A New Hope, the Sentinel-class landing craft (also known as the \"Imperial landing craft\") also made its first appearance in Shadows of the Empire. This is the craft seen lifting off in A New Hope when the stormtroopers are roaming Tatooine on the dewbacks."}, {"tag": "p", "text": "Xizor makes a cameo appearance at the podrace in Star Wars: Episode I The Phantom Menace. A Micro Machines model was used to portray him."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}