{"url": "Star_Wars:_Shadow_of_Vader", "categories": ["Category:Real-world articles", "Category:Canceled comics", "Category:Marvel Comics canon series"], "nodes": [{"tag": "h1", "text": "Star Wars: Shadow of Vader"}, {"tag": "p", "text": "Star Wars: Shadow of Vader was a five-issue comic book miniseries that focused on Darth Vader's influence on the galaxy across eras. Each issue would have followed a different character or group, reflecting on how their encounters with Vader changed their lives. Chuck Wendig was originally announced to write the miniseries, but was fired from Marvel in October 2018 after a series of negative political tweets attacking the Republican Party in the wake of Brett Kavanaugh's contentious Supreme Court nomination. According to Wendig, at least issues 4 and 5 of the miniseries would no longer be written by him."}, {"tag": "p", "text": "During New York Comic Con 2018, Wendig told the attendees what each issue would have been about: the first issue was an homage to Friday the 13th, with Vader hunting down kids at a summer camp; the second issue involved the Star Wars: Episode V The Empire Strikes Back background character Willrow Hood; the third issue centered on a morgue attendant on the Death Star battle station; the fourth issue diverged to focus on the Acolytes of the Beyond, first seen in Wendig's The Aftermath Trilogy; and the fifth issue followed a New Republic pilot—whose parents were killed by Vader—who joins the Resistance only to learn that Leia Organa's father was none other than Vader himself."}, {"tag": "p", "text": "The series was to be published by Marvel Comics starting November 2018, but was delayed until February 2019 as it wasn't mentioned in January's solicitations. Wendig later speculated at his Twitter account that perhaps Marvel would hire a new writer to rewrite the first three issues or that the series has been cancelled. On November 15, 2018, however, Marvel officially confirmed via Bleeding Cool that the series had effectively been cancelled."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery for Shadow of Vader"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}