{"url": "Star_Wars:_Rogue_One:_Death_Star_Deluxe_Book_and_3D_Wood_Model", "categories": ["Category:Real-world articles", "Category:Star Wars IncrediBuilds"], "nodes": [{"tag": "h1", "text": "Star Wars: Rogue One: Death Star Deluxe Book and 3D Wood Model"}, {"tag": "p", "text": "Star Wars: Rogue One: Death Star Deluxe Book and 3D Wood Model is a woodshop activity book for building a model of the Death Star as it appeared in Rogue One: A Star Wars Story. In addition to the model and instructions, the set also comes with a guidebook to the Death Star, titled Star Wars: Rogue One: Death Star - Inside the Formidable Battle Station, written by Ryder Windham, containing an in-universe guide to the components and history of the various Death Star battle stations, as well as a behind-the-scenes section on how the Death Star was conceptualized and produced for the films. It was released on May 23, 2017."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "Build your own Death Star with this IncrediBuilds: Star Wars model kit, featuring a full-color book with facts and trivia on the Empire's deadliest weapon!"}, {"tag": "p", "text": "Build and color your own 3D Death Star model and learn all about the iconic battle station in this deluxe IncrediBuilds book set."}, {"tag": "p", "text": "The Empire's deadliest weapon takes center stage in this exciting Star Wars wood model set. The deluxe 32-page hardcover book is packed with information on the Death Star–from its destructive capabilities to the history of its creation–and filled with amazing imagery from the Star Wars films, including Rogue One: A Star Wars Story. The wood model is easy to assemble and snaps together to form a dynamic, displayable 3D version of the Death Star that fans will love."}, {"tag": "p", "text": "Includes:"}, {"tag": "p", "text": "Skill Level: Advanced"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}