{"url": "Star_Wars:_Return_of_the_Jedi_(video_game)", "categories": ["Category:Real-world articles", "Category:Game stubs", "Category:1980s computer and video games", "Category:Real-world arcade games", "Category:1984 releases"], "nodes": [{"tag": "h1", "text": "Star Wars: Return of the Jedi (video game)"}, {"tag": "p", "text": "The Star Wars: Return of the Jedi video game debuted in video arcades in 1984. Levels in the game are set during the Battle of Endor. Digitized voices of various actors' lines from the film play at certain moments in the game. During the recording of the player's records on the high score screen, the Ewok Celebration song will play in the background."}, {"tag": "p", "text": "The game was later ported to home platforms including Amstrad CPC, Atari ST, BBC Micro, Commodore 64, and ZX Spectrum. It also appeared in the Arcade mode of Star Wars: Rogue Squadron III: Rebel Strike, like the other two Arcade games Star Wars: The Arcade Game and The Empire Strikes Back. Unlike those two, however, it can't be unlocked by regular means, and requires a two-part passcode to unlock. The passcode is \"!?ATH!RD GAME?YES\"."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "There are eight levels and each level is divided into three phases: in the first phase you control Princess Leia on a speeder bike and you are pursued by Imperial speeders trying to take you down. In the second phase two sequences are alternated: in one the player controls an AT-ST as Chewbacca and has to avoid tree trunks coming down, while in the other the player controls the Millennium Falcon as Lando Calrissian, escorted by two X-wings facing groups of three TIE interceptors each, flying close to Imperial Star Destroyers. The last phase enters the second Death Star with the Falcon alone and the player has to blow up the reactor while avoiding pursuing TIE interceptors."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Screenshot gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}