{"url": "Star_Wars:_Shadows_of_the_Empire_(Ertl)", "categories": ["Category:Real-world articles", "Category:Star Wars: Shadows of the Empire (comics)"], "nodes": [{"tag": "h1", "text": "Star Wars: Shadows of the Empire (Ertl)"}, {"tag": "p", "text": "Star Wars: Shadows of the Empire is a mini comic book distributed in certain of the Ertl Company's model kits from the Shadows of the Empire series. The comic covers the period of Fett's departure from Gall to Luke's departure from Tatooine in chapter 16 of the Shadows of the Empire novel."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Luke Skywalker and Rogue Squadron engage a squadron of TIE fighters that were harassing Leia Organa Solo, Lando Calrissian, and C-3PO onboard on the Millennium Falcon. Leia, Lando, and the others had tracked Boba Fett to Gall, who was transporting Han Solo. However, the Falcon maintained damage and had to break off pursuit."}, {"tag": "p", "text": "Meanwhile, onboard Slave I, Fett told Han that he was more trouble in carbonite than he was before. However, he also admitted to considering taking Darth Vader's bounty on Luke."}, {"tag": "p", "text": "On Kile, Luke, Wedge Antilles, and the rest of Rogue Squadron discover that an R2 unit that tried to kill Luke had been destroyed. Luke was then attacked by a mechanic but was killed. Luke deduces that Vader paid the mechanic to kill him. Meanwhile,the Executor approaches a Rebel shipyard and Vader, along with other TIE pilots easily destroy it. Vader then makes contact with Emperor Palpatine to inform him of the shipyard's destruction. Palpatine is displeased that Vader did not inform Prince Xizor of the attack. Xizor had been listening to the conversation and informed Guri of his intent to kill Luke to prevent Vader from capturing him and presenting him to Palpatine.\nBack on Kile, Luke receives a message from Koth Melan and asks him to come join him immediately. With that, Luke and R2-D2 board Luke's X-wing and head off."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}]}