{"url": "Bassa_hound", "categories": ["Category:Canon articles", "Category:Wookieepedia Comprehensive articles", "Category:Articles with spoilers", "Category:Canines", "Category:Creatures of unspecified diet", "Category:Domesticated creatures", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Bassa hound"}, {"tag": "p", "text": "Bassa hounds were a species of heavy-hoofed dog. During the Imperial Era, a bassa hound belonged to the personal zoo of Harra the Hutt on the planet Vodran. By the New Republic Era, bassa hounds were trained as hunting companions at Kergans Academy. Years later, Resistance member Mattis Banz went on a mission to Vodran and had a run-in with a bassa hound and Harra's other creatures."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Bassa hounds were a species of heavy-hoofed dog. They were non-sentient and could be trained as hunting companions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the High Republic Era, bassa hounds were mentioned in the phrase \"Why keep a bassa hound and bark yourself?,\" which was considered by the Nihil Tempest Runner Pan Eyta as he waited for his navigator to answer a communications call."}, {"tag": "p", "text": "During the reign of the Galactic Empire, at least one bassa hound was kept by Harra the Hutt in her personal zoo on the swamp planet Vodran. The animals were set loose after the Empire arrived on the planet, and Harra fled. By the New Republic Era, bassa hounds were used in hunting lessons at the expensive Kergans Academy on the planet Kergans. The Zeltron Lorica Demaris attended the school and hated the activity. Later, during the Cold War between the Resistance and the First Order, Resistance member Mattis Banz embarked on a mission to Vodran and had a brief, dangerous encounter with Harra's former menagerie as the animals stampeded away from a pack of rancors. A bassa hound was among the creatures, and it nearly took off Banz's head when it galloped by."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A bassa hound first appeared in Join the Resistance, a junior novel written by Ben Acker and Ben Blacker and published on March 7, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}