{"url": "Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Fall_of_the_Sith_Empire", "categories": ["Category:Real-world articles", "Category:Star Wars: Tales of the Jedi - The Fall of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Star Wars: Tales of the Jedi — The Fall of the Sith Empire"}, {"tag": "p", "text": "Star Wars: Tales of the Jedi — The Fall of the Sith Empire is a sub-series of the Tales of the Jedi series of comics. It ran from June 18, 1997 to October 22, 1997, and was then compiled as a trade paperback on May 6, 1998."}, {"tag": "p", "text": "It tells the story of the beginning and end of the Great Hyperspace War."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Battle of Coruscant was the first battle between the Galactic Republic and Naga Sadow's Sith Empire."}, {"tag": "p", "text": "Memit Nadill, trusting in Odan-Urr's judgment, came to Coruscant to rally the Jedi before the Sith were to attack, but the invasion fleet came early. The Coruscant defense forces led by Jedi Guardian Anavus Svag quickly defended the planet as other Republic forces and Jedi joined the defense."}, {"tag": "p", "text": "The size of the Dark Lord's army was visually exaggerated and influenced by Sadow himself, meditating in his meditation sphere high above Primus Goluud."}, {"tag": "p", "text": "When Gav Daragon fired on the sphere, Naga Sadow's concentration was disrupted, causing much of the army on Coruscant to fade. This increased the confidence and resolve of the Jedi and Republic soldiers, allowing them to take advantage and repel the Sith invasion."}, {"tag": "h3", "text": "Koros Major"}, {"tag": "p", "text": "The Battle of Koros Major was fought between the army of Koros and the Sith Empire. Due to Naga Sadow's focus being on the Battle of Coruscant, he had appointed his prisoner Gav Daragon as commander of the Koros Major invasion fleet. As the battle began, Gav landed on the planet to look for his sister Jori, with a group of Massassi bodyguards."}, {"tag": "p", "text": "As Gav entered Aarrba the Hutt's repair dock, his bodyguards saw the Hutt as a threat, and attacked and killed him. Jori entered at that exact moment and attacked Gav with a lightsaber given to her by Odan-Urr, assuming he had killed Aarrba. But Gav was able to escape and flee the planet, leaving Teta's men to battle the Sith to eventual victory."}, {"tag": "h3", "text": "Kirrek"}, {"tag": "p", "text": "The Battle of Kirrek was fought between the army of Koros and the Sith Empire. Prior to the battle, Empress Teta had made an agreement with Commander Llaban, commander of the rebellion in the earlier Battle of Kirrek, to fight alongside each other to defend Kirrek against the Sith, earning amnesty for the ex-rebels. She had also decided to let the prisoners mining the colony world of Ronika to fight in the defense of Kirrek, but they were absent for the beginning of the battle."}, {"tag": "p", "text": "Early in the battle, Odan-Urr attempted to use his battle meditation as he did during the Unification Wars, but the fury and determination of the Massassi warriors was infallible. Led by the Sith Lord, Shar Dakhan, the Massassi broke through the line of defenders and began climbing the wall. Separating much of the defenders from the Sith onslaught was Odan-Urr's Master Ooroo, a Celegian who survives by floating in a tank of cyanogen, which is toxic to most species. He ordered the Kirrek rebels to find cover. He then tipped himself over, shattering his cyanogen tank and sending the fumes into the breaths of several Massassi, led by Shar Dakhan, killing them instantly. This killed Ooroo as well, as oxygen is just as toxic to him as cyanogen is to the Massassi."}, {"tag": "p", "text": "The prisoners from Ronika arrived, and with the death of the Sith commander, victory for the Tetans quickly became a foregone conclusion."}, {"tag": "h3", "text": "Primus Goluud"}, {"tag": "p", "text": "The Battle at Primus Goluud took place above the red supergiant Primus Goluud between Empress Teta's forces and the Sith Empire of Naga Sadow. Jori Daragon led Empress Teta to her brother Gav, presuming he had entirely turned to the Dark Side. Gav, trapped in Naga Sadow's meditation sphere, proved he was still on their side by transmitting the coordinates to Korriban to Teta's ship."}, {"tag": "p", "text": "Soon, the Dark Lord's ships arrived and engaged the Koros battalion. Sadow wasted no time in using a superweapon attached to his flagship to trigger solar flares across Primus Goluud. The Sith forces retreated to the Sith Empire, closely followed by Teta's ships, as Gav was left to die in the meditation sphere."}, {"tag": "h3", "text": "Korriban"}, {"tag": "p", "text": "The first battle of Korriban was fought between Naga Sadow and Ludo Kressh's respective war fleets high above the Sith funeral world of Korriban."}, {"tag": "p", "text": "Fleeing the Battle of Primus Goluud, Naga Sadow's fleet were confronted by Ludo Kressh, who declared himself the new Dark Lord of the Sith and banished Sadow from the Sith Empire. A fierce battle between the Sith Lords ensued, until Sadow crashed one of his ships into Kressh's flagship, killing the new Dark Lord."}, {"tag": "p", "text": "The second battle of Korriban immediately followed the first battle. The Tetan forces, using coordinates given to them by Gav Daragon, came out of hyperspace very soon after the death of Ludo Kressh in the First Battle of Korriban, catching Naga Sadow by surprise. This allowed the Koros ships to quickly put the Sith Empire's forces at a disadvantage."}, {"tag": "p", "text": "But Sadow had another trick up his sleeve; the Dark Lord ordered his Massassi to kill their commanders on each ship, leaving a massive, impassable barricade between himself and the Koros fleet. Naga Sadow then fled to Yavin 4 with his one remaining ship, to where he hoped to rebuild the once glorious Sith legacy."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}