{"url": "Star_Wars:_The_Arcade_Game", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:1983 computer and video games", "Category:Real-world arcade games", "Category:Arcade games", "Category:Atari Video Computer System games", "Category:Atari 5200 games", "Category:Commodore 64 games", "Category:Colecovision games"], "nodes": [{"tag": "h1", "text": "Star Wars: The Arcade Game"}, {"tag": "p", "text": "Star Wars: The Arcade Game, or simply Star Wars, is an arcade game produced by Atari and released in 1983. The game is a first-person space simulator, based around Star Wars: Episode IV A New Hope. More specifically the game's action covers the Battle of Yavin. The game is composed of 3D color vector graphics. Considered one of the most popular video games of all time, it was greatly successful in its day, particularly in the wake of the theatrical release of Return of the Jedi."}, {"tag": "p", "text": "It was later produced as Star Wars: The Arcade Game for the Atari 2600, Atari 5200, Atari 8-bit home computers, ColecoVision, and Commodore 64. In 1991, an updated version of the game was released for the NEC PC-98 and the Sharp X68000 systems under the title Star Wars: Attack on the Death Star. This version featured a long introductory cutscene at the beginning of the game."}, {"tag": "h2", "text": "Opening Crawl"}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "The player assumes the role of Luke Skywalker (\"Red Five\"), as he pilots an X-wing fighter from a first-person perspective. Unlike other arcade games of similar nature, the player does not have to destroy every enemy in order to advance through the game; he must simply survive as his fighter flies through the level, which most often means he must avoid or destroy the shots that enemies fire."}, {"tag": "p", "text": "The player's ultimate goal is to destroy the Death Star through three attack phases."}, {"tag": "p", "text": "Each successive Death Star run greatly increases the difficulty; TIE Fighters shoot more often, there are more Laser towers and batteries in the second round, and there are many more obstacles and laser fire during the trench run. Unlike the movie, where the units shoot laser cannons, the enemy units in this game shoot projectiles resembling fireballs, in order to give the player a chance to destroy the shots fired at him."}, {"tag": "h2", "text": "Arcade details"}, {"tag": "p", "text": "The game featured several digitized samples of voices from the movie, including Mark Hamill as Luke Skywalker, Alec Guinness as Obi-Wan Kenobi, James Earl Jones as Darth Vader, Harrison Ford as Han Solo, and the mechanized beeps of R2-D2. The game was the first to feature digitized voice capabilities, often considered a prime factor of the game's success."}, {"tag": "p", "text": "The game is available as a standard upright or an elaborately decorated sit-down version. The controls consist of a yoke control (similar to a steering wheel) with several buttons, all which fired the fighter's laser."}, {"tag": "p", "text": "In some gameplay, the first level utilized The Imperial March. This was because the Arcade Game was released shortly after the release of Star Wars: Episode V The Empire Strikes Back."}, {"tag": "h2", "text": "Notes"}, {"tag": "h2", "text": "Ports"}, {"tag": "p", "text": "The game was published for home computers in Europe by Domark in 1987. That same year Broderbund acquired the rights to develop Star Wars games from Lucasfilm. Broderbund published the Apple II and\nCommodore 64 versions of the arcade game in North America in 1988. The Commodore 64 version was programmed by Daniel James Gallagher and featured voice sampling by Andy Beverage. Two versions were released for the Atari 5200 by Parker Brothers; Star Wars Arcade and Death Star Battle. The latter is almost an exact conversion of the Atari 2600 version, in Star Wars: Rogue Squadron III: Rebel Strike all 3 classic trilogy arcade games are unlockable (although ROTJ requires a cheat to unlock). The appearance of the arcade system in Rebel Strike indicated that the version used was the upright version of the arcade cabinet, and not the sit down model."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Screenshot gallery"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Joe Booth is credited as one of the game's programmers while John Cassells was the one responsible for the graphics. The game was programmed for the Atari 2600 by Bob Smith, who was involved in programming many other games for Atari. Mike Hally was the game designer.[source?]"}, {"tag": "p", "text": "Players with attention to detail may notice that after the TIE Fighter waves, when you are flying towards the Death Star, the yellow grid lines on the Death Star spell out either \"MAY THE FORCE BE WITH YOU\" on odd-numbered waves. Assorted peoples' names are spelled out on even numbered waves. When flying in the trench towards the vulnerable exhaust port, \"USE THE FORCE\" is spelled in green until you fire a shot. If you dodge the fireballs, do not fire any shots and use one shot to fire your torpedoes in to the exhaust port, you get a sizable \"USE THE FORCE\" bonus. This is encouraged by Obi Wan himself at the beginning of the trench sequence."}, {"tag": "p", "text": "Concepts original to the game, most notably the Meridian trench being loaded with obstacles instead of barren as in the original film, were later reused for the Battle of Yavin mission in the 2001 game Star Wars: Rogue Squadron II: Rogue Leader, as well as its co-op port in Star Wars: Rogue Squadron III: Rebel Strike. The latter game also included the arcade game as an unlockable bonus. According to the making of documentary for Rebel Strike, the arcade game acted as the inspiration of the Rogue Squadron series."}, {"tag": "p", "text": "The 2012 non-canon web-based video game Star Wars Galactic Spy included the arcade cabinet as one of the items players can search for in Mos Eisley. Stormtroopers are seen waiting for their turn to play the game."}, {"tag": "p", "text": "In the films Gremlins and No Small Affair (both released 1984), both cabinets were depicted. The trench sequence was seen in Gremlins when the Gremlins play the game and in the film No Small Affair, an upright cabinet is used."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}