{"url": "Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Saga_of_Nomi_Sunrider", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Tales of the Jedi story arcs"], "nodes": [{"tag": "h1", "text": "Star Wars: Tales of the Jedi — The Saga of Nomi Sunrider"}, {"tag": "p", "text": "Star Wars: Tales of the Jedi — The Saga of Nomi Sunrider was the second story-arc in the Tales of the Jedi comics."}, {"tag": "p", "text": "HighBridge Audio released an audio adaptation of the comic."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "In the year 3999 BBY, the Jedi apprentice Andur Sunrider, along with his wife Nomi, their daughter Vima, and their droid A-3DO leave their home on the planet H'ratth in order to seek out the reclusive Jedi Master known as Thon on Ambria in the Stenness system. Having been sent by his old Master, Chamma, to learn from Thon, Andur carries several rare Adegan crystals which he was to present to Thon as a gift from Chamma. Midway through their trip to the Stenness system, the Sunriders stop at a hyperspace terminal to gather food and supplies for the final leg of the journey to see Thon. During their time on the hyperspace terminal, it is discovered by Bogga the Hutt, a known crime lord, that Andur is in possession of several rare Adegan crystals. Wanting the crystals for himself, Bogga orders his gang of thugs to attack the young man and bring the crystals back to him. Bogga's gang managed to surprise and kill the young Andur, but are unable to gather the Adegan crystals from the corpse. Following his death, Andur reappears as a Force ghost to his wife Nomi, telling her to pick up his fallen lightsaber and defend both their daughter and herself. Through her dead husband's insistence and knowledge that she is Force-sensitive, Nomi is able slay two of the criminals and send the rest fleeing. She then gathers up Vima, A-3DO, and the crystals, and depart once again for Ambria."}, {"tag": "p", "text": "Having arrived on the desolate world of Ambria, Nomi orders A-3DO to stay behind with their ship, the Lightside Explorer. Bringing Vima along, Nomi sets out to follow her feelings in the hopes that they would lead her to that whom she sought—Jedi Master Thon. Eventually making her way through the harsh deserts of Ambria, Nomi and Vima encounter a lone being riding atop a fierce-looking beast. Knowing that this being is a Jedi, Nomi follows him back to his modest dwelling, a small farm in the middle of the desert. Meanwhile, at the order of Bogga, who still wants the elusive Adegan crystals, several gangsters manage to track Nomi to Ambria, where they find A-3DO inside the Lightside Explorer. Believing that the crystals they sought are inside the ship, the thugs shoot A-3DO while in the process of looking for the hidden treasure, unaware that Nomi has taken the crystals with her. Following their quarry's trail to the dwelling where Nomi and Vima are, Bogga's men are confronted by Nomi's host. However, the Jedi is overwhelmed by the sheer number of thugs. Despite the apparent advantage held by the gangsters, the beast which Nomi had seen the Jedi riding intervenes in the struggle. Advantaged by the element of surprise, the beast is able to trample several of the pirates, thus forcing the remainder of the gang into retreat. Safe for the time being, it is soon revealed that the being whom she had met was actually a Jedi Knight by the name of Oss Wilum, and that it is the fierce-looking beast who actually Master Thon."}, {"tag": "p", "text": "Under the guidance of Thon, Nomi begins her training as a Jedi Knight, alongside Oss Wilum. While the Jedi training continues on Ambria, a ship of Bogga the Hutt's is hijacked by the pirate Finhead Stonebone, who is intent on capturing the valuable ore which was contained aboard the ship. However, Bogga himself, aboard his flagship Enforcer One, is able to thwart Stonebone's plans and captures both him and his pirate gang. Believing that Bogga was going to execute him for his crimes, Stonebone was surprised when Bogga decides that the pirate and his gang would pay for their crimes by traveling to Ambria, where Stonebone was to kill Master Thon and anyone with him, and retrieve the Adegan crystals which had previously eluded Bogga's best efforts. Stonebone, as the leader of both his pirate crew and several thugs of Bogga, leads an attack on Thon's homestead, and manages to capture Thon due to Nomi's reluctance to engage in violence following her husband's murder. However, upon realizing that Thon is not going to fight back, in order to show her the path of the Jedi, Nomi decides to use her Force abilities to attack Stonebone and the rest of his gang. Through the combined efforts of Nomi and the freed Thon, the pirates are soon driven from Ambria, never to return again."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}