{"url": "Star_Wars:_The_Card_Game", "categories": ["Category:Real-world articles", "Category:Fantasy Flight Games", "Category:Star Wars: The Card Game"], "nodes": [{"tag": "h1", "text": "Star Wars: The Card Game"}, {"tag": "p", "text": "Star Wars: The Card Game is a cooperative Living Card Game released by Fantasy Flight Games on December 20, 2012. The game allows for one to four players—with the Star Wars: The Card Game Core Set allowing for two possible decks to be made. Players are in command of a Rebel strike force/mission team, and compete against an Imperial deck that functions \"with a devious artificial intelligence.\" Players launch fleets of starships and manipulate notable characters from the Star Wars universe against the Empire. By working together, players can fend off Imperial assaults and complete missions to win the game. The game includes many characters, starships, missions, and enemies from the Star Wars universe."}, {"tag": "p", "text": "Due to the reaction of demonstrations of the game at Gen Con 2011, the Star Wars: The Card Game LCG was removed from its scheduled distribution to undergo a major redesign. It was released on December 20, 2012. As of Promise of Power's release in early 2018, it has finished giving out expansions."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "It is a desperate time for the Rebel Alliance and its allies in this head-to-head card game. One player controls the forces of the dark side as he seeks to tighten his hold upon the galaxy. The strength of the dark side's position is represented by the game's Death Star dial, and if the dial reaches \"12,\" the dark side wins. In order to advance his cause, the dark side player can command the vast military might of the Imperial Navy's fleet of Star Destroyers and TIE fighters, the devious cunning of the Sith, and the mercenary talents of the Scum and Villainy of the galaxy."}, {"tag": "p", "text": "Fighting against the dark side's tyrannical rule, the other player assumes the cause of the light side forces. To claim victory, he must defeat three dark side objectives. It's no easy task, but he'll be able to make use of every resource and tactic available to the Rebel Alliance, the Jedi, and their allies among a small host of Smugglers and Spies."}, {"tag": "h2", "text": "Products"}, {"tag": "h3", "text": "Core Set"}, {"tag": "h3", "text": "Deluxe Expansions"}, {"tag": "h3", "text": "Force Packs"}, {"tag": "h4", "text": "The Hoth Cycle"}, {"tag": "h4", "text": "Echoes of the Force cycle"}, {"tag": "h4", "text": "Rogue Squadron cycle"}, {"tag": "h4", "text": "Endor cycle"}, {"tag": "h4", "text": "Opposition cycle"}, {"tag": "h4", "text": "Alliances cycle"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}