{"url": "Star_Wars:_Stormtroopers:_Beyond_the_Armor", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Canon reference books", "Category:Journey to Star Wars: The Last Jedi", "Category:Real-world reference books"], "nodes": [{"tag": "h1", "text": "Star Wars: Stormtroopers: Beyond the Armor"}, {"tag": "p", "text": "Star Wars: Stormtroopers: Beyond the Armor is a hardcover reference title written by Ryder Windham and Adam Bray that takes an in-depth look at the impact of stormtroopers on the Star Wars franchise, from the films to popular culture. It was published by HarperDesign on October 24, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Foreword by John Boyega"}, {"tag": "p", "text": "Just in time for the next blockbuster, Star Wars: The Last Jedi, this unique and beautifully designed compendium with removable features traces one of the franchise's most iconic characters — the stormtrooper — from initial development through all nine Star Wars movies to their many iterations in TV, comics, videogames, novels, and pop-culture."}, {"tag": "p", "text": "Star Wars: A New Hope, the very first installment in the beloved science-fiction series, introduced the Imperial stormtroopers—the army of the fearsome and tyrannical Galactic Empire. Charged with establishing Imperial authority and suppressing resistance, these terrifying, faceless, well-disciplined soldiers in white have become a universal symbol of oppression."}, {"tag": "p", "text": "Star Wars Stormtroopers explores these striking warriors and their evolution in depth for the first time. Ryder Windham and Adam Bray trace the roots of their creation and design, and explore how these elite troops from a galaxy far, far away have been depicted in movies, cartoons, comics, novels, and merchandizing."}, {"tag": "p", "text": "Filled with photographs, illustrations, story boards, and other artwork, this lavish officially licensed book comes complete with removable features, including posters, stickers, replica memorabilia and more, making it an essential keepsake for every Star Wars fan, as well as military, design, and film aficionados."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The original title was Star Wars Stormtroopers: The Ultimate Guide, but author Adam Bray confirmed that the title has since been changed."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}