{"url": "Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Golden_Age_of_the_Sith_(TPB)", "categories": ["Category:Real-world articles", "Category:Tales of the Jedi TPBs"], "nodes": [{"tag": "h1", "text": "Star Wars: Tales of the Jedi — The Golden Age of the Sith  (TPB)"}, {"tag": "p", "text": "The Star Wars: Tales of the Jedi — The Golden Age of the Sith Trade Paperback is a graphic novel collecting all six issues in the Star Wars: Tales of the Jedi — The Golden Age of the Sith comic series."}, {"tag": "h2", "text": "Editions"}, {"tag": "p", "text": "ISBN 1-56971-229-8, August 1997, Dark Horse Comics, Trade Paperback"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The history of the Old Republic has become legend: how the bold explorations of young Gav and Jori Daragon brought two galactic empires crashing together, how Odan-Urr became a powerful Jedi, and how the seven worlds of the Koros system were finally united by the wise and skilled Empress Teta."}, {"tag": "p", "text": "Five millennia before the birth of Luke Skywalker and the fall of Palpatine's Empire, our story unfolds…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Odan-Urr is studying Jedi history when his master, Ooroo, sends him to the Koros system to help Empress Teta fight the Unification Wars and unite the seven worlds located in the system. Once he has arrived on Cinnagar he helps to conquer the last planet, Kirrek, with a technique he has learned about in his studies, battle meditation. But even with this technique he cannot prevent casualties from occurring; among them are two blockade runners, Hok and Timar Daragon.\nWith their parents dead, Gav and Jori Daragon get their ship, Starbreaker 12, back from Aarrba the Hutt who was holding it back as collateral."}, {"tag": "p", "text": "With the ship Gav and Jori have become hyperspace explorers, but their latest route proves less then successful; they just barely make it through. They make it back to Cinnagar, but their ship is heavily damaged. Aarrba the Hutt agrees to make the repairs, but he won't give their ship back until they have paid all the bills."}, {"tag": "p", "text": "Ssk Kahorr sends one of his drone ships along the route discovered by Gav and Jori, but it is destroyed when it passes to close to Primus Goluud, a red supergiant. Ssk Kahorr isn't pleased with this and sends two bounty hunters after the two hyperspace explorers. But they are saved by two Jedi, Odan-Urr and Memit Nadill. They advise them to leave the Koros system, because it is not safe for them. Gav and Jori steal back the Starbreaker 12 and desperately flee the system with random hyperspace coordinates."}, {"tag": "p", "text": "On Korriban on the far side of the galaxy, a funeral procession is held for Marka Ragnos, a Dark Lord of the Sith. The procession is lead by Ludo Kressh, but just when the tomb is about to be closed, his nemesis arrives, Naga Sadow. A fight about who should be the next Dark Lord ensues between the two rivals, but they are stopped by the ghost of Marka Ragnos, who warns them of what is to come."}, {"tag": "p", "text": "Meanwhile, back in the Koros system, Odan-Urr has a premonition about the evil Jedi banished centuries ago. He tells Empress Teta about his dreams, and she promises that she will raise the matter on Coruscant."}, {"tag": "p", "text": "Back on Korriban, the Starbreaker 12 arrives and Gav and Jori are captured by the Sith forces."}, {"tag": "p", "text": "On Ziost, the Sith Lords discuss what to do with the prisoners. After a long debate it is decided to have Gav and Jori killed. But Naga Sadow, seeing in these prisoners a chance to expand the Sith Empire, does not give up this easily. He sends one of his Massassi warriors to retrieve the weapons on their ship. He hatches a plan to capture the prisoners for himself and use them to regain contact with the Republic."}, {"tag": "p", "text": "Together with his most loyal Massassi warriors, he frees the Daragons. But to keep his identity hidden from the other Sith Lords, he has to kill everyone in his path, including his old mentor Simus. He leaves a Republic blaster behind, to let others think it was an attack by the Republic.\nGav and Jori are sent to his stronghold on Khar Shian and Sadow returns to Ziost where an urgent meeting is held between the Sith Lords. The other Sith Lords are indecisive about what to do and in the confusion he claims to be named the new Dark Lord of the Sith. The other Sith Lords, except Ludo Kressh and his supporters, agree."}, {"tag": "p", "text": "Sadow immediately calls upon the others to prepare their ships and warriors so they can attack the Republic first."}, {"tag": "p", "text": "Empress Teta and her two Jedi advisors have arrived at Coruscant, where she addresses the Senate about Odan-Urr's premonition, but the people listening do not believe her. Even without the help of the Republic, Teta decides to prepare her own forces."}, {"tag": "p", "text": "In Naga Sadow's hidden fortress on the dark side of Kar Shian, Gav Daragon is trained in the ways of the Sith by Naga Sadow."}, {"tag": "p", "text": "Naga Sadow sends his Massassi warriors to retrieve the Starbreaker 12 from Ziost and then travels to his decoy fortress on Khar Delba, where Jori Daragon is held. On Ziost, Sadow's loyal Massassi steal the Starbreaker 12, but not without leaving evidence of their Master's involvement. Ludo Kressh discovers this evidence, and together with his supporters, Horak-mul and Dor Gal-ram, he prepares to attack Sadow's fortress on Khar Delba. Meanwhile the Starbreaker 12 arrives there."}, {"tag": "p", "text": "Ludo Kressh's forces have arrived at Khar Delba and have opened fire at Sadow's apparently defenseless fortress. Naga Sadow convinces Jori Daragon that she must return to the Republic before the fortress is destroyed. Reluctant to leave her brother behind she agrees. After the Starbreaker 12 has escaped to hyperspace, Sadow calls in his fleet that he had hidden on the dark side of Khar Shian. But that is not all; Massassi warriors on the ships of Horak-mul and Dol Gal-ram kill the Sith Lords and direct their fire on the ships of Ludo Kressh, who has no choice but to retreat. After this victory, Naga Sadow prepares his forces to invade the Republic, using the tracing beacon hidden on the Starbreaker 12."}, {"tag": "h2", "text": "Excerpt"}, {"tag": "p", "text": "An excerpt of the story can be found at the official Dark Horse Comics site."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Collected issues"}, {"tag": "p", "text": ""}]}