{"url": "Star_Wars:_Tales_(Omnibus)", "categories": ["Category:Real-world articles", "Category:Legends short story collections"], "nodes": [{"tag": "h1", "text": "Star Wars: Tales (Omnibus)"}, {"tag": "p", "text": "Star Wars: Tales is a single volume collection of three of the five Tales series books and was published exclusively by the Science Fiction Book Club (SFBC)."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The denizens of the Star Wars universe - soldiers, spies, smugglers, pleasure seekers and cutthroats of every stripe. Ever wonder what their stories are, what brought them to the Mos Eisley Cantina or how they ended up in Jabba the Hutt's palace? Here's your chance to find out."}, {"tag": "p", "text": "Kevin J. Anderson has pulled 40-count 'em-40 wildly imaginative tales by some of SF's leading writers, among them Timothy Zahn, Barbara Hambly, Judy and Garfield Reeves-Stevens, Daniel Keys Moran, Esther Friesner, George Alec Effinger and A. C. Crispin."}, {"tag": "p", "text": "There's the tale of Bib Fortuna, Jabba the Hutt's majordomo who has plans to overthrow the Hutt and take over his fortune - if he isn't betrayed by his co-conspirators first…"}, {"tag": "p", "text": "Oola the Dancer, proud and graceful, who dances the perfect dance—on the edge of eternity…"}, {"tag": "p", "text": "Figrin D'an and the Modal Nodes, Jabba's full-time musicians who dare to break their exclusive contract for one dazzling gig…"}, {"tag": "p", "text": "The Hammerhead Momaw Nadon, an exiled Ithorian priest who plots to destroy a vicious Imperial lieutenant-even if he must break his most sacred vows to do it…"}, {"tag": "p", "text": "And Boba Fett, the galaxy's most feared bounty hunter, who embarks on what may be his last great adventure—tracking and killing his old adversary, Han Solo."}, {"tag": "p", "text": "Each has a story to be to tell…if he lives to tell it."}, {"tag": "h2", "text": "Collected works"}, {"tag": "p", "text": "The final two books in the Tales series, Tales from the Empire and Tales from the New Republic, were not included in the omnibus."}, {"tag": "h2", "text": "External links"}]}