{"url": "Star_Wars:_TIE_Fighter", "categories": ["Category:Real-world articles", "Category:1994 computer and video games", "Category:1995 computer and video games", "Category:X-Wing computer games"], "nodes": [{"tag": "h1", "text": "Star Wars: TIE Fighter"}, {"tag": "p", "text": "Star Wars: TIE Fighter is the sequel to Star Wars: X-Wing and the first Star Wars video game set on the side of the Galactic Empire."}, {"tag": "p", "text": "A notable improvement was the 3-D rendering engine, which supported Gouraud shading, an effect that makes curves of low polygon objects look much more realistic. There were many improvements and flight options added, and the briefings were richer; apart from the standard schematic map, the player had the ability to \"talk\" to an Imperial briefing officer and a Lesser Prophet in a dialogue menu."}, {"tag": "p", "text": "In addition to the pilot's manual, the initial release of the game offered a novella called The Stele Chronicles, similar to The Farlander Papers that shipped with X-Wing."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The game begins soon after the Battle of Hoth, and the expansions lead up to the Battle of Endor. The player assumes the role of a rookie TIE pilot, whose name in the player's guide is given as Maarek Stele. Since this is the first game ever on the side of the Galactic Empire, the position of an Imperial main character could estrange some players; however the pilot's role becomes a bit sympathetic since he lives in fear of the punishment of Darth Vader and other superiors, and later the player is directed against other odds."}, {"tag": "p", "text": "Here the Empire is portrayed as a force for peace and order, while the Rebel Alliance is portrayed as a cause of anarchy and chaos. While the Rebels are one of the biggest threats in the initial stages of the game, many missions also deal with the elimination of pirates and other criminals, civil wars, traitor Imperials, and others, in order to maintain peace in the galaxy."}, {"tag": "p", "text": "Similar to X-Wing, there is a concourse which gives the player several options. They can examine craft in the tech room, go to the combat simulation chamber to practice training missions or replay successful missions, view gun camera footage in the film room (with the option of \"entering\" the mission at any point), transfer to another sector (campaign) or review successful campaign cutscenes, switch pilots, and fly the next upcoming mission."}, {"tag": "p", "text": "Though an Imperial Star Destroyer is frequently depicted as the headquarters of a sector or star system, the concourse which is a circular atrium likely represents the interior of an XQ Platform. According to The Stele Chronicles, the concourse is located aboard the Imperial Star Destroyer Vengeance."}, {"tag": "p", "text": "As mentioned, it was the first Star Wars game ever on the side of the Galactic Empire; interestingly, it is also so far the only game that progresses wholly from the Empire's perspective, while all other subsequent games that offer control of the Empire, give it only as an optional choice. Also, it is the only game whose opening crawl does not feature the Star Wars Main Title, but instead it features a modified version of the Imperial March."}, {"tag": "h2", "text": "Improvements over X-Wing"}, {"tag": "p", "text": "An obvious improvement was the rendering engine, which supported Gouraud shading, an effect that makes curves of low polygon objects appear more realistic."}, {"tag": "p", "text": "The game engine was significantly improved to support greater numbers of craft, and those of higher detail than in X-Wing."}, {"tag": "p", "text": "The AI and scripting were considerably enhanced to create more complex mission scenarios as well as more challenging and capable opponents and allies."}, {"tag": "p", "text": "Among the many gameplay improvements were difficulty settings and options such as unlimited ammo and indestructibility (though using these cheats drastically reduced the player's score.)"}, {"tag": "p", "text": "There were many flight options added, like flight dialogue and messages, a message log, a list of objectives, ships' status and behavior, three-dimensional map, and HUD, a sub-target system and other additions such as an option to choose armaments before flying."}, {"tag": "p", "text": "The HUD or targeting computer, (showing a 3-D rendering of the targeted vessel), was well received by players since it allows the player to see the target's relative orientation in real time. This allowed players to avoid dangerous head-on confrontations, and to specifically target individual components such as weapons batteries. Numerous new hot keys afforded players myriad targeting options."}, {"tag": "p", "text": "The ability to match speed with a target lets the player tail an enemy with less risk of collision."}, {"tag": "h3", "text": "New Craft"}, {"tag": "p", "text": "Another significant improvement is the expanded roster of craft like variants of capital ships, utility craft, and others. There are also space stations, including the XQ Platform series and X7 Factory Station (replacing X-Wing's makeshift use of containers and bulk freighters to represent \"bases\"). Some were never further adopted in the Expanded Universe like the Mon Calamari Light Cruiser (the regular MC80 Mon Calamari Star Cruiser is found in the combat simulation chamber but not the storyline missions), R-41 Starchasers, and T-wings. Darth Vader's TIE Fighter (TIE Advanced x1) is not included; in its place is the much faster and more powerful TIE Avenger."}, {"tag": "p", "text": "Available craft to fly are seven starfighters. Like the films, the player initially pilots craft such as the TIE Fighter, TIE/sa bomber, and TIE/IN interceptor, all of which lack shields and a hyperdrive. However, there are few missions where the player is part of swarms of fragile craft conducting near suicidal assaults (as what the canonical Imperial Navy would do)."}, {"tag": "p", "text": "Later missions become very customized, becoming similar to the preceding X-Wing, depart from the mass attacks with suicidal TIEs and mirror the main character's advancement in importance and significance through the ranks. Especially in the Defender of the Empire and Enemies of the Empire expansions, most of the missions feature the player against overwhelming odds, often without wingmen because this would make the player a catalyst in how the battle unfolds. . There are several original craft like the Assault Gunboat, TIE Advanced or \"Avenger\", TIE Defender (later added to The Essential Guide to Vehicles and Vessels) and Missile Boat (in the expansions only)."}, {"tag": "p", "text": "As the TIE Avenger, TIE Defender, and Missile Boat far exceeded the capabilities of existing starfighters, later iterations of the X-Wing series either toned them down or made them unavailable."}, {"tag": "p", "text": "Like the rest of the X-Wing series games where game mechanics were emphasized, TIE Fighter is known to use alternate models and statistics that are not canonical with the films nor the Star Wars Legends (formerly Expanded Universe) sourcebooks."}, {"tag": "h3", "text": "Weapons"}, {"tag": "p", "text": "TIE Fighter featured new weapons such as proton rockets, proton bombs, magnetic pulse warheads, tractor beam, and the jamming beam. In addition, there were also advanced concussion missiles and advanced proton torpedoes, which were better tracking and more powerful versions of the original warheads. As a result, the potency of the standard concussion missile and proton torpedo were toned down, as per game mechanics though this was not in accordance with canon. The images of the concussion missile and proton torpedo also differ from other official sources."}, {"tag": "p", "text": "As in X-Wing, in TIE Fighter, ions will gradually bring down shields like laser cannons, however on unshielded craft a few shots will permanently disable it for the duration of the mission unless there is a repair vessel. This contradicts canon and Star Wars Legends where, ion cannons can punch through shields but will only disable temporarily. All laser cannons are of equal strength; there is no differentiation between a TIE Interceptor's laser cannons and a Star Destroyer's turbolasers."}, {"tag": "p", "text": "Shields of capital ships and space stations will not regenerate once depleted. As well, capital ships such as Star Destroyers and Mon Calamari cruisers feature far less weaponry than their official sourcebook statistics. Consequently, they are not as much of a threat (if a player \"surgically\" takes out all their weapons effectively rendering it defenceless, and/or finds a blind spot by parking just behind the capital ship's engines), though it still requires much ordnance to destroy them. This was a design compromise reflecting the limitations of the game engine at the time - since the targeting and combat AI of each turret on a starship used almost as many resources as a single starfighter, the presence of a single Star Destroyer would count almost as much as an entire squadron of fighters."}, {"tag": "h2", "text": "Optional Goals"}, {"tag": "p", "text": "The briefing includes a dialogue-like interface with questions to an Imperial briefing officer, reminiscent of the LucasArts' concurrent adventure games. Apart from the standard briefing, there is a secondary briefing in some missions, given from a Sith-like Cloaked Figure. This person briefs the pilot on the Secondary and Bonus objectives (see below for detail)."}, {"tag": "p", "text": "Success of secondary and bonus objectives (also referred in-game as secret mission objectives) doesn't alter the scenario or the outcome. However, these optional objectives increase the pilot's score and prestige: as after completing a tour of duty, the medal will contain green and red pins based on perfect completion of secondary and bonus objectives per mission, respectively. However completing the secondary or bonus objectives in the simulation chamber will give the player no awards."}, {"tag": "h2", "text": "Scenarios"}, {"tag": "p", "text": "The story evolves in seven different systems, separated in seven Tours of Duty, of four to six missions each."}, {"tag": "h3", "text": "Tour of Duty I: Aftermath of Hoth"}, {"tag": "p", "text": "Hoth system: Pursue Rebels fleeing from Hoth."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Tour of Duty II: The Sepan Civil War"}, {"tag": "p", "text": "Sepan system: End a prolonged civil war."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Tour of Duty III: Battle on the Frontier"}, {"tag": "p", "text": "Newland system: Establish a new Imperial base."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Tour of Duty IV: Conflict at Mylok IV"}, {"tag": "p", "text": "Mylok system: Battle pirates in the Outer Rim."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Tour of Duty V: Battle for Honor"}, {"tag": "p", "text": "Parmel system: Capture a defecting officer."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Tour of Duty VI: Arms race"}, {"tag": "p", "text": "Parmic system: Demetrius Zaarin builds new technology."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Tour of Duty VII: Treachery at Ottega"}, {"tag": "p", "text": "Parmel system: Stop a revolt by rogue Imperials."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Expansion pack"}, {"tag": "p", "text": "One additional campaign disk was sold separately, Defender of the Empire which added 3 new Tours of Duty:"}, {"tag": "h3", "text": "Tour of Duty VIII: Strategic Warfare"}, {"tag": "p", "text": "Omar system: Zaarin attempts sabotage."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Tour of Duty IX: T/D Technology"}, {"tag": "p", "text": "Parmel system: Secure TIE Defender technology."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Tour of Duty X: New Threats"}, {"tag": "p", "text": "Eva-T system: Counter-Attack!"}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Enemies of the Empire"}, {"tag": "p", "text": "The scenario ends with Thrawn's promotion to Grand Admiral, and Emperor Palpatine tasking him to hunt down Zaarin. An additional campaign disk, Enemies of the Empire concluded the plot, but was never sold separately. Instead, it was included in the Collector's CD-ROM."}, {"tag": "h3", "text": "Tour of Duty XI: Hunt for Zaarin"}, {"tag": "p", "text": "Semag system: Thrawn seeks the traitor Zaarin."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Tour of Duty XII: Prelude to Endor"}, {"tag": "p", "text": "Yllotat system: Investigate Bothan connection."}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Tour of Duty XIII: The Emperor's Will"}, {"tag": "p", "text": "Iast system: Final triumph...?"}, {"tag": "h4", "text": "Missions"}, {"tag": "h3", "text": "Combat Training"}, {"tag": "p", "text": "Although not actual missions, one can do four training simulations of past missions for each of the fighters in the game. Completing at least two will result in a combat medallion of the specific fighter used, with the color depending on how many training missions have been completed."}, {"tag": "h4", "text": "TIE/F missions"}, {"tag": "h4", "text": "TIE/I missions"}, {"tag": "h4", "text": "TIE/B missions"}, {"tag": "h4", "text": "TIE/A missions"}, {"tag": "h4", "text": "Assault Gunboat missions"}, {"tag": "h4", "text": "TIE/D missions"}, {"tag": "h4", "text": "Missile Boat missions"}, {"tag": "h2", "text": "Collector's CD-ROM Edition"}, {"tag": "p", "text": "Like X-Wing, TIE Fighter was also re-released a year later (1995) in an enhanced version including the original release plus two expansions. The game engine was also rebuilt to run under Windows 95."}, {"tag": "p", "text": "Like the previous X-Wing Collector's CD-ROM, it offered full voice-over soundtrack, and an improved rendering engine which supported 640x480 resolution."}, {"tag": "p", "text": "The Collector's Edition featured a completely redone introduction cutscene, all of it was fully rendered. There is now a Super Star Destroyer and a Nebulon-B frigate alongside the many Imperial Star Destroyers. During the assault on the Rebel platform, the Imperials are attacking with TIE Bombers instead of just TIE Interceptors, making the assault more realistic as starfighters' laser cannons would have been unable to do significant damage to a large space station. However the kind of bombs they use to bombard the facility, do not appear in-game."}, {"tag": "p", "text": "The CD-ROM Edition also added a new campaign Enemies of the Empire with 3 brand new Tours of Duty that conclude the scenario."}, {"tag": "p", "text": "TIE Fighter had a major retouch for its release along with the collections X-Wing Collector Series (1998) and X-Wing Trilogy (1999). The game was retrofitted with the Star Wars: X-Wing vs. TIE Fighter graphics engine, which uses texture mapping instead of Gouraud shading. Concourse graphics and some cutscenes were also retouched. This version is the one which will work with MS Windows XP, though the iMuse music system was removed. . However, the original DOS-based Collector's CD version, which includes iMuse, can be emulated using Dosbox."}, {"tag": "h3", "text": "Re-release on GOG.com"}, {"tag": "p", "text": "On October 28, 2014, Disney Interactive announced a new partnership with GOG.com, a DRM-free digital distributor, that would allow for more than twenty classic Lucasfilm video game titles to be re-released digitally for modern computers. Along with Star Wars: X-Wing and Star Wars: Knights of the Old Republic, Star Wars: TIE Fighter became available for digital download for a price of $9.99."}, {"tag": "h2", "text": "Demo"}, {"tag": "p", "text": "LucasArts released a demo of TIE Fighter in early 1994. This demo was based on an unfinished build of the game and has some unique features as a result. It consists of just one long mission in a TIE Fighter against various Rebellion forces. The cockpit is not the same as that in the final game , sound effects are different, and the soundtrack is from Star Wars: X-Wing."}, {"tag": "p", "text": "The demo was sponsored by Dodge and displayed a Neon car advertisement before the gameplay began. It came on two 3.5\" 1.44 MiB floppy disks. The demo announced the game's release date as \"Spring 1994\" but it wasn't released until July."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}