{"url": "Star_Wars:_Starfighter_Missions", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Game stubs", "Category:Incomplete lists", "Category:2020 computer and video games", "Category:Canon mobile games"], "nodes": [{"tag": "h1", "text": "Star Wars: Starfighter Missions"}, {"tag": "p", "text": "Star Wars: Starfighter Missions is a Star Wars mobile flight shooter game by Lucasfilm and the Korean game company JOYMAX. Featuring over 80 iconic starfighters, the game aims to reenact the experience of flying into battles that are featured in the Star Wars films. The game was launched on August 6, 2020, although not in the United States. It was released on November 19 on iOS."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Fly iconic starfighters in [Star Wars: Starfighter Missions], the first Star Wars mobile flight shooter game where you can collect and upgrade over 80 iconic starfighters from the Star Wars galaxy. Take starfighters you've earned in battle and customize them based on your play style and the enemies you are up against."}, {"tag": "p", "text": "As you live out your dream as a Star Wars pilot, flying into battles inspired by those seen in the films, strategically form squadrons of three starfighters and instantly swap them in and out of the heat of battle to gain an advantage in any situation and destroy the enemy. Use powerful and unique skills to dominate the skies in fast-paced dogfights above the breathtaking vistas of your favorite Star Wars planets. Earn new ships or powerful upgrades and customizations when you successfully complete missions."}, {"tag": "p", "text": "Choose your side and seize victory. Join the light side and take command of Han Solo's Millennium Falcon, or join the dark side to crush your enemy with Darth Vader's TIE fighter. Claim victory to acquire special badges and earn your spot in the Hall of Fame."}, {"tag": "p", "text": "Pick a side and scramble your starfighters!"}, {"tag": "p", "text": "KEY FEATURES"}, {"tag": "p", "text": "- Lead a squadron of three starfighters into the heat of battle, instantly swapping them in and out, utilizing each unique ability to survive any situation the battle might throw at you."}, {"tag": "p", "text": "- Fight for the light side or dark side in three different game modes that allow you to experience iconic Star Wars battles inspired by the Classic and Sequel Star Wars trilogies"}, {"tag": "p", "text": "- Complete fast-paced battle stages to collect and upgrade over 80 iconic starfighters and their pilots, including Han Solo's Millennium Falcon, Luke Skywalkers X-wing, Darth Vader's TIE fighter, Kylo Ren's TIE silencer, and more."}, {"tag": "p", "text": "- Experience the unique characteristics of iconic Star Wars planets as you fly over breathtaking vistas or battle it out in orbit"}, {"tag": "p", "text": "- Anyone can play through intuitive gameplay, join the guild with your friends, and compete for higher ranks through the League Ranking System."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}