{"url": "Star_Wars:_Starships,_Speeders_%26_Space_Stations_(Big_Golden_Book)", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Big Golden Books", "Category:Canon reference books"], "nodes": [{"tag": "h1", "text": "Star Wars: Starships, Speeders & Space Stations (Big Golden Book)"}, {"tag": "p", "text": "Star Wars: Starships, Speeders & Space Stations is a canon young-readers book. It was written by Christopher Nicolas and published by Golden Books on July 25, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Explore all the amazing vehicles from the Star Wars universe in this Big Golden Book!"}, {"tag": "p", "text": "From A-wings to X-wings, from landspeeders to snowspeeders, from Death Stars to Star Destroyers—this Big Golden Book is packed with stories about all the awesome vehicles from the Star Wars saga! Featuring stunning retro stylized illustrations, this book is perfect for Star Wars—and Big Golden Book—fans of all ages!"}, {"tag": "p", "text": "Star Wars has captivated millions worldwide for almost forty years. The phenomenon began with the 1977 theatrical debut of Star Wars, later retitled A New Hope, and has expanded to include six additional major motion pictures (The Empire Strikes Back, Return of the Jedi, The Phantom Menace, Attack of the Clones, Revenge of the Sith, The Force Awakens), television programming, publishing, video games, and much more, with new films coming every year."}, {"tag": "p", "text": "Created by visionary writer/director George Lucas, Star Wars is an epic \"space opera\" and an ever deepening, timeless, mythological tale of good versus evil, set in a galaxy far, far away. Filled with noble Jedi Knights, fearsome creatures, and cruel villains, Star Wars introduced \"the Force\" into the global vocabulary, along with characters such as evil Darth Vader, wise old Yoda, idealistic Luke Skywalker, and lovable Chewbacca. The saga continues to grow and expand, delighting new generations with its exotic worlds, iconic themes, and unforgettable stories."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}