{"url": "Star_Wars:_The_Blueprints", "categories": ["Category:Real-world articles", "Category:Real-world reference books"], "nodes": [{"tag": "h1", "text": "Star Wars: The Blueprints"}, {"tag": "p", "text": "Star Wars: The Blueprints is a book by J. W. Rinzler, which collects more than 250 blueprints from the filming of the Star Wars saga. The limited edition was published on September 15, 2011, with only 5,000 hand-numbered English copies available. On April 2, 2013, the book was re-released at a more affordable price."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Limited edition"}, {"tag": "p", "text": "Star Wars: The Blueprints brings together, for the first time, the original blueprints created for the filming of the Star Wars Saga. Drawn from deep within the Lucasfilm Archives and combined with exhaustive and insightful commentary from best-selling author J. W. Rinzler, the collection maps in precise, vivid, and intricate detail the very genesis of the most enduring and beloved story ever to appear onscreen."}, {"tag": "p", "text": "Star Wars: The Blueprints gives voice to the groundbreaking and brilliant engineers, designers, and artists that have, in film after film, created the most imaginative and iconic locales in the history of cinema. Melding science and art, these drawings giving birth to fantastic new worlds, ships, and creatures."}, {"tag": "p", "text": "Most importantly, Blueprints shows how in bringing this extraordinary epic to life, the world of special effects as we know it was born. For the first time, here you will see the initial concepts behind such iconic Star Wars scenes as the Rebel blockade runner hallways, the bridge of General Grievous' flagship, the interior of the fastest hunk of junk in the Galaxy, and Jabba the Hutt's palace. Never before seen craftsmanship and artistry is evident whether floating on the Death Star, escaping on a speeder bike, or exploring the Tatooine Homestead."}, {"tag": "p", "text": "Star Wars: The Blueprints is a limited edition. Only 5,000 hand-numbered English language copies will be available."}, {"tag": "h3", "text": "Hardcover reprint"}, {"tag": "p", "text": "Star Wars: The Blueprints brings together the original technical drawings from deep within the Lucasfilm Archives. Combined with insightful commentary from best-selling author J. W. Rinzler, the collection maps in precise, vivid, and intricate detail the very genesis of one of the most enduring and beloved stories to appear onscreen."}, {"tag": "p", "text": "The meticulously researched text gives voice to the groundbreaking and brilliant engineers, designers, and artists that have, in film after film, created the most imaginative and iconic locales. Blueprints shows how in bringing this extraordinary epic to life, early concepts were translated into iconic sets—the rebel blockade runner, the Millennium Falcon, the bridge of General Grievous's flagship, Jabba the Hutt's throne room, and many others—thanks to the exquisite craftsmanship and artistry of successive art departments."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Bibligraphy"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}