{"url": "Star_Wars:_The_Bad_Batch_(soundtrack)", "categories": ["Category:Real-world articles", "Category:Star Wars: The Bad Batch soundtracks"], "nodes": [{"tag": "h1", "text": "Star Wars: The Bad Batch (soundtrack)"}, {"tag": "p", "text": "Star Wars: The Bad Batch was scored by Kevin Kiner, Sean Kiner and Dean Kiner, Peter Lam, Nolan Markey, and David Glen Russell, with Mark Evans serving as studio personnel and mixer. Produced by Kevin Kiner, the soundtrack for Star Wars: The Bad Batch was first released on May 14, 2021, beginning with the track \"Enter the Bad Batch.\""}, {"tag": "p", "text": "Volume 1 of the soundtrack, comprising episodes one to eight, was released on June 25, 2021; Volume 2 of the soundtrack, which comprises episodes nine to sixteen, will be released on August 20 of the same year."}, {"tag": "p", "text": "The score features the \"Bad Batch Theme\" from Star Wars: The Clone Wars - The Final Season (Episodes 1-4) and introduces \"Omega's Theme.\" The two themes are played in the end credits of The Bad Batch episodes, with the former theme representing Clone Force 99 and the latter representing the character Omega, who debuted in the series premiere, \"Aftermath.\""}, {"tag": "p", "text": "The soundtrack also uses motifs from other Star Wars media. Such as \"The Imperial March,\" hinted at in the track \"Civil War About to Begin\" and featured prominently in the track \"End of the War,\" which also uses \"The Force Theme\" and \"The Emperor's Theme.\" The mystery motif is used in \"Battle Simulation\", while dies irae is used in \"Caleb at the Cliff\" and \"Danger at the Market.\" An incidental motif from A New Hope plays in \"End of the War.\""}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Kiner stated that since The Bad Batch is more of a direct sequel to Star Wars: The Clone Wars than Star Wars Rebels, the score for the new television series evolved directly from The Clone Wars. \"Omega's Theme\" was co-written by Kevin Kiner and his sons Sean and Dean. Kevin Kiner played the solo guitar viola instrument for the track \"Zygerrian Camp,\" and produced Volume I of the soundtrack, which was released with 37 tracks and 118 minutes worth of music."}, {"tag": "h2", "text": "Tracks"}, {"tag": "h3", "text": "Volume 1"}, {"tag": "p", "text": "Total - 118 minutes"}, {"tag": "h3", "text": "Other releases"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}