{"url": "Star_Wars:_The_Clone_Wars:_Episode_Guide", "categories": ["Category:Real-world articles", "Category:Articles needing additional sources", "Category:The Clone Wars reference books"], "nodes": [{"tag": "h1", "text": "Star Wars: The Clone Wars: Episode Guide"}, {"tag": "p", "text": "Star Wars: The Clone Wars: Episode Guide is a reference book by Jason Fry that ties into the Star Wars: The Clone Wars television series. It covers all episodes aired—108 total through Season Five—as well as the feature film. It was released on June 3, 2013. Although primarily designed to give a cohesive timeline between various episodes, the guide also gave some trivia bits and behind the scenes material. In addition, the guide was originally only going to encompass the first 100 episodes in the series, but it was changed nearing completion to include Season 5, especially when Season 5 eventually turned out to be the last season of the series to be aired on Cartoon Network."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Revisit all 108 episodes of  Star Wars: The Clone Wars  TV series with this all-new guide. Each episode of the first five seasons of the animated show gets its own spread, with behind-the-scenes information on the characters, spaceships, weapons, gadgets and more. This definitive guide presents the correct chronological order of the Clone Wars episodes for the first time."}, {"tag": "h2", "text": "Hardcover summary"}, {"tag": "p", "text": "JOURNEY BACK THROUGH THE CLONE WARS"}, {"tag": "p", "text": "Relive the dramatic events of the Clone Wars with this episode-by-episode guide to all five seasons of Star Wars: The Clone Wars."}, {"tag": "p", "text": "Follow the twists and turns of the hit television series as the story unfolds, presented for the first time ever in chronological order."}, {"tag": "p", "text": "Rediscover your favorite heroes and villains, vehicles, droids, and locations, from the very beginning."}, {"tag": "p", "text": "Join the secret missions, sinister plots, epic battles, and deadly duels as the Clone Wars engulf the galaxy."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}