{"url": "Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Freedon_Nadd_Uprising", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Articles that need plot summary", "Category:Star Wars: Tales of the Jedi - The Freedon Nadd Uprising"], "nodes": [{"tag": "h1", "text": "Star Wars: Tales of the Jedi — The Freedon Nadd Uprising"}, {"tag": "p", "text": "Star Wars: Tales of the Jedi — The Freedon Nadd Uprising is a story arc of the Star Wars: Tales of the Jedi comic book series. It ran from August 1, 1994 to September 1, 1994."}, {"tag": "p", "text": "HighBridge Audio released an audio adaptation of the comic."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "While attempting to move the sarcophagi of Freedon Nadd and Queen Amanoa to the moon of Dxun, Jedi Knights Arca Jeth, Ulic Qel-Droma, Cay Qel-Droma, Tott Doneeta and Oss Wilum are attacked by several hundred Naddists, led by Warb Null, invading Iziz from underground. While distracting the Iziz forces, a group of Naddists are able to snatch the sarcophagi and take it back with them underground."}, {"tag": "p", "text": "Master Arca, Ulic and Queen Galia consult Galia's ailing father, King Ommin, for assistance. However, they are confronted by the spirit of Freedon Nadd, and Ommin betrays his seemingly immobile state by attacking Master Arca, knocking him unconscious. Warb Null comes in and attacks Ulic, but is soon bested and killed by the young Jedi. Unfortunately, this gives Ommin the time he needs to kidnap Master Arca."}, {"tag": "p", "text": "Meanwhile, on Ossus, Nomi Sunrider, Dace Diath, Shoaneb Culu, Kith Kark and Qrrrl Toq are chosen to defend Iziz in the forthcoming Second Battle of Onderon."}, {"tag": "p", "text": "On Coruscant, heirs to the Empress Teta system royalty and members of the Dark Side cult the Krath, Satal and Aleema Keto, enter the Galactic Museum and find a fascinating Sith book. Satal steals it while the curator is not looking, and, after seeing a news report on the Sith practitioners still active in Iziz, the Ketos fly to Onderon to find said practitioners and discover the secrets of their new book."}, {"tag": "p", "text": "Satal and Aleema Keto arrive on Onderon to find a massive battle taking place. Their ship, The Krath Enchanter, crashes, but the young Ketos are able to escape with their lives. Meanwhile, the Jedi task force from Ossus, led by Nomi Sunrider, battles their way through Sith war droids and Naddists. Kith Kark is killed in the assault, as the rest of the Jedi infiltrate the royal palace, meeting up with Ulic and Cay Qel-Droma, Tott Doneeta and Oss Wilum."}, {"tag": "p", "text": "Meanwhile, the Ketos are greeted by King Ommin, hoping to unlock the mysteries of their stolen Sith tome. Ommin gives Satal an amulet, with which he can read the book perfectly, as Arca Jeth is hung on the wall, suffering under deadly Sith magic. Out in the battlefield, Cay Qel-Droma has his prosthetic arm cut off by a war droid, which he quickly dispatches of with his organic arm."}, {"tag": "p", "text": "The group of seven Jedi arrive at King Ommin's stronghold, and Ulic slices off the former King's armature, sending him tumbling to the ground limply. Victorious, the forces of Iziz soon transport the sarcophagi of Freedon Nadd, Queen Amanoa and now King Ommin to Dxun, to forever be laid to rest."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the audio version, the Ketos locate the Museum they are searching for through the use of a Location monitor, instead of the guide book which appears in these comics."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}