{"url": "Star_Wars:_Super_Bombad_Racing", "categories": ["Category:Real-world articles", "Category:Non-canon Legends articles", "Category:2001 computer and video games", "Category:Non-canon computer and video games", "Category:Racing games"], "nodes": [{"tag": "h1", "text": "Star Wars: Super Bombad Racing"}, {"tag": "p", "text": "Star Wars: Super Bombad Racing is a 2001 PlayStation 2 kart racer released shortly after Star Wars: Starfighter. Using characters and locations from Star Wars: Episode I The Phantom Menace, the game challenges you to race up to eight CPU opponents or four of your friends, using weapons and gadgets to gain the upper hand. A secondary arena battle mode allowed pure combat between racers."}, {"tag": "p", "text": "The game's trademark was the appearance of the characters: in similar style to Mario Kart for the Nintendo 64, the characters all had oversized heads and piloted shrunken vehicles. The vehicles, however, all hovered, making Super Bombad Racing a unique skill to master in the handling department."}, {"tag": "p", "text": "Developed by Lucas Learning and published by LucasArts, the game was mainly aimed at children thanks to the \"cute\" cartoon appearance of the characters and locations. Several of the characters have been toned down from their appearances in Star Wars: Episode I The Phantom Menace, and character taunts between racers are all kid-friendly. Each racer has a special, racer-exclusive weapon or ability. Musically, the game features recognizable themes from the John Williams film scores, but all have been reworked into childish, pop-type beats."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "h3", "text": "Racers"}, {"tag": "h3", "text": "Courses"}, {"tag": "h3", "text": "Arenas"}, {"tag": "h3", "text": "Unlockable Content"}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Super Bombad Racing received mixed responses when released in 2001. Some praised the game, calling it an accomplished kart racer and a welcome addition to the then-short list of PlayStation 2 titles. Others, however, felt that while the game was mechanically sound, the Star Wars setting and appearance felt \"tacked on\" and therefore a dirty ploy to make money for LucasArts. Others roundly criticized the game, both for turning Star Wars into a childish kart racer and for simply making a bad game. GameSpot.com gave Super Bombad Racing a score of 6.2 out of 10, saying it \"...introduces a few clever concepts, but its length and the gameplay flaws significantly limit the game.\""}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Trivia"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}