{"url": "Star_Wars:_Starfighter", "categories": ["Category:Real-world articles", "Category:Articles with unencyclopedic tone", "Category:Pages needing citation", "Category:2001 computer and video games", "Category:2003 computer and video games", "Category:Legends computer games", "Category:Legends console video games", "Category:LucasArts games", "Category:Real-world arcade games"], "nodes": [{"tag": "h1", "text": "Star Wars: Starfighter"}, {"tag": "p", "text": "Star Wars: Starfighter is a flight simulation video game for the PC, Xbox and PlayStation 2 that takes place during Star Wars: Episode I The Phantom Menace, released on February 19, 2001."}, {"tag": "p", "text": "Star Wars: Starfighter Special Edition is an improved version of the original release, Star Wars: Starfighter. It included several bonus features not included in the first title, such as improved graphics, special bonus levels, unlockable fighter craft and even some two-player versions of story levels."}, {"tag": "p", "text": "The game's script was worked on by Matt Jacobs."}, {"tag": "p", "text": "In 2003, Tsunami Visual Technologies, Inc. released a version of the game for the TsuMo arcade motion multi-game system. This version featured five levels. On April 28, 2015, the game was made available on PlayStation Network, allowing it to be played on PlayStation 3."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "The storyline follows the exploits of three pilots prior to and during the Invasion of Naboo; Naboo starfighter pilot Rhys Dallows, mercenary Vana Sage and Feeorin pirate Nym. While Dallows defends Queen Amidala from mercenaries in the Naboo system, Vana Sage is betrayed by the Trade Federation near Eos, and Nym carries out raids on Federation freighters over Lok. The three ultimately cross paths, and set out to fight back against the Trade Federation following the death of Dallows' mentor, Essara Till, and the capture of Nym's base on Lok. The pilots join the Battle of Naboo, with Nym and Vana protecting a groundside settlement while Dallows takes the fight to the orbital Droid Control Ship with Bravo Squadron."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "The story begins with Rhys Dallows, a budding N-1 starfighter pilot. After a short combat tutorial with his mentor Essara Till, the two are assigned their first joint mission. They are to escort Padmé Amidala traveling in the Royal Starship as she meets with Trade Federation officials. The meeting is revealed to be a trap, and Rhys and Essara are forced to defend the royal starship from mercenaries until it can escape. After it jumps into hyperspace, Essara is killed by an unidentified ship, and Rhys's ship is disabled. Rhys is later rescued by the Toydarian Reti in the Zoomer."}, {"tag": "p", "text": "The story shifts to Vana Sage, a mercenary employed by the Trade Federation. She is hired to help test the Scarab-class droid starfighter, which serves as an informal tutorial for controlling her ship. After completing the task, her astromech droid, Mod-3, intercepts a transmission about the illegal invasion of Naboo. The Trade Federation subsequently terminates her contract and sends numerous \"Hunter-Killer\" droids and a squad of mercenaries to kill her. Vana manages to destroy all but one of the droids, which leads her to a droid production factory on the volcanic planet of Eos. After a brief investigating of the factory, she returns to her base of operations, awaiting Reti and Rhys."}, {"tag": "p", "text": "Nym, a Feeorin pirate Vana had managed to capture at some point before the events take place, had escaped and now threatened to kill Vana. She manages to buy him off by telling him about the droid factory she discovered on Eos, which he repays by trapping her in a locker and meeting back up with his pirate group above Lok. Nym then had started a piracy operation which began the First Battle of Lok, disabling a freighter in orbit and managing to send it crashing to Lok's surface, Nym's pirates steal valuable supplies from the crashed freighter and attempt to return to their base by navigating through a river defending the small freighter to a cave. The Trade Federation strikes back, overrunning Nym's pirates and forcing him to self-destruct the base as they return to Vana's home."}, {"tag": "p", "text": "Reti and Rhys arrived at Vana's home and found her in the locker and released her. Nym then arrived back at Vana's station, After the meeting between Rhys, Vana, Nym and Reti, the four ally with each other in an attempt to stop the Trade Federation once and for all. The character played as varies throughout the second half of the game, as the small group destroys the droid factory on Eos, disables a Trade Federation freighter and steals supplies, delivers those supplies to Bravo Flight, rescues Trade Federation prisoners, and then defends the Naboo Royal Guard's outpost. Failure of this mission only occurs if either the outpost is badly damaged or 5/10 defense turrets are destroyed. The final mission takes place around the Droid Control Ship, as Bravo Flight destroys the receiver stations on the exterior of the ship. When they destroy all the droid starfighters currently deployed, the leader of the Trade Federation-hired mercenaries appears. The shield to one of the hangar bays opens; a landing craft leaves as the mercenary and Rhys enter. The lander can be destroyed but requires tremendous amounts of time and damage to destroy. The shield closes again, trapping Rhys inside and the rest of Bravo Flight outside of the ship. Inside the hangar bay, several landing craft surround the area. These can also be destroy except the landers. Destroying these makes the hangar safer to navigate. A fierce battle throughout the inner bays of the ship ensues, with Rhys eventually destroying the mercenary's ship. When Anakin Skywalker fires the shot that destroys the control ship, Dallows escapes the doomed vessel by destroying the shield generator blocking his escape route."}, {"tag": "p", "text": "After the battle, the three heroes meet and exchange farewells before Nym's departure to rejoin his fellow pirates."}, {"tag": "h2", "text": "Bonuses"}, {"tag": "h3", "text": "Missions"}, {"tag": "p", "text": "These missions are unlockable by completing campaign missions with gold medals."}, {"tag": "h3", "text": "Vehicles"}, {"tag": "p", "text": "These vessels are unlocked for use in every mission by attaining certain gold medals or entering cheat codes."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}