{"url": "Star_Wars:_The_Clone_Wars_(comics)", "categories": ["Category:Real-world articles", "Category:The Clone Wars comics"], "nodes": [{"tag": "h1", "text": "Star Wars: The Clone Wars (comics)"}, {"tag": "p", "text": "Star Wars: The Clone Wars was a comic book series published by Dark Horse Comics. The first issue was released on September 10, 2008. The series ran for 12 issues tied in to the Star Wars: The Clone Wars animated series. The first story arc was written by Henry Gilroy, the head writer for the first season of the show. The series was supposed to be composed of only six issues, but it was so successful that on January 18, 2009, Dark Horse editor Randy Stradley announced six more issues. Those issues were composed of two three-part stories, co-written by Henry Gilroy and series writer Steven Melching. All Issues were later compiled in three seperate trade paperbacks and released in the same format as the Star Wars: The Clone Wars graphic novellas. On December 28, 2009, Randy Stradley announced the cancellation of the series due to the young-comics-readers market being too small."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Set in the time between Attack of the Clones and Revenge of the Sith, this new series will focus on the legendary Clone Wars! Some of your favorite Jedi: Obi-Wan Kenobi, Anakin Skywalker, Master Yoda, Master Mace Windu, and others, will be joined by a few new faces as they fight to maintain the true spirit of the Republic."}, {"tag": "p", "text": "In addition to the lead story, each issue will feature a backup story by one of the artists from the TV series!"}, {"tag": "p", "text": "This new series will be a compliment [sic] to Lucasfilm's highly anticipated CGI-animated The Clone Wars movie and television programs!"}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ", with comments by John Ostrander"}, {"tag": "p", "text": ""}]}