{"url": "Star_Wars:_The_Clone_Wars_(novelization)", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Articles with an excess of redlinks", "Category:Film novelizations", "Category:Star Wars: The Clone Wars tie-in novels"], "nodes": [{"tag": "h1", "text": "Star Wars: The Clone Wars (novelization)"}, {"tag": "p", "text": "Star Wars: The Clone Wars is the novelization of the 2008 Lucasfilm Animation movie of the same name. It was written by Karen Traviss and published by Del Rey on July 26 of that year. The story tells of the first meeting between Jedi Knight Anakin Skywalker and his new Padawan apprentice, Ahsoka Tano, amidst the raging Clone Wars."}, {"tag": "p", "text": "The Star Wars: The Clone Wars novelization is the first of five Star Wars Legends novels published by Del Rey that tie in to the Star Wars: The Clone Wars animated television series. The following four novels comprise the Star Wars: The Clone Wars and Star Wars: Clone Wars Gambit series by Traviss and Karen Miller."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Back cover"}, {"tag": "p", "text": "The raging Clone Wars illuminate dark motives and darker destinies until one question must be answered: Does the end ever justify the means? It's time the Jedi found out."}, {"tag": "h3", "text": "Inside flap"}, {"tag": "p", "text": "Across the galaxy, the Clone Wars are raging. The Separatists, led by Count Dooku, the onetime Jedi and now secret Sith Lord, continue to press forward, and more and more worlds are either falling, or seceding and joining the cause. Under the leadership of Supreme Chancellor Palpatine, the Republic heroically battles on, championed by its huge army of cloned soldiers and their Jedi generals."}, {"tag": "p", "text": "Anakin Skywalker, believed by some to be the prophesied \"Chosen One\" destined to bring balance to the Force, is now a Jedi Knight under the tutelage of his Jedi Master, Obi-Wan Kenobi. Death is a constant possibility—and his chances of survival aren't improved by the unexpected arrival of an apprentice: Ahsoka, a brash inexperienced fourteen-year-old Padawan. But there's no time for Anakin to question his latest orders. He and Obi-Wan have been assigned a new mission, and failure is not an option."}, {"tag": "p", "text": "Jabba the Hutt's precious infant son has been kidnapped, and when the frantic parent applies to the Jedi for help, it falls to Anakin, Obi-Wan, Ahsoka, and their clone troops to track down the evidence and retrieve the missing Huttlet. And more is at stake: For a grateful Jabba just might allow the Republic access to the Hutt-controlled space lanes that the Grand Army desperately needs in order to beat the Separatists into submission."}, {"tag": "p", "text": "But the Republic is not the only power that craves access to those space lanes. Count Dooku, determined to win the prize for the Separatists, has set a trap for the Jedi. When they find the Huttlet, they will also find Dooku's master assassin, Asajj Ventress, and countless legions of battle droids waiting to spring a trap."}, {"tag": "p", "text": "The blazing new animated feature film Star Wars: The Clone Wars takes place in the years preceding Star Wars: Episode III Revenge of the Sith and sets the stage for the groundbreaking TV series. Both contain all original material—direct from the brilliant imagination of legendary Star Wars creator George Lucas. And these exciting new adventures and characters are being brought to life in book form by none other than #1 New York Times bestselling Star Wars author Karen Traviss."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Star Wars: The Clone Wars has raised multiple continuity issues."}, {"tag": "h3", "text": "Portrayal of the Jedi Order"}, {"tag": "p", "text": "Karen Traviss' portrayal of the Jedi Order and Anakin Skywalker is in conflict with George Lucas' vision of the Star Wars universe. The harsh critique and accusations against the Jedi Order - gathering wealth what they don't use to help those who are in need, having a cold, loveless community, turning a blind eye on the Republic's flaws - embedded in Anakin's point of view are grounded on Traviss' twisted interpretation of the Jedi Code or claims asserted by the author without any canonical basis. Additionally, Anakin is portrayed as a young man who is struggling with repressed rage and shows signs of obsessive love disorder - in George Lucas' movies and television series he has none of this traits."}, {"tag": "h3", "text": "Dating of events"}, {"tag": "p", "text": "The Star Wars Annual 2011 establishes that the story takes place in the second year of the war, as part of the Clone Wars timeline restructuring necessitated by the TV series. The Essential Reader's Companion revised the story's dating to 22 BBY."}, {"tag": "p", "text": "The book was released before the feature film was released, and contains many details from the screenplay's early drafts that did not appear in the final cut of the film."}, {"tag": "h3", "text": "CT-9932"}, {"tag": "p", "text": "In the Battle of Teth, after Asajj Ventress's droid forces massacre most of Torrent Company, near the end of chapter 12, Captain Rex asks the survivors to report in via comlink. He gets six responses, including Coric and CT-9932."}, {"tag": "p", "text": "When the surviving troopers are next mentioned near the end of chapter 13, there are six total—Rex, Coric, Zeer, Attie, Nax, and Del—and this remains consistent throughout the rest the Teth sequence. This indicates either that two of the comlink responses in chapter 12 came from the same trooper, or that one of the survivors who reported in died in the intervening time. If there was no additional casualty, CT-9932 must be the designation for Zeer, Attie, Nax, or Del, though the novel does not connect it to an individual trooper."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "American"}, {"tag": "h4", "text": "British"}, {"tag": "h4", "text": "Foreign"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}