{"url": "Star_Wars:_The_Clone_Wars_(multimedia_project)", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Star Wars: The Clone Wars multimedia project"], "nodes": [{"tag": "h1", "text": "Star Wars: The Clone Wars (multimedia project)"}, {"tag": "p", "text": "The Star Wars: The Clone Wars multimedia project is an ongoing project created by Lucasfilm Ltd., in conjunction with Del Rey, Dark Horse Comics, Cartoon Network and LucasArts. The main focus of the project is the Star Wars: The Clone Wars television series that premiered in 2008 and concluded in 2020 with the final season."}, {"tag": "p", "text": "Chronicling the three year period of the Clone Wars between the films Star Wars: Episode II – Attack of the Clones (2002) and through Star Wars: Episode III – Revenge of the Sith (2005), the project consists of a vast array of novels, comic books, video games and other media."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Feature film"}, {"tag": "p", "text": "The TV series was preceded by a full-length 3D animated feature film, directed by Dave Filoni. The film was released theatrically on August 14, 2008 and focused on Jedi Anakin Skywalker, Obi-Wan Kenobi and Ahsoka Tano foiling a scheme by Count Dooku to kidnap Rotta, the son of influential gangster Jabba Desilijic Tiure."}, {"tag": "h3", "text": "Television"}, {"tag": "p", "text": "The TV series premiered on Cartoon Network October 3, 2008 with the episode \"Ambush\" and ended its run on the channel with \"The Wrong Jedi\", the final episode of the fifth season. A sixth season, titled The Lost Missions, was shown on the Netflix streaming service, after which the series was cancelled."}, {"tag": "p", "text": "At San Diego Comic-Con 2018, Dave Filoni announced the show's return for a seventh and final season. The twelve episodes premiered on Disney's streaming platform Disney+ from February 21 to May 4, 2020."}, {"tag": "p", "text": "Although it primarily centered on the exploits of Skywalker, Kenobi, Tano and Captain Rex during the course of the Clone Wars, the series nonetheless featured a large cast of characters, with entire episodes focusing on other Jedi, clone troopers, politicians and many other individuals affected by the war."}, {"tag": "h4", "text": "Legacy"}, {"tag": "p", "text": "Eight unfinished episodes were released on StarWars.com in story-reel form as part of The Clone Wars Legacy project in 2014-2015."}, {"tag": "h3", "text": "Books"}, {"tag": "h4", "text": "Legends"}, {"tag": "p", "text": "A series of five tie-in novels were released between 2008 and 2010, authored by Karen Traviss and Karen Miller."}, {"tag": "p", "text": "A series of young adult novels by Ryder Windham was published between 2009 and 2012"}, {"tag": "p", "text": "Additionally, a variety of books for young reader audiences was published, as well as a number of reference books."}, {"tag": "h4", "text": "Canon"}, {"tag": "h3", "text": "Comics"}, {"tag": "p", "text": "A monthly comic series ran for twelve issues and was published between 2008 and 2010"}, {"tag": "p", "text": "A series of digest sized graphic novels lasted for ten issues"}, {"tag": "p", "text": "In addition to those, a number of other related series and one-shot comics have been published"}, {"tag": "h3", "text": "Video games"}, {"tag": "p", "text": "A number of tie-in video games have been released, including"}, {"tag": "h3", "text": "Other media"}, {"tag": "p", "text": "An online in-universe news outlet briefly existed in 2008 and was brought back in 2009 to tie-in to the Republic Heroes video game. Each episode of the series is also accompanied by an episode guide, published online."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "On April 25, 2014, much of the pre-existing Expanded Universe material was declared non-canon by Lucasfilm Ltd., although the Star Wars: The Clone Wars TV series and the 2008 film remained canon."}, {"tag": "p", "text": "Wookieepedia treats the 2008 feature film and seasons one through six as belonging to both \"Legends\" and canon continuities. Tie-in media published prior to the LucasFilm declaration of April 25, 2014 is considered solely \"Legends\", while television episodes and tie-in material published after that date is exclusively canon."}, {"tag": "h2", "text": "Notes and references"}]}