{"url": "Bastion/Legends", "categories": ["Category:Legends articles", "Category:Bastion locations", "Category:Braxant Run", "Category:Braxant sector planets", "Category:Confederacy of Independent Systems planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Empire-in-exile planets", "Category:Fel Empire planets", "Category:Fortress worlds", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Imperial Remnant planets", "Category:Pentastar Alignment planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Bastion"}, {"tag": "p", "text": "Bastion, originally Sartinaynian, was the capital world of the Imperial Remnant, a successor state of the Galactic Empire, located in the Braxant sector in the Outer Rim Territories, and later the Fel Empire and Empire-in-exile. Bastion was located in the Sartinaynian system at the terminus of the trade route known as the Braxant Run."}, {"tag": "p", "text": "Originally, \"Bastion\" was just a term for the worlds on which the Remnant's Council of Moffs and administrative headquarters were temporarily located. By the time of the Caamas Document Crisis, the Imperial government was located on Sartinaynian; it was the last of these worlds, where the rulers of the Empire relocated shortly before peace with the New Republic in 19 ABY."}, {"tag": "p", "text": "Bastion's location remained a closely guarded secret, until the events surrounding the discovery of the Caamas Document in 19 ABY forced Han Solo and Lando Calrissian to locate the planet in an attempt to find a complete copy in the Imperial archives. It later became the capital world of the Imperial Remnant, the Fel Empire, and later Roan Fel's Empire-in-exile."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Old Republic era, the planet had originally been settled by Humans who opposed alien membership in the Galactic Republic. However, political realities eventually forced the colonists to join the Republic, and ironically, the colony relied heavily on the alien Muuns of the InterGalactic Banking Clan for financial support, based on nearby Muunilinst. Both planets would remain loyal to the New Order, and the continuing leverage enjoyed by Muunilinst could be seen by that world's refusal to surrender one of its defensive Golan battlestations to guard Bastion. Instead, the capital was orbited merely by the Bastion customs station."}, {"tag": "p", "text": "Bastion was in Confederate space during the Clone Wars."}, {"tag": "p", "text": "Like its predecessors, it served as the meeting place for the Moff Council and the site of the state archives, the civil administration, and Bastion Military Control; but the Imperial leadership strove to keep the precise location of this new Bastion as secret as possible to prevent the New Republic mounting a direct assault on their command facilities, so the fact that Sartinaynian was Bastion was not initially widely-known. Following the Bastion Accords that ended the Galactic Civil War, the Imperial Remnant no longer required a mobile, secret capital; thus, Sartinaynian remained the Imperial capital and became increasingly well-known in this role, so that the name of Bastion became permanently associated with the planet, eclipsing its old name."}, {"tag": "p", "text": "In addition to serving as capital of the Imperial Remnant as a whole, Bastion also served as the throne world for the Imperial Moff of the Braxant sector, namely Moff Vilim Disra during the Galactic Civil War, and his successor, Ephin Sarreti, during the Yuuzhan Vong War. While Disra had been appointed a Moff by Emperor Palpatine, Sarreti was a young man whom had never even met Palpatine, and was not as enmeshed in Palpatine's prejudices, making him a more popular leader in the progressive, \"reformed\" Imperial Remnant."}, {"tag": "p", "text": "During the Yuuzhan Vong invasion, Bastion was attacked by forces under the command of B'shith Vorrik. Vorrik destroyed the planetary defenses and the bulk of the Imperial fleet there, as well as much of the surface of the planet. Fortunately, the fleet was able to buy enough time for most of the planet's population to evacuate before it was defeated."}, {"tag": "p", "text": "Bastion was rebuilt, continuing to serve as the Imperial capital until their recapture of Coruscant. Two years after the Second Galactic Civil War had ended, Bastion was the world that had represented the Imperial Remnant during the Unification Summit by Jagged Fel on Coruscant. By 130 ABY, it was said to be the most fortified planet in the galaxy."}, {"tag": "p", "text": "In 137 ABY, Emperor Roan Fel reclaimed the planet as a base of operations against the usurper to the Imperial throne, Darth Krayt. He drew loyalist forces to the planet, in order to further ensure its protection against Sith attack. The planet's nigh impenetrable defense systems made Bastion as well defended as Coruscant, which prevented any direct assault on the planet."}, {"tag": "p", "text": "Despite Bastion being a fortress world, Darth Kruhl was still able to get on-planet when Governor Vikar Dorn of Munto Codru pretended to defect to Fel's faction of the Empire. Kruhl made it all the way to the Pellaeon Gardens, where Fel had been meditating. It was there that Fel killed him. After the incident non-Imperials were no longer allowed to visit Bastion, as the threat to the Emperor was too great. The Sith, however, still tried to find a way to infiltrate Bastion and so they offered a million credits to anyone who could penetrate the planet's defenses."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}