{"url": "Star_Wars:_The_Comics_Companion", "categories": ["Category:Real-world articles", "Category:Comics", "Category:Real-world reference books"], "nodes": [{"tag": "h1", "text": "Star Wars: The Comics Companion"}, {"tag": "p", "text": "Star Wars: The Comics Companion is a Star Wars Legends reference book chronicling the storyline of Star Wars comic books published under Dark Horse Comics. It was written by Ryder Windham and Daniel Wallace, and published by Dark Horse Books on February 21, 2006."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Dark Horse presents the definitive guide to Star Wars comics, complete with in-depth coverage all the way through Episode III! Written by Ryder Windham, Star Wars expert, and densely illustrated with both brand-new art and classic images from the comics, this chronological compendium contains everything you need to be the ultimate Star Wars reader in-the-know. Follow Anakin Skywalker's descent into darkness, from his early days as a Padawan, to his harrowing Clone Wars battles, up through his transformation and eventual death as Darth Vader. Get complete details on the exploits of Luke and Leia, Han and Chewie, and all the rest of the gang, with thorough rundowns of classic Star Wars tales originally printed decades ago! Spanning over 25,000 years of Star Wars history, from the very beginnings of the Jedi order, no character goes unmentioned and no quadrant goes unmapped."}, {"tag": "p", "text": "This clear and complete handbook covers everything from Star Wars: Dark Empire to Episode III—the bible for any serious Star Wars comics reader, and anyone looking to become one!"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "Introduction"}, {"tag": "p", "text": "The Old Republic Era: 25,000-1,000 Years Before Episode IV A New Hope"}, {"tag": "p", "text": "The Rise of the Empire Era: 1,000-0 Years Before Episode IV A New Hope"}, {"tag": "p", "text": "The Rebellion Era: 0-5 Years After Episode IV A New Hope"}, {"tag": "p", "text": "The New Republic Era: 5-25 Years After Episode IV A New Hope"}, {"tag": "p", "text": "The New Jedi Order Era: 25+ Years After Episode IV A New Hope"}, {"tag": "p", "text": "Manga Editions"}, {"tag": "p", "text": "Anthologies"}, {"tag": "p", "text": "Infinities (non-continuity)"}, {"tag": "p", "text": "Index"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}