{"url": "Star_Wars:_The_Last_Jedi:_Expanded_Edition", "categories": ["Category:Real-world articles", "Category:Canon adult novels", "Category:Film novelizations"], "nodes": [{"tag": "h1", "text": "Star Wars: The Last Jedi: Expanded Edition"}, {"tag": "p", "text": "Star Wars: The Last Jedi: Expanded Edition is the novelization of the sequel trilogy film Star Wars: Episode VIII The Last Jedi. Written by Jason Fry, with input from director Rian Johnson, the novelization includes deleted scenes and other additional content. The book was first published by Del Rey in hardcover and eBook formats on March 6, 2018. A paperback edition was released on November 27, 2018."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Written with input from director Rian Johnson, this official adaptation of Star Wars: The Last Jedi expands on the film to include scenes from alternate versions of the script and other additional content."}, {"tag": "p", "text": "From the ashes of the Empire has arisen another threat to the galaxy's freedom: the ruthless First Order. Fortunately, new heroes have emerged to take up arms—and perhaps lay down their lives—for the cause. Rey, the orphan strong in the Force; Finn, the ex-stormtrooper who stands against his former masters; and Poe Dameron, the fearless X-wing pilot, have been drawn together to fight side-by-side with General Leia Organa and the Resistance. But the First Order's Supreme Leader Snoke and his merciless enforcer Kylo Ren are adversaries with superior numbers and devastating firepower at their command. Against this enemy, the champions of light may finally be facing their extinction. Their only hope rests with a lost legend: Jedi Master Luke Skywalker."}, {"tag": "p", "text": "Where the action of Star Wars: The Force Awakens ended, Star Wars: The Last Jedi begins, as the battle between light and dark climbs to astonishing new heights."}, {"tag": "p", "text": "Featuring thrilling photos from the hit movie."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The novel contains several differences to the film and scenes that don't appear in the final film:"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}