{"url": "Star_Wars:_The_Interactive_Video_Board_Game", "categories": ["Category:Real-world articles", "Category:Home video", "Category:Real-world board games"], "nodes": [{"tag": "h1", "text": "Star Wars: The Interactive Video Board Game"}, {"tag": "p", "text": "Star Wars: The Interactive Video Board Game (subtitled Assault on the Death Star) is a 1996 board game released by Hasbro Inc.."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following a failed attempt by the Rebel Alliance to destroy the second Death Star, Emperor Palpatine orders Darth Vader to take command of the battlestation and move it to the forest moon of Endor to be completed in secret. Shortly thereafter, he learns of a major Rebel supply base on the planet D'rinba IV and diverts its course to the planet, intending to use the battlestation's superlaser to destroy it. Intercepting this information, the Alliance assembles a team of Force-sensitive individuals to sneak onboard and disable the station. However, Vader soon learns of their presence and has the station put on alert. The situation becomes a race against time for the members of the infiltration party, as they must attempt to succeed in their mission while avoiding the station's stormtrooper contingent and, late in the mission, a party member's fall to the Dark side of the Force."}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "The game is based on cards and die, and requires the assembly of various three-dimensional components."}, {"tag": "p", "text": "The game contains a VHS tape that is played on a television screen as the players play the game. In the tape, Vader arrives onboard the second Death Star to take command of the station to destroy a Rebel Alliance supply base on the planet D'rinba IV. The player characters are tasked with the mission to stop him."}, {"tag": "p", "text": "The tape contains scenes from the original trilogy mixed with footage shot specifically for the tape by Gilbert Taylor, cinematographer for A New Hope. The footage, shot over the course of 2 days, features David Prowse and James Earl Jones reprising their roles as the physical presence and voice of Darth Vader respectively. Prowse wore an original Vader costume from the Lucasfilm Archives. Production Design was by Frank Walsh (www.fwalsh.com) who later went onto designing sets for the Netflix Sci-fi series Lost in Space. Sets were built by Dick George Productions, who previously worked on some of the sets for A New Hope."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "This game was referenced in The Dark Forces Saga, a series of online adventure scenarios for the Wizards of the Coast Star Wars RPG line published on their website. Written by Abel G. Peña, this series canonizes four of the VCR game's player characters as Kyle Katarn, (from Star Wars: Dark Forces), Shira Brie (from the Marvel Comics Star Wars series), Corwin Shelvay (from West End Games's Star Wars RPG material), and Erling Tredway (also from West End Games's Star Wars RPG material.)"}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Chris Bishop of Echo Station reviewed the game positively and noted its high production value, though at first glance finding the game to look intimidatingly complicated and bearing a lot of instructions. He noted that the story sacrificed continuity with the movies, wherein the Death Star's superweapon would not yet be fully operational. He found that James Earl Jones's performance gave an oddly softly spoken Darth Vader character."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}