{"url": "Star_Wars:_The_Force_Unleashed_II_(comic)", "categories": ["Category:Real-world articles", "Category:Comic adaptation trade paperbacks", "Category:Comic video game adaptations", "Category:The Force Unleashed"], "nodes": [{"tag": "h1", "text": "Star Wars: The Force Unleashed II (comic)"}, {"tag": "p", "text": "Star Wars: The Force Unleashed II is the graphic novel version of Star Wars: The Force Unleashed II. Along with the book, it features the storyline of the game. It was revealed at Celebration V to be the story of the game retold by Boba Fett."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The end of the story in the hugely popular game The Force Unleashed left the Star Wars galaxy poised at the brink of civil war. But before that can happen, the Emperor and his apprentice, Darth Vader, have another plan already in play."}, {"tag": "p", "text": "The author of the original game, Haden Blackman, returns with a new story of treachery, deception, and the manipulation of the overwhelming power of the Force. Omar Francia, from Star Wars: Legacy and Mass Effect, is back, providing the amazing art for this original graphic novel based on the upcoming LucasArts game!"}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "In the year 1 BBY (exactly 1 year before the Battle of Yavin), the bounty hunter Boba Fett is residing on Nar Shaddaa with his occasional partner Xasha. At this time, both bounty hunters are virtually bankrupt, though Xasha remains optimistic about the prospect of rebuilding their financial status. Fortunately for Fett, he receives a transmission from Darth Vader, who wishes to provide the bounty hunter with an assignment to capture a target more dangerous than any of Fett's usual prey. With the prospect of being paid triple his usual rate, Fett and Xasha traveled aboard Slave I to intercept the target on Cato Neimoidia, the planet that Vader anticipated as the target's intended destination."}, {"tag": "p", "text": "After arriving at Cato Neimoidia's coordinates, Fett filled Xasha in on the details of their assignment, revealing that the target is called \"Starkiller\" and that he is exceptionally strong in the Force. Both bounty hunters soon got an idea about just how powerful Starkiller was when they saw the ruins of Tarko-se. After entering what was left of the city, it became clear that they had missed the battle. As they searched the ruins of the city, all they could find amongst the tons of wreckage were the dead bodies of many Stormtroopers. Xasha was interested in scavenging parts of Stormtrooper armor in order to sell them on the black market, believing they would be worth a lot of money to the right buyers. Fett forced Xasha to leave the dead troopers alone so that they could remain focused on their mission."}, {"tag": "p", "text": "They discovered the body of a massive beast, which appeared to have died from massive physical injuries. After seeing all that Starkiller was capable of, Xasha became filled with doubt and felt that she and Fett were hardly qualified to confront someone of Starkiller's caliber. At that moment, Fett detected a heartbeat just as the creature awakened. While Xasha dodged the monster's attacks, Fett analyzed the beast and learned that it possessed a secondary heart. Unable to count on any of his weapons, Fett used his jetpack to shoot his body right through the creature's chest in a desperate effort to take out its spare heart. The encounter with the creature, as well as seeing all of the destruction that Starkiller was capable of, discouraged Xasha from continuing the hunt any further, which Boba Fett had anticipated. Although Xasha tried to convince Fett to leave the job behind and stay with her, Fett declined her offer. Before leaving, she expressed her fondness of their partnership, as well as her hope that Fett wouldn't lose his life on such a dangerous mission."}, {"tag": "p", "text": "After parting with Xasha, Boba Fett traveled to Timira City, a cloning facility located on his homeworld of Kamino. After watching a holographic recording of Starkiller's last encounter with Darth Vader, Fett learned that \"Starkiller\" was actually a clone, who was created from the corpse of the original Starkiller. Fett was surprised to discover that Vader created a clone who was capable of escaping from Kamino, leveling an entire city and defeating a giant beast on Cato Neimoidia. Vader simply dismissed the clone as a failed experiment and commanded the bounty hunter to locate Captain Juno Eclipse and bring her to Kamino, knowing that the clone would follow. Fett requested assistance from at least a squadron of stormtroopers, though he doubted that they would survive the mission. Vader did not care about how many resources had to be used to bring the clone back to him, and thus gave Fett much more than he requested. After looking over several Terror Troopers and a Terror Walker, Fett was satisfied and began preparations to complete his assignment."}, {"tag": "p", "text": "Before leaving Kamino, Boba Fett inspected a new batch of clones that were still being developed inside of their cloning tanks. The cloning technician who oversaw their development commented on how new accelerated cloning process allowed him to develop fully-matured clone units in a mere few weeks. However, the process was still in its experimental stage and thus, the clones suffered from \"abnormal brain development.\" The cloning technician concluded that all of the clones would eventually go insane. He was confident that some clones could remain psychologically stable for at least a year, maybe longer, but others would suffer from mental degradation before they could even complete their basic training."}, {"tag": "p", "text": "Aboard Slave I, Boba Fett interrogated a Human male from Corellia who secretly joined the ranks of the Alliance to Restore the Republic. After injecting the Rebel prisoner with a truth serum, Fett learned the name and transponder code of the Salvation, the frigate under the command of Captain Juno Eclipse. Since he was not paid to kill the prisoner, Fett spared the Rebel's life, only to drop him off on a world populated by vicious carnivores."}, {"tag": "p", "text": "After discovering the Salvation hiding within an asteroid belt, Boba Fett and his Imperial squadron waited behind the asteroids until the Rogue Shadow arrived and prepared to dock with the Rebel frigate. Fett knew that the clone was on the starship and immediately ordered his forces to launch their surprise attack. The Rebels were completely caught off guard and though they tried to retaliate, Fett told his squadron to ignore the other Rebel ships and concentrate entirely on the Salvation. The bounty hunter then boarded the frigate and personally led a squadron of Terror Troopers to the bridge, shortly after warning them about Starkiller's Force abilities, especially his proficiency with Force lightning. He also ordered that all Rebels were to be killed, except for Captain Eclipse. With the help of the Terror Troopers, Fett stormed the bridge, disabling PROXY and shooting Eclipse in the arm while his troops eliminated the rest of the bridge's crew."}, {"tag": "p", "text": "Before being forced inside Slave I by Fett, Eclipse caught a brief glimpse of \"Starkiller.\" But since she did not yet know that he was a clone, she assumed that he was the same young man that she knew before his death. Before Starkiller could do anything to stop the bounty hunter, Boba Fett escaped from the damaged frigate with his prisoner and immediately entered a course for Kamino to fulfill his mission. Through the Terror Walker's view, Fett watched as Starkiller destroyed dozens of Terror Droids, including the Terror Walker as well. Eclipse warned Fett that Starkiller would come after her, to which Fett had not doubt of, considering everything all that he did just to search for her. Eclipse tried to scare Fett by pointing out that Starkiller did not possess the restraint and control of a Jedi, and that he would utterly destroy Fett just to rescue her, even if it meant pulling down an entire Star Destroyer on the bounty hunter. In response, Fett revealed the truth to Eclipse. The real Starkiller was indeed dead. The one who was searching for Eclipse was a clone created by Darth Vader, which Fett described as a \"half-mad copy who only thinks he's in love with Juno Eclipse.\" As Eclipse gave in to despair, she begged the bounty hunter to not let her be used by Vader as a means of hurting the clone. Although he was somewhat affected by her pleading, Fett continued the journey to Kamino to deliver her to Vader."}, {"tag": "p", "text": "When Slave I landed on Timira City, Boba Fett exited the starship with Eclipse to meet Darth Vader and his escort of stormtroopers. Although he wanted his payment for capturing and delivering the woman alive, Vader refused and stated that their arrangement would not conclude until Starkiller was captured. After seeing what the clone was capable of, Fett insisted on leaving before Starkiller arrived. Vader flatly refused and commanded Fett to remain. The Sith Lord promised that after Starkiller's defeat, Boba Fett would be granted an exclusive contract with the Galactic Empire. Fett complied, but not before listing all of his terms, such as being allowed to negotiate his rates on every job, as well as the Empire covering all of his expenses. Shortly after the stormtroopers escorted Eclipse in to the cloning facility, the Rebel fleet arrived and thus began the Assault on Kamino."}, {"tag": "p", "text": "After Starkiller used the remains of the Salvation to break through Kamino's planetary shield, the Rebel forces began their assault on the planet. General Rahm Kota and a squadron of Rebel troopers landed on Timira City and attempted to engage Boba Fett. Caught off guard by the attack, Fett narrowly escaped in to the cloning facility with his life. There, he encountered an highly deformed clone of the original Starkiller. The clone was also psychologically unstable and immediately attacked Fett with a lightsaber. Fett's initial attempts to kill the clone proved to be futile. After the mad clone sliced apart the bounty hunter's rifle, Fett tried to kill him by using his flamethrower, but to no avail. Overcome by his blind rage, the aberrant clone Force-pushed Fett and prepared to strike him down. Fett just barely survived by launching his jetpack's missile directly at the clone, killing him."}, {"tag": "p", "text": "Shortly afterward, Boba Fett encountered the technician he met earlier, who was preparing to leave Kamino in order to save his research on cloning by bringing it to Coruscant. When Fett inquired about the status of the clones that still resided within their tanks, the technician stated that the accelerated cloning process failed once more. He promised to return to Kamino after the Rebels were defeated to see what went wrong with the clones. The bounty hunter was utterly displeased and demanded at gunpoint that the technician not desert the clones in their unstable conditions, especially since they were the legacy of his \"father.\" The technician revealed that the clones were not created from the template of Jango Fett; they were made from Boba Fett's genes. Thus, they were essentially \"clones of a clone.\" Fett demanded to know how this was accomplished, to which the technician confirmed that Darth Vader hired Xasha to collect samples of Fett's DNA, as well as an imprint of his brain patterns for the memory flashes required to train the clones. Boba Fett was enraged and killed the technician before moving on to destroy all of his clones."}, {"tag": "p", "text": "When the last of his clones were destroyed, Boba Fett saw Darth Vader from a distance as the Sith Lord used Eclipse to force Starkiller into submission. The bounty hunter watched through his helmet's visor as Vader reestablished his control over the clone. Without warning, Eclipse tried to assassinate Vader by using one of Starkiller's own lightsabers. Vader narrowly avoided being struck down by the blade, though Eclipse did succeed in slicing across Vader's chest panel. In retaliation, Vader Force-pushed Eclipse out of the tower, causing her to fall to her apparent death on a platform below. Starkiller tried to save Eclipse, only for Vader to do everything he could to prevent the clone from reaching the woman. Blinded by uncontrollable rage, the clone attacked his former Master with all of his power and determination."}, {"tag": "p", "text": "Just as Boba Fett picked up his sniper rifle to assist Vader, he was approached by General Kota, PROXY and a squad of Rebel troopers. Falling back on his considerable skills as an expert combatant, the bounty hunter easily dispatched the troopers and even managed to defend himself against the aging Jedi Master. Before engaging the bounty hunter, PROXY used his holographic technology to take on the form of the long dead bounty hunter, Jango Fett who wore a suit of armor that was nearly identical to Fett's Mandalorian armor. To his shock, Boba Fett found himself being attacked by the Holodroid disguised as \"his father\". The droid's tactic worked and Fett was distracted enough for PROXY to shoot him in the arm, causing Boba to fall on his knees in apparent defeat. Before Kota and PROXY could arrest him however, Boba Fett detonated a sonic grenade to temporarily disable the Jedi and the droid."}, {"tag": "p", "text": "Fett managed to escape from them in time to watch as Starkiller defeated Darth Vader by cutting the Sith Lord's right hand off before blasting him with Force lightning. As Starkiller prepared to take Vader's life, Fett took aim at the clone's head with his sniper rifle. But before either of them could make a move, Kota and his troopers arrived, urging Starkiller to spare the defeated Sith Lord so that the Alliance could turn him into a valuable prisoner. At the last moment, Starkiller relented and made his way to Eclipse's body. Just as Fett prepared to put the clone out of his misery, Juno Eclipse miraculously awakened and kissed Starkiller. Fett removed his helmet in complete shock at seeing that the woman survived certain death. Although he tried to take aim at Starkiller again, he decided that the fight was already over and it would be wrong to attack the clone in his moment of vulnerability. As the Rebels defeated the remaining Imperial forces, Boba Fett slipped away from the battle."}, {"tag": "p", "text": "After the Rebels secured Darth Vader aboard the Rogue Shadow, Boba Fett sliced into the Alliance transmission and listened as the Rebels plotted their next move while sitting inside the cockpit of Slave I. He watched a holographic projection of Juno Eclipse reporting to Senator Leia Organa. Just before Eclipse concluded her report, Boba cupped the holographic image of Juno's face with his hand as the transmission ended. When Juno and Starkiller departed from Kamino with Vader secured in their starship's meditation chamber, Boba Fett secretly pursued them in his own starship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "External links"}]}