{"url": "Star_Wars:_The_Force_Unleashed:_Ultimate_Sith_Edition", "categories": ["Category:Real-world articles", "Category:Cleanup", "Category:Non-canon Legends articles", "Category:2009 computer and video games", "Category:Infinities", "Category:Legends computer games", "Category:Legends console video games", "Category:LucasArts games", "Category:The Force Unleashed"], "nodes": [{"tag": "h1", "text": "Star Wars: The Force Unleashed: Ultimate Sith Edition"}, {"tag": "p", "text": "Star Wars The Force Unleashed: Ultimate Sith Edition is a complete edition of the videogame The Force Unleashed, which includes the main campaign and three levels: a campaign in the Jedi Temple and two additional campaigns depicting the events of Starkiller after becoming the Emperor's apprentice, Lord Starkiller. The Ultimate Sith Edition also includes all of the original downloadable content, including character skins, costumes, databank entries, and more."}, {"tag": "h2", "text": "Content"}, {"tag": "p", "text": "The \"Ultimate Sith Edition\" has all the original costumes, as well as the downloadable costumes and character skins. There is also new content, such as the Desert Survival Gear and Starkiller's new Dark Lord's Armor, although the latter two costumes are inaccessible on the main campaign disc for the Xbox 360 version. There are also two Luke Skywalker and two Obi-wan Kenobi costumes available to play as, as well as many others."}, {"tag": "h2", "text": "Packaging"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The Ultimate Sith Edition comes in a metallic case with two discs for the 360 and PC version and one Blu-ray disc for the PS3 version. In addition to the game itself, each version comes with a book of character cards with a foreword by Haden Blackman and a collectible lithograph of one of the character cards. In the UK The Ultimate Sith Edition comes in a normal Xbox 360 case with two discs inside."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bonus levels"}, {"tag": "h3", "text": "Jedi Temple"}, {"tag": "p", "text": "The first of the new missions was set before the end of the original game. It was the Jedi Temple level originally available as downloadable content. Galen Marek entered the Jedi Temple on Coruscant and fought through squads of Stormtroopers, Jedi training droids, and other challenges, to find the Great Holocron. When he did, an image of his father, Kento Marek, sent Galen into the Holocron, where he needed to pass the Jedi Trials."}, {"tag": "p", "text": "After completing the challenges, Galen was confronted by a vision of a masked Sith Warrior. The two engaged in combat, and Galen knocked the assailant's mask off with a fierce blow of his lightsaber. The warrior's removed mask revealed him to actually be Galen Marek's dark alter-ego, Lord Starkiller. They continued their duel, Starkiller attacking while briefly morphed in the form of a noble Jedi in posthumous robes, before reverting back to his true dark form. Throwing Galen off the platform they were on, he used the Force to hurl broken pillars at Galen, who ran up them to impale Starkiller, and then kicked him down to the dark abyss below."}, {"tag": "p", "text": "Galen awoke, only to briefly see his hand in the clawed form of his Sith self, and to be sent a message from Starkiller, that he wouldn't escape his Sith fate. He then snapped out of it thanks to Rahm Kota, and left the temple."}, {"tag": "h3", "text": "Tatooine"}, {"tag": "p", "text": "The second mission was at the events of A New Hope, only it was renamed A Fragile Hope. Starkiller and his Imperials captured the Tantive IV and Princess Leia Organa. Leia was taken prisoner and the Tantive was destroyed. Starkiller then traveled to Tatooine disguised as a Tusken Raider to locate the stolen Death Star plans suspected to be with two droids. His master contacted him to ask Jabba the Hutt of any information on the droids."}, {"tag": "p", "text": "Killing Jawas, Tuskens, and throwing a Sandcrawler off a cliff along the way, Starkiller finally reached Jabba's Palace, and entered by overloading the Palace Security droid. After slaughtering many Gamorrean guards, Jabba was impressed and invited Starkiller to speak business. Starkiller asked Jabba of two droids, astromech and protocol, and that he would be well compensated for any information. Jabba said he knew nothing, but a blunder by his translator droid revealed the droids to be at Docking Bay 94, Mos Eisley. Furious, Jabba dropped Starkiller into the Rancor pit as the Sith Lord realized his treachery. Starkiller battled Jabba's rancor and eventually killed it. Jabba then enraged calls his guards to kill him and even puts a bounty on his head. He eventually made his way to the Palace Incinerator, where he encountered a run-down PROXY, who helped Starkiller bypass the Incinerator Security; before PROXY shut down for good, Starkiller gave him a genuine \"thank you.\" Before leaving the Palace however, Starkiller was confronted by Boba Fett, who was after the bounty on him, placed by Jabba. After a vicious duel, Fett launched a missile from his jetpack, which Starkiller grabbed and hurled back at him, apparently killing Fett as a result."}, {"tag": "p", "text": "Starkiller left on a desert skiff and made his way to Docking Bay 94, where he saw the droids with Luke Skywalker escaping aboard the Millennium Falcon. As he attempted to pursue them, Obi-Wan Kenobi remained to face Starkiller, who was thrilled at the prospect of being able to kill the legendary Jedi Master. Though Kenobi was more experienced, Starkiller was more powerful, and soon overpowered Kenobi, piercing his shoulder, then throwing him into the Falcon's engine. However, before he could retrieve the droids, Kenobi's Force ghost attacked him. Starkiller used his mastery of Force lightning to make Kenobi's spirit disappear. Before completely vanishing, Kenobi urged Luke to escape. As the Falcon lifted off, Starkiller leaped onto the hull and managed to place a tracking beacon before falling to the ground, watching as the ship fled, and clenching the other tracking beacon in his fist."}, {"tag": "h3", "text": "Hoth"}, {"tag": "p", "text": "Although Starkiller was successful in planting the homing device on the hull of the Millennium Falcon, the Death Star was still destroyed by the Rebels. After the battle, the ghost of Obi-Wan began tutoring Luke in the ways of the Force. Years later Starkiller tracked down Skywalker and the rest of the Rebels to Hoth. After dispatching a snowspeeder with his lightsaber and exiting his AT-AT, Starkiller began his attack on Echo Base. Captain Keenah - who was to act as Starkiller's attack group liaison - planned an infiltration route for the Sith Lord to enter Echo Base via ice caverns adjacent to the base. The caverns were infested with wampas, who he dispatched with ease. As ice columns the Sith had been jumping across started to collapse, Captain Keenah contacted Starkiller on his comlink to inform him of the cavern's instability and admitted that the most likely cause was the walker invasion force. Although the captain claimed the mistake to be unintentional and Starkiller was unharmed from the experience, the Sith Lord reached out with the Force to strangle the captain for his failure. Lieutenant Marsen was next in line as Starkiller's liaison and attempted to aid the Sith Lord throughout the rest of the invasion."}, {"tag": "p", "text": "In the ice caverns adjoined to the Rebel base, presumably to prevent wampa and other attacks from the cave, the Rebels had set up a sentry auto turret defense. Easily dispatching the turret, the Sith Lord encountered Rebel troops who had came to investigate the disturbance. They stood no chance at defeating Starkiller, who continued to push his way into the base, violently slaughtering all Rebels as well as many wampas which entered the base during the battle. Lieutenant Marsen contacted Starkiller about the presence of a group of Rebels ahead of his location that likely had an officer with them - he was not incorrect, and Lord Starkiller had finally found the young Force-user he was after. Upon confronting Luke Skywalker alone, Starkiller revealed the truth about Luke's father in an attempt to infuriate and confuse him, although he denied it. Despite the surrounding turmoil of the invasion, Luke kept his cool in the duel that followed. Luke even tried to turn Marek away from the dark side by telling him he could sense the good in him, but his attempts in all respects failed and Luke was forced to let three wampas out of containment to cover his escape. This did not distract Starkiller for long, and he continued to make his way through the base to trap Skywalker."}, {"tag": "p", "text": "When Starkiller disabled the force field generator protecting the Millennium Falcon in the Echo Base hangar, the blast doors were closed to protect the ship as well as Princess Leia. Starkiller attempted to force open the doors with the Force, but Skywalker was waiting for him and Force-pushed him away, stepped through, and resealed the doors behind him. Luke claimed he would not run away from Starkiller or his own destiny. Another duel ensued, this time as the hangar was engulfed in fighting between Rebel and Imperial soldiers. Starkiller overpowered and continued to humiliate Luke, drawing Luke toward the dark side. As snowtroopers ran up to capture Skywalker, he tapped into the passionate forces of the dark side to defeat them and was reinvigorated for battle against Starkiller. Skywalker began using red Force lightning, wild lightsaber attacks, and boasting that even though Obi-Wan could not defeat Starkiller, he could."}, {"tag": "p", "text": "Although Luke's powers were very aggressive and damaging, Starkiller absorbed his opponent's powerful lightning into his lightsaber and launched it back at him throughout the battle and beat him in lightsaber combat. Starkiller threw Luke into the path of an outbound T-47 Snowspeeder. Recovering, Luke wildly attacked Starkiller. After blocking an attack with his lightsaber, Starkiller cut Luke's right hand. As the Sith Lord readied for a final stab, the blast doors protecting the Millennium Falcon opened behind him and the ship shot off through the hangar, ready to escape the planet. Starkiller reacted quickly and withdrew from his attack to catch the ship with the Force. Starkiller told Luke that he could only save his friends with the power of the dark side of the Force and the now-fallen Jedi quickly obliged by shooting Force lightning out again which Starkiller blocked with his lightsaber and sent it back to Luke pushing him across the hangar floor. Although Luke had succeeded in distracting Starkiller with the attack, allowing the Millennium Falcon to escape, he was beaten and had embraced the power of the dark side. Lord Starkiller congratulated his new apprentice."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "There are some discrepancies between the dark side ending of the game and the Hoth and Tatooine missions. For instance, Rebel pilots have the Alliance Starbird on their helmets, despite this symbol ostensibly being inspired by Starkiller's heroic sacrifice in the canonical Light Side ending. Also the Tatooine mission suggests that Jabba the Hutt already possessed a rancor in 0 ABY, which is contradictory with the 2002 comic Star Wars Infinities: The Empire Strikes Back, in which it can be seen that Jabba only possessed a pair of Nexus until at least 3 ABY. However, both of these stories are \"what if\" tales and so are not considered canon."}, {"tag": "p", "text": "In the Hoth mission, Starkiller says, \"You have failed me for the last time, Captain Keenah.\", and strangles Keenah with the Force. This a reference to Vader saying the similar line to Admiral Ozzel and strangling him with the Force in Star Wars: Episode V The Empire Strikes Back."}, {"tag": "p", "text": "The achievement/trophy used for defeating Boba Fett is called \"And the Quarterback is Toast!\", a reference to what Fett said after using a heat-seeking missile to blow up the remaining Ewok in Robot Chicken: Star Wars Episode II, which was itself a reference to the movie Die Hard."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Bibliography"}]}