{"url": "Star_Wars:_The_Force_Unleashed", "categories": ["Category:Real-world articles", "Category:We're Doomed!", "Category:Cleanup", "Category:The Force Unleashed"], "nodes": [{"tag": "h1", "text": "Star Wars: The Force Unleashed"}, {"tag": "p", "text": "Star Wars: The Force Unleashed is a 2008 multimedia project created by LucasArts, in collaboration with Dark Horse Comics, Del Rey, LEGO, Hasbro Inc., and Palace Press. It was originally slated for release in 2007, and billed as \"the Expanded Universe multimedia event of 2007.\" However, problems in game development caused the project to be delayed until 2008. The project was created with the direct input and guidance of Star Wars creator George Lucas. Similar to Shadows of the Empire over a decade earlier and Clone Wars a few years earlier, it features products across different lines, all covering the same story. This includes two games, a game guide, a novel, a graphic novel, a toy line, a reference book, a Miniatures set, and a roleplaying-game supplement."}, {"tag": "p", "text": "A sequel to the video game, Star Wars: The Force Unleashed II, was announced during Spike's 2009 Video Game Awards. The video game, as well as an accompanying novel and graphic novel, were all released in October 2010."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Force Unleashed features a young man by the name of Galen Marek (codenamed \"Starkiller\"), the secret Sith apprentice of Darth Vader, and his missions as such in the year 2 BBY. At the beginning of the game, Darth Vader led the forces of the Galactic Empire against the revolting Wookiees on Kashyyyk, searching for a Jedi Knight that Vader had sensed. After finding and murdering the Jedi, Vader discovers his Force-sensitive son (young Starkiller), choosing him as his apprentice."}, {"tag": "p", "text": "Vader dispatches Starkiller to eliminate several Jedi who survived Order 66. His first target is General Rahm Kota, who used a private militia instead of clones and thus survived Order 66. Starkiller sets out with his pilot, Juno Eclipse, and droid PROXY in order to track Kota down. This first level takes place on board a TIE-Fighter construction station in orbit around Nar Shaddaa. After defeating a large number of both militia and stormtroopers alike, Starkiller finds the general, and defeats him in a fierce saber duel. However, as he is about to be executed, Kota predicts that Vader won't always be Starkiller's master, and that someday Kota will be instead. Starkiller casts Kota out of the burning space station and leaves, taking Kota's lightsaber as proof of his defeat and apparent death."}, {"tag": "p", "text": "Vader, still not convinced of Starkiller's ability, turns him loose on the junk world Raxus Prime, where he hunts down an insane Jedi Master who has constructed an army of junk monsters and titans. Destroying these with his new-found Force lightning abilities and killing a large number of scavengers in the process, Starkiller ascends an enormous junk tower to find the Jedi Master Kazdan Paratus talking to junk statues of the Jedi Council, saying he will defend them against this \"Sith trash.\" After defeating Kazdan Paratus, Starkiller insists that he is ready to confront Emperor Palpatine, but Vader rejects this idea. Instead the Dark Lord orders his apprentice to undertake one final test before he can fulfill his destiny, sending Starkiller to hunt and kill former Jedi Council Member Shaak Ti."}, {"tag": "p", "text": "This third test takes place on the world of Felucia, a gargantuan landscape dominated by enormous mushrooms, plants and the mouth of the oldest living Sarlacc. After fighting his way past Felucian natives trained by Master Shaak Ti, Starkiller makes his way past rancors and the occasional shaman to the mouth of the Sarlacc, making use of his newly discovered repulse abilities. There he encounters the Jedi in question and defeats both her, her Felucian allies, and the Sarlacc itself."}, {"tag": "p", "text": "Returning with another lightsaber to add to his collection and Shaak Ti's ominous final words \"The Sith always betray one another, given time.\" ringing in his ears, Starkiller returns to Vader's ship. Vader tells him they will now face Emperor Palpatine, who has just arrived. This turns out to be a trap, as it is quickly revealed that Palpatine knows all about Vader's \"secret\" apprentice. The Emperor orders Vader to kill the young Sith to prove his loyalty, and Vader apparently does so; after impaling Starkiller on his lightsaber, Vader throws him around the room and then blasts him through a window into space. Apparently dead, Starkiller's body is recovered by a medical droid shortly after the incident."}, {"tag": "p", "text": "Starkiller awakens on board an enormous medical station which PROXY has set on a collision course for a nearby sun. Vader instructs him to escape the facility and to begin building an army of dissidents and rebels to distract the Emperor's attention, and allow the two of them another opportunity to attack him by surprise. Vader claims that this was his original plan all along, and that it was necessary so that he could avoid arousing suspicion from Palpatine's spies."}, {"tag": "p", "text": "Grudgingly accepting this, Starkiller fights with EVO troopers who can resist his lightning based abilities and large heavy troopers resembling large robots, then escapes with his pilot Juno for whom he is developing feelings against the advice of PROXY."}, {"tag": "p", "text": "Starkiller heads to Cloud City where he encounters Master Rahm Kota, now blind after his near fatal battle. Together they escape, following an encounter with new, force-sensitive, armored opponents. They resemble Imperial guards but with less cloak, more armor, and single lightsaber blades mounted on Imperial guard-style staffs."}, {"tag": "p", "text": "After rescuing Master Kota, Starkiller travels to Kashyyyk based on his information about an important contact in the Senate. Kota tells him that \"something very valuable\" to his contact is being kept on the Wookiee homeworld, but does not say what it is. After battling troopers through a large, well-defended building, Starkiller is surprised to discover that the \"something\" is none other than Princess Leia, the daughter of Kota's contact Bail Organa. Leia insists that she will only leave if he destroys the Sky Hook transportation project being constructed under slave labor first. Starkiller murders the Imperial military leader of the encampment, a hunter of Wookiees, destroys the Sky Hook facility and wins the freedom of the Wookiee nations."}, {"tag": "p", "text": "Back on the Rogue Shadow, Kota explains that Senator Organa, his contact, has vanished, having traveled alone to Felucia to look for Master Shaak Ti. Starkiller, knowing Shaak Ti is already dead and that Organa is walking to his death, returns there to find the planet has become corrupted by the dark side. He battles his way past dark Felucians and a large garrison of Stormtroopers. He heads inside the Sarlacc from earlier in the game and after passing through its digestive system, emerges to find Organa being held captive by Shaak Ti's now dark-side-corrupted former apprentice, Maris Brood. After defeating both her and her \"pet\" (an enormous bull rancor), Starkiller spares Maris' life, and she flees to places unknown, vowing to renounce the dark side forever."}, {"tag": "p", "text": "However, Organa insists that 'open' rebellion is too risky as the Empire is too strong. Starkiller, on Vader's instruction, heads back to Raxus Prime to destroy an Imperial Base now orbiting the planet as an attempt to destroy a symbol of their power. During the mission, PROXY, who was programmed by Vader to regularly try to kill him as part of his training, ambushes him with a hologram of Darth Maul, but Starkiller overwhelms him and destroys the base, bringing down a Star Destroyer in order to cover his escape."}, {"tag": "p", "text": "Finally, after a meeting of rebel leaders is arranged by the now-freed Bail Organa, he attempts to exclaim the beginning of a Rebellion against the Empire. However, Organa's speech is cut short by the sudden arrival of Lord Vader and several stormtroopers, who detain the rebels. Vader expresses his satisfaction at his apprentice's efforts to bring all of \"the Emperor's enemies\" together where they could be all arrested at once, then attempts to kill Starkiller once more, this time at the edge of a mountain cliff. However, before Vader delivers the fatal blow he is briefly distracted by PROXY, allowing Starkiller time to drop off of the ledge and escape. After being brought back aboard the Rogue Shadow, he and Juno discover the Rebels are being taken to a giant space station where they will be presented to the Emperor."}, {"tag": "p", "text": "After a level on the Death Star which is nearing completion, Starkiller confronts Vader, as the captive Rebels and Emperor Palpatine look on. Vader is defeated, but not yet dead, when Palpatine attacks General Kota; Starkiller must then choose whether to kill his master Lord Vader or try to prevent the Emperor from killing the Rebel leaders."}, {"tag": "p", "text": "If Vader is attacked, Starkiller kills Vader, the rebels die, and he becomes an assassin for the Emperor."}, {"tag": "p", "text": "If the Emperor's attack is interrupted, Palpatine is defeated but not killed by Starkiller. Instead, as the rebels escape, Starkiller dies from an explosion of Palpatine's intense Force Lightning and becomes a martyr for the Rebellion."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Promotional material"}, {"tag": "h3", "text": "Novel"}, {"tag": "h3", "text": "Video games"}, {"tag": "h3", "text": "Comics"}, {"tag": "h3", "text": "Toys"}, {"tag": "h3", "text": "Roleplaying game"}, {"tag": "h3", "text": "Miniatures game"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}