{"url": "Star_Wars:_The_High_Republic", "categories": ["Category:Real-world articles", "Category:Star Wars: The High Republic"], "nodes": [{"tag": "h1", "text": "Star Wars: The High Republic"}, {"tag": "p", "text": "Star Wars: The High Republic, first announced as Project Luminous, is an ongoing multimedia project being worked on by Cavan Scott, Claudia Gray, Charles Soule, Daniel José Older, and Justina Ireland, which spans both comics and books to tell one cohesive story set in the High Republic Era, two centuries prior to the events of Star Wars: Episode I The Phantom Menace. The project's official release was in 2021 although the first official branded material for the project was already released prior in December of 2020, in the form of a short story. Details about the project were first revealed at a press event on February 24, 2020, prior to the COVID-19 pandemic that delayed its release."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The idea of Project Luminous came from Lucasfilm Publishing's creative director, Michael Siglain, who individually approached each author in the summer of 2018 about getting to work on what he then called the All-Star Initiative. To Cavan Scott, Siglain revealed the project over breakfast, while both were at San Diego Comic-Con 2018, but he didn't say who else would be working on Luminous yet."}, {"tag": "p", "text": "A few months later, in September of 2018, all five of the authors who had signed on for Luminous were taken to Skywalker Ranch in California, where they began to flesh out the story beyond the project parameters. They were also joined by the Lucasfilm Publishing editorial team and Lucasfilm Story Group. They stayed for a few days, spending most of their time discussing the project, but they also got to see a 4K screening of Star Wars: Episode IV A New Hope. They then went to Skywalker Ranch one more time in March of 2019 and saw a 4K cut of Star Wars: Episode V The Empire Strikes Back."}, {"tag": "p", "text": "Project Luminous was announced one month later, at the Star Wars Celebration Chicago Lucasfilm Publishing: Writers Roundtable, Monday April 15, 2019."}, {"tag": "p", "text": "Project Luminous was revealed on February 24, 2020. In an announcement trailer, Project Luminous's name was revealed as being Star Wars: The High Republic. James Waugh, Lucasfilm's VP for Franchise Content and Strategy, explained that, with the end of the Skywalker saga looming with the release of Star Wars: Episode IX The Rise of Skywalker, the publishing branch of the company brought in some of the authors who had worked on previous tie-in materials and allowed them the creative freedom to fill-in the gaps with Star Wars stories beyond the reach of the films and the Skywalkers. Pablo Hidalgo, of the Lucasfilm Story Group who was involved in the Project Luminous writers' room, described the early process as giving the writers a blank slate and allowing them to choose what they wanted to write about and when. Eventually, the idea came from one of Obi-Wan Kenobi's earliest lines about the Jedi in A New Hope, about the Jedi being \"the guardians of peace and justice in the Old Republic.\" Michael Siglain also explained that the story truly began to come together with the question \"What scares the Jedi?\""}, {"tag": "p", "text": "The project involved a variety of Lucasfilm members including Jason D. Stein, a creative executive and Jeffrey Thomas, a senior illustration manager."}, {"tag": "p", "text": "Star Wars Insider announced that it would be releasing a line of High Republic short stories exclusive to the magazine, beginning with the short story \"Starlight: Part One - Go Together\" in Star Wars Insider 199."}, {"tag": "h2", "text": "Foreshadowing"}, {"tag": "p", "text": "The High Republic was first mentioned in the April 30, 2019 audio drama Dooku: Jedi Lost by Cavan Scott. It was first identified as the High Republic Era in the January 8, 2020 comic issue The Rise of Kylo Ren 2 by Charles Soule."}, {"tag": "p", "text": "Also mentioned in Dooku: Jedi Lost are Padawan Klias Teradine and Jedi Master Trennis. Teradine discovered the Bogan Collection and was expelled from the Jedi Order. Trennis became one of the Lost Twenty who left the Jedi Order. Keeve Trennis is a Jedi character in The High Republic comic series, although she has not been explicitly confirmed as the same person."}, {"tag": "p", "text": "Nihil raiders first received a mention in the comic story \"The Lost Stories, Part 1,\" written by Scott and published in Star Wars Adventures 30 by IDW Publishing on January 29, 2020."}, {"tag": "p", "text": "Starlight Beacon was indirectly mentioned in the comic Star Wars 2, written by Charles Soule and was also published by Marvel Comics on January 29, 2020, and its name was given in the project's official reveal on February 24, 2020."}, {"tag": "p", "text": "A female Jedi seen in a holocron in The Rise of Kylo Ren 3, a comic written by Soule and illustrated by Will Sliney and released on February 12, 2020, was confirmed by Soule to be Avar Kriss, a character in The High Republic: Light of the Jedi."}, {"tag": "p", "text": "In the announcement trailer for the High Republic project, concept art of entities labeled \"Nameless\" can be seen. These beings were mentioned in two of Cavan Scott's works, the aforementioned Dooku: Jedi Lost and the fourth issue of the comic series Star Wars Adventures: Return to Vader's Castle."}, {"tag": "p", "text": "Chelli Aphra noted that murals of the Rings of Vaale contained High Republic iconography."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Phase I: Light of the Jedi"}, {"tag": "h4", "text": "Novels"}, {"tag": "h5", "text": "Young adult"}, {"tag": "h5", "text": "Junior"}, {"tag": "h4", "text": "Audio dramas"}, {"tag": "h4", "text": "Short stories"}, {"tag": "h4", "text": "Comic books"}, {"tag": "h5", "text": "Comic miniseries"}, {"tag": "h5", "text": "Manga"}, {"tag": "h4", "text": "Young readers"}, {"tag": "h3", "text": "Promotional"}, {"tag": "h2", "text": "Related media"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}