{"url": "Star_Wars:_The_Essential_Atlas_Online_Companion", "categories": ["Category:Real-world articles", "Category:Star Wars Blog", "Category:StarWars.com articles"], "nodes": [{"tag": "h1", "text": "Star Wars: The Essential Atlas Online Companion"}, {"tag": "p", "text": "The Star Wars: The Essential Atlas Online Companion is a series of articles on the official Star Wars website published in the wake of the release of The Essential Atlas by its authors Jason Fry and Daniel Wallace. The articles are the lists of systems that appear in the appendix of The Essential Atlas, but many systems now have an entry for which sector they are located in, a feature that the published work does not. The lists are intended to be used as a dynamic document, with updates and revisions planned to either correct erroneous information, add detail to existing placements, and add locations as new works are released. The Online Companion also included galaxy maps with the localization of the sectors by Modi."}, {"tag": "p", "text": "According to comments made by Atlas co-author Jason Fry, as revealed on TheForce.net's Jedi Council Forums, the Online Companion's database listed star systems according to names of well-known celestial objects, rather than proper system names, and that the database's listing was not intended to create new system names or override previously established continuity. He also stated his intention to create homeworlds for numerous species based on context implied from their names."}, {"tag": "p", "text": "On March 15, 2011, a map of the Mid Rim sectors and a new appendix were released. The appendix contained the sectors information for Mid Rim systems, the forgotten systems from previous versions, and the newly created systems (including those from The Clone Wars)."}, {"tag": "p", "text": "An email from Jason Fry revealed that an appendix update and an Expansion Region sector map was to be released, and that the Atlas material is available on starwars.com/atlas. On October 25, 2012 these updates were posted."}, {"tag": "p", "text": "On June 11, 2014, Jason Fry exclusively provided a HD version of the previously released Expansion Region sectors map to Wookieepedia. He also revealed that Lucasfilm Ltd. accepted publication of more appendix updates and sector maps."}, {"tag": "h2", "text": "Sectors"}, {"tag": "h2", "text": "Systems (by Region)"}, {"tag": "p", "text": "The systems below are listed alphabetically by region and are as named by The Essential Atlas Online Companion; not necessarily by their canon names."}, {"tag": "h3", "text": "Colonies"}, {"tag": "h3", "text": "Core Worlds"}, {"tag": "h3", "text": "Deep Core"}, {"tag": "h3", "text": "Expansion Region"}, {"tag": "h3", "text": "Extragalactic systems"}, {"tag": "h3", "text": "Hutt Space"}, {"tag": "h3", "text": "Inner Rim"}, {"tag": "h3", "text": "Mid Rim"}, {"tag": "h3", "text": "Outer Rim Territories"}, {"tag": "h3", "text": "Sith Worlds"}, {"tag": "h3", "text": "Unknown Regions"}, {"tag": "h3", "text": "Wild Space"}, {"tag": "h3", "text": "Unplaced systems"}, {"tag": "h3", "text": "Systems unmentioned by The Essential Atlas Online Companion"}, {"tag": "h2", "text": "Systems (complete list)"}, {"tag": "h2", "text": "Online updates"}, {"tag": "h2", "text": "Map gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ", with Jason Fry and Daniel Wallace"}]}