{"url": "Star_Wars:_The_Mandalorian:_The_Ultimate_Visual_Guide", "categories": ["Category:Real-world articles", "Category:Canceled reference books", "Category:Star Wars Visual Dictionaries"], "nodes": [{"tag": "h1", "text": "Star Wars: The Mandalorian: The Ultimate Visual Guide"}, {"tag": "p", "text": "Star Wars: The Mandalorian: The Ultimate Visual Guide was a planned reference book for the television series The Mandalorian. It was to be written by Pablo Hidalgo and was set to be published by DK Publishing on July 1, 2021 in the United Kingdom and on July 6, 2021 in the United States. The reference book was cancelled by DK Publishing on March 9, 2021."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The essential companion to the first two seasons of The Mandalorian."}, {"tag": "p", "text": "Produced in close collaboration with Lucasfilm and written by Star Wars insider Pablo Hidalgo (TBC), this 200-page book is full of fascinating details. Study more than 600 images, incredible concept art, and behind-the-scenes photography in this must-have guide to the Disney+ phenomenon."}, {"tag": "p", "text": "Discover the hidden gadgets of the Mandalorian's beskar suit of armor. Learn more about the cutest 50-year-old alien in the galaxy–The Child. Discover the secrets of the Way. Examine the functional workings of the Razor Crest. Uncover the codes of the Bounty Hunter Guild. Meet the deadly Cara Dune and the ruthless Moff Gideon. Find out how the Mandalorian became the best in the parsec."}, {"tag": "p", "text": "With a foreword by Executive Producer Dave Filoni (TBC), Star Wars: The Mandalorian: The Ultimate Visual Guide is the perfect gift for Star Wars fans of all ages."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}