{"url": "Star_Wars:_The_Legacy_Collection", "categories": ["Category:Real-world articles", "Category:Hasbro toy lines"], "nodes": [{"tag": "h1", "text": "Star Wars: The Legacy Collection"}, {"tag": "p", "text": "Star Wars: The Legacy Collection, later marketed as simply Star Wars: Legacy Collection, was a Hasbro toy line that ran from 2008 to 2010. It featured a variety of characters and vehicles from the six Star Wars films."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The collection was released in July of 2008 along with the Star Wars: The Clone Wars line in the fourth \"midnight madness\" event."}, {"tag": "p", "text": "The figures included a \"Build-A-Droid\" system, in which each figure features a piece to collect and create a unique astromech droid or protocol droid. The concept was launched at the end of the 30th Anniversary Collection with a series of Wal-Mart exclusive two packs called \"Droid Factory\" where pieces from all six packs combined to build C-3PX. One of those packs included the first original Marvel Comics Star Wars series character released as a toy, K-3PX. (Droid Factory was later revived as a separate toy line by Disney Parks.) Comic Packs featuring Marvel series characters Fenn Shysa and Tobbi Dala soon followed. This trend continued in 2009 with the release of Lumiya in a comic pack and her alter ego Shira Brie in an Evolutions set. 2009 also saw the release of the first action figures representing Jacen and Jaina Solo, the children of Han Solo and Princess Leia as seen in various Star Wars novels. They have even released an action figure depicting Plo Koon, with a removable Antiox breath mask and lightsaber gauntlet."}, {"tag": "p", "text": "The packaging for the basic figures featured a stormtrooper helmet, contrasting with the clone trooper helmet of the The Clone Wars line. The series included special \"First Day of Issue\" packaging for figures manufactured on the first day of production. \"The Saga Legends\" line continued as well, now focusing on kid friendly primary characters and so called \"troop builder\" characters such as clone troopers or battle droids. In 2009, the packaging for the basic figures of the collection shifted away from blue and white stormtrooper helmet theme to a red and white packaging with a simple Star Wars logo and a large character portrait."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The Legacy Collection introduced some new elements to the Star Wars canon. Its \"Evolutions\" sets revealed Keyan Farlander flew a B-wing during the Battle of Endor, and finally confirmed that the A-wing pilot from Star Wars: Episode VI Return of the Jedi whose image was borrowed by the Rebel Assault video game to depict Jake Farrell was, in fact, Farrell. The toy line was the first source to show full-body representations of several characters, including Trinto Duaba, Dice Ibegon, Pons Limbic, and Leesub Sirln. The Hrchek Kal Fas and Wioslea action figures also reveal new features of those characters' anatomy by showing Kal Fas without gloves and boots, and by showing Wioslea's body under her cloak."}, {"tag": "p", "text": "The unnamed astromech droid used by Red Leader Garven Dreis in Star Wars: Episode IV A New Hope was made into an action figure included in a Battle Pack set, and named \"R5-K6\". The line also named R5-C7, a droid first seen in Star Wars: Episode II Attack of the Clones."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Checklist"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}