{"url": "Star_Wars:_The_Old_Republic,_Threat_of_Peace", "categories": ["Category:Real-world articles", "Category:Star Wars: The Old Republic story arcs", "Category:The Old Republic: Threat of Peace"], "nodes": [{"tag": "h1", "text": "Star Wars: The Old Republic, Threat of Peace"}, {"tag": "p", "text": "Star Wars: The Old Republic, Threat of Peace is a series of webcomics that ties in to the Star Wars: The Old Republic massively multiplayer online role-playing game (MMORPG) by LucasArts and BioWare. Written by Robert Chestney and illustrated by Alex Sanchez, the series was published in installments of three pages every other Friday through 2009 and early 2010 by Dark Horse Comics on StarWarsTheOldRepublic.com. The series was later reprinted in comic book form, and then collected in a trade paperback. Threat of Peace focuses on the Treaty of Coruscant and its aftermath, but as the series was released particularly early during the development of The Old Republic, the appearance of many elements and characters in the comics is radically different from the finalized versions that appear in The Old Republic."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "War between the Galactic Republic and the Sith Empire has gripped the galaxy for generations, but the sacking of Coruscant and a subsequent peace treaty are changing everything. As the Republic scrambles to re-establish order, the Sith Empire moves quickly to consolidate power within its new dominion. Behind closed doors, however, individual Sith Lords engage in a quiet but deadly power struggle, and discord breaks out among the Jedi as they wrestle with the moral implications of the new galactic balance. During these chaotic days, the stories of several critical characters interweave as they pursue their passions, stand up for their convictions and ultimately lead the galaxy back to the brink of a catastrophic conflict."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Printed comics cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}