{"url": "Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:2015 computer and video games", "Category:Star Wars: The Old Republic Digital Expansions"], "nodes": [{"tag": "h1", "text": "Star Wars: The Old Republic: Knights of the Fallen Empire"}, {"tag": "p", "text": "Star Wars: The Old Republic: Knights of the Fallen Empire is the fifth Digital Expansion to the BioWare MMORPG Star Wars: The Old Republic. First announced on June 12, 2015 in advance of Electronic Arts's official presentations at the 2015 Electronic Entertainment Expo on June 15, Knights of the Fallen Empire features a renewed focus on cinematic storytelling, as well as new worlds, new companions, and a dynamic story that is affected by the choices players make. The expansion was first hinted at in the Community Cantina Tour held in Anaheim, California on April 18; wristbands were given out that featured the hashtag #FallenEmpire and the date \"06.15.15,\" and a secret image featuring a throne and the hashtag was hidden in the files given to attendees and later posted online. Knights of the Fallen Empire focuses on the new threat of the Eternal Empire and its leader, the Emperor of the Eternal Throne. At Level 60, the player's character is frozen in carbonite and awakens five years later to find that the Eternal Empire has become the dominant force in the galaxy. The player becomes the \"Outlander\" and builds an alliance to wage war against the Eternal Empire."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Sometime after the Invasion of Ziost, the Eternal Empire of Emperor Valkorion enters into the Galactic War between the Galactic Republic and the reconstituted Sith Empire, and led by its new emperor, Arcann, the Eternal Empire decimates both the Republic and the Sith. Players awake from carbonite five years after the galaxy has fallen to the Eternal Empire, with the Republic and the Sith Empire having all but collapsed, and must gather new and old companions and take the fight to the Eternal Empire as an \"Outlander.\""}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "Star Wars: The Old Republic: Knights of the Fallen Empire is a Digital Expansion for the video game Star Wars: The Old Republic, and raises the level cap of the game from 60 to 65. Knights of the Fallen Empire has been described as having \"a renewed focus on cinematic storytelling,\" and introduces \"new worlds to explore, new companions to recruit into your alliance, and a dynamic story that players will be able to shape based on the choices they make.\" The original eight class stories are also enhanced to make them more immersive and engaging. Single-player story arcs, the game's end-game Operations, and other content were also upgraded to levels 60 and above. Players are able to create one level 60 character in order to experience the Knights of the Fallen Empire storyline without having to play through the existing game."}, {"tag": "p", "text": "The story of Knights of the Fallen Empire will be told and released in smaller \"chapters,\" the first nine of which were released at launch. Sixteen chapters, the last five of which are unnamed at the moment, are listed on the game's website, and the chapters are said to be released monthly after launch. Any subscriber, regardless of when they subscribe, will have access to all of the Fallen Empire chapters that have been released up until that point. Knights of the Fallen Empire is set five years after the events of the existing game, and will introduce new companions, as well as reintroduce some of the existing companions in the new timeframe. A total of five new companions will be added, including Lana Beniko from the Forged Alliances storyline and the previous expansion, Shadow of Revan. The new level cap will allow for a focus on \"increased mobility and action-packed combat,\" and the expansion's focus on single-player story will result in restrictions on grouping during story missions and arcs."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Knights of the Fallen Empire was first hinted at in the Community Cantina Tour in Anaheim, California on April 18, 2015. Attendees received wristbands with the hashtag #FallenEmpire and the date \"06.15.15,\" and the flash drive of files given out to attendees also included a secret image, featuring the hashtag and the Eternal Throne, which was later posted online. The Digital Expansion was officially announced during Electronic Arts' presentation at the Electronic Entertainment Expo on June 15, 2015, though the name was released on June 12 in the schedule of Electronic Arts' presentation. The game's announcement took the form of Sacrifice, a cinematic trailer developed by Blur Studio like the game's previous trailers, and the full-length trailer was released afterwards online."}, {"tag": "p", "text": "As with other expansions, Knights of the Fallen Empire was preceded by a number of subscriber rewards. Players who subscribed by August 10 received Nico Okarr, the smuggler who appeared in the Return cinematic trailer, as a companion, and those subscribed by August 31 received an exclusive set of blasters for Okarr. September 30 saw subscribers receive Nico Okarr's duster coat, and subscribers by October 19 received a swoop bike inspired by the one seen in Star Wars: Knights of the Old Republic. The Epic Story Boost, which rewards subscribers with 12 times the standard experience for class missions, remained in effect until October 19."}, {"tag": "p", "text": "Alexander Freed wrote Chapter 10 of Knights of the Fallen Empire, entitled \"Anarchy in Paradise.\""}, {"tag": "h2", "text": "Release"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}