{"url": "Star_Wars:_The_Original_Marvel_Years_Omnibus_Vol._1", "categories": ["Category:Real-world articles", "Category:Star Wars: The Original Marvel Years Omnibus"], "nodes": [{"tag": "h1", "text": "Star Wars: The Original Marvel Years Omnibus Vol. 1"}, {"tag": "p", "text": "Star Wars: The Original Marvel Years Omnibus Vol. 1 is a Legends hardcover  Omnibus that collects the first forty-four issues of the Marvel comic-book series Star Wars, as well as Star Wars Annual 1. This omnibus collection was released with two covers, one by artist Howard Chaykin and a variant edition by Greg Hildebrandt. It was published by Marvel Comics on January 27, 2015 and was followed by two additional volumes collecting the entirety of the original 107-issue Marvel Star Wars series."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In 1977 a phenomenon dawned. Marvel Comics published the very first Star Wars comic-book series. Now, the House of Ideas is re-presenting those original adventures in its over-sized Omnibus format — Star Wars: The Original Marvel Years collecting Star Wars (1977) #1-44 and Annual #1."}, {"tag": "p", "text": "It's the return of the Jedi to Marvel in an opening volume that begins with Star Wars: Episode IV A New Hope and ends with Star Wars: Episode V The Empire Strikes Back. In between, the Rebels face a wealth of new perils — from space pirate Crimson Jack to the bounty hunter Beilert Valance, as well as a surprisingly svelte Jabba the Hut (one \"t\"). Luke goes back to Tatooine, Leia battles alone, Han and Chewie play the deadly Big Game, and Darth Vader hunts for answers! Revisit all your old favorites and discover some new ones!"}, {"tag": "p", "text": "There's no doubt, the Force is strong with this collection!"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Collected issues"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}