{"url": "Star_Wars:_Uprising", "categories": ["Category:Real-world articles", "Category:Semi-protected articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:2015 computer and video games", "Category:Canon mobile games"], "nodes": [{"tag": "h1", "text": "Star Wars: Uprising"}, {"tag": "p", "text": "Star Wars: Uprising was a mobile game by Kabam. The game had a beta rollout in the summer of 2015, with a full release on September 10, 2015 for iOS and Android."}, {"tag": "p", "text": "Uprising is set shortly after the events of Star Wars: Episode VI Return of the Jedi and deals with the aftermath of the Battle of Endor, which saw the deaths of Darth Sidious and Darth Vader. The Galactic Empire, reeling from its loss, locks down the Anoat sector. A rogue band of resistance fighters comes together to create an uprising against the Empire in the sector."}, {"tag": "p", "text": "On September 22, 2016, it was announced by Kabam that Star Wars: Uprising would be ceasing operations on November 17, 2016. The game's servers were taken offline at 9 AM PST on that day."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In the days following the Battle of Endor and the fall of the Emperor, The Anoat sector has been locked down by the Empire. With the Rebel Alliance on the other side of the Iron Blockade, it falls to the sector's smugglers, freedom fighters, bounty hunters and gangsters to join forces and form an uprising."}, {"tag": "p", "text": "The Galaxy needs a new hero. What kind will you be?\nDecide and become a part of Star Wars history."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Chapter I"}, {"tag": "h3", "text": "Chapter II"}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "Players will begin Star Wars: Uprising as a smuggler targeted by the Galactic Empire, which catches the smuggler transporting contraband in the Anoat sector. The smuggler is put on the run, and the player learns how to fight and flee from Imperial forces."}, {"tag": "p", "text": "The player begins missions that allow them to go on new smuggling and recovery operations, as well as to begin creating a crew of characters. According to Kabam executive Aaron Loeb, players are able to create the kind of Star Wars hero that they want to be. The game also includes large-scale, staged sector battles that players can take part in with other players."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Star Wars: Uprising was first announced on June 4, 2015. The game was developed by Kabam, guided by senior VP Aaron Loeb, in collaboration with Lucasfilm and The Walt Disney Company. Kabam designed the game to evolve throughout gameplay, with staged events that bring players into sector battles that allow players to engage in real-time battles with fellow players. The game's story is part of the canon storyline between Star Wars: Episode VI Return of the Jedi and Star Wars: Episode VII The Force Awakens."}, {"tag": "p", "text": "Artwork for Star Wars: Uprising was done by Brian Matyas, with Danny Keller serving as head of animation."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Star Wars: Uprising is a canonical game set between Return of the Jedi and The Force Awakens, and it is the first mobile game to be set in that era. The game, which deals with the aftermath of the events of Return of the Jedi, is set in the Anoat sector, which first appeared in Star Wars: Episode V The Empire Strikes Back. Two of the game's locations, Cloud City and Hoth, also first appeared in The Empire Strikes Back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}