{"url": "Star_Wars:_The_Power_of_the_Force_(comic)", "categories": ["Category:Real-world articles", "Category:Articles from unlicensed sources", "Category:Legends one-shot comics"], "nodes": [{"tag": "h1", "text": "Star Wars: The Power of the Force (comic)"}, {"tag": "p", "text": "Star Wars: The Power of the Force (Star Wars: Il Potere della Forza) was an eight-page Italian production scripted by Fiorenzo Delle Rupi and illustrated by Filippo Rossi. In 2013, it was translated in English by Abel G. Peña and made available for download."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In his inner sanctum, the Galactic Emperor Palpatine meditates on holographic effigies of Obi-Wan Kenobi, Anakin Skywalker, and Luke Skywalker, while reflecting on his past as a Galactic Republic senator, the long relationship of Obi-Wan Kenobi and Anakin Skywalker, and his plans to turn Luke to the dark side of the Force. Meanwhile, on Dagobah, the Jedi Master Yoda uses the Force to conjure an image of himself alongside his late colleague Mace Windu. He then lauds the bravery of R2-D2 and Chewbacca before contemplating the similarity between Princess Leia Organa and her mother, Padmé Amidala, and his concern that Luke Skywalker might also share such a similarity with his fallen father. Ultimately, Yoda puts his trust in the light side and its defenders."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "In the summer of 1998, with the upcoming release of Star Wars: Episode I The Phantom Menace, the Hasbro toy company launched a series of \"FlashBack\" action figures tied to the movie. Hasbro Italy requested that a promotional comic be made for the new line. They recruited Fiorenzo Delle Rupi, president of the Cloud City fan club, and Filippo Rossi, co-founder of L'Associazione culturale Yavin 4. The eight-page production, comprizing six pages of story and two pages of advertising, was penned by Delle Rupi, with illustrations provided by Rossi. Originally written in Italian, that story was made available in English for the first time on August 13, 2013. The translation was made by Star Wars author Abel G. Peña, with his colleague Rich Handley re-lettering the comic."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The frame story of Star Wars: Il potere della Forza is set between the events of Star Wars: Episode V The Empire Strikes Back and Star Wars: Episode VI Return of the Jedi, which occurred in 3 and 4 ABY respectively. The nested story is made of a series of flashbacks that go back to the Invasion of Naboo in 32 BBY. It also hinted at Yoda being familiar with Chewbacca, which was later confirmed with the events of Star Wars: Episode III Revenge of the Sith, which occurred in 19 BBY. Similarly, due to the requirements of shoehorning an image from the Flashback Photos series of Hasbro into the story, the comic was also the first to hint that, despite the Empire's speciesist policies, Palpatine had some acknowledgement of the Wookiee species, in particular Senator Yarua, back when he was a senator, something that was later confirmed in Jedi Council: Acts of War and further elaborated on in Cloak of Deception."}, {"tag": "p", "text": "It should be noted that, while the Italian title for this comic and the toy line it was produced for was reused for the Star Wars: The Force Unleashed multimedia project, there is no plot relation between the two."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}