{"url": "Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition", "categories": ["Category:Real-world articles", "Category:Star Wars Insider"], "nodes": [{"tag": "h1", "text": "Star Wars: The Skywalker Saga: The Official Collector's Edition"}, {"tag": "p", "text": "Star Wars: The Skywalker Saga: The Official Collector's Edition is a book collecting content from Star Wars Insider magazine that covers various interviews relating to the nine episodes of the Skywalker saga. It was published by Titan Comics on May 4, 2021."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"A long time ago in a galaxy far, far away...\" For more than five decades, the Skywalker saga has thrilled generations of fans who have grown up with one of the greatest stories in cinematic history. This sprawling epic of nine episodic films covers 67 years of unforgettable action, featuring thousands of iconic characters, from Star Wars: A New Hope to Star Wars: The Rise of Skywalker. And the Star Wars Insider magazine has been there every step of the way, gaining exclusive access to cast, crew, and creators."}, {"tag": "p", "text": "Now, collected together for the first time, this movie companion chronicles the story behind the making of the Skywalker saga, as told by the writers, directors, designers, and crafts people who built and shaped a legend."}, {"tag": "p", "text": "From George Lucas' thoughts on embarking on the making of A New Hope to Ewan McGregor on stepping into the shoes of the late Sir Alec Guinness to play Obi-Wan Kenobi to Daisy Ridley taking on the role of Rey in the final trilogy, this is a must-have for anyone touched by this incredible story."}, {"tag": "h3", "text": "Initial solicitation"}, {"tag": "p", "text": "A guide to the Star Wars Skywalker saga, featuring the best interviews and features from 200 issues of Star Wars Insider magazine!"}, {"tag": "p", "text": "A deluxe collector's book focusing on the films that form the Star Wars Skywalker saga, from The Phantom Menace to The Rise of Skywalker. Featuring a unique collection of interviews and features, this collection includes insight from the key players that brought the series to life."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The book was initially announced as Star Wars: Episode 1-9 Special Edition Book and was scheduled for release on October 13, 2020. The title was eventually then delayed to its current scheduled release date of May 4, 2021, with a new title, Star Wars: The Skywalker Saga: The Official Movie Companion. With the reveal of the book's final cover, a new subtitle was revealed, The Official Collector's Edition."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}