{"url": "Star_Wars:_The_Secrets_of_the_Sith", "categories": ["Category:Real-world articles", "Category:Future books", "Category:Incomplete lists", "Category:Canon reference books", "Category:Canon Young Readers"], "nodes": [{"tag": "h1", "text": "Star Wars: The Secrets of the Sith"}, {"tag": "p", "text": "Star Wars: The Secrets of the Sith is a forthcoming canon reference book written by Marc Sumerak with illustrations by Sergio Gómez Silván. The book is scheduled to be published by Insight Kids on October 5, 2021. It is the sequel to Star Wars: The Secrets of the Jedi."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Join Emperor Palpatine, otherwise known as Darth Sidious, in this exploration of the Sith and the evil allies of the dark side. Star Wars: The Secrets of the Sith will thrill young fans with dark-side knowledge, incredible artwork, and interactive features, such as pop-ups, booklets, and lift-the-flap inserts."}, {"tag": "p", "text": "Experience the power of the dark side: Narrated by Emperor Palpatine, this book will give young readers insight into the might of the dark side."}, {"tag": "p", "text": "Learn about some of the greatest Star Wars dark-side villains: Spanning films, television shows, books, comics, and video games, Star Wars: The Secrets of the Sith chronicles some of the dark side's most infamous practitioners, including Darth Maul, Count Dooku, Asajj Ventress, Darth Vader, the Grand Inquisitor, and Kylo Ren."}, {"tag": "p", "text": "Amazing original illustrations: Star Wars: The Secrets of the Sith is a beautifully illustrated children's book that readers will want to revisit time and again. Including a frameable 11″ x 17″ poster of the cover art, this book is a great gift for Star Wars fans."}, {"tag": "p", "text": "Full of exciting interactive features: Pop-ups, booklets, and lift-the-flap inserts will thrill young fans, making for an engaging experience while delving into stories about the Sith."}, {"tag": "p", "text": "The perfect addition to any Star Wars library: This beautifully bound hardcover book is a must-have for any young fan's collection."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "After writing 2019's Star Wars: The Secrets of the Jedi, a Jedi-centered reference book, Marc Sumerak was hired by Insight Editions to write a reference book centered on the Sith. Having written Secrets of the Jedi from Luke Skywalker's perspective, Sumerak was forced to write Secrets of the Sith from Emperor Palpatine's perspective. Sumerak was helped by his editor Chris Prince in writing how the Emperor transforms from a reserved public face during his days as a politician to the cunning strategist and despot he later turns out as Emperor, taking into account the Emperor's over-the-top personality. Chronicling character biographies, reflections on the Force's nature and histories consisted in diving deep into the Star Wars lore and refocusing all those events from Palpatine's point of view, a character with specific beliefs in the dark side of the Force, allowing the reader to go back and see all those pieces of media with Palpatine in their mind's forefront, paying specific attention to his actions."}, {"tag": "p", "text": "In illustrating the book, like he did with Secrets of the Jedi, Sergio Gómez Silván tried to capture a mythic feel in his illustrations, drawing the galaxy's technology with ancient elements like medieval knights and saints, Art Nouveau and Japanese parchments of the Feudal Japan. Silván usually worked from the lightsabers to compose the image of color based on them. To depict an illustration of Darth Vader particularly, Gómez tried to show Anakin Skywalker's evolution, from the yellowish tones of Tatooine's desert back when he first met Obi-Wan Kenobi through the reddish center of the Jedi Temple where he murders the Jedi younglings which inevitably led to his fate as a Sith to Mustafar's orange fires, to complete Darth Vader's metamorphosis. Gómez put this combination in contrast of the lightsaber's blue color to give Obi-Wan prominence as Anakin's connection to the light side of the Force with a wide palette of color."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}