{"url": "Star_Wars:_The_Visual_Encyclopedia", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Canon reference books", "Category:Star Wars Visual Dictionaries"], "nodes": [{"tag": "h1", "text": "Star Wars: The Visual Encyclopedia"}, {"tag": "p", "text": "Star Wars: The Visual Encyclopedia is a reference book from Dorling Kindersley. Authored by Adam Bray, Cole Horton, and Tricia Barr, the 200-page title was released on April 4, 2017. Leland Chee, member of the Lucasfilm Story Group, commented that \"[this book] maybe [sic] the closest we'll ever get to doing an actual Holocron book.\""}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Covering more than 3,000 characters, creatures, planets, vehicles, Droids™, weapons, technology, and more from the Star Wars™ universe, this visual tour is the ultimate compendium for the epic saga and beyond."}, {"tag": "p", "text": "With a full history of the galactic politics, the Jedi Council, and the Empire, Star Wars: The Visual Encyclopedia walks fans through the entire timeline of Star Wars. Galleries of images and information on every page, including lightsabers, languages, clothing, and more, are showcased with fascinating facts and trivia. See the blasters of Star Wars: Episode IV A New Hope™, look at the stormtroopers of Star Wars: The Force Awakens™, and study the geography of Rogue One: A Star Wars Story™."}, {"tag": "p", "text": "Discover the food, architecture, transportation, and more from this galaxy far, far away. Each section of the book focuses on different topics to dedicate special attention and detail to every part of the universe, no matter how small. From the planets in the outer rim to Padmé's bridal wear, nothing is missed."}, {"tag": "p", "text": "A celebration of all things Star Wars, this visual museum is the perfect addition to any fan's bookshelf."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}