{"url": "Star_Wars:_Visions_of_the_Blade", "categories": ["Category:Real-world articles", "Category:Infinities one-shot comics"], "nodes": [{"tag": "h1", "text": "Star Wars: Visions of the Blade"}, {"tag": "p", "text": "Star Wars: Visions of the Blade is a sixteen-page Infinities on-line comic with art by Tom Hodges. It revolves around the cross between the Star Wars and Soulcalibur universes."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A space battle brews between Darth Vader and cortosis miners as Vader's Devastator nears the Cowl Crucible. As Vader orders Captain Mulchive Wermis to guide the Star Destroyer deeper into the Cowl, he sees an illusional image of a sparkling silver-blue sword and reaches out to grab it, coming back to his senses after Wermis calls out to him. Vader then leaves to his private chamber to call out to Starkiller through the Force."}, {"tag": "p", "text": "Starkiller, deep within the Cowl himself in the Rogue Shadow and alongside Juno Eclipse, hears his Master's voice calling out to him. As the Rogue Shadow hits a storm, Starkiller has a vision of the same blade as Vader. In his vision, he also encounters Taki, who grabs the blade from him. Meanwhile, Juno manages to get them out of the storm to land on a nearby planet for repairs."}, {"tag": "p", "text": "Elsewhere in the galaxy, Yoda experiences a similar vision, though this time of Astaroth approaching a red sword on a volcanic planet. As he comes to and heads out his hut on Dagobah, he talks about the coming battles with the spirit of the late Qui-Gon Jinn. Back in the Cowl, Vader is seen again experiencing visions, this time of Mitsurugi slaying Stormtroopers and Tusken Raiders. After leaving his chamber, he heads out into the heart of the Cowl in his black Eta-2 interceptor."}, {"tag": "p", "text": "Back on the Rogue Shadow, Starkiller sees himself battling Taki over the sword, eventually striking her with Force lightning and knocking her out, claiming the sword as his own. Just after Starkiller emerges victorious, he departs to the north of the landing site, leaving Juno to finish tinkering with the ship. Vader lands and approaches Juno in search of Starkiller; when he hears of his taking off, Vader heads out himself into the woods, only to encounter Mitsurugi once again, though this time in person. Without a word, the two draw their weapons and enter combat as Yoda watches from the sides, stalked by Astaroth and eventually engaging in combat himself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}