{"url": "Star_Wars:_Trench_Run", "categories": ["Category:Real-world articles", "Category:2009 computer and video games", "Category:Legends mobile games", "Category:Legends web-based games"], "nodes": [{"tag": "h1", "text": "Star Wars: Trench Run"}, {"tag": "p", "text": "Star Wars: Trench Run is a video game set in the Star Wars universe, specifically during Star Wars: Episode IV A New Hope. It was developed by Infrared5 and published by THQ Wireless. It can be played on StarWars.com or purchased and played on the iPhone and iPod Touch through the Apple App Store. It was announced on October 22nd, 2009 and released on November 17th, 2009. The iPhone and iPod Touch version costs $4.99 USD. The game was updated to a 2.0 version on July 20th, 2010. The update is free with the purchase of the original game, but the ability to control the PC version of the game using your iPhone must be purchased for $1 USD. The game depicts the final space battle of the Rescue of Princess Leia and the Battle of Yavin, particularly the fateful trench run Luke Skywalker took to destroy the Death Star."}, {"tag": "p", "text": "As of early 2012, the iPhone version of the game was pulled from the iOS App Store."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "The game has two modes, Mission and Arcade. The Mission mode has five subsequent sub-modes where the player controls Luke Skywalker in his T-65 X-wing starfighter during the Battle of Yavin, including the famous trench run on the first Death Star as seen at the climax of Star Wars: Episode IV A New Hope. The sub-modes are as follows: Dog Fight, which has you destroying TIE fighters just above the surface of the Death Star. Cannons, which has you evading fire from the turbolaser batteries in the Death Star trench. Obstacles, which has you dodging the many protruding constructs within the trench. Darth Vader, which has you avoiding being shot down by the Sith Lord by eluding the targeting computer of his TIE Advanced x1. Exhaust Port, which has you launching the fateful proton torpedo into the Death Star's weak spot for massive damage. The Arcade mode allows the player to replay any of the sub-modes from the Mission mode, but with increasingly more difficulty as they progress through them. Both modes allow for the uploading of your score after completion, which is displayed on a leaderboard for all to see."}, {"tag": "p", "text": "The 2.0 update added two new modes called Escape and Han Solo to the Mission mode. The Escape mode has you manning the laser cannons of the Millennium Falcon as you escape from the Death Star after rescuing Princess Leia, and Han Solo has you manning the laser cannons again as you protect Gold Squadron, a squad of BTL Y-wing starfighters as they fly down the trench (this mode is also available separately in the Arcade mode). Additionally, the game allows for new ships to be piloted in the arcade mode, including a TIE-Fighter and Y-wing. Further improvements to the graphics, lighting, and explosion effects were also added along with the ability to control the web version of the game with your iPhone or iPod Touch."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}