{"url": "Star_Wars:_X-Wing_Tour_of_Duty:_Imperial_Pursuit", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:1994 computer and video games", "Category:X-Wing computer games"], "nodes": [{"tag": "h1", "text": "Star Wars: X-Wing Tour of Duty: Imperial Pursuit"}, {"tag": "p", "text": "Star Wars: X-Wing Tour of Duty: Imperial Pursuit was the first expansion pack for the Star Wars: X-Wing video game, providing new missions for players. It was released in 1994 and was followed by the B-Wing expansion later that year. Subsequent releases of the original game included both expansion packs. Once installed, the Imperial Pursuit missions appeared as \"Tour of Duty IV\" in the game."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "During the evacuation of Yavin 4 and the search for a new secret location for a new base, the Rebels must resist growing Imperial pressure and the new Interdictor Cruiser."}, {"tag": "p", "text": "In the first stage of the tour (missions 1–5) the Rebel Alliance flees Yavin and scatters, to avoid the Empire's retribution over the loss of the Death Star. During the initial evacuation, however, the Rebels lose most of their vital food supplies."}, {"tag": "p", "text": "In the second stage (missions 6–14) the Rebels struggle to find food. Overlord Ghorin of the Greater Plooriod Cluster claims to have grown sympathetic to the Rebellion and offers them the much-needed supplies. However, he deceives them and sells them poisoned grain. To avenge his double-cross, the Rebels discredit Ghorin by first stealing some of his Y-wings (to use them for attacks against Imperial food supplies) and then exchanging his regular grain shipments to the Empire with the tainted grain they had received. As a result, Ghorin is executed by Darth Vader."}, {"tag": "p", "text": "In the final stage of the campaign (missions 15–20) the Rebels steal TIE Advanced (to study), destroy the frigate Red Wind, and start preparing for Operation Ram's Head. The operation involves the capture of the Corvette Blade 5, which carries the experimental Shield X technology. The Corvette is then used to attack and essentially destroy an Imperial deepdock, by ramming the bridge towers of several Star Destroyers."}, {"tag": "p", "text": "Players receive the Shield of Yavin medal for successfully completing the tour of duty."}, {"tag": "h3", "text": "Missions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "See also"}]}