{"url": "Star_Wars_(1977)_10", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 10"}, {"tag": "p", "text": "Star Wars 10 is the tenth issue of the Legends comic book series Star Wars. It was written by Donald F. Glut, Howard Chaykin, and Roy Thomas; penciled by Chaykin, Tom Palmer, and Alan Kupperberg; and first published by Marvel Comics on January 10, 1978. It features the story \"Behemoth from the World Below,\" in which the Cloud-Riders are defeated, and Han Solo fights the titular monster."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Behemoth, a giant reptilian monster, is on the rampage and Han Slo [sic] may be a small village's only hope."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Old One has summoned the Behemoth, a giant reptilian monster, to defend the village Onacra from the villainous Cloud-Riders. Serji-X Arrogantus, the leader of the Cloud-Riders, realizes that he and his men have no chance against the beast, and he also realizes that the giant is being controlled by the old shaman. He attacks the Old One, but the Behemoth reacts in time to kill Serji-X. However, the shaman is killed as well, causing the monster to run amok. With the rest of the Star-Hoppers of Aduba-3 running for cover, would-be Jedi Knight Don-Wan Kihotay tries to stop the great beast on his own. Hedji tries to help him, but is easily killed by the monster. Han Solo rushes to help Kihotay and uses the man's lightsaber to destroy the Behemoth, saving the village."}, {"tag": "p", "text": "Meanwhile, Leia Organa searches the Drexel system for Luke Skywalker, who has not been heard from since his last transmission was interrupted."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Roy Thomas was the editor/co-plotter for this issue. Donald F. Glut wrote the script for this issue. Howard Chaykin was the artist/co-plotter for this issue. Tom Palmer was the co-artist/embellisher on this issue. Alan Kupperberg did the layouts, John Costanza was the letterer, and Françoise Mouly was the colorist on this issue."}, {"tag": "p", "text": "In this issue's \"Star-Words\" letters page, writer Roy Thomas announced that he and penciller Howard Chaykin would be leaving the series and that Archie Goodwin and Carmine Infantino would be taking over."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}