{"url": "Star_Wars:_X-Wing_Miniatures_Game_Core_Set", "categories": ["Category:Real-world articles", "Category:Star Wars: X-Wing Miniatures Game Core Sets"], "nodes": [{"tag": "h1", "text": "Star Wars: X-Wing Miniatures Game Core Set"}, {"tag": "p", "text": "The Star Wars: X-Wing Miniatures Game Core Set, more commonly known as the X-Wing Core Set and more recently referred to as the Classic Core Set, is the two-player starter set for the Star Wars: X-Wing Miniatures Game, a tactical ship-to-ship combat game released by Fantasy Flight Games. It features three unique missions, each with their own special rules and conditions for victory, cards, and fully assembled and painted starships—one X-wing and two TIE Fighters."}, {"tag": "p", "text": "Players are able to control starships, such as Rebel X-wings and Imperial TIE fighters, and pit them against each other in fast-paced space combat. The game features detailed and painted miniatures and recreates Star Wars space combat in several scenarios included in the release. Players are able to select their crew and plan their maneuvers before play in order to develop strategies to complete their missions. Initially announced with an early 2012 release date, the X-Wing: Core Set and the first wave of expansion packs premiered at the Gen Con gaming convention on August 16, 2012."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "X-Wing is a tactical ship-to-ship combat game in which players take control of powerful Rebel X-wings and nimble Imperial TIE fighters, facing them against each other in fast-paced space combat. Featuring stunningly detailed and painted miniatures, X-Wing recreates exciting Star Wars space combat throughout its several included scenarios. Select your crew, plan your maneuvers, and complete your mission!"}, {"tag": "p", "text": "The X-Wing starter set includes everything you need to begin your battles, such as scenarios, cards, and fully assembled and painted ships. What's more, X-Wing's quick-to-learn ruleset establishes the foundation for a system that can be expanded with your favorite ships and characters from the Star Wars universe."}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "The X-Wing: Core Set contains three miniatures, plus maneuver dials and action tokens, as well as pilot and upgrade cards."}, {"tag": "h3", "text": "Miniatures"}, {"tag": "h3", "text": "Mission scenarios"}, {"tag": "h3", "text": "Cards"}, {"tag": "h4", "text": "Rebel Pilot"}, {"tag": "h4", "text": "Imperial Pilot"}, {"tag": "h4", "text": "Upgrade cards"}, {"tag": "h4", "text": "Damage cards (Core Set only)"}, {"tag": "h3", "text": "Tokens"}, {"tag": "h4", "text": "Mission tokens"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}