{"url": "Star_Wars:_X-Wing_Miniatures_Game", "categories": ["Category:Real-world articles", "Category:Fantasy Flight Games", "Category:X-Wing Miniatures Game"], "nodes": [{"tag": "h1", "text": "Star Wars: X-Wing Miniatures Game"}, {"tag": "p", "text": "The Star Wars: X-Wing Miniatures Game is a tactical ship-to-ship combat game released by Fantasy Flight Games. Two players—or two teams of players—are able to control starships, such as Rebel X-wings and Imperial TIE fighters, and pit them against each other in fast-paced space combat. The game features detailed and painted miniatures and recreates Star Wars space combat in several scenarios included in the release. Players are able to select their crew and plan their maneuvers before play in order to develop strategies to complete their missions. Initially announced with an early 2012 release date, the Core Set and the first wave of expansion packs premiered at the Gen Con gaming convention on August 17, 2012."}, {"tag": "p", "text": "The remade, standalone second edition was launched in September 2018."}, {"tag": "p", "text": "The game is not to be confused with the capital ship miniatures combat games Starship Battles or FFG's product Star Wars: Armada."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "X-Wing is a tactical ship-to-ship combat game in which players take control of powerful Rebel X-wings and nimble Imperial TIE fighters, facing them against each other in fast-paced space combat. Featuring stunningly detailed and painted miniatures, X-Wing recreates exciting Star Wars space combat throughout its several included scenarios. Select your crew, plan your maneuvers, and complete your mission!"}, {"tag": "h2", "text": "Rules"}, {"tag": "h3", "text": "Basic Rules"}, {"tag": "p", "text": "Each type of ship in X-Wing has a unique piloting dial. Players select a speed and maneuver each turn, concealing their choices from other players. beginning with the lowest skilled pilot, each player reveals what they secretly set on the dial to the other players and executes the maneuver. Official play involves one of the provided scenarios, a range of customization options, varied maneuvers, and possible combat outcomes. Some aspects of play are determined through random generation, with a roll of dice and by drawing cards from a shuffled deck."}, {"tag": "h3", "text": "Mission scenarios"}, {"tag": "p", "text": "Advanced rules scenarios were also included in the initial release—the Core Set—as well as the in five of the subsequent releases, the Millennium Falcon, Slave I, the Lambda-class Shuttle, the Imperial Aces, the Rebel Aces, the YT-2400 Freighter, and the VT-49 Decimator Expansion Packs. Other packs include campaigns, which are series of interconnected missions."}, {"tag": "h2", "text": "Products"}, {"tag": "h3", "text": "Core Sets"}, {"tag": "h3", "text": "Expansion Packs"}, {"tag": "h4", "text": "Wave I"}, {"tag": "h4", "text": "Wave II"}, {"tag": "h4", "text": "Wave III"}, {"tag": "h4", "text": "Wave IV"}, {"tag": "h4", "text": "Wave V"}, {"tag": "h4", "text": "Wave VI"}, {"tag": "h4", "text": "Wave VII"}, {"tag": "h4", "text": "Wave VIII"}, {"tag": "h4", "text": "Wave IX"}, {"tag": "h4", "text": "Wave X"}, {"tag": "h4", "text": "Wave XI"}, {"tag": "h4", "text": "Wave XII"}, {"tag": "h4", "text": "Wave XIII"}, {"tag": "h4", "text": "Wave XIV"}, {"tag": "h4", "text": "Epic"}, {"tag": "h4", "text": "Aces"}, {"tag": "h3", "text": "Accessories"}, {"tag": "p", "text": "Fantasy Flight Games has also released various accessories to enhance game play in the Star Wars Miniatures game."}, {"tag": "h4", "text": "Dice Packs"}, {"tag": "p", "text": "Physical and virtual dice packs were release for distribution to provide additional dice for use in the game. This accessory includes an additional set of six custom eight-sided dice, three red attack dice and three green defense dice, allowing both players to have a full set of dice each instead of sharing the dice from the Core Set.."}, {"tag": "h4", "text": "Dice Apps"}, {"tag": "p", "text": "A virtual comprehensive application of the Dice Pack for iOS and Android devices was developed and distributed in app stores specifically allowing players to select and roll custom dice in the X-Wing™ Miniatures Game, the Star Wars Roleplaying Game, and in Star Wars: Edge of the Empire, but even includes an assortment of seven types of polyhedral dice for all other gaming needs. Features of the app include an option to allow players to save their most commonly used configurations as \"presets,\" eight iconic backgrounds and six distinct sound packs from the Star Wars universe, and an intuitive radial menu and interactive help guide.."}, {"tag": "h4", "text": "Starfield Game Tile Kit"}, {"tag": "p", "text": "A vivid backdrop for use as a playing surface for X-Wing games, the Starfield Game Tile Kit allows players to build custom environments using any combination of twelve one-square-foot double-sided matte-finished card stock tiles mounted on 2.5mm fiber board for durability. Tiles display several vivid Star Wars–themed images—including starfield, Alderaan, asteroid field, and Death Star tiles—that can by combined together in many different configurations to produce a wide array of Star Wars-themed scenes. The kit includes rules to allow players to go beyond cooperation in pre-game construction and provide the added element of competitively setting up the battlefield."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Although the game itself is spelled \"X-Wing\" (with an upper-case W), all references to the in-universe ship are spelled \"X-wing\" (with a lower-case W), as it is spelled in other media."}, {"tag": "p", "text": "In order to make the ship models correctly proportioned and detailed, Lucasfilm provided Fantasy Flight Games with exact dimensional data and access to information about the models from the original trilogy."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}