{"url": "Star_Wars:_X-Wing_Tour_of_Duty:_B-Wing", "categories": ["Category:Real-world articles", "Category:1994 computer and video games", "Category:X-Wing computer games"], "nodes": [{"tag": "h1", "text": "Star Wars: X-Wing Tour of Duty: B-Wing"}, {"tag": "p", "text": "Star Wars: X-Wing Tour of Duty: B-Wing was the second expansion pack for the Star Wars: X-Wing video game, providing new missions for players. It was released in 1994, following the Imperial Pursuit expansion released earlier that year. Once installed, the B-Wing missions appeared as \"Tour of Duty V\" in the game."}, {"tag": "p", "text": "Subsequent releases of the original game included both expansion packs."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "The expansion focuses on the production of a new craft, the B-wing, and its delivery to the Rebellion. The tour ends with the arrival on Hoth and the construction of Echo Base, setting the stage for The Empire Strikes Back."}, {"tag": "p", "text": "During the first stage of the tour (missions 1 - 8) the Rebels perform their first tests of the B-wing starfighter and make efforts to attract a new ally. The Habassa, being an isolationist culture, are initially highly reluctant to join the Alliance. However, the Rebels manage convince them by first rescuing Habassan prisoners from an Imperial convoy, and afterwards defending a Habassan convoy from an Imperial ambush. Alliance pilots also destroy a secret space installation where the Empire attempts to recreate the stolen Shield X technology."}, {"tag": "p", "text": "During the second stage of the tour (missions 9 - 14), with the Habassa having joined the Alliance, the Rebels start preparing their final escape from the pursuing Imperial Fleet. They steal and modify Imperial survaillance probes, destroy several system patrol squadron bases, and continue their support for the Habassa by protecting their convoys from Imperial attacks. The Alliance captures an Imperial Frigate and Imperial officers in order to get up-to-date information on their positions."}, {"tag": "p", "text": "During the final stage of the tour (missions 15 - 20) the Rebels need to completely disappear from Imperial sight, in order to perform the final evacuation to Hoth. They destroy a probe calibration site and, eventually, the Star Destroyer Relentless, which processed the information from all probes in the sector. The Alliance eliminated any remaining probes in Operation Blunt Stick and the fleet made their final jumps to Hoth, despite the interference of several Imperial Frigates."}, {"tag": "p", "text": "Players receive the Talons of Hoth medal for successfully completing the tour of duty."}, {"tag": "h3", "text": "Missions"}, {"tag": "h3", "text": "Historical Missions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "See also"}]}