{"url": "Star_Wars_(1977)_15", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 15"}, {"tag": "p", "text": "Star Wars 15 is the fifteenth issue of the Legends comic book series Star Wars. It was written by Archie Goodwin, illustrated by Carmine Infantino and Terry Austin, and first published by Marvel Comics on June 27, 1978. It features the story \"Star Duel!,\" in which Han Solo faces off against the space pirate Crimson Jack."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "When the Millenium Falcon [sic] is disabled, Han will have to outduel space pirates to survive!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "With Governor Quarg killed and his jamming equipment disabled, Crimson Jack's battlecruiser is fully operational and waiting for Han Solo and the Millennium Falcon to leave the surface of Drexel so Jack can exact some revenge. Jolli engages in a dogfight with the Falcon which results in her Y-wing and the Falcon becoming disabled. Although Solo appears helpless as a result of the damage, he forces a personal exchange between himself and Jack when he reveals that Chewbacca erased Jack's navigational charts while on board his cruiser. Meanwhile, Jolli requests assistance because of damage sustained in the earlier battle, but Jack dismisses her, focusing instead on how to get back at Solo. Angered by Jack's response, Jolli fires on her former allies and rams her ship into the battlecruiser, killing the crew and herself. While Jack survives the blast, he is still bent on killing Solo, but in the final duel between the two, Solo ends up killing the red-bearded pirate with a blaster."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In Star Wars 15, Luke Skywalker claims that he does not know how to swim, while Leia Organa is able to. In the previously-published novel Splinter of the Mind's Eye (1978), the reverse is true."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}