{"url": "Star_Wars_(1977)_26", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 26"}, {"tag": "p", "text": "Star Wars 26 is the twenty-sixth issue of the Legends comic book series Star Wars. It was written by Archie Goodwin, illustrated by Carmine Infantino, and first published on May 22, 1979 by Marvel Comics. The issue features the story \"Doom Mission!,\" in which Luke Skywalker investigates the appearance of Imperial raiders in Alliance territory."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Empire has something devious set up on Yavin and Luke and Leia are on a mission to uncover just what is going on."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Empire has set up a blockade of the Gordian Reach Sector and Luke and Leia, on their way back to the Rebel base on Yavin 4, are ambushed by two Imperial TIE fighters. Just as the situation appears hopeless, a Rebel X-wing patrol arrives and destroys the two enemy fighters."}, {"tag": "p", "text": "Once they finally arrive at the base, they inform General Jan Dodonna about the events they observed earlier, where TIE fighters were entering the gaseous atmosphere of Yavin. Since Yavin's atmosphere is too thick for conventional signalling, they deduce that the House of Tagge and the Empire have developed some new signalling technology and set up a launch station within the gas giant. Luke goes on a mission to retrieve one of the signalling units from a downed TIE fighter, but at the cost of critical damage to R2-D2."}, {"tag": "p", "text": "Luke then pilots a captured TIE fighter, fitted with the new signalling unit, through the atmosphere of Yavin to the Achtnak Turbine Station. He destroys the station without trouble, but must find his way back to open space without the benefit of guidance from the station. Using the Force to direct him, Luke manages to find his way out of the thick atmosphere. Little does he know that Baron Orman Tagge followed him out, saving himself from being lost on Yavin forever."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}