{"url": "Star_Wars_(1977)_48", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars (Marvel 1977)", "Category:True Believers"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 48"}, {"tag": "p", "text": "Star Wars 48, also published as Vader vs. Leia 1, is the forty-eighth issue of the Legends comic book series Star Wars. It was written by Larry Hama, illustrated by Carmine Infantino, and first published on March 24, 1981 by Marvel Comics."}, {"tag": "p", "text": "The issue features the story \"The Third Law,\" in which Princess Leia and Darth Vader have a battle of wits over the priceless Crown Jewels of Alderaan."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Darth Vader and Leia face off in a gambit involving X-Wing fighters the Rebellion sorely needs and priceless jewels!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Princess Leia Organa, C-3PO, R2-D2, and Rebellion finance minister Viscount Tardi arrive on the banking world of Aargau to complete the financing of a sale of X-wing fighters to the Rebellion. Also on the planet is Darth Vader and his entourage of paid assassins specializing in unarmed combat as it is forbidden for non-citizens of Aargau to carry weapons."}, {"tag": "p", "text": "Vader's assassins make several attempts on Tardi's life, but Leia's quick wit succeeds in not only saving the Viscount, but destroying the assassins as well. Ultimately Vader is forced to play his hand and he cuts Tardi down with his lightsaber, but Viscount Tardi is actually just a droid made in his image, and the real Tardi had died months ago. Leia had R2 record video images of the \"murder\" and transmit them to C-3PO who is waiting at police headquarters to prevent Vader from exposing their ruse to the authorities. Leia needed the fake Viscount to secure the loan, and she used the Crown Jewels of Alderaan as indisputable collateral, but knowing that the authorities would have discovered that Tardi was a fake when they passed through Aargau's security scanners as soon as they attempted to leave the planet, it was necessary for Leia to manipulate Darth Vader into destroying the duplicate."}, {"tag": "p", "text": "Darth Vader has also been manipulating Princess Leia as he really has no interest in preventing her financial deal for the starfighters; he actually wanted to take possession of the priceless jewels. He bribed an officer at the local customs station and succeeded in acquiring the treasure. He had only played along with Leia's plan to ensure he could leave the planet without the jewels being missed by the authorities."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}