{"url": "Star_Wars_(1977)_18", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 18"}, {"tag": "p", "text": "Star Wars 18 is the eighteenth issue of the Legends comic book series Star Wars. It was written by Archie Goodwin, illustrated by Carmine Infantino and Gene Day, and first published by Marvel Comics on September 26, 1978. It features the story \"The Empire Strikes!,\" in which the Heroes of Yavin arrive at the Wheel, a nefarious space station associated with the House of Tagge."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "What has caused Luke to fall into a coma?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While training on board the Millennium Falcon, Luke Skywalker falls into a deep and mysterious trance. As Han Solo, Leia Organa, and Chewbacca pilot the Falcon toward medical help, they stumble across the remains of a House of Tagge merchant ship. They discover a surviving Rebel soldier who tells them that the Tagge ship was actually attacked by Imperials, but it was made to look like Rebels had destroyed the craft. The Imperial cruiser of Commander Strom soon arrives on the scene intending to capture the Falcon and her crew, but Han pilots their escape to the relative safety of the Wheel. Strom sends his troops to follow, but is soon contacted by the Wheel's administrator Simon Greyshade, who reminds the Imperial commander that the Wheel is supposed to be free of interference from the Empire. Strom then claims that these Rebels are responsible for the attack on the House of Tagge ship which was carrying profits from the Wheel, at which point Greyshade relents and allows the Imperials onto the Wheel's lower levels to catch the Rebels."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}