{"url": "Star_Wars_(1977)_53", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 53"}, {"tag": "p", "text": "Star Wars 53: The Last Gift From Alderaan! is the fifty-third issue in Marvel's Star Wars series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Princess Leia Organa and Captain Chedaki pilot a blockade runner to investigate Imperial activity in the Shiva system, but as the two are entering a shuttle to go down to the planet Shiva IV, the ship is damaged by a space mine. Chedaki is killed in the explosion and Leia is forced to launch the damaged shuttle in order to protect the ship and the rest of the crew from harm. The shuttle crashes on Shiva IV and Leia is immediately attacked by a savage raiding party. A group of natives led by Aron Peacebringer and Kéral Longknife repel the raiders and rescue the princess. Leia returns to the capital Illyriaqüm with Aron, and tries to warn him of the danger that the Galactic Empire poses, but the warlord is not convinced that such an empire exists. But during a gala of Calian nobility, Aron and Leia are both secretly captured by Imperial stormtroopers and brought before General Sk'ar as prisoners."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "This issue and the following one were based on unused art for the canceled Marvel Comics series John Carter, Warlord of Mars. Star Wars series regular Carmine Infantino had provided some fill-in art for the series based on Edgar Rice Burroughs's space-fantasy warlord John Carter of Mars which was left over after the cancellation; not wishing that the art be wasted, approximately a year after the cancellation Marvel tasked Chris Claremont with writing a new story based on the existing art and Walter Simonson with adapting Infantino's art as needed to fit the Star Wars series. John Carter was turned into Aron Peacebringer of Shiva IV in the story that filled these two issues. In the Star-Words letters column, the issues were passed off as simply inspired by the John Carter stories."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The story introduces Sk'ar, Aron Peacebringer, Ygal Delois, Alisande and Kéral Longknife."}, {"tag": "p", "text": "Leia refers to the Cherenkov effect when she sees the destroyed city of K'avor. This phenomenon is named after the real-world Russian scientist Pavel Alekseyevich Cherenkov."}, {"tag": "p", "text": "The 2008 The Complete Star Wars Encyclopedia confirmed that the TIE Series craft appearing on the comic's cover is a TIE boarding craft, not to be confused with a TIE/sh VIP shuttle."}, {"tag": "p", "text": "While not named in this story, Sk'ar's race was retconned to be Kaleesh in later Expanded Universe material."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}