{"url": "Star_Wars:_X-Wing_Alliance", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:1999 computer and video games", "Category:LucasArts Archive Series", "Category:X-Wing computer games"], "nodes": [{"tag": "h1", "text": "Star Wars: X-Wing Alliance"}, {"tag": "p", "text": "Star Wars: X-Wing Alliance is the fourth game in the X-Wing computer game series, and is considered by most fans to be the sequel to Star Wars: TIE Fighter, and therefore the third part of a progressive trilogy. Though the multiplayer-focused Star Wars: X-Wing vs. TIE Fighter was the third game released in the series, its lack of story-driven campaigns was decried by fans."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "X-Wing Alliance presents the story of Ace Azzameen, the youngest member of the Azzameen family, a neutral family of traders. The player assumes Ace's place in all of the missions in the game."}, {"tag": "p", "text": "Apart from the usual badges and medals for winning missions which are featured in the other games of the X-Wing computer game series, progress is also indicated by the number of souvenirs collected in Ace's room. Additionally, an E-mail delivery system helps to evolve Ace's background story and provided deeper looks into his personal relationships and his family's whereabouts."}, {"tag": "p", "text": "X-Wing Alliance offers a full voiceover soundtrack and full dialogue in-flight. Flight control is marginally updated from the previous games of the series, allowing the player to link their cannons together, the ability to board and pick up other craft, and the addition of rudder support. Graphics are also overhauled in this game; high-resolution textures, more complex models, and full three-dimensional cockpits were added. However, the cockpits are not faithful to the other games; all indicators and screens are separated from the cockpit as an in-flight HUD depicted as floating windows."}, {"tag": "p", "text": "It also introduces missions that span multiple star systems, similar to the \"autopilot\" feature of the Wing Commander games; rather than ending the mission, jumping to hyperspace (when the option is available) will progress the mission to a new location and a new mission objective."}, {"tag": "p", "text": "The book Star Wars: X-Wing Alliance: Prima's Official Strategy Guide, released nearly three months after the game, presented mission summaries and hints in the form of an account of the game's events from the droid MK-09. It included a CD with an upgrade to the game that included additional skirmish templates, a camera feature that was present in the other games of the series, and films of every mission in the game."}, {"tag": "h2", "text": "Opening Crawl"}, {"tag": "h2", "text": "Story"}, {"tag": "p", "text": "Although the game is considered a sequel, it takes place simultaneously with Star Wars: TIE Fighter, showing the whereabouts of the Rebellion during those events: it starts a little after the Battle of Hoth, crosses over with the Shadows of the Empire and ends with the Battle of Endor (TIE Fighter's expansion ends right before Endor)."}, {"tag": "h3", "text": "Prologue: Family Business"}, {"tag": "p", "text": "The game's prologue, or tutorial, concerns Ace's \"family missions\" where his elder family members and Emkay instruct him in the flying of Corellian transports so that he can begin working for the family."}, {"tag": "p", "text": "These missions reveal that the Azzameen family is in heated competition with the Viraxo and is generally sympathetic to the Rebel Alliance. Due to their sympathies, the patriarch of the family, Tomaas Azzameen, begins making bacta smuggling runs for the Alliance in the aftermath of the Battle of Hoth. This causes them to pay dearly as the Galactic Empire raids their home station for running bacta to an Alliance outpost. The family subsequently seeks asylum with a Rebel task force."}, {"tag": "p", "text": "Missions:"}, {"tag": "h3", "text": "Interlude: Joining the Rebellion"}, {"tag": "p", "text": "Two training missions introducing Ace to the Alliance. The missions begin not from Ace's main home base, but from a place called Lost Station."}, {"tag": "p", "text": "Missions:"}, {"tag": "h3", "text": "Battle 1: Clearing the Way"}, {"tag": "p", "text": "As a Rebel pilot, Ace's first missions center around helping the Defiance battle group gather the last of the Hoth survivors and evade a huge Imperial task force sweeping the area. He also make a couple of side-runs to aid his family in their struggle against the Viraxo."}, {"tag": "p", "text": "Missions:"}, {"tag": "h3", "text": "Battle 2: Secret Weapons of the Empire"}, {"tag": "p", "text": "During his tour with the Rebel Alliance, he proves himself to be a significant pilot as he participates in missions which reveal new Imperial projects, such as a slew of experimental TIEs under the direction of Admiral Zaarin."}, {"tag": "p", "text": "Missions:"}, {"tag": "h3", "text": "Battle 3: Over the Fence"}, {"tag": "p", "text": "When Alliance forces begin receiving anonymous communiques from deep within Imperial space revealing valuable targets Ace is thrown into a massive battle to liberate one defector and capture another."}, {"tag": "p", "text": "Missions:"}, {"tag": "h3", "text": "Battle 4: The Bothan Connection"}, {"tag": "p", "text": "Some events from the game tie in with events from the films Star Wars: Episode V The Empire Strikes Back and Star Wars: Episode VI Return of the Jedi—as well as to events from the novel Shadows of the Empire—such as sequences which track the Rebellion's situation after the Battle of Hoth, assist Dash Rendar in the capture of the Imperial freighter Suprosa which carries the Death Star II plans, and revolve around stealing Shuttle Tydirium."}, {"tag": "p", "text": "Missions:"}, {"tag": "h3", "text": "Battle 5: Mustering the Fleet"}, {"tag": "p", "text": "When the bulk of the Alliance's freighter fleet is slagged by the Empire, the Alliance strike a deal with a local \"business\" coalition to acquire much-needed supplies. When one member of the coalition breaks away and goes rogue, Ace and his squadron have to move fast to stop them and save the Rebellion's reputation and allies."}, {"tag": "p", "text": "Missions:"}, {"tag": "h3", "text": "Battle 6: The Darkest Hour"}, {"tag": "p", "text": "With the chrono ticking down to the Battle of Endor Ace and his squadron are confronted with saving several Bothan spies with critical intel, stealing a certain Lambda-class shuttle, escaping a relative's betrayal, and defeating a band of mercenaries attempting to tear the Rebel Alliance apart, all against increasingly long odds."}, {"tag": "p", "text": "Missions:"}, {"tag": "h3", "text": "Battle 7: Battle of Endor"}, {"tag": "p", "text": "After encountering the Imperial fleet, the player has to pilot the Millennium Falcon inside the Death Star and destroy its reactor, in a scene that resembles that of the movie."}, {"tag": "p", "text": "Missions:"}, {"tag": "h2", "text": "Cameos and references"}, {"tag": "h2", "text": "Modifications"}, {"tag": "p", "text": "A few models are included in the game's data files but are not featured in the game's reference library or missions. One such item is a \"booster pack.\" Custom missions have been made that use the hidden models."}, {"tag": "p", "text": "The X-Wing project was finished with this chapter so no expansions were ever scheduled for Alliance; it is the only one of the X-Wing series to have no expansion or re-enhanced remake."}, {"tag": "p", "text": "However, the game is modifiable and many fans and programmers create improved textures and graphics for the ships, new missions and other modifications."}, {"tag": "p", "text": "Some of the new missions are actually remakes of the previous games, based on the engine of Alliance. Currently an unofficial fan-made Star Wars: TIE Fighter remake is being created. This modification for example replaces the Mon Calamari Star Cruiser concourse and briefings with Imperial versions, as well as remaking the classic TIE Fighter missions using the Alliance engine to increase player enjoyment."}, {"tag": "p", "text": "As for Alliance itself, fan based upgrade sites such as \"X-Wing Alliance Upgrade\" have acted as the central distribution points for upgraded spacecraft packs."}, {"tag": "p", "text": "These vary from simple upgrades to higher resolution graphics, such as containers, landing bays, weapons etc., to high capital ships such as the various Star Destroyers as well the Super Star Destroyer Executor, all with multiple (and destroyable) hardpoints like shield generators, engines, bridges and turbolasers. Playable fighters are modified complete with upgraded virtual cockpits bringing cockpit visuals closer to movie canon."}, {"tag": "p", "text": "By editing the \"Shiplist\" game file and replacing NonFlyable ships with Flyable, players can fly any ship they want, including a Super Star Destroyer. Downloading the V1.01 upgrade can also allow all larger ships' turrets to work if set to autofire."}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": "Alliance was re-released as a part of the collection X-Wing Trilogy along with the other parts of the trilogy and a demo of X-Wing vs. TIE Fighter. That version had no re-enhancements or differences to the original release."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cut content"}, {"tag": "p", "text": "Totally Games originally planned to include the StarViper heavy starfighter and the modified Strike Cruiser, but these craft were cut from the game's final release."}, {"tag": "p", "text": "It was originally planned that players would be able to work cooperatively and man the turrets of freighter-type ships in multiplayer. This was advertised and demonstrated in an early preview video. However, the limitations of Internet and LAN performance at the time, as well as the game's own netcode, resulted in this feature being dropped in final production, although user-created modifications later re-enabled this feature."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}