{"url": "Star_Wars_(1977)_56", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 56"}, {"tag": "p", "text": "Star Wars 56: Coffin in the Clouds is the fifty-sixth issue in the Marvel Star Wars series of comics. It was also the story that introduced the character of Shira Brie, later known as Lumiya."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Lando Calrissian returns to Cloud City only to find that it appears to have been completely abandoned. He soon discovers Imperial bombtroopers arriving to disarm a series of bombs left behind by disgruntled Ugnaught workers. The Imperials attempt to disarm the first one they find, a talking bomb, and the bomb itself appears to be helping them, but instead tricks them into arming the explosive mechanism rather than disarming it. The charge explodes, leaving Captain Hugo Treece, the acting governor of Cloud City, the only surviving Imperial. Calrissian and Treece agree to a truce in order to recover Lobot, who was critically damaged by the Ugnaughts, and have him deactivate the remaining bombs left on Cloud City before the entire city is destroyed. Their plan works, but as soon as the rest of the bombs are disarmed Treece turns on Lando and shoves him through the railing bordering Cloud City, where he falls towards the planet Bespin below."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In this story, Bespin has a habitable surface: the residents of Cloud City had been evacuated to it, and it is the home planet of the Ugnaughts. Previous and succeeding sources, however, say that Bespin is a gas giant."}, {"tag": "p", "text": "At one point, Lando claims that cyborgs have the ability to telekinetically manipulate electronic circuits, and Lobot displays such an ability to deactivate the bombs. No other source attributes such an ability to cyborgs, and it is inconsistent with what a cyborg is."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}