{"url": "Star_Wars_(1977)_60", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 60"}, {"tag": "p", "text": "Star Wars 60: Shira's Story is the sixtieth issue in the Marvel Star Wars series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Members of Rogue Squadron pilot four TIE fighter ships and infiltrate the Imperial outpost on the planet, Spindrift. Swooping down, they begin strafing the command towers. An Imperial Major and his underling, Gerdy, attempt to flee in a sub-ter rover transport. They manage to get halfway across a suspension bridge, when one of the TIE fighters destroys the end of the bridge. Gerdy and the Major have no choice but to surrender. They are shocked to discover that the pilots of the TIE fighters are none other than the Rebel Alliance officers, Luke Skywalker, Captain Thorben, Shira Brie, Gemmer and Wald. After securing the base, Captain Thorben retrieves a set of route coordinates for a new Imperial armada. Rogue Squadron then returns to the Rebel base on the planet, Arbra."}, {"tag": "p", "text": "Back at the base, Shira Brie informs Princess Leia that she needs to return to her home world, Shalyvane, on a personal matter. She asks Leia for the return coordinates, so that she'll be able to come back after she is done taking care of business. Leia cites that the base coordinates are top secret and that she cannot reveal them to her. Luke volunteers to accompany Shira and takes responsibility for bringing her back. Thorben and Wald agree to go with them."}, {"tag": "p", "text": "Arriving on Shalyvane, Shira heads to the Circle of Kavaan in the capital city of Chinshassa. Shira tells a story about how her people were wiped out by the savage tribes of the Em'liy when she was a little girl. After completing her tale of woe, a horde of Em'liy warriors appear over the horizon. The Rebels engage in a massive firefight and lay waste to the religious stones surrounding the Circle of Kavaan. The Em'liy keep Luke and the others pinned down with blaster fire, but Shira manages to circle around the war-zone and board her TIE fighter. She swings the fighter back around and decimates the Em'liy warriors. After the dust settles, everyone gets back into their fighters and heads back towards Arbra. Shira never reveals the true nature of her visit to Shalyvane."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}