{"url": "Star_Wars:_Yoda_Stories", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:1997 computer and video games", "Category:1999 computer and video games", "Category:Legends computer games", "Category:Legends console video games"], "nodes": [{"tag": "h1", "text": "Star Wars: Yoda Stories"}, {"tag": "p", "text": "Star Wars: Yoda Stories is a 1997 Star Wars Legends video game developed by LucasArts for PC and Game Boy Color. It was preceded by Indiana Jones and His Desktop Adventures, and no further Desktop Adventures titles were released. In the Star Wars timeline, Yoda Stories is placed between Star Wars: Episode V The Empire Strikes Back and Star Wars: Episode VI Return of the Jedi, where Luke Skywalker is completing his training with Jedi Master Yoda."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Unlike other titles, Yoda Stories has no central plot or definitive goal—it's a collection of random games where the player, controlling Luke Skywalker, has to complete an objective like rescuing Han Solo or Princess Leia, obtaining an object, or warning the Rebellion in several locations of the Star Wars universe like Neshtab, Tatooine, and the Forest moon of Endor."}, {"tag": "p", "text": "Each game starts with Luke arriving at Dagobah in an X-wing. If the player is still a rookie, R2-D2 can be picked up and dropped anytime for hints. After finding Yoda, the Jedi Master gives Luke one assignment and one object that will be required to complete it, and the game begins. Each gameworld is composed by 100 screens, but how many are active can be set in the options. Although it's not required to complete the game, a locator provides information (such as the status of a puzzle) and a way to find out where the player is. It is always found in one of the eight screens surrounding the spaceport screen, usually found under a rock, inside a wrecked vehicle or with a person. To progress in the game, the player has to make errands, such as finding a key, or an object, until he reaches the final puzzle. The Force is also present, but in the beginning it must be obtained from the ghost of Obi-Wan Kenobi. It stops all enemies from moving, and is occasionally required to complete a puzzle."}, {"tag": "p", "text": "There are several enemies, from Imperial stormtroopers and Tusken Raiders to animals, and all can be dealt accordingly with Luke's lightsaber, blasters or thermal detonators (that destroy any enemies in a 3-radius plus-sign pattern). As Luke can be hurt, there are several ways to replenish his health, from health kits and bacta canisters to plants."}, {"tag": "p", "text": "In the fifth game, Luke battles Darth Vader, and if successful, the next game he starts with a green lightsaber instead of his father's blue; after 10, he starts with the Force (without the need to find the ghost of Obi-Wan), and finally, after 15 times, with a \"Spirit Heart,\" which gives the player a second life. Unlike Indiana Jones and his Desktop Adventures, Yoda Stories keeps the number of games beaten and also the highest score."}, {"tag": "p", "text": "Indiana Jones is featured as an easter egg in a mission, as a sequel to a mission in Desktop Adventures. Luke remarks on his similarity to Han Solo."}, {"tag": "h2", "text": "Possible Scenarios"}, {"tag": "p", "text": "The order of missions, the planets' maps and other details are randomly chosen, but the goals and which planet a mission takes place on stays the same each time"}, {"tag": "p", "text": "Desert World"}, {"tag": "p", "text": "Forest World"}, {"tag": "p", "text": "Snow World"}, {"tag": "h2", "text": "Critical reaction"}, {"tag": "p", "text": "The game received poor reviews at the time of the release, mostly because it was decided to review it as a regular game, rather than a \"quick break\" game replacement to games like Solitaire or Hearts.[source?] The graphics are simple bitmaps and regular 32×32 icons, with few animations."}, {"tag": "h2", "text": "Versions of the game"}, {"tag": "p", "text": "A Windows version was released in 1997. This version can be bought on disc now, but needs a download from the internet to get it to work on newer versions of Windows. The Windows version included a re-release of Star Wars: Making Magic."}, {"tag": "p", "text": "The Game Boy Color version was released in 1999. Like the computer version, the gameplay is a number of simple quests, but the game consisted of a finite number of levels: fifteen. The graphics are not as detailed or colorful compared to the computer game due to the limitations of the Game Boy Color hardware, and controlling the main character is more difficult and less fluid in this version due to the lack of a mouse. Because of these factors and lackluster, repetitive gameplay, the game has received consistently low scores from several gaming sites; Gamespot cited it as \"possibly the worst Star Wars game ever produced.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}