{"url": "Star_Wars_(1977)_17", "categories": ["Category:Real-world articles", "Category:Star Wars (Marvel 1977)"], "nodes": [{"tag": "h1", "text": "Star Wars (1977) 17"}, {"tag": "p", "text": "Star Wars 17 is the seventeenth issue in the Marvel Star Wars series of comics. It contains the story \"Crucible.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While Luke Skywalker is piloting the Millennium Falcon through space, his mind flashes back to his life back on Tatooine. Luke, Biggs Darklighter, Deak, and other youngsters race their T-16 skyhoppers through the twisting maze of Beggar's Canyon when a wounded scout arrives to warn them of an impending attack by the Sandpeople. While the others try to hold off the attacks, Luke and Biggs rush off to warn the other residents of the area of the danger. Biggs is wounded by a Tusken Raider, and Luke has to take him in his skyhopper through the dangerous caverns of Diablo Cut to get him to safety."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aside from the first page and last two pages of this issue, the entire story is a flashback to Luke's life before A New Hope."}, {"tag": "p", "text": "Luke crashes his skyhopper at the end of this story. This incident is possibly the 'damage' referred to in some of the Expanded Universe sources as to why Luke doesn't use the skyhopper when he and Threepio search for the runaway Artoo-Detoo in Episode IV."}, {"tag": "p", "text": "During the flashback, Luke mentions his plans to buy the macrobinoculars which he is seen using in Episode IV."}, {"tag": "p", "text": "Luke refers to his 6-2Aug2 hunting rifle as an \"energy-rifle\", despite it being a slugthrower."}, {"tag": "p", "text": "In A New Hope, in the movie Luke mentions shooting romp rats from his T-16 during the scene the rebels explain their plan to destroy the Death Star. He explains to another pilot that he has experience in shooting targets that are only two meters or so in size. This story from the comic is a nod to that line from the movie."}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}