{"url": "Star_Wars_(1998)_27", "categories": ["Category:Real-world articles", "Category:Star Wars: Republic"], "nodes": [{"tag": "h1", "text": "Star Wars (1998) 27"}, {"tag": "p", "text": "Starcrash is the twenty-seventh issue in the Star Wars: Republic series of comics. It was published on February 28, 2001 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "This issue, meet Jedi Yoshi Raph-Elan. On his way to a meeting of Jedi, Yoshi is attacked by an unknown enemy. Stranded without even a lightsaber, he must find out what this new threat wants. Along the way, he meets the beautiful princess Lourdes, and learns a lesson about trusting ancient prophecies. And it's all brought to you by Doug Petrie (Buffy: Ring of Fire and writer for the Buffy TVS TV series), Randy Green (Witchblade), and Andy Owens (Buffy and Angel)."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In transit, newly Knighted Jedi Yoshi Raph-Elan finds himself attacked by unknown assailants. One of the ships hits him, disabling his craft, and forcing him to crash-land on a nearby planet. After finding his ship worthless, and his lightsaber smashed, Yoshi heads off for a nearby village. Upon his arrival, Yoshi finds a small child about to be shot by a battle-droid. After saving the child and dispatching the droid, he heads off in search of the droid's master. His search takes him to a large castle. In an attempt to infiltrate the castle, Yoshi is discovered by Princess Lourdes, who is intended to marry the droids' master, Lord Gar-Oth. The princess brings Yoshi with her to a reception of Lord Gar-Oth, in hopes he can help against the conqueror. But when Gar-Oth declares his intentions to marry Lourdes right then and there, Yoshi lies, saying he is her husband. Gar-Oth attacks him, but upon realizing he is a Jedi, he unveils his giant Goliath droid, which he orders to attack the Jedi. After the princess kills Gar-Oth, Yoshi is able to use the giant droid's own circuitry to repair his lightsaber, which he uses to destroy the droid. Later, a republic ship is sent to rescue the young Jedi, but not before Lourdes kisses Yoshi telling him to return to her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During the comic, the speech of a number of aliens was depicted as Greek letters jumbled together."}, {"tag": "p", "text": "The events of this comic as they relate to Princess Lourdes are retold in The Official Star Wars Fact File 128, along with some new background information."}, {"tag": "p", "text": "The Essential Atlas, released in 2009 provided further detail on two species depicted in this comic, the Yahk-Tosh, and a previously unnamed species now identified as the Jilruans."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}