{"url": "Star_Wars_(1991_video_game)", "categories": ["Category:Real-world articles", "Category:1991 computer and video games", "Category:Legends console video games", "Category:Nintendo Entertainment System games", "Category:Nintendo Game Boy games", "Category:Sega Game Gear games"], "nodes": [{"tag": "h1", "text": "Star Wars (1991 video game)"}, {"tag": "p", "text": "Star Wars is a video game released for the Nintendo Entertainment System in 1991. The head designer was Akila Redmer with Kalani Streicher as one of the developers. The object is to pilot a landspeeder around Tatooine, explore caves, assemble all the necessary characters, gather a lightsaber and shields for the Millennium Falcon, navigate through a meteor shower to the Death Star, battle stormtroopers, and destroy the Death Star. A port of the game for the Nintendo's Game Boy was released in 1992."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Synopsis"}, {"tag": "h4", "text": "Tatooine Desert"}, {"tag": "p", "text": "In the pursuit of the Empire, two droids in the service of the Rebellion, R2-D2 and C-3PO, manage to escape to the planet Tatooine. They are recovered by Jawas and are subsequently sold to Luke Skywalker and his Uncle Owen. Unbeknownst to his new owners, the smaller droid, R2-D2 slips away. C-3PO is left to explain to Skywalker that R2 spoke of fulfilling his mission before escaping. Luke takes C-3PO along as he uses his landspeeder to traverse the desolate wilderness of Tatooine, avoiding dangers such as charging banthas and strategic radar stations."}, {"tag": "p", "text": "Having received word that the Rebel droids have the stolen Death Star plans, Darth Vader has sent a scouting party down to the Tatooine as well in hopes to intercept them. He sent out various Imperial Probes to search for the droids and use deadly force if encountered. Meanwhile his Stormtroopers have set up laser cannons throughout the desert to prevent any resistance to the Empire's operation."}, {"tag": "h4", "text": "Laser Cave"}, {"tag": "p", "text": "Luke's first stop is the cave entrance to the Laser Cave. Luke navigates the dark, expansive cavern while jumping over large gaps with deadly sharp bones at the bottom. Another deadly trap Luke encounters is volatile ooze dripping from the stalagmites on the ceiling. By the exit of the cave, Luke discovers a Blaster Power-Up, imbuing his sidearm blaster with a more powerful blast."}, {"tag": "h4", "text": "Sandcrawler"}, {"tag": "p", "text": "Continuing their search back on Luke's landspeeder, C-3PO's scanners confirm that R2-D2 is being held within the Jawas' massive Sandcrawler, confirming that R2-D2 was once again captured by Jawas as he traversed the Tatooine Desert alone."}, {"tag": "p", "text": "Upon inquiring about R2-D2's whereabouts, Luke is immediately met with resistance from the Jawas, who now must fight his way to R2-D2's location. Luke discovers that the inner workings of the Sandcrawer double as traps for intruders, such as Metal Mashers that are made to pound scrap metal with deadly force. Luke also uses these mechanics to his advantage, as he runs along conveyer belts and jumps along anti-gravity Jump Boosters to ascend to higher levels, blasting hostile Jawas along the way. A blue guard robot proves formidable as it emits a devastating energy blast and is immune to Luke's blaster shots. After navigating the maze of the Sandcrawler, Luke finally finds R2-D2 in the very top. After being rescued, R2-D2 explains more of his mission to C-3PO: he is searching for his master, who is a resident of Tatooine by the name of General Kenobi."}, {"tag": "h4", "text": "Tusken Cave"}, {"tag": "p", "text": "Before investigating this lead, Luke searches nearby caves for supplies before advancing onwards. With C-3PO and R2-D2 in tow, Luke explores the Tusken Cave–named for its vicious native inhabitants. The uneven ground on the inside sets off deadly boulders barreling towards Luke, who continues to ascend the paths. The Tusken Cave is also plagued by dripping ooze, as well as crawling Sand Slugs, which Luke dispatches with his blaster. As the cave opens up, Luke is faced with smaller platforms that require long jumps to traverse. He dodges and blasts swarms of Sand Flies, who instinctively attack and try to knock Luke into the abyss below."}, {"tag": "p", "text": "Deep inside the cave, it's primary inhabitants Sand People and Tusken Raiders recognize Luke as an intruder and attack without warning. In combat with Tusken Raiders, Luke avoids their swinging gaffi sticks and counterattacks when he is out of melee range. The Sand People carry out their attack with powerful energy blasts released from their body. Luke's reward for his trouble is recovering a Millennium Falcon shield before he escapes the cave."}, {"tag": "h2", "text": "Plot and gameplay"}, {"tag": "p", "text": "The plot of the game is mostly based on the story of Star Wars: Episode IV A New Hope, with changes to suit a video game. Characters have to fight their way from scene to scene. Luke Skywalker must rescue R2-D2 from a Jawa sandcrawler, which he ends up in after leaving to find Obi-Wan Kenobi. He also travels through a series of caves on Tatooine filled with dangerous creatures. It also does not show Obi-Wan being killed by Vader, although the guide in Nintendo Power does nonetheless reference Obi-Wan's death at the hands of Vader."}, {"tag": "p", "text": "For the most part, the game is a typical side-scrolling platformer. Luke uses the lightsaber as his primary attack, and he can also use the Force to execute special maneuvers like floating, speeding, and stopping time, among others. When the characters are rescued, they will help Luke by providing hints and other actions that are important to progress through the game. Between planets, the game switches to a first-person shooter perspective as the Millennium Falcon is forced to fight a wave of TIE fighters that prevent the player's entrance to the next planet. The final level involves using the X-wing against the Death Star. The X-wing travels through a long corridor; at the end, proton torpedoes will be shot automatically in order to destroy the station. If the player fails to get to the end before time runs out, the Death Star will destroy Yavin 4, and the game will be over."}, {"tag": "p", "text": "Each character has different attributes. Obi-Wan Kenobi can resurrect Han Solo or Princess Leia five times. R2-D2 can display a map of Death Star hallways."}, {"tag": "p", "text": "The game is particularly difficult, since it gives only three lives and two continues. The Millennium Falcon can sustain three hits before being destroyed, although collecting Millennium Falcon shield items beforehand can expand its life gauge to allow for nine hits."}, {"tag": "h3", "text": "Levels"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}