{"url": "Star_Wars_(1998)_38", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Republic"], "nodes": [{"tag": "h1", "text": "Star Wars (1998) 38"}, {"tag": "p", "text": "Star Wars 38 is the thirty-eighth issue of the Legends comic book series Star Wars. It was written by John Ostrander, illustrated by Davidé Fabbri and Christian Dalla Vecchia, and first published by Dark Horse Comics on January 23, 2002. It features the story \"The Stark Hyperspace War Part Three of Four,\" in which the story of the titular war continues, and Padawans Obi-Wan Kenobi and Quinlan Vos endure dangers on Troiken."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Stark Hyperspace War gets more intense. To prevent the Republic Senate from surrendering, the Jedi must get Senator Valorum back to Coruscant. The assaults grow heavier on the remnants of the Republic forces on Troiken and the fragile defense falls increasingly to Plo Koon. Can Qui-Gon Jinn find the secret of the virus that has corrupted the Republic nav computers and open up the hyperspace lanes to the Republic again? Meanwhile, Tholme and his apprentice, Quinlan Vos, struggle to get what they've learned back to the other Jedi."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The issue's front matter states: \"The events in this series take place 30 years prior to Star Wars: A New Hope,\" which corresponds to 30 BBY."}, {"tag": "p", "text": "In this issue, the Aayla Secura acknowledges the retroactive cameo made by Quinlan Vos in the 1999 film Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}